{
  "article_id": "001d269788a5",
  "url": "https://www.90min.com/granit-xhaka-premier-league-title-message-arsenal",
  "title": "Granit Xhaka sends Premier League title message to Arsenal",
  "date": "20240420T134500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Granit Xhaka sends Premier League title message to Arsenal\n- Swiss international believes former club Arsenal can still win Premier League\n- Xhaka admits he's been keeping a keen eye on Arsenal's matches\n- The 31-year-old recently won the Bundesliga with Bayer Leverkusen\nFormer Arsenal midfielder Granit Xhaka remains optimistic about the club's chances of winning the Premier League for the first time in 20 years, despite last weekend's disappointing defeat to Aston Villa.\nThe Gunners were surprisingly beaten 2-0 at the Emirates Stadium on Sunday and crashed out of the Champions League three days later after losing 3-2 on aggregate to Bundesliga giants Bayern Munich.\nArsenal's defeat to Villa was all the more frustrating as Liverpool also slipped up against Crystal Palace, with the dropped points for both handing Manchester City the advantage in a hotly-contested Premier League title race.\nMikel Arteta's side can get back on track with a win over Wolves at Molineux, and Xhaka, who departed the club last summer to join newly crowned Bundesliga champions Bayer Leverkusen, is confident that Arsenal's race is not yet run.\n\"There are six games left in the Premier League and there is still a big chance [for Arsenal] to get the Premier League title,\" Xhaka said (via the Mirror). \"I wish them all the best for sure because I am still in contact with the staff and players and also still watching the games.\n\"Can Arsenal win the title? I hope so because the team, the staff and the football club as well deserve to win trophies. They are very close this year as well like it was last year but football is about small details. I hope they can do it.\"\nAs for Xhaka, the 31-year-old has the chance to win an unprecedented treble with Bayer Leverkusen, who have already wrapped up a first-ever Bundesliga title with five games to go.\nXabi Alonso's charges are remarkably still unbeaten in all competitions - a run they extended to 44 games with a late equaliser against West Ham United on Thursday - and are into the semi-finals of the Europa League. They are also heavy favourites to win the DFB Pokal - Germany's equivalent of the FA Cup - as they will take on 2. Bundesliga outfit FC Kaiserlautern in the final.\n\"To win something after the first year here is always extra special,\" Xhaka remarked of his and Leverkusen's achievements. \"But we are still in other competitions, we are still in the DFB Pokal final and the Europa League semi-finals. We know that to win the Europa League you need to be ambitious. We won the league last Sunday but we still have the hunger to achieve something else.\n\"I had very good times in Arsenal for seven years, we were very close to winning the Premier League last year and it was not good enough but I knew the philosophy behind this football club and that's why I moved here.\"",
  "word_count": 492,
  "scraped_at": "2026-02-14T01:56:51.549530",
  "_text_extracted": true
}