{
  "article_id": "004b9cf6096a",
  "url": "https://www.ok.co.uk/lifestyle/meet-lionesses-england-squad-cup-30493396",
  "title": "Meet the Lionesses : Say hello to England women football team as they begin World Cup",
  "date": "20230722T094500Z",
  "domain": "ok.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Meet the Lionesses: Say hello to England's women's football team as they begin World Cup\nEngland's Lionesses will be hoping for another triumph at this year's Women's World Cup - which will start on 20 July at Eden Park Stadium in Auckland, New Zealand\n- Follow OK! on Threads here: https://www.threads.net/@ok_mag\nAfter England’s Lionesses stormed to victory at the 2022 Euros last year, eager fans are excited to see how they’ll do at this year’s Football World Cup.\nThe 2023 Women’s Football World Cup is being hosted by Australia and New Zealand and, with interest in the women’s game growing and growing, is set to be the largest in history as 36 teams will be vying for glory.\nDespite the tough competition, the Lionesses look like they stand a pretty good chance and the current odds that they bring it home for England are slated at 5/1.\nBut who are the women of the team? Here’s a full list…\nGoalkeepers\nMary Earps\nMary, 30, plays for Manchester United and is widely regarded as one of the best in the business.\nShe won FIFA’s award for Goalkeeper of the Year in February, after she became the first female to reach a clean sheet (which means not a single goal got past her) in 50 games.\nHannah Hampton\nHannah Hampton, who plays for Chelsea, was missing in action during last year’s Euros, as she went unused throughout the tournament.\nAged just 22, she’s significantly less experienced than Mary, but is regarded as one of the most technically gifted goalies of the new generation.\nEllie Roebuck\nEllie Roebuck, 23, is expected to be second on the pitch should first choice Mary Earps be unable to play.\nEllie plays for Manchester City, where she’s their number one keeper.\nDefenders\nMillie Bright\n29 year old Millie Bright has been enlisted to captain the England team this summer in the absence of the injured Leah Williamson.\nShe plays for Chelsea and is pretty experienced competing on a world stage - this will be her fourth international competition.\nLucy Bronze\n31 year old Barcelona player Lucy Bronze is among the most decorated of the squad.\nShe’s won the Women’s Champion League four times - most recently just last year, in 2022 - and has even won it for two different teams.\nJess Carter\n25 year old Chelsea star Jess Carter was a little used player during last year’s Euros triumph and played for just 16 minutes in total.\nHowever, she’s featured in all of England’s international games from February this year, so is likely to be much more prominent this summer.\nNiamh Charles\nAnother Chelsea women’s team player, 24 year old Niamh Charles just missed out on a spot on the England squad last year, so is a brand new addition.\nShe was also sidelined at the Tokyo Olympics so this is her first major international tournament - fans will be closely watching this promising player.\nAlex Greenwood\n29 year old Manchester City player Alex Greenwood was a substitute at the Euros last year.\nHowever, with Leah Williamson out of action, it looks like she’ll be among the starting line up this time around.\nEsme Morgan\n22 year old Esme is new to the International stage, and wasn’t selected for the Euros squad 2022.\nHowever, analysts say that, despite her age, this Manchester City player shows a lot of promise and is definitely one to watch.\nLottie Wuben-Moy\nLottie is another unused substitute from last year’s Euros that will be hoping for some play time in the Women’s World Cup.\nShe’s a 24 year old Arsenal player, who is perhaps as well known to the general public for her activism as her football, after she penned an open letter last year to all of the Prime Ministerial candidates calling for girls to have equal access to football.\nMidfielders\nLaura Coombs\nAt 32, Laura is the oldest of the World Cup squad, but that won’t hold her back.\nShe’s had a long career in football, but hadn’t been selected for the squad since way back in 2015 - so it’s safe to say she’s in her comeback season.\nJordan Nobbs\n30 year old Jordan will be hoping for a little more luck than usual this summer, after injuries ruled her out of last year’s Euros and the 2019 World Cup.\nShe’s a brand new addition to Aston Villa, after quitting Arsenal after 13 years a couple months ago.\nGeorgia Stanway\nYou couldn’t miss 24 year old Georgia Stanway at last year’s Euros, and she’s likely to be the team’s primary penalty taker once again this year.\nDespite being a midfielder, the Bayhern Munich player is likely to find herself scoring at least a couple goals for the team.\nElla Toone\nElla Toone has moved up in the world, from a substitute last year to almost certainly starting for England this time around.\nAt last year's Euros, she was of the team's so called \"super subs\" that shot the Lionesses to victory.\nKeira Walsh\nKeira Walsh was among Barcelona’s victorious Women’s Champions League final team last year - proving that the team was right to stump up £400,000 for the player.\nThe 26 year old is predicted to be one of the most valuable players this summer.\nKatie Zelem\n27 year old Katie Zelem is the captain of the Manchester United women’s team, which has just enjoyed one of the best runs ever.\nShe was a surprise absence from this year’s international features against Brazil and Australia, but it looks like she’s back on the cards for the World Cup.\nForwards\nRachel Daly\nRachel Daly is no doubt one of Aston Villa’s most valuable players, and was awarded the Golden Boot gong after scoring 22 goals in 22 games earlier this year.\nShe was pretty visible during last year’s Euros, when she became famed for her love of Celine Dion.\nBethany England\nBethany England, 29, switched from Chelsea in January of this year to Tottenham in the hopes of securing a spot on the World Cup spot.\nIt evidently worked, but it’s not clear if she’ll get play time, after being left on the bench for the Euros.\nLauren Hemp\nLauren Hemp is only 22 years old, but has been one of the most used players on the squad since new manager Wiegman took over in 2021.\nLauren, who plays for Manchester City when she’s not in an England shirt, is likely to play a starring role this summer as well.\nLauren James\n21 year old Lauren James is another relative youngster who’s made quite a splash on the world stage.\nShe’s proven herself to be of huge value to her team, Chelsea - and it runs in the family, as her brother Reece plays for the men’s side.\nChloe Kelly\nManchester City player Chloe Kelly was one of the most memorable stars of last year’s Euro as she scored the winning goal against Germany.\nFans of the Lionesses will be hoping she can recreate her triumph for them once again.\nKatie Robinson\n20 year old Katie is among the younger women heading off to represent England, but she’s impressed since making her debut in November 2022.\nThe Brighton and Hove player was no sure thing when it came to a World Cup spot, so she’ll have to prove bringing her along was the right call.\nAlessia Russo\nAlessia Russo, who is currently an unattached player, was one of the Euro’s team “super subs” last year.\nShe garnered a lot of attention for a staggering goal in the semi-final against Sweden.",
  "word_count": 1262,
  "scraped_at": "2026-02-14T02:07:08.862214",
  "_text_extracted": true
}