{
  "article_id": "0076b0441585",
  "url": "https://www.67hailhail.com/news/celtic-star-kyogo-furuhashi-explains-why-latest-japan-goal-was-extra-special/",
  "title": "Celtic star Kyogo Furuhashi explains why latest Japan goal was extra special",
  "date": "20231018T080000Z",
  "domain": "67hailhail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Celtic star Kyogo Furuhashi was back amongst the goals for Japan on Tuesday.\nHajime Moriyasu’s side are one of the form teams in international football right now. Their latest victory — a 2-0 friendly success over Tunisia — was their sixth in a row. In that time they’ve netted a whopping 24 goals and conceded just 5.\nThe likes of Germany and Canada have been battered in that run, with Furuhashi, Reo Hatate and Daizen Maeda all playing their part.\nOn Tuesday, the forward netted the team’s opening goal just before half-time. It was exactly the kind of strike we’ve come to expect from the 28-year-old during his time in Scotland.\nIt was an extra special one for him too because it arrived at Noevir Stadium — the home of his former side Vissel Kobe.\n“First of all, we won as a team and kept a clean sheet,” he told local outlet Soccer King.\n“I’m glad that I was able to score a goal in this stadium with memories. I was pleased to score at Noevir Stadium Kobe.\n“I started to move thinking that it would be good if (the pass) would come out in the flow but it came to a good place by chance. I was able to trap it more calmly than I thought. While looking at the keeper, I was able to put it in a position where I can kick either way.”\nAs always, the translation from Japanese is a little ropey. However, if you watch Kyogo’s goal then you’ll realise what he’s talking about.\nThe ball actually came to him after deflecting off a Tunisia player and he cooly controlled it with one touch then slotted it past the goalkeeper with his next.\nIt was the kind of calmness in front of goal that we may need amid the frenzy of UEFA Champions League football. Kyogo now has a couple of goals for Japan in recent months and that strike against Lazio a few weeks ago.\nHe will be returning back to Celtic in a terrific frame of mind. We can’t wait to see what’s next for him.\nIn other news, this weekend’s unusual Celtic kick-off explained as complex Sky Sports issue arises",
  "word_count": 369,
  "scraped_at": "2026-02-14T01:51:09.235282",
  "_text_extracted": true
}