{
  "article_id": "0078211f18d5",
  "url": "https://www.themag.co.uk/2026/02/make-no-mistake-we-will-turn-this-around-kieran-trippier-newcastle-united/",
  "title": "  Make no mistake , we will turn this around … Kieran Trippier",
  "date": "20260208T134500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘Make no mistake, we will turn this around…’ Kieran Trippier\nKieran Trippier has been talking after Newcastle United lost at home to Brentford.\nA match where United took the lead but then the visitors came back to lead 2-1.\nOnly for Bruno Guimaraes to both win and score a penalty to bring the scoreline level again.\nHowever, the closing stages seeing Brentford grab a late winner.\nKieran Trippier reacting after a third defeat in a row for Newcastle United: “Make no mistake, we will turn this around. We’re just going through a difficult patch. I’m not using any excuses for the amount of games because us players, supporters and the club want to play Champions League football. We want to be playing in every competition so there’s no excuses from my side on that sense but it’s about resetting. We’ve not won in five but it’s all about character, stepping up and being accounted for, myself included. We will be back winning games and it’s another tough test at Tottenham but all we can do is recharge, keep listening to the manager and go again because it’s a relentless schedule but that’s what we want.”\nThe frustrating thing was that after a nervy start to the match, with few chances for either team, Sven Botman then put Newcastle United ahead. Only for then Brentford to have the lead by the break.\nKieran Trippier on how the game developed: “We start the game well and go one-nil up but, again, it’s about putting more pressure on the teams that we’ve been playing when we’ve got the lead. It’s disappointing to go in 2-1 down but we came back into the game. In the whole, it’s the way we’re conceding the goals. It’s not like us and hasn’t been since I’ve arrived at the club. Now, it’s a busy period so for myself as a senior player and other senior players in the dressing room is to calm things down because we’ve got another big game on Tuesday [against Tottenham].”\nAfter Bruno Guimaraes dragged United back level, that killer goal for Brentford to win the game.\nKieran Trippier on Brentford’s late winner: “It’s the way we concede the goal. I always look at myself after every game and I don’t even need to look at the third goal because I’m out of position. That’s where I stand up and take responsibility, which I’ve done throughout my whole career. I don’t hide. I don’t shy away from it. We’re frustrated especially at home because we’ve been a force and threat. Teams have always feared us but now we have to reset. We have to keep going. This is the reality playing every three days. Us players will take responsibility and apologise to the supporters but all I can say is stick by us like you always have and we go again against Tottenham.”\nThe matches are relentless.\nSeven games coming up in the space of a shade over three weeks.\nFour Premier League games, the FA Cup at Villa, plus a Champions League play-off two-legged tie, that could take United into the last 16.\nKieran Trippier telling official club media what needs to happen: “Maybe a little bit of confidence. When you don’t win, I’ve been in this position many times in my career when I’ve been a young player and the senior players have stood up. I’m in that boat now where we need to steady the ship. We need to keep listening to the gaffer. He sets our plan and it’s us players to take responsibility and execute that. The goals we’re conceding is down to us and nobody else.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 623,
  "scraped_at": "2026-02-14T01:53:15.565693",
  "_text_extracted": true
}