{
  "article_id": "00796b12805f",
  "url": "https://metro.co.uk/2025/12/01/chelsea-star-enzo-fernandez-names-five-contenders-win-premier-league-25041509/",
  "title": "Enzo Fernandez says four teams can deny Arsenal the Premier League title",
  "date": "20251201T191500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea midfielder Enzo Fernandez has named the five teams he views as ‘contenders’ to win the Premier League this season.\nArsenal, bidding to win their first league title since 2004, boast a five-point lead at the top of the table after losing just one of their first 13 games.\nThe Gunners could be even further clear of their rivals but failed to beat ten-man Chelsea at the weekend, being forced to settle with a point after Mikel Merino cancelled out Trevoh Chalobah’s opener at Stamford Bridge.\nChelsea were second going into the London derby but slipped to third after Manchester City scored an injury-time winner in a dramatic 3-2 win over Leeds United.\nAston Villa are level on points with third-placed Chelsea, while Brighton and newly-promoted Sunderland are in European places ahead of Manchester United and defending champions Liverpool.\nLiverpool are making a hash of their title defence – losing almost half of their league games to slip nine points behind early pacesetters Arsenal.\nBut Fernandez still views Liverpool as ‘contenders’ to win the Premier League – along with Chelsea, Arsenal, Man City and Man United.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Of course we are [title contenders],’ the £115m Chelsea star told GiveMeSport.\n‘This season, there are many contenders: Liverpool, Manchester City, Manchester United. All the teams are battling towards the top. There are some very strong Premier League sides.\n‘Arsenal have also been doing really well for many years. And Liverpool are a great side. I’m not going to choose one because they’re all good.’\nFernandez is hopeful that Chelsea will not only challenge for the Premier League but enjoy a productive run in the Champions League.\nThe Argentina international added: ‘We know the Champions League is very tough.\n‘We’ll try to reach the final, which is what we deserve as a club. We’ve been doing well, so we’re capable of being right up there.’\nChelsea’s sensational spending appeared to be hindering the team in the early era of Todd Boehly’s tenure but the Blues have turned a corner over the past 12 months.\nAn inevitable Conference League win was followed up by an impressive triumph at the Club World Cup over the summer.\n‘When I arrived, there were so many players coming and going,’ Fernandez said on Chelsea’s progress.\n‘It was a hard period with so many players in the dressing room. We almost didn’t all fit! I think there were 30 of us or even over 30 players. It was crazy…\n‘And there were many manager changes before, in the end, Chelsea went for Enzo Maresca. That’s when the club started to build more solid foundations as a group.\nPremier League title odds\nArsenal 2/5\nManchester City 11/4\nChelsea 16/1\nLiverpool 18/1\nManchester United 80/1\nAston Villa 125/1\n(Odds courtesy of Betfair)\n‘We developed our footballing identity, which has been great for the squad. Now you can see how settled we are and what a talented squad we have.\n‘We are a really good side and we all get on well on and off the pitch. For the last 18 months to two years, we’ve had such positive feelings here.’\nWhile Arsenal, Chelsea and Man City’s title credentials are fairly clear, it is trickier to make a case for Liverpool and Manchester United.\nMore Trending\nReigning champions Liverpool were favourites to win the title again following a stunning summer spending spree but Arne Slot’s side have struggled badly.\nLiverpool had lost nine of their last 12 games – the club’s worst run since 1953 – before a much-needed win over West Ham on Sunday.\nManchester United also clinched three points that day, coming from behind to beat Crystal Palace, but the Red Devils have still dropped points in more than half of their league games this season.\nRuben Amorim’s side do look vastly improved but that is not a huge achievement given United finished just 15th last year.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd ‘baffled’ by brutal decision from England head coach Thomas Tuchel\nMORE: Atletico Madrid set price for Manchester United to sign Conor Gallagher in January transfer window\nMORE: Three clubs who could sign ‘fantastic’ Chelsea star despite warning from fans",
  "word_count": 763,
  "scraped_at": "2026-02-14T02:03:26.519357",
  "_text_extracted": true
}