{
  "article_id": "009dfe26011d",
  "url": "https://metro.co.uk/2024/08/14/pep-lijnders-raids-former-club-liverpool-highly-rated-teenage-prospect-21424872/",
  "title": "Pep Lijnders raids former club Liverpool for highly - rated teenage prospect",
  "date": "20240814T220000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Liverpool assistant manager Pep Lijnders has plundered his former club and agreed to sign teenage prospect Bobby Clark for Red Bull Salzburg.\nThe Dutch coach left Anfield at the end of last season after a spell as Jurgen Klopp’s assistant and took over the top job at the Austrian side.\nHe has been quick to return to the Reds to make a signing, bringing Clark to Austria on a permanent deal.\nThe BBC report that a £10m deal has been agreed with Liverpool having a 17.5 per cent sell on fee as and when the teenager leaves RB Salzburg.\nClark, who is the son of former Newcastle player Lee, has already made 14 appearances in the Liverpool first team under Klopp.\nMore Trending\nThe England Under-20 international played six times in the Premier League and scored his only goal for the Reds in a Europa League win over Sparta Prague.\nWhile clearly the Austrian Bundesliga is a significant step down from the Premier League, RB Salzburg are in the Champions League this season so the young Englishman will be involved in the top tier of European football.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nLijnders’ side edged past Twente in a dramatic qualifying round, winning 2-1 at home before a 3-3 draw in Netherlands on Tuesday night.\nNext up is a two-legged play-off with Dynamo Kiev, which Clark will hope to be involved in.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Rio Ferdinand predicts Premier League title winner and top four\nMORE: PSG make decision on signing Jadon Sancho amid Manchester United’s pursuit of Manuel Ugarte\nMORE: Manchester United hero names player who could win Arsenal the Premier League title",
  "word_count": 343,
  "scraped_at": "2026-02-14T01:51:48.876864",
  "_text_extracted": true
}