{
  "article_id": "00a4f329ba5c",
  "url": "https://www.nytimes.com/athletic/6884287/2025/12/13/what-happens-when-a-star-player-goes-to-war-with-their-club/",
  "title": "What happens when a star player goes to war with their club ? ",
  "date": "20251213T070000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Mohamed Salah accused Liverpool of “throwing him under the bus” last weekend, he became part of a long tradition of high-profile Premier League players going public about their dissatisfaction. Whether it is getting dropped, wanting a transfer or just not liking the manager, star footballers are rarely shy about making their feelings very publicly known. How did clubs handle these renegades in the past? And is there a way back for him once that line has been crossed?\nAdvertisement\nThe Athletic looks at some famous examples of what happens when a player goes to war with his club… and how it panned out.\nAlexander Isak at Newcastle United (2025)\nWhat was the issue?\nThe short version: Isak wanted to leave Newcastle United, but the club had no intention of selling him. The Sweden international striker believed he had been given a ‘soft promise’ of an improved and extended contract by the club’s decision-makers in early 2024, but the hierarchy’s make-up changed that summer, after Newcastle narrowly avoided a points deduction for almost breaching the Premier League’s profitability and sustainability rules (PSR).\nUnder Paul Mitchell, the sporting director at the time, it was decided that Newcastle could not afford to increase the salary of someone who was already one of their highest earners when he had four years left on his deal and they were struggling to comply with PSR.\nIt later emerged that Isak felt hurt by how the negotiations were broken off, and he made clear his desire to leave once Liverpool showed an interest in signing him.\nHow was it handled?\nNewcastle head coach Eddie Howe described Isak’s actions as going on “strike” once the centre-forward had left, with the 26-year-old refusing to travel to east Asia on the club’s pre-season tour, train or play once the season commenced.\nIsak was separated from the main group by Howe, who initially met with the player in an effort to coax him back around. The board repeatedly told Isak that he was not going to be allowed to leave, but he was steadfast in his desire to go and did not relent.\nHow was it resolved?\nIt wasn’t — at least not in a way Newcastle would have wanted. Eventually, after Isak told a delegation of board members that he had no intention of playing for the club again during the final week of the window, he finally got his way and secured a British-record £125million ($143m) move to Liverpool.\nAdvertisement\nNewcastle, Liverpool, Sweden and Isak himself have suffered from negative knock-on effects from that protracted transfer saga though.\nChris Waugh\nCristiano Ronaldo at Manchester United (2022)\nWhat was the issue?\nJust a year on from his surprise return for a second spell at Old Trafford (after 12 years away — nine with Real Madrid, three at Juventus) and despite finishing United’s difficult 2021-22 campaign as their top scorer, Ronaldo found himself on the periphery following Erik ten Hag’s appointment as manager. The five-time Ballon d’Or winner had informed United that summer that he wished to leave again to play Champions League football, but failed to secure a move during that window, then started just four of the season’s first 14 Premier League games under Ten Hag.\nAfter refusing to come on as a late substitute during the closing stages of a 2-0 win against Tottenham Hotspur in October, the then 37-year-old was dropped from the matchday squad entirely and trained alone for a week at United’s Carrington base.\nRonaldo was reintegrated, but not for long. Shortly after a 2-1 win at Fulham, just as Premier League clubs prepared to break for the mid-season 2022 World Cup in Qatar, journalist Piers Morgan released an interview with him. The Portugal international — who had missed that trip to Craven Cottage, citing illness — claimed he was being forced out of Old Trafford and mercilessly criticised almost every aspect of the modern-day United.\nRonaldo claimed he had no respect for Ten Hag, said he felt “betrayed” by members of the club’s hierarchy, and even bemoaned the standard of the training ground’s hot tub.\nHow was it handled?\nUnited were not aware of the interview until shortly before Morgan teased Ronaldo’s bombshells within it on social media.\nLater that week, United announced they had “initiated appropriate steps”, which The Athletic revealed involved starting a legal process against Ronaldo for breach of contract.\nAdvertisement\nHow was it resolved?\nOn November 22, United announced they had reached a mutual agreement with Ronaldo to terminate his contract with immediate effect. Ronaldo did not receive a payoff. He played the remainder of the World Cup as a free agent until Portugal’s elimination in the December quarter-finals, then joined Al Nassr of the Saudi Pro League.\nMark Critchley\nPierre-Emerick Aubameyang at Arsenal (2021)\nWhat was the issue?\nArsenal deemed the centre-forward had too many disciplinary breaches. In March 2021, Aubameyang was left out of the matchday squad for arriving late before the north London derby against Spurs. In the December of that year, he was granted permission to visit his ill mother in France, but was expected to return to London the same day and report for training on the following one. He instead came back to England the day he was meant to train, and Arsenal also took issue with his failure to follow Covid-19 testing protocols in place at that time.\nHow was it handled?\nArsenal’s manager Mikel Arteta did not mention any issues with Aubameyang in his pre-match press conference that Friday but shortly before the game, against Southampton, said the forward would be absent due to a disciplinary breach.\nAubameyang, Arsenal’s captain at the time, was stripped of the armband three days later. A statement from Arsenal said: “Following his latest disciplinary breach last week, Pierre-Emerick Aubameyang will no longer be our club captain, and will not be considered for selection for Wednesday’s match against West Ham United.\n“We expect all our players, particularly our captain, to work to the rules and standards we have all set and agreed. We are fully focused on tomorrow’s match.”\nHow was it resolved?\nAubameyang did not play for Arsenal again. He was made to train on his own, but was called up to Gabon’s squad for the Africa Cup of Nations in January and February 2022. He tested positive for Covid-19 the day before their first game of the tournament and missed further matches due to heart lesions.\nAdvertisement\nOn deadline day of the winter transfer window in early February, he travelled to Barcelona. He later told The Athletic: “I wanted to push it, I just wanted to go.” Arsenal were only made aware of his journey to Spain by seeing clips on social media, as captured on Amazon’s All Or Nothing documentary. He then left Arsenal by mutual consent to complete his move to Barcelona before the deadline, similar to how Mesut Ozil left for Fenerbahce of Turkey a year earlier.\nArt de Roche\nDiego Costa at Chelsea (2017)\nWhat was the issue?\nThe seeds for a bitter divorce were sown in January 2017 when Chinese Super League club Tianjin Quanjian made a bid to sign striker Costa and offered a large salary. Before a game against Leicester City, the player argued with fitness coach Julio Tous. Head coach Antonio Conte was not happy about what had taken place and the Brazil-born Spain international was subsequently left out of the match. Their personal relationship never recovered.\nWhile Costa did see out the season to help Chelsea win the Premier League, Conte would later claim that it was at this point that an agreement was reached between the player, his agent Jorge Mendes and the club that he would be sold in the summer.\nThis version of events was disputed by Costa, who told reporters while on international duty in the June that his exit was instigated by Conte after he had messaged him to say he was not part of his plans. Costa said, “My relationship with the coach has been bad this season. It is a shame, I have already forwarded the message to Chelsea people to decide.”\nCosta refused to return to England to join pre-season training and was determined to secure a move back to Atletico Madrid, his previous club.\nHow was it handled?\nCosta remained in Brazil and was fined two weeks’ wages by Chelsea for not training with them. The club still expected him to fulfil the terms of his contract even though it was obvious there was no way back for him in the squad. Speaking to the UK’s Daily Mail newspaper in Brazil, Costa complained he was being treated “like a criminal”.\nAdvertisement\nNegotiations with Atletico began, but other clubs, including Milan, were also keen. Chelsea started shopping for a replacement and, after missing out on Everton’s Romelu Lukaku to Manchester United, bought Alvaro Morata from Real Madrid.\nHow was it resolved?\nChelsea and Atletico Madrid agreed a transfer worth in excess of £50million in September 2017, on the eve of playing each other in the Champions League’s group stage. The deal was struck after the summer window had closed, but Costa could not join Atletico until the January anyway because FIFA, world football’s governing body, had banned them from registering new signings for two windows in June 2016 after breaching transfer rules involving youth players.\nCosta did not play for Chelsea again before moving back to Spain. The whole affair had consequences for Conte’s future. The leaked text message angered the Chelsea hierarchy, because they felt it hurt their chances of getting a bigger fee for Costa. It was one of the factors for Conte’s sacking at the end of the 2017-18 season.\nSimon Johnson\nCarlos Tevez at Manchester City (2011)\nWhat was the issue?\nStriker Tevez, then City’s captain, asked for a transfer during the 2010-11 season, claiming his relationship with “certain executives” at the club was “broken down and beyond repair”. The Argentina international lost his first-team place early the following season and was accused by City manager Roberto Mancini of refusing to go on as a substitute during a Champions League match against Bayern Munich. Mancini said Tevez was “finished” at the club.\nHow was it handled?\nCity fined Tevez two weeks’ wages and suspended him for the same period. He was also stripped of the captaincy. When he returned to training two weeks later, he was exiled from the first-team squad.\nHe insisted he had merely refused to continue warming up during that Bayern game — rather than refusing to go on — but at a disciplinary hearing the club found him guilty of five breaches of contract and issued a further fine.\nAdvertisement\nTevez flew home to Argentina, where he remained for three months, claiming he had been treated “like a dog”.\nHow was it resolved?\nAfter the January transfer window closed without an exit route materialising (and with City’s Premier League title challenge faltering slightly), both sides recognised the stand-off was helping nobody. A cautious rapprochement followed.\nTevez returned to the UK in mid-February, four and a half months after the Munich incident, and issued a statement apologising “sincerely and unreservedly to everybody I have let down”. Mancini and the club accepted the apology.\nHe was kept waiting for another month before returning to action, but made a significant impact from the bench to help secure victory over Chelsea in his comeback match. Tevez then returned to the starting line-up and made some important contributions — acclaimed by the supporters — as City won their final six games of the season to secure the title. He stayed for another season before joining Juventus in summer 2013.\nOliver Kay",
  "word_count": 1947,
  "scraped_at": "2026-02-14T01:49:57.605985",
  "_text_extracted": true
}