{
  "article_id": "00c76438e418",
  "url": "https://www.meathchronicle.ie/2023/08/24/aymeric-laporte-completes-move-from-manchester-city-to-saudi-side-al-nassr/",
  "title": "Aymeric Laporte completes move from Manchester City to Saudi side Al - Nassr",
  "date": "20230824T184500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aymeric Laporte completes move from Manchester City to Saudi side Al-Nassr\nBy Andy Hampson, PA\nAymeric Laporte has completed his move from Manchester City to Saudi Arabian side Al-Nassr, the Premier League champions have announced.\nThe Saudi Pro League outfit are understood to have paid a fee of £23.5million for the 29-year-old Spain defender, who has spent the past five-and-a-half years at the Etihad Stadium.\nLaporte follows former City team-mate Riyad Mahrez to the Middle East country after the Algerian joined Al-Ahli earlier in the summer transfer window.\nLaporte told City’s website, www.mancity.com: “I am proud to have represented Manchester City over the last six seasons.\n“When I first joined, I was excited about the prospect of winning trophies. However, I could not have imagined the success we would go on to achieve together.\n“I would like to thank the coaches, my team-mates and of course the brilliant City fans for all of their support throughout my time in Manchester.\n“I will always be a City fan and I look forward to seeing you all again.”\nLaporte, who joined City from Athletic Bilbao in a £57million deal in January 2018, won five Premier League titles, the Champions League and five domestic cups as a member of Pep Guardiola’s squad.\nHowever, he had fallen down the pecking order at City over the past year and the recent arrival of Josko Gvardiol had pushed him further to the fringes.\nCity director of football Txiki Begiristain said: “Aymeric has been an excellent player for Manchester City during a great time for the club.\n“He fitted into the team seamlessly upon arrival in 2018 and played a key role in many of our successes over the years that have followed.\n“The form of the other defenders in the squad made it hard for him to find sufficient game time in 2022-23 and we respect his decision to seek a move elsewhere.\n“I look forward to following his career from afar.”\nLaporte joins an increasingly star-studded squad at Riyadh-based Al-Nassr, where his team-mates will include Cristiano Ronaldo, Sadio Mane and Marcelo Brozovic.",
  "word_count": 347,
  "scraped_at": "2026-02-14T01:56:26.905712",
  "_text_extracted": true
}