{
  "article_id": "00dbd76af4cd",
  "url": "https://www.fourfourtwo.com/features/ranked-30-best-strikers-premier-league-history",
  "title": "The best strikers in Premier League history",
  "date": "20231127T174500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best strikers in Premier League history\nFourFourTwo remembers the greatest centre-forwards of the Premier League era: goalkeepers beware...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWho's the best striker in Premier League history?\nIt's almost an impossible question – but that won't stop us asking it. Over three decades, some of the greatest goalscorers the world has ever seen have lit up our league, scoring thousands of goals between them.\nThere can only be one chosen as the greatest ever…\nErling Haaland\nToo soon? No chance. Manchester City's super Scandinavian is the first man to 50 Premier League goals in fewer than 50 appearances – at such a scoring rate, he would have Alan Shearer's record sewn up in just five and a half seasons.\nHe could never score again, however, and his legacy would already be in stone. The man who came to English shores, fired City to a Treble and smashed the record for most goals in a 38-game season without so much as breaking a sweat. He is a phenomenon alright.\nOle Gunnar Solskjaer\n“I got to Old Trafford and the tour guide thought I was going for a tour. He was talking away and then he asked me, ‘So what are you doing here?’”\nSolskjaer informed the tour guide that, actually, he had arrived from Norway to sign for Manchester United. Eleven years later he had earned his rightful place in club folklore – not just for the winner in the 1999 Champions League Final, but also for playing a key role in six Premier League crowns.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe ‘Baby-Faced Assassin’ became regarded as a super-sub: a third of his league appearances were off the bench, meaning he found the net once every 150 minutes. Four strikes as a sub at Nottingham Forest in 1999 was perhaps his greatest Premier League performance.\nJermain Defoe\nA consistent goalscorer, Defoe has hit double figures in eight different Premier League seasons, and is the only player to have netted five goals in one half, in Tottenham’s 9-1 demolition of Wigan in 2009.\nBack playing on the south coast with Bournemouth this season, having also represented Portsmouth, there remains debate about his overall contribution to team success – he’s suffered relegation at West Ham and Sunderland during his top-flight career.\nBut no one can doubt Defoe’s finishing ability: after making his Premier League bow for the Hammers at Middlesbrough 16 years ago, he’s now in seventh place in the all-time scoring list and holds the record for the most goals as a sub – 23 - including a screamer against Man City in 2013.\nJurgen Klinsmann\nTrue, more than 200 players have scored more Premier League goals, though few have made quite the same impact as the ex-Germany international.\nOne of the first major foreign signings of the Premier League era when he left Monaco for the Lilywhites in 1994, Klinsi was disliked in England after Italia 90.\nBut he turned opinion around when asking, “Are there any diving schools in London?” at his unveiling, before marking a debut header in a 4-3 win at Sheffield Wednesday by collapsing on the Owls’ turf in celebration.\nHe netted 21 goals and was crowned Football Writers’ Player of the Year but departed after just the one campaign. Chairman Alan Sugar swiftly declared he wouldn’t wash his car with Klinsmann's shirt, yet the German returned on loan three seasons later, helping Tottenham avoid relegation.\nLes Ferdinand\n“People don’t think Les Ferdinand, former England international, but Les Ferdinand, bloke who wrecked the Blue Peter garden.”\nHe didn’t – despite rumours that began when he made an ill-judged joke about the 1983 incident – and no one can boast a higher Premier League goal tally without converting a single penalty.\nSir Les didn’t need any spot-kicks: he bagged 101 goals in the first five seasons of the Premier League, joining Newcastle from QPR in 1995.\nKevin Keegan’s ill-fated title tilt proved the closest that Ferdinand came to winning the league, but he continued to find the net at Spurs, West Ham and Leicester – where he scored 12 times in the season of his 37th birthday – before a stint with Bolton... commuting to Lancashire in his helicopter, naturally.\nJimmy Floyd Hasselbaink\n“On the pitch he always looked annoyed with everyone,” his Chelsea team-mate Gianfranco Zola once said. But that was a rage which drove the Dutchman to goalscoring success.\nOnly three players have topped the Premier League scoring charts with more than one team – Robin van Persie, Alan Shearer and Hasselbaink.\nReal name Jerrel, the powerful striker scored 18 times with Leeds, sharing the Golden Boot award with Michael Owen and Dwight Yorke in 1998/99. Following a season with Atletico Madrid (where he scored 24 goals in 34 games, finishing as La Liga's second-highest scorer despite Atleti's relegation), he netted 23 times in 35 appearances for Chelsea in 2000/01, including four in a 6–1 rout against Coventry.\nWith his rocket of a right foot, Hasselbaink helped a resurgent Blues finish second in 2003/04 before moves to Middlesbrough, Charlton and Cardiff.\nRomelu Lukaku\nSince arriving in the Premier League, it’s felt like Lukaku has had a point to prove. In 2011, the Belgian frontman had a huge reputation, having scored 41 goals for Anderlecht aged only 18.\nDespite Chelsea paying £17m, he started just the one league game before being loaned out – to West Brom, then Everton – with the suggestion that he must prove himself as a top-flight forward. That he did, scoring 17 goals for the Baggies and 15 in his year at Goodison Park.\nYet Chelsea – and Jose Mourinho – weren’t convinced, and sold him to Everton. In an inconsistent team, Lukaku scored 53 goals in three campaigns, improving his finishing and link-up play all the while. Suddenly Chelsea were keen again, but he opted for Manchester United – and, ironically, Mourinho.\nLukaku still struggles to shrug off the doubters who have never been far away, but he continues to perform at a high level for his country – as he demonstrated during Belgium's run to the 2018 World Cup semi-finals.\nCarlos Tevez\nThe Argentine frontman’s controversial move to England looked like a disaster. He hadnt't found the net by March in his first season, with West Ham nine points shy of safety.\nBut then the real Carlitos turned up: seven goals to save the Hammers, followed by a transfer to Manchester United and back-to-back titles. Things were going well, but it wouldn’t be Tevez without more controversy – so he opted to join Manchester City, where he was greeted at Eastlands by the famous ‘Welcome to Manchester’ poster.\nForty-three goals in just two years followed before grumpy Tevez returned, falling out with manager Roberto Mancini and playing only a bit-part in the club’s 2011/12 title triumph. An absurdly talented frontman, but very high maintenance.\nDiego Costa\nRivalling Tevez in the high-maintenance stakes, it’s Costa: possibly the only player on this list to be dumped by text.\nThe Spain international hit the ground running in the Premier League after his 2014 move from Atletico Madrid, netting seven goals in his first four matches for Chelsea – a new record.\nWorld football’s oldest-looking 26-year-old registered 20 goals to spearhead the west Londoners’ run to the title, but an infamous banner labelled the Brazil-born frontman – plus Cesc Fabregas and Eden Hazard – a ‘rat’ after poor form in his second campaign contributed to Jose Mourinho’s sacking.\nThe controversial goal-getter hit back in 2016/17, though, scoring 20 once more as the Blues regained the title under Antonio Conte, author of: “Hi Diego – you are not in my plan.” Unsurprisingly, he left to rejoin Atleti in summer 2018 with the parting shot: \"I was wrong going to Chelsea.\"\nNicolas Anelka\n“People often say my time with Arsenal was my best period. But it wasn’t. I was a much better player for Bolton.”\nAnelka left the Premier League three times, but he just kept on coming back. A title winner at Highbury when he was 19, the following campaign brought 17 goals and an ill-fated switch to Real Madrid. But Le Sulk moved back to England with Liverpool (on loan) and Manchester City before departing again for Fenerbahce.\nSam Allardyce revived Anelka’s career at Bolton, and the French striker became the Premier League’s top scorer with 19 for Chelsea in 2008/09, winning another title a year later. He and Tevez are the only two players on this list to earn a winner’s medal with more than one team.\nAfter transferring to China, Anelka’s final Premier League stint came at West Brom, where he was sacked for gross misconduct after using the quenelle gesture celebrating one of his two goals for the Baggies.\nDimitar Berbatov\nDespite featuring in the 2002 Champions League Final for Bayer Leverkusen, Tottenham fans weren't exactly sure what they'd get when their club recruited the brooding Bulgarian in summer 2006. But it didn’t take Berba long to secure cult status, with his nonchalant-yet-clinical playing style making the Lilywhites one of England’s must-watch outfits (not to mention League Cup winners).\nManchester United soon wrestled him away from N17 for £30 million and, after a slow start, Berbatov once again came good – particularly during 2010/11 when he notched a personal best 20 goals in winning the title.\nHe'd lost another yard of pace by the time of his two-season spell with Fulham, but if anything that just made his effortless waltzing around the pitch seem even cooler. In an era where speed and physicality were considered near essential for any top-level striker, Berba’s slick sauntering provided a much-needed variation from routine in the Premier League.\nFernando Torres\nA deadline-day switch has rarely drawn so stark a line through a career. Before his move to Chelsea in 2011, Torres was a rapid, clinical, prolific marksman. After it, he was largely a bumbling, stumbling comic punchline of a striker. But in his three-and-a-half years with Liverpool he was a phenomenon.\nFrom his Anfield bow – when he glided through Chelsea’s defence to score his first goal for the club – he showed the physicality and technique to net at will. He did that 33 times in his first campaign (24 in the league) and 39 in 70 over the next two despite a succession of injuries to ankle, hamstring and knee.\nThat wear and tear was probably a big factor in his decline, although Blues fans will always cherish his 2012 Champions League semi-final clincher at the Camp Nou en route to Munich glory.\nGianfranco Zola\nNot every forward is all about the sheer weight of goals – and Chelsea’s Italian icon falls into that category.\nThe pint-sized Sardinian striker helped to transform not only the Blues but also English football, with his dazzling array of flicks and tricks fooling centre-backs and wowing supporters across the land.\n“At the beginning, the ‘open’ style of English football really helped me,” Zola explained to FFT back in 2007, “as I was coming from tighter marking in Serie A.”\nZola was crowned the Football Writers’ Player of the Year in 1997 following his first campaign at Stamford Bridge, and his seven years in London featured two FA Cups, the League Cup and the winner in a Cup Winners’ Cup final.\nThe greatest shame? He exited as Roman Abramovich arrived and missed out on lifting league titles with the Blues.\nDwight Yorke\nSometimes things just click. “When me and Yorkie started playing together, it was like meeting a special woman and falling in love,” Andy Cole told FFT back in 2010. “Everything felt right.”\nEyebrows had been raised when Alex Ferguson paid Aston Villa £12.6 million for Trinidad and Tobago forward Yorke – after all, the Scot already had Cole, Ole Gunnar Solskjaer and Teddy Sheringham at his disposal.\nFerguson rotated his frontmen during the early weeks of the 1998/99 season, but by October he'd stumbled across a blossoming double act. Yorke and Andy Cole started five games together during that month and netted nine goals between them as the Red Devils scored 19. There was now little doubt that they were top dogs as United swept aside all comers, clinching the Treble.\nAndy Cole\nThat Andy Cole is fourth on the all-time highest scorers in Premier League history without ever having scored a penalty in the competition is simply astounding.\nFerocious form at Bristol City got him his big move to Newcastle United, where he tore up the top flight – and then came Manchester United, a treble and a spot in history. But Cole wasn't finished, moving on from Old Trafford to become a cult hero in midtable sides, scoring hatfuls for Blackburn, Fulham and Man City. He simply knew where the goal was.\nRobbie Fowler\nFans love a local lad rattling in the goals, hence why Liverpool’s faithful nicknamed the Toxteth-born Fowler ‘God’. He scored his maiden hat-trick against Southampton on his fifth league appearance, and his second against Arsenal on his 30th (the latter coming in five first-half minutes).\nIn the age of Shearer, Klinsmann and Wright, Fowler was the most clinical of all Premier League strikers.\nBut then a knee ligament injury in 1996/97 stopped the goal-poacher in his tracks, with Michael Owen pinching his place in the Reds’ XI. Fowler eventually made his comeback but had lost the explosiveness that once made him so feared by Premier League defences.\nFowler will always be a case of what might have been. Spells with Leeds and Manchester City, and even an emotional return to Anfield in January 2006, failed to rekindle the old magic.\nMichael Owen\nOwen was just 18 and still in his first full season as a regular with Liverpool when he shared the Golden Boot in 1997/98. Not content with that, he repeated the feat a year later after becoming a hero for England at the World Cup thanks to that goal against Argentina.\nThe perfect script for a film? He wouldn’t know – Owen claims that he doesn’t watch them. The speedster would go on to seal the Ballon d’Or in 2001 and posted double figures in each of his seven full seasons in the Liverpool first team – although intriguingly, never struck 20 in a league campaign.\nMoves to Real Madrid and Newcastle didn’t work out as planned, and injury woes meant he was a bit-part player when he finally won a league title at Manchester United in 2011, before retiring at Stoke.\nJamie Vardy\nVardy has as strong a claim as anyone to be Leicester's greatest player of all time.\nHis winding journey from factory worker to the top tier of English football is well known by now, but the speedy striker's position on this list has nothing to do with novelty factor and everything to do with his achievements since the Foxes' promotion in 2014.\nVardy only scored five times in a debut Premier League campaign where he was frequently fielded out wide, but he exploded into life in 2015/16 – 24 goals helped fire Leicester to the unlikeliest title triumph in English football history. He's now passed 100 goals, and his propensity to deliver against the Premier League's biggest and best only burnishes his credentials.\nRobin van Persie\nAlex Ferguson’s final season in charge of Manchester United delivered the league crown, largely thanks to Van Persie’s move from rivals Arsenal.\nThe Dutchman hadn’t won the league in eight campaigns in north London – he joined the club a couple of days after the end of the Invincibles season in 2004 – and injuries occasionally prevented him from showing his full potential as he switched from wideman to striker.\nBut the left-footer reached his peak at the age of 28: winning the Golden Boot with 30 goals in his final season at the Emirates, before netting 26 times in his debut term at Old Trafford to help Fergie bid farewell with a 13th league title to his name.\nRobbie Keane\nMaybe the greatest celebration in Premier League history? Robbie Keane was absolutely prolific everywhere he went, starting off at Wolves, playing at Coventry, Leeds, Tottenham, Liverpool – even Inter Milan in a short stint – to become the most prolific Irishman that modern English football has ever seen.\nHe was a one-man whirlwind: strong, quick and devilishly accurate in a penalty area. He made football fun for a long, long time.\nTeddy Sheringham\n“Arsenal fans sang, ‘Oh, Teddy Teddy, he went to Man United and he won f**k all,’” Sheringham once told FFT. “We won the Treble and I wondered what they’d now chant. It was, ‘Oh, Teddy Teddy, he went to Man United and he’s still a c***!’”\nSheringham hadn’t won a major title prior to 1999, but helped the Red Devils to three league titles in four seasons at Old Trafford, earning him the Footballer of the Year honour at 34.\nTop scorer in the first Premier League campaign, he’d moved from Nottingham Forest to Spurs in 1992 and adapted into a clever second striker, contributing goals and 76 top-flight assists. Sheringham later played for Portsmouth and West Ham, becoming the oldest scorer in the Premier League at 40.\nHarry Kane\nThere’s little doubt in Harry Kane’s mind exactly when his rise to elite-level striker kicked in.\n“That match at Villa Park was definitely a turning point,” he told FFT in 2015, speaking of a 2-1 win the previous November. “Before that, I’d shown what I could do in Europa League and League Cup matches, but then coming on in the Premier League and scoring the winner in injury time was a real statement that I was ready.” From there, he hasn’t looked back – it was the first of 21 Premier League goals of that season, with 25 more following in 2015/16 and 29 in 2016/17.\nKane has improved his Premier League goal tally every season since breaking into Spurs' team, so it came as little surprise when he did it again last term and reached 30 in a league season for the first time. In doing so, he joined an exclusive club of players to achieve the feat over a 38-game season: featuring Mo Salah, Cristiano Ronaldo, Kevin Phillips, Thierry Henry, Robin van Persie and Luis Suarez.\nIan Wright\n“179, just done it,” read the t-shirt as Ian Wright celebrated. The excitement had got the better of him: actually, he’d just bagged his 178th goal for Arsenal, and wasn’t supposed to show off the undershirt unless he netted twice. As it turned out, No.179 followed five minutes later and Cliff Bastin’s club record was broken. Out came the t-shirt again.\nWright became a legend at Arsenal in the early Premier League years and his last act as a Gunner was to win the title, aged 34, before moving across London to West Ham. The striker’s spell with the Hammers was arguably most notable for the time he damaged the dressing room of referee Rob Harris after being sent off against Leeds, earning him a three-match ban.\nWrighty always had a temper, but there were few better finishers.\nRuud van Nistelrooy\nFew players enjoy their best years after a cruciate knee ligament injury, but Van Nistelrooy was one of them. “The injury gave me a mental strength that I didn’t have before,” he told FFT. The injury delayed the Dutch forward’s arrival at Manchester United from PSV.\nYet he was named PFA Players’ Player of the Year after his first campaign at Old Trafford and bagged the Premier League Golden Boot a year later, hitting 25 goals in the league as part of a whopping 44 in all competitions.\nHis goals-per-game ratio was mightily impressive but, surprisingly, the striker won only one league title in five seasons with the Red Devils. A breakdown in relations with manager Alex Ferguson and Cristiano Ronaldo led to his departure in 2006.\nDidier Drogba\nA £24m signing from Marseille in 2004, Drogba’s first few months in the Premier League were far from perfect – he was struggling for goals and being lambasted for his diving.\nBut the Ivory Coast international managed to turn things around and become a legend. The powerhouse in Jose Mourinho’s back-to-back title victories of 2004/05 and 2005/06, he won the Golden Boot a year later before repeating the feat with 29 goals in 2009/10 – finished off with a hat-trick against Wigan on the final day as the Blues won the league once more. After spells in China and Turkey, he returned to Chelsea to claim a fourth title in 2015, and is the only African to hit 100 Premier League goals.\nDrogba could make this list at No.8 for his Premier League exploits alone, but it's that match-winning display in the 2012 Champions League Final for which he'll always be worshipped in west London.\nLuis Suarez\nLuis Suarez £22.8m, Andy Carroll £35m. Those were the amounts Liverpool paid on January 31, 2011 – and the comparison seems absurd now.\nBut the Uruguayan arrived with baggage. Not only was he an international villain after his handball denied Ghana a goal at the 2010 World Cup, he’d also served a ban for biting an opponent during his time with Ajax. Suarez didn’t hit the goal trail straight away – in 2011/12, he found the net just 11 times, though he struck the woodwork on eight more occasions.\nThere was more controversy too: he was banned for racially abusing Patrice Evra (and later for another bite, on Chelsea’s Branislav Ivanovic). Then came the bizarre £40,000,001 bid from Arsenal after the goal-getter had netted a rather more impressive 23 in 2012/13. But there was no chance of Suarez leaving for north London and he reached top form a year later, scoring 31 times in 33 league matches as Liverpool nearly clinched the league crown under Brendan Rodgers.\nDennis Bergkamp\n“It’s like solving a puzzle – I always had a picture in my head of how everything would look two or three seconds later.”\nDennis Nicolaas Maria Bergkamp was one step ahead of the rest. Recruited by Bruce Rioch, he combined intelligence with elegance to produce 87 goals and 94 assists, linking up with Ian Wright to seal the league title for Arsenal in 1998, then Thierry Henry to win it in 2002 and in the Invincibles year of 2004.\nThe Dutchman was PFA Players’ Player of the Year when he struck 16 goals in 28 games in 1997/98. His incredible treble at Leicester was hailed by Martin O’Neill as “the best hat-trick I have ever seen”, and a bedazzling turn and finish against Newcastle in 2002 was named the best ever goal in the Premier League.\nWayne Rooney\n“Remember the name, Wayne Rooney,” commentator Clive Tyldesley bellowed. It’s a little-known fact that he did this with every young player back then, with Clive turning up at youth internationals shouting, “Remember the name, Stacy Long!” and, “You’ll be hearing a lot more about this kid, Sean Doherty!”\nHe was spot on about Rooney, though. That stunner for Everton against Arsenal in October 2002, aged 16, was the first of what would prove to be 208 Premier League goals, on the way to five titles with Manchester United and the PFA Players’ Player of the Year prize in 2010.\nHe weighed in with a whopping 103 assists as well, his tally only bettered by Ryan Giggs and Cesc Fabregas. Decent.\nSergio Aguero\nIf trying to tackle the Argentine is hard enough, stopping him from finding the net was impossible. Nobody can rival the Manchester City striker’s goals-per-minutes ratio.\nDennis Bergkamp may have scored the best goal of the Premier League era, as voted by supporters, but Aguero netted the most memorable. His late, late strike against QPR that sealed City the title in 2012 was one of English football’s most dramatic moments – and yet, incredibly, it took until 2017/18 for Aguero to make a PFA Team of the Year.\nEric Cantona\n“I didn’t punch the fan strong enough – I should have punched him harder.” By that point, Cantona had already kicked Crystal Palace fan Matthew Simmons in the face in any case, so he'd probably got the message.\nIf Cantona will be partly remembered for going all kung fu at Selhurst Park in 1995, no one at Manchester United will ever forget the way the French forward transformed a club that hadn’t secured a league title for 26 years into the force of the Premier League era.\nCollar up, chest out, Cantona commanded a pitch and bagged almost a goal every other game – superb stats for someone who was often deployed as a withdrawn striker. He also scored the first Premier League hat-trick, for Leeds in a 5-0 rout of Tottenham, in 1992.\nAlan Shearer\nHe scored 31 times in just 40 games in 1993/94, 34 in 42 matches in 1994/95, then 31 over 35 outings in 1995/96, taking home the Football Writers’ Player of the Year gong in ’94 and PFA Players’ Player of the Year honour in ’95 en route to the Premier League title.\nNo wonder Rovers owner Jack Walker wanted Shearer to stay at Blackburn so much that he was offered a player-manager position in 1996 aged only 25. Shearer politely declined, signing for Newcastle in a world-record £15 million deal and immediately becoming Premier League top scorer for a third consecutive year.\nBy his retirement in 2006, Shearer had netted 148 league goals for the Magpies, taking his tally to 260. Along the way he also set Premier League records for the most hat-tricks (11), the most trebles in a single campaign (five, in 1995/96) and the most goals in a game (five, against Sheffield Wednesday in 1999). The Premier League has never witnessed a goalscoring machine quite like him – although that celebration could still do with a bit of work...\nThierry Henry\nThierry Henry became a legend with a panache that made him both an Arsenal and Premier League icon. ‘Va va voom’ was not just about searing pace, it was about delivering the beautiful and the seemingly impossible. Take the solo goal he scored against Liverpool back in April 2004, slaloming past pretty much the entire Reds defence.\nNo other player has ever hit more than 20 goals in five consecutive campaigns. On four of those occasions he was Premier League top scorer, collecting the PFA’s Player of the Year prize in 2003 and 2004, and the Football Writers’ award in 2003, 2004 and 2006.\nThierry made a brief return to London in January 2012 on loan from New York Red Bulls, with the sole league strike of his second spell – a last-minute winner away at Sunderland – ultimately crucial in Arsenal’s quest to secure qualification for the Champions League. Even at 34, he was making a difference.",
  "word_count": 4590,
  "scraped_at": "2026-02-14T02:07:27.057766",
  "_text_extracted": true
}