{
  "article_id": "00edec99fc3b",
  "url": "https://theathletic.com/4588976/2023/06/08/jack-grealish-100m-wanted-more/",
  "title": "Everybody wanted more : How Jack Grealish lived up to his £100m Man City price tag",
  "date": "20230608T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There is a very clear memory of Jack Grealish at Manchester City’s trophy parade last summer: a drink in each hand, sunglasses covering a glazed expression and the controversial assessment that Riyad Mahrez had “played like Almiron”.\nNo doubt, he was enjoying himself. And why not? Not even a year on from his £100million transfer from Aston Villa, he had a Premier League title to show for his efforts.\nAdvertisement\nYet when he got back on the team bus after appearing on stage to lift the trophy with his team-mates, it was a different story.\nEmotional after a few drinks, he confided in City staff that he had not been good enough throughout the season. He vowed to improve but was concerned about how things had panned out since his move north.\nPep Guardiola had always supported Grealish publicly and privately he knew the value that the new arrival offered his side, but the winger did not start any of City’s Champions League knockout matches last season. When City needed to come back from 2-0 down against Villa, of all sides, to seal the title on the final day, Grealish did not get on the pitch at all. That was a big blow.\nFast forward a year and he has been a key man in what is a new-look City side, a permanent fixture on the left of Guardiola’s attack as they march towards the treble, playing with the same sort of spark and flair that he did at Villa Park. The fee is not weighing him down now.\nBut during the first season, it had invited extra scrutiny: he is the first and only British player to command such a fee, the seventh most expensive player of all time, and while he was doing a lot of things that Guardiola truly appreciated, they were not the things associated with a £100million player. Everybody wanted more.\nAs his bus confession illustrates, so did Grealish. Privately, so did Guardiola. This is how it all changed.\nGrealish was very frustrated not to have been involved in that game against Villa on the final day of last season but, once the final whistle blew, confirming City as champions, he felt part of the club’s success just as much as any other player.\nAs has become clear in recent months, he is living a dream. “I had a text from my mum before the game saying, ‘These are the nights you dreamed of as a kid’ and it’s true,” he said after starting at Real Madrid’s Santiago Bernabeu stadium in May.\nAdvertisement\nOn the pitch after that Villa game, he was very emotional and rounded up his mum, dad, brother and two sisters to thank them for everything they had done to support him over the years and for their belief in him. He told them this was just the beginning — on Saturday he will surely start as City try to claim a historic treble in Istanbul.\nHe enjoyed himself in the days that followed, as he always has done. When Villa won promotion in 2019, he celebrated in typical Grealish style in London and, on that City trophy parade last year, he was just one of a number of players who decided to let their hair down — one team-mate had to leave the stage to vomit down an alleyway.\nAt the end of last season, he went to Ibiza and then Las Vegas and made headlines for doing so. These days he tries to stay away from the limelight a little more in that sense but is not shy about addressing his partying.\n“Course I am,” he said last Saturday after City won the FA Cup. “I don’t win an FA Cup every week, so I’m going to enjoy it. Straight back to training and recovery tomorrow.”\nThat is part of the Grealish package: he has no filter when talking — the Almiron example is a more negative side of that and one he is said to regret — but overall it is one of the reasons he is so valuable to brands such as Gucci and Puma, who stumped up a king’s ransom to sign him earlier this season.\n“There has been a big shift in what has made a player truly marketable in recent times — with authenticity being the key driver of that,” says Dan Connor, co-owner of AND THE NEW, a creative-digital sports marketing agency. “They don’t come more genuine than Jack.”\nThat summed up his approach last pre-season: if he parties hard, he works much harder. After his Ibiza and Vegas trips, he trained like an animal to be ready for the new campaign. That is not especially typical in football these days — players like Erling Haaland, Ruben Dias and Nathan Ake tend to avoid alcohol — but it seemed to work for him.\nAdvertisement\n“I’ve been impressed by how professional he is,” Guardiola said the day after City returned from Munich following a Champions League game in April. “Yesterday we arrived at 6pm, everybody goes home, he was here making treatment, in the water area, preparing just in case he’s needed next Wednesday (against Arsenal) because at Aston Villa he was not used to playing three games every week for a long, long, long time.\n“He knows his body, regeneration, and we cannot forget that Jack came last season from Aston Villa with a six-to-seven-month injury, he didn’t have the rhythm that he has right now and these little details have a big influence in the club, with the players, the manager, the way we want to play, and sometimes you need a little bit more time, but always I think when your mind is there, you can adapt quickly.”\nThat part of his relative struggle in his first season at City is overlooked: he had been recovering from a shin injury that kept him out for three months (not the six-to-seven that Guardiola says) but perhaps more importantly he was not used to the rhythm of playing so many matches in quick succession.\nHe has worked to put that right — generally in the afternoon and evening.\nHe is a slow starter, not a morning person, and while the likes of Dias and Ake are the archetypal “first in, last out” sort of trainers, Grealish can be sluggish in the mornings. “One minute before training starts,” says one insider with knowledge, when discussing Grealish privately. The hard work he puts in during the afternoon and the evening helps find the right balance. That work includes specific movements to help maintain his explosive power from a standing start, exercises to stay lean and to maintain the definition in his legs.\nDuring an injury lay-off between December 2018 and March 2019, he moved Oli Stevenson, the strength and conditioning coach at Villa, into his house and the pair stayed together at the training ground until late in the evening working out.\nBy now, with support from City’s team of sports scientists, he knows how to get the best out of his body. All his food is prepared by nutritionists, which is common, and he largely sticks to it.\nAdvertisement\n“I have Singapore chow mein, I have egg fried rice, I have salt and pepper chips, salt and pepper prawns, then curry sauce,” he revealed earlier this season. “And then mix it all in and have a big free for all in there.”\nThat is a post-match meal, which do not have to be so healthy, and one of his other favourites is fillet steak and chips, preferably from one of Salt Bae’s restaurants — he took his family to the Doha branch during downtime at the World Cup in Qatar last year.\nOverall, as with his fitness work, he knows how to find the right balance and has cut out butters and oils from most of his food. Watching City’s Spanish and Portuguese players eating is said to have given him inspiration.\nAll of this explains the kind of work he has done for years now and his habits at City, but something else was needed to become the key player he is today.\nWhen Guardiola said: “Always I think when your mind is there you can adapt quickly,” he was referring to a previous answer from the same press conference.\n“Always I believe that it’s when the players believe…” Guardiola began. He had been asked about the long list of City players who have signed for the club and struggled at first before bursting into life in the second season, like Rodri, Riyad Mahrez, Leroy Sane, Joao Cancelo and Bernardo Silva.\n“For example, Bernardo, knowing him, if he played better in the second season than the first it’s just because I didn’t give him as many minutes in the first season as I gave him in the second, because Bernardo had the feeling on day one that he can adapt.\n“But there are other players. Jack admitted publicly he struggled a little bit with belief. ‘Am I a Man City player? Am I able to play here?’ and the moment his mindset (changed) he was unbelievable, ‘Of course I am good enough to play here, of course I have the ability’.\n“Some players need a little bit more time than the other ones.”\nAdvertisement\nGrealish is as carefree a talker as you are likely to find in top-level football and he has indeed been open about his feelings.\n“I didn’t realise how hard it is to adapt to another team and another manager,” he said in January. “When I came here, it was so much more difficult than I thought.\n“’In my head, I was thinking, ‘Going to the team that’s sitting top of the league, I’m going to get so many goals this season’, and obviously it isn’t the case.”\nHe had just come off the bench to set up City’s winner against Chelsea during a period in which most of his team-mates were struggling after the World Cup. Grealish was one of the few — like John Stones and, a little later, Dias — who seemed to look better.\nEarlier in 2022-23, he played largely like his first season and also missed several games through injury right at the start, meaning his attempts to kick on were hampered from the get-go. In fact, going into the World Cup, that Miguel Almiron comment came back to haunt him as the Newcastle winger enjoyed a hot streak in front of goal.\nHis resurgence in the past few months is not something that can be quantified by an uptick in goals and assists, the things that were always used to measure his success and something he himself was desperate to improve.\nHe has four league goals and seven assists since the World Cup, which does not quite explain why he now looks like the kind of player everybody expected when he signed 18 months ago.\nAccording to sources around him and the City coaching staff, there is no specific moment or reason for that improvement. A consistent run in the side at the start of the year is the closest suggestion anybody has. Everybody agrees, though, that he is a different player now, figuratively and literally.\nGrealish, after all, has always done all of the unglamorous stuff Guardiola genuinely values. According to sources close to the City first team, these are the specific instructions:\n- Stay on the left. While at Villa he could roam, it is non-negotiable that he sticks to his zone\n- When he gets the ball, he has freedom to dribble, pass or shoot, albeit with an appreciation of choosing the best option\n- Draw players out of their positions to free up space for others. That’s how City can open up spaces in packed defences and create overloads\n- Simple passes sideways or backwards are fine. They allow other players to switch the play\n- Work hard defensively\nGrealish has always fulfilled these briefs and Guardiola particularly appreciates how he pulls players out of position and his perfectly weighted passes — like his assist for Erling Haaland to break the Premier League scoring record against West Ham in May.\nIn terms of assists, last season his actual assists fell below his ‘expected assists’, meaning his team-mates were not converting the chances he created. This season, the numbers perfectly match up because his team-mates are taking their chances.\nBut there was one thing the manager wanted more of: aggression. Play like you do in training was the message.\nAdvertisement\nGuardiola stressed that, as long as the City team were in their correct shape, with players in the right position to try to win the ball back if it is lost, Grealish should not fear taking his man on. Over time, the winger has become more confident in those scenarios, happier to take that risk rather than play a simple pass — as long as the time was right.\nThose two things — City’s correct shape and Grealish’s willingness to dribble — highlight some of the more subtle intricacies to Guardiola’s gameplay and spell out exactly why Grealish is so valued.\nWhen goals, assists and the transfer fee was still hanging over Grealish’s head, it would not have sounded like an impressive defence to talk about how he slows City’s game down. Yet that is exactly what Guardiola needs from him, especially this season as he tries to harness Erling Haaland’s directness.\n“We should spend more time in the final third, give more passes in that moment,” Guardiola said after City’s wild 3-3 draw at Newcastle in August when Grealish was injured. “But it’s difficult because Erling is going (forward), Phil (Foden) has this aggression to go. If Jack plays there or Riyad (Mahrez) or Bernardo (Silva) play on the right, they are more calm and they help us to be all together, and when we lose the ball, we are there and they (the opponents) cannot run.”\nSlowing the game down is exactly what Guardiola needs in those games, helping his side stay compact and avoid counter-attacks while keeping the ball. City beat Arsenal in February with just 36 per cent possession, the lowest of any team ever managed by Guardiola, but it was not exactly what the manager wanted.\n“In these type of games, you have to keep the ball, two or three touches, being pressed you have to keep it like Erling has done. Midfield players and everyone (have to do it) and we were not able to do it today, just Jack and a little bit Riyad, but especially Jack.”\nSo Grealish helps City be what Guardiola wants them to be and now he appreciates that he can take his man on at the right time.\nAdvertisement\nYet ‘at the right time’ has an even deeper meaning; as does ‘what Guardiola wants City to be’. They have changed as a team over the years, to the point where wingers like Raheem Sterling and Leroy Sane would be incompatible these days. Those players would like the ball played into space to run onto, or to play one-twos to run in behind, but that is the opposite of what Guardiola wants now. He wants wingers to take more touches, to help the team stay compact.\nAnd that has led to very specific instructions to his wide players: run at your man, but do not dribble past him. Ever seen Grealish facing up an opposition full-back with the ball at his feet, pushing him backwards, but passing inside rather than taking him on? If it is early in the game, that is exactly what he is supposed to do. So are Mahrez and Bernardo Silva when they play wide.\nThe idea is the same: force the opposition back (the full-back will be back-pedalling) and buy time. While this is happening, the other City players are advancing up the pitch. They may be regrouping if they had lost their shape or are simply advancing as a unit; either way, they are compact and ready to pounce if possession is lost.\nOnce City’s wingers have done that often enough, for example, the first five or six times they get the ball, City have established control over the game. After that, they can start to take their man on. This has the added bonus of confusing the full-back — the winger they are marking had been playing it safe, suddenly he bursts past him. What will happen next time?\nThose kinds of details put into context just how simple it was to focus so much on goals and assists and that is what Guardiola repeatedly told Grealish last season. He told him repeatedly because it was something Grealish, even knowing what else he brought to the team, still obsessed over.\n“We didn’t sign him for the incredible goals or assist,” Guardiola said at the start of this season, creating headlines. Even with that get-out, Grealish did not cut himself any slack and, after scoring against Wolves the next day, he said: “I should be scoring more, I should be getting more assists. The only thing I can do is score and get assists.”\nYet at the same time he himself has been able to spell out just how difficult he found it to adapt, hinting at that lack of belief that Guardiola suggested.\nAdvertisement\n“It’s so much more difficult,” he said earlier this year. “A lot of teams do tend to sit in against us, which obviously wasn’t the case at Villa.\n“I’ve said it before, but it’s so much different to what I was used to at Aston Villa. Playing for Dean Smith, he’d say to me, ‘Go and find where you think the weak link is in the defence. If you want to go in the right, in the middle, if you want to hug the touchline.\n“At Villa, I’d always have an overlapping full-back. Stuff like that.”\nThe graphic below highlights he is less involved in chance creation and has fewer shots and does more defending at City than he did at Villa (a fuller description of the terms used is available here).\nAnd the below shows just how much he was able to go wandering to receive the ball at Villa: while the majority of his receptions came on the left, he was clearly cropping up in different areas.\nAt City, he is instructed to stay on the left and wait for the ball to reach him.\nAnd he was creating chances from different areas of the pitch for Villa: some central, some from the right, some from deep.\nAt City, 50 per cent of his chances created come from that small area on the left of the penalty area and the vast majority of the rest are in nearby areas.\nThe outcome is Grealish becoming Guardiola’s go-to man on the left-hand side, keeping good friend Foden out of the starting line-up. He has improved so much in recent months that Kalvin Phillips, signed from Leeds last summer and yet to make an impact at City, is hoping to follow in his footsteps.\n“One of my main inspirations is probably Jack,” Phillips said. “Because me and Jack have had pretty similar career paths, playing for clubs that we’ve always supported, got promoted, then playing in the Premier League for a couple of seasons and then coming to one of the best footballing teams in the world.\nAdvertisement\n“I just look at Jack’s career and how his time at City has gone so far. In his first season he didn’t play as much as he probably would have liked to, but this season he has been one of the main players and he has been a very special player in our team. I just look at that as inspiration and I know I need to keep working hard.”\nAnd if you work that hard, maybe you can afford to play hard, too.\nAdditional graphics by Thom Harris.\n(Top image: designed by Eamonn Dalton; photo by Marc Atkins via Getty Images)",
  "word_count": 3339,
  "scraped_at": "2026-02-14T02:24:42.721680",
  "_text_extracted": true
}