{
  "article_id": "010a00974f12",
  "url": "https://www.caughtoffside.com/2025/08/17/newcastle-bilal-el-khannouss-transfer/",
  "title": "Newcastle want to sign 21 - year - old to play alongside Jacob Ramsey",
  "date": "20250817T210000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle have been very busy on the transfer front in recent weeks, and that continued on Sunday with confirmation of Jacob Ramsey’s arrival from Aston Villa. The 23-year-old joins Eddie Howe’s side as competition for places in midfield, and he may not be the only addition made to that area of the park.\nHaving sold Elliot Anderson and Sean Longstaff in the last 14 months, Newcastle are currently light on options in midfield. Outside of the regular starting trio of Sandro Tonali, Bruno Guimaraes and Joelinton, Howe only had Lewis Miley as an option for Saturday’s goalless draw at Villa Park, with Joe Willock having suffered another injury during pre-season.\nNewcastle interested in Leicester midfielder Bilal El Khannouss\nThis could mean that another midfielder could join, and as per Football Insider, Pete O’Rourke has confirmed that Newcastle are keen on Leicester’s Bilal El Khannouss, who could be signed to play alongside new signing Ramsey.\n“He’s a player who has attracted a lot of interest this summer. He was one of Leicester’s shining lights in the Premier League last season. He’s a very smart operator and he’s got potential to move on to a bigger club and become a big player for them in the future. He isn’t letting the speculation affect him at the moment, he started for Leicester in their opening game of the season and got a couple of assists as well.\nNewcastle have been looking at him while pursuing Jacob Ramsey. They could potentially sign both to strengthen the squad in that position. Eddie Howe needs a bigger squad this season with Champions League football to contend with.\n“Leicester are open to selling him and they’ll face a real battle to convince him to stay in the Championship if he does have Premier League offers. It’s one to keep an eye on before the end of the window. I expect offers to come in for El Khannouss before the end of the window.”\nLeicester are expecting to lose El Khannouss before the summer is over, and as far as his next move goes, Newcastle would be an excellent one.",
  "word_count": 352,
  "scraped_at": "2026-02-14T02:02:51.931617",
  "_text_extracted": true
}