{
  "article_id": "011ae7ac853a",
  "url": "https://www.caughtoffside.com/2024/06/19/chelsea-ian-maatsen-aston-villa/",
  "title": "Chelsea Ian Maatsen on the verge of joining Aston Villa after deal agreed",
  "date": "20240619T191500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea’s Ian Maatsen is moving closer to joining Aston Villa after the two Premier League clubs agreed a deal for the transfer of the left-back.\nThe Blues need to sell some of their players before June 30 to comply with the Premier League’s profit and sustainability rules and the defender was one star placed on the transfer list.\nMaatsen spent the second half of the current campaign on loan with Borussia Dortmund and it was a very beneficial move for all involved. The full-back played a key role in helping the German side reach the Champions League final as the Chelsea man featured in 23 games for BVB.\nThe 22-year-old was expected to complete a permanent move to the Bundesliga side this summer, but it is now being reported that the Maatsen is on his way to Aston Villa.\nAccording to The Athletic, Villa and Chelsea have agreed a deal for the left-back with the fee being just above £35m. Personal terms are also in place on a six-year contract, which the Birmingham club are working to finalise.\nThis has the potential to be a great signing for the Premier League club as they continue to search for players to strengthen their squad ahead of a 2024/25 campaign which contains Champions League football.\nUnai Emery wanted Chelsea’s Ian Maatsen at Aston Villa\nThe report states that Villa manager Unai Emery is a huge admirer of the Maatsen and played a part in the Birmingham club recruiting the defender ahead of the new season. The Dutch full-back will likely take the starting role on the left at Villa Park, which could see one of their other left-backs leave.\nAlex Moreno and Lucas Digne are Villa’s current options and the French star has been close to leaving the Premier League club in the past.\nThe arrival of Maatsen may prompt an exit, but the signing of the Chelsea defender is an impressive one if he can perform in England’s top flight as he did in Germany this season.",
  "word_count": 336,
  "scraped_at": "2026-02-14T01:57:18.891035",
  "_text_extracted": true
}