{
  "article_id": "012695de067a",
  "url": "https://www.france24.com/en/live-news/20231114-mazzarri-makes-shock-napoli-return-after-garcia-shown-the-door",
  "title": "Mazzarri makes shock Napoli return after Garcia shown the door",
  "date": "20231114T181500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mazzarri makes shock Napoli return after Garcia shown the door\nTurin (Italy) (AFP) – Walter Mazzarri made a shock return as Napoli manager on Tuesday after Rudi Garcia fell victim to a dismal start to the Italian champions' Serie A title defence.\nIssued on:\nGarcia lasted just five months at Napoli after replacing Italy coach Luciano Spalletti, failing to inspire a team which had kept almost all the stars of last season's first Scudetto since 1990.\nNapoli are 10 points behind league leaders Inter Milan in fourth and have been in turmoil for weeks as May's historic title triumph began to increasingly look like a one-off.\nGarcia, 59, was fired after Sunday's 1-0 home loss to Empoli was greeted by a deluge of boos and whistles from supporters, whose joy at being reigning Italian champions has vanished.\nReports of his dismissal emerged almost immediately after that defeat, Napoli's fourth at home in all competitions this season.\nThe announcement of Mazzarri's Napoli return after a decade away, reportedly on a deal until the end of the current campaign, initially came via owner Aurelio De Laurentiis.\nThe movie mogul simply wrote \"welcome back Walter!\" on X, formerly known as Twitter, after the club confirmed Garcia's sacking.\nDe Laurentiis was visibly irked by that display in the pouring rain in Naples, as was injured star striker Victor Osimhen.\nBut fans are also pointing the finger at De Laurentiis, whose decision it was to replace Spalletti with a man whose stock has fallen dramatically since being sacked by Roma in early 2016.\nGarcia, who won Ligue 1 with Lille in 2011, was fired from his previous job at Al Nassr in April not long after the Saudi Arabian club signed Cristiano Ronaldo in a deal worth tens of millions of dollars.\nHe was previously a losing Europa League finalist with Marseille in 2018 and took Lyon to the semi-finals of the Champions League two years later.\nFan anger\nDe Laurentiis has long had a difficult relationship with Napoli supporters, in particular with the hardcore fans who were in open revolt for much of last season over high ticket prices and bans on drums, flags and banners.\nThe 74-year-old also owns Bari and before the start of that historic campaign fans were imploring him to sell up and go full-time at the second-tier club.\nDissatisfaction with team displays and the ownership will bring added pressure to Mazzarri, who helped return southern Italy's biggest club to the upper echelons of Italian football in his first four-year spell.\nThe 62-year-old guided Napoli to the 2012 Italian Cup, beating undefeated league champions Juventus in the final to win the club's first trophy in over two decades.\nHe left in May 2013 after finishing second in Italy's top flight with a thrilling team which boasted Ezequiel Lavezzi, Marek Hamsík and Edinson Cavani in attack.\nMazzarri took over at Inter Milan shortly afterwards but was sacked in November that year and his career has since taken a downward turn, with uninspiring spells at Watford, Torino and Cagliari leaving him a surprising choice ahead of Igor Tudor.\nFormer Croatia defender Tudor, who won two Serie A titles with Juventus as a player, took Marseille to third in Ligue 1 last season but left the long-troubled club \"for professional and private reasons\".\nTudor also did an excellent job the previous season at Verona, who finished ninth after he took over from sacked Eusebio Di Francesco early in that campaign.\n© 2023 AFP",
  "word_count": 580,
  "scraped_at": "2026-02-14T02:07:27.065340",
  "_text_extracted": true
}