{
  "article_id": "0135b0994aa7",
  "url": "https://theathletic.com/4859016/2023/09/16/moises-caicedo-chelsea-idv/",
  "title": "The club set for €20m Moises Caicedo windfall who want to help Ecuador win World Cup",
  "date": "20230916T064500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“It’s a ton of money for us, and it will be 100 per cent reinvested in our youth divisions,” Independiente Del Valle’s honorary president Michel Deller tells The Athletic.\nMoises Caicedo’s recent €133million (£115m, $143m) move from Brighton to fellow Premier League side Chelsea has an unlikely beneficiary thousands of miles from England — the Ecuadorian club who developed him and sold him to Brighton.\nAdvertisement\nIndependiente, based in Sangolqui on the outskirts of capital city Quito, will receive more than €20million due to a 20 per cent sell-on clause inserted in the deal that took the midfielder to Brighton at age 19 in February 2021.\nDeller says they do not yet know the exact amount they will get – some of the ‘solidarity’ money will also go further down the line to Caicedo’s first club, Colorados Jaipadida — but the real estate entrepreneur confirms Independiente have already started planning to spend the first part of their windfall on a new ‘high-performance centre’ for 200 boys and girls in the player’s home city of Santo Domingo de los Tsachilas.\n“Our idea is to do a trust whose directors are professional investors, and the return the club gets can only be used for youth development, building new high development centres and academies in Ecuador,” Deller says. “The infrastructure is easy, the important thing is how you maintain it, how you continue developing talent, and more importantly how you form complete human beings.”\nCaicedo is just one of dozens of Ecuadorian kids from humble backgrounds who Independiente have scouted and developed into high-quality footballers in recent years. Independiente have won trophies domestically and internationally, provided a generation of exciting talents for Ecuador’s national team, and set an example of how the game can be a way to aim for a better life for millions of boys and girls in the country.\n“For many young people, not just in Ecuador but in most of the Americas, football is their one opportunity,” Deller says. “We are going to have about 200 boys and girls living in the new centre in Santo Domingo de los Tsachilas. These kids have so much hope in their eyes, so much love, so many dreams.\n“Football is about aspirations and dreams, doing things that can change and improve people’s lives, keep kids in school, keep them off drugs, out of trouble. We understood that all along.”\nAdvertisement\nDeller is one of Ecuador’s most successful entrepreneurs — his company, DK Management Services, builds and manages some of the country’s biggest shopping centres. In 2006, he partnered with half a dozen other businessmen, including current Independiente Del Valle club president Franklin Tello, to take over a side then called Independiente Jose Teran. This was a third-tier outfit, founded in 1958 by a shoemaker in the 80,000 population neighbouring town of Sangolqui.\n“There was one humongous advantage — no huge fanbase,” Deller says. “Sangolqui is about 45 minutes from Quito, in the valley, about 300 metres below. Quito has six or seven pro soccer teams in a city of two million, so your level of competition for fans and for expectations there is really high. We wanted a club where we could do our work and grow.”\nThe idea was to organise the often tumultuous world of Ecuadorian football, and to start from the bottom up. Young talents would be developed to improve the team, with their eventual sales providing more money to keep investing.\nWithin four years, the renamed Independiente del Valle had jumped two levels to the domestic top flight and were competing with the country’s traditional heavyweights Emelec, Barcelona — not that one — and LDU Quito.\nBy 2013, Independiente qualified for their first continental-level competition. In 2016, they made a surprise run to the Copa Libertadores final (South America’s equivalent of the Champions League). Three years later came their first major trophy — the Copa Sudamericana (their version of the Europa League). The Ecuadorian title followed in 2021, with another Copa Sudamericana in 2022. The Ecuadorian Supercopa (Community Shield) and South American Recopa (their Super Cup) have already been secured this year.\nThey stuck to a formula for their team — seven homegrown talents alongside four more experienced players brought in from elsewhere. In the Recopa back in February, Independiente faced last year’s Copa Libertadores winners Flamengo. The Brazilians featured established international stars David Luiz, Arturo Vidal and Gabriel Barbosa. But Independiente won on penalties in Rio de Janeiro’s fabled Maracana Stadium after a 1-1 aggregate draw over two legs.\nAdvertisement\n“We’ve been blessed with more success than the most optimistic person could have dreamed,” Deller says. “It’s difficult to comprehend, as money plays a big factor in football. In South America, we compete with Brazilian and Argentinian clubs with very big fanbases and budgets. That Flamengo team was valued at 30 times more than ours.\n“When you can do that, you start understanding the magic of football.”\nCaicedo joined Independiente Del Valle at the age of 15, leaving his family behind in Santo Domingo to live in the academy facility at Sangolqui. When a cruciate knee ligament injury in 2017 put him out for 10 months, he was provided with a personalised rehab, training and nutrition plan to keep his development on track. He was also educated for four hours a day, like all his team-mates, on maths, languages, sexual behaviour and prevention of drug and alcohol abuse.\n“We understood very early on that there was immense talent in Ecuador, but nobody ever really invested in the people,” Deller says. “We give kids that opportunity. That is why their parents are OK with them leaving at such an early age, coming to live in what is basically a residence academy. This is their chance at a better life. We spend immense time, energy and money in education. That is the essence of what we do, and it is a big part of our success.”\nFrom 2015 to 2020, Independiente had an official relationship with Qatar’s Aspire Academy. This involved a steady stream of Aspire’s coaches, staff and executives working with the kids in Sangolqui. These included Miguel Angel Ramirez — the Spanish coach who gave Caicedo his first-team debut at 17 in October 2019.\nCaicedo captained Independiente Under-18 sides as they won competitions in South America and Europe, and also shone in the 2020 Under-20 Copa Libertadores final, helping beat Argentina’s River Plate, whose team included his new Chelsea team-mate Enzo Fernandez.\nSuch success at youth level is a key part of Independiente’s project.\nAdvertisement\nThe club’s under-16s were the only South American team invited to the Red Bull-organised Next Generation Trophy in Austria last month, where their results included a 4-1 win over Liverpool and a 2-1 defeat of Atletico Madrid, although they could not repeat their success of reaching the final in 2022.\n“We try to compete at the highest level with all our youth divisions,” Deller says. “We go all around the world to expose our kids to the highest level of competition so that, when they are older, they can say I played against this kid, and I was better than he was, and I can beat him now that I’m older. We invest heavily in that.”\nNot all South American clubs have Independiente’s patience and stability, and not all think about the long-term career plans of their teenage talents. For Independiente, this can mean a lower transfer fee at first, but can benefit everyone over time — as it has spectacularly with Caicedo moving first to Brighton and now Chelsea.\n“We had players before go to Europe, U.S. and other places, where they had a very difficult time adjusting,” Deller says. “Having all the skills, especially the mental skills, to be able to succeed, adapt, improve — I’m so proud when I see Moises speaking English.”\nEach year, Independiente sell four or five youth products to clubs in South America, North America or Europe with the proceeds reinvested in facilities and infrastructure. Their senior team now play at the new 12,000-capacity, FIFA-quality, all-seater Estadio Banco Guayaquil, the first fully privately-financed football stadium in Ecuador, which was opened just a few weeks after Caicedo’s sale to Brighton for around £4million.\n“We have about six or seven top entrepreneurs and business people in Ecuador, who take the best practices from our businesses and apply them to football,” Deller says. “It is not a typical dictatorship, like most clubs. We’re in fashion right now, everyone is talking about us, so it’s easy to say this. But if you came five years ago, or 10 years ago, I’d have told you the same thing. We have been very lucky along the way.”\nThe success of Independiente’s model success means that, even before their latest windfall, they have been expanding their reach. Last May, the club opened a high-performance centre in Ecuador’s northern province of Esmeraldas, a historically deprived area close to the border with Colombia. The incoming Caicedo money will also help to open more residential centres for teenage players, including in the south-western coastal city of Guayaquil, as well as day academies for younger children.\nAdvertisement\n“The idea is to develop centres in the most problematic areas in Ecuador, the ones that need the most opportunity,” Deller says. “We are going to start working with kids that are five to nine years old, so they can have a really good lunch every day, a good education. We want to control what happens to them during the day. Then they can go sleep at home.”\nIn May this year, Deller and his partners also bought Colombian top-flight side Atletico Huila. They plan to use the same methodology to develop talents in that country.\n“There are two humongous challenges in Colombia — the country is much bigger, so having kids coming to stay in a residence more than six hours drive away is difficult,” Deller says. “Ecuador also has a pretty good youth competition structure from 13, Colombia does not have that until the age of 17. So we will have to recruit in different areas, and figure out how we do high-level competition. We want to see how far we can go there, and then go to other countries.”\nMeanwhile, Deller also has big ambitions in his homeland.\nTen members of the 26-strong Ecuador squad at last year’s World Cup were developed at Independiente, including the team’s three young outstanding players — Piero Hincapie of Germany’s Bayer Leverkusen in defence, Caicedo in midfield and Gonzalo Plata, then of Spanish side Real Valladolid and now at Qatar’s Al Sadd, in attack.\nThe under-17s team which will play in that age group’s World Cup in November is also well-stocked with Independiente players, including the side’s captain Kendry Paez, whose move to Chelsea when he turns 18 in May 2025 has already been agreed.\n“We are the base of every single Ecuador team — every age group,” Deller says. “There is tremendous talent in the under-15s, maybe our best team ever. This is about much more than Independiente, this is about Ecuadorian soccer, and the example it generates for society.\nAdvertisement\n“We still have a long way to go. Our mission is for Ecuador to be world champions. We believe we can accomplish that. It will require a tremendous amount of work, a lot of luck. Small countries like Uruguay, Croatia and Iceland have shown us what they can do with three million people, five million, a million. We have 17 million people in Ecuador. We have to aim for that.”\nEcuador have only got to four World Cups in their history, failing to qualify on 12 occasions, and have reached the last 16 just once, in 2006. However, Deller believes Independiente’s story, and Caicedo’s example, show the people of his country that anything is possible.\n“For Ecuador, the sale of Moises Caicedo transcends football,” he says. “It shows how a humble young man can fulfil his dream. Many years ago, he wanted to be a great player, to play in the Premier League, to play at Chelsea. And he put in everything he had, and he was able to do it.\n“This becomes something like a growing snowball, that just continues to grow as it feeds the idea that other people can accomplish the same.\n“That is why we are so optimistic. We are just touching the surface at the moment.”\n(Top photo: Rodrigo Buendia/AFP via Getty Images)",
  "word_count": 2070,
  "scraped_at": "2026-02-14T02:00:57.132816",
  "_text_extracted": true
}