{
  "article_id": "01647169e0d7",
  "url": "https://www.anglocelt.ie/2025/05/05/ruben-amorim-knows-europa-league-is-all-that-matters-now-for-manchester-united/",
  "title": "Ruben Amorim knows Europa League is all that matters now for Manchester United",
  "date": "20250505T144500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim knows Europa League is all that matters now for Manchester United\nBy Reuben Rosso-Powell, PA\nRuben Amorim said Manchester United’s Europa League semi-final second leg on Thursday is what is important after a 4-3 Premier League defeat at Brentford on Sunday.\nThe Red Devils’ winless run in the league was extended to six matches despite a late comeback that saw Alejandro Garnacho and Amad Diallo score consolation goals.\nHowever, after their 3-0 first-leg win over Athletic Bilbao last Thursday, United know they have the chance to qualify for the Champions League by winning the Europa League.\n“I think it’s stressful to lose games. When we’re fighting for a title it’s not stressful,” said Amorim, whose side are 15th in the table.\n“I have no doubts that we are playing better and we are understanding the way we play, even in this context.\n“So we have to take all the hits in this moment. We are losing games in the Premier League, but we are fighting for the Europa League so we need to accept that and to think about now Thursday which is the most important game for us.”\nKevin Schade’s brace, a Luke Shaw own goal and Yoane Wissa’s 18th of the campaign helped Brentford to victory at the Gtech Community Stadium, after Mason Mount had opened the scoring.\n“We, as a club, need to understand in this moment that we have a big responsibility (to win the Europa League). We have to prepare a squad for different competitions,” Amorim said on the eight changes he made to his starting XI.\n“(Rotation) is good for the players. Everybody is playing, we are preparing more than one game but it’s hard.\n“Of course we want to be competitive, we struggled a lot during these 90 minutes. We have to think about the next game and then the Premier League. It’s really hard but we are doing the best we can to try to manage (the situation) and try to risk in some games.”\nThomas Frank’s Bees capitalised on an injury to Matthijs de Ligt by using the extra man to score their first goal.\nThe Dutch defender was substituted and is a doubt for Thursday’s European tie.\n“Yeah, I definitely have sympathy about De Ligt and, you know, it’s clear that they struggle in many ways,” boss Frank said.\n“When you are in football, the struggles are part of football but you just know it is not nice. Of course, it’s a tricky situation so I hope De Ligt is OK.”",
  "word_count": 423,
  "scraped_at": "2026-02-14T02:02:47.557837",
  "_text_extracted": true
}