{
  "article_id": "016f0cb018df",
  "url": "https://www.thenationalnews.com/opinion/editorial/2025/09/08/du-etisalat-data-internet-slow-uae-undersea-cables/",
  "title": "It vital to brace for internet disruptions in the future",
  "date": "20250908T041500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For internet users, often there is no greater inconvenience than the Wi-Fi acting up. An interruption in internet services, as experienced briefly on Saturday by many in several parts of the Middle East, as well as in India and Pakistan – is a reminder of the 21st century dependency on speedy and stable broadband.\nWe tend to not dwell on the technologically complex systems at work that allow members of a household on multiple devices to simultaneously buffer videos on YouTube, do a live stream, and be on a Zoom call, without a hiccup. But when underwater internet cables are cut, all those pursuits effectively come to a standstill. This is down to the impressive fact that the total data-carrying capacity of these cables, also called power cables or submarine cables, is in the range of terabits a second.\nFaults in undersea cables have caused disruptions in the past in many areas of international waters, more often by accident. Indeed, according to the US-based Centre for Strategic and International Studies, more than 70 per cent of cable faults are not intentional. Damage can be caused by fishing nets, anchors, weather, even sharks nibbling on the cables, and, as was reported last year, sinking cargo ships.\nHowever, it’s often difficult to distinguish between whether a disruption is accidental or intentional. This adds a layer of complication that malign actors can conceivably use to their advantage.\nThere is no clear understanding so far as to what caused Saturday’s problem. The Houthi rebels, who are in control of large parts of Yemen, have not claimed responsibility, nor has the finger of blame been pointed at them. Yet repair work on the undersea cables can be risky in this part of the world – a prime telecommunications route that links Europe to Africa and Asia through Egypt – as the Houthis are routinely given to attacking ships in these waters.\nPreventing disruptions is essential for a smooth flow of data and the running of everyday business. Tightening security and boosting undersea infrastructure, then, is necessary, albeit expensive, in national and strategic interests.\nIn many parts of the world, and in the region – with the UAE among the highest ranking – breezy 5G internet is a given. Fortunately, Saturday’s internet lag didn’t last very long either. The extent of the lag was limited, and it seemed to not have critically affected hospitals and other emergency services. But incidents that involve these critical power cables, often buried deep in the seabed, raise questions of preparedness and systems resilience.\nWith several countries in the region veering towards the digital realm and increasingly incorporating data-intensive AI, even a minor event calls into focus the increasing need to bolster infrastructure out at sea. As a CSIS report emphasised, “ensuring systems are hardened, fail-safe, have sufficient redundancy and are quickly recoverable” becomes essential.\nEver greater levels of investment towards strengthening these frameworks will continue to make countries digitally sound and able to meet the data demands of their populations. Very simply, it will ensure that economies continue to function.",
  "word_count": 510,
  "scraped_at": "2026-02-14T01:49:53.055163",
  "_text_extracted": true
}