{
  "article_id": "017c26ace867",
  "url": "https://metro.co.uk/2026/01/29/is-premier-league-dominance-starting-to-ruin-the-champions-league-26591335/",
  "title": "Is Premier League dominance starting to ruin the Champions League ? ",
  "date": "20260129T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It takes an awful lot to produce a moment in football that even the wily, veteran Jose Mourinho is taken aback by.\nBut standing in the Benfica dugout in the final minute of extra time, even he could not have expected goalkeeper Anatoliy Trubin to be their unlikely hero on the night.\nRising to head home Benfica’s fourth against Real Madrid from a free-kick, Trubin wheeled away to celebrate a goal that saw his side leapfrog Marseille and secure the final spot in the Champions League playoffs in the most dramatic of fashion.\nIt was a goal that provided the perfect crescendo to the final night of league-phase action, and for UEFA, perhaps the kind of moment they had been hoping their revamped format would produce.\nBy scrapping the traditional four-team groups in favour of a 36-team, eight-match league phase format, UEFA hoped to ensure more games between Europe’s biggest sides and more jeopardy in the tournament’s earlier stages.\nAnd the dramatic finale of the second edition appears to have vindicated that decision in the eyes of many fans, who were initially sceptical to the change.\nBenfica’s goal might have quickly become the story of the night, but the other big winners were surely the English, whose dominance in this new league phase is already proving something of a headache for the competition.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWins for Liverpool, Chelsea, Tottenham, and Manchester City on Wednesday saw all four sides join Arsenal in the top-eight and straight into the round of 16, while Newcastle narrowly missed out despite a creditable draw away at Paris Saint-Germain on the final night.\nBayern Munich, Barcelona and Sporting CP make up the rest of the top eight, meaning no other league has more than one team automatically into the top-16.\nLast year was a similar story, too, with three of the top eight made up of English sides, the most teams of any league yet again.\nThe vast sums of money swashing around the Premier League has long been known. The record £3bn spent by top-flight English clubs this summer was more than was spent by Bundesliga, La Liga, Ligue 1 and Serie A clubs combined.\nAnd that vastly superior spending is now starting to manifest itself into a noticeable gulf in quality between English clubs and much of the rest of the competition.\nSure, the likes of Bayern Munich, Barcelona, Paris Saint-Germain and Real Madrid are still able to keep up with England’s elite, but the competition’s middle and working class now look increasingly off the pace.\nTake Tottenham, for example. Thomas Frank’s side are currently only eight points above the Premier League relegation zone, and yet finished fourth in the Champions League league phase, picking up 17 points from their eight European games.\nBy contrast, they have picked up only 11 more points in the league despite having played 15 extra games. That can’t be good optics for the competition, whichever way you look at it.\nSpurs’ Jekyll-and-Hyde displays in the league and on the continent can’t be entirely attributed to the tournament, but the extended league phase, which puts additional workload on all teams, has surely helped the English sides blessed with deeper pockets and bigger squads.\nMore Trending\nWhether Premier League sides can extend that dominance into the knockout stages this time around remains to be seen, but a worrying trend for the tournament is already emerging.\nPremier League sides have already won three of the last seven Champions Leagues, which is greater than any other European league in that same time frame.\nAnd with five teams already in the last-16, the odds of at least one team making it to the latter stages seem nigh-on certain.\nEngland becoming the dominat force in European club football is not the fault of the Champions League; that much is certain. But the competition will surely be damaged if the balance is not redressed sooner rather than later.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Former Arsenal star Serge Gnabry responds to Tottenham transfer offer\nMORE: Champions League draw: Newcastle, Real Madrid and Paris Saint-Germain learn play-off opponents\nMORE: Teddy Sheringham reveals huge concern over £74m Man Utd star: ‘It’s hard for him’",
  "word_count": 766,
  "scraped_at": "2026-02-14T01:59:36.854387",
  "_text_extracted": true
}