{
  "article_id": "01977e301b36",
  "url": "https://toffeeweb.com/season/24-25/comment/fanscomment/45877.html",
  "title": "Everton 2025 / 26 Squad - Looking up",
  "date": "20250220T164500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Obviously, much of this depends on budget. I’m guessing we’ll spend more than we recoup in sales for the first time in nearly five years. This is a huge step forward from extreme and sustained cost-cutting. However, PSR and TFG’s other financial commitments mean that we’re unlikely to go on a spree of Brighton (€-229.96m) or Ipswich (€-150.23m) proportions.\nSo here’s a guess – we’ll end the summer transfer window with a net spend of about -€35m. It’s not a lot of money these days – not enough to buy an Archie Gray, an Elliot Anderson, a Georginio Rutter, an Ian Maatsen or a Max Kilman. Given the likely departures of possibly all of Calvert-Lewin, Broja, Lindstrom, Harrison, Doucoure, Mangala, Gueye, Keane, Young, Coleman, Virginia, Begovic – it really is a small kitty. Which is why I expect us (sadly) to sell Branthwaite. If we don’t, TFG will probably need to cough up a net spend of about -€100m. Hopefully, that happens, but I’m not banking on it in my educated guesswork.\nAnd that educated guesswork also tries to second guess the sorts of players who might become available – and who Moyes/Thelwell might buy (based on past and recent experience a focus on players aged 22 to 26 with at least 100 games under their belt). It might all be nonsense but Ndiaye, O'Brien and Broja all featured in last year's article along with quite a few close calls.\nAnyway, look away now if you don’t like transfer speculation.\nFIRST XI\nGoalkeeper\nJordan Pickford\nHopefully, he stays despite rumoured interest from Bayern and a few others.\nRight Back\nKyle Walker-Peters (Saints) - free\nSeems a highly likely low-cost signing. He would give us our best right back since before Coleman broke his leg eight years ago. There’ll be plenty of competition for him though so we might have to look for other options.\nRumours: Lamptey (Brighton), van Ewijk (Coventry), Tchatchoua (Verona), Wesley (Flamengo).\nMore obvious possible options: Sildillia (Freiburg), Acheampong (Chelsea), Kumbedi (Lyon).\nLeft Back\nLief Davis (Ipswich) – free.\nAlso a likely signing. Wouldn’t be a huge surprise if Mykolenko moves on in the summer to generate a bit of a fee. He has his moments but there are better options out there.\nRumours: Truffert (Rennes).\nMore obvious possible options: Brown (Gent), Locko (Brest), Oosterwolde (Fenerbahce), DeCuyper (Club Brugge).\nCentre Back (Right)\nJames Tarkowski\nNot the most talented of players but hard as nails and very, very dependable. Where would we have been without him these past few years? And what a goal in the Derby!\nCentre Back (Left)\nCallum Doyle (loan from Man City with an option/obligation to buy).\nDecent on the ball and mobile too, the big left-footed centre-back is an ideal replacement for Branthwaite. It would be great to keep Branthwaite, of course, and it may happen – but it looks more likely he’ll have to leave to fund the rebuild.\nRumours: Esteve (Burnley).\nMore obvious possible options: Zeze (Nantes), Marmol (Las Palmas), Herrando (Osasuna)\nDefensive Mid\nSantiago Hezze (Olympiakos).\nAlthough very speculative, I could see Hezze coming in. He’s a good footballer and might strike up a good relationship with fellow Argentine Alcaraz. What I can’t see happening is us taking up the £33m option to buy Orel Mangala. It’s a shame because he has been good this season – but not good enough to risk such a big chunk of budget on. We might negotiate that fee down, I suppose, but buying deteriorating assets over 26 (with injuries to boot) is what has killed us financially. Probably best just to move on.\nRumoured: Neil (Sunderland)\nMore obvious possible options: Chotard (Montpellier), Brazhko (Dinamo Kiev), Costa (Mallorca), Stach (Hoffenheim), P.Maia (Sao Paulo), Onyedika (Club Brugge), Munoz (Osasuna).\nBox-to-Box\nJames Garner. When fit, he’s good. Not brilliant but good - and certainly no great urgency for an upgrade.\nRumours: Diarra (Strasbourg), Dewsbury-Hall (Chelsea), Rohl (Freiburg).\nMore obvious possible options: Taylor (Ajax), Zafeiris (Slavia Prague), Dele-Bashiru (Lazio).\nAttacking Mid\nDwight McNeil\nCompeting with Alcaraz, of course – who may end up taking this spot (especially with McNeil’s injury concerns).\nRight Wing/Forward\nTom Fellows (West Brom) – about £18m\nMore obvious possible options: Lindstrom (Napoli) – although the Dane might have talent and speed he seems to lack the intensity we need. I think Moyes and Thelwell might think the £18m option to buy would be better spent on the much younger Fellows (off the back of a very productive season for West Brom).\nRumoured: Nuamah (Lyon), Chukwueze (AC Milan), Yilmaz (Galatasaray).\nLeft Wing/Forward\nIliman Ndiaye\nOur best attacker by some distance. I know many would prefer him as a number 10 – but the left wing / forward is only a starting position on a piece of paper. He doesn’t need to be running up the line like Jason Wilcox, the point is to work with a full-back and interchange with the likes of McNeil, Alcaraz etc.\nStriker\nBeto\nThis might disappoint some, but it is extremely difficult to find a ready-made striker. Vast sums are being spent on players who fail to deliver like Hojlund and Nunez (both of whom Man Utd and the RS would gladly get rid of). It might be more cost-effective and productive to put up with Beto (an eight to 12-goal striker and maybe beyond) – and develop someone of real talent behind the scenes (see the second XI).\nRumours: Castro (Bologna), Pepi (PSV), Igamane (Rangers), Ferguson (Brighton).\nCastro and Ferguson are undoubtedly talented but their stats are underwhelming. Castro has six goals in 30 this season in a fairly average Serie A. Ferguson’s best in a season is six. Now they are both young (20) and developing, and definitely have the style and talent for the Champions League – but it could take a few years before they are hitting more than about 8 to 10 league goals. Pepi and Igamane also have talent but the weakness of the Eredivisie and the SPL will flatter them.\nOther possible options: Delap – but he’d be expensive, probably £45m(+) and may well get offers from Arsenal, Chelsea, Man Utd, the RS and other much richer clubs.\nSECOND XI\nThis is where we are particularly dire and need to invest more heavily in players who can compete with and overtake our current first XI. We can’t continue to pad out the second XI with lower quality. It is money wasted even if it provides short-term cover. If anything, signings for the second XI should aim to be of higher quality but just lesser experience.\nGoalkeeper\nJoao Virginia\nMakes sense to re-sign him if he’s willing. Otherwise, there will be plenty of very low-cost/free keepers available to play second fiddle to Pickford.\nRight Back\nKabore (Man City). Very (very) fast RB who has now had various loans and is currently doing well at Werder Bremen playing Left Back which shows his (helpful) versatility. He may prefer a club with a nailed-on first-team spot though.\nRumours: Elias Jelert (Galatasaray) – loan or c.£5m fee.\nOther possible options: Vagiannidis (Panathinaikos), Holm (Bologna) – both are out of contract. Otherwise, there are probably between about 25 and 50 players who we could credibly buy and develop for this position aged between about 18 and 23.\nIt looks like Patterson will return to Rangers and Roman Dixon would benefit from a Championship loan. Both of these players need a run of games at a good standard, and that’s not looking likely in the Premier League.\nLeft Back\nHarry Amass (Man Utd) – loan or c. £5m or so.\nThe youngster is a very Baines-like player who needs a break. He won’t break through at Man Utd because they’ve just bought Dorgu and Leon for his position. But he could be an excellent signing for us.\nAs with right-backs, there are probably about 25 to 50 players who we could get for this position. No point spending a lot of money.\nMore obvious possible options: Rouhi (Juventus), Doig (Sassuolo).\nCentre Back (Right)\nJake O’Brien\nGood player and I am not trying to be disparaging by putting him in the second XI. But looks more like a long-term Tarkowski replacement than an immediate Branthwaite replacement. Nevertheless, a very good signing to bolster the squad with quality and promise over the long term. He may force his way into the First XI as a regular starter at CB soon. He’s done well as an emergency RB but that’s not his long-term position.\nCentre Back (Left)\nYour guess is as good as mine.\nSeems unlikely we’ll be able to spend much money on a fourth centre-back, who won’t play much in any case (unless there’s a serious injury crisis).\nAs with full-backs, there are probably about 25 to 50 players who we could get for this position. A few random younger ones include Phillips (Spurs), Dweh (Viktoria Plzen), Zatterstrom (Malmo) and Traore (Caen). Might get an old head in for free though – like Ben Davies at Spurs who can also play left back.\nDefensive Mid\nIdrissa Gueye\nProbably keep him for another season if he’s up for it. In remarkable shape for his age. I’m not a huge fan of him as a footballer but fair play, he’s doing well this season and still seems to have plenty of gas in the tank for an old fella. Loving his retro shorts also.\nBox-to-Box\nTim Iroegbunam\nLike O’Brien, a decent signing and it was a shame to see his development curtailed by injury. Another with an outside chance of forcing his way into the First XI as a regular starter. That's how it should be.\nHarrison Armstrong will probably continue his development on loan and hopefully come back better for it.\nAttacking Mid\nCarlos Alcaraz (Flamengo) – we’ll presumably take up the option to buy for what now appears to be a bargain price. Well done Thelwell for shopping at source in South America.\nRight Wing/Forward\nDoak (the RS). Could cost about £25m but this should be a sound investment long term. He’s done really well at Boro on loan and is ready to kick on and get games in the Premier League. Suspect that won’t happen at the RS – so maybe we can hold our nose and pay our horrible neighbours the money.\nMight seem a lot for the Second XI but this and the corresponding left-wing/forward position is where we need to invest in genuine talent – because our attacking options are so limited and this position is where goals are scored and created from in the modern game.\nRumours: Akgun (Galatasaray), Weah (Juve).\nMore obvious possible options: Sulc (Viktoria Plzen), Rowe (Norwich / Marseille), Doan (Freiburg), Belloumi (Hull), Bobb (City), Hutchison (Ipswich).\nLeft Wing/Forward\nI don’t think we can afford to make a major signing for both the right and left-wing/forward position. So here are a few options for the other side – but probably as an alternative to Doak rather than in addition.\nMore obvious possible options: Diouf (Slavia Prague), Sainz (Norwich), Zaragoza (Osasuna), Lauriente (Sassuolo), Boving (Sturm Graz), Konstantelias (PAOK), Orjasaeter (Sarpsborg).\nBut really if we were to have Doak, Fellows, Ndiaye and McNeil that would give us a decent blend in any case across the attacking third.\nThere’s a small chance that someone like Ebere or Benjamin might step up from the Academy too.\nStriker\nRicardo Pepi (PSV) – c.£25m.\nPotentially a very good striker (certainly more talented than Beto) – and strategically important commercially given the shirt sale opportunities in the USA. Lots of positives for TFG. He’s had a slow start to his career in Europe but is still very young would come off the back of a strong season with PSV. He also has the style of a Champions League striker – and is not just a physical specimen (like Beto and Calvert-Lewin).\nRumours: Yuri Alberto (Corinthians), Brobbey (Ajax), Igamane (Rangers)\nMore obvious possible options: Bonny (Parma), Emegha (Strasbourg), Gondou (St Petersburg), Barry (Villareal).\nIn all honesty, we’re not really in a good moment for striking talent across world football. These things seem to come and go. I’m not sure any of these players are really better than Beto.\nThe conundrum then is what to do with Chermiti. He has played very little football at a critical time for his development. He probably needs a Championship loan or similar quality overseas to stretch him.\nIf that happens then we also need to bring in a third striker in addition to Pepi (or whoever)\nMore obvious possible options: Ings (West Ham), Machino (Holstein Kiel), Turgeman (Tel Aviv), Ivanovic (Millwall) – being players from the categories of old/free or fairly cheap/random (i.e. sub £15m).\nReader Comments (79)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 20/02/2025 at 15:35:19\nIt's definitely going to be an interesting summer.\nThe overhaul needed is obvious.\nAging players, loaned players and out of contract players all to be determined.\nMy gues would be :\nYoung - not kept\nKeane - not kept\nDcl- not kept\nHarrison - returned\nBroja- returned\nColeman- released (coach role ?)\nBegovic- released\nThe only player above you could argue for keeping would be DCL who I think has probably decided to move on, but Moyes may have an impact on that.\nThe next lot are players who are starting nearly every match so they may fall into an undecided category.\n( not my opinion just what I feel the club may be thinking )\nDoucouré - undecided\nGana - undecided\nLindstrom - undecided\nAlso undecided:\nVirginia - undecided\nAlacaraz- undecided ( likely to stay )\nThelwell said in his interview that it would be evolution rather than revolution, so I'm guessing some players will be offered extensions.\nIt's the ageing sqaud players that need to be replaced with developing younger players.\nI agree that Branthwaite could or more likely will be sold to fund investment and give us that chunk of a transfer budget.\nApart from him I don't see any big moves out, there's only really Ndiaye, mcneil & myko who would command decent fees possibly Garner but I just don't see any of them leaving.\nWe need the maximum for Jarred if he's sold, not 40- 50m more 70- 80m because the rest of the squad are not really commanding much.\nIt needs TFG to invest also, I hope it's not just a case of sales to fund purchases.\nBusy summer !\n2 Posted 20/02/2025 at 17:04:06\nI was very skeptical about Moyes coming back but certainly he has changed things for the better and it could well be that his travels in recent years are paying off with his know how of the Prem.\nThere are still some tough tests to come this season but the players are showing a lot more intensity than they did with Dyche although I still think Dyche is a good manager but a new broom sweeps clean.\nThe future does look brighter and once the dross is disposed of we may see the basis of a great season for 2025/26 with the new owners and new stadium.\n3 Posted 20/02/2025 at 17:19:55\nI'd wager a fiver now on our first eleven lining up at Bramley Moore to look something like:\nPickford\nTBA O'Brien Branthwaite Myko\nTBA Iroegbunam Gueye Mcneil\nNdiaye Beto\nUTFT\n4 Posted 20/02/2025 at 18:45:21\nThat does probably only mean 2-3 players requiring a fee as well as Alcaraz. But of course we do pay for players over 3 to 4 year periods so that could help us too.\n5 Posted 20/02/2025 at 18:55:43\nDCL, Doucoure, Keane, Holgate, Young All Leave and that saves a lot from salaries perspective\nColeman (Coaching role)\nSell - Patterson - 6-7 million, Reece Welch, Mykolenko - 15-20mn\nLoan - Chermiti, Armstrong, Sherriff, Omari Benjamin\nIdrissa Gana - Still got it and can do well with Moyes. 1-2 year contract\nKey signings we can focus on:\n1. Charly Alcaraz (15mn.) - Replaces Doucoure\n2. CB - Back up (on Loan) or small fee\n2. Leif Davis (LB) and Walker Peters (RB / LB) on a free\n3. Juanlu Sanchez as RB - (20-25 mn). Can also play as winger / RWB. Elias Jelert - Cheaper option\n4. Rayan Cherki (RW) is quality and may cost around 25mn. We can sign another promising RW winger on loan\n5. Defensive midfielder - Mangala on reasonable fee is fine but not worth spending 25 million plus on him. We can Loan (Dewsbury hall) or sign long term replacement for Gana - Habib Diarra.\n6. Liam Delap / Thierno Barry / Ricardo Pepi. New striker may cost us 30-40mn\nThis squad could lead us to Europa / Europa Conference league\n6 Posted 20/02/2025 at 19:03:19\n7 Posted 20/02/2025 at 19:05:25\nIt is interesting to read your thoughts on Lindtsroem not being quite what we need despite obvious talent. He reminds me of Leon Osman in that both have/had a knack of striking volleys and half volleys brilliantly on a technical level but the shots were always either to weak to beat the keeper or directed straight at the keeper. The kind of moments that offer promise on a showreel until you realize that this is the sum of their capabilities. So like you I'd pass on the Dane.\n8 Posted 20/02/2025 at 19:08:00\nI always enjoy your insight into the players market and you have started the great debate into who to keep and who to get.\nOne of my big bugbears in recent times has been our acquisition of players that don't score goals and I would like to see this taken account of although I have to say Alcaraz appears to be someone acquired who can score a few.\nI am pleased you have listed HUTCHISON at Ipswich who I rate higher than Fellows and wouldnt mind a tilt at Delap also if Ipswich go down.\nOne thing we should bear in mind is that we can amortize players cost over the period of their contract up to 5 years so assuming most will be on 5 year contracts we can multiply the kitty by up to 5 times so 30k becomes 150k although it would restrict future budgets.\nAlso reading we are interested in Sanchez at Seville. Interested in your thoughts on him.\nAlso no mention of Martin Sherif, Braiden Graham or Omar Benjamin all doing exceptionally well at youth level.\n9 Posted 20/02/2025 at 20:38:47\nI don't expect us to sell Branthwaite, now that it's not a financial requirement. I think the new owners will want to keep our most prized assets.\nI believe Jake O'Brien pushes Tarks to the bench next season. But if Jarrad does go, Jake is his obvious replacement. The right-foot-left-foot thing is vastly overhyped on center backs. To me they are interchangeable.\nI think listing Iroegbunam in the second 11 is bonkers. He obviously needs work on his defensive positioning, but that kid is a starter, and a star.\nAnd I don't think Pepi is an answer for us. Obviously he's a tremendously talented finisher -- even in the easy Dutch league, a goal every 66 minutes is an insane return -- but there's a reason he never starts a game for PSV. He doesn't have the physicality of Beto or the searing pace of Chermiti. And he completely lacks power in the air -- never scores with his head. Plus Pepi actually has zero commercial appeal in the US... Pulisic, Balogun and Weah are the attackers capturing the attention of the American public, not Pepi. (If we do get Weah from Juve, he starts on right wing, end of.)\nInteresting news coverage this week of the very loud impending divorce between Gasperini and Lookman at Atalanta. I wonder...?\n10 Posted 20/02/2025 at 20:45:07\n11 Posted 20/02/2025 at 20:58:30\nI think O'brien and Iroegbunam should have lots of games and long careers with Everton but not expecting them to be nailed on starters next season.\n12 Posted 20/02/2025 at 22:12:10\nA thought. Roma bought Enzo Le Fee from Rennes for €23M then loaned him to Sunderland. He is a winger who it seems can play either side. He has been a real star in the Championship.\nI wonder if TFG might find a way of Roma lending him to us next season. He is a hell of a player.\n13 Posted 21/02/2025 at 00:31:04\nTW is blessed to have quality regular posters such as yourself. Hope the new owners appreciate you.\nAlso hope the new owners can be bothered to update the league table some time soon, particularly as it looks better after 25 games than it did after 23!\n14 Posted 21/02/2025 at 00:41:58\nObviously if that happens, he's gone.\nSo while we may not have to sell him, we may just get a Godfather offer we simply can't refuse.\n15 Posted 21/02/2025 at 01:22:26\nWe are also well stocked on the wings with O'Neill etc. While centre mid looks decent with Mangala, Garner and Tim, a few injuries and we're in trouble. I'd like to see a box to box player there like Ward-Prowse or such like.\nI am assuming that DCL will be gone. Leaving it all down to Beto would be irresponsible so I'd hope we could splash the cash there. I'd love for us to get Toney or Mbuemo from Brentford. Both could hit the ground running. Failing that, why not sort out a deal for Richarlison who isn't getting playing time for a failing Spurs side?\n16 Posted 21/02/2025 at 09:03:39\nThese are tiny sums.\nWhat would a Phil Neville cost now? A 28 year old with (then) about 50 caps for England and a pedigree of silverware. This sort of player might now cost £30m or more.\nAnything below £20m is the bargain bin these days.\n17 Posted 21/02/2025 at 10:04:14\nRobert, as has become expected, detailed analysis to the extreme that would put Rafael Benitez's alleged 3,000 player database to shame.\nI know you've said before that it's all out there, but I still don't know how you do it!! Hats off to you. I don't even know most of those players let alone have I seen many of them play.\nI probably fall into the category of your health warning of not liking transfer speculation. I wouldn't call it that from my perspective, more that I just don't take much notice of it. I can't stand the transfer windows and Sky's frenzied, almost 24/7 coverage, complete with a countdown clock as the window gladly approaches its closure and we can get on with what we've got or end up with.\nBut, great effort Robert. Let's hope we have an active summer with transfers in the areas needed. We have a long list of players out of contract, although I can see one or two getting extended Twelve (or however many it is), is too many to replace in one window, and aside from Armstrong and maybe Dixon, I can't see much making the step up from the U18s or U23s.\n18 Posted 21/02/2025 at 10:14:56\nI would expect to see Lindstrom coming back on another loan. He isn't going to want to go back to Napoli, and he's not done enough for a permanent deal. His mind will be convincing Moyes he's good enough to stick around. Mangala could be a future loan returner, but that looks like Summer 26 rather than January 26.\nPatterson is worth more than £3.5m. Rangers aren't the only show in town, and you could equally see him go to Italy, Germany, Championship, as a return to Scotland. Whatever that looks like he needs to stay fit.\nMy guess he stays as I think hes a Moyes style full back. The situation with Obrien isn't dissimilar to Baines & Lescott years ago, and I could see Patterson secure his place. Baines future was discussed at length before he took the position, and look what happened after. If it's £3.5m you may as well keep him another season if his body is up to it, and sell with a year left on his deal if Coleman and Young are done.\nA hard decision will be Branthwaite. This could unlock maybe 3 or 4 deals, and that will be judged on its merits. I love him, but let's be honest we've sold players far better than him down the years, and that's not going to change if he wants out.\nMykolenko ideally would be retained, but his book value is low and he has 1 year left on his deal. £10-15m psr boost might be taken for a player that's not 100% convincing.\nMcneil probably fits that category as well if Alcaraz impresses. Ndiaye, Alcaraz and a new right winger would leave Mcneil as back up in admittedly squad game. Despite the toffeweb protests, the opportunity to upgrade the players under psr limitations, then I think he will be sacraficed over the next 12 months if it throws £20m into the psr calculations and same in cashflow.\nMoyes will bring some emerging players like an Alcaraz, he will use the loan market, he will bring some out of contract players - but on sensible wages, and he will bring in players that are unloved or unheard of (big Dennis, Mc bride, Castillo) to bulk it out.\nGana, Doucoure, Young will be retained.\nBroja, dcl, Holgate, Mangala, Keane, Coleman, Harrison will be released.\nWith relegation worries eased, he can properly look at the squad and start scouting & setting up deals for the summer. That's a great position to be in, instead of sweating on it in May, and not knowing who the long term manager is.\n19 Posted 21/02/2025 at 10:17:59\nThen consider the effect of those with longer term injuries being fit and available next season such as Chermiti and McNeil. I'd expect Harrison, Broja loans to be terminated and while I quite like Managala I couldn't agree to a 25M or 33M transfer fee and the seriousness of his injury. I'm still out on Lindstrom but much would depend on the fee, 5-10M yes but more would depend on who else is available at the price.\nI'd like us to keep Virginia but if he decides to leave could Begovic fill in for a seson if Pickford became an injury concern and what of the younger highly considered keepers albeit there will be the chorus that keepers need to be experienced.\nI suppose a lot boils down to how small a squad could you get by with for a season, is 25 the minimum or just the preferred number?\n20 Posted 21/02/2025 at 11:46:21\nI think we should be looking to sell from a position of strength. Yes it may not be a necessity to sell this year, but that also strengthens our position.\nWe seen Levy come and nick Richarlison when we were desperate.\nThe lads likely to leave, the Euros coming up will be on his mind.\nI wish we are in position to keep him, but we need to get the best possible deal for the club, and have our targets negotiated before other clubs see us take in the big fee.\n21 Posted 21/02/2025 at 16:31:20\n22 Posted 21/02/2025 at 16:33:43\nDavid, Levy didn't \"nick\" Richarlison. He paid us a rich £60m bounty for him, and his return has been 14 league goals in three seasons. Try and find a Spurs fan who doesn't think we skinned Levy alive on that deal.\n23 Posted 21/02/2025 at 16:40:33\n24 Posted 21/02/2025 at 16:54:25\nIf you can get more than that, then there's even more of a reason to sell. His book value is about £4m, so with PSR continuing another season, would represent away to increase our wiggle room.\n25 Posted 21/02/2025 at 17:16:36\nAnd maybe ours that you think need loan experience could go the other way, would they get the necessary experience?\n26 Posted 21/02/2025 at 17:27:36\n27 Posted 21/02/2025 at 17:45:33\nTransfermarkt has him valued at about £24m and I think that's about right.\n28 Posted 21/02/2025 at 17:58:35\nA few players that I think we should be looking at domestically are Chukwemeka, Acheampong, Hutchinson, Harwood Bellis, Cirkin and Vata. They are all players I really like.\nSome of the more popular players like Davis, Walker Peters, Dewsbury Hall and Ward Prowse I would be vehemently against and believe that they are a downgrade to what we already have.\nThe interesting point needing addressed first is about who will be responsible for carrying out the squad overhaul. Previously it seemed Thelwell would be on his way out with Lindstrom, Beto and O'Brien used as sticks to beat him with.\nConsidering there have been some failed attempts to sign excellent players previously scouted such as Kudus, will the powers-that-be view the deals Kevin has produced including Alcatraz now force a rethink upstairs?\nI like others don't see the changes Robert you are envisaging with Mykolenko definitely getting a new deal, some out of contract players signing on revised wages and loan players returning like Harrison did to my mind. I would imagine we will try to keep Branthwaite until after the World Cup as the player will want game time with us that in that preceding year and the club will want to maximise their selling capacity.\nI could see a net spend of about 50million with increased income and a few bodies out and us maximizing the 4 loan positions once again.\n29 Posted 21/02/2025 at 18:30:20\nBut I can't see there being a queue of clubs willing to pay EUR 30m for him. Those european clubs just don't pay that for a stay at home left back. And if there is, great, that's £20m clean Psr profit if we decide to sell.\nI did say I'd let him fight it out with another left back, but my reading is that won't be possible, and if psr is a constraint on what we want to do, we have few assets to realise.\nMy preference would be to sacrafice mcneil and Mykolenko, if it meant we could improve elsewhere and potentially retain Branthwaite.\nAfter a long slog, we need to keep our best players and build from there.\n30 Posted 21/02/2025 at 19:57:11\nWe're not going to able to upgrade every position in one window - this is really the start of a 2 to 3 year project of overhauling a bottom half quality squad.\nWe need to be aiming to get to a position where our bench is stocked with the likes of O'brien, Garner, Iroegbunam, McNeil, and Beto - with much more talented players in the First XI.\n31 Posted 21/02/2025 at 20:16:49\nBesides, more so now, it's a squad game once injuries and suspensions kick in. Or who we're playing and what formation the manager wants to use for certain games.\nI don't think it's a case being prescriptive.\n32 Posted 21/02/2025 at 20:26:54\nBesides, more so now, it's a squad game once injuries and suspensions kick in. Or who we're playing and what formation the manager wants to use for certain games.\nI don't think it's a case being too prescriptive.\n33 Posted 21/02/2025 at 23:26:59\nI think you're undervaluing Mykolenko.\n34 Posted 22/02/2025 at 01:34:02\nThe top player prices dwarf all others because mainly the clubs buying them are paying for proven excellence / reliability to fill a particular hole in their already star-studded first teams.\nFor that reason, I’m hoping we won’t need to cash in on Jarrad. It will take a few seasons of clever dealing but eventually we could have him gracing the BMD turf with a full team at his level.\nI am also with Mike G, regarding Tarky and Jake O’Brien. I think Robert is too lukewarm on the youngster and whilst it may not be a case of ‘the king is dead, long live the king’ I don’t think any of us should fret if Tarky eventually needs a bit of a break.\nIf Charly continues to impress and Orel Mangala makes a full recovery I’d be happy for them both to be signed. I know we have something already set up for Charly (looks like that might be a bargain?) and had thought we had something similar for Mangala (though I presume the injury null and voided that). However, he is much less of an unknown quantity and maybe something similar would still be possible?\nIf they haven’t played for us I’m generally guessing. However, I’ve seen some Southampton coverage recently and not been overly impressed with Walker-Peters. It was similar with Max Aarons : plenty of people were blown away when I thought I could see big flaws. Tariq Lamptey will not be stopping any opposition from converting headed chances and generally our fans find that unforgivable behaviour for a full back.\n35 Posted 22/02/2025 at 05:03:44\nRe Nathan: I would very much preferred him going on loan to a Championship Club (preferably another Premier League Club, of course) than back to the Rangers. Looking at the god-awful bottom half of the Scottish Premiership (which, IMHO, are League One Clubs at best), I would reckon that even if Rangers will have either Champions League or Europa League Football to offer, the gap in competitiveness between the Championship & Scottish Premiership is simply too big. Time is not on our side to rehabilitate Nathan as a player and an eventual asset to be traded, so the competitiveness in those minutes next season will be utmost critical.\nWould be glad to have your & others' thoughts.\n36 Posted 22/02/2025 at 05:34:22\nStill, there are a lot of positions to fill with a small squad in contract beyond the summer. Moyes said yesterday that there will be lots of players out of contract this summer so we can expect a few Josh Brownhill type squad fillers I expect.\n37 Posted 22/02/2025 at 06:13:45\nIt would be odd for the new owners to buy the club but not invest significantly in the one part of the business that is guaranteed to increase commercial revenue - the first team squad.\nThe exit of players like Doucoure and DCL also presents significant opportunity in terms of wage restructuring.\nTFG will invest in the first team squad this summer as that is what any sensible business owner would do after an acquisition. It won’t be dramatic, but it won’t be dependent on the sale of Branthwaite.\n38 Posted 22/02/2025 at 06:29:11\nMykolenko alone has played almost 100 premier league games and, at the age of 25, is an asset that will improve. Patterson has had injury issues, but he is 23 years old and has been capped 21 times for Scotland. Try £35 million plus for the two and you will be closer.\nThank goodness Robert and some other posters are not negotiating our player sales.\n39 Posted 22/02/2025 at 06:48:42\nThelwell has targeted Mohammed Kudus, Morgan Gibbs-White, Anthony Elanga, Kim Min-jae (now at Bayern Munich, Yankuba Minteh, Nicolas Jackson, Viktor Gyokeres and then Rasmus Hojlund during his stint with Sturm Graz. Unbelievably, it was the decision on Moshiri and co that we should sign Neil Maupay rather than Gyokeres and Hojlund as he was tried and tested in the premier league.\nAny these deals would have represented value if we had the money to ge them over the line. That won’t be a problem in the summer.\n40 Posted 22/02/2025 at 06:49:18\nAnything worth having in the Burnley defence, right or left back, given that they have conceded 9 goals in 34 games and have lost fewer games - 2 - than anyone else?\n41 Posted 22/02/2025 at 07:36:08\nExcellent and enjoyable article Robert thanks, I love a bit of transfer speculation. The rebuild job is enormous, start with Gana on a yr extension. Loan's that might be possible good shout above from someone saying Tammy Abraham from Roma and Le Fee. Failing Tammy, I think Igamane would be a good value signing.\nI'd love us to go for Dewsbury-Hall on a permanent contract but I don't think its the priority assuming we sign Alcaraz and if Moyes fancies Tim once he's had a proper look at him. Same goes for Rigg of Sunderland or even Jobe Bellingham.\nSo for me, the above suggestions along with permanent signings for Fellows, Walker-Peters (with Patterson being sold) a young back up to Myko and a promising CB to replace Keane (maybe the young lad from Peterborough has been touted?).\nI don't think this is an unrealistic wish-list and entirely achievable. I'd like us to get Thelwell's contract sorted or his replacement lined up soon and hit our business early, this is Everton though.\n42 Posted 22/02/2025 at 07:36:24\nI think we'll have a net spend of about £30m or so. Sam thinks £50m. Neither are big sums. You seem to expect significant investment - so what sort of figures are you talking about? £200m(+) like Brighton or £150m(+) like Ipswich?\nPaul # 40, there's lots of talent in the Championship but much will depend on who gets promoted. I mentioned the rumours to Neil and Esteve - and Doyle who is on loan at Norwich. Chris Rigg is the star but will almost certainly join a Champions League club.\nSi # 34, I don't think anyone sees Walker-Peters as brilliant. His most attractive quality is that he's free. Unusually for a player of some quality and experience in the Prem he's\ngood value. We have been abysmal at RB for many years apart from a few cameos from aging Seamus. Walker-Peters is a step up. We can't get top quality in every position so he'd be a sensible signing for the rebuild.\n43 Posted 22/02/2025 at 07:41:13\n44 Posted 22/02/2025 at 07:49:55\nTom Felows, 21 years of age, 13 goal involvements in 34 matches.\nChris Rigg, 17 years of age. 5 goals already and very highly rated.\nEsteve 22, part of a super efficient Burnley back line.\nCallum Doyle, left sided centre back and 21. On loan from City to Norwich, but looks they aren't Premier league bound.\nI could see Moyes looking at some of those Celtic players Ange brought in from Japan. They're all in the now or never move to the Epl, learnt some english/settled and would not be too expensive. Tim Howard has commented that Moyes likes the low trouble / worker bee type and I would have thought Maeda & Hatate would fit that bill.\n45 Posted 22/02/2025 at 08:07:05\nHe's now 4th choice RB behind a 6ft 6 CB, a 39 year old utility player and a 36 year old. Possibly 5th choice if you take account of Dixon.\nI don't know why we would be sentimental about this guy. Ship him out and move on - he's never going to develop on the bench.\n46 Posted 22/02/2025 at 08:14:41\nBefore he was injured, Moyes was subbing him on in each game. And he was performing.\nWe can't possibly sell the only senior right back under 35 at the club.\n47 Posted 22/02/2025 at 09:57:01\nI wouldn't touch Burnley by the way. I know a few on here have friends and family who watch them, but from the limited of what I've seen, Dyche may have gone, but his mark remains.\nI don't know if there is anything decent in the probably to be relegated teams. Just don't buy any Leicester defenders!!\nThere is nothing wrong with shopping in the Championship or lower, but I hope the scouting network is cast further. It seems to be with the likes of Ndiaye and Alcaraz to name two. I suppose the rejuvenated Beto fits that category as well.\n48 Posted 23/02/2025 at 08:50:26\nAnyway, because I can't comment on the match thread yet I thought I'd have another look at this thread instead as a distraction.\nI agree with those saying keep Mykolenko, I quite like him and he is a Moyes type player. Whilst I'd hope we get better in the long run, we have so many positions to fill; I would recommend giving him a contract extension and sign a promising left-back to compete with him. I don't believe we'd get anywhere near to £20M for him… and what would his replacement cost?\nO'Brien and Tarkowski to compete for the slot alongside Jarrad next season, healthy competition.\nThinking about it, Robert, I think you are underestimating the level of summer investment TFG are going to make… I bloody hope so anyway! Both Moyes and Thelwell have been quoted as saying there is money available in the summer and neither implied it was limited, if I recall.\nThat said, I would be cautious about blowing £100M. I would like to see calculated investment and a robust plan for squad improvement.\n49 Posted 23/02/2025 at 15:52:29\nHarrison Armstrong, currently with Derby will return hopefully having had some valuable match experience. Goalkeepers, Harry Tyler and Billy Crellin play regularly for their loan teams in Divisions 1 and 2. And finally I think young Dixon is worthy of consideration as he is extremely quick and has something extra about him.\nFor my money it's good to see our young players on the bench, hopefully this will give them all encouragement and open a pathway into the senior squad.\n50 Posted 23/02/2025 at 16:40:59\nAs for the youngsters, David # 49, I think Armstrong probably needs another loan next season - he's not getting many minutes at Derby just at the moment which suggests he needs some more time to develop. That's fair enough - he's only just turned 18 after all.\nAs for Dixon, it's really tricky. He possibly is good enough to retain as a stand-in, but he could get fewer than 5 games for us next season. Not ideal for someone who will turn 21 later this year - and who will now learn absolutely nothing from u21s football (the standard is so low he could even go backwards). Probably better for him to also go out on loan, hopefully in the Championship, to see whether he has the makings of Premier League footballer.\n51 Posted 10/03/2025 at 08:06:15\nI think the figure of £25M quoted in the press is too high given he has scored just 9 goals in a Mickey Mouse league. However, he is young, hungry and looks like he could become a real player.\nHe looks alot like Illiman when on the ball, I'd be really interested to see them link up together with McNeil and Alcaraz, we could really have the green shoots of a dynamic forward line there with relatively little outlay (£15M for Alcaraz and say £18M for Igamane). Interested in others thoughts.\n52 Posted 10/03/2025 at 08:29:58\nI personally don't get into the whole transfer guessing thing. I sometimes see a player who instantly catches the eye, like Marcel Sabitzer did when I went to watch Schalke play RB Leipzig in 2021. We would have had no chance but he was quality and tore poor Jonjoe Kenny a new one that night. Some players, you can tell straight away, others, you need to watch them several times.\nUltimately, us mortals can speculate, guess and suggest who we'd like to see at the Everton Stadium. But that's down to the Head Coach and whatever is going to happen with the alleged recruitment specialist being rumoured or any future DoF.\nI don't recall anyone shouting for Ndiaye or Alcaraz prior to them arriving. Simply put, we just don't know and our guesses are usually off the mark.\n53 Posted 10/03/2025 at 08:58:58\nI have got many wrong too and of course, YouTube gives a false impression. However, there are two different approaches to transfer uncertainty, some who don't see the point and only get excited when they are holding the shirt for a picture.\nThen there are those who spend a lot of time ruminating about the possibilities out there which could enhance us and change our fortunes. Ever since I was a kid, I've done the latter and love a transfer window. I am putting faith in Moyes to get this right.\n54 Posted 10/03/2025 at 09:03:48\nThere is a really long list of failures across lots of clubs.\nIgamane looks talented and might be the man. But it wouldn't be a huge surprise if he plateaus out as a c. 8 to 12 goal player.\nAs we've seen with the likes of Nunez and Hojlund recently, you can spend over £70m and still fail.\nEvan Ferguson is not having a good time of it thus season despite obvious ability.\nOur notable (only?) successful striker purchase in the Premier League era is Lukaku. A teenager billed for greatness since he was about 15 who was hitting very impressive goal returns at 19 in the Premier League with WBA. He was also a physical beast.\nWhat would such a player cost today?\nMinimum £70m I would have thought.\nTrying to find someone of this calibre for about £25m or less will be very hard indeed.\nOur better option may be to show patience with Beto while we develop a few talented young strikers bought young and / or from cheap markets.\nIndeed Braiden Graham and Chermiti might be part of this.\n55 Posted 10/03/2025 at 09:12:59\n56 Posted 10/03/2025 at 09:19:26\nWith this squad, I can't see us ending up any higher than 15th (16th more likely).\nI'll take that with both hands, after the Moshiri - Kenwright - Dyche nightmare, but we do need to rebuild with quality over quantity.\n57 Posted 10/03/2025 at 09:49:10\nI can see Harrison and Lindstrom being let go and Beto and Chermeti used as back-up strikers. I think we will probably start Ndaiye out wide but we will also have the opportunity of playing him in the 10 role.\nObviously we aren't renewing Doucoure's present contract and unless he agrees to play for a lot less money I can see him being allowed to go as will Michael Keane and Ashley Young.\nThis will free up money for some incoming players. I also think we need more competition for our goalkeeping spot.\n58 Posted 10/03/2025 at 11:14:29\nI used to speculate a lot and when I was still playing Football Manager (I've retired now), the first signing I always tried was Kanchelskis. In real life, I was made up when he signed unexpectedly. Probably the last truly top drawer signing we made in my opinion, depending on which side of the fence people sit with Lukaku.\nI'm not a fan of the transfer windows, but they're not going anywhere soon.\n59 Posted 10/03/2025 at 12:50:13\nAs opposed to the woeful Thelwell and the massive list of his underlings and scouts (YES!!! WE HAVE SCOUTS !!! and quite a few) who have failed to recruit to an acceptable standard.\nNot only that but improve the awful academy and prospective stars of the future.\nFact :\nNot one player in the first 21 \"TOP GOALSCORERS\" in the PL.\nNor any likelihood to have.\nBear in mind that number 21 has 7 PL goals.\nSelling Branthwaite is a nonsense.\nReducing the wage bill by vast amounts with getting rid of the recruited failures and out of contract duffers will free a significant kitty to hit the out of contracts as described.\nKeeping Branners, OBrien (1 of the few thelwell successes) is and must be seen as building blocks. With Jordan behind them.\nWe are in a situation where we have\nNO full backs.\nNO wingers\nNO Strikers\nNO CM\ndespite the Thelwellians saying he is great and should stay.\nWe are virtually an entire team short of quality.\nHis record is crap.\nAnd people want to trust him to recruit quality from any proceeds of a Branthwaite sale.\nHe has proven beyond any reasonable doubt that those funds would be wasted. We would end up with sub standard as has frequently occurred.\nHe has failed to find any player who can score more than 7 goals.\nIts my understanding Gueye has been offered a 1 yr extension.\nI hope Doucoure (who hasnt) moves on.\nWith Cant-Score, Self Harm(Broja) and the likeable but poor Beto requiring replacing, this should be the priority.\nThe financial unfair play rules are about to change. AGAIN !!!\nAND with BMD open our FFP margin should be rising. Albeit it might take a season for it to count.\nThere may be fallout and an offload of players when or if City ever get punished.\nPlus with almost all of the pl's fave top 6 clubs being financially in the shit and having to admit it, some of their players may be moved on starting a merry go round\n60 Posted 10/03/2025 at 13:24:13\nYou say, “ the woeful Thelwell” who is ‘crap’\nThis is the Thelwell who oversaw the departures of Richarlison and Gordon for a combined €110 million, as well as the Onana deal for another 60, facilitated the Dobbin/Tim swap, got €26 million for Iwobi with a year on his contract and refusing to resign, and binned off a bunch of youth players for inflated prices when we needed cash.\nHe signed McNeil, Garner, Alacaraz, Lindstrøm, Gueye, N'Diaye, O'Brien, Beto, Chermiti and Tarkowski for a combined 100 million, all of which are married to the first team.\nThis is also ignoring the shed loads of cash being drained by dead wood that Kev saw out, compared to Brands' philosophy of trying to get the most value of what we had and avoid losing players for free (think Holgate's 5 year extension. OK Maupay was a dog and people will point to Simms and Dobbin and claim we should have kept them, but we got decent money for them and the juries out as to whether or not they will ever make the step back up to the Premier League.\nI think he’s done better than many posters on here claim. As for not bringing in a striker, half the Premier League are looking for a striker, even Arsenal failed.\n61 Posted 10/03/2025 at 14:16:21\nFully agree, well said.\n62 Posted 10/03/2025 at 14:20:36\nThis sort of thing is driven by data and technology - see an article I wrote a few years ago called Air Blocker Filter Man which talks of the ever more sophisticated use of data.\nOverwhelmingly our biggest problem is not access to data - the Everton scouts etc know everyone I know and more - it is money.\nDuring the Premier League era we have not been able to compete for the best players (fees and wages) and since Moshiri pulled the plug we've struggled to compete for any players - hence losing out on the likes of Philogene to Ipswich.\nSo we are getting players who are available to us given a very limited budget (the smallest in the Premier League for the past 4 years) - rather than the players we specifically want.\nCould we become more imaginative. Totally and with lots of bells and whistles besides. I've written articles in this too - about how the likes of Leverkusen and the RS have buolt up exceptional squads without top tier budgets. But money remains the biggest barrier to us.\n63 Posted 10/03/2025 at 14:30:48\nAt present we have maybe 6 or 7 quality players when fit in our first team squad.\nWe probably won't be able to buy more than 3 players( maybe 4 if we are lucky) of the right standard but they will make a massive difference.\nWith good scouting there is no reason why we can't improve the squad more.\nJust for starters two fast attacking full backs and a striker with composure would totally change the dynamics of the team. After we have those additions we can look at other positions.\nWith regards to Thelwell I think he did a good job under difficult circumstances.\n64 Posted 10/03/2025 at 16:28:33\nWe lost Richarlison, Gordon, Onana, Dobbin for Lindstrom, Harrison, Young, Maupay, Chermiti, Beto etc.\nWhat have we got position wise ? As people on here repeatedly say we need virtually every position filling.\nAs you have said Ray. He got rid of the deadwood. Thats his job. He has done his job moving poorer players on. So forgive me if I'm not enthused.\nSelling good players for nothing in return.\nNdiaye and Obrien being exceptions.\nNo player at Everton can reach double figures scoring.\nYou guys clearly see that as success.\nAs for DOF.\nIts a position that has not produced nor assisted Everton. In fact that reverse.\nAll 3 DoF have to take responsibility for the clubs on pitch failings.\nAs for the use of data etc. of course that is a tool to assist.\nBut anyone can make figures look good cant they. Ask Mr Dyche.\nIf Evertons view of recruitment is sitting behind a computer and clicking on figures to buy the next player and not watching them over a period then I don't see improvement.\nAcademies lose many youngsters each year who havent made the grade\nOurs is so good we have two gks on the bench and a midfielder from it, who was keeping a seat warm, out on loan. No one likely to hit the first team.\nIf Thelwell had done a remarkable job, in fact a good job, id be singing his praises. But the reality says different\n65 Posted 10/03/2025 at 16:49:08\n66 Posted 10/03/2025 at 16:51:56\nWe don't know what goes on behind the scenes but we pretty much guessed. He was operating under constrained circumstances beyond his control and probably being told to arrange to sell those players you mention and then have to replace them on a limited budget.\nHopefully those days are over.\nYou left Alcaraz off your list and bringing back Gana Gueye. James Garner has potential.\nRestructuring the academy as seeing the fruits materialise can take several years. Not something that happens overnight or even in one or two seasons.\nNo need to ask for forgiveness. It's your view. Many would have walked realising what they had walked into. He gave it a go and stuck with it.\nThe failings of Everton in recent seasons go beyond to DoF and I stopped blaming managers a while back. Apart from Dyche's last few months, when change was needed.\nLook upstairs and in the Directors Box for where the poor running of the club for decades has resulted in the situation we found ourselves in.\nFortunately, I'm feeling more optimistic than my usual self for what lies ahead.\n67 Posted 10/03/2025 at 16:52:10\n68 Posted 10/03/2025 at 17:06:07\nDobbin? Please. Thelwell got £10m for a guy who has scored 2 in 27 in the Championship this season. And you consider him a \"loss\"? Want to bet Chermiti turns out better?\nWhy the club aren't keeping him is clearly because the new ownership is committed to a non-DoF model of operation. Roma doesn't have one. They have a technical director and a director of development, but no DoF role.\nAnd you have no idea if other clubs are lining up for him. I'd bet you that he won't be on the beach long.\n69 Posted 10/03/2025 at 17:33:59\nI think it would be a big mistake to make wholesale changes all at once to this squad and would prefer a progressive plan to improve quality and goalscoring ability.\nI also think it would be a mistake to let Jarrad go at this point because players with his quality don't come around that often and we should have enough in the kitty to provide for the necessary year 1 improvements.\n70 Posted 10/03/2025 at 18:24:04\nFrom the start around 30 years ago I warned of what would happen. It did. I am not pleased to have been proven correct.\nThis thread is not about that. Hence my not feeling the need to include it.\nEverton have also regressed under the present structure that has a DOF.\nNone have done well.\nThe playing staff is far from what it should be, arguably could have been without a DoF. We will never know.\nI am pleased this failure is being binned.\nMike you have missed the point.\nIm talking of players out to the quality in.\nDanny if you want to start a names game I raise you\nVinagre & Danjuma.\nMike, a little wager on your last paragraph perhaps. As stated I am talking of successful or reasonably regular higher placed clubs or ones with money to burn.\nAs for the Roma model Mike, FSG call it a Technical Director of Football. Here is the JDQ :-\nmaximising football clubs' annual revenue\nsetting revenue targets for different operations, such as ticket or merchandise sales\nnegotiating annual player transfer and wage budgets with owners and first-team coaches\ndeveloping the club's playing style and coaching culture\nrecruiting players and managers whose football skills fit the club's sporting culture\nnegotiating in-bound and out-bound player transfers with other clubs\nagreeing on shirt and stadium sponsorship deals with brands\nsetting up academies to develop young players\nforming local or international scouting networks\nmanaging relations with sport media\nanalysing commercial performance\nfining players for breaches of contract\nFlorent Ghisolfi is Roma's TDoF\nAnyway. We beg to differ re Mr Thelwell.\nBut not about our LOVE of Everton\n71 Posted 10/03/2025 at 19:56:05\nGetting rid of Iwobi was masterful even though the little sod is now unrecognisable at Fulham.\n72 Posted 10/03/2025 at 20:17:01\nNo name games here Martin, but you can have Kroldrup and James Beattie. For every success, there is one that doesn't come off.\nEvery transfer, regardless of the name, is a gamble. Some work out, some don't.\nI'd go a bit further back than 30 years. The steady fall from grace started after our last league title. Thats nearly 40 years away. Bar a few spikes, since then, we've gone from top to near bottom. Thelwell was nowhere near the club until 2022.\n73 Posted 10/03/2025 at 21:01:49\nNot Thelwell or anyone else.\n74 Posted 10/03/2025 at 21:11:35\nI meant the Thelwell ones. We could sit in a pub for hours to humiliate ourselves with the shite this club has wasted so much money on.\nGlen Keeley. One of our first loan signings. Shocker.\nI agree 100% re the decline. Post *****. We never got our mojo back.\nThen lost respectability. Scraped by through the early Premier League years. Then Kenwright arrived and ensured our place in Horrible Histories\n75 Posted 10/03/2025 at 21:20:11\nYou're right we could talk all day in a bar about it.\nHopefully we're back on the right path. I'm confident we are. All we all want is for our team to compete and be successful.\n76 Posted 10/03/2025 at 21:42:51\nEmergency loan signing days before the derby, clearly unfit and thrown in the deep end. Felt sorry for the bugger, I did (but only on reflection years later).\n77 Posted 10/03/2025 at 21:45:37\nWith regards Mykolenko, theres only 5 other teams conceeded less goals than us, I think he's well worth keeping\nDoucoure is a keeper also if he will agree a smaller contract.\nPatterson seems too injury prone, so I would sell him.\nEven though our defence has done well, I've not been overly impressed with Branthwaite this season. I think we will struggle to get much more than £50M.\nI liked the look of Chermiti before his injury so I would hang onto him, Alcaraz is a no brainer as is Ndiaye, Mangala was just starting to play well before his injury so keep if we can find the cash.\nWe need another striker to support Beto if Champions League leaves which seems likely.\nHarrison is a Moyes type of player so the jury is out there.\nMoyes has got a good tune out of our current players so I wouldn't be in too much of a hurry to replace too many.\n78 Posted 10/03/2025 at 21:49:28\n£20M or less for a single player is bargain bin these days and bottom-half / small clubs are routinely spending £20m to £40M on players.\nThere are strategies to address this (which I won't labour again) but even so the higher our spending, the better chance we will have of bringing in quality players – and quality squad depth.\n79 Posted 10/03/2025 at 21:53:35\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 10142,
  "scraped_at": "2026-02-14T01:52:15.334115",
  "_text_extracted": true
}