{
  "article_id": "01acbb518922",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-inter-presser",
  "title": "Every word from Arteta pre - Inter presser | Press conference | News",
  "date": "20241105T221500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta said ‘his blood is pumping’ as he anticipates Wednesday night’s Champions League clash with Italian giants Inter Milan at San Siro.\nThe manager also spoke about outgoing sporting director Edu, the latest on Martin Odegaard and Declan Rice, Saka’s captaincy and he also had a message for our supporters.\nHere’s a full transcript from his press conference in Milan…\non his reaction to Edu leaving:\nEverything happened very quickly. Obviously I loved working with him, I really enjoyed being alongside him on this incredible journey. From day one we’ve been together. First of all I’m very grateful personally for everything he’s done for me, and for the amazing work he’s done for the football club. I think we both had this special chemistry, working together, we really both enjoyed our roles and working together.\nI’m very blessed he’s been part of my life in such a beautiful place that I am right now, managing this amazing club and he’s been a massive part of that. He’s got an amazing opportunity now to do something else, in a different role and he believes it’s the right professional move for him. We have to respect that, and from the bottom of my heart, everybody really feels that we want the best for him.\non supporters' concerns after Edu’s departure:\nThe plan and vision that starts with ownership is very clear and very ambitious, we are going to continue. We have a very strong leadership team, with unbelievable know-how, real passion and great feeling for the football club. We are not going to stop where we are at the moment. Across the club [there is] excitement, passion, and understanding of where we want to take this journey remains intact. That means opportunities for somebody else to come in, to fill that role. There are people that Edu has brought alongside him on this journey which is always very important, and we move on. We say ‘thank you’ and we have to move on because that is the reality of our industry.\non Odegaard and Rice:\nThe positive news is it’s great to have Martin back. He’s trained with us for the first time, a full session today. He felt good, it’s a bit earlier than we expected, but he wanted to be with the team, so we’ll decide tomorrow whether we use him, but at least it’s a big step that he’s travelled with us and is part of the team. Declan unfortunately has picked up an injury against Newcastle. He was able to finish the game but he wasn’t feeling good in the last few days so we have to assess him on Thursday to understand whether he will be fit or not for the weekend.\non whether there is pressure to win this season:\nMy blood is pumping. This is the kind of game that we want to play. To come to Milan to play Inter, two years ago they were in the final of the Champions League, they won the Scudetto last year so to come here and show the team that we are right now and the ambition that we have. These are the games we want to play, that’s for sure.\non the pre-match period of silence for Valencia:\nIt’s great [UEFA are doing that] because we need a lot of support. We need noise around what happened because the situation has been extremely difficult for a lot of families, a lot of people, especially these difficulties are going to continue for months, so that support is going to have to be consistent. The more aware we make people, the better, because the more help and support they are going to get, so we thank them for that.\non Jakub Kiwior’s involvement and what he has to do to play more:\nEspecially with all the qualities that he has and when puts them at the service of the team, that’s it. When he has the opportunity to play those minutes and show that he’s got the level that we think he has to help us perform and win football matches, that’s it.\non whether this is a test of character for the club:\nWith everything we’ve been through here in four or five years, what a great place we are in because we’ve been with problems of all kinds. We are in an incredible moment and we are blessed to be where we are. We’re going to play this competition, we’re going to play 70 games, we’re going to have injuries, we’re going to have defeats like many other teams and it shows where we are and then how good we’re going to be to react and be ourselves and tomorrow come here to win again.\non how his team is seen in Italy:\nI don’t know. It’s obviously the opinion of all the managers, if they see us in this regard. We see ourselves as well as a very strong team that can compete with anybody and it’s time to show tomorrow that we are at our level and we can come here and beat them.\non Simone Inzaghi and Inter Milan:\nI think they have a really clear idea and identity and that for me is the biggest strength of Inter and that’s full credit to the manager. He has some very specific ideas, especially in ball possession, the way he moves the position of certain players to occupy different spaces and this makes it tricky and unpredictable. But to be fair, we face in the Premier League a lot of tactical issues that we have to resolve and hopefully tomorrow we’re going to do that as well.\non why he likes Saka as captain:\nEspecially the way people look at him. People admire him, people respect him. People want to be next to him. He’s got this capacity to inject this positivity into people, a very particular way of smiling and transmitting his energy and he’s one of our leaders right now. He’s come all the way from the academy, he’s one of our biggest talents, biggest players, no question about that. He’s got that status in the team right now.\non his message to the supporters after Edu leaving and defeat to Newcastle:\nIn moments when you have a defeat or two or certain news that nobody expects, like we’ve always done we stick together with positive energy and move forward. This is part of football and we have to be very strong and that’s what we’ve done. We’ve come a long way with that, so stick together.\non being in Italy:\nIt’s certainly a privilege to be here and I’m fully prepared for the game that we’re going to have to play against the opposition we’re going to be facing. I love the culture, I love languages, and different ways to communicate with the world, especially with our players and staff.\non Declan Rice’s injury:\nIt was a knock so it’s a problem with his foot. He wasn’t comfortable with it so at the moment he’s not fit.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1204,
  "scraped_at": "2026-02-14T02:26:24.530692",
  "_text_extracted": true
}