{
  "article_id": "01b4673e7b9a",
  "url": "https://punchng.com/explainer-why-var-ruled-out-alvarezs-penalty-against-madrid-in-ucl-thriller/",
  "title": "EXPLAINER : Why VAR ruled out Álvarez penalty against Madrid in UCL thriller",
  "date": "20250313T111500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Controversy erupted in the UEFA Champions League Round of 16 second-leg clash between Atlético Madrid and Real Madrid after Julián Álvarez’s penalty was disallowed following a VAR intervention.\nThe decision, which played a pivotal role in Atlético’s elimination, sparked outrage among fans, pundits, and even Atlético’s head coach, Diego Simeone.\nThe penalty shootout, held at the Metropolitano Stadium on Wednesday night, had reached a critical juncture when Álvarez stepped up to take his kick.\nHowever, what seemed like a legitimate goal at first glance was dramatically overturned after video analysis revealed an unintended double touch, leading to an indirect free-kick in Real Madrid’s favour.\nSimeone: ‘Raise Your Hand If You Saw It’\nAtlético Madrid manager Diego Simeone did not hide his frustration after the match, openly questioning the controversial decision.\nSpeaking at the post-match press conference, he challenged the legitimacy of the VAR ruling, suggesting that even those closest to the action had not noticed Álvarez’s alleged double contact.\n“Raise your hand if you saw the ball move twice,” Simeone said, addressing the media with visible frustration.\n“We can watch the replays over and over, but who in real-time actually saw it? These are the kinds of moments that change games.”\nThe Argentine tactician, known for his passionate and defensive style of play, further suggested that the decision favoured Real Madrid, a club that has benefited from contentious VAR calls in past European fixtures.\nAtlético supporters echoed their manager’s sentiments, flooding social media with claims of bias and what some labelled a “historic robbery.”\nWhy Was Álvarez’s Penalty Ruled Out?\nAccording to UEFA and the International Football Association Board rules, a penalty taker must make a single clean strike when taking a spot-kick.\nIf the ball is touched twice before another player intervenes, the kick is considered a violation, and an indirect free-kick is awarded to the opposing team.\nReplays showed that as Álvarez struck the ball, he lost balance, leading to an accidental second touch with his standing foot.\nAlthough the ball still found the back of the net, Real Madrid goalkeeper Thibaut Courtois immediately appealed for a double contact.\nVAR official Pol van Boekel reviewed the footage and confirmed that Álvarez had indeed made two touches in quick succession—one with his right foot and an inadvertent follow-up with his left.\nAs a result, referee Szymon Marciniak had no choice but to cancel the goal.\nThe call had a devastating impact on Atlético’s hopes of advancing.\nWith the shootout still in progress, Marcos Llorente later missed his penalty, and Real Madrid’s Antonio Rüdiger converted the decisive spot-kick, sealing a 4-2 victory in the shootout.\nFans React: ‘A UEFA Script for Madrid?’\nThe ruling set off a firestorm of reactions on social media, with many Atlético supporters and observers questioning whether the decision was consistent with how other similar incidents had been judged.\nThe Sun described the incident as “one of the most controversial moments in Champions League history” and reported that fans were furious over what they perceived as Real Madrid receiving preferential treatment in European competitions.\nOne viral tweet read: “UEFA’s favourite team gets another decision in their favor. We’ve seen worse penalties stand, but when it’s Atlético, the whistle blows.”\nDespite the uproar, football analysts pointed out that the law is clear and has been applied in similar cases before.\nThe debate, however, continues to rage on whether such fine margins should be subject to VAR intervention, particularly in high-stakes knockout games.\nWith this dramatic outcome, Real Madrid marches on to the quarter-finals, but the controversy surrounding Álvarez’s penalty is likely to linger for years to come.\nPrevious double touch, VAR intervention\nThere are precedents for penalties being ruled out due to a double touch or VAR intervention.\nHere are some notable examples:\n1. Riyad Mahrez’s Disallowed Penalty – Leicester City vs. Manchester City (2019)\nDuring a Premier League match in 2019, Riyad Mahrez took a penalty for Leicester City, but the ball struck his standing foot before going into the net.\nThe referee immediately ruled it out, awarding an indirect free-kick to the opposition.\nThe decision followed the same IFAB rule that was applied to Julián Álvarez’s case—penalty takers cannot touch the ball twice before another player intervenes.\n2. Lionel Messi and Luis Suárez’s ‘Trick Penalty’ – Barcelona vs. Celta Vigo (2016)\nAlthough this was a planned attempt rather than an accidental double touch, Lionel Messi’s famous indirect penalty—where he rolled the ball forward for Luis Suárez to score—sparked debates over what constitutes a legal penalty execution. If Messi had mistakenly touched the ball twice, the goal would have been disallowed just like Álvarez’s.\n3. Kylian Mbappé’s Retaken Penalty – France vs. Switzerland (EURO 2020)\nIn the UEFA Euro 2020 Round of 16, Kylian Mbappé had his penalty saved during the decisive shootout against Switzerland. However, earlier in the tournament, a penalty was controversially recalled for encroachment after a VAR check. While this wasn’t a double touch, it showcased VAR’s strict enforcement of penalty regulations in knockout games.\n4. Pierre-Emerick Aubameyang’s VAR-Penalized Kick – Arsenal vs. Manchester City (2020)\nAubameyang once had a penalty reviewed by VAR after his foot slipped, causing minimal movement of the ball before he struck it properly. Although it wasn’t as blatant as Álvarez’s case, referees considered whether an accidental double touch had occurred. Ultimately, the goal stood because there was no conclusive evidence of two contacts.\n5. John Egan’s Accidental Double Touch – Sheffield United (2021)\nIn a Championship match, John Egan accidentally touched the ball twice while taking a penalty. The referee disallowed the goal and awarded an indirect free-kick. The incident mirrored Álvarez’s, as the ball moved due to an unintended second touch.\n6. Mitrović’s Infamous Double Touch – Serbia vs. Portugal (2021 World Cup Qualifiers)\nDuring a 2021 FIFA World Cup qualifier between Serbia and Portugal, Aleksandar Mitrović took a penalty that was disallowed after VAR confirmed a double touch.\nWhat Happened?\nMitrović slipped while striking the penalty, causing the ball to deflect off his kicking foot onto his standing foot before going into the net.\nThe referee, with the help of VAR, ruled that this was an illegal double touch, and Portugal was awarded an indirect free-kick instead of conceding a goal.\nThe decision left Serbian fans frustrated, especially as the match was crucial for World Cup qualification.\nHow It Compares to Julián Álvarez’s Case\nBoth Álvarez and Mitrović lost their footing, unintentionally making contact with the ball twice.\nIn both cases, VAR intervened and ruled out the goal, enforcing the IFAB rule that prohibits a player from touching the ball twice before another player intervenes.\nThe referees awarded an indirect free-kick to the opposing teams in both situations.\nMitrović’s case is one of the most well-known instances of a penalty being ruled out due to a double touch, and it serves as a direct precedent for Álvarez’s disallowed spot-kick against Real Madrid.\nKey Takeaway\nJulián Álvarez’s disallowed penalty was not an unprecedented event. Football history has seen several instances where a double contact nullified a goal.\nWhile rare, these occurrences highlight the strict nature of penalty execution rules and VAR’s increasing role in enforcing them.",
  "word_count": 1190,
  "scraped_at": "2026-02-14T02:05:46.996032",
  "_text_extracted": true
}