{
  "article_id": "01bb78c52450",
  "url": "https://news.yahoo.com/joe-cole-urges-chelsea-stick-210733008.html",
  "title": "Joe Cole urges Chelsea to stick with Graham Potter for rest of season",
  "date": "20230214T214500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Joe Cole urges Chelsea to stick with Graham Potter for rest of season\nGraham Potter must be given the rest of the season to get to grips with the changes at Chelsea, according to Joe Cole.\nBlues boss Potter is yet to see a marked improvement in his team’s fortunes since the close of the January transfer window, with Sunday’s draw against West Ham the third Premier League game in a row they have failed to win.\nChelsea struggled in the second half at the London Stadium despite a promising start that saw loan signing Joao Felix score his first goal for the club, a pattern that was observable in recent stalemates against Liverpool and Fulham.\nWith eight new signings having joined during the window, there is clearly a rebuilding job to be done by Potter and his staff, with a lack of consistency and cutting edge a mark of the depth of the task at hand for the manager.\nChelsea face Borussia Dortmund in the Champions League last-16 first leg on Wednesday, and former Blues midfielder Cole thinks that, with so much change on and off the pitch, moulding a coherent culture among the squad is key.\n“People get caught up in saying he needs to get to the semi-final or he needs to finish fourth,” Cole told the PA news agency. “I think the club’s gone through such a changeover, from the owners to the manager to the players and staff. You just need someone to settle the thing down. I think Graham Potter is the man for that.\n“Come May, regardless of where Chelsea are in the league, or how well they’ve done in the Champions League, there needs to be signs of some sort of culture forming. Graham Potter needs to stamp his authority on the team.\n“You find a lot out about managers when they go through difficult times. Chelsea finishing ninth in the league would be a difficult time for the club, because the expectation is high. I think he’s handled everything well. But it’ll be time that tells how well. I hope he gets given that time.”\nChelsea’s huge £315million January transfer outlay has drawn scrutiny of owner Todd Boehly’s running of the club, particularly given the team’s rapidly diminishing hopes of qualifying for next season’s Champions League via their league placing.\nFailure to finish in the top four could have ramifications for the club’s hopes of satisfying UEFA’s Financial Fair Play rules, unless Potter can mastermind a surprise third Champions League title for the Blues.\nBoehly and co-owner Behdad Eghbali consider the restructuring of the squad to be largely complete following January’s assault on the market, and Cole is confident that the pair will be prepared for the worst-case scenario should the team fail to qualify for Europe.\n“You have to give the owners leeway,” said the two-time Premier League winner. “They must have a plan, they’re intelligent businessmen. Graham Potter is a studious football man. People behind the scenes are equally competent.\n“Financially, it’s the owners’ responsibility. If you don’t get into the Champions League, there’s a hole in your budget for next year. But I’m sure these guys will have accounted for that in their dealings.\n“When do you see a club where the ownership and multiple people behind the scenes change like this? Players, manager, coaches – everything has changed. The sensible thing is to go, ‘right, let’s give this time, see what happens’. Great if they all hit the ground running and Chelsea win the next 10 games.\n“But what are the parameters? We need to see some cohesion in the team by May, we need to see them performing at the levels they’re all capable of.”\n:: BT Sport is the exclusive home of the UEFA Champions League. Watch AC Milan v Spurs exclusively live on BT Sport 1 on Tuesday, February 14 from 7pm. For more info, visit btsport.com",
  "word_count": 653,
  "scraped_at": "2026-02-14T02:06:47.853026",
  "_text_extracted": true
}