{
  "article_id": "01f13a471172",
  "url": "https://www.teamtalk.com/liverpool/five-leading-liverpool-targets-confirmed-as-arne-slot-eyes-new-striker-defensive-reinforcements",
  "title": "Liverpool : FIVE leading targets confirmed as Arne Slot eyes new striker , defensive reinforcements",
  "date": "20250429T203000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nFIVE leading Liverpool targets confirmed as Arne Slot eyes new striker, defensive reinforcements\nLiverpool are set for one of their busiest transfer windows in their recent history as Arne Slot looks to build a squad capable of dominating English and European football for the long-term.\nIn previous windows, Liverpool have often focused on one specific area, for example last summer they prioritised a midfield revamp, but now they are keen to strengthen in multiple positions.\nThe first big arrival for next season is already agreed, with Giorgi Mamardashvili set to come in and compete with Alisson for his goalkeeper spot, although the expectation is that Alisson will remain Slot’s No. 1.\nDefensive reinforcements are a top priority for Liverpool. Liverpool are big admirers of Bournemouth left-back Milos Kerkez and are leading the race for his signature.\nA bid in the region of £40m-£45m will be required to sign the 21-year-old, who has been earmarked as Andy Robertson’s long-term successor.\nA new centre-back is also wanted by Liverpool, despite them tying captain Virgil van Dijk down to a new contract, amid uncertainty surrounding Ibrahima Konate, who is a target for Paris Saint-Germain.\nBournemouth centre-back Dean Huijsen figures highly on Liverpool’s shortlist, but they face competition from Chelsea and Arsenal. There have been some suggestions that Chelsea are favourites to sign Huijsen but we understand that the race is open. Huijsen has a £50m release clause, which Liverpool deem market value.\nREAD MORE: Daring Liverpool raid on Tottenham discussed as pundit names SIX ‘heavyweight’ Slot targets\nLiverpool tracking three elite strikers\nLiverpool aren’t actively looking to bring in a new defensive midfielder, and haven’t rekindled their Martin Zubimendi interest.\nArsenal are confident of signing the Real Sociedad star, who came close to switching to Anfield last summer before deciding to stay in Spain in a late twist.\nMeanwhile, there are question marks over Luis Diaz’s future with Liverpool, so his potential departure could see the Reds move for a new left-winger. That said, Diaz is contracted until 2027.\nDarwin Nunez is likely to leave and has concrete Saudi interest, so a new centre-forward is a priority for Liverpool.\nTEAMtalk understands that Eintracht Frankfurt striker Hugo Ekitike has been discussed behind the scenes at Liverpool. The 22-year-old has scored 22 goals this season and is open to a move to the Premier League, but could cost close to €100m.\nNewcastle’s Alexander Isak is the dream target but he will be incredibly expensive to sign – perhaps as much as £150m – and if Newcastle qualify for the Champions League he could simply prove impossible to sign.\nBrighton forward Joao Pedro has also been looked at by Liverpool and has scored highly in their data-driven search for targets. Brighton don’t want to sell Pedro so it could take a big fee to get him.\nThe feeling among sources is that it could take time for Liverpool to crystalize their top striker target, but they do intend to sign one and have budget to spend.\nLiverpool not planning new right-back signing\nA host of other names have been linked with Liverpool recently. Bayer Leverkusen centre-back Piero Hincapie is oftenmentioned, but TEAMtalk understands that he is not currently under consideration.\nIt is true that Liverpool like Chelsea defender Levi Colwill, but the Blues have been clear that he is not for sale, and that’s why Liverpool decided against an approach last summer. Only if Chelsea’s position changes would Liverpool reconsider. They are experts at reading the market and rarely waste time on targets they believe aren’t for sale. It’s also why a reasonably quick market assessment of Isak will take place, and Liverpool will either bid or move on.\nWe also understand that despite Trent Alexander-Arnold being set to join Real Madrid this summer, Liverpool are not necessarily prioritising a right-back signing, as Arne Slot and Liverpool’s recruitment team backs talented youngster Conor Bradley to replace the England international, presuming he formalises his verbal agreement with Real Madrid.\nHowever, if Newcastle target Jarrell Quansah was to depart, given he can also provide right-back cover, another full-back may be needed, but it’s not top of Liverpool’s wish list as it stands.\nDON’T MISS: Big updates on FOUR exit-linked Liverpool stars as new contract priority is revealed",
  "word_count": 714,
  "scraped_at": "2026-02-14T01:58:31.691950",
  "_text_extracted": true
}