{
  "article_id": "0204d3eaa1f0",
  "url": "https://www.aol.com/psg-v-man-city-live-174731763.html",
  "title": "PSG v Man City LIVE : Result and reaction as hosts roar back to claim crucial Champions League win",
  "date": "20250122T224500Z",
  "domain": "aol.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSG v Man City LIVE: Result and reaction as hosts roar back to claim crucial Champions League win\nManchester City suffered a critical blow to their hopes of progressing to the Champions League knockout rounds as Paris Saint-Germain roared back to win a crazy contest at a raucous Parc des Princes.\nAfter a goalless first half, the game exploded into life with Jack Grealish and Erling Haaland seemingly setting the visitors on course for a vital three points. But a Bradley Barcola-inspired PSG had other ideas, equalising quickly before surging to victory to resuscitate their hopes of securing a play-off spot.\nPSG leapfrog their opponents with the win. While it wasn’t quite winner takes all with both facing weaker opposition next week, Manchester City are drinking at the last chance saloon with just Club Brugge to come amid an extend wretched run that threatens to end their European adventure prematurely. What next for Pep Guardiola’s side?\nRe-live all of the Champions League action from the Parc des Princes in our live blog below:\nPSG vs Man City LIVE\nPSG produce stunning comeback to beat Manchester City in the Champions League\nDefeat leaves Manchester City in a must-win situation with one game to go in the league phase\nKICK OFF!\nHALF TIME: PSG 0-0 Manchester City\nGOAL! PSG 0-1 MANCHESTER CITY (Jack Grealish, 50 minutes)\nGOAL! PSG 0-2 MANCHESTER CITY (Erling Haaland, 54 minutes)\nGOAL! PSG 1-2 Manchester City (Ousmane Dembele, 56 minutes)\nGOAL! PSG 2-2 Manchester City (Bradley Barcola, 61 minutes)\nGOAL! PSG 3-2 Manchester City (Joao Neves, 79 minutes)\nFULL TIME: PSG 4-2 Manchester City\nParis Saint-Germain FC 4 - 2 Manchester City FC\nMikel Arteta will take Arsenal's easy win - but their cruise through shows flaws in the Champions League format\n22:18 , Miguel Delaney at the Emirates Stadium\nArsenal do as much as they can, which means it is close to impossible for anyone else to do enough to prevent their safe passage into the Champions League last eight. Uefa are hoping for what might be a satisfyingly wild night next Wednesday, but some of it does sound a little absurd.\nIf Arsenal fail to get a point in Girona, all of Bayer Leverkusen, Aston Villa, AS Monaco, Lille, Brest and Feyenoord would have to win by massive margins to have any chance of forcing them into the play-offs.\nIn short, they’re there, as was always expected before this 3-0 victory over a dogged Dinamo Zagreb.\nArteta will take Arsenal's easy win - but cruise through shows flaws in the format\nHow tonight's action leaves the British clubs...\n22:06 , Harry Latham-Coyle\nThis is how it stands for the British clubs in the Champions League...\nLiverpool - top and through to last 16, finishing either first or second.\nArsenal - third, and all but through to last 16\nAston Villa - ninth, need to win and hope results go their way to make last 16, but guaranteed at least a play-off place.\nCeltic - 18th, guaranteed to be in at least play-offs, but unlikely to finish in top eight.\nManchester City - 25th, will be in the play-offs and unseeded if they beat Club Bruges at home in final match. City will be eliminated from European competition if they draw or lose against the Belgians.\nFULL TIME: PSG 4-2 Manchester City\n21:57 , Harry Latham-Coyle\nAstonishing. Six goals in the second half with PSG landing a critical blow in this crazy, crucial contest. They take a huge step towards the knockout rounds; Manchester City are on the canvas with a game to go.\nFULL TIME: PSG 4-2 Manchester City\n21:55 , Harry Latham-Coyle\nGOAL! PSG 4-2 Manchester City (Goncalo Ramos, 90 + 3 minutes)\n21:55 , Harry Latham-Coyle\nIt has! PSG have their fourth and a night to remember at the Parc des Princes!\nA protracted VAR review but away they go in raptures! Off the shoulder of Josko Gvardiol it thuds into Goncalo Ramos’s path, rendering his offside position moot - a neat finish gives the home supporters yet more reason to celebrate, not that they needed it.\nPSG 3-2 Manchester City, 90 + 3 minutes\n21:53 , Harry Latham-Coyle\nGoncalo Ramos has the ball in the back of the net, but the flag is swiftly hoisted...although has that come off a Manchester City player last?\nPSG 3-2 Manchester City, 90 + 2 minutes\n21:51 , Harry Latham-Coyle\nA corner. Ilkay Gundogan has to get the deliver right...a foul on Gianluigi Donnarumma as he punches clear. Is that it?\nPSG 3-2 Manchester City, 90 minutes\n21:50 , Harry Latham-Coyle\nA vital save! Ousmane Dembele’s wondrous weave sets up Goncalo Ramos, but the striker can’t contort a finish around Ederson with his back slightly to goal.\nThree additional minutes.\nPSG 3-2 Manchester City, 88 minutes\n21:48 , Harry Latham-Coyle\nThe Parc des Princes is absolutely jumping, the home fans having been given something to be proud of. A lean continental campaign looks to be picking up.\nPSG 3-2 Manchester City, 86 minutes\n21:46 , Harry Latham-Coyle\nClears the crossbar! A sniff for Ilkay Gundogan but the midfielder can’t keep his 20-yard shot down.\nPSG 3-2 Manchester City, 84 minutes\n21:45 , Harry Latham-Coyle\nManchester City look lost, not for the first time in recent months. Since scoring their second, they’ve completely relinquished control of the contest, unable to get out of their own end. PSG have had more than two thirds of the ball - remember, it was 50/50 or thereabouts at half time. What a comeback.\nOffside! PSG 3-2 Manchester City, 83 minutes\n21:43 , Harry Latham-Coyle\nAlmost four!\nIt would have been a great goal, this, Achraf Hakimi’s switch superb and both Nuno Mendes and Goncalo Ramos playing their part, but Ousmane Dembele had strayed offside before turning home. That surely would have sealed it.\nPSG 3-2 Manchester City, 81 minutes\n21:41 , Harry Latham-Coyle\nLuis Enrique is into protect mode - Bradley Barcola has helped turn this contest, but the situation calls for the defensive steel of Lucas Hernandez. It appears Nuno Mendes will push further up the left flank.\nGOAL! PSG 3-2 Manchester City (Joao Neves, 79 minutes)\n21:39 , Harry Latham-Coyle\nWhat a ball! What a header! John Stones can’t get his head on the delivery and Joao Neves capitalises!\nPSG lead, improbably. Vitinha’s whipped cross is so, so good, shaving the top of Stones’s head and then hopping up invitingly for Neves at the far stick. A powerful header leaves Ederson without a hope - from 2-0 down, PSG have Champions League life.\nPSG 2-2 Manchester City, 78 minutes\n21:37 , Harry Latham-Coyle\nJohn Stones replaces Matheus Nunes as Paris Saint-Germain prepare to deliver a free kick from the right.\nPSG 2-2 Manchester City, 76 minutes\n21:36 , Harry Latham-Coyle\nJohn Stones looks to be Pep Guardiola’s next move.\nPSG 2-2 Manchester City, 72 minutes\n21:33 , Harry Latham-Coyle\nManchester City just need to see this tough period out. You fancy them to come again before the end of the game but PSG are controlling affairs at the moment.\nPSG 2-2 Manchester City, 70 minutes\n21:31 , Harry Latham-Coyle\nRifled against the crossbar! Nearly something sensational from Ousmane Dembele, the feet delectable, the drive piercing, and only the rattling woodwork denies him.\nPSG 2-2 Manchester City, 69 minutes\n21:29 , Harry Latham-Coyle\nExperience and youth for Manchester City as Pep Guardiola makes two more changes. Mateo Kovacic and Kevin De Bruyne take leave as James McAtee and Ilkay Gundogan are introduced.\nPSG 2-2 Manchester City, 67 minutes\n21:26 , Harry Latham-Coyle\nA useful intervention in his own box now from Haaland, blocking Bradley Barcola’s snapshot. It may have been travelling wide but there were a slew of bodies beyond the Norwegian striker.\nPSG 2-2 Manchester City, 66 minutes\n21:24 , Harry Latham-Coyle\nIt doesn’t feel like we are done with the scoring. Erling Haaland has a brief glimpse at one end before Ousmane Dembele sends a shot into the rafters at the other, the substitute forward leaning back as he strikes.\nPSG 2-2 Manchester City, 65 minutes\n21:24 , Richard Jolly at the Parc des Princes\nAnarchy in the Parc des Princes, with four goals in 15 minutes, first a swift double from City and then a terrific comeback from PSG. So much for the theory that Grealish might bring more control... But now, as they were at half-time, City are hanging on. PSG have more incision since Ousmane Dembele came on.\nPSG come back from 2-0 down to draw the game level at 2-2 in just 8 minutes 🤯\nBradley Barcola with the finish against Man City 💥\n📺 @tntsports & @discoveryplusUK pic.twitter.com/5r35CdgheW— Football on TNT Sports (@footballontnt) January 22, 2025\nPSG 2-2 Manchester City, 63 minutes\n21:22 , Harry Latham-Coyle\nLuis Enrique does go through with those changes. Welcome Goncalo Ramos and Warren Zaire-Emery; adieu Desire Doue and Fabian Ruiz.\nGOAL! PSG 2-2 Manchester City (Bradley Barcola, 61 minutes)\n21:20 , Harry Latham-Coyle\nThere’s Bradley Barcola’s goal! It’s 2-2!\nMy word. What a game this has become! Desire Doue curls one off the crossbar, leaving Ederson sprawled on the deck after his attempt to save, and Barcola has the deadeye precision to beat the grounded goalkeeper with his shot in off the post.\nPSG 1-2 Manchester City, 59 minutes\n21:18 , Harry Latham-Coyle\nChanges appear to be on the way for PSG. They’ll have a corner first, though.\nPSG 1-2 Manchester City, 58 minutes\n21:18 , Harry Latham-Coyle\nPhew. Bradley Barcola threatens a fourth of the half with a blazing effort on the angle from 20 yards or so. Over the bar.\nGOAL! PSG 1-2 Manchester City (Ousmane Dembele, 56 minutes)\n21:16 , Harry Latham-Coyle\nWhat is going on? Three goals in 11 second half minutes and PSG have a lifeline!\nBradley Barcola is the craftsman, all sharp edges as he carves down the left. Ousmane Dembele intelligently churns his feet on the penalty spot as the retreating defenders plough past him, taking his time to pick his spot past Ederson to get the hosts back in it.\nGOAL! PSG 0-2 MANCHESTER CITY (Erling Haaland, 54 minutes)\n21:14 , Harry Latham-Coyle\nAnother! Two in quick succession as Manchester City seize the moment!\nMore outstanding work from a visiting defender, Matheus Nunes this time providing the telling surge. His diagonal drive cuts through the Paris Saint-Germain banks, and his pass is well timed, too, to release Jack Grealish.\nGrealish’s cross is diverted to Erling Haaland who sweeps home from close range.\nPSG 0-1 Manchester City, 52 minutes\n21:13 , Harry Latham-Coyle\nJack Grealish will be mightily pleased to get on the scoresheet, the goals not often coming so easily for him. Can Manchester City build from here?\nRichard Jolly fires over the following from Paris:\n“Pep Guardiola looked both drenched and dissatisfied in the first half and he has made a double change. Maybe Ruben Dias went off because he is on a yellow card. Sacrificing Savinho seemed to suggest he wanted more control, with Jack Grealish sent on. But if the thought was that he was charged with keeping the ball, he instead put it in the net. Against the run of play, City lead.”\nGOAL! PSG 0-1 MANCHESTER CITY (Jack Grealish, 50 minutes)\n21:09 , Harry Latham-Coyle\nInstant impact!\nOn the pitch a matter of minutes, Jack Grealish slams home the opener! It’s superb from Manuel Akanji to help craft it, driving with power and purpose to the byline. His cutback finds Bernardo Silva, who is denied brilliantly by Gianluigi Donnarumma, but the Italian is powerless to prevent Grealish converting the rebound. What a substitution!\nPSG 0-0 Manchester City, 49 minutes\n21:08 , Harry Latham-Coyle\nDesire Doue has swapped wings with Ousmane Dembele on the right. Doue goes at Matheus Nunes but gets limited joy. The midfielder-cum-right-back has done a decent job so far.\nPSG 0-0 Manchester City, 47 minutes\n21:07 , Harry Latham-Coyle\nA defensive reshuffle for Manchester City, then, with Ruben Dias perhaps taken off as a precaution after an early booking. Josko Gvardiol has gone to centre-half with the versatile Rico Lewis on the left of the back four.\nSecond half...\n21:04 , Harry Latham-Coyle\nA switch at the interval from Luis Enqiue - and, in fact, Pep Guardiola.\nOusmane Dembele replaces Lee Kang In for the hosts, and for Manchester City, it’s a double switch: Savinho and Ruben Dias off, Rico Lewis and Jack Grealish on.\nElsewhere...\n20:53 , Harry Latham-Coyle\nA couple of scores from elsewhere. Celtic have had three goals ruled out and missed a penalty, which I’m sure will leave Brendan Rodgers delighted.\nArsenal 1-0 Dinamo Zagreb\nCeltic 0-0 Young Boys\nReal Madrid 2-0 Red Bull Salzburg.\nWhat a goal 🤧\nRodrygo doubles his, and Real Madrid's tally, after a brilliant interchange with Jude Bellingham, with a sublime finish 🔥\n📺 @tntsports & @discoveryplusUK pic.twitter.com/T3w5GNnVYs— Football on TNT Sports (@footballontnt) January 22, 2025\nHT: PSG 0-0 Manchester City\n20:50 , Harry Latham-Coyle\nA half that crackled without fully bursting into flames after the ruling out of Achraf Hakimi’s apparent opener. Manchester City have looked a real threat going forward but familiarly frail at times defensively - this crunch clash really could go either way. Back for more in a bit.\nHALF TIME: PSG 0-0 Manchester City\n20:48 , Harry Latham-Coyle\nNO GOAL! PSG 0-0 Manchester City, 45 minutes\n20:46 , Harry Latham-Coyle\nPSG lead! A half that deserved a goal gets one just before the interval!\nOr does it? Is Nuno Mendes offside in the build-up? The left back’s hard work had created the chance, a neat one-two taking him in behind before Achraf Hakimi rifled home. But he is offside! A stray knee and the goal is quickly chalked off on VAR review.\nPSG 0-0 Manchester City, 43 minutes\n20:45 , Harry Latham-Coyle\nJosko Gvardiol does well against the dynamic Desire Doue, but that’s a sign of the youngster’s character, hustling to win the ball back having been bested. He’s just 19, the summer signing from Rennes, and starting to find his feet at this level.\nPSG 0-0 Manchester City, 42 minutes\n20:43 , Harry Latham-Coyle\nMarquinhos is forced into a very sharp header with Ruben Dias threatening.\nKevin De Bruyne to deliver the next corner...too deep.\nPSG 0-0 Manchester City, 41 minutes\n20:42 , Harry Latham-Coyle\nManchester City continue to press, a couple of corners followed by a free kick due to Bradley Barcola’s barge in the back of Phil Foden.\nPSG 0-0 Manchester City, 40 minutes\n20:41 , Harry Latham-Coyle\nTop stop! Manchester City break at speed, cutting Paris Saint-Germain open. Savinho is slotted in and fires against the legs of Gianluigi Donnarumma, closing the space sharply and saving.\nPSG 0-0 Manchester City, 38 minutes\n20:40 , Harry Latham-Coyle\nAchraf Hakimi’s attempted cross skews off the outside of his boot and ends up a pretty threatening shot, Ederson taking no chances and thrusting a hand at it. Matheus Nunes follows his goalkeeper’s lead and heads behind.\nThe corner from Lee Kang In bends out of play.\nPSG 0-0 Manchester City, 36 minutes\n20:37 , Harry Latham-Coyle\nPep Guardiola has donned a beanie, which is dampening quickly as the rain continues to pour in Paris. PSG use the slick surface to bop the ball around for a bit, though it’s relatively aimless.\nPSG 0-0 Manchester City, 33 minutes\n20:34 , Richard Jolly at the Parc des Princes\nNo goals, but a terrific first half-hour here. PSG have been very impressive in midfield, where Joao Neves, Vitinha and Fabian Ruiz are younger and more athletic than the City trio, but have considerable quality as well. City have had a couple of chances, but are grateful to Josko Gvardiol for preserving parity with a goal-line clearance.\nPSG 0-0 Manchester City, 32 minutes\n20:33 , Harry Latham-Coyle\nIt appears that the referee has granted Marquinhos reprieve, not going to his pocket even as the ball exits play a full three or four minutes after his foul.\nManchester City are content with a corner, which Phil Foden will lope across to swing in. Not his best - too deep, collected and cleared.\nPSG 0-0 Manchester City, 29 minutes\n20:31 , Harry Latham-Coyle\nA nice rhythm to this contest, not a real rocker but with a proper smoothness.\nMarquinhos will surely be booked for his attempted foul having tried to hinder a Manchester City counter attack. Onwards they go, though, with Nuno Mendes strong to hold off Erling Haaland at the end of it.\nPSG 0-0 Manchester City, 26 minutes\n20:29 , Harry Latham-Coyle\nHow did that not go in? A brilliant block on the line!\nA corner causes chaos and Fabian Ruiz thumps the bouncing ball seemingly into the back of the net. But a blocking body escapes from a thicket of Manchester City defenders to biff it away. Ruiz can’t believe it.\nPSG 0-0 Manchester City, 25 minutes\n20:27 , Harry Latham-Coyle\nNot far away! A loose header from Manuel Akanji grants Vitinha a shooting opportunity. Off a foot it flies for a corner.\nPSG 0-0 Manchester City, 24 minutes\n20:26 , Harry Latham-Coyle\nSo we remain goalles through the opening quarter, with both sides just starting to feel this contest out. Manchester City are beginning to find their flow, but it’s an even share of possession so far.\nPSG 0-0 Manchester City, 21 minutes\n20:24 , Harry Latham-Coyle\nManchester City are beginning to threaten more regularly, though. A delicious bit of skill from Savinho sends Achraf Hakimi and co. down the Seine, but Phil Foden’s touch is poor when the Brazilian finds him with a sharp inside pass.\nPSG 0-0 Manchester City, 20 minutes\n20:22 , Harry Latham-Coyle\nTame. Erling Haaland is leaning back a bit and fading as a cross hits his head, leaving Gianluigi Donnarumma relatively comfortable as he claims in front of his face. Could Haaland have let it go for Kevin De Bruyne beyond him? Perhaps.\nPSG 0-0 Manchester City, 18 minutes\n20:20 , Harry Latham-Coyle\nMateo Kovacic is another struggling to pick up the pace of the game. Two or three misplaced passes so far from the Croatian, with Manchester City considering adding a more direct Rodri replacement to their squad this January.\nPSG 0-0 Manchester City, 15 minutes\n20:17 , Harry Latham-Coyle\nSavinho hasn’t yet got going for Manchester City, the Brazilian cast away on the left with the visitors so far favouring the right in their build-up play. An attempt to find him from Erling Haaland is clipped slightly off line.\nPSG 0-0 Manchester City, 13 minutes\n20:14 , Harry Latham-Coyle\nChance! A great run from Kevin De Bruyne in behind eventually creates a chance for the Belgian, his goalwards lash beaten away by Gianluigi Donnarumma between the sticks.\nPSG 0-0 Manchester City, 12 minutes\n20:13 , Richard Jolly at the Parc des Princes\nPSG may have a reputation as a club for the rich and famous, but this isn't about those in the plush seats. The rest of the Parc des Princes is bouncing. The atmosphere is cracking, making it still more of a test for City. Ruben Dias has got an early yellow card and Joao Neves has come close to an opener.\nPSG 0-0 Manchester City, 10 minutes\n20:11 , Harry Latham-Coyle\nOoh. A very early booking for Ruben Dias, shutting the door on Achraf Hakimi in full knowledge that the right back has the beating of him in the pace stakes.\nAnd nearly an opener! Joao Neves finds space at the far stick beyond Matheus Nunes and should really hit the target with his header.\nPSG 0-0 Manchester City, 9 minutes\n20:10 , Harry Latham-Coyle\nErling Haaland rises highest to head away.\nThomas Tuchel is here tonight, watching Phil Foden and co against one of his former clubs.\nPSG 0-0 Manchester City, 8 minutes\n20:09 , Harry Latham-Coyle\nNuno Mendes very nearly combines neatly with Desire Doue, with Manuel Akanji reacting well having been initially caught napping. Another corner for the hosts.\nPSG 0-0 Manchester City, 6 minutes\n20:07 , Harry Latham-Coyle\nManchester City are trying to press high, though Paris Saint-Germain are playing intelligently, varying their shape with both midfield and forward lines highly interchangeable. Josko Gvardiol steps in well to end their adventure.\nPSG 0-0 Manchester City, 5 minutes\n20:06 , Harry Latham-Coyle\nA rasping drive from Desire Doue stings the palms of Ederson. Lively from the teenage forward.\nThe corner comes to nothing.\nPSG 0-0 Manchester City, 3 minutes\n20:05 , Harry Latham-Coyle\nBaffling. Up come the big blokes, but Manchester City play it short and are forced all the way back to goalkeeper Ederson.\nMateo Kovacic then gives the ball away in his own final third, and Ederson has to gather a dangerous cross soon after. Sloppy.\nPSG 0-0 Manchester City, 2 minutes\n20:03 , Harry Latham-Coyle\nMatheus Nunes is providing plenty of width on the right, more up in midfield than his nominal role in the back four when in possession before reverting deeper when PSG win the ball.\nMateo Kovacic drives forward and Kevin De Bruyne earns a corner.\nPSG 0-0 Manchester City, 1 minute\n20:02 , Harry Latham-Coyle\nPhil Foden tries to put some footwork on Nuno Mendes but fails to make any headway, the left back handling the Manchester City man well.\nKICK OFF!\n20:01 , Harry Latham-Coyle\nA peep of the whistle and off we go in Paris.\nPSG vs Manchester City\n19:59 , Harry Latham-Coyle\nOut the players come into the Paris night, the rain tumbling down. The Champions League anthem gets a few boos from every corner of the stadium, these two Middle Eastern-owned clubs united on certain issues. More of a roar as it comes to an crescendo.\nPSG vs Manchester City\n19:56 , Harry Latham-Coyle\nThe Parc des Princes looks spectacular as the lights go out and the flames fly, creating a big match feel perhaps not befitting this pair’s currently lowly competition status. Who will take a big step towards the knockout rounds tonight?\nPSG vs Manchester City\n19:50 , Richard Jolly at the Parc des Princes\nIt's 24th against 26th in the battle of the underachievers at a rather damp Parc des Princes. PSG and Manchester City are also two of the big January spenders, albeit when their new signings cannot play until the knockout stages, which one may not reach. PSG are in more danger and a draw may be a good result for City. But Matheus Nunes is used as a makeshift right-back again, pitting him against Bradley Barcola. PSG may like the sound of that.\nLuis Enrique plays down pressure of fixture\n19:43 , Lawrence Ostlere\nLuis Enrique played down the pressure ahead of his Paris St Germain side's potentially pivotal Champions League clash with Manchester City tonight.\nDefeat would leave either side in serious danger of missing out on the knockout stages but Enrique has refused to label the contest 'must-win'.\nThe PSG manager said: \"Why would there be pressure? This team never gives up and fights until the last minute.\n\"The reality is we should have won the games against PSV (Eindhoven) and Atletico (Madrid). With those (extra) five points we would already be qualifying for the next round.\n\"But I am very optimistic and confident. Is it a must-win game? The obligation is all the players give 100 per cent, and I take the same attitude every day.\n\"You can lose games, and that's life. The most important thing is to be committed.\"\nGuardiola: 'Our families are really, really close'\n19:34 , Lawrence Ostlere\nBoth City and PSG have struggled in the Champions League this season, with PSG 25th on seven points. Guardiola had kind words for PSG coach Luis Enrique, who is his friend.\n\"I want from the deepest of my heart a horrible performance from PSG tomorrow, so we can beat them, but it will be 95 minutes and afterwards the relation (with Luis Enrique) will return to how it always has been,\" he said.\n\"Our families are really, really close. There are friendships that will be eternal, forever. I love them, I think they love us. We have an incredible connection... We are happy when we can see each other.\"\nGuardiola: 'Now comes the toughest period of the season'\n19:25 , Lawrence Ostlere\nSpeaking yesterday in his pre-match press conference, Pep Guardiola was encouraged by the return of Jogn Stones to fitness as blamed fitness problems for some of City’s struggles.\n\"Step by step the players are coming back and hopefully we can be there in the Premier League and qualify here. Today John came back to the team, that is incredibly good news for us,\" Guardiola said.\n\"We can add to the position that we struggled a lot all season. We could not find our rhythm and the guys who have been with us, I could not demand (a faster return) from them as there was a fear of being injured.\n\"We could not sustain the intensity that has defined in the past nine years but now hopefully we (can) do it. Now comes the toughest period of the season... the challenge is there, and we go for it.\"\nNews: City accused of tapping up teenager\n19:16 , Lawrence Ostlere\nManchester City have been accused of tapping up teenage defender Juma Bah by his club Real Valladolid.\nThe Spanish side say the 18-year-old and his agent told them on Tuesday he would be unilaterally terminating his contract and that the player from Sierra Leone then failed to report for training on Wednesday morning.\nValladolid say City are \"behind this decision\" and \"advised the player to take this route\".\nValladolid said they were told by the Spanish football federation (RFEF) on Wednesday that the funds needed to activate the termination clause in Bah's contract had been paid.\nA statement from the Spanish top-flight club said they had been placed in a \"defenceless position\" by City and that they \"reserve the right to resort to the appropriate legal and sporting jurisdictions to exercise (our) rights and defend (our) interests.\n\"The player's intention, supposedly supported and guided by Manchester City and his agent, has caused great disappointment and indignation within Real Valladolid, who welcomed Juma Bah with open arms and gave him the opportunity of a lifetime,\" the statement said.\nCity have declined to comment.\nBah first moved to Valladolid from AIK Freetong in his home country last summer.\nTeam news - Paris Saint-Germain\n18:51 , Harry Latham-Coyle\nAchraf Hakimi returns for PSG at right back, while Bradley Barcola joins Desire Doue and Lee Kang In up front.\nPSG XI: Donnarumma; Hakimi, Marquinhos, Pacho, Nuno Mendes; Fabian Ruiz, Vitinha, Joao Neves; Barcola, Doue, Lee.\nTeam news - Manchester City\n18:47 , Harry Latham-Coyle\nIt looks like Matheus Nunes at right back again for Manchester City, with Savinho and Bernardo Silva brought in further forward.\nManchester City XI: Ederson; Nunes, Akanji, Dias, Gvardiol; Kovacic; Savinho, De Bruyne, Bernardo, Foden; Haaland.\nLining up in Paris 💪\nXI | Ederson, Nunes, Akanji, Dias, Gvardiol, Kovacic, De Bruyne (C), Bernardo, Savinho, Foden, Haaland\nSUBS | Ortega Moreno, Carson, Stones, Grealish, Gundogan, Wright, Alleyne, O'Reilly, Lewis, McAtee#ManCity | #UCL pic.twitter.com/jR7556a9fd— Manchester City (@ManCity) January 22, 2025\nFallen giants PSG and Man City clash in Champions League game of sudden death\n18:39 , Lawrence Ostlere\nBefore the line-ups drop, here’s a bit of pre-match reading from senior football correspondent Richard Jolly:\nTwo of the superclubs are now scrambling to get into the top 24. The champions of France and England kick off in 26th and 24th place, respectively. “The match comes at a tough time in terms of the league,” added Luis Enrique. “We have seven points and they have eight. I don’t think anyone could predict Manchester City would have this number of points ahead of matchday seven.”\nRead more:\nFallen giants PSG and City clash in Champions League sudden death\nPSG v Man City – predicted line-ups\n18:31 , Lawrence Ostlere\nHere’s how the two sides could line up tonight:\nPSG XI: Donnarumma; Beraldo, Pacho, Hernandez; Zaire-Emery, Vitinha, Ruiz, Mendes; Barcola, Lee, Doue.\nMan City XI: Ederson; Nunes, Akanji, Dias, Gvardiol; Gundogan, Kovacic; Foden, De Bruyne, Savio; Haaland.\nPSG team news\n18:23 , Lawrence Ostlere\nFor PSG, the main news is that new signing Khvicha Kvaratskhelia is not able to feature in the competition before the league phase ends, so he will not play a part.\nOtherwise, centre-back Marquinhos is the only other injury doubt, with Ecuadorian defender Willian Pacho covering last time out.\nNuno Mendes and Warren Zaire-Emery will likely line up as wing-backs, with Vitinha and Fabian Ruiz in midfield.\nIn the forward positions, young wingers Bradley Barcola and Desire Doue should play alongside striker Lee Kang In.\nMan City team news\n18:16 , Lawrence Ostlere\nCity have no new injury concerns after the win over Ipswich, with Nathan Ake and John Stones still out for the near future and Oscar Bobb nearing a return some time next month.\nGuardiola may field a similar side to the one that won at Portman Road.\nHow to watch PSG v Man City tonight\n18:05 , Lawrence Ostlere\nPSG vs Man City is due to kick off at 8pm GMT tonight at the Parc des Princes.\nViewers in the United Kingdom can watch the match live on TNT Sports 1, with coverage on the channel from 7pm. Subscribers can also stream via discovery+.\nPSG v Man City – Champions League\n17:50 , Lawrence Ostlere\nManchester City travel to the French capital to face Paris Saint-Germain in the Champions League, with Pep Guardiola’s side in need of a positive result to secure a place in the competition’s play-offs.\nCity could yet climb into the automatic qualification places, but it would require plenty of luck in results elsewhere given they are languishing in the table.\nAnd they face a PSG side that are flying in Ligue 1, with a nine-point lead at the top and having just welcomed new signing Khvicha Kvaratskhelia.\nHowever, the hosts are even lower in the Champions League’s league phase table, sitting outside the play-off positions, and will be desperate for a win that would take them above City to salvage their European campaign for now.\nPSG v Man City – Champions League\n17:39 , Lawrence Ostlere\nThis is exactly the sort of match Uefa hoped to conjure up with their new format for the Champions League: two giants of Europe coming to blows with plenty at stake. PSG meet Manchester City, and the loser here tonight is in real danger of going out of the competition at the first hurdle.\nPSG v Man City – Champions League\n17:30 , Lawrence Ostlere\nGood evening and welcome along to a crucial clash in the Champions League as two of the richest clubs world football, PSG and Manchester City, clash in Paris, with both needing points to salvage their campaign.\nFollow all the action right here.",
  "word_count": 5154,
  "scraped_at": "2026-02-14T01:49:18.063532",
  "_text_extracted": true
}