{
  "article_id": "0215708e2ee5",
  "url": "https://theathletic.com/4673003/2023/07/21/messi-inter-miami-mls-argentina/",
  "title": "Inter Miami Messi may have declined physically , but his brain is as sharp as ever",
  "date": "20230721T163000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionel Messi will become unquestionably the most revered footballer to have ever played in Major League Soccer the moment he kicks his first ball. Attention thus far, therefore, has largely been upon what Messi means to the development of MLS overall, rather than what he will mean to his new club, Inter Miami.\nAdvertisement\nThe Athletic’s Paul Tenorio has addressed some of the inevitable wider questions — what does it mean for the MLS’s player acquisition model? What about its roster rules? Will his arrival prompt teams to install natural grass pitches to replace artificial ones? — but while Messi is one of the most famous people in the world, a true global superstar, he has reached that status by largely concentrating on his football. It’s doubtful the Argentinian will be as forthcoming as David Beckham was in his LA Galaxy days in terms of being a symbol for the league and he won’t be providing catchy post-match quotes like Zlatan Ibrahimovic did when at that same club more recently.\nMessi is all about football, and all eyes are on how Inter Miami integrate him into the side — which is currently the worst in the Eastern Conference and has the fewest points in the entire league.\nMiami — and, yes, the wider MLS too — need Messi at his best on the field. So how good is he in July 2023, a month after turning 36? And where should he be deployed?\nFollow live coverage of Lionel Messi’s Inter Miami vs Atlanta United\nGO DEEPER\nFootball is constantly in flux - so why do its pitch markings remain unchanged?\nBefore we get to the issue of where Messi should play, and how he will play, we can be fairly certain that Messi will play. Throughout his career in Europe, Messi was almost always available for selection, and a defining part of his career has been his ability to play week in, week out. At one stage, he had an unspoken agreement with Barcelona’s coaches not to substitute him.\nMessi hasn’t played fewer than 2,000 minutes (the equivalent of 22 full matches) in a league campaign from the start of 2008-09 onwards and has only dipped below 2,500 once in those 15 years. That exception came in a challenging first season of his two at Paris Saint-Germain, when he didn’t make his shock move away from Barcelona until after the 2021-22 Ligue 1 campaign had already started. He took three months to get up to speed having not had a pre-season, but then played the full 90 minutes in 20 of PSG’s final 25 Ligue 1 games that season.\nAdvertisement\nBut this should be considered a reason for caution — in the only previous instance of Messi joining a new club, he wasn’t at his best for them for several months. If that’s replicated in Miami, we won’t see Messi’s best until the 2024 MLS season starts next February.\nThen comes the question of precisely where Messi should play.\nBroadly speaking, Messi has played three different roles throughout his career: as a right-winger, as a false nine up front, and as a classic No 10 behind a proper striker. At his best, he combines elements of these three roles.\nGO DEEPER\nLionel Messi: The evolution of the greatest footballer of all time\nMessi first emerged as a right-winger, cutting inside onto his left foot to deadly effect during his formative years with Barcelona. His move to a central role under Pep Guardiola was initially considered a tactical alternative, then became Barca’s long-term strategy and ultimately became Messi’s defining position.\nSince then, however, there have been periods when he’s played from the right. Under Luis Enrique at Barcelona, Luis Suarez initially started playing a role on the right but then switched to a proper No 9 position with Messi reverting to his wide berth of old, from where he won his second treble of La Liga, Copa del Rey and Champions League in 2014-15.\nMore pertinently, under Christophe Galtier at PSG last season, Messi was fielded in the inside-right position in a 3-4-3, which allowed him to take up his favoured attacking positions without requiring him to demonstrate mobility or defensive awareness. Achraf Hakimi would push forward from right wing-back to provide the energy down that flank, and Messi moved inside, playing more centrally than in his first season in Paris — with 43 per cent of his attacking touches in Ligue 1 coming within the width of the six-yard box (up from 35 per cent a year earlier).\nThe problem with Messi playing out wide, which generally requires you to make more recovery runs after possession is lost, is that he simply doesn’t have the mobility in the second half of his fourth decade to offer anything defensively when playing in a right-sided role. The presence of both Kylian Mbappe and Neymar in the same team as him at PSG — and the need to accommodate all three of them together — meant a right-sided role for Messi made sense, but it probably doesn’t make sense at any other club side in the world.\nAdvertisement\nMessi’s declining mobility is evident from an attacking perspective too. We know his approach in recent years has been about lingering on the periphery of the game before bursting into life, but the sheer volume of those explosive actions has, understandably, reduced.\nUsing data from StatsBomb, we can see in the chart below that Messi’s two seasons at PSG produced the fewest and second-fewest dribbling attempts of his whole career.\nSo has Messi gone from a pure dribbler to a great all-round attacker who offers goals and assists as well as dribbling, to a player who offers goals and assists but no dribbling?\nWell, not quite.\nComparing Messi in 2022-23 to peak Messi is, well, a bit unfair, so there are a couple of things to consider here.\nFirstly, the now 36-year-old’s attempted dribbles per 90 across his two PSG seasons still placed him at an above-average rate for a winger in Europe’s top five domestic leagues (Premier League, La Liga, Serie A in Italy, German Bundesliga and Ligue 1).\nSecondly, when he does try to beat an opponent, he clearly hasn’t lost the knack for it. Messi’s take-on success in a PSG shirt remained in the top 20 per cent among all wingers in Europe — 65 per cent and 55 per cent, albeit with that 10 per cent drop in year two.\nStill, the numbers suggest Messi remains among the best dribblers around.\nIf Miami coach Gerardo Martino, a fellow son of the Argentine city of Rosario and his Barcelona manager for the 2013-14 season, considers that it’s not worth playing Messi from the right, another option is to use him up front.\nHe’s the player who popularised the false nine role, but Messi hasn’t been deployed there very often in recent years; for Barcelona, he became accustomed to playing as a second striker, a role he’s generally played for Argentina too. At PSG, there was a brief period in his debut season when he was their closest thing to a centre-forward.\nAdvertisement\nDefensively, his lack of tracking back is less of an issue here than when played out wide, although there are some negatives:\nIf he’s playing in a pressing-based side, he won’t be particularly effective in terms of starting the press. Playing him as a No 9 means he’s not involved in the play for long periods, particularly if his side is on the back foot, and you therefore see little of his creative skills. At the same time, when Messi does drop deep, he tends to wander wherever he fancies, coming too deep in situations when others aren’t in a position to stretch the play in the other direction.\nThe positives? Messi remains an excellent finisher. He can conserve his energy for doing damage where it matters most: in and around the opposition box. Arguably Messi’s classic goal is when he sweeps home a team-mate’s cutback delivered from the left wing — usually starting his run from an inside-right position just outside the penalty area, and sprinting diagonally towards the near post.\nNot all his shots come from those situations, of course. But that zone correlates well with Messi’s shooting heatmap over the years, particularly in recent years. There’s a very clear ‘Messi Zone’.\nMessi’s goalscoring decline — by his own absurdly high standards — was widely discussed during his time in France.\nThat difficult first season, with only six Ligue 1 goals, was followed by a rate of 0.48 goals per 90 minutes in 2022-23, per StatsBomb data. Most attackers would be pleased with that, yet it was the third-worst rate of his entire career. Only in 2007-08, when he was 20, did Messi score at a lower average per 90 for Barcelona.\nStill, Messi was one of just eight players across Europe’s top five leagues to average more than one goal contribution — goals plus assists — per 90 last season (1.02).\nAdvertisement\nDigging deeper, we can map his non-penalty expected goals (xG) and expected assists (xA) per 90 compared with all other forwards in Europe’s top five leagues across the past two seasons.\nMessi isn’t competing with Robert Lewandowski, Erling Haaland or his former team-mate Mbappe in terms of goals. But he’s still consistently contributing in both respects, scoring and creating chances at a high level, which isn’t bad for a ‘disappointing’ stint in Ligue 1.\nWe can also plot Messi’s last two campaigns in terms of xG and xA against current MLS players’ returns for those metrics so far this season.\nThere are a couple of caveats — Messi was playing against higher-quality opposition, in general, but has also been playing for a dominant side that coast to the French title most seasons — but if he were to continue at that same rate, he’d be the best all-round attacker in MLS.\nAnd creative qualities, particularly when you consider he is joining a struggling side, are particularly valuable — there’s not much point in Messi waiting about up front for service when he could be positioned deeper, getting involved more.\nAt the World Cup last November and December, Messi essentially ‘completed’ football after being handed a free role by Argentina coach Lionel Scaloni.\nAllowed to drift where he pleased between the lines, scoring goals and playing neat through-balls, Messi was in his element. The slower pace of international football compared to the club game, it’s fair to say, also suited him nicely.\nTo put it mildly, Messi was… economical with his running at the World Cup, but still effective. As The Athletic has previously analysed, he turned walking into an art form, pulling defenders into spaces they didn’t want to be by barely moving at all.\nUsing data from FIFA, we can see that Messi averaged the highest distance walked (metres) per game of any player in the tournament.\nIt is a well-established truism: Messi walks better than most players run.\nAgain, Messi can’t do the defensive part of that job very well, particularly when it comes to tracking opposition holding midfielders. Argentina ended up with their No 9 Julian Alvarez basically playing as the No 10 without possession — deeper than Messi in the defensive phase, in advance of him in the attacking one.\nAdvertisement\nYou need to pair Messi with the right player: diligent, energetic, selfless. It remains to be seen whether Miami forward Josef Martinez, their Venezuela international centre-forward and six-goal top scorer so far this season, can be that player.\nPlaying as a No 10 for Miami is probably the best role for Messi in terms of creativity. And while his dribbling and goalscoring numbers have dropped in recent years, he is still an absolutely brilliant footballer in terms of playing through balls.\nIf anyone thought his powers had waned during his time in Ligue 1, you can see below that Messi was still doing Messi things at a comparable rate to his Barcelona peak — with a success rate of 40 per cent similarly aligning with his career average.\nIn fact, according to numbers provided by Opta via FBref, no player across Europe’s top five leagues has averaged a higher volume of successful through balls per 90 minutes than he did during his two seasons at PSG.\nMessi’s physical capacity has declined, but his brain is as sharp as ever.\n(Photo: Hector Vivas/Getty Images)",
  "word_count": 2073,
  "scraped_at": "2026-02-14T02:24:50.286363",
  "_text_extracted": true
}