{
  "article_id": "022ac6bcd544",
  "url": "https://www.twtd.co.uk/ipswich-town-news/32007/town-confirm-waghorn-signing/onthisday",
  "title": "Town Confirm Waghorn Signing - Ipswich Town News",
  "date": "20240807T040000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Monday, 7th Aug 2017 12:43\nTown have confirmed the signing of Rangers striker Martyn Waghorn on a two-year deal with an option for a further season. The Blues are understood to have paid around £1 million for the 27-year-old.\nWaghorn, who has been handed the number nine shirt, passed a Town medical and put pen to paper on his contract this morning and the Blues are hoping that the paperwork - including international clearance - will be sorted in time for him to make his debut at Luton tomorrow.\n“I know about all the history of Ipswich and watched the club when they were in Europe,\" Waghorn told the official website. I know what a good club it is so it’s a great opportunity for me.\n“I was at Sunderland’s academy and was a ballboy at games when he [Mick McCarthy] was manager there so I know all about the manager here as well. He’s achieved a lot in the game and I’m grateful to him for giving me the chance to come here and play games.\n“It’s an exciting move for me. You get a fresh buzz when you join a new club. That’s how I feel. It’s a new start and I’m really looking forward to it.\n“I’m 27 and feel I’m coming into my prime now and feel my best football is yet to come.\n“I know some of the lads already, Garns [Joe Garner] from Rangers, Emyr [Huws]. They are good players. There is a good squad here.\n“I have played regularly over the last few years and scored a few goals. I know about the Championship. I played in a couple of play-offs, so hopefully I can bring that experience and kick on here and help Ipswich have a good season and have some success here.”\nSouth Shields-born Waghorn came through the youth system at local club Sunderland - who are understood to have been keen to re-sign him this summer - and made a handful of Premier League appearances while at the Stadium of Light, as well as having spells on loan at Charlton and Leicester before joining the Foxes on a permanent basis for £3 million in August 2010.\nThe 5ft 10in tall former England U19 and U21 international was loaned to Hull City, Millwall and Wigan while a Leicester player before joining the Latics full-time on a free transfer in April 2014.\nHe moved on to Rangers in July 2015, signing a three-year deal. While with the Ibrox club Waghorn made 63 starts and 15 sub appearances, scoring 44 goals, 16 of them last season.\nDuring 2015/16 Waghorn, who can also operate in wide areas, helped Rangers to carry off the Scottish Championship and Scottish Challenge Cup. He was also named in the PFA Scotland Team of the Year for the Championship that season.\nWaghorn was left out of the 18 for yesterday's 2-1 victory over Motherwell, the Glasgow giants' opening league fixture of the season.\nPreviously he started the first leg of the Europa League qualifier against Niedercorn from Luxembourg at end of June but was left out of the second match the following week.\nI'm delighted to have signed for @Official_ITFC looking forward too getting going. Thanks for the messages âš½ðŸ™ŒðŸ» pic.twitter.com/cKEi1zHaIp– Martyn Waghorn (@MWaghorn33) August 7, 2017\nThe Rangers squad is currently in a state of flux with manager Pedro Caixinha, who was appointed in March, looking to offload a number of players in order to bring in his own recruits.\nThe Blues have already benefited from Rangers' summer fire sale by signing Joe Garner, the scorer of a debut winner in Saturday's 1-0 victory over Birmingham, back in June.\nPhotos: ITFC\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nReading the Rangers' comments they are astonished at this deal, they can't believe they're making any cash for him at all! Their fans say his confidence is shot. But I spend a fair bit of time up north of the border and I can imagine them being very demanding and getting on his back quickly. Gers think of themselves as a Champions League club so can see how he hasn't lived up to their expectations. Also everything up there based on the old firm, so if he hasn't scored or done damage in one of those fixtures he'll be seen as not up to it. The Scottish league is a funny one, punctuated with some quality but in the main, really poor.\nHopefully Mick and a transfer, and a good team behind him, can give him a reboot as looking at his goals reel, he has all the attributes.\nMuch better than dodgy website rumours is it not mate?\nIt feels really good to have some quality up front at last, missing since Murphy left last August. With Waghorn coming in and Garner off to a great start, McGoldrick and Sears will have to work extra hard to earn a place up front. Lovely to have proper competition for places, and real options from the substitutes' bench.\nWhat a difference a weekend makes! We were all feeling worried after the Charlton pre-season defeat and seeing we are among the favourites for relegation, but now we have 3 points earned in front of a decent crowd, a new striker coming in who looks a really good signing, and possibly one or two others set to follow. Optimism returns. COYB!\nI think of our summer shopping as on a par with shopping at TK Maxx. Sift through the rubbish, the gems are out there and they're in your size. Just have to look for them.\nCOYB!\nWe could also sign Harry Forrester, James Tavernier, Josh Windass and keeper Wes Foderingham if they are having a fire sale!\nGreat signing.\n4-4-2 4-3-3 and 3-5-2 we have the players for!\nBart\nIorfa. Webster. Chambers. Kenlock\nSkuse\nHuws. Adeyemi\nWag horn Celina\nGarner\nWould not mind a centre back to come in\nDownes is a real find - lets hope he is used correctly - we must have learnt something on how often to play youngsters from Hyam, Bishop injury situations\nNot before time either.\nYou need to login in order to post your comments",
  "word_count": 1035,
  "scraped_at": "2026-02-14T01:48:56.589259",
  "_text_extracted": true
}