{
  "article_id": "0241d2f3b56c",
  "url": "https://www.caughtoffside.com/2024/09/14/tottenham-want-sign-dominic-calvert-lewin/",
  "title": "Tottenham keen on landing 27 - year - old Englishman on a bargain",
  "date": "20240914T121500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dominic Calvert-Lewin could leave Everton in the summer of 2025 and Tottenham Hotspur have shown interest in securing his services.\nAccording to a report from Fichajes, the North London club are keen on signing the 27-year-old England international and it remains to be seen whether they can secure an agreement with the player.\nHe will be a free agent next summer and signing a player of his quality and experience for free would be an exceptional bit of business.\nTottenham manager Ange Postecoglou is looking to strengthen his attacking unit and he wants to add further depth to the side. Signing the 27-year-old could be the ideal move for Tottenham.\nThey have already signed Dominic Solanke earlier this summer and Calvert-Lewin could compete with him for the starting spot.\nThe Everton striker is struggling to hit top form but he has shown his quality in the Premier League before. If Tottenham can help him regain his form and confidence, they could have a top-class player on their hands.\nDominic Calvert-Lewin needs a fresh start\nThe England international is certainly at the peak of his powers and he will be desperate to get back to his best. Joining a big club could give him the fresh start he needs. Furthermore, the attacking football at Tottenham is likely to suit him better.\nIt remains to be seen how the situation develops.\nTottenham will be hoping to challenge for major trophies in the coming seasons and they will look to compete in the UEFA Champions League regularly. They need quality players at their disposal and the Premier League striker would be a superb addition on a bargain.",
  "word_count": 274,
  "scraped_at": "2026-02-14T01:49:08.094943",
  "_text_extracted": true
}