{
  "article_id": "0250f59a310c",
  "url": "https://www.manchestereveningnews.co.uk/manchester-united-suffer-huge-injury-28834339",
  "title": "Manchester United suffer huge injury blow ahead of Liverpool FA Cup clash",
  "date": "20240317T111500Z",
  "domain": "manchestereveningnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United could be without key player Casemiro for Sunday's game against Liverpool after his withdrawal from the Brazil squad through injury.\nThe defensive midfielder has been a regular feature in the Premier League for Erik Ten Hag's side since returning from a knock in Janaury, having played in all but one league fixture this year. However, Casemiro could now be set to miss an 18th game of the season for United.\nA statement from the Brazilian Football Federation have confirmed that Porto forward Pepe will replace the 32-year-old in the latest Selecao squad. Casemiro's withdrawal has led to question marks over whether he will be available for Sunday's FA Cup quarter-final at Old Trafford, reports the Manchester Evening News..\nREAD MORE: Liverpool injury crisis finally easing but curious case remains and Jurgen Klopp reality clear\nBrazil's coach, Dorival Junior said: \"We have just received a report from Dr. Rodrigo Lasmar. From a pre-list made by the Brazilian National Team's technical committee with 50 names, 13 of them were already away due to injury at their clubs. Unfortunately, we also lost Casemiro. Therefore, Pepe, from Porto, a native striker who now plays as a midfielder, is called up.\"\nThe FA Cup is United's only hope of winning a trophy this season. Ten Hag's team also face a battle to secure Champions League football for next season as they currently sit eight points off the top four.\nOn a brighter note for United, forward Rasmus Hojland is fit for Sunday's match against Liverpool after recovering from a muscle injury. Mason Mount could also be back in action after being out since November with a calf problem.\nThe best LFC news, features, videos and podcasts\nNobody covers Liverpool Football Club in more detail than the ECHO. Our team of reporters follows the Reds home, away and abroad and we have seven days a week coverage of everything from the first team, to the women's team and the Academy.\nHere's how you can get the best LFC news on every platform:\nDownload our premium LFC App for exclusive content and ad-free reading. Apple here and Android here.\nFollow us on Facebook, X (formerly Twitter) and Instagram. Our Blood Red brand is one of the top rated LFC podcasts. You can watch it on Youtube here or search Blood Red podcasts wherever you listen. We're also on TikTok.\nJoin our WhatsApp community for breaking news directly to your phone as it happens and follow our WhatsApp channel for updates and the best pictures.\nSubscribe to our newsletters here for all the news directly to your inbox.\nSubscribe to Dave Powell's Bottom Line newsletter for exclusive business of football news, features and interviews directly to your inbox.\nFollow us on every platform here.",
  "word_count": 458,
  "scraped_at": "2026-02-14T01:48:46.205729",
  "_text_extracted": true
}