{
  "article_id": "02669b8c09e2",
  "url": "https://www.twtd.co.uk/ipswich-town-news/48964/mckenna-the-group-has-shown-fantastic-character",
  "title": "McKenna : The Group Has Shown Fantastic Character - Ipswich Town News",
  "date": "20250215T220000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 15th Feb 2025 18:24\nTown boss Kieran McKenna hailed the fantastic character shown by his side as they held Aston Villa to a 1-1 draw at Villa Park, despite playing 50 minutes with 10 men after Axel Tuanzebe was shown what the Blues manager felt was a “really poor red card”.\nLiam Delap gave Town the lead in the 56th minute with his 10th goal of the season with Ollie Watkins levelling for the home side 13 minutes late with the Blues putting in a hugely impressive defensive performance claim the point.\n“It’s obvious to say, but the group has shown fantastic character there in difficult circumstances,” McKenna said.\n“In the build-up to the game, Leif [Davis] pulled out late yesterday with a little issue, so you see people coming into the squad, Conor Townsend making his first Premier League start. Julio [Enciso], we had him have to go off early in the game.\n“A really poor red card for me in terms of the first yellow card, for me not even a foul, let alone something that can be given a yellow card for, which puts us in a really difficult position with the 10 men.\n“So to be where we were at half-time, to produce the organisation, the spirit, the resilience that we did in the second half, right through the squad with different players coming in having not been on the pitch as much, was a really good sign of the mentality of where the group’s at, the spirit within the group and the supporters were right behind it was well.”\nRegarding Delap’s deftly taken strike, his third against Villa this season, he added: “A really good goal, you always hope that you’ll get a couple of moments. We said at half-time, we felt like we could win the game if we defended well because we knew we’d get one or two moments.\n“You’re hoping you can find the ball to Omari [Hutchinson] in a one-v-one situation and if you create the chance you want it to go to Liam.\n“To be fair, Ben [Johnson]’s hit a great switch out to Omari, he’s really good one-v-one to work the cross and good movement from Liam, and a different type of goal from him as well, in terms of getting across the man on a cross. Really good.”\nMcKenna says Delap having that type of versatility is vital playing in his team: “Very important because if you’re going to be the striker for us in our first season back in the Premier League in 22 years, you’re not going to be facing a low block every game.\n“Some games we’re more dominant and there are more crosses and things like that, some games it’s counter-attacking, some games teams are really high against us and there’s space behind, so you need that balanced threat.\n“With Liam, and to be fair George Hirst being back now is a big boost for us, we’ve got two sort of balanced, physical strikers, who can help us in different ways.\n“Really good for Liam and I think, as I’ve said before, there are not many like him in terms of the mixed threat you’ve got.”\nWhile Delap was making headlines at one end of the field, it was keeper Alex Palmer making them at the other, the January signing from West Brom making a string of saves.\n“Brilliant day for him,” McKenna enthused. “It’s always worth taking stock. I’m not sure how many we’ve had but I think we’re into the high teens for Premier League debuts and every player who makes one is a helluva story and a helluva journey.\n“Alex is another player who has certainly got his. He’s had to work his way to this point, so making a Premier League debut at 28 after all the loans and everything he’s done on his journey, and to do it back in the Midlands, I guess, and then to perform like he did, make some of the saves that he did, and end up helping the team get a point, it’s a great day for him and a great start for us.”\nPut to him that the initial £2 million fee the Blues paid West Brom for his services looks like a bargain, McKenna smiled: “Let’s see. I don’t know the price, to be honest, I don’t ask.\n“He’s worked his way up, done the hard yards to get to the Premier League. He’s got his opportunity now and he certainly took it today.”\nAsked whether goalkeeper had been a problem area for Town until his signing, McKenna responded: “There have been some good performances in the goalkeeping department. Aro [Muric] has had some good performances, Christian Walton’s had some good performances.\n“Of course, Christian’s injury is a problem for us anyway, so we needed to strengthen the department.\n“Alex has different qualities to those two and is in a good rhythm. He’s played almost every minute of the last couple of seasons, so to bring in a goalkeeper who’s in match rhythm and confident at this stage of the season and who has played with two of the back four today as well, in terms of Dara [O’Shea] and Conor [Townsend], to do that at this stage of the season is pretty good business, hopefully.”\nMcKenna says he wasn’t concerned by the early incident when Morgan Rogers went to ground as he ran past Palmer on the right of the Town box, VAR having taken a look after referee Robert Jones had waved away protests from the home side.\n“It was one of those moments that you don’t like to see when the ball’s going one way and the goalie and defenders and the forwards are running towards it,” the Town manager recalled.\n“I wasn’t worried about the decision at the time, to be honest. I thought the striker had got it but the ball had gone big and I didn’t think there was much contact, so I never thought we were going to be in any trouble with VAR.\n“But, of course, as that ball’s bouncing and they’re all running towards it, it’s not a particularly enjoyable moment.”\nThe Blues having lost their previous four matches, the draw looks like a big point both in terms of the way it was won and also in the context of the season as a whole.\n“Hopefully, but you don’t know,” the Northern Irishman continued. “But you do know that every point is hard fought, so to get one here is appreciated and especially how it was done.\n“Hopefully it will be a valuable point in the end, but for us as a football club, to come away to a top team, who are doing so well this season, are doing well in the Champions League, who have only lost one game this year in either competition, with new signings and the bench that they were bringing on in the second half, and to come so close to actually winning the game, I think it’s day when we need to be really proud of the football club.”\nAsked about an exchange with Villa boss Unai Emery at the whistle, McKenna said: “No problem, I shook hands with the staff, who were delighted, of course, with the point before I managed to get over to him, but he’s a top manager and I have nothing but full respect for Unai.”\nTWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nThe less said about the ref on the other hand..................\nSo proud of this group of players, very apprehensive when I saw that Sam and Lief were out with injuries, and what a Premiership debut for Alex Palmer and from the comments a great performance from Townsend.\nI can only hope that Liam decides his future is still with us at the end of the season.\nWe have seen too many leave this club too soon only to disappear into oblivion and not get the playing time they deserved to get.\nPlay like this every game to the end & we have a good chance of staying up.\nWell done lads, COYB’S!!!\nPhillips has to start every week over morsy the build up today was quicker where morsy slows everything down\nI felt sorry for Jack Clarke today who I feel is becoming a scrapgoat for mckenna brings him on after 16 mins to take him off at half time was shocking I understand we had to take someone off but I see mckennas golden boy got to stay on apart from the cross for the goal did nothing again\nas for the referee today he was very poor never a red card as the 1st foul wasn't ever a foul but 5 mins after the axel 1st card mcginn catch greaves later and get nothing\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1495,
  "scraped_at": "2026-02-14T01:49:18.061286",
  "_text_extracted": true
}