{
  "article_id": "02929d913c06",
  "url": "https://theathletic.com/4442230/2023/04/24/arsenal-wolfsburg-comeback/",
  "title": "Patched - up Arsenal show tactical nous in Champions League comeback",
  "date": "20230424T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There are draws that feel like defeats, and there are draws that feel like victories.\nArsenal supporters experienced both this weekend.\nAfter their league-leading men’s side drew 3-3 at home to bottom-of-the-table Southampton on Friday night, leaving them as the outsiders in a two-horse Premier League title race, their women’s team produced an impressive, composed comeback on Sunday, recording an important 2-2 first-leg draw away to Wolfsburg in the Champions League semi-finals.\nAdvertisement\nThe reaction from the stands at full-time told the story — disappointed moans and few whistles from the home crowd, and genuine celebration from the couple of hundred Arsenal fans who had made the trip to northern Germany. Their joy was a reflection of various aspects: a first leg played away from home, a raft of injury problems, and the fact that Arsenal had been 2-0 down. Now, they’re favourites to reach the final.\nThe quarter-final stage ended with some rare kinship between Arsenal coach Jonas Eidevall and his Chelsea counterpart Emma Hayes, and both found themselves in a similar situation this weekend.\nBoth have been forced to cope without two key forwards for much of the campaign (Beth Mead and Vivianne Miedema of Arsenal; Chelsea’s Pernille Harder and Fran Kirby), and readjusted to create a side probably less sophisticated than they originally envisaged. Now, on top of that, they found themselves approaching the semi-finals without two key players from their spine too (Arsenal’s Kim Little and Leah Williamson; Kadeisha Buchanan and Millie Bright for Chelsea).\nAnd both Hayes and Eidevall came to the same conclusion: they needed to switch to a back five.\nIn fairness, Eidevall had little choice. “It suited the players we had available in the best way,” he offered afterwards, effectively saying it wouldn’t have been his preference. He is left with only two players, Lia Walti and Frida Maanum, who are comfortable in the centre of midfield.\nEven then, the use of Maanum in this deeper role, rather than in the No 10 position she has excelled in since Miedema’s injury in December, robs Arsenal of arguably their main attacking spark.\nBut Arsenal needed to keep it tight, and they needed to compete physically against a tough, aggressive Wolfsburg side.\nJen Beattie, the major beneficiary of the formation change, demonstrated that when she clambered over two players to head clear a high ball. Her team-mate Walti also got a whack in the process and needed treatment, but it showed Arsenal were up for the physical challenge.\nAdvertisement\n“The way (Jen) applies herself day in and day out in training is phenomenal,” said Eidevall afterwards. “She has been a culture-setter in what this group is about. If she does that when she is not selected to start games, who can turn around and say, ‘I don’t try harder because I am not playing’? To see her play a game like today makes me so happy. She so much deserved the performance.”\nIn front of Beattie, Walti protected the ball excellently under pressure and won free kicks. Maanum crunched into Lena Oberdorf, Wolfsburg’s world-class defensive midfielder, in the early stages. Arsenal weren’t going to be bullied — which happened a little in their quarter-final second-leg defeat here last year.\nEidevall compensated for his lack of numbers in midfield by asking his centre-forward, Stina Blackstenius, to keep a close eye on Oberdorf. At times she dropped back deeper than the two wide players, Katie McCabe and Victoria Pelova, to ensure Wolfsburg couldn’t find Oberdorf easily.\nArsenal’s weakness came when Wolfsburg played long balls into the space behind their wing-backs, including in the move that brought the opening goal.\nThat specific diagonal, in behind Noelle Martiz, always seemed on the cards because Wolfsburg’s wide players fulfilled different roles. Svenja Huth, on the right, was told to track back with Steph Catley to ensure Wolfsburg dropped into a back five when Arsenal attacked with a front five. But left-sided Sveindis Jonsdottir had a licence to stay high, and Wolfsburg’s first goal came from a diagonal to her, a chest down, and a pass into the path of Ewa Pajor, who finished smartly.\nArsenal’s second concession was self-inflicted, a disastrous mix-up between Beattie and Rafaelle, whose wayward pass allowed Jonsdottir to tap home.\nAt this point, Arsenal might have collapsed. The semi-final might have been over before half-time in the first leg.\nBut despite the two goals, Arsenal’s game plan had actually worked well, and they stuck with their initial approach. They got one back shortly before half-time from a set piece, but crucially it had been won when Maanum, for the first time, played like she does in her No 10 role, bursting forward into the channel and forcing a corner. Rafaelle then atoned for her costly error with a powerful header.\nAdvertisement\nA 2-1 defeat was arguably not a bad result, all things considered, but Arsenal’s performance to win the second half 1-0 was genuinely outstanding.\nWalti helped them take control of the game by continually receiving passes from her defence, protecting the ball and playing calm passes up into attack. There are few players in world football more comfortable in those situations; her hips send opponents the wrong way, and her ambipedal nature means she’s happy turning to her left or her right.\nMaanum, while largely robbed of her ability to make attacking runs, is nevertheless an outstanding deep midfield player; she battled well and played some positive passes up to the forwards.\nWhen Arsenal announced her signing almost two years ago, the club website described Maanum as “an all-round midfielder who can play in a variety of positions (…) capable of playing at the base of midfield in a more disciplined role, while also being able to push forward and progress play with her tidy footwork and positive attacking runs”. That has proved entirely correct. The same player who scored that astonishing opener from the edge of the box in the quarter-final second leg against Bayern Munich last month was happy protecting her back four here.\nAnd while you probably couldn’t say Arsenal’s equaliser was coming, they never looked like conceding a third, which was probably the main priority.\nThe goal itself was a simple finish from Blackstenius after a positive Lotte Wubbon-Moy pass, and good work down the right from Pelova. But it was a fitting goal: Blackstenius symbolised Arsenal’s tactical discipline and deserved a reward for her hard work shadowing Oberdorf.\n“It was very impressive from the players,” Eidevall said, “because it’s a very big difference in how the No 9 has to work in those two different systems. But it helps a lot that when you see the Swedish national team, they play 3-4-3, when Stina has to play that role as a nine, so it makes it much easier because she’s done that before. But it’s a big change, and it wouldn’t have been possible if you can’t draw on that experience.”\nAdvertisement\nAt 2-2, Arsenal killed the game impressively. The referee repeatedly urged them to speed up their throw-ins. Pelova was substituted, and when trying to walk off across the pitch to the other side, was aggressively barged by Oderdorf, who insisted she left the pitch by the touchline she’d been standing on. Wolfsburg knew what Arsenal were up to. They knew this was a missed opportunity.\nCompleting the job won’t be easy, but Arsenal have given themselves a serious chance of reaching the final on June 3.\nAnd with the Emirates set to be nearly full for that return leg, next Monday might turn out to be a truly massive day.\n(Top photo: Martin Rose via Getty Images)",
  "word_count": 1270,
  "scraped_at": "2026-02-14T01:50:29.473229",
  "_text_extracted": true
}