{
  "article_id": "02becb4875bd",
  "url": "https://www.managingmadrid.com/2024/8/18/24222761/into-the-grey-18-aug-2024",
  "title": "Into The Grey : 18 Aug 2024",
  "date": "20240818T053000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A Word From the Author\nInto The Grey: 18 Aug 2024\nAnother Juninho Edition of the Daily Merengue\n“Once more into the fray...”\nThe last good fight I’ll ever know. Live and die on this day. Live and die on this day.\nWelcome to The Daily Merengue — a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nShoutout to the Mods who do a fantastic job, Valyrian Steel, KungFuZizou, NeRObutBlanco, Felipejack, and Juninho (the “King of Mods”).\nAnd Once Again Into The Fray: Real Madrid v. Mallorca\nGameweek 1. It’s been a long summer hasn’t it? Los Merengues are finally back competing for another La Liga title, and it all begins at Estadi Mallorca Son Moix against Mallorca (who finished 15th in the 23/24). Most reports state that we should expect a similar lineup to that which played against Atalanta so let’s pray for a quicker start. I know I know...we will suffer as we always do. Nevertheless, I’d love for this to be a thrilling blowout victory where our Gala XI can better learn to play with each other. Also it’d be excited to see a penalty or free kick just to see who is on what set piece duty. Anyway Hala Madrid y Nada Mas. Vamos chicos!\nA Quick Plea to La Liga\nLet content creators post compilation videos featuring your league. It is virtually free marketing. Of course, I understand the legality of TV rights / sponsorship / branding but you are unknowingly capping your league’s reach as you try to attract emerging football markets. Long gone are the days of sports broadcasting for highlights. It’s 2024.\n#FreeMadridstaTV\nPay-Per-View : JUNINHO 24/25 PREDICTIONS\nUndercard: La Liga Predictions\nCampeones: Real Madrid. (will discuss later)\n2nd — Atletico Madrid. I’ll be honest. I’m not confident with this pick simply because Atletico Madrid has a way of Diego Simeone-ing and bundling every good thing that seems to happen to them. We’ve seen this before where Atleti seem to be on a path to play exciting proactive football with new attacking talents. Then by December, it’s the same Atleti haramball. Anyway, personally, I think Atleti have had an amazing transfer window. Julian Alvarez + Sorloth should rejuvenate their stagnant attack. Gallagher (or Javi Guerra) should reinvigorate the tired legs of their midfield. And finally Le Normand should be a stalwart in their defense. IMO, Atleti should be our closest competitors if they’re willing to change.\n3rd — Barcelona. BBers are probably reading this and calling it “hate.” MMers are probably lauding this take. But there’s no malice in this prediction. I’m just well concerned about our greatest rival’s hopes for this season. Although Hansi Flick is arguably a very good manager (I still think the jury is out), I’m a bit concerned about his tactical fit / Laporta & Deco’s transfer decisions. IMO Barcelona desperately need a functional CDM to make this all work. I don’t trust this high press and line with Bernal / FDJ / fill-in any other La Masia product. I don’t trust Pedri to stay healthy. I don’t trust Lewa to continue to score braces. I do trust Lamine Yamal but even then...he’s only a child. At one point some MMers (no names) trusted Ansu Fati too...(lol). Realistically, Barca will find some way to actually finish 2nd or 1st but as of Gameweek 1. “We Don’t Trust You”\n4th — Insert Basque Team..but really Athletic Bilbao. I could just as easily say Real Sociedad but tbh I have no clue where the goals are coming from at Sociedad, which was a major theme to their drop-off last season. I’m going with Bilbao because I believe this is the year for Nico to make the auspicious leap. I also think Sancet will be a bit more instrumental than he has been in past seasons. I mean...did you see the golazo?\n[insert clip if not for La Liga trying to bring down my shine]\nGot ‘em....!!!!\nMain Card: Real Madrid Predictions\nIf you have any issues with these predictions, please direct your complaints to KFZ.\nLa Liga — 1st Place. We. Have. No. Business. Losing. La Liga. Like really...On paper, this team is better than it was last year by a decent amount while imo our rivals haven’t gotten much better (besides Atletico who finished 19 points behind us). I could be wrong but I don’t think (Sorloth + Julian Alvarez + Le Normand + English McTominay / Javi Guerra) — Diego Simeone Haram Tactics = 19 points. Now we do have a few dark arts superstitions going against us. Carlo Ancelotti has never defended a league title. Real Madrid hasn’t won a back to back title since 2006 - 2008. We have an interesting amount of defensive depth (which isn’t THAT bad but of course isn’t great). We are following a summer with NT performances so a lot of our players will be tired / susceptible to injuries. There are a lot of games. So yea...but you know what we do have? Kylian Mbappe — arguably the best player in the world. Vinicius Jr. — arguably the best or 2nd best winger in the world. Rodrygo — arguably a Top 5-7 RW (even though the MM mandem dislikes him). Jude Bellingham — the best English talent + midfield talent alive. Fede Valverde — a roadrunner (lmao). I’m kidding Fede is arguably a Top 3 box to box midfielder. Rudiger — El Loco. And Camavinga — the best dressed footballer on the planet as well as a dear dear friend of MM.\nWhat do they got?\nChampions League — Semifinals. I don’t really like UCL predictions because its a tournament that involves a significant amount of sheer luck. However, on paper we should arguably be the best or 2nd best team in the world. As long as we don’t run into City (again...), we should be favorites in all of our matchups. Ok maybe not against Atleti cause they seem to find ways to beat us.\nCopa Del Rey — 1st Place. This is more of a hope than a prediction. We all know we’ll get knocked out by Atleti (again) or some team like Zaragoza. But I hope we take the CDR seriously this year. We have the young talent to do so. Also, I’m tired of all this “treble” talk. This should be our year for the elusive treble because imo this team will only get worse next year. Some of this depth (ie Cama / Rodry / Modric / Ceballos / Brahim / Guler) is surely leaving next summer.\nMickey Mouse Trophies (ie CWC, International whatever, etc.) — I dont care. There are too many games. People who brag about sextuples etc should go outside..\nAdvice for the Lil Homie(s)\n“A precipitous slope, a narrow river width, a fast and violent flow. Due to the terrain and the external influence, the state of the water is perfectly decided. And yet, water obeys only itself. Water is only water. Thoroughly water. Absolutely free. ”\n.\n.\n.\n.\n.\n.\nmataauhimade....",
  "word_count": 1190,
  "scraped_at": "2026-02-14T01:54:45.417458",
  "_text_extracted": true
}