{
  "article_id": "02ffd095d2c0",
  "url": "https://www.90min.com/posts/which-clubs-could-actually-sign-kylian-mbappe",
  "title": "Which clubs could actually sign Kylian Mbappe ? ",
  "date": "20240216T151500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Which clubs could actually sign Kylian Mbappe?\n- Mbappe will leave PSG when his contract expires at the end of the season\n- Real Madrid seen as leading contenders for his signature\n- Europe's elite would all be keen to sign Mbappe on a free transfer\nBy Tom Gott\nIt's finally happening. Two years after we all thought Kylian Mbappe would leave Paris Saint-Germain, he's actually leaving.\nHaving confirmed to PSG president Nasser Al-Khelaifi that his time in the French capital is up, Mbappe has put Europe on high alert, with fans all across the globe begging for their owners to make a move, but which clubs have a genuine shot at landing Mbappe?\nHere's a look at all the possible suitors.\nNo chance\nBarcelona\nThere's not a single lever in this, or any, universe that Barcelona could pull to free up the sort of money needed to sign Mbappe.\nThe Blaugrana's finances are still in turmoil, and while they'll never get the chance to sign peak Mbappe on a free transfer again, there's simply no way they can afford his wages, bonuses or literally anything else.\nJuventus\nJuventus' finances aren't catastrophic but they would need to be a whole lot better to be able to pursue Mbappe.\nEven if they had the money, Juve's brand of football under Massimiliano Allegri probably won't be too appealing to a guy trying to prove he's the best attacker on the planet.\nInter\nInter have been one of Europe's elite sides in the past few years, but they've also been flirting with financial ruin for a large part of that period.\nThe project could easily appeal to Mbappe, but the budget simply isn't there.\nBayern Munich\nDo Bayern Munich have the money for Mbappe? Probably, but the thing stopping the Bavarians from making this move is their own morals.\nClub officials have spoken with open disgust towards the finances involved in modern football, begrudgingly accepting the need to change when they splashed out on Harry Kane last summer. This is a whole different level, however, and simply won't be happening.\nTottenham Hotspur\nUnfortunately for Tottenham, they have actually been publicly rejected by Mbappe himself.\nThe French superstar laughed in Tom Holland's face when the actor asked him about joining Tottenham in 2021, and Mbappe later told CNN: \"I don't think I will play for Tottenham in my life.\"\nOuch.\nSlim chance\nChelsea\nMbappe had a trial at Chelsea as a youngster and was pictured in the club's shirt as a kid, so there's likely an affinity towards the Blues, and you just know Todd Boehly would love to land somebody of Mbappe's fame and quality.\nChelsea have spent heavily but do still have plenty left in the tank, especially for a free transfer, but convincing Mbappe to join the absolute carnage we've seen at Stamford Bridge under the BlueCo ownership will be nearly impossible.\nManchester United\nManchester United are one of the biggest clubs on the planet and they're about to be backed by Sir Jim Ratcliffe and INEOS. This is the sort of statement signing any new owner would love to make. It might be a squeeze to make the money work, but United definitely could do it.\nThere's also the intriguing sub-plot that comes from PSG's interest in signing Marcus Rashford as a replacement for Mbappe. United are perhaps the only side that could sway PSG with some sort of swap offer.\nLike Chelsea, however, United have absolutely zero appeal to a win-now megastar trying to become the best in history.\nArsenal\nArsenal's re-emergence as one of Europe's top sides has come at a great time if they want to pursue Mbappe, but is the project one or two years early? The Gunners are really good and are one of the few sides in England who could actually promise some fun to Mbappe, but are they ready to deliver the silverware he's looking for?\nHaving not won those trophies or been a big-enough brand for the last few years, Arsenal won't comfortably be able to finance a move for Mbappe, but they definitely could if they worked hard enough, although it could come at the expense of several other players. Perhaps not the right move, but definitely a plausible one.\nLiverpool\nJurgen Klopp's insistence that Liverpool cannot compete with the big boys financially has bordered on comical at times. If you're trying to sign Moises Caicedo for over £100m, you've got cash. You just might not have Mbappe cash.\nLiverpool have long been touted as one of the main suitors for Mbappe, and a large part of that is a reported bond between the PSG man and Klopp, who might have picked a rough time to publicly confirm he's leaving the club and sending them into a period of uncertainty.\nReal chance\nReal Madrid\nLook, Real Madrid are the obvious favourites here. That's not up for debate. They've been flirting with Mbappe for literal years and have made a big-money offer to bring him to the Santiago Bernabeu with a hefty signing-on bonus.\nAside from the money, Madrid also have the profile to appeal to Mbappe. They're one of the world's best teams, both currently and historically, and they boast a brand matched by few. If you're trying to go down in history as a winner, joining Madrid is probably your best bet.\nManchester City\nIn 2024, the year Mbappe needs to find a new club, there is no better team than Manchester City. They're the reigning Champions League holders, among the favourites to win the whole thing again, and can pretty much guarantee you as much major silverware as you could imagine in the most high-profile league on the planet.\nThe football project is there and the money is definitely there, but where City may fall short is their profile. They probably don't have the brand to tempt Mbappe, whose feelings towards linking up with forced-rival Erling Haaland would make for fascinating reading.\nCity are one of the few teams who could genuinely convince Mbappe from a footballing and financial perspective, but is that enough? Only time will tell.",
  "word_count": 1019,
  "scraped_at": "2026-02-14T01:56:44.629467",
  "_text_extracted": true
}