{
  "article_id": "03027b2621c9",
  "url": "https://www.ewn.co.za/2025/04/26/ipswich-relegated-as-newcastle-chelsea-boost-top-five-bids",
  "title": "Ipswich relegated as Newcastle , Chelsea boost top five bids",
  "date": "20250426T193000Z",
  "domain": "ewn.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ipswich relegated as Newcastle, Chelsea boost top five bids\nAFP\n26 April 2025 | 16:55Out of their depth among the Premier League elite, Ipswich have won just four of their 34 league games.\nEmblematic of the self-inflicted wounds that hampered Ipswich this season, Kieran McKenna's side had Ben Johnson sent off in the 37th minute for two bookings in quick succession at St James' Park.\nNewcastle's Alexander Isak converted a penalty after Jacob Murphy was fouled by Julio Enciso in first half stoppage-time.\nDan Burn's 56th-minute header doubled Newcastle's lead and William Osula's 80th-minute goal left Ipswich with no chance of beating the drop.\nThird-bottom Ipswich are 15 points behind fourth-bottom West Ham with four games left, ensuring their first season in the top-flight for 22 years will end with an immediate return to the Championship.\nOut of their depth among the Premier League elite, Ipswich have won just four of their 34 league games.\nTheir relegation alongside Southampton and Leicester, who were both already condemned to the drop, means all three promoted sides will be back in the second tier next season.\nIpswich's fairytale rise to the Premier League had captured the hearts of football romantics after their successive promotions from League One and the Championship.\nMcKenna, 38, had earned plaudits for Ipswich's attacking style during their surge up the divisions after his appointment in 2021.\nBut the former Manchester United assistant coach was unable to preserve Ipswich's top-flight status.\nNewcastle climb to third place as the League Cup winners eye Champions League qualification.\nEnzo Maresca saluted Chelsea's \"nasty\" performance after a gritty success that kept them in the hunt for a Champions League berth.\nNicolas Jackson struck for the first time since December to seal a vital victory at Stamford Bridge.\nThe Senegal striker's first-half blast from 20 yards moved Chelsea into fifth place with four games left.\n'We were nasty'\nChelsea's third win in their last five league matches eased the pressure on Blues boss Maresca, who has come under fire for his team's cautious tactics during their slump in the second half of the season.\n\"First half we controlled the game, we dominated, created chances and didn't concede nothing. Then second half we dropped a little bit,\" he said.\n\"We were strong, nasty enough when we needed to be like that. Overall I think we deserved to win and we are happy.\"\nRyan Sessegnon struck in stoppage-time as Fulham won 2-1 at Southampton to stop the hosts moving past the record-low Premier League points total set by Derby.\nJack Stephens' 14th-minute opener had Southampton on course for a first home league victory since November, but Emile Smith Rowe levelled for Fulham after 72 minutes.\nA draw would have helped Southampton move onto 12 points and avoid Derby's unwanted lowest-ever Premier League points total of 11 from the 2007-08 season, only for Sessegnon to net in the final seconds.\nBrighton reignited their European push by piling more misery on former manager Graham Potter with a dramatic 3-2 victory over West Ham at the Amex Stadium.\nPotter, who left Albion to join Chelsea in 2022, saw Mohammed Kudus and Tomas Soucek put the Hammers ahead after Yasin Ayari's opener for Brighton.\nBut Kaoru Mitoma headed the Seagulls level in the 89th minute before Carlos Baleba sensationally curled home from distance in stoppage-time.\nBrighton ended a five-match winless run, while West Ham's dismal streak extended to a seventh game without victory.\nPotter has taken just 13 points from 14 games since replacing the sacked Julen Lopetegui in January.\nWolves claimed a club record-equalling sixth successive top-flight win as they put relegated Leicester to the sword with a 3-0 victory at Molineux.\nMatheus Cunha, Jorgen Strand Larsen and Rodrigo Gomes scored for Wolves, who last won six in a row in the top-flight in 1970, while second-bottom Leicester's winless run stretched to 11 matches.",
  "word_count": 644,
  "scraped_at": "2026-02-14T01:55:09.083012",
  "_text_extracted": true
}