{
  "article_id": "03062bd98166",
  "url": "https://www.caughtoffside.com/2024/10/25/liverpool-transfer-target-orkun-kokcu/",
  "title": "Orkun Kokcu father has claimed Liverpool move is possible for his son",
  "date": "20241025T131500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to Halis Kokcu, the father of Orkun Kokcu, a move to Anfield to join Liverpool is possible for his son.\nThe Benfica midfielder has history with Liverpool manager Arne Slot having worked with the Dutchman at Feyenoord in the Eredivisie.\nLiverpool have been persistently linked with midfielder Kokcu, who joined Benfica in 2023 for a fee of around £20 million (via Transfermarkt).\nKokcu made the move from Feyenoord, where he played under manager Slot, establishing himself as a first-team regular with 97 appearances over two seasons and scoring 21 goals under the Dutch coach’s guidance.\nThe Standard has reported that the Premier League giants are keen on signing the attacking midfielder.\nComments from his father have now confirmed suggested that a transfer to the Reds is possible.\nHis father told ESPN NL, as quoted by GOAL:\n“Arne is a good friend of ours. He has been through a lot of things with Orkun. Yes, why not? It’s possible.”\n“The most important thing now is Orkun’s focus, that he does well with Benfica,” he said.\n“But of course, players and trainers don’t have just one station, the staff knows that too. In modern football, clubs think about finances, about making a profit. Orkun is a player who has the potential to make a profit with the next step. The fans and the club are also fine with that, of course. That was also the project. We’ll see where he ends up.”\nDutch manager Arne Slot showed strong belief in Kokcu, naming him Feyenoord captain at just 22—a decision that paid off when the team clinched the Eredivisie title that season.\nNow 23, Kokcu has made an impressive start at Benfica, scoring four goals in nine appearances, and Slot reportedly remains keen to reunite with him.\nOrkun Kokcu can give the Liverpool midfield a new dimension\nKokcu would be a valuable addition to Liverpool’s midfield, offering versatility and skill across various roles while still early in his career.\nLiverpool reportedly dispatched scouts to observe Kokcu’s performance during Benfica’s recent 3-1 Champions League defeat to Feyenoord on Wednesday.\nThe Reds’ interest in Kokcu appears to be growing as they continue to monitor the talented midfielder’s progress.\nIn terms of signing a new defender, Celta Vigo’s Oscar Mingueza could be targeted by the Reds to replace Trent Alexander-Arnold.",
  "word_count": 385,
  "scraped_at": "2026-02-14T01:51:57.639510",
  "_text_extracted": true
}