{
  "article_id": "030a016ed3e5",
  "url": "https://www.aol.co.uk/peter-schmeichel-backs-very-talented-080039153.html",
  "title": "Peter Schmeichel backs  very talented  Rasmus Hojlund to succeed at Man Utd",
  "date": "20250426T111500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Peter Schmeichel backs ‘very talented’ Rasmus Hojlund to succeed at Man Utd\nPeter Schmeichel is convinced Rasmus Hojlund has the talent and mental toughness to come through his challenging spell at Manchester United.\nThe Red Devils went for potential over a proven asset when signing the highly-rated Denmark striker from Atalanta in July 2023 in a £64million deal that could reach £72million with add-ons.\nHojlund showed promising flashes during his first season but has stuttered this term, with the 22-year-old scoring just once in his last 28 club appearances in all competitions.\nSchmeichel knows the pressures that come with playing for United as well as anyone and has helped support his compatriot since moving to Old Trafford, where he is certain Hojlund will prove his worth.\n“The boy is very, very talented,” the former goalkeeper told the PA news agency ahead of United’s Premier League trip to Bournemouth on Sunday.\n“He’s like every other player in that squad – of course short of confidence. Everyone. This is the big thing. Once you don’t win games, the confidence levels drop so it’s been a tough one.\n“I mean, he will come through it. He’s so strong mentally. He will come through it. He’s got really, really good support from his family as well and I know what he can do.\n“Hopefully there’s a bit of success left in this team, and you bring that into your break, you come back in a different frame of mind, new season.\n“I’m convinced that he’s still a very, very valuable player for Manchester United.”\nIt was always a big ask to throw Hojlund in and hope he flourished, with the weight of expectation compounded by the paucity of other striking options and goal output from team-mates.\nSchmeichel says it is wrong to pin it all on one player and hopes United’s poor campaign can be salvaged by Europa League glory.\n“He’s a number nine,” he said. “Number nines need service. It’s not always been the case in this team.\n“The service has not been great, but it’s been everyone so just singling out a player I think is wrong. Football is a team game, and you win and lose as a team. I know it’s cliches and all that, but that is the truth.\n“When you have an off day – which when playing for Man United you shouldn’t really have too many of them – the rest of the team should be in such confident mood that they will carry you through.\n“But this is not happening for anyone in this squad, and it’s just one of them. There’s too many things, too many changes in a short period of time.\n“The good thing is that we still have the Europa League, so we can still dream about Champions League and if that happens it’s all going to change in the summer, and this is where we pin our hopes now.”\nSchmeichel has been a regular this season at Old Trafford, where he will be returning in a coaching capacity at Soccer Aid for UNICEF 2025 on June 15.\n“It’s always great to be there,” he said of United’s home.\n“It’s always great to see people that you’ve known for so many years. That place is a special place to me. There’s no doubt about it.\n“Soccer Aid is really important and I like the whole concept of what UNICEF is doing, so I am really looking forward to it.”\n:: Soccer Aid for UNICEF takes place on June 15 at Old Trafford. Adult tickets start from £20 and juniors from £10. See socceraid.org.uk.",
  "word_count": 601,
  "scraped_at": "2026-02-14T01:52:20.888661",
  "_text_extracted": true
}