{
  "article_id": "030ebb3d68a2",
  "url": "https://www.espn.co.uk/espn/story/_/id/46134192/bafode-diakite-el-hadji-malick-diouf-proving-the-radar-premier-league-transfer-hits%C2%A0",
  "title": "Bafode Diakite , El Hadji Malick Diouf proving to be under - the - radar Premier League transfer hits",
  "date": "20250902T133000Z",
  "domain": "espn.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "While some of the biggest new arrivals in the Premier League are so far struggling to make their mark in the top flight -- *cough* Benjamin Sesko -- some of the less heralded signings are quickly proving their worth to their new employers.\nOver at Bournemouth, Bafodé Diakité was a fairly low-key arrival from LOSC Lille, but is already demonstrating his aptitude for the top tier, while El Hadji Malick Diouf of West Ham United and Sunderland's Wilson Isidor proved this weekend why they could be among the PL's most astute new faces this season.\nA strong defensive record was at the heart of Bournemouth's ninth-placed finish in the Prem last season, with only five teams in the division conceding fewer than their 46 goals last term.\nHowever, the Cherries' fine performances at the back naturally attracted covetous glances from some of Europe's biggest clubs, with defenders Dean Huijsen (Real Madrid), Milos Kerkez (Liverpool) and Illia Zabarnyi (Paris Saint-Germain) securing moves to some of Europe's biggest clubs for a combined £144.5m.\nThis left the club facing an almighty recruitment drive during the summer, with head coach Andoni Iraola needing to recreate last year's solidity with a new cast.\nEnter Diakite, arriving for a cool £34m from Lille, charged with filling one of the vacated centreback positions in the heart of Iraola's backline.\nThe 24-year-old, signing for a club-record fee, was influential as Les Dogues finished fifth in Ligue 1 last season, with their defensive record bettered only by PSG, while also making ten appearances during his first ever Champions League campaign.\nExcelling either on the right or in the heart of the defence, Diakite's physicality stood out in Ligue 1, as did his anticipation and positioning. He proved to be a goal threat on occasion as well, with his potency from set pieces leading to 12 goals for Lille across his three seasons for the club.\nAlready, he looks to have settled quickly at Bournemouth, bouncing back from a testing evening at Liverpool in the Cherries' opener -- where they shipped four -- to playing his part in three consecutive clean sheets, in league games against Wolves and Tottenham Hotspur, and against Brentford in the EFL Cup in midweek.\nDiakite was imposing as Spurs were dispatched 1-0 at home on Saturday, notably making six clearances as the visitors held firm despite all that Thomas Frank's side threw at them.\nJanusz Michaliik rues Tottenham's first loss of the season at home to Bournemouth as he believes it was a missed opportunity for Spurs.\nIndeed, while Richarlison had been one of the league's standout players during the first weeks of the campaign, he was effectively shackled by Diakite, whose aggression and relish for one-on-one tussles helped him get the better of the feisty Brazilian.\nThe Guinea-eligible defender's rugged tackling should make him a fine fit for English football as he further settles, while his ease in possession should enable him to adapt to Iraola's style.\nAdrien Truffert, who signed from Stade Rennais to bolster the backline, also neutralised Mohammed Kudus as Spurs ran out of imagination, while another Ghanaian, Antoine Semenyo, has enjoyed an encouraging start to the campaign despite his own fair share of transfer speculation, suggesting another strong season could be on the cards for the Cherries.\nElsewhere, 20-year-old El Hadji Malick Diouf was also tipped in some quarters to be one of the smartest signings of the window, even though -- in joining West Ham -- he signed for a club who appear to be on the precipice of a troubled campaign.\nThe youngster, like Diakite, didn't get off to the best of starts, having struggled to get to grips with the intensity of the league as Sunderland swatted the Hammers away with a 3-0 victory on the opening day.\nA 5-1 home defeat by Chelsea further heaped the doom and gloom onto the club, although Diouf did register an assist in that match, and followed it up with another this weekend as Graham Potter's side finally picked up their first win as a late blitz secured an unlikely 3-0 triumph at Nottingham Forest.\nDiouf had already played a key role in Jarrod Bowen's 84th-minute opener, starting the move that ultimately led to his goal with a throw-in down the Irons' left flank, before setting up Callum Wilson for their third in the 91st minute.\nThis time, the Senegal youngster's threat from wide areas was clear, as he sent in a looping cross which picked out Wilson just outside the six-yard box, leaving the England international with a simple header from close range.\nDespite the Hammers' toil so far this season, only Jack Grealish has more assists than the West African, with Diouf looking remarkably comfortable as he makes the sizeable leap from Slavia Prague and the Czech top flight to English football.\nThe wideman can now look forward to joining up with his Senegal teammates ahead of their World Cup qualifiers against Sudan and the Democratic Republic of Congo over the coming weeks.\nOver at Sunderland, another former France youth international -- Wilson Isidor -- also appears to be enjoying his first steps in the top flight.\nThe 25-year-old isn't a new face at the Stadium of Light, having featured regularly for the Black Cats during their promotion campaign last term, but Sunderland activated their clause to bring the forward in on a permanent basis in February.\nHaving already scored off the bench in their opening 3-0 victory against West Ham United, he was again the hero this weekend as fellow relegation candidates Brentford were dispatched 2-1.\nHe certainly left it late, bagging a 96th-minute winner as he leapt to head Granit Xhaka's fine whipped cross beyond Caoimhín Kelleher and secure maximum points for the hosts. In finding the net for a second consecutive league game at the Stadium of Light, Isidor becomes the first Sunderland player since Steven Fletcher in 2012 to score in his first two home appearances in the Prem.\nIt was a day for celebration for the Malagasy-Haitian attacker for other reasons, with the goal coming only a day after his partner gave birth to the couple's daughter.\nSunderland head coach Regis le Bris told BBC Match of the Day: \"He had a happy day [on Friday] and another one [on Saturday].\n\"He worked so hard, and he deserved this moment. He flew [on Friday] evening and was ready to go [on Saturday] morning.\"\nThe forward's goal was Sunderland's second latest-ever winner in the top flight, and the latest since 2008.",
  "word_count": 1087,
  "scraped_at": "2026-02-14T01:52:36.762085",
  "_text_extracted": true
}