{
  "article_id": "0310d25552cb",
  "url": "https://www.arsenal.com/news/arteta-basque-return-and-going-one-step-further",
  "title": "Arteta on Basque return and going one step further",
  "date": "20250915T221500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After taking us to the quarter-finals and then the semi-finals of the Champions League in his first two attempts as our boss, Mikel Arteta is hoping that the 2025/26 season sees us continue that progression and go one step further.\nOur campaign kicks off in Bilbao on Tuesday when we take on Athletic Club, and will be our first taste of European action since we fell in the last four to eventual winners Paris Saint-Germain back in May.\nA lot has changed at the club since then with eight new arrivals coming in to bolster the ranks, and Mikel is hoping the ezra strength in dept, added with the experience gained over the past two campaigns and the fire within our squad to achieve more this time round could all prove vital in our quest to lift the continental prize for the first time in our history.\n“That’s the aim in the beginning but we all know that it’s going to be a really long journey,” Mikel mused in his pre-match press conference. “The margins in this competition are super small and you have to be at your very best from day one to give yourself the best possible chance.”\nOn what we learned from last season’s run, he added: “That we are good enough, that we can compete against any opposition on the day. And on top of that, two things have to go your way. You need to have a full squad available when it comes to the most critical moments in the season, and then the ball has to go in at the right moment or with the right decision, it has to because the margins are so small.\n“You take a lot of learnings from [losing in the semis]. It’s painful because it’s not only what we feel, it’s about the expectation that we created and the real conviction that we had within the club, the team, that we could go all the way because we showed a very high level of consistency and quality throughout the competition and learn from it and try to be better.\n“I sense a very clear intention that [the players] want to be better every single day and that’s the start and the end, and there is nothing else to control. Create the energy and belief amongst the players, the understanding and the feeling that we can compete against any opposition and certainly they have that.”\nA first-ever competitive meeting with Athletic Club has allowed Mikel the chance to return to his homeland in the Basque Country, where Bilbao is situated an hour or so away from San Sebastian where he grew up.\nHaving grown up in the region and played for Athletic’s rivals Real Sociedad, Mikel is excited to make his managerial debut in the city in front of a lot of his friends and family.\n“We’re excited to start again from scratch in a beautiful place, in a stadium that is going to generate something special,” he added. “We’re looking forward to that and I’m very excited again to step by step build some momentum, and start to have some wins.\n“We landed in Bilbao, that’s normally where I land when I go back home to San Sebastian, it’s an hour's drive from there. All my family is from there, and you just sense the passion, the rivalry, the football atmosphere. It’s great to be here - I’ve never been in this stadium before, so it’s a good experience.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 608,
  "scraped_at": "2026-02-14T02:26:56.627317",
  "_text_extracted": true
}