{
  "article_id": "032acf22998b",
  "url": "https://www.france24.com/en/live-news/20230423-marseille-reclaim-second-after-late-lyon-own-goal",
  "title": "Marseille reclaim second after late Lyon own goal",
  "date": "20230424T021500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marseille reclaim second after late Lyon own goal\nParis (AFP) – Marseille climbed back into second place in Ligue 1 on Sunday after a 2-1 win at Lyon following a farcical own goal by Malo Gusto with the final kick of the game.\nIssued on: Modified:\nCengiz Under put Marseille in front on the stroke of half-time before Alexandre Lacazette brought Lyon level midway through the second half with his 20th league goal of the season.\nLyon were punished for their failure to deal with a cross deep into added time as Sinaly Diomande hit Chelsea loanee Gusto with his attempted clearance and the ball ricocheted into the net.\nMarseille's first league win in Lyon since 2007 sent them a point clear of third-placed Lens again and snapped their opponents' seven-game unbeaten streak.\n\"I hope it's a turning point but there's still a lot of points to play for between now and the end of the season,\" said Marseille coach Igor Tudor.\n\"It's a really valuable win but we're still far from our objective. This goal in the final second is why people love football.\"\nOnly the top two in Ligue 1 qualify automatically for the Champions League, with the team finishing third entering in the third qualifying round.\nHowever, third place will gain direct entry to the group stage if the winner of this season's Europa League also qualifies for the continent's elite club competition via their domestic championship.\nLyon had clawed to within five points of the European places following a run of just one defeat in 12 outings, but they were undone by their defensive frailties against Marseille.\nUnder gave the visitors the lead when he slid in the rebound after Alexis Sanchez raced clear only to be denied by an inspired Anthony Lopes.\nLacazette continued his fine goalscoring form by turning in a cross from Corentin Tolisso on 68 minutes for his sixth goal in as many games.\nLopes then pulled off a brilliant save to tip Jonathan Clauss' strike onto the bar but could only watch on in horror after the late mix-up in his area.\nHabib Diallo scored twice in a 2-0 win away to Reims to haul Strasbourg out of the relegation zone, while French Cup finalists Toulouse won 1-0 at Lorient.\nMontpellier overcame a red card for captain Teji Savanier to beat Rennes 1-0 courtesy of a late Stephy Mavididi header.\nNice are without a win in seven after losing 2-1 at home to Clermont, while Nantes grabbed an injury-time equaliser to draw 2-2 with Troyes and stay out of the bottom four on goal difference.\nBrest ended the weekend in the drop zone following a goalless draw at Ajaccio, who along with Troyes and Angers look certain to go down.\n© 2023 AFP",
  "word_count": 462,
  "scraped_at": "2026-02-14T02:09:52.172863",
  "_text_extracted": true
}