{
  "article_id": "03587feba5a8",
  "url": "https://www.jamaicaobserver.com/2025/06/13/europes-top-leagues-complete-club-world-cup-tournament-us/",
  "title": "Europe top leagues to complete the Club World Cup tournament in US",
  "date": "20250613T054500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Europe’s top leagues to complete the Club World Cup tournament in US\nWith Europe’s top leagues completed, the Club World Cup takes centre stage with the Lionel Messi-led Inter Miami taking on Egyptian powerhouse club Al Ahly in the opening game of the tournament, then on Sunday, a massive clash when PSG and Atletico Madrid square off against each other.\nEvent # 1 – Club WCUP – AL Ahly vs Inter Miami – 7:00 PM\nThe 2025 Club World Cup kicks off with its 32 teams tournament, and the opening game will feature one of the host team, Inter Miami playing at home against Al Ahly of Egypt. Indeed, Al Ahly enters this competition as the most successful team in Africa, having won the Confederation of African Football (CAF) Champions League in three of the four years they qualified. Indeed, they are more than qualified to participate in the tournament, having won the CAF Champions League in 2021, 2023, 2024 and was runner-up in 2022.\nAl Ahly is the most successful club on the continent and one of the most decorated in the world, with 134 titles across national, CAF, and FIFA competitions. With that said, they recently won their 45th Egyptian league title and were eliminated in the semi-final of the African Champions League due to the away goal rule.\nMeanwhile, Inter Miami enters as the host nation invitee, a selection that was widely criticised, but the Lional Messi-led side will be aiming to silence the doubters with strong performances on the pitch. Indeed, as the host country, the USA was granted a spot, as is customary in the Club World Cups. However, that spot has always been reserved for the league champions of the host country in that particular year. This time, however, MLS and FIFA had not confirmed that this would be the case, and during the 2024 regular season, during the all-star game, the league commissioner said the spot would go to the winner of the 2024 Supporter’s Shield. This decision drew heavy criticism, with many claiming that FIFA always seeks to favour Lionel Messi. The 2024 MLS champion was the Los Angeles Galaxy.\nKey Stats\n• AL Ahly – One of the most successful teams in Egypt, winning 12 CAF Champions League titles and a record 45 Egyptian Premier League titles.\n• Inter Miami – Have won the 2023 League Cup and the 2024 Supporters Shield.\n• Both sides – Al Ahly have scored at least one goal in each of their last eight matches, while Inter Miami have conceded a goal in each of their last 10 matches.\nThe betting tip: Inter Miami win and both teams to score.\nEvent # Club WCUP – PSG vs Atletico Madrid – 2:00 PM\nThe first big heavyweight showdown at this summer’s FIFA Club World Cup will take centre stage on Sunday, when recently crowned Champions League winners PSG will go head-to-head with Spanish heavyweights Atletico Madrid. Indeed, PSG ended their long wait for Champions League glory in the just concluded tournament, and they will be aiming for more glory in this tournament.\nThe French giants will enter this clash with confidence at an all-time high, having emphatically dismantled Inter Milan 5-0 in the Champions League final a few weeks ago.\nAtletico Madrid will enter this tournament with bruised confidence, having finished a frustrating third in the Spanish LaLiga campaign, 12 points adrift of champions Barcelona, despite leading the table at the halfway mark.\nTheir presence at the Club World Cup comes courtesy of a strong UEFA coefficient points accrued in recent years. With that said, Atletico Madrid ended their season on a high, beating Girona 4-0 to close off in style, but having struggled against the bigger sides in Europe in recent years, will they be able to go head-to-head with the best team in Europe on current form. This game might be a tale of offense versus defence as PSG possess one of the best attacking teams in Europe and Atletico Madrid have always been one of the best defensive teams in Europe.\nKey Stats\n• PSG – PSG have scored at least one goal in their last 18 matches in all competitions.\n• Atletico Madrid – Atletico Madrid will be playing in their first Club World Cup in their history. They defeated PSG 2-1 when both teams met in the Champions League last November.\n• Both sides – In the last three meetings between both sides PSG have one win, Atletico one win and the other ending in a draw, Atletico won the last meeting 2-1 in the just concluded Champions League competition.\nThe betting tip: PSG win.",
  "word_count": 774,
  "scraped_at": "2026-02-14T02:09:11.425354",
  "_text_extracted": true
}