{
  "article_id": "037258269ee2",
  "url": "https://www.90min.com/posts/arsenal-willing-to-sell-jorginho-latest-on-emile-smith-rowe-future",
  "title": "Arsenal willing to sell Jorginho & latest on Emile Smith Rowe future",
  "date": "20230608T144500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal willing to sell Jorginho & latest on Emile Smith Rowe future\nArsenal are willing to listen to offers for midfielder Jorginho this summer, 90min understands.\nThe 31-year-old moved to the Emirates Stadium in January as Mikel Arteta looked to galvanise his squad for an unexpected push towards the Premier League title.\nSquad depth had been an issue for the Spaniard, who relied heavily on the likes of Thomas Partey, Granit Xhaka and Martin Odegaard in the first five months of the season, and Jorginho's experience of competing at the top level was seen as a welcome boost as Arsenal looked to shake off the relentless Manchester City.\nJorginho dislodged Partey from his role as a deep-lying playmaker, making 14 appearances in total, but wasn't able to prevent Arsenal's incredible run of results from tailing off. They eventually finished as runners-up to City but remained comfortably ahead of Manchester United and Newcastle.\nHowever, Jorginho's signing was only ever seen as a short-term measure, and 90min understands that Arsenal will not stand in his way this summer should he have the chance to return to Italy.\nFormer Chelsea manager Maurizio Sarri, now in charge of Lazio, is keen to reunite with Jorginho at the Stadio Olimpico, and 90min understands that Serie A winners Napoli and Champions League semi-finalists AC Milan are also interested.\nArsenal are not actively looking to force Jorginho out of the club but are acutely aware that they need to make space in their squad for incomings. Granit Xhaka is leaving the club to join Bayer Leverkusen and Albert Sambi Lokonga, whose loan spell at Crystal Palace didn't work out, is also likely to be moved on.\nTheir exits could facilitate the arrivals of Declan Rice and Moises Caicedo, with Arsenal keen to sign both players despite their lofty price tags.\nWest Ham captain Rice, who lifted the Europa Conference League on Wednesday night, wants to move on to further his ambitions but 90min understands the club will hold firm with their £100m vaulation. Chairman David Sullivan has at least confirmed he'll be leaving.\nAs for Brighton, they may be willing to accept around £80m for Caicedo - a figure Arsenal were not prepared to way in the January transfer window. The Gunners may need to pull out all the stops this time round as big-spending Chelsea are interested in signing the pair for new head coach Mauricio Pochettino - they too have players to move on and a wage bill that needs significant trimming.\nREAD MORE FROM THE 90MIN TALKING TRANSFERS TEAM\nEmile Smith Rowe not for sale, Reiss Nelson contract extension close\nArsenal have no plans to sell attacking midfielder Emile Smith Rowe, 90min further understands, amid speculation over his future in north London.\nThe 22-year-old signed a new five-year contract back in July 2021 and was handed the number ten shirt made famous by Dennis Bergkamp. A firm fans' favourite, he went to enjoy a superb 2021/22 campaign, scoring ten Premier League goals, but struggled to make an impact last season because of a groin injury that required surgery.\nSmith Rowe was then unable to dislodge Gabriel Martinelli from the starting lineup upon his return, and further competition for places was added when Leandro Trossard arrived from Brighton & Hove Albion in January.\nBut despite playing just 161 minutes of Premier League football, sources have told 90min that Arsenal have no intention of selling and hope Smith Rowe, who was previously the subject of rejected bids from Aston Villa worth at least £25m, can recapture his best form next season.\nThe Gunners are also finalising a contract extension for winger Reiss Nelson, who is set to sign a new long-term contract despite concerns of his own around game time.\nLISTEN NOW\nOn this week's edition of Talking Transfers, part of the 90min podcast network, Scott Saunders is joined by Toby Cudworth and Graeme Bailey to discuss Ange Postecoglou's appointment at Spurs, Man Utd chasing Rasmus Hojlund, Harry Kane to Real Madrid, Lionel Messi & more!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 683,
  "scraped_at": "2026-02-14T02:00:19.982070",
  "_text_extracted": true
}