{
  "article_id": "037c76edb9b8",
  "url": "https://thepeoplesperson.com/2024/04/10/joshua-zirkzee-super-agent-working-on-deal-to-send-man-united-striker-target-to-aston-villa-278693/",
  "title": "Joshua Zirkzee : Super - agent working on deal to send Man United striker target to Aston Villa - Man United News And Transfer News",
  "date": "20240410T233000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Super-agent Kia Joorabchian is understood to be working on a deal to send Bologna striker and reported Manchester United target Joshua Zirkzee to Aston Villa.\nUnited have been previously linked to Zirkzee, with Sir Jim Ratcliffe and INEOS thought to be keen on securing the services of a striker to share the goalscoring burden with young Rasmus Hojlund.\nDespite showing encouraging glimpses of his brilliance and the player he can become, Hojlund still requires help and cannot be relied upon to lead the United line on his own. The Red Devils also require quality depth in the number nine position.\nSo far, United have been mentioned to be in for talismans like Evan Ferguson, Ivan Toney, Thalys and of course, Zirkzee.\nA recent report covered by The Peoples Person explained that Erik ten Hag’s side are not the only side weighing up a move for Zirkzee, who is also admired at Arsenal and AC Milan.\nIt was communicated that the Dutch forward prefers a transfer to AC Milan over England as he already knows the Serie A very well and wouldn’t need to undertake a period of adaptation to a new league as would be the case if he moved to the Premier League.\nMeanwhile, Bologna want to keep their prized asset despite the mounting interest in his services both from Italy and abroad.\nAccording to Il Resto del Carlino (via Bologna Sports News), Aston Villa have also joined the race for Zirkzee and have moved to steal a march on other suitors by starting to work on a deal to lure the goalscorer to Villa Park.\nVilla are now in the driving seat to sign Zirkzee and have the advantage of the expertise of their sporting director Monchi, who knows the Italian football landscape well and has very good connections from his time at AS Roma.\nMonchi wants the United target, especially considering Villa are on track to qualify for the Champions League and their primary source of goals, Ollie Watkins is attracting overtures from bigger clubs due to the prolific 2023/24 season he is currently enjoying.\nIt’s believed that the Villa management has already established contact with Joorabchian to get a deal for Zirkzee going, ahead of clubs like United.\nZirkzee’s representative has made it clear that his client wants wages of around €4m a year. He currently earns a salary of between €800k – €900k.\nMeanwhile, Bologna want €60-70m in terms of the transfer fee to permanently part ways with the 22-year-old. It’s important to note that Bayern Munich retain a €40m buy option to exercise at the end of the season.\nIt’s easy to see why United are following Zirkzee. He has plundered 10 goals and three assists in 29 top-flight games.\nThe Netherlands international is an adaptable forward who stands at 6ft 4in. His stature and power enable him to be an aerial threat and he has previously been compared to Barcelona’s Robert Lewandowski.\nZirkzee is adaptable and can be deployed both as a target man or as a link-up striker tasked with bringing others into play by holding up the ball.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 538,
  "scraped_at": "2026-02-14T01:56:51.557855",
  "_text_extracted": true
}