{
  "article_id": "03acd586e1ab",
  "url": "https://www.fourfourtwo.com/features/world-cup-winners-without-playing-a-match",
  "title": "World Cup winners without playing a match",
  "date": "20240523T090000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "World Cup winners without playing a match\nSome top players have won World Cups without appearing for a single minute. Here, a look at some notable examples...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWinning the World Cup is usually the pinnacle of any player's career. But not always.\nWhen England won the tournament on home soil in 1966, legendary striker Jimmy Greaves was depressed. He had lost his place due to injury earlier in competition and was unable to win it back.\nGreaves did not receive a medal until over 40 years later and cut a forlorn figure as his team-mates celebrated. But at least he played at the tournament.\nMany were less fortunate, watching from the sidelines for an entire World Cup-winning campaign as their team-mates triumphed. Here, a look at some players who won football's greatest prize without playing a single minute...\n32. Roman Weidenfeller\nA two-time Bundesliga winner and Champions League runner-up in a long spell at Borussia Dortmund, Roman Weidenfeller was one of the best German goalkeepers of his generation.\nPicked in the squad for the 2014 World Cup, Weidenfeller was back-up to the great Manuel Neuer and was one of one of five German players who did not play a single minute in their team's triumph in Brazil.\n31. Giuseppe Dossena\nGiuseppe Dossena had long spells at Torino and Sampdoria in the 1980s and early 1990s and the midfielder was also part of Italy's squad at the 1982 World Cup.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nDossena won 38 caps for the Azzurri between 1981 and 1987. He was an unused substitute as Italy won the World Cup in 1982, despite being handed the iconic number 10 shirt for the tournament in Spain.\n30. Pepe Reina\nPepe Reina was a fixture for Spain through their three consecutive major tournament wins between 2008 and 2012.\nThe former Liverpool goalkeeper was in the squad at Euro 2008, at the 2010 World Cup and again at the European Championship in 2012. He played one match in 2008, but did not make an appearance in 2010 or 2012.\n29. Bernard Lama\nBernard Lama won 44 caps for France between 1993 and 2000 and the former Paris Saint-Germain goalkeeper was part of the squads which triumphed at the 1998 World Cup and Euro 2000.\nLama was back-up to Fabien Barthez on both occasions and retired from international football in 2000, at the age of 37. At club level, he played for one further season with Rennes.\n28. Franco Armani\nFranco Armani was handed the number 1 shirt by Argentina ahead of the 2022 World Cup, but the River Plate goalkeeper was back-up to Emiliano Martínez in Qatar.\nArmani and fellow goalkeeper Gerónimo Rulli were the only two members of Argentina's squad not to feature on the pitch in the South Americans' World Cup win, with all of the outfield players used by coach Lionel Scaloni at some stage.\n27. Carlos Castilho\nCarlos Castilho won the World Cup twice with Brazil in 1958 and 1962, but the legendary goalkeeper didn't make an appearance in either tournament.\nCastilho played almost 700 games for Fluminense in a long career with the Rio de Janeiro club. Back-up to Gilmar in 1958 and 1962, he went to four World Cups in total but only played in the 1954 edition.\n26. Andreas Köpke\nAndreas Köpke played for his country between 1990 and 1998 and was the starter between the sticks as Germany won Euro 96.\nKöpke earned 59 caps in total and was part of the West Germany squad which won the 1990 World Cup, although he did not play a single minute in that triumph. He retired from international duty after the 1998 World Cup.\n25. Norman Hunter\nNorman Hunter was back-up to Bobby Moore for most of his England career and the Leeds United legend was limited to just 28 caps for the Three Lions.\nHunter was part of the England squad at the 1966 World Cup, having made his international debut the previous year, but was an unused player as Alf Ramsey's side won the trophy.\n24. Ricardo La Volpe\nRicardo La Volpe might be best known for coaching Mexico at the 2006 World Cup in Germany, but the Argentine also won the tournament as a player.\nLa Volpe, who played for San Lorenzo at the time, was Argentina's third-choice goalkeeper behind Ubaldo Fillol and Hector Baley at the 1978 tournament and did not play as the South Americans won the trophy on home soil.\n23. Giovanni Galli\nGiovanni Galli was in goal for AC Milan as the Rossoneri won the European Cup back to back in 1989 and 1990 and was also Italy's starter between the sticks at the 1986 World Cup.\nIn 1982, Galli was part of Italy's squad which won the World Cup as he deputised for captain Dino Zoff and did not make an appearance. After the 1986 World Cup, he was never picked for Italy again.\n22. Émerson Leão\nÉmerson Leão won 80 caps for Brazil and the former Palmeiras goalkeeper was a starter for the South Americans in the 1974 and 1978 World Cups.\nLeão made his international debut in 1969 and was a non-playing member of Brazil's World Cup-winning squad in 1970. He was also a back-up at the 1986 tournament.\n21. Jupp Kapellmann\nA three-time European Cup winner with Bayern Munich and once the Bundesliga's most expensive player, Jupp Kapellmann was a fine midfielder and defender in the 1970s.\nKapellmann was part of West Germany's World Cup-winning squad in 1974, but did not make a single appearance in the tournament. After retirement, he became a doctor.\n20. Alphonse Areola\nDespite picking up just a handful of caps for France over the years, Alphonse Areola was a World Cup winner with Les Bleus at Russia 2018 as back-up to Hugo Lloris.\nAnd the former Paris Saint-Germain goalkeeper almost became a two-time winner without playing as France narrowly lost out to Argentina on penalties in the final of Qatar 2022.\n19. Sergio Almirón\nSergio Almirón was given the number 1 shirt by Argentina for the 1986 World Cup due to the policy of players being allocated numbers alphabetically – except for Diego Maradona, who wore the no. 10.\nAlmirón did not feature for Argentina as the South Americans won the tournament in Mexico, with the former Newell's centre-forward one of three players unused by coach Carlos Bilardo.\n18. Helmut Kremers\nErwin and Helmut Kremers were the first twins to play in the Bundesliga and the two featured together for Borussia Monchengladbach, Offenbach Kickers and Schalke in the 1970s.\nBoth were West German internationals. Striker Erwin was part of the squad which won the European Championship in 1972 and defender Helmut was in the group which claimed the World Cup two years later, albeit without playing a match.\n17. Jimmy Armfield\nJimmy Armfield was capped 43 times by England between 1959 and 1966 and the former Blackpool full-back was captain for 15 of those.\nArmfield was also a member of England's World Cup-winning squad in 1966, but had lost his place to George Cohen by then and also picked up an injury in a game against Finland ahead of the tournament, so did not feature on the pitch in the Three Lions' victorious campaign.\n16. Coutinho\nCoutinho was one of the great Brazilian players of the 1950s and 1960s, scoring prolifically alongside Pelé in a special Santos side.\nA Brazilian international between 1960 and 1965, Coutinho was due to be a starter at the 1962 World Cup but suffered an injury on the eve of the tournament and did not make an appearance as the South Americans retained the title.\n15. Daniele Massaro\nDaniele Massaro's goal against Mexico at the 1994 World Cup helped Italy qualify for the knockout stages, but the midfielder saw his penalty saved by Taffarel in the shootout against Brazil in the final as the Azzurri's campaign ended in sadness.\nTwelve years earlier, Massaro had experienced World Cup joy as part of the victorious squad in 1982, albeit without playing a match for Enzo Bearzot's side in Spain.\n14. Matthias Ginter\nMatthias Ginter has won over 50 caps for Germany and the centre-back was part of the squad which won the 2014 World Cup in Brazil.\nGinter made his Germany debut as a late substitute in a friendly against Chile in March that year and was an unused squad player in Brazil. Also part of the squad in 2018, he had to wait until 2022 to make his debut in a World Cup as he came off the bench in added time in Germany's 4-2 win over Costa Rica.\n13. Mauro\nMauro Ramos lifted the World Cup trophy as Brazil captain in 1962 and became a two-time champion, having also been in the squad which won the trophy in 1958.\nIn the 1958 World Cup, Mauro was a reserve at centre-back for captain Hilderaldo Bellini and did not play. Four years later, Bellini was back-up for Mauro as he skippered the side.\n12. Víctor Valdés\nVíctor Valdés is one of Barcelona's greatest-ever goalkeepers for many, the best of them all. Between 2002 and 2014, the Catalan racked up over 500 appearances and made a memorable contribution in a glorious era for the Blaugrana.\nPicked for Spain by Vicente del Bosque between 2010 and 2014, Valdés was capped 20 times and was part of the squads which won the 2010 World Cup and the European Championship two years later. Back-up to Iker Casillas, he did not play in either of those tournaments.\n11. Hilderaldo Bellini\nHilderaldo Bellini was one of Brazil's great defenders and as captain in 1958, he was the first Brazilian to lift the World Cup.\nBellini skippered the South Americans to victory in Sweden and was a winner again four years later, but he did not play a match at the 1962 tournament in Chile.\n10. Pietro Vierchowod\nPietro Vierchowod was part of a special generation of Italian defenders in the 1980s and 1990s and is a legend at Sampdoria, where he played for 12 years between 1983 and 1995.\nThe tenacious centre-back won 45 caps for Italy between 1981 and 1993. He was part of Italy's World Cup-winning squad in 1982, but did not get onto the pitch in Spain.\n9. Dida\nIf somebody asked who played in goal for Brazil at the 2002 World Cup, you might say it was Dida. But if you did, you would be wrong.\nAlthough he won fewer caps overall and was less known internationally after spending his entire career with Palmeiras, Brazil's starter in their 2002 World Cup-winning campaign was Marcos. Dida was in the squad, but didn't play a single minute in Japan and South Korea.\n8. Frank Mill\nA popular player in long spells at Borussia Monchengladbach and Borussia Dortmund in the 1980s and early 1990s, Frank Mill represented West Germany in two Olympic Games and won a bronze medal in Seoul in 1988.\nTwo years later, he earned a surprise call-up for the 1990 World Cup from West Germany coach Franz Beckenbauer and was part of the squad which won the trophy. As fourth-choice striker behind Rudi Völler, Jürgen Klinsmann and Karl-Heinz Riedle, he didn't play a single minute at Italia 90.\n7. Angelo Peruzzi\nAngelo Peruzzi is regarded as one of the great Italian goalkeepers, but ahead of him was the greatest of them all: Gianluigi Buffon.\nPeruzzi won 31 caps for Italy between 1995 and 2006 but was behind Buffon for most of his international career and won the World Cup as back-up to the Juventus legend in 2006. He retired from Italy duty after the tournament.\n6. Raúl Albiol\nRaúl Albiol collected 58 caps for Spain between 2007 and 2021 and was part of the squad which won the 2010 World Cup in South Africa.\nThe former Valencia, Real Madrid and Napoli defender picked up an injury in training following a clash with team-mate Fernando Llorente and ultimately did not play a single minute. He was the only outfield player not used by Spain coach Vicente del Bosque in the tournament.\n5. Pepe\nJosé Macia, better known as Pepe, was a legendary forward who played alongside Pelé at Santos and for the Brazilian national team in the 1950s and 1960s.\nPepe was due to start for Brazil in the 1958 and 1962 World Cups, but suffered injuries on the eve of both tournaments and lost his place to Mário Zagallo. He did not feature in either campaign and is a two-time World Cup winner without ever having played in the tournament.\n4. Adil Rami\nAdil Rami made three appearances for France in 2018 and was called up to the squad for the World Cup in Russia by coach Didier Deschamps.\nBut the central defender did not feature in any of Les Bleus' seven matches in the tournament and was the only unused outfield player in Deschamps' 23-man squad.\n3. Franco Baresi\nFranco Baresi was included in Italy's squad for the 1980 European Championships alongside his brother Giuseppe, but neither played a single minute.\nTwo years later, the AC Milan defender was included in Italy's World Cup squad, but again did not feature as the Azzurri went on to win the tournament. Later, he became a legend for club and country, spending his entire career at Milan and helping Italy reach the 1994 World Cup final. However, that match ended in agony as the centre-back missed a penalty in the shootout as Italy lost to Brazil.\n2. Daniel Passarella\nDaniel Passarella lifted the 1978 World Cup as Argentina captain, but the legendary defender did not play a single minute as the Albiceleste won the trophy again in 1986.\nPassarella lost his place to José Luis Brown after a bout of enterocolitis and ended up sitting out the entire tournament. Despite appearing with a big smile alongside Diego Maradona in an image for El Gráfico ahead of the tournament, the two men did not have a good relationship and the defender later claimed the captain and coach Carlos Bilardo made sure he was out. In any case, Passarella remains the only Argentine player to have won the World Cup twice.\n1. Ronaldo\nRonaldo was already a prodigious talent in 1994 and having made his Brazil debut earlier in the year, the striker was selected for the World Cup at the age of 17.\nThe teenager did not play a single minute as Brazil won the trophy for a fourth time, but said he was \"overjoyed\" to be there. He was known as Ronaldinho at the time (little Ronaldo) because there was already a Ronaldo in the squad. That Ronaldo later became known as Ronaldão (big Ronaldo) and a few years later, there was of course another Ronaldinho. Anyway, Ronaldo went on to win the World Cup again in 2002 as Brazil's top scorer and star player in Japan and South Korea.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 2686,
  "scraped_at": "2026-02-14T02:01:16.458217",
  "_text_extracted": true
}