{
  "article_id": "03b976980577",
  "url": "https://www.90min.com/posts/5-man-utd-players-tipped-to-leave-old-trafford",
  "title": "5 Man Utd players tipped to leave Old Trafford",
  "date": "20231216T031500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "5 Man Utd players tipped to leave Old Trafford\n- Man Utd to try and clear deadwood during January transfer window\n- Red Devils enduring poor 2023/24 season so far\n- Casemiro and Raphael Varane among players who could leave\nBy Sean Walsh\nIt's only been about 10 or 11 days since Manchester United were the form team of the Premier League.\nUnfortunately, life moves quickly. So does football. Welcome back to the misery well, Red Devils.\nUnited have been dumped out of the Champions League - and Europe altogether - while their next match comes away at Premier League table-toppers Liverpool.\nSir Jim Ratcliffe's purchase of a minority stake in the club is still subject to completion. Graham Potter has been linked with the manager's job. And, of course, buzzwords like 'clear-out' and 'rebuild' have been floating around the United bubble of discourse on the eve of the January transfer window.\nWhich players could be shifted over the next month or so? Let's take a look at five prime contenders.\nCasemiro\n90min reported on Friday that Casemiro has accepted his future lies away from Old Trafford and so is prepared to leave in January.\nHe is a target for the Saudi Pro League, and though Paris Saint-Germain would also be keen on a deal, they are likely to be hamstrung by Financial Fair Play constraints.\nCasemiro turns 32 in February and considering United could actually get pretty close to recouping the £60m they paid to Real Madrid for his services, this feels like a perfect time to sever ties. It's back to the 'who should United sign to anchor their midfield?' drawing board.\nRaphael Varane\nReal Madrid have, at least in part, been able to refresh and reinvigorate their squad with some of the world's best young talent thanks to United's willingness to take their senior stars off their hands.\nSeems like a completely fair trade-off.\nRaphael Varane enjoyed a bounce-back campaign last season but has mysteriously fallen out of favour this term even when fit.\n90min revealed on Thursday his contract is set to expire in 2024 and his long-term future remains uncertain. With United in the hunt for a new centre-back, it would make sense to part ways with Varane soon.\nJadon Sancho\nOver three months on from their initial spat, Jadon Sancho remains firm in his refusal to apologise to manager Erik ten Hag for questioning his decision to drop him.\nHe would be interested in returning to former club Borussia Dortmund, though 90min understands reports suggesting United have held talks over a swap deal with Donyell Malen are wide of the mark.\nSancho is still only 23 and has a long career ahead of him, but he's got a lot of time to make up for after such an underwhelming spell at Old Trafford. Who's ready to take on a distressed asset?\nAnthony Martial\nIf Anthony Martial stays at United until the end of the 2024/25 season, he will be due a testimonial.\nSadly, it's pretty unlikely he will survive at Old Trafford that long, with the club set to decide against triggering the extension clause in a contract which expires in June 2024.\nMartial, thanks for the black-glove images, the ice-cold celebrations, the 2019/20 season where you randomly became world class for no reason, but it's time to say goodbye.\nDonny van de Beek\nFor a multitude of reasons, Donny van de Beek just hasn't worked out at United.\nHe was a vital piece of Ten Hag's Ajax team that reached the 2019 Champions League semi-finals but has been unable to replicate that form in England, both with and without the Dutch boss by his side.\nA January loan to Eintracht Frankfurt is on the cards.",
  "word_count": 622,
  "scraped_at": "2026-02-14T01:56:38.154795",
  "_text_extracted": true
}