{
  "article_id": "03df73cc96b0",
  "url": "https://kawowo.com/2023/04/26/know-your-stars-forward-innocent-media-the-electric-finisher/",
  "title": "KNOW YOUR STARS : Forward Innocent Media , the electric finisher",
  "date": "20230426T224500Z",
  "domain": "kawowo.com",
  "source_country": "Uganda",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Overview:\nInnocent Media commenced his football career at the age of 10 years. He has since featured for St Mark Primary school in Koboko, Koboko Parents S.S, Sentah College – Mbarara, Buddo S.S Koboko Raising stars, Nyamityobora U-17 team and lately Arua Hill Sports Club in the Uganda Premier League.\nFootball forwards (strikers) are special characters whose main aim on the field of play among others is to put the ball past the goalkeeper into the back of the net.\nIn whichever fashion the ball gets into the net, fans and players alike fist-punch, shout, jump and hurl in insane celebrations.\nDeft tap-ins, sweet over-head kicks, bullet shots, headers, wonder lobs, chested finishes, long range shots and low drives, strikers score in all styles.\nArua Hill Sports Club striker Ronald Innocent Media has transformed goals to be his staple diet.\nMedia, 21, has scored the goals in all the aforementioned styles.\nHe is the second child in the family of six to Alex Awule and Grace Sakaya, born on 28th March 2002 in Koboko district.\nHis nick-names; “Ogara” a Lugbara tag for an axe and “Electric Finisher” boldly elucidate the brave manner by which he easily finds the back of the net.\n“As I was growing up, I was nick-named Ogara which means an axe. People described the lethal way I would finish similar to that of a sharp axe. When I transferred to Buddo S.S, I was baptized as Electric finisher due to the manner I finished the ball into the net” he recollects.\nHe is a big fan of on form Nigeria and Napoli football club striker Victor James Osimhen as well as retired Manchester United forward Wayne Rooney.\nLocally, he was inspired by KCCA forward Muhammed “Jargasson” Shaban.\nHe is best known for his exceptional positional sense, anticipation, quick reaction and natural finishing instincts.\nProgressive Football Journey:\nMedia commenced his football career at the age of 10 years. He has since featured for St Mark Primary school in Koboko, Koboko Parents S.S, Sentah College – Mbarara, Buddo S.S Koboko Raising stars, Nyamityobora U-17 team and lately Arua Hill Sports Club in the Uganda Premier League.\nHe was scouted to the Arua Hill Sports Club team by coach Bosco Dudu in 2020.\nIn 2021, under Charles Livingstone Mbabazi as head coach, he attained the license to play for the senior team in top flight league, scoring four goals.\nWhen he completed A-level at Buddo in 2022, he became a regular for Arua Hill S.C and has since scored 7 goals during the current 2022-2023 season.\n“I yearn to play in the UEFA Champions League. This is the main reason, I want to keep my feet on the ground, work diligently and progress ahead” he opens up on his dream.\nOn any day, Media prefers a well-cooked dish of rice and meat.\nHe has already played for the South Sudan U-20 and U-23 national teams with a prospect of playing for the senior team as well.\n“I was born in Uganda but I have played for the South Sudan U-20 and U-23 junior teams. I have been approached by officials from FUFA to play for Uganda Cranes at the senior level. That will be a decision to think of” he notes.\nGiven his promising form, Media has already attracted the keen eye of domestic and foreign based scouts and agents with offers for a number of clubs in Uganda, CECAFA region and in Europe.\nAll these are stepping steps to the big dream of playing in the UEFA Champions League.\nDetailed profile:\n- Full Names: Ronald Innocent Media\n- Date of Birth: 28th March 2002\n- Nick-names: Ogara, Electric Finisher\n- Place of Birth: Koboko district\n- Parents: Alex Awule & Grace Sakaya (2nd born out of 6)\n- Role Models: Muhammed Shaban (KCCA & Uganda Cranes), Victor Osimhen (Nigeria & Nappoli) & Wayne Rooney\n- Strong feet: Right\n- Key weapons: Awesome positioning, agility & exceptional finishing\n- Football journey: Koboko Raising Stars, Nyamityobora U-17 team, Arua Hill Sports Club (currently)\n- Education: Pearl Kindergarten, St Mark Primary School, Koboko Parents (S1 & S2), Sentah College Mbarara (S3), Buddo S.S (O&A Level – Studied Geography, Entrepreneurship & Fine Art with ICT in S6)\n- Best Dish: Rice & Meat\n- Dream: To play in the UEFA Champions League",
  "word_count": 720,
  "scraped_at": "2026-02-14T01:50:29.467080",
  "_text_extracted": true
}