{
  "article_id": "0415fe6a5e0b",
  "url": "https://www.france24.com/en/live-news/20240101-kylian-mbappe-s-future-to-dominate-transfer-window",
  "title": "Kylian Mbappe future to dominate transfer window",
  "date": "20240101T053000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "French football star Kylian Mbappe's future to dominate transfer window\nThe future of Kylian Mbappe and his protracted courtship by Real Madrid is expected to be the key theme of the transfer window that opens in Europe on Monday.\nArsenal's search for a proven goalscorer to spearhead their challenge for a first Premier League title since 2004 could also loom large.\nManchester City meanwhile are widely expected to let Kalvin Phillips leave the club, ending a disappointing stay for the former Leeds midfielder who has failed to make his mark at the world champions.\nMuch attention though will again focus on Mbappe, Paris Saint-Germain's lethal finisher and the man who a year ago scored a hat-trick for France in the World Cup final only to finish on the losing side.\nReal Madrid are again the main suitor for the 25-year-old whose contract at PSG expires in June -- will the 14-time European champions finally get a commitment from the player they have been pursuing for years?\nIt is far from certain though as Mbappe triggers an extraordinary reaction in France, illustrated when President Emmanuel Macron intervened to persuade him to stay at PSG in June 2022 when a move to Real seemed almost cut and dried.\nReal are not sitting on their hands though. Endrick, the latest Brazilian starlet, will join the club from Palmeiras when he turns 18 in July 2024 for a fee reported to be 72 million euros.\nToney to the Gunners?\nArsenal's lack of a goalscoring edge could lead them to plunge into the market. For weeks, their rumoured target has been Ivan Toney, the Brentford forward whose ban for over 200 breaches of the Football Association's gambling rules ends in mid-January.\nHowever, Brentford's decline in form which has seen them drop to within four points of the relegation places could persuade the club to hang onto 27-year-old Toney, even in the face of a big offer from the Gunners.\nKalvin Phillips was riding high when the midfielder joined City on the back of England's run to the Euro 2022 final, but he has played barely a handful of games for the club and Pep Guardiola has admitted the move never worked out.\nJuventus have reportedly been keen to sign Phillips, who is desperate to force himself into England's plans for Euro 2024, but reports from Italy say the club are cooling on the idea.\nA move to Newcastle looks a more realistic possibility as the Magpies look to bolster a squad seriously depleted by injuries and the 10-month ban handed down to Italian midfielder Sandro Tonali, also for gambling.\nEddie Howe’s men have slumped down the Premier League table in recent weeks and the Saudi-owned club look badly in need of reinforcements if they are to qualify for next season's Champions League.\nSerhou Guirassy, the prolific Guinea international who has scored 17 Bundesliga goals so far this season for Stuttgart, has also been linked with a move to Tyneside.\nNewcastle could also turn to their connections in the Saudi Pro League. They are allowed to sign players on loan from sides also controlled by their Saudi owners, after a vote by Premier League clubs on a temporary ban on related-party loans failed to receive the required support.\nHowever, one target, Ruben Neves, said in early December he would not accept a move to Newcastle because his family was happy in Saudi Arabia.\nLiverpool forward Roberto Firmino also headed to the Saudi league in the summer, but is reportedly unsettled at Al Ahli.\nThe Brazilian, 32, could now be heading to their rivals Al Ettifaq, the club coached by former Liverpool captain Steven Gerrard, although Premier League strugglers Sheffield United are also said to be interested in his services.\n(AFP)",
  "word_count": 624,
  "scraped_at": "2026-02-14T02:13:24.755589",
  "_text_extracted": true
}