{
  "article_id": "043c5fef6c79",
  "url": "https://theathletic.com/live-blogs/womens-world-cup-live-news-updates/DXcrsOVTMpcs/F2fWJ83tlIO5/",
  "title": "How to turn a Women World Cup star into a global brand",
  "date": "20230817T113000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Women’s World Cup 2023 news and updates\nWomen's World Cup latest\nHeadlines\n- Women's World Cup final — match hub\n- Spain vs England in final: Everything you need to know\n- Sweden beat Australia in third-place play-off\n- Andonovski out as USWNT head coach — official\nFeatures\n- Miedema: How Wiegman will handle World Cup final\n- Mewis: What it’s like to play in a World Cup final\n- Arjan Veurink: Wiegman's 'tactical genius' right-hand man\nStay updated\nHow to turn a Women's World Cup star into a global brand\nAs the World Cup plays out across television screens and on mobile devices around the world, the question every marketing executive is asking is: Who is the star?\nWho is the player that will emerge from this tournament as a “must-have” for brands looking to capitalise on the growing stature of the women’s game?\nOnce that is decided, then the real work begins...\nHow Spain overcame past demons to inch closer to World Cup glory\nWhen Rebecka Blomqvist equalised for Sweden in the 88th minute of their World Cup semi-final against Spain, all of Spain’s ghosts reappeared as extra time loomed.\nThe players may have thought about past occasions when they fell apart, such as in last year’s European Championship quarter-final against England, or their demolition by Japan in the group phase of this tournament.\nIt has been a whirlwind year for them — one in which they have gone from never reaching the last eight of the World Cup before to making their first final at the competition, despite off-pitch conflict which means they have achieved this without some of the world’s best players.\nIt was time to show they had learned from those experiences against England and Japan. That they could overcome their own doubts. And they took less than a minute to do that, through Olga Carmona’s late winner.\nAuckland’s Eden Park was sent into meltdown and the players celebrated wildly. This time, they had broken down all barriers.\nThey had done it in a different way to their past victories, showing they have all the resources you could ask of World Cup finalists.\nMore analysis below\nA fierce sporting rivalry — on a different stage\n“If we don’t beat you, we’ll knock your bloody heads off.”\nAustralia vs England could be the fiercest international sporting rivalry on the planet, a cross-discipline feud with its roots in historic colonialism and a hyper-competitiveness between two countries who define their sense of worth through sport more than most others.\nThe Women’s World Cup semi-final tomorrow (Wednesday) in Sydney will be the most significant football match ever played between the two nations. Not only have they never faced each other at this tournament before, neither the men’s or women’s teams have ever played in a competitive fixture.\nSam Kerr scored in a 2-0 win for Australia the last time these two sides met in April (thus far, Sarina Wiegman’s only defeat in 36 matches as England head coach), and the seven friendlies between the men’s teams are most notable for being the international debuts of Wayne Rooney (in 2003) and Marcus Rashford (2016).\nThis is a rivalry that is mostly played out in other sports. So for the uninitiated, or those who like to indulge in it, here is a brief history…\nA window into Sarina Wiegman's world of management\nThe photo shows Sarina Wiegman standing in the showers, clothes drenched. A red Ter Leede scarf and a gold medal are draped around her neck. Her players dance around her, arms aloft, celebrating their 2006-07 Dutch title.\n“Sarina hates that,” says Ter Leede club president Kees de Lange, sitting on a bar stool in the clubhouse, half an eye on the Formula 1 race on TV in the background. “What?” The Athletic asks. “Being the centre of attention,” De Lange replies.\nIt is true. In the other pictures hung on the walls next to the bar, Wiegman is on the periphery.\nFast forward 16 years and she has not changed. When Prince William presented the 53-year-old with her honorary CBE (as she isn’t British) at St George’s Park in June, she was almost speechless, and deflected the attention to her Euro 2022-winning England team.\nA double European champion and World Cup finalist as a manager, a three-time FIFA Best Women’s Coach selection and winner of last year’s BBC Sports Personality of the Year ceremony’s Coach Award, Wiegman has had to get used to taking centre stage since those early days coaching Ter Leede.\n“She is the missing ingredient England were looking for,” said Leah Williamson, captain of that triumphant England side, at the celebrations in London’s Trafalgar Square last summer. “She is a special person.”\nSo what makes England's history-making coach the force she has become? Read more below.\nWiegman believes Lionesses are ‘very well prepared’ for semi-final\nSarina Wiegman confidently affirmed her side’s preparation for their World Cup semi-final against Australia.\nThe Lionesses’ first defeat under Wiegman came in April this year, ending a 30-match unbeaten streak.\nThe 53-year-old manager has said, however, that her side have learnt from the defeat and will use the experience heading into Wednesday’s semi-final.\n“That game at that point in that time already gave us a lot of information,” she said.\n“So we learned from that but we have that knowledge now we have that experience.\n“And it's really good to have that experience and take that with us tomorrow.\n“But also we analysed Australia during the tournament. So I think we are very well prepared for what they want to do and how they want to play and yes, we are ready for it.\nWiegman on England's last World Cup semi-final defeat: 'A lot has changed in four years'\nEngland head coach Sarina Wiegman believes her side — and women's football more broadly — are in a very different place since the Lionesses' fell short at the semi-final stage in the 2019 World Cup.\nSpeaking to reporters ahead of Wednesday's semi-final against Australia, Wiegman said: \"A lot is different you know, that (semi-final loss in 2019 World Cup) was four years ago now.\n\"So I think the environment is different. The women's game, different teams, players.\n\"I think the past is the past. We can implement the future and I think it's important to stay present on the task ahead, which is tomorrow.\"\nThe Dutch manager also acknowledged the Lionesses' achievement in reaching consecutive World Cup semi-finals.\n\"There are a lot of teams that are being expected to go to the semifinals to the final, but you can never take anything for granted,\" she said.\n\"It's really really hard. And it's just very, very special to go so far in the tournament.\n\"But when you're there when you're at the semi-final, you want to win it to win because you really want to go to the final but that's the same for Australia.\n\"I feel privileged that we've got this far and I really want to get to take the next step too.\"\nAustralia coach admits England are favourites in World Cup semi-final\nAustralia head coach Tony Gustavsson has pointed out the multitude of ways that he thought England should be the favorite to win this clash, claiming that the England women’s budget “was the same budget as all national teams in (Australia’s) FA.”\nHe said: “In terms of who’s the favorites, I think I’ll leave it to you guys to speculate and write about that.\n“If you look at (FIFA) rankings, they’re favorites. If you look at where their players play, they have starting players in top clubs and top leagues all over the world. Not just 11. They have like 15, 16, and then you compare to us, we have bench players on those teams.\n“We have players playing in (Australia’s) A-League, we have players playing in mid-table teams in Sweden. So if we look at all that and we look at resources financially, obviously they are a massive favorite going into this game.\n\"But the one thing that we have that they don’t have is the support and the belief from the fans and that itself is going to be massive tomorrow.”\nAustralia coach Gustavsson confirms Kerr is available for England match\nAustralia head coach Tony Gustavsson has confirmed that star striker Sam Kerr will be available for the semi-final encounter with England tomorrow.\nThe Chelsea forward has missed much of the tournament with a calf injury but Gustavsson said prior to the game that the 29-year-old will be able to play against England at Stadium Australia tomorrow.\nHe said: \"She pushed through more minutes than we hoped for, to be honest. The way she pushed through was fantastic and impressive, both the mental and physical aspect.\n\"She recovered well. She trained today, so she’s available.\"\nSpain's 'historic day' as Sweden rue another last-four defeat\nSpain are heading to the final in only their third Women's World Cup.\nThey reached the knockout stage four years ago but lost to eventual champions the United States.\nThis time, they have overcome near mutiny, with 15 players last year signing a letter complaining about boss Jorge Vilda and the conditions for the national team.\n\"This is a historic day,\" said Vilda. \"We're in the final, that's what we wanted.\"\n\"Now it's the final. I think we have to do what we've done in every match,\" said Salma Paralluelo, who opened the scoring in the 81st minute. \"We've overcome every challenge and now we face the ultimate challenge, the big one\"\nSweden, meanwhile, have now lost in four of five semi finals.\n\"I have to watch the game, I really do, before I can make any assessments,\" said Sweden coach Peter Gerhardsson. \"Right now I am full of emotions. I think everyone just feels sadness and huge disappointment.\"\nThe final looms...\nWho will face Spain in Sunday's final? We'll find out tomorrow...\nSpain reach World Cup final\nSpain are the first team into the 2023 Women's World Cup final!\nA chaotic eight-minute period has decided the game and it is Jorge Vilda's team that will play against Australia or England in Sunday's final.\nThe Sweden players are crestfallen, the Spain players are jubilant.\nTournament football, eh?\nIncredible late drama!\nSensational drama in the semi-final between Spain and Sweden!\nThe game seemed set for extra time after Rebecka Blomqvist equalised for Sweden in the 88th minute — but Olga Carmona hit back just seconds later to put Spain back in front!\nCan they hold on this time? Seven added minutes to go... follow the final stages here.\nArnold ahead of England and Australia semi-final: 'There is a massive rivalry'\nMackenzie Arnold has spoken on the rivalry between Australia and England ahead of the two side's meeting in the World Cup semi-final tomorrow.\nThe Australia goalkeeper started her side's dramatic quarter-final victory over France, which they won via a penalty shootout, but the 29-year-old says she will approach tomorrows game as any other game.\nShe said: \"Obviously, there's a massive rivalry between Australia and England with sports all over the place, and that's obviously going to be no different tomorrow. But at the same time, we've got a lot of rivalries in football with Brazil, USA, New Zealand.\n\"So I think tomorrow is going to be another just another game and like Tony said, we're trying to focus on one game at a time and really focus on ourselves and our own game plan rather than getting caught up in a rivalry.\"\nArnold also spoke about the fact that many of her international teammates play their club football in England's Women's Super League.\nShe added: \"I think all of us that play over in that league, we can just say it's a different world, coming from the (Australian A-League).\n\"It's just the amount of professionalism and the talent that they have over there and the amount of time that they put into their clubs and players, it just really shows (in) the progress, both of them individually and the game as a whole.\"\nSpain on top vs Sweden in early stages\nWe're underway in the first semi-final and though it's goalless, Spain are playing with personality and controlling the early tempo.\nSweden's high-pressing game suits Spain and they have been able to create chances.\nCenter back Ilestedt’s golden boot bid\nCenter back Amanda Ilestedt currently leads Sweden in goals scored (four) and is one of four players tied for second place in the tournament’s golden boot race as the competition approaches the semi-final stage.\nThe reasoning is quite simple: Sweden effectively uses its set piece opportunities and Ilestedt is in the right place at the right time.\nSweden has mostly used in-swinging set pieces throughout the tournament. They have varied on occasion with out-swinging deliveries, but putting a ball directly in front of the goal has proven to be more successful for the team. It gives players like Ilestedt the chance to get on the ball and not have to generate too much power to turn it goalward.\nShe’s already matched Wendie Renard’s World Cup record for most goals by a defender at a single World Cup. She will be someone that Spain has to mark tightly. If they don’t, Ilestedt could become the first defender at a World Cup to win the golden boot award.\nAnalysis below\nRedondo and Spain looking to replicate 2010 World Cup triumph\nA few days before the start of this Women’s World Cup adventure Alba Redondo's phone rang. On the other end of the line was her idol and one of her great footballing guides: Andres Iniesta.\nRedondo was 14 in 2010 when her idol put the ball in the back of the net to give Spain their first World Cup triumph. She can’t help but see parallels with this tournament in Australia and New Zealand.\nShe watched the men’s success 13 years ago as an amateur and a girl who played non-professional football for the Albacete B Foundation. Now she is one of the protagonists in what is already Spain’s best performance at a Women’s World Cup as they prepare to face Sweden in the semi-finals.\nRead the full interview below\nAsllani: The anti-captain who became Sweden’s leader\nKosovare Asllani is set to lead Sweden out in their World Cup semi-final against Spain.\nWhen Asllani made her debut for Sweden 15 years ago, there was no doubt about her level of talent. Few, however, would have predicted she would one day wear the captain’s armband at a World Cup.\nAsllani was the opposite of a captain; a talented attacker but also a loose cannon, forever getting herself into trouble in the media and sometimes with her club too,\nA decade on, Asllani has matured into a dependable leader. While Swedish stalwart Caroline Seger is still officially the captain, her status as a backup means Asllani wears the armband, ahead of, for example, four-time Women’s Super League-winning skipper Magdalena Eriksson. Still outspoken off the pitch and still hugely influential on it, Asllani provides Sweden with the confidence and the ferocity that has sometimes been lacking.\nMore analysis below\nSpain's midfield dilemma\nIn some ways, the fact Spain are in the semi-finals of this Women’s World Cup should not be that surprising, since they have what is undoubtedly their best generation of players ever. The younger ones — champions of everything at youth level — have come together with senior team-mates to mark a turning point in Spanish women’s football.\nIt is a potent combination that has led Spain to a position as one of the four best teams in the world for the first time in their history.\nAdded to this is the fact their squad contains reigning Ballon d’Or winner Alexia Putellas, who has won the award for the past two seasons,and one of the leading contenders to win that same award this year in Aitana Bonmati.\nHaving two of the best women’s players in the world should be a blessing for any squad. And even more so when they are both part of one of the best midfields in Europe with their club, Barcelona.\nBut it is not quite that simple for Spain. In some ways, it is actually a problem for manager Jorge Vilda.\nHow will Spain deal with their Bonmati-Putellas dilemma? Find out below.\nAustralia's Tony Gustavsson, Mackenzie Arnold talk WSL development, favourites for England matchup\nAustralia coach Tony Gustavsson and goalkeeper Mackenzie Arnold spoke ahead of their team's semi-final match against England on Wednesday. Questions have been edited for brevity and clarity.\nHow has the development of WSL and so many Australian players being in the league helped this team?\nMA: \"All of us that play over in that league can say it’s a different world coming from the W-League. The amount of professionalisation and the talent that they have over there, the time they put into their clubs and players, it really shows the progress both of them individually and the game as a whole. After seeing the Euros and them winning that and seeing how much it really took off and how much money was invested over there. It just really goes to show the progression they’ve had.\"\nTG: \"Scouting over there and seeing training and watching games, whether it be Champions League games, league games or FA Cup games. The other thing is the investment, they might be a little bit further ahead than us in investing, in terms of the money and resources. The same goes for the national team. Someone told me that the women’s programme in the women’s FA has the same budget as all national teams in our FA. That says a lot about the resources and money that they have and that is also contributing to the development of the players. That means more full-time staff, it means better training facilities, more resources, more full-time players.\n\"We’re at the beginning of that journey and I hope to sit here in 10 to 20 years from now and say this was a crossover moment when it comes to investment in women’s football and we can have the same resources and the same money as well.\"\nWho are the favourites?\nTG: \"In terms of favourites, I think I’ll leave it to you guys to speculate and write about that. That’s your expertise. If you look at rankings they’re favourites, if you look at where their players play they have starting players in top clubs, in top leagues all over the world. Not just starting XI, down to 15, 16. Then compared to us, we have bench players in those teams. We have players playing in mid-table teams in Sweden. So if you look at all that and you look at resources, financially, obviously they are massive favourites going into this game. But the one thing that we have that they don’t have is the support and belief from the fans. That in itself is going to be massive tomorrow.\"",
  "word_count": 3162,
  "scraped_at": "2026-02-14T02:07:08.847749",
  "_text_extracted": true
}