{
  "article_id": "045388d16eb4",
  "url": "https://metro.co.uk/2025/07/02/lyon-set-asking-price-arsenal-liverpool-chelsea-target-malick-fofana-23564711/",
  "title": "Lyon set asking price for Arsenal , Liverpool and Chelsea target Malick Fofana",
  "date": "20250702T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal, Liverpool and Chelsea are just three of the many clubs interested in Lyon winger Malick Fofana and the French club have named their price.\nThe 20-year-old moved to Lyon from Gent in January 2024 and has been a regular in the side since.\nThe Belgium international scored 11 times in his first full season with Lyon and established himself as one of the brightest young talents in Europe.\nAlongside the Gunners, Reds and Blues, Nottingham Forest and Fulham have also expressed an interest, although will do very well to win the race for the winger.\nGerman champions Bayern Munich, Italian champions Napoli and RB Leipzig are also reportedly keen.\nThe Independent report that Lyon are asking for £51.5m for his services this summer, but given the level of interest in him they are hoping this lofty price could rise still higher.\nThe report suggests that the interested clubs have already made contact, while transfer expert Fabrizio Romano reports that Nottingham Forest have got as far as agreeing a deal with Lyon.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nClearly that suggests that Forest are in a good position in the battle to sign the Belgian, but there has been no agreement between the City Ground side and the player.\nWith much bigger clubs tracking him, Fofana is believed to be waiting to see what other offers come in and hoping for a Champions League club to make the move.\nLyon would rather not lose one of their best players, but they do need to raise funds due to the financial crisis at the club and will be happy to sell for a big offer.\nMore Trending\nThey finished sixth in the top flight last season but have been relegated to Ligue 2 due to the precarious financial position they find themselves in.\nRayan Cherki has already been sold to Manchester City, while Alexandre Lacazette left on a free transfer and has moved to Saudi side Neom, along with Said Benrahma.\nLyon are appealing the decision to relegate them and hope to convince authorities that their finances have improved sufficiently to avoid the punishment.\nClearly if they pocket over £50m for Fofana then that will help their case.",
  "word_count": 415,
  "scraped_at": "2026-02-14T01:58:41.939783",
  "_text_extracted": true
}