{
  "article_id": "047766b8f407",
  "url": "https://dailynews.co.tz/go-simba-go/",
  "title": "Go Simba , go ! – Daily News",
  "date": "20250516T104500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Go Simba, go!\nDAR ES SALAAM: SIMBA SC are focusing on the Confederation Cup final first round against RS Berkane in Morocco this weekend.\nThat is a grand stage, having passed all the hurdles from group stages, taking confidence from their solid defensive resilience and will now shift focus to preparing for the final, where they hope to complete a memorable journey with silverware.\nAs the Head Coach Fadlu Davids said, they should put concerted efforts as they prepare for the crucial first leg away.\nSpeaking after their 2-1 victory over KMC, the South African tactician expressed satisfaction at having rotated his squad extensively during their league run, ensuring every player has had valuable minutes ahead of the continental clash.\nHe noted that it was important to give everyone game time. Now we analyse and decide what the best approach is for each leg of the final.\nWith strategic rotation now complete, Fadlu hinted that selection battles are heating up in camp.\nThe game was arranged to be staged at Stade Municipal de Berkane and it comes at a time when the technical bench already has a clear picture of which attacking unit will lead the charge in Morocco and who will be their finishing force at home.\nSimba has been putting full force in this CAF Confederation Cup is an annual association football club competition established in 2004 and organised by CAF.\nALSO READ: Simba sail to CAF Confederation groups\nClubs qualify for the competition based on their performance in their national leagues and cup competitions.\nIt is the second-tier competition of African club football, ranking below the CAF Champions League.\nThe winner of the tournament faces the winner of the aforementioned competition in the following season’s CAF Super Cup.\nSimba’s preparations have been in full swing and Fadlu was keen to highlight the behind-the-scenes heroes particularly the medical and fitness departments, as there are no fresh injuries.\nAll in Simba as a nation, should join hands for the club, to ensure the team performs well in Morocco, although it is an uphill task, so that back home on the second leg before thousands of their fans, it may be easy to earn a positive result and lift the trophy.\nThe squad flew to Morocco on May 12, led by the Deputy Minister for Culture, Arts and Sports, Hamis Mwinjuma, some other government officials and Tanzania Football Federation (TFF) leaders.\nSimba go to the game, knowing that Moroccan clubs have the highest number of victories , with seven titles, but that does not mean that Simba cannot beat Berkane, all the best Msimbazi Street lads.",
  "word_count": 436,
  "scraped_at": "2026-02-14T02:11:36.682021",
  "_text_extracted": true
}