{
  "article_id": "0482310b2c6f",
  "url": "https://www.thenationalnews.com/news/us/2025/09/14/charlie-kirk-shooting-suspect-not-co-operating-with-authorities-governor-says/",
  "title": "Charlie Kirk shooting suspect not co - operating with authorities , governor says",
  "date": "20250915T041500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Utah Governor Spencer Cox said on Sunday that the man accused of fatally shooting right-wing activist Charlie Kirk is refusing to co-operate with authorities, as investigators seek to determine a motive by interviewing his friends and family.\nAuthorities have not yet established why Mr Robinson allegedly climbed on to a rooftop at Utah Valley University and fired a long-range shot that struck Mr Kirk in the neck during an outdoor event on Wednesday. Investigators are still piecing together the circumstances leading up to the killing.\nMr Robinson has not confessed to investigators, Mr Cox told ABC News. “He is not co-operating, but all the people around him were co-operating, and I think that's very important,” the Republican governor said. Tyler Robinson, 22, will face formal charges on Tuesday and remains in custody.\nMr Kirk, a staunch ally of President Donald Trump and co-founder of the conservative student group Turning Point USA, was killed by a single rifle shot during the event in Orem, near Salt Lake City, which was attended by 3,000 people. The killing has led to increased fears of a spike in political violence in the US, and an ever-deepening divide between the left and the right.\nOne person who is apparently talking to investigators is Robinson's roommate, who was also a romantic partner, Mr Cox said, citing the FBI. Mr Cox said the suspect’s roommate, described as “a male transitioning to female,” has been “incredibly co-operative” with authorities.\nPressed on CNN about whether the roommate’s gender identity factored into the investigation, Mr Cox said: “That's what we're trying to figure out right now … It's easy to draw conclusions from that, and so we've got the shell casings, other forensic evidence that is coming in and trying to piece all of those things together.”\nInvestigators found messages engraved into four bullet casings, which included references to memes and video game in-jokes. Mr Robinson, a third-year student in the electrical apprenticeship programme at Dixie Technical College, part of Utah's public university system, was taken into custody at his parents' house, about 260 miles (420km) south-west of the crime scene after a 33-hour manhunt.\nRelatives and a family friend alerted authorities that he had implicated himself in the crime, Mr Cox said previously. While Mr Robinson was raised by religious parents in a deeply conservative region of the state, “his ideology was very different than his family,” Mr Cox said on Sunday on NBC, without going into specifics.\nState records show Mr Robinson is a registered voter but not affiliated with any political party.\nA relative told investigators that Mr Robinson had grown more political in recent years and had once discussed with another family member his dislike for Kirk and his viewpoints, according to the arrest warrant affidavit. Mr Robinson was “not a fan” of Mr Kirk's, Mr Cox said on Sunday.\nMany Republicans, including Donald Trump, quickly blamed the political left, accusing liberals of fuelling anti-conservative hostility that could inspire violence.\nMike Johnson, the Republican speaker of the US House of Representatives, urged calm on Sunday. “We've got to turn the rhetoric down,” Mr Johnson said on Fox News. “There's this recognition that people have got to stop framing simple policy disagreements in terms of existential threats to our democracy.”\nMr Trump has credited Mr Kirk with driving young voters to conservatism. His Turning Point movement says it has more than 800 chapters across college campuses. A memorial event for Mr Kirk will be held on September 21 in Glendale, Arizona, his organisation said.",
  "word_count": 587,
  "scraped_at": "2026-02-14T01:49:53.053572",
  "_text_extracted": true
}