{
  "article_id": "048c5106928a",
  "url": "https://theathletic.com/4632504/2023/06/23/liverpool-jurgen-klopp-germany-job/",
  "title": "Germany are desperate for Jurgen Klopp – but would he really leave Liverpool ? ",
  "date": "20230623T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hansi Flick is feeling the heat in Germany.\nTuesday’s dismal 2-0 defeat to Colombia in Gelsenkirchen unleashed another torrent of criticism directed at the national team’s head coach following the 1-0 loss at the hands of Poland and a 3-3 draw with Ukraine.\nIt prompted Bild, the country’s biggest-selling newspaper, to demand that the German Football Association (DFB) dismiss Flick after a run of just four wins in the past 16 matches.\nAdvertisement\n“Anything else would be negligent,” argued sports editor Matthias Brugelmann, with the European Championship on home turf just 12 months away. “The trend is as clear as it is frightening and would have already cost the club coach of a top team his job.”\nBrugelmann was equally convinced about the solution to Germany’s woes.\n“Jurgen Klopp,” he wrote. “The DFB has to fight for him with all its might. Klopp would put Germany in Euros euphoria. His popularity would help create a mood swing.”\nBrugelmann is not alone. In Bild’s online poll asking readers who should be national team coach for the Euros, the Liverpool manager emphatically leads the way with 47 per cent of the vote. Former Bayern Munich boss Julian Nagelsmann is a distant second on 17 per cent with Flick third on 11 per cent.\nDFB president Bernd Neuendorf insists Flick will remain in charge for September’s friendlies against Japan and France, but if he cannot arrest Germany’s decline in those matches then the clamour for change will be deafening.\nThere is little doubt that Klopp would be the DFB’s candidate of choice to take over if Flick’s position becomes untenable. It’s no secret at the German FA’s Frankfurt headquarters that their vice-president Hans-Joachim Watzke, who worked with Klopp at Borussia Dortmund, would dearly love to see him at the helm of the national team.\nSo, too – as that Bild poll suggested – would many Germany fans. It might be approaching eight years since Klopp left his homeland but his profile there is greater than ever.\nHe’s still a regular on TV screens courtesy of his advertising deals with brewer Erdinger, German wealth advisors DVAG, and others. Managers like Flick, his predecessor Joachim Low, Nagelsmann and Thomas Tuchel have never garnered the same level of public affection.\n“It all started with his underdog story as manager of Mainz,” says Lukas Dombrowski, a football reporter for Bild. “Then with his work as a TV pundit during the home World Cup in 2006. He showed that he’s authentic and charismatic.\nAdvertisement\n“The way he transformed Dortmund added to his reputation and after the success he’s achieved at Liverpool, he’s regarded as one of the best ambassadors for Germany abroad.\n“That’s why so many companies want to be associated with him. He’s highly visible here. There’s lots of interest in everything he has to say, certainly much more than, say, Tuchel when he went to Paris and then London.”\nThere are other factors at play, too. The Klopp family still have a house in Mainz, which is only about 45 minutes by car to Frankfurt. Klopp has talked about moving back there when his time at Liverpool comes to an end and taking a year off before embarking on another challenge.\nBut does any of that mean there is any chance of Germany getting their man?\nThe timing wasn’t right for Klopp when the national team job last came up two years ago and it’s difficult to see the stars aligning this time around, either.\nKlopp ruled himself out of the running after Low revealed in March 2021 that he was going to step down after the delayed Euros that summer.\n“It’s simple. You sign a contract and you stick to that contract. I stuck to contracts at Mainz and Dortmund,” Klopp said.\nHe later clarified: “The important thing is I didn’t say that I didn’t want to become a national coach, but that I cannot. That’s a huge difference. There is a very clear commitment. I have an important role here at Liverpool.”\nThat commitment has increased since, with Klopp penning a two-year extension last year to keep him at Anfield until the summer of 2026. He had previously intended to depart in 2024 and take a sabbatical but felt compelled to stick around to oversee the rebuild of the squad.\nDespite the struggles of last season when Liverpool missed out on Champions League qualification those closest to Klopp are convinced that his energy and motivation for the challenge ahead is greater than ever. He’s focused on putting the club back competing for the biggest prizes and proving that 2022-23 was merely a blip. His agent Marc Kosicke has described the renewed links with the national team job as “not a topic for us at all”.\nAdvertisement\nIn Germany, they still cling to the hope that the emotional pull of leading his country into a home Euros may yet persuade the Premier League’s longest-serving manager answering an SOS call.\nSince failing to guide Germany beyond the group stage of the 2022 World Cup in Qatar, Flick’s only win in five friendlies arrived against Peru in March.\n“People are either laughing at how bad things have got under Flick or even worse they just don’t care anymore,” says Dombrowski.\n“It’s not just the results, it’s the performances. TV ratings are down. No one trusts Flick anymore. Klopp would be the perfect man to take over. Appointing him would have such a positive effect on everyone. He’s such a popular figure here.”\nIf Liverpool start next season sluggishly and frustration among the club’s fanbase grows maybe the landscape will look different by the autumn. Klopp would only ever consider walking away if he felt he was overstaying his welcome.\nHowever, it’s hard to envisage that kind of scenario unfolding. The reception he got on the lap of appreciation at Anfield after the final home game in May spoke volumes about the unwavering faith in him. The same goes for the feeling among the owners.\nSome much-needed positivity was restored by Liverpool finishing the season unbeaten in 11 games and then the shrewd signing of Brighton’s Alexis Mac Allister provided a further lift. Further reinforcements are expected in midfield and defence.\n“We played a bad season and came fifth. Imagine if we are our normal selves, which we will be next season. We will be a contender again,” Klopp said defiantly after the 4-4 draw at Southampton on the final day.\nHe appears destined to manage Germany one day. It’s certainly the more likely next step after Liverpool rather than another job at club level.\nBut having recently turned 56, he still has time on his side. He relishes the day-to-day involvement on the training field. The slower pace of international management can wait.\nWhile Germany dream of Klopp riding to the rescue, he’s preoccupied with masterminding Liverpool’s resurgence.\n(Top photo: Angel Martinez/Getty Images)",
  "word_count": 1146,
  "scraped_at": "2026-02-14T02:09:58.115702",
  "_text_extracted": true
}