{
  "article_id": "04c11a725acc",
  "url": "https://www.twtd.co.uk/ipswich-town-news/47028/burgess-still-in-our-own-hands",
  "title": "Burgess : Still in Our Own Hands - Ipswich Town News",
  "date": "20240411T123000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thursday, 11th Apr 2024 10:15 by Jonny Chick\nIpswich Town defender Cameron Burgess remained positive after the Blues’ goalless stalemate at home to mid-table Watford with Town’s destiny remaining in their own hands.\nThe draw moved the Blues back into the automatic promotion places, level on points with table-topping Leicester, who have a game in hand, and one point above third-placed Leeds United.\nPortman Road, which has been the hub of drama this season, has hosted few low-scoring affairs in Ipswich’s return to the second tier and the Blues created enough chances in the first half against Tom Cleverley’s Hornets to feel this was two points dropped rather than one gained.\nTown penned the visitors into their own half for the majority of the first period and created an abundance of chances.\nStriker Kieffer Moore had three efforts on goal and was unfortunate not to find the back of the net with a bullet header that goalkeeper Daniel Bachmann did incredibly well to keep out.\nNathan Broadhead was also among the chances in the first half. The winger saw two efforts saved by Bachmann before his deflected strike glanced off the post. Contrary to the first 45, Town failed to record a shot on target after the break.\n“We focus on the performances and on another night, one of those chances drops for us. We did everything right up until that point, one just needed to fall for us,” said Burgess.\n“If the ball’s hitting the post and rolling across the line like that [for Broadhead’s chance], what can you do you do? But we keep battling away, we take the positives from it. It’s a point at the end of the day and it’s still in our hands so we keep going.\n“If you’ve been at the last handful of home games, you will have seen us score with seconds to go. There was always that chance we were going to go and do it and we have that type of group.\n“We have that character about us, we never say never and we keep going to the final whistle. Sometimes it’s not always going to go your way and, at the end of the day, a clean sheet and a point, we move on and we keep going.”\nWhen asked why he felt there was a difference in attacking output between the two halves, the 28-year-old said: “It felt like they had a lot more bodies behind the ball.\n“There was a lot of balls we had in their box that didn’t fall for us, it probably had to go through about four or five bodies for it to reach the goalkeeper, which is not always easy.\n“When we implement our style and do our stuff at home, teams can do that, so it’s never going to be easy, especially here at home.\n“On another day, if we score one of those goals in the first half, it could be a completely different game. But that’s football, that’s how it goes sometimes.\n“We take the positives from it, if teams, like Watford with the players they’ve got, are going to come and do that then we must be doing something right so we just stick at it.”\nKieran McKenna’s side always respond to a loss and there was a clear reaction to their 1-0 defeat at arch-rivals Norwich City on Saturday.\nOn the derby day disappointment, Burgess admitted it was hard to get over it and put it out of his mind ahead of last night’s match\n“A little bit, personally anyway,” he admitted. “I hate losing, it’s not fun, especially when it’s such a big fixture for the fans and the club, but I guess what helps you get over it a little bit is the fact we’re playing for something is massive for this football club and we’re all well aware of that.\n“And it’s obviously nice to have a game which is midweek when you’ve played on a Saturday and you don’t get a result.\n“We started the game [against Watford] in the right attitude tonight and hopefully it's a step in the right direction to where we want to get to.”\nAfter promotion-rivals Leicester City and Leeds United dropped points on Tuesday night, the door was left ajar for the Blues to take pole position heading into the weekend. An opportunity Town failed to fully capitalise on, but a point that could prove important come the end of the season.\nThe Australian international, who helped Town keep their 14th clean sheet in the league this season, says some players kept an eye on Leeds and Leicester’s games on Tuesday but he chose to watch the 3-3 draw between Real Madrid and Manchester City.\n“Some were [watching Leeds or Leicester], some weren’t. Me personally I was watching the Champions League, I was watching an epic thriller of Real Madrid and Man City. It would have been nice to have seen one of those goals go in for us to night, that would have been good” he laughed.\n“What other teams do, we can’t control. I suppose if you look at it, things are in our hands, so we’re going to go into every game to try and win every game like we always have done. If we keep doing the right things, things will happen for us.\n“We keep doing what we’re doing, keep focusing on performances. You’ve seen all different types of results for us this season and we keep trying to do the same things every game, that’s how football works.\n“Sometimes you’re going to score late winners and win 3-2, sometimes you’re going to get a clean sheet, it’s going to be 0-0 and you’re going to hit the post, it’s just the way football works.\n“We’re just focused on what we do and keep going for games, keep trying to win games and hopefully it falls for us in the end.”\nBurgess says Town have last season’s successful run in to reflect on during this season’s battle for promotion.\n“It’s an experience to draw back on really, more than anything at this point. For me personally, I feel like we’re still in that phase, although we had a little bit of a break in the summer, we’re still in that phase and it’s just been a carry on of that journey, really.\n“We’ve had plenty of experiences to draw back on, we’ve had games where we’ve not done things the right way and we go in the next game and we correct it. That’s the type of group we have and it’s a credit to the boys in the dressing room and the staff that give us the details.\n“We just keep going, we learn from mistakes, we just keep punching, we keep going and we keep trying to win games. That’s all we know how to do and that’s what we’re going to keep doing.”\nThe draw with Watford was Burgess’ 101st appearance for the Blues after the East Anglian derby at Carrow Road earned him a spot in the club’s 100 Club.\nOn his achievement, he said: “It’s a privilege to be able to play 100 games for this football club, in front of these fans. Every time you get the chance to play at Portman Road it’s a special occasion.\n“Something to reflect on maybe when I’ve finished playing more than now, it’ll be a really proud moment. I take a little chance to reflect on it and think about it and be really proud of it at the moment, but we’re in the thick of something really special for this football club and it’s not really about me, it’s about this team.”\n“[Promotion to the Premier League] that would be the icing on the cake. I suppose. That’s exactly what we’re going for, we’ve got to try and win games, that’s all we know how to do. If we can go and try and win these last four games like we’re going to try and do, then who knows, let’s see what happens.”\nAs well as surpassing 100 appearances, Burgess also represented Australia at the Asian Cup at the beginning of this year, where his country bowed out in the round-of-16 stage.\n“It was another really good experience personally. To go to a major tournament for an international is a great experience and I’m really enjoying playing for Australia as well,” he said.\n“To be able to do that is a really proud moment and it wouldn’t have happened without being able to do the right things for this club, so I owe a lot to my teammates and the staff here.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1477,
  "scraped_at": "2026-02-14T01:48:46.199470",
  "_text_extracted": true
}