{
  "article_id": "04c720573bfd",
  "url": "https://www.nytimes.com/athletic/6743233/2025/10/24/barcelona-real-madrid-clasico-bellingham-rashford-trent/",
  "title": "El Clasico English stars : Will Bellingham , Rashford and Alexander - Arnold all play ? ",
  "date": "20251024T060000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marcus Rashford, Jude Bellingham and Trent Alexander-Arnold.\nAll three English players could feature in Sunday’s first Clasico of the season between Real Madrid and Barcelona.\nOf the three, Rashford is easily in the best form right now. The Manchester United loanee scored twice for Barcelona in Tuesday night’s 6-1 thumping of visitors Olympiacos, bringing his 2025-26 Champions League tally to four goals in three appearances.\nAdvertisement\nBellingham’s season only got going last month when he returned from summer shoulder surgery, and his first start was in the 5-2 derby defeat by Atletico Madrid on September 27. After that game, he was dropped from the starting XI. But head coach Xabi Alonso and his staff are hoping the midfielder can quickly get back to his best — and his showing against Juventus on Wednesday, where he got the only goal in a Champions League home win, was promising.\nAlexander-Arnold, meanwhile, has not enjoyed the greatest opening to his new chapter at the Santiago Bernabeu, though he is at least back in contention to face Barca having been out for more than a month with a hamstring injury.\nHere’s what to know about each player right now.\nJude Bellingham\nJude Bellingham knows better than most that El Clasico is a different kind of game — despite only joining Real Madrid in summer 2023.\nThe now 22-year-old, who signed for an initial fee of €103million (£89.7m/$119.6m at the current rates) from German side Borussia Dortmund, has experienced the best and worst of Spanish football’s biggest rivalry in his first two seasons.\nBellingham is now looking to redeem himself after being criticised in recent months for his form and the fact that his place in the starting line-up has not been as secure lately.\nHis first appearance against Barcelona two years ago was like something out of a movie, with him playing the hero. Madrid were losing 1-0 at their arch-rivals before Bellingham led a comeback, scoring two second-half goals, including a 92nd-minute winner.\nIn his second meeting with the Catalan side, he celebrated his first trophy as a Madrid player, following a resounding 4-1 win in the Spanish Super Cup final in January last year. That night, Vinicius Junior scored a hat-trick — but Bellingham shone with a beautiful pass for the Brazil forward’s first goal.\nAdvertisement\nBellingham took the headlines once again in his first Clasico at the Bernabeu three months later. His goal in the 91st minute made it 3-2 to the hosts and meant that Carlo Ancelotti’s side were almost certain to win La Liga, moving them 11 points clear ahead of Barca with six games to go.\nBy contrast, last season’s meetings with their biggest rivals across three different competitions could not have gone much worse for Madrid. Barca won all four matches by a lop-sided aggregate score of 16 goals to seven. Bellingham started each game, but he did not find the net or provide an assist.\nThe season ended with Madrid having failed to win any of the three major competitions they entered (Champions League, La Liga and Copa del Rey), bringing an end to Ancelotti’s four-year reign as Alonso took over ahead of the Club World Cup — which they didn’t win either. There was a lot of criticism of many players from both inside and outside the club, and Bellingham was not spared. He had gone from contributing to a goal every 101.2 minutes in his first season to once every 159.8 minutes in year two.\nOne reason for this slump was the collective problems of the squad. Another was the long-running issue with his left shoulder, which he had been managing since November 2023. The Athletic reported in May that Bellingham would have surgery to try to solve this after the Club World Cup, which the player confirmed during that tournament.\nBellingham retained his starting spot under Alonso as Madrid got to the semi-finals, with staff sources (speaking anonymously to protect their position, like others cited in this article) saying he would maintain a prominent role.\nThis was evident when Bellingham started in the derby against Atletico last month, despite having played only 20 minutes in two matches since his return from surgery. That 5-2 defeat was Madrid’s first — and only so far — loss of the season and sparked discussions about a lack of leadership in the squad. Alonso also faced criticism over perhaps playing Bellingham before he was fully back up to speed.\nBellingham was used as a substitute in the two matches that followed, but Madrid sources insist he was picked against Atletico for purely footballing reasons (reports in Spain said Alonso might have felt pressured into selecting him) and that his subsequent drop to the bench was in no way a punishment (as had also been suggested in Spanish media).\nAdvertisement\nThose same sources say Bellingham, who was left out of Thomas Tuchel’s England squad for their October internationals, has been more subdued in training of late but they have complete confidence that he will step up in terms of his football and leadership. His first goal of the season, the winner against Juventus on Wednesday, could be the start of that.\nMario Cortegana\nMarcus Rashford\nIf truth be told, few Barcelona fans were expecting Marcus Rashford to catapult himself into being a guaranteed starter in this first Clasico of the season when he arrived on loan in July — but that is exactly what has happened.\nThe 27-year-old is set to be in Hansi Flick’s line-up on Sunday, and he’s fully earned it. He has been the most consistent performer in Barca’s forward line during their recent injury crisis, and his output has been more than decent.\nOn Tuesday, he scored his second Champions League double of the season in that 6-1 defeat of Greece’s Olympiacos. Across all competitions, he has nine goal contributions (five goals and four assists) in 12 appearances for the Catalan club.\nDespite Barca likely having Raphinha and Ferran Torres back fit for the trip to Madrid, it would be the first game for both players since recovering from hamstring injuries. It does not seem like a situation in which Flick can risk starting both of them. Torres has the slight advantage, given he made the bench on Tuesday.\nIf Torres does start, we will see Rashford operating as a left-winger against Madrid. Flick considers this his ideal position in Barca’s system, despite him covering centrally over the past week.\nDressing-room sources say Rashford has made a very positive impression since landing on loan from Manchester United. He is described as a shy character, but visibly happy to be part of the group and very willing to adapt to the team’s dynamics.\nAdvertisement\nRashford has proved to be a significant upgrade on Flick’s back-up options from last season — Pau Victor and Ansu Fati — although there are still challenges to take on for him and the team.\nFlick has in particular criticised the team’s pressing in the early weeks of this season. He believes it has dropped compared to their title-winning 2024-25 campaign. Though the absences of Raphina and Torres have contributed to that. Barca’s coaching staff are happy with what Rashford has delivered, but they admit pressing is not among his strongest traits. “It’s normal, every player is different, but the important thing is all the attackers are fully focused on their duties against Real Madrid,” a dressing room source added.\nRight now, Rashford seems to be in the best place, football-wise, he has been for quite some time.\nThis is the perfect moment for him to seize the occasion and shine on one of the biggest stages in world football.\nPol Ballus\nTrent Alexander-Arnold\nAlexander-Arnold could play his first Clasico on Sunday, and is expected to be in the Madrid squad for the first time since his injury in the Champions League opener against French visitors Marseille on September 16. Madrid confirmed the following day that he had suffered a hamstring injury, and at the time feared it could keep him out for six to eight weeks.\nIt brought the progress of Trent (this is the name he has worn on his shirt since leaving Liverpool in the summer) at his new club to a sudden halt. The 27-year-old’s start in Spain has not been easy due to a combination of factors, on which subject The Athletic reported in depth in September:\nBack in August, two sources with access to the day-to-day goings-on at Madrid’s training ground said Alexander-Arnold was still in the process of reaching the right rhythm and tempo to properly gel with his team-mates. More recently, the same sources called for patience with the Englishman, arguing that he also needs to find his voice within the dressing room.\nAt the time of his injury, Alexander-Arnold was starting to show signs of turning a corner. He had been a starter in Madrid’s first three home matches, with captain Dani Carvajal replacing him at right-back for away games.\nAdvertisement\nMadrid have confidence in him and his career. They believe he has key contributions to make, bringing hierarchy and experience to the squad. But having not played against Juventus, Federico Valverde is expected to start on Sunday.\nIt is worth remembering that Madrid fans began to take a liking to Alexander-Arnold because of a match against Barcelona — the second leg of a 2018-2019 Champions League semi-final, when Liverpool came back from losing 3-0 away with a 4-0 win at Anfield.\nThat famous night, Madrid celebrated the corner that he took so quickly to surprise Barcelona and allow Divock Origi to score the goal that sent them through.\nAll of the club’s fans hope he pulls another trick out of the bag on Sunday at the Bernabeu.\nMario Cortegana",
  "word_count": 1628,
  "scraped_at": "2026-02-14T01:52:49.017067",
  "_text_extracted": true
}