{
  "article_id": "04f81f1ae5ea",
  "url": "https://www.ghanaiantimes.com.gh/no-one-is-thinking-about-lukaku/",
  "title": "  No one is thinking about Lukaku - Ghanaian Times",
  "date": "20231020T093000Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘No one is thinking about Lukaku\nInter Milan CEO, Giuseppe Marotta, has insisted that not a single person at the club is dwelling on Romelu Lukaku’s decision to snub a return to San Siro this summer.\nThe Belgium international fired the Nerazzurri to the 2020-21 Serie A title with 24 top-flight goals under Antonio Conte, before departing in a £97.5m deal to Chelsea that same summer.\nHowever, Lukaku struggled to reacclimatise to life back in the Premier League and made a rod for his own back with the fans after admitting that he was pining for a return to Serie A.\nThe 30-year-old’s calls were answered last summer as he made the move back to Inter on a season-long loan, during which he scored 14 goals and provided seven assists in 37 games, winning the Coppa Italia and Supercoppa Italiana alongside picking up a Champions League runners-up medal.\nAnother stint at San Siro either on loan or permanently was mooted for Lukaku once the season had concluded, but the striker was also understood to have been in talks with Juventus, which allegedly left Inter feeling betrayed.\nA transfer to Juventus did not materialise for Lukaku, but the ex-Manchester United man has now reunited with Jose Mourinho at Roma and boasts seven goals from his first eight games for the Giallorossi.\nLukaku’s move to Stadio Olimpico could be made permanent for £37m in the summer of 2024, and Marotta was recently asked about the striker’s behaviour in an interview with Gazzetta dello Sport.\nHowever, the Inter CEO insisted that the Chelsea man is no longer a topic of discussion at San Siro and refused to criticise his conduct, saying: “Lukaku represents our past, it’s just our past,” as quoted by Fabrizio Romano.\n“No one is thinking about him at Inter, not even one single person His behaviour? It happens in football. It’s not the first time it happens.”- SportsMole",
  "word_count": 318,
  "scraped_at": "2026-02-14T01:56:32.773656",
  "_text_extracted": true
}