{
  "article_id": "04fd043144cc",
  "url": "https://www.90min.com/posts/how-psg-can-win-champions-league-in-2023-24",
  "title": "How PSG can win the Champions League in 2023 / 24",
  "date": "20230311T144500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How PSG can win the Champions League in 2023/24\nBy Euan Burns\nFor another season, the Champions League has eluded Paris Saint-Germain. They were knocked out in the round of 16 by Bayern Munich after losing the first leg 1-0 in Paris, and the second leg 2-0 in Munich.\nChristophe Galtier has become yet another coach who could not get PSG over the line, at least not so far. It remains to be seen whether they will allow him to continue as the coach next season.\nIn 12 years of Qatar Sports Investment ownership, just over £1.5bn has been spent on players and they have gone beyond the quarter-finals of the Champions League twice. It's no secret it's the prize they desire most, but PSG have suffered failure year on year.\nHere is a look at what PSG could do to finally bring Champions League glory to France in the 2023/34 season.\nKeep Messi and Mbappe, let Neymar go\nIn these sort of situations, it can be the right call to get rid of the more established stars who are perhaps holding the team back. That is not entirely the case with PSG. They have to make sure they can keep Lionel Messi and Kylian Mbappe this summer as they simply cannot be replaced.\nIt will not be easy though as Messi is out of contract and Real Madrid could make a definitive move for Mbappe in the summer. Having failed to win the Champions League again, Mbappe could view this season as the final straw.\nIt has to be assumed there is at least one more season in Messi that makes him worth the figures it will take to keep him. Cash has never been the issue for PSG, though; it's how they spread the spending and the characters they bring in.\nAs for Neymar, his injury issues mean he currently looks like the weak link of the three, despite his incredible talent. They seem to want him gone anyway and they cannot win the Champions League with three forwards who do no work off the ball.\nPSG need to sacrifice a flair player for a more hard-working and industrial player somewhere else in the squad, in whatever shape they may choose.\nBolster the defence\nThe major area of the squad that needs addressing, beyond keeping two of their three superstars, is the defence. Injuries have been unfortunate for PSG this season but they have not been able to deal with them due to the lack of quality depth.\nThey started the second leg against Bayern Munich with Danilo Pereira, who is a midfielder, in the back three as Pascal Kimpembe is injured. Marquinhos was then struck down during the game so with no senior central defenders on the bench, Nordi Mukiele had to come on to form a back three of a wing-back, a central midfielder and an almost 37-year-old Sergio Ramos.\nWhile not officially confirmed, it is widely expected Inter's Milan Skriniar will be a PSG defender next season, joining on a free transfer. That is a good pickup but another big signing is probably needed in that area if they are to continue playing with a back three. Napoli's Kim Min-jae could be a good option, but it is something they must get right.\nREAD NEXT\nShould Christophe Galtier stay?\nPSG are quick to change coaches generally once it becomes clear that the big prize isn't going to be obtained. Carlo Ancelotti, Laurent Blanc, Unai Emery, Thomas Tuchel, Mauricio Pochettino and Christophe Galtier (so far) have all now tried and failed under QSI's ownership.\nGaltier's time at the club is not over yet and he is only in his first season. Given they are eight points clear at the top of Ligue 1, there's nothing to gain by sacking him in response to this defeat. There will certainly be discussions taking place around a possible replacement, though. It should be remembered that Galtier saw his side get knocked out of the Coupe de France by Marseille so it will just be the one major trophy this season.\nThe current pool of available managers being linked includes Zinedine Zidane, who knows how to win the Champions League, Luis Enrique, who has won it once, and Thomas Tuchel, who has also won it once but failed to do so when at PSG.\nIf they want to win it next season, you'd think they have to get someone who has done it before, but Zidane has been out of the game for two years and Enrique hasn't coached a club side since 2019.\nUse local talent\nPeople have been shouting this at Paris Saint-Germain for a very long time, so it is hardly a niche suggestion. Paris is considered one of the three major hotbeds of football talent in the world alongside south London and Sao Paulo.\nA disproportionate number of great current players have been on PSG's books at some point but have had their success elsewhere. An academy is not there just to create players for the first team, but it should benefit the first team more than it has been doing so at PSG.\nPlayers that were once at PSG and could have been of use to the team include but are not limited to Kingsley Coman (Bayern Munich), Matteo Guendouzi (Marseille), Moussa Dembele (Lyon), Adrien Rabiot (Juventus), Odsonne Edouard (Crystal Palace), Christopher Nkunku (RB Leipzig and soon Chelsea), Xavi Simons (PSV) and Arnaud Kalimuendo (Rennes).\nThis season, the only real splash to be made by an academy player has come through Warren Zaire-Emery. The 17-year-old midfielder impressed against Bayern Munich and seemed to show more intent than many of his teammates.\nBlooding a few more youngsters during the rest of the campaign and at the start of the next could mean that by the time the knockouts come around again, you have a handful of good young players in the first team who have a very different mindset to the established stars that have let PSG down so many times in the past.\nIf you combine a hungrier and less-spoiled squad with a coach who knows how to win the Champions League, a more balanced and deep squad, and the bewitching talent of Lionel Messi and Kylian Mbappe, there is a chance that with many big European sides in transition, the door is still open next season for PSG to win the Champions League.",
  "word_count": 1069,
  "scraped_at": "2026-02-14T01:59:46.889424",
  "_text_extracted": true
}