{
  "article_id": "052a5cecdd46",
  "url": "https://www.con-telegraph.ie/2026/01/01/enzo-marescas-chelsea-exit-came-after-multiple-discussions-with-manchester-city/",
  "title": "Enzo Maresca Chelsea exit came after multiple discussions with Manchester City",
  "date": "20260101T231500Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca’s Chelsea exit came after multiple discussions with Manchester City\nBy Robert O'Connor, Press Association\nEnzo Maresca’s departure from Chelsea came after he informed the club he had been in contact on multiple occasions with Manchester City about taking over from Pep Guardiola, the Press Association understands.\nThe Italian left his job on Thursday after 18 months during which time he led the club back to the Champions League after a two-year absence as well as winning the Conference League and World Club Cup.\nHowever, his willingness to speak to City despite having three-and-a-half years of his contract to run, together with a more general deterioration in his relationship with the club, brought matters to a head and led to a parting of ways.\nThe feeling at Chelsea is that their former head coach showed a lack of respect in speaking to City, who could be looking for a new boss this summer if as reported Guardiola chooses to step down, particularly following the gamble the club took in hiring Maresca directly from Leicester of the Championship.\nPA also understands that Maresca’s reluctance to heed the advice of medical staff in regards to team selections, potentially risking the fitness of players who had recently returned from injury, also played a significant part in making his situation untenable.\nIt was this, and not a wider disagreement with the sporting directors, that was at the core of the issue when Maresca talked about his “worst 48 hours” at the club and not being supported internally following the win over Everton on December 13.\nThe Italian’s refusal to clarify that his comments were aimed at the medical staff led to intense speculation that he was taking aim at the club’s hierarchy, further muddying the waters and placing the relationship in a state of terminal decline.\nA number of players during Maresca’s tenure have had their game time carefully managed, most notably Reece James and Cole Palmer, with problems relating to repeated injuries meaning the club have been highly cautious about overloading players.\nMaresca was booed by supporters at Stamford Bridge during Tuesday’s 2-2 draw with Bournemouth – his final match in charge – when he substituted Palmer in the final half hour.\nIt is also understood that suggestions Maresca was excluded from decisions surrounding recruitment, which is led by a five-strong team headed by co-sporting directors Paul Winstanley and Laurence Stewart, are wide of the mark, with no acquisitions sanctioned without the head coach’s green light.\nA statement from the club on Thursday said: “Chelsea Football Club and head coach Enzo Maresca have parted company.\n“During his time at the club, Enzo led the team to success in the Uefa Conference League and the FIFA Club World Cup. Those achievements will remain an important part of the club’s recent history, and we thank him for his contributions to the club.\n“With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the club believe a change gives the team the best chance of getting the season back on track. We wish Enzo well for the future.”\nLiam Rosenior, the head coach of French club Strasbourg, who are owned by Chelsea’s parent company BlueCo, has emerged as the early favourite to replace Maresca among bookmakers.\nChelsea Under-21s head coach Calum McFarlane will speak to the media on Friday afternoon at a press conference to preview the weekend game against City.",
  "word_count": 574,
  "scraped_at": "2026-02-14T02:15:58.636088",
  "_text_extracted": true
}