{
  "article_id": "05605d46a2ab",
  "url": "https://www.caughtoffside.com/2023/06/17/exclusive-fabrizio-romano-reveals-the-reasons-why-chelseas-mason-mount-wants-to-join-man-united/",
  "title": "Chelsea news : Romano reveals why Mason Mount wants MUFC move",
  "date": "20230617T141500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s no secret that Mason Mount wants to leave Chelsea Football Club, with Manchester United believed to be one of the club’s that are interested in his services.\nThe England international clearly feels let down by the Blues, and with chaos still reigning at the Stamford Bridge outfit, Mount appears to want to start afresh elsewhere.\nFor a player with such a bright future in the game and an enviable skill set, one could argue that Chelsea have really dropped the ball on this one.\nErik ten Hag has proven over the course of the season that not only does he have superior tactical nous, but that he’s also a master motivator of men and knows exactly how to get the best out of them.\nHe was within one goal of winning both domestic cup competitions in his first season, whilst also qualifying for next season’s Champions League.\nWith the right players on board at Old Trafford, there’s no reason why he can’t lead the Red Devils to further glory.\n‘The Red Devils have continued to send messages to Mount, making sure he knows how much they want him to join them. He is their priority signing,’ Fabrizio Romano revealed in his exclusive CaughtOffside Substack.\n‘The player appreciates ten Hag’s way of playing and his insistence on bringing Mount to Old Trafford. It’s an exciting project and the player is remaining calm about the situation as there is no issue at all regarding personal terms.\n‘United are also happy as they know Mount is keen to make the move, but the main outstanding issue is Chelsea’s position on the price.’\nWith the summer transfer window having only just opened, there’s plenty of time for both sides to come to an accord and get the deal done.\nIt’s now in Chelsea’s best interests to do just that because, very simply, their player no longer wishes to represent them.",
  "word_count": 317,
  "scraped_at": "2026-02-14T01:50:37.804831",
  "_text_extracted": true
}