{
  "article_id": "056a2cc761ce",
  "url": "https://cartilagefreecaptain.sbnation.com/champions-league-2025-26/66550/tottenham-hotspur-news-thomas-frank-champions-league-draw-monaco-press-conference",
  "title": "Frank on Monaco draw :  Today was not top  | Cartilage Free Captain",
  "date": "20251023T173000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When he one day looks back at his Tottenham Hotspur career, Thomas Frank will probably not point at yesterday’s scoreless draw at Monaco in the Champions League as a particularly memorable one. Or at least not memorable in a GOOD way. Spurs looked second best for virtually the whole 90 minutes, weathered 23 shots – eight of which were saved by Guglielmo Vicario – and should feel fortunate to leave the Principality with a point in Europe’s most prestigious club competition.\nFrank on Monaco draw: “Today was not top”\nYou don’t say!\nThe laundry list of complaints is pretty long. Spurs again struggled to progress the ball through midfield, though this time both Rodrigo Bentancur and Joao Palhinha struggled on both sides of the ball. Tottenham’s defense, notionally a strength this season, was carved open by Monaco attackers Maghnes Akliouche and Falorin Balogun repeatedly. Both Lucas Bergvall nor Xavi Simons were able to get going, and Richarlison and Randal Kolo Muani struggled to have any sort of impact.\nIn fact, out of the entire squad you could say only Vicario and Wilson Odobert distinguished themselves in a positive way against Monaco, and Odobert was subbed off in the second half after complaining about an abdominal injury; his status is still unknown.\nLots to talk about in the post-match press conference, then! Frank, is always, well…. frank when speaking to the media and he did not appear to have much interest in attempting to whitewash a terrible performance that nonetheless turned out to be a pretty okay result.\n“I think it was a game where relatively even first half and then a second half where I think Monaco was better than us, where we didn’t hit the performance we want. I think we lacked a bit of intensity overall in the game, especially the second half. And that combined with a day where we didn’t get too many players at a good enough level, that can happen.\n“I think we are learning [how to play in the] Champions League and every game in Champions League is difficult, especially away games against a good Monaco side, a Monaco side I said, before the game, which I also think it’s fair to say they had the best half of the season against us, but fair play to them and then the ability for us to compete in the Premier League and then in the Champions League is a challenge we are up for and want to.\n“I also think it’s fair to say last year we finished 17th and competed in Europa League, so we are taking it step by step. And it’s not the worst thing on a bad day to get a point and a clean sheet. I think today the clean sheet was down to a few things, but a big thing down to [Guglielmo] Vicario, I think, [who] played a fantastic game.”\nFrank’s come under a lot of criticism for the way he has set up this current Tottenham team to play, and U-Ball was back in effect on Wednesday night in Monaco. While he’s not come out and said it plainly, he’s been hinting at the idea that using central midfield to defend and progressing the ball through the flanks is the best way to get the most out of his players. The results have been if not impressive at least acceptable thus far, but the football itself has been nigh unwatchable, a far cry from the swashbuckling attack of Ange Postecoglou (at least early in Ange’s tenure).\nHe was asked directly about losing two of the club’s best players in modern history in the past couple of seasons and whether the vacuum created by Harry Kane and Son Heung-Min leaving has had an impact in Spurs’ overall performances in his first season.\n“I think that’s fair to say. Wilson Odobert is a very, very good talent and I think he’s been positive but of course he is taking his step into the Premier League and the Champions League. With other players also, Xavi [Simons] has just come to the club, Lucas is a young player, Kudus has been exceptional for us, but also played more or less every minute. So we lack maybe that little extra spark today.\n“[Randal] Kolo Muani we believe can make a difference and looked positive when he came on. But he had that injury, so of course there’s some of that. No complaints, it is what it is. It’s my job to get the most out of the players available.”\nCoach speak is coach speak, but Frank has always been a little more honest in his press conferences. Frank is clear on a couple of things: Spurs are only now really starting to feel the impact of losing both Harry Kane and Son Heung-Min in recent seasons, and the combination of a team now marked by youth and inexperience are making things more difficult. But after what he called a “bad day,” Frank is also hinting at the idea that the team he has at his disposal right now is possibly not what he ideally wants or needs to be a contender in the league this season.\nThat doesn’t change the fact that it was still a bad game, and Tottenham essentially stole a result. Frank even seems to concede that point, and was open to the idea that his young team is struggling with the intensity of playing multiple high-level matches in a week.\n“Good question. Maybe we need to think a little bit more about it. I’ll try to come up with an answer. There can be many, many things. It can be a combination of play it good and cover it. It was a very competitive game against Villa. I think we performed very well. Then to go again. Some of them haven’t done that too much, some have. It could be just on the day you don’t get a top performance. I think the first half was okay in that sense, but I think in the second half we lacked more.\n“I don’t think it’s effort. I think it’s more the ability to go again and again and again in every action throughout a game. I think it’s not been a problem at other times. Sometimes it is. Today was not top.”\nFrank did have praise for one of his young players — Archie Gray has found Premier League minutes hard to come by lately but in Monaco he started and played 90 minutes, albeit he played most of the match at left back. It was a curious positional choice for Gray, who has mostly played midfield this season but had a lot of games at right back and in central defense during Postecoglou’s first season. Gray looked a little hairy out there at times — no different than the majority of the back line, to be fair — but Frank said his positional flexibility is an asset.\n“I think [Gray] solves it very well, as he’s done a lot of times last year, left-back, right-back and centre-back. I think he can play all three positions. I think his best position is still midfielder. But I think he can play all three. I like his character and effort in the left-back today. He just carried on when he came into the midfield and did well there as well.”\nThe match may have been painful on the eyes, but the old heads will remember any number of terrible performances away in Europe over the past 15 years or so. In the end, a Champions League point in Monaco is not a bad result; Spurs are still undefeated in the competition and with five points from three matches are solidly in the knockout phase of the competition. Spurs now turn their attention back to the Premier League with a trip to Merseyside to play in Everton’s new stadium this weekend; their next Champions League match is home to winless Copenhagen on November 4.",
  "word_count": 1333,
  "scraped_at": "2026-02-14T02:26:56.606452",
  "_text_extracted": true
}