{
  "article_id": "05874da88c47",
  "url": "https://www.hexham-courant.co.uk/news/23610355.newcastle-united-set-sign-ac-milan-maestro-sandro-tonali/",
  "title": "Newcastle United set to sign AC Milan maestro Sandro Tonali",
  "date": "20230623T204500Z",
  "domain": "hexham-courant.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United have reportedly completed the signing of Sandro Tonali from AC Milan in a record transfer for an Italian player.\nTransfer specialist Fabrizio Romano has suggested that a deal for the midfielder has now been completed, with the Toon expected to pay £67.7m to bring him to St James' Park.\nThe 23-year-old will sign a contract until 2029 with Eddie Howe's side and becomes the first big-name signing of the summer following qualification for the Champions League last season.\nIt is certainly a statement from the Magpies to sign a player who recently won the Serie A title and featured in the Champions League semi-final with the Rossoneri but perhaps not a surprise given the transformation of the club since the takeover in 2021.\nTonali joins a talented midfield that already includes the likes of Bruno Guimaraes, Joelinton and Joe Willock, but depth and quality will be vital in Howe's squad for the upcoming campaign if they are going to balance domestic and European football.\nThe youngster has drawn comparisons with Italian football legend Andrea Pirlo in the past and the former Juventus man suggested that Tonali was the best in the league when he was just 19 in 2020.\nDespite being just 23, the midfielder boasts a wealth of experience having made 130 appearances for AC Milan in his three seasons at the San Siro, while he has also featured 14 times for Italy under manager Roberto Mancini.\nHis experience at the top will be vital for Howe's side next season as Champions League football returns to St James' Park for the first time in 20 years and he will no doubt challenge for a regular starting spot in the Magpies' midfield.\nNewcastle's signing of Tonali symbolises just how far they have progressed in the last two years.",
  "word_count": 300,
  "scraped_at": "2026-02-14T01:56:02.428173",
  "_text_extracted": true
}