{
  "article_id": "05a08416192e",
  "url": "https://www.caughtoffside.com/2024/09/19/transfer-news-madueke-newcastle-mainoo-contract/",
  "title": "Transfer news : Madueke Newcastle , Mainoo contract",
  "date": "20240919T181500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on Fabrizio Romano’s Daily Briefing, a subscription service. If you would like to receive Fabrizio Romano’s exclusive transfer news via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\nAnthony Martial finds a new club at last\nWe keep having fresh updates on free agents, with Adrien Rabiot confirmed earlier this week as a new player for Olympique Marseille after finally making a decision on a new club after leaving Juventus, while now there’s also news on Anthony Martial as he’s joined AEK Athens.\nMartial had been a free agent since leaving Manchester United earlier in the summer, and he’s now completed his move to Greece on a three-year deal. Martial had been negotiating with Brazilian club Flamengo but his salary was too expensive for them, and so now he’s ready for this new experience in Greek football.\nIt was a long saga after he left United, with opportunities as well with Como and some clubs in Turkey, but now it’s all done for him to join AEK Athens for this new chapter.\nNoni Madueke had chances to leave Chelsea this summer\nThere were a lot of stories about Noni Madueke’s future at Chelsea this summer, and it’s true that there was at one point a moment when the Blues considered selling Madueke. They never considered a loan or that kind of solution, but in case of receiving an important proposal, it was a possibility for them to sell the player.\nThat was at the end of June, and it came during that period you may remember when there was some confusion with Financial Fair Play and we saw Newcastle and other clubs trying some swap deals around England to make the FFP rules work for them.\nSo, at that point Madueke was one of the main targets for Newcastle. Then what happened? After that, Chelsea saw how special Madueke was in training and in official games under Enzo Maresca. There is the feeling inside Chelsea that Maresca and his staff have been able to change the mindset of Madueke – it’s something they’ve been working on in training and you can see it already in official games.\nIt’s important to note that there was not even a negotiation between clubs, from what I’m told. It was just strong interest as Newcastle appreciate Madueke, but no talks, no price communicated, not even a discussion with the player’s camp. He was just very high on the Magpies’ list.\nChelsea are super happy with him and he’s performing really well this season, recently earning his first England call-up, and so that’s why Chelsea decided in August to call him untouchable. He’s now considered a really important player for this project for this season and the long-term.\nThe possibility of going to Newcastle was there in June, and for Newcastle Madueke was considered the perfect player. He was also on the list at RB Leipzig, who were looking for a winger and who also negotiated for Rayan Cherki. In the end they decided to go for a different kind of player in Antonio Nusa, but Madueke was also appreciated there.\nNow, however, it’s clear that Madueke is staying at Chelsea and is an important player for them after his fantastic recent performances, so it’s a completely different story around the winger.\nI think Chelsea got this decision on Madueke right, and it’s part of a strong summer on the market overall for the Blues. I’d say they look better than last season – Jadon Sancho and Joao Felix are two great additions and of course they also added more players. I think they have a very good squad; they need to find the right balance under Maresca but I expect Chelsea to have a good season.\nManchester United preparing to advance Kobbie Mainoo contract talks\nAs I reported earlier in the summer, Manchester United have been preparing to offer a new contract to Kobbie Mainoo. Now it’s September and we can say that Man United are now preparing to advance in talks with Mainoo.\nAt the moment, it’s still an internal process for United – they are preparing the proposal, meaning the salary, the bonuses, and, although it’s nothing urgent, they want to offer this fantastic talent an important contract to make him feel in the best condition possible at Man United.\nThe feeling is mutual – United are very happy with Mainoo and he is also very happy at the club, where he has the full trust of his manager Erik ten Hag, who has been such a key figure in developing him in the first-team.\nEveryone at the club is together on this – the new owners, the directors – they all want Mainoo to be the face of the club and the face of this interesting new project. So, the new contract proposal is being prepared, and Amad Diallo will be another one to watch as the club build together around their talented young players.\nRodri on his future and possible player strikes\nManchester City midfielder Rodri, speaking ahead of the Champions League game with Inter Milan, confirmed something important on his future, which is that he is not talking to any other club.\nIt’s normal to see rumours about a top player like Rodri, and we’ve heard some stories about Real Madrid, but this is just part of being one of the very best players in the world in his position, it’s absolutely normal. Still, Rodri himself has clarified once again how important it is for him to focus on Man City.\nSo for now, Rodri has a contract with Man City, and, as he’s said, he’s not thinking about anyone else, he’s very calm and relaxed, while Man City of course want to keep him, and they consider his new contract one of the priorities for the next months. There will be a discussion, so let’s wait and see how it goes, but for now there is nothing concrete with any other clubs, so let’s respect Rodri and respect City and see what the outcome of their talks will be.\nOf course, Rodri has also been one of a few players, along with Jules Kounde, Alisson and Thibaut Courtois, to raise the important issue of players now being expected to compete in so many games, hinting that they could be forced to go on strike over the heavy schedule.\nI understand the players’ position. It’s many games, and of course they have excellent salaries but at the same time it’s still your life and they want to rest more also to offer better performances when they play. This topic will be discussed again with the institutions, I’m sure.\nYann Bisseck and those links with Arsenal\nArsenal have been dealt the blow of losing Martin Odegaard to injury, and we wish him all the best and a speedy recovery, but another player who has been really unfortunate with fitness problems as well is Takehiro Tomiyasu.\nThis has led to some speculation about Tomiyasu’s future and possible replacements for the Japanese defender. For instance, I’m aware there have been some stories linking Arsenal with an interest in Yann Bisseck, but in all honesty there is nothing at the moment.\nNo talks, no contacts, zero so far. He’s a key player for Inter and he just joined one year ago so they’re not planning for anything now, Bisseck is doing very well.\nTottenham want to keep Cristian Romero\nCristian Romero continues to be an important player for Tottenham, and so it’s perhaps normal that we’re starting to see rumours about interest from other top clubs, with some fans asking me if there’s anything to the links with Real Madrid.\nHowever, I’m told that nothing is happening now. Romero’s contract could be a topic in the next months as Spurs of course want to keep him for the long term; but no active talks have started yet.",
  "word_count": 1324,
  "scraped_at": "2026-02-14T02:01:51.732627",
  "_text_extracted": true
}