{
  "article_id": "05b34482b34e",
  "url": "https://www.uefa.com/insideuefa/news/0280-17dc5e89fbb9-35f6ff237f7c-1000/",
  "title": "UEFA Football Board urges for more clarity on handball rule | Inside UEFA",
  "date": "20230425T123000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA Football Board urges more clarity on handball rule\nTuesday, April 25, 2023\nArticle summary\nUEFA Football Board expressed satisfaction with the level of refereeing in the UEFA club competitions and suggested that the same unified approach should also be applied across Europe.\nArticle top media content\nArticle body\nThe UEFA Football Board held its inaugural meeting at the House of European Football in Nyon, Switzerland, reflecting on various topics, including the Laws of the Game and refereeing matters such as the line of intervention, VAR, the handball rule and player behaviour.\nIn an engaging and constructive discussion, the Board expressed great satisfaction with the current level of refereeing in the European club competitions, especially in the UEFA Champions League, and suggested that the same unified approach to refereeing should be applied in domestic competitions across Europe.\nWith regard to the Laws of the Game, which stipulate that not every touch of a player's hand/arm with the ball is an offence, the Board issued the following recommendations for next season for better compliance of the Laws with the nature of the game:\n• In their guidelines for the next season, the Board recommends that UEFA should clarify that no handball offence should be called on a player if the ball is previously deflected from his own body and, in particular, when the ball does not go towards the goal.\n• On the same notice, the Board recommends that not every handball should automatically lead to a caution after every shot at goal, as anticipated by current guidelines.\n• The Board encourages the referees to be more decisive in cautioning players who display unsporting behaviour, especially when attempting to deceive the referee by feigning injury or pretending to have been fouled.\n• UEFA should launch an initiative towards the IFAB for the amendment of Law 12, which foresees that a player should be sent off for denying the opposing team a goal or an obvious goal-scoring opportunity by a handball offence. The Board feels players should be sent off only if they deliberately and intentionally touch the ball with their hand/arm. In case of other handball offences, the players should only be cautioned.\nThe Board members also received an update on the international match calendar and the post-2024 competition reforms.\nThe inaugural meeting was attended by Éric Abidal, Rafael Benítez, Fabio Capello, Petr Čech, Luís Figo, Robbie Keane, Jürgen Klinsmann, Ronald Koeman, Philipp Lahm, Michael Laudrup, Paolo Maldini, Roberto Martínez, Juan Mata, Predrag Mijatović, Gareth Southgate, Patrick Vieira, Rudi Völler, Javier Zanetti and Zinedine Zidane.\nOther Board members, who could not attend the meeting, were also consulted and shared their opinions on these topics as part of this project.\nThe complete composition of the UEFA Football Board is available here.\nZvonimir Boban:\n“Having such beautiful football minds around the same table proved to be not just desirable but necessary. It was a true honour to be part of such an open and genuine discussion, and I am confident that we have found reasonable solutions to overcome a few stumbling blocks that negatively impact what happens on the field of play. It might sound like a banality, but mistakes happen, and we should not stigmatise them, influenced by the shirt we wear. The handball rule, for example, will always be disputed, but we can make it more consistent and aligned with the game's true nature.”\nPaolo Maldini:\n“The Football Board is an excellent initiative from UEFA, ensuring that the voice from the pitch is heard at an institutional level. It was great to see many familiar faces and experiences assembled under the same roof, openly discussing football's most critical issues. Most of us were opponents on the field of play, but now we are here together to help and protect what is most precious to us - the game itself. I am looking forward to our next meeting.”\nRudi Völler:\n“Discussing the game and specific regulations with this many prominent figures from the football world was exciting. I liked it very much. Most of us don't play the game anymore, and many were very successful in other different roles, so each of us brings a unique experience to the table. In short, an excellent beginning.”\nPatrick Vieira:\n“I am really excited to be here, to be honest. There were a lot of ideas in the room, a lot of experience, and hopefully, some really good solutions could arise from this discussion. We come from different countries and backgrounds, but we all share a universal passion, love for football, and willingness to protect our beautiful game.”\nNote to media:\nPhoto gallery available here.\nVideo for download available here.",
  "word_count": 775,
  "scraped_at": "2026-02-14T01:50:29.470875",
  "_text_extracted": true
}