{
  "article_id": "05b57e4f2380",
  "url": "https://www.caughtoffside.com/2023/07/14/manchester-united-could-offer-more-than-e60-million-for-25-year-old-frenchman/",
  "title": "Manchester United keen on Theo Hernandez",
  "date": "20230714T094500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly interested in signing the AC Milan defender Theo Hernandez.\nA report from Fichajes claims that the Red Devils could be willing to offer more than €60 million for the French international defender.\nHernandez has been a key player for AC Milan and it remains to be seen whether the Rossoneri are ready to sanction his departure this summer.\nApparently Manchester United are not content with their options in the left-back position, and they are looking to bring in reinforcements.\nHernandez has proven himself at the highest level with club and country and he should prove to be a quality acquisition.\nThe 25-year-old certainly has the ability to make an immediate impact in the Premier League, and he will certainly improve Manchester United defensively.\nThe Red Devils will be hoping to compete for the league title and the UEFA Champions League next season and they need top-class players in order to match up to the European elite.\nCurrently, Manchester United have Luke Shaw and Tyrell Malacia as their left-back options. It will be interesting to see if they decide to sell one of those players provided a move for Hernandez goes through.\nThe French international will be hoping for regular first-team action at Old Trafford and Erik ten Hag should look to cash in on one of his left-backs before signing Hernandez.\nThe 25-year-old is at the peak of his powers and he is likely to play his best football at Manchester United if the transfer goes through.",
  "word_count": 251,
  "scraped_at": "2026-02-14T01:48:22.652102",
  "_text_extracted": true
}