{
  "article_id": "05d2ee3f081e",
  "url": "https://www.themag.co.uk/2025/01/newcastle-3-wolves-0-instant-newcastle-united-fan-writer-reaction-st-james-park/",
  "title": "Newcastle 3 Wolves 0 - Instant Newcastle United fan / writer reaction",
  "date": "20250115T233000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle 3 Wolves 0 – Instant Newcastle United fan/writer reaction\nNewcastle 3 Wolves 0 – Wednesday 15 January 2025 7.30pm\nInstant fan / writer reaction from some of our regular contributors on The Mag.\nNat Seaton:\n‘NINE in a row!!!\nA thoroughly deserved win with Isak and Gordon getting the goals, but special mention (yet again) for Tonali, he is a joy to watch and just keeps getting better, how much more is there to come?!\nExciting times and what great football we’re playing, getting us to this point.\nCan’t wait for Saturday, we all know what number win in a row that would be!!’\nBilly Miller:\n‘Alexander Isak, record breaker!\nHe’s secured the Newcastle United record for consecutive Premier League games scored in.\nNow he must be eyeing Vardy’s overall record. We’ve got the fixtures for him to do it.\nIf we can keep him fit, he’s got every chance of the golden boot this season.\nMore importantly, we’ll have every chance of Champions League qualification.\nWe’ve hopped into 4th after dominating a toothless Wolves side.\nIt’s nine wins on the bounce now. The mighty Mags are absolutely flying.’\nDavid Punton:\n‘A ninth straight win and into the top four we go. We’re buzzing.\nImmense from Isak yet again. Another two goals and an assist to top it off.\nWolves are battling for their Premier League lives so we had to be patient tonight. The chances came though and they went in.\nWe gave Wolves a fair few chances up the other end but they couldn’t take them and were thwarted by a stunning save from Dubravka and the VAR going our way too.\nYou could also say we have won well and there is still plenty of room to get even better than this.\nThat said, a 3-0 win is not to be sniffed at. I love this Newcastle team.’\nGToon:\n‘Amazing to see this winning run continue.\nWhat a team we are.\nThings are really coming together with the level of performance within the group.\nIt’s great to see we are giving players a break too, when the result is confirmed.\nAnd who would have thought that Bournemouth on Saturday are probably going to be the toughest test of our run and it’s a top six clash.\nBizzare.’\nThe Armchair Fan:\n‘Absolutely amazing!\nNine wins in a row, six in the league and three in the cups!\nTop four, semi-final of one cup and fourth round of another.\nHave we ever had things so good?!\nHappy days! Roll on Saturday!’\nGreg McPeake:\n‘Local Portuguese bar and they are quite happy to put the Newcastle game on ahead of the North London derby.\nLove the fact the self-entitled Arsenal lot think they can buy whoever.\nIsak doing the business again, rubbing their noses in it.\nA comfortable win and though Wolves worked hard the lads were in control.’\nMark Jankowski:\n‘Wolves came into the game having seen an upturn in their performances since having appointed Pereira as manager.\nTo Wolves’ credit they gave a confident and spirited performance and if they’d had a striker with half as much finishing ability as our number 14, it may have been a much closer game.\nUltimately Newcastle’s quality shone through in a game that wasn’t a classic.\nTwo more goals for Isak (one had a significant deflection) and another for Gordon sealed the points.\nI’ve got a feeling it winning run may end on Saturday but that’s a worry for another day, for now I’ll enjoy being 4th.’\nTony Mallabar:\n‘Don’t think I’ve been to a home league game midweek where I celebrated a first half goal so much.\nNot because Isak got his 8th in a row goal. But because it was freezing and collectively half the east stand got up to empty our bladders.\nIt was a shame seeing one of England’s old founding clubs only fill two thirds of the away end.\nIf any Wolves fans reading this think am having a pop, totally not. Just shame to see the current malaise in how match day fans are treated, a midweek January trip to Newcastle cannot be the easiest to attend.\nBut never mind, we have now won 8 in a row, so an even more must win game on Saturday against a team we’ve never beaten in the Premier League under NGE’s tutelage.’\nMatt Busby said to Joe Harvey:\n‘Job done.\nWe rode our luck at times and that was a game we might have lost earlier in the season. Momentum is everything.\nGood use of the subs by Eddie.\nAlex Isak is unplayable. How unselfish was he in setting up Anthony Gordon?\nBig Dan Burn and Botman also fantastic this evening.’\nNewcastle 3 Wolves 0 – Wednesday 15 January 2025 7.30pm\n(Stats via BBC Sport)\nGoals:\nNewcastle United:\nIsak 34, 57, Gordon 74\nWolves:\nPossession was Newcastle 60% Wolves 40%\nTotal shots were Newcastle 17 Wolves 13\nShots on target were Newcastle 5 Wolves 7\nCorners were Newcastle 4 Wolves 2\nTouches in the box Newcastle 32 Wolves 23\nNewcastle team v Wolves:\nDubravka, Livramento (Trippier 85), Botman, Burn, Hall, Tonali, Joelinton (Miley 83), Bruno, Murphy (Almiron 78), Isak (Osula 78), Gordon (Willock 78)\nUnused subs:\nVlachodimos, Kelly, Krafth, Longstaff\nNewcastle United upcoming matches:\nSaturday 18 January – Newcastle v Bournemouth (12.30pm) TNT Sports\nSaturday 25 January – Southampton v Newcastle (3pm)\nSaturday 1 February – Newcastle v Fulham (3pm)\nWednesday 5 February – Newcastle v Arsenal (8pm) Sky Sports (League Cup)\nWeekend of Saturday 8 February – Birmingham v Newcastle TBC (FA Cup)\nSaturday 15 February – Man City v Newcastle (3pm)\nSunday 23 February – Newcastle v Forest (2pm) Sky Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 961,
  "scraped_at": "2026-02-14T02:08:52.966419",
  "_text_extracted": true
}