{
  "article_id": "05ed6a1d53b7",
  "url": "https://www.dailynews.com/2024/05/20/lafc-looks-to-secure-u-s-open-cup-quarterfinal-spot-without-steve-cherundolo/",
  "title": "LAFC looks to secure U . S . Open Cup quarterfinal spot without Steve Cherundolo",
  "date": "20240521T031500Z",
  "domain": "dailynews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Prior to halftime of the Los Angeles Football Club’s Round of 32 U.S. Open Cup win in Las Vegas two weeks ago, Steve Cherundolo was sent off with a straight red card for engaging officials near midfielder Eduard Atuesta, who appeared to get stepped on after the ball was blown dead.\nReferee James Duling’s decision drew a bemused smile from the 45-year-old head coach, and, moments later, Cherundolo was unable to address his team in the visitor’s locker room at Cashman Field.\nInstead, scoreless at the break, a quick and loud word from assistant coach Ante Razov sharpened LAFC’s attitude and approach.\nThe second-half performance in a 3-1 win against the USL Championship Las Vegas Lights did more than set up a match with Loudoun United FC on Tuesday at BMO Stadium in the 109th edition of America’s oldest soccer tournament. It delivered LAFC’s first road victory of 2024 and kicked off a streak that will be extended to four straight wins if the Black & Gold reaches the Open Cup quarterfinals.\nAs Cherundolo takes in the action from the stands with his family and serves the one-game suspension for the red card, Razov will get his first opportunity in a decade of coaching to lead a team from the outset.\nThe retired 50-year-old goal scorer from Whittier, a three-time Open Cup champion while playing with the Chicago Fire, shrugged off the moment as particularly meaningful.\n“We’re prepared to go out and advance in the tournament,” Razov said.\nExpected to start against Loudoun like he did Las Vegas, “our coaching staff works very closely together, and they’re all very invested and very involved with the group, so there’s not much that changed other than Steve not being on the bench with us,” goalkeeper Abraham Romero added.\nCherundolo is the boss yet the dynamic with Razov and fellow assistants Marc Dos Santos and Oka Nikolov gives off the impression that the coaching staff “are like one,” said fullback Sergi Palencia, which the Spaniard described as atypical in his experience as a pro.\nRepresenting the suburbs of northern Virginia as the reserve team for D.C. United, Loudoun knocked out Orange County SC two weeks ago, when LAFC, in its fifth attempt at claiming a Lamar Hunt U.S. Open Cup trophy, joined the competition as one of eight MLS participants. (Seven remain.)\nLoudoun generally plays a back four and looks to hit vertically, counter press and quickly run up the field into channels. The club changed to five at the back in 3-0 victory against Monterey Bay FC at the 5,000-seat Segra Field in Leesburg, Virginia, last Saturday, a “close to perfect result” before the weeklong road trip to Southern California, 24-year-old winger Kalil ElMedkhar said.\n“They’re good footballers. It’s a good footballing team. Good players. Individual talent. They’re hard-working,” said Romero, who won the USL Championship with OCSC in 2021 alongside current Loudoun midfielder Tommy McCabe.\nAs it happens, the Open Cup match with LAFC comes while Loudoun – 3-6-2 in second division competition and currently eighth in its conference – was set to take a third trip to California during the past month for a USL Championship contest on the 25th in Irvine.\nDespite the Open Cup’s significance – a spot in the CONCACAF Champions League goes to the victor – limited ticket-buying interest from fans for the do-or-die competition will see Loudoun compete inside a half-capacity BMO Stadium, where Razov explained players must create their own intensity without the sights and sounds of a league match.\n“We understand it’s a different kind of game, but we’re at home on our field and we expect a certain standard of play,” Razov said.\nLOUDOUN UNITED FC AT LAFC\nWhat: U.S. Open Cup, Round of 16\nWhen: Tuesday, 7:30 p.m.\nWhere: BMO Stadium\nStreaming/Radio: watch.usopencup.com, mlssoccer.com, uslsoccer.com, 980 AM",
  "word_count": 636,
  "scraped_at": "2026-02-14T02:25:33.976888",
  "_text_extracted": true
}