{
  "article_id": "05ffb42360b4",
  "url": "https://theathletic.com/5279329/2024/02/16/kylian-mbappe-psg-exit-why/",
  "title": "Kylian Mbappe and PSG : What went wrong ? ",
  "date": "20240216T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was the news everyone was anticipating — and one of football’s worst-kept secrets.\nKylian Mbappe has told Paris Saint-Germain he will be leaving at the end of the season. There has not been an agreement between Mbappe and PSG over how his exit will be handled but it is expected to be made official in the next few months.\nAdvertisement\nMbappe’s exit at the age of 25 is a blow for PSG. Mbappe was the hometown hero, the boy from Bondy who returned to Paris to try to help its biggest club win European honours. He even renewed with PSG against all odds in the summer of 2022, seemingly providing a route to a long-term commitment to the club.\nSo why has it come to this?\nMbappe’s PSG story began when he lit up the Champions League for Monaco and signed for PSG in a €180million ($198m, £155m) deal at 18. While a lot was known about Mbappe’s potential, his performances for Monaco in the first half of that 2016-17 season drew rave reviews in France and comparisons with Thierry Henry.\nBut the matches that brought his talents to a wider audience came against Manchester City in their last-16 Champions League tie, scoring a goal in both legs.\n“Mbappe…” Pep Guardiola said after the first leg, shaking his head. “He is so fast.”\nThe forward scored three times over two legs against Borussia Dortmund in the quarter-final, ending that season with 26 goals in all competitions for Monaco and forcing his way into the France senior squad, becoming their youngest debutant Bleus since Maryan Wisniewski more than six decades earlier.\nIn the space of 12 months, Mbappe had gone from being a potential ‘next big thing’ to a player all the leading clubs wanted. Barcelona were extremely keen, particularly when Neymar left for PSG. Arsenal and Liverpool made serious enquiries to his entourage in the summer of 2017, with Arsene Wenger meeting him to try to persuade him to move to London. Both Manchester clubs showed interest. But the clubs pushing hardest were Real Madrid and PSG.\nMadrid were strong favourites and their offer of €180million (€150m guaranteed, €30m linked to future success) was accepted by Monaco. In an interview with Canal+, Vadim Vasilyev, Monaco’s vice president at the time, recalled telling Mbappe, “We have received an offer that was impossible to refuse, from the club of your dreams, so tell me your answer.”\nAdvertisement\nBut Mbappe’s negotiations with Madrid proved problematic. His father, Wilfried, wanted guarantees about playing time — not easy with Karim Benzema, Cristiano Ronaldo and Gareth Bale at the club — and expected Mbappe to be among Real’s highest earners. At a meeting in California, where Madrid were on a pre-season tour, Wilfried told the Spanish club’s hierarchy PSG had offered more money and more guarantees selection-wise. Relations were strained.\nTo the surprise of many, Mbappe ended up joining PSG. The French club had already broken the world transfer record to sign Neymar for €222million that summer, so they proposed a deal where he would move on a season-long loan from Monaco before making a permanent €180m transfer at the end of the season. “This is the project that will help me develop while I win titles,” he declared. Real Madrid could wait.\nAlong with Neymar’s move to Paris, Mbappe’s transfer caused deep disquiet among European football’s elite. Almost immediately, UEFA announced a formal investigation into PSG’s finances, “particularly in light of its recent transfer activity”. The investigation was closed 10 months later with UEFA saying that PSG’s finances “will remain under scrutiny”.\nBut there was a more wholesome angle to the deal. At 18 years old, Mbappe was coming home.\nShortly after being paraded in front of the media at the Parc des Princes on September 6, 2017, Mbappe got into a car and was driven from Paris’ leafy western suburbs, around La Peripherique to the north east, back to where it all began: back to Bondy, back to ‘le 93′, le neuf-trois.\nYou can take the boy out of Bondy. But Mbappe has always said you cannot take the Bondy out of the boy.\n“In Bondy, you learn values that go beyond football,” he wrote in his article for the Players’ Tribune in 2020. “You learn to treat everyone the same, because you’re all in the same pot. In Bondy, in the 93, in the banlieues, maybe there is not a lot of money, it’s true. But we are dreamers. We’re born that way, I think. Maybe it’s because dreaming doesn’t cost much. In fact, it’s free.”\nAnd so, in an event laid on by Nike, a €180million teenager kicked a ball around with boys and girls who shared his dreams. Overlooking them, on the side of a building, was a huge mural declaring Bondy to be ‘ville des possibles’, town of possibilities.\nAdvertisement\nThe 93rd departement, Seine-Saint-Denis, has the highest proportion of immigrants and the highest poverty rate. According to INSEE (France’s national institute of statistics and economic studies), 28.6 per cent of Bondy’s 50,000-plus residents live below the poverty line.\nLike so many of those economically challenged neighbourhoods in the sprawling Parisian suburbs, it is also a breeding ground for football talent. Three members of the France squad at the 2022 World Cup — Mbappe, William Saliba and Randal Kolo Muani — are from Bondy.\nBut when things went sour — and they did — Bondy also became a target. There was a death threat spray-painted on his mural in Bondy in January 2022, seemingly in response to a slight dip in PSG’s results. They still won Ligue 1 by a 15-point margin that season, with Mbappe scoring 39 goals in all competitions. But, with European success still elusive, dissatisfaction is rarely far from the surface.\nAt times, PSG has resembled a circus. Mbappe has called it a “divisive club” that “can attract gossip”.\nHe flourished alongside Neymar for a time, but the longer they spent in the same forward line and the same dressing room, the more difficult their relationship became. Messi’s arrival in 2021 was an extra complication, on the field and off it.\nMbappe’s relationship with PSG has been strained. There has been a long-running dispute over the club’s use of his image for commercial gain. “PSG is a big club and a big family,” he said last year, irked that an interview with him had been used as a voiceover in a video to promote season tickets. “But it is certainly not Kylian Saint-Germain.”\nIt has sometimes looked that way. The enormous contract he signed in 2022 gave him a voice to be heard by the club hierarchy when discussing football strategy. The appointment of sporting director Luis Campos, who backed him at Monaco, was seen as a nod to the club’s star player — though Mbappe has maintained he “will not go above the role of a footballer”.\nAdvertisement\nOn and off the pitch, Mbappe became the dominant personality in a team that also included Messi, Neymar and Sergio Ramos. He was scoring goals by the bucketload and earning huge sums of money in a trophy winning team in a city he loves. But PSG couldn’t keep him happy.\nTo borrow a line from U2, they gave him everything he ever wanted. It wasn’t what he wanted.\nIt was a surprise — not least to Real Madrid — when Mbappe extended his contract at PSG two years ago.\nHe had allowed his deal to run down to the final weeks, surely the prelude to a move to Spain. But no, he and his entourage spurned Madrid’s advances once again to stay with PSG, a two-year contract with the option — his option — to extend to June 2025.\nBut the following summer, Mbappe informed the PSG leadership he would not be renewing his deal to 2025. That put the club in a situation where, unless they cashed in on him soon, they were at risk of losing him on a free transfer at the end of this season.\nPSG were willing to sell him to Madrid for the right price. But matters were complicated when Al Hilal offered a world-record €300m fee to try to take him to Saudi Arabia.\nPSG accepted the transfer bid, but Mbappe said he was not willing even to discuss the transfer — his heart and mind were set, seemingly, on joining Real Madrid as a free agent this summer.\nHe began the new campaign as persona non grata at PSG, omitted (along with the Al Hilal-bound Neymar) from the club’s pre-season tour of Japan and South Korea and again when the Ligue 1 programme began against Lorient. But he was then reinstated to the squad — the club accepting the futility of a stand-off — and embarked on what has been his most prolific season at PSG, averaging more than a goal a game.\nBut the longer he has stayed at PSG, the more he has looked ready for a new challenge.\nAdvertisement\nIt comes back to something that, according to the book Je M’Appelle Kylian Mbappe, his mother said when he was weighing up whether to join PSG or Madrid in the summer of 2017: “You’re a genius at football, Kylian. Aren’t you going to be bored in Ligue 1?”\nBored is the wrong word. But the dream has always been Real Madrid.\nHe will likely be moving to Spain at the age of 25, a little later than he had sometimes hoped but entirely in keeping with the career path he outlined as a child: one that ended with Real Madrid.\nThere was also PSG’s perspective. They always wanted Mbappe to renew, but even earlier this month, they felt as though they had a plan in place for whatever came next — and that they were not beholden to him.\nMbappe has also made financial commitments if he does leave PSG this summer. He will have to return money to the club from the contract signed in 2022 and give up planned future payments.\nThe annual gross cost to PSG to keep hold of Mbappe is €200million. They plan to use that money to continue rebuilding the squad and renew their top young talents — Warren Zaire-Emery and RB Leipzig loanee Xavi Simons to name two — to new long-term contracts. Zaire-Emery has already agreed to his deal.\nAnother player PSG are keen to keep a hold of is Mbappe — but not Kylian. They want to keep Ethan, his 17-year-old brother, at the club. He made his PSG senior debut in the 3-1 Ligue 1 over Metz in December.\nThe club have already undergone major personnel changes. More than €300million of talent has been added, with 13 faces signed last summer in addition to new coach Luis Enrique. January also saw two more youngsters sign, 20-year-old defender Lucas Beraldo and 18-year-old midfielder Gabriel Moscardo, and the average age of the team has dropped dramatically. The emphasis is on casting aside their ‘superstar’ era with a team built on sustainability.\nAdvertisement\nThere are already targets in mind for the summer. Napoli striker Victor Osimhen is one on the list.\nThey are also eyeing a summer move for Gavi, the Barcelona midfielder. The 19-year-old has been a long-term target for Luis Enrique and club president Nasser Al-Khelaifi. While he is considered an ‘unsellable’ asset by Barcelona, their financial situation complicates any business they might do this summer. It is also not clear whether Gavi would be open to a move away from Barcelona.\nA PSG source, unnamed to protect relationships, also suggested that the club’s minority investor Arctos, which acquired a 12.5 per cent stake in December 2023, was comfortable with the club’s plan to move on without Mbappe. For a private equity group such as Arctos, the idea that any one business should have the level of financial liability on any one person, as PSG did on Mbappe, likely always seemed peculiar in the first place.\nMbappe will leave with five league titles, five domestic cups and one World Cup triumph from his time at the Parc des Princes.\nThe impact of his departure cannot be overstated. This is PSG’s greatest goalscorer, both in Europe and domestically. He is the France captain and the most prolific and consistent goalscorer the French league has seen since Jean-Pierre Papin for Marseille in the late 1980s and early 1990s. His exit will be a major blow for PSG, but also for his country.\nFor supporters in Paris, this will have been anticipated but no less easy to stomach. He is their star player, born on the outskirts of the city.\nIt may allow PSG to rebuild the squad but losing a player of Mbappe’s calibre will leave a huge mark on and off the field.\nAdditional reporting: Adam Crafton\n(Top photo: Sameer Al-Doumy/AFP via Getty Images)",
  "word_count": 2145,
  "scraped_at": "2026-02-14T01:51:19.060493",
  "_text_extracted": true
}