{
  "article_id": "0608399d0208",
  "url": "https://thepeoplesperson.com/2023/05/02/andre-marriner-appointed-referee-for-manchester-uniteds-visit-to-brighton-263466/",
  "title": "Andre Marriner appointed referee for Manchester United visit to Brighton",
  "date": "20230502T164500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United travel to Brighton on Thursday looking to finally put their place in the top four beyond doubt.\nShould United beat Roberto de Zerbi’s in-form side, it would all but guarantee Champions League football for next season.\nHowever, Brighton will be out for revenge after losing the all-important FA Cup semi-final against United last month and in doing will also boost their own chances of European football.\nDe Zerbi’s men have been the surprise package of the season, playing an attractive brand of football that has catapulted them up the Premier League table.\nErik ten Hag will be glad to have his full compliment of players available in the middle of the park, given Brighton’s possession-based style.\nCasemiro looks back to his best after missing four games through suspension for picking up his second red card of the season against Southampton.\nAs reported by Football Fancast, Andre Marriner, who had a hand in both of the Brazilian’s dismissals will be taking charge of Thursday’s clash.\nBoth of Casemiro’s red cards were debatable with Marriner playing his part on each occasion.\nHis first came against Crystal Palace where Casemiro ushered Will Hughes away from confrontation by grabbing the top half of his shirt and shoulders, determined by Marriner to be a grab round the throat which led to a dismissal.\nCasemiro was then given his marching orders for a high tackle on Southampton’s Carlos Alcaraz, in which he grazed the ball but followed through on the Argentine.\nMarriner was on VAR duty on the day and deemed the tackle to be dangerous enough to warrant a red.\nSubsequent similar challenges have since gone unpunished on Marriner’s watch, giving Casemiro reason to be wary on Thursday.\nVictory on the coast would be a huge one for United, who want to wrap up Champions League qualification before setting their eyes on the FA Cup final in June.\nFollow The Peoples Person on Twitter or Instagram for all the latest news as it happens and to join in the conversation.",
  "word_count": 337,
  "scraped_at": "2026-02-14T02:06:54.987805",
  "_text_extracted": true
}