{
  "article_id": "060c4a685328",
  "url": "https://thepeoplesperson.com/2025/04/13/predicted-manchester-united-newcastle-united-andre-onana-rasmus-hojlund-292861-292861/",
  "title": "Predicted Man United XI vs Newcastle United : Andre Onana and Rasmus Hojlund dropped - Man United News And Transfer News",
  "date": "20250413T073000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United travel to Tyneside to face an in-form Newcastle side today hoping to get a morale-boosting victory ahead of their crucial Europa League quarter final second leg tie against Lyon on Thursday.\nHead coach Ruben Amorim has said he will rest players who need to recuperate so we expect to see a few changes from the side that drew 2-2 at the Groupama Stadium three days ago.\nWe expect one of those rested to be goalkeeper Andre Onana, who was responsible for both Lyon goals and who has been suffering an extended run of bad form.\nVarious reports have claimed that United’s coaching staff have had enough of the unpredictable Cameroonian and that his deputy, Altay Bayindir, will be given a chance against the Magpies.\nWith Matthijs de Ligt, Lisandro Martinez, Jonny Evans and Ayden Heaven all still injured, the back three is likely to remain unchanged, with Harry Maguire flanked by Noussair Mazraoui and Leny Yoro.\nVictor Lindelof and Godwill Kukonki are available should Amorim wish to rest any of those three.\nDiogo Dalot and Patrick Chinazaekpere Dorgu will probably also keep their places as wing backs. Luke Shaw might finally start his comeback with some game time if one of those two is rested for the final 30 minutes.\nHarry Amass is another option.\nAlthough all eyes are on the Europa League because of its potential to provide an entry route into next season’s Champions League, Amorim knows that every position United can climb in the Premier League will provide more prize money and therefore a bigger transfer kitty for the summer.\nHe will therefore want to win this game and surely must be looking to bench the ineffective Rasmus Hojlund, regardless of who is set to start on Thursday.\nAmorim is a huge admirer of Mason Mount and we have been predicting he will start in the last two games. Third time lucky?\nMeanwhile Casemiro has played two straight games in four days and will surely need to put his feet up. Alejandro Garnacho has also had a lot of football in the last couple of weeks.\nPutting all this together, we think Bruno Fernandes will partner Manuel Ugarte in midfield, with Christian Eriksen, Josh Zirkzee and Mount up front.\nKobbie Mainoo is another option in midfield, if needed. Toby Collyer and Amad remain absent through injury.\nFinally, Chido Obi’s omission from the Under 21s squad on Friday suggests he will be taking part in this one, potentially even coming on ahead of Hojlund, as Amorim takes another look to see if the younger of the two Danes is ready to lead the line.\nWith all that said, here is our predicted line-up for today’s 4.30pm kick-off:\nFeatured image Julian Finney via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 463,
  "scraped_at": "2026-02-14T02:02:35.581324",
  "_text_extracted": true
}