{
  "article_id": "06150a7e941e",
  "url": "https://www.nytimes.com/athletic/6958871/2026/01/10/brahim-diaz-afcon-morocco/",
  "title": "Brahim Diaz : A substitute for Real Madrid , a superstar for Morocco",
  "date": "20260110T103000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brahim Diaz is the undisputed star of AFCON 2025.\nHe is flourishing in the spotlight for Morocco, having been a forgotten man for Real Madrid this season. He has scored in every game for the AFCON hosts, including the opener in their 2-0 quarter-final win against Cameroon. His goals in five separate matches is an incredible feat matched by only three other players in AFCON history.\nAdvertisement\nSamuel Eto’o, the competition’s all-time top goalscorer who was in the crowd at the Prince Moulay Abdellah Stadium in his role as the president of Fecafoot (Cameroon’s football association), never achieved it.\n5 – Players to score in five separate matches at a single CAF Africa Cup of Nations tournament:\n1974 – Ndaye Mulamba for DR Congo\n2010 – Gedo for Egypt\n2022 – Vincent Aboubakar for Cameroon\n2025 – Brahim Díaz for MoroccoStars. pic.twitter.com/TBhMXcoqhB\n— OptaJoe (@OptaJoe) January 9, 2026\nThe tournament arrived at the perfect time for Brahim, who is experiencing a miserable time at Madrid under Xabi Alonso. The right-winger has only started three times in La Liga in 2025-26 and on one of those occasions he was substituted at half-time. The only players that the 26-year-old has recorded more minutes than at Madrid are either struggling with injuries, such as David Alaba and Ferland Mendy, or raw, unproven talents, such as Endrick, Gonzalo Garcia and Valde.\nNo athlete is adored by the Moroccan public as much as Achraf Hakimi. He is the reigning men’s Confederation of Africa (CAF) Footballer of the Year and was named in the men’s XI at the FIFA Best Awards in 2025. The full-back lifted a fourth consecutive league title with French side Paris Saint-Germain last season and helped them to win the Champions League for the first time.\nHakimi also scored the winning penalty when Morocco beat Spain in the last 16 at the 2022 World Cup in Qatar and became their captain two years later. However, his status is under threat from Brahim. The 27-year-old Hakimi might be the best player on the continent, but Morocco’s head coach Walid Regragui thinks Brahim should aim higher.\n“He can be the best player in the world,” Regragui said after Morocco beat Cameroon to set up a semi-final against Algeria or Nigeria. “Of course, today he is the X factor of my team. I want to say congratulations to him because now he understands what it (means to have) Moroccan blood: to run, to fight and to give what you have.”\nOne Team. One Family. One Dream. #DimaMaghreb 🇲🇦❤️🦁 pic.twitter.com/davYj6XmqW\n— Brahim (@Brahim) January 4, 2026\nBrahim’s brilliance is helping Morocco fans believe, and something special happened in the streets of Rabat after last night’s win.\nAdvertisement\nThroughout this tournament, it has felt as if the local supporters have not been truly enjoying themselves. The expectation levels have risen dramatically since Morocco reached the semi-finals of the 2022 World Cup and given their impressive record at youth-team level. Reaching the last four at AFCON, something they had not achieved in 21 years, was the minimum requirement.\nAll of that pressure and frustration appeared to burst after they took a huge step towards winning this competition for the first time since 1976.\nPeople were hanging out of the roofs of cars and waving flags as they drove back into the city centre after full time. It was past midnight, but a large group of people congregated around a water feature outside the main train station. They banged drums and danced while old women were dragged through the crowds by children tooting horns.\nAFCON fever has finally captured the country — and there is one individual who is more responsible than most for making it happen.\nIt is a remarkable rise for Brahim, who only made his debut a month after the last AFCON finished in February 2024. He grew up in Malaga, represented Spain at youth-team level and earned one senior cap in a friendly against Lithuania in June 2021.\n“I feel 100 per cent Spanish and 100 per cent Moroccan,” Brahim said in an interview on Movistar Plus in March 2024. “The affection that Spain and Morocco have shown me is immense; they are two wonderful countries. I have Moroccan roots, but I grew up in Spain.\n“I always make decisions with my heart, and that’s how it was this time too. I’m a simple guy with dreams. The affection and the project they showed me in Morocco seem very good to me.”\nBrahim turned out to be the perfect replacement for former Chelsea and Ajax winger Hakim Ziyech in more ways than one. He has become Regragui’s first-choice out wide and taken over the spot in Moroccan hearts which was previously reserved for Ziyech. He screamed into a television camera when the game finished, kissed the badge on his shirt and applauded the crowd before either shaking the hand of or hugging the majority of Cameroon’s squad.\nAdvertisement\nBrahim’s 26th-minute effort was scruffy, but he has a habit of popping up in important moments. He has opened the scoring four times at AFCON, including grabbing the first goal of the tournament. He broke the resistance of Comoros and Tanzania, two teams set up to defend deep and hit Morocco on the counter. Brahim was a menace in qualifying, too. He hit a hat-trick in a 7-0 thrashing of Lesotho and finished as the top goalscorer with seven, ahead of Guinea’s Serhou Guirassy (six).\nThere were several questionable decisions from the Mauritanian referee Dahane Beida which went in Morocco’s favour against Cameroon, including Bilal El Khannouss avoiding a second yellow card despite scything Danny Namaso down in the middle of the pitch during a counter-attack. Cameroon’s captain Tolo Nouhou said after the game that Eto’o, the president of the Cameroon FA, told them in the dressing room not to speak to the media about the officiating.\nIt slightly spoiled the evening for neutral observers, but Moroccan fans will not care. It has taken nearly three weeks but Brahim has sparked the party into life.",
  "word_count": 1008,
  "scraped_at": "2026-02-14T02:09:43.015046",
  "_text_extracted": true
}