{
  "article_id": "067b3742cac1",
  "url": "https://en.yna.co.kr/view/AEN20231005002000315",
  "title": " ( Asiad ) In pursuit of gold , PSG midfielder Lee Kang - in putting team above all else",
  "date": "20231005T014500Z",
  "domain": "en.yna.co.kr",
  "source_country": "South Korea",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(Asiad) In pursuit of gold, PSG midfielder Lee Kang-in putting team above all else\nBy Yoo Jee-ho\nHANGZHOU, China, Oct. 5 (Yonhap) -- He has yet to play a full match since joining South Korea at the Asian Games men's football tournament in China, but Paris Saint-Germain (PSG) midfielder Lee Kang-in says he couldn't care less about his playing time.\n\"It's not up to me whether I play the full 90 minutes or not. It's up to the coach,\" Lee said after playing 60 minutes in South Korea's 2-1 win over Uzbekistan in the semifinals Wednesday night. \"I am not disappointed at all about my playing time. It doesn't matter how many minutes I play in the next one. I just want to win the gold medal here.\"\nLee missed South Korea's first two group stage matches in China due to his club commitments. Since the Asian Games aren't part of the FIFA international calendar, clubs aren't obligated to release their players. PSG did agree to send Lee to China but only on the condition that he would play a UEFA Champions League group stage match before making his trip.\nHe made his tournament debut against Bahrain on Sept. 24 and logged 36 minutes. He played 60 minutes in the round of 16 against Kyrgyzstan and then came off the bench to play 28 minutes in the second half against China in the quarterfinals.\nLee was back in the starting lineup against Uzbekistan on Wednesday and was subbed out near the hour mark.\nLee, who had missed some time from late August to early September with a left quad injury, had a little more bounce in his step Wednesday than in earlier matches.\nAsked if he had started feeling better, Lee said: \"Well, I always feel the same. Winning is more important than how I feel at the moment.\"\njeeho@yna.co.kr\n(END)\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\nG-Dragon confirms BIGBANG's official comeback this year\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\n(Yonhap Interview) Auto 'good place to start' for submarine bid package: Canadian defense procurement chief\n-\nDefense ministry to push for special law on building nuclear subs\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\n(Movie Review) 'Humint': Ryoo Seung wan's romance wrapped in unflinching action\n-\n(Yonhap Interview) Moonassi brings stirrings of heart to paper\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\nG-Dragon confirms BIGBANG's official comeback this year\n-\n(2nd LD) N. Korea in process of designating leader's daughter Ju-ae as successor: NIS\n-\n(LEAD) (Olympics) Snowboarder Choi Gaon claims gold in women's halfpipe\n-\nN.K. leader's daughter Ju-ae takes center stage with father in photos at Beijing embassy\n-\n(LEAD) N.K. leader's sister calls Seoul's regret over drone incursion 'sensible'\n-\n(Olympics) Snowboarder Choi Gaon claims gold in women's halfpipe",
  "word_count": 500,
  "scraped_at": "2026-02-14T02:10:28.714637",
  "_text_extracted": true
}