{
  "article_id": "0681013630e1",
  "url": "https://www.namibian.com.na/newcastle-face-premier-league-title-test-at-man-city-caicedo-set-for-chelsea-bow/",
  "title": "Newcastle face Premier League title test at Man City , Caicedo set for Chelsea bow",
  "date": "20230818T131500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle face an early test of their Premier League aspirations this season when they take on Manchester City, while Chelsea’s £115 million ($146 million) midfielder Moises Caicedo is set to make his debut at West Ham.\nTottenham are looking for the scalp of Manchester United on Saturday in their first home game since the departure of Harry Kane.\nAFP Sport looks at the best of the action on the second weekend of the Premier League season:\nCan Newcastle dream?\nThe Magpies head to the Etihad top of the table after a 5-1 demolition of highly-fancied Aston Villa last weekend.\nSandro Tonali and Harvey Barnes scored on their debuts, while Alexander Isak’s classy double was further evidence of the Swede’s rise to becoming one of the Premier League’s top marksmen.\nAfter qualifying for the Champions League for the first time in 20 years, there have been doubts over how Eddie Howe’s men will balance the demands of domestic and European football.\nBut they could be facing City at the perfect time.\nPep Guardiola sarcastically thanked the Premier League for scheduling his side to play just three days after a draining UEFA Super Cup win over Sevilla in the baking heat of Athens.\nCity will be without Kevin De Bruyne, while Bernardo Silva, Ruben Dias and John Stones are doubts after playing no part in the Greek capital in midweek.\nNewcastle have not won away to City in the Premier League in 23 years.\nBut their rise since a takeover from the Saudi sovereign wealth fund less than two years ago has been rapid.\nBeat the champions on Saturday and talk on Tyneside may turn to dethroning City come the end of the season.\nSpurs seek consolation for Kane pain\nTottenham began a new era last weekend without Kane up front and with Ange Postecoglou in charge in at 2-2 draw at Brentford.\nThe heat will be turned up on chairman Daniel Levy as Spurs return home for the first time this season.\nProtests are planned by fans unhappy at Kane’s departure despite a hike of up to 20 percent in ticket prices.\n“We are charged amongst the most expensive prices in the Premier League and Europe by one of the richest clubs in Europe. It is an exploitation of fan loyalty,” said the Tottenham Hotspur Supporters’ Trust.\nUnited began their campaign with a 1-0 win over Wolves, but the scoreline did not tell the true story.\nThe visitors had the most shots by any visiting side at Old Trafford since 2005 in a dominant performance and were denied a clear penalty in stoppage time when United goalkeeper Andre Onana punched Sasa Kalajdzic as he attempted to clear a cross.\nUnited will again have to cope without new striker Rasmus Hojlund due to a back injury and Erik ten Hag faces the conundrum of whether to persist with new signing Mason Mount alongside captain Bruno Fernandes in midfield.\nCaicedo’s Chelsea bow\nChelsea won the race to land Caicedo despite competition for Liverpool, but had to pay Brighton a British record price that could rise to £115 million.\nIt is the second time in seven months that Chelsea have smashed the Premier League transfer fee record after spending £107 million on Enzo Fernandez in January.\nCaicedo and Fernandez are set to become the cornerstone of Mauricio Pochettino’s new-look side, which got off to a promising start in a 1-1 draw against Liverpool last weekend.\nBut scoring goals remains Chelsea’s problem with new signing Christopher Nkunku set for months on the sidelines.\nWest Ham are still coming to terms with losing their own £100 million midfielder after captain Declan Rice departed for Arsenal.\nJames Ward-Prowse has been brought in to deputise for Rice and the England international is expected to make his Hammers debut on Sunday.\nFixtures (all times GMT)\nFriday\nNottingham Forest v Sheffield United (1845)\nSaturday\nFulham v Brentford, Liverpool v Bournemouth, Wolves v Brighton (all 1400), Tottenham v Manchester United (1630), Manchester City v Newcastle (1900)\nSunday\nAston Villa v Everton (1300), West Ham v Chelsea (1530)\nMonday\nCrystal Palace v Arsenal (1900)\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 786,
  "scraped_at": "2026-02-14T02:20:03.676834",
  "_text_extracted": true
}