{
  "article_id": "068842348666",
  "url": "https://metro.co.uk/2025/10/02/alan-shearers-premier-league-predictions-including-man-utd-arsenal-chelsea-v-liverpool-24324488/",
  "title": "Alan Shearer Premier League predictions for Man Utd , Arsenal and Chelsea v Liverpool | Football",
  "date": "20251002T220000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alan Shearer has delivered his latest Premier League predictions as defending champions Liverpool visit Chelsea off the back of two successive defeats.\nArne Slot’s side won their first seven games of the season but back-to-back defeats to Crystal Palace and Galatasaray has raised alarm bells at Anfield.\nLiverpool will look to get back to winning ways at Stamford Bridge on Saturday against a Chelsea team who have taken just one point from their last three league games.\nThis weekend’s Premier League action starts on Friday night with in-form Bournemouth playing host to mid-table Fulham.\nTottenham visit Leeds United in Saturday’s early kick-off between title contenders Arsenal take on Nuno Espirito Santo’s West Ham at the Emirates Stadium.\nAnother 3pm kick-off sees Manchester United in action in a must-win game against newly-promoted Sunderland, who are thriving back in the Premier League.\nSunday’s fixtures include Ange Postecoglou’s struggling Nottingham Forest taking on Newcastle United and Pep Guardiola’s Manchester City visiting Brentford.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAs ever, England legend and Betfair ambassador Alan Shearer has revealed his Premier League predictions to Metro.\nBournemouth v Fulham\nThis is a tough one to call first up but I’ll go for a home win.\nPrediction: Bournemouth win\nLeeds v Tottenham\nWith Leeds playing at home and Tottenham being away in the Champions League during the week, it won’t be an easy game. I’ll go for a draw.\nPrediction: Draw\nArsenal v West Ham\nNuno will make West Ham a lot tighter, but I still think it’ll be a home win here. Look at the options that Arsenal now have, the result they got against Newcastle last week and in the Champions League. I’ll go for a home win.\nPrediction: Arsenal win\nManchester United v Sunderland\nSunderland had a great result last weekend and have made an incredible start to the season. I have no confidence at all in Manchester United, but I do think they’ll beat Sunderland. It also wouldn’t surprise me if Sunderland get something and if they do, you’d have to worry for Ruben Amorim. Without having any belief whatsoever, I’m just going to say home win.\nPrediction: Manchester United win\nChelsea v Liverpool\nIt’s a great game. Liverpool can’t lose three on the spin – they’re the defending champions and pre-season title favourites – and if Chelsea lose three league games on the spin, Maresca is under huge pressure as well. I’ll probably sit on the fence because of the importance of both teams not losing the game.\nPrediction: Draw\nAston Villa v Burnley\nAston Villa got their much-needed first win last weekend and I think they’ll make it very difficult for Burnley. They’ll be full of confidence, so I’ll go for a home win.\nPrediction: Aston Villa win\nEverton v Crystal Palace\nCrystal Palace are a really good team. They played in Europe on Thursday which will make going to Everton that little bit tougher. With that record they have, they’ll be desperate to keep it going so I’ll go for a draw.\nPrediction: Draw\nNewcastle v Nottingham Forest\nNewcastle’s extra 24 hours rest will help them. Forest are struggling and Newcastle are at home after a big Champions League win, so I’ll go for a home win.\nPrediction: Newcastle win\nWolves v Brighton\nWolves were unlucky last time out but with the way Brighton play it will be very difficult for them. I’ll go for an away win.\nMore Trending\nPrediction: Brighton win\nBrentford v Manchester City\nBrentford will make it tough, but Man City will have too much for them. Away win.\nPrediction: Manchester City win\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ange Postecoglou responds to Nottingham Forest fans chanting for him to be sacked\nMORE: ‘Not the right fit’ – Man Utd warned not to replace Ruben Amorim with Premier League rival\nMORE: Gabriel Martinelli makes huge claim over Viktor Gyokeres after Olympiakos blank",
  "word_count": 712,
  "scraped_at": "2026-02-14T02:21:48.751423",
  "_text_extracted": true
}