{
  "article_id": "06a7434efe20",
  "url": "https://thepeoplesperson.com/2025/09/26/mbeumo-has-quickly-become-indispensable-under-man-united-299427/",
  "title": "Bryan Mbeumo has quickly become indispensable to Man United - Man United News And Transfer News",
  "date": "20250927T000000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s right forward role has been notoriously weak in recent seasons.\nFollowing Mason Greenwood’s off-field issues, the Red Devils invested heavily in Antony to sort out the position in the summer of 2022.\nDespite a fiery start to life at the Theatre of Dreams, the Brazilian turned out to be an expensive flop and was offloaded permanently this year.\nAlejandro Garnacho, Amad Diallo, Facundo Pellistri and even Bruno Fernandes have been deployed on the right wing at times in recent years without much success.\nSo when the English giants agreed a £71m deal for Mbeumo this summer, fans had every right to be ecstatic. The Cameroonian had lit up the league with Brentford in the 2024/25 campaign, registering 20 goals and eight assists from 38 games.\nInterestingly, Mbeumo was also a hard worker on the pitch, and his relentless pressing made him a perfect fit in Ruben Amorim’s 3-4-3 system.\nA stunning 2024/25 campaign\nMbeumo joined Brentford from Troyes in 2019 and spent six years at the Gtech Community Stadium. During that time, he honed his skills under Thomas Frank and played a key role in their promotion to the Premier League for the first time.\nHe also helped the Bees stay in the league before exploding last season. While people will reference his goals and assists tally, the 26 year old’s work ethic was exemplary as well.\nMbeumo registered 2250 total presses in the league last season, the ninth-most in the Premier League. When Brentford were in possession, the Cameroonian was a willing runner, ready to stretch the opposition.\nOnly Daniel Munoz (959) made more off-the-ball runs than Mbeumo (891) last season. 418 of those were behind the opposition defence – the most in the league.\nOf course, sceptics will insist that the player overperformed his xG last season and that he could be a one-season wonder. However, there was no denying that United managed a coup by securing his services amid the fierce competition for his signature.\nThe desire to join United\nMbeumo was a wanted man this summer following his exploits last season.\nNewcastle United were keen to sign him, as were Tottenham Hotspur, who had appointed Thomas Frank as Ange Postecoglou’s replacement over the summer.\nThe prospect of teaming up with his former manager across London would surely have enticed the Cameroonian. However, as soon as the Red Devils entered the scene, there was only going to be one winner.\nMbeumo later revealed that he was a United fan while growing up and even had a “Ronaldo” shirt as a child. INEOS and Ruben Amorim, of course, have Sir Alex Ferguson and the club’s legacy to thank for helping them win this race.\nDespite the lure of Champions League football and, perhaps, better economic packages as well, the Cameroonian held firm. He only wanted to fulfil his long-standing dream.\nThe stats at United so far\nMbeumo made his debut for United against Arsenal in the first game of the 2025/26 Premier League season, alongside new arrival Matheus Cunha. The two of them were outstanding against the Gunners, and the Red Devils were unlucky to lose 1-0.\nThe Cameroonian scored his first goal for the Red Devils in the defeat against Grimsby Town, where he also missed his second penalty kick. His first Premier League goal came in the 3-2 win over Burnley.\nMbeumo has registered 128 off-the-ball runs this season already in the league, with only Chelsea’s Enzo Fernandez (138) managing more. When it comes to runs in behind, the Cameroonian (83) is the clear leader.\nMbeumo has also registered 15 shots in the Premier League this season, with only Erling Haaland (21) managing more. He has created nine chances for his teammates as well.\nThe Cameroonian has easily been Amorim’s best attacker this season. However, Cunha fans will point out, and rightly so, that the Brazilian was immense as well until his unfortunate injury.\nHow has Mbeumo fit into under Amorim’s tactics?\nAmorim’s 3-4-3 system depends heavily on versatile forwards, who can stretch the opposition backline, as well as drift in when required. Mbeumo’s attributes, as such, make him a perfect fit for the job.\nIt is no wonder that the Cameroonian has started every game in the Premier League this season.\nMbeumo has been a transitional outlet on the wings and United have turned to him with early balls after winning possession. His ability to carry the ball, coupled with his pace and acceleration, has been a godsend for the Red Devils. He is also the second-fastest man in the league this season so far.\nChelsea’s Robert Sanchez had a first-hand taste of the Cameroonian’s qualities last weekend. Latching on to a flick from Benjamin Sesko, Mbeumo drove into the final third, forcing the Spanish goalkeeper to intervene. Sanchez brought him down and picked up a straight red. United went on to win the game 2-1.\nHis movement has been exceptional\nMbeumo’s movement has also been a boon for his teammates. By hugging the byline, the Cameroonian has opened up space in the final third for the likes of Bruno Fernandes to run into.\nThe former Brentford man has also embraced Amorim’s off-the-ball pressing tactics. Mbeumo doesn’t just press; he presses intelligently, even curving his runs to block passing lanes, which puts the opposition under pressure.\nThe Cameroonian is so much more than just a goalscorer in this team, but it is also true that the team will look to him for goals as the season progresses.\nNeeds to add goals\nMbeumo had already scored four goals in his first five Premier League games for Brentford last season. In contrast, he has managed only one in the league this campaign.\nThis Saturday’s game against the Bees in the Premier League could be the perfect occasion for him to add to his tally!\nThe Cameroonian has taken no time to settle down at Old Trafford, and the only thing lacking now is goals. Interestingly, the Red Devils have struggled in front of the goal once again this season, and are the biggest xG underperformers in the top five leagues in Europe.\nMbeumo, though, has already caught the imagination of fans and was adjudged the club’s Player of the Month for August. He is a vital cog in Amorim’s tactics, and once the goals start flowing, the Cameroonian could turn out to be the signing of the summer.\nMbeumo is the joint top scorer for United this season, along with Bruno Fernandes. It is safe to say that the Cameroonian has been as important as the Portuguese Magnifico to the team so far.\nAll stats have been taken from Opta Analyst.\nFeatured image Matt McNulty via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1118,
  "scraped_at": "2026-02-14T01:55:21.387561",
  "_text_extracted": true
}