{
  "article_id": "06ba39f55d33",
  "url": "https://apnews.com/article/manchester-derby-city-united-2cd8df7db763fb73582011dd8c184e2c",
  "title": "Manchester derby can further expose gulf between City and United",
  "date": "20240229T111500Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester derby can further expose gulf between City and United\nManchester derby can further expose gulf between City and United\nJim Ratcliffe’s determination to bring down Manchester City is abundantly clear.\nSo is his admiration, it seems, for the team he calls “the enemy.”\nSince becoming co-owner of Manchester United last week, Ratcliffe has spoken about the “driven and elite environment” that has been created at City in its Abu Dhabi-controlled regime.\nHe described City’s 4-0 win over Real Madrid in last season’s Champions League semifinals as “the best football I have ever seen.”\nHe was even behind United’s recent appointment of one of City’s former top executives, Omar Berrada, as the new chief executive in what United said was the first step on a journey “to put football and performance on the pitch back at the heart of everything we do.”\nRatcliffe acknowledged United was a “long way behind” City. Just how far might be placed into sharp focus this weekend.\nIt’s the 192nd Manchester derby on Sunday, pitting two rivals at opposite stages of their modern development: City, the English, European and world club champion, vs. United, a fallen giant looking to be kickstarted by the riches and passion of a locally born billionaire.\nFew are giving United a hope in the Premier League clash at Etihad Stadium — privately, maybe even Ratcliffe will not expect a win, either — but his recent investment in United, not forgetting his comments about knocking City and fellow local rival Liverpool “off their perch” within three years, provides the narrative and backdrop to a fixture that, for the most part, has been one-sided in recent years.\nTake last season’s match at the Etihad, for example, where Erling Haaland and Phil Foden scored hat tricks in City’s 6-3 thrashing of United.\nOr this season’s match at Old Trafford, where United was overrun and ultimately humiliated in a 3-0 loss in October.\nUnited coach Erik ten Hag is convinced his side can compete this time.\n“The players are ready for it and looking forward to it,” he said. “I can smell it.”\nCity comes into the derby following a 6-2 win at Luton in the FA Cup highlighted by a five-goal performance by Haaland.\nUnited has actually won seven of its nine games in all competitions in 2024 but barely ever convinces, which leaves Ten Hag under permanent pressure. Tellingly, Ratcliffe, in his round of post-takeover interviews, never gave his complete backing to the Dutchman.\nMarch will also see United take on its other big foe, Liverpool, in the FA Cup quarterfinals. It’s a month of great opportunity for Ten Hag and his players but also one of potential danger, if United was to lose to City — and therefore further jeopardize its Champions League qualification ambitions — and Liverpool.\nFifteen points separate second-placed City and sixth-placed United, and that could be 18 by Sunday evening.\nTen Hag expects midfielder Bruno Fernandes and central defender Raphael Varane to be fit. But no other players — like center half Harry Maguire — are ready to return.\nTen Hag calls Fernandes “a leader by example” and expects him to play a key role, providing he gets more protection.\n“He is creating the most chances in the Premier League. You see opponents are targeting him,” Ten Hag said. “I feel the refereeing should protect him.”\nMore important for City these days is the points gap to leader Liverpool, which stands at one heading into the weekend. Liverpool plays first, away to Nottingham Forest. Third-placed Arsenal, which is a point behind City in third place, visits Sheffield United on Monday.\nLONDON DERBY\nAfter scoring a last-minute winner to reach the FA Cup quarterfinals on Wednesday night, Chelsea has a short trip across West London for a local derby against Brentford on Saturday.\nChelsea is languishing in 11th place amid a difficult campaign for coach Mauricio Pochettino.\nLast Sunday, his players were described by leading British soccer pundit Gary Neville — a former United defender — as “billion-pound bottle jobs” after losing to an injury-hit and youthful Liverpool side in the English League Cup final.\nNeville stands by what he said, although he accepts it was a “harsh” line.\n“I said that they froze in extra time, there is no doubt that they were playing with fear and froze,” Neville told a Sky podcast. “Bottle doesn’t mean cowardness, they just froze on the day. We (United) froze in games sometimes, in Champions League semifinals.”\nBrentford has lost four of the past five league games and is in 16th place.\n___\nSteve Douglas is at https://twitter.com/sdouglas80\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 771,
  "scraped_at": "2026-02-14T02:13:34.135339",
  "_text_extracted": true
}