{
  "article_id": "06be042bfaad",
  "url": "https://www.namibian.com.na/five-candidates-to-replace-ten-hag-at-man-utd/",
  "title": "Five candidates to replace Ten Hag at Man Utd",
  "date": "20241028T214500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag’s rollercoaster reign as Manchester United manager came to an end on Monday after a disastrous start to the season saw the Red Devils slip to 14th in the Premier League table.\nFormer United striker Ruud van Nistelrooy will take caretaker charge before a permanent successor to Ten Hag is appointed.\nAFP Sport looks at five of the leading candidates to land the job at Old Trafford:\nGareth Southgate (unattached)\nFresh from leading England to a second consecutive final of the Euros, Southgate is available after ending his eight-year reign in charge of the Three Lions in July.\nThe 54-year-old’s impact in turning his nation into a force again at major tournaments has reportedly gained him admirers among United’s new leadership group, including co-owner Jim Ratcliffe.\nHowever, Southgate has not managed at club level since a spell at Middlesbrough between 2006 and 2009.\nAlthough widely acclaimed for changing the wider culture around the England team’s relationship with the media and supporters, Southgate’s tactical nous was often questioned during his time in international football.\nBut he has previously worked with some of the big names Ten Hag struggled to get the best out of at Old Trafford in Harry Maguire, Luke Shaw, Mason Mount and Marcus Rashford.\nThomas Frank (Brentford)\nThe Brentford boss was on the visitors’ bench for Ten Hag’s final home game that ended in a 2-1 United victory.\nBut with far more meagre resources, the Dane has the Bees sitting ninth in the Premier League table, two points above United.\nFrank has been in charge of Brentford for six years, leading them to the Premier League for the first time in 2021 and establishing the London club in the top-flight despite often having to sell his star players.\nGraham Potter (unattached)\nPotter has been out of work since being sacked by Chelsea in April 2023.\nHis struggle to cope with the demands of a top club during an ill-fated seven months at Stamford Bridge will count against the Englishman.\nHowever, he was a rising star of the Premier League prior to that appointment for the attractive brand of football he instilled at Brighton.\nPotter was previously linked with taking over at French club Nice, who are also owned by Ratcliffe’s INEOS sports group.\nXavi (unattached)\nUnited officials reportedly held talks with the former Barcelona boss last week.\nThe legendary former midfielder left the club where he made his name as a player at the end of last season following disagreements with the Barca hierarchy.\nHe defied the Catalan giants’ financial restrictions to win La Liga in 2022/23 and took them to the quarter-finals of last season’s Champions League.\nShould he succeed Ten Hag it would set up an intriguing battle with his former mentor, Manchester City boss Pep Guardiola.\nSimone Inzaghi (Inter Milan)\nInzaghi has also been linked to the United job, with the 48-year-old Italian earning a reputation as a skillful tactician in his homeland after leading Inter to the Serie A title last season and the Champions League final in 2023.\nAccording to reports in Italy, Inzaghi has been studying to improve his English in the expectation he will one day manage in the Premier League.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 636,
  "scraped_at": "2026-02-14T02:14:47.091545",
  "_text_extracted": true
}