{
  "article_id": "06d07974bd67",
  "url": "https://www.fourfourtwo.com/features/england-beware-dan-ndoye-has-had-the-year-of-his-life-and-can-fire-switzerland-to-the-euro-2024-semi-final",
  "title": "England beware , Dan Ndoye has had the year of his life and can fire Switzerland to the Euro 2024 semi - final",
  "date": "20240706T130000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England beware, Dan Ndoye has had the year of his life and can fire Switzerland to the Euro 2024 semi-final\nDan Ndoye has lit up Euro 2024 with his dazzling dribbling, sensational speed and superb goal against Germany – now he wants to make history by taking down England\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThere has been something in the water in Bologna this year. Or the ragù, perhaps.\nNot only did the football club representing this gastronomic stronghold in the centre of Italy qualify for the Champions League for the first time ever, but their players have continued to ride that wave of momentum at Euro 2024.\nWhether it was Riccardo Calafiori’s barnstorming assist for Italy against Croatia, Stefan Posch’s energetic performances for the impressive Austrians, or goalkeeper Lukas Skorupski’s man-of-the-match display for Poland against France, they have popped up everywhere.\nIn fact, at the end of the group stage the Serie A club pointed out that their players had provided more goal contributions at the tournament than any other club with two goals and five assists. Not bad going for the underdogs from Emilia-Romagna.\nWithout doubt, one nation has showcased this unchained Bologna-mania more than any other: Switzerland.\nVIDEO Why Spain Have The PERFECT System To Win The Euros\nMidfield duo Michel Aebischer and Remo Freuler have each provided a goal and two assists so far, but they have arguably been outshone by a team-mate who should send shivers down the spine of any nervy England fan, Dan Ndoye.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe winger’s electric attacking displays have lit up the tournament, even if he only has one goal to show for it so far. But what a goal it was.\nNdoye’s run between two Germany centre-backs and guided volley was his first strike for the Swiss senior team, and helped them go agonisingly close to a famous win over the host nation, who bagged a late equaliser.\nThe Bologna winger’s electric pace and dizzying dribbling skills have made him a standout player so far and even earned the 23-year-old transfer links to the likes of Manchester United and Inter Milan.\n“His development is fantastic, I can see it day after day,” said Switzerland manager Murat Yakin. “He has grown a lot since the Under-21s and it was a great decision to join Bologna. He’s young, I like having him in the team a lot with his unpredictability and his clear head; the goal against Germany helped to unblock him mentally.”\nA lot of English attention will undoubtedly be trained on familiar faces like Man City defender Manuel Akanji, Newcastle’s Fabian Schar and ex-Arsenal man Granit Xhaka.\nBut Ndoye could well be the man to decide whether his country reaches a major tournament semi-final for the first time ever in Dusseldorf – at least that is how former Switzerland international Blerim Dzemaili sees it.\n“You don’t know how to take on this team as they don’t give you any reference points. They can defend and counter-attack, but also keep the ball with Freuler and Xhaka, who is the absolute leader,” Dzemaili told Corriere della Sera.\n“But the crucial player is Ndoye. He’s doing things that nobody was expecting, he’s even scoring goals and that’s giving him even more confidence.”\nNdoye’s rise has been rapid, but he’s not the only one; club-mates Calafiori, Joshua Zirkzee and Lewis Ferguson have had similarly ascendant years. The winger joined Bologna from Basel last summer after spells with Lausanne and Nice and was a key figure in Motta’s side as they finished fifth, shaking up the established elite by bettering giants like Roma, Lazio, Fiorentina and Napoli.\nAlthough he was far from clinical, scoring one goal in 32 games to go with two assists, Ndoye played an important role tactically, diligently tracking back to help defensively in what proved to be perfect preparation for a summer spent with Yakin’s tactically astute, hard-working side. “Thiago Motta scolded me often to make me defend more, and I thank him for it because that allowed me to improve a lot,” Ndoye said.\nMake no mistake. Should England have any gaps at the back, he will find them. Should they find themselves leaving too much space, he will attack it.\nNdoye has been a hive of activity in his appearances so far, with 18 dribbles and 13 attempts on goal while clocking a sprint speed of 35.6 km/h that only six players have bettered. Before arriving in Germany, Ndoye had only started one competitive match for his country.\nNow he could decide whether they become the first Swiss side ever to make the final four of a major tournament, after falling at the quarter-final hurdle three years ago at the Euros and three times at the World Cup.\nGet a free live stream to watch Euro 2024 from anywhere in the world to the summer's big tournament\nMore Euro 2024 stories\nBBC pundit threatens to walk out of Euro 2024 over England team\nEngland line-up vs Switzerland taking shape, with shock selections touted\nAlasdair Mackenzie is a freelance journalist based in Rome, and a FourFourTwo contributor since 2015. When not pulling on the FFT shirt, he can be found at Reuters, The Times and the i. An Italophile since growing up on a diet of Football Italia on Channel 4, he now counts himself among thousands of fans sharing a passion for Ross County and Lazio.",
  "word_count": 1015,
  "scraped_at": "2026-02-14T02:08:01.883349",
  "_text_extracted": true
}