{
  "article_id": "06ec352aa9c2",
  "url": "https://www.jamaicaobserver.com/2024/11/29/guardiola-will-not-run-manchester-city-rebuild/",
  "title": "Guardiola will not  run  from Manchester City rebuild",
  "date": "20241130T000000Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Guardiola will not ‘run’ from Manchester City rebuild\nMANCHESTER, United Kingdom (AFP)— Pep Guardiola says he is braced for the challenge of turning around Manchester City’s fortunes after the worst run of his managerial career ahead of a daunting trip to runaway Premier League leaders Liverpool.\nCity are without a win in six games, with five consecutive defeats followed by a 3-3 Champions League draw against Feyenoord on Tuesday, when City blew a 3-0 lead in the final 15 minutes.\nDefeat at Anfield on Sunday would leave the Premier League champions 11 points behind Arne Slot’s men.\nGuardiola’s angst was clear in midweek as he appeared on camera after the Feyenoord game with a number of self-inflicted scratches on his face.\nThe 53-year-old recently extended his contract at the Etihad until 2027 and said the chance to overcome a rare period of adversity played a part in that decision.\n“The moment I feel I’m not positive for the club, another one will come. It has to be (the case). But I want an opportunity to try to do it,” Guardiola said at his pre-match press conference on Friday.\n“I don’t want to run away. I want to be there. I want to rebuild the team in many aspects from now on until the end of the season, the next seasons, to try to continue up there.”\nCity have repeatedly rewritten the record books of English football during Guardiola’s eight years in charge.\nThey have won six Premier League titles in seven seasons, including an unprecedented four in a row, and won the treble in 2023.\nBut Guardiola has repeatedly called his side “fragile” and lacking in confidence in recent weeks.\n“In the first knock we are not as stable as we have always been,” he said. “In the past when we were able to go 3-0 up, we didn’t score the fourth, we didn’t score the fifth, but the game was dead.\n“Now in the first moments (of adversity) I don’t know how we are going to react for obvious reasons that we have, for the desperation to win, for the absence of important players.\n“The best test to prove how stable we are is Anfield because we cannot expect they will not have that moment and momentum and that is when we have to stand up as a team.”\nGuardiola, though, disagreed that City’s squad is in need of an overhaul in the transfer market.\nBallon d’Or winner Rodri has been ruled out for the rest of the season with a serious knee injury, while Guardiola has had to cope without a number of other key players.\n“You have to now change everything — I don’t completely agree with that. We cannot forget three months ago we were champions of the Premier League,” he said.\n“The squad is really good, but we don’t have the squad. It’s not just Rodri, nominated the best player (in the world), it’s many, many, many other players. So that is more difficult.\n“We don’t have six, seven important players. We have played two weeks, three weeks without four central defenders, two holding midfielders. But step by step, the players come back a little bit and hopefully we can be together for a long time.”",
  "word_count": 541,
  "scraped_at": "2026-02-14T02:02:07.181994",
  "_text_extracted": true
}