{
  "article_id": "0707c365dce3",
  "url": "https://www.themag.co.uk/2023/08/uefa-now-make-public-their-stance-on-added-time-in-champions-league-matches-and-other-competitions-newcastle-united-premier-league/",
  "title": "UEFA now make public their stance on added time in Champions League matches and other competitions",
  "date": "20230831T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA now make public their stance on added time in Champions League matches and other competitions\nUEFA have now revealed their stance for Champions League matches and other competitions that they oversee, when it comes to the time wasting / time added on debate.\nFIFA have been encouraging match officials to add more time at half-time and full-time to compensate for the minutes taken out of the game via stoppages, for such things as goal celebrations, substitutions and VAR checks, as well as moments deemed to be players time wasting.\nWe saw this at the Qatar World Cup where matches often went to 100+ minutes in total.\nThe International Football Association Board (IFAB), the organisation that oversees the laws of the game, has subsequently backed the FIFA initiative.\nWhilst this season the Premier League have also got on board and now more realistic time is getting added on, especially at the end of the second half.\nUEFA, however, are not on board.\nWhen asked by reporters if fans can expect similar match durations in this season’s European club competitions, including the Champions League, UEFA chief of football Zvonimir Boban said, as quoted by The Athletic:\n“It is absolutely absurd.\n“Regarding player welfare, it’s some kind of small tragedy or big tragedy because we are adding almost 12, 13, 14 minutes.\n“We are adding almost one half of the game.\n“I can speak from experience, especially as a midfielder, (but) it’s the last 30 minutes of the game when you get tired. And then somebody comes and adds another 15 minutes of the game… for what reason?\n“How commonly have we spoken critically about the calendar and too many games. We are not listening to players and coaches — they are complaining all the time.\n“And now we add probably six, seven minutes more per game — for some, that’s almost 500 minutes more per season, that is six games.\n“It’s crazy. It’s too much, so we will not do this. Our guidelines are different.”\nI must admit that I am all in favour of the new added extra time in the Premier League, it was ridiculous in so many matches last season, where you could have up to ten second half substitutions goal celebrations, waits for VAR decisions, other stoppages, as well as some time wasting by one or both teams… yet only five minutes (each sub is supposed to see 30 seconds added) or less added on when you got to 90 minutes.\nWhen watching Champions League matches in the past, I have always thought it was even worse. My memory tells me that the vast majority of CL games, unless something extreme has happened in terms of delay(s) in the game, you almost never see more than three or four minutes added. My assumption when I was seeing this, wasn’t UEFA concern about player welfare, rightly or wrongly, my guess / assumption had been that they wanted as little disruption as possible so that the very valuable TV adverts would be shown on schedule with as minimal delay as possible.\nHowever, I now have absolute faith that UEFA are only concerned about player welfare… not cash, maybe.\nIn the Premier League, there will be times when Newcastle United experience both positive and negative moments due to the extra minutes now being added.\nInteresting to compare and contrast when NUFC are in the Champions League, in terms of how those matches are handled, with regard to added time / time wasting.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 596,
  "scraped_at": "2026-02-14T01:50:52.139935",
  "_text_extracted": true
}