{
  "article_id": "070dae713450",
  "url": "https://www.liverpoolfc.com/news/opposition-lowdown-internazionale",
  "title": "The opposition lowdown : Internazionale",
  "date": "20251209T094500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MatchThe opposition lowdown: Internazionale\nGet the lowdown on Internazionale ahead of Liverpool's visit to San Siro in the Champions League tonight.\nSeason so far\nInter head into the meeting with the Reds on the back of a 4-0 home win over Como on Saturday evening and are third, one point behind joint-leaders AC Milan and Napoli, in Serie A.\nThat was I Nerazzurri's third consecutive victory across all competitions, a run that began after a 2-1 away defeat by Atletico Madrid in the Champions League.\nCristian Chivu's team had won all four of their previous outings in Europe this season and sit joint-second in the league phase standings prior to matchday six.\nThey have also progressed to the quarter-finals of the Coppa Italia and will face Bologna in the last four of the Italian Super Cup later this month.\nKey players\nCaptain Lautaro Martinez is Inter's top scorer this season with 11 goals in 18 appearances, including four in four Champions League matches.\nMarcus Thuram and Hakan Calhanoglu have weighed in with eight and seven goals respectively across all competitions, while Federico Dimarco leads the way in assists with five.\nDimarco and goalkeeper Yann Sommer are the only players to feature in all five of Inter's Champions League fixtures so far this season.\nTeam news\nDuring his pre-match press conference on Monday afternoon, Chivu said: \"Manuel [Akanji] didn't train today because he wasn't feeling well. We'll see how he is tomorrow.\n\"[Francesco] Acerbi is the defender who gets the most minutes, along with [Alessandro] Bastoni and Akanji. [Yann-Aurel] Bisseck showed what we expected. The decisions I make are based on the opponent, the workload and my intuition.\n\"Acerbi has shown in recent years that he can play every three days. He recovers very quickly and he can do it.\"\nChivu also confirmed both Matteo Darmian and Denzel Dumfries are ruled out of the game due to injury.\nPrevious meetings\nThe clubs have met on six previous occasions, all in the European Cup/Champions League, with Liverpool winning four and losing two of those matches.\nTheir most recent clash was in the last 16 in 2021-22, when the Reds prevailed 2-1 on aggregate by claiming a 2-0 first-leg victory at San Siro before a 1-0 defeat at Anfield in the second leg.\nWhat they said\nInter head coach Chivu\n\"Liverpool have made intensity their motto and [Arne] Slot is trying to maintain this. They started well this year, then had a difficult time, but they're one of the most renowned teams in the world. We know their value and we want to bring intensity. They have this culture, also thanks to the way football is experienced in England, which allows them to have that kind of approach to matches and to football in general.\"\nPre-match stats\n- Liverpool could become only the second visiting team in history to defeat Inter three times at San Siro in the European Cup/Champions League, after Bayern Munich\n- Inter are unbeaten in their last 18 European games at San Siro, a run going back to September 2022\n- Inter have reached the final of this competition in two of the past three seasons, losing against Manchester City in 2023 and Paris Saint-Germain earlier this year\n- They have played English sides on 43 previous occasions in their history, with 17 wins, seven draws and 19 defeats",
  "word_count": 560,
  "scraped_at": "2026-02-14T02:27:05.515675",
  "_text_extracted": true
}