{
  "article_id": "072a26ea8323",
  "url": "https://www.thisdaylive.com:443/index.php/2023/08/19/man-city-face-first-title-defence-real-test-as-newcastle-storm-etihad",
  "title": "Man City Face First Title Defence Real Test as Newcastle Storm Etihad",
  "date": "20230820T030000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nMan City Face First Title Defence Real Test as Newcastle Storm Etihad\nManchester City’s quest to become the first club to win the Premier League four times in a row faces its first real test as new English top flight power house, Newcastle visit the Etihad today. Both sides had an easy ride in the opening day of the league season. While the Citizens beat Burnley 3-0, the Magpies pummeled Aston Villa 5-1 but today’s encounter is expected to be a true test for both managers – Pep Guardiola and Eddie Howe, who are known for their contrasting approach to the game\nTwo of the Premier League’s big winners on the opening weekend square off in an intriguing Etihad encounter tonight, as Manchester City host Newcastle United. The Magpies demolished Aston Villa 5-1 at St James’ Park last weekend, while Pep Guardiola’s side recently clinched UEFA Super Cup glory against Sevilla.\nWhile some people wait a long time for a bus and two come at once, the Man City faithful endured years of European agony before witnessing their side win two continental honours in the space of two months, and their Super Cup success followed a straightforward opening 3-0 Premier League win over Burnley.\nThe student reunited with his master as Clarets boss Vincent Kompany tried to mastermind an opening-day shock, but Erling Haaland’s customary brace swiftly killed such hopes, before Rodri put the cherry on the icing on the cake to ensure Man City started as they mean to go on.\nNow returning to their Etihad headquarters for the first time this season, Man City are aiming to stretch their magnificent Premier League winning streak on familiar turf to 11 matches, having triumphed in all of their top-flight home meetings in 2023 since being held by Everton on New Year’s Eve.\nWhile Man City’s three-goal success at Turf Moor is appropriately good enough for third place in the Premier League table, Eddie Howe’s rampant Newcastle currently lead the way at the top courtesy of their exceptional display against a disjointed Aston Villa side.\nMoussa Diaby had initially cancelled out an opener from fellow new arrival Sandro Tonali, but Unai Emery’s high defensive line was subsequently exposed time and time again by Newcastle, as Alexander Isak’s brace, Callum Wilson’s finish and Harvey Barnes’s injury-time strike completed the Magpies’ mauling. Sitting clear of Man City and Brighton & Hove Albion on goal difference with 37 games left to play, Newcastle will soon have European football on their minds as they wait to learn who they will face in the Champions League group stage, but repairing an underwhelming away record is Howe’s number one priority at this moment in time.\nThe 5-1 thumping of Villa extended Newcastle’s Premier League unbeaten streak to five matches, but they won just one of their final four away games in the 2022-23 season and have conceded in each of their last nine on the road since a goalless draw with Crystal Palace in January.\nIt is nearly 12 months to the day since Newcastle and Man City played out a pulsating 3-3 draw at St James’ Park, but Guardiola’s side eased to a 2-0 victory at the Etihad in March and have not been bested by the Magpies since Rafael Benitez oversaw a 2-1 win in January 2019.\nAnother mouthwatering fixture in gameweek two of the 2023-24 Premier League season sees Tottenham Hotspur welcome Manchester United to their North London headquarters this evening.\nAnge Postecoglou’s side began their new campaign with a 2-2 draw away to London rivals Brentford last weekend, while the Red Devils scraped a controversial 1-0 win over Wolverhampton Wanderers.\nAcclimatising to life without Bayern Munich-bound Harry Kane strutting his stuff in the final third, Tottenham still adopted Postecoglou’s forward-thinking philosophy in their Premier League opener with Brentford last weekend.\nOnce underway, Spurs drew first blood through Cristian Romero, but their unsolved defensive issues came to the fore once again as Bryan Mbeumo and Yoane Wissa turned the tie on its head for the Bees, who were missing their own talismanic striker in the suspended Ivan Toney.\nHowever, a fine fourth from Emerson Royal saw the two capital counterparts shake hands on a point apiece on the opening weekend – a fair result between two progressive and attack-minded head coaches .\nSitting ninth in the fledgling rankings following their Gtech Community Stadium stalemate, Spurs triumphed in each of their first five home games of the 2022-23 Premier League season and also strung together a five-game winning sequence in front of their own fans between February and April.\nThose green streaks paled into insignificance towards the end of the campaign, though, as Tottenham won just one of their final four home contests last term, but they have not failed to score at the Tottenham Hotspur Stadium in the Premier League since January and will no doubt be encouraged by Wolves’ plucky display at Old Trafford.\nA few lucky stars were being counted at the Theatre of Dreams on Monday evening, as Man United just about got over the line against Wolves thanks to a Raphael Varane header, but there were concerns aplenty for Erik ten Hag as Gary O’Neil’s side launched a wave of unexpected attacks.\nAndre Onana earned his keep for the most part, but the Cameroonian shot-stopper survived a heart-in-mouth moment in the dying embers, as neither Simon Hooper nor VAR official Michael Salisbury deemed his collision with Sasa Kalajdzic inside the box to be penalty-worthy.\nWolves boss O’Neil subsequently claimed that he had received an apology from PGMOL chief Jonathan Moss – another beg-pardon to add to the list and all officials involved have curiously been dropped for this weekend’s fixtures; not that the Old Trafford faithful will care.\nThe seventh-placed Red Devils have now prevailed in each of their last five Premier League contests on the bounce, although they ended the 2022-23 season with just three wins from their final 10 games on rival territory – a run which includes a 2-2 stalemate with Ryan Mason’s Tottenham.\nTen Hag’s side threw away a two-goal lead to draw with the Lilywhites that day, but Man United now travel to North London having avoided defeat in each of their last five matches with Tottenham, whose most recent success in this fixture was their astounding 6-1 Old Trafford triumph in October 2020.",
  "word_count": 1061,
  "scraped_at": "2026-02-14T02:10:09.483629",
  "_text_extracted": true
}