{
  "article_id": "074dc174f863",
  "url": "https://www.the42.ie/why-michael-carrick-6924539-Jan2026/",
  "title": "Little evidence to suggest Michael Carrick is ready for such a high - profile role",
  "date": "20260113T124500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THERE IS a case to be made that Michael Carrick is one of the most underrated players in Manchester United’s history.\nThe midfielder won the Champions League and five Premier League trophies during his time at Old Trafford.\nThat is only two fewer titles than the man whose jersey he inherited at Old Trafford — Roy Keane.\nAs the Corkonian’s time in the game was coming to an end, there were many younger counterparts dubbed the new ‘Roy Keane’.\nEric Djemba-Djemba and Kléberson were among the players the Red Devils signed as potential successors to Keane in that crucial defensive midfield role.\nThe Irish star had captained the club to a seventh title since he joined in May 2003, less than a year after the Saipan debacle.\nBut it would be another four years before the Red Devils tasted success again — at the time, United’s longest drought of the Premier League era — and tellingly, the resurgence coincided with Carrick’s first season at the club following a big-money (at the time) £14 million move (potentially rising to £18.6 million or €21.5 million) from Spurs.\nUnited won four of the next six Premier League titles, regaining that sense of dominance that had dissipated as Keane’s playing days drew to a close.\nAnd the last triumph was arguably the best from the former West Ham youngster’s perspective, as Carrick was one of only four United stars to make the PFA Team of the Year.\nSo why is the retired midfielder not always quite as fondly remembered as some other United greats?\nPerhaps Carrick’s sin was outstaying his welcome.\nKeane, for instance, played just two full seasons in the aftermath of that 2003 title triumph.\nAnd it’s not as if United were awful in that period — they finished top-three on both occasions, and had the misfortune to be eclipsed by two of the best sides in Premier League history — Arsenal’s ‘Invincibles’ and early-Jose Mourinho Chelsea.\nBy contrast, Carrick played for five more seasons after what is still United’s most recent title triumph.\nSo in some people’s minds, the 44-year-old is associated just as much with the post-Ferguson slump as he is with the glory years.\nCarrick was also the subject of one of Keane’s more memorable quips in the latter’s fledgling punditry days, likening the player’s “flat” post-match interview to the dismal United performance after a 2-0 loss to Olympiakos in the Champions League.\nHowever, there is no doubt that Carrick was a key part of the late Ferguson years, and his contribution tends to be appreciated, at least by the more discerning fans and media — in Four Four Two’s 2023 list of United’s greatest ever players, the former England international placed 37th.\nYet, as has been underlined countless times, success on the pitch does not necessarily translate to the dugout.\nAnd since transitioning to coaching, Carrick’s CV could be described as relatively unspectacular.\nSome of the trepidation United fans have is because, similarly to rival candidate Ole Gunnar Solskjær, he was part of underwhelming stints in the past.\nAfter retiring at the end of the 2017-18 season, he went directly onto Jose Mourinho’s coaching staff at United.\nYet the Portuguese manager departed the role six months later, with Carrick briefly serving as caretaker boss before being retained during the Solskjaer era.\nCarrick served in his second caretaker post at United following Solskjaer’s exit in November 2021 and had a relatively positive few days in the role, presiding over wins against Arsenal and Villarreal (the latter secured their place in the Champions League knockout stages), as well as a draw with Chelsea.\nYet it is unfair to judge managers in these temporary and backroom staff positions.\nThe other coach whom Mourinho originally appointed alongside Carrick was Kieran McKenna, who has since impressed at Ipswich Town, guiding the Tractor Boys to back-to-back promotions and potentially, a return to the Premier League this season as they sit third in the Championship.\nCarrick followed McKenna’s lead, moving down the English football pyramid to establish himself.\nThe Tyne and Wear-born coach took over at Middlesbrough in October 2022, 10 months after leaving his role as United first-team coach shortly after Ralf Rangnick’s appointment as interim manager.\nThe Boro spell began promisingly. At the time of his appointment, the club sat 21st in the Championship, having taken 17 points from 16 games, and were only one point above the relegation zone after Chris Wilder’s brief and disappointing tenure.\nYet Carrick had a significant impact, as the Teesiders won 16 of his first 23 matches in charge.\nThat form helped propel them to a fourth-place finish before losing in the semi-finals of the playoffs to Coventry City.\nBigger sides began to take notice amid this early success. Carrick was linked with the Tottenham job that eventually went to Ange Postecoglou as the ex-United star’s stock in the game rose.\nUnfortunately, the second season at Boro was not quite as impressive as his first. Despite guiding the club to an EFL Cup semi-final spot (beating Chelsea 1-0 in the first leg before a 6-1 hammering in the second), they finished four points off the playoff spots in eighth.\nThat near miss was still enough to persuade Boro to hand Carrick a new three-year contract.\nBut a year later, the manager was out the door. It continued to be a case of diminishing returns, as Boro finished 10th, five points worse off than the previous campaign, although again only four off the playoffs and still in contention on the final day.\nYet it was the manner in which the club finished the campaign that likely sealed Carrick’s fate, as he became the 17th managerial casualty of the Championship’s 24 teams that season after an in-depth review from the hierarchy.\nA 2-0 win away at Blackburn put them in pole position for another go at the playoffs.\nBut they lost four and won only one of their remaining six league fixtures amid a dramatic collapse in form at the worst possible time.\n“There will be a sense of sadness on Teesside that Carrick was unable to follow up on the promise of his first season when some of the football left fans purring. That sadness will be weighed against the reality that the club have gone backwards in the seasons since,” wrote the BBC’s Mark Drury at the time.\nCarrick would not have been expecting to be leading Man United seven months later, and his unlikely elevation is a testament to the desperate times at Old Trafford as much as anything else.\nThe decision seems dictated by the emotion of the past and Carrick’s achievements as a player, more so than logic.\n“Nostalgia plays tricks on people’s minds,” as Alex Ferguson once said.\nBut United were hardly going to persuade an elite manager to take a short-term gig while they ostensibly wait for someone better to become available in the summer.\nAnd a name like Carrick probably also gives them a bit more leeway than someone with no historical connection to the club, such as Rangnick. Fans are less likely to promptly turn on a figure who has given the team great memories in the past.\nAnd that is not to say this decision is doomed to failure.\nCarrick’s time at Middlesbrough at least suggested he was adept at short-term fixes.\nSimilarly, when Solskjaer agreed to the interim job in 2018, his only managerial successes had come in the relative obscurity of Norwegian football, with Molde, and trophies such as the Lancashire Senior Cup, while in charge of Manchester United reserves.\nHis one previous high-profile job in England had lasted just eight months and included relegation from the Premier League with Cardiff City.\nYet improbably, initially at least, Solskjaer’s spell at United was an unexpected success.\nThe plan had been for him to return to Molde at the end of the season, but a succession of positive results and pressure from high-profile supporters such as Rio Ferdinand led to his ascension into the job proper.\nAfter winning 14 of his opening 19 matches in charge, Solskjær signed a three-year contract in March 2019, but that moment was as good as it got.\nUnited still finished the season in sixth — the same position they were in when the Norwegian was initially appointed.\nThe team improved thereafter, with third and second-place finishes in the next two seasons under Solskjaer.\nBut the shock return of Cristiano Ronaldo towards the start of the 2021-22 season coincided with a dip in form, and Solskjaer was relieved of his duties in November of that season.\nLike Amorim, the Norwegian’s most notable achievement was arguably guiding the Red Devils to a Europa League runners-up spot.\nAccording to UK media reports, one of the deciding factors this time on United opting for Carrick over Solskjaer was the former’s acceptance that he would be stepping down at the end of the season, regardless of results.\nThat would suggest United have learned their lesson to avoid being swayed by the emotion and nostalgia that comes with a former great player working short-term minor miracles.\nYet the club has been on a downward spiral for a long time, primarily due to the ineptitude and ill-conceived ideas of its hierarchy, so fans would be forgiven for doubting whether this latest decision is a sound one.",
  "word_count": 1556,
  "scraped_at": "2026-02-14T02:09:43.011572",
  "_text_extracted": true
}