{
  "article_id": "0777503ae63c",
  "url": "https://www.managingmadrid.com/2024/5/27/24165588/real-madrid-open-media-day-recap-ahead-of-the-champions-league-final",
  "title": "Real Madrid open media day recap ahead of the Champions League final",
  "date": "20240527T210000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is that time of the year again — Real Madrid have started preparing for the Champions League final, and one of those preparations is the media day that both teams have to do during the week leading up to the final.\nReal Madrid’s open media day recap ahead of the Champions League final\nA number of players spoke ahead of the big game.\nThere were a number of players who spoke at media day this time around. Jude Bellingham, Vinicius Jr, Dani Carvajal, Eduardo Camavinga are just some of the players who spoke to journalists, and here are the quotes compiled from the day.\nVinicius Jr\nAbout the Champions League\n“It’s a very important week and we hope we can win again. We’re always focused on winning. I hope I can score, but the most important thing is to win. It’s a unique match and we have to start strong. We’ve only lost two games, and hopefully, we can finish the season like that. It’s a very important week, and hopefully, we can win again.\nHis style of play\n“I’ve never been scared of losing the ball and that’s what has taken me this far. Not every player can wear this jersey or train with these legends. The unity of this team is what makes us good.\nFacing Dortmund\n“German players are always difficult, and they’re very close to me, but we’ll see what the coach prepares in order to do our best.”\nWaiting for the final\n“These days it’s different. Saturday usually comes quickly, but now it’s taking long. It’s time to enjoy it as this doesn’t happen too many times. Well, if you are at Real Madrid then yes it does.”\nConfidence from teammates\n“My teammates always tell me that I am the best and it gives me confidence, but I never think about it. I think about what I can contribute to the team. Goals and assists. The best thing that could happen to us this season is to win the Champions League.”\nWhether he’d take winning the CL and Copa, but Kroos wins the Ballon d’Or\n“I sign to win the Champions League and the Copa America, and the Ballon D’Or for Toni Kroos. It’s his last season, we won’t see him play again.”\nMbappe\n“I hope he decides his future soon. I always want to play with the best players in the world.”\nJude Bellingham\nFacing Dortmund\n“It’s very special for me to play this game, but we have to try to put the emotions to one side.”\nFirst season at Real Madrid\n“It’s been a great first season, everyone has welcomed me very well.”\nImportance of being at their best\n“It’s important that we’re at our best. It’s difficult for the other teams when we play at that level. Our staff are analyzing everything so we can win, I have 100% confidence in them. To play this kind of game is the reason why I’m here. I always dreamed of playing for this team and scoring goals. This team means Champions League, it’s what they always want.\n“I want to make a little bit of history with this team.”\nBallon d’Or\n“Viní Jr is the best in the world. He creates magic out of nothing. He has everything to be the best.\n“If Vini feels I should win it, then you can split the Ballon d’Or in two pieces.”\nJadon Sancho\n“I got a message from Sancho, saying ‘see you there.’”\nThibaut Courtois\nOvercoming the injury\n“To have been able to play four games already and to be available for the final is my personal victory. All my hard work helped me to play in May. When you get injured, you have to come back and prove that you’re the same as before or better, and that’s what I’ve been thinking about for the last few months.\n“I’m happy to be able to make all those saves on the pitch. I’d like to thank my team-mates, the club and the fans for their support after an injury like this.”\nThe Champions League final\n“I’m very happy to be part of Real Madrid’s history. We have a tough game ahead of us, but I want to keep building on the greatness of this club. I hope we can win one more European Cup. Borussia are a great side, they know how to defend, they are good at set-pieces and on the counter-attack.”\nLucas Vazquez\nThe Champions League final\n“We all just want to get to the final and win it. The important thing is for the team to win the Champions League for Real Madrid. The opposition won’t make it easy for us, but if we do everything we have during the week, I think we can win the Champions League. We’re going to work as hard as we can to achieve our goal of winning the Champions League and to give everything we’ve got.”\nHis personal improvement\n“I’ve felt very comfortable this year, and the team has taken a big leap forward. All the players have taken a step forward. That’s why we’ve won the league, we’re in the Champions League final, and we’ve had a great season.”\nBrahim\nHis first Champions League final\n“I’m very happy to have made it to a final, my first one. I hope it’s the first of many. It’s been a wonderful season. This group makes everything so easy. We’re not friends, we’re a family and everything is much easier with my team-mates. “It’s been a very even season for everyone and we’re now in another final.”\nMessage to the fans\n“Madridistas, thank you very much for your support. We have one final left to play and we’re going for number 15. We’re going to fight for it, we’ll give everything and it’ll be easier with your support.”\nNacho\nEqualling Gento\n“A number of my team-mates and I are just one step away from equaling Gento and we’re really eager to please madridistas and ourselves. The decade we’ve lived through has been incredible, I’m fortunate to be the captain of this team. I want to thank you for the support you’ve shown throughout the season. We’re just one step away from lifting the most special trophy for this club and we’re going to give our all on the pitch.”\nThe difficulties faced this season\n“The coach has made sure that the group is prepared for any situation. It’s been a difficult year; we’ve had a lot of injuries, and that speaks for the ability of this squad. We’ve won two trophies and we’re playing in another final on Saturday. We’re on the verge of continuing to make history and we’re just one step away from being able to win another Champions League, as difficult as that will be.”\nCibeles\n“The celebration in Cibeles has been the most emotional moment in my life. It was the maximum. If God wants, I’ll be there again soon.”\nEuros\n“Very happy to be back with Spain for the Euros. I’m enjoying the moment. Another final with my club, incredible. We’re so close to lifting another Champions League trophy. We’re here to dream.”\nRodrygo\nThe jersey\n“When you put on this jersey, you’re more and more prepared. It’s a very nice final coming up and hopefully we’ll win it. It’s been a difficult season, they all are, but this one maybe even more so because of injuries. We have this last game to achieve our goal.”\nThe final\n“Ever since we beat Bayern, it feels like the final has taken a long time to come. It’s a final and it’s going to be tough. It’s always difficult against German teams. It’s also going to be difficult for them.”\nBest moment in the UCL this season\n“My goal against City at the Bernabéu. It was special.”\nLuka Modric’s legacy\n“Modric wants to win and always be better and that together with the DNA of the club, to always win everything. It’s easy for us, younger, because if I see Modric, 38 years old, five Champions and Golden Ball running from the corner to the penalty area, then I will run too. The older ones give the example and everyone understood what Real Madrid is. There’s no ego in our locker room.”\nFede Valverde\nThe final\n“It’s going to be a tough game. Borussia Dortmund are a great team, in which everyone is working in the same direction. We’ve got great players and we have to make the most of that to get as much out of them as possible. Hopefully, we can give the fans something to cheer about on Saturday and make it a great day.”\nHow he’s feeling ahead of the game\n“I’m proud to be experiencing the week, I’m very excited and at the top of my game. It’s been a very special season because of everything we’ve been through and the role I’ve played in the team. I ‘ve played a bit further back this year, but I’m a team player and I’m very happy to contribute with hard work and commitment.”\nToni Kroos’s departure\n“I am very sad. He has helped me a lot, on and off the pitch. I will always be grateful to him.”\nJoselu\nChampions League final\n“It’s Champions League final week, and we’re going to enjoy it. I’m happy, the season is coming to an end in the best possible way and it has helped us to prepare for this game. I’ve soaked up this week.”\nBayern\n“The Bayern game was an incredible moment, and it’s going to be great to be out on the pitch in a final. The game doesn’t start when the coach names the line-up, it starts 24 hours before when you’re in the right frame of mind. Every player has to be focused and ready to come on at any moment. You win finals, Real Madrid win finals and we have to go in with that mentality. I am happy to play even two or three minutes for Real Madrid.”\nEder Militao\nReturn from injury and another UCL final\n“I was injured seven months ago, but I’m now ready to play in a Champions League final. I couldn’t have imagined it. I was only thinking about recovering. I didn’t think I’d experience another final. It’s like a film. Football is about winning trophies and making history. Everything happens very quickly, and you have to make the most of every moment with your teammates.”\nDani Carvajal\nSixth Champions League final\n“I’m looking forward to it and I’m having a great week. We’re focused on Saturday after winning the league. I’m very happy, with no injuries, playing at a good level on the pitch and full of confidence. I never thought I could play in six Champions League finals and I’m looking forward to lifting the trophy on Saturday.”\nThe unity of the squad\n”The squad has really stepped up after the serious injuries. We’ve given the coach a helping hand. We all contribute, and we’re a winning group. We have to convey confidence and enthusiasm to the younger players, even though some of them have already played in the final in Paris. We’re all going to London, and we want to win and give our fans something to cheer about. It’ll be a big game, and Dortmund will make things difficult for us.”\nA message to the fans\n“Madrid fans, we’re just a few days away from a Champions League final. I want to thank you for your support throughout the season. We’ve given our all, and we’ve won a wonderful league title. We’ve reached the Champions League final by knocking out big sides, and on Saturday, we have the final test against Dortmund. I hope we can bring you the Decimoquinta.”\nEduardo Camavinga\nEagerness to play the final\n“I just want it to be Saturday already to play this type of game. We always want more and we want to win the final. We’re playing in a legendary stadium, but I just want to win.”\nPreparation\n“We’re more focused because it’s a final. We’ll do everything during this week to prepare for the final. We have a strong team, and it’s easier to play with good players. I’d like to thank the fans for their support, and we want to win the Decimoquinta for you.”\nAntonio Rudiger\nGood energy in the dressing room\n“Having good energy in the dressing room is very important for me. Playing for this club is a dream come true. I’m trying to enjoy it, and that’s why I’m trying to be at my best. Winning is what Real Madrid demands. All the best players want to come here and play in games like this.”\nPlaying for Dortmund in the past\n“I have many friends at Dortmund, but my job is to win with Real Madrid.”\nToni Kroos\nThe farewell\n“When I arrived in 2014, I would have never imagined to have such a farewell. It’s been so special, and it will stay with me forever. If I ever want to cry at home, I will play the video of my farewell. I tried not to cry, but when I saw my daughter cry, it was very difficult for me. I will never forget these moments. I will remember forever, my children and my wife [will], too.”\nGerman teams\n“Playing against German teams is always difficult. We played against all of them this season, Leipzig, Bayern, now Borussia Dortmund.”\nLast game for the club\n“This will be my last game, but I don’t think about that now. There’s no time to think. I’m only focused on winning the Champions League. It’s been a good campaign, now it wouldn’t make sense to lose the final. I don’t think for myself. I think about this club. This is a big game and we want to win for this club, not for me.\n“This will be my last effort for Real Madrid. Hala Madrid.”\nAurielien Tchouameni\nThe injury\n“The most important for me is to help the team now. Even if I’m injured. It’s very difficult for me to play but we have other good players. I wanted to play this final but I’m sure I will play more in the next years.”\nLuka Modric\nApproaching the final\n“The best thing is living day by day, then when the game gets closer it’s there when you start thinking about the game. Now we are very relaxed, calm, we believe in us.”\nReceiving all the standing ovations\n“This is the best thing that can happen in football. The love from fans is the best thing ever. This will stay with me forever, for my life.”\nSix Champions League finals\n“Another final... it looks easy but it’s not. What this club, this generation is doing is unbelievable, we are very happy to be here.”\nMessage to the fans\nHello Madridistas. Thank you for your support in key moments in the League and Champions League, we have one last push left in London and we are going to do everything to bring happiness for those who are there and those who cannot go.”",
  "word_count": 2522,
  "scraped_at": "2026-02-14T02:01:16.454648",
  "_text_extracted": true
}