{
  "article_id": "07a908b0d8e1",
  "url": "https://thepeoplesperson.com/2025/03/15/manchester-united-scouts-submit-glowing-reports-on-lille-wonderkid-ayyoub-bouaddi-291971/",
  "title": "Manchester United scouts submit glowing reports on Lille wonderkid Ayyoub Bouaddi - Man United News And Transfer News",
  "date": "20250315T201500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United could do with adding more quality in the middle of the park in the summer given the current options at Ruben Amorim’s disposal.\nEven though Casemiro is playing well at the moment, he does not fit the head coach’s long-term vision and neither does Christian Eriksen with both expected to leave once the season concludes.\nKobbie Mainoo is still to find his best position in the new 3-4-3 system which is why Bruno Fernandes is having to play as a deep-lying playmaker at the moment.\nAmorim wants the club captain to return to playing as an attacking midfielder and multiple talents from across Europe are being monitored.\nAyyoub Bouaddi in demand\nThe latest name on that list comes courtesy TBR Football with the report claiming the Red Devils have joined the race for Lille wonderkid Ayyoub Bouaddi.\nThe 17-year-old broke a bunch of records last season including becoming the youngest player to feature for the French club in a European club competition game and in Ligue 1, while also becoming the youngest to start in a UEFA Champions League match for Lille.\nHe can play all across the midfield and even as an auxiliary centre-back but excels as a central midfielder. Scouts have come back with “glowing” reports on him after watching him extensively this season.\nAnd apart from the Old Trafford side, there is interest from Arsenal, Liverpool, Chelsea, Manchester City, Aston Villa and Brighton. Not only English sides but also Real Madrid, Bayern Munich and RB Leipzig are also monitoring proceedings.\n“Sources have told TBR Football that Arsenal, Liverpool, Chelsea, Manchester City, Manchester United, Aston Villa and Brighton have all taken the chance to watch Ayyoub Bouaddi in action.\n“TBR Football has also been told that the Premier League clubs have been left with ‘glowing’ reports on the teenager.\nLille will not let go so easily\n“But there is more than just interest from the Premier League in Bouaddi, with Real Madrid, Bayern Munich and RB Leipzig having all watched him this year.”\nIt must be remembered that the Ligue 1 giants are already set to lose both Angel Gomes and Jonathan David in the summer sho they will fight tooth and nail to hold on to their prized jewel.\nAlso, the player is only 17 so he will not be able to join United before January 2026 and given United’s immediate requirement, it will be interesting to see if the club still proceeds with the deal.\nThe France U21 international has a contract until 2027 and is valued at €25 million as per Transfermarkt. Given the interest in his services, it will not be easy for INEOS to secure his signature.\nPlenty of Lille players are on United’s radar including former Carrington graduate Gomes as well as goalkeeper Lucas Chevalier. The 20-time English league champions have a great relationship with the French club given their recent deal for Leny Yoro last summer.\nFeature image Christof Koepsel via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 499,
  "scraped_at": "2026-02-14T01:49:31.515497",
  "_text_extracted": true
}