{
  "article_id": "07ae4b6e60dc",
  "url": "https://metro.co.uk/2025/12/31/next-chelsea-manager-odds-blues-make-decision-enzo-maresca-future-25961666/",
  "title": "Next Chelsea manager odds as Blues make decision on sacking Enzo Maresca",
  "date": "20251231T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Premier League star Liam Rosenior has emerged as the early betting favourite to succeed Enzo Maresca at Chelsea.\nChelsea have picked up just one win in their last seven Premier League games with faint hopes of challenging for the Premier League title quickly evaporating.\nThey were held to a 2-2 draw at home to Bournemouth on Tuesday night with the Cherries without a league win since October.\nMaresca was roundly booed by home fans after taking off Cole Palmer as his side chased a winner in that game with more jeers following at full-time.\nNumerous reports on Wednesday claimed Maresca was not in immediate danger of losing his job in the aftermath of that result but the Italian’s departure was confirmed on Thursday afternoon.\nAnother huge game awaits on Sunday with a trip to Manchester City before a west London derby with Fulham next Wednesday.\nDifficult games against Arsenal and Napoli in the Carabao Cup and Champions League also await the next Chelsea manager.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nNext Chelsea manager odds\nLiam Rosenior: 1/2\nCesc Fabregas: 5/1\nRoberto De Zerbi: 8/1\nOliver Glasner: 8/1\nUnai Emery: 14/1\nXavi: 14/1\nAndoni Iraola: 14/1\nFrank Lampard: 25/1\nIt remains to be seen who that is but bookmaker BetVictor have placed Rosenior as the favourite for the Chelsea job at 1/2 on.\nRosenior, 41, is building an impressive reputation at Strasbourg, another club under the BlueCo banner.\nEx-Chelsea captain Cesc Fabregas is next in the betting at 5/1, with former Premier League manager Roberto De Zerbi and current top-flight boss Oliver Glasner both at 8/1.\nBarcelona and Spain legend Xavi was the the current favourite for the job but has drifted out to 14/1.\nXavi has been out of a job since leaving Barcelona in 2024 after three years at the helm, winning one Spanish title in that period.\nFulham boss Marco Silva and Unai Emery are both at 10/1 with Frank Lampard priced at 12/1 for a third stint in the dugout.\nBefore Christmas, multiple reports named Maresca as a leading candidate to replace Pep Guardiola at Manchester City should the latter walk away at the end of the season.\nMore Trending\nMaresca worked as the Under-23 head coach at City and as Guardiola’s assistant before leaving for Leicester in 2023.\nThe Italian firmly dismissed those reports, however, saying: ‘It doesn’t affect me. It’s 100% speculation.\n‘There is no time for this kind of thing. I have a contract here until 2029. My focus is just about this club. I’m very proud to be here.\n‘It’s speculation. One week ago was the same thing with Juventus. I don’t pay attention because I know it’s not true.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: I snubbed Manchester United transfer – and then became a legend at Liverpool\nMORE: Premier League club shortlist two Chelsea stars for January transfers\nMORE: Man Utd handed transfer boost ahead of January window as £38m sale a ‘formality’",
  "word_count": 557,
  "scraped_at": "2026-02-14T01:59:31.503998",
  "_text_extracted": true
}