{
  "article_id": "07f73f0c0e66",
  "url": "https://www.cityam.com/houston-dynamo-refund-tickets-after-messi-misses-inter-miami-game/",
  "title": "Houston Dynamo refund tickets after Messi skips Inter Miami game",
  "date": "20250303T123000Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Houston Dynamo refund tickets after Messi misses Inter Miami game\nMajor League Soccer team Houston Dynamo have offered supporters a refund on the cost of their tickets after opponents Inter Miami left Lionel Messi out of their match on Sunday.\nHouston Dynamo sold out their 22,000-capacity Shell Energy Stadium for the MLS fixture only for Inter Miami to unexpectedly rest 37-year-old eight-time Ballon d’Or winner Messi.\nThe hosts said they had expected Messi to play because he had not been included in a list of unavailable players shared between the two teams ahead of the game.\n“The recently shared player status report for the match did not include forward Lionel Messi. Unfortunately, we have no control over who plays for our opponent,” Dynamo said.\nThey added that the 20,810 spectators who still attended “can claim a complimentary ticket to a future Dynamo match this season. Additional details will be provided early next week.”\nMessi had played three matches in the space of seven days in the lead-up to the trip to Texas, scoring in both legs of a Concacaf Champions League first round win over Kansas City Chiefs.\nMessit ticket refund row strikes again\nInter Miami, who beat Dynamo 4-1 without their star player, are due to face Jamaican side Cavalier FC in the second round of the Champions League on Thursday night.\nIt is not the first time that teams have been forced to issue refunds because of the absence of Messi, whose arrival has been credited with growing football’s popularity in the US.\nLast year Vancouver Whitecaps offered fans half-price food after the Argentinian did not play in and in 2023 Chicago Fire offered ticket credits to matchgoers at another no-show.\nIn early 2024 Messi was himself moved to apologise after his omission from a pre-season friendly in Hong Kong caused a major backlash in China.\nMessi’s popularity means that Inter Miami games remain in high demand, with tickets for July’s fixture at New York Red Bulls already going for more than $200 on the resale market.",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:49:18.059333",
  "_text_extracted": true
}