{
  "article_id": "082868c26110",
  "url": "https://www.gdnonline.com:443/Details/1366505/PSV-shift-attention-from-Champions-League-to-Dutch-top-of-table-clash",
  "title": "Football : PSV shift attention from Champions League to Dutch top of table clash",
  "date": "20251022T110000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSV Eindhoven coach Peter Bosz encouraged his players to celebrate after their 6-2 thrashing of Napoli in the Champions League but said work would begin the next day for their top of the table clash in the Dutch league at the weekend.\nPSV came from a goal down to run riot against the Serie A champions in front of a frenzied crowd at the Philips Stadion on Tuesday but are now swiftly turning their attention to Sunday’s clash against Feyenoord.\n\"They can celebrate but they don’t have to go out to the pubs,\" said Bosz, \"because now we start to prepare for Sunday\".\nFeyenoord, who have a three-point advantage at the top of the table, with 25 points from nine matches, host second-placed PSV in Rotterdam in a match that could be an early indicator of the destiny of the Dutch championship.\nTuesday’s win over Napoli was crucial in keeping PSV in the Champions League race for knockout round places after the Dutch champions garnered a single point from their opening two group clashes.\n\"I said in the dressing room that we can reach this level, we've been working towards it for weeks. We have to keep doing that now,\" the coach said.\n\"It was a difficult start, they put us under full pressure, and we had to play our way out of that. We knew that if we wanted a chance to win, we had to play our football. And that's what we did.\"\nPSV quickly overturned the early deficit into a 2-1 half-time lead and then went on to dominate proceedings with an impressive display of flowing football.\nPSV had needed the win after losing at home to Belgian newcomers Union St Gilloise before drawing at Bayer Leverkusen.\nThey have a tough programme remaining with trips to Olympiakos, Liverpool and Newcastle and two remaining home games against Atlético Madrid and Bayern Munich.\n\"When we saw the draw beforehand, we wondered if we, with our new squad, could compete. That first match was a poor dress rehearsal, but we played very well in Germany. After this win, I can say ‘we can compete at this level’,\" Bosz said.",
  "word_count": 359,
  "scraped_at": "2026-02-14T02:19:01.975268",
  "_text_extracted": true
}