{
  "article_id": "0833e3e441f6",
  "url": "https://www.bbc.com/sport/football/articles/cgerenr1ddno",
  "title": "Man Utd : Erik ten Hag Q & A - manager has  left behind  review of his job",
  "date": "20240802T111500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ten Hag Q&A: Man Utd boss has 'left behind' job review\n- Published\nIt was 25 May when Manchester United deservedly beat Manchester City in the FA Cup final.\nThe victory was remarkable for many reasons, coming as it did on the back of reports United manager Erik ten Hag would be sacked, no matter what the outcome.\nThe Dutchman had endured a turbulent season at Old Trafford.\nUnited had their worst performance in the Champions League group stage, finishing bottom to be knocked out of European competition.\nAfter a poor start to the Premier League season with six defeats in their opening 10 matches, they finished eighth with a negative goal difference. It was their lowest top-flight finish since the 1989-90 season.\nBut they ended the campaign on a high, beating City 2-1 in the FA Cup final.\nJust like compatriot and former United manager Louis van Gaal eight years before, Ten Hag went into the Wembley press room in bullish mood, warning new co-owner Sir Jim Ratcliffe if United got rid of him, he would win trophies \"somewhere else\".\nVan Gaal was axed within 24 hours. Ten Hag had to wait 17 days to discover his fate. After an extensive review, which included speaking to alternative managers, both before and after that FA Cup triumph, United’s hierarchy flew to Ibiza to tell the 54-year-old they had concluded they had the right man all along.\nThey triggered a one-year extension clause in his contract to prove it.\nFor the first time since those seismic three weeks, Ten Hag has spoken to BBC Sport, in Los Angeles, on the club’s pre-season trip to the United States.\nWhat were you thinking during the 'review'?\nIt feels like it is years ago. I left it behind and I am looking forward. I know why I am here. I am here to win. I am here for the project and to win trophies. We want to move forward.\nWere you waiting for the phone call?\nNo, because I knew this project and we are going in the right direction. We had won two trophies and I was preparing the season. That is what I did in this period. And of course I took a break. I needed it. It was a tough season.\nI was focussed on the reality. The reality was we had a tough season and I had to plan the squad. I had to prepare pre-season and the season and the decision making - and we are here.\nWe are now working good together. We are all here on the tour preparing the season. The leadership group, the new staff, the new coaching staff, also some new players. We are working on improvements and making the next step in the new season.\nDoes football structure overhaul take away your safety net?\nEven though we won two trophies, in the six years before United didn’t win any. We knew we had to change.\nWe have started the project. It is good. The new structure and new leadership has come in. New players have come in to improve the dressing room. Of course, the structure is there. The club has made changes and we can look forward.\nPeople have been brought in with great abilities. I am sure that will give us an even better foundation from which to attack.\nWe are building, we have to keep building and making progress. Then you need improvements. Everyone was reviewing. They came to the right conclusions, so we made the changes in the structures of the club.\nBut also we are improving the squad and we are going to improve the game model.\nFans backed you - how strong is your desire to stay longer?\nI am pleased with the support of the fans. They showed we are all together. That is a strong part, the team, the players and fans who are attending our games, home and away.\nIt brings fight to the stadium and fight to our players on the pitch. They are so supportive to achieve the right results. We hope to give it back, to strengthen the bond.\nThat is what United stands for. We want to construct better teams and better players and to achieve more success. We have won two trophies but our ambitions are high.\nCan you win another trophy this season?\nI definitely believe it is possible to win another trophy. But that is not my goal. It is not about me, it is about the club. That is the most important thing. We have to put the club in front.\nEveryone has to be aligned and go for a greater purpose. It is not about individuals. It is about the team. It is about unity. It is about togetherness to achieve at the highest.\nMore signings after Yoro & Hojlund injuries?\nThat is the plan. We want to make improvements in the squad and we want a squad as good as possible, although that is the aim of every club.\nIt is important when you want to be at the top level, in a season like this, which will be a season of ‘survival of the fittest’ you need squad depth.\nHow important to avoid another bad start to season?\nThe start is always important but it is the end that matters. We saw in the first season we bounced back, we had a successful season with many games and two finals. We went quite far in Europe [knocked out by Sevilla in Europa League quarter-finals] and we were third in the league.\nThe start is the foundation. If you have a good start it gives you a foundation to run into a successful season. But if you don’t get it, it can still be a successful season because seasons are long and trophies are always won in April or May.\nYou don’t have to [start well] but it is helpful if you do. Of course we are aiming for this.\nRelated topics\n- Published25 May 2024\n- Published2 August 2024\n- Published4 July 2024\n- Published26 July 2022",
  "word_count": 1014,
  "scraped_at": "2026-02-14T02:10:58.960708",
  "_text_extracted": true
}