{
  "article_id": "0834bf7cabcf",
  "url": "https://www.the42.ie/brendan-rodgers-celtic-european-exit-6800412-Aug2025/",
  "title": "  Well see what the remaining days in the window bring  - Rodgers admits Celtic frustration",
  "date": "20250827T143000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CELTIC MANAGER BRENDAN Rodgers struggled to mask his frustration over the club’s Champions League play-off preparations after a shoot-out defeat against Kairat Almaty consigned them to the Europa League.\nA failure to invest in attacking options came back to haunt Celtic during a goalless 210 minutes against the team from Kazakhstan and Rodgers hinted the club had manufactured their own stress.\nDaizen Maeda, last season’s top goalscorer, missed a glorious chance in the 86th minute before Celtic belatedly dominated in extra-time without finding the breakthrough.\nAnd the Japan attacker followed substitutes Adam Idah and Luke McCowan in seeing his penalty saved during a 3-2 shoot-out defeat.\nCeltic have failed to add any wingers following Jota’s long-term injury in May and the sale of Nicolas Kuhn to Como more than six weeks ago.\nAnd the fact that Shin Yamada, the only experienced striker to arrive since Kyogo Furuhashi left in January, stayed on the bench throughout the second leg, was further evidence that Rodgers is unconvinced about his quality.\nCeltic have spent about £3million on transfers so far this summer while bringing in about £20million, a sum similar to what they will miss out on following their failure to reach the Champions League proper.\nOnly two summer signings – Kieran Tierney and Benjamin Nygren – featured in Kazakhstan and the anticipated arrivals of Antwerp winger Michel-Ange Balikwisha and Boca Juniors left-back Marcelo Saracchi will come in the wake of major fan anger.\nRodgers again found himself in the difficult position of trying to diplomatically field questions about the seemingly inexplicable failure to strengthen adequately before the most consequential games of the season.\nSpeaking at the post-match media conference, Rodgers said: “I always think that investment is great, but it has to be a timely investment. And whatever it is you’re doing, it has to be all at the right time.\n“But at this moment in time, it’s a little bit raw. We’ve just lost the game.\n“This group of players have given everything. We just couldn’t find enough good moments and moments of quality to break through.”\nCeltic had been looking to build on last season’s near miss against Bayern Munich in the knockout phase but will now be absent from the Champions League proper for the first time in four years.\nWhen asked if it felt like a self-inflicted blow because key players had not been replaced, Rodgers said: “It’s very frustrating. We all know where we want to get to. We showed last year, the strides that I felt we took. But you have to build on that.\n“The last thing you want to do in football is manufacture your own stress. That’s what you don’t want to be doing.\n“But all we can do now is look at where we’re at as a football club and decide what way we want to go.\n“But we can still have a very good season.\n“We’ll see what the remaining days in the window bring, and then we’ve got a really big game at the weekend (against Rangers).”\nWhen asked if the loss of the Champions League income would impact Celtic’s remaining transfer activity, Rodgers said: “I haven’t a clue. I really don’t know.”",
  "word_count": 533,
  "scraped_at": "2026-02-14T01:58:57.508568",
  "_text_extracted": true
}