{
  "article_id": "0866d07e0981",
  "url": "https://www.cityam.com/2025-club-world-cup-to-last-29-days-fifa-confirm-in-saudi-arabia/",
  "title": "2025 Club World Cup to last 29 days , Fifa confirm in Saudi Arabia",
  "date": "20231217T171500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "2025 Club World Cup to last 29 days, Fifa confirm in Saudi Arabia\nThe 32-team quadrennial Club World Cup will stretch across nearly a month in the summer of 2025, Fifa confirmed on Sunday.\nThe competition will launch from 15 June to 13 July 2025 and will be hosted in the United States.\nThe move restricts the amount of time players from qualifying Premier League teams will have between the conclusion of the competition and the start of the 2025-26 domestic season.\nThe decision was presented at a meeting of the Fifa Council in Jeddah, Saudi Arabia, on Sunday.\nEnglish sides already in 2025 competition\nManchester City, Real Madrid and Chelsea will take part, as recent Champions League winners, alongside nine other European teams.\nThe 32 teams will compete in the United States a year before the nation co-hosts – alongside Canada and Mexico – the 2026 Fifa World Cup.\nThere will be eight groups of four with the top two in each qualifying for a round of 16.\nThe European Club Association has endorsed the new competition and Fifa hopes that the new competition will help in addressing European dominance in club football.\n“Clubs play a fundamental role in world football, and the Fifa Club World Cup 2025 will be a major milestone in providing clubs from all confederations with a fitting stage on which to shine at the highest level of the game,” Fifa president Gianni Infantino said.\n“This will be an open competition based on sporting merit that will play a key role as part of our efforts to make football truly global.”\nThis comes in the same cycle as an expanded World Cup, which has led to some concerns surrounding player welfare.\nElsewhere the Fifa Council confirmed that a new Intercontinental Cup will be introduced from next year between the winners of the Champions League and the winners of other intercontinental playoffs.\n“The tournament will feature all current confederation premier club competition champions,” Infantino added.\n“(It) concludes with a final at a neutral venue between the UEFA Champions League winners and the winners of an intercontinental play-off between clubs from the other confederations.”\nOther qualified teams for the 2025 competition include Neymar and Ruben Neves’ Saudi Pro League side Al-Hilal, Brazilian trio Palmeiras, Flamengo and Fluminense and MLS outfit the Seattle Sounders.\nManchester City will be in Saudi Arabia this week to face Japanese outfit Urawa Reds in the semi-finals of this year’s Club World Cup. The final is on Friday.",
  "word_count": 415,
  "scraped_at": "2026-02-14T02:07:27.049293",
  "_text_extracted": true
}