{
  "article_id": "0870a8e10235",
  "url": "https://theathletic.com/5171165/2024/01/01/free-agents-transfers-contracts-expiring/",
  "title": "Free agents in 2024 – the players who can now sign pre - contract transfer agreements",
  "date": "20240101T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This season’s winter transfer window is now open, meaning clubs can officially start the scramble to add reinforcements or offload players deemed surplus to requirements.\nPremier League sides can do business until 11pm GMT on Thursday, February 1 — and, following discussions with the major leagues around Europe, that will also be deadline day in La Liga (Spain), Serie A (Italy), Ligue 1 (France) and the Bundesliga (Germany).\nAdvertisement\nBut while clubs who want to sign players under contract must negotiate and, usually, pay a transfer fee during a FIFA-determined transfer window, wise forward planning allows ‘pre-contract agreements’ in some circumstances.\nThe Athletic explains what these are and which players due to be out of contract in the summer could now step up transfer plans…\nWhat is a pre-contract agreement and when can players sign one?\nA pre-contract allows clubs to get ahead with their recruitment, with a player and an interested club able to commit to a move before that player’s current deal expires.\nTalks can begin up to six months before a contract expires — meaning January 1 is a key date for the many players whose deals end on June 30 — but only with teams other than the one the player concerned is currently registered with (their parent club if presently out on loan).\nGO DEEPER\nThe man who freed football’s ‘slaves’, decades before Bosman\nDomestic transfers are regulated by each country’s football association as opposed to world governing body FIFA — and in a further restriction, the English FA cuts longer pre-contract timeframes in a bid to avoid conflicts of interest in the event a player might face their future club before leaving their current one.\nAny player looking to move from one English team to another as a soon-to-be free agent can only open talks a month before their contract expires.\nWhich notable players can sign a pre-contract agreement?\nNote: Some players below have club options in contracts that are yet to be triggered.\nPremier League\nManchester United have a decision to make about a player who has won one World Cup final, played in another and won the Champions League four times. Varane’s contract expires this summer, with the option of an additional year to extend his stay until 2025.\nThiago’s consistent injury problems played a part in Liverpool signing four new midfielders in last year’s summer window. He rejected offers from Saudi Arabia at that time but, as things stand, it seems more probable he will leave Liverpool after this season rather than stay.\nAdvertisement\nIt is common for clubs to include the option of an extra year in a contract and Jorginho, who was signed by Arsenal for £12million on deadline day in January 2023, is no exception, with an option to extend the Italy midfielder’s stay at the Emirates by an additional year should Arsenal choose to.\nChelsea are heavily reliant on Silva, despite his age. The 39-year-old remains a regular starter halfway through their first season under Mauricio Pochettino. It is not yet known if Silva will be offered a new contract. Chelsea’s current centre-back options beyond the long-time Brazil captain include Alex Disasi, Wesley Fofana, Benoit Badiashile, Levi Colwill, Trevoh Chalobah, Bashir Humphreys and Malang Sarr.\nHaving started all 19 of Newcastle’s Premier League games this season, Schar looks set to stick around beyond June when his current contract expires. Newcastle are expected to offer him a new deal in the coming months.\nThe Tottenham defender was offered to Bournemouth and Nottingham Forest in the summer transfer window but ended up staying in north London. Dier has featured in only four Premier League games this season, starting one, and seems likely to continue as a backup option who rarely plays under Ange Postecoglou.\nMartial became the world’s most expensive teenager when Manchester United signed him from Monaco in 2015 in a deal worth £36million, potentially rising to £58m. He then signed a five-year contract in 2019 with an option of an extra year. But, like David de Gea, who left in the summer despite having an optional year on his deal, United do not intend to prolong Martial’s stay under the terms of his current agreement.\nAfter featuring in all but four of 38 Premier League games last season, with 23 starts, Perisic, who was originally signed for Tottenham by his former Inter Milan coach Antonio Conte, had not featured as much during the current campaign even before an ACL injury in September. Spurs are not expected to offer him a long-term extension.\nAdvertisement\n“I’m pretty sure the club will show their class,” manager Jurgen Klopp said in December when asked if Liverpool plan to offer Matip a new contract. Originally signed on a free transfer in the summer of 2016, Matip has a long-term knee injury that means he might have already played his last game for Liverpool.\nColeman is now into his 15th season at Everton after signing an extension last summer. The 35-year-old defender is club captain but is now a peripheral figure in terms of the first team, having made just two Premier League appearances this season.\nLike others, Willian was offered the opportunity of a pay rise via a move to a club in Saudi Arabia last summer. Al Shabab were willing to offer the now 35-year-old Brazilian winger a salary of £200,000 per week. In the end, he signed a new one-year deal at Fulham, which includes the option to extend by an additional 12 months.\nJurgen Klopp was interested in keeping Milner last summer but Liverpool opted against it, which paved the way for Brighton to swoop in and sign him as a free agent. With more than 600 Premier League appearances under his belt, the ever-present midfielder continues to be an important player under Roberto De Zerbi.\nArsenal’s longest-serving player signed a contract extension in February 2023 that will keep him at the club until June. Opportunities for first-team action this season have been limited, with Elneny making only four appearances in all competitions; just one as a substitute in the Premier League.\nIf Lallana, who turns 36 in May, decides to call time on his playing career, a pathway into coaching with current club Brighton could be his next venture. During the international break in September last year, Lallana joined up with the England Under-21s squad in a coaching capacity, and Brighton have a reputation for hiring former players in coaching roles.\nFollowing the recent appointment of Nuno Espirito Santo, it remains to be seen if Aurier will feature as prominently for Nottingham Forest as he did under predecessor Steve Cooper. If Forest do want to keep the now-31-year-old full-back, they have an option to extend his current agreement by an extra year.\nAdvertisement\nEverton brought Gueye back to the club from Paris Saint-Germain in summer 2022, three years after he left them for the French side, and signed him to a two-year contract. The midfielder has featured in the majority of Everton’s games so far under Sean Dyche.\nAs one of Brighton’s most senior pros, Welbeck’s contributions extend beyond what happens on the pitch. Despite not being a regular starter, he is still considered a valuable player at Brighton.\nTosin was on Tottenham’s radar last summer and with his contract now running down, he is likely one of most coveted free-agents-to-be over the coming months. Signed for a bargain fee of just £1.5million, Fulham could lose a player they thought they would be able to make a sizeable profit from, for free.\nThe Brazilian defender was signed on an 18-month contract a year ago after moving from Atletico Madrid to Nottingham Forest. It was expected that he would be a key player during the current campaign, but Felipe has made only four appearances during 2023-24.\nClyne, an academy graduate at Crystal Palace, has signed successive one-year contracts during the past two seasons having returned to them in 2020 after three years with Southampton and five at Liverpool. His latest agreement is set to expire soon. The former England full-back, who will be 33 when the season ends, has featured sparingly (nine league appearances with six starts) but could still be retained for the seniority and leadership he offers.\nIn 2022, Fabianski signed a one-year contract at West Ham with the option to extend it by an additional 12 months. That option was activated last summer. The goalkeeper has predominantly been used in cup competitions this season, with five appearances in the Europa League group stage and two in the Carabao Cup to go with three Premier League starts.\nBrentford are expected to keep 34-year-old defender Mee at the club beyond this summer’s expiry of his current contract. Mee, signed on a free transfer from relegated Burnley after the 2021-22 season, is considered to be a leader under head coach Thomas Frank.\nAdvertisement\nWan-Bissaka has a 12-month extension clause in his current contract, but Manchester United are yet to announce if they will trigger that option or not. The defender became United’s fifth-most-expensive signing when he moved from Crystal Palace for £50million in the summer of 2019.\nTraore spent last season on loan at Turkey’s Istanbul Basaksehir and finds himself on the fringes of Unai Emery’s Aston Villa squad in this one, with just two Premier League appearances – both as a substitute. It is expected that the winger will be allowed to leave in the summer once his contract expires.\nWest Ham’s longest-tenured player signed a two-and-a-half-year contract in January 2022 that included the option of an extension to 2025. The forward came close to leaving the club last January — Wolves and Nottingham Forest wanted to sign him permanently, and Chelsea submitted a loan offer.\nBournemouth have a few players whose deals will expire at the end of the season. Of that group, Christie, who has featured prominently this season under new coach Andoni Iraola, seems the most likely to stick around. Other players whose contracts run out in June are Darren Randolph, Ryan Fredericks, Emiliano Marcondes and Adam Smith.\nHughes joined Crystal Palace for £6million in the summer of 2021 and finds himself entering the final few months of the contract he signed upon arrival from Watford. His team-mates Joel Ward, Nathan Ferguson, Jairo Riedewald, James Tomkins and Remi Matthews are also set to become free agents when this season comes to a close.\nThe former Tottenham and England midfielder is yet to feature for Everton this season, after spending the previous one out on loan at Turkish club Besiktas. Any future contract extension will likely depend on how often Dele features during the latter half of the season.\nGoalkeepers often spend the final part of their career as the third-choice at a club, providing intangible contributions for others. Adrian falls into that bracket. “I know the situation and my role in the squad,” he said during an interview with The Athletic in June. He is firmly behind Alisson and Caoimhin Kelleher at Liverpool and his contract situation is assessed on a year-to-year basis at the end of each season.\nAdvertisement\nNorthern Ireland’s fourth-most capped player originally signed a short-term contract back at Manchester United before the deal was extended for the duration of the current season on deadline day last September. The 35-year-old defender has made 12 appearances in the Premier League and two in the Champions League.\nHaving started all but three games for Burnley this season following their return to the Premier League under Vincent Kompany, it would seem likely that the club will activate the option to extend Brownhill’s contract by an additional year. Jay Rodriguez, Jack Cork and Charlie Taylor are also set to be out of contract, while Johann Berg Gudmundsson has an additional one-year option.\nWest Ham are in negotiations with Coufal to keep him around beyond the summer. Aaron Cresswell and Angelo Ogbonna are also set to be out of contract, but the club are unlikely to offer them new deals.\nThe loan agreement Forest had in place for Wood was made permanent for £15million because of a clause in the agreement with his previous club Newcastle. Eighteen months later, the striker finds himself out of contract soon, alongside Ethan Horvath, Cheikhou Kouyate, Ola Aina, Wayne Hennessey, Willy Boly, Scott McKenna and Harry Arter.\nGO DEEPER\nDavid Ornstein's January transfer window guide: The plans for the Premier League's top teams\nLa Liga\nA staple of Real Madrid’s dynastic run in the Champions League that yielded five trophies between 2014-22, Modric does not have much left to accomplish at club level. Croatia’s record cap holder is out of contract soon, turns 39 early next season and received offers from clubs in Saudi Arabia last year.\nModric’s long-time Madrid midfield partner finds himself in a similar position, but there is an interesting difference between the two players in terms of their contracts. When Madrid gave Kroos a new deal last summer, they wanted to sign him until 2025. But the 2014 World Cup winner, who’ll turn 34 this week, opted to sign just a one-year contract instead.\nIn April 2022, Ramos said he wanted to play at the top level for another “four or five years”. Basic maths tell us the former Real Madrid defensive stalwart, who is now back at his first pro club Sevilla, is intent on extending his career until 2026 at the earliest, which suggests retirement is not on the cards in June.\nAdvertisement\nAtletico Madrid are the only club Koke has ever played for. The midfielder, who turns 32 in a week, still features regularly for Diego Simeone’s side, which would suggest he may be set to continue his career in Spain’s capital.\nSerie A\nGiroud is still making meaningful contributions at AC Milan, having scored eight goals to go along with five assists in Serie A. The now 37-year-old signed a new contract in April that runs to the end of this season. Given that he is still in good form, he will not be short of suitors in a few months.\nAdrien Rabiot\nManchester United have tried to sign Rabiot twice in the past two years. Last summer, he chose to remain at Juventus for another season instead. The terms of that agreement will see the France midfielder again become a free agent in June.\nLeonardo Spinazzola\nAn Achilles injury during Italy’s triumphant European Championship finals campaign in summer 2021 derailed Spinazzola’s climb towards becoming a household name across the continent. Since his recovery, the Roma full-back has continued to deliver under coach Jose Mourinho and was part of their side that won the first Europa Conference League in 2022.\nAlexis Sanchez\nSanchez left Manchester United for Inter Milan, initially on a season’s loan, stayed two more years, left for Marseille, then rejoined Inter 12 months later last summer. With just two goals, both of which came in the Champions League, and zero assists in 13 overall appearances at age 35, his value to Simone Inzaghi’s team appears to be declining.\nLigue 1\nWhen Mbappe signed a new deal with Paris Saint-Germain in 2022, it was for two years with the option of an additional one. Usually, it is the club who decides whether or not to extend an agreement. But in this case, Mbappe has the final say. That contract is set to expire at the end of this season and he is yet to announce if he will activate the option to stay in Paris for an extra year.\nKeylor Navas\nNavas left PSG on loan last January in search of first-team football but after that spell with Nottingham Forest now finds himself back on the bench in Paris, and without any first-team appearances so far this season. A move away would seem probable, given that he is now 37 years old and Gianluigi Donnarumma, 24, is unlikely to be displaced as the club’s undisputed starter.\nAdvertisement\nBundesliga\nMarco Reus\nHaving spent more than a decade of his career at Borussia Dortmund, a logical assumption would be that Reus would be more interested in staying put rather than playing elsewhere. For now, there is no official word about where the midfielder, who turns 35 in May, will play next season, if at all.\nHummels’ next move has not yet been decided either but his age does not appear to be limiting his opportunities. The now 35-year-old continues to feature regularly for Dortmund and he was also named in new coach Julian Nagelsmann’s first Germany squad this past October.\nWhich other players will soon be free agents?\n- Angel Di Maria (Forward) — Benfica\n- Jamie Vardy (Forward) — Leicester City\n- Piotr Zielinski (Midfielder) — Napoli\n- Mario Hermoso (Defender) — Atletico Madrid\n- Guido Rodriguez (Midfielder) — Real Betis\n- Daichi Kamada (Midfielder) — Lazio\n- Rafa Silva (Forward) — Benfica\n- Gabriel Barbosa (Forward) — Flamengo\n- Tiago Djalo (Defender) — Lille\n- Alex Meret (Goalkeeper) — Napoli\n- Leandro Barreiro (Midfielder) — Mainz\n- Wilfred Ndidi (Midfielder) — Leicester City\n- Pablo Fornals (Midfielder) — West Ham United\n- Lloyd Kelly (Defender) — Bournemouth\n- Kelechi Iheanacho (Forward) — Leicester City\n- Che Adams (Forward) — Southampton\n- Kenny Tete (Defender) — Fulham\n(Top photos: Getty Images)",
  "word_count": 2869,
  "scraped_at": "2026-02-14T01:51:13.757780",
  "_text_extracted": true
}