{
  "article_id": "08abf196acb8",
  "url": "https://www.illawarramercury.com.au/story/8808135/how-the-national-second-tier-will-affect-the-wollongong-wolves/?cs=2568",
  "title": "How the National Second Tier will affect the Wollongong Wolves | Illawarra Mercury",
  "date": "20241101T013000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was a sense of relief on Thursday when Football Australia finally confirmed the details of their new National Second Tier competition, which will of course feature the Wollongong Wolves.\nSubscribe now for unlimited access.\nor signup to continue reading\nIn a journey that has felt like a lifetime, FA made the public announcement that the new NST - set to act as the league directly below the top tier A-League - would commence in October 2025.\nThe response on the announcement was vastly positive in the fact that the competition has actually be confirmed to be up-and-running. However, considering that the new venture was slated to begin in 2023, then 2024, and finally in 2025 in a completely different format, there was some understandable disappointment.\nThe format\nOne of the main criticisms of FA is the decision to start the NST in the 'Champions League' style format between October and December. 16 teams will compete in a group stage, with knockouts and a final to follow.\nIf anything, this format is just a glorification of the old post-season National Premier League finals series, where the best teams in each state would battle for the NPL national title, which of course the Wolves won in 2019.\nWhen the NST was in the planning stages, the Association of Australian Football Clubs - the governing body behind the original concept - where gunning for a home-and-away season.\nThe Wolves were announced as one of the NST's foundation clubs in November 2023 alongside APIA Leichhardt, Avondale, Marconi, Preston Lions, South Melbourne, Sydney Olympic, and Sydney United.\nWhen this was confirmed, FA made it public that they would want to add at least two (but ideally four) more teams to incorporate a full home-and-away season. This didn't eventuate, causing a rift between FA and the eight foundation clubs.\nAlong the way, the Wolves have always been ready to go when called upon, despite the numerous hurdles along the way.\nDue to FA being unable to secure enough teams for the proposed format, they were forced to adapt, culminating in the two month 'Champions League' tournament which was announced on Thursday.\nWhilst the overriding positive out of the announcement was the confirmation that the competition will actually be happening, this format is hardly what the clubs, as well as the fans were calling out for originally.\nThe idea of the new league is to eventually incorporate promotion and relegation between the A-League and the NST. Even the most radical of Australian football fan knows that this would not be possible in the first season of the move, but the 'Champions League' style model is hardly a reflection of a league to compete with the A-League, rather, a glorified NPL competition.\nBut, the move may save foundation NST clubs from the potential financial strain that would have come with a home-and-away season. FA are essentially dipping the toe in so to speak, with the long term goal of building a season to mirror the A-League.\n\"Further updates will be provided as the NST continues to evolve, noting it remains a key strategic objective to establish a standalone NST home and away league competition as soon as the minimum threshold is secured,\" FA's statement read.\nHow this has (and will) affect the Wolves\nFoundation NST clubs have been doing it tough through all the turmoil of getting the competition up-and-running, the Wolves included.\nThe Wolves made the official commitment to join the NST back in 2022, and a lot has happened along the way.\nFormer chief executive Strebre Delovski - who now acts on the board of Football NSW - led the way to ensuring the Wolves would be ready when they returned to the national stage.\nAfter stepping down from the part time role in April, the Wolves appointed a full-time general manager in Mark Upton to lead them into the NST. But due to FA's delay in getting the NST up and running, the Wolves were forced to make the tough call to let Upton go from the role.\nThe addition of the NST will also be incredibly taxing on the playing group. For example, the Wolves will compete in a 30-round NPL competition (plus finals, should they make it). From there, they will play for a further two months in the NST, with a squad of 16-20 players.\nConsidering the Wolves start their pre-season training in November and December, it could potentially be a gruelling 12-month season for them.\nOverall, the confirmation of the NST is a positive for not only the Wolves, but Australian football. But football die-hards will just have to be even more patient before we see a truly successful football pyramid system as seen with such success overseas.\nAnd if you think it's going to be smooth sailing from here, you'd be dead wrong. But Australian football fans aren't used to anything else.",
  "word_count": 813,
  "scraped_at": "2026-02-14T02:11:06.617704",
  "_text_extracted": true
}