{
  "article_id": "08b42390b015",
  "url": "https://thepeoplesperson.com/2025/04/28/i-worry-about-paul-scholes-voices-major-concern-over-matheus-cunhas-move-to-man-united-293409/",
  "title": "  I worry about ...: Paul Scholes voices major concern over Matheus Cunha move to Man United - Man United News And Transfer News",
  "date": "20250429T000000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United has dropped a cautionary note about the transfer of Wolverhampton Wanderers forward Matheus Cunha to Old Trafford.\nCunha has enjoyed an outstanding season and has been a pivotal figure in Wolverhampton Wanderers’ successful battle against relegation, after a period when their drop to the Championship seemed almost certain. In 29 Premier League appearances, the Brazilian has notched 15 goals and six assists.\nUnited are among the clubs eyeing Cunha and it’s believed a deal is on the brink of getting over the line. Last week, Fabrizio Romano confirmed that Ruben Amorim’s side are leading the race to land Cunha and want to strike an agreement very quickly.\nDavid Ornstein of The Athletic later revealed that United do not need sales or Champions League football to sign Cunha as funds are already in place to bring him.\nIt was claimed that the Red Devils are keen on utilising Cunha in one of the number 10 roles behind the striker but Scholes has questioned whether the 25-year-old will flourish in that role.\nIn his first exclusive column with TNT Sports, Scholes noted, “He looks like he’s got the attributes that Ruben Amorim wants. He knows that physically, his team are just not strong or quick enough, so Matheus Cunha is obviously athletic, and he’s got quality with 15 league goals this season.”\n“I just worry for any signing coming to Manchester United at the minute. It just feels like it’s such a bad place to go. The quality of play right now is so poor.”\n“And with Cunha, is he a centre-forward or is he a wide player? There’s no doubt that he has quality and of course, it would be nice to sign him, but I worry about where he fits in. You can sign the best three players in the world, and I think they’ll struggle coming into this team at the minute, but they’ve got to start somewhere.”\nUnited have endured a trainwreck of a season but there is a chance to still win silverware by lifting the Europa League.\nWinning the Europa League would also secure United a slot in next season’s Champions League. However, according to Scholes, the Europa League will not save United or take away from what has been a “disastrous” past few months.\n“Man Utd have been a disaster in the Premier League this year. It’s been really difficult to watch and again it was difficult once more against Bournemouth. The Europa League has given them a little bit of life. Winning it will not save their season because the Premier League is your bread and butter and that’s where you’ll be judged, and I think Amorim knows that.”\n“There’s a bit of light at the end of the tunnel with the Europa League for the fans especially. They’ve got a tough game against Athletic Club as they’re one of the better teams left in the competition. I think being at home in the second leg helps them.”\n“If they were away in the second leg, I think they’d really struggle to get through, but if they can go over there and get a result, then the crowd at Old Trafford in that second leg can really get you through.”\nWhile Scholes advised against declaring United the favourites, he conceded that they possess as good a chance as any team to go all the way.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 568,
  "scraped_at": "2026-02-14T01:58:31.693871",
  "_text_extracted": true
}