{
  "article_id": "08c98a32720e",
  "url": "https://www.caughtoffside.com/2024/12/12/collymore-column-spurs-nuno-plaudits/",
  "title": "Collymore column : Spurs need a solid defence , Nuno deserves plaudits and much more",
  "date": "20241212T103000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In his exclusive column for CaughtOffside, former Aston Villa attacker Stan Collymore discusses some of football’s biggest talking points, including why Tottenham won’t win anything without a solid defence, why Nuno Espirito Santo deserves the plaudits, why Enzo Maresca is the right man at the right time for Chelsea and much more.\n—\nTottenham won’t win anything without a solid defence\nI’ve got a soft spot for Ange Postecoglou and for anybody that wants to play football on the front foot, attacking, creating chances, scoring goals… because that’s the type of player that I was.\nHe’s managed in Japan, he’s managed in Scotland, however, the Premier League is unforgiving. You can’t win a title in the English top-flight without having a real cast-iron defence.\nLeicester proved you can do it without scoring bucket loads of goals, but it’s telling that only the bottom three in the Premier League have a worse goal difference than Spurs at the moment.\nA couple of weeks ago, Tottenham were the highest scorers in the division, so there’s something structurally, fundamentally wrong at the club. This isn’t just a blip.\nThis is a team that can score goals and create chances, but whatever they do, they can’t keep it out at the other end.\nI think it’s gross naivety, and the last time a team played like this was in the late 90s when I was playing; Kevin Keegan’s Newcastle.\nLike Ange, Keegan was very much like “this is the way I play,” but of course they missed out on the title despite being miles ahead of Man United at one stage.\nFergie’s United side created chances and scored goals but crucially kept plenty of clean sheets, so for me, it’s really simple.\nAnge Postecoglou is going to keep his job, and he’s going to go on and be a successful manager. Then he has to learn that English football isn’t about defending on the halfway line, letting teams play the ball in behind and conceding.\nThe ‘they’ll score three but we’ll score four’ way of playing is all well and good in the lovely days of August, September and October when everybody’s flying, everybody’s fit, everybody’s healthy, but when you start to take international breaks, FA Cup ties, League Cup ties, European commitments, injuries, suspensions and poor form into account, Spurs are not going to get away with it.\nThe other question is whether this is a club that is it fit for purpose to win trophies? The answer is no, and that’s down to Daniel Levy. I think, until he goes, there won’t be a change of mentality.\nNuno deserves plaudits for superb Forest win at Old Trafford\nWhat a fantastic result for Nottingham Forest at Old Trafford, coming almost 30 years to the day since their last win, a game in which I scored.\nNuno Espírito Santo deserves the plaudits for masterminding the victory, coming not long after taking all three points at Anfield.\nDon’t forget that the narrative around the manager was that he wasn’t good enough. Bombed out of Spurs, a move to Saudi meant he was out of sight and therefore out of mind, but with players like Morgan Gibbs-White, Callum Hudson-Odoi and Chris Woods in situ, he has players who can score goals and help bring his attacking philosophy into play.\nWhat’s more, they defend well too, doggedly getting bodies behind the ball like Nuno did when at Wolves. Probably unfairly, he got tagged as that job being an old pals act with agent, Jorge Mendes, also being Portuguese and making use of his black book to help build the team.\nThat took away from the fact that they were actually a very good team. Defending deep and playing on the counter attack, which became Nuno’s hallmark at Wolves, is perfect for Forest, because they’ve got a number of players that are very good at quickly getting into the opponent’s half.\nWhat would success look like for them at the end of this season? I think you’re looking at a very congested top half of the table, which they’ll do very well to get into, and that’s not being disrespectful.\nTo put into context how far they’ve come under Nuno, as an opposition manager you’d shake hands before kick-off for a point now at the City Ground.\nFrom Ruben Amorim’s perspective after that defeat, it goes back to what I said in this column a couple of weeks ago: Everybody’s up for sale.\nMarcus Rashford just needs to move on, and if you look at players to build around, there’s nobody in a Manchester United shirt that Amorim could rely upon to be a nine out of 10 every week. No one duking it out over six or seven games to get United into a title race.\nThere’s nobody there that sticks out as a top tier player and I would say 90% of that squad you could sell, but they’re not going to play for better or bigger clubs than Manchester United – which kind of tells you how poor their squad really is at this point.\nEnzo Maresca ’s brilliance has focus back on Chelsea’s football\nEnzo Maresca is a fascinating one really.\nHe keeps saying Chelsea are not in a title race when they obviously are, and they’re playing lovely front foot, attacking, attractive football with Cole Palmer at the heart of it.\nIt’s worth recalling a column I did back in January 2023 when I basically agreed with Mykailo Mudryk that Chelsea were a better project than Arsenal. It’s hard to argue against it at this point, when you consider what Maresca has achieved in such a short space of time compared to Mikel Arteta’s tenure.\nAll of the players that were expected to come in and do bits for them are now doing bits for them. Bar Nicolas Jackson, who I think there’s plenty more to come from, everybody’s chipping in and creating chances.\nThe Blues have lots of young players that are hoping to develop over a number of years, and if the key performance indicators are that something’s not working well enough, the club will go and buy someone more experienced.\nChelsea are a rich club like Manchester City, but to the younger generation, they’re a big club with the rich part being very much secondary.\nMaresca has got them playing with freedom and a shape that you can see what he’s trying to do. They do like to go and press, but they’re not obsessed with pressing so much that they’re defending at the halfway line every two minutes – like Spurs.\nThey can sit with a mid block, they can sit and defend when under the cosh if necessary and, though I don’t think they’ve quite got it completely right yet, in Cole Palmer they’ve got one of the players of the season so far.\nPalmer is now really starting to understand the role of a No.10 in that he’s not just looking to drive at people and take people on, he’s looking to pass it and just stay where he is, or to make his runs at clever times.\nMaresca has basically got a cohesive unit, and I think that where he’s succeeded – and where Poch, Lampard and Potter failed – is that we’re no longer talking about the more than a billion pounds that’s been spent recently by the club.\nNow when you see Chelsea, you think ‘excellent, young side.’\nSaka shines for Arsenal but City woeful again\nAside from Manchester City, another excellent Champions League week for English clubs.\nJhon Duran will be knocking on Unai Emery’s door again after a fabulous performance from the Aston Villa sub. How long is it before he starts to get a little bit vocal in his need to start games?\nOllie Watkins could do with a little bit of a break from time to time, and the manager knows that when Duran comes on he invariably scores.\nThere’s always another gear that Villa can go to, and that’s proving to be the case for Liverpool for whom it was business as usual this week.\nI think that for Liverpool now, it’s a case of managing expectations. Everybody thinks they’re going to walk the Premier League and they’re possibly one of the favourites to win the Champions League.\nBut every team has a down spell during a season, so although they came away with another very good, solid performance and got the points to top the table, Arne Slot needs to start managing minutes with a busy winter period ahead.\nMan City losing at Juventus… I don’t think it’s the greatest Juventus team ever, but in terms of City’s form recently, it’s hardly a surprise, and they’re actually a point off total elimination from the Champions League.\nIt would be something quite spectacular if they weren’t to go through.\nArsenal are obviously getting goals and they’ve been criticised this season about them mostly coming from set pieces, so for Bukayo Saka to score from open play, it’ll keep the knockers at bay.\nI think he’s the sort of wide man now playing either left or right of the three who gets in the box a lot, therefore there’s no reason why he shouldn’t be getting 20+ goals a season and that’s what he’ll be judged on.",
  "word_count": 1557,
  "scraped_at": "2026-02-14T01:52:10.158248",
  "_text_extracted": true
}