{
  "article_id": "08e410486736",
  "url": "https://www.teamtalk.com/news/manchester-united-e200m-bid-jude-bellingham-real-madrid",
  "title": "Real Madrid transfer news : Man Utd  prepared to pay €200m  for the next Zidane and make him  their franchise player  ",
  "date": "20251226T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd ‘prepared to pay Real Madrid €200m’ for the next Zidane and make him ‘their franchise player’ – report\nManchester United are ready to make a massive bid to bring Real Madrid midfielder Jude Bellingham to Old Trafford, according to an outlandish and fanciful Spanish report, which has also revealed Los Blancos’ stance on selling the England international to the Red Devils.\nBellingham’s future at Real Madrid has (surprisingly?) been the subject of speculation in some sections of the Spanish press. Earlier this month, a speculative report claimed that Liverpool are keen on a 2026 deal for Bellingham, who has not been at his best for Madrid this season and is still adjusting to his role in manager Xabi Alonso’s system.\nThen it was the turn of Man Utd to be linked with Bellingham, with E-Noticies, a Catalan news outlet, reporting on December 12 that the Red Devils are ‘preparing a €150million (£131.7m, $176m) offer’.\nOKDiario has now got in on the act, with journalist Miguel Serrano reporting that Man Utd are ready to make a huge offer to Madrid and Bellingham to complete a 2026 transfer deal.\nMan Utd ‘are prepared to pay Real Madrid €200million (£174.5m, $235.5m) for Bellingham’, according to the report.\nThe Red Devils reportedly want Bellingham to be ‘their franchise player starting next season’.\nNot only are Man Utd ready to shatter their club-record transfer fee for the 22-year-old England international, but the Premier League side are also said to be willing to offer Bellingham ‘a six-year contract worth €15million (£13.1m, $17.7m) net per season’.\nBellingham has been on the books of Madrid since the summer of 2023 and is under contract at the Spanish and European giants until 2029.\nThe 22-year-old has made 120 appearances for Madrid so far in his career, scoring 43 goals and providing 32 assists in the process.\nBellingham has won LaLiga and the Champions League once each with Madrid.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nReal Madrid stance on selling Jude Bellingham to Man Utd\nOKDiario is not one of the most reliable sources, so one needs to take this report about Man Utd and Bellingham with a big pinch of salt.\nOne needs to ask how such massive news is not being reported in major Real Madrid-leaning Spanish publications, such as Marca and AS.\nNo credible media outlets in England have reported the story either, so we need to wait for other publications to back this claim before reading too much into it.\nIt would be remiss to think that Man Utd would not love to have Bellingham in their team, especially as the Red Devils were keen on him when he was a teenager.\nIn the summer of 2020, Man Utd tried to convince Bellingham to move to Old Trafford before he left Birmingham City for Borussia Dortmund, as reported by Sky Sports at the time, but the youngster did not want to wait to play regular first-team football.\nSources have told TEAMtalk that Man Utd are keen on signing a new midfielder in 2026, as manager Ruben Amorim aims to continue the rebuilding of the team.\nBellingham does not feature on the list, especially as Madrid have no plans whatsoever to sever ties with a midfielder who has been compared to the great Zinedine Zidane by Los Blancos legend Cristiano Ronaldo.\nIn February 2025, Ronaldo said about Bellingham on La Sexta during an interview with Edu Aguirre, as relayed by talkSPORT: “I think he also has a spectacular future. He will help Real Madrid a lot.\n“He has a long way to go. He reminds me a lot of Zidane. He has a big future.\n“Zidane was amazing, a beautiful player, but Bellingham is 21 years old.\n“He’s got his whole future ahead of him. He will give a lot to Madrid, because the boy, I think he will be extraordinary.”\nFormer Madrid manager Carlo Ancelotti, too, has previously compared Bellingham to France and Los Blancos great Zidane, saying: “There are things about the way he plays that remind me of Zidane, it’s his extraordinary quality on the ball.”\nIt would be a massive shock if Madrid sell Bellingham, and, according to OKDiario, the Spanish and European giants are not planning to.\nBellingham has ‘no intention’ of leaving Madrid anytime soon, and Los Blancos do not want to sell him either.\nEven if Man Utd ‘formalise their €200million offer’ for Bellingham, Madrid ‘will not accept it’, according to the report.\nLatest Real Madrid transfer news: Liverpool raid, midfielder tipped for move\nMeanwhile, a Spanish report has claimed that Real Madrid manager Xabi Alonso wants to sign two players from Liverpool, but Los Blancos have already decided against signing one of them.\nA Portuguese star has been backed to join Real Madrid next summer, despite Manchester United holding talks over a January transfer deal.\nAnd finally, the Real Madrid media has raved about Los Blancos’ decision on Nico Paz, who is flourishing at Como at the moment.",
  "word_count": 850,
  "scraped_at": "2026-02-14T01:59:31.512785",
  "_text_extracted": true
}