{
  "article_id": "08f4e8170826",
  "url": "http://thepeninsulaqatar.com/article/26/11/2024/al-sadd-relish-tough-al-hilal-challenge-eye-win",
  "title": "Al Sadd relish  tough  Al Hilal challenge , eye win",
  "date": "20241126T163000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAl Sadd's Hassan Al Haydos (left) with Boualem Khoukhi during a training session.\nDoha, Qatar: Al Sadd head coach Felix Sanchez said yesterday that the AFC Champions League Elite match against Saudi Arabian heavyweights Al Hilal will be challenging. The matchday-five encounter, set to take place at Al Sadd’s home turf at sold-out Jassim Bin Hamad Stadium, will see the Qatar football giants aiming to tackle the visitors in their toughest clash in the League so far.\nSpeaking at a pre-match press conference yesterday, Sanchez said playing in front of the home fans will be a morale booster for his players when they take on the high-flying Al Hilal side.\n“We will face Al Hilal, third in the standings, in a difficult match. Playing at home and in front of our fans motivates us to give our best. We’ll approach this game with full strength,” Sanchez said.\nAl Sadd are currently sitting on fourth spot with eight points in the 12-team West Zone standings of the Asian league. On the other hand, Al Hilal, the champions of the Saudi Pro League, currently have 12 points.\nSanchez said that high-stakes matches against teams of Al Hilal’s caliber will help Al Sadd’s growth.\n“These are the kind of games we look forward to. The players are excited and ready to perform. We are aiming for a win in this difficult match,” Sanchez said.\nAl Hilal will be without star Ruben Neves, while Neymar and Malcom will be doubtful, but Sanchez dismissed concerns over their absences.\n“Every team faces absences. We are focusing on our strengths and readiness to deliver a top performance,” the Spaniard said.\nAl Sadd defender Boualem Khoukhi stated the team is optimistic despite Al Hilal’s strengths.\n“Al Hilal is a formidable team, but we’re focused and determined to secure the three points. I hope our fans will be there to support us,” the Qatar international said.\n“We’ve prepared well and understand the importance of this match. The recent league win has given us great motivation,” Boualem added, referring to the team’s recent 5-2 win over Al Khor in QSL.\nAl Hilal coach Jorge Jesus said his team is ready despite the lack of time to prepare for the encounter.\n“Our team started preparing for the match directly after our match in the Saudi League, and there was not enough time between matches, only two days including travel. However, we will face Al Sadd the same way we are accustomed to. We trust in the players and their abilities and capabilities and we naturally seek to win,” Jesus said.\n“We are trying to benefit from the best conditions available to us. I do not want to repeat that the time available for preparation is not enough, but we are ready,” Jesus added.\nThe match kicks off at 7:00pm.\nThe top eight teams from each zone will progress to the Round of 16, with knockout stages beginning in Saudi Arabia in April 2025.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 560,
  "scraped_at": "2026-02-14T02:18:02.447441",
  "_text_extracted": true
}