{
  "article_id": "08fcb1e253df",
  "url": "https://impactnottingham.com/2023/05/womens-world-cup-is-englands-dream-over-before-its-even-begun/",
  "title": "Women World Cup : Is England Dream Over Before It Even Begun ? ",
  "date": "20230503T153000Z",
  "domain": "impactnottingham.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Olivia Hughes\nAs it nears a year since England’s first major tournament victory post 1966, the present is perhaps bittersweet for close followers of women’s football. Though the pre-tournament buzz may be setting in, with club football coming to its climax, England stars have been hit with several injury blows. Impact’s Olivia Hughes reports about the reality check of the upcoming challenge.\nIt was a sunny day at Manchester United’s Leigh Sports Village Ground on April 19th when disaster struck the England Women’s team. During Arsenal’s crucial match against United in the race to become WSL champions, Gunners vice-captain and England skipper Leah Williamson was struck down in the eleventh minute. It initially looked like a dislocated knee, but later proved in fact to be an ACL injury that would rule her out of club and country football for 12 months.\nWomen are two to eight times more likely to experience an ACL injury than men\nRecent research has shown that women are two to eight times more likely to experience an ACL injury than men. For the England squad, this is not an unfamiliar issue. Euros golden boot winner Beth Mead is currently sidelined with the same injury. More recently England’s favoured right back, Lucy Bronze, underwent keyhole surgery on her knee after coming off in her Champions League game against Chelsea for Barcelona on the 22nd of April. Bronze, though, should only miss a couple of weeks of action.\nIt would be hard not to mention the impact caused by the loss of star attacking midfielder Fran Kirby who has suffered countless injuries in her career and is currently out indefinitely. It is unlikely that she will be returning to the squad this season.\nThe big question for England’s Manager Sarina Wiegman is who will replace Williamson as captain. Among fans, it currently stands that the obvious choice is Millie Bright who has captained the England Squad before, but Bright has not played a match in around a month after picking up an injury with Chelsea. Bronze is another shoe in to lead the group, but again it is unclear whether she will be fit enough in time. Alex Greenwood is perhaps the next suitable choice. However, she also didn’t play in England’s recent international games due to injury.\nThis is not to say the squad is not strong without its injured players. Younger players have demonstrated immense talent and have proven to be real assets to recent international games. The standout here is Lauren James, who has slotted into the team seamlessly since her debut in September 2022. But whether the young stars are up to the challenge of international giants including host country Australia with the sensational Sam Kerr is up for debate.\nPerhaps these continual losses, whether to retirement or injury, are showing in performances\nWiegman has not just lost key players due to injury with legacy players such as Jill Scott and Ellen White retiring after the Euros. Perhaps these continual losses, whether to retirement or injury, are showing in performances as England lost for the first time since Wiegman took over as manager against Australia in a recent friendly.\nWorld Sport Network currently predict the USWNT (who have won the previous four World Cups) to win the competition with England’s squad a close second favourite. Regardless of injury, the England squad will have an exciting summer in Australia, and it should be a fantastic tournament for viewers across the world to take in.\nThe Women’s World Cup will run from July 20th to August 20th.\nOlivia Hughes\nFeatured image courtesy of David Pickup via Pexels. Image use license found here. No changes were made to this image.\nIn article image 1 courtesy of @leahwilliamsonn via Instagram. No changes were made to this image.\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @ImpactSport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 687,
  "scraped_at": "2026-02-14T02:00:20.002277",
  "_text_extracted": true
}