{
  "article_id": "0955228489ff",
  "url": "https://www.teamtalk.com/chelsea/pochettino-sack-assessing-candidates-who-could-replace-under-fire-chelsea-boss",
  "title": "Pochettino sack : Assessing the eight candidates who could replace the under - fire Chelsea boss",
  "date": "20240228T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nPochettino sack: Assessing the eight candidates who could replace the under-fire Chelsea boss\nMauricio Pochettino is feeling the heat at Chelsea right now and we have assessed the eight candidates who could replace the Argentine boss.\nIt’s fair to say that Pochettino’s tenure as Chelsea boss so far hasn’t gone to plan. The club find themselves languishing in midtable and as of writing, they are a whopping 17 points adrift of the top four.\nDespite their struggles in the league, the club did have the golden opportunity to lift some silverware, but they ultimately came up short against Liverpool in the EFL Cup final.\nTEAMtalk sources have indicated that Chelsea have been exploring alternatives to the Argentine boss as the frustrations at the club continue to grow.\nWe’ve taken a closer look at eight realistic candidates who could replace Pochettino in the Chelsea hot-seat.\nRuben Amorim\nThe Portuguese boss has previously spoken to Chelsea and it wouldn’t be much of a surprise to see the club resurface their interest.\nGiven the 39-year-old’s stellar work with Sporting, he has also attracted interest from the likes of Liverpool and Newcastle.\nDespite being the youngest candidate on this list, Amorim does have a decent amount of experience behind him. He’s taken charge of over 200 games throughout his managerial career and he’s won five trophies in that time.\nAccording to David Ornstein, Amorim has a €10m release clause in his contract with Sporting which will be of interest to Chelsea. The Portuguese coach is under contract until 2026 and clubs will need to trigger his release clause to get him out of Portugal.\nRoberto De Zerbi\nThe Italian coach has garnered an excellent reputation with Brighton and he continues to be linked with some of the biggest vacancies around Europe.\nOf course, Chelsea will be wary of what went wrong the last time they hired a manager from Brighton as Graham Potter struggled to make the adaptation.\nWith that being said, De Zerbi’s credentials are hard to ignore. The 44-year-old has guided Brighton to the Europa League and he’s got them playing some eye-catching football in the process.\nGiven the youthful nature of Chelsea’s squad, the club will be keen to hire a manager who has a track record with developing young talents. There’s no denying that De Zerbi would tick a lot of boxes.\nSimone Inzaghi\nInzaghi is another name that has been linked with the Chelsea job of late. The 47-year-old has done a tremendous job with Inter Milan and plenty of European powerhouses are taking note of his progress.\nAfter guiding Inter to the Champions League final last season, he now has them sitting top of Serie A. Inzaghi’s side have been a great watch this season and it’s no wonder that Chelsea have been keeping tabs on him.\nOnly Bayern Munich have scored more goals than Inter across Europe’s top five leagues this season. That’s the sort of attacking prowess that Chelsea are in dire need of right now.\nAlong with Chelsea, the likes of Barcelona, Liverpool and Man Utd have also been sniffing around Inzaghi. Watch this space.\nJose Mourinho\nCould a third stint at the club be on the cards for Mourinho? The Special One now finds himself out of work, having recently parted company with Roma.\nMourinho has expressed his desire to get back into management as soon as possible and a return to Stamford Bridge can’t be completely ruled out.\nThe Portuguese boss won eight trophies during his two stints with Chelsea, including three league titles. He may no longer be at the very peak of his powers, but a return to the Premier League could be absolutely box-office.\nThomas Frank\nWhile Brentford have had a tough time of it this season, Frank still has plenty of admirers. On the whole, the Danish boss has done a superb job at Brentford and it’s no surprise that so many sides have been keeping tabs on him.\nReports from earlier this month linked Frank with the Chelsea job and while he’s probably considered an outsider, he seems to be someone who is under consideration for the role.\nXavi\nThe Barcelona boss is set to leave the Camp Nou at the end of the season. While things have unravelled for the 44-year-old this season, he has shown some glimpses of promise during his early managerial career.\nHe guided Barcelona to an unlikely La Liga triumph last season and he has played a key role in developing some of Europe’s hottest prospects.\nEarlier this week, TEAMtalk sources revealed that a move for Xavi hasn’t been completely ruled out, although it remains to be seen if the Chelsea job would be of interest to the Spanish coach.\nHansi Flick\nWhile his time in charge of the German national team didn’t go to plan, Flick is still a highly sought-after candidate. During his 19 months as Bayern Munich boss, he managed to win seven trophies.\nThe German boss was linked with the Chelsea job last season after he was spotted in attendance at Stamford Bridge during a goalless draw with Fulham.\nThe speculation linking him to the Chelsea job has since died down, but it could resurface if the club make a snap decision on Pochettino.\nFlick is also fancied by Barcelona who see the 59-year-old as an ideal candidate to replace Xavi at the end of the season.\nMichel Sanchez\nGiven the tremendous job he’s done with Girona, it’s only natural that the Spanish coach will be linked with some of the biggest jobs around Europe.\nSince taking the Girona job in 2021, Michel’s managerial reputation has grown immensely. The 48-year-old has taken the Spanish side from the second division into title contention in just a few years.\nDespite drawing the attention of several big clubs of late, Michel has insisted that he is happy with his current contract at Girona.\n“I am a better coach thanks to this club,” Michel told reporters. “Quique Carcel [sporting director] and the club have made my work very happy, in other teams I have had more problems.\n“I have a contract and I am very comfortable. I think I will continue here. I am convinced.”",
  "word_count": 1037,
  "scraped_at": "2026-02-14T02:13:34.135664",
  "_text_extracted": true
}