{
  "article_id": "09838b809798",
  "url": "https://hudsonriverblue.com/jovan-mijatovic-to-join-nycfc/",
  "title": "NYCFC sign 18 - y - o Jovan Mijatović from Red Star Belgrade",
  "date": "20240115T191500Z",
  "domain": "hudsonriverblue.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The youth movement at New York City FC looks like it will continue into the 2024 season: The club is linked to 18-year-old striker Jovan Mijatović, who is rumored to join NYCFC on loan from Manchester City once they complete the signing of the Serbian international from FK Crvena Zvezda, better known in English as Red Star Belgrade. Both Manchester City and NYCFC are owned by the City Football Group.\nThe young striker scored nine goals in 19 appearances for Red Star Belgrade this season, and appeared in four Champions League games for the Serbian giants. In fact, his most recent appearance for the club was in their 2-3 Champions League group stage loss to Manchester City.\nThe highly-regarded prospect was linked to Juventus FC in December. Transfermarkt, the football website that's as much about vibes as factual information, considered that deal 59% done before it stalled out. They value the striker at €3 million.\nMijatović was first linked to NYCFC via a loan from Manchester City over the weekend. That rumor snapped into focus earlier today when Sky Sports reporter Gianluca Di Marzio reported it was \"on the verge\" of being completed.\nShould Mijatović join NYCFC, he will bring a ruthlessness and aggression in front of goal that the club was missing last year. The 5' 10\" striker wants the ball at his feet, and he both creates chances and jumps into goalmouth scrambles. The left-footed striker is unafraid to take his chances, but he also feeds his teammates, and provided two assists this season.\nStill, Mijatović will need to adjust to the physicality and speed of MLS defenders. And the 18-year-old will bring limited experience to a young squad that struggled last year to be clinical in front of goal and close out games when in a winning position. Should Mijatović take the field, he will likely be flanked by the 21-year-old Talles Magno on the left (assuming he doesn't leave New York City this winter), and the 20-year-old Julián Fernández on the right.\nMijatović will also be competing for minutes with Mounsef Bakrar, who took the No 9 jersey when he joined NYCFC in the summer transfer window. The 23-year-old scored four goals in 13 appearances for New York City.\n• Hannes Wolf to NYCFC: Reports\n• Talles Magno wants transfer, Bologna FC interested: Reports",
  "word_count": 388,
  "scraped_at": "2026-02-14T02:10:42.041297",
  "_text_extracted": true
}