{
  "article_id": "09b07ad3f4e7",
  "url": "https://www.arsenal.com/news/alessia-russo-signs-new-deal",
  "title": "Alessia Russo signs new deal",
  "date": "20250905T120000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We’re delighted to announce that Alessia Russo has signed a new long-term contract.\nAlessia joined us in July 2023 and has since scored 36 goals in 72 appearances for the club, helping us to win the League Cup in 2024 and the UEFA Women’s Champions League in 2025.\nNow 26, Alessia has broken her personal scoring records in each of her two seasons with Arsenal so far. She scored 16 goals in 31 appearances in her first campaign at the club, before finding the net 20 times in 41 appearances last season. Alessia’s 12 goals in 21 league appearances in the 2024/25 season saw her win the Barclays Women’s Super League Golden Boot.\nAlessia played an integral role in our historic Champions League triumph last season, scoring a decisive brace in our thrilling comeback victory over Real Madrid in the quarter-finals, before finding the net again in our 5-3 aggregate semi-final defeat of eight-time winners Lyon.\nFollowing a stellar 2024/25 campaign, Alessia was crowned Football Writers’ Association Player of the Year and was named in both the PFA and the UEFA Champions League Teams of the Year. She has also been nominated for the 2025 Ballon d’Or.\nAt international level, Alessia played a key role in England’s successive UEFA Women’s European Championship title wins in 2022 and 2025, as well as the Lionesses' run to the FIFA Women’s World Cup final in 2023.\n“Arsenal feels like home,” said Alessia. “This is such a special club and it has felt that way to me from the moment I joined two years ago. Playing for Arsenal is an honour and has pushed me to develop and grow as a player, and I feel empowered with this badge on my chest.\n“I’m so proud of everything we’ve achieved together as a club, with our supporters driving us forward. But I’m still so hungry for more success, and I know that’s shared by everyone here at the club. I can’t wait to get started this season, starting with this Saturday at Emirates Stadium.”\nDirector of Women’s Football Clare Wheatley added: “Alessia is one of the best strikers in world football and we’re thrilled to have agreed a new, long-term contract with her. We are all determined to bring more silverware to this club and keeping players like Alessia at the club is crucial to achieving that.\n\"I know our supporters will be delighted by this news, I join them in congratulating Alessia on her new contract.”\nHead Coach Renée Slegers added: “Alessia is a really important part of our group and I’m so pleased that she has signed a new deal here. As a striker, Alessia’s goals often take the spotlight – but she brings so much more to our group.\n\"She’s a selfless player, working so hard for the team, and she also contributes so much to our team culture. I’m looking forward to striving for more together.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 512,
  "scraped_at": "2026-02-14T02:09:24.930064",
  "_text_extracted": true
}