{
  "article_id": "09d0fcea4a1d",
  "url": "https://www.dailymail.co.uk/news/article-15190945/Starmer-claims-decision-recognise-Palestinian-state-HELPED-Trump-strike-Gaza-peace-deal-shrugs-humiliation-Egypt-signing-ceremony.html",
  "title": "Starmer claims his decision to recognise Palestinian state HELPED Trump to strike Gaza peace deal - as he shrugs off humiliation at Egypt signing ceremony",
  "date": "20251014T133000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Keir Starmer today claimed his decision to recognise a Palestinian state helped Donald Trump strike his Gaza peace deal.\nThe PM insisted he was 'proud' of the 'contribution' Britain had made as he made a statement to MPs.\nShrugging off a humiliating trip to the signing in Egypt yesterday - where he was accused of trying to grab a share of the glory - Sir Keir told the Commons the UK had been working 'behind the scenes for months'.\nHowever, he stressed that 'none of this would be possible' without the US president and it was 'his peace deal'.\nThe premier said making the agreement 'last' will be 'no less difficult' than reaching it in the first place.\nBut Kemi Badenoch complained that Labour's decisions had 'diminished' Britain's influence.\nKeir Starmer insisted he was 'proud' of the 'contribution' Britain had made as he made a statement to MPs\nAppearing in the Commons, the PM said: 'The surviving hostages are free, the bombardment of Gaza has stopped, and desperately needed aid is starting to enter as a result of the peace plan led by President Trump,' he said.\n'We have the chance, and it is a chance, to bring a terrible chapter in history, finally, to a close. It's a moment of profound relief for this House, for this nation, indeed for the whole world.\n'But it is tempered, of course, by the knowledge that for the hostages and their families, for the loved ones of those killed on October 7, and for the innocent civilians in Gaza, the dead, the bereaved, the starving, this has been two years of living hell.'\nSir Keir added: 'Mercifully, the killing and destruction has now stopped, and aid is beginning to enter Gaza.\n'But to be clear, we urgently need to see more aid and faster. All restrictions must now be lifted.\n'The need for food, sanitation, healthcare and shelter are still acute.'\nThe UK's move to recognise the state of Palestine at the UN last month - taken alongside other countries including France - was condemned by the US and Israel.\nHowever, Sir Keir argued that it had 'helped lead to' an 'historic' declaration by Arab states condemning Hamas.\nNegotiations will now follow on phase two of the deal, which involves Hamas laying down its weapons – a possibility the group is reported to have dismissed – and the rebuilding of Gaza under a 'peace board' chaired by Mr Trump and potentially including former prime minister Sir Tony Blair.\nSir Keir told MPs: 'While we celebrate the relief of peace today, making that peace last will be no less difficult a task, along with our allies, an absolute focus in the days and weeks ahead is the relentless implementation of this peace plan.\n'That is no small challenge, and so we stand ready to deploy our diplomacy and expertise in three key areas.'\nHe also called for the remains of deceased hostages to be returned to their families 'immediately'.\nThe UK will provide an additional £20 million in humanitarian aid to provide 'water, sanitation and hygiene products' to people in Gaza, Sir Keir told MPs.\nMrs Badenoch accused Sir Keir of 'taking the wrong decisions time and time again, diminishing our influence in' the Middle East.\nShe told the Commons: 'It's quite clear that UK relations with Israel have been strained by the actions of this Government.\n'Their view, and they have stated publicly, is that it looks like, under pressure from his own back benches, the Prime Minister has taken the wrong decisions time and time again, diminishing our influence in the region.'\nIgnoring cries of 'shame' from Labour MPs, Mrs Badenoch criticised the decision to restore funding to Unrwa (United Nations Relief and Works Agency for Palestine Refugees) 'within weeks of Labour coming into power'.\nShe said: 'That's an organisation whose members assisted in the kidnapping of these hostages, the release which we are celebrating today.\n'Relations with Israel have been so damaged that when Israel launched strikes against Iran, a country that has been a direct threat to us for years, the UK was out of the loop.'\nBut Sir Keir swiped back: 'I was surprised and saddened that she spent more time attacking what we actually did to help the process than even mentioning the humanitarian crisis in Gaza, without setting out in terms the number of people that have been killed, that are starving, been subjected to denial of aid, when the immediate task for any serious government is to work with allies to get that aid in at speed.\n'I would have expected at least an acknowledgement of that terrible situation. It shows, yet again, just how far her party has slid from (a) serious statesperson approach to diplomacy.\n'This is not the time for a fight about the role which any individual played.\n'I am proud of what (US special envoy to the Middle East) Steve Witkoff said about our national security adviser (Jonathan Powell). He was negotiating this, he knows absolutely the role we played, and this House should be proud that we played that role.\n'We played that role only because of the relationship that this Government has with the Trump administration. We are a trusted partner, working both before this peace deal and afterwards.'\nThe clashes came after a miserable visit to Sharm el-Sheikh for Sir Keir.\nHe and other world leaders were left kicking their heels in Sharm el-Sheikh for several hours, as the president took accolades and met freed Hamas hostages in Israel.\nOnce Mr Trump arrived, the premier then stood fidgeting mutely behind him as he delivered a long speech - during which he noted that he did not like some of the leaders present, and remarked on the 'beauty' of Italian PM Giorgia Meloni.\nAt one point Mr Trump summoned the PM of Pakistan, Shehbaz Sharif, to the podium and urged him to repeat lavish praise he had showered on the president earlier.\nKeir Starmer was invited up to the front of the stage by Donald Trump as he addressed the world's media at the Gaza summit in Egypt\nIn an awkard moment, the Prime Minister was not allowed his moment in the spotlight, as Mr Trump stepped in front and continued speaking\nSir Keir later tried to make the best of the situation by posting a photo of the moment he shook hands with Mr Trump on stage\nMr Trump ran through the countries present alphabetically, meaning that Paraguay and Norway both received shout-outs from the commander-in-chief first.\nSir Keir thought his moment had come when the president finally asked 'where is the United Kingdom'.\nHe awkwardly raised his arm and quipped, 'behind you as usual', before striding forward a few paces to shake Mr Trump's hand.\n'Where is the United Kingdom? Come here,' Mr Trump said, as a grinning PM walked up to him, seemingly ready to speak at the podium.\n'Is everything going good?' Mr Trump asked Sir Keir, who replied, 'Very good'.\n'It's very nice that you're here,' the President said.\nHowever, Sir Keir was left in limbo as rather than showing him to the podium to speak, Mr Trump merely turned his back and continued his own address.\nThe PM, lips pursed, had no other option but to trudge back to his place in the parade of leaders.\nMs Meloni, standing over Trump's right shoulder, appeared amused by the exchange.\nSir Keir later tried to make the best of the situation by posting a photo of the moment he shook hands with Mr Trump on stage.\n'President Trump, this is your achievement. I thank you for your tireless efforts to deliver this moment. The UK stands ready to support a full implementation of the peace plan,' he wrote on X.\nTories compared Sir Keir to former Chelsea football star John Terry, who changed into full kit to lift the Champions League trophy despite not playing in the final.\nHe was accused of only travelling to Egypt for a 'photo op' after risking derailing the process by recognising Palestine as a state last month.\nThe Trump administration's Middle East envoy earlier tried to cool tensions after the US ambassador to Israel branded a Cabinet minister 'delusional' for suggesting the UK played a 'key role'.\nStarmer was also challenged on Tony Blair's role on the Gaza peace board, stating it's 'for others to decide' if he forms part of Gaza's new governing.\nA peace plan floated by the White House last month listed Sir Tony as a member of the proposed board.\nMemes of Sir Keir as John Terry were circulating on social media\nSir Keir (right) met Emmanuel Macron (left) and Mahmud Abbas (centre) in Sharm el-Sheikh as they waited for Mr Trump\nSir Keir joined a queue of world leaders who waited to shake Donald Trump's hand at a Gaza peace summit\nStarmer said: 'I think the makeup of the peace board is still being discussed. For my part, I have to say, I'm much more interested in the practical steps.'\nPushed on the question about whether Blair should be involved, Starmer replied: 'That's for others to decide. Tony Blair was a great leader of our country, and would make a huge contribution.\n'But I'm not focused on which particular people sit on which particular board. I'm focused on what do we need to do tomorrow, and I mean tomorrow, to make sure this is implemented.'\nThe PM added that there are 'discussions going on' about who will be on the board - but he said he has not put himself forward.\nMr Trump arrived at the beach resort several hours late for the gathering of more than 20 world leaders.\nNo Israel or Hamas representatives were present at the signing, at which Mr Trump received Egypt's highest civilian honour, the Order of the Nile.\nLeaders filed through to shake the hand of Mr Trump, who said the 'historic agreement' answered the 'prayers of millions'.\nSir Keir was not the only leader to endure an awkward scene, with a bizarre encounter playing out between Mr Trump and Emmanuel Macron.\nMr Trump drew Mr Macron in for a warm handshake before the pair each placed an affectionate hand on the other's upper arms. The embrace soon turned into something akin to an arm wrestle as the two exchanged what seemed like intense conversation while swinging their opposite number's hand from side to side.\nMr Macron eventually freed himself from Mr Trump's grasp and hurried off the stage. However, lip reader Nicola Hickling told the Daily Mail that the handshake was more than a casual greeting.\n'Nice to see you, so you agreed?' Trump told Mr Macron, who turned from the camera and muttered an inaudible response. 'Are you being genuine?' Mr Trump asks as Mr Macron replies: 'Of course.'\nThe US President then tightens his grip on Mr Macron before shooting back: 'Okay, so now I want to know why, you hurt me. I already know.'\nMr Trump then squeezes Mr Macron's hand again as the French leader looks down and away from the cameras.\nIt's not clear what the pair were speaking about, however it comes weeks after Mr Macron was seen mocking Mr Trump with world leaders.\nThe two have a colourful history, often appearing friendly, despite occasionally criticising each other.",
  "word_count": 1888,
  "scraped_at": "2026-02-14T02:12:04.353564",
  "_text_extracted": true
}