{
  "article_id": "09d4661e96d4",
  "url": "https://www.managingmadrid.com/2024/10/14/24269934/las-blancas-news-alberto-toril-sad-about-the-result-but-happy-with-the-game-we-played",
  "title": "Alberto Toril : Sad about the result , but happy with the game we played  ",
  "date": "20241014T191500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alberto Toril spoke for Real Madrid TV after the Madrid derby last night in which Las Blancas took 1 point in a 1-1 draw against Atletico. Diario AS posted the post-match statements of the Real Madrid manager.\nToril: “Sad about the result, but happy with the game we played.”\nReal Madrid coach comments on the Madrid derby.\nToril is happy with the game. Interesting.\n“Sad about the result, but happy with the game we played, with the desire we put in, the intensity, the fact that we didn’t give up, looking for the opposing goal until the end. We had four chances to score in the final stretch, in the last few minutes, but we’re leaving with a draw.”\nThe manager also mentioned the questionable decision to whistle a penalty for Atleti. Unlike everyone else who watched the game, Toril did not see that moment. It is important to note that managers in Liga F are asked about questionable refereeing decisions more often than not, whether they were in favor of their team or of their rivals. The general answer to those questions is that the league needs VAR.\n“We have to learn; we are a very young team in some situations. It happened against Chelsea, it happened today. It’s a penalty that could have been avoided, I haven’t seen it, I do not know if it is or not, but I think that these are actions that could have been avoided and, in the end, they cost us.”\nGood football in the Madrid derby is virtually impossible. It’s never a good watch. The coach begs to differ.\n“The team is doing quite well, with good football, solidarity, they know what they have to do, but in the end, the balance of errors costs us. It is a question of growing in experience and situations that are costing us.”\nNote that neither Alberto Toril nor any Real Madrid player talks to any other media except for Real Madrid TV. The only time there’s an official press conference is after the Champions League, Supercup and Cup games.",
  "word_count": 346,
  "scraped_at": "2026-02-14T01:51:57.647271",
  "_text_extracted": true
}