{
  "article_id": "09d8140dbbab",
  "url": "https://www.teamtalk.com/chelsea/graham-potter-strong-signing-lethal-premier-league-striker-put-man-city-sword",
  "title": "Chelsea  strong  on signing lethal Premier League striker who put Man City to the sword",
  "date": "20230207T203000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nChelsea ‘strong’ on signing lethal Premier League striker who put Man City to the sword\nChelsea have identified a fearsome Premier League striker as the potential final piece of their attacking puzzle, though a move could hinge on the results of an investigation, per two sources.\nThe Blues have spent north of £550m in the last two transfer windows, though by all accounts, they’re business is far from complete.\nDespite their lengthy list of arrivals, Chelsea still lack a genuinely top class centre-forward.\nPierre-Emerick Aubameyang is aging and the writing is already on the wall over his career at Stamford Bridge.\nThe 33-year-old was recently left out of Chelsea’s Champions League squad and is being linked with a move to MLS outfit LAFC. The American window only opened on January 31 and does not close until April 24.\nElsewhere, Kai Havertz continually flatters to deceive, while Joao Felix has only been signed on loan.\nArmando Broja is currently sidelined with a long-term injury and is one for the future more than the present, as is David Datro Fofana. Romelu Lukaku is currently struggling to even start matches while out on loan at Inter Milan.\nAs such, the Blues are expected to dip back into the market for a new centre-forward over the summer. Two sources have both pointed towards Brentford’s Ivan Toney being in Chelsea’s sights.\nPotter, Chelsea “strong” on Brentford’s Toney\n“Ivan Toney is a player that Chelsea really like, and that’s from the new regime and the new recruitment team,” journalist Simon Phillips told GiveMeSport. “He’s a name that they put forward.\n“But obviously the situation with his gambling issues and what’s going to happen there, what kind of ban he’s going to get, Chelsea have to wait and see what happens.\n“But Toney is a strong candidate for a striker in the summer.”\nElsewhere, Ben Jacobs shed further light on Chelsea’s budding pursuit of Toney.\nJacobs confirmed Chelsea are highly likely to sign a new striker at season’s end and confirmed Toney is admired by Blues boss Graham Potter.\n“Chelsea are very likely to add a traditional striker in summer,” said Jacobs. “They have lots of names on their radar.\n“It’s true, Graham Potter does like Ivan Toney, but I am sure they’ll watch closely how he’s punished for alleged gambling charges before discussing further.\n“I don’t think there’s anything too concrete on Toney yet. It’s one to watch as we head towards the summer.”\nToney would represent a readymade and Premier League proven option for the Blues. At 26, he’s in the prime of his career and his 13 goals in 19 this season show he can be deadly in England’s top flight.\nTwo of those goals came in the 2-1 victory over Man City earlier this season. He also scored against Tottenham on Boxing Day and famously bullied Arsenal and Ben White in particular on opening day last season.\nHowever, there is an obvious catch in the form of an ongoing investigation into Toney.\nThe frontman has been charged by the FA with 262 alleged breaches of betting regulations. If the charges are proven, Toney could face a ban from English football that’d almost certainly scupper any summer transfer plans.\nIf cleared, GiveMeSport suggest Brentford could command around £50m for Toney in the event the likes of Chelsea come calling.\nREAD MORE: Next big Chelsea signing revealed with Blues ‘very probable’ winners of €40m transfer battle",
  "word_count": 576,
  "scraped_at": "2026-02-14T01:59:41.722528",
  "_text_extracted": true
}