{
  "article_id": "09dd655c9dd9",
  "url": "https://www.france24.com/en/live-news/20230608-city-old-boy-dzeko-caps-career-with-unexpected-champions-league-final",
  "title": "City old boy Dzeko caps career with unexpected Champions League final",
  "date": "20230608T063000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "City old boy Dzeko caps career with unexpected Champions League final\nMilan (AFP) – Edin Dzeko has the chance to crown his career with the biggest prize in football, his former club Manchester City standing in the way of a Champions League triumph which no-one would have expected when he signed for Inter Milan two years ago.\nIssued on:\nNow 37 years old and coming to the end of his time as an elite striker, Dzeko has had an Indian summer at Inter since arriving from Roma two years ago.\nHe was brought in as a cheap replacement for Romelu Lukaku after he set off on a disastrous, big-money return to Chelsea, a symbol of how financial problems had forced a club which had just won the Serie A title to downgrade.\nSeven league goals in his sixth and final season at Roma seemed to signal the end of an attacker who had risen from a traumatic childhood in war-torn Bosnia to become his country's all-time top scorer and a multiple league title winner.\nThose seasons in the Italian capital failed to yield a single trophy despite playing in a gifted series of teams which featured the likes of Mohamed Salah, Alisson Becker, Daniele De Rossi and ageing icon Francesco Totti.\nThe high point was undoubtedly reaching the semi-finals of the Champions League in 2018 after coming back from three goals down to eliminate Barcelona, a season after rattling in a club-record 39 goals.\nBut although Dzeko has not broken the 20-goal barrier since reaching the last four he is considered key by Inter coach Simone Inzaghi, the glue which holds together their attack.\n\"Edin is a great player who helps the team in both attack and defence,\" said Inzaghi in November.\n\"He adds a lot and he will continue to do so. If it were up to me I would renew his contract.\"\nDzeko has scored just five times in 2023 but could still start in Istanbul due to his ability to turn up when it matters.\nIt is why he is favourite for Simone Inzaghi's starting XI and also why he is set to extend his stay at Inter for another season despite his diminishing scoring ability and advancing years.\nRise from the rubble\nDzeko missed out on the Serie A title by two points last season but under Inzaghi added two Italian Cups and Super Cups to the three league titles he won at City and Wolfsburg, where he got his big break.\nNow he faces the biggest match of his life against the team he helped come the powerhouse it is today.\nHis equaliser against Queens Park Rangers in May 2012 set the stage for Sergio Aguero's last-gasp winner which snatched City's first league title since 1968.\nThe on-field success is a far cry from his childhood during the Bosnian War in Otoka, a area on the outskirts of Sarajevo filled with 30-storey tower blocks in view of the Serbian snipers lurking in the hills above.\nChildren in his neighbourhood would wait for gunfire in the bitter ethnic conflict to die down before they would head out to kick a ball around.\nOne day during the bloody siege of Sarajevo, Dzeko's life was saved by his mother who stopped him from going out to play with his friends -- seven of them would soon after be killed by a bomb which exploded on the pitch.\nWhen he was picked up as a boy to play in the youth ranks at Zeljeznicar, one of Bosnia's top clubs, he would have to train in a school gym as their stadium was on the frontline and ploughed with trenches.\nThat experience growing up left a big mark on Dzeko, who does humanitarian work for sick children in his home country with his wife Amra, with whom he has four children.\n\"Edin is solid, strong, stable. He's been through a lot in life and in football,\" his father Midhad said to AFP two years ago.\n\"He knew how to deal with pressure and how to cope.\"\n© 2023 AFP",
  "word_count": 679,
  "scraped_at": "2026-02-14T02:07:02.902351",
  "_text_extracted": true
}