{
  "article_id": "09e7ece97ecc",
  "url": "https://www.teamtalk.com/news/liverpool-transfer-off-alexander-isak-newcastle-owners-reach-monumental-decision",
  "title": "Alexander Isak : Liverpool transfer OFF as Newcastle owners reach MONUMENTAL decision to leave striker in tears",
  "date": "20250731T094500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alexander Isak transfer OFF for Liverpool as Newcastle owners reach MONUMENTAL decision – report\nNewcastle United are reported to have told Alexander Isak he will not be joining Liverpool or anyone else this summer, with owners PIF ‘putting the block on him leaving the club’, and Fabrizio Romano rating the chances of the deal going through as being in the Reds’ favour.\nThe Swede finds himself at the centre of intense speculation after deciding against travelling with his Newcastle teammates on their tour of Asia, with the official club line being that he is nursing a thigh injury. But after our sources confirmed that the scan has come back as ‘all clear’, and with Isak now strongly pushing to now join Liverpool, a whirlwind of transfer activity has since ensued.\nThose stories have reached fever pitch in recent days amid claims that Isak has already agreed terms on a record-breaking move to Liverpool, which will see him earn £250,000 a week over an initial five-year deal.\nAnd with Liverpool now expected to launch an official offer for his services in the coming days, it seemed Newcastle would be able to do little about seeing their star man depart after three seasons on Tyneside.\nHowever, it emerged on Wednesday that after Newcastle are now resigned to missing out on their top choice to replace Isak in Benjamin Sesko – with the striker now intent on joining Manchester United instead – it seems PIF are now ready to put their foot down over the future of their talismanic No.14.\nAccording to Givemesport, Newcastle owners, the Public Investment Fund (PIF,) have ‘put the block on him leaving the club’.\nThe report confirms that the Saudi chiefs ‘do not need the cash and don’t need to satisfy PSR requirements’, meaning that after ‘top-level talks involving boss Eddie Howe, the hierarchy has simply told the striker that he won’t be going anywhere this summer’.\nAnd in a sign of things to come, the report then states: ‘Now it remains for Howe to integrate the forward back into the ranks as quickly as he can ahead of a new season’.\nDON’T MISS ➡️ Liverpool learn Newcastle’s bottom line for Alexander Isak as Slot is told record deal WILL go through\nRomano and Plettenberg talking up Isak to Liverpool transfer\nTEAMtalk first revealed back on February 13 that Isak would be ‘very interested in a move to Anfield‘ with sources revealing at the time that it was ‘no secret that he wants to play consistent Champions League football and compete for trophies, which would be seen as an almost guarantee with Liverpool.’\nUnderstandably, Newcastle seem determined to hold Isak down to those remaining three years he has left on his contract at St James’ Park, which currently runs through to 2028.\nFurthermore, with a £150m (€171m, $200m) valuation on the striker’s head aimed at dissuading Liverpool from making a move, they do at least appear to be doing all in their power to prevent his move to Anfield.\nDespite that, reports on Wednesday claimed Isak had now ‘gone AWOL’ from Newcastle’s training ground in an attempt to force through the move and amid claims he has already agreed a huge wage package to switch to Merseyside.\nSpeaking from Seoul, ahead of Sunday’s friendly against Tottenham Hotspur, Howe also stated his wishes for the player to stay.\n“He is still our player. He’s contracted to us. We, to a degree, control what is next for him,” Howe told the media.\n“I would love to believe all possibilities are still available to us. My wish is that he stays, but that’s not in my full control.”\nAsked if they had received an official offer from Liverpool, Howe continued: “We have not received a formal offer for Alex from any club. My wish is that he stays and we see him playing again next year.”\nDespite all that, Romano rates the deal as having a 60% chance of going through.\n“For Alexander Isak, in terms of percentage for Liverpool, it’s at 60 per cent. It’s quite optimistic, but there is still work to do, 40 per cent to go before we can say Isak is going to be a Liverpool player,” the transfer guru told DAZN.\n“But Liverpool have all the intentions to go strong for this deal. Liverpool already made contact with Newcastle two weeks ago.\n“Liverpool are prepared to make a Premier League record-breaking bid for the 25-year-old, but are waiting for Newcastle to give the green light.”\nSky Germany reporter Florian Plettenberg then followed up by stating Isak has already agreed terms on a lucrative six-year deal at Anfield.\nPlettenberg wrote on X: ‘Understand: Alexander Isak has already reached a verbal agreement in principle with Liverpool over a contract running until 2031.\n‘Isak wants to make the move to LFC as early as this transfer window. The clubs are in contact. His salary at Liverpool would be similar to that of Hugo Ekitike’s.’\nLiverpool to sell four to sign Isak; Fowler excited; Trippier staying calm\nLiverpool, meanwhile, have taken their first steps towards raising the capital for Isak by offloading the first of what we believe to be four major stars at Anfield this summer to fund the move.\nAnd with Luis Diaz on Wednesday completing his transfer to Bayern Munich for the third-largest fee in Liverpool’s history, the Reds will soon move to offload a number of other costly, but ultimately unwanted stars from Arne Slot’s squad.\nIn the wake of all that, legendary Liverpool figure Robbie Fowler has dropped his verdict on what the “phenomenal” Isak would bring to Liverpool.\nHowever, in the face of the storm brewing over Isak’s future, Newcastle defender Kieran Trippier has presented a picture of calm, having expressed why he is “not panicking” over the striker’s situation and explaining why he thinks the Swede will play for the Magpies again.\nAlexander Isak transfer timeline\nFebruary 13 – TEAMtalk’s Fraser Fletcher reveals Isak would be very interested in moving to Liverpool to play consistent Champions League football and compete for trophies.\nMay 22 – Fabrizio Romano reveals Liverpool have been in contact with Newcastle about Isak, without getting any encouragement a deal would be possible.\nJune 19 – Multiple sources agree Liverpool’s interest in Isak still persists and they could look to eclipse their record-breaking signing of Florian Wirtz.\nJune 20 – TEAMtalk’s Fraser Fletcher reports that Liverpool are considering making a £150m offer for Isak, who would be open to the move.\nJune 24 – The Times claims Newcastle are willing to break their club wage record to give Isak a new contract.\nJune 26 – David Ornstein confirms Newcastle have no intention of selling Isak and want to renew his contract, with the player happy after securing Champions League involvement.\nJuly 12 – The Daily Telegraph reveals Newcastle are back in the race for Hugo Ekitike, but as someone to have in the same squad as Isak rather than replace him.\nJuly 16 – Romano reveals Liverpool have told Newcastle they are willing to pay a record £120m fee for Isak.\nJuly 18 – Santi Aouna reveals Al Hilal have opened talks with Isak’s agents over a move to the Saudi Pro League.\nJuly 19 – Eddie Howe sends Isak home from Newcastle’s pre-season friendly against Celtic, confirming the decision was due to the speculation about his future.\nJuly 23 – Liverpool announce the signing of Ekitike from Eintracht Frankfurt.\nJuly 24 – Absent from their pre-season tour, Isak makes the bombshell decision of telling Newcastle he wants to leave.\nJuly 26 – Howe says there is ‘no chance’ of Isak joining up with Newcastle’s pre-season tour at a later date.\nJuly 28 – Sacha Tavolieri claims Liverpool have agreed a five-year contract with Isak.\nJuly 30 – Nicola Schira claims Isak will earn £250,000 a week over a contract to 2030 at Anfield.",
  "word_count": 1315,
  "scraped_at": "2026-02-14T02:02:51.942062",
  "_text_extracted": true
}