{
  "article_id": "09f928019dc3",
  "url": "https://www.aol.co.uk/ange-postecoglou-believes-tottenham-foundations-221548832.html",
  "title": "Ange Postecoglou believes Tottenham  foundations are fairly fragile  ",
  "date": "20240514T231500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou believes Tottenham’s ‘foundations are fairly fragile’\nA furious Ange Postecoglou insisted the last 48 hours had shown Tottenham’s foundations are fragile after the 2-0 defeat to Manchester City in front of a subdued home crowd.\nPostecoglou had repeatedly expressed his bemusement on Monday at the prospect of Spurs’ own supporters being happy to lose to City due to the implications it would have on the title race.\nA positive result for Tottenham against Pep Guardiola’s team would have handed the initiative to their rivals Arsenal in the battle to win the Premier League ahead of Sunday’s final day.\nWhile Spurs produced a strong display against City, two second-half Erling Haaland goals earned them a precious victory but home fans chanted ‘are you watching Arsenal?’ after the striker’s 51st-minute opener.\nThe atmosphere at Tottenham Hotspur Stadium was more flat than many other home matches, with the majority of songs targeted at Arsenal, but Postecoglou refused to be drawn on what exactly provoked a tetchy press conference which ended with the Australian admitting “adjustments” are required to take the club to the top.\n“I think the last 48 hours has revealed to me that the foundations are fairly fragile, mate,” Postecoglou said.\n“That’s just what I think. I just think the last 48 hours have revealed a fair bit to me. That’s alright. It just means I’ve got to go back to the drawing board with some things.”\nPressed on what he meant, Postecoglou responded: “Outside, inside, everywhere. It’s been an interesting exercise.\n“It’s just my observations mate. I’m not going to tell you, because it’s for me. I’m the one who’s got to do it.\n“You can make your own assessments of what’s happened. I understand. I probably misread the situation as to what I think is important in your endeavour to become a winning team, but that’s OK. That’s why I’m here.\n“No, it’s got nothing to do with summer plans. The summer plans are there.”\nQuizzed on Tottenham supporters chanting “are you watching Arsenal?”, Postecoglou insisted: “I’m not interested mate. I just don’t care.\n“Maybe I’m out of step, but I just don’t care, I just want to win. I want to be successful at this football club, it’s why I was brought in.\n“So what other people, how they want to feel, and what their priorities are, are of zero interest to me. I know what’s important to build a winning team, that’s what I need to concentrate on.\n“I can’t dictate what people do. They’re allowed to express themselves any way they want. But yeah, when we’ve got late winners in games it’s because the crowd’s helped us.\n“I already know what I want to do, it’s just I’ve got to make some adjustments to how I do it.”\nFormer Spurs midfielder Jamie Redknapp, working at the game as a TV pundit, questioned the culture at the club.\nRedknapp told Sky Sports: “It’s not been easy listening to what’s been going on, and people questioning Spurs maybe winning this game.\n“There was a chance of Champions League football with this club but people were more interested in just stopping Arsenal winning the title.\n“That mentality – and I 100 per cent agree with him (Postecoglou), that’s what he’s alluding to – that’s a culture that’s been created for a long while at this club.\n“I was here. I didn’t ever feel it was a winning mentality.”",
  "word_count": 571,
  "scraped_at": "2026-02-14T02:25:33.992015",
  "_text_extracted": true
}