{
  "article_id": "0a093ad1bf07",
  "url": "https://www.westmeathindependent.ie/2025/08/18/mondays-briefing-arsenal-edge-first-win-after-chelsea-strikeforce-fires-blanks/",
  "title": "Monday briefing : Arsenal edge first win after Chelsea strikeforce fires blanks",
  "date": "20250818T083000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Monday’s briefing: Arsenal edge first win after Chelsea strikeforce fires blanks\nBy PA Sport Staff\nArsenal took the honours in the first big clash of the Premier League season, battling to a 1-0 win over Manchester United at Old Trafford.\nThere were signs of hope for Ruben Amorim’s side despite the result, while elsewhere Nottingham Forest made a fine start to the season and Chelsea played out a stalemate with Crystal Palace.\nAltay Bayindir’s blunder handed Arsenal victory and undid a positive Manchester United performance in Sunday’s pulsating Premier League encounter.\nOld Trafford rocked as Mikel Arteta’s runners-up headed to the rebuilding Red Devils in the most eye-catching fixture of the opening weekend.\nUnited looked far better than the side that finished 15th last season – their worst top-flight campaign since 1974 – yet Amorim’s men fell to another loss as Riccardo Calafiori capitalised on Bayindir’s early flap.\nUnited are a work in progress but summer signings Matheus Cunha and Bryan Mbeumo looked sharp on their debuts, while Patrick Dorgu hit a post in the first half.\nArsenal keeper David Raya also produced a string of important stops to keep the hosts at bay.\nBayindir’s difficult moment again put the spotlight on United’s goalkeeping situation.\nThe Turk was given the nod to start the game with Andre Onana still working his way back from injury.\nBayindir failed to deal with a corner, allowing Calafiori to nod in, but Amorim, felt his keeper was put in a very difficult situation.\n“You’re allowed to do a lot of things in the corner, we need to do the same,” he said. “When you touch that way the goalkeeper, he needs to use his hands to catch the ball, not push players, or he chooses to push players and let the ball past.”\nLast season Bayindir conceded directly from a Son Heung-min corner in a 4-3 Carabao Cup defeat at Tottenham, but Amorim rejected criticism of the keeper, saying: “He suffered a goal like this where? Against Tottenham? It was without VAR. With VAR it was a foul.\n“Then in the next game against Arsenal, who saved the penalty? Who saved the game? You don’t remember the game but I remember the game and Altay was unbelievable in that game. I am happy with the three goalkeepers.”\nCrystal Palace manager Oliver Glasner said Eberechi Eze will play for as long as he remains at the club and urged fans not to believe “rumours” the England international is about to be sold.\nAmid reports of an imminent move, Eze was a surprise inclusion as Palace began their Premier League campaign with a goalless draw against a lacklustre Chelsea at Stamford Bridge.\nHe looked to have delivered a potential parting gift to supporters with a brilliant first-half free-kick before VAR intervened controversially to disallow the goal.\nPalace have had talks with Tottenham over Eze and Arsenal are also reported to be keen to sign the midfielder.\n“As much as I know, Eze has a contract with Crystal Palace, he’s a Crystal Palace player and he showed it today,” said Glasner.\n“As long as he is a Palace player and performs like this, he will play for us. Nobody has told me something else.”\nNottingham Forest made a mockery of Nuno Espirito Santo’s pre-match worries as they beat Brentford 3-1 in their opening game of the season.\nNuno expressed his “concern” for the campaign ahead of the match, citing a lack of options in his squad, but he will feel better after a rampant display at the City Ground.\nAfter new signings Omari Hutchinson and James McAtee were unveiled before kick-off, their new team-mates put on a show as Chris Wood’s double and a debut goal for Dan Ndoye put them 3-0 up at the break.\nIt was the start that new Brentford boss Keith Andrews would have dreaded.\nWith Mbeumo and Christian Norgaard sold over the summer and Yoane Wissa effectively on strike trying to force a move away, Andrews has not been handed the easiest of tasks in his first managerial role.\nIgor Thiago got the Bees on the scoresheet with a second-half penalty, but life after Thomas Frank began poorly.\nNewcastle completed the signing of Aston Villa midfielder Jacob Ramsey.\nThe 24-year-old has signed a long-term contract with the Magpies, who are understood to have paid an initial £39million for his services, with a further £4m due in add-ons.\nThe Villa academy graduate, who made 167 appearances for the club, 10 of them in last season’s Champions League, is head coach Eddie Howe’s fourth acquisition of a difficult summer.\nRamsey said: “I’m delighted to be here. It’s been a mad two or three days, but I’m really happy to be here and I can‘t wait to get started.”\n“Jacob is another fantastic addition to our squad,” added Toon boss Eddie How. “His qualities will bring us something different on the pitch and he fits the profile of being young and hungry to develop, but also with a wealth of Premier League football under his belt.”\nLeeds mark their return to the Premier League on Monday night when they host Everton in the final match of the opening round.\nDaniel Farke’s side will hope to use the Elland Road crowd to make it a difficult night for Everton, who could have new loan signing Jack Grealish in the squad.\nFacing the Toffees, meanwhile, could be forward Dominic Calvert-Lewin, who spent nine years on Merseyside before departing at the end of his contract earlier this summer.",
  "word_count": 920,
  "scraped_at": "2026-02-14T01:52:36.772394",
  "_text_extracted": true
}