{
  "article_id": "0a0a1af0c8a4",
  "url": "https://metro.co.uk/2025/10/23/michael-owens-premier-league-title-top-four-prediction-they-look-strong-24511163/",
  "title": "Michael Owen Premier League title and top - four prediction :  They look strong ! ",
  "date": "20251024T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michael Owen has changed his Premier League title prediction and has revealed exactly who he thinks will be finishing in the top four this term.\nArsenal sit top of the table after the opening eight games of the 2025-26 season, looking to land their first top-flight trophy in 22 years.\nThe Gunners, who have finished as Premier League runners-up for three seasons in a row, are three points clear of second-placed Manchester City.\nOwen’s former club Liverpool, the 2024-25 champions, are third with the same points tally and goal difference as fourth-placed AFC Bournemouth.\nChelsea and Tottenham sit fifth and sixth, above Sunderland and Crystal Palace, while Manchester United and Brighton complete the current top 10.\nOwen: I think Arsenal will win the league\n‘I tipped Liverpool to win the Premier League before the season, but now, I’d say Arsenal,’ Owen told Sky Bet.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘They look strong. But Liverpool are still a very good side and not far off. I don’t fancy Manchester City as much this year.\n‘My current top four would be Arsenal, Liverpool, Manchester City, and Chelsea.\n‘For relegation, I’d probably say Leeds, Burnley, and Wolves. Nottingham Forest might escape it with their managerial change, but those three look most at risk.’\nMichael Owen's full top-four prediction\n- Arsenal\n- Liverpool\n- Manchester City\n- Chelsea\nOwen: Arsenal have been excellent for years\n‘I really don’t get that argument [about Mikel Arteta’s job being on the line if Arsenal don’t win the Premier League],’ Owen added.\n‘Arsenal have been excellent for years. They’ve had more points over the last three seasons than anyone else.\n‘You can’t keep doing that and not win something eventually. Even finishing second isn’t a failure.\n‘Look at Liverpool – they’ve won two Premier League titles but have come second plenty of times too.\n‘Manchester City have come second a few times in their recent history. People act like second is negative, but it’s not.\n‘Arsenal are getting closer. They got to the semi-finals of the Champions League last year and did better than any other English club.\nMore Trending\n‘They are getting better all the time so if they were to sack Mikel Arteta for finishing second again, it’d be incredible.\n‘Clubs that keep changing managers, like Manchester United did, end up back at square one.\n‘Look at Arsenal when they parted company with Arsene Wenger – they are just coming back into title contention now.\n‘If Arsenal keep faith, they’ll win trophies – no question. It’s not a God-given right – it’s the most competitive league in the world. Anyone demanding a title now is being entitled. It’s ridiculous.’\nMORE: Ruben Amorim agrees to sell Erik ten Hag’s £36.5m Man Utd signing\nMORE: Thiago Silva’s son defends Chelsea star who was ‘mocked’ on social media\nMORE: ‘Main man’ – Danny Murphy names key player for Arsenal to win the Premier League",
  "word_count": 534,
  "scraped_at": "2026-02-14T01:59:14.385477",
  "_text_extracted": true
}