{
  "article_id": "0a0be93fe3d3",
  "url": "https://www.caughtoffside.com/2024/08/03/aston-villa-unai-emery-dream/",
  "title": "Aston Villa transfer news : Push to sign Joao Felix continues",
  "date": "20240803T061500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Although it isn’t an easy deal to do by any means, CaughtOffside sources indicate that Aston Villa are still pushing to get a move for Unai Emery’s dream target over the line.\nWith a Champions League campaign ahead in 2024/25 as well as domestic commitments, it could be quite the season for the Villains, however, if they want it to ultimately be a successful one, then they need players that can take them to the next level.\nAtletico Madrid’s want away striker, Joao Felix, is one such player.\nAston Villa still trying for Joao Felix\nThe Portuguese isn’t wanted at the Rojiblancos, and despite initial reports suggesting that he would return to Barcelona on loan, it appears that the Catalans have turned their attentions elsewhere.\nCaughtOffside sources can confirm that Felix has already held talks with Emery, and has expressed a desire to return to the Premier League, thus strengthening the Spaniard’s hand in terms of bringing negotiations to a successful conclusion.\nAlongside the likes of Ollie Watkins, the Portuguese can provide the impetus up front for Villa to propel them forward.\nHowever, one area where he would need to improve significantly is in his work rate. That he’s still considered something of an enigma says much.\nThough Villa can be considered to have the edge in the race to land Felix, his former club, Benfica, have also entered the fray, initiating talks with Atleti regarding a potential loan deal.\nGiven that the Spanish giants would prefer a straight sale, they’re likely to baulk at any offers to take the player on loan, though if that remains the only option open to them, they may be forced to allow it on the basis that they could ensure any loan comes with a compulsory purchase in 12 months time.\nVilla plan to sell Jhon Duran to finance their move for Joao Felix, however, their own asking price of around the £40m mark has seen what was expected to be a smooth transfer to West Ham for Duran hit the buffers.\nSo, at present, even though CaughtOffside sources understand that Villa are willing to offer Felix a four year deal, they can’t complete on the move simply because they’re unable to finance it.",
  "word_count": 371,
  "scraped_at": "2026-02-14T01:51:48.880540",
  "_text_extracted": true
}