{
  "article_id": "0a504bd61e2a",
  "url": "https://www.themag.co.uk/2025/10/hes-a-very-good-one-rival-premier-league-boss-talks-alexander-isak-and-nick-woltemade-fulham-marco-silva-newcastle-united/",
  "title": "  He a very good one  - Rival Premier League boss talks Alexander Isak and Nick Woltemade",
  "date": "20251023T200000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘He’s a very good one’ – Rival Premier League boss talks Alexander Isak and Nick Woltemade\nMarco Silva has been comparing and contrasting Alexander Isak and Nick Woltemade.\nThe Fulham boss set to face Newcastle United and the Germany international on Saturday, with Woltemade having replaced the now Liverpool striker.\nMarco Silva thinks the signings of both Alexander Isak and Nick Woltemade are very positive pointers as to the success of Eddie Howe’s choice of transfer targets and where he has directed the club’s money to be spent.\nNewcastle United more than doubling the £63m they spent on Alexander Isak when banking £130m from Liverpool, then committing a potential £69.3m (£65m plus £4.3m possible future add-ons) on Nick Woltemade.\nMarco Silva believing that Newcastle United have signed an exceptional replacement for Isak, with Big Nick having scored four goals in five Premier League starts (five goals in seven starts when including the Champions League), as well as having an excellent all round game that brings other NUFC players into play.\nMarco Silva talking about Nick Woltemade (and Alexander Isak…) ahead of Newcastle v Fulham on Saturday:\n“Very good striker, very good striker (Nick Woltemade).\n“Of course, they had, last three seasons, an unbelievable striker (Alexander Isak), too.\n“It is not something new for them.\n“It is a good sign, for them as a football club.\n“When they lose a great striker, because Liverpool spent that amount of money on him, that means recruitment, and they did it well.\n“They went for a slightly different style (with Nick Woltemade), but to spend the money they spent on him and the impact that he has had straightaway, I think is very good.\n“One is slightly different, probably not so aggressive in the space like Isak was, much more a player that is very good leading the play. And, of course, inside the box he can score.\n“He (Nick Woltemade) showed already that inside the box he can score in many different ways.\n“The game against Brighton is a good example, the way he was able to finish in that way and score in that way.\n“He’s a very good one – the way sometimes he can be the extra midfielder and he’ll come to link their game and support for them to beat the first pressure, for example.\n“And, of course, inside the box his profile is a very good one.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 413,
  "scraped_at": "2026-02-14T01:59:14.385737",
  "_text_extracted": true
}