{
  "article_id": "0a996f02a0a7",
  "url": "https://www.starsandstripesfc.com/uswnt-news/2024/10/22/24275175/usa-vs-iceland-2024-friendly-scouting-uswnt-united-states-womens-national-team-uefa-europa-match",
  "title": "2024 USWNT Friendly : Scouting Iceland",
  "date": "20241022T140000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fresh off of a gold medal at the 2024 Summer Olympic Games, the United States Women’s National Team returns to action and begins the long wait before the next World Cup. There will be several friendlies and minor tournaments along the way as the program looks to continue enjoying the immediate success brought by manager Emma Hayes. Next on the schedule are two friendlies against Iceland, which has shown signs of growth over the past 15 years but is yet to break into Europe’s upper tiers. The first match is set for Q2 Stadium in Austin, Texas, a 20,738-seat soccer-specific stadium with a Platinum TE Seashore Paspalum hybrid grass surface; Nashville, Tennessee’s Geodis Park – a 30,109-seat venue with a Latitude 36® Bermudagrass surface – will host the latter fixture.\nUSA vs. Iceland, 2024 Friendly: Scouting Iceland\nThe USWNT returns to action after achieving glory.\nThis is the 16th all-time meeting between the two nations, with the USWNT holding an 13-0-2 advantage and triumphing (5-0) in the most-recent match at the 2022 SheBelieves Cup. Ranked 13th internationally by FIFA, Iceland qualified for the 2025 UEFA Women’s Championship with a second-place finish in Group 4, avoiding the playoff and opening up a spot in the calendar for the pair of friendlies. The tournament run included victories over Poland (3-0, 1-0), a split with Germany (1-3, 3-0), and a draw and a win against Austria (1-1, 2-1).\nThorsteinn Halldórsson (stylized Þorsteinn Halldórsson) was appointed to the manager role in January of 2021 after winning two domestic championships and two domestic cups and reaching the Round of 16 of the 2019-20 UEFA Women’s Champions League with Breiðablik. Seeking “the continuation of the team’s development” and noting “good performances,” the federation extended his contract “until at least 2026” with “clauses in connection with the 2027 World Cup.” The 56-year-old retired defender secured qualification for two consecutive European championships and has “enjoyed the job since taking over” and praises his players for doing “great things.”\nHalldórsson named a 23-player roster for the pair of friendlies featuring the majority of the group that was present during European qualifying. The entirety of the squad competes in Europe, with six call-ups on the books in the domestic Besta deild kvenna. Alexandra Jóhannsdóttir and Bryndís Arna Níelsdóttir withdrew “due to injuries” and were replaced by Ásdís Karen Halldórsdóttir and Heiða Ragney Viðarsdóttir.\n***\nGOALKEEPERS (3): Telma Ívarsdóttir (Breiðablik), Fanney Inga Birkisdóttir (Valur), Cecilía Rán Rúnarsdóttir (Inter Milan)\nDEFENDERS (6): Guðný Árnadóttir (Kristianstads DFF), Ingibjörg Sigurðardóttir (Bröndby IF), Glódís Perla Viggósdóttir (Bayern Munich), Guðrún Arnardóttir (FC Rosengard), Natasha Moraa Anasi (Valur), Sædís Rún Heiðarsdóttir (Valerenga)\nMIDFIELDERS (9): Sandra María Jessen (Þór/KA), Berglind Rós Ágústsdóttir (Valur), Hildur Antonsdóttir (Madrid CFF), Katla Tryggvadóttir (Kristianstads DFF), Karólína Lea Vilhjálmsdóttir (Bayer 04), Selma Sól Magnúsdóttir (Rosenborg BK Kvinner), Amanda Jacobsen Andradóttir (FC Twente), Hafrún Rakel Halldórsdóttir (Bröndby IF), Heiða Ragney Viðarsdóttir (Breiðablik)\nFORWARDS (5): Sveindís Jane Jónsdóttir (VfL Wolfsburg), Hlín Eiríksdóttir (Kristianstads DFF), Emilía Kiær Ásgeirsdóttir (FC Nordsjælland), Diljá Ýr Zomers (OH Leuven), Ásdís Karen Halldórsdóttir (LSK Kvinner Fotballklubb)\n***\nHalldórsson typically employs a 4-3-3 formation and is said to “stick to the basics and opt for route-one football” by “avoiding any intricate build-up patterns and looking to play higher up the pitch and win second balls.” Relying on long-ball tactics, the team can be “difficult to break down” with a crowded defensive half and is also “dangerous from set pieces.” While the style of play is fast and direct, there can be some issues when forced to work out of the back or clear away danger, with some opponents able to pounce on errors.\nDespite her young age and the presence of experienced players on the depth chart, Fanney Inga Birkisdóttir played every minute during EURO 2025 qualifying and appears to have an inside track on the number-one role. The 19-year-old Valur goalkeeper was in net for two consecutive domestic league championships and has put in strong performances by displaying a “confidence in all actions” that belies her youth. She has good movement on the back line with quick footwork and also a willingness to charge forward at a moment’s notice to meet the opponent. Her saves are fairly sure-handed with the ability to smother the ball and prevent any costly rebounds in dangerous areas, while also getting good height on jumps when challenging for crosses.\nAfter making her top-division debut at the age of 13, Ingibjörg Sigurðardóttir of Brøndby has emerged as a key centre-back and is described as “a beast on the pitch, incredibly strong, and good on the ball with her right and left foot.” She gets a tremendous amount of power behind her long passes and headers, both as a dangerous figure on set pieces and occasionally pushing forward into the box during the run of play. The 2022 Icelandic Footballer of the Year Glódís Perla Viggósdóttir is tremendous in the air and a regular source of finishing along with a highly-active fixture during the build-up. The 29-year-old Bayern Munich defender is a vocal leader on the back line and takes a dominant role with deft one-on-one shutdowns and line-splitting distribution over the top.\nGuðrún Arnardóttir of Swedish side FC Rosengård is a “tough-tackling defender,” recently earning named the league’s Player of the Month with constant “performances at a high level” that provide “a brave two-way game.” She is quick to push into the attack and is a willing target on set pieces with frequent aerial success and relishes physical battles with the opponent. On the other side of the formation is Guðný Árnadóttir, who can also contribute in the final third and describes her strengths as “speed and passing.” The 24-year-old Kristianstads fullback will line up in the middle of the line, test the goalkeeper from distance, regularly win headers, register interceptions, and distribute at a solid rate. There is also Sædís Rún Heiðarsdóttir, a younger option who has carved out a role for herself with Vålerenga after several productive and prizewinning seasons in the domestic league. The former U-19 team captain blasts shots at a deep range, particularly on free kicks, and should be familiar to the USWNT manager after training with Chelsea last year.\nSelma Sól Magnúsdóttir is capable and experienced with dozens of international caps and over a decade of first-division experience, praised as “a straightforward central midfielder” with the ability to spark the counter. Coaches note her “great mentality,” which is useful in all phases of the game, particularly when pushing into high areas and finding the composure to blast a shot into the net. The athletic Hildur Antonsdóttir covers the length of the field and harasses the opponent with constant pressure, gritty defensive actions, and driving runs into open space. The 29-year-old Madrid CFF midfielder is always up for a crunching tackle, going to ground and quickly popping back up to hit a long ball to a teammate in transition. Currently on loan at Bayer Leverkusen from Bayern Munich, Karólína Lea Vilhjálmsdóttir is a key link-up option and creative option in the final third with an excellent passing vision. She uses her size at five-foot-ten to bully opponents and force turnovers, switching quickly into transition and occasionally piping in a finish with a quick shot.\nThe exploitative Sanda Jessen received an extensive run with the squad during EURO qualifying, displaying short-burst pace and poaching instincts that enable her to react to the ball before the opponent. The 29-year-old Þór/KA winger plays on the front foot and is always looking to break out in transition and ghost into the back post to smash home a pass or clean up a rebound. Diljá Ýr Zomers had a breakout season in the Belgian Women’s Super League with Oud-Heverlee Leuven, topping the charts with 23 goals and being praised as “daring and extremely hardworking” with influential “defensive work.” She is constantly looking to push toward the center of the field and can finish in a variety of ways, whether running onto passes, setting up a shot with a quick turn, or converting crosses. Another option is Hlín Eiríksdóttir of Kristianstads, who has found the back of the net three times this year for Iceland by displaying a keen sense of spacing when prowling the final third. In addition to being a productive scorer, the Sweden-based attacker can also serve as a set-up player and locate teammates with a high level of tactical awareness.\nIceland enjoys the privilege of deploying an elite talent at the top of the formation, with Sveindís Jane Jónsdóttir already bagging four international goals this year and appearing primed for another leap in quality. The 23-year-old VfL Wolfsburg forward has won a Bundesliga title, two DFB-Pokals, and Icelandic Women’s Footballer of the Year, acting as an all-around talent with an obvious impact in the attacking half, constant actions on defense, and a nifty long throw-in. Standing at five-foot-nine-and-a-half, she is a physical marvel who is willing to engage in battles with the opposing defenders but also employs her long stride to break into a blistering pace, dominating on the counter-attack. Sometimes deployed on the wing at the club level, her best work is done in the transition game, either slotting the ball past the goalkeeper or hitting a centering pass to a teammate.\nThe USWNT is back on top of the world and gets to enjoy a gold-medal reign for the foreseeable future, taking on all comers and continuing to build the program in a strong direction. Hayes has the next three years to tinker, experiment, test out new tactical ideas, and integrate younger players into the roster, rebuilding and retooling the squad ahead of the 2027 World Cup. The talent difference should carry this group to two consecutive victories in these friendlies, with the uplift carrying over from the summer.\nThe first match is scheduled for Thursday, October 24th at 7:30 p.m. Eastern, 4:30 p.m. Pacific. Viewing options include TBS, Max, Universo, Peacock, and FUBO TV (free trial).\nThe second match is scheduled for Sunday, October 27th at 5:30 p.m. Eastern, 2:30 p.m. Pacific. Viewing options include TNT, truTV, Max, Universo, Peacock, and FUBO TV (free trial).",
  "word_count": 1684,
  "scraped_at": "2026-02-14T01:51:57.642035",
  "_text_extracted": true
}