{
  "article_id": "0a9c9fdf01c8",
  "url": "https://www.nytimes.com/athletic/6833398/2025/11/25/ajax-badge-125-anniversary-amsterdam-1928/",
  "title": "Ajax gets his face back : Dutch giants revert to hand - drawn 1928 badge",
  "date": "20251125T070000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As television money has transformed the landscape of European football in the 21st century, the challenge has fallen on big clubs in smaller markets to innovate, or face being left behind.\nAjax, the most successful club in the Netherlands, have proven that invention does not require abandoning tradition. In fact, their history has provided the blueprint for continued success. In the early 1970s, legendary coach Rinus Michels built Ajax into the best club team in Europe. In 1973, they became just the second team to win three successive European Cups, with Michels’ totaalvoetbal philosophy executed by players reared at the club’s academy.\nAdvertisement\nConsidering the changing landscape of football finances, reaching the semi-finals of the Champions League in 2019 — where they were just seconds away from the final — is one of the most impressive achievements of the past decade. As it was for the great Ajax sides of the past, their run was built on the backs of players developed at the club, including Matthijs de Ligt and Frenkie de Jong, who now play for Manchester United and Barcelona respectively.\nAt the heart of their success were those long-standing footballing ideas and principles, focused on an attacking, dynamic style of play, which continues to inform Ajax sides from senior to youth levels. With that in mind, it should come as no surprise that they have gone back to their roots again.\nMore than three decades after modernising their club crest, Ajax have permanently reverted to their classic badge, first implemented in 1928.\n“History has shown that we are at our best when we remain true to the Ajax DNA. That’s why we are doing everything within the club to uphold that DNA, from our football philosophy to our core values,” club CEO Menno Geelen wrote on the club’s website. “Bringing back the classic logo symbolises this commitment and serves as both a tribute to our rich history and an inspiration for the future — a future that relies on everything we hold dear about our club.“\nIn honour of the club’s 125th anniversary, Ajax have re-adopted the crest used between 1928 and 1990. It is entirely hand-drawn and was the first crest to feature the artist’s imagination of Ajax (the ancient Greek mythological hero the club is named after), which informed the more modern design used by the club until the classic logo officially returned for this season. The abstract version of the mythical warrior implemented in 1990 was drawn with 11 lines, symbolising the number of Ajax players on the pitch.\nAdvertisement\nFor many, the crest the club abandoned this year represents much of what Ajax seem to be searching for. In 1995, Ajax won the Champions League, their fourth European Cup, following principles similar to those of the all-conquering side of the early 1970s. Thirteen of Louis van Gaal’s 16-player squad that beat Milan in the final were Dutch, including Clarence Seedorf, Frank Rijkaard, Edgar Davids, twins Frank and Ronald de Boer and Patrick Kluivert, who scored the winning goal. While Ajax maintained its prestige overseas, fans closer to home longed to return to the badge they felt better represented their club.\n“There are a lot of supporters who have a romantic feeling about this badge,” says Yoeri van den Busken, a senior member of Ajax’s supporters’ association. “Our director Fabian Nagtzaam said this badge is the soul of Ajax. Manchester United has the devil, Celtic has the shamrock, Benfica has the eagle; Ajax (the mythical warrior) is our identity. It makes us feel proud and powerful.”\nAjax supporters expressed their desire to return to the intricate design known to the club on several occasions, organising protests in 2014, 2015 and 2021 that attracted thousands of fans to the streets — the slogan: Geef Ajax z’n gezicht terug (give Ajax his face back). The club were initially reluctant, but after years of discussions with supporters, they announced the permanent return for the 2025-26 season last November, celebrated with a friendly between Ajax and Real Madrid legends in Amsterdam. In an era where European clubs at the elite level are growing further from their supporters, it represents a meaningful move towards club and fan unity.\n“As a supporters’ organisation, we fought and struggled a lot,” says Van den Busken. “We spoke to the directors from time to time, a lot about the return to the classic badge. We don’t have the money of the Premier League teams, so Ajax have to listen to the people. Without the people, it is nothing. Last year we were fighting for the league championship and we missed out, but the criticism wasn’t as high as before because we’ve got our face back. Because of that commitment, people are more positive than before.”\nFor the club, returning to the “classic” design is a complicated task. As clubs and designers around the world are stripping back the idiosyncrasies from their logos, this represented the opposite — adding extra features that complicate the seamless transfer of the design onto buildings and small items of merchandise. While the 1990 design has 11 lines and a sleek typeface, the classic design is hand-drawn and incredibly detailed. The club hired Amsterdam-based design studio Smorgasbord to delve into the club’s archives and build “a comprehensive visual language” and “brand identity guidelines.”\nAdvertisement\nThrough all the complications, the motivation to deliver for the supporters remains. Ajax have failed to reach anywhere near the heights of their 2018-19 season since. After sacking boss John Heitinga earlier this month, they are sixth in the Eredivisie, 14 points behind leaders PSV. In the Champions League, a competition that historically means so much to the club and props up their finances, they are dead last going into matchday five, having lost all four matches. In light of their troubles, ensuring the bond remains between the club and fanbase feels more critical than ever.\nWhile club-developed players inspired the great sides of the past to glory, Ajax are losing their brightest talents before they can blossom in Amsterdam. It’s a source of pride to see academy graduates, including Liverpool’s Ryan Gravenberch and Chelsea’s Jorrel Hato, thriving in the Premier League after winning their first Netherlands caps at the club. But back in Michels’ and Johan Cruyff’s day, or even in the 1990s, the genuine prospect of reaching the latter stages of the European Cup may have motivated them to stay beyond their teenage years.\nStill, for a club as in touch with their past as any at the elite level, Ajax should not panic — history tells us a golden generation is never too far away. The badge — with strong associations to the glory days of the past, inspired by the mythical warrior who adorns it — now serves as a permanent driver for the club and its fans, symbolising what sets Ajax apart as possibly Europe’s most unique giant.",
  "word_count": 1147,
  "scraped_at": "2026-02-14T02:09:38.458299",
  "_text_extracted": true
}