{
  "article_id": "0aa00ca41611",
  "url": "https://www.bbc.co.uk/sport/football/66845088",
  "title": "Feyenoord vs Celtic : Can Brendan Rodgers deliver Champions League progress for Scots ? ",
  "date": "20230919T003000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Feyenoord vs Celtic: Can Brendan Rodgers deliver Champions League progress for Scots?\n- Published\n\"I'm here again to win and to look to see if we can do something in Europe.\"\nThat was the ambition Brendan Rodgers outlined on his return to Celtic as manager this summer. And it is what Celtic supporters will crave. It's been a long time since the club did something significant on the European scene.\nThat statement of intent from Rodgers has lingered during the start of the domestic campaign, but his arrival wasn't the time to explore it in great detail.\nWith the club's Champions League campaign set to get going here in Rotterdam on Tuesday night against Feyenoord, now seems appropriate to delve in further.\nSo, what would amount to \"something\" exactly? Last week, Rodgers elaborated by stating: \"Our overall aim is to be in Europe after Christmas.\"\nAfter the 3-0 win over Dundee, as Celtic prepare to face Feyenoord away in their opening Champions League group stage encounter, he added: \"I know there always can be a wee bit of trepidation going into the Champions League and the level, but for me there is nothing but excitement.\"\nWhen the Champions League anthem bellows from the PA system in De Kuip on Tuesday evening, the excitement will most certainly spill over. It tends to make hairs stand up on the back of the neck no matter the occasion. More so, ahead of the opening group match when everyone is on equal footing.\nWith that post-Christmas aim in mind, third place or better is then required. Just how much trepidation there might be amidst all that excitement is worthy of examination as Rodgers pursues that target.\nRodgers eyeing second-spell gains\nBy his own admission, Celtic \"can definitely do better\".\nA look at their Champions League record absolutely rams that home, not just under Rodgers.\nIt's a long time since the heady days of 'Fortress Parkhead', when the likes of Juventus, AC Milan and Manchester United all departed with nothing. That home element was a massive factor in previous success, something the manager will look to tap into.\nOf late, the only group win came away at Anderlecht under Rodgers in 2017, a result that on its own, alongside five defeats, secured third place in their group. That win ended a punishing run of 16 group games without victory.\nThere have been none since in the 10 games they've played, drawing twice. It doesn't make good reading.\nYet this season's draw perhaps offers some optimism. Tough, but not an insurmountable task.\nOf the Pot A seeded teams, Feyenoord were lowest ranked. They will be a formidable test, but one Celtic can approach with a degree of hope, if they perform and find the right balance. That's with further tests against Atletico Madrid and Lazio lying ahead.\nQuestion of balance perhaps key\nLast season, Celtic earned plaudits for their overall approach in the group stage. They tried to play their attack-minded 'Ange-ball' game no matter the opposition under now-Tottenham boss Ange Postecoglou.\nIt didn't translate into wins, just two draws against Shakhtar Donetsk, but seemed to provide a platform to build upon this season.\nCompared to Rangers' bruising experience on the same stage, Celtic came off lightly.\nNow, after Rodgers' return, Celtic's European performances under him have come under the microscope to give indicators of likely success. Will this time be any different?\nIn his first tenure, a high-pressing, attacking approach was the usual hallmark, no matter the competition.\nAt Champions League level, 7-0, 7-1 and 5-0 reverses followed. There were some utterly bruising evenings over two Champions League campaigns that delivered that solitary, yet impressive, win over Anderlecht from 12 games.\nThe quality of opposition has to be acknowledged, given it included a Lionel Messi, Luis Suarez and Neymar-inspired Barcelona, a Kylian Mbappe, Neymar (again) and Edinson Cavani-inspired Paris St-Germain, and a Robert Lewandowski, Arjen Robben and Thomas Muller-inspired Bayern Munich.\nAmid all the anguish were creditable draws against a highly impressive Manchester City - twice - and a point away to Borussia Monchengladbach. Not easy feats and those are points to consider in anticipation of this challenge. As is the fact Rodgers's team came through challenging qualifying rounds in those two years, effectively in pre-season.\nOverall, though, it felt that Celtic were trying to keep their head above water with little prospect of progression.\nA Europa League campaign, after failing to reach the Champions League groups, brought some progress before, in early 2019, Celtic lost out to Valencia in the last 32 and within weeks, Rodgers was back in the English Premier League with Leicester City.\nThis time, with the benefit of not having to navigate the qualifying process, there's anticipation as to whether Celtic can arrest these trends and develop beyond domestic dominance.\nLessons learned at Leicester?\nRodgers' record with the Foxes, and his approach, suggests this time may be different. At least tactically. Slightly less pressing high up perhaps with a level of pragmatism when the occasion merits it.\nIn Europe, there was a clear improvement in Rodgers' European record at Europa League and Europa Conference League level.\nThat may offer the Celtic support some hope. If they can overcome significant injury issues, particularly in defence, then a win or two may be achievable. Or more.\nIn May 2022, the former Liverpool manager guided Leicester City to a Europa Conference League semi-final, losing by a one-goal margin over two legs to eventual winners Roma. Not quite the Champions League you might argue.\nYet, Jose Mourinho's Roma side went on to beat, guess who, Feyenoord.\nRodgers has previously alluded to evolving as a manager and tailoring his approach when required, conceding that it's not in his DNA but required at times.\n\"Ultimately, the game's about winning. I won't be averse to having that balance this time between attacking and having that little bit of pragmatism,\" he has said.\nGiven Celtic's recent European record, you suspect that pragmatism will come into play more often than not, especially on their travels.\nHow Celtic fans will hope it delivers that special \"something\", European football after Christmas.",
  "word_count": 1020,
  "scraped_at": "2026-02-14T02:07:14.754135",
  "_text_extracted": true
}