{
  "article_id": "0ab4888fa77c",
  "url": "https://theathletic.com/5163554/2023/12/30/guirassy-stuttgart-release-clause/",
  "title": "Guirassy goalscoring and creativity is making a mockery of €17 . 5m release clause",
  "date": "20231230T063000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Serhou Guirassy had an exceptional first half of the season for Stuttgart. He scored 13 goals in his first seven Bundesliga appearances of the campaign and finished with 17 from 14 as the winter break started.\nAnd while the Guinea forward, 27, did cool off as autumn turned to winter, that is partly due to the hamstring strain he suffered in October.\nAdvertisement\nThe injury appeared to disturb the balance of a technically gifted and quick striker who, before the interruption, was playing with complete confidence and great fluidity. Yet he still scored three goals in his final five appearances in all competitions before the break.\nGuirassy’s goals in 2023-24 have come in the form of tap-ins, headers, long-range strikes and finishing off one-v-ones. Naturally, therefore, the queue of interested parties has grown longer and longer, not least due to his €17.5million (£15.2m; $19.4m) release clause — a modest fee for one of Europe’s most prolific goal scorers.\nStuttgart have tried and failed to renegotiate Guirassy’s contract and alter it. That they found themselves doing so reflects the fact that they never anticipated his performances would be as good as they have been.\nThis is understandable. During spells across France and Germany, for Lille, Amiens, Cologne and Rennes, Guirassy had never scored more than 10 league goals in a season before 2022-23 with Stuttgart (he finished with 11).\nBut viewing this season’s form as an anomaly would be wrong and ignores the changing circumstances at the German club who sit third in the Bundesliga.\nGuirassy joined Stuttgart, initially on loan from Rennes, in the summer of 2022. The club had only returned to the top flight in 2020 and at the end of his first season they beat Hamburg in a relegation play-off to avoid dropping out of it again.\nStylistically, they were a deep-lying counter-attacking team. Guirassy’s form (11 goals from 20 starts) was sufficient for the club to activate a €9m purchase option, but not until head coach Sebastian Hoeness arrived in the spring of 2023 — after Pellegrino Matarazzo and Bruno Labbadia had been dismissed within six months — did VfB begin to transition towards the possession-centred football that they play today and, in doing so, bring out the full range of the Guinean’s abilities.\nAdvertisement\nStuttgart are now an entirely different side and the effect on Guirassy has been profound. This season he has averaged 3.8 shots per 90 minutes in the Bundesliga (versus 2.6 in 2022-23) and has enjoyed significant increases in his touches in the opposition penalty area (6.7 per 90 compared to 4.9), his number of passes attempted (30.5 per 90 compared to 24.5) and, as mentioned, his goal return.\nMost revealingly, his creative influence has grown from a lowly 0.08 expected assists (xA) per 90 minutes in the league in 2022-23 to 0.22 in 2023-24 (the same as Borussia Dortmund’s Julian Brandt, who is an outright playmaker).\nThat context highlights Guirassy’s development into more of a complete forward. He is not a box-dweller purely dependent on goals and conversion rates, but someone around whom an attacking system can be built.\nAn equally valuable observation — one particularly important for interested parties — is that Stuttgart’s change in playing style has seen the emergence of a supporting cast of attacking midfielders, too.\nChris Fuhrich — a languid, Jack Grealish-type player — has been good enough from the left to earn his first senior cap for Germany. Enzo Millot, in the centre, has been one of the better chance-creating No 10s in the Bundesliga. Meanwhile, Silas, whose dynamic style was always assumed to be more suited to the counter-attack, is playing the best football of his career from the right.\nStuttgart have played successful and attractive football this season and that trio, often playing in the line behind Guirassy, have greatly helped their centre-forward’s productivity. He has needed them and they have needed him.\nOn-loan Brighton & Hove Albion forward Deniz Undav has been playing well too (nine goals from 13 appearances) and that also makes isolating Guirassy’s worth difficult.\nAdvertisement\nThe quality of Hoeness’s coaching is an obfuscating factor as well, with Stuttgart well placed to qualify for next season’s Champions League under the 41-year-old manager.\nTaking Stuttgart from the brink of the 2.Bundesliga to a possible place at Europe’s top table, within the space of a season and with many of the same players, is arguably a coaching performance to rival what Xabi Alonso is doing at Bayer Leverkusen.\nBut questioning whether Guirassy is just a beneficiary of his surroundings is misguided.\nHe has scored at a rate of more than a goal a game, and once every four shots, so of course he has been in superb individual form.\nAnd is this hot streak, and the surge in reputation that has come with it, a by-product of the overall improvement at Stuttgart? Yes. Players always rise and fall with their tactical circumstances.\nBoth things can be true.\nAnd crucially, Guirassy has proven himself within two contrasting systems — one possession-based and proactive, the other conservative.\nHe has shown a capacity to profit from and be of benefit to the players around him, while scoring goals from a variety of situations. Even if his scoring rate and all-round creativity both worsen in the second half of the season, he is still a highly valuable component in a football team.\nHe has been named in Guinea’s squad for the Africa Cup of Nations, which starts on January 13 and runs until February 11, but at €17.5m — rising to €20m in the summer — he comes at a very good price.\n(Top photo: Harry Langer/DeFodi Images via Getty Images)",
  "word_count": 946,
  "scraped_at": "2026-02-14T01:51:13.758830",
  "_text_extracted": true
}