{
  "article_id": "0abe80aa2c41",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=307148",
  "title": "Legendary UEFA Champions League Stars Immortalised in Cardboard Sculptures Unboxed Ahead of Final in Istanbul",
  "date": "20230627T010000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Legendary UEFA Champions League Stars Immortalised in Cardboard Sculptures Unboxed Ahead of Final in Istanbul\nFedEx, an official sponsor of the UEFA Champions League, has revealed four giant cardboard sculptures memorialising iconic UEFA Champions League final moments. Sculptures of Cristiano Ronaldo, Lionel Messi, Steven Gerrard, and Gareth Bale have gone on show outside the Atatürk Olympic Stadium ahead of the Champions League final between Manchester City FC and FC Internazionale Milano on Saturday.\nThe Champions Unboxed activation captures the players legendary Champions League historical memories from outrageous overhead kicks to unique goal celebrations, the sculptures are constructed entirely from recycled FedEx cardboard boxes.\nCompleting the sculptures line-up are statues depicting Steven Gerrard initiating the infamous Miracle of Istanbul comeback in 2005; Cristiano Ronaldos opener in the all-English 2008 final vs Chelsea FC; Lionel Messis celebration following his strike against Manchester United FC in 2009; and Gareth Bales jaw-dropping bicycle kick against Liverpool FC in 2018.\nThe structures were brought to life by world-renowned Canadian sculptor and artist, Laurence Vallières, whose impressive body of work has wowed audiences globally. The sculptures were created over several months, with 130 recycled FedEx boxes used to construct the awe-inspiring statues. Fans were also able to have their say on what they considered to be the best Champions League final goals, with a vote hosted on social media allowing them to make their choice on the greatest UEFA Champions League final moments.\nOn the creation of the cardboard artworks, Vallières remarked: It was a really exhilarating project to work on; creating the sculptures with recycled FedEx cardboard was an exciting new challenge and it was truly enjoyable to mark the historic heroes of previous Champions League finals in such a unique way.\nSpeaking on the activation, Brenda McWilliams, Vice President of Communications, Brand & Marketing Operations for FedEx Europe, said: Our sponsorship of the UEFA Champions League creates opportunities to connect with people all over the world through the passion and emotion football evokes. With this activation we aimed to capture the moments that have sculpted the beauty and drama of previous finals, whilst readying ourselves for the next Champions.\nFedEx unveiled the sculptures outside the Atatürk Olympic Stadium on the 18th anniversary of the clash between Liverpool and AC Milan at the same venue, in what is widely considered the greatest final ever. AC Milans local rivals FC Internazionale Milano will go up against English giants Manchester City FC in this years final.\nFC Internazionale Milano won the competition in 2010, courtesy of a man of the match performance from Dutch midfielder Wesley Sneijder who was present at the FedEx launch event. Sneijder commented: This is a highly anticipated and exciting final. For the UEFA Champions League to return to Istanbul is an incredible moment for the city and football fans. I have many memories playing in this competition with FC Internazionale Milano that I cherish, and a strong personal connection to Turkey from my time at Galatasaray S.K - it is special to be back here and experience the electric atmosphere that a UEFA Champions League final brings to a host city. I have enjoyed talking through my memories with FedEx and predicting who could be next.\nFans will be able to get a closer look at the sculptures at the UEFA Champions Festival being held in Istanbul and will also be given the chance to meet the artist and partake in a FedEx workshop where they will have the opportunity to create their own cardboard mementos of the final. The festival will be held across four days in the Yenikapı quarter, where there will be a range of activities for traveling and local fans to engage with.\n( Press Release Image: https://photos.webwire.com/prmedia/8/307148/307148-1.jpg )\nWebWireID307148\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 645,
  "scraped_at": "2026-02-14T01:50:37.782833",
  "_text_extracted": true
}