{
  "article_id": "0ac68d915ba0",
  "url": "https://www.naharnet.com:443/stories/en/301438-haaland-scores-two-as-man-city-beats-young-boys-3-0-advances-in-champions-league",
  "title": "Haaland scores two as Man City beats Young Boys 3 - 0 , advances in Champions League",
  "date": "20231108T161500Z",
  "domain": "naharnet.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Haaland scores two as Man City beats Young Boys 3-0, advances in Champions League\nThe Champions League is European club football's most testing stage.\nTry telling that to Erling Haaland.\nThe Norway striker extended his record in the competition to 39 goals in 34 games as Manchester City advanced to the knockout round with a 3-0 win against Young Boys on Tuesday.\nHaaland scored twice, including a brilliant long-range effort in the second half, to move him to within two of City great Sergio Aguero's total of 41.\nIt seems inevitable he will one day challenge Cristiano Ronaldo's record of 140 Champions League goals. And after losing out to Lionel Messi in the battle for the Ballon d'Or last week, he will likely be back in contention for football's biggest individual prize next year if he continues his scoring streak.\n\"If he, with his mates, win a lot of trophies, there will be chance to win it,\" City manager Pep Guardiola said. \"If not, we won't do anything.\"\nCity's defense of the Champions League is going smoothly. Guardiola's team extended its perfect record after four games in Group G and also extended its unbeaten home run in the competition to 28.\nHaaland opened the scoring at Etihad Stadium with a 23rd minute penalty and Phil Foden made it 2-0 in first-half stoppage time.\nHaaland then fired into the top corner from the edge of the area six minutes after the break — but was denied a hat trick when he was substituted in the 61st.\nBy then there was little doubt that City was on course for a 23rd straight home win in all competitions in a game that saw Young Boys reduced to 10 men when Sandro Lauper was sent off for high foot on City substitute Nathan Ake in the 53rd.\nAfter Matheus Nunes was brought down in the area by Lauper in the first half, Haaland stepped up and sent goalkeeper Anthony Racioppi the wrong way by firing into the bottom left hand corner.\nOn Foden's goal, the forward received a pass from Jack Grealish on the right and then showed quick feet to beat Ulisses Garcia inside the area. He still had a tight angle to shoot from, but swept the ball past Racioppi and into the far corner.\n\"Of course we are incredibly happy to have qualified with two games left. Finish first. We have time to think about it,\" Guardiola said. \"The word that defines this group of players for many years is the consistency. We have high standards and that is why we are still in the Premier League up there and qualified from the Champions League.\"\nSTONES OUT\nCity defender John Stones was substituted at halftime because of a muscle problem and could be out for a while,\" Guardiola said.\n\"It is a pity, it is bad news for us. I don't know how long (it will be).\"",
  "word_count": 486,
  "scraped_at": "2026-02-14T02:17:09.423830",
  "_text_extracted": true
}