{
  "article_id": "0ae808982efb",
  "url": "https://www.teamtalk.com/news/liverpool-tottenham-leapfrog-man-utd-e90m-striker-signing-condition-january-transfer-revealed",
  "title": "Liverpool and Tottenham leapfrog Man Utd for €90m striker signing , as  concrete talk held and condition for January transfer revealed",
  "date": "20241226T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool and Tottenham leapfrog Man Utd for €90m striker signing, as ‘concrete talks’ held and condition for January transfer revealed\nA striker previously signed for €90m has a ‘strong chance’ of moving to the Premier League next month, and Manchester United have been overtaken by Liverpool and Tottenham in the race to seal a risky deal, according to a report.\nLiverpool, Tottenham and Man Utd are all looking to strengthen in the winter window for wildly differing reasons. Liverpool hope to maintain their title charge, while Spurs and Man Utd simply hope to get their campaigns back on track.\nWith Manchester City’s struggles showing no sign of easing, fourth spot and Champions League football does appear to be up for grabs for any team who can put a run of results together in the second half of the season.\nOne player the three clubs are all taking a close look at is PSG striker, Randal Kolo Muani. The Frenchman – signed from Eintracht Frankfurt for €75m plus €15m in add-ons back in 2023 – is not in manager Luis Enrique’s plans. As such, the striker has the green light to leave next month.\nL’Equipe previously claimed Man Utd were keen to strike a deal with PSG who are open to a six-month loan that contains an option/obligation to buy.\nBut according to a fresh update from Sky Germany’s Florian Plettenberg, Man Utd do not expect to sign Kolo Muani in January. What’s more, the reporter revealed Premier League rivals Liverpool and Tottenham are now circling.\nHowever, one factor each of the interested sides must carefully weigh up is the new claim PSG will insist on an obligation to buy – not an option – being included.\nTaking to X, Plettenberg stated: “Randal Kolo Muani is set to leave PSG during the winter transfer window.\n“Concrete talks with potential teams about a loan deal are ongoing. PSG would like to include an obligation to buy.\n“Currently, there is a strong chance he will move to the Premier League. Understand Liverpool have gathered information, but nothing further has happened yet.\n“Manchester United are monitoring the situation, but Man Utd do not currently expect a transfer to happen in January. Tottenham and RB Leipzig are interested. More teams keen on him.”\nGame over for Kolo Muani at PSG\nKolo Muani remains a key performer for Didier Deschamps and his France side, with the frontman racking up 14 appearances and scoring six goals for Les Bleus in 2024.\nHowever, his importance and influence at club level has shrunk. Indeed, Kolo Muani has been afforded just 350 minutes of action in Ligue 1 this term.\nEnrique has largely favoured Marco Asensio in the central striking role. Others including Goncalo Ramos, Ousmane Dembele and most recently Desire Doue have got the nod, with Kolo Muani’s last league start coming all the way back on October 6.\nOf the three English sides showing interest, it’s unquestionably a move to Liverpool that would come as the biggest surprise.\nArne Slot already possesses Diogo Jota and Darwin Nunez for the centre-forward role. He’s also found great success when deploying Luis Diaz as a makeshift striker in recent weeks.\nLatest news – Liverpool contracts / Tottenham signing / Rashford, Garnacho issue\nIn other news, TEAMtalk has taken a deep dive into the last 10 Liverpool players to sign a new contract aged 30-plus. Virgil van Dijk and Mohamed Salah – both of whom already feature on the list – will re-enter the picture if they pen fresh terms.\nElsewhere, Tottenham are reportedly stepping up their pursuit of Atalanta defender, Ben Godfrey.\nSpurs are determined to add to their injury-ravaged backline in January and the former Everton man can be signed on a six-month loan.\nFinally, Marcus Rashford and Alejandro Garnacho have been told what their biggest problem at Man Utd is and Ruben Amorim is partly to blame.",
  "word_count": 648,
  "scraped_at": "2026-02-14T01:58:00.742694",
  "_text_extracted": true
}