{
  "article_id": "0b086aadb9b3",
  "url": "https://theathletic.com/4227616/2023/02/20/andoni-iraola-how-the-would-be-leeds-coach-is-inspiring-rayo-vallecano-with-bielsas-ideals/",
  "title": "Andoni Iraola : How the would - be Leeds coach is inspiring Rayo Vallecano with Bielsa ideals",
  "date": "20230220T164500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rayo Vallecano coach Andoni Iraola gave a wry smile when he was told he looked disappointed after his side’s 1-1 draw at home to Sevilla on Sunday, which Rayo largely dominated.\n“It’s what these players have earned over these seasons,” Iraola said in his post-match press conference. “Sevilla were also happy with the point and they defended well. But I am happy as the feeling was that if the game went on a bit longer, we would have won. Last year we also drew with them here, but the feeling today is much better.”\nAdvertisement\nThe Rayo coach, his players and most of the team’s fans did see this as two points dropped, even though Sevilla’s expensively assembled squad started the season playing in the Champions League and the Andalusian side boast a La Liga salary budget four times bigger: Sevilla’s is €200million (£177.6m; $213.7) compared to Rayo’s €50m.\nThe feeling was a mark of how far Iraola and his team have come since they first joined forces in Segunda Division, the Spanish second tier, less than three years ago.\nAt 40 years old, Iraola is the youngest coach in La Liga and is also its fastest rising — as shown by the lengths Leeds United went to in trying to make him their new manager earlier this month, after seeing his high-tempo, high-pressing style as an extension of that employed by revered former boss Marcelo Bielsa.\nGO DEEPER\nIraola, Corberan and how Leeds United want the head coach search to work\nSevilla coach Jorge Sampaoli is another who has been heavily influenced by Bielsa, and he was full of praise for Rayo when asked to define their style in the Vallecas press room on Sunday evening.\n“They have conviction in what they are doing and are a team who are able to break barriers,” Sampaoli said. “They are a very brave side, who pressure the ball everywhere and do not let you play. We played against a very good team today.”\nAfter making 510 appearances for Athletic Bilbao and then finishing his playing career at New York City in Major League Soccer, Iraola began in management with Cypriot side AEK Larnaca, then returned to Spain and took Segunda side Mirandes to the Copa del Rey semi-finals.\nAfter joining Rayo in summer 2020, he guided them to promotion at the first time of asking via the play-offs. They had a superb first half of the 2021-22 La Liga campaign and finished a creditable 12th.\nThat first season included a 1-0 victory against Barcelona in what turned out to be Ronald Koeman’s last game as boss of the Catalan side, and they then went to Camp Nou and beat Xavi’s Barca team 1-0 late in the campaign.\nAdvertisement\nThis season, Rayo held Barca to a goalless draw at Camp Nou on the opening day and a few months later Rayo beat their more illustrious neighbours Real Madrid in a 3-2 thriller at Vallecas.\nAll this has been done on a shoestring budget: Rayo have the second-smallest stadium in La Liga and their salary limit ranks 16th among the competition’s 20 sides.\nWhile some coaches might complain about these restrictions, Iraola has turned it to his advantage, working with the same team over the long term so they got to know his ideas and their own team-mates’ strengths and weaknesses.\nThe first-choice XI (who started when they beat Madrid last November) contains eight players who achieved promotion from Segunda with their coach during the 2020-21 campaign.\nThe additions were right-back Ivan Balliu (a free transfer from Almeria), centre-back Florian Lejeune (on loan from Deportivo Alaves) and young forward Sergio Camello (on loan from Atletico Madrid); all smart deals that fitted well into the collective who were already at Vallecas.\nRayo’s core of players might have had no prior top-flight experience, but they complement each other extremely well and have grown to perfectly know their roles both on and off the ball in their 4-2-3-1 formation.\nThese established players include right-sided midfielder Isi Palazon (28), left-winger Alvaro Garcia (30), centre-back Alejandro Catena (28) and midfielders Santi Comesana (26) and Oscar Valentin (28), who have all progressed together and become well-established La Liga players.\nWhile club president Raul Martin Presa has somehow found money for big-name forwards Radamel Falcao and Raul de Tomas, Iraola has preferred to use the 22-year-old Camello, who is less clinical in front of goal but possesses the physical and tactical qualities the team need up top.\nAdvertisement\nAnd the data clearly shows a sustained upward trajectory from Iraola’s side, as well as their clear and cohesive game plan.\nWe can see from this graph of Rayo’s pressing intensity over the past 18 months that their PPDA (passes per defensive action) has steadily increased since they were promoted to La Liga.\nPPDA measures how many passes a team allows their opposition to make before they produce a defensive action, so we can see how active they are in looking to win the ball back. Iraola’s side started off with a slightly passive approach in August 2021 but, as confidence has grown along with tactical familiarity, they have become an incredibly aggressive team.\nIntense, front-footed defending and speedy, efficient transition play are the keystones to Iraola’s approach — much like with Bielsa, who once instructed the former right-back to tear down the line himself when they were together at Athletic Bilbao from 2011-13.\nA distinctive feature of Rayo’s game has been a desire to find the wings as much as possible, particularly on the left, where the lightning-quick Fran Garcia loves to gallop forward in support of his equally rapid namesake Alvaro Garcia.\nRayo launch 41.3 per cent of their attacks down the left-hand side, delivering more crosses from that area than any other side in the league. Fran Garcia’s fine performances led Real Madrid to activate a €10m buy-back clause to sign their former academy graduate, while Bayer Leverkusen were also interested.\nThose attacks are often launched quickly, mainly through incisive long passes from the right-footed, left-sided centre-back Catena. He has attempted the most long balls in La Liga this season and has also progressed the ball the furthest with his passes — ranking just above Real Madrid’s deep-lying playmaker Toni Kroos and ahead of Villarreal’s ball-playing defenders Raul Albiol and Pau Torres.\nCatena’s pass map reflects his direct approach. The defender is under instructions from Iraola to stretch the pitch vertically, opening space for creators Palazon and Oscar Trejo to receive the ball and then build attacks deep in opposition territory.\nBut Rayo are not a long-ball team who just get it forward and fight for second balls, as the graphic below shows. While they rank in the Champions League spots for PPDA, they are mid-table for long pass share and attack speed. Their average possession of 52.9 per cent and field tilt of 55.9 per cent are also impressive, showing how they control matches more often than not.\nIraola’s Rayo side are an incredibly smart team who play a thrilling brand of football. Their players may have taken a long route to the top half of La Liga, but they do have quality and work within a system that allows them to express this for the benefit of the team.\nAdvertisement\nThey have lost just twice in La Liga since October, while they have firmly positioned themselves in the fight for European qualification with 11 points from their last six games.\nIt was clear from Sunday’s game that Iraola’s team are much further along the road than Sampaoli’s Sevilla side in what is the Argentinian’s second spell at the club. Where that road will end for Rayo is now the big topic of debate and excitement around Vallecas.\nThe team’s Bukaneros (The Buccaneers) Ultras fan group have been heard chanting “Next season, Rayo v Liverpool” and the point against Sevilla kept them sixth in the table, meaning they are well-placed to play in European competition next year for just the second time in the club’s history.\nWhether a meeting with Liverpool takes place in the 2023-24 season might depend more on whether Jurgen Klopp’s team can find more consistency and qualify for either the Europa League or UEFA Conference League given their struggles this season.\nIraola declined Leeds’ approach and stuck to his contract at Rayo, which ends in June. There is huge interest now in what he might do next and widespread expectation that he will soon be coaching a club with more resources than cash-strapped Rayo.\nIt would be fascinating to see how he performs with higher-profile players and a sizeable transfer budget. Although, given how he has turned Rayo’s limitations to their advantage, more resources could also bring more challenges and headaches.\nWhatever happens, Iraola will almost certainly come up against Premier League opposition soon enough, whether as a coach working in England or playing against English sides in European competition.\nGO DEEPER\nReal Sociedad are Barca and Real Madrid's closest challengers, but where are the others?\nRayo dominated possession against Sevilla (58 per cent compared to 42 per cent) and produced more shots than their opponents (18 shots to Sevilla’s seven; five and two shots on target respectively). Given Sevilla’s goal came from a deflection, Iraola could have spoken about his team’s bad luck afterwards or criticised the decision not to award a penalty for a challenge on De Tomas late on.\nInstead, he chose to focus on another fine performance from his players.\n“These players have earned the right to take on opponents like this as equals,” Iraola said.\nAdvertisement\n“Sevilla are a good team, have been playing well, we went to pressure them, and they got in behind us a few times. Still, we kept insisting and the idea of the team did not change. I’m happy with how we played; it was a very difficult game, but we were Rayo Vallecano.”\n(Top photo: Diego Souto/Quality Sport Images/Getty Images)\nThe Athletic’s Spanish football coverage has expanded…\n- La Liga news, La Liga table; La Liga fixtures and results\n- Dermot Corrigan is joined by four new writers…\n- Real Madrid news from Mario Cortegana and Guillermo Rai\n- Barcelona news from Pol Ballús and Laia Cervelló Herrero",
  "word_count": 1705,
  "scraped_at": "2026-02-14T02:24:32.671241",
  "_text_extracted": true
}