{
  "article_id": "0b4af956b942",
  "url": "https://theathletic.com/4510680/2023/05/12/gronnemark-liverpool-throw-in-coach/",
  "title": "Throw - in coach Gronnemark :  Working for Liverpool opened up the world for me  ",
  "date": "20230512T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There’s a moment Thomas Gronnemark will always cherish from his five-year association with Liverpool.\nThe setting was a supermarket close to his home in Denmark shortly after Liverpool were crowned Premier League champions in June 2020.\n“I was shopping for some groceries when I realised this old guy, who must have been around 70, was looking over at me,” he recalls.\nAdvertisement\n“He came over, pulled up his sleeve and showed me this big LFC tattoo he had on his arm with ‘You’ll Never Walk Alone’ and the club badge on it. He started crying and told me he was a lifelong fan who had waited 30 years to see Liverpool win the title again. There was a lot of emotion. He was so thankful.\n“That meant a lot to me. It makes you realise you’ve been a part of something really special — a huge achievement in the club’s history.”\nPundits initially scoffed when Jurgen Klopp added the world’s first throw-in coach to his backroom staff in the summer of 2018.\nHowever, over the past five years, the value of his input has been recognised across the globe. He has gone on to work for some 25 professional clubs, including Dutch giants Ajax, MLS Cup finalists Philadelphia Union, Brazilian outfit Flamengo and French Cup winners Toulouse.\n“During that period, the teams I’ve worked with have won 14 titles (trophies), but the biggest thing for me is the relationships you establish with coaches and players,” he insists.\n“My motivation has been to improve throw-ins all around the world. I’ve been part of a real throw-in movement. There are around 40 to 60 of them in every match. People now see the importance and the potential of them.”\nAll good things come to an end.\nLiverpool and I have decided not to continue our agreement about the throw-in coaching after five great seasons.\nI´m proud of being a part of taking LFC from 18th to 1st in the Premier League on throw-ins under pressure. 1/6 (video in the end) pic.twitter.com/tOaEjERxXu— Thomas Gronnemark (@ThomasThrowin) May 10, 2023\nGronnemark’s data shows Liverpool were 18th in the Premier League in 2017-18 with a success rate of just 45.4 per cent when it came to keeping possession from their throw-ins under pressure. By the end of his first season, which culminated in Champions League glory in Madrid, Liverpool were leading the way with a success rate of 68.4 per cent. Klopp’s men went on to score 13 goals from throw-ins during the title-winning campaign of 2019-20.\nAdvertisement\nHowever, the nature of Gronnemark’s role at Liverpool changed in the wake of the Covid-19 pandemic, with less time spent on the training ground. Increasingly, he has worked remotely, sending Klopp and the coaching staff his analysis report of throw-ins after every game.\nLiverpool recently decided not to renew his contract when it expires at the end of May — but the split is amicable.\n“Over the past five seasons, Liverpool have scored between 10 and 15 goals per season from throw-in situations. Mostly from ours but also some from opponents’ throws. It’s so satisfying when that happens,” says Gronnemark.\n“I’d say in my first two seasons our throw-ins were really great. That was when I was working with the players face to face for a week four or five times a season. Then things changed due to Covid and they never went back to how they were. I only had two visits last season. I was at the training ground a few weeks ago but that was the first time since last July.\n“When you go nine or 10 months without seeing players, you then spend a lot of time doing recaps, so you cannot really work on new stuff. From my perspective, it was a bit frustrating. I feel I can have my biggest influence out on the pitch.\n“I was clear with the club that I felt their throw-in level had gone from great to good this season. If you look at the recent game against Nottingham Forest, the team conceded from bad situations at throw-ins. Going from great to good is not satisfactory for me.\nThank you for a great time and cooperation, to Liverpool FC and Jürgen Klopp, the staff and players. We had a fantastic ride. 4/6\n— Thomas Gronnemark (@ThomasThrowin) May 10, 2023\n“I told the club that I felt the best solution was to increase the number of visits next season so I could work deeper with the players. The second best solution was not continuing at LFC because I can’t have a proper influence going so long between visits.\nAdvertisement\n“The response from the club was that they didn’t think going back to four or five visits a season would be possible and that they will try to work with the throw-ins themselves going forward. I’m not angry, I respect their decision and I’ll always be thankful for the amazing opportunity they gave me.”\nGronnemark grew up in Horsens, in the east of Denmark, and was a promising young striker with great pace before turning his attention to athletics. With a 100m personal best of 10.61 seconds, he represented his country on the track before becoming part of the Danish bobsleigh team.\nWatching football, he became increasingly convinced that the importance of throw-ins was massively underestimated by coaches and vowed to do something about it.\nHis ability to coach long throws — he held the world record of 51.33m between 2010 and 2021 — was embraced by Danish clubs Viborg FF and FC Midtjylland. But he struggled to find a club willing to incorporate the drills he had come up with for ‘fast and clever’ throws to help teams create space and retain possession.\nThe phone call he received from Klopp in July 2018 proved to be life-changing. The Liverpool boss had read a story in a German newspaper about how Borussia Monchengladbach’s Andreas Poulsen had improved his long throws from working with Gronnemark at Midtjylland.\n“I’d been coaching in the Danish Super League since 2007 and I had all this knowledge from the ‘long, fast and clever throws’ philosophy I’d written, but no one wanted it,” he says.\n“They only wanted the long throws, they thought I was crazy. When you score from a long throw it’s clear what a weapon you have, but sometimes it’s about creating space, keeping the ball, switching play and then scoring say 15 seconds later.\n“I’ll forever be thankful that Jurgen called me that day. The fact he believed in me and wanted me on board created a lot of interest in my coaching.\nAdvertisement\n“Working for Liverpool opened up the world for me. It’s been good for the club and good for me. It proved to be my international breakthrough. I’ve been contacted via my website by thousands of coaches from over 100 countries.\n“I have the best memories from Liverpool. It’s such a fantastic city and maybe I’ll come back and work for them again in the future. Now new opportunities await.”\nGronnemark has already signed contracts with three clubs for next season and is in discussions with various others. In terms of the Premier League, he has also previously worked at Brentford and is open to offers.\nHe’s had the last laugh on the pundits who mocked him when he first arrived at Liverpool. Former Everton striker Andy Gray was among them when he chuckled on beIN Sports: “Here’s the ball, pick it up with both hands, take it behind your head and throw it with both feet on the ground. I’ve got a new one for you, I want to be the first kick-off coach.”\nGronnemark adds: “This kind of criticism comes from people who are talking about something they aren’t knowledgeable about, so it’s quite easy to brush off. If a young child said you are a bad journalist you wouldn’t get offended because it’s coming from someone who doesn’t know anything about writing. It’s the same.\n“I don’t care about what Andy Gray or Richard Keys or Steve Nicol thinks. Some people will always be sceptical about something new and innovative, but they won’t stop me in my journey.”\n(Top photo: Nick Taylor/Liverpool FC/Liverpool FC via Getty Images)",
  "word_count": 1372,
  "scraped_at": "2026-02-14T01:48:17.248606",
  "_text_extracted": true
}