{
  "article_id": "0b524e5a5749",
  "url": "https://www.bbc.com/sport/football/articles/c5yx0d4zzyzo",
  "title": "England squad : Taylor Harwood - Bellis and Lewis Hall given first call - ups",
  "date": "20241107T194500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harwood-Bellis and Hall given first England call-ups\n- Published\nEngland interim manager Lee Carsley has handed first call-ups to Southampton defender Taylor Harwood-Bellis and Newcastle United full-back Lewis Hall for this month's Nations League fixtures.\nThe Three Lions face Greece on 14 November and Republic of Ireland on 17 November.\nIt is Carsley's final England squad as interim manager before Thomas Tuchel takes charge on a full-time basis in January 2025.\n\"He [Tuchel] hasn't had any influence on the squad selection,\" said Carsley.\n\"I congratulated him via text. He is highly respectful of the job I am doing. I see this as a massive privilege, the trust the FA has placed in me and my team.\"\nTuchel a 'great appointment' for England - Potter\n- Published23 October 2024\nTuchel is proven - Walker on new England manager\n- Published18 October 2024\nFA and FAI fined by Uefa after fans booed anthems\n- Published6 November 2024\nHarwood-Bellis, 22, joined Southampton on a permanent basis in July after helping the Saints to promotion during a season-long loan move from Manchester City in the 2023-24 season.\nHe has made 13 appearances for Russell Martin's side this season, scoring three times.\nHall, 20, joined Newcastle in a £28m deal from Chelsea in July after spending the previous campaign on loan in the north east of England.\nThe left-back has appeared in all 10 of Newcastle's Premier League matches this season, starting seven.\n\"They're both players who have played a lot of minutes this season and have shown they can consistently play in the Premier League at a high level,\" said Carsley.\n\"Players that I both know really well. I've known Taylor from Man City and captaining the Under-21s, having a successful summer with promotion and playing in the Premier League week in and week out, he's a player that really deserves it.\n\"He's an outstanding captain and a brilliant example to the rest of the players in the under-21s squad.\n\"Lewis is a player who's taken his time to settle in - he's high quality, left-footed and a player who deserves to be in and has shown he can be really consistent.\"\nLiverpool midfielder Curtis Jones has earned a call-up after he pulled out of October's squad for the birth of his child.\nThe 23-year-old, who won the European Under-21 Championship under Carsley in 2023, is yet to make his debut for the national side.\n\"Curtis is an all-round player, who plays in various positions,\" said Carsley.\n\"He is a player I highly rate, he's one of the best I've worked with in terms of ability. He is showing consistency at a high level now. He can score goals, assist and is player we've had a lot of success with in the past.\"\nManchester City defender John Stones is absent after missing the past two matches with a foot injury, but club-mate Jack Grealish is included despite sitting out their past five matches because of injury.\nCarsley said England were in contact with City's medical staff and \"expects Jack to be fit\" for the matches.\n\"He [Grealish] has trained the last couple of days, he’ll come in, we’ll assess him, make sure he’s ready to play. I think he’s an important player, not just for this camp but for the future,\" added England's interim boss.\n\"He’s an infectious character throughout the changing room, on and off the pitch, you can see he enjoys playing for England so he’s a player we wanted to give as long as we could.\"\nChelsea winger Cole Palmer has been selected, despite being an injury doubt for Sunday's Premier League match against Arsenal.\nArsenal midfielder Declan Rice is called up despite missing the Gunners' 1-0 defeat by Inter Milan in the Champions League on Wednesday.\nThe 25-year-old has suffered a broken toe but is set to continue playing despite the injury.\nSouthampton's Aaron Ramsdale is selected ahead of Newcastle goalkeeper Nick Pope, while Manchester United duo Kobbie Mainoo and Harry Maguire miss out through injury.\nCarsley to rejoin Under-21s\nCarsley also confirmed that will return to coaching England's Under-21s when his spell in charge of the senior team comes to an end.\nThe 50-year-old was handed the reins on a temporary basis after Gareth Southgate stepped down in July following England's defeat by Spain in the Euro 2024 final.\nCarsley previously said he \"hoped\" to revert to his previous role but was now definitive about his future.\n\"My role will be back with the Under-21s. A role that I'm really privileged to do, there's full support for the senior team,\" he said.\n\"The job and the role is clear, to help produce and develop players for the senior team. And I think I'm in a better position to do that now I've seen the level that the seniors are operating at.\"\nCarsley rewarding young Lions - analysis\nAlex Howell, BBC Sport senior football news reporter\nThroughout the three camps Carsley has led he has called upon players who he knows from his time as England Under-21s boss.\nCarlsey led the U21s as they won the Euros in Georgia in 2023 and he has rewarded those players who lifted the trophy with him.\nHe has not gifted any caps and the young players he has introduced have been in good form, but it has definitely helped that he has worked with them before.\nThere are eight members of the squad who won that trophy under Carsley in this latest England senior squad, and seven of them started the final against Spain.\nEngland squad\nGoalkeepers: Dean Henderson (Crystal Palace), Jordan Pickford (Everton), Aaron Ramsdale (Southampton)\nDefenders: Trent Alexander-Arnold (Liverpool), Levi Colwill (Chelsea), Marc Guehi (Crystal Palace), Lewis Hall (Newcastle United), Taylor Harwood-Bellis (Southampton), Ezri Konsa (Aston Villa), Rico Lewis (Manchester City), Kyle Walker (Manchester City)\nMidfielders: Jude Bellingham (Real Madrid), Phil Foden (Manchester City), Conor Gallagher (Atletico Madrid), Morgan Gibbs-White (Nottingham Forest), Angel Gomes (Lille), Curtis Jones (Liverpool), Cole Palmer (Chelsea), Declan Rice (Arsenal)\nForwards: Anthony Gordon (Newcastle United), Jack Grealish (Manchester City), Harry Kane (Bayern Munich), Noni Madueke (Chelsea), Bukayo Saka (Arsenal), Dominic Solanke (Tottenham Hotspur), Ollie Watkins (Aston Villa)\nWhat do England need in Nations League?\nEngland are second in Nations League B Group 2 after four games - three points behind leaders Greece with two matches left to play.\nTheir Nations League campaign will not only have a bearing on which level they next play in the competition, but could also improve their chances of qualifying for the next World Cup.\nThey would earn automatic promotion by winning their group, while finishing second would set up a play-off against a side that finishes third in League A.\nThe draw for those play-offs will be made on 22 November, with the matches to be played in March.\nAs an aside, countries that win their Nations League group earn a place in the qualifying play-offs for the 2026 World Cup, should they fail to qualify for the competition by normal means.\nThe 12 group winners in Europe's World Cup qualifying will go through to the finals automatically, while the 12 runners-up go into the play-offs, which will also include the four Nations League group winners with the best records that did not make it out of their World Cup group.",
  "word_count": 1210,
  "scraped_at": "2026-02-14T02:02:07.198509",
  "_text_extracted": true
}