{
  "article_id": "0b76267f144f",
  "url": "https://www.fourfourtwo.com/features/afcon-2023-stadiums-host-cities-capacities-and-everything-you-need-to-know",
  "title": "AFCON 2023 stadiums : Host cities , capacities , and everything you need to know",
  "date": "20240108T174500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AFCON 2023 stadiums: Host cities, capacities, and everything you need to know\nThere are six AFCON 2023 stadiums in Ivory Coast, all of which are either purpose-built or significantly renovated\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSix AFCON 2023 stadiums in Ivory Coast will have the honour of hosting this year's tournament.\nAfter a two-year postponement, due to the adverse summer weather concerns in Ivory Coast, the west-African nation will deliver the 34th edition of AFCON in four brand new stadiums and two renovated grounds.\nHere, FourFourTwo gives you the lowdown on all six host stadiums.\nAFCON 2023 stadiums\nStade Olympique Alassane Ouattara\nCity: D’Ebimpé (North of Abidjan)\nCapacity: 60,000\nOpened: 2020\nThis new sports facility lies in the commune of Anyama, in the northern outskirts of Abidjan, with building work commencing in 2016 with a view to host matches during the AFCON.\nIt took four years to complete, with the stadium and the infrastructure around it costing an estimated $260m. China covered a significant part of it as a gift for their 30-year trade cooperation anniversary in 2013. The ground, which was designed and constructed by Chinese companies, is a little reminiscent of other grounds in China.\nThe modern stadium, which has an access control system, has a capacity of approximately 60,000 seats. During the tournament, the stadium houses large VIP areas for CAF [Confederation of African Football] and government members, including private boxes.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAfter the tournament the ground will be used as the main stadium for the national team. They will also play in other venues to maintain the connection with people\nthroughout the country, but this will act as the main ground for all the national men’s and women’s teams. Besides that, the venue can also be used for major Athletics and Rugby matches.\nGames at Stade Olympique Alassane Ouattara:\n- January 13: Ivory Coast vs Guinea Bissau (Group A)\n- January 14: Nigeria vs Equatorial Guinea (Group A)\n- January 18: Equatorial Guinea vs Guinea-Bissau (Group A)\n- January 18: Ivory Coast vs Nigeria (Group A)\n- January 22: Equatorial Guinea vs Ivory Coast (Group A)\n- January 22: Mozambique vs Ghana (Group B)\n- January 28: Last 16\n- February 2: Quarter-final\n- February 7: Semi-final\n- February 11: Final\nStade Felix Houphouet Boigny\nCity: Abidjan\nCapacity: 33,000\nOpened: 1964\nThe Felix Houphouet Boigny Stadium, which is also known as “Le Félicia”, is located in the centre of Abidjan, which used to be the main stadium for the national team until the Olympique Alassane Ouattara stadium was built.\nThe Felix Houphouet Boigny Stadium is named after the first president of Ivory Coast. In 1984 the stadium staged the final of the AFCON; the other time Ivory Coast hosted the tournament. Since then, the stadium staged tournaments like the 2009 African Championship of Nations and the 2017 Jeux de la Francophonie.\nDuring those years, two major incidents took place as well, as on March 29, 2009, a gateway gave way before kick-off of a World Cup qualifier between Ivory Coast and Malawi, resulting in a stampede. On January 1, 2013, another stampede took place after people departed a New Year’s Eve fireworks display in the early hours of the morning. Both incidents caused numerous deaths and injuries.\nOver the years the ground has been renovated a few times, with the latest redevelopment taking place in 2021 to upgrade it for the AFCON.\nGames at Stade Felix Houphouet Boigny:\n- January 14: Egypt vs Mozambique (Group B)\n- January 14: Ghana vs Cape Verde (Group B)\n- January 18: Egypt vs Ghana (Group B)\n- January 19: Cape Verde vs Mozambique (Group B)\n- January 22: Guinea Bissau vs Nigeria (Group A)\n- January 22: Cape Verde vs Egypt (Group B)\n- January 27: Last 16\n- January 29: Last 16\n- February 2: Quarter-final\n- February 10: Third place play-off\nStade Laurent Pokou\nCity: San-Pedro\nCapacity: 20,000\nOpened: 2023\nThis ground is one of the newly built venues for the tournament, which has 20,000 fully covered seats. The stadium is named after Laurent Pokou, the Ivorian football legend who has scored 14 goals in the AFCON (a record until 2008). He also gives his name to the official match ball of the tournament.\nThe ground is also an Olympic stadium, that can stage athletic tournaments. Building work commenced in April 2019 and was finished in September 2023, a bit later than scheduled due to covid-19. Although the stadium is only just opened, it already staged several women’s Champions League matches and also the last match of the Africa Cup of Nations qualification between Ivory Coast and Lesotho.\nAfter the AFCON the stadium will be used by several teams from San-Pedro, who had to play their home matches in other cities like Abidjan before. There has been an investment in the training facilities for the competing AFCON teams in the city as well, and they will be also used by smaller local teams after the tournament, thus making it an investment for the future and fulfilling its legacy goal.\nGames at Stade Laurent Pokou:\n- January 17: Morocco vs Tanzania\n- January 17: DR Congo vs Zambia\n- January 21: Morocco vs DR Congo\n- January 21: Zambia vs Tanzania\n- January 24: Namibia vs Mali\n- January 24: Zambia vs Morocco\n- January 28: Last 16\n- January 30: Last 16\nStade Charles Konan Banny\nCity: Yamoussoukro\nCapacity: 20,000\nOpened: 2022\nIt is one of the main sports facilities in the city, which is the capital of the country. It’s a new ground, where the building work started in January 2019 and finished in May 2022. A few days after the opening it staged already a big game as Ivory Coast hosted Zambia in an Africa Cup of Nations qualifying match.\nThe stadium, which has room for up to 20,000 spectators, was planned to be built in 24 months, but this one also took longer because of Covid. A lot of local workers were employed to work on the stadium as the idea was to give local people a job. After the AFCON the stadium will be used for local football teams.\nIn Yamoussoukro there is also The Basilica of Our Lady of Peace, a Catholic\nminor basilica which is among the largest churches in the world.\nGames at Stade Charles Konan Banny:\n- January 15: Senegal vs Gambia (Group C)\n- January 15: Cameroon vs Guinea (Group C)\n- January 19: Senegal vs Cameroon (Group C)\n- January 19: Guinea vs Gambia (Group C)\n- January 23: Guinea vs Sengal (Group C)\n- January 23: Angola vs Burkina Faso (Group D)\n- January 29: Last 16\n- February 3: Quarter-final\nStade de la Paix\nCity: Bouake\nCapacity: 40,000\nOpened: 1984\nThis ground was built to host the matches of the 1984 African Cup of Nations, alongside the Felix Houphouet Boigny Stadium in Abidjan. A big renovation took place before the upcoming AFCON, which started in June 2019 and was eventually ready in March 2023 when the stadium hosted several matches.\nIt now holds a capacity of around 40.000. Like most of the other stadiums, the seats are decorated in green, white and orange, representing the national flag of Ivory Coast.\nGames at Stade de la Paix:\n- January 15: Algeria vs Angola (Group D)\n- January 16: Burkina-Faso vs Mauritania (Group D)\n- January 20: Algeria vs Burkina-Faso (Group D)\n- January 20: Mauritania vs Angola (Group D)\n- January 23: Gambia vs Cameroon (Group C)\n- January 23: Mauritania vs Algeria (Group D)\n- January 27: Last 16\n- February 3: Quarter-final\n- February 7: Semi-final\nStade Amadou Gon Coulibaly\nCity: Korhogo\nCapacity: 20,000\nOpened: 2023\nThis venue is one of the four grounds which has been newly built. The stadium is named after the late Ivory Coast prime minister Amadou Gon Coulibaly, who served from 2017 to 2020. He died in office in July 2020 and shortly after it was decided to name the stadium after him.\nThe ground was officially opened in November 2023 and was a host venue for the 2023 women’s Champions League tournament, alongside San-Pedro. With a capacity of 20,000 seats, the Poro region stadium, which is in the north of Ivory Coast, has a football-rugby field, fully covered stands and a tartan athletics track. Around the city there are four training centres as well.\nGames at Stade Amadou Gon Coulibaly:\n- January 16: Tunisia vs Namibia (Group E)\n- January 16: Mali vs South Africa (Group E)\n- January 20: Tunisia vs Mali (Group E)\n- January 21: South Africa vs Namibia (Group E)\n- January 24: South Africa vs Tunisia (Group E)\n- January 24: Tanzania vs DR Congo (Group F)\n- January 30: Last 16\nArthur Renard has been writing for FourFourTwo since 2013, when Ronald Koeman hosted him for a Readers interview in a small room in stadium De Kuip. Two years later Arthur moved to London, where he still lives and from where he covers English football, while he has also been travelling the world to cover events like the World Cup and Copa America.\n- Ryan DabbsStaff writer",
  "word_count": 1643,
  "scraped_at": "2026-02-14T02:07:39.570571",
  "_text_extracted": true
}