{
  "article_id": "0b7e0307a56a",
  "url": "https://metro.co.uk/2025/04/18/arsenal-liverpool-man-utd-learn-new-price-sign-hugo-ekitike-22935542/",
  "title": "Arsenal , Liverpool and Man Utd learn new price to sign Hugo Ekitike",
  "date": "20250418T220000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal, Liverpool and Manchester United have been set a new price to sign Eintracht Frankfurt striker Hugo Ekitike this summer.\nEkitike has garnered the attention of a host of top clubs throughout Europe after his breakout season in the Bundesliga with Frankfurt.\nHaving struggled early in his career after a move to Paris Saint-Germain, the 22-year-old refound his form on loan at Frankfurt last season and has gone from strength to strength since signing permanently last summer.\nThe Frenchman has notched up 14 goals and five assists in 28 league appearances to help Frankfurt into third position and on track to qualify for next season’s Champions League.\nDespite his impressive performances, however, the German club are said to be preparing for his departure in the summer, with several clubs interested in his signature.\nInitially, it was thought that a fee in the region of €80million (£68m) would be enough to convince Frankfurt to part ways with their prized asset.\nBut Sky Sports Germany are now reporting that the German club have raised their asking price and will instead demand a transfer fee of €100million (£85m).\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSuch news may come as a blow to several Premier League clubs who had viewed Ekitike as a more budget-friendly option for the summer transfer window.\nArsenal, in particular, are already said to have enquired about the Frenchman as they make signing a recognised a striker their number-one priority for the summer.\nThe Gunners have long admired Alexander Isak but may have to look elsewhere if they cannot put up the record-breaking fee likely required to coax the Swede away from Newcastle.\nLiverpool have also been credited with interest in the 22-year-old, particularly if they chose to offload the misfiring Darwin Nunez this summer.\nAnd Manchester United have also been linked with a move as Ruben Amorim searches for an upgrade to Rasmus Hojlund and Joshua Zirkzee who have both flattered to deceive since their respective moves to Old Trafford.\nCarragher wants Liverpool to sign Ekitike\nEkitike’s build and play style have drawn obvious comparisons with the aforementioned Isak, who has already shown his capabilities in the English top-flight.\nMore Trending\nAnd Liverpool legend Jamie Carragher believes the Frenchman would be a great fit at Anfield and a more realistic signing for his former club than Isak this summer.\n‘There’s the lad at Eintracht Frankfurt, Ekitike. That smacks to me the kind of player that Liverpool would sign,’ Carragher said on the latest It’s Called Soccer! podcast.\n‘He’s 22, he’s at a club where you think they could be a selling club. He’s done really well there.\n‘He went to PSG as a really young boy after lighting up the French league as a young kid and it didn’t quite work out for him, but he’s still really young, got great numbers and it almost looks to me like the type of player that Liverpool would sign rather than maybe going for an Isak.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Harry Redknapp makes bold Harry Maguire claim after Man Utd star’s heroics against Lyon\nMORE: Man Utd emerge as ‘front-runners’ to sign £70m Chelsea and Liverpool transfer target\nMORE: Man Utd flop says ‘personal life’ was reason for his poor form",
  "word_count": 606,
  "scraped_at": "2026-02-14T01:58:31.721600",
  "_text_extracted": true
}