{
  "article_id": "0b8248e4ad3f",
  "url": "https://thepeoplesperson.com/2025/05/01/marcus-rashford-is-criticised-for-choosing-to-miss-aston-villas-fa-cup-semi-final-293499/",
  "title": "Marcus Rashford is criticised for the  circus  he attracts off the pitch - Man United News And Transfer News",
  "date": "20250501T143000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marcus Rashford has been criticised for the “circus” he attracts off the pitch by former Manchester United goalkeeper Ben Foster who believes Aston Villa should avoid signing the 27-year-old permanently this summer.\nThe forward swapped Old Trafford for Villa Park at the end of the January transfer window to join the Villains on loan until the end of the season after a public dispute with Ruben Amorim.\nUnai Emery played a key role in convincing Rashford to complete the move – which contains a £40 million buy-clause – with the Spanish manager believing the 27-year-old still retains the ability to be one of the most effective forwards in Europe.\nAnd Emery has fully backed Rashford since he arrived in Birmingham, choosing to start him up front over first-choice number nine Ollie Watkins against Paris Saint-Germain in the Champions League quarter-final.\nAn unfortunate hamstring injury has since effectively ended Rashford’s season with United and Villa “in talks” over an early return to Old Trafford to complete his rehabilitation.\nBut it meant Rashford was unable to play in last weekend’s match at Wembley against Palace, as Villa’s disappointing end to the season continued with a comprehensive 3-0 loss.\nJust hours later, the England international was spotted at the Tottenham Hotspur Stadium for the boxing main event between Chris Eubank Jnr and Conor Benn – a move described as “tone deaf” by one Villa fan, despite other professional footballers also being in attendance.\nAnd Foster contends this choice is one which Emery will not have been happy with and that Villa would be able to spend £40 million “better elsewhere”.\n“I don’t think he’s a £40m player for Villa,” Foster said on his Fozcast podcast. “With Marcus Rashford, comes too much of a circus. There always just seems to be too many other stories and it’s not always about football.\n“There’s always something else with the boxing match and going to that but not going to the game. I just don’t think Unai Emery wants that and I don’t think he needs that. He’ll be able to spend £40m elsewhere, and I think you’ll get better results in a bigger picture by doing it that way.”\nRashford is reported to be waiting until the summer to make a decision on his future with Champions League football thought to be key in his next step, with continued interest from Barcelona and Paris Saint-Germain.\nIt is important to note, however, that Rashford was in attendance at Wembley for the semi-final, despite Foster’s claims the 27-year-old had missed it, as he was spotted interacting with supporters in one of the stadium’s lounges.\nFeatured image Mike Hewitt via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 448,
  "scraped_at": "2026-02-14T01:58:31.684321",
  "_text_extracted": true
}