{
  "article_id": "0b8e5e8f19c7",
  "url": "https://www.meathchronicle.ie/2023/08/15/focus-on-spain-ahead-of-their-world-cup-final-showdown-with-england-or-australia/",
  "title": "Focus on Spain ahead of their World Cup final showdown with England or Australia",
  "date": "20230815T131500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Focus on Spain ahead of their World Cup final showdown with England or Australia\nBy PA Sport Staff\nSpain will face either European champions England or co-hosts Australia in Sunday’s World Cup final after a dramatic 2-1 victory in their last-four showdown with Sweden.\nJorge Vilda’s side, who had never won a knockout game at the tournament before their arrival in Australia and New Zealand, could be just 90 minutes away from lifting the biggest prize of all.\nHere, the PA news agency takes a closer look at a team which have perhaps already-exceeded even their own expectations.\nCoach\nVilda learned his football at the feet of his father Angel, who worked as a physical trainer for – among others – Luis Aragones at Atletico Madrid, Johan Cruyff at Barcelona and Jupp Heynckes at Real Madrid.\nA physical education graduate, the 42-year-old was appointed boss in 2015 having worked with Spain’s under-age teams, but had to significantly remodel his squad after a rebellion in 2022 which saw 15 players make themselves unavailable – Aitana Bonmati, Ona Batlle and Mariona Caldentey have since returned to the fold – in protest at the conditions under which they were having to operate.\nKey players\nTwice Ballon d’Or winner Alexia Putellas is undoubtedly the star of the Spain squad on paper, but having fought her way back from the anterior cruciate ligament injury she suffered on the eve of last summer’s Euros, the 29-year-old Barcelona midfielder has been used sparingly in the tournament and played only the opening 57 minutes of the semi-final, one of three starts to date.\nIn her absence, Bonmati, Alba Redondo and Jennifer Hermoso have each scored three times, but Barca team-mate and former international sprinter Salma Paralluelo, 19, has proved the woman for the big occasion with vital strikes from the bench in both the last eight and the semi-finals.\nPedigree\nSpain are playing at their third World Cup finals tournament, but had never before progressed beyond the last 16. They reached the quarter-finals at Euro 2022, where they led eventual winners England with six minutes of normal time remaining before going down 2-1 in extra-time. Ranked sixth in the world by FIFA, they are an emerging force in the international game and are bidding to add the senior World Cup to those they currently hold at under-17s and under-20s levels.\nStyle of play\nVilda favours a 4-3-3 formation and a possession-based game which he believes is aligned to the philosophy instilled by Cruyff during his time in charge at Barcelona. The system relies on high-tempo passing and movement and a relentless press in attack to create the space in which their highly-technical game-changers can thrive. Familiarity is a weapon too – seven of the starting XI against Sweden play their club football with Champions League winners Barca.",
  "word_count": 469,
  "scraped_at": "2026-02-14T02:00:36.668742",
  "_text_extracted": true
}