{
  "article_id": "0b9889b3807d",
  "url": "https://www.90min.com/posts/6-players-regret-not-moving-january-2024",
  "title": "6 players who will regret not moving in January",
  "date": "20240202T033000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "6 players who will regret not moving in January\n- The January transfer window closed across Europe on 1 February\n- A winter market light on big moves left plenty of players in a tricky spot\n- Sides including Arsenal & Man City didn't sell individuals that may regret hanging around\nRoy Keane's time as a footballer was laden with accolades and admiration but it was not without some missteps.\nYet, when reflecting on a playing career which included 11 red cards, boycotting a World Cup and getting pushed out of Manchester United, Keane chiefly regretted not leaving the Red Devils sooner.\n\"I wish I bloody had!\" the Republic of Ireland international seethed. \"Part of me is jealous now when I see other lads going abroad because it's a great experience for your family.\"\nAs the end of each transfer window comes and goes, there are scores of players who are lumbered with the same pang of remorse as Keane. Here are the individuals that may carry the most regret after staying put this January.\nAaron Ramsdale (Arsenal)\nIn October, Aaron Ramsdale admitted that he was \"suffering and hurting\" from his sharp slip down Arsenal's goalkeeping pecking order. Across the subsequent three months, Ramsdale has been afforded four appearances.\nArsenal's former number one has gotten the nod for a Champions League dead rubber, two cup games and a league trip to Brentford, the latter solely because David Raya cannot face his parent club. With Arsenal out of the Carabao and FA Cups, Ramsdale's only senior appearance between now and the end of the season will likely be the reverse league fixture against Brentford.\nHad the England international secured a January move, he would not be quite so fixated with Saturday 9 March.\nJoao Palhinha (Fulham)\nThomas Tuchel's interest in \"a real defensive midfielder\", namely one \"who is more concerned with defence than attacking the opposition box\", has existed since his appointment at Bayern Munich but evolved into an obsession as the summer window dragged on.\nJoao Palhinha came within a whisker of fulfilling Tuchel's deepest desires, even posing in the famous red kit before the deal fell through in the final hour. Bayern were still interested in Fulham's midfielder heading into the winter window but prioritised the arrival of right-back Sacha Boey for £25.6m - presumably to Tuchel's enduring chagrin.\nWhile comfortable Premier League safety is an impressive level to reach, it remains to be seen whether a genuine European behemoth such as Bayern will be quite so keen on Palhinha this summer, as he turns 29 and still has four years left on his contract.\nKarim Benzema (Al Ittihad)\nHampered by injuries, managerial clashes and an unforeseen Indian Ocean cyclone, Karim Benzema's six months in Saudi Arabia have not been entirely successful.\nThe former Ballon d'Or winner was heavily linked with a move away this winter - which 90min warned would have been very complex - that never materialised.\nRather than return to one of Europe's leading leagues, Benzema will spend the remainder of the campaign toiling away at the sharp end of an Al Ittihad side that lies seventh in the Pro League despite boasting a clear financial advantage over the majority of the division.\nSergio Gomez (Man City)\nLuis de la Fuente gave Sergio Gomez his debut for Spain's under-18s, under-19s and under-21s. Yet, there is no chance of the same man handing Gomez a spot in the senior squad for Euro 2024 given his distinct lack of first-team football for Manchester City.\nGomez is City's only orthodox left-back yet has been afforded as many appearances (ten) as infamous outcast Kalvin Phillips this season. The English midfielder secured his much-needed move away but Gomez was scarcely linked with a transfer, let alone close to getting one.\nWhether the former Barcelona academy player will be content with this bit-part role for the rest of the two-and-a-half years that are still on his City contract remains to be seen. But he'll have to grin and bear it for at least another six months.\nSerhou Guirassy (Stuttgart)\nRemember Krzysztof Piatek? The Polish poacher emerged from nowhere in 2018, riding an unsustainable hot streak to score 13 Serie A goals before Christmas for Genoa. AC Milan, before they were taken over by a company that employs statistical analysis, bought into the hype. A £30m fee ensured that Piatek was the most expensive striker in the January 2019 window.\nPiatek initially brought his finishing glut to Lombardy but a swing in fortune - the ugly, unspoken factor that has such a prominent role in football - dramatically cooled his hot streak. After relegation battles with Hertha BSC and Salernitana, the 28-year-old has washed up in the Turkish top flight.\nStuttgart's Serhou Guirassy is outperforming his expected goals by an even wider margin than Piatek this season. That's not to say that the Guinea striker will drop off quite as sharply as the Pole, but his stock may never be higher than this exact moment in time.\nA £15m release clause will still be valid in the summer window but Guirassy's suitors may not be quite as lofty. Nevertheless, the future is still bright for a player who was lining up in the Bundesliga's relegation play-off last summer.\nPierre-Emile Hojbjerg (Tottenham)\nPierre-Emile Hojbjerg confirmed that he would not be moving on from Tottenham Hotspur in January despite strong links to Atletico Madrid and Juventus.\nThe 28-year-old midfielder explained his reasoning for staying at a club where he is the fourth-choice option (at best): \"I always said in the past like I say now, what drives me is the purpose of fighting for something and I definitely feel that Tottenham is fighting for something.\"\nYet, Spurs are out of both cup domestic competitions, have no European obligations and are eight points adrift of league-leading Liverpool. While Atletico brace themselves for the Champions League knockout stages and a Copa del Rey semi-final, Juventus are going toe-to-toe with Inter at the Serie A summit. As long as Hojbjerg is happy (for now).",
  "word_count": 1006,
  "scraped_at": "2026-02-14T02:07:39.558818",
  "_text_extracted": true
}