{
  "article_id": "0b9f01dd84cb",
  "url": "https://www.wruf.com/headlines/2023/04/12/champions-league-quarterfinals-preview-napoli-takes-on-milan/",
  "title": "Champions League Quarterfinals Preview : Napoli Takes On Milan - ESPN 98 . 1 FM",
  "date": "20230412T181500Z",
  "domain": "wruf.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League Quarterfinals Preview: Napoli Takes On Milan\nTwo of Serie A’s titans, AC Milan and Napoli, face off today in what could be the quarterfinal’s most thrilling matchup.\nNapoli were favored in the matchup, but injury concerns and a 4-0 loss to Milan have raised questions over their ability to maintain their impressive form thus far.\nhttps://twitter.com/ChampionsLeague/status/1646030390367322112?s=20\nNapoli’s Path to Victory\nNapoli’s biggest strength is their counter attack.\nArguably the fastest team in European soccer, Napoli have also proven poise in front of goal.\nGeorgian (the country, don’t get excited USMNT fans) left wing Khvicha Kvaratskhelia has been a revelation this season, tallying 14 goals and 16 assists in just 32 matches. With these thirty goal contributions, he established himself as one of the best left wingers in Europe.\nKvaratskhelia, alongside superstar striker Victor Osimhen, is the heart and soul of Napoli’s attack.\nOsimhen has also been crucial to Napoli’s success this season, tallying 25 goals in 29 matches. He’s been on an absolute tear, trailing only Erling Haaland in the European golden boot race.\nhttps://twitter.com/brfootball/status/1645732450088124416?s=20\nNapoli will miss Osimhen today. The Nigerian striker is out with a groin injury picked up during their 4-0 win against Torino. The Italian squad are bracing for life without their superstar, although he could return for April 18’s second leg matchup.\n“I decided not to play Osimhen because I don’t want him injured for too long,” Napoli manager Luciano Spalletti said yesterday. “We have another game against Milan next week and I want him fit for that. But we have won very important games without Osimhen. We are here because we have won without him in this competition and I am expecting the same, that all my players rely on their teammates’ abilities.”\nSpalletti is right. Other players will have to step up.\nKvaratskhelia needs a masterclass today, and offensive players like Polish midfielder Piotr Zielinski and Mexican right wing Hirving Lozano need to push themselves. Whoever starts between backup strikers Giacomo Raspadori and Giovanni Simeone needs to play well for Napoli to have a chance.\nExpect Napoli to hold Milan to a low result, something like 1-0 or 1-1, and really push in the second leg. Today shouldn’t be about winning for the Serie A squad; it should be about surviving.\nAC Milan’s Path to Victory\nAC Milan’s path to victory is simple: Repeat their 4-0 win against Napoli from two weeks ago and capitalize on Osimhen’s absence.\nMilan thrashed Napoli on April 2. Portuguese star Rafael Leao had a brace. Both Brahim Diaz and Alexis Saelemaekers hit the back of the net. All Napoli could do was watch.\nMilan won by attacking pockets of space in between Napoli defenders.\nhttps://twitter.com/samirsynthesis/status/1642851132052500481?s=20\nBrahim Diaz manages to get around Mario Rui, which drags Kim Min-jae to the left. This opens up just enough space for Leao to go one on one with Amir Rrahmani, a matchup the former Serie A player of the year will always win. All he had to do was get around his defender and chip the goalkeeper.\nMilan won by absolutely overwhelming Napoli. They loaded up the box and attacked the counter. Napoli couldn’t recover.\nIf Milan can repeat these tactics, they’ll win easily, especially with Osimhen out.\nFinal Verdict\nNapoli, lacking Osimhen, won’t be able to hang with Milan.\nExpect things to get ugly today, although Napoli could bring it back on goal differential in the second leg if the striker returns.\nCategory: Champions League",
  "word_count": 577,
  "scraped_at": "2026-02-14T01:53:35.627399",
  "_text_extracted": true
}