{
  "article_id": "0badc41dafeb",
  "url": "https://www.starsandstripesfc.com/2024/7/31/24210103/usa-vs-morocco-2024-olympic-mens-tournament-quarterfinal-scouting-united-states-mens-national-team",
  "title": "2024 Olympic Men Tournament Quarterfinal : Scouting Morocco",
  "date": "20240731T200000Z",
  "domain": "starsandstripesfc.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The United States Under-23 Men’s National Team pushed through a challenging Group A at the 2024 Olympic Men’s Tournament, securing advancement with a win over Guinea on the third matchday. Now in the quarterfinal round, Marko Mitrović’s squad is one victory away from being in true contention for a medal and at least matching the program’s best-ever finish. However, there is a powerful opponent waiting to end the campaign, as Morocco has been one of the liveliest performers in France through three fixtures. Set to host is Paris’ Parc de Princes, a 47,929 all-seater stadium located in the 16th arrondissement with a Desso GrassMaster® natural reinforced grass surface.\nUSA vs. Morocco, 2024 Olympic Men’s Tournament Quarterfinal: Scouting Morocco\nThe United States is in the knockout phase.\nMorocco is in the Olympics for the first time since 2012 and registered the program’s best finish at the 1972 Games by reaching the second round. أسود الأطلس (Atlas Lions) qualified by winning the 2023 U-23 Africa Cup of Nations, taking down Guinea (2-1), Ghana (5-1), Congo (1-0), Mali in penalties (2-2 [4-3]), and Egypt in extra time (2-1). The current competition commenced with a first-place finish in Group A with a victory over Argentina (2-1), a defeat to Ukraine (1-2), and a win against Iraq (3-0).\nTarik Sektioui was appointed to the U-23 manager position in February of this year, with his hiring “in line with the National Teams Committee’s new strategy” after “unimpressive performances in friendlies” by Issame Charai. The 47-year-old retired winger has significant experience at the club level, most recently at domestic outfit Maghreb Fès. He acknowledged some attacking issues after the loss to Ukraine, noting that “an unwillingness to alter patterns” was a key factor.\nSektioui named an 18-player roster for the competition with three strong overage additions. The domestic Botola Pro competition is home to four of the talents, while 12 are on the books in Europe, mostly in France and Belgium. Ayman El Wafi was initially included in the group but replaced by Bilal El Ouadghiri.\n***\nGOALKEEPERS (2): Munir Mohamedi (Al-Wehda), Rachid Ghanimi (FUS Rabat)\nDEFENDERS (5): Achraf Hakimi (Paris Saint-Germain), Akram Nakach (Union de Touarga), Mehdi Boukamir (Charleroi), Adil Tahif (RS Berkane), Zakaria El Ouahdi (Genk)\nMIDFIELDERS (6): Benjamin Bouchouari (Saint-Étienne), Bilal El Khannous (Genk), Yassine Kechta (Le Havre), Oussama Targhalline (Le Havre), Oussama El Azzouzi (Bologna), Amir Richardson (Reims)\nFORWARDS (5): Eliesse Ben Seghir (Monaco), Soufiane Rahimi (Al-Ain), Ilias Akhomach (Villarreal), El Mehdi Maouhoub (Raja Casablanca), Abde Ezzalzouli (Real Betis)\n***\nSektioui has used both 4-3-3 and 4-4-2 formations, sticking with the former during the Olympics. Morocco plays “with speed and verticality,” pressing high up the field and looking to make quick inroads on goal when generating opportunities by “penetrating into the penalty area.” Players push the tempo, typically starting attacks from the wings and breaking through opponents’ lines with give-and-go combinations or solo runs before centering the ball.\nThe overaged Munir Mohamedi has largely been a back-up with the senior team but was given another chance to shine at the Olympics, starting every match during the group stage. The Spain-born 35-year-old RS Bekrane goalkeeper cuts a tall figure at six-foot-three with a muscular frame yet has the quickness to get low on short-range opportunities and set pieces. He is patient when coming off of his line and cuts down the angle of the attacker without overcommitting, relying on his footwork, agility, and positioning to make saves. In what may come to be relevant, his work on penalty kicks is spotty with very few saves over his career, although his veteran experience could finally culminate in crunch time.\nCharleroi centre-back Mehdi Boukamir has been developing into a key player for Morocco since switching over from Belgium, making a constant stream of interceptions and thriving in possession with intelligent passing decisions. He possesses good size at six-foot-two and projects a cool confidence when staring down the opponent in the one-on-one or stepping forward to carry possession into an advanced zone. Bologna’s Oussama El Azzouzi is a highly-versatile option who can line up in the midfield and on the back line, boasting “technical quality, defensive tenacity, and covering a lot of ground.” The 23-year-old from the Netherlands is a steady presence with calm distribution during the build-up and a balanced profile when defending his goal, often responsible for steering away danger.\nGenk fullback Zakaria El Ouahdi is a “very direct player” with a “good first touch” when “driving down the line to deliver crosses into the box” and “tracks back well” in order to “show the tenacity to win back possession for his team.” He is a full-field player with constant involvement in all phases of the game, displaying a willingness to get into physical battles but also makes the safe decisions during the build-up. One of the most talented players in the tournament, Achraf Hakimi brings “verticality and dynamism” to the wing, with constant attacking runs forward to pair with a high number of passes per match in all areas of the field. The 25-year-old Paris Saint-Germain defender is both fast and skilled with elite agility that terrorizes opponents, constantly overlapping on the outside and making crucial intercessions in the back.\nTowering six-foot-six midfielder Amir Richardson should be familiar to USMNT fans, as there were whispers that the program attempted to recruit the elegant dribbler, incisive passer, and aggressive tackler. He has a place and fluidity of movement that belies his size, covering the length of the field with relative ease and the agility and skill to dance out of pressure in order to take the game to the opponent. Le Havre’s Oussama Targhalline boasts a similar skill set with heavy challenges, a wide range of distribution, and the hardiness to carry the ball forward through contact. The 22-year-old from Sidi Belyout has a fast first step and an intelligent read on the run of play which enables him to rack up interceptions, but his best work is done when building out of the back or springing the counter-attack. The trio is topped by Bilal El Khannouss of Genk, who occupies the advanced role and “is blessed with excellent technical ability, athleticism, and agility to be able to shift from one direction to another in the blink of an eye.” Total Football Analysis notes his energetic pressing with a high work rate and tenacity as well as his constant scanning that enables him to analyze the formation and pick out teammates.\nMonaco attacker Eliesse Ben Seghir is praised for his versatility and “loves to roam the pitch freely in order to offer alternative and progressive passing lines” while being “creative [in] his off-ball movements.” The former France youth international boasts “a low center of gravity when on the ball,” which poses a challenge to defenders along with his “explosive burst of speed” to break into space before serving as an expert distributor or dangerous finisher. Ilias Akhomach of Villareal patrols the opposite side of the formation, described as a “superb dribbler with exceptionally quick feet” who is “able to wriggle through tight spaces.” He is at his best when carrying the ball into the final third by taking on multiple defenders before drawing a foul or making the safe connection with a teammate. There is the potential for Real Betis’ Abde Ezzalzouli, also known as Ez Abde, to play a role in proceedings with a “good eye for goal and the ability to carry the ball from deep areas into the box.” His cutting through opponents can change the course of a match, individual efforts that provide a necessary spark or break out of a high press.\nAn overaged addition to the roster, Soufiane Rahimi more than justified his inclusion at the Olympics with four goals to currently lead the Golden Boot race. The 28-year-old Al Ain forward is a versatile option who can thrive anywhere in the attacking half with quickness, keen dribbling skills, and a physicality to handle bigger defenders. In addition to his scoring prowess, he is an adroit creator, particularly when cutting inwardly from the wings, drawing defenders into his orbit and dishing to an open teammate. Whether operating on the counter-attack or serving as the final input on a slower build-up requiring some lock-picking, his multifaceted profile makes shutting him down a complex proposition.\nThe United States completed the first part of the job by emerging out of a challenging group at the Olympic Games, but there is more work to do. The road only becomes more difficult from this point, as Morocco has at times looked to be one of the strongest attacking groups in the tournament with a constant dynamism. Expect a hard-fought battle between the two sides that could result in a match that goes beyond regulation and perhaps into penalties.",
  "word_count": 1464,
  "scraped_at": "2026-02-14T01:51:48.881431",
  "_text_extracted": true
}