{
  "article_id": "0bc4dc2113ce",
  "url": "https://tribune.com.pk/story/2464409/after-title-win-mbappe-and-psg-have-sights-set-on-treble",
  "title": "After title win , Mbappe and PSG have sights set on treble",
  "date": "20240429T053000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After title win, Mbappe and PSG have sights set on treble\nThey must now be favourites to beat the Germans in the upcoming semi-final\nParis Saint-Germain are hoping their latest Ligue 1 title, secured on Sunday with three games to spare, will be just the first leg of a historic treble with a Champions League semi-final to come and the French Cup final to look forward to as well.\nIt is PSG's 12th French title, at least two more than any other team, and it is also their 10th in 12 seasons, which goes to show how the footballing landscape in the country has been transformed since the Qatari takeover of the club in 2011.\nThe extent of PSG's financial advantage over the rest of French football is crushing and means ending each season as champions is effectively a minimum requirement.\nWhen analysts Deloitte published their list of the top-earning football clubs in the world for last year, PSG were third with revenue of just over 800 million euros ($855m). The only other French team in the top 20 was Marseille, with 258 million euros.\nUEFA's own European Club Finance report, published in February, revealed PSG as having the second highest wage bill on the continent behind only Barcelona, at over 600 million euros.\nThose wage costs will have changed significantly this season, following the departures of Lionel Messi and Neymar, but a recent study by sports daily L'Equipe claimed that the 10 highest-paid players in Ligue 1 just now all play in Paris.\nIn that context, it is almost impossible for anyone to compete with Luis Enrique's team domestically, but the Spanish coach still deserves credit.\n\"Given our history and our squad, we are the favourites, although not everybody manages to do it, especially with so many games still to play,\" he said last week.\n\"But I have said since the very first day that we are the favourites, that we have the best squad and the biggest budget. It is almost an obligation.\"\nHe took over a team set for a period of transition in the post-Messi and Neymar era.\nPSG did not convince in winning the league last season, losing seven games and only pipping Lens by a point.\nThis campaign has, to borrow a French expression, not always been like a long, peaceful river.\nLuis Enrique had to incorporate a raft of new signings and has had to deal with the awkward situation surrounding Kylian Mbappe's future.\nMbappe was frozen out at the start of the campaign with the club putting pressure on him to sign a new deal or agree to be sold rather than simply run down the last year of his contract.\nThat partly explains why PSG won just three of their first seven Ligue 1 games.\nHowever, they have since picked up the pace and their only league loss so far remains a 3-2 home defeat against Nice in September.\nOusmane Dembele has been excellent since arriving from Barcelona, playing mainly on the right wing, and Bradley Barcola has starred on the other side.\nTeenager Warren Zaire-Emery has been a fixture in midfield and earned a call-up to the full France squad, while Portuguese creator Vitinha has arguably been PSG's best player.\nBut then there is Mbappe, who has 43 goals in all competitions, and that despite being used sparingly in the league over the last two months since informing the club of his decision to leave on a free at the end of the season.\nMbappe has completed 90 minutes just twice in PSG's last 11 league games.\nLuis Enrique has justified that by saying he needs to prepare for a future without his star player and try alternatives. But in the meantime, PSG must make the most of having the France captain in their ranks.\nThat they are now a better, more balanced team without having to accommodate Messi and Neymar is no surprise.\nAlthough they wobbled in the Champions League group stage, they qualified for the knockout phase and took four points against Borussia Dortmund along the way. They must now be favourites to beat the Germans in the upcoming semi-final.\nThat would allow them to finish the Mbappe era with a French Cup final against Lyon on May 25 and the Champions League final a week later, with the prospect of a clean sweep of trophies in sight.\n\"Of course that's something we are talking about. It's a source of motivation for us,\" Luis Enrique said.\n\"It will be a long, winding road to get there. We will need to stay fully focused until the end of the season.\"\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 795,
  "scraped_at": "2026-02-14T02:07:51.316943",
  "_text_extracted": true
}