{
  "article_id": "0c113d277dfa",
  "url": "https://www.caughtoffside.com/2025/02/19/liam-delap-united-chelsea/",
  "title": "Man United rival Chelsea for £40m star as club forced to change transfer strategy",
  "date": "20250219T071500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly ready to rival Chelsea for the potential £40million transfer of Ipswich Town striker Liam Delap.\nThis comes as the Red Devils may have to alter their approach in the transfer market somewhat, with money becoming more and more of an issue for the club after some big spending in recent years.\nHaving wasted so much money on poor signings like Antony and Casemiro in the last few seasons, Man Utd now have to be a bit smarter and seem set to try investing in slightly cheaper and younger players.\nThat’s according to iNews, who report on United looking at the £40m-rated Delap as an alternative to Sporting Lisbon striker Viktor Gyokeres, who would likely cost around double that.\nChelsea have also been monitoring Delap, according to the report, so this might not be that straightforward a deal to get done.\nLiam Delap could be set for a big move after impressive Premier League campaign\nDelap has caught the eye in the Premier League this season, scoring ten goals and contributing two assists for his teammates.\nWhile those aren’t exactly earth-shattering numbers, the 22-year-old has clearly been a stand-out performer for this struggling Ipswich side.\nIt’s easy, therefore, to imagine Delap improving a great deal with better players around him, while he’s also young enough that he could be a truly terrific player if he develops well in the next two or three years.\nUnited urgently need upgrades on flops like Joshua Zirkzee and Rasmus Hojlund, so this could be a good move if they can pull it off.\nStill, Chelsea also need a new striker after a lack of progress made by Nicolas Jackson this term, while Christopher Nkunku has largely been out of favour under Enzo Maresca.\nDelap will surely favour Chelsea if they have Champions League football to offer next season, with United’s dire league form surely likely to start hurting them when it comes to attracting transfer targets.",
  "word_count": 325,
  "scraped_at": "2026-02-14T01:52:15.336110",
  "_text_extracted": true
}