{
  "article_id": "0c3626335784",
  "url": "https://metro.co.uk/2025/08/27/carabao-cup-third-round-draw-arsenal-chelsea-liverpool-learn-opponents-24014021/",
  "title": "Carabao Cup third - round draw : Arsenal , Chelsea and Liverpool learn opponents",
  "date": "20250828T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are away to Port Vale in the third round of the Carabao Cup while Liverpool will host Southampton and Chelsea travel to Lincoln City.\nElsewhere, Newcastle United will begin the defence of their Carabao Cup trophy against Bradford City.\nTottenham are at home to Doncaster, while Manchester City are away to Huddersfield Town.\nMeanwhile, League Two side Grimsby Town, who pulled off a shock upset to knock Manchester United out of the competition on penalties on Wednesday night, are away to Sheffield Wednesday.\nCarabao Cup third-round draw in full\nPort Vale vs Arsenal\nSwansea City vs Nottingham Forest\nLincoln City vs Chelsea\nTottenham vs Doncaster\nBrentford vs Aston Villa\nHuddersfield Town vs Manchester City\nLiverpool vs Southampton\nNewcastle United vs Bradford City\nSheffield Wednesday vs Grimsby Town\nWolves vs Everton\nCrystal Palace vs Milwall\nBurnley vs Cardiff City\nWrexham vs Reading\nWigan Athletic vs Wycombe\nBarnsley vs Brighton\nFulham vs Cambridge\nThis season’s Carabao Cup third-round fixtures will take place across two weeks beginning September 15 and September 22.\nChampions League games will also take place in the week beginning September 15, while Europa League fixtures are scheduled for the week beginning September 22 September.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAs UEFA competition fixtures cannot be rescheduled, teams participating in the Champions League or Europa League cannot meet each other in the third round of the Carabao Cup.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Jamie Carragher mocks Gary Neville with Arsenal video after Man Utd’s humiliating defeat to Grimsby\nMORE: Chelsea ‘waiting on Alexander Isak transfer’ after Nicolas Jackson agreement\nMORE: Jose Mourinho names his Europa League favourites ahead of league phase draw",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:58:57.507983",
  "_text_extracted": true
}