{
  "article_id": "0c5df5209ffd",
  "url": "https://www.managingmadrid.com/2023/12/26/24015072/the-everything-men-26-december-2023",
  "title": "The Everything Men : 26 December 2023",
  "date": "20231226T124500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nThe Everything Men: 26 December 2023\nBoxing Day Edition of the Daily Merengue\nShoutout to the mods who do a fantastic job, Valyrian Steel, Felipejack, Juninho, NeRObutBlanco and yours truly, Kung_Fu_Zizou\nThis Thread is inspired by the Late Great Alfredo Di Stefano.\nIn many way Di Stefano is the ultimate reference for Real Madrid. It is difficult to articulate just how some players capture the imagination many generations beyond their own. Some players reach the realm of the mythical.\nThe Everything Men are those boys who do everything. When their teammates talk about them, they say, “he can do everything”.\nFederico Valverde\nFederico Valverde was groomed as a Centre-Mid during his time at Castilla. His incredible speed was impossible for managers to ignore and on during his loan spell at Alaves he had to learn to play out wide. This would later help him adapt to some unique demands when he eventually returned to Real Madrid.\nFede can play everywhere and anywhere. He is every manager’s dream. Every team has a player who can cover multiple positions, no club has anyone who can do it as well as Federico Valverde. You need to defend, Fede can do it, you need support in attack, Fede will do it, you need goals, he’s got them. This season he hasn’t been tasked with scoring goals and has been responsible for maintaining a balance in that XI. He has been exceptional in the role. Easily one of the best players in the world. His mixture of energy, industry and experience makes him a near cheat-code for the Real Madrid manager.\nEduardo Camavinga\nCamavinga is one of the stranger youngsters I have ever seen. Typically erratic as you’d expect from a youngster but so incredibly gifted that his ability and feel for the game would have you think he’s a veteran. Most youngsters are technically gifted, very few have a feel for the game to be able to make order out of chaos.\nEdu is one of those players who can do everything. There’s very little missing from his game let alone his ability to execute in various roles. He’s been largely deployed as an 8, a 6 and at Left-Back. Fans were half-expecting to see him fill-in for the injured Courtois at the start of the season.\nOne of the most exciting players in the game today. He’s only recently turned 21 and there’s some way to go before he reaches his peak.\nJude Bellingham\nJude Victor William Bellingham, First of his name.. Jude is this generation’s Alfredo Di Stefano. He like Fede and Edu can do everything. What sets him apart is his efficacy in stopping the opposition in near equal measure to his efficacy in tearing the opposition apart. His work on both sides of the ball makes him seem an impossible player. He’s not the quickest player out there but his timing and decision-making maximises his output on both sides of the ball. He has scored 17 goals in 21 appearances for Real Madrid making him the leading scorer in the team.\nJude Bellingham has gone from a player who can play multiple roles to a player who executes multiple roles in every game.\nOne of my favourite moments of the season so far is Bellingham’s goal against Napoli at the Bernabeu. The reason that goal stands out is that it further highlights his uniqueness as an Everything Man. This goal comes after Carlo ditched the diamond for a more conventional 4-4-2 with Jude starting on out the left and helping to defend that flank. Yet, he makes a perfect run into the box and scores a perfect Centre-Forward’s goal.\nFOOD FOR THOUGHT\nReal Madrid last had a traditional number 9 as a starting CF with Ruud van Nistelrooy and latterly Gonzalo Higuain. Since then, Karim Benzema who was a foil to the great Cristiano Ronaldo was our idea of a Centre-Forward. Given the club’s reluctance or inability to replace Karim Benzema over the summer and as well the the pending arrival of one Endrick Felipe, it seems the Centre-Forward role at Real Madrid might never return to penalty-box strikers. Upon his return Vinicius will likely complete the unusual trio of Rodrygo-Jude-Vini as the offensive trio of the starting XI. It is likely that if all 3 remain healthy for the rest of the season, the team will be successful.\nGiven that some might hold the presumption that victory is vindication, does Real Madrid need a return to the traditional number 9.. the likes of Erling Haaland?\nThe Daily Poll\nPoll 1\nPoll 2",
  "word_count": 792,
  "scraped_at": "2026-02-14T01:51:13.765374",
  "_text_extracted": true
}