{
  "article_id": "0c5dfd7ba53e",
  "url": "https://www.themag.co.uk/2025/06/newcastle-united-now-set-to-commit-to-over-200m-on-signing-new-players-this-summer/",
  "title": "Newcastle United now set to commit to over £200m on signing new players this summer ? ",
  "date": "20250611T174500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United now set to commit to over £200m on signing new players this summer?\nWhat do you think the chances are of Newcastle United committing to over £200m of new signings this summer?\nLikely? Unlikely? Impossible?\nI’m guessing that the overwhelming majority of you are going with the second or third opinion.\nWhat do you base those opinions on?\nThe journalists who cover Newcastle United pretty much all report a budget, an agreed spend, a proverbial ‘war chest’, £100m for Eddie Howe and NUFC this summer in the transfer market.\nWhere does that figure come from? Why do they all say the same/similar amount? Have they all got the same inside information, or is it more a case of it is a nice round figure and one journalist came out with it as an ‘exclusive’, so the rest just lazily repeat that £100m speculated summer 2025 spend?\nMy question would be, why would any Newcastle United fans believe that the journalists know what is going on inside the club, when have they ever proved to be correct before when we have had previous transfer windows, either when it comes to the total spend, or the signings that NUFC would make?\nUnder Eddie Howe and these Newcastle United owners, the journalists have time after time proved to not have a clue.\nSo I think it is a sizeable factor in the general mindset of Newcastle United fans with this summer’s expected transfer business, taking their lead from an NUFC media that they constantly say haven’t got a clue…\nThe same as the journalists, I don’t have the faintest idea what Eddie Howe and the Newcastle United owners really have planned, BUT I think the evidence points far more towards a commitment to spend £200m this summer, than it does £100m.\nWhy £200m (or more…)?\nLook at what happened in summer 2023, the last time Newcastle United qualified for the Champions League.\n£7m Yankuba Minteh\n£55m Sandro Tonali\n£38m Harvey Barnes\n£40m Tino Livramento\n£28m Lewis Hall\nA total of £168m spending committed to in summer 2023, the Livramento deal was an initial £32m and then £8m future add-ons, whilst Hall was an initial loan deal and an obligation to pay the £28m the following summer (next financial year).\nYou might think, just because Newcastle United committed to £166m+ two summers ago, no reason to assume that the same, or more, spending will happen this summer.\nMy answer to that is why wouldn’t you make this assumption, especially with any number of other factors to take into consideration.\nNewcastle United are now presented with a massive challenge AND a massive opportunity.\nEddie Howe has worked miracles to win a trophy and finish top five, meaning this return to the Champions League.\nThe Champions League that is even more lucrative now than two seasons ago, more guaranteed matches, more guaranteed money AND guaranteed no group of death.\nFor the Newcastle United owners to get where they want to go, in terms of growing the club, ensuring Champions League football for the 2026/27 season is a huge priority.\nThey will be well aware that Eddie Howe has worked miracles to achieve what he has this past season, now fully backing him is a no-brainer.\nEddie Howe has brought success to Newcastle United despite three transfer windows where he hasn’t brought in a single new first team contender.\nInstead, the squad has actually been seriously weakened, the past 12 months we have seen Anderson, Minteh, Kelly and Almiron all sold as the squad has been relatively stripped to the bone. It has been a very significant gamble to do so BUT Eddie Howe pulled it off.\nI think this summer has been targeted for some time by Eddie Howe and the club’s owners to go large in the transfer market AND now with a trophy and Champions League qualification in the bag, that ambition in the summer 2025 market will be even bigger.\nThe sale of that quartet will generate close to £100m and almost all of that is pure profit when it comes to PSR.\nAlso, when we get into July it is a new financial year and the three season PSR cycle that we then go into, won’t include two of the three biggest loss making seasons of 2021/22 and 2022/23.\nI think that Newcastle United can do significant incoming deals this month BUT scope to do even far more on top of that when we get to July 2025.\nFurther sale boosts\nHaving already seriously stripped down the squad in recent windows, that could well be added to.\nI think every chance that one or both of Sean Longstaff and Joe Willock will leave this summer. Willock is 25 and has two years left on his NUFC contract, Longstaff is 27 and has one year left on his current deal. They are both Premier League level midfielders and should fetch transfer fees of £15m each, if sold.\nI wouldn’t be surprised if others such as Targett, Dubravka and maybe one or two other squad members left for smaller fees. Plus of course any of these outgoing deals also bringing down the wage bill.\nAs yet Newcastle United haven’t done it but then also the option of selling one of the high valuation automatic first team players, maybe say Anthony Gordon for £80m+, as a potential example. Not that I am advocating the sale of Gordon or any other of our first choice big players but the option is there to massively add to the potential of what Newcastle United could bring in.\nSpeaking of which…\nCan Newcastle United afford it?\nNobody knows for sure what scope Newcastle United exactly have for buying players, it is all educated (and not so educated!) guesses.\nAs I said earlier, I think this summer 2025 transfer window has always been targeted by the club owners and Eddie Howe as the time when Newcastle United can be ambitious once again and spend big. With those big loss making season of 2021/22 already having dropped off the three season PSR calculation and then 2022/23 to drop off after this month, that is a serious shift. Then these sales of Minteh, Anderson, Kelly and Almiron the past 12 months have massively added to that.\nWhat also must be factored in are two other key factors.\nThe 2024/25 Newcastle United season will have been far better than anyone inside the club could have predicted. The success on the pitch, finishing top five, winning a trophy, qualifying for Champions League, will have triggered far more revenue than they would have expected and budgeted for. All of these things meaning more matches than expected and higher overall matchday revenues (compared to expected), sales of more merchandise (special cup winners shirt!), more commercial revenues (including often deals with main sponsors have built in bonuses if qualifying for Champions League etc), TV money (so many matches televised and the higher you finish in the Premier League it is around £3m more for each place).\nThen of course we know that in the 2025/26 season, the simple fact that Newcastle United are in the Champions League, then equals massive extra amounts of cash will come in, compared to if NUFC hadn’t qualified.\nPut it this way, if you believe this figure of £100m as being the basic budget the Newcastle United owners have supposedly (according to journalists) told Eddie Howe can be spent on players this summer. What then do you believe the allowed spend would have been this summer if Newcastle hadn’t qualified for Champions League, indeed if hadn’t qualified at all for any European competition, as was the case a year ago?\nIf you really believe that only £100m will be allowed to spend on players this summer WITH Champions League money guaranteed in 2025/26, then surely it would have been only an allowed spend of something like £30m-£50m at the most WITHOUT Champions League money guaranteed (or at least Europa League).\nWith all these other factors I have outlined above, no new first team contenders these past three windows, sizeable sales of players especially from a PSR perspective, two of the three biggest loss making seasons falling off the three year PSR calculations, do you then really honestly believe that there would still have only been say £30m or so allowed to be spent (if no Champions League qualification)???\nI don’t believe that for one second.\nWhich then also tells me that we can expect Eddie Howe to be allowed to commit seriously more this summer on new signings than £100m.\nThe thing is as well, is that with PSR, unless you are right up to your limit at any particular time on a three year basis, then it is a lot to do with how ambitious you want your transfer spend to be, what you want to spend NOT what you can spend. Basically, each season you have limits on how much you can spend due to your PSR perspective but clubs will very rarely spend the very maximum they could do at any one time.\nI know we are all sick of hearing about PSR and amortisation but I think it is important to understand the following, to help see why Newcastle United could be willing to spend far more than you think they will this summer.\nIf say on 1 July 2025 on the first day of the new financial year, Newcastle United bought a £50m player and gave him a five year contract.\nRemember, paying the cash and the PSR accounts calculations are two different things. You have to pay the other club the £50m whenever they demand it is paid as part of the negotiations, so they might want all the cash paid at once (which usually would mean you can negotiate a smaller transfer fee in return for paying it all up front), or a significant sum (maybe half) at once and the rest in instalments across one or more years, or all paid in equal instalments.\nOn the PSR, accounts and amortisations side, that £50m on a five year contract is split into five equal £10m portions. So for each of the five years (2025/26, 2026/27, 2027/28, 2028/29, 2029/30), £10m goes into your yearly accounts on the expenditure side of things. So on the plus side you are getting a £50m for the 2025/26 season BUT only £10m will be added to your losses (or come off your profits) for that season’s accounts. Whilst on the negative side, each of the following four seasons you also have £10m added to your losses (or coming off your profits) in each of those seasons as well. This is also what is called the player’s ‘book value’, the amount still owned for amortisation purposes. So a £50m signing on a five year contract, his book value after one of the fives season has gone will be £40m. After two seasons it will £30m and so on. This is important because if you then sell the player, it can make a massive difference to your accounts and your PSR position.\nIf you sold the £50m player after two seasons then his book value is £30m, so if a club pays you £50m then that goes into the accounts as a £20m profit (a club buying him for £50m less his book value of £30m). However, if after two seasons you sold that £30m player for £10m, then it goes into your accounts as a £20m loss (a club buying him for £10m less his book value of £30m). This is a massive additional problem for clubs if they buy expensive players who are total flops. Not only are you going to lose a load of cash on them BUT you are also going to seriously damage your PSR position. You look at Man U and how they paid massive amounts of money on the likes of Antony, Hojlund, Sancho and many others, even if they are willing to take the cash hit by quickly selling them on for a fraction of what they paid, they can’t do it because it hugely damages their PSR position, the book value losses go straight onto that season’s accounts if they are sold. What somebody will pay is far less than their current book value.\nThe problem comes of course that if you keep doing this, spending a lot of money on players year after year, you are stacking up problems for future accounts and PSR, because each new season you have those amortisation amounts to add to your negative side of the accounts, before you start buying more players.\nAnyway, my point would be that as the Newcastle United owners (and accountants) know there is a guarantee of substantially higher revenues next season due to the success this season on the pitch, then it makes it far more worthwhile to really push it, to take a calculated gamble, to try and ensure that success (on the pitch and financially) keeps on going.\nI don’t want to hurt your head too much more with the PSR and amortisation thing BUT there are also other ways the Newcastle United owners can substantially increase how much they would be able to spend on new signings, in terms of PSR.\nIf we round Alexander Isak’s summer 2022 transfer fee of £63m down to £60m, he signed a six year contract back then, which meant that was six years of £10m amortisation each season. So after three seasons his book value will be £30m (3 x £10m amortisation coming off the original £60m transfer fee and 3 x £10m to go).\nHowever, if Newcastle United now agree a new extended contract with Alexander Isak, the amortisation amounts now change for each season that remains of his new contract. So the £30m amortisation would instead of getting spread over the last seasons as is currently the case, might instead be spread over five years instead, if a new five tear contract agreed. So 3 x £10m would instead become 5 x £6m, with next season’s 2025/26 accounts having £6m instead of £10m added to the downside of the accounts. From an accounts and PSR perspective, this could of course allow them to give Isak a massive payrise, offset by the lower amortisation amount each of the seasons. If Alexander Isak kept it as a three years remaining contract AND the club agreed far higher wages, then that would put a far bigger strain on the accounts as the amortisation £10m each season would remain BUT with a bigger wage bill adding to the club losses (coming off profits).\nWe have already seen the likes of Bruno and Gordon getting more cash and at the same time new and far longer contracts. Players such as Tonali, Livramento and Botman, as well as Isak, likely to follow I reckon.\nConfidence and Necessity\nWhen you have a manager such as Eddie Howe, why wouldn’t you want to trust him with £200m+ of transfer spending commitments this summer?\nThe Newcastle United owners will have absolute confidence in Eddie Howe when it comes to his stellar transfer record so far, brilliant on the pitch and increasing dramatically in value off it.\nIt is also a necessity for the club’s owners to back Eddie Howe and prove to him why this is the club where he can fulfil all his ambitions.\nEddie Howe has worked miracles to bring stunning success on the pitch, despite such severe constraints off it, these past three transfer windows.\nIt is also a necessity to commit to serious amounts of money this summer because that is what quality players cost!\nYou might still get the odd bargain but reality is that if you are expecting players to come in and perform at the level of Tonali, Joelinton, Bruno, Gordon, Botman, Livramento, Hall, Isak etc, then other clubs will also be after them and they won’t come cheap.\nTo believe that committing to £100m this summer on Newcastle United signings would be enough, isn’t the real world.\nTo bring in say four instant first team contenders and two or three longer-term prospects who will initially be squad players, you are definitely talking more £200m+ than £100m this summer.\nAs I mentioned earlier, in summer 2023 ahead of the last Champions League campaign, Newcastle United committed to £168m+ of transfer spending.\nIn the 2022/23 season it was actually a very similar commitment, with around £120m committed to in summer 2022 with Isak, Targett, Pope and Botman arriving. Then making it £165m was the £45m capture of Anthony Gordon in January 2023.\nI honestly think this is going to be a statement transfer window for Newcastle United, the club’s owners backing Eddie Howe to take the club to a whole new level in terms of competing on AND off the pitch.\nI find it amusing that so many people are still wanting to believe that these past two years (since summer 2023) are some kind of major indicator that should make you believe Newcastle United won’t go big in this transfer window.\nThe exact opposite should be the case, these last couple of years Newcastle United have been building up to this, doing the necessary hard yards of no new first team contenders signed, so that they will now have the ability to really go for it.\nEven Mr Poker Face Eddie Howe has said Newcastle United will be looking to make major moves in this summer transfer window. If even our esteemed, usually cards close to his chest, leader is saying this, then I reckon we are in for a seriously exciting and massive summer ahead.\nNobody needs to be crying on because Newcastle United haven’t made major moves in this extra ten day transfer window period that was granted to help the FIFA Club World Cup competing squads. When Eddie Howe has said about making early signings, he will for sure have been meaning getting as many deals as possible done by earlyish in July, so they have a proper pre-season with their new teammates and get up to speed with the demands of playing in an Eddie Howe team.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 3045,
  "scraped_at": "2026-02-14T01:52:26.333465",
  "_text_extracted": true
}