{
  "article_id": "0c63aed73e9b",
  "url": "https://www.fourfourtwo.com/person/coaches-managers/ange-postecoglou-offers-savage-response-to-thomas-franks-tottenham-hotspur-sack",
  "title": "Ange Postecoglou offers savage response to Thomas Frank Tottenham Hotspur sack",
  "date": "20260212T141500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou offers savage response to Thomas Frank's Tottenham Hotspur sack\nFormer Tottenham Hotspur boss Ange Postecoglou is not one to mince words and he's been particularly critical of his former employer\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSpurs parted company with 'Big Ange' last summer following a topsy-turvy 2024/25 campaign in which the club won the UEFA Europa League, but also finished 17th in the Premier League table.\nPostecoglou will contend that as the season progressed, European competition took priority, hence why the team finished in such an uncharacteristically lowly position. But, the Spurs hierarchy didn't quite see it that way, deciding to start afresh in the summer with Brentford's Thomas Frank.\nThe North Londoners spent £6.7 million to bring the Dane to the Tottenham Hotspur Stadium but sacked Frank earlier this week after a torrid run of two wins in 17 matches.\nAnge Postecoglou: 'Sacking Frank is a fair decision'\nThere were certainly parallels between Frank's reign and Postecoglou's time at the club, performing well in Europe but failing to replicate that in the league, in addition to agonisingly lengthy injury lists.\nThe Australian, who most recently spent an ill-fated spell in charge at Nottingham Forest, didn't have much sympathy for his successor, or the board that sacked him eight months ago.\nGet VIP Spurs tickets HERE with Seat Unique!\nTottenham Hotspur hospitality offers a diverse range of premium experiences, from vibrant social lounges to private boxes. Packages include premium padded seating in prime locations, exclusive lounge access pre- and post-match, gourmet dining, and a complimentary drinks package. Guests may also enjoy live entertainment and Spurs legend appearances.\nSpeaking on the Stick To Football podcast, Postecoglou reacted to Frank's sacking: \"It's a fair departure, for me. Anyone who studies the game will know that it wasn't a progression from me.\n\"I built that squad to play a certain way over the last couple of years.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"You walk into the Tottenham, what you see everywhere is 'To dare is to do'. It's everywhere. And yet their actions are almost the antithesis of that. It's real curious in terms of understanding, 'What are they trying to build?'\n\"Obviously they've built an unbelievable stadium, unbelievable training facilities, but when you look at the expenditure, particularly in their wage structure, they're not a big club.\"\nPostecoglou enjoyed success in Japan with Yokohama F. Marinos and in the Scottish Premiership at Celtic but has so far been unable to crack the Premier League with Spurs and Forest.\nThe head coach believes his second season at Tottenham was impacted by the club's reluctance to spend heavily on proven Premier League quality.\n\"At the end of my first year, when we finished fifth, for me, [it's] how do you go from fifth to really challenging? Well, we had to sign Premier League ready players, but finishing fifth that year didn't get us Champions League. We didn't have the money, so we ended up signing Dom Solanke, absolutely I was really keen, I really like him - and three teenagers.\n\"I was looking at Pedro Neto, [Bryan] Mbeumo and [Antoine] Semenyo at the time, Marc Guehi, because I said, if we're going to go from fifth to there, that's what the other big clubs will do in that moment.\"\nJoe joined FourFourTwo as senior digital writer in July 2025 after five years covering Leeds United in the Championship and Premier League. Joe's 'Mastermind' specialist subject is 2000s-era Newcastle United having had a season ticket at St. James' Park for 10 years before relocating to Leeds and later London. Joe takes a keen interest in youth football, covering PL2, U21 Euros, as well as U20 and U17 World Cups in the past, in addition to hosting the industry-leading football recruitment-focused SCOUTED podcast. He is also one of the lucky few to have 'hit top bins' as a contestant on Soccer AM. It wasn't a shin-roller.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 791,
  "scraped_at": "2026-02-14T01:59:36.829037",
  "_text_extracted": true
}