{
  "article_id": "0c8a892beb6d",
  "url": "https://theathletic.com/4343985/2023/03/29/yasir-al-rumayyan-newcastle-profile/",
  "title": "Newcastle chairman Yasir Al - Rumayyan : A life of power , privilege and risk",
  "date": "20230329T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On June 6, the PGA Tour and LIV Golf announced plans to merge, ending the civil war splitting the sport. The deal can be seen as a major win for the upstart Saudi league, offering it legitimacy, a seat at golf’s top table, and ending months of litigation between the sides.\nAt the heart of the deal is PIF governor Yasir Al-Rumayyan. Before becoming chairman of Newcastle United, he was best known internationally as a golf fanatic, trying to grow opportunities for the sport in Saudi Arabia.\nFor Al-Rumayyan personally, this is one of the most significant days in his career as he is set to become chairman of the new golf tour.\nTasked with delivering the ambitious vision of crown prince Mohammed bin Salman in the capricious world of Saudi politics, Al-Rumayyan has made his most significant move yet. It also ends the potentially risky prospect of being deposed in a US court.\nAlready one of Saudi Arabia’s leading technocrats, chairman of the state oil company, owner of Newcastle United, Al-Rumayyan is now the most powerful man in golf. This is the story of his rise to power.\nJamie Reuben, Newcastle United’s co-owner, passed the ball to the club’s chairman Yasir Al-Rumayyan. It bobbled along the way, but even so, Al-Rumayyan’s control was disappointing. No matter.\nAdvertisement\nThis was April 2022 and St James’ Park was empty, the crowd having left happy after a 1-0 win over Crystal Palace that took Newcastle past 40 points. Al-Rumayyan, who controls over $600billion (£491bn) as governor of Saudi Arabia’s sovereign wealth fund (PIF), was enjoying himself.\nSeven months earlier, Newcastle had looked like relegation fodder and PIF’s proposed takeover appeared dead in the water. Now, the takeover had gone through, Newcastle seemed to have reached safety, and the chairman was gambolling forward, attempting a rainbow flick.\nPost game kickabout for @ghodoussi @jamiereuben and Yasir Al-Rumayyan. Sign them up @NUFC #NUFC pic.twitter.com/jm2htAciYu\n— Joe Buck (@16joebuck) April 20, 2022\nThe joy on Al-Rumayyan’s face was evident. This was a new kingdom, one outside the kingdom of Saudi Arabia, where he serves as right-hand man to Crown Prince Mohammed bin Salman, one of the world’s most powerful and controversial rulers.\nBut there is a story beyond the giddy appearances, a story of power, privilege and risk. The Athletic has spoken to Saudi experts and business associates to uncover a man playing a high-stakes game, where no one’s future is certain.\n“He is the technocrat given the responsibility of putting Bin Salman’s vision into practice,” says one Saudi-based expert, speaking anonymously for his own security. “But remember, if he doesn’t deliver, Bin Salman is not going to blame himself.”\nEven amid Riyadh’s flashy redevelopment, four identical towers stand out. Clad in woven gold, Digital City is the home of PIF, and if you unscrolled Al-Rumayyan’s CV from the top floor, it would probably just about touch the ground.\nHe is the governor of PIF, one of the largest sovereign wealth funds in the world, holding stakes in several of the West’s most eminent companies — Disney, Tesla, Boeing, and Uber.\nAdvertisement\nHe is the chairman of state oil institution Aramco, the globe’s most valuable company, and of Maaden, Saudi Arabia’s largest mining firm. Reliance Industries, the largest conglomerate in India, has named him on its board, as has Uber, the largest taxi company in the world.\nAn American judge said he is “up to his eyeballs” managing LIV Golf, the upstart golf league founded by PIF that has just merged commercial operations with the PGA Tour and DP World Tour, but he still found time in early March to launch a new airline — Riyadh Air — with the stated aim of growing larger than Gulf rivals Emirates and Etihad.\nThere is also the small matter of developing NEOM, a proposed $40bn super city near the Egyptian border, which is the personal brainchild of Bin Salman.\nIn short, Al-Rumayyan holds many jobs, but not, he claims, the hands-on role of operating Newcastle United. For a relatively anonymous banker from the provinces, in a country where membership of a bloated royal family typically sets a glass ceiling for those outside those circles, his rise is unprecedented.\nAl-Rumayyan was born in Buraidah, 350km north west of Riyadh, to a Saudi father and Syrian mother. As a child, he moved to the capital to attend Al-Abna’a, a school catering for the sons of officers working for the Saudi Ministry of Defence and Aviation. In those early days, he was more interested in sport than business.\n“There were halls available in the airbase,” he told Saudi-based Thmanyah Radio last October. “Because of my father’s job, I had access to United States Sports Academy coaching. I tried everything — swimming, volleyball, basketball, running. I participated in a lot of running competitions.”\nHe says he was never a talented footballer; golf, his primary passion, would come later. According to one student who attended Al-Abna’a at the same time, the future business leader was an average student.\nWhile Saudi royals — the wider monarchy comprises about 15,000 people — often send their children abroad for university, Al-Rumayyan studied accounting at King Faisal University in the eastern city of Al-Hofuf. The decision would later please Bin Salman.\nAdvertisement\nThe 23-year-old graduate then embarked on a career in finance, working as an executive at several banking and investment companies. In late 2007, he left his role as head of securities listings at the Capital Market Authority (CMA) — the country’s financial regulatory authority — to study leadership at the Harvard Business School on a three-month course, before returning to a promotion.\nBefore 2015, his most significant role was as chief executive of Saudi Fransi Capital. In an interview with Bloomberg in March 2020, he said he transformed it from a failing bank to “one of the most profitable companies in the Middle East (…) responsible for 41 per cent of all investment banking opportunities in Saudi Arabia”.\nDespite being successful and earning well, this was still hardly the trajectory to deliver him to the upper reaches of the Gulf elite. Eight years ago, however, everything changed. Three events were key.\nEvent one: When King Abdullah passed away from pneumonia in 2015, Mohammed bin Salman’s father, King Salman, an octogenarian, took the throne. Power consolidated around his son, now 37 years old, who was named Crown Prince. In 2016, he launched Vision 2030 — a plan to diversify the Saudi economy, reducing the reliance on oil and transforming the nation’s standing in the global economy.\nBack then, the PIF was a tiny fund, employing fewer than 50 staff. It was also known for the conservatism of its investments. But that would need to change to enact Bin Salman’s dreams.\n“He wanted to emulate the Qatari and Abu Dhabi sovereign wealth funds,” says Christopher Davidson, an expert on Saudi who has published extensively on statecraft in the region. “Going elsewhere in the world and acquiring assets, especially cultural assets, could deliver soft power opportunities for Saudi Arabia.”\nEnter Al-Rumayyan. One month after King Abdullah’s death, the banker was invited to join the Royal Court — an advisory board sitting separately to the formal government apparatus but typically with more power than the ministries. Tasked with providing the court with decision-making data, he entered Bin Salman’s orbit.\nAdvertisement\n“I’d never met him,” he told Thmanyah Radio. “I just received a call and arrived at the palace for an interview. (He) gave me three things to do and asked when I could start. I told him three months. He said, ‘No, one month’. The next week, I got another call saying I had to come immediately.”\nWithin six months, he put himself forward to run PIF. “(He) asked me to hire a CEO for the fund. I requested the names of CEOs in the investment sector, got the files and everything. I was travelling with the prince on a plane and we were going through each one. He wasn’t fully satisfied with the majority. ‘No, bring me someone else,’ he said. Then it clicked. The decision was made to make me the supervisor of PIF.”\nLess than a year later, in August 2016, he joined the Aramco board, responsible for generating around 42 per cent of Saudi GDP. “He had social skills, which not all bankers have,” explains Justin Scheck, who co-wrote Blood and Oil, a book about Bin Salman’s rise to power. “But this is a guy whose defining trait was the long stretches of time he spent at the Riyadh Golf Club.”\nBut the appeal was not just financial — it was also personal.\n“(Bin Salman) wanted to promote people who were not connected to the bloated regimes of the past,” says Davidson. “But a major criterion was loyalty, just as much as meritocracy. In regimes which are one-man shows, like Saudi Arabia, it’s a trend to take people from relative obscurity and build them up very quickly. It ensures their loyalty won’t swerve. There’s no rival power they’re connected to. They owe their meteoric rise entirely to you.”\nHis education in Saudi Arabia was also seen as a factor — Bin Salman is keen to avoid his nation appearing dependent on outsiders. The Crown Prince has sought to establish his reputation as a ‘son of the land’, rather than Western-educated ‘son of the air’. Al-Rumayyan accompanied him on several retreats into the Saudi desert for traditional camping trips, the symbolism of which was important to Saudi Arabia’s de facto leader.\nThen came the second key moment in Al-Rumayyan’s rise. The Ritz-Carlton hotel in Riyadh looks like a Regency palace, a facsimile of Versailles in the desert. It is utterly vast — large enough, in November 2017, to contain 400 members of the Saudi elite. They had received a phone call inviting them to a meeting with Bin Salman, but upon arrival were met by state security guards and taken to the hotel. There, some reported beatings, while others were told their assets were being confiscated in a move Saudi officials describe as an “anti-corruption drive”.\nAdvertisement\nIn March 2018, The New York Times reported that a 60-year-old general involved in the purge had subsequently died, having shown signs of being beaten. At the time, an official of the Saudi Embassy in Washington told the paper: “All allegations of abuse and torture of those investigated during the anti-corruption proceedings are absolutely untrue.”\nBin Salman had sent a signal. He was ready to shake up the established order. “He didn’t pull out the tree from the roots,” one Saudi-based source with knowledge of the royal family’s workings told The Athletic. “He just wanted to cut off certain twigs and allow his own to grow.”\nAl-Rumayyan and his associates filled the void. His brother-in-law, Mazin bin Ibrahim Al-Kahmous, later became president of Saudi Arabia’s Oversight and Anti-Corruption Authority. With the old guard out of favour, Al-Rumayyan shot up the ladders of Saudi society, helped in part by his birthplace.\n“(Bin Salman) wants people who are switched on commercially,” explains Simon Chadwick, a professor of Sport and Geopolitical Economy at Paris’ SKEMA Business School. “But he needs to keep the provinces onside, so he was especially looking to promote people from those regions who could be part of this progressive vision of the future.”\nBin Salman increasingly wanted Al-Rumayyan by his side. He bought Al-Rumayyan a house worth 250 million Saudi riyals (over $60m) near the presidential palace, while the two began spending long periods of time together beyond official meetings.\nThe Ritz-Carlton episode had another impact on Al-Rumayyan and PIF: cash. In 2014, PIF had assets of $84bn. By early 2019, just over one year after the detainment, it had $320bn. The headcount had risen from less than 50 to 500. Saudi documents filed to a civil court in Canada as part of an unrelated case show one of Bin Salman’s aides asked Al-Rumayyan to transfer 20 companies linked to the anti-corruption purge to PIF during this period, which the governor replied to with hand-written approval.\nSaudi officials acknowledge that at least $107bn was stripped. Bin Salman maintains that those affected were guilty of corruption. A footnote — one of those purged was businessman Nasser Al Tayyar, whose house was bought for Al-Rumayyan by Bin Salman, the money returning to the Saudi state.\nAdvertisement\nOver the past four years, PIF has continued to grow and now employs more than 2,000 people, holding at least $600bn of assets.\nThen came the third event: the murder of Jamal Khashoggi. In October 2018, Saudi journalist Khashoggi, who had written critically about Bin Salman in the Washington Post, walked into the country’s embassy in Istanbul. There, he was killed and dismembered by a 15-member squad of Saudi assassins, who flew into Turkey on a jet transferred to PIF as part of the Ritz-Carlton detainment. Several alleged perpetrators were later sentenced to death by a Saudi court.\nThe Turkish authorities, a CIA report, and a United Nations investigation have blamed Bin Salman for ordering the murder. He denies the killing was carried out on his request but took “full responsibility” in an interview with U.S. TV show 60 Minutes in 2019, acknowledging it was carried out by individuals working for the Saudi government. There is no indication Al-Rumayyan had any involvement.\nSaudi Arabia’s modernisation project had taken a major blow. Germany and France placed sanctions on Saudi Arabia, while Virgin owner Richard Branson cancelled a proposed deal with the country. Bin Salman, called a “pariah” by now-U.S. President Joe Biden, dismissed advisor Saud al-Qahtani, who was considered by the CIA to have overseen the assassination, and placed him under house arrest.\n“Al-Qahtani was seen as his right-hand man,” says Davidson. “But it’s been important to (Bin Salman) that he has a trusted representative who can travel freely to the United States, which he has not chosen to do himself since the killing. That man is Al-Rumayyan. It’s almost certain to say that if Khashoggi’s death had not taken place, it would have been (Bin Salman) we see playing in American golf tournaments.”\nKhashoggi’s murder also accelerated PIF’s strategy. By mirroring the sporting investments of the Abu Dhabi and Qatari sovereign wealth funds, Bin Salman could appeal to Saudi Arabia’s young population (70 per cent is under 30) as he sought their political support. But it also had an external role. Would tourists and businesspeople want to visit a Saudi Arabia tarred with the brush of Khashoggi’s murder?\nIn Newcastle and LIV Golf, PIF saw a soft-power opportunity and a blank advertising canvas.\nAdvertisement\nSix months after PIF paid £244million of the £305million needed to buy Newcastle from Mike Ashley, on the same day Al-Rumayyan had that kickabout at St James’ Park, Newcastle’s owners joined the squad in the dressing room for their now-traditional post-win photograph. At the front, from left to right, are co-owners Jamie Reuben, Amanda Staveley, Al-Rumayyan, and Mehrdad Ghodoussi.\nUNITED. AS. ONE.\n⚫️⚪️ pic.twitter.com/NGf9QFbMoB\n— Newcastle United FC (@NUFC) April 20, 2022\nAnother figure stands at the back, between Eddie Howe and Javier Manquillo, clad in a grey suit, a black-and-white scarf around his neck: Majed Al Sorour, a high-school friend of Al-Rumayyan, who used to play football professionally for Al-Nassr.\nBest known for his work as chief executive of the Saudi Golf Federation and managing director of LIV Golf, he was also the second Saudi member of Newcastle’s board. His duties included conducting official club business by speaking with potential outside partners, though like Al-Rumayyan, he did not attend Premier League meetings or directly involve himself in the minutiae of transfer negotiations. Al Sorour was a more visible presence than Al-Rumayyan on Tyneside, even if he did not attend every match.\nQuietly, in documents filed to Companies House in December 2022, Al Sorour stepped down from the Newcastle board. In February, two other PIF-linked executives were appointed directors of the club in his place — Abdulmajid Ahmed Alhagbani, head of MENA (Middle East and North Africa) Securities Investments at the company, and Asmaa Mohammed Rezeeq, whose remit for the sovereign wealth fund includes sourcing global investments.\nIn the following months, Al Sorour would also leave every other formal role he held, including his positions at Golf Saudi, LIV Golf and Performance 54, a British-based sports marketing agency.\nNewcastle United, Golf Saudi and Performance 54 all declined to comment to The Athletic when asked about the reasons behind Al Sorour’s departure. Al-Rumayyan also declined an offer to be interviewed for this article.\nThough there are no suggestions anything untoward has happened to Al Sorour, his sudden absence demonstrates the capricious nature of life for the elite in Bin Salman’s Saudi Arabia. A string of the Crown Prince’s previous advisors have rapidly found themselves out of favour.\nAdvertisement\nThere was Saud Al-Qahtani, dismissed after the Khashoggi killing and placed under house arrest. Adel Fakieh, the minister of economy and planning, arguably more influential than Al-Rumayyan, was caught up in the Ritz-Carlton purge. Khalid Al-Falih, the energy minister, was publicly stripped of his duties in September 2019 after questioning Bin Salman’s directives — Al-Rumayyan took his place as chairman of the Aramco board.\n“(Bin Salman) has a very small inner circle. He has an issue trusting people because there’s so much backlash within his own family,” explains Davidson. “One characteristic running through personalistic regimes is arbitrary hirings and firings at the top, it’s very dynamic.”\nWhen creating the plan for Vision 2030, the Saudi government was advised by U.S. consulting firm McKinsey. Some see their influence in a new target-driven Saudi Arabia. “If you don’t achieve your targets, you’re gone, you’re out,” says Chadwick. “When the times are good, you’ve got some longevity. But we’re beginning to see that turnover of employees.”\nCharged with delivering Bin Salman’s futuristic vision, Al-Rumayyan quickly discovered the crown prince is a demanding supervisor. The businessman remembers the first formal PIF board meeting lasting two consecutive days, with delivery expected immediately. “He used to request information he needed immediately,” Al-Rumayyan told Thmanyah Radio. “But it would have usually taken two or three months to collect.”\nSome within PIF have expressed fears the wealth fund is finding it difficult to fulfil Bin Salman’s briefs. Al-Rumayyan has previously explained his philosophy in Saudi interviews — it is better to have 100 goals and succeed in 70 than to have 10 targets and complete them perfectly. “There’s a risk PIF is over-extended because every major initiative the Crown Prince announces has grown too big to implement,” says one Saudi-based expert, speaking anonymously to protect relationships.\nOthers perceive the decision-making as over-centralised, with too many projects needing to be signed off by Al-Rumayyan, who has so many senior roles beyond PIF. One story which illustrates his desire to be involved in details describes him joining the Aramco board, noting the security guards were better than PIF’s, so he organised a training programme for the PIF guards, tripled their salary, and introduced New York doormen-style uniforms.\nFrom a Newcastle perspective, officials have found some decisions requiring approval can get snarled up in PIF’s structure. Part of the delay in sourcing a chief executive and then ratifying the appointment of Darren Eales, who joined from Atlanta United in August, was finding a slot in Al-Rumayyan’s diary for interviews to be held.\nAdvertisement\n“The risk is that he has over-promised what he can deliver to (Bin Salman),” says one Saudi-based source, speaking anonymously to protect relationships. “He’s basically been charged with delivering the moon, and it’s not easy trying to keep up with the grandiosity of the projects being launched.”\nIn such a pressurised role, where favour is fickle and the targets are ambitious, his lack of pre-existing relationships could be another explanation for his rise. “(Bin Salman) needs someone close enough to trust, who he can invite into the central core of the family,” says Chadwick. “But at the same time, they need someone who is far enough away from them who, if he messes up, can be disassociated. We’re seeing the same thing now with Sheikh Jassim and the Qatari bid for Manchester United. People ask, ‘Who is this guy?’ He’s a member of the royal family, but just not one of the central hardcore, kept at arm’s length.”\nAl-Rumayyan might appear powerful. He is also disposable.\n“He works for a guy,” says Scheck. “He has a lot of money and can do certain things he wants. But he’s a courtier.”\nOne thing protecting Al-Rumayyan is his international prominence. He is one of the faces of LIV Golf, appears on the big screen at St James’ Park and leads PIF and Aramco negotiations abroad — helped of course by a sizeable chequebook. In July 2022, he was even photographed with Donald Trump standing at the first tee of Trump National Golf Club Bedminster. Both wore ‘Make America Great Again’ hats.\nHis downfall would be noted and, regardless, it is clear Bin Salman currently has faith in Al-Rumayyan. In terms of investment returns, PIF is lagging behind several other sovereign wealth funds, despite high-profile acquisitions, but Al-Rumayyan is not considered the economic brain behind the fund — sources uniformly agree his strength is how personable he is with other businesspeople, a useful skill. Deals are often conducted on the golf course.\nThe signs of pressure, however, are there. In November 2019, one of his first tasks as chairman of the Aramco board was to float the company publicly. By selling just 1.5 per cent, the hope was it could raise around $30bn of funds, with Bin Salman seeking a total valuation of $2trillion. Failure to hit this metric had led to the removal of Al-Rumayyan’s predecessor. According to a Financial Times report, when top bankers relayed a consensus valuation of between $1.1tn-$1.5tn, Al-Rumayyan “went mad”. “In that context, flying into a rage is a sign of frustration,” says Scheck. “It’s a sign of power you wish you had — to make things your own way.”\nAdvertisement\nThree months later, Scheck himself was involved in a controversy involving Al-Rumayyan, when he co-authored an investigation in the Wall Street Journal (WSJ) that claimed former reality TV producer Carla DiBello had become a key advisor within PIF on deals including the first bid for Newcastle and investment in Indian conglomerate Reliance Industries. A businesswoman who previously worked as an executive on Keeping Up With The Kardashians, the WSJ reported that some within PIF had raised questions.\n“This is the sort of thing that would typically shorten an advisor’s career,” says Scheck, who now works at the New York Times. “But Al-Rumayyan has managed to weather these potentially embarrassing incidents because he’s loyal, and MBS trusts him.”\nAt the time, a PIF spokesperson said the WSJ had “misrepresented” facts, but did not specify which details were disputed, while a lawyer for DiBello denied any improper conduct and said she was not paid by PIF.\nIn 2023, Al-Rumayyan faces one more risk, stemming from the day his then-seven-year-old son Faisal fell off his horse. “Faisal’s mother forbade riding after that incident, so we looked for a sport with less physical contact,” said Al-Rumayyan. “We found golf by accident.”\nWhen asking about Al-Rumayyan’s interests outside work, every acquaintance agrees his love for golf is genuine. He says he plays off a 12 handicap and has joked he is “good out of bunkers” due to the Saudi desert. The driving force behind LIV Golf, the personal has now become the professional, the new tour which was launched by Saudi Arabia to disrupt golf’s status quo.\nIts emergence has not come without controversy. A string of legal cases emerged in the United States after the PGA Tour banned LIV-aligned players from playing in their events, with the former demanding Al-Rumayyan be subpoenaed in District Court for information on the league’s creation. PIF claimed Al-Rumayyan has sovereign immunity as a member of the Saudi government — a statement which, in turn, led to a minor storm due to assurances received by the Premier League that Newcastle were not state-controlled.\n“Giving evidence could really damage his relationship with the Crown Prince,” said one Saudi-based expert, speaking anonymously for his own security.\nAdvertisement\nThis would not prove to be an issue. On Tuesday, it was announced that the PGA Tour and LIV Golf would merge commercially. The litigation between the two sides would also end as a result.\nAlmost two years ago, when PIF’s potential takeover of Newcastle was scrutinised due to Saudi Arabia’s human rights record, Al-Rumayyan’s reaction was one of profound frustration. “Everything PIF is involved in has succeeded,” an insider on a call with Al-Rumayyan, speaking anonymously to protect relationships, remembers him saying. “Hospitals, universities, wind farms — they’ve brought huge benefits to the British economy. So why isn’t this being recognised?” Eventually, the Premier League approved the takeover.\nNewcastle is an important component of PIF’s investment strategy. While LIV was enduring difficulties, Newcastle have soared from the relegation zone to a place in the Champions League in around 18 months. With the Premier League being the world’s most-watched competition, failure at Newcastle could have been humiliating, especially when tracked by Saudi Arabia’s youthful and football-obsessed population.\nThankfully for Al-Rumayyan, the team succeeded last season. Although the chairman is not a regular presence at St James’ Park, he did attend the Carabao Cup final defeat to Manchester United and the Premier League loss to Liverpool in February. He ultimately holds similar oversight to Mike Ashley, the previous owner, with Al-Rumayyan’s approval needed on major decisions — particularly when it comes to significant expenditure.\n“He who pays the piper calls the tune,” is how one source with knowledge of the inner workings at Newcastle, speaking anonymously to protect relationships, describes it.\nAl-Rumayyan does not run the club day-to-day. Manager Eddie Howe and Dan Ashworth, the sporting director, lead the footballing side. Staveley, Ghodoussi and Eales run the off-field business. Howe said in March that his direct dealings with Al-Rumayyan and PIF are “very, very low”. The head coach primarily speaks to Al-Rumayyan during board meetings; sometimes via video link; when the chairman attends matches; or when Newcastle have visited Saudi, as they did in January and December 2022.\nThere have still been several significant interventions, however. After Newcastle’s 3-3 draw against Manchester City, during which striker Callum Wilson limped off injured, Al-Rumayyan signalled his intention to “do something big”. Newcastle broke their club record to sign Alexander Isak five days later for around £60million (now $73.9m). The previous January, after watching a meek 1-0 FA Cup loss to Cambridge United, he approved the decision to exercise Chris Wood’s Burnley release clause. The £25million fee was internally accepted as being inflated, but Newcastle’s need was such that Al-Rumayyan was convinced to ratify it.\nAdvertisement\nFollowing that embarrassing cup exit to Cambridge, he also entered the dressing room to offer encouragement to players and speak to Howe, who persuaded the PIF governor to invest heavily during a transfer summit in Jeddah later that month. Bruno Guimaraes, Dan Burn and Matt Targett joined Kieran Trippier and Wood on Tyneside, for a total outlay of £92million.\nIn February, while he was on Tyneside for the Liverpool defeat, Al-Rumayyan received presentations and reports from the main department heads at Newcastle, including Howe, Ashworth and Eales. He enquired about their success so far and asked what needed to improve, assuring them he would provide the money and resources to ensure the club achieve their grand ambitions. The potential summer transfer budget and soon-to-be-announced commercial deals were discussed with Al-Rumayyan.\nProgress has already occurred at breakneck speed at St James’ Park. Of all Al-Rumayyan’s investments, arguably none have increased in value as much as Newcastle, who the chairman has speculated may eventually be worth at least $3.5bn. The club’s qualification for the Champions League — having only targeted 10th place internally before the 2022-23 season — will have had an impact on value.\n“Being in (Bin Salman’s) inner circle is, I guess, a bit like being a football manager,” says Chadwick. “When the times are good, you’ve got longevity. But if you don’t hit that points target, don’t qualify for Europe, don’t get promoted, you’re out.”\nAl-Rumayyan’s unlikely route to the Gulf elite has involved him navigating a pathway strewn with pitfalls. His current role tasks him with hitting onerous and imposing targets while being spread thinly across jobs intended for a dozen businesspeople. Just like in football, the luminaries of today are only ever months away from removal in this capricious and fickle business. In October 2022, he wrote to Newcastle fans that it will take “patience and persistence” to reach their goals. He will presumably be hoping for such luxury himself.\nAdditional reporting by Chris Waugh",
  "word_count": 4789,
  "scraped_at": "2026-02-14T01:48:06.473555",
  "_text_extracted": true
}