{
  "article_id": "0c9faf3401ad",
  "url": "https://www.palatinate.org.uk/why-ruben-amorim-is-the-perfect-replacement-for-erik-ten-hag/",
  "title": "Why Rúben Amorim is the perfect replacement for Erik ten Hag",
  "date": "20241107T123000Z",
  "domain": "palatinate.org.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why Rúben Amorim is the perfect replacement for Erik ten Hag\nBy Dylan McLaren\n“Eras come to an end.” This was Erik ten Hag’s message to Manchester City and Liverpool when he took the Manchester United job in April 2022. Now, two and a half years later, ten Hag’s era is the one that has ended, with Liverpool and Manchester City currently sitting as the top two teams in the Premier League table.\nAfter a poor start to the season under the Dutchman, the club currently sit in 14th place in the Premier League and without a win in Europe for over a year. Manchester United’s owners the INEOS group have triggered the £8.3 million release clause for Sporting Clube de Portugal’s manager Rúben Amorim, seeing him join the club following the conclusion of the November international break. As we approach his first game, many will be asking who is the 39-year-old, and why is he the right man to take the Red Devils back to the top of English and European football?\nAmorim is fairly new to management, taking his first job in 2018 where he briefly managed Portuguese side Casa Pia before a dispute with the Portuguese Football Federation which led to his resignation. Amorim then took charge of S.C. Braga B in 2019 before becoming their first team manager later that year. In March 2020, Sporting CP paid the £8.65 million release clause in his Braga contract to bring him to the club, where he would win two league titles and three domestic cups. Now, after a solid start to the 2024/25 season that sees Sporting CP on top of the Portuguese league whilst also being on the same points as Manchester City in the Champions League, the former Benfica midfielder has been given the hot seat at Old Trafford, tasked with turning around their abysmal start to the season under Erik ten Hag.\nAmorim goes into the Manchester United job with something ten Hag never had: the unanimous backing of the board. Over the summer, it was revealed that Manchester United had sounded out now England manager Thomas Tuchel to take the job from the Dutchman however following the Reds’ shock FA cup victory over Manchester City, ten Hag stayed, and was given £200 million to spend on fresh players. When it came out that Manchester United had actively searched for new managers, it was clear that he did not have the backing of every member of the Manchester United hierarchy.\nThe speed which Amorim has been appointed demonstrates the clear backing from INEOS ten Hag did not have. When he was relieved of his duties around 11am on October 28th, not even seven hours later, there were reports that Amorim would have his release clause activated. INEOS were aware who they wanted and must have been aligned on who they felt was the right man for the job. This clear support will benefit Amorim massively, as he can do his job without the fear that any slip-up could be term-ending.\nThe determination shown by INEOS to get the man they saw right for the job is astonishing and shows they clearly believe he is good enough to take Manchester United back to the top. Something fans and the media had been extremely critical of under Erik ten Hag was the Old Trafford teams lack of a clear playing style. Before joining Manchester United, ten Hag had played wonderful high pressing football with Ajax. However, he admitted in a press conference while at Manchester United he would not play the same football he did at Ajax, leaving many to wonder what the point of hiring him was if not for his tactical approach.\nAmorim has a firm set of tactical beliefs fans will hope to see him stick to. Though I would love to sit here and write page after page analysing his tactical system, I’m not sure anyone would read it, so put simply, he plays a 3421 formation with a goalkeeper who is comfortable with the ball. In front of this are two quick centre backs who play wide and a stronger centre back in the middle however all three are comfortable on the ball. On each flank are energetic wingbacks, a hard-working midfield and dynamic attack that centres on creating chances for the striker.\nManchester United’s summer acquisitions of Leny Yoro, Matthijs de Ligt, Noussair Mazraoui and Manuel Ugarte are perfect for this system. Certain players at the club previously will also fit in with ease, particularly Kobbie Mainoo and Rasmus Højlund. At Sporting CP, Amorim turned striker Victor Gyökeres into one of the best strikers in Europe, averaging over 1.2 goal contributions per game in all competitions. Højlund, who has only managed three shots and one goal in the current Premier League campaign, will be able to flourish in a system that supports his style of play. Mainoo on the other hand is perfect for the attacking orientated midfielder role in Amorim’s two-man midfield.\nAmorim absolutely must stick to this tactical system. One of ten Hag’s biggest mistakes was changing his style to fit what the players wanted, and in doing so lost his identity. Manchester United need a clear style of play, and it must be exciting. Fans are tired of watching their team not create clearcut chances in a game and are calling for a manager who plays exciting football, and no one in Europe does this better than their new manager. Since the start of the 2023/24 season, no team in Europe’s top five leagues has scored more league goals than Amorim’s Sporting CP side with 126. For context, in the same period United have scored only 65. They are desperate for a manager who knows how to attack, and Amorim is the perfect choice.\nThe development of players is also an essential part of why Manchester United wanted Amorim. Despite his many flaws, ten Hag was an amazing manager under whom to work as a younger player. His tenure saw the rise of stars such as Alejandro Garnacho and Mainoo, and it is a key component of Manchester United’s DNA to bring through talented youth. Amorim excels at this, bringing through countless young talents at Sporting CP. João Palhinha, Nuno Mendes, Matheus Nunes and Pedro Porro all currently play at the highest level and owe their development to Rúben Amorim. He is incredible at creating talent from the academy, and at Manchester United, you would expect no different. Academy players such as Harry Amass, Chido Obi-Martin and Sékou Koné will hope to become star players under Amorim’s leadership. He is not afraid to put youth players in as soon as they are ready, and these three particularly deserve a chance. As Manchester United icon Sir Matt Busby would often say, “If you’re good enough, you’re old enough.”\nThe Manchester United role is arguably the most heavily scrutinised position in world football. Amorim was seen as the leading candidate for Liverpool in the summer before they opted for Arne Slot. He was also seen as the ideal replacement for Pep Guardiola at Manchester City should he leave at the end of the season. However, the mood has shifted since his announcement as Manchester United’s boss. Instead of being a talented and exciting young manager, he is inexperienced at the highest level and not good enough. These are the same points the media used to weaken ten Hag’s support over his tenure. However, the difference here is that Amorim will be more friendly to the media than his predecessor.\nErik ten Hag struggled to show his personality in press conferences and was often criticised for lying or holding onto past mistakes. His incessant referencing of United’s offside goal against Arsenal early in the 2023/24 season and his constant referencing of the two trophies he had won made him unlikeable to some. Amorim is not the same with the media. He speaks English to a remarkably high level, is very direct with the press and is willing to joke with interviewers. Though the media may be harsh to him at first, he should be able to win them over with his personality. Ultimately though, a good set of results that see the club move from 14th will be the real source of any praise.\nTactically, developmentally, and just as a human being, Rúben Amorim seems to be the perfect man to get Manchester United firing again. However, we have seen great managers in the Old Trafford dugout struggle since Sir Alex Fergusons departure over a decade ago. Fans will be praying Amorim will finally be the one to take them back to where they feel they belong. Dubbed by many as “the next Jose Mourinho” (despite being tactically opposite), hopefully Amorim’s time in Manchester is longer than The Special Ones.\nImage: Agencia LUSA via Wikimedia Commons",
  "word_count": 1475,
  "scraped_at": "2026-02-14T02:26:24.529830",
  "_text_extracted": true
}