{
  "article_id": "0ca16ae7bd4d",
  "url": "https://www.france24.com/en/live-news/20230517-newcastle-don-t-feel-hunted-says-howe",
  "title": "Newcastle dont feel  hunted , says Howe",
  "date": "20230517T124500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle don't feel 'hunted', says Howe\nLondon (AFP) – Newcastle boss Eddie Howe says he does not feel as if his team are being \"hunted\" as he seeks to fend off charging Liverpool and finish in the Premier League's top four.\nIssued on:\nThe Magpies, seeking to qualify for the Champions League for the first time in two decades, host high-flying Brighton at St James' Park on Thursday.\nRoberto De Zerbi's side, fresh from a 3-0 win at Arsenal, are chasing European football for the first time in their history.\nNewcastle are currently third in the table -- behind Manchester City and Arsenal -- level on points with Manchester United. Both Newcastle and United have three games remaining.\nJurgen Klopp's Liverpool are just one point behind, having played a game more, after their seventh straight league win at Leicester on Monday.\nHowe said Newcastle still had matters in their own hands and insisted he was not focusing on red-hot Liverpool.\n\"I don't feel like we're being hunted,\" he said at his pre-match press conference on Wednesday. \"I don't feel that emotion. It's us against ourselves, really. That's how I see it. It's us trying to be the best we can be.\n\"I've not focused on any other team all season. In my experience, I knew Liverpool were never far away because they are a top team and they are capable of going on runs of wins.\n\"They are very similar to Manchester City where they can win a group of games without blinking. They have got that experience.\"\nVictory in Newcastle's last two home games, against Brighton and then Leicester on Monday, would guarantee a place in the Champions League.\nHowe also said he hoped the security breach that left him in danger at Elland Road could help prevent a future \"tragedy\" on a football pitch.\nThe 45-year-old was confronted in his technical area by an angry spectator during Saturday's 2-2 Premier League draw at Leeds, and a man has since been banned from the stadium for life and charged with assault.\n\"I just hope that that incident itself can then help the authorities and whoever is concerned with the security and safety of the players and staff,\" he said.\nHe added: \"I'd hate to see a tragedy on a football pitch that could have been avoided.\"\n© 2023 AFP",
  "word_count": 390,
  "scraped_at": "2026-02-14T02:24:42.736308",
  "_text_extracted": true
}