{
  "article_id": "0ca562a84436",
  "url": "http://www.china.org.cn/2025-11/28/content_118199657.shtml",
  "title": "Barcelona , Atletico look to pressure Real Madrid in La Liga",
  "date": "20251128T051500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 14th round of matches in La Liga gives FC Barcelona and Atletico Madrid the chance to pile the pressure on Real Madrid, while a Seville derby always entertains and Villarreal has a fascinating visit to an in-form Real Sociedad.\nBarcelona needs to recover from the 3-0 away loss to Chelsea in the Champions League and has a good chance to do that when Alaves visits the semi-revamped Camp Nou Stadium on Saturday afternoon.\nGiuliano Simeone (L) of Atletico de Madrid competes during the UEFA Champions League football match between Atletico de Madrid and Inter Milan in Madrid, Spain, Nov. 26, 2025. (Xinhua/Cheng Min)\nPedri could be back to give extra creativity to the Barcelona midfield, but Barcelona coach Hansi Flick will be keen to continue rotating his side as much as possible ahead of next Tuesday's game against Atletico.\nAlaves has conceded just 12 goals this season, but has only netted 11 times in 13 matches, while the Barcelona players go into the match knowing a win would lift them two points clear ahead of Real Madrid's visit to Girona on Sunday night.\nKylian Mbappe took some of the pressure off Real Madrid coach Xabi Alonso with his four-goal haul away to Olympiakos on Wednesday, but the 4-3 final score again highlights the problems Madrid has in defense.\nAlonso should have Thibaut Courtois back after the stomach bug that saw him miss out in Athens. Antonio Rudiger has a chance of playing after his long injury layoff in Sunday's visit to Girona.\nGirona is still in the bottom three, but last weekend's draw away to Betis has confirmed signs of improvement in Michel Sanchez's side, which has the worst defensive record in La Liga.\nAtletico Madrid scored a late winner against Inter Milan in the Champions League and Diego Simeone's team should have a relatively comfortable Saturday night at home to bottom of the table Oviedo.\nOviedo has improved since Luis Carrion's return as coach, but seems to be enough yet to survive this season.\nThe Seville derby between Sevilla and Betis always tends to produce fireworks and this comes at a difficult moment for Sevilla, that has a long injury list and has suffered four defeats in its last five matches.\nBetis would normally be favorite, but just 65 hours after the end of its Europa League clash against Utrecht means Manuel Pellegrini is short of recovery time for his players.\nVillarreal is developing into a Jekyll and Hyde team, with excellent La Liga displays mixed with some horrible Champions League performances, such as Tuesday's 4-0 thrashing away to Borussia Dortmund. Marcelino Garcia Toral's side visits a Real Sociedad side in top form after a 3-1 win away to Osasuna last weekend that gives it three wins and two draws in the last five matches.\nThe round of games starts on Friday when Getafe is at home to Elche in what looks to be a contrast of styles with Getafe probably aiming to break up Elche's passing game.\nOsasuna takes its terrible away record of six defeats and a draw to Mallorca, with coach Alessio Lisci under increasing pressure in Pamplona and without key defender Alejandro Catana.\nThe pressure is also building on second from bottom Levante that is at home to an Athletic Club Bilbao that creates chances, but fails to take them.\nCelta Vigo is at home to Espanyol in what looks to be an even match and the round of games finishes on Monday with Rayo Vallecano at home to a Valencia looking to climb away from the relegation zone.",
  "word_count": 595,
  "scraped_at": "2026-02-14T02:09:38.456859",
  "_text_extracted": true
}