{
  "article_id": "0cb6d313d06c",
  "url": "https://www.arsenal.com/news/mikel-kepas-mentality-and-warrior-hincapie",
  "title": "Mikel on Kepa mentality and  warrior  Hincapie",
  "date": "20251028T190000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has described Piero Hincapie as a 'warrior' following the Ecuadorian's Premier League debut in our win over Crystal Palace.\nThe South American came in for Riccardo Calafiori in the 82nd minute and helped us preserve another clean sheet as we won 1-0 at Emirates Stadium.\nIt was his second appearance after featuring as a late substitute against Athletic Club in the Champions League in September, and ahead of facing Brighton in the Carabao Cup, Mikel was quick to praise Piero's versatility and desire.\n\"He's a warrior,\" Mikel said in his pre-match press conference. \"He's going to bring such intensity, physicality, and emotion to the team as well. He’s quality on the ball - he's a player who is super keen.\n\"He can play inside, he can play in wide positions, he's done it, as you said, in different ways, and now we need to get him up to speed because the moment that physically he's at his best, he's going to raise the level.\"\nAnother player Mikel said has raised our levels is goalkeeper Kepa Arrizabalaga since his move from Chelsea in the summer.\nKepa made his debut in the Carabao Cup third round against Port Vale and our manager believes his attitude in training has been a key factor in our impressive defensive numbers at the start of this campaign.\nOn the Spanish international, Mikel said: \"David [Raya] has been incredibly good for us in the last few years and Kepa knew that when he came in, but he's ready to compete.\n\"If I have to highlight behaviours in that dressing room and culture, probably I would mention him as number one, because again, he's come into a different environment after winning everything in football, almost, being in the national team, Chelsea, Real Madrid, big, big clubs and he comes here and every single day he's behaving like tomorrow's training session is the most important one in his life.\n\"He will have his chances to play, he's in a really good place, and if he plays tomorrow, I'm sure he will be really, really good. I think Kepa has raised the level, he has created a true great environment for everybody to shine and I think that's down to him.\"\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 400,
  "scraped_at": "2026-02-14T02:26:56.604974",
  "_text_extracted": true
}