{
  "article_id": "0cc34a9ed212",
  "url": "https://www.bbc.com/sport/football/articles/ce3l3q16d3go",
  "title": "Conor Bradley : How Liverpool full - back has proved he can replace Trent Alexander - Arnold",
  "date": "20250206T084500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Toughening up' in League One - the making of Bradley\n- Published\nA one-club player is rare these days so perhaps Liverpool always knew a time might come when Trent Alexander-Arnold moved on.\nThe 26-year-old England international has been with the Reds since he was a child but with his contract set to expire, Alexander-Arnold has announced he is leaving Anfield and looks set to join Real Madrid.\nBut the prospect of his somewhat inevitable departure has been softened by the emergence of Conor Bradley in recent years.\nThe 21-year-old Northern Irishman has impressed when he has had to deputise - from Alexander-Arnold's spell out through injury last season to his eye-catching display against Real in the Champions League last November.\nHaving been with Liverpool himself since his mid-teens, Bradley signed a new four-year contract with the Reds in May 2025. It could soon be time for him to make the right-back position his own - even if Liverpool are closing in on a deal for Bayer Leverkusen's versatile right-sided Dutchman Jeremie Frimpong.\nCatching the eye as a young forward\nBradley first joined Liverpool's youth academy in 2019 but had been affiliated to the club for much longer than that, having been at their Northern Ireland development centre since he was nine.\nAt that age, the defender - who was born in Aghyaran in County Tyrone - was a sport enthusiast, representing his school in Gaelic football, football, hurling, athletics and cross country running.\nBut it was mainly as a young footballer that those who coached Bradley saw just how big his potential could be.\nOne year earlier, the eight-year-old had been brought to the attention of Joe McAree, who had been at the forefront of youth football in County Tyrone for almost 50 years.\n\"Everyone else had gone home when the referee, Adie Laird, approached me,\" recalled McAree in a 2021 interview with BBC Sport.\n\"He said he knew of a player who could make our team even better - 'he's playing for St Patrick's in Castlederg and he's the best I've ever seen. He's eight years old and his name is Conor Bradley'.\"\nMcAree was keen for Bradley to join the renowned Dungannon United Youth, which had seen many youngsters come through to forge successful careers in the professional game.\nBecause of his age at the time and distance from the set-up, though, it would be a couple of years before Bradley did sign for them. When he did, it was not as the right-back he would become in his professional career.\n\"He was a forward player for us, spraying the ball around the pitch,\" recalled McAree.\n\"His passing was exceptional. His awareness of where to distribute a ball - that was Conor's strength, and he could cover the ground as well.\"\n'Toughening up' in League One\nBradley made the permanent move to Liverpool when he was 16, joining the club's youth academy on a two-year scholarship.\nBut so impressive was his form, he signed professional terms with the Reds just one year into that.\nHis big opportunity to prove himself in senior football came with a loan move to League One side Bolton for the 2022-23 season.\nIn total he made 53 appearances in all competitions during his spell with Wanderers and impressively swept the club's awards, being named the club's Young Player, Players' Player and Player of the Season.\n\"It was an unreal season, it was everything I wished for and more,\" said Bradley.\n\"To play that many games, that is what I wanted to go and do. It toughened me up a bit and it was vital for me.\"\nHis form did not go unnoticed by then-Reds boss Jurgen Klopp, who brought him into the first-team fold for pre-season before the 2023-24 campaign.\nBut little did Bradley know at the time, an even bigger chance to impress the German was soon to follow.\n'Absolutely magnificent' - taking his chance under Klopp\nAt the start of last year Alexander-Arnold suffered a knee injury.\nKlopp had been impressed enough by Bradley during the summer before to decide against signing another right-back and instead showed his trust in the youngster by handing him his full Premier League debut on 21 January, 2024 against Bournemouth.\nIt was a chance he took with both hands.\nLiverpool won the game 4-0 with Bradley providing an assist for Diogo Jota's second goal.\nTen days later he scored his first goal for the Reds and provided two more assists in a 4-1 success against Chelsea, earning him the man of the match award after a scintillating display.\n\"He was absolutely magnificent,\" said former Liverpool striker Robbie Fowler.\n\"Every Liverpool player was brilliant but that was a special performance. Anyone who went over his side, he defended unbelievably.\"\n'He's got devilment' - Northern Ireland breakthrough\nDuring his rise at Liverpool Bradley also swiftly developed into a Northern Ireland regular.\nHe had captained his national team at under-16 level before receiving a call to the senior team in May 2021, making his debut later that month as a late substitute in a 3-0 win against Malta.\nBradley's first international goal came against Scotland in a 1-0 friendly win in March last year, before he capped a strong 2024 for his country with three more.\nBut aside from the goals it has been his combative displays for Northern Ireland that has delighted the fans from the moment he first broke through.\nIn September 2021, shortly after coming off the bench in a World Cup qualifier against Switzerland, he made a crunching tackle that prompted a huge roar from the Windsor Park crowd.\n\"The thing about Conor is he is aggressive,\" said Jim Magilton, who won 52 caps for Northern Ireland and was on the books of Liverpool before he made a name for himself with Oxford United, Southampton and Ipswich Town.\n\"He tackles. People look at him as this quietly spoken kid but he's got devilment - he couldn't wait to make that tackle against Switzerland.\n\"He would line them up and be licking his lips. You could see that toughness in him which I always loved.\"\nDoes Bradley have what it takes to replace Alexander-Arnold?\nAlexander-Arnold v Bradley\nDefensive stats since 2023-24\nBradley's performance against Real Madrid earlier this season showed, once again, he is more than capable of stepping into Alexander-Arnold's shoes.\nBut just how do the two compare?\nDefensively, there are some key areas in which Bradley comes out on top.\nHe wins almost twice as many duels as Alexander-Arnold per game (6.6 to 3.6) and averages more tackles (3.1 to 2.1).\nAlexander-Arnold v Bradley\nAttacking stats since 2023-24\nAlexander-Arnold is rightly regarded as one of the best attacking full-backs in the world and it is here that he excels in a statistical head-to-head with Bradley.\nMost noticeably, Alexander-Arnold plays more passes into the box and creates more chances on average, with 2.5 per 90 minutes compared to 1.3 for Bradley.\nThere's no doubt the loss of Alexander-Arnold, should he depart, would be a huge blow for Liverpool.\nBut Bradley has shown he is more than capable of stepping up and Reds fans will no doubt be confident he will do so again when Alexander-Arnold moves on.\nA version of this story was first published in February 2025.\n- Published16 August 2025",
  "word_count": 1219,
  "scraped_at": "2026-02-14T01:52:15.345470",
  "_text_extracted": true
}