{
  "article_id": "0cddc56a6a89",
  "url": "https://www.empireofthekop.com/2024/08/15/owen-prediction-liverpool-premier-league/",
  "title": "Liverpool fans may be surprised by Michael Owen bold Reds prediction",
  "date": "20240815T140000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michael Owen has made a bold prediction about Liverpool this season which could pleasantly surprise Reds supporters.\nThe 44-year-old tarnished his reputation among many Kopites in 2009 when he signed for Manchester United, although it seems that he still holds the Merseyside club in high regard, having become a superstar at Anfield at the turn of the millennium.\nFollow Empire of the Kop on Instagram (@empireofthekop) HERE\nThe ex-England striker gave his predicted top four for the new campaign to the Premier League’s official Instagram channel, and the composition of that quartet was a radical departure from what most pundits will have had.\nOwen has gone for Arsenal to be crowned champions and Liverpool to finish second, with Manchester City dropping as far as fourth, one place behind Aston Villa.\nView this post on Instagram\nOwen’s predicted finish for Liverpool is in stark contrast to that of one ex-United teammate, with Gary Neville brashly declaring that he thinks we mightn’t even be in the top six by the season’s end.\nThe bare minimum expectation for Arne Slot in his first season in charge at Anfield is to deliver Champions League football by finishing no lower than fourth, although the group of players that he’s inherited from Jurgen Klopp should be strong enough to consolidate third place.\nIt’ll probably take a couple of elite-level acquisitions to truly push Man City and Arsenal for the title in 2024/25, although only the most optimistic of Reds fans would anticipate being in the mix for overall supermacy by next May.\nLiverpool had been right up there with the top two going into April last term, before the efforts of competing on four fronts with an injury-plagued squad caught up with us during the run-in, so some supporters may be inclined to dream big.\nSecond place would be an impressive feat from Slot this season if Owen’s prediction turns out to be accurate, and we suspect that many Kopites would snigger at the prospect of City being all the way back in fourth after everything that’s gone on in the past few years!\nEOTK Close-up with John Welsh: ‘a local lad who lived his dream’ and Slot’s LFC predictions",
  "word_count": 364,
  "scraped_at": "2026-02-14T02:01:23.780768",
  "_text_extracted": true
}