{
  "article_id": "0ce938ddf3b4",
  "url": "https://www.theguardian.com/world/2025/mar/05/first-edition-russia-view-putin-trump",
  "title": "Wednesday briefing : The view from ​Russia as ​Trump upends the world order",
  "date": "20250305T084500Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning. In his address to Congress last night, Donald Trump recited a letter from Volodymyr Zelenskyy offering to return to the negotiating table – and warmly welcomed the tone of discussions his administration has held with Russia. “We’ve received strong signals that they are ready for peace,” he said. “Wouldn’t that be beautiful?”\nThat was not the first sign of Trump’s faith in Vladimir Putin’s promises – but it served to underline what is surely the most radical US foreign policy shift in a generation. Whether parroting Kremlin talking points on Zelenskyy’s democratic credentials, making false claims that Ukraine started the war or cutting off vital military aid to Kyiv, the US president has created a dynamic that would have scarcely been believable six months ago.\nNow, as his vice president insults the militaries of traditional US allies, Trump sees Moscow as a partner in carving up the world into spheres of influence. That has, unsurprisingly, been greeted with glee in Moscow. But at the same time, there are real anxieties about whether Trump can be trusted.\nSo what do we know about how Russia wants to seize the opportunity it has been presented with – and does it have any reason for caution? For today’s newsletter, I spoke to Pjotr Sauer, the Guardian’s Russian affairs reporter, about whether the Kremlin views Trump as a reliable ally, or a useful idiot. Here are the headlines.\nFive big stories\n-\nKilled women count | Nearly one in 10 of all women who died at the hands of men in the UK over the past 15 years were mothers killed by their sons, a report reveals. The statistics have led to calls for the government to take specific action to tackle matricide.\n-\nTariffs | Justin Trudeau has claimed the aim of a “dumb” trade war launched by Donald Trump is to usher in the “complete collapse” of the Canadian economy and make it easier for the US to annex Canada. Leading stock market indices fell sharply, with the US benchmark S&P 500 losing all its post-election gains, as the US slapped 25% taxes on Canadian and Mexican goods and hiked tariffs on China.\n-\nScams | An organised network operating from the former Soviet state of Georgia has scammed thousands of savers from the UK, Europe and Canada out of $35m (£27m) after they fell for fake celebrity adverts on Facebook and Google. The scheme was revealed in a leak of call centre data covering more than 1m recordings.\n-\nGaza | Arab leaders have endorsed a $53bn (£42bn) plan to rebuild Gaza under the future administration of the Palestinian Authority (PA), in a rushed attempt to present an alternative to Donald Trump’s idea for a property development-style plan. The Arab League presented the plans at a summit in Cairo.\n-\nMedia | Failings in the making of a documentary on Gaza are a “dagger to the heart” of the BBC’s claims of trustworthiness and impartiality, the corporation’s chair has said, as he indicated that figures inside the corporation had fallen short in their handling of the film.\nIn depth: ‘Russia scents blood’\nOne of the signal features of the shift in the US view of the war in Ukraine under Trump has been the reaction from Moscow: senior official after senior official, as well as media pundits loyal to the Kremlin, have exulted in what they describe as an epochal shift in the relationship. “The new [US] administration is rapidly changing all foreign policy configurations,” Kremlin spokesperson Dmitry Peskov said recently. “This largely coincides with our vision.”\n“Obviously, they can’t believe their luck at the moment,” Pjotr Sauer said. “And they welcome what’s happening in Ukraine itself, but also in a bigger global picture. They are very happy at the idea that they will be granted control of a ‘sphere of influence’ in the 19th-century sense, and that Europe may have to accept what Russia has to say about its own so-called back yard.”\nIs there any caution about trusting Trump?\nJubilant though the Kremlin undoubtedly is, there may also be a view that Trump’s stance is an opportunity to be exploited rather than a shift to be counted on, Pjotr said. “The Kremlin is being quite careful in balancing how it treats Trump. Putin has been complimenting him, but officials have been pushing back against western proposals, endorsed by Trump, including the idea of European troops on the ground in Ukraine.”\nPartly, that is driven by bitter memories of the disappointment of Trump’s first term, where the Kremlin was euphoric at his victory but then saw his administration impose new sanctions on Russia and arm Ukraine.\n“The more experienced pro-Kremlin commentators in the media say that Russia still has to be careful, because Trump is an emotional and erratic politician who can change his mind,” Pjotr said. “There is still a school of thought that is suspicious the US is laying some sort of trap, and Trump is playing a game Russian officials aren’t understanding. But most realise this is just how he is, and that this time around, you’re getting a totally different Trump.”\nHow is Russia responding militarily?\nFor a country said by Donald Trump to want peace, Russia is taking a noticeably aggressive stance on the battlefield: Putin’s strategic response to the prospect of some sort of ceasefire has been to double down on its attempts to secure as much territory as possible.\nIn this story, Dan Sabbagh reports on Ukrainian warnings that Russian troops are now being sent on “suicidal missions” to win a foothold across the Dnipro river, sending wave after wave of troops to take control of territory that would help justify their claim to control of the whole of the Kherson region.\n“Russia scents blood,” Pjotr said. “They sense that there is a window of opportunity before Europe has its act together properly and as American aid dries up. Their number one objective is to take back control of the parts of the Kursk region in Russia which Ukraine has occupied, and which is a huge embarrassment to Putin – that is seen as a strong card for Ukraine in negotiations.”\nOne question about how this effort goes is whether the US switches off more of the support that Ukraine relies on, like intelligence sharing and the use of Elon Musk’s Starlink system, crucial to frontline communications. Reuters reported last month that access to Starlink could be cut if no deal on US access to Ukraine’s critical minerals was reached. (Elon Musk has denied that claim.)\nHow big a deal would it be if the US eases sanctions?\nOn Monday, it was reported the US is drawing up options for lifting sanctions as part of broad discussions on improving relations between the two sides. The Pentagon has also ordered a pause in offensive cyber operations against Russia.\nA change to the sanctions regime would be a big deal on its own, Pjotr said, and perhaps a prequel to closer economic ties more generally: “Putin has been saying that if the US wants rare minerals it should come and get Russia’s, and Marco Rubio and others have been talking up joint energy projects in the Arctic.” But the shift would be most significant in how it might open up divides over sanctions on this side of the Atlantic.\n“In the end, Russia’s economic ties with the US are less significant than the ones it has with Europe,” Pjotr said. “The US has such symbolic value that any change in Washington is likely to make it much harder to maintain a unified regime. Countries like Hungary and Slovakia are already sympathetic, and there are others which have been extremely reliant on Russian energy.”\nCould Putin seek a new confrontation with Europe?\nOne of the key self-interested arguments for European nations alarmed by Russia’s actions in Ukraine has been that if Putin is able to escape further consequences for the invasion, he might be emboldened to act elsewhere – and against Nato countries.\nIt’s very early to say whether Trump’s stance has made that more likely in the short term, and it may be that Putin’s interest in the White House’s continued friendship may militate against more decisive action before the next presidential election. But there is little doubt that Moscow is now oriented more vigorously towards military confrontation than it has been for decades.\n“It would be very speculative to talk about what Russia might do next at this point – we haven’t even reached a Ukraine ceasefire,” Pjotr said. “But what is certainly true is that Russia has a huge war economy: it would be very hard to adjust to a peacetime approach. Most European officials don’t believe that it would invite a new conflict right away, but it remains a very militarised society.”\nHe points to a new Finnish intelligence report which says that while Helsinki has not yet been the subject of intense Russian influence campaigns, “this will probably change when Russia is able to redeploy the resources that are currently tied up in Ukraine”.\n“It is likely that some of these troops will be moved to other places on the border with Europe,” he said. “It doesn’t mean a war, but it does ramp up tensions. Putin’s whole ethos and reason to exist is the confrontation with Europe.”\nCould Russia become an ally for the US against China?\nThose seeking a coldly rational explanation for Trump’s recent behaviour suggest that he sees Moscow as a potential partner in a new era of great power politics. Keith Kellogg, the Trump administration’s Russia-Ukraine envoy, said at the Munich security conference that severing the Russia-China alliance was one of the key goals of the new administration’s strategy.\nPjotr is sceptical of whether such a play can come off. “Most serious observers think that’s a very naive way to view the world,” he said. “Putin and Xi have a personal relationship, and Russia is so dependent on China – which has proven a very loyal partner. Putin couldn’t sustain the war economy without Chinese support.”\nCrucially, he points out, Moscow views the US as a much more fickle partner, whose stance might easily change at the next election if a Democrat wins it.\n“Putin knows that Xi is as unlikely as he is to go anywhere in the coming years, barring health issues,” he said. “Clearly, the US thinks that it can peel Russia away from China. But that may stem from the fact that there are not a lot of Russia experts working in the White House.”\nWhat else we’ve been reading\n-\nI soldiered on through 14 minutes of With Love, Meghan, on Netflix last night, and I have to tell you that it left me feeling like Marina Hyde’s reflections were a masterpiece of understatement. “As Her Grace explains: ‘Everyone’s invited to create wonder in every moment,’” she notes. “This is an offer not even promised by most major religions.” Archie\n-\nI loved the outstanding perimenopause novel All Fours by Miranda July, which has been announced as one of the longlisted books for the 30th Women’s prize for fiction. You can read Lara Feigel’s review here. Katy Vans, newsletters team\n-\nGreenland decided to end uranium mining because of serious fears that it would generate toxic waste; now a mining company could force it to restart – or pay $11bn in damages, nine times its annual budget. Patrick Greenfield and Phoebe Weston’s report reveals the astonishing provision of international law that could let it happen. Archie\n-\nIt is newyddion da iawn (very good news) that Sain, the indie label championing Welsh music, is still going strong after 56 years. Katy\n-\nIt’s not quite the same stress reliever as a bunch of videos of cats doing funny things but I’ll happily take these cute woolly mice instead; scientists have started their quest to bring back the woolly mammoth on a smaller scale. Katy\nSport\nFootball | Martin Ødegaard scored twice as Arsenal demolished PSV Eindhoven 7-1 in the first leg of their Champions League last-16 tie in the Netherlands. An own goal and a Marco Asensio penalty in the space of six minutes late on gave Aston Villa a 3-1 win at Club Brugge.\nTennis | Emma Raducanu has revealed she “couldn’t see the ball through tears” and could “barely breathe” during a stalking ordeal at the Dubai Open last month. The 22-year-old Briton said that she had previously been approached twice by a man who was “fixated” on her during her second-round match against Karolina Muchova.\nCricket | Virat Kohli’s 84 steered India past Australia and into the Champions Trophy final, where they will meet New Zealand or South Africa. India went past Australia’s total of 264 with 11 balls to spare.\nThe front pages\nThe Guardian leads with “‘I stand ready’: Zelenskyy vows to work with Trump for peace” while the Mirror has “Disgrace” and “Trump sidekick slur” after JD Vance implicitly ridiculed the British military. “‘Clown’ Vance’s slur on 636 war heroes” says the Express and the Metro goes with “Lest he forget … US vice-pres accused of insulting our dead”. “We’re ready for peace, Zelensky tells Trump” – that’s the Times while the Telegraph has “Zelensky bows to Trump pressure” and the i runs with “UK scrambling to save Ukraine peace deal – as Zelensky grovels to Trump”. The Daily Mail goes with “Zelensky’s olive branch to Trump after PM’s plea”. Top story in the Financial Times is “Trump tariffs trigger Europe sell-off as anxiety over global slowdown rises”.\nToday in Focus\nHow far will Trump’s embrace of Russia go?\nThe US has suspended all military aid to Ukraine. What does this mean for European security? Andrew Roth reports\nCartoon of the day | Stephen Lillie\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nThe “steel pan finals” that kicked off Trinidad and Tobago’s annual carnival are a joyous celebration of an instrument that began as a symbol against colonial oppression. “Pan is a therapeutic instrument that keeps you calm. It’s happy music,” Beverley Ramsey-Moore, the president of Pan Trinbago, told the Guardian’s Natricia Duncan. “It represents the tears, blood and sweat of our ancestors, and it is important as a community-building tool.”\nThe event took place during a state of emergency in the Caribbean country after gang warfare in December. The steel pan festivities, meanwhile, are a key part of a carnival that is “a show of resilience”, in the words of Global Carnival Alliance founder Paige De Leon. “It is the power of the art that started as a resistance to colonial oppression. It is the power of our decision to express ourselves regardless of how you choose to oppress us. Then, it was slavery; now it’s people who break the law and try to create a state of fear.”\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2505,
  "scraped_at": "2026-02-14T01:49:31.518203",
  "_text_extracted": true
}