{
  "article_id": "0cf16a360829",
  "url": "https://www.heraldscotland.com/news/23627260.marijn-beuker-creating-worlds-best-youth-set-up-queens-park/",
  "title": "Marijn Beuker on creating world best youth set - up at Queen Park",
  "date": "20230701T220000Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Having worked with his celebrated countrymen Louis van Gaal, Ronald Koeman, Marco van Basten and Arne Slot during his time at the visionary Dutch club AZ Alkmaar, Marijn Beuker is not the sort of individual to be easily impressed.\nYet, when Dick Advocaat, who is well known to Scottish football supporters from his time at Rangers in the late 1990s and early 2000s, took charge at the Eredivisie outfit for a second time in 2013 it is fair to say that Beuker was blown away.\nThe Little General transformed the fortunes of the struggling side he inherited, secured eighth place in the top flight and a spot in the play-offs for Europa League qualifying and left a lasting impression on his compatriot doing so.\n“Dick is a special guy, an amazing human being,” said the Queen’s Park director of football operations earlier this week. “There was an interim manager who was having a lot of difficulty. He came in and brought a lot of energy. Because he’s so small, he was the wee excitement in the whole building.\n“Dick had that ease of working with people. He was very smooth, but he also still had a lot of authority with the group. That was something I picked up on. I’m not a head coach so I try to look more at things from a different side. It was about his leadership skills, his management ability that he had. That’s what I tried to learn from.”\nBut Beuker, who left his role with AZ after 15 years and joined Queen’s Park back in 2021, is hoping to surpass one of his former colleague’s achievements in Scotland in the seasons ahead.\nAdvocaat enjoyed, in his first two seasons at least, great success at Ibrox. He completed a domestic treble in his debut campaign, landed the double the following term and reached the Champions League group stages. But he did so by spending millions in the transfer market.\nThe only Scottish youngster who broke through and established himself in the first team at Rangers during his tenure was Barry Ferguson.\nBeuker is in the process of putting in place a modern, dynamic and revolutionary youth set-up at Queen’s Park which he hopes will produce a multitude of technically gifted professionals in the years to come.\n“I would say that one is a bit low on the numbers,” he said. “Rangers are a different club to us. I would compare us to AZ. What we want to do is play a particular way of football and in order to do that you need specific players.\n“The best chance to find those players, and its also the cheapest way, is to grow them yourself. It’s also a much more fun way. And the fans have a connection with the locals. That’s why we do it. We have the time to build that. The stress and the need for titles won’t be influencing our decisions for that. We are going to build a sustainable project.”\nQueen’s Park turned professional in 2019 and have since, with the help of funding from wealthy Scottish businessman Lord Haughey, undergone huge change both on and off the park.\nThe training facilities at their Lesser Hampden home are now so impressive that Steve Clarke based the Scotland squad there before their Euro 2024 qualifiers last season.\nElsewhere, Robin Veldman, the former Ajax and Anderlecht coach, was this month brought in as their new manager.\nBut surely, even with the progress they have made in a short period of time, competing with Celtic and Rangers for the brightest young prospects in the game presents its challenges? Beuker is unconcerned by the competition they face.\n“The Glasgow area has 1.6 million people living around it,” he said. “So there is a big, big pool. A club can only add so many players. There is a lot of exciting talent in Scotland and for us we are in the most exciting city for talent because it is so big.\n“I don’t want to say things to parents, I want to have one of the best programmes in the country, in the world. For the last 15 years I try to understand how you make the best programme in the world. I want to have the best that there is and then educate the whole staff group in order to understand that. People will see the difference and I hope it will attract people.\n“Plus, what we are looking for is not necessarily what other clubs are looking for. (Andrea) Pirlo once said football is played with the brain and the feet and the body is just an instrument. So that is something specific we are looking at. We are looking for cognitive ability, intelligence. The profile we look for won’t necessarily be the same.”\nTheir lofty long-term objectives do not mean that Queen’s Park, who missed out on the cinch Championship title and promotion to the Premiership for the first time in 42 years when they lost to eventual champions Dundee on the final day, do not have any short-term aims.\n“Everything we do is related to winning,” said Beuker. “You don’t play a game with the goal of losing. If you have an ambition then the ambition is to play at the highest level and to perform as high as you can perform.\n“What I try to do is calculate it backwards, to ask: ‘What do you need?’. At the end, we want to do it with a lot of young players. We want to produce young players similar to AZ. That is a very, very good way of achieving success.\n“But everything we do is about trying to be as good as we can and win as much as possible. Our focus is on building that process. But as they always say results often take care of themselves.”\nBeuker signed a 10 year contract when he joined Queen’s Park. But he is striving to put a structure in place which will serve the Glasgow club well for years after he has departed. He has already seen evidence the changes he has overseen are already working.\n“This is something for the long-term,” he said. “What is important is that there is continuity in the philosophy. I could die in a couple of months. I hope it doesn’t happen, but when it does, there has to be a continuation at the club.\n“We invest a lot of time to influence staff members to the point where they’re self-supporting. Because there will be a point, when Robin is leaving or I’m leaving. When they do, the club must continue with the philosophy. That’s the most important thing to invest in.”\nThe revolution that Queen’s Park have embarked on may have raised eyebrows in the Scottish game, and led to some derogatory comments in some quarters, but Marijn Beuker and his associates will not be deflected from their task.\n“It doesn’t matter,” he said. “In terms of negativity towards the project, we have the same in Holland. We have a saying over there: ‘There are 17 million national team coaches’. Because everyone has an opinion on something.\n“But we do it because we believe it’s the best way to move forward or achieve something. It might be against the status quo. That’s sometimes what you get. But so be it because it won’t change us. We won’t change what we believe in. It’s logical for us, from A to B.”",
  "word_count": 1244,
  "scraped_at": "2026-02-14T01:56:02.395157",
  "_text_extracted": true
}