{
  "article_id": "0d08ea45359e",
  "url": "https://www.teamtalk.com/news/laliga-head-honcho-adds-weight-keeping-mason-greenwood-out-man-utd-clutches-again-barcelona-defender-rules-out-liverpool-move",
  "title": "Euro Paper Talk : LaLiga head honcho adds weight to keeping Mason Greenwood from out of Man Utd clutches again ; Liverpool defensive target rules out Barcelona exit",
  "date": "20240301T173000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro Paper Talk: LaLiga head honcho adds weight to keeping Mason Greenwood from out of Man Utd clutches again; Liverpool defensive target rules out Barcelona exit\nLaLiga and Getafe are doing everything they can to make sure Manchester United winger Mason Greenwood is still playing in Spain next season, while a top Barcelona defensive star has seemingly ruled out a mooted switch to Liverpool this summer – all in Friday’s Euro Paper Talk.\nGETAFE PUSHING HARD TO KEEP GREENWOOD\nGetafe’s push to keep Mason Greenwood from returning to Manchester United this summer has been heavily backed by LaLiga president Javier Tebas.\nWinger Greenwood has already netted five LaLiga goals so far as part of his loan spell in Madrid after agreeing a switch from United back in September.\nThe England international is expected to return to Old Trafford at the end of the campaign, but his long-term future at Old Trafford is unclear.\nRivals Atletico Madrid and Barcelona are both rumoured to be monitoring the situation, with United open to a cut-price deal – if the terms are acceptable.\nGetafe club president Angel Torres believes Greenwood wants to return to Getafe for the 2024/25 campaign and Tebas has lent his support to a possible deal.\n“Greenwood was not condemned, so I don’t care. He’s a great player and is doing well at Getafe. I hope he continues to be successful and stays in Spanish football because that’s always good for us”, he said.\nThe latest indication from Getafe is that they will request a second loan agreement with United, as they cannot meet Greenwood’s increasing transfer valuation.\nIf United accept a loan renewal they are likely to demand a greater salary contribution from Getafe into 2025.\nRatcliffe open to Greenwood return\nHowever, recent reports suggest that Sir Jim Ratcliffe, who is now head of football operations at the club, is open to the idea of Greenwood being back in the United first-team mix for next season.\nCaughtOffside have also reported that Greenwood has no intention of prolonging his time in Spain. Instead, it is claimed that he wants to go back to United and try to reach his full potential at Old Trafford.\nThe 22-year-old is said to be excited by Ratcliffe’s project and feels he can become a vital part of United’s journey back to regular trophies.\nTo that end, much now depends on Ratcliffe’s actual stance and whether the Red Devils want Greenwood back full-time – although clubs in Spain are ready to jump at any hint that he could be available for a move again.\nDON’T MISS: Incredible Man Utd XI for 2024/25 as Ratcliffe rebuild takes full shape with several blockbuster incomings\nSEVILLA SET TO ABANDON CHASE FOR ARSENAL MAN\nSevilla director of football Victor Orta is slowly abandoning a plan to sign Jakub Kiwior from Arsenal this summer, with a deal becoming ‘increasingly complicated’. (La Colina de Nervión)\nBayern Munich are willing to pay up to 100m euros (£85.6m) to sign Portugal centre-back Antonio Silva from Benfica. (Sport)\nManchester United and Aston Villa have sent scouts to watch Torino’s Italian right-back Raoul Bellanova this season. (Tuttosport)\nAthletic Club forward Inaki Williams says he will try to keep his young brother Nico at the club for as long as possible amid interest from Premier League duo Arsenal and Chelsea. (ESPN)\nAC Milan and Juventus are interested in signing Morocco striker Youssef En-Nesyri when the former West Ham target enters the final year of his contract with Sevilla this summer. (Il Corriere dello Sport)\nAtletico Madrid are not ruling out summer exits for the likes of top stars Angel Correa and Memphis Depay. (Matteo Moretto)\nBarcelona are keen for Manchester City loanee João Cancelo to continue with them next season. (Mundo Deportivo)\nTOP BARCA STAR RULES OUT PROPOSED LIVERPOOL SWITCH\nBarcelona defender Andreas Christensen, who has been heavily linked with Liverpool, has no interest in leaving the club this summer. (TV2)\nReal Madrid have a ‘verbal agreement’ in place with Alphonso Davies to sign the Bayern Munich left-back. (ESPN)\nJuventus will offload Liverpool and Newcastle target Federico Chiesa during the summer if he does not sign a contract extension. (La Gazzetta dello Sport)\nRomelu Lukaku ‘will be sold’ this summer but only stay at Roma if they qualify for the Champions League this season. (Gazzetta dello Sport)\nBarcelona rejected two lucrative offers from Bayern Munich to sign defender Ronald Araujo in the January transfer window. (Mundo Deportivo)\nArsenal will look to sign a striker in the summer, with RB Leipzig’s Benjamin Sesko, Sporting CP’s Viktor Gyökeres and Brighton’s Evan Ferguson among the options. (Various)\nWinger Chris Führich’s contract, which will run until the summer of 2028, includes a release clause in the range of €20m-€25m depending on how successful Stuttgart’s season is. (Florian Plettenberg)\nItalian giants Roma are interested in appointing Richard Hughes, Bournemouth’s technical director, to a role at the club next season. (Various)",
  "word_count": 818,
  "scraped_at": "2026-02-14T01:56:44.614749",
  "_text_extracted": true
}