{
  "article_id": "0d24cf786817",
  "url": "https://www.myjoyonline.com/why-eritreans-want-isak-to-remain-at-newcastle/",
  "title": "Why Eritreans want Isak to remain at Newcastle",
  "date": "20250818T050000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nAlexander Isak has been central to Newcastle United's success since joining the club, but in one growing community in the city, his impact has stretched beyond the pitch.\nFor members of the Eritrean diaspora, seeing someone who shares their heritage succeed on football's biggest stage is profoundly inspiring.\nIn local parks and training grounds across the area, a quiet transformation is underway, with young Eritreans driven by the striker's story lacing up their boots with renewed ambition.\n\"I love football now because of Alexander,\" a 13-year-old boy of Eritrean origin told BBC Tigrinya. \"Seeing him play here makes me proud. He's like me.\"\nYacob Akale, a father of three, shared how one of his sons looks up to the striker, who represents Sweden but has Eritrean parents.\n\"Alexander has been a huge motivation to our children in Newcastle,\" he said.\n\"They now believe that with hard work, anything is possible. They see him as one of their own.\"\nYet the worries are that Isak, who has scored an impressive 62 goals in 109 outings since joining in August 2022, may have made his final appearance for the Magpies.\nThe 25-year-old was the subject of a bid from Premier League rivals Liverpool earlier this month and is training apart from the rest of the squad.\nBoss Eddie Howe has said \"everything is in play\" - but BBC Sport understands Isak is determined to leave the club.\nSpeculation halts optimism\nWhen Newcastle qualified for the Champions League in May, the joy among fans - including among Eritreans - was palpable.\nBut dreams of challenging for Europe's most coveted trophy now hang in the balance, even after Newcastle valued Isak at a staggering £150m ($201m) to ward off interest from reigning Premier League champions Liverpool.\nThe Reds turned to Eintracht Frankfurt to bring in Hugo Ekitike, yet the Anfield side does not seem to have given up on Isak.\nThey made a £110m ($147.5m) offer, which Newcastle rejected and have since bolstered their available funds by selling Darwin Nunez.\nLiverpool's interest could have been inspired by Isak's winning goal against them in last season's Carabao Cup final at Wembley, a strike that helped the Magpies win their first trophy in 70 years.\nYet in late July, on the same day he was left out of the squad for Newcastle's pre-season tour of Asia, he said he was looking to explore a move away from Tyneside.\nEritreans in the north east of England want him to stay.\nAn 'ambassador' for Eritrea\nWhile Isak was born in the Swedish capital, Stockholm, he has previously talked of his pride in his heritage.\n\"Even though I grew up in Sweden, there is a big Eritrean community. I was always around and raised in that type of environment,\" he said in an interview with Newcastle and Premier League legend Alan Shearer.\nIsak is the first player with links to the small nation in the Horn of Africa to shine in world football, and many Eritreans at home and abroad see him as an ambassador for their country.\n\"It is great to see someone with Alexander's status come here,\" Mehari Estifanos, a former Eritrean player and national youth team coach who now lives in Newcastle, told the BBC.\n\"People in this area had little knowledge of Eritrea, but after Alexander arrived, many people know where it is and [about] Eritrean culture.\"\nEstifanos says Isak has inspired youngsters in the diaspora to take up football, and some are already in academies in England and elsewhere in Europe.\nThat development is all the more important given the fact the game in Eritrea has deteriorated to such an extent that the world governing body Fifa dropped the national side from its rankings last year.\nIn recent years, headlines have only been made when players have absconded while on international duty.\nThe Eritreans living on Tyneside and in the surrounding areas feel it is their duty to support Isak, and the country's red, green and blue flag is a common sight when Newcastle are in action.\n\"Alexander is an Eritrean ambassador just like the famed cyclists Biniam Girmay and Daniel Teklehaimanot\" said Akale.\n\"All of us are proud of him. Even [on] his boots are one Swedish [flag] and the other Eritrean.\"\nDiscovering Eritrean culture\nWhile Isak's decisive role has improved Newcastle's fortunes on the pitch, it has also prompted supporters of the club to explore his heritage.\nBereket Kiflu co-owns a popular Eritrean-Ethiopian restaurant close to the club's St James' Park stadium, and business has been good - especially since Isak took a photo of it during the Carabao Cup trophy parade and posted it on social media.\nMany locals have visited to taste the exotic cuisines from the region, often based around a sourdough flatbread called enjera.\n\"I heard he (Isak) takes a lot of the players there,\" comedian and podcaster Anth Young told BBC Tigrinya.\n\"I have never had Eritrean food before but I'm going to go try.\n\"I have seen the Instagram posts. It looks amazing.\"\nSupporters are now desperate for Isak to remain with the Magpies and cement his status as a club legend.\n\"One day he will be up there in a statue like Bobby Robson and Alan Shearer,\" one local fan said.\nSupporters in Newcastle, and beyond, are now anxiously watching to see how the striker's future will be resolved.\nIsak's price tag might be too steep for most, but for Eritrean youth his value cannot be measured in pounds.\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n23 minutes -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n52 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n1 hour -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n1 hour -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n3 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n3 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n4 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n4 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n4 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 1138,
  "scraped_at": "2026-02-14T01:52:36.772996",
  "_text_extracted": true
}