{
  "article_id": "0d24d41188da",
  "url": "https://thenationonlineng.net/psg-offers-me-new-challenge-for-growth-says-ajibade/",
  "title": "PSG offers me new challenge for growth , says Ajibade - The Nation Newspaper",
  "date": "20250827T110000Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nAugust 27, 2025 by Tunde Liadi and Agency Reporter\nPSG offers me new challenge for growth, says Ajibade\nSuper Falcons’ captain Rasheedat Ajibade says her move to Paris Saint-Germain Féminines is more than just a transfer — it is a new chapter filled with growth, inspiration, and connection.\nThe 25-year-old forward, who signed a two-year contract with the French giants until 2027, described joining PSG as the perfect opportunity to evolve both as a footballer and as a person.\n“It’s a new challenge, especially when you come into this kind of prestigious club with amazing talent, amazing players, amazing people,” Ajibade told PSG TV. “I’ve got an opportunity to grow as a player and as a person. I believe this is the place for me to evolve, to learn, and to become the best version of myself.”\nAjibade arrives in Paris after a successful four-and-a-half-year spell with Atlético Madrid, where she scored 40 goals in 139 appearances, winning the Spanish Super Cup and Copa de la Reina.\nRead Also: 12 players who turned failed medicals into career comebacks\nFresh from captaining Nigeria to a record 10th Women’s Africa Cup of Nations (WAFCON) title in Morocco, where she was named tournament MVP, she believes PSG offers the perfect platform to take her career to new heights.\nShe said: “PSG is a very unique, great brand. It’s a team I’ve admired from a distance — from the men’s game to the women’s game. It’s a place where I’ve seen players evolve and do great things. Looking at the history, values, and mission of the club, I believe it’s one of the best places for young players to grow.”\nWith the move to Paris, Ajibade reunites with her Super Falcons teammate Jennifer Echegini and she explained the shared bond will help her settle quickly into her new surroundings.\n“We know ourselves very well from the national team. I even call her my sister. She’s an exceptional footballer and a wonderful person, so having her here will make my adaptation much easier,” she noted.\nThe former FC Robo forward also pointed to the lasting influence of former Super Eagles captain Austin ‘Jay-Jay’ Okocha, who once wore the PSG shirt and left a deep legacy in France.\nShe said: “PSG has a special mark in Nigeria because of Okocha and his tremendous skills.\n“For us, that connection is a big plus. PSG is part of our football family back home, and most Nigerian players, both boys and girls, dream of playing here one day.”\nAjibade’s arrival adds depth to PSG’s squad as they prepare for challenges in Division 1 Féminine and the UEFA Women’s Champions League. But for the Super Falcons’ captain, this move is much more than winning trophies.\n“It’s about becoming the best version of me,” she said.",
  "word_count": 466,
  "scraped_at": "2026-02-14T01:58:57.508797",
  "_text_extracted": true
}