{
  "article_id": "0d64b0f6daf1",
  "url": "https://www.bbc.co.uk/sport/football/68259000",
  "title": "Roony Bardghji : Copenhagen teenage sensation facing Manchester City",
  "date": "20240213T113000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For Roony Bardghji, the spotlight has been a constant companion.\nWhen Manchester City travel to FC Copenhagen for the first leg of their Champions League last-16 tie on Tuesday (20:00 GMT), the teenage right winger will be the major threat, especially after his winning goal against Manchester United in the group stage.\nLife has been hectic for the 18-year-old, known simply as Roony.\nBorn in Kuwait to Syrian parents, he moved to Sweden with his mother and brother at the age of six, later reuniting with his father. His footballing journey took him to various clubs, including Kallinge SK, Rodeby AIF, Malmo, and then in 2020, Copenhagen.\nBy the time that move was confirmed on his 15th birthday, a lot of people in Scandinavia were well aware of him. Since then, with 12 goals in 49 league games, he has justified why.\n'The height of his ceiling is himself'\nKeeping his feet on the ground was always crucial for Roony's progression, as the widespread attention gathered in his days as a youth player.\n\"He had a very humble approach to all the things he did, in his work ethic every day,\" Roony's under-19s coach at Malmo Jeffrey Aubynn, who now heads up their scouting network, tells BBC Sport.\n\"He showed on the field he had a big belief in his ability. That combination, with the many technical tools he has, stood out for me.\n\"He has increased his development all the time since leaving Malmo, playing in the Champions League. The height of his ceiling is defined by himself.\"\nRoony is used to playing at a higher level than his age would dictate. At Rodeby, a small club based a six-hour round trip from his house where he played between the ages of 10 and 13, it did not take him long to dominate on the pitch, but it was his desire to succeed that shone through.\n\"When Roony started training with us, he was a little chubby kid with a passion for football,\" his coach at the time, Fredrik Akesson, remembers.\n\"He was an easy-going guy, always polite with a smile on his face and quickly made friends in the team. He knew we were a team that trained more than others, especially on the right things. He also knew that we played more matches and tournaments than any other team in Sweden.\n\"Our team was one of the best in our age group. Whenever Roony got the ball, something extraordinary happened, be it a fantastic move, a stylish assist, or a great goal.\n\"You could put him in a team with guys four or five years older, and he made an impact. That's when you began to understand his potential to become really good. He decided numerous finals and crucial matches for us. There were lots of agents watching him when we played in larger tournaments in Sweden.\"\n'Whenever Roony got the ball, something extraordinary happened'\nIt was from there that he went to Malmo, one of Sweden's biggest clubs, but such was his burgeoning reputation across Scandinavia, it was not long until he was being courted again.\n\"We heard of him before he came, he was very dominant at Rodeby. He stood out in that environment,\" Aubynn adds. \"He is very versatile, good in between the lines, he can take players on one against one. He is direct in trying to find the goal and finishing possibilities.\n\"We wanted to keep him. We tried; we gave him a plan and showed him our thoughts for his journey in our club. Sometimes relationships end in football. He went to Copenhagen and I wish him the best.\"\nThe magnitude of signing Roony was not lost on anybody in Denmark. It was seen as a seminal moment for FC Copenhagen.\n\"When he was 14 or 15, many knew he was special,\" Danish journalist Nicklas Degn says. \"He was approached a lot from a very early age. It was seen as a marquee signing for FC Copenhagen in terms of publicity. It was seen as FC Copenhagen underlining themselves as the biggest club in Scandinavia.\n\"He is close to the total package for a player who plays on the right wing and can cover most offensive positions. Roony is the greatest talent in Scandinavia.\"\n'He will go to a great Premier League club'\nIn 2021, at the age of 16, he became Copenhagen's youngest ever player, scoring a week after his debut. His name has been linked with almost every top European club, and he could one day be destined for the Premier League.\n\"He has justified the hype and his potential is difficult to understate,\" Degn continues. \"He will go to a great Premier League club. He would suit a team that dominates the ball, like Manchester City, or Liverpool because he has very similar characteristics to Mohamed Salah.\n\"When Copenhagen have to come up with something brilliant or unlock a team, it is Roony they look to. He has this unique talent.\"\nCity will have to be on alert for a player who is not afraid to put them on the back foot with intelligent dribbling and movement.\n\"What stands out the most to me is his use of the body,\" Akesson says. \"He often deceives opponents with body movement before the ball reaches his feet, putting opponents in awkward situations.\n\"When he has the ball, he has an incredible ability to unbalance opponents, then dribble or fake past them. He uses his body when opponents try to tackle him, allowing him to gain speed out of situations on the field.\nBut most pertinently, Roony has not got ahead of himself. There are more levels to reach, as he looks to become a fully fledged Sweden international.\n\"Being humble is key. You see many cases where good talents come through early with success but can't keep their feet firmly on the ground and lose grip of the journey,\" Aubynn says. \"It is always a journey and it is about how good you are at taking the right steps.\"\nRoony's journey is just beginning, but he is showing he belongs on the very biggest stage.",
  "word_count": 1025,
  "scraped_at": "2026-02-14T01:51:19.063165",
  "_text_extracted": true
}