{
  "article_id": "0d7e8a6020bb",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-going-full-steam-ahead-man-utd-close-on-agreement-50m-rated-teenager",
  "title": "Ten Hag going  full steam ahead  as Man Utd close on agreement for £50m - rated teenager",
  "date": "20230227T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTen Hag going ‘full steam ahead’ as Man Utd close on agreement for sensational £50m-rated teenager\nManchester United are prioritising a new deal to tie down one of the club’s bright young prospects as manager Erik ten Hag goes all out to secure the future of one of the game’s most-promising teenagers.\nThe Red Devils are upwardly mobile under the Dutchman’s management, having won their first trophy in six years on Sunday. And that 2-0 Carabao Cup success against Newcastle United could be the first of up to four trophies they could land this season.\nAnd while they remain only third favourites to win the Premier League behind Manchester City and Arsenal, a place in the top four will bring Champions League football back to Old Trafford.\nThey could, however, also land the Europa League and FA Cup this season, with United now losing just once in their last 21 games. Indeed, as the form team in the Premier League right now, few sides would want to play them as it stands.\nYet this appears to be just the start for United, with plans in place to further strengthen their squad this summer. To that end, an Arsenal great has named the one thing they need, as well as naming three players to build around, in their quest for title glory next season.\nIndeed, Ten Hag is likely to prioritise quality over quantity this summer as he makes minor adjustments to his squad. To that end, a new big-name striker, a new midfielder and potentially a new defender will likely be targeted.\nHowever, the United manager may also allow up to six players to depart as he looks to clear out some of the squad’s deadwood.\nREAD MORE ~ Transfer Gossip: Man Utd pushing to sign ‘special player’ who Ten Hag knows is an upgrade on two stars\nTen Hag keen to secure new Alejandro Garnacho deal\nHowever, before any big-money transfer cheques are signed, Ten Hag wants to ensure one of the club’s bright young prospects is secured to a new deal.\nArgentina star Alejandro Garnacho is enjoying a brilliant breakthrough season at Old Trafford. Having featured in 26 games this season (nine of which are starts) the winger has three goals and four assists to his name.\nThe 18-year-old’s deal at Old Trafford is currently due to expire in summer 2024. And while United do hold a one-year option on that, they are keen to reward the youngster with a huge new deal as a reward for his progress.\nTalks over an extension have now been ongoing for some time. But with the likes of Real Madrid and Barcelona showing interest in the £50m-rated star, United are now stepping up those talks.\nIndeed, last week it was reported that an agreement was close to being finalised on a new five-year deal.\nNow transfer expert Dean Jones has told GiveMeSport that that agreement is on the cusp of being signed.\nAnd regardless of United’s ownership, he says Ten Hag is at the forefront of plans to sign him up for the long term.\n“Yeah I think ones like this, you can go full steam ahead on,” Jones said. “It would take a very strong willed owner to go against deals like this anyway.\n“There are football people within the hierarchy that are tasked with this as their job, and that’s not going to change once the takeover happens.”\nREAD MORE: Forget the Glazers, Ratcliffe or Qataris; Ten Hag is Man Utd’s most important factor\nAgreement will be great news for United\nTying down the teenager will be hugely-welcome news for United.\nThe winger has proved a handful for any full-back he has faced, underlining his qualities with superb strikes at Fulham and Leeds.\nAn excellent option both as a starter and off the bench, he has really made his mark under Ten Hag. As a result, it is easy to see why some of the world’s other biggest clubs are starting to take note.\nWitnessing his abilities for the first time back in November, Sky Sports commentator Don Goodman admits he was blown away by the teenager.\nSpeaking after his cameo in the 4-2 Carabao Cup win over Aston Villa, Goodman hailed his talents.\n“I see what all the fuss is about now. What an introduction he made. He looks sensational,” Goodman said.\nNow, with a new deal imminent, United will hope Garnacho can get even better and go on to become a hugely-successful component of Ten Hag’s side.",
  "word_count": 756,
  "scraped_at": "2026-02-14T01:55:49.883207",
  "_text_extracted": true
}