{
  "article_id": "0d94d2f6fbfb",
  "url": "https://theathletic.com/4072134/2023/01/12/emery-villa-stevenage-humiliation/",
  "title": "Unai Emery Aston Villa must brush aside Stevenage shock and fight for European spot",
  "date": "20230112T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s probably safe to say Unai Emery is the first manager to beat Barcelona, Juventus and Bayern Munich in 12 months… while also losing to Stevenage, who play in League Two, three tiers below his Aston Villa side.\nVilla’s humiliating late collapse at home on Sunday will go down as one of the great FA Cup third-round upsets and one of Villa’s most embarrassing results. Almost all of the players in Villa’s squad are individually worth more than Stevenage’s entire team.\nAdvertisement\nHowever, Emery shouldn’t receive too much blame for the defeat. Villa’s players were poor across the board in the match, with Leon Bailey and Philippe Coutinho wasteful in attack and Leander Dendoncker and Robin Olsen making defensive errors in the late meltdown.\nThe loss was all the more surprising as the Spaniard has made an impressive start to Premier League life at Villa, taking 10 points from a possible 15.\nThe Stevenage debacle will, therefore, sting for a long time and it begs the question of what on earth is the point of being Aston Villa — the seventh-most decorated team in English football and comfortably the most successful in the vast swathe of England between London and Manchester — if you are going to roll over in cup competitions and never really threaten the upper echelons of the Premier League?\nEmery is famous in world football as a serial cup winner, winning France’s two knockout competitions twice each with Paris Saint-Germain as well as the Europa League a record four times (three times with Sevilla and once with Villarreal).\nHe has also made a habit of beating the big boys of English football, overcoming Jurgen Klopp’s Liverpool in the 2016 Europa League final with Sevilla and, in Villarreal’s 2021 win, Arsenal and Manchester United.\nWhen he arrived at Villa he spoke of his desire to lift a trophy, which would make him an instant hero at a club that hasn’t won anything since the 1996 League Cup.\nGiven all of this, and with relegation looking unlikely, it would have been fair to assume Aston Villa would go deep in the FA Cup this season, which makes the Stevenage meltdown feel all the more galling.\nThe defeat means January 2016 will remain the last time Villa won an FA Cup game. Remi Garde was the manager, David Cameron was the prime minister of the United Kingdom and Barack Obama was the president of the United States.\nAdvertisement\nYou will have your own views on those politicians but Garde is a contender for the worst Villa manager of the modern era. That 2-0 win in an FA Cup third-round replay over Wycombe Wanderers was just one of three victories in 23 games under the Frenchman and he was sacked before Villa were relegated for the first time since 1987. The following year, Villa came 13th in the Championship, the club’s worst season since 1973-74.\nSo, despite embarrassment against Stevenage and the continuation of that dire FA Cup record, it must be remembered that Villa are a club transformed since those dark days seven years ago.\nA takeover in 2018 by American Wes Edens and Egyptian Nassef Sawiris pumped money into a club that had been cash-starved for years.\nVilla won the Championship play-off final at the end of the 2018-19 campaign under Dean Smith and the following season did well to avoid relegation from the Premier League.\nWhen they then stalled under Smith and later Steven Gerrard, the owners were ruthless in replacing them, and Emery seems to have been a good choice based on the evidence in the league so far.\nThe two billionaires are among the richest Premier League owners and Villa can now comfortably outspend most clubs outside England. This was evidenced by the club persuading Boubacar Kamara to swap Champions League football at Marseille for Villa Park, and securing Emery, who reached the Champions League semi-finals with Villareal last season. Furthermore, Villa have the eighth-highest wage bill in the Premier League.\nBut they have failed to back up their spending with results. Since returning to the top flight for the 2019-20 season, they have finished 17th, 11th and 14th. In that time, they have placed below clubs on far smaller budgets such as Brentford and Brighton & Hove Albion.\nAdvertisement\nUnder Emery, though, finishing in the European places seems possible. The Spanish boss beat Manchester United, Brighton and Tottenham Hotspur in three of his first four league games, with a spirited loss against Liverpool the only blemish.\nIt was confirmed on Tuesday that Villa have signed 29-year-old left-back Alex Moreno from Real Betis on a three-and-a-half-year contract for €15million (£13.3m; $16.1m) including add-ons.\nEmery also wants new attacking options in this transfer window and that makes a lot of sense. Emiliano Buendia, Danny Ings, Leon Bailey and Phillippe Coutinho were signed at great expense after the record sale of Jack Grealish, but all have struggled at times.\nTheir FA Cup defeat means Villa fans will have to make do with a hunt for a first top-half finish in the Premier League in 12 years to find meaning in their season. They have the players, the manager and the financial backing to achieve this.\nDo that, and nobody needs to mention Stevenage ever again.\n(Top photo: Marc Atkins/Getty Images)\nThe Athletic’s Spanish football coverage has expanded…\n- La Liga news, La Liga table; La Liga fixtures and results\n- Dermot Corrigan is joined by four new writers…\n- Real Madrid news from Mario Cortegana and Guillermo Rai\n- Barcelona news from Pol Ballús and Laia Cervelló Herrero",
  "word_count": 931,
  "scraped_at": "2026-02-14T02:16:35.983910",
  "_text_extracted": true
}