{
  "article_id": "0e0c6533180b",
  "url": "https://metro.co.uk/2026/01/02/arsenal-man-city-most-likely-sign-87m-brazil-star-26004718/",
  "title": "Arsenal and Man City  most likely  to sign £87m Brazil star",
  "date": "20260102T150000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal and Manchester City are reportedly the ‘most likely’ destinations for wantaway Real Madrid forward Rodrygo.\nRodrygo was one of the shining lights of Carlo Ancelotti’s all-conquering Madrid team that won La Liga, the Spanish Super Cup and the Champions League just 18 months ago.\nBut Rodrygo has suffered a dramatic fall from grace ever since, with the 24-year-old managing just one goal and one assist in 16 appearances under Xabi Alonso in the Spanish top flight this season.\nAccording to Spanish publication SPORT, Rodrygo and his father are determined to avoid a repeat of last summer, when the winger was denied a transfer despite a number of enquiries and negotiations with Premier League clubs.\nLong before the 2025/26 campaign got underway, Rodrygo had been exploring his options having been pushed to the periphery at the Bernabeu, forced to play a supporting role to the likes of Kylian Mbappe, Vinicius Junior and Jude Bellingham.\nThe report claims there is now ‘no going back’ for Rodrygo at Madrid and the Brazilian is ‘accelerating his departure’, with the decision to up sticks made some months ago.\nIf it were up to Rodrygo, a move away from the Spanish capital would be forced through this January – but this is deemed ‘unlikely’, even less so after Mbappe’s knee injury.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRodrygo is said to feel ‘under-appreciated ‘ by Alonso and the rest of Madrid’s hierarchy and believes ‘everything revolves around’ Mbappe.\nIt’s claimed Rodrygo’s ‘future points to England’, with Arsenal and Manchester City ‘positioned as the most likely destinations’, although Liverpool cannot be completely ruled out at this stage.\nAll three clubs were credited with a strong interest in Rodrygo last summer, only for the attacker to stay put and fight for his place at Madrid under new manager Alonso.\nThe report adds that a proposed move to Bayern Munich does not appeal to Rodrygo at this stage. PSG are the only other team – outside of the Premier League – who could feasibly cough up the required €100million (£87m).\nBizarrely, Rodrygo has been without an agent since 2022 – when he cut ties with Nick Arcuri and the Un1que Football agency – and he is keen to secure himself a representative as soon as possible to strengthen his position ahead of the summer transfer window.\nRodrygo’s current contract with Los Blancos runs through to June 2028.\nJust last month, Alonso said he was ‘waiting’ for Rodrygo and insisted the Brazil international had the ‘quality’ to turn his fortunes around.\n‘Trust him and wait,’ the Madrid head coach told reporters when asked about Rodrygo’s disappointing start to the season.\n‘This can change with a goal. He has quality.\n‘He’s played in some matches and not in others. Nobody doubts his quality and he has the right attitude.\n‘We’re waiting for him. He needs that good feeling after a good match.’\nSpeaking to Casino Guru earlier this season, ex-Arsenal and Brazil midfielder Gilberto Silva encouraged the Gunners to explore a possible move for his fellow countryman.\n‘I know him and we’ve met a couple of times, but I don’t know his situation with Arsenal,’ Gilberto said.\nMore Trending\nAt the beginning of the season, I thought it would be fantastic to have Rodrygo at the club.\n‘It is clear he will not have much of an opportunity to play under Xabi Alonso at Madrid, but he’s a great player with real talent, which is a waste if he is on the bench – but obviously there is big competition at Arsenal as well.\n‘He’s got the ability to perform not only from the left side but in other positions across the forward line as well.\n‘Should Arsenal go in for him? Why not. If he’s not happy and there is an opportunity to increase the strength of the squad, then we can try and get him.’\nWhat would be the better move for Rodrygo?\n-\nArsenal\n-\nManchester City\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Declan Rice and Riccardo Calafiori injury update ahead of Bournemouth vs Arsenal\nMORE: Regis Le Bris highlights Arsenal quality after Man City draw with Sunderland\nMORE: ‘Doesn’t look good’ – Pep Guardiola reveals injury blow as Man City lose ground on Arsenal",
  "word_count": 772,
  "scraped_at": "2026-02-14T01:49:57.600672",
  "_text_extracted": true
}