{
  "article_id": "0e2973ede9fc",
  "url": "https://www.90min.com/posts/jurgen-klopp-greatest-games-liverpool-manager",
  "title": "Jurgen Klopp greatest games as Liverpool manager",
  "date": "20240127T004500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jurgen Klopp's greatest games as Liverpool manager\n- Klopp will leave Liverpool as a modern legend at the end of the 2023/24 season\n- German manager has overseen some incredible games in charge of the Reds\n- Iconic moments have arrived in clashes with Man Utd, Tottenham and Chelsea\nJurgen Klopp is undisputedly one of Liverpool's greatest ever managers.\nThe German arrived at Anfield in 2015 and led a resurgence in the Reds' fortunes, building an exciting team that soon challenged for and won some of the biggest prizes in club football. His departure at the end of the 2023/24 season will leave a huge void on Merseyside, but his reign has been packed with incredible matches that fans will cherish forever.\nKlopp's Liverpool have won the Champions League and Premier League titles while posing the biggest threat to modern domestic giants Manchester City, with some landmark games proving pivotal to the former Borussia Dortmund boss' success with the club.\nHere are his best matches in charge of the Merseyside giants.\n1. Chelsea 1-3 Liverpool - 31 October 2015\nKlopp had some work to do on Liverpool's collective mindset when he replaced Brendan Rodgers in 2015. His first Premier League win came on Halloween and provided more than just a spook for Jose Mourinho, his counterpart in the Blues dugout.\nA spectacular Philippe Coutinho strike drew the Reds level after Ramires had put the hosts ahead and a deflected effort from the Brazilian and Christian Benteke's 83rd-minute finish ensured all three points for Klopp.\nMourinho would limp on until December when he was eventually given the boot.\n2. Norwich 4-5 Liverpool - 23 January 2016\nAsked about the scenes in Liverpool's dramatic win over Norwich in January 2016, Klopp replied: \"I don't know, I saw nothing.\n\"Usually I have a second pair, but I couldn't find them. It's really difficult looking for glasses without glasses.\"\nLaughable defending was on show from both sides as nine goals were scored at Carrow Road, but it was Adam Lallana's final effort in the 95th minute just after Sebastien Bassong had equalised that resulted in Klopp struggling with his eye-ware.\nIt was a sure sign of more chaotic fun to follow, though the late wins soon came in more high-profile clashes with trophies on the line.\n3. Liverpool 4-3 Borussia Dortmund - 14 April 2016\nIncredible comebacks in Europe would become a trademark of Klopp's reign at Anfield and his first came against former club Borussia Dortmund in the Europa League quarter-finals.\nThe Reds were 4-2 down on aggregate in the second half after goals from Henrikh Mkhitaryan, Pierre-Emerick Aubameyang, Divock Origi and Marco Reus, needing three second-half efforts to overhaul the deficit in their favour.\nCoutinho rammed one in from distance before Mamadou Sakho headed in. An unlikely hero then stepped up as Dejan Lovren planted James Milner's cross into the back of the net, sparking near delirium at Anfield and misery for BVB coach Thomas Tuchel.\n4. Liverpool 4-3 Manchester City - 14 January 2018\nLiverpool had secured Champions League football in Klopp's first full season at Anfield but they would soon start laying down the gauntlet for the Premier League title as Man City's biggest rivals.\nThe Reds were at their swashbuckling best, unsettling the then-unbeaten City as Alex Oxlade-Chamberlain fired them into the lead before a second-half blitz after Leroy Sane's equaliser.\nThe famed trio of Roberto Firmino, Sadio Mane and Mohamed Salah all netted inside ten minutes to put Liverpool 4-1 up.\nCity rallied towards as full-time approached with two late efforts from Bernardo Silva and Ilkay Gundogan, but it wasn't enough to prevent the hosts deservedly snaring all three points.\n5. Liverpool 4-0 Barcelona - 7 May 2019\nIf that Dortmund comeback signalled the start of something special for Klopp at Liverpool, the extraordinary remontada his side performed in the Champions League semi-finals against Barcelona was even stronger proof of his aura and genius.\n3-0 down from the first leg and missing stars like Salah and Firmino, Liverpool once again made life hell for the Barca stars visiting Merseyside. Origi's finish stoked belief in the home crowd before Georginio Wijnaldum came off the bench at half-time and grabbed a brace.\nTrent Alexander-Arnold famously took a quick corner to set up Origi for his second with more than ten minutes still to play. No response came from Lionel Messi or returning Reds Coutinho and Luis Suarez, confirming Liverpool's spot in Madrid's 2019 final.\n6. Tottenham Hotspur 0-2 Liverpool - 1 June 2019\nLiverpool had seemingly used up their season's allowance of drama in the build-up to the 2019 Champions League final after dispatching Barcelona and finishing second to Man City in the league title race.\nOpponents Tottenham gave the Reds a helping hand - quite literally - as Moussa Sissoko was penalised, allowing Salah to blast the Reds into an early lead from the penalty spot.\nSpurs pushed and probed but couldn't get past Brazilian wall Alisson before Origi rattle in a late second.\nThe 2-0 win sealed Liverpool's fifth top European title and Klopp's first trophy with the club.\n7. Manchester United 0-5 Liverpool - 24 October 2021\nClashes between Liverpool and Manchester United have been tight and fiercely contested in the Premier League era, but this encounter between the two English giants back in 2021 wasn't one such occasion.\nInstead, the Reds completely embarrassed Ole Gunnar Solskjaer's hapless Red Devils, charging into a 4-0 lead at half-time before grabbing a fifth in the 50th minute.\nIt was a day to remember for Salah, who bagged a hat-trick after Naby Keita and Diogo Jota had put Klopp's side ahead.\n8. Liverpool 0-0 Chelsea - 14 May 2022\nThis FA Cup final was a similarly turgid affair in comparison to the 2019 Champions League showpiece, with Liverpool and Chelsea slugging out over 120 goalless minutes.\nHaving already bested Chelsea in the Carabao Cup final in 2021/22, the Merseysiders repeated the trick as Kostas Tsimikas struck the winning penalty in the shootout.\nIt secured a first FA Cup in 16 years and kept Liverpool in the hunt for a quadruple, though they were pipped by Man City and Barcelona on the domestic and European fronts respectively.\n9. Liverpool 7-0 Manchester United - 5 March 2023\nBeating your most hated rivals 7-0 after they had been giving it large about winning the Carabao Cup for the entire week prior.\nJust brutal. I mean...7-0. Come on.\nSeven. Nil.",
  "word_count": 1076,
  "scraped_at": "2026-02-14T02:07:39.560569",
  "_text_extracted": true
}