{
  "article_id": "0e4c99535532",
  "url": "https://theathletic.com/4855322/2023/09/14/madueke-chelsea-isaksson-hurst-skills/",
  "title": "Chelsea Noni Madueke and the skills coach fine - tuning his technique",
  "date": "20230914T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Noni Madueke is one of those footballers who is prepared to work overtime to fulfil his ambitions.\nWhile some can be guilty of becoming complacent when the big money starts rolling in, the 21-year-old Chelsea attacker keeps putting in extra hours to improve. Take it from someone who knows him better than most — his personal football coach, Saul Isaksson-Hurst.\nAdvertisement\n“I have been working closely with Noni for the last two years,” Isaksson-Hurst tells The Athletic. “I have seen no change in Noni’s approach since the first session we did together. He is still very driven, still wants to get better. He understands that the best do more and he has to work really hard to do it.”\nMost football fans will assume the game’s top professionals playing at the highest level receive all the technical and tactical tuition they need from the clubs who pay their wages. Madueke is an example of a growing trend in the sport of individuals reaching out to qualified coaches who are not on their employers’ staff.\nIsaksson-Hurst boasts more than 20 years of experience in the game. He has a lengthy resume having been employed at the academies of Chelsea and Tottenham Hotspur. Most recently, he has been helping Arsenal’s junior set-up. Other clients include USMNT striker Folarin Balogun, who recently moved from Arsenal to Monaco of France’s Ligue 1, former Chelsea youngster Samuel Iling-Junior at Juventus, Brentford’s Rico Henry, Max Aarons of Bournemouth and Chelsea’s Omari Hutchinson (on loan at Ipswich Town of the Championship).\nIt has become customary to see players posting clips on their social media of themselves undertaking strenuous exercises, particularly during the summer break, to be ready for pre-season training. But the service Isaksson-Hurst provides is not focussed on fitness. He specialises in exercises designed to improve a player’s technique.\n“As one of my players said to me, just because you’re at a club, you don’t necessarily receive that individual attention,” Isaksson-Hurst explains. “A lot of players want to do extras — to do as much as they can. Not only can I do drills which replicate the game, but I work on outcomes that the particular player needs.\nAdvertisement\n“A lot of these young players understand the essence of marginal gains. They look after themselves and have their private chefs. Noni also has a personal physio who looks after him physically. I am there to support him. To work on those extras, the technical aspects, to push him and maybe get those little bits extra out of him. Even those big clubs, they’re not going to provide that one-on-one — the attention to detail — that is exactly what they need every week.”\nMadueke first reached out to Isaksson-Hurst in the summer of 2021, when he was beginning to make an impression at PSV Eindhoven. The then 19-year-old had joined PSV from Tottenham’s academy at age 16 and gone on to score seven goals in 28 appearances over two seasons in the Eredivisie, the Netherlands’ top division, but wanted to develop himself further.\n“The first summer, I watched a lot of his clips,” Isaksson-Hurst continues. “Noni is very similar to Arjen Robben in that he likes to cut inside onto his left foot from the right-hand side. That is one of his super-strengths. We talked about that and how doing that it also opens up the possibility of running down the outside — defenders are so conscious of his threat inside that it opens up the right channel.\n“We worked a lot on faking to go in on his left but go down the right as well. We used (and still use) mannequins as defenders. We work on angles of approach, speed of approach, timing of movements. Then working on those end products. For an attacking player, a lot of that is shooting in and around the box.\n“In the Johann Cruyff Shield (the Dutch equivalent of English football’s Community Shield), he scored one goal when he cut in on his left foot and the other (Madueke got two in that 4-0 win over Ajax in August 2021) was when he faked on his left and scored with his right. They were the exact two things we had worked on.\nAdvertisement\n“We talk about these one-v-one elements of the game. Some people think it is just something magical — that’s a misconception. You can break them down and work on them like anything else, to anticipate what is going to happen in the game. You then try and replicate them in your training environment and make sure that is what you do in the game as well.”\nThe results were so instant that the duo have worked closely ever since.\nWhen Madueke was living in the Netherlands, meet-ups were obviously more limited with Isaksson-Hurst based back home in England, although they were in touch on a regular basis. In the summer of 2022, Isaksson-Hurst was invited to join Madueke on his holiday in the Spanish resort of Marbella and they trained together for a week. They met up on Madueke’s vacation on the Greek island of Mykonos this year, too, with clips posted online of the player working up a sweat as he practised in the intense heat.\nView this post on Instagram\nSince Madueke joined Chelsea in January for €33million (£28.4m/$35.4m at current rates), the pair have been able to see each other much more. His schedule with the Premier League club is understandably always taken into account so he does not overdo things, but there is always scope for extra sessions — “It might be once every couple of weeks or once every two months,” says Isaksson-Hurst — or to provide feedback on performances.\nBoth men regard players such as Bukayo Saka and Riyad Mahrez, who have developed fine reputations for what they can do on the right wing, as examples to follow. Footage of what they do on the pitch is studied and implemented into drills as well.\n“It is important for him to be able to go both ways,” says Isaksson-Hurst. “If you look at Saka, probably the best right winger in the world, that’s one of his strengths — going left and right. Mahrez as well. You just have to keep working on these things.\n“It is important to understand who the best players in those positions are. Who is having lots of success? What are the things they are doing? We chat about all that, although Noni is his own man and can be a different player.\nView this post on Instagram\n“Noni is a mentality monster. He is so driven, sometimes you have to tell him to calm down. He is very aware, very astute, and knows the game is changing. He has always played on the right as a traditional No 7, but we have now been working on some technical elements to play more inside in the pockets. He understands the role is changing and you need to be more flexible in those areas — that is what it takes to play in the Premier League.\nAdvertisement\n“He wants to be one of the best players in the world. He wants to establish himself and play for England. That’s one of the reasons he came back to England and the Premier League. He has those aspirations and the quality to do that.”\nMadueke already has 14 caps for England Under-21s. He was part of the squad which won that age group’s European Championship in July and he started Monday’s 3-0 victory away to their Luxembourg counterparts in qualifying for the next Euros in 2025. As well as playing a key role in the first goal and assisting on the second, he showcased that ability to dribble both ways from the right flank, just as Isaksson-Hurst would want.\nThe challenge Madueke now faces is getting a regular place in the first XI at his club.\nThere have been obstacles overcome already.\nDespite making a good start to his Chelsea career, he was left out of the team because priority was given to those selected in the Champions League squad for that competition’s knockout phase.\nAfter the highs of winning silverware with his country over the summer, Madueke then picked up a hamstring injury that meant he did not play any minutes during pre-season under new head coach Mauricio Pochettino.\nHe has made three appearances in the 2023-24 season, and scored his first goal at Stamford Bridge in the Carabao Cup victory over fourth-tier AFC Wimbledon but competition for places is intense, particularly with Raheem Sterling showing good form in his favoured right-wing role and the club also spending an initial £40million this summer to sign Madueke’s England Under-21s team-mate Cole Palmer from Manchester City.\nSpeaking to The Athletic after that Wimbledon game, Madueke was unconcerned.\n“I missed pre-season completely, so it was not really an ideal start,” he said. “I have been giving my all in every session, doing extras where I can.\nAdvertisement\n“I am close with Raheem — that’s my boy — but I don’t think we play in the same position. Raheem is probably a left winger.\n“He (Pochettino) is a top manager, an elite coach. We have conversations and he just tells me to be disciplined and focused every day to try and reach my potential. That is what I am working on doing.”\nChelsea’s new boss was Tottenham head coach when Madueke was rising through the junior ranks there before that move to PSV. Now they both have a role to play in trying to make Chelsea a success.\nIsaksson-Hurst has no doubts it will happen.\n“Pochettino is ideal for Noni, but I think Noni is ideal for him,” he adds. “Pochettino likes young, proactive players who will just run all day and bust a gut. Noni is one of those people who will give everything in training and in matches.\n“It is a match made in football heaven.”\nGO DEEPER\nNoni Madueke: Quick, skilful, clever and Chelsea's perfect complement for Mudryk\n(Top photos: Getty Images)",
  "word_count": 1673,
  "scraped_at": "2026-02-14T02:00:57.134467",
  "_text_extracted": true
}