{
  "article_id": "0e4e67d7d5e7",
  "url": "https://metro.co.uk/2026/01/18/chelsea-agree-personal-terms-sign-56m-star-ahead-arsenal-26369497/",
  "title": "Chelsea agree personal terms to sign £56m star ahead of Arsenal",
  "date": "20260118T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have agreed personal terms with Jeremy Jacquet but will still need to improve their bid to sign the Rennes defender and Arsenal transfer target.\nNew Blues boss Liam Rosenior is keen to bolster his defensive options after replacing Enzo Maresca at Stamford Bridge earlier in the month.\nRosenior has made a mixed start to his reign at Chelsea, beating Charlton in the FA Cup and Brentford in the Premier League either side of a Carabao Cup semi-final first-leg defeat to Arsenal.\nWhile the former Strasbourg boss has repeatedly talked up the talent of his Chelsea squad, he is believed to be hoping to sign a new centre-back before the January transfer window shuts.\nEnzo Maresca was left disappointed by Chelsea’s decision not to sign a replacement for the injured Levi Colwill last summer and Rosenior is also keen to strengthen in that area of the pitch.\nChelsea first expressed interest in French centre-back Jacquet six months ago and have stepped up their transfer efforts since the January window opened.\nJacquet signed a contract extension at Ligue 1 side Rennes in May but did so with the agreement that he would be sold should a suitable offer arrive amid interest from Arsenal as well as Chelsea.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut it is the blue side of London that appear to be at the front of the queue to sign Jacquet, with Chelsea agreeing personal terms with the player, according to Fabrizio Romano.\nIt is claimed Jacquet is excited about the possibility of joining Chelsea but want a club record sale fee of around £56m to sanction his departure.\nChelsea have so far shown a reluctance to pay over £50m for Jacquet and hope Rennes backtrack on their transfer demand and sell him for cheaper.\nRennes could use Arsenal’s interest to pressurise Chelsea into paying more, with the Gunners known admirers of a player who has been tipped as a future France international.\nJacquet, 20, starred in France U19’s run to the Euro 2024 final and was subsequently named in the Team of the Tournament.\nBig-spending Chelsea are yet to make any January signings but often wait until nearer the deadline to work on deals.\nPrefer us to the others? Then tell Google!\nAs a loyal Metro reader, we want to make sure you never miss our stories when searching for your news. Whether it is the latest politics news explained, live football coverage or a showbiz scoop.\nClick here and tick Metro.co.uk to ensure you see stories from us first in Google Search.\nThey have cut short one loanee’s spell at Stamford Bridge, however, with Facundo Buonanotte heading back to parent club Brighton ahead of a summer move to Leeds United.\nMore Trending\n‘We thank Facundo for his efforts throughout his time at Chelsea and wish him well for the future,’ the Blues said in a statement.\nThe Blues have tasked Rosenior to get Chelsea back into the Champions League, with the club currently sixth in the Premier League, two points outside the top-four places.\nChelsea were far from at their best on Saturday but still managed to beat west London rivals Brentford 2-0 thanks to goals from Joao Pedro and Cole Palmer.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Tottenham make Thomas Frank decision before Champions League clash\nMORE: Manchester United make decision on Joshua Zirkzee deal, confirms Roma chief\nMORE: Mikel Arteta urged to drop ‘disappointing’ Arsenal star for Manchester United clash",
  "word_count": 640,
  "scraped_at": "2026-02-14T02:09:43.002769",
  "_text_extracted": true
}