{
  "article_id": "0e5706ee6deb",
  "url": "https://www.rnz.co.nz/news/sport/493801/pushing-forward-the-ferns-charged-with-scoring-goals-at-the-world-cup",
  "title": "Pushing forward : The Ferns charged with scoring goals at the World Cup",
  "date": "20230716T024500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The world's most travelled female footballer, an artist and a Lionel Messi fan will shortly have a chance to show what they can do at the country's biggest sports event. Here's part two of RNZ's Football Ferns profiles.\nThe pressure is on for the squad's midfield and strikers - create chances and score after a streak of 10 winless matches that has seen just two goals on the Ferns' side of the ledger.\nIt's a record this group don't need to be reminded of as they chase the dream of qualifying for the knock-out stage and beating one of their group opponents - it would be the first time either goal was realised at a world cup for any senior New Zealand side, male or female.\nMidfielders\nName: Annalie Longo\nDate of birth: 1 July 1991\nClub: Free agent\nPosition: Midfielder\nLongo was only 15 when she made her Ferns debut in 2006 - the youngest Kiwi to make a senior international team. Now the fifth most-capped woman player, she has been battling to recover from rupturing her anterior cruciate last September but the Ferns will be hoping to have her firing on all cylinders in their engine room come cup time. \"The ultimate dream was to go to a home World Cup and retire on what would have been a full circle moment,\" she said. She's also busy in a women's development role with NZ Football, fostering women's participation at all levels from playing to board level, is in the process of becoming a qualified coach and has tried her hand at TV commentary while injured although it's more nerve-wracking than playing, she says.\nName: Olivia Chance\nDate of birth: 5 October 1993\nClub: Celtic\nPosition: Midfielder\nChance is the world's most-travelled female footballer when it comes to international duty, clocking up more than 90,000 miles in the seven months to March, a study by FIFPRO shows. She's been a key figure during coach Jitka Klimková's tenure, a guaranteed starter on the left side of midfield. Chance said with limited professional chances on the home scene, her Celtic role in football-mad Scotland has been pivotal in sharpening her for international duty. \"Being able to play regularly and take that back is huge to New Zealand.\" She's close to Vic Esson but the friendship is put aside when Esson pulls on her Glasgow Rangers shirt. A knee injury has limited Chance's game time since April although she's confident of being fully fit for the World Cup.\nName: Betsy Hassett\nDate of birth: 4 August 1990\nClub: Wellington Phoenix\nPosition: Midfielder\nRegarded as a hardworking dedicated squad member, Hassett credits yoga with prolonging her career. \"It has helped my body so much,\" she said. \"I am still pretty flexible and I can run forever.\" While she still feels like \"one of the young ones\", she knows it's time to step up. \"It's a cool challenge to be a leader in our team and support others.\" Hassett has experienced setbacks - breaking her leg in a game on the eve of setting off for a college career in the US. She had to do all her rehab in an unfamiliar setting in the US. Soon after, her No 1 supporter, her mum, died. \"This World Cup she would've been there, so that's pretty sad for me that she won't be around for it. But I know she'll be there in spirit.\"\nName: Malia Steinmetz\nDate of birth: 18 January 1999\nClub: Western Sydney Wanderers\nPosition: Midfield\nSteinmetz came to football via athletics, where she excelled in sprints, high jump and long jump at her Auckland club. She's a fan of Argentina's World Cup-winning captain Lionel Messi while squad veteran Ali Longo has been a major influence. \"I had her as a mentor when I was 10 - I couldn't talk to her, I was in awe of her.\" Before a game she likes to listen to Van Morrison while avoiding sitting next to Liz Anton in the dressing room because \"she's a fretter\". Life outside football involves spending time with friends \"and sorting out all the local cheap food shops\".\nName: Ria Percival\nDate of birth: 7 December 1989\nClub: Tottenham Hotspur\nPosition: Midfielder\nJust over a year ago, the co-captain was told by a London surgeon her ruptured anterior cruciate ligament was the worst he had ever seen - and she might never play again. His skill and an intense rehab on her part have ensured the country's most capped player (161) is ready for game time at her fifth World Cup. \"Having the support of friends and family was massive. It got me through it and kept me thinking about the World Cup.\" Percival is the only Kiwi to have played in an FA Cup final at Wembley (for West Ham in 2019) and in a Champions League final (for Frankfurt in 2012). She believes if the Ferns can make history and make the cup's knockout stage, it will be a chance to inspire the next generation of girls.\nName: Daisy Cleverley\nDate of birth: 30 April 1997\nClub: HB Koge, Denmark\nPosition: Midfielder\nIdentified early as a special talent, Cleverley achieved national honours at just 14 and went on to play at the U17 and U20 World Cups and is now lining up for her third World Cup campaign. However, her career has been marred by several injuries. Player salaries is one of her hobby horses, speaking out publicly on how easy it is for women to be short-changed during contract negotiations. \"As sad as it is, in order to receive the equality that we deserve, you need to have men on board to create more momentum and investment,\" she told the NZ Herald.\nForwards\nName: Hannah Wilkinson\nDate of birth: 28 May 1992\nClub: Melbourne City\nPosition: Striker\nDespite taking up football as a child to keep pace with her brothers, \"I have been an artist longer than a footballer,\" Wilkinson said, with her talent leading to a commission to paint a mural at Eden Park. The artwork represents the three women's World Cups being played in New Zealand in two years. Wilkinson is also handy with a guitar, great for singalongs within the Ferns squad, she said. She's also been voted the squad's best singer. One of three in the squad to have more than 100 caps, she's the top goal-scorer in her club's history, however, she's feeling the pressure of failing to score for the national team this year. \"I've missed chances which typically I don't miss,\" she said.\nName: Grace Jale\nDate of birth: 10 April 1999\nClub: Canberra United\nPosition: Striker\nA recall to the Ferns last year after a four-year absence was daunting for Jale. \"When I first came in, I was a nervous wreck, in my little hermit crab shell.\" She's grateful to have friend Olivia Chance in the squad. \"She's in a similar position to me and she's like my guardian angel.\" Jale's ability to score goals attracted the interest of her Australian club but it's come at a cost - the Fijian-Kiwi misses Auckland's beaches so makes regular five-hour trips to Wollongong to enjoy the ocean in her down time. \"My favourite way to unwind is to take a walk along the beach.\" Once the girl who'd be in front of the TV watching football instead of doing homework, she is hoping to add to her career highlight - starting against the USA in front of family and friends in January. \"It was incredible.\"\nName: Millie Clegg\nDate of birth: 1 November 2005\nClub: Wellington Phoenix\nPosition: Striker\nIt's been a crazy year for the 17-year-old - as well as sitting final exams at school, she's been to two youth-age World Cups, moved from Auckland to Wellington to join her first professional club and is now the \"baby\" in the senior squad. She brings a much-needed ability to score goals which has already been on show at international level and in her debut club season. She's the daughter of a former New Zealand hockey captain and while her mum did her best to encourage Clegg in that direction she has stuck with football. As well as hoping for game time at the World Cup she may try for a college scholarship to the US.\nName: Jacqui Hand\nDate of birth: 19 February 1999\nClub: Aland United, Finland\nPosition: Striker\nHand had been playing football with the boys for six years by the time one of football's biggest stars came to New Zealand. \"I was one of the ball girls for that game. This was when David Beckham was in LA Galaxy, and I got to meet him. That was amazing.\" However, her idol was actually her older brother, Matthew, who earned a football scholarship to the USA. \"I remember from a young age wanting to grow up to be just like him.\" After four years with Colorado College, she's loving a change of scene on the Swedish-speaking Aland Islands and playing in the Finnish league even though away games involve an overnight ferry and travel that can stretch to a 50-hour round trip. She's used in a wide attacking role and looms as an aerial goal-scoring threat for the Ferns.\nName: Indiah-Paige Riley\nDate of birth: 20 April 2001\nClub: Brisbane Roar\nPosition: Forward\nRiley has represented Australia at age-group level but has now switched her allegiance. Auckland born, she moved across the Tasman with her family when she was 12 and it was regarded as a coup for NZ Football when they persuaded her to make the change. The chance to play in the World Cup in her home city was a major factor in her decision, she said. National coach Jitka Klimková admitted she only set the ball rolling after receiving a tip-off from a sports reporter. Riley has been held back by injury this year but when fit brings dribbling skills and the ability to move the ball out of tight spaces to the Ferns' game plans.\nName: Gabi Rennie\nDate of birth: 7 July 2001\nClub: Arizona State University\nPosition: Striker\nA team regular for two years, she's another who has been finding goals a hard ask in World Cup warmup matches. She's seeking the cutting edge that saw her score on her Ferns debut at the Tokyo Olympics and also be a standout when playing for the NZ U17s who finished third at the 2018 World Cup - the first New Zealand team, male or female, to ever make the final stages of a major FIFA tournament. \"That was like a crazy high, and coming down from that was pretty hard.\" She's interested in environmental conservation and concerned about human rights violations. She's studying the latter and biological sciences while playing football in Arizona. \"Learning about the significance of our natural environment and how to preserve it is something I love to learn about and spread awareness on,\" she said.\nName: Paige Satchell\nDate of birth: 13 April 1998\nClub: Wellington Phoenix\nPosition: Winger\nSatchell (Ngāpuhi) who won a national cross-country title at high school level displays blistering pace down the right flank for the Ferns - but not the finishing ability that is sorely needed. However, she's regularly featured in the side's warmup campaign for the World Cup. Early on in her club career, Satchell tore her ACL and was petrified it would slow her down permanently. \"But I rehabbed really well and I'm back to normal and I still have my skills and my pace.\" After playing at club level in Germany and Australia, Satchell signed on for the Phoenix believing playing at home would be the best build-up for the World Cup.\nRNZ with additional reporting by Newsroom's Locker Room.",
  "word_count": 1958,
  "scraped_at": "2026-02-14T02:00:36.700211",
  "_text_extracted": true
}