{
  "article_id": "0e5dc296f41d",
  "url": "https://bleacherreport.com/articles/10125483-frances-kylian-mbappe-feeling-better-after-injury-could-play-vs-netherlands",
  "title": "France Kylian Mbappé  Feeling Better  After Injury , Could Play vs . Netherlands",
  "date": "20240620T213000Z",
  "domain": "bleacherreport.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Featured Video\nLeBron's Historic Triple-Dub 👑\nFrance's Kylian Mbappé 'Feeling Better' After Injury, Could Play vs. Netherlands\nFrance national team coach Didier Deschamps has yet to rule out Kylian Mbappé for Friday's Euro 2024 match against the Netherlands.\nDeschamps told reporters the Real Madrid forward is \"feeling better.\"\n\"Everything is going well, after the shock we had,\" he said. \"He was able to take part is some light exercises yesterday and that will be the same this evening. We'll do all we can to ensure that he'll be available tomorrow.\"\nMbappé suffered a broken nose in the late stages of France's 1-0 win over Austria to open the tournament.\nIn terms of his availability for the remainder of the group stage, the prognosis didn't initially appear to be positive. ESPN's Julien Laurens reported he'd be out against the Dutch. French Football Federation president Philippe Diallo said Tuesday it was \"reassuring\" Mbappé wouldn't require immediate surgery but that \"it's a bit too early to give a timetable\" as to his return.\nShould France beat the Netherlands, there would then be little need to lean on its best player because Deschamps' side will have in all likelihood sewn up a place in the knockout stage.\nMbappé had 27 goals and seven assists in 29 Ligue 1 appearances for Paris Saint-Germain this season, and he was just as lethal in the Champions League (eight goals in 12 starts). Prior to Euro 2024 kicking off, he was among the favorites to win the Golden Boot as the tournament's top goalscorer.\nMbappé's broken nose will hurt his chances of collecting any individual honors. Beyond potentially taking him out of action, the 25-year-old will have to adjust to playing with a protective mask.\nFrance's bid to win a first European title since 2000 may not be adversely affected, though, as long as he's on the pitch when the knockout rounds get underway.",
  "word_count": 316,
  "scraped_at": "2026-02-14T02:10:54.421727",
  "_text_extracted": true
}