{
  "article_id": "0e5e0590aea5",
  "url": "https://www.aol.co.uk/news/battle-heart-chelsea-only-one-070300575.html",
  "title": "This is a battle for the heart of Chelsea – there can only be one winner",
  "date": "20240908T073000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This is a battle for the heart of Chelsea – there can only be one winner\nHaving sold, sacked or moved on many of the players, managers and employees who they inherited at Stamford Bridge – and even some they brought with them – it was inevitable that the game of survival at Chelsea would eventually reach the ownership.\nThe final battle for Chelsea will be between the two components of the consortium that runs the club, and the men who are its public face. Behdad Eghbali v Todd Boehly is not the collision modern Chelsea wanted but it was the one the club were always likely to have inflicted upon them. The two US investors, private equity and otherwise, who corral the vast amounts of investor money sunk into the club are at loggerheads. Now there can be only one winner.\nThis is a taste of consortium ownership in the current age: Premier League clubs too valuable to be bought by one individual or one institution, squabbled over by uneasy alliances. Perhaps Manchester United’s new ownership framework might be subject to the same turbulence at some point. As ever, these things are fragile and their success rests largely on the compatibility of the personalities of those involved.\nAfter the May 2022 takeover of Chelsea by the respective funds, it was Boehly who was quickly identified, in the public consciousness at least, as the key figure. He did little to dissuade anyone from that perception. He said a lot about how the Premier League might improve, including the modest proposal for an all-star game. He appointed himself as the sporting director for the first summer window. He delivered his post-match verdict to the players in person.\nYet inside the club it became clear that Eghbali, with 61.5 per cent under the control of Clearlake Capital, was the driving force. A Californian private equity investor with utter conviction in his own methods, it was Eghbali whose presence around the club was felt by those inside Chelsea to be that much stronger. By this summer, with the ownership’s second permanent managerial appointment, Mauricio Pochettino, departing after just a single season it was Eghbali who was in charge.\nNow, Boehly’s side want a team left in peace to run Chelsea. Eghbali’s preference is to maintain a day-to-day presence for much of the week around his executives. In private, it has been described as a clash of cultures. Nothing, the club insisted, can be done without the sign-off of Boehly, who is in concert with fellow investors Hansjorg Wyss and Mark Walter, all of whom have their own money in the club.\nThese are delicate matters. Investor confidence rests on a clear public position. The club have expended great effort in maintaining that outward-facing calm. Although in the end, it took just one Bloomberg report on Friday night to light the fuse and now Chelsea have a civil war alongside the battle to re-establish themselves as one of the big teams in European football.\nThe battle for the heart of Chelsea has begun\nEven for the private equity titans of the 21st century who seem to prefer a perpetual state of change and uncertainty, this feels like a lot.\nRunning the Chelsea of the post-Roman Abramovich years was always going to be a tough assignment for whoever won the auction. First of all was the £2.5 billion price and the obligation to invest a further £1.75 billion. Then there was the shockwave from the sanctions against the Russian, and the effect on a squad that lost two key players on free agency. There is the forever problem of Stamford Bridge’s unsuitability. There is a legacy of potential sanctions, as yet unresolved. Yet for all this, less than two years on, the club are in a crisis of the new ownership’s design.\nThey have already used the sale of the two Stamford Bridge hotels within the greater ownership group to comply with profitability and sustainability rules, as well as the sale of part of the women’s team. All but two of the high-profile first-team academy graduates have been sold. There is much staked on Champions League qualification. In that context, Eghbali v Boehly feels like a leadership challenge on the brink of an election.\nTheir position has long been that these new owners are habitually successful in investments. That they bring in management teams that make for more successful companies. They have indeed reduced the eye-watering wage bill at Chelsea, but there is yet to be any guarantee those who have been recruited will be able to compete with the very best in the league. As a portfolio of player investments it has merits. As a squad capable of taking on English football, only time will tell.\nAs for that expertise in assembling an executive team, there has been much activity. The departures and hires and, in some cases, departures of the hires are too numerous to list. Yet an example of the volatility came in the departure in the week of chief executive Chris Jurasek, who has worked for Clearlake in the past. His brief time in west London echoes that of Tom Glick, recruited from Manchester City as president of business. He lasted only 10 months.\nIn the wake of Jurasek’s departure, it has been announced that Chelsea will be run by a management committee comprised of chiefs of various flavours from different departments. At Cobham that has long been the case, with two sporting directors.\nWho is in charge? For a long time it has felt like Eghbali, with Boehly, bruised at the criticism, having retreated from the public eye. Yet in the world of the private equity bros, conflict must be eternal. Little more than two years on from their takeover comes the next battle for the heart of Chelsea. At some point one assumes all this will be resolved. But first it will take even more money, and another power struggle. This is already the most expensive sale of a football club in history.",
  "word_count": 1004,
  "scraped_at": "2026-02-14T01:49:08.095916",
  "_text_extracted": true
}