{
  "article_id": "0e5f791dc74d",
  "url": "https://www.kingfut.com/2023/02/28/adel-sundowns-not-intimidating/",
  "title": "Adel Abdel - Rahman : Mamelodi Sundowns are not intimidating",
  "date": "20230228T140000Z",
  "domain": "kingfut.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Al Ahly’s player Adel Abdel-Rahman spoke about the reasons for the Red Devils draw with Mamelodi Sundowns in the CAF Champions League.\nIn a four-goal thriller, Al-Ahly dropped two points against Mamelodi Sundowns following a 2-2 draw at Al Ahly-WE Stadium in the third round of the CAF Champions League group stage.\nAl Ahly currently set at third with one point from two games before facing Cameron’s Cotonsport next Saturday.\n“Sundowns are one of the best offensive African teams, but they are not so good defensively. It is a team that plays good football, but they are not intimidating,” Adel Abdel Rahman spoke to “etc” channel.\n“Al Ahly are going through a difficult period since returning from the FIFA Club World Cup. They had to go to Sudan to face Al-Hilal, before playing in Aswan, and finally confronting Mamelodi Sundowns. This definitely has its impact on the players.”\n“Al Ahly missed several opportunities against Sundowns, and the rhythm of the game had to be broken after the second goal by Hussein Al-Shahat, and it was a defining point in the outcome of the match. The South African team was motivated and attacked fiercely after the second goal,”\n“Every season during this time of the season, Al Ahly face these difficult circumstances due to the amount of matches they had to play. Starting from participation in the FIFA Club World Cup, it is usually followed by the CAF Champions League and the Egyptian Premier League league’s games. Koller is rotating his players but the team must learn from the mistakes that occurred in the past,”",
  "word_count": 265,
  "scraped_at": "2026-02-14T01:46:30.514005",
  "_text_extracted": true
}