{
  "article_id": "0e60e009f3bf",
  "url": "https://metro.co.uk/2025/10/22/pat-nevin-claims-chelsea-star-thought-finished-ajax-performance-24500229/",
  "title": "Pat Nevin claims Chelsea star thought he was  finished  before Ajax performance",
  "date": "20251022T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pat Nevin has claimed Tyrique George thought he was ‘finished’ at Chelsea before his fine Champions League performance against Ajax.\nThe 19-year-old came on at half-time for the Blues, replacing Marc Guiu, as the west London club secured a 5-1 victory over their Dutch opponents.\nGeorge scored just three minutes after his introduction, with the Chelsea academy graduate registering his first-ever goal in the Champions League.\nHe helped Chelsea make history, as Enzo Maresca’s side became the first team in the competition to have three teenagers score in a single match.\nFormer Chelsea star Nevin believes George thought he was ‘finished’ at the club prior to the win over Ajax, after the Blues signed Joao Pedro and Liam Delap in the summer transfer window.\n‘What a lovely moment for Tyrique George,’ Nevin, who now works as a football pundit, said on BBC Radio 5 Live.\n‘He thought he was getting real chances at Chelsea and they went and bought two strikers.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He thinks that’s him finished, and will be sent out. He comes on, scores a goal and looked really good in that position.\n‘Among the others, he looked really good and I am delighted for him.’\nGeorge nearly joined Fulham towards the end of the summer transfer window but the move collapsed.\nSpeaking to TNT Sports after the match, George said: ‘Really happy to win. We got so many goals and just had fun out there.\n‘I was itching to get on and score. That’s what I did so I am happy.\nIt’s an amazing feeling [to score my Champions League goal]. It’s what dreams are made of.’\nMaresca ‘very proud’ of Chelsea record breakers\nChelsea boss Maresca is ‘very proud’ at Chelsea becoming the first team in history to have three teenagers score in a Champions League match.\nMore Trending\nQuizzed about his side breaking the record, Maresca said: ‘[I am] very proud. It’s a special night for the club, for the young players.\n‘I think Guiu already scored for Chelsea five or six goals last year in the Conference [League]. Ty already scored also in the Premier League.\n‘Estevao, exactly the same. I think overall it was a great night, especially for these young players and for the club.’\nMORE: £27m Arsenal star hailed as ‘one of the best in the world’ after Atletico Madrid win\nMORE: Barcelona star Marcus Rashford sends message to Real Madrid ahead of El Clasico\nMORE: Ajax boss makes Chelsea claim after Champions League defeat",
  "word_count": 467,
  "scraped_at": "2026-02-14T01:59:14.386851",
  "_text_extracted": true
}