{
  "article_id": "0e6061802497",
  "url": "https://www.themag.co.uk/2023/09/eddie-howe-brighton-press-conference-very-positive-mood-as-looking-to-bounce-back-after-liverpool/",
  "title": "Eddie Howe Brighton Press Conference - Very positive mood as looking to bounce back after Liverpool",
  "date": "20230901T133000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe Brighton Press Conference – Very positive mood as looking to bounce back after Liverpool\nThe Eddie Howe Brighton press conference.\nThe Newcastle United Head Coach meeting the media on Friday morning.\nA huge match at the Amex Stadium on Saturday.\nEddie Howe in a vey positive frame of mind.\nThe Newcastle United Head Coach and his players determined to bounce back after that Liverpool disappointment.\nEddie Howe Brighton press conference:\n“I think they’re a very interesting team.\n“Roberto (De Zerbi) has done an amazing job. He’s a very unique coach in the way he gets his teams to play. Not many, or any, coaches I’ve seen like him and the style of play is very good.\n“They’re very ball-dominated and clever with how they set their teams up. He and his players deserve a lot of credit what what they’ve done and achieved last season. They’ve started this season well.\n“They’ve been brilliant for the Premier League. The way they’ve played the game, under Graham Potter and now under Roberto De Zerbi, has been a breath of fresh air.\n“They’ve done it a really certain style and a very good football team, very attack-minded who have surprised people.”\nEddie Howe on the injury situation:\n“Sven Botman has had an ankle scan and it doesn’t appear too good.\n“There is definitely an injury there but it presents okay.\n“It is very bruised and a little bit swollen but has been very lightly jogging this week.\n“We’re going to see how he is today and make a decision for this weekend.\n“Joelinton is another player that we’re going to make a late decision on.\n“He hasn’t trained this week.\n“Very similar to Sven, he’s done some light jogging and feels better with each day.\n“We’re going to make a late call.”\nEddie Howe on the Champions League draw:\n“It took me a few seconds to process it.\n“You’re looking at it and trying to fully understand because the draw was actually quite complex and I didn’t realise it was that complicated to figure out what was going on.\n“When the dust settles down, you’ll look at it with pure excitement.\n“There’s no negativity from any of us internally towards the draw.\n“It’s hard and challenging but I think there’s some great European games for us to experience and great places to visit for our supporters.\n“The travel distance isn’t too bad, either, and I think when you add it all together, it’s been a great thing.\n“My attitude to these things is we’ll get who we get.\n“There’s no preconceived idea in my mind of what I’m looking for so very relaxed.\n“It was the same for the Carabao Cup draw although we couldn’t have got a harder draw.”\nEddie Howe on approaching the Champions League challenge:\n“The mentality for us, no matter who we play, has to be an attitude of no fear or doubt and let’s embrace everything it is going to bring. It will challenge us hugely.\n“Those teams have played in Europe for many, many years and they have excelled.\n“There’s no doubts about the size of the challenge but bring it on.\n“That has to be how we feel and that’s what I encourage my players to think. I think it’s exciting.\n“I think it brings it home that there’s a lot of talk about the Champions League but we didn’t know who we were playing, what group we were in and there’s a lot of unknowns.\n“Now, we have a target and games in mind which then starts to bring you to visualise it which can only be a healthy thing.”\nEddie Howe on Newcastle United drawn at home to Manchester City in the League Cup:\n“The start of the fixture list was very difficult in the Premier League and we’ve been tested, playing the top teams.\n“I always think that makes you better, playing against the elite teams, which brings your own game on, so hopefully it’s a good thing for us at the start of the season.\n“You always have to find the positive in every situation while being very firmly realistic.\n“You can’t control the cup draws and if they are difficult, on paper, the reality is they’re likely to be difficult.\n“We have to respond, improve and be competitive to find ways to win. That’s the job we’re in.\n“I fully believe that we can do that and I’ve got no doubts if we’re at our best.\n“That is the challenge for us to find our fully best levels.”\nEddie Howe on the summer transfer window which closes at 11pm tonight:\n“I think the transfer window’s been very slow initially.\n“During the summer months, there wasn’t a lot of action.\n“It’s definitely quickened up as we’ve gone closer to the deadline.\n“It seems like a lot of late action, with clubs then willing to trade.\n“For us, it’s been the kind of window where we’ve been able to get the targets in that we’ve wanted.\n“We’ve been quite settled and there’ll be no late moves for us.\n“I think you can only tell the strength of a window in time but as I sit here now, I’m pleased.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 882,
  "scraped_at": "2026-02-14T01:56:26.893231",
  "_text_extracted": true
}