{
  "article_id": "0e865cff68b1",
  "url": "https://www.nytimes.com/athletic/6869916/2025/12/08/salah-liverpool-slot-arsenal-title/",
  "title": "The Briefing : Shades of Ronaldo in Salah outburst ? Is Premier League a three - horse race ? ",
  "date": "20251208T081500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to The Briefing, where every Monday during this season, The Athletic will discuss three of the biggest questions to arise from the weekend’s football.\nThis was the weekend when Mohamed Salah plunged his Liverpool future into huge doubt by airing his frustrations with manager Arne Slot, Arsenal’s Premier League title hopes were hit when they fell to a last-gasp defeat at Villa Park, and Manchester City moved within two points of the top of the table.\nAdvertisement\nHere we will ask where the blame lies for Salah’s outburst, if it is now a three-horse race for the Premier League title and whether Manchester City manager Pep Guardiola was right to respond to Rayan Cherki’s outrageous assist against Sunderland by telling him to keep things simple.\nAre there shades of Ronaldo in Salah’s outburst?\nThroughout the troubles of the past couple of months, the one thing in Liverpool’s favour is that any tensions and grievances have been kept in-house. A sense of crisis has been undeniable, given their results, but it has not been compounded by the type of leaks, finger-pointing and power plays that usually accompany such a dramatic downturn in results at a club of that size.\nMohamed Salah’s explosive interview on his way out of Elland Road on Saturday has changed all of that.\nBy accusing the club of “throwing me under the bus” and saying he no longer has a relationship with manager Arne Slot, the 33-year-old has turned an on-pitch crisis into something approaching civil war.\nSome will argue that Slot was asking for trouble by leaving a player of Salah’s stature out of the starting line-up for three successive matches — and keeping him on the bench throughout the 2-0 win at West Ham United and then Saturday’s 3-3 draw at Leeds United. This has not looked like squad rotation or a series of horses-for-courses selections; this has looked like a firm, decisive move away from a player who has scored 250 goals for Liverpool and established himself as one of the club’s all-time greats.\nSalah’s performance level has undoubtedly dropped this season, but he is hardly alone in that respect — and there have been worse performers, in defence and midfield as well as attack, who have kept being picked regardless of form. That is not to say that Salah’s performances have merited indulgence, but the forward is entitled to ask questions when he has gone from playing almost every minute of every game (which at times looked excessive) to barely getting a look-in at a time when the intense fixture list suggests that the workload should be shared around.\nAdvertisement\nBut his actions on Saturday, taking the uncharacteristic step of seeking out journalists in the post-match mixed zone and airing his frustrations so publicly, showed an alarming lack of self-awareness as well as a lack of respect for his team-mates, his manager and the club.\nSome of the points Salah made were legitimate, if a little unhelpful from a diplomatic perspective. But that line where he said, “I don’t have to go every day fighting for my position because I earned it”? That is what I believe the kids call a “self-own”. It made the case against him far more persuasively than anything anyone else, particularly Slot, has said in recent weeks. Rather than make it hard to leave him out, Salah has made it difficult for the manager to restore him to the starting line-up for tomorrow’s crucial Champions League clash away to Inter.\nNobody who knows anything about Salah would question his motivation or his professionalism, but that comment hinted a sense of entitlement, a belief that his past achievements merited indulgence of a type that you just don’t get when you are 33 years old and struggling for form and confidence in a team that is drastically underperforming, where the manager is thrashing around in search of a winning formula or at least some way to arrest the slump.\nThere are more than faint echoes of the way Cristiano Ronaldo was marginalised in his miserable final months as a Manchester United player in 2022. There are differences too — Ronaldo instigated that situation by demanding a transfer and then took umbrage when then-manager Erik ten Hag left him out of the starting line-up — but the sense of indignation, of a star player unwilling and unable to comprehend that his status within the squad might have been downgraded, is similar.\nWith Salah, as with Ronaldo, it has often felt that this tunnel vision and unwavering self-belief are crucial parts of what has made him such a wonderful player. But those traits become harder to live with when set alongside diminishing returns on the pitch. Both are regarded as consummate professionals, totally dedicated to their craft, but neither is the type you could imagine reacting well to being left out of the starting line-up, as has been illustrated.\nAdvertisement\nThis was always the danger when Liverpool extended Salah’s contract for another two years in the summer he celebrated his 33rd birthday. Few would have predicted the extent of his struggles this season — much less the team’s — but there was always the possibility that, when the time came to evolve towards a post-Salah future, it was going to be uncomfortable for all concerned.\nSalah suggests there is another agenda here: that his sudden fall from favour is because “someone doesn’t want me in the club”. Again, there are echoes of the Ronaldo situation here. That saga ended with a star player making a wildly lucrative transfer to Saudi Arabia in the January transfer window (in his case, having mutually agreed the termination of his contract at United five weeks earlier). It remains to be seen how the Salah affair will resolve itself, particularly given that he will leave next week to join up with the Egypt squad for the Africa Cup of Nations.\nIn the circumstances, Slot might come to appreciate a break from having to deal with an unhappy Salah.\nBut what neither he nor anyone else at Liverpool will appreciate is the way that such a traumatic campaign — one in which, it bears repeating, they have had to deal with the grief that followed the tragic loss of the talented and extremely popular Diogo Jota — has now been given the unwelcome soap-opera element of a spat between manager and star player.\nForget any talk of who might win or lose from this. When a manager and star player are at war, there are never any winners.\nIs the Premier League now a three-horse race?\nIn the space of two weeks, Arsenal’s lead at the top of the table has been trimmed from six points to just two. City are now within striking distance — as are Villa, who, after a wretched start to the campaign, have now won nine of their last 10 Premier League games.\nVilla’s victory over Arsenal on Saturday told us a lot about Unai Emery’s team. What it told us about the leaders is harder to judge.\nOn the one hand, it was Arsenal’s first defeat in 12 Premier League matches and marked the end of an 18-game unbeaten run in all competitions since they lost at Liverpool on the final day of August. On the other hand, it was the third consecutive away game that has ended in disappointment: conceding a stoppage-time equaliser at Sunderland, failing to make a one-man advantage count in a 1-1 draw at Chelsea and now a loss at Villa.\nAdvertisement\nInevitably, there will be talk about mentality — or, more specifically, about fragility because that is the default narrative with Arsenal, as if people are conditioned to regard this team just as they did late 2000s and early/mid-2010s Arsenal, the one that frequently went into battle with a series of weak links in key positions through the spine of the team. This team, built around the likes of Gabriel and Declan Rice, is made of much stronger stuff.\nBut Gabriel has been out since suffering a thigh injury on international duty with Brazil last month. William Saliba has missed the last three games with an injury Arteta describes as “bizarre”. One of their deputies, Cristhian Mosquera, is out until mid-January with an ankle injury. At Villa, they lined up with Jurrien Timber, their first-choice right-back, in central defence alongside Piero Hincapie, their summer loan signing from Bayer Leverkusen — and, while those two applied themselves well against a strong Villa team, the gaps in Arsenal’s defence were ultimately exploited.\nIt is doubtful whether there is another club in world football with Arsenal’s depth in defensive positions, but they are inevitably weaker without Gabriel and Saliba. Gabriel’s absence is also felt when it comes to their attacking threat from set pieces. The immediate question is not about Arsenal’s mentality but about whether they can avoid suffering further damage before their first-choice central-defensive partnership is reunited.\nAs for the other challengers, Villa have not always played as well in recent months as their run of results suggests, but those stirring back-to-back victories over Brighton and Arsenal in the space of four days hint at the kind of belief and momentum that Chelsea and others have yet to illustrate.\nCity don’t look anything like as strong or as consistent as they were when beating Arsenal to the Premier League title in 2023 and 2024, but they are still capable of racking up wins. It is up to Arsenal to set a standard that others cannot match.\nWas Guardiola right to tell Cherki to keep it simple?\nFor most of us watching, Rayan Cherki’s improvised assist for Manchester City’s goal against Sunderland on Saturday was a thing of beauty: a rabona cross that picked out Phil Foden so perfectly that the goalscorer could hardly disguise his delight at the audacity of it.\nPep Guardiola was not so impressed. When he said he had never seen Lionel Messi play a cross like that, it was not a compliment. It was a reminder of the need to “do the simple things well”. The best players, Guardiola suggested, do not feel the need to bring out their party pieces. “If it doesn’t work,” he said, “then there are problems.”\nGuardiola’s demand for simplicity is one that just about every coach would echo. The difficulty with applying that principle to Cherki is that, to a player of such bewitching talents, a rabona cross comes more naturally than the simple pass.\nAdvertisement\nMost of the time, a player producing a cross like that will do so because he does not trust his weaker foot. But Cherki would back himself to pull off that trick every time — and probably with either foot. As sensible as Guardiola’s advice is, it is hard to tell Cherki to keep it simple when the player clearly finds that part of the game so easy.\nComing up…\n- With no European commitments to excuse them, Manchester United have been chosen for the Premier League’s Monday night slot again, this time travelling to bottom-of-the-table Wolves. Milan are in the same boat in Serie A, with no European football this season, but, unlike United, they are taking advantage of it. A trip to Torino will test their Scudetto credentials.\n- The Champions League dominates the agenda on Tuesday and Wednesday, with some big matches for heavyweights who have left themselves with little margin for error in the league phase. If Liverpool suffer a third league-phase defeat away to Inter on Tuesday evening, Slot will have bigger concerns than the Salah situation. Barcelona, who have also lost two of their first five games, could do with a victory over Eintracht Frankfurt. Real Madrid vs Manchester City on Wednesday should be fun, even if the suspicion remains that both will make the top eight and proceed straight to the round of 16.\n- There are some excellent match-ups in the Women’s Champions League too: Real Madrid vs Wolfsburg on Tuesday and Manchester United vs Lyon on Wednesday, with all four teams hoping to book a quarter-final place without having to face the play-offs.\n- There are some appetising EFL games this week: Championship leaders Coventry City, beaten 3-0 by Ipswich Town on Saturday, visit Preston North End on Tuesday. Fourth-placed Ipswich are at home to sixth-placed Stoke on Wednesday. Also on Tuesday evening, it’s third against first in League One, where Stevenage are at home to Cardiff.\n- The Europa League and Conference League take over on Thursday. I might need a night away from the TV by then.",
  "word_count": 2096,
  "scraped_at": "2026-02-14T02:03:26.517514",
  "_text_extracted": true
}