{
  "article_id": "0ea051c40e2e",
  "url": "https://www.namibian.com.na/bayern-sign-england-captain-kane-on-four-year-contract/",
  "title": "Bayern sign England captain Kane on four - year contract",
  "date": "20230812T131500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England captain Harry Kane ended his record-breaking career with Tottenham on Saturday signing a four-year deal with Bayern Munich until 2027.\nKane said he “felt it was time to leave” the Premier League club he had spent two decades with as he chases trophies with the Bundesliga giants.\n“I felt like it was the time to leave. I didn’t want to go into the season with a lot of unresolved future talk,” Kane posted on social media.\n“Obviously a lot of emotions going through me right now; sad to be leaving the club I’ve spent nearly 20 years of my life at, from 11-year-old boy to a 30-year-old man now.\n“There’s been so many great moments and special memories, memories that I will cherish forever.”\nAfter protracted negotiations between Bayern and Spurs’ chairman Daniel Levy a deal was finally struck on Thursday.\nKane flew to Munich on Friday evening to complete the traditional medical where he was greeted by a multitude of Bayern fans before putting pen to paper on his new contract.\nSix-time European champions Bayern were in desperate need of a striker after struggling to replace Robert Lewandowski who left for Barcelona last season.\nThe reported fee for Kane is a Bundesliga record 100 million euros ($110 million, £86 million) plus 10 million euros in bonuses.\nKane, who was out of contract next summer, leaves Tottenham having scored 280 goals in 435 games to become the club’s all-time leading goalscorer, but without a trophy.\n“I’m very happy to be a part of FC Bayern now,” Kane said in a club statement.\n“Bayern is one of the biggest clubs in the world, and I’ve always said that I want to compete and prove myself at the highest level during my career. This club is defined by its winning mentality — it feels very good to be here.”\nKane is also England’s all-time top goalscorer with 58 international goals. He finished top scorer at the 2018 World Cup where England reached the semi-finals.\nAt the 2022 tournament in Qatar, they were defeated by France in the quarter-finals, Kane first scoring and then missing a penalty with England 2-1 down and six minutes left on the clock.\nKane also featured in his country’s run to the European Championship final in 2021 where they lost to Italy in a penalty shoot-out.\n‘Fresh challenge’\nSilverware is all but guaranteed at Bayern, who have won 11 straight Bundesliga titles.\nThe club won the Bundesliga in each of Lewandowski’s eight seasons in Munich, with the Pole averaging 30 goals per season. In 2022-23, not one Bayern player hit the 15 league goal mark.\nKane has scored more than 20 league goals in all but three of the past nine Premier League seasons, winning the Golden Boot on three occasions.\nDespite finishing second in last season’s Premier League scoring charts behind Erling Haaland (36), Kane netted 30 league goals in 2022-23, equalling his best mark.\nBayern were eliminated by eventual winners Manchester City in the quarter-finals of the Champions League last season and only won the Bundesliga title on goal difference thanks to a final-day capitulation from Borussia Dortmund.\nKane had been linked with a move away from his boyhood club two years ago but Manchester City failed in their pursuit.\nSpurs chairman Levy said the club had “reluctantly agreed to the transfer”.\n“We sought over a long period of time to engage Harry and his representatives in several forms of contract extension, both short and long term,” Levy said.\n“Harry was clear, however, that he wanted a fresh challenge and would not be signing a new contract this summer. We have reluctantly, therefore, agreed to his transfer.\n“We have seen a product of our academy system become one of the best players to ever pull on a Spurs shirt and become one of world football’s elite strikers. It has been a truly remarkable journey.”\nKane could start the next chapter in his career later on Saturday, with the German Super Cup scheduled for the Allianz Arena against RB Leipzig.\n“I hope to play part of it,” Kane told Bayern’s website.\n“I spoke briefly to the coach, but I will meet him this (Saturday) morning with the team and I will try to fit in as soon as possible.”\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 817,
  "scraped_at": "2026-02-14T02:07:08.851798",
  "_text_extracted": true
}