{
  "article_id": "0eae0018977c",
  "url": "https://www.yahoo.com/news/arsenal-banish-pepe-porto-dark-073000917.html",
  "title": "Arsenal banish Pepe and Porto dark arts to pass toughest challenge yet",
  "date": "20240313T081500Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal banish Pepe and Porto’s dark arts to pass toughest challenge yet\nYou would hardly have guessed, on this evidence, that Pepe was the first outfield player over 40 to compete in the Champions League. As captain of this artful, scheming, sometimes plain dastardly Porto side, he had no compunction about embodying their worst traits, contriving ever more nefarious ways to stop a football match from breaking out.\nArsenal had little idea how to deal with a man who, fresh from being booked for a dive of which Tom Daley would have been proud, simply laughed it off.\nWhat you had to marvel at, more than anything, was Pepe’s endurance. Here was somebody whose opposite number at centre-half, William Saliba, was barely half his age. And yet deep into extra time, he was still running through his entire repertoire, haranguing the referee, reacting histrionically to minimal contact, contesting every one-on-one as if it were his last.\nIt can be easy sometimes to caricature Pepe as the emblem of anti-football. But against opponents who had scored 33 Premier League goals since the turn of the year, he proved how grimly effective the art of disruption could be.\nAll that Arsenal fans could do, by way of response, was to generate some hostility of their own, expressing their disdain for Pepe’s antics in the shrillest terms. When it came to the decisive shoot-out, the Emirates veritably seethed with rage towards Porto, as the crowd bombarded every penalty-taker with derision.\nAs the stadium erupted at the sight of David Raya parrying Galeno’s effort away to his left, it was instructive to study Pepe’s reaction. Rather than howling with indignation, he simply applauded, conscious that he had thrown every trick in his armoury at Arsenal and that they had still discovered a way to win.\nThis felt like a night when Mikel Arteta’s young side, mesmerising domestically but still unproven in the knockout stages in Europe, developed a few valuable street-fighting skills. Bukayo Saka was given a fair idea of the type of evening it would be when, within the first three minutes, Wendell scythed him down with a tackle that looked agricultural at first, but turned out to be perfectly-timed.\nSetting the tone early 😬\nWendell puts a crunching challenge in on Bukayo Saka in the opening moments of the game!#UCL pic.twitter.com/nLUFsNAVdz— Football on TNT Sports (@footballontnt) March 12, 2024\nPorto were hell-bent on neutralising Arsenal’s elegant movement with some meanness. For 120 minutes, the plan, marshalled by Pepe, was executed to perfection.\nThere are two distinct prisms through which to view Pepe. The first is to recall the Real Madrid malcontent who resorted far too often to casual thuggery, once kicking Javi Casquero with such unadulterated spite that he received a 10-game ban.\nBut then it becomes impossible to ignore his sheer weight of accolades: the three Champions League triumphs in four years, the European Championship glory with Portugal in 2016, when he won the man-of-the-match award in the final. It was this body of work that he called on to frustrate Arsenal during this compelling, precarious, sometimes downright ill-tempered duel.\nHis interventions were often crucial. When, in the first half, Ben White’s tantalising cross drifted over goalkeeper Diogo Costa, Pepe hared back into the perfect position, positioning himself on the line to head the ball wide, all while injuring himself in a collision with the post. Just as he has been unafraid of inflicting harm on his opponents – ask Lionel Messi, a victim of his savagery in many a ‘Clasico’ – he has seldom been too interested in self-preservation either.\nIt was thanks to Pepe, too, that Arsenal did not wrap up this victory long before penalties loomed. Making a customary nuisance of himself, he drew the foul from Kai Havertz, deemed to have tugged his shirt before Martin Odegaard’s strike rippled the net. The body language, screaming as if he had just been violently assaulted, was a classic of the Pepe canon.\nTaken at face value, these shenanigans can quickly grow tiresome. But given that Pepe is a month beyond his 41st birthday, he must be accorded a certain degree of grudging admiration. It is anything but standard protocol for a player in his fifth decade still to be featuring at the sharp end of the Champions League, never mind driving his team through every minute of battle without any visible signs of fading.\nMore in Sports\nThe oldest non-goalkeeper before him was Alessandro Costacurta of AC Milan, who, at 39, lasted 45 minutes of an instantly forgotten 2006 group-stage defeat by AEK Athens.\nPepe’s contribution would live longer in the memory. Against Arteta’s starlets, he offered, for all his off-putting faults, a stirring rebuke to the notion of club football’s greatest competition being no country for old men.",
  "word_count": 800,
  "scraped_at": "2026-02-14T02:10:47.915753",
  "_text_extracted": true
}