{
  "article_id": "0eb6a5729250",
  "url": "https://metro.co.uk/2025/02/19/lamine-yamal-picks-dream-summer-signing-barcelona-22585677/",
  "title": "Lamine Yamal picks out his dream summer signing for Barcelona",
  "date": "20250219T101500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lamine Yamal has named Bayern Munich forward Jamal Musiala as his dream signing for Barcelona in the summer transfer window.\nThe 17-year-old Barcelona winger has enjoyed an extraordinary level of success since making his debut for the Catalan giants in August 2023, aged just 15.\nIn that time, Yamal has established himself as a key player for both club and country, playing an instrumental role last season as Barca finished runners-up in La Liga before inspiring Spain to Euro 2024 glory.\nThe teenage sensation has picked up where he left off this term, racking up five goals and ten assists in his opening 21 league appearances, with Barca sitting level on points with bitter rivals Real Madrid at the top of the table.\nNeedless to say, Yamal is widely regarded as one of the most exciting young players in world football and the La Masia academy graduate has already been likened to some of the greats of the game since his breakthrough, from Neymar to Lionel Messi.\nHis meteoric rise to the top in recent years, meanwhile, has been compared to that experienced by Musiala, with the pair often pitted against each other as potential Ballon d’Or winners of the future.\nBut it appears Yamal has nothing but admiration for the Germany international and would love to see him donning the colours of Barcelona if he had his way.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAsked to name three players outside of Barcelona who inspire him the most, Yamal told Spanish newspaper Mundo Deportivo: ‘Musiala, Neymar, Savinho.’\nPressed on which of the trio he would most like to sign for Barca, the youngster laughed and responded: ‘You want me to say Neymar… but no.\n‘Musiala, who has a contract [at Bayern Munich].’\nMusiala last week put an end to speculation over his future by signing a new long-term contract with Bayern Munich, tying him to the club until 2030.\nThe 21-year-old has scored 58 goals in 195 appearances for Bayern to help the Bundesliga giants win four league titles, three German Super Cups, the UEFA Super Cup and the FIFA Club World Cup.\nMore Trending\nYamal’s current deal at the Camp Nou, meanwhile, is due to expire in 18 months’ time and talks over a renewal have been put to one side, with the attacker fully ‘focused’ on enjoying a successful end to the campaign.\n‘My situation will be resolved in July,’ he added.\n‘But right now I am focused on La Liga, the Champions League and the Copa del Rey, that is the most important thing,\n‘I don’t think anyone doubts what I am like as a Barca player and how much I love this club.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd cult hero names toughest Premier League opponent who ‘drove him insane’\nMORE: Newcastle set new price for Arsenal and Chelsea to sign Alexander Isak",
  "word_count": 543,
  "scraped_at": "2026-02-14T01:58:05.343616",
  "_text_extracted": true
}