{
  "article_id": "0ebd2ea6f9eb",
  "url": "https://punchng.com/behold-falcons-paris-olympics-18-woman-army/",
  "title": "Behold , Falcons Paris Olympics 18 - woman army",
  "date": "20240704T003000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahead of the Paris 2024 Olympics, Super Falcons head coach, Randy Waldrum, unveiled his 28-woman squad, including star players Asisat Oshoala, Rasheedat Ajibade and Chiamaka Nnadozie, while veteran stars Francisca Ordega and Onome Evi were dropped in controversial circumstances. PUNCH Sports Extra’s ABIODUN ADEWALE and PETER AKINBO x-ray the mix of seasoned and promising talents in Waldrum’s roster as Nigeria aims to make a strong return to the women’s football event for the first time since 2008\nGOALKEEPERS\nChiamaka Nnadozie (Paris FC, France)\nUnarguably Nigeria’s best female player in the 2023/24 season, Nnadozie also enters the Paris 2024 train as the best goalkeeper in Africa as well as in France – where the Olympics will be held – having won two awards at the end of last season. Her credentials of saving seven penalties – the most by any goalkeeper in Europe – during the just-concluded season earned her the best goalkeeper award in the French D1 Arkema in April before being named again as the best keeper in the French women’s topflight by the National Union of Professional Footballers in May. She featured in 20 games for her team as they finished third in the playoffs.\nTochukwu Oluehi (Shualat Alsharqia, Saudi)\nFormer Sunshine Queens and Rivers Angels keeper Oluehi has been a steady presence for Shualat Alsharqia in Saudi Arabia. Known for her shot-stopping ability and command of the area, Oluehi will compete for the starting spot with top choice Nnadozie and provides crucial experience between the posts. She is also famous for her penalty heroics, which won Nigeria the 2018 WAFCON title, the last time the team won a tournament.\nDEFENDERS\nOsinachi Ohale (Pachuca, Mexico)\nDespite being one of the oldest players in the squad, 32-year-old Ohale will be playing her first women’s football Olympics tournament, no thanks to the Falcons’ inability to qualify for the event since their last appearance in 2008. She remains a dependable figure at the back and will hope to inspire confidence in the Falcons team like she did at the 2023 Women’s World Cup in Australia and New Zealand where she scored her only senior international goal in Nigeria’s 3-2 win against co-hosts Australia. Her performance at the World Cup earned her a move to Mexico, where she made 31 appearances for Pachuca.\nOluwatosin Demehin (Reims, France)\nLike every other player who has gone from the youth ranks to the Falcons, Demehin has made rapid progress with the national team after captaining the Falconets at the women’s U-20 World Cup in 2022. The Olympics is her second major tournament after the 2023 World Cup. She played all the team’s matches in Australia and New Zealand and hopes to continue her formidable partnership with the experienced Ohale. At club level, the 22-year-old was hampered by injury last season, limiting her to only 11 league appearances with one goal and one assist as Reims finished fourth in the playoffs.\nMichelle Alozie (Houston Dash, USA)\nAfter making her Falcons bow by fate against Jamaica during the team’s US Summer Series in 2021, Alozie has established herself as a mainstay in the team and will be playing her fourth tournament for the Falcons in Paris. She’s featured at the 2022 WAFCON, the Aisha Buhari Cup and the 2023 World Cup. She was one of the star players in Australia and New Zealand, although she missed a penalty in the shootout, which led to Nigeria’s ouster in the round of 16 against England. The 27-year-old Houston Dash defender has made 14 league appearances this season for her club and provided one assist.\nNicole Payne (Portland Thorns, USA)\nAgain, Nicole will be ticking another box with her sister Toni as they both make the train to Paris. Currently playing for Portland Thorns in the National Women’s Soccer League, the 23-year-old also made her Falcons debut for Nigeria during the US Summer Series in 2021 and offers another option for Waldum in defence. At club level, she has been consistent for Thorns in the NWSL this season, making nine appearances.\nChidinma Okeke (Mynavi Sendai Ladies, Japan)\nFormer FC Robo star Okeke makes a stunning comeback to the Falcons for the Olympics. The 23-year-old was named in the 2019 World Cup squad but didn’t feature for the team and hasn’t been in the fold since then until the qualifiers. She recently made a move from Madrid CW to Mynavi Sendai Ladies, Japan after failing to lock down a place in Spain.\nMIDFIELDERS\nDeborah Abiodun (University of Pittsburgh, USA)\nKante, as Abiodun is nicknamed, will hope to continue her impressive run for the Falcons after playing a crucial part during the qualifiers. The 20-year-old will also be appearing at her second major tournament for Nigeria. This time, she is primed to lockdown her place in the midfield after she was limited to just one game at the 2023 World Cup, no thanks to a red card she picked up on her debut against Canada.\nHalimatu Ayinde (Rosengard, Sweden)\nHaving won two WAFCON titles (2016 and 2018) and also featured at three World Cups, Ayinde continues to live up to the billing, with her first appearance at the Olympics on the horizon. At club level, the 29-year-old is in superb form for Rosengard as they top the Swedish women’s league with 42 points. Ayinde has played 12 of 14 games this season, making one assist.\nChristy Ucheibe (Benfica, Portugal)\nSince Ucheibe’s debut in 2022, she has been consistent for the Falcons and is expectedly on the train for her first Olympics. The 23-year-old was one of the best players at the 2023 World Cup, where she was rated as the fourth-best tackler. Ucheibe, a serial winner with current Portuguese champions Benfica (four titles), will hope to inspire the Falcons to the podium in France.\nJennifer Echegini (Juventus Ladies, Italy)\nBorn in The Netherlands to Nigerian parents and raised in London, Echegini brings her dynamic play and international experience to the squad. The 23-year-old is also in super form from last season, where she hit the ground running at her new club Juventus by winning the eBay MVP award for the best U-23 player in the women’s Serie A. In 14 games, she scored 10 goals, including a hat-trick, in their 4-0 win over Fiorentina in April. She also had one assist.\nToni Payne (Sevilla FC, Spain)\nAnother midfield dynamo from the 2023 World Cup, Payne returns to the Falcons for the Olympics assignment on the back of a successful six-year spell at Sevilla, where she scored 31 goals in 170 appearances. She made her debut for Nigeria in 2021 and has played at the WAFCON as well. The Olympics presents another chance for players like Payne, who came into the team after 2018 – when the team last won a title – to pick up a piece of silverware.\nFORWARDS\nRasheedat Ajibade (Atletico Madrid, Spain)\nAjibade has been in stellar form for Atletico Madrid, where she was recently named the club’s Player of The Season. She scored 10 goals and provided eight assists during the 2023/24 season, including a decisive goal that secured a UEFA Women’s Champions League spot for Atletico. The 24-year-old’s leadership and attacking prowess will be crucial for Nigeria in Paris.\nEsther Okoronkwo (Changchun, China)\nOkoronkwo has been a consistent performer for Changchun FC in China. Known for her speed and finishing, she has become an integral part of her club’s attacking lineup. Okoronkwo scored the sole goal in the Falcons’ 1-0 win over Cameroon during the qualifiers for the Olympics. The 27-year-old will aim to replicate her club form on the international stage as she seeks to make a significant impact at the Olympics.\nAsisat Oshoala (Bay FC, USA)\nEx-Barcelona striker Oshoala, now with Bay FC in the US, continues to be a standout performer. Her experience and goal-scoring ability have made her one of the most feared attackers in women’s football. Oshoala brings a wealth of experience and a proven track record of performing in major tournaments. The six-time Women’s African Player of The Year is expected to lead the team in any role coach Waldrum plays her while she hopes to add to her 32-goal tally for the Falcons.\nUchenna Kanu (Racing Louisville, USA)\nKanu has been impressive at Racing Louisville with her ability to create and convert chances. Her agility and skill in front of goal makes her a key player to watch. The 27-year-old has scored four goals in 10 appearances for her club and her form will be vital for the Falcons as they hope to navigate through the group stages of the Olympics.\nChiwendu Ihezuo (Pachuca, Mexico)\nIhezuo has had a solid season with Pachuca Club in Mexico, where she has been a reliable goal scorer with the 27-year-old finding the back of the net on 15 occasions for her club in just 21 appearances. Her physicality and presence in the box add a different dimension to Nigeria’s attack, making her a valuable asset for coach Waldrum.\nChinonyerem Macleans (Lokomotiv Moscow, Russia)\nOne of the surprise inclusions by coach Randy Waldrum, Macleans brings her different playing style from Lokomotiv Moscow to the national team. The 24-year-old’s ability to hold up play and her clinical finishing will be essential for Nigeria’s campaign. Macleans’ versatility across the attacking third allows her to adapt to different roles.\nALTERNATE PLAYERS\nJumoke Alani (Nasarawa Amazons)\nAlani has been making waves with Nasarawa Amazons in the Nigeria Women’s Football League. Known for her defensive prowess and strong tackling, Alani has been a key player in the team’s defence. Her inclusion as an alternate player gives the Falcons a solid backup option in defence. Alani’s physicality and ability to read the game make her a valuable asset, ready to step in if needed.\nIfeoma Onumonu (Utah Royals, USA)\nOnumonu 30, finds herself in the alternate list after just recovering from injury but she brings her experience from the NWSL, where she has been a consistent performer for the Utah Royals. Her versatility allows her to play both as a central forward and on the wings, providing coach Waldrum with multiple tactical options.\nGift Monday (Tenerife, Spain)\nMonday has been a rising star at Tenerife. Known for her speed, dribbling skills and finishing, Monday has quickly made a name for herself in Spain with six goals and one assist in her first full season in the 2023/24 campaign. Her ability to take on defenders and create scoring opportunities makes her an exciting prospect for the future. As an alternate player, Monday provides depth to Nigeria’s attacking options and could be a game-changer if given the opportunity.\nMorufa Ademola (Rivers Angels)\nAdemola is the goalkeeping option on the alternates list.\nThe Rivers Angels shit stopper, who was awarded the best goalkeeper award in the Nigeria Women’s Football League in the 2023/24 Super 6 in Yenagoa, Bayelsa State, was instrumental as the ‘Jewels of Rivers’ secured a second-place finish in the league and their Federation Cup win.\nCOACH\nRandy Waldrum\nSince taking over the Falcons job in 2020, American coach Waldrum was under scrutiny from the media over the performance of the team. But all that changed in 2023 after the Women’s World Cup, when the Falcons dazzled their way to the round of 16 with some scintillating displays. His contract was renewed afterwards, and he ticked his next assignment by qualifying for the Olympics – the first time since 2008. Having not won any title with the team, The Paris Games is also Waldrum’s chance for silverware.",
  "word_count": 1916,
  "scraped_at": "2026-02-14T02:01:23.798870",
  "_text_extracted": true
}