{
  "article_id": "0edff8cd52a8",
  "url": "https://www.westmeathexaminer.ie/2024/12/10/mohamed-salahs-penalty-moves-liverpool-closer-to-champions-league-last-eight/",
  "title": "Mohamed Salah penalty moves Liverpool closer to Champions League last eight",
  "date": "20241211T003000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mohamed Salah’s penalty moves Liverpool closer to Champions League last eight\nBy Carl Markham, PA\nMohamed Salah’s enduring consistency extended the Champions League’s only 100 per cent record to six matches as his penalty secured Liverpool a 1-0 victory in Girona to virtually guarantee the leaders a place in the last eight.\nThe Egypt international became the 11th man to reach 50 Champions League goals, overtaking Zlatan Ibrahimovic and Kylian Mbappe with Thierry Henry (51) and Thomas Muller (54) now in his sights.\nHaving missed from the spot a fortnight ago against Real Madrid, there was no mistake this time when presented with the opportunity in the 63rd minute to extend an impressive record of scoring in 11 of his last 16 matches.\nAnd while the chatter and conjecture over the summer expiration of his contract – reports last week suggest he has at least now been offered a new deal – it is not affecting the 32-year-old’s output.\nIt was his 16th goal of the season, his 47th for the Reds in European club football’s premier competition, and Liverpool’s 50th. He also equalled Steven Gerrard’s club record of six Champions League penalties and is now just one goal behind Billy Liddell, fourth on the club’s all-time goalscoring list.\nSalah benefited from a VAR intervention after it spotted Luis Diaz’s left boot had been removed by former Manchester United midfielder Donny van de Beek’s ambitious attempt to nick the ball in the penalty area.\nBut it was not only Salah’s reliability which Liverpool were indebted to as goalkeeper Alisson Becker, making his first appearance in two months after a hamstring injury, helped extended their run without conceding in this competition to just short of nine hours.\nIn his absence Caoimhin Kelleher had kept five clean sheets in 11 matches, including against Real Madrid and Manchester City, but once the Brazil international was fit again head coach Arne Slot did not hesitate to bring him back.\nAt his pre-match press conference Slot had said “For so many years Alisson has been so outstanding for this club and we are expecting him to do the same over the next few months” and the 32-year-old backed up those words.\nHe was employed more than he would have hoped to have been in a first half during which the visitors allowed a strong start to slip and should have been behind at the break.\nJoe Gomez came as close as he has at any time in the last decade to scoring his first goal for the club when his early near-post header was tipped over by former Tottenham and Fulham goalkeeper Paulo Gazzaniga from Liverpool’s first corner.\nDarwin Nunez, who has only one goal in his last 10 appearances, was twice denied by Gazzaniga but the Uruguay international had another of those now all-too-common frustrating performances with his fluffed header from Dominik Szoboszlai’s hanging cross meaning the supporting Curtis Jones and Salah were unable to profit.\nBut the hosts were undeterred and would have been ahead had it not been for Alisson and Daley Blind’s lack of composure in front of goal.\nThe ex-Manchester United, Ajax and Bayern Munich defender’s last goal was 11 months ago and that looked evident from his swish-and-miss at Miguel Gutierrez’s cross into the six-yard area.\nAlisson saved Alejandro Frances’ follow-up attempt, batted away a Gutierrez shot, flung himself to his right to keep out Yaser Asprilla’s long-range drive and, straight from the second-half kick-off, denied Arnaut Danjuma.\nAndy Robertson forced the first save from Gazzaniga just before the hour but Diaz had already been fouled by Van de Beek, although not spotted by referee Benoit Bastien.\nTrent Alexander-Arnold’s late dipping free-kick fully extended Gazzaniga as Liverpool closed out a professional, if unspectacular, victory against the European debutants.",
  "word_count": 629,
  "scraped_at": "2026-02-14T02:26:24.517328",
  "_text_extracted": true
}