{
  "article_id": "0f0d50a3820a",
  "url": "https://thepeoplesperson.com/2025/11/27/mason-greenwood-jamaica-players-turn-on-ex-man-united-forward-301581/",
  "title": "Mason Greenwood : Jamaica players turn on ex - Man United forward - Man United News And Transfer News",
  "date": "20251127T220000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mason Greenwood is facing fresh controversy after members of the Jamaica national team reacted negatively to the prospect of the former Manchester United forward representing the Reggae Boyz, according to reports.\nLegal Troubles\nGreenwood, 24, is currently playing for Olympique de Marseille after joining the French side in the summer of 2024, having faced serious legal issues in the United Kingdom.\nIn January 2022, United suspended the academy graduate after he was arrested on suspicion of suspicion of rape and assault. He was then charged in October of the same year with attempted rape, assault occasioning actual bodily harm, and controlling and coercive behaviour.\nBut the Crown Prosecution Service announced in February 2023 they were discontinuing the case, revealing there was “no longer a realistic prospect of conviction” due to the withdrawal of key witnesses and the discovery of new evidence. Greenwood has always denied the allegations.\nUnited then attempted to reintegrate him in the summer of 2023 , but immediately reversed their decision after a wave of public outrage, inside and outside of football. Instead, it was hastily agreed, Greenwood would spend the season on loan at Getafe in LaLiga – a chance to rebuild his career away from the spotlight of Old Trafford.\nAround this time, Greenwood began an application for citizenship at the Jamaican embassy in London, The Athletic reveals.\nThe versatile forward, who has one cap for the Three Lions, impressed in Madrid for his adopted side, winning the club’s Player of the Season award. But controversy travelled with him as opposition players and fans alike objected to his presence in Spain.\nAt the end of the loan, it was clear that English football was still unwilling to accept his return – and a permanent exit was pursued by United, with Marseille quickly emerging as a frontrunner.\nA £26.7 million deal was struck with the Ligue 1 giant, which included a significant sell-on clause should he be sold in the future. And Greenwood’s superb form since arriving at the Orange Vélodrome certainly suggests this is likely to bear fruit for the Red Devils.\nMason Greenwood Stats: 2025/26 Season\nRejected at international level\nGreenwood is thought to harbour hopes of playing for England again, despite this application for Jamaican citizenship.\nThis is not a realistic prospect, however, with manager Thomas Tuchel stating the Marseille marksman is “not in our thoughts” and the English FA fully aware “the backlash bringing him into camp would spark,” The Athletic states.\nBut this not a concern for the Jamaican Football Federation (JFF), the report reveals, with the belief that Greenwood has been “cleared by the courts and should be free to continue his career.”\nIn September, Greenwood rejected a call-up to play for Jamaica in the final stage of the World Cup qualifying campaign, owing, in part, to this desire to represent the Three Lions again. But there will come another, more crucial, chance to don the Reggae Boyz shirt next year.\nJamaica’s only remaining route to qualify for the tournament in North America is the intercontinental play-offs in March, where they face New Caledonia – a team of “part-timers” according to The Athletic – and, if victorious, the DR Congo, a side 14 places higher in FIFA’s rankings.\nJFF President Michael Ricketts retains hope Greenwood will opt to play for Jamaica in these defining matches. “I would think so. Because, at the onset, he seemed to have been excited at getting his documentation sorted out,” Ricketts said.\nThis positivity at the executive level over Greenwood does not translate into the Jamaican dressing room however, with “more than one player in the squad” believing his inclusion would be “contentious” due to nature of the allegations.\nBut there is also objection on a footballing level, with a sense amongst some that the Englishman would be “arriving for the good times, having missed the tougher moments.”\nIsaac Hayden, Jamaica’s 30-year-old midfielder currently playing for Queens Park Rangers, confirms to The Athletic this split between the team and their federation.\n“I’ve only played for Jamaica for a year, and there was some resistance to me when I started, but I have played 12 games and everyone can see my passion and the way I play the game. I give everything on the pitch, and I wanted to be there to help Jamaica progress to the World Cup.\n“[The JFF] are obsessed with names and trying to recruit more players. They want to have the best team on the pitch, but I said it to the[m]: ‘If a player is not willing to commit for the last round of qualifying, unless they’re injured, I do not see why they should be joining the group in March or at the end of the season if we qualify’. There is no way that should be allowed to happen.\n“I’ve had discussions with the lads who have played for Jamaica for years. Some might end up playing eight games to qualify for the World Cup but get left out for players who come in when the job is done. I don’t think it would sit well with me or any of the other players. It’s not something I would want to be a part of.”\nSpecifically on the idea of Greenwood playing in March, Hayden acknowledges the forward’s quality – but his stance remains unwavering.\n“The quality of the player, his numbers, what he is producing, is of the highest level, but it comes down to principle and integrity. If players can just rock up because of a World Cup, it would make the whole thing a farce. That would say a lot about the player, and the organisation for allowing that to happen.\n“My recommendation to the JFF was that any new player who wants to come in beyond the recent September window can do so for 2026 (after the World Cup play-offs and possible World Cup campaign), when it is a whole new cycle.”\nJamaican and Charlton Athletic left-back Amari’i Bell mirrors his international teammate, saying Greenwood’s inclusion would be “controversial”.\n“Many of us for years have put our blood, sweat and tears into playing for the nation, with a lot of things happening in the background. We’ve had to deal with all that. It wouldn’t seem fair to people who have been through that whole process and will never get another chance to play at a World Cup. It’s a bit controversial.”\nAnd this is before the moral argument is factored in, owing to the allegations Greenwood previously faced in England.\nThe word ‘controversy’ will almost certainly follow the 24-year-old for the remainder of his career and beyond, at both club and international level, no matter how many goals he scores. But it may not be enough to deny him a place on the Jamaican plane to the World Cup next year if the JFF gets their way, regardless of what his fellow passengers may think about his ticket.\nFeatured image Juan Manuel Serrano Arce via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1186,
  "scraped_at": "2026-02-14T02:12:17.571794",
  "_text_extracted": true
}