{
  "article_id": "0f0d219d6d37",
  "url": "https://www.france24.com/en/live-news/20240225-three-talking-points-from-the-premier-league-weekend",
  "title": "Three talking points from the Premier League weekend",
  "date": "20240225T204500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Three talking points from the Premier League weekend\nManchester (United Kingdom) (AFP) – Arsenal and Manchester City took advantage of Liverpool's weekend off from Premier League action to leave the top three separated by just two points.\nIssued on:\nBut victories for the title contenders came in contrasting fashion as Arsenal blew away Newcastle 4-1, while City edged out a nervy 1-0 win at Bournemouth.\nBehind the top three, it was Aston Villa's weekend in the battle for the top four.\nUnai Emery's men opened up a five-point gap over Tottenham thanks to a 4-2 win over Nottingham Forest, while Manchester United's recent fine form ended abruptly in a 2-1 home defeat to Fulham.\nAFP Sports looks at three talking points from the Premier League weekend.\nAnother Man Utd false dawn\nCompletion of Jim Ratcliffe's purchase of a minority stake in United, allied to a run of four consecutive league wins, meant there was an air of optimism around Old Trafford before kick-off.\nRatcliffe this week revealed his ambition to usurp Liverpool and City within three years.\nBut the work that lies ahead of the British billionaire was laid bare in a shambolic performance as Fulham claimed their first win at Old Trafford since 2003.\nErik ten Hag's men were barely deserving of Harry Maguire's late equaliser to cancel out Calvin Bassey's opener for the visitors.\nAnd in their determination to push for a winner, United were caught out as Alex Iwobi finished a clinical Fulham counter-attack.\nRatcliffe also underlined the need for Champions League football next season to give United more freedom to invest without breaching financial fair play limits.\nHowever, defeat leaves the Red Devils eight points adrift of fourth-placed Villa and with a daunting trip to City to come next weekend.\nLuiz 'lifted' by Emery\nDouglas Luiz has been one of the cornerstones of Villa's rapid rise under Unai Emery.\nThe Brazilian struck twice against Forest to take his tally for the season to nine in the Premier League, all of which have come at Villa Park.\nOnly Mohamed Salah has scored more home Premier League goals this season and the former Manchester City man credited Emery for developing him into an all-round midfielder.\n\"I just think he has lifted me, it is the truth,\" said Luiz. \"He has told me every day, you need to defend, and if you go, you need to score.\"\nArsenal 'living the dream'\nAs Liverpool battle a mounting injury list and City struggle to find their top form, Arsenal are the form horse in the title race.\nNewcastle were the latest lambs to the slaughter when faced with Mikel Arteta's free-scoring Gunners, who have struck 25 goals in six consecutive Premier League wins.\nArsenal ran out of gas down the final straight in last season's title race having led for the most of the season.\nA year on and Arteta's more mature side appear to be relishing the role of chasers despite the calibre of the Liverpool and City teams ahead of them.\n\"We are living the dream,\" said captain Martin Odegaard.\n\"We have all dreamed of being here. You see every week how competitive it is and that is where we want to be - we want to fight for trophies.\"\n© 2024 AFP",
  "word_count": 544,
  "scraped_at": "2026-02-14T02:13:34.138189",
  "_text_extracted": true
}