{
  "article_id": "0f16f65b8ca8",
  "url": "https://www.90min.com/features/arsenal-aims-ambitions-fixtures-final-two-months-2024-25-season",
  "title": "Arsenal aims , ambitions and fixtures for final two months of 2024 / 25 season",
  "date": "20250323T010000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal's aims, ambitions and fixtures for final two months of 2024/25 season\n- Arsenal's season likely to depend on success in Champions League\n- Key players for Mikel Arteta need tying down to new contracts\n- Groundwork must be laid ahead of busy summer for the Gunners\nMikel Arteta must be slightly concerned that Arsenal's season now hinges on whether they can claim a piece of silverware which has perpetually eluded them.\nAfter back-to-back second place finishes, there was a sense in pre-season that this may well be the Gunners' year. However, key injuries, an undeniable refereeing conspiracy and a flat-lining attack means Liverpool have been the primary beneficiaries of Manchester City's demise this term.\nIt can't be forgotten that Arteta has lifted the Gunners from a miserable era and returned them to a perch familiar with a more prosperous period. However, the Spaniard hasn't yet been able to get Arsenal over the line, and his project requires more silverware to ensure his almost universal support doesn't cease.\nThe Premier League title may be gone, but Arsenal's season isn't over yet. Here are the club's key objectives for the remainder of the 2024/25 campaign.\nMake history in Europe\nArteta returned Arsenal to Europe's top table in 2023, and the Gunners recorded their first Champions League knockout stage victory since 2010 by virtue of a penalty shootout triumph over Porto.\nA seasoned Bayern Munich halted their continental journey in the last eight, but Arsenal have shown in Europe this term that last season's experience was mightily helpful. Savvy, astute, and efficient, the Gunners have cruised through their Champions League campaign in 2024/25. Arteta's side finished third in the league phase table and breezed past PSV Eindhoven in the round of 16 after securing a record-breaking 7-1 away win in the first leg.\nHowever, as was the case last season, Arsenal face a behemoth in the quarter-finals. Real Madrid have long held hands with the Champions League, and they're hunting crown number 16 in Munich at the end of May. Carlo Ancelotti's side are fallible, but they almost always find a way on this stage.\nPedigree matters. Heritage matters. While Madrid are synonymous with European glory, Arsenal are bereft of continental success. This is a competition they've never won before, but victory over Madrid in the last eight will doubtlessly spark a sense of destiny no matter the challenges which arrive later on.\nWinning your first-ever Champions League title would be some way to overcome domestic disappointment.\nContract extensions for cornerstones\nEdu Gaspar had his faults as sporting director, but he did do an excellent job of ensuring the key cogs in Arteta's machine were tied down for the long haul.\nHowever, the cornerstones of the Spaniard's project are veering towards the conclusions of their second contracts. The club are bound to let Jorginho and Thomas Partey walk this summer, while Leandro Trossard, Oleksandr Zinchenko and Takehiro Tomiyasu will soon enter their final years.\nWhile 2027 currently appears distant, it will come around in no time. As it stands, Gabriel, William Saliba, Bukayo Saka, and Gabriel Martinelli all have deals due to expire that summer.\nMartinelli's past two seasons suggest he's not a star worth losing sleep over, but there will be some angst regarding the remaining situations. Gabriel and Saliba may well be the best centre-back partnership in Europe, and although Saka has missed a chunk of 2024/25 due to a hamstring tear, he's the poster boy of Arteta's project. You can't imagine Arsenal without him.\nGabriel has been linked with a summer Saudi move, while Madrid are sniffing around for Saliba. Their departures seem unlikely, but Arsenal can't allow the same situation we're seeing at Liverpool this season to develop.\nEyes on the summer\nNo matter how the rest of the season plays out in north London, the upcoming summer transfer window is hugely significant for the Gunners.\nThe club, in short, has not done enough over the past couple of windows to set themselves up for success. Their inactivity in January was bizarre, and expectations are sky-high for the summer, especially with Andrea Berta arriving as sporting director.\nArsenal require a midfield rejuvenation with Jorginho and Partey in need of replacing, but everybody knows where the club's priority lies in the transfer market. They need a superstar centre-forward. Alexander Isak is the utopia, while Benjamin Sesko is the project option with astounding potential to fulfill.\nThis attack needs level-raisers across the board, with upgrades required opposite Saka. While the Football Manager-like projections of Arsenal's window are fanciful, expect the club to be very busy this summer. They have to be.\nThe groundwork should be getting laid as we speak.\nArsenal's remaining 2024/25 fixtures\nWith Liverpool 12 points clear at the top of the Premier League table with nine games to go, Arsenal will be prioritising their upcoming Champions League quarter-final against Real Madrid.\nBefore they host the first leg on 8 April, Arsenal face Fulham and Everton, two teams they dropped points against in December. Brentford then travel to the Emirates before Arteta's side visit the Bernabeu for just the second time in club history. It's fair to say that Madrid's glorious amphitheatre has lived fondly in the memories of supporters for the past 20 years.\nThe Gunners will hope their European campaign is prolonged, with the semi-final fixtures pencilled in for the end of April and start of May. Their season could conclude in Munich on 31 May, but a more subdued finale at Southampton appears more likely.\nIf it isn't to be in Europe, they'll hope to still be in the title race by the time they visit Anfield on 10 May.",
  "word_count": 945,
  "scraped_at": "2026-02-14T02:18:17.725701",
  "_text_extracted": true
}