{
  "article_id": "0f27b4256912",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-sack-man-utd-pressure-ratcliffe",
  "title": "Ten Hag sack : Stunning  not good enough for Man Utd  claim as pressure grows on Ratcliffe to act",
  "date": "20240420T141500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTen Hag sack: Stunning ‘not good enough for Man Utd’ claim as pressure grows on Ratcliffe to act\nFormer Manchester United captain Bryan Robson has become the latest club legend to question Erik ten Hag’s future, admitting this season has been “not good enough for Man Utd.”\nAnd he believes Sunday’s FA Cup semi-final clash with Coventry City is “a must-win game” for Ten Hag‘s hopes of avoiding the sack as pressure grows on new joint-owner Sir Jim Ratcliffe to act.\nTen Hag has come under mounting scrutiny during a difficult second season at Man Utd, with the club – currently sitting a distant seventh in the Premier League table, 13 points adrift of fourth-placed Aston Villa – almost certain to miss out on qualification for the Champions League.\nMan Utd’s mediocre domestic form comes in a season in which the club finished bottom of their Champions League group in December, having recorded just a single win from their six European fixtures.\nTEAMtalk exclusively revealed last month that Man Utd are likely to appoint a new manager in the summer, with Ten Hag seen as a dead man walking by club insiders and some players no longer believing in the Dutchman and his methods.\nSacking Ten Hag would be a significant move by Ratcliffe, who took control of all football operations inside Old Trafford after formally completing his purchase of a 27.7 per cent stake in Man Utd in February.\nRobson, who made 345 appearances for Man Utd between 1981 and 1994, has sympathy for Ten Hag given the amount of injuries in his squad this season, but conceded that the season has fallen below expectation.\nAnd with the FA Cup the club’s last remaining hope of securing a trophy this season, the former midfielder sees the tie with Coventry as a potentially pivotal match for Ten Hag’s hopes of surviving.\nHe told The Sun: “We’re not in the league position we’d like to be in.\n“I think the manager has had a lot to put up with, including the injuries we’ve had, which is part and parcel of the game and you can’t get away from that.\n“Sometimes you have a bad season with a lot of injuries. So he’s had to cope with that, which is why we’ve conceded a lot of goals.\n“At certain parts of the season, we look good and we put it together.\n“But it’s not good enough for Manchester United, it has got to be better.\n“We’re still in the FA Cup semi-final and it’s a must-win game – not just for the manager, but for the club itself.”\nWith Man Utd luring Omar Berrada from local rivals Manchester City to become the club’s new chief executive – and confirming the appointment of Jason Wilcox as technical director on Friday – Ratcliffe has already made his presence felt inside Old Trafford.\nRobson is expecting more changes to be on the way in the summer, adding: “I can see the new ownership and the running of the club is going to be different.\n“We don’t know exactly how that’s going to work yet, but I am sure we will see by the end of the season, we see where we are in Europe, hopefully we’ve won a trophy.\n“It will be interesting to see what we do in the summer, how we structure the club and how we start to improve the squad of players.”\nDON’T MISS: Ten Hag sack: Five left-field contenders to become next Man Utd manager analysed",
  "word_count": 592,
  "scraped_at": "2026-02-14T02:07:51.324533",
  "_text_extracted": true
}