{
  "article_id": "0f299e3df097",
  "url": "https://www.themag.co.uk/2025/11/if-newcastle-united-can-win-these-six-matches-i-would-be-more-than-happy/",
  "title": "If Newcastle United can win these six matches I would be more than happy",
  "date": "20251121T093000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If Newcastle United can win these six matches I would be more than happy\nThis is a full on run of matches coming up for Newcastle United.\nA period of time that could potentially make or break our season.\nIt is ridiculous that we have already had (as usual) three international breaks, where there are no matches in club football for two weeks each time.\nThen you are thrown back into such a crowded schedule.\nNewcastle United having these nine matches now in four weeks, before then we get to Xmas.\nThese nine matches are Man City (H), Marseille (A), Everton (A), Spurs (H), Burnley (H), Bayer Leverkusen (A), Sunderland (A), Fulham (H) and Chelsea (H).\nI saw an interesting poll this week on The Mag, asking fans what they thought would be the minimum number of wins in these nine matches that would equal success. The most popular answer was six wins from nine as a minimum that would leave us feeling that this next month had been a success, with seven wins in nine the next most popular answer, followed by five wins from the nine.\nGood to see Newcastle United fans accepting that success isn’t having to win every single match. You’d love it to happen but in the real world that isn’t reality.\nTo face nine games in only four weeks is a massive challenge and I would love it if we won six of these nine matches, especially these six!\nIn this run of matches, it is a big positive that five of the nine are at home.\nIn no real particular order, these are the six wins that I would be most happy about.\nMan City (H). I think this would be huge for many reasons, Eddie Howe hasn’t won a Premier League match against Man City, just the League Cup one two seasons ago. This would be a big reminder to everybody, Newcastle fans and neutrals/enemies, that we can beat anybody. Plus of course it would be three valuable points AND set us off full of confidence for the other eight games this next month.\nMarseille (A) and Bayer Leverkusen (A).\nIf Newcastle United could get wins against this pair, that would be 15 points from six games. Last season in the Champions League, 16 points guaranteed you top eight. With PSV at home next, imagine just needing a point from that to guarantee a place in the last 16 of the Champions League! If that doesn’t excite you then I don’t know what will…\nSunderland (A). Surely I don’t have to explain this one.\nFulham (H). In my mind, I shouldn’t have to explain this one either. Like the Champions League thing, why wouldn’t you be getting excited if we were through to another semi-final. Certainly, if you were lucky enough to be at Wembley in March this year like me, why wouldn’t you want to have the chance of doing that all again??? You can talk all you want about league positions and cash, but in those moments when Dan Burn and that other bloke scored, then the final whistle, they were priceless.\nOnly allowing myself six wins, does mean that three of these four will have to be losses (or draws), I hadn’t set the rules on this side of things when I started to think of the six I would most want to win.\nThe final game before Christmas is Chelsea at home and beating that lot is always a nice moment, something we have got used to under Eddie Howe at St James’ Park. As the last game before Xmas as well, I have to choose this.\nSadly that means no wins against Everton (A), Spurs (H), or Burnley (H).\nA price worth paying if it means winning those other six? Definitely!!!\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 648,
  "scraped_at": "2026-02-14T02:09:38.461816",
  "_text_extracted": true
}