{
  "article_id": "0f526fe7c832",
  "url": "https://easternmirrornagaland.com/real-vs-atletico-rivalry-continues-with-a-fourth-madrid-derby-of-the-2023-24-season/",
  "title": "Real vs Atletico : Rivalry continues with a fourth Madrid Derby of the 2023 - 24 season – Eastern Mirror",
  "date": "20240201T160000Z",
  "domain": "easternmirrornagaland.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Home\n- Real vs Atletico: Rivalry continues with a fourth Madrid Derby of the 2023-24 season\nShare\nNEW DELHI — For the first time this season, the Santiago Bernabeu Stadium will host the Madrid Derby when Real Madrid face Atletico Madrid in La Liga this Sunday night. However, this will be the fourth meeting between Los Blancos and Los Rojiblancos of the 2023/24 campaign, and their third clash in the space of a month.\nGiven that Carlo Ancelotti and Diego Simeone’s squads were also drawn against each other in this season’s Spanish Super Cup and Copa del Rey, the Madrid Derby has been reaching a crescendo over the past few weeks, ahead of this hugely important showdown at the Bernabéu.\nThey met early in this league campaign in September on Matchday 6, when Atletico de Madrid achieved an impressive 3-1 victory at the Estadio Civitas Metropolitano when all three of their goals -– two by Alvaro Morata and one by Antoine Griezmann -– were headers.\nReal Madrid achieved revenge, though, when the old foes faced off in Saudi Arabia on January 10 in the Spanish Super Cup semifinal, as Dani Carvajal fired in a late strike to make it 3-3 and force extra time, where goals from Joselu and Brahim Diaz earned Los Blancos a 5-3 victory and a ticket to the final, which they won against FC Barcelona to lift the first trophy of the 2023/24 Spanish football season.\nJust over a week later, on January 18, there was another duel, this time in the last-16 stage of Copa del Rey. After Real Madrid equalised twice to make it 2-2 after 90 minutes, a sensational Griezmann goal put Atleti 3-2 up in extra time before Rodrigo Riquelme sealed the deal on a late counterattack to give Los Colchoneros a night to remember.\nThose previous meetings have set the stage for this upcoming duel, and fans are expecting more goals given that there have been 5.33 goals on average per Madrid Derby so far this season. This fixture had already been trending in this direction in previous seasons, as there hasn’t been a clean sheet in this rivalry match since a 1-0 Atleti victory in May of 2022. Since then, all three derbies last season and the three so far this term have seen both teams get on the scoresheet.\nCan Atletico de Madrid defeat Real Madrid for a third time this season?\nReal Madrid are enjoying an impressive 2023/24 campaign overall, as they have already won one trophy, are very much in the title race and topped their Champions League group with a perfect record. From 31 matches played so far this term, Ancelotti’s side have only lost twice. However, both those defeats were against Atlético de Madrid.\nIt’s interesting to look at Real Madrid’s defensive stats for the season as a whole. They have only conceded 30 goals in total, less than one per game, but 10 of those goals have been netted by their neighbours. In other words, Real Madrid are conceding just 0.71 goals per game against all other opponents, but are letting in 3.33 per game when they face Los Colchoneros.\nIt may well be, therefore, that Simeone and this Atletico de Madrid squad have worked out a way to frustrate Real Madrid and achieve results. Not since 2014/15 have Atleti conquered their rivals three times or more in the same season, but that will be the aim this Sunday when they make the short trip to the Bernabeu for this La Liga showdown.",
  "word_count": 590,
  "scraped_at": "2026-02-14T02:10:42.029973",
  "_text_extracted": true
}