{
  "article_id": "0f6a784ef179",
  "url": "https://www.myjoyonline.com/juventus-15-point-deduction-for-illicit-transfer-activity-is-reversed/",
  "title": "Juventu 15 - point deduction for illicit transfer activity is reversed",
  "date": "20230421T051500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nJuventus' 15-point penalty over transfer dealings has been reversed.\nItaly's highest sporting court says the case should be re-examined after Juve were accused of fixing balance sheets by artificial gains from transfers.\nThe lifting of the points deduction means Juventus move up from seventh to third in the Serie A table.\nRather than Juve being cleared, the case will now return to the Italian Football Federation appeals court, the body which gave the initial punishment.\nAs a result of the decision, with eight games to go in the season, AC Milan are knocked out of the Champions League places while Roma drop to fourth.\nTottenham managing director of football Fabio Paratici lost his appeal against a 30-month ban as part of the same proceedings.\nThe former Juve sporting director was one of 11 directors at the club, either former or still in place at the time of the ruling, who were sanctioned.\nParatici, former president Andrea Agnelli, former chief executive Maurizio Arrivabene and sports director Federico Cherubini had their appeals rejected.\nFormer player and director Pavel Nedved, Paolo Garimberti and Enrico Vellano were successful with their appeals.\nWhy were Juventus docked 15 points?\nThe Old Lady were handed a points deduction after an investigation into the club's past transfer dealings spanning two years from 2019 to 2021 by Italian football's governing body (FIGC).\nJuventus were accused of fixing their balance sheets by artificial gains of around 60m euros from club transfers, charges they were found guilty of by the FIGC's appeals court in January.\nThe club, however, denied any wrongdoing and took their case to a tribunal at the Olympic Committee, Italy's highest sporting court.\nThe tribunal did not rule on the merits of the case but instead examined the legal legitimacy of the punishments handed out by the FIGC to the club and directors.\nJuventus were among several Serie A clubs acquitted of suspect transfer activity by an FIGC appeals court trial last year but the investigation into the club was reopened due to new evidence from a separate criminal probe into their finances.\nThe 15-point sanction was tougher than the nine-point deduction prosecutors had requested.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n11 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n36 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n38 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 584,
  "scraped_at": "2026-02-14T01:55:54.944680",
  "_text_extracted": true
}