{
  "article_id": "0f7e552a652b",
  "url": "https://www.90min.com/posts/liverpool-1-1-aston-villa-player-ratings-20-5-23",
  "title": "Liverpool 1 - 1 Aston Villa : Player ratings as Firmino strikes late in Anfield farewell",
  "date": "20230520T164500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool 1-1 Aston Villa: Player ratings as Firmino strikes late in Anfield farewell\nRoberto Firmino nabbed an 89th-minute equaliser on his final appearance at Anfield, saving a point for Liverpool in a 1-1 draw at home to Aston Villa on Saturday.\nManchester United's victory over Bournemouth on the same day left Liverpool's Champions League aspirations hanging by a thread, but Firmino ensured that they are still tentatively intact.\nVilla started the game confidently, refusing to blindly blast the ball up the pitch in the face of Liverpool's feverish pressure. John McGinn swept a delicate first-time pass around the corner as the visitors pierced through their hosts in transition. Ollie Watkins managed to toe the ball ahead of Ibrahima Konate, luring the centre-back into an ill-timed lunge which earned a blatant spot kick.\nWatkins dusted himself off to line up his sights from 12 yards but got the calibration all wrong, planting his penalty kick well wide of Alisson's net.\nLiverpool wasted the lifeline Watkins handed them. Villa came out on top in an impromptu bout of head-tennis on the edge of Liverpool's area, pinning the Reds back before Douglas Luiz swung the ball towards the back post where Jacob Ramsey was lurking, volleying in from a tight angle inside the opening half-hour.\nTyrone Mings was a magnet to the ball at the heart of Villa's defence and found himself at the epicentre of the game's controversial decisions. Despite branding Cody Gakpo with his studs while making a late tackle in the first half, Mings remained on the pitch to make a goal-line clearance after the interval. Gakpo tucked in the rebound, lifting up his shirt to show his battle scars only for VAR to intervene - Virgil van Dijk had strayed offside in the build-up.\nUnai Emery lost his two natural left-backs to injury during the game, eventually turning to the versatile veteran Ashley Young. As Villa sought to defend their lead, Emery directed both of his wingers back to form a defensive line of six.\nHowever, Ramsey didn't scurry back in time to help Young in the 89th-minute. Finally freed of Villa's dogged double-marking, Mohamed Salah bent a devilish cross with the outside of his left boot. Firmino flung his foot forward, finally getting ahead of Mings to stab Liverpool level.\nLiverpool player ratings (4-3-3)\nGK: Alisson - 6/10 - Beaten by an excellent volley but stood firm thereafter.\nRB: Trent Alexander-Arnold - 5/10 - Trademark Trent in every sense; sprayed the ball around effortlessly but also switched off at the back post for Ramsey's opener.\nCB: Ibrahima Konate - 3/10 - Lost the race with Watkins and compounded his clumsiness with a penalty concession.\nCB: Virgil van Dijk - 5/10 - Proved to be swifter over the turf than Konate but forced to scurry back far more often than he would have cared for.\nLB: Andy Robertson - 4/10 - Rapidly got touch-tight with Leon Bailey whenever the opportunity presented itself.\nCM: Jordan Henderson - 5/10 - Struggled to exert a significant influence over proceedings.\nCM: Fabinho - 3/10 - Sluggish and sloppy, Fabinho arrived to a raft of duels a second too late throughout the contest.\nCM: Curtis Jones - 6/10 - Hounded after the ball with an infectious zeal but didn't see a great deal of possession.\nRW: Mohamed Salah - 5/10 - Skirted around the fringes of the game, struggling to wriggle his way between the two Villa players that made their way over to him.\nST: Cody Gakpo - 5/10 - Unfortunate to have a well-taken goal ruled out.\nLW: Luis Diaz - 4/10 - Flitted in and mainly out of the contest.\nSubstitutes\nDiogo Jota (63' for Jones) - 4/10 - Struggled to attune the staccato rhythm of the contest.\nRoberto Firmino (72' for Diaz) - 7/10 - It just had to be him, didn't it?\nKostas Tsimikas (72' for Robertson) - 5/10\nJames Milner (72' for Henderson) - 5/10\nHarvey Elliott (82' for Fabinho) - N/A\nSubs not used: Kelleher (GK), Carvalho, Matip, Gomez\nManager\nPep Lijnders - 3/10 - Tossed on all of Liverpool's available attackers but could hardly be credited with a great tactical rejig.\nCURRENT PREMIER LEAGUE TABLE, TOP SCORERS & UPCOMING FIXTURES\nAston Villa player ratings (4-3-3)\nGK: Emi Martinez - 7/10 - Dealt well with what little he had to do.\nRB: Matty Cash - 6/10 - Managed to cope reasonably well with the directness that Diaz brings.\nCB: Ezri Konsa - 7/10 - Less subtle with his defensive interventions than his centre-back partner but just as important.\nCB: Tyrone Mings - 8/10 - Delivered a glut of crucial clearances and tackles but was very fortunate to escape a red card at the end of the first half after leaving his shoe size on Gakpo's midriff.\nLB: Lucas Digne - 6/10 - Tasked with penetrating the final third when Villa had the ball as well as tucking into a very narrow back four out of possession. Forced off injured shortly after half-time.\nCM: Boubacar Kamara - 7/10 - Sweeping up as Villa's deepest midfielder and plugging numerous holes.\nCM: Douglas Luiz - 7/10 - Picked out Ramsey for the opener with a characteristically accurate waft of his right leg but didn't shirk his defensive duties when Liverpool probed.\nAM: John McGinn - 6/10 - The closest player to Watkins, Villa's skipper was typically tenacious, almost tackling opponents even when he had the ball.\nRW: Leon Bailey - 5/10 - Tracked back diligently but wasn't overly involved going forward.\nST: Ollie Watkins - 4/10 - The steward sitting wide of the goal needn't have flinched when Watkins took his penalty, the ball went ever further away from the net.\nLW: Jacob Ramsey - 8/10 - The skill it must have taken to beat Alisson with a perfectly cushioned volley from practically the byline with his weaker foot cannot be underestimated.\nSubstitutes\nAlex Moreno (53' for Digne) - N/A - The injury-enforced replacement was forced off with injury himself.\nAshley Young (53' for Bailey) - 6/10 - Forced to cover at left-back after Moreno limped off.\nEmiliano Buendia (65' for Moreno) - 5/10\nJhon Duran (87' for Watkins) - N/A\nLeander Dendoncker (87' for Luiz) - N/A\nSubs not used: Olsen (GK), Sinisalo (GK), Traore\nManager\nUnai Emery - 6/10 - Villa played some lovely football before taking the lead, baiting Liverpool's press and unsettling the hosts' infamously high line. In the second half, all that went out of the window as they grimly set about defending their advantage, which ultimately didn't work.",
  "word_count": 1094,
  "scraped_at": "2026-02-14T02:19:46.300349",
  "_text_extracted": true
}