{
  "article_id": "0fbf770248e5",
  "url": "https://www.caughtoffside.com/2023/08/04/mauricio-pochettino-interview-mature-pochettino-relishing-the-pressure-of-winning-a-premier-league-title-with-chelsea/",
  "title": "Interview : Pochettino relishing the pressure of winning the Premier League",
  "date": "20230804T180000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino is acutely aware Chelsea has a ‘win now’ culture. Despite finishing 12th last season – failing to qualify for European football for the first time since 2015/16 under Jose Mourinho – expectations ahead of the new campaign haven’t been tempered.\n“We are going to try and win [the Premier League],” Pochettino said after the 1-1 draw against Dortmund in Chicago. “I am not selling smoke. Chelsea has to try and win [the title]. I’ll tell you if it was possible at the end of the season.”\nPochettino looks refreshed, and calm about the challenge in front of him. There’s an acceptance he’s inherited a young squad that may take time to mould. And that’s why Chelsea’s clearly ambitious project is often dubbed ‘long term’. But the 51-year-old Argentine isn’t simply planning seasons ahead – that’s a task reserved for Chelsea’s sporting directors and owners.\n“‘I need to win [now],” said Pochettino, speaking from his hotel during Chelsea’s pre-season tour of Chicago. “I am a coach… and it’s like a striker. If they score, good. If they don’t, [it’s a] problem. The coach is the same. We need to win and if we don’t, we will struggle.\n“Next week we are going to face Liverpool [to start the Premier League season] and the mentality is to win. My idea and message to the players, the fans and everyone is that we are Chelsea, and we need to win. Today, yesterday, not tomorrow.\n“At the same time, we need to be working hard and be clever in how we are going to prepare for next month, the next six months and the year.”\nWhen Chelsea host Liverpool on August 13, Pochettino will return to the touchline for a Premier League game for the first time since November 9, 2019, when Tottenham drew 1-1 with Sheffield United. He was sacked 10 days later, leaving Spurs lingering 14th in the Premier League table.\nBut across his five seasons in charge, Pochettino secured four consecutive top-four finishes and led Spurs to their first-ever Champions League Final in 2019, where they lost 2-0 to Liverpool in Madrid.\nAfter 14 months out of the game following his Spurs exit, Pochettino accepted the Paris Saint-Germain job in January 2021. And in his second season in charge, he won Ligue 1 in 2021/22 with Lionel Messi, Kylian Mbappe and Neymar all part of his star-studded squad.\nPSG proved a testing gig, though. It was as much about navigating politics as tactics. And Pochettino was judged almost entirely on whether he won the Champions League. He reached the semi-finals in 2021; but the following season a last-16 loss to Real Madrid from 2-0 up on aggregate with only half an hour of the tie left effectively ended his time at the Parc des Princes.\n“We took very positive things from this experience knowing that when you arrive at a club like Paris Saint-Germain it’s about winning the Champions League. If you don’t win the Champions League, you need to move on,” conceded Pochettino, who also captained PSG as a player. “I hope that changes because I think Paris deserves to be more consistent and time to build something.\n“When we lost to Madrid after one year in charge, the club started to think about changing everything. I explained that [Manchester] City or Liverpool, they lose semi-finals or finals, but keep going, giving the coaching staff the possibility to work for the [next] pre-season.\n“You can’t win if you don’t build nothing [and just] bring in names and players. Liverpool won [the Champions League] after very good years of working hard and being consistent. City [were] the same after seven years with Pep, and also Madrid. That is important to understand. Maybe sometimes you can win and it’s an exception, but in general, the club who is going to win is more consistent, working, making a plan, to try and win.”\nPochettino’s hope is that Chelsea will give him time, with the first aim being to get back into the Champions League; and that recruitment will be strategic, collaborative and not solely star-obsessed.\nIt’s understood that former Chelsea manager Thomas Tuchel grew frustrated when co-owner Todd Boehly kept raising the idea of bringing Cristiano Ronaldo to Stamford Bridge last summer. Tuchel felt signing Ronaldo made no football sense and could disrupt his dressing room. Now flash forward to this window and Kylian Mbappe is very publicly on the market, and Neymar could yet be sold as well. PSG are content to fuel links with Chelsea, but signing either player – despite snowballing rumours – is firmly downplayed by those close to the club.\nChelsea now have a fully-built recruitment team and strategy in place compared to 12 months ago making sporadic signings less likely. With this type of ‘transfer committee’ recruitment model disagreement is actually healthy. There needs to be freedom to challenge due to several senior leadership figures, Pochettino included, all heavily involved in pursuing targets. But what’s clear is Boehly and fellow co-owners Behdad Eghbali and Jose Feliciano have quickly learned there may be times when they need to back off. That’s also why highly-rated co-sporting directors Laurence Stewart and Paul Winstanley have now become the faces and voices of recruitment.\nBefore Pochettino accepted the Chelsea job he went to great lengths to fully understand Chelsea’s vision and dynamic. It was basically a two-way interview. During his first Zoom call with co-sporting directors Stewart and Winstanley, Pochettino even half-jokingly asked who was interviewing who.\nPochettino’s thoroughness, and Chelsea’s own exhaustive process to replace Graham Potter, are both understandable given the dramatic and chaotic 12 months since Clearlake-Boehly assumed control of Chelsea in late May last year.\nPochettino watched from afar as Chelsea’s new project endured major teething problems but was actually briefly under consideration when Potter was appointed in September last year.\nThe then Brighton boss was the clear choice back then, hence why Chelsea’s owners moved so swiftly. Plus, Pochettino was reluctant to move seven games into the Premier League season and with the summer window shut. His time at PSG had made him in no hurry to rush back into the game. Taking that prolonged break, and waiting patiently for the right opportunity, means he returns more mature and introspective. This will be a different Pochettino from the one last seen in England at Spurs.\n“We changed many things [since leaving Spurs],” he said. “We [Pochettino and his coaching staff] are older now and when you’re 50 you need to be careful, because your change is quick! We are more mature, and we learned a lot in different situations.\n“We are guys who always judge ourselves and want to improve, and the experience gave us the possibility to improve. In terms of football, we are always moving on, watching and trying to develop different ideas. But in terms of management also, to have the possibility to manage in a different country provides the possibility to have more tools in the moment you create that platform, and the way to manage people also here in England. We’re much better people [now].”\nInstant results will always be expected at Chelsea. Even a handful of losses constitutes a crisis at Stamford Bridge. It’s a club with a serial-winner mentality and has been ever since Roman Abramovich took over in June 2003. The Russian billionaire was notoriously cutthroat with managers but won 21 trophies being so, thus justifying his approach.\nContrast that to Spurs, where the departing Antonio Conte boldly claimed in April his players were almost resigned to mediocrity.\n“They are used to it here, they are used to it,” he ranted after a 3-3 draw at Southampton, which proved to be his last game. “They don’t play for something important. They don’t want to play under pressure. They don’t want to play under stress. It is easy in this way. Tottenham’s story is this. 20 years the owner has been there and they never won something…”\nPochettino’s experience at Spurs was markedly different and far more positive compared to Conte’s tenure and included leading Spurs to their highest league finish since the 1962/63 season when they ended up runner-up to Chelsea in the 2016/17 Premier League title race. He has fond memories from his time in north London and retains a close personal relationship with Daniel Levy leading many to speculate whether he’d return to Spurs for a second managerial spell this summer. In the end, an offer never came.\n“I am not going to give my opinion about the comments of [Conte],” said Pochettino. “For me, when I was at Tottenham it was a different period, but I think the mentality to win was there. Maybe we didn’t lift a trophy, but we won in many, many ways. But now Chelsea is a different club [in a] different period [with a] different process [and a] different project.”\nChelsea is indeed different largely because the owners are trying to disrupt and innovate at super-speed en route to success. But the issue last season was all the constant change simply created more instability. So Pochettino is now looking to bring consistency, perhaps slow things down a little, and ultimately take some pressure off his players.\n“There’s always pressure when you are involved in this game,” he said. “When I started at Espanyol it was massive pressure because we were fighting relegation. Southampton was similar. Tottenham [had pressure] for different reasons. PSG, yes, and now with Chelsea. You are always under pressure…\n“We won the Premier League Summer Series. OK. And? We keep going, moving, because we need to… win the next game. If we lose the Premier League Summer Series, it’s massive pressure. [They’ll say], ‘Oh, Chelsea isn’t winning…’\n“We have had [five] games unbeaten [in pre-season] and it’s good. But when you lose one the good feelings disappear. That is our job. It is to keep the stability and provide balance. Sometimes the team has ups and downs. For us, it is [important] to behave in the same way.\n“Maybe now I sleep better. Before it was difficult when I started at Espanyol. It was like all or nothing. You feel, ‘If we don’t win tomorrow or tonight my career is going to be a disaster’. Now you manage the pressure better. You always feel the adrenaline but after you disconnect and say, ‘Now I need to rest, I need to sleep’.\n“I think that experience has helped me to have better sleep and to enjoy time with my family and my friends. It is easier to enjoy time with the players and the coaching staff. Before it was more bam, bam, bam, bam. We use the experience to learn. The passion is there, the adrenaline is there [and] the discipline. But it is about knowing when to be in this process and when to have time to enjoy yourself – when to liberate the players from all this pressure. How we behave as a coaching staff will transmit itself to the players.”\nPochettino is intent on building a new culture at Chelsea. Whether it’s hosting a barbecue at Cobham on his opening day, promising the squad a free meal for pushing themselves during gruelling pre-season testing, or just ensuring everyone at the club knows he has an open-door policy, the little touches haven’t gone unnoticed so far. Several senior players have been highly impressed by Pochettino and already feel like he cares about them as both footballers and, as importantly, people.\nThe opening game against Liverpool is now a chance to get a big win. Pochettino is wise enough to know one game won’t change all, but given Chelsea failed to beat any of last season’s eventual top six in 2022/23 – and managed just one win against any of the top-half finishers – kicking off the Pochettino era with victory against Jurgen Klopp’s side would make a real statement and set the tone for the season.",
  "word_count": 1991,
  "scraped_at": "2026-02-14T01:53:51.861085",
  "_text_extracted": true
}