{
  "article_id": "0fc4f79b8cae",
  "url": "https://thepeoplesperson.com/2024/06/28/galatasaray-increase-their-offer-for-manchester-united-right-back-aaron-wan-bissaka-282159/",
  "title": "Galatasaray increase their offer for Manchester United right - back Aaron Wan - Bissaka - Man United News And Transfer News",
  "date": "20240628T190000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United appear to be closer to finding a breakthrough in their attempts to sell players than signing new stars for Erik ten Hag.\nWith no Champions League football for the forthcoming season, the Red Devils find themselves in a precarious situation amid concerns regarding the Premier League’s Profitability and Sustainability Rules.\nINEOS’ transfer war chest is limited and in order to bring in multiple elite players to strengthen Ten Hag’s squad this summer, the club’s hierarchy will have to raise funds through player sales.\nIn that regard, Aaron Wan-Bissaka may help United improve their FFP situation, with the right-back understood to be attracting serious interest from Galatasaray.\nEarlier this month, The Peoples Person covered a report claiming the Turkish giants have submitted a €10 million bid for the 26-year-old defender.\nHowever, the Premier League giants turned it down, hoping to recoup more for the right-back they signed for a fee in the region of £50 million from Crystal Palace back in 2019.\nThe same report had suggested that Wan-Bissaka has already said “yes” to Galatasaray’s offer of an annual salary of €2.5m. Now, Galatasaray have once again knocked on United’s doors to find an agreement to secure the Englishman’s services.\nAccording to Fanatik (via Sport Witness), the Turkish champions have tabled an offer of €15 million for the United star in their bid to replace Serge Aurier.\nWith personal terms already agreed with the player’s entourage, Galatasaray are now waiting for United’s response.\nHowever, their improved bid might once again be turned down as the Old Trafford outfit are thought to be looking for €20 million.\nUnited’s position is strengthened by the fact that Wan-Bissaka, who is considered one of the most defensively reliable full-backs in Europe, is also allegedly attracting interest from several Premier League clubs, including West Ham United.\nIdeally, Ten Hag would be better off having both Wan-Bissaka and Diogo Dalot as his right-back options, but the PSR concerns could force United to part ways with Ole Gunnar Solskjaer’s signing.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 355,
  "scraped_at": "2026-02-14T01:57:18.880655",
  "_text_extracted": true
}