{
  "article_id": "0ff398fcdc01",
  "url": "https://english.aawsat.com/sports/4397356-chelsea%E2%80%99s-american-owners-agree-buy-stake-french-top-tier-soccer-club-strasbourg",
  "title": "Chelsea American Owners Agree To Buy Stake in French Top - Tier Soccer Club Strasbourg",
  "date": "20230623T154500Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea ownership group BlueCo has agreed to buy a stake in French top-tier club Strasbourg in a significant step forward in its plans for multi-club ownership.\nThe consortium, which purchased the Premier League club in May last year, are to become new shareholders “subject to a consultation process with the relevant employee representative bodies.”\nA statement said Thursday: “The shareholders of Racing Club de Strasbourg Alsace today announced an agreement with BlueCo, the consortium which purchased Chelsea FC in May 2022.\n“The agreement would mark a new chapter in Racing’s history as the ownership consortium commits to accelerate sustainable investment in the club’s growth, including in the first teams and in the Academy, in continuity with the project implemented by Marc Keller, who would remain president of the club, supported by his current management team.”\nThe statement added that “In accordance with Professional Football League regulations, the project was presented today to the Direction Nationale du Controle de Gestion (DNCG), whose assessment is expected in the coming weeks.”\nFinancial details of the intended deal were not announced. Strasbourg won its only French league title in 1979 and the last of its three French Cups in 2001.\n“This strategic investment would further our presence in European football, alongside our ownership of Chelsea,” BlueCo said. The consortium includes American investment fund Clearlake Capital and Todd Boehly, a part-owner of the Los Angeles Dodgers.\nMulti-club ownership creates opportunities to share resources and knowledge while also giving parent clubs the option of greater control of transfer market business.\nFIFA has weighed regulating the ownership model while UEFA President Aleksander Ceferin has said it could look at relaxing its rules designed to limit clubs that share owners both playing in European competitions.\nThe UEFA rules were drafted 25 years ago to protect the integrity of competitions.\nNeither Chelsea, the 2021 Champions League winner, nor Strasbourg qualified to play in UEFA’s club competitions next season.",
  "word_count": 319,
  "scraped_at": "2026-02-14T01:56:02.428340",
  "_text_extracted": true
}