{
  "article_id": "0ff471ab4f1b",
  "url": "https://www.teamtalk.com/arsenal/mikel-arteta-compares-star-just-signed-arsenal-lionel-messi",
  "title": "Arsenal : Mikel Arteta compares star who just signed to Lionel Messi",
  "date": "20260201T090000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nMikel Arteta compares star who’s just signed for Arsenal to Lionel Messi\nMikel Arteta reckons the only valid comparison to make between a player who’s just put pen to paper at Arsenal is with the greatest footballer of all time, Lionel Messi.\nSay what you want about Arteta and this current Arsenal team, but if you claim they’re lacking in belief or self-confidence, you’ll be a liar.\nThe Gunners might not have the trophies to back up their bluster over recent years, though that may well change when the cups are handed out over the next five months.\nArsenal, Andrea Berta and Edu before him have set this Arsenal team up to dominate for the rest of the 2020s and beyond.\nThe pieces to win the biggest trophies are in place right now, but to win year after year after year, much will be expected of 16-year-old wonderkid, Max Dowman, down the line.\nThe Arsenal academy graduate is widely regarded as one of, if not the best, prospect in his age group in world football.\nAnd on Friday, Dowman officially signed a pre-contract agreement with the Gunners that is the pre-cursor to signing his first professional contract with the club when he turns 17 at the end of 2026.\nWhen speaking about Dowman in a recent press conference, Arteta made the comparison of all comparisons when stating the only player he’s seen perform to such a high level at Dowman’s age was Lionel Messi.\nArteta said: “What he’s done with us at the age of 15, me personally, I haven’t seen it before, only with that guy who used to play at Barcelona, but maybe not even that.\n“But yeah, not only that but he has a certain charisma as well and personality that he doesn’t get overwhelmed by the situation or the stadium or the opposition. That’s a huge quality to have.”\nDowman already holds a number of records, including being Arsenal’s youngest ever starter in a competitive match at the age of 15 years and 302 days.\nHe’s also the youngest ever player to play in the Champions League at 15 years and 308 days.\nAn international level, he’s the youngest ever goalscorer for England at Under-19 level, with his goal against Ukraine’s U19s last September snatching the record off Ryan Sessegnon that dates all the way back to 2016.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nWhy Arsenal are perfect club for Max Dowman\nArteta went on to explain why Arsenal is the perfect place for Dowman to reach hit true potential in the future and hopefully, to be in proper conversations with Messi when all is said and done.\n“The fact that we have very good examples (of youth players breaking into the first team – Bukayo Saka, Myles Lewis-Skelly, Ethan Nwaneri etc) at the club is very helpful. Then it’s down not only to the player as well but the family as well.\n“They’re a crucial part of [the player’s] education and their development, and we’re very responsible of that.\n“But he’s been great, he’s got a great family and the communication between us has been very productive over the years.\n“And now I think they trust what we’re going to do with him and now it’s down to him and us to ensure he has an amazing career.”",
  "word_count": 577,
  "scraped_at": "2026-02-14T01:53:15.573564",
  "_text_extracted": true
}