{
  "article_id": "100030c5102c",
  "url": "https://english.aawsat.com/sports/5107986-cristiano-ronaldo-ready-asian-champions-league-action-milestone-birthday%C2%A0",
  "title": "Cristiano Ronaldo Ready for Asian Champions League Action Before a Milestone Birthday",
  "date": "20250203T133000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo turns 40 on Wednesday but is showing few signs of slowing down as he prepares to lead Saudi club Al-Nassr against Al-Wasl in the Asian Football Confederation’s Champions League Elite.\nThe Portuguese star, who signed for the Riyadh club in Dec. 2022, leads the Saudi Pro League scoring charts with 15 goals in 17 games.\nIf Ronaldo can reproduce that form in the continental tournament -- there are two games remaining in the group stage, from which his team has already qualified -- then Al-Nassr has a chance to become Asian champion for the first time.\n“The best birthday gift for Ronaldo is to achieve victory against Al-Wasl,” Al-Nassr coach Stefano Pioli said ahead of the Monday meeting. “It is an important match for us and we want the three points.”\nAfter winning the UEFA Champions League five times with Manchester United and Real Madrid, Ronaldo’s chances of winning a first Asian title have been bolstered with Al-Nassr's signing of Jhon Duran from English Premier League club Aston Villa last week.\nAccording to reports in Saudi Arabia, Duran has already been registered in time to play against Al-Wasl of the United Arab Emirates.\n“Duran is in good shape,” Pioli said. “We will decide how best to use him.”\nThe team will certainly be without former Manchester City defender Aymeric Laporte, who is absent for personal reasons. There are also injury issues for another defender, Ali Lajami, as well as Portuguese midfielder Otavio.\nAl-Nassr is in third place in the 12-team group, behind Saudi rivals Al-Hilal and Al-Ahli, both unbeaten after six games.\nAl-Hilal has won four continental titles, more than any other Asian club. The Blues have lost Neymar ahead of their match against Persepolis of Iran. Brazil’s record scorer returned to South America last week after an injury-hit spell of just seven appearances in 18 months for Al-Hilal.\n“We are looking forward to the game,” coach Jorge Jesus said. “Our ambitions are always to win at home and in Asia.”\nAl-Ahli, with former English Premier League stars such as Riyad Mahrez and Ivan Toney, has the offensive strength to win the Champions League for the first time. The Jeddah club, currently second, heads to Qatar to take on Al-Sadd.\nAll 12 teams in the western zone — the tournament is split into two geographic halves until the quarterfinals — are in with a chance of finishing in the top eight and progressing to the knockout stage.\nThe eastern zone resumes next week.",
  "word_count": 415,
  "scraped_at": "2026-02-14T02:11:27.591989",
  "_text_extracted": true
}