{
  "article_id": "100e6c9a9658",
  "url": "https://www.justarsenal.com/eidevall-happy-with-performance-and-result-as-injury-ridden-arsenal-beat-leicester-1-0/339067",
  "title": "Eidevall  happy with performance and result  as injury - ridden Arsenal beat Leicester 1 - 0",
  "date": "20230507T093000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eidevall “happy with performance and result” as injury-ridden Arsenal beat Leicester 1-0 by Michelle\nJust when Leicester had started getting used to winning, Arsenal happened. The Foxes have struggled to find consistency in the WSL this season. But notably, before their game against Arsenal on Friday night, they had celebrated two wins out of two. And injury-ridden Arsenal crushed Leicester’s hopes of achieving three wins out of three. Frida Maanum’s second-half goal ensured the Gunners took all three points against Leicester at Meadow Park.\nOur Gunners were coming off a tricky run of results before beating Leicester, failing to beat Wolfsburg in a two-legged Champions League semi-final, and not forgetting that 1-0 loss away to Manchester United (before Champions League semi-finals).\nArsenal have Leicester’s number though; they have a 4-game perfect WSL record against them. But it was worth noting that this fourth win was a struggle to come by, as Eidevall so rightfully admitted via Arseblog post-match: “Today was not easy, and that is what I said to the players after; the game on Monday was a huge game for us, and this was a quick turnaround, and we have a tight squad, and we lost Lina (Hurtig) to an injury. We knew this was a tough ask against a Leicester that has really found form, especially with this very front-footed, aggressive football. They beat Liverpool 4-0, convincingly, and they have been playing really well. We knew it wasn’t going to be easy, so I am really happy with the performance and the result.”\nThat win is one of five cup finals for Eidevall, and his team is targeting ending the season on a high – this is a very big ask given that half of the Arsenal squad is out injured..\nCOYGW!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 325,
  "scraped_at": "2026-02-14T02:00:20.001329",
  "_text_extracted": true
}