{
  "article_id": "1012b37e03d2",
  "url": "https://cosafa.com/familiar-face-returns-to-cosafa-qualifiers-for-gaborone-united/",
  "title": "COSAFA | Familiar face returns to COSAFA qualifiers for Gaborone United",
  "date": "20240731T064500Z",
  "domain": "cosafa.com",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Familiar face returns to COSAFA qualifiers for Gaborone United\nGaborone United will make their debut at the CAF Women’s Champions League | COSAFA Qualifier in Blantyre, Malawi from August 15-24, hoping to build on the strong showing of compatriots Double Action Ladies in the past three editions.\nThe club might be competing for the first time, but their coach William ‘Raizor’ Monene has previous experience in the regional competition with Double Action, including last year’s run to the final.\nMonene was with Double Action when they finished second to Gaborone United in the Gaborone City Region Division One last season, but has since crossed over to take his new club to the COSAFA Qualifiers.\nThat comes after he guided them to the Women’s Football Championship when they defeated Makgabz City FC 25-0 in the semi-finals, before an 8-1 victory over Tawana in the decider.\nDouble Action were beaten finalists in the COSAFA Qualifiers last year, with Monene leading them to the final before a 2-0 loss to powerhouse Mamelodi Sundowns.\nThey also reached the semifinals in 2021 and finished third in 2022, so have showcased the quality in Botswana’s women’s football. Gaborone will now want to carry that forward.\nThey have been drawn in Group B at the finals in Malawi and open their campaign against Mozambican debutants UD de Lichinga on August 16, before clashes with Young Buffaloes (August 18) from Eswatini and Malawian side Ascent Academy (August 20).\n“It is a good draw looking at the teams we are having, it is a balanced once. The most important thing is to try and analyse the teams we are playing against, especially the team from Mozambique,” Monene said.\n“Our team is gelling well, everyone is injury-free. The management are doing all they can to make the team competitive. We will be ready for the competition.”\nGaborone had 11 players called up for the camp ahead of the recent national team trip to Tunisia for the Tunis Women’s Cup, so have plenty of players with international experience in their group.\nMany of the players have not featured at this level before, but in Monene they have a tactician who knows exactly what it takes to be successful and will hope to pass that on to his players.",
  "word_count": 377,
  "scraped_at": "2026-02-14T02:08:01.871377",
  "_text_extracted": true
}