{
  "article_id": "102bb9eb7f83",
  "url": "https://www.uefa.com/returntoplay/news/027d-16f6e691bb58-238de5d7fb52-1000--what-to-look-forward-to-in-2023/",
  "title": "EURO 2024 qualifying , Women Finalissima , new Nations League winners , U21 EURO , Women Nations League : What to look forward to in 2023 | Inside UEFA",
  "date": "20230101T180000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EURO 2024 qualifying, Women's Finalissima, new Nations League winners, U21 EURO, Women's Nations League: What to look forward to in 2023\nSunday, January 1, 2023\nArticle summary\nUEFA.com picks out some of the blue-riband events to look forward to in 2023.\nArticle top media content\nArticle body\nIt looks set to be another bumper year of European football (and futsal) in 2023 – UEFA.com picks out some of the choicest morsels to feast on over the next 12 months.\nEURO 2024 qualifying starts (and nearly finishes)\nThe journey to UEFA EURO 2024 only begins in March, but by the end of the year we will know 21 of the 24 finalists. There is no shortage of enticing fixtures to look forward to from the off, with Italy vs England scheduled for the opening night of qualifying action and France vs Netherlands the following day. The final tournament draw will take place in Hamburg in December, with the last three spots to be confirmed via the play-offs in March 2024.\nFirst Women's Finalissima\nHot on the heels of the sold-out men's game between Italy and Argentina last summer, the first Women's Finalissima will match England with Brazil at Wembley Stadium on 6 April. The game is part of the expansion of the cooperation between UEFA and CONMEBOL and will be the first time the champions from the Women's EURO and Copa América Femenina have met in a formal, scheduled fixture. With memories of Sarina Wiegman's team's stunning performances still fresh in the memory, it promises to be quite a night. Tickets are on sale now.\nJune: New Nations League winners to be crowned\nRotterdam and Enschede in the Netherlands will stage the third UEFA Nations League finals in mid-June. The hosts, who dropped just two points en route to the finals, will be joined by fellow League A group winners Croatia, Italy and Spain – this ensures new champions following previous successes for Portugal in 2019 and France in 2021. The draw to determine the semi-final pairings will take place in January.\nU21 EURO in Georgia and Romania\nStaged in Hungary and Slovenia two years ago, the U21 EURO final tournament will again be hosted jointly in 2023, this time by Georgia and Romania. The tournament runs from 21 June to 8 July, starting with a 16-team group stage from which eight nations progress to the quarter-finals. There will be games at four stadiums in Romania (two in Cluj-Napoca, two in Bucharest) and four stadiums in Georgia (one each in Batumi and Kutaisi, and two in Tbilisi). Seven of the 16 finalists – including holders Germany – have lifted the trophy previously.\nA new dawn for women's football\nNot even 12 months after England won Women's EURO on home soil, the 2023 FIFA Women's World Cup gets under way in Australia and New Zealand. Eleven European teams have already booked their place, with Portugal still hoping to make it a round dozen via the inter-confederation play-offs in February. Will Europe have its first winners since Germany in 2007? Then, in autumn, the UEFA Women's Nations League kicks into gear as part of the new UEFA women's national competition system unveiled in November.\nEURO host announcements\nThe appointment of the UEFA EURO 2028 and UEFA EURO 2032 hosts is expected to be made in autumn. Türkiye have submitted a bid dossier for both tournaments, with a joint UK/Republic of Ireland bid also in for 2028 and Italy looking to stage the 2032 edition. Another key UEFA date to look out for is the annual UEFA Congress in Lisbon on 5 April.\nBusy year in the futsal calendar\nThe first UEFA final of 2023 will be in Debrecen, Hungary, in March, when the third UEFA Women's Futsal EURO champions will be crowned; the last showpiece will also be on the futsal pitch, the UEFA Under-19 Futsal EURO decider in Poreč, Croatia, in September. The UEFA Futsal Champions League finals, featuring two debutants in Mallorca Palma Futsal and Sporting Anderlecht Futsal, take place in May, with FIFA Futsal World Cup qualifying spread across much of the year.\nRegions' Cup returns\nFollowing the cancellation of the 2020/21 UEFA Regions' Cup due to the COVID-19 pandemic, the 2023 finals will be the first in four years. Bavaria, Belgrade, holders Dolny Śląsk, Galicia, Lisboa, Republic of Ireland Amateur, Zenica-Doboj and Zlín have qualified for the summer finals, with the hosts and venue yet to be confirmed.",
  "word_count": 739,
  "scraped_at": "2026-02-14T02:19:30.191465",
  "_text_extracted": true
}