{
  "article_id": "102bb025df50",
  "url": "https://gulfnews.com/opinion/op-eds/heightened-summer-tensions-brewing-in-france-what-is-the-reason-1.96705553",
  "title": "Heightened summer tensions brewing in France . What is the reason ? ",
  "date": "20230702T080000Z",
  "domain": "gulfnews.com",
  "source_country": "United Arab Emirates",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "COMMENT\nRecent protests have placed a microscope squarely on its police forces and their tactics\nLast updated:\n4 MIN READ\nIn spite of a relatively peaceful evening of protests following the tragic police killing of a 17-year-old, two incidents targeting civic leaders underscored the volatile nature of the situation.\nThe mayor of a suburb of Paris said on Sunday that protesters had rammed a car into his home and then set the vehicle on fire, injuring his wife and one of his children.\nIn the last few days, the killing of a 17-year-driver by police in a Parisian suburb has provided a spark. Several hundred people have been arrested in nights of rioting and protests following the incident in Nanterre, where the boy was fatally shot following a traffic stop.\nTear gas, bin fires, batons, blood and broken glass. These are the sights and sounds that pervade parts of Paris — about as far removed in every sense from the summer evenings enjoyed by those who escape the city.\n“A night of unbearable violence against symbols of the Republic: town halls, schools and police stations set on fire or attacked. 150 arrests,” said Interior minister Gerald Darmanin on Thursday. “Support for the police, gendarmes and firefighters who face up with courage. Shame on those who did not call for calm.”\nUnrest was also reported in other cities including the industrialised centres of Lille and Amiens in northern France, along with Dijon in the east and Toulouse in the south.\nDozens of police have been injured in the rioting and extra police have been drafted in to try and quell the violence.\nBut there is an all-too- familiarity to this summer’s social script.\nThis time, it was the shooting of the youth, named in local reports as Nahel M., that sparked the chaos. Months ago, it was pension reforms that sparked widespread violence, rioting and protests. Sadly there is a tragic list of youths — seemingly always from immigrant backgrounds or ethnic minorities that came off second best in dealings with police — that have led to similar convulsions.\nThose speaking out include French footballer Kylian Mbappe, the Paris Saint-Germain star who captains the French national team and grew up in Saint-Denis, nearby Nanterre. He tweeted it was an “unacceptable situation”.\nPresident Emmanuel Macron called the shooting “unexplainable and inexcusable” and called for calm. “Nothing justifies the death of a young person,” he said as the police officer accused of the killing was held in custody on suspicion of manslaughter.\nThe official version is that the teenager — of North African origin — failed to comply with an order to stop his car and that officers feared for their lives after he threatened to run them over.\nThat is disputed by his family and their lawyers, and they cited a video circulating online that shows two police officers leaning into the driver-side window of his yellow car, before the vehicle pulls away and an officer opens fire. The car is later seen crashed into a nearby post. The driver was fatally wounded by a bullet and died at the scene.\nBut this latest incident, along with a long deep and difficult reflection on how security officials reacted to the anti-pension reform protests of March and April, has resulted in a searing spotlight being shone on police and their tactics in dealing with unrest, protests and what is perceived as an inevitable slide into rioting and street violence.\nThe Council of Europe — the European Union’s human rights watchdog — has weighed into French policing methods, citing them for “excessive use of force” during demonstrations against Macron’s pension reforms, noting that officials failed to protect peaceful demonstrators and journalists from police brutality.\nReporters Without Borders has said police assaulted several “clearly identifiable” journalists. Police officials deny the claims, saying they were responding to violent rioters and anarchist groups that frequently infiltrate French demonstrations to provoke clashes.\nThe respected French newspaper Le Monde obtained and published an audio file recorded by an arrested person that captures police slapping, making sexual remarks, threats and boasts and appears to be in blatant breach of their expected behaviour code.\nWhile most European police forces handle protesting crowds with restraint, letting protesters blow off steam, the French method seems to be one of confrontation — meeting protests with force. And escalation, once that occurs, seems inevitable.\nThere is a common theme, one that has been visible during the pension protests, or during the long-running Gillets Jeune — Yellow Vests — protests over inflation and higher petrol and toll charges.\nIndeed, during the hours before last year’s Champions League football final in Paris between Liverpool and Real Madrid, police used heavy handed and unnecessary rough tactics to subdue what was a peaceful crowd simply trying to enter a stadium.\nAn investigation into that incident found policing to be shameful and their accounts conflicted by what eyewitnesses and camera footage detailed.\nThe official report by the Union of European Football Associations (Uefa) and an investigation by EU officials were highly critical of police actions. For Liverpool fans in particular — a club that has had historic and tragic brushes with poor policing in the UK, Belgium and elsewhere — the police tactics on the night were traumatic.\nThis autumn, France plays host to the Rugby World Cup and, next summer, will welcome the world to the 2024 Olympics — meaning its police and security services will be very much under the microscope.\nUntil French policing is reformed, its long hot summers will continue to simmer.\nRelated Topics:\nUp Next",
  "word_count": 930,
  "scraped_at": "2026-02-14T02:12:52.282846",
  "_text_extracted": true
}