{
  "article_id": "102f84285b78",
  "url": "https://www.90min.com/posts/fpl-double-gameweek-25-salah-saka-lead-captain-debate",
  "title": "FPL Double Gameweek 25 : Salah and Saka lead captain debate",
  "date": "20230223T163000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FPL Double Gameweek 25: Salah and Saka lead captain debate\nBy Holly Shand\nFantasy Football Hub is purpose-built to turn FPL managers into FPL winners. From their industry-leading tools to the experts who reveal their teams every gameweek, it's no surprise tens of thousands of managers gain the edge with the Hub every season. Join the Hub today and, if you don't win your mini-league, you'll get your money back. Terms and Conditions apply.\nAnother Double Gameweek in FPL opens up the captaincy decision once again, with some different faces in the frame for a change.\nIt looks to be a two horse race, so which options should you be considering?\nMohamed Salah vs Crystal Palace (A) & Wolves (H)\nOn paper, Liverpool have the pick of the fixtures for the double, with Mo Salah the most likely of their attacking players to see 180 minutes across the two fixtures. We’ve seen an improvement in form in his recent performances too, with a goal and an assist in his last two games.\nHe also registered a goal and an assist in Liverpool’s Champions League game against Real Madrid this midweek and Salah is also on penalties to further bolster his points potential. Salah has a great record against Crystal Palace, with seven goals and six assists in nine appearances against the Eagles for Liverpool.\n- 25/02/2023 - Crystal Palace vs Liverpool\n- 01/03/2023 - Liverpool vs Wolves\nBukayo Saka vs Leicester (A) & Everton (H)\nWhile going with a Liverpool player for the armband gives the edge when it comes to fixtures, Arsenal provide a greater consistency across the season as a whole, scoring 11 goals in their last six fixtures. Bukayo Saka has been heavily involved, with three goals and two assists.\nCrucially, he has the added bonus of penalties in his locker too to further bolster his score. Over the last five gameweeks, he sits second for shots on goal with 24 and with Arsenal not yet back in Europa League action, rotation risks seem to be minimised by backing the Gunners for captaincy.\n- 25/02/2023 - Leicester City vs Arsenal\n- 01/03/2023 - Arsenal vs Everton\nMartin Odegaard vs Leicester (A) & Everton (H)\nThere will be some managers, myself included, facing Double Gameweek 25 without the two main captaincy protagonists in Salah and Saka. If that’s the case, Martin Odegaard provides a plausible alternative and shouldn’t be overlooked for those managers wanting to back an Arsenal player.\nOdegaard sits fourth for key passes in the last four gameweeks with 15, while he’s also had 15 shots on goal in the same period. As Arsenal’s playmaker, he’s rarely rested or substituted. He netted maximum bonus points last time out against Aston Villa, despite registering just one goal involvement.\n- 25/02/2023 - Leicester City vs Arsenal\n- 01/03/2023 - Arsenal vs Everton",
  "word_count": 474,
  "scraped_at": "2026-02-14T01:46:30.522666",
  "_text_extracted": true
}