{
  "article_id": "104f18950acd",
  "url": "https://news.webindia123.com/news/Articles/Entertainment/20231117/4140340.html",
  "title": "Arjun Kapoor reacts to trolls claiming he faked his height while posing with David Beckham",
  "date": "20231117T050000Z",
  "domain": "news.webindia123.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, February 14, 2026\nNews\nMumbai (Maharashtra) | November 17, 2023 9:52:12 AM IST\nPost the match, on Wednesday night, the football great at actor Sonam Kapoor and Anand Ahuja's residence for a bash where several B-town celebs marked their presence.\nActor Arjun Kapoor, who also attended the bash, on Thursday, posted a string of pictures with Beckham on Instagram.\nhttps://www.instagram.com/p/Czsqb6JIJGP/\nHowever, the actor later faced a lot of criticism for faking his height and looking taller than the football star.\nTaking to his comment section, a meme page asked him to share how that was possible. The actor reacted to the page and wrote, \"I'm actually 183 cms, that's slightly over 6 feet so let's not believe everything that we read.\"\nApart from Arjun, the Wednesday night bash was attended by well-known faces in the entertainment industry including Anil Kapoor, Sanjay Kapoor, Shahid Kapoor, Mira Rajput, Shibani Dandekar, Farhan Akhtar, Karisma Kapoor, Malaika Arora among others.\nBeckham is a UNICEF Goodwill Ambassador. The International Cricket Council has entered into a partnership with UNICEF to empower women and girls and promote inclusion and gender equality through cricket.\nBeckham on the other hand is also considered one of the best footballers of all time. He has represented England at national level and made over 100 appearances for them from 1996-2009. The midfielder also represented iconic football clubs like Manchester United, Real Madrid, AC Milan, Paris Saint Germain and LA Galaxy in his decorated career. With these clubs, he has won prestigious titles like the Premier League, La Liga, Ligue 1 and UEFA Champions League titles. (ANI)\nLATEST COMMENTS ()\nComments Not Available",
  "word_count": 271,
  "scraped_at": "2026-02-14T02:07:27.063611",
  "_text_extracted": true
}