{
  "article_id": "1057eac881a1",
  "url": "https://theathletic.com/5404710/2024/04/10/bayern-munich-champions-league-arsenal/",
  "title": "Humble Bayern Munich show hunger – they need this energy to restore their dominance",
  "date": "20240410T064500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich have rarely looked themselves this season. But on Tuesday night at the Emirates, playing against type was a productive ploy for the soon-to-be deposed German champions.\nThe visitors approached the first leg of the quarter-final against Mikel Arteta’s Champions League novices like outsiders rather than European nobility, happy to contend with only 40 per cent of possession and to bet on counter-attacks with varying degrees of sophistication. Their two goals didn’t arrive courtesy of one of those fine reverse Harry Kane through-balls but from a desperate punt upfield and a brilliant piece of long-distance dribbling by Leroy Sane.\nAdvertisement\nAggressive, dogged and even a little dirty at times, mid-block Bayern rose to the occasion by lowering their aesthetic standards. “We don’t always have to celebrate football,” Thomas Muller, an unused sub, said after the 2-2 draw. “Football is about what happens in the two boxes. How you get there and with how much possession is irrelevant. It’s always good to play with a degree of humility. It helped us to take the game for what it was today.”\nVOTE: Which was the best of the 10 Champions League goals last night?\nYou could observe the respect, perhaps fear even, that sharpened the visitors’ senses for the trip to the best team in the Premier League. Bayern had come prepared to suffer.\nUnlike in countless games this season and last, conceding a goal didn’t result in a total meltdown but a spirited fightback led by the irrepressible Sane, who defied his numerous critics with a performance brimming with commitment and character.\nIt was ironic yet totally fitting for this match that the gifted but sometimes unnervingly inconsequential 28-year-old should set the tone for this determined show from the Bavarians.\n“Leroy had some incredible moments, especially in the first half,” Joshua Kimmich said. “While everyone else defended, he carried the ball up front. He was one of the decisive players, he got us back into the game (after going 1-0 down) straight away.”\nSerge Gnabry, another member of the much-criticised group of Germany internationals, also played a key role by scoring the 1-1 equaliser before leaving the pitch with a hamstring injury in the second half.\nBayern’s rope-a-dope tactics in a big European knockout tie were faintly reminiscent of the way they blocked and tackled their way to a penalty shootout triumph in the 2001 final of the Champions League. But there are more recent echoes as well. Tuchel’s first game in charge in Munich, a 4-2 win over Borussia Dortmund just over a year ago, was notable for the record title holders’ strategic passivity off the ball and reliance on transitions, as was the 3-0 victory over overachieving Stuttgart in December.\nAdvertisement\nThose two wins were the most convincing matches against domestic opposition in the former Chelsea manager’s reign at Allianz Arena, which begs the question why Bayern haven’t been able to make this version of Tuchelball work more often.\nThere are two answers. Firstly, for it to work, you need classy opposition who want to control the game themselves in possession and push Bayern back. There simply aren’t enough teams in the Bundesliga willing or able to play this way. Against Cologne on Saturday, Tuchel’s men will once more have far less space to exploit and their chronic problems in the build-up and final-third combination play will come to the fore again.\nSecondly, any team that wants to survive long spells without the ball needs to be committed to the fight and each other, a cohesive unit of selfless individuals. Bayern, spoilt by more than a decade of mostly unchallenged dominance in the league, have been anything but — in possession and without. Hunger and willingness to stick together have only reliably been on show on European nights when a thrilling sense of real jeopardy pervades.\nWell past midnight, at their Marylebone hotel banquet for the couple of hundred VIPs and sponsors that were allowed to attend despite UEFA’s ban on travelling supporters from Bavaria, CEO Jan-Christian Dreesen praised the team for “showing their true face”.\nIn truth, however, this was an exception, not the norm. Bayern are in with a chance to progress against a better-functioning Arsenal side thanks to showing the basics of “passion, devotion and quality”, as Tuchel put it — the very qualities that have been missing throughout their wretched domestic season.\nRegardless of the outcome of the return leg next week, the team need to rediscover the joys of working hard on more ordinary occasions if their Bundesliga hegemony is to be restored.\n(Top photo: Ian Kington/IKImages/AFP via Getty Images)",
  "word_count": 767,
  "scraped_at": "2026-02-14T01:54:34.171910",
  "_text_extracted": true
}