{
  "article_id": "10679f9fb8e4",
  "url": "https://economictimes.indiatimes.com/news/international/us/ajax-vs-feyenoord-match-halted-after-fans-threw-fireworks-what-next-for-the-teams/articleshow/103912694.cms",
  "title": "Ajax vs Feyenoord : Ajax vs Feyenoord match halted after fans threw fireworks , what next for the teams ? ",
  "date": "20230924T170000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Match Suspended After Firework Chaos\nAjax's home Eredivisie encounter against archrivals Feyenoord took a troubling turn as the match was suspended just 11 minutes into the second half. A section of agitated fans resorted to tossing flares onto the field, endangering player safety. Despite a brief delay, the disruption persisted as flares continued to land on the pitch.The referee, prioritizing player security, had no choice but to suspend the game. \"De Klassieker has been permanently suspended after repeated fireworks on the field,\" Eredivisie stated in a released statement, promising further information regarding the game's continuation.\nThe Ajax - Feyenoord match was stopped once again due to torches thrown onto the field. #ajafey pic.twitter.com/5kXL3iLDjs\n— Dutch Leagues #Eredivisie 🇳🇱🇹🇷 (@DutchLeagues) September 24, 2023\nDiscontent Brews Among Ajax Fans\nThe Ajax faithful expressed their frustration as their team, which has had a challenging start to the season with just one win, trailed 3-0 in the first half. The club finished third in the previous season, missing out on Champions League qualification for the first time in 13 years, ending a run of seven championships and five runners-up finishes in the past 12 seasons.Dutch Football's Struggle with Fan Behavior\nSunday's abandoned derby match joins a growing list of disrupted fixtures in Dutch football, which has grappled with fan misconduct in recent years. The Dutch football federation (KNVB) implemented a rule mandating a 10-minute suspension if objects are thrown onto the field by fans. Subsequent object-related incidents lead to match abandonment.Government Response to Fan Misconduct\nDilan Yesilgöz-Zegerius, the Dutch Justice Minister, expressed her disappointment on social media, saying, \"This no longer has anything to do with football and being a supporter. You play with the safety of the players, fellow supporters, and yourself. Shame on you!\"Scoreboard and Match Details\nFeyenoord dominated the match, securing a commanding 3-0 lead. Santiago Gimenez netted a brace, while Igor Paixao added another goal before half-time. The match's suspension was instigated by disgruntled supporters, who resorted to disruptive actions.Consequences Await Ajax and Investigation Ensues\nAjax may face repercussions from Dutch football authorities for failing to control fan behavior. The KNVB will determine the severity of punishments to be imposed. Questions will also be raised regarding how a group of hooligans managed to storm the stadium entrance, leading to the deployment of riot police and tear gas.What Lies Ahead for Ajax?\nThe Amsterdam giants found themselves in the 13th spot in the Eredivisie table, having had a lackluster start to the 2023-24 campaign with just five points. Meanwhile, reigning champions Feyenoord continue to chase PSV at the top of the division. The future for Ajax remains uncertain as the fallout from this chaotic encounter unfolds.\nFAQs\nWhat happened at Ajax vs Feyenoord?\nAt one point, the match had to be halted as various objects were thrown from the stands, creating a dangerous situation for the players' safety. After a brief pause, an attempt was made to resume the game. However, the need for a second suspension arose as flares continued to land on the playing surface.Who is Feyenoord's biggest rival?\nDe Klassieker, also known as \"The Classic,\" is the premier football rivalry in the Netherlands, featuring Ajax from Amsterdam and Feyenoord from Rotterdam. The highest recorded attendance for this iconic match occurred on January 9, 1966, when a crowd of 65,562 spectators gathered in Rotterdam. This historic event is often referenced as the 1937 Klassieker.(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 630,
  "scraped_at": "2026-02-14T01:48:28.233520",
  "_text_extracted": true
}