{
  "article_id": "10c671dca34b",
  "url": "https://theathletic.com/4407519/2023/04/13/real-madrid-carlo-ancelotti-chelsea-champions-league/",
  "title": "As Real Madrid impress again , Carlo Ancelotti is the big winner , at a critical time",
  "date": "20230413T080000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Carlo Ancelotti started and ended Wednesday’s Champions League quarter-final first leg in the same way: hugging Frank Lampard. In between he experienced a night to remember, one that strengthens him at an important juncture.\nLampard summed up his respect for Ancelotti after the match. Accompanied by members of his Chelsea side on the way back to their team bus, the Englishman stopped to answer a question from The Athletic: do you understand why he has been criticised so much?\nAdvertisement\n“No. I didn’t even know he was being criticised. He’s the man,” Lampard said, raising his hand as if illustrating a summit.\nIn April last year, Ancelotti became the first coach to win all five of Europe’s top leagues. In May, he became the first manager to win four Champions League titles. After beating Celtic in November, he became the manager with the most wins in Champions League history, with 103.\nBut even if Lampard did not know it, Ancelotti lives among critics. That’s why, on Tuesday, in the pre-match press conference, the Italian raised his eyebrow a little more than usual, as he co-ordinated a memorable scene.\nIt came after what everyone took to be the end. Ancelotti had answered a final question and it looked like he was done, so Juan Camilo Andrade from Real Madrid’s communication department signalled a close to the media session and thanked everyone in the room. The coach asked him not to be so quick. He had a point to make.\n“Wait! Everyone recognises that I am fantastic at management, but then there are other things,” Ancelotti said. “This team is well worked. If we are lucky enough to win the Copa del Rey, this team will have won all the trophies in two seasons, and sometimes there are teams that don’t win them in a lifetime.”\nWednesday’s 2-0 victory over Chelsea, a result that puts Madrid on track to reach the Champions League semi-finals for the 11th time in 13 seasons, gave further strength to that message, which was addressed directly to his critics. According to some reports in Spain, Ancelotti had on Tuesday morning heard himself labelled, in a debate on Radio Marca, a “mere manager”.\nThe “mere manager” has now accumulated two major successes in one week. Last Wednesday, he was exalted at the Camp Nou — not just because of the 4-0 scoreline, but also thanks to the manner of victory over Barcelona to reach the Copa del Rey final. It was achieved by sticking to his ideals, with Luka Modric and Toni Kroos starting in midfield and Eduardo Camavinga at left-back.\nAdvertisement\nNone of these choices, according to different reports in Spanish media, please club president Florentino Perez, who wants new blood in the team and considers it a waste to play the Frenchman in the defensive line. But with Ancelotti’s plan, Madrid overcame Chelsea, too, celebrating another great European night.\nGO DEEPER\nHow Ronaldo and Kaka are helping Brazil pursue Carlo Ancelotti\nThe Real Madrid dressing room is considered among the most difficult to manage in the world, and a characteristic often observed among elite footballers is selfishness, at times driven by the instinct to survive in a world that features so much pressure and criticism. But it seems Ancelotti’s players are a degree more motivated to win if it means that their coach will stay. You saw it again on Wednesday.\n35 – Carlo #Ancelotti has won 35 Champions League games with Real Madrid (in 47 matches), more than any other manager with the club in the competition. Authority.#RealChelsea pic.twitter.com/pxUR4MR3Bj\n— OptaPaolo (@OptaPaolo) April 12, 2023\nThe players are delighted with Ancelotti. They value his experience and his knowledge. On Monday, in an interview in Marca, Antonio Rudiger called for him to continue. On Tuesday, in the pre-match press conference, David Alaba did the same. On Wednesday, Vinicius Junior praised him in the mixed zone. “If I prefer to be coached by him here or in Brazil? Hopefully in both places,” he said, laughing.\nVinicius Jr, who contributed two assists and was named player of the match against Chelsea, owes him a lot. In one of his first meetings with Real Madrid in June 2021, Ancelotti told the club that he was counting on the Brazilian and that he had complete faith in him.\nMarco Asensio, scorer of Madrid’s second goal and edging closer to renewing his contract, knows that his coach has spoken several times in his favour with the board.\nAdvertisement\nDani Ceballos, who is living his best moment as an elite footballer, has also received the affection of Ancelotti, who wants him to stay.\nBut not everything is rosy. Ancelotti knows there is an unwritten law that says that to stay at Real Madrid it is necessary to win a major title. He himself was sacked in 2015 after winning the Copa del Rey and Champions League the season before. The Italian’s contract runs until the summer of 2024.\nThere are doubts revolving around the club, and there are doubts around Ancelotti, too. The Brazilian Football Association, with help through Ronaldo and Kaka, has been making its interest in making him national team manager him well known.\nAfter the work of the intermediaries, the idea is that there will be no direct talks until after the Champions League campaign. Brazil want to show respect to Real Madrid as much as possible and know that Ancelotti’s priority is to stay, but they are prepared in case the scenario turns out in their favour, because they also know that the Italian finds the prospect appealing.\nHistory says that, at times, winning the Copa del Rey has been enough for an under-pressure manager to survive at Madrid, but it is not a total guarantee. They play Osasuna in the final on May 6. The Champions League semi-final first legs take place the following midweek and, although Ancelotti is taking nothing for granted, their opponent would likely be Manchester City. A bad result could still be definitive, despite whatever might come before.\nBut on Wednesday in the Santiago Bernabeu, with Madrid leading 1-0 in the 66th minute, supporters chanted Ancelotti’s name, a gesture that is not so common and which the coach thanked by waving his hand.\nThe chant was repeated in stoppage time. When the ball bounced towards the edge of his technical area, Ancelotti controlled it with a deft right foot before juggling skilfully and returning it into play. The crowd celebrated and shouted his name, while David Alaba went to embrace him.\nIf it were up to popular judgement, there would be no doubt.\n(Top photo: Diego Souto/Quality Sport Images/Getty Images)",
  "word_count": 1107,
  "scraped_at": "2026-02-14T02:24:37.523245",
  "_text_extracted": true
}