{
  "article_id": "10ce24cb0403",
  "url": "https://www.thesouthafrican.com/news/kaizer-chiefs-target-santos-resigns-from-petro-is-he-heading-to-naturena/",
  "title": "Kaizer Chiefs target Santos resigns from Petro ; Is he heading to Naturena ? ",
  "date": "20240601T111500Z",
  "domain": "thesouthafrican.com",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kaizer Chiefs target Santos resigns from Petro; Is he heading to Naturena?\nAlexandre Santos is on pole position to take over as Kaizer Chiefs coach. The Portuguese coach recently left Petro Atletico.\nKaizer Chiefs target Alexandre Santos has left his post as Petro Atletico coach amid reports linking him to Amakhosi.\nThe Portuguese coach clinched his third successive Girabola league title with Petro before leaving the Angolan giants. Santos has become a free agent and is currently in pole position to take over as the new Chiefs coach. The Soweto giants were also linked with South African coach Pitso Mosimane for months.\nWith Santos having left Petro, Kaizer Chiefs might be the next destination for the 47-year-old coach. This week, Petro Atletico stated the departure of Santos.\n“Petro Atletico announce the end of the contractual relationship with professional football coach Alexandre Santos, at the end of the current sporting season, having been the coach’s own decision, for professional reasons,” Petro Atletico said in a statement.\n“During the period in which he was in charge of the Tricolor team, Alexandre Santos demonstrated exemplary commitment and tireless dedication.\nSantos leaves Petro, with Kaizer Chiefs likely to be his next destination\n“Under his leadership, Petro de Luanda experienced three memorable seasons, marked by notable sporting successes,” the statement continued.\n“It is with pride that we recognise the achievements achieved during this period, highlighting the third Girabola championship, two Angola Cups, a Super Cup and consecutive presence in the group stage of the African Champions League, in which they reached the semi-finals in the 2021/2022 season and the final quarters in the current season.\nAmakhosi’s next potential coach leaves Petro, might be heading to Naturena\n“We would like to express our gratitude to Alexandre Santos for his professionalism, leadership and contribution to the growth and success of our club,” the club added.\nAccording to some reports, Kaizer Chiefs might announce Petro as their new coach in the coming weeks. It remains to be seen if the Portuguese mentor will head to Naturena. Amakhosi finished 10th in the 2023/24 DStv Premiership under Cavin Johnson, who has since left his role as coach.",
  "word_count": 357,
  "scraped_at": "2026-02-14T02:10:54.441055",
  "_text_extracted": true
}