{
  "article_id": "10df8bf59f59",
  "url": "https://www.theboltonnews.co.uk/news/24247383.foreign-office-issues-terrorist-warning-uk-travellers/",
  "title": "Foreign Office issues terrorist warning to united kingdom travellers",
  "date": "20240411T153000Z",
  "domain": "theboltonnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UK Foreign Office has warned that \"terrorists are very likely to try to carry out attacks in France\" ahead of the holiday season and Olympics.\nJust this week, security was \"considerably reinforced\" at Wednesday's Champions League football match in the French capital between Paris Saint-Germain and Barcelona after a \"threat\" from the Islamic State group.\nFresh security fears over the Paris Olympics were raised last month following the Moscow concert hall attack - claimed by Islamic State - in which at least 140 people were killed.\nOne of the biggest security challenges facing the organisers of the Games in the French capital is to protect the opening ceremony on July 26.\nShould the Foreign Office be abolished?\n— BBC Radio 4 Today (@BBCr4today) April 8, 2024\nMoazzam Malik, its former director general, is among a group of senior diplomats and officials calling for the FCO to be replaced by a new Department for International Affairs with 'fewer colonial era pictures on the wall'.#R4Today\nIt is planned to be an unprecedented, open-air extravaganza, with an estimated 222,000 people viewing along the Seine river’s edge and 200,000 more watching from buildings.\nThe official Government website states: \"There is a high threat of terrorist attack globally affecting UK interests and British nationals, including from groups and individuals who view the UK and British nationals as targets. You should remain vigilant at all times.\"\nTerrorism attacks could be indiscriminate, including in places frequented by foreign nationals such as:\n- shopping centres\n- entertainment establishments\n- cultural events\n- public transport\n- places of worship\nMethods of attack have included knife attacks, shootings, bombings and vehicle attacks. Be vigilant in public places and follow the advice of local French authorities.\nThere have been several recent high-profile terrorist attacks in France, including:\n- in 2023, one person was killed in a knife and hammer attack in central Paris\n- in 2023, a teacher was killed in a knife attack in a school in Arras\nRecommended reading:\nTerrorist cell linked to Moscow concert hall attack ‘broken up’\nDeath toll in Moscow concert hall attack rises to 143\nForeign diplomats lay flowers at site of Moscow concert hall attack\nCrime in France\nProtecting your belongings\nTake sensible precautions against street and car crime. Pickpockets can work in gangs; one distracts you while the other one goes into your bag. Don’t leave your passport or other valuable items alone in vehicles.\nThieves and pickpockets operate on the Paris underground, RER lines and at mainline stations. Make sure you:\n- don’t keep your passport, credit cards and other valuables in the same place\n- use the inside compartments in bags where possible\n- carry your bag across your body rather than on your shoulder\n- keep your belongings close to you in restaurants and bars\n- aren’t distracted around tourist attractions and cash points\nIf your passport is lost or stolen, it is advisable to report this to the police and obtain a police report.\nAssaults in France\nThere have been several cases of serious assault on the RER (train) line B, which serves:\n- Paris Charles de Gaulle airport\n- Orly airports\n- Paris Gare du Nord Eurostar terminus\nThere have also been serious assaults on RER line D, which serves the Stade de France.",
  "word_count": 547,
  "scraped_at": "2026-02-14T01:48:46.197883",
  "_text_extracted": true
}