{
  "article_id": "10e8c6a10291",
  "url": "https://www.meathchronicle.ie/2023/12/12/ac-milans-stefano-pioli-says-he-had-no-idea-sandro-tonali-had-gambling-problem/",
  "title": "AC Milan Stefano Pioli says he had no idea Sandro Tonali had gambling problem",
  "date": "20231213T030000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AC Milan’s Stefano Pioli says he had no idea Sandro Tonali had gambling problem\nBy Damian Spellman, PA\nAC Milan boss Stefano Pioli has insisted he had no idea Sandro Tonali had a gambling problem before he was sold to Champions League opponents Newcastle.\nThe 23-year-old Italy international joined the Magpies in a £55million summer switch from Milan and played in a 0-0 draw against his former club in their Champions League Group F opener at San Siro in September.\nHowever, he is now serving a 10-month ban for breaches of betting regulations during his time in Italy, robbing the Tyneside club of a key man for the remainder of this season.\nAsked if he knew about Tonali’s problem when he was sold, Pioli said at his press conference at St James’ Park on Tuesday evening: “No, I didn’t know anything about Sandro’s problem.\n“He was very polite, respected and respectful to others, he was a very sensible boy.\n“Even if I feel I have an open relationship with the players, I only talk to them about football. What they do outside, I don’t know everything about them.”\nAsked further if he backed the player to get through his current difficulties, Pioli added: “Absolutely, yes. His football quality and tactical quality, technical, physical quality, there’s no doubt about him. He’s a great player.\n“We’re close to Sandro. When he was with us, he was a really cheerful, positive young man, close to the team, popular, very important to the team’s rise, applied himself, worked hard, very willing to help the team.\n“Unfortunately, he fell into a delicate situation. We’re with him, we’re close to him and we hope this experience will teach him and help him be better in the future.”\nTonali’s suspension came just 12 games into his Newcastle career, but Pioli is confident the Premier League club will reap the rewards of their investment.\nHe said: “At the moment they signed him, it was a good deal, they signed a very good player. Then what happened afterwards, no-one could have expected it.”\nIf Tonali’s departure left a significant gap in Milan, another was plugged this week when it was announced that former striker Zlatan Ibrahimovic had returned to the club as a “senior adviser”.\nAsked for his reaction, Pioli said: “Zlatan is taking the next step of his career. He’s always been a top character, a top player. He’s faced every challenge with determination, with intelligence and this is a new challenge for him and he’ll show the same personality, the same characteristics to do everything to help the club.”\nBoth sides head into Wednesday night’s game able to finish second, third or fourth in the group, but neither have their fate in their own hands with victory a must if they are to stand any chance of making the last 16.\nPioli said: “We’ve got one objective, we’ve only got one chance – win the match.\n“I know the team will do everything they can to win the game. I know what’s awaiting us, I know what kind of team they are, I know what kind of stadium it is, but our team will do everything we can to come through this big, big challenge.”",
  "word_count": 538,
  "scraped_at": "2026-02-14T02:25:08.293008",
  "_text_extracted": true
}