{
  "article_id": "111621610c13",
  "url": "https://www.90min.com/posts/jude-bellingham-confident-message-barcelona-first-el-clasico",
  "title": "Jude Bellingham sends confident message to Barcelona ahead of first El Clasico",
  "date": "20231028T113000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jude Bellingham sends confident message to Barcelona ahead of first El Clasico\n- Bellingham has shrugged off injury concern to feature against Barcelona\n- The 20-year-old has enjoyed magnificent start to Real Madrid career\n- England international speaks of looking forward to playing Madrid's biggest rivals\nJude Bellingham says he's ready to take on Barcelona in El Clasico and isn't nervous about playing in the biggest game in world football.\nThe 20-year-old has made a breathtaking start to life at Real Madrid, reaffirming his status as one of the best midfielders in the game today.\nBellingham's statistics are hugely impressive - he has scored 11 goals in all competitions in just 12 games and contributed three assists - but his aura and presence in Carlo Ancelotti's side is what has struck the biggest chord.\nThe dominant nature of Bellingham's performances has seen his name splashed across every major newspaper and website this season, and that continued in midweek when he scored the winning goal for Madrid in their 2-1 win over Braga in the Champions League.\nBut rather than focusing on Bellingham's goal exploits, it was concern over a potential injury that had the world talking. The good news for Madrid, and the Birmingham City academy graduate, is that the niggle he picked is not serious, and he'll be ready to take on Xavi's Barcelona in the first Clasico of the season.\nWith the world watching, some may expect Bellingham to be nervous to take on Madrid's biggest adversaries. But speaking to RTVE, he sent a bold, confident message to Barcelona about how much he relishes playing on the big stage.\n\"I'm really excited,\" Bellingham said, adding whether he has any nerves: \"No, not really. I've played a lot of high-pressure games. Maybe not one of this magnitude. I can't wait to see what the atmosphere will be like... If you can't get motivated for a game like this, where else would you rather be as a football player?\"\n\"I'm ready. I had a little tweak in the last game in the Champions League but I'm feeling good and hopefully I'll be out there and hopefully we get a good result... I just had a bit of fatigue, I've played a lot of games so far this season already.\"\nBellingham recalled his memories of watching El Clasico when he was growing up, adding that the fixture's most iconic moments are something he remembers to this day.\n\"I definitely loved the games as a kid and I always tuned in,\" he remarked. \"No matter how late it was, even when my mum was telling me to get to bed, I'd always stay up until I got the last minute of every Clasico.. I remember celebrations and stuff like that, I remember [Cristiano] Ronaldo at Camp Nou [with his] 'calma' [celebration after scoring in April 2012].\n\"It sticks with you in your head, the iconic moments, the good, the bad, sometimes the ugly side of it as well, you always remember everything. There've been so many classic games, so many magic moments.\"",
  "word_count": 510,
  "scraped_at": "2026-02-14T01:51:09.220351",
  "_text_extracted": true
}