{
  "article_id": "111ab41a8c22",
  "url": "https://www.bbc.co.uk/sport/football/65178168",
  "title": "European Super League : Supporters of breakaway  like wolf in Little Red Riding Hood  ",
  "date": "20230405T130000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "European Super League: Supporters of breakaway 'like wolf in Little Red Riding Hood'\n- Published\nUefa president Aleksander Ceferin has criticised supporters of the European Super League and compared them to the wolf in Little Red Riding Hood.\nJuventus, Real Madrid and Barcelona are still keen to push ahead with amended plans for the project.\nIn December, Uefa and Fifa were backed by the European Courts of Justice in their bid to block the creation of a European Super League.\n\"It's a good job nobody has ever died of shame,\" said Ceferin.\nA final judgement is still to come next spring from the European Courts of Justice over a challenge to Uefa's perceived monopoly position.\nBut the courts' advocate general Athanasios Rantos said at the end of last year that the rules of football's European and world governing bodies were \"compatible with EU competition law\".\nThe case was tabled by the European Super League and its supporters A22 Sports Management, who backed a 12-club proposal in 2021 that failed to materialise as a result of protests.\n\"Those who promote this project are now claiming that they want to save football. In the space of a few months, the Super League has turned into a character in Little Red Riding Hood: a wolf disguised as a grandmother, ready to eat you up,\" Ceferin told the Uefa Congress in Lisbon.\n\"But nobody's fooled. Because here we have two opposing world views.\n\"We have cynicism over morality. We have selfishness over solidarity. We have greed over benevolence. Self-absorption over openness to others. Self-interest over altruism. Shameful lies over the truth. Heirs over builders. Cartel over meritocracy and democracy. Stock prices over sporting merit. The quest for profit over the quest for trophies.\"\nAt the meeting, Ceferin was re-elected as Uefa president unopposed for a third term and will now remain in the role until 2027.\nPremier League critics are 'jealous'\nCeferin also defended the Premier League, despite some viewing it as being in the vanguard of precisely the aspects of the European Super League he attacked.\n\"Jealousy sees everything except the truth,\" he said.\n\"Since the British government, supporters and clubs said no to the Super League, the Premier League has been demonised and labelled a Super League in its own right that needs to be toppled.\n\"However, the Premier League's success was not achieved by accident. By adopting an audacious approach based on a vision, a strategy and a lot of hard work, its leaders and clubs developed a remarkable model founded on sporting merit, one of the most egalitarian systems in the world.\n\"Rather than a model to be destroyed, this is a model that should be followed.\"\n'Understand mistakes and don't repeat them'\nDuring his address Ceferin did not specifically mention Uefa's widely criticised handling of last season's Champions League final or its initial attempts to blame fans for the problems.\nHowever, it seemed to be the chaos in Paris to which he was referring when he admitted that all leaders make mistakes.\nUefa announced in March it was to refund Liverpool fans who had tickets for the match.\nIt followed an independent report that found Uefa bears primary responsibility for the chaotic scenes before the game against Real Madrid.\nFans were penned in and sprayed with tear gas outside the Stade de France in Paris as kick-off was delayed by 36 minutes.\n\"No leader can boast an unblemished record,\" he said.\n\"There are always a few stains and mistakes that tarnish our reputation and errors they would love to erase.\n\"I am no different and Uefa is no different. The most important thing is to understand the mistake, change and not repeat them.\"\nFrom party tricks to questionable medicinal claims: Find out how electricity has developed over the centuries\n'The shorter your sleep, the shorter your life': Joe Wicks learns why sleep is fundamental to our health",
  "word_count": 648,
  "scraped_at": "2026-02-14T01:48:06.471174",
  "_text_extracted": true
}