{
  "article_id": "1127e44a4743",
  "url": "https://thechronicle.com.gh/todays-uefa-europa-conference-league-fixtures-preview/",
  "title": "Today UEFA Europa & Conference League Fixtures & Preview - The Ghanaian Chronicle",
  "date": "20250417T053000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United, Lyon lock horns in Europa second leg\nA week on from their action-packed 2-2 first-leg draw in France, Manchester United and Lyon lock horns once again in the second leg of their Europa League quarter-final at Old Trafford on Thursday night.\nThe winners of this contest on aggregate will take on either Rangers or Athletic Bilbao in the semi-finals at the beginning of May.\nAfter being embroiled in a war of words with Nemanja Matic in the build-up to last week’s first leg, Andre Onana did little to hit back at claims of being one of the worst goalkeepers in Man United’s history, as he was at fault for two goals that helped Lyon rescue a last-gasp draw on home soil.\nMan United’s fortunes did not improve last weekend as they were condemned to a heavy 4-1 away defeat to Newcastle United in the Premier League following another error-strewn performance – their 14th loss of the league campaign which has confirmed the club will finish with their lowest points total of the PL era.\nLanguishing in 14th place with only 38 points after 32 games, Man United are in danger of ending the season as low as 17th, while European qualification via the Premier League is an unrealistic target for the Red Devils as they sit 10 points behind the top eight as well as 17 points behind the top five.\nAware that Europa League glory would seal Champions League qualification for next season, it is simply win or bust for Man United on Thursday.\nMan United should throw everything at Thursday’s second leg in front of a fired-up Old Trafford crowd and can treat this fixture as a final, considering the sheer enormity and importance of it to their season.\nCredit: sportsmole.co.uk\nFrankfurt and Tottenham faceoff in return leg\nEintracht Frankfurt and Tottenham Hotspur lock horns again for the return leg of their Europa League quarter-final tie at Deutsche Bank-Park on Thursday night.\nThe sides are level at 1-1 after the first leg in North London last midweek, but the pressure is much stronger on Spurs boss Ange Postecoglou, who needs success in this competition if he is to save his job.\nFrankfurt built on a morale-boosting 3-0 win over Heidenheim at the weekend, serving as the perfect preparation for the visit of Tottenham this midweek.\nThat marked a third straight home win for Frankfurt at home, and moved them five points clear inside the Bundesliga’s top four, with Champions League football now looking a near-certainty, even if they do not win this competition.\nFrankfurt enter the second leg as favourites to advance to a third Europa League semi-final, which could make them just the third team to achieve that feat, after Sevilla and Manchester United.\nHistory does not bode well for Spurs entering this fixture, because they have lost on six of their last seven trips to Germany in the knockout stages of a European competition, failing to score in four of the last five.\nSpurs have been dismal on the road both domestically and in Europe of late, and missed the chance to take an advantage into this return leg, so the odds are certainly stacked against them on an evening which could seal Postecoglou’s fate.\nCredit: sportsmole.co.uk\nChelsea has huge advantage against Legia Warszawa\nChelsea take a huge advantage into the second leg of their Conference League quarter-final versus Legia Warsaw at Stamford Bridge on Thursday night.\nEnzo Maresca‘s side lead 3-0 following their trip to the Polish capital last week, further solidifying their tag as huge favourites to win this competition next month.\nAn utterly dominant display in Warsaw last Thursday means Chelsea are virtually assured of their place in the semi-finals, barring the most extraordinary comeback in UEFA-competition history.\nChelsea are 15 from 15 when it comes to progressing in Europe after winning the first leg away from home, and this will be one of the most comfortable leads they have had in any of those previous ties.\nReaching the semi-finals is unlikely to bring harmony to the fanbase though, with the Chelsea faithful beginning to turn against Maresca and his style of play, especially after the 2-2 draw at home to Ipswich Town on Sunday.\nChampions League qualification is slipping through their fingers, and success in the Conference League will only grant them a spot in the Europa League, a potentially huge failure given the money that has been spent at the club over the last few years.\nWith Legia already down and out, Chelsea’s kids should be given an opportunity to prove themselves in the first team, and that could encourage a positive performance, which may result in another handsome victory for Maresca’s side.\nCredit: sportsmole.co.uk\nLazio looking for a big turnaround against Bodø/Glim\nLazio will be looking for a big turnaround when they welcome Norwegian side Bodo/Glimt to the Stadio Olimpico in the second leg of their Europa League quarter-final on Thursday night.\nThe visitors stand on the brink of history after a 2-0 win in the first leg, as they could become the first club from Norway to reach the semi-finals of a European competition if they are able to dump out the league phase winners.\nAt a venue where numerous European giants have struggled in recent years up in the Arctic Circle, notably Lazio’s bitter rivals Roma, who lost 6-1 there in 2021, Marco Baroni‘s men were the next victims to suffer defeat at Aspmyra last Thursday.\nUlrik Saltnes‘s second-half brace means Bodo/Glimt take a two-goal advantage to the Italian capital, and that does not bode well for Lazio, because history suggests they will struggle to overturn the deficit.\nWhat is even more concerning is that in Lazio’s history, they have never overturned a two-goal first-leg deficit on the continent, but they are well placed to create history.\nBodo/Glimt’s recent fairytale rise in European competition has been down to their sensational home form, but they are notoriously poor travellers in comparison.\nThe visitors have never won in Italy, losing on five of their six visits, and the last of those was also at the Olimpico, when Roma thrashed them 4-0 in the Conference League in 2022.\nCredit: sportsmole.co.uk\nFIXTURES\nEuropa League\nEintracht Frankfurt 20:00 Tottenham",
  "word_count": 1038,
  "scraped_at": "2026-02-14T02:20:59.029684",
  "_text_extracted": true
}