{
  "article_id": "11461ce31a1d",
  "url": "https://metro.co.uk/2025/12/28/thomas-frank-urged-resign-former-spurs-star-slams-shambles-25875764/",
  "title": "Thomas Frank urged to resign as former Spurs star slams  shambles  ",
  "date": "20251228T123000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thomas Frank has been urged to resign as Tottenham manager with the club in ‘shambles,’ according to former Spurs defender Ramon Vega.\nTottenham are 14th in the Premier League after back-to-back defeats and are back in action on Sunday against Crystal Palace as they look to arrest their slide down the table.\nAfter an encouraging start to his first season in charge in north London, Frank is struggling for results and there is unrest among the supporters.\nThe Dane has been keen to point out that Spurs finished 17th in the top flight last season, so he is hardly taking over from a position of strength, despite their return to the Champions League via winning the Europa League.\nSpeaking to Sky Sports, he said: ‘Honestly, I think we are in a transition phase, because yes, we are a Champions League club, but are we a Champions League club? We only qualified because we won the Europa League.\n‘We didn’t qualify because we were one of the four or five best clubs in the Premier League last season. We finished 17th. And now we need to compete in the Champions League while we’re competing in the Premier League, which is the most difficult thing.’\nVega, who played for Spurs from 1997-2001 and won the League Cup in 1999, is completely unconvinced by Frank and feels he should be already stepping aside as he is not buying his excuse for poor results.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Frank, stop talking about last season,’ the former Switzerland international posted on X. ‘They finished 17th. You now have more fit players than Ange [Postecoglou] had last season, yet you’re still not better off. In fact, it’s a shambles.\n‘At least Ange with no support made a miserable season into a wonderful ending for the fans by winning the European Cup and qualifying for the CL. You are now enjoying. So please do us a favour and resign, mate!’\nIt is not the first time this season that Vega has been critical of Frank, telling talkSPORT that he does not believe the Dane has the character to handle the dressing room of a big club.\nSpurs under Thomas Frank\nPremier League\nP:17 W:6 D:4 L:7\nCarabao Cup\nP:2 W:1 L:1\nChampions League\nP:6 W:3 D:2 L:1\nUEFA Super Cup\nP:1 D:1\n‘He needs to manage the dressing room. Here the football is a psychological side,’ he said. ‘If he doesn’t control he dressing room. He can be as good as he wants, as nice as he is. But he doesn’t have the balls.\n‘I don’t see Frank pretty much suitable for Spurs because he hasn’t got the balls, hasn’t got the character to do this.’\nWho could replace Frank?\nVega had an idea for who could replace Frank and it is a familiar face at Tottenham, former Spurs striker Robbie Keane, who is currently in charge of Hungarian side Ferencvaros.\n‘Now, the question is, who’s going to potentially be good for this?’ Vega said.\nMore Trending\n‘I have a suggestion. Robbie Keane. He’s done very well and has just beat Rangers [in the Europa League earlier this month].’\nKeane has taken a unique path in management so far, starting as player manager at Indian side ATK in 2018.\nHe has held assistant roles with Republic of Ireland, Middlesbrough and Leeds before stints in charge of Maccabi Tel Aviv and now Ferencvaros since January.\nMORE: Arsenal star could have won club the title against Brighton, says Paul Merson\nMORE: Chelsea to conduct investigation into Aston Villa dugout incident\nMORE: Ian Wright concerned with Arsenal ‘problem’ after Brighton win",
  "word_count": 651,
  "scraped_at": "2026-02-14T01:59:31.510587",
  "_text_extracted": true
}