{
  "article_id": "11509c840207",
  "url": "https://www.teamtalk.com/manchester-united/fight-cristiano-ronaldo-al-nassr-man-utd-bundesliga-star-huge-contract-decision",
  "title": "Man Utd fight Cristiano Ronaldo Al Nassr for 157 - goal Bundesliga star after monumental contract decision leaked",
  "date": "20230219T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd fight Cristiano Ronaldo’s Al Nassr for 157-goal Bundesliga star after monumental contract decision leaked\nManchester United are preparing to battle Cristiano Ronaldo’s club Al Nassr for the signing of a high-quality German Bundesliga player after he opted to leave his current side, according to reports.\nRonaldo returned to Old Trafford for a second spell in August 2021 when Man Utd paid Juventus an initial £12.9million for him. The striker enjoyed a fantastic first season back in Manchester, scoring 24 times in 38 appearances.\nHowever, Ronaldo’s place in the Man Utd starting lineup came under threat when the Red Devils appointed Erik ten Hag as manager.\nRonaldo’s game time gradually decreased and in response he conducted a sensational interview where he criticised Ten Hag, some of his team-mates and the Man Utd board.\nThe Portuguese legend has since gone on to join Saudi Arabian outfit Al Nassr. He has played five times for them, registering five goals and two assists so far.\nAnd Ronaldo could end up playing with a top Man Utd transfer target in the form of Borussia Dortmund’s Marco Reus. According to CaughtOffside, who cite reports emerging from Spain, Man Utd are ready to pounce after Reus made a big decision on his future.\nThe attacking midfielder has opted against signing a contract extension with Dortmund. He will therefore leave the German side as a free agent once his contract expires in June. This is a big decision as he is an icon at Dortmund and has played there since 2012.\nMan Utd are ‘monitoring’ Reus and could soon submit a contract offer. Under the Bosman ruling, the Dortmund skipper has been free to negotiate a contract with foreign clubs since January 1.\nMarco Reus would bring plenty of goals to Man Utd\nReus would be a fantastic addition for Ten Hag. He is one of the best creators in Germany, having set up 118 goals in 372 matches for Dortmund. Reus also gets among the goals himself, having scored 157 times in a Dortmund shirt.\nReus boasts plenty of Champions League and international experience. He would also bring leadership to the Man Utd dressing room, having captained Dortmund since the 2018-19 campaign.\nTo get Man Utd supporters even more excited, Ten Hag has already made contact over Reus’ potential signing. In January, Bild journalist Christian Falk revealed how the manager had held a secret meeting with Reus’ agent, Dirk Hebel.\nREAD MORE: Man Utd star relishing unthinkable Ten Hag tactic most managers wouldn’t even consider\nBut Man Utd do not have a straight road to the 33-year-old’s signature. The report claims Al Nassr are also keeping tabs on Reus. They could send him a lucrative contract offer to lure him to the Middle East.\nAl Nassr boss Rudi Garcia would love to play Reus behind Ronaldo to set up a deadly attack. And Al Nassr have plenty of money to match Reus’ wage demands, as they pay Ronaldo an eye-watering £1.2m a week. That is just his football wage, as he will earn up to £3.6m in total per week thanks to his other ventures while playing in Saudi Arabia.\nReus must now decide what his priorities are for the final few years of his career. At 33, he could go to Al Nassr for one last big pay day prior to retirement.\nMore likely, though, the playmaker will prioritise a switch to Man Utd. This will allow him to continue playing at a high level. He will also get the chance to play in the Premier League, something he has never done previously.\nPlus, Man Utd can offer Reus a good wage themselves. It will not be as much as Ronaldo’s colossal earnings, but it should still be above the £100k-a-week mark.",
  "word_count": 634,
  "scraped_at": "2026-02-14T01:36:59.937134",
  "_text_extracted": true
}