{
  "article_id": "116b716e4942",
  "url": "https://www.90min.com/posts/tottenham-hotspur-who-is-to-blame",
  "title": "Tottenham Hotspur : Who is to blame ? ",
  "date": "20230327T023000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur: Who is to blame?\nBy Sean Walsh\nHere at 90min towers, we've realised that there is always at least one Premier League club in relative crisis at any given time. In tribute, they are christened as the 'crisis club of the week'.\nBut Tottenham Hotspur have crossed a line. You can't keep continuously wrestling back the championship belt (you know, proverbially - we all know about the trophy drought). There must be a price to pay.\nAs such, we've had to dust off the old 'who is to blame?' gimmick instead. So, who really is to blame for Spurs' current distress?\n35. Chirpy the cockerel\nBlame rating: 0.1/10\nLook at him. That big smile. Those big shoes. Those big wings.\nHe is everything wrong with Tottenham Hotspur.\n34. Lily the cockerel\nBlame rating: 0.2/10\nWhat's worse than one big giant cockerel?\nTWO big giant cockerels.\n33. Mario Balotelli\nBlame rating: 0.5/10\nIt's time to hop in the time machine. It's time for some domino-effect interrogating.\nMidway through the 2011/12 season, Tottenham had separated themselves from the top-four chasing pack and were within touching distance of Premier League title contenders Manchester City.\nIn a crunch game at the Etihad Stadium, Spurs fought back from two goals down to level it at 2-2. Mario Balotelli somehow escaped a red card for stamping on Scott Parker's head, and would score a stoppage time penalty to seal a win for Man City and send Tottenham's campaign into a tailspin.\nThat's why they're still stuck fighting for top-four finishes now.\n32. Ryan Nelsen & Louis Saha\nBlame rating: 0.75/10\nWith Tottenham in the midst of that title fight, they recruited Ryan Nelsen and Louis Saha on free transfers on deadline day.\nHow do you think it went?\n31. Harry Redknapp's dog\nBlame rating: 1/10\nBut the person most at fault for such a collapse is Harry Redknapp. Or more specifically, his dog Rosie.\nDuring a trial of two counts of cheating the public revenue, Redknapp explained to a court that he set up a Monaco bank account with Rosie's name because he loved her so much.\nAll the while, Spurs' season was going down the pan and he was flirting with the England job.\nHow could you do this, Rosie?\n30. The special relationship with Real Madrid\nBlame rating: 1.5/10\nAt the end of Redknapp's tenure, star midfielder Luka Modric was sold to Real Madrid, with Spurs announcing they had entered a special 'partnership agreement' with the Spanish giants.\nGareth Bale joined Real Madrid a year later.\n29. Juande Ramos\nBlame rating: 2/10\nThough Juande Ramos is also Real Madrid alumni, his connection to Tottenham is for a very different reason.\nHe was the last manager to win a trophy with Spurs. Much better managers have followed in his wake and failed. What a lottery.\n28. Martin Jol\nBlame rating: 2.1/10\nRamos won the cup, but that team spiritually belonged to Martin Jol. He's just as culpable.\n27. Lasagna\nBlame rating: 2.5/10\nBecause you can't blame who Spurs are and what they're about without referencing Lasagna-gate 2006. I don't want to go into it, though. Too painful.\n26. Adele\nBlame rating: 3/10\nOne of Tottenham's most famous fans just happens to be someone who can also sell out Wembley - how are Spurs supposed to live with that pressure?\nBut speaking of Wembley...\n25. Wembley Stadium\nBlame rating: 3.5/10\nTottenham had outgrown their old White Hart Lane stadium and had to move on. During construction of a new ground, they had to play at Wembley - a soulless stadium which was a nightmare to get to and from.\nSpurs were unbeaten in their final season at White Hart Lane and lost their first game at Wembley. Go figure.\n24. The £1bn Tottenham Hotspur Stadium\nBlame rating: 4/10\nTottenham haven't quite felt the benefits of their new home just yet. Why not? Why can't a stadium play at wing-back?\n23. The non-existent cheese room\nBlame rating: 4.1/10\nAmong proposals for Tottenham Hotspur Stadium were a cheese room as part of the club's luxury offerings.\nIt did not make the final blueprints.\n22. Beavertown\nBlame rating: 4.5/10\nBeavertown have a microbrewery inside the new stadium. They now run a pub where the old ticket office stood. I am the proud owner of Beavertown x Spurs merchandise.\nThey truly run the world.\n21. NFL\nBlame rating: 5/10\nThe NFL have a 10-year agreement to play matches at Tottenham Hotspur Stadium. There is a specific-use American football pitch underneath the soccer one.\nIt's just not football anymore.\nREAD NEXT\n20. Richard Hammond\nBlame rating: 5.1/10\nTottenham Hotspur Stadium featured on an episode of Richard Hammond's Big.\nDid the club further need their ego stroked? No.\nIs the episode any good? Oh yeah, really great. Rivalries aside, definitely go watch it.\n19. Daft podcasters\nBlame rating: 5.2/10\nDo podcasters even say anything interesting? Anything noteworthy? Are they worth the hassle? Everyone's got a bloody podcast these days.\nAnyway, please subscribe to Oh What A Night, part of the 90min podcast network. Hosted by me.\n18. Damir Skomina\nBlame rating: 5.5/10\nThe referee who gave a handball against Moussa Sissoko 22 seconds into the only Champions League final Tottenham might ever play.\nI hope you're proud of yourself. You ruined it for everyone.\n17. Paulo Dybala's image rights\nBlame rating: 5.6/10\nOff the back of reaching that Champions League final, Spurs made an audacious move to sign Paulo Dybala from Juventus.\nHe didn't seem overly keen on the deal anyway, but a move fell apart on deadline day as Tottenham could not legally work their way around an issue with the forward's image rights.\nGreat.\n16. Jose Mourinho\nBlame rating: 6/10\nJose Mourinho was hired to get Tottenham over the line in their pursuit of a trophy.\nHe took the club backwards instead.\n15. The Croatian authorities\nBlame rating: 6.1/10\nTottenham were handed a boost in their 2020/21 UEFA Europa League last 16 tie with Dinamo Zagreb when it was confirmed that manager Zoran Mamic had been sentenced to four years in prison.\nSpurs managed to blow a two-goal lead and lost the second leg 3-0. Maybe if Mamic was let off the hook things would have been different.\n14. Joe Hart's social media manager\nBlame rating: 6.2/10\nOff the back of that surprise elimination, the social media manager of Joe Hart - who spent just one season at Spurs - praised the result on the goalkeeper's Instagram page, assuming that Tottenham wouldn't have ballsed it up.\nHart issued a public apology for the incident, but the damage was done.\n13. The Dulux dog\nBlame rating: 6.5/10\nThis really was a time where bashing Tottenham was the lowest of hanging fruits. Even Dulux - who had become the club's official paint supplier days earlier - posted tweets mocking their empty trophy cabinet.\n12. Sir Alex Ferguson\nBlame rating: 6.6/10\n\"Lads, it's Tottenham.\"\nThis utterance from Fergie set up a generation of Spurs jokes.\n11. Giorgio Chiellini\nBlame rating: 6.7/10\nAh, the man behind the modern person's Spurs proverb.\n\"It is in the history of the Tottenham.\"\nThat's another generation sorted.\n10. Chick King\nBlame rating: 7/10\nThe best fried chicken in north London, why must you always tempt us back to N17?\nSources (Matt Le Tissier and David Cotterill) suggest the secret ingredient is Chirpy.\n9. Beyonce\nBlame rating: 7.5/10\nOk, I'm only being half-satirical with this list. 75% at a push. 100% if you think I'm a moron.\nBut there are genuinely Tottenham fans who think that Beyonce playing concerts at the stadium this summer is an awful thing which somehow ties to the club's ambitions.\n8. Fabio Paratici\nBlame rating: 8/10\nIs it a good thing when your managing director of football could be banned from football for two-and-a-half years for financial irregularities?\nProbably not.\n7. Antonio Conte\nBlame rating: 8.6/10\nAntonio Conte was meant to be different. He was hired to get Tottenham over the line in their pursuit of a trophy. He took the club backwards inst- hey, didn't I say this already?\n6. Harry Kane\nBlame rating: 8.7/10\nThe unlikeliest of heroes, all things considered. 271 goals for Tottenham Hotspur, and by dumb modern-day logic, none of them mean anything.\nWhat a sad little life, Harry.\n5. Tim Sherwood\nBlame rating: 8.8/10\nWell, Tactics Tim, you always wanted to take credit for Kane becoming one of the best players in the world.\nTime to have your cake and eat it.\n4. Arsenal\nBlame rating: 9/10\nWhooooo remembers '4th - Arsenal' jokes?\nNo but seriously the Gunners have made the leap Spurs were supposed to and it's causing misery down the other end of the Seven Sisters Road and I hate it.\n3. Lord Sugar\nBlame rating: 9.1/10\nLord Sugar was the owner of Tottenham during one of the worst stretches of their entire history. Nowadays, he just tweets discriminatory things and hosts The Apprentice.\nQuite a brush for the club to be tarred with.\n2. Daniel Levy\nBlame rating: 9.5/10\nObjectively and subjectively, Tottenham have made huge strides under Daniel Levy's chairmanship.\nThey've also stagnated in recent years because of some really poor decisions and refusal to learn from mistakes.\nLevy giveth, Levy taketh away.\n1. Mauricio Pochettino\nBlame rating: 10/10\nHere he is. The man who raised the bar, who made modern Tottenham Hotspur the club they are today.\nIt's only right that he should be forced to return and sort out this mess. Who's with me?\nOn this edition of Oh What a Night, part of the 90min podcast network, Sean Walsh & Jude Summerfield discuss the issues at Tottenham Hotspur and who is to blame for where the club find themselves. If you can't see this embed, click here to listen to the podcast!",
  "word_count": 1633,
  "scraped_at": "2026-02-14T01:53:35.632194",
  "_text_extracted": true
}