{
  "article_id": "117fa42a7090",
  "url": "https://www.sbs.com.au/news/podcast-episode/albanese-leaves-pn-g-without-the-desired-defence-pact-midday-news-bulletin-17-september-2025/deheb9jba",
  "title": "Albanese leaves PNG without the desired defence pact | Midday News Bulletin 17 September 2025",
  "date": "20250917T061500Z",
  "domain": "sbs.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Listen to Australian and world news and follow trending topics with SBS News Podcasts.\nTRANSCRIPT:\n- Anthony Albanese to leave Papua New Guinea without the defence pact he's been seeking.\n- Israel's ground offensive in Gaza begins, despite a UN commission accusing it of genocide there.\n- And in football, Real Madrid starts the Champions League with a win.\nPrime Minister Anthony Albanese will leave Papua New Guinea without the defence pact he'd been hoping for.\nMr Albanese and his Papua New Guinean counterpart, James Marape, have agreed to the wording of the pact, but it has not been officially approved by the Papua New Guinean government.\nIt's a setback to Australia's efforts to maintain friends and influence in the Pacific region, in order to try and ward off China's attempts to do likewise.\nThe pact is known as the Pukpuk Treaty, after the pidgin word for crocodile, and it would be Australia's first formal defence treaty in more than 70 years.\nMr Albanese says it's important the treaty is implemented in the right way.\n\"Processes are important, and sovereignty is important. And we respect it. And Papua New Guinea will go through its cabinet processes.\"\n—\nFederal Opposition Home Affairs spokesman Andrew Hastie is standing by his threat to quit the Coalition frontbench if they remain committed to net zero emissions by the year 2050.\nMr Hastie says he doesn't want to get ahead of himself, given Opposition Leader Sussan Ley and others are still conducting a review into energy policy, amongst other things.\nBut he's told Sky News he simply can't pretend to support certain things.\n\"Energy policy is something I care very deeply about, and it's a hypothetical question but, fundamentally, I wouldn't be much use to the Coalition if I'm out the front trying to sell a policy I don't believe in.\"\nMr Hastie says the Coalition should be reframing the debate around emissions, rather than accepting it through the lens of the Labor Party.\n—\nThe Tasmanian Planning Commission has found that the proposed A-F-L Stadium at Macquarie Point on the Hobart waterfront should not be built.\nThe report is not binding, but could sway the parliamentary vote that is needed to get the stadium built.\nThe report says the project, which would cost $945 million, is too big for the site and not worth the cost.\nThe stadium being built is a condition to the proposed Tasmanian side being admitted to the AFL and AFLW, which is due to happen in 2028.\n—\nMining company BHP is to shed 750 jobs from its Queensland coal mining operations.\nThe Australian newspaper is reporting the company is blaming the move on the Queensland government taking what the company sees as excessive amount of royalties from the mining operations.\nThe job cuts will seemingly come from mining operations in the Bowen Basin in central Queensland.\nThe Queensland government says the state's royalty agreements are locked in until the 2029-2030 financial year.\nThey are the same royalty agreements that the current LNP government inherited from the previous Labor party government.\n—\nIsrael has launched its long-awaited ground offensive in Gaza... despite a UN commission accusing of it committing genocide there.\nThe Israeli military says it has significantly expanded its operations in Gaza City, with residents reporting relentless bombing.\nThe UN Independent International Commission of Inquiry has found that genocide is occurring in Gaza at Israel's hands, and that is it being incited by Israeli leaders, including Prime Minister Benjamin Netanyahu.\nThe Commission does not speak for the UN as an organisation.\nIsrael has rejected the inquiry's finding, calling it distorted, and says the Commission needs to be wound up.\nUN Secretary-General Antonio Guterres says, whatever words are used to describe Israel's actions in Gaza, the point is that these actions need to stop.\n\"Independently of the names that are given, the truth is that this is something that is morally, politically and legally intolerable.\"\n—\nIn football, Real Madrid has started their new Europeans Champions League campaign with a two goals to one win over French side Marseille.\nSuperstar striker Kylian Mbappe scored both goals for the Spanish side, both of them from the penalty spot.\nThe 15-time European champions had to play the final 18 minutes with ten men, after Dani Carvajal was sent off for headbutting a Marseille player.\nCoach Xabi Alonso says the side handled the difficult situation late in the match very well.\nSpanish, then translated* “We had a red card and despite lacking one player, I didn’t have the feeling the team thought they were just hanging on, or were just looking for chances. The team wanted to keep on playing hard, dominating the match. We won 2-1. We were mature, we didn’t suffer from it, and this is a very important victory to start this Champions League.”\n***",
  "word_count": 806,
  "scraped_at": "2026-02-14T01:49:53.052573",
  "_text_extracted": true
}