{
  "article_id": "117ffdb0d77e",
  "url": "https://www.hola.com/us/celebrities/20251102865096/nicki-nicole-deletes-photos-lamine-yamal-breakup/",
  "title": "Nicki Nicole deletes photos with soccer star Lamine Yamal after confirmed breakup",
  "date": "20251102T060000Z",
  "domain": "hola.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lamine Yamal and Nicki Nicole have reportedly broken up, according to statements the soccer player himself made to D Corazón. Journalist Javi de Hoyos, a contributor to La 1’s program, confirmed the unexpected and much-rumored split with the Barcelona player. “It wasn’t because of any infidelity,” the athlete clarified.\nAlthough there had been some online rumors about a breakup, confirmation came this Saturday straight from Lamine, who wanted to explain the situation to the journalist. “We’re not together,” he said, putting any doubts to rest. “We just decided to go our separate ways, that’s all. Everything being said out there has nothing to do with our relationship,” he added, aware of speculation that he had been unfaithful during a recent trip to Milan, where he partied with friends. “I haven’t cheated or been with anyone else.”\nThe young couple had been in the media spotlight for months: photos on social media, the singer showing up in the stands at his football games, love messages, countless videos and dedications that made it clear things were serious between them, and even pregnancy rumors just a week ago. That’s why it’s surprising how quickly everything seems to have faded between them, especially considering that on October 22, Lamine dedicated a goal he scored against Olympiacos to her.\nThey confirmed the rumors of a relationship in late August, but they started in the summer. At first, they were very private, but soon they couldn’t hide their love anymore. Now, though, there’s no trace of their relationship on social media. Both of them have deleted all the photos they posted over the past few months—pictures where they looked affectionate, close, and clearly in love.\nTo make things even more surprising, the couple made their official debut just 10 days ago at the King’s League. Even though they had shown off their love on Instagram and TikTok, that event was the first time we actually saw them together in public—appearing side by side and confirming that their relationship seemed to be moving forward quickly. The reality, however, turned out to be entirely unique.\nThis is how their short but intense relationship unfolded\nThe first time the two were linked was during Lamine Yamal’s controversial birthday celebration. Nicki Nicole reportedly attended the footballer’s party in Barcelona, where he was celebrating his 18th birthday. Although nothing happened that night, “there was definitely a lot of flirting,” journalist Javi de Hoyos said on D Corazón. They reportedly kissed in a nightclub on July 24 and left together around 4 a.m.\nIt was in early August when talk began to spread that the famous international artist and the young footballer might have more than just a friendship. These rumors grew stronger after the two were spotted enjoying a fun weekend together in Monaco. The photos that circulated showed them sharing playful, intimate moments, further fueling speculation about their close connection.\nWeeks later, the singer was the guest of honor at FC Barcelona’s Joan Gamper Trophy match against Como, which ended in a solid win for Barça. During the game, cameras caught her in the stands, enjoying the atmosphere, cheering with excitement, and, most notably, wearing Lamine’s jersey with the number 10 on the back. From that moment on, their affection and chemistry went beyond the small screen—it was through photos, cryptic messages, and social media posts that their relationship became official.\nWho is Nicki Nicole?\nNicole is an Argentine singer who became a phenomenon in her country and beyond as part of the urban music scene that includes rappers like Duki and Trueno, with whom she had a highly publicized relationship. Born in 2000 in Rosario, she rose to fame in 2019 after releasing her debut single, Wapo Traketero, a song shared by Duki himself, one of the biggest names in Argentine rap and freestyle battles, which quickly put her in the spotlight.\nSince then, after collaborating with artists like Bizarrap, Aitana, Rels B, and Bad Gyal, Nicki Nicole has established herself as one of the leading voices of her generation. Her music blends the raw roots of rap with a more pop-influenced sound, making her one of the most versatile and influential artists in Latin urban music today.\nIn addition to Trueno, her most stable and celebrated relationship among fans, which almost led to marriage, Nicki Nicole also had a brief romance with fellow singer Peso Pluma. The two appeared very affectionate on the red carpet at the 2023 Grammy Awards in Seville, but their relationship ended a few months later when Nicki found out he had cheated on her after a video of it went viral online.",
  "word_count": 769,
  "scraped_at": "2026-02-14T01:52:49.007107",
  "_text_extracted": true
}