{
  "article_id": "1181f8211041",
  "url": "https://www.fourfourtwo.com/news/jules-breach-kobbie-mainoos-late-winner-for-manchester-united-at-wolves-was-the-match-of-the-year-but-chelseas-cole-palmer-takes-the-individual-performance-of-2024",
  "title": "JULES BREACH : Kobbie Mainoo late winner for Manchester United at Wolves was the match of the year but Chelsea Cole Palmer takes the individual performance of 2024",
  "date": "20241205T104500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JULES BREACH: Kobbie Mainoo's late winner for Manchester United at Wolves was the match of the year but Chelsea's Cole Palmer takes the individual performance of 2024\nThe TNT Sports reporter presents a rundown of her highlights from the past 12 months\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nMatch of the Year\nThere have been some extraordinary football matches in 2024, so to narrow it down I’ve picked my favourite game from the ones I was lucky enough to be in the stadium for.\nIt was pretty close between two. Manchester City’s 3-2 win at Newcastle was up there. It included Kevin De Bruyne’s long-awaited return from injury during an outstanding cameo, and a stoppage-time winner from Oscar Bobb.\nEddie Howe’s side arguably offered more entertainment across the year than any other team, with St James’ Park always delivering one of the very best atmospheres across the whole of the Premier League.\nHowever, my most unbelievable match of the year was at Molineux – a seven-goal thriller between Wolves and Manchester United that you simply could not write.\nIt pretty much summed up Manchester United’s rollercoaster season under Erik ten Hag. They were 2-0 up in 22 minutes, and 3-1 ahead after 75 minutes. Then the drama really began. Gary O’Neil’s side, roared on by the home crowd, showed incredible fighting spirit to get back into the game, with Pedro Neto scoring a 95th-minute equaliser. That was already exciting enough, but what followed was absolutely jaw-dropping.\nIn the 97th minute, Kobbie Mainoo wriggled into the Wolves area, nutmegging Max Kilman on the way, and curled the ball into the bottom corner. That sparked bedlam in the away end, after a sensational first Premier League goal from the academy graduate. It was just the most remarkable end to a thoroughly entertaining game. Football, bloody hell.\nBest Individual Display\nThere are so many notable mentions in this category. From Ademola Lookman for Atalanta in the Europa League final, ending the unbeaten season of Bayer Leverkusen, to Andriy Lunin’s superb display in goal for Real Madrid against Man City in the Champions League, or quite frankly any of Erling Haaland’s brilliant hat-tricks. But, just like Haaland, there’s one player who could get this award for multiple performances this year: Cole Palmer.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nIn September, Palmer became the first player ever to score four first-half goals in a Premier League match, in Chelsea’s 4-2 win over Brighton.\nEarlier this year, he also scored four goals against Everton in a 6-0 thrashing. That game epitomised everything fans love about Palmer. The flicks, tricks and skills, his awareness, the quality of the goals including a lob over Jordan Pickford, and his ability to do all of that in the nonchalant manner that has become his trademark characteristic – it all combined to make it my favourite individual display of the year.\nWhat’s made it even more impressive is that he’s been able to put in performances like that consistently. Scoring four against Everton made it back-to-back hat-tricks at Stamford Bridge, after he’d scored three in a crazy comeback victory over Manchester United less than a fortnight earlier. Palmer is a game-changer who gets you off your seat time and again.\nGoal of the year\nOllie Watkins couldn’t stop smiling as he admitted that he’d “had a feeling all day” that he’d score against the Netherlands in the Euro 2024 semi-final. The entire nation is thankful that it turned out to be more than a feeling.\nWatching back Watkins’ matchwinner still gives me goosebumps – you could see the precise moment it hit him how big that goal was. He had etched his name into England’s football history.\nThere were other standout goals from Gareth Southgate’s team at the Euros, including Jude Bellingham’s bicycle-kick and Bukayo Saka’s stunner against Switzerland, but that strike from Watkins was just really special.\nAs we head into the new year, under a new England manager, let’s hope there will be more special moments like that to look forward to.\nJules Breach is a broadcast journalist who has lead presenting roles for TNT Sport, Channel 4, ITV, and Premier League Productions. Jules hosted BT Sport’s live flagship football show Score and also presents live Premier League, Europa League and Champions League matches. Jules is the lead presenter for Channel 4’s coverage of the England games and also hosts ITV’s EFL Highlights show. Jules presents worldwide coverage for Premier League Productions and away from work is a passionate Brighton fan.",
  "word_count": 864,
  "scraped_at": "2026-02-14T01:52:10.166484",
  "_text_extracted": true
}