{
  "article_id": "1199e9239e10",
  "url": "https://www.thisdaylive.com/index.php/2024/08/19/obaseki-hails-edo-queens-for-qualifying-for-sfinals-of-caf-champions-league-play-off/",
  "title": "Obaseki Hails Edo Queens for Qualifying for Sfinals of CAF Champions League Play - off – THISDAYLIVE",
  "date": "20240819T034500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nObaseki Hails Edo Queens for Qualifying for S’finals of CAF Champions League Play-off\nAdibe Emenyonu in Benin-City\nThe Edo State Governor, Mr. Godwin Obaseki, has congratulated the State’s female football team, Edo Queens for securing a ticket at the CAF Champions League WAFU B Qualifier, after defeating Omnisport Etincelle 1-0 in their final Group B match.\nEdo Queens who are Nigeria’s representative to the fourth edition of the CAF Women’s Champions League WAFU-B Inter–Clubs play-off, secured maximum points from three matches in Group B to clinch a spot at the next round of the tournament.\nThe Nigerian Women’s Premier League (NWPL) champions will be facing the host nation’s Inter D’Abidjan at the semifinal match of the competition as the teams battle to decide who will represent the zone at this year’s CAF Women’s Champions League finals in November.\n“I heartily congratulate our darling ladies, Edo Queens for their outstanding performance in the CAF Champions League WAFU B Qualifier, securing a place in the semifinals of the competition after their 1-0 victory over Omnisport Etincelle of Burkina Faso.\n“I celebrate your exploits and stellar performance throughout the group stage of the tournament where you secured maximum points from all three matches, making our dear State and country proud. As the champions of the Nigerian Women’s Premier League (NWPL), you have once again demonstrated your prowess and exceptional talent on the continental stage, and we are confident that you will bring the laurel home.”\nObaseki added, “As you continue on your impressive run at the WAFU Zone B CAF Women’s Champions League qualifiers, be rest assured that the people and government of Edo State stand behind you. Accept my hearty congratulations.”",
  "word_count": 281,
  "scraped_at": "2026-02-14T02:10:58.956169",
  "_text_extracted": true
}