{
  "article_id": "11a2745eee67",
  "url": "https://www.rnz.co.nz/international/pacific-news/485194/sports-news-in-brief-for-march-3",
  "title": "Sports news in brief for March 3",
  "date": "20230302T210000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rugby - Drua\nThe Fijian Drua has announced key re-signings of five players beyond the current Super Rugby Pacific season.\nPlayers that have recommitted their services to the Drua are hookers Tevita Ikanivere, Mesulame Dolokoto and Zuriel Togiatama as well as Flying Fijians props Haereiti Hetet and Livai Natave.\nFijian Drua chief executive, Mark Evans said they're delighted to retain the services of the talented front-rowers for the next season and beyond in some cases.\nEvans adds they continue to invest in both young and upcoming players as well as the seniors within in the team.\nRugby - Fiji U-20s\nThe coaching staff of Fiji's Under 20 rugby side has been stood down following the death of squad member Ratu Pasikali Naevo.\nThis has been confirmed to FBC Sports by Fiji Rugby Union Chair Humphrey Tawake.\nThe FRU Chair said the U2O training has also been deferred until the completion of the internal investigation.\nNaevo passed away at the Lautoka Hospital on Sunday after claims of collapsing in a training session in the West.\nPasikali is the son of former Flying Fijians lock Api Naevo and nephew of Semisi 'Man Mountain' Naevo.\nLeague - Hunters v Silktails\nTHE PNG Hunters will face Fiji's Kaiviti Silktails in the Melanesian Bowl rugby league challenge on Saturday in Sigatoka.\nBoth teams play in separate Australian state competitions.\nHunters chief executive Scott Barker told The National that the team left for Fiji yesterday after receiving a late invitation to participate in the trial match.\nBarker says the match is a great opportunity to prepare for the Hostplus Cup round one challenge against the Western Clydesdales next Sunday in Toowoomba.\nThis is the second attempt by the two sides to get the match off the ground.\nThe first Melanesian Bowl challenge was to be played at the Gold Coast in February but was cancelled due to bad weather.\nFootball - Solomon Islands\nA provisional squad of 30 players have been named by the Solomon Islands for the FIFA international window friendly matches next week against Vanuatu and Fiji.\nThe players are mainly selected from the local Telekom S-League alongside five overseas players who are available for the Fiji game.\nA squad of 23 players will make the final roster for matches as training under coach Felipe Vega-Arango began in Honiara this week.\nThe two games are an opportunity for the coaches to look at the players leading up to the Pacific Games in Honiara in November.\nFootball - Oceania Champions League\nIn football, a stunning curling shot from the sideline by Dennis Ifunaoa has helped the Solomon Warriors qualify for the Oceania Champions League 2023.\nHis strike was the opening goal with the Warriors going on to beat Kossa FC 2-1 in the second leg of their National Play-Off fixture, for a 3-2 aggregate win.\nIfira Black Bird of Vanuatu and AS Pirae of French Polynesia have also qualified for the finals to be held later this year.",
  "word_count": 493,
  "scraped_at": "2026-02-14T02:12:28.616402",
  "_text_extracted": true
}