{
  "article_id": "11a4b0eb35da",
  "url": "https://www.justarsenal.com/should-arsenal-now-be-giving-arteta-a-new-contract-to-head-off-barceelona-interest/358966",
  "title": "Should Arsenal now give Arteta a new contract to head off Barceelona interest ? ",
  "date": "20240129T161500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Xavi is set to depart his position as Barcelona manager in the summer. The Barcelona boss said about his future: “I don’t want to be a problem for the club, and the best thing is to leave after June. I was the solution two years ago, but now leaving is the best option,” Xavi told reporters in his post-match press conference after his Barcelona side lost 5-3 to Villarreal.\nHow does this affect Arsenal?\nAs a gooner, you must be wondering how Xavi’s future relates to you. There have been numerous reports that have claimed that Laporta is a huge fan of Arteta, with the Barcelona president considering the Arsenal manager as a possible replacement for Xavi.\nIn relation to those claims, I feel that from now until the La Liga giants appoint a new head coach, Arteta will be heavily linked with the position.\nAnd given that the Arsenal manager grew up in the legendary La Masia, blossoming in Barcelona B before leaving for PSG, he may be enticed to return and live his Barcelona dream as their coach.\nNotably, Arteta has only 18 months left on his current contract, and Arsenal must act quickly to secure his future at the club by offering a better and longer deal. He has yet to win a big trophy managing Arsenal, but his work at the Emirates speaks for itself; he has truly transformed the club.\nUnder him, the Gunners have recovered their identity, are playing beautiful football, and are not only fighting for the league title but also for the Champions League after six years in the limbo.\nMany are confident that the Gunners will soon reap the benefits of his leadership. At 41, the Spaniard has over 20 years to continue dominating the football scene; the Gooners should surely hope he does so with us.\nSam P\nHere is the latest DUBLIN ARSENAL video reviewing our battering of Crystal Palace by our BRAZILIAN EAGLE HUNTERS\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 350,
  "scraped_at": "2026-02-14T02:25:18.574126",
  "_text_extracted": true
}