{
  "article_id": "11abb87fad18",
  "url": "https://ghanaiantimes.com.gh/goalkeeping-howler-gifts-psg-win-in-champions-league/",
  "title": "Goalkeeping howler gifts PSG win in Champions League",
  "date": "20240920T080000Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Goalkeeping howler gifts PSG win in Champions League\nParis Saint-Germain were grateful to a last-minute howler from goalkeeper, Paulo Gazzaniga, as they snatched a 1-0 win over European debutants, Girona, in their opening game of the new-look Champions League on Wednesday.\nPSG had over 60 per cent possession and 24 attempts on goal but looked set to be left frustrated by their opponents at the Parc des Princes until a low Nuno Mendes cross squirmed under Gazzaniga and into the net in the 90th minute.\nIt was a harsh ending to their Champions League bow for Girona, who qualified for Europe for the first time in their history after a historic third-place finish in La Liga last season.\nPSG missed chance after chance in the second half and looked set to draw another continental blank, just like in their semi-final defeat by Borussia Dortmund last season when they somehow failed to score in either leg.\nHowever, the late goal allowed Luis Enrique’s team to continue their perfect start to the campaign as they aim to go further than last season’s run to the semis and win European football’s biggest prize for the first time.\nThe Champions League has been radically changed by UEFA, with all clubs in the new league phase now playing eight matches against eight different opponents.\nThe top eight will advance to the last 16, with clubs finishing from ninth to 24th in the standings going into a play-off round to decide the remaining last-16 spots. PSG’s next game will be away to Arsenal, while later opponents in a tough draw include Atletico Madrid, Bayern Munich and Manchester City.\nGirona, meanwhile, will go on to a home clash against Dutch former European Cup winners, Feyenoord, with plenty of reason to believe they can make an impact after a battling performance here.-Besoccer",
  "word_count": 304,
  "scraped_at": "2026-02-14T02:08:12.424902",
  "_text_extracted": true
}