{
  "article_id": "11b045870a59",
  "url": "https://www.nytimes.com/athletic/6410166/2025/06/10/club-world-cup-guide-group-e/",
  "title": "Club World Cup Group E : Inter are rightful favorites but battle for second should be fierce",
  "date": "20250610T124500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Group E at the Club World Cup could conjure up a few entertaining matches, but the defining storyline is likely to be the battle for second place.\nItalian side Inter are the favorites to top a pool that also includes Argentina’s River Plate, Monterrey from Mexico and Japanese side Urawa Red Diamonds.\nAdvertisement\nLast month’s UEFA Champions League runners-up qualified for this tournament anyway via their ranking by UEFA, European football’s governing body, between 2021 and 2024. River got in through their ranking by CONMEBOL, South America’s UEFA equivalent, over the same period. Monterrey and Urawa are here thanks to winning the 2021 Concacaf Champions League and 2022-23 Asian Champions League, respectively.\nRiver will be backed to finish second behind the men from Milan in this group, but Monterrey could pose a threat.\nHere, The Athletic picks out the group favorites, the fun facts, and the storylines to watch.\nFixtures\n(All kick-offs ET/BST)\nJune 17: River Plate vs Urawa Red Diamonds (Seattle — 3pm/8pm)\nJune 17: Monterrey vs Inter (Los Angeles — 9pm/2am June 18)\nJune 21: Inter vs Urawa Red Diamonds (Seattle — 3pm/8pm)\nJune 21: River Plate vs Monterrey (Los Angeles — 9pm/2am June 22)\nJune 25: Inter vs River Plate (Seattle — 9pm/2am June 26)\nJune 25: Urawa Red Diamonds vs Monterrey (Los Angeles — 9pm/2am June 26)\nThe favourites are…\nInter.\nThe 2024-25 season was on track to become one of their greatest ever, only for it to fall apart in its final few weeks — Napoli pipped them to the Serie A title by a point, bitter rivals and city neighbours Milan eliminated them in the Coppa Italia semi-finals and Paris Saint-Germain picked them apart, 5-0, in the Champions League final.\nIt all contributed to head coach Simone Inzaghi’s departure, after four years in charge, by mutual agreement in the wake of the latter result.\nFormer Inter player Cristian Chivu has taken the reins after only a few months’ experience of senior management with Parma at the end of this season, starting with this Club World Cup, which is an opportunity for the club to claim some silverware to ease the pain of April and May.\nTheir main competitors for top spot in Group E are River, who topped their Copa Libertadores section with three wins and three draws, setting up a round-of-16 tie with Libertad of Paraguay when that competition resumes in August. The Buenos Aires club lost just one of 16 matches in the first phase of the Argentinian top flight’s 2025 season, too (eight wins, seven draws) to finish second in their pool behind Rosario Central.\nAdvertisement\nMarcelo Gallardo’s key players include German Pezzella, Gonzalo Montiel, Manuel Lanzini, Marcos Acuna, Maximiliano Meza, and (for now) the teenage talents of Franco Mastantuono.\nThe standout match is likely to be…\nRiver vs Inter.\nAside from the quality of their respective squads in comparison to those of Monterrey and Urawa, this will be an excellent match because both teams favour a high-intensity out-of-possession style (or at least, Inter did under Simone Inzaghi).\nInter conceded only five goals in their first 12 Champions League games this season, before letting in 11 in the other three against Barcelona (the two legs of the semi-final) and PSG. River have allowed 16 in 22 matches so far across the league and Copa Libertadores.\nInzaghi’s positional rotations had the Inter midfielders drop into defence in the build-up phase, and their wide centre-backs or wing-backs operate as wingers in the final third. Defensively, they fell into a compact shape, forcing teams to work around them, and packed the box with physical, resolute defenders such as Alessandro Bastoni and Francesco Acerbi.\nThe latter years of Gallardo’s first spell as River coach between 2014 and 2022 saw him receive praise for their explosiveness in attack, drawing compliments from Pep Guardiola. While Guardiola began inverting Manchester City’s full-backs around that period, Gallardo stuck with high and wide full-backs and inside forwards, giving River five men in attack from quick build-up play.\nHis current spell — he returned in August after a year’s break from the game and then six months managing Al Ittihad in Saudi Arabia — has seen the team prioritise defending, with 22 of his 50 matches ending in draws. His preference for a 4-2-3-1 has given way to a 4-3-1-2 or 4-4-2 at times, with a focus on midfield control.\nAdvertisement\nTheir meeting in Seattle will be both teams’ final game of the group stage and could be a straight shootout for top spot if things go to plan in their first two matches.\nThe group’s galactico are…\nThe names mentioned above give River the tiniest of cases, while Monterrey have an actual galactico in Sergio Ramos, the 39-year-old former Spain captain who won the UEFA Champions League and old-format Club World Cup four times each with Real Madrid.\nInter, though, with three European Cup/Champions League crowns, 20 Serie A titles and the 2010 edition of the Club World Cup to their name, are the obvious answer.\nBefore their late-season collapse, Bastoni had a case to finish at least in the top five of the voting for the 2024-25 Ballon d’Or. Lautaro Martinez (22) and Marcus Thuram (18) scored a combined 40 goals this season, while Denzel Dumfries tormented Barcelona in that epic Champions League semi-final. Yann Sommer, Hakan Calhanoglu and Henrikh Mkhitaryan had solid campaigns, too.\nData site Transfermarkt gives Inter’s squad a total market value of €677.8million (£571m/$773m), which is six times higher than River’s (€114.2m) and nearly 10 times that of Monterrey (€69m). Urawa, who have former Barcelona Athletic (their B team, who play in Spain’s third division) midfielder Hiroki Abe and midfielder Matheus Savio, who came through the youth ranks at Flamengo, one of the Brazilian clubs in this competition, in their ranks bring up the rear at €20.45m.\nThe player who could make a name for themselves…\nMastantuono is an obvious answer here, but with his future in doubt, we’ll go with Monterrey striker German Berterame.\nBerterame has been in fine form this season with 22 goals in 41 matches, after scoring 16 for them in his 2022-23 debut year and 13 in 2023-24. The 26-year-old is now a known name in Mexico and Argentina, where he began his career with San Lorenzo before moving to the Mexican league in 2019. This will be his chance to leave a mark on a global tournament.\nAn old-fashioned striker, Berterame is not actively involved in the build-up but is good at holding the ball up. He excels at positioning himself in the optimal position to score, often getting onto the blindside of defenders in the box. He is a consistent back-post threat and is instinctively the first to react to a rebound.\nAdvertisement\nBerterame is comfortable finishing with either foot or his head. For Monterrey to challenge Inter and River to get out of Group E, the man who won his only Mexico cap to date as a substitute against the United States last November will be key.\nA story to look out for\nNone of these four teams has ever played each other in a competitive fixture. So, even when considering the extent of analytics and footage available in football today, Group E brings an element of intrigue.\nInter and River have only met once, in a 1961 friendly that ended 1-1. The late Mario Corso scored for Inter, while former Brazilian great Moacir netted for River. Thirty-three years later, Inter and Monterrey also played a friendly. The Italians won, 1-0, with a goal from Igor Shalimov.\nIn 2004, Inter and Urawa met in a friendly during the Serie A side’s pre-season tour of Japan, with the home side emerging 1-0 winners in Saitama.\nMore recently, River and Monterrey have played two friendlies in the past two years. River won 1-0 in January 2023 with Lucas Beltran scoring, while the teams drew 1-1 this January, Rodrigo Aguirre netting first for the Mexicans and Marcelo Herrera equalizing.\nYou might not know this but…\nMonterrey head coach Domenec Torrent was an assistant to Guardiola for 11 years, winning 24 trophies together with Barcelona, Bayern Munich and City. Torrent was announced in May as the replacement for former River, Bayern, Atletico Madrid, City and Argentina defender Martin Demichelis, who was sacked at the end of their domestic season after a little over eight months in charge.\nTorrent was with Guardiola from his early days managing Barcelona ‘B’ (now Barcelona Atletic) until departing the Etihad Stadium in June 2018 to manage a New York City team headlined by former Barca striker David Villa. Torrent left the MLS club just over a year later and went on to manage Brazil’s Flamengo (July to November 2020), Galatasaray in Turkey (January to June 2022) and Mexican side Atletico San Luis (May 2024 to April this year).\nMonterrey’s Club World Cup opener against Inter will be the 62-year-old Spaniard’s first game in charge.",
  "word_count": 1488,
  "scraped_at": "2026-02-14T01:52:26.337255",
  "_text_extracted": true
}