{
  "article_id": "11de83e86221",
  "url": "https://www.namibian.com.na/mbappe-ready-for-bernabeu-bow-as-ancelotti-seeks-madrid-balance/",
  "title": "Mbappe ready for Bernabeu bow as Ancelotti seeks Madrid balance",
  "date": "20240823T104500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kylian Mbappe’s La Liga debut for Real Madrid did not go as planned as Los Blancos drew at Mallorca last weekend, with coach Carlo Ancelotti believing the Spanish champions lacked “balance”.\nThe French superstar striker will make his first home appearance for Los Blancos at the Santiago Bernabeu on Sunday against promoted side Real Valladolid, owned by former Madrid forward and Brazil great Ronaldo.\nMbappe is on course to enjoy a similarly sizable legacy in football, but is hoping to make a far greater impact at Madrid than Ronaldo was able to, during the club’s ‘galactico’ era.\nRonaldo won just one La Liga title and failed to lift the Champions League during five seasons in the Spanish capital between 2002-07.\nOne of the biggest problems during that period was a top-heavy side which boasted several superstar attackers but lost lynchpin Claude Makelele.\nAncelotti has lined up with Mbappe, Vinicius Junior, Rodrygo Goes and Jude Bellingham in the 2-0 UEFA Super Cup win over Atalanta and the 1-1 Mallorca draw, but criticised his team’s balance after both matches\n“We just had to do better, with more attitude, you can learn from these games – it’s clear where the problem is,” Ancelotti told reporters last week.\n“We need to defend better, we need more balance.”\nOne issue for Madrid is that Mbappe, Vinicius and Rodrygo all prefer to be shifted towards the left flank.\nAnother is that by playing all three forwards, Bellingham is pushed back into a midfield role, when it seems after last season’s superb debut campaign where he helped Madrid win La Liga and the Champions League, he is most content contributing in attacking areas.\n“(Balance) is found by all players thinking the same thing – when it comes to getting the ball back we all have to think about it together,” continued the Italian coach.\n“It’s a team problem that they didn’t understand was a key aspect in this game, Mallorca played a great game in a defensive sense, better than us.”\nWhile visitors Real Valladolid, who beat fellow promoted side Espanyol in their first match, do not pose too much threat to Madrid on paper, the sooner Ancelotti can get his team firing on all cylinders the happier he will be.\nAfter years of links to Madrid, Mbappe completed his dream move this summer at the end of his Paris Saint-Germain contract.\nThe forward clinically struck against Atalanta in Warsaw but was shut out by Mallorca and their goalkeeper Dominik Greif.\nMbappe will hope to mark his first Bernabeu appearance for Madrid with a goal, weeks after he was greeted there by over 80,000 fans at his presentation.\nOnce Madrid’s forwards are on song, they will be difficult for any side to stop.\n“When I saw them running towards me, I just prayed to God and asked myself — ‘what am I doing here?’” admitted Mallorca defender Pablo Maffeo.\nMadrid’s remarkable firepower could prove a double-edged sword with teams rising to the challenge of stopping the attacking quartet dubbed the “fantastic four”.\n“We’re going to face the best team in the world, with one of the best coaches in history and the best attack in the world today,” said Valladolid coach Paulo Pezzolano.\n“We know what we’re going to face, but we’re going there convinced that we’re going to compete and bring something back home, knowing that it’s difficult, but that we can do it.”\nPlayer to watch: Julian Alvarez\nThe former Manchester City striker made his Atletico debut as a substitute at Villarreal in their opening fixture but could be given a bigger role against Girona on Sunday as he makes his first appearance at the Metropolitano stadium for Diego Simeone’s new-look Rojiblancos.\nKey stats\n0 – Real Valladolid were the only team in La Liga not to concede a goal in the opening round of fixtures\n2 – With a brace against Valencia, Robert Lewandowski is the division’s top scorer\n17 – French players appeared in week one, the most represented nationality behind 285 Spaniards\nFixtures\nFriday (all times GMT)\nCelta Vigo v Valencia (1700), Sevilla v Villarreal (1930)\nSaturday\nOsasuna v Real Malloca (1500), Barcelona v Athletic Bilbao (1700), Espanyol v Real Sociedad, Getafe v Rayo Vallecano (both 1930)\nSunday\nReal Madrid v Real Valladolid (1500), Leganes v Las Palmas (1700), Alaves v Real Betis (1715), Atletico Madrid v Girona (1930)\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 831,
  "scraped_at": "2026-02-14T01:51:48.871214",
  "_text_extracted": true
}