{
  "article_id": "11f9c5429aef",
  "url": "https://www.90min.com/posts/england-golden-generation-ranked-by-their-managerial-ability",
  "title": "England golden generation - ranked by their managerial ability",
  "date": "20240103T203000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England's golden generation - ranked by their managerial ability\n- Wayne Rooney recently sacked by Birmingham\n- England's golden generation have had little success in management\n- Nine ex-internationals ranked by managerial ability\nBy Sean Walsh\nThe England sides of the 2000s were among the most underwhelming national teams in living memory.\nHow such a star-studded side only got as far as the quarter-final stage at major tournaments - and then just straight up did not qualify for one - remains a mystery.\nSome of the leaders of those Three Lions teams have admitted there was a lack of cohesion in the national setup because of their intense rivalries at club level. This led to a few frosty and cold relationships in the England camp.\nJudging by their managerial careers so far, most of them never really outgrew that anti-social and angsty period of their lives.\nWho's the best of a pretty rubbish bunch though? Here's 90min's rankings.\n9. Gary Neville\nTeams managed: Valencia\nCareer win percentage: 35.7%\nHighlight: Being the literal manager of Valencia Club de Futbol\nLowlight: The look on his face when losing 7-0 to Barcelona\nA quick look at Gary Neville's stats suggest he wasn't an utterly terrible manager - 28 games, 10 losses, seven draws, 11 losses. 39 goals scored, 38 conceded. See, not horrendous, right?\nBut then you factor in he was in charge of Valencia, who finished the previous season in La Liga's top four. Ah.\nOh, and don't ask how he got the job. Or what his exploits have done for the job prospects of pundits worldwide.\n8. Paul Scholes\nTeams managed: Salford City (caretaker/interim), Oldham Athletic\nCareer win percentage: 30.8%\nHighlight: Won four games in his career\nLowlight: Won only one as a permanent manager\nRight, so Neville won several more matches as a manager than Paul Scholes. He also had a slightly better win percentage. So why does Scholes rank higher?\nBecause he, mercifully, packed in that managerial lark quite quickly, taking charge of just seven games as a permanent boss before packing it in.\n7. Sol Campbell\nTeams managed: Macclesfield Town, Southend United\nCareer win percentage: 22.6%\nHighlight: Only one of the two teams he managed are now defunct\nLowlight: One of the two teams he managed is now defunct\nSol Campbell's management tale is actually quite a sad one. He took charge of two struggling sides in Macclesfield and Southend, and despite his win percentage he wasn't completely rubbish. He has since insisted he is quitting coaching as he is happier away from that world.\n6. Wayne Rooney\nTeams managed: Derby County, D.C. United, Birmingham City\nCareer win percentage: 26.1%\nHighlight: Saving cash-strapped Derby from relegation\nLowlight: Any venture undertaken without the assistance of Liam Rosenior\nThere is no reason other than Michael Jordan-like competitiveness for Wayne Rooney to be a football manager.\nHe should be spending every day laying on a beach and making sure the Vardys aren't privy to his private life.\n5. Phil Neville\nTeams managed: Salford City (caretaker), England Women, Inter Miami, Portland Timbers\nCareer win percentage: 43.6%\nHighlight: Actually managed in a World Cup semi-final\nLowlight: Sacked by his mate David Beckham a few weeks before Inter Miami signed Lionel Messi\nThat Phil Neville is deservedly fifth on this list is a serious indictment on everyone who is below him.\n4. Scott Parker\nTeams managed: Fulham, Bournemouth, Club Brugge\nCareer win percentage: 39%\nHighlight: Two promotions to the Premier League and managed in the Champions League\nLowlight: Lost 9-0 once\nThe streets (and The Streets) will not forget Scott Parker.\n3. Michael Carrick\nTeams managed: Manchester United (caretaker), Middlesbrough\nCareer win percentage: 53.7%\nHighlight: Unbeaten in his three games in charge of Manchester United\nLowlight: Somehow only being third on this list\nIn years to come, Michael Carrick will likely move to the top of these rankings. We just need to see more from him to justify that first.\n2. Frank Lampard\nTeams managed: Derby County, Chelsea, Everton, Chelsea again (caretaker)\nCareer win percentage: 41.3%\nHighlight: Technically built a Champions League winning team\nLowlight: Crawling through the supplicants door\nIt's often forgotten Frank Lampard's managerial career actually started with promise. He led Derby to the Championship play-off final and steered Chelsea to a top-four finish despite receiving a transfer ban after Eden Hazard left.\nIt then really went downhill after 2020.\n1. Steven Gerrard\nTeams managed: Rangers, Aston Villa, Al Ettifaq\nCareer win percentage: 57.1%\nHighlight: The 2020/21 Scottish Premiership title\nLowlight: The existence of Unai Emery\nThe transformation of Aston Villa under Unai Emery has essentially killed Steven Gerrard's managerial career at the top level. No wonder he ran off to Saudi Arabia.\nCollective achievements and records\n- Games managed: 1,062\n- Games won: 450\n- Games drawn: 241\n- Games lost: 361\n- Win percentage: 42.4%\n- Trophies won: 2",
  "word_count": 809,
  "scraped_at": "2026-02-14T02:07:39.578538",
  "_text_extracted": true
}