{
  "article_id": "12437be66023",
  "url": "https://www.empireofthekop.com/2024/06/26/liverpool-could-pocket-100m-before-slot-first-signing/",
  "title": "Liverpool could now pocket £100m - plus before Slot first signing is done",
  "date": "20240626T200000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The combination of the international tournaments and Arne Slot’s need to assess Liverpool’s squad in pre-season could see new signings delayed until after June.\nBy which point anyway the Dutchman’s transfer kitty could have been bolstered by around a further £100m or more judging by potential sales and commercial agreements.\nFootball Insider have now been advised by former Everton chief Keith Wyness that the Reds’ deal with Japan Airlines might be worth as much as £10-20m.\nFollow Empire of the Kop on Instagram (@empireofthekop) HERE\nIt’s a small chunk of change by today’s standards – though it could be significantly boosted by transfer activity.\nREAD MORE: Richard Keys hints job he’d like Jurgen Klopp to take next and it’s absolutely wild\nREAD MORE: ‘I’m told’: Fabrizio Romano reacts to exciting Liverpool transfer rumour he’s heard\nLiverpool could hand Richard Hughes and Co. a serious war chest\nJames Pearce was borderline suggestive in his latest update for Liverpool in The Athletic’s DealSheet. The former Echo reporter noted that, though Luis Diaz and Caoimhin Kelleher remain part of Arne Slot’s plans for 2024/25, offers above £50m and £25m respectively for the pair ‘could make Liverpool reconsider’.\nAssuming, Liverpool received a minimum of £10m above each stated price, those two sales alone – plus the new sponsorship deal with Japan Airlines – would see us pocket a total figure potentially exceeding £100m.\nExits could significantly vary, of course, and funds could always be raised from alternative avenues. For instance, both Bobby Clark and Tyler Morton are understood to be attracting interest from across Europe.\nThough we’re not in desperate need of balancing the books as some of our rivals are in order to meet PSR requirements, it’s welcome all the same.\nGiven that we look in need of strengthening across the board, we need every penny we can get.\nWho could Liverpool sign first for Arne Slot?\nLiverpool are understood be open to signing a new centre-half, though the position isn’t a priority at this point in time.\nThough, this remains a challenge in terms of finding the right opportunity at the right price – as has no doubt been evidenced by the ongoing transfer battle for Leny Yoro.\nThis can quickly change, of course, unless targets elsewhere become increasingly appealing.\nA new right-sided forward looks a potentially promising avenue given the obvious lack of depth for Mo Salah.\nEOTK Close-up with John Welsh: ‘a local lad who lived his dream’ and Slot’s LFC predictions",
  "word_count": 412,
  "scraped_at": "2026-02-14T01:57:18.882424",
  "_text_extracted": true
}