{
  "article_id": "1250a0f84702",
  "url": "http://www.cambodiantimes.com/news/278653972/not-first-time-i-spoke-with-barcelona-about-potentially-coming-here-marcus-rashford",
  "title": "Not first time I spoke with Barcelona about potentially coming here : Marcus Rashford",
  "date": "20251024T124500Z",
  "domain": "cambodiantimes.com",
  "source_country": "Cambodia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ANI\n24 Oct 2025, 15:36 GMT+10\nBarcelona [Spain], October 24 (ANI): Out-of-favour England forward Marcus Rashford revealed that his summer loan deal with Barcelona wasn't the first time he was in contact with the Spanish behemoths about a potential transfer. The one factor that swayed him to join the Catalan club was a desire for change after spending more than 20 years with his parent club, Manchester United.\nAfter enduring a couple of turbulent seasons with Manchester United and being exiled from the main squad, Rashford has found his lost mojo, netting five goals in 12 appearances. The 27-year-old explained the reason behind his newfound purple patch and explained that he is benefiting from 'a new environment'.\n'It was so many years in one place. People forget this, but 24 years, 23 years of my life was with Manchester United. So sometimes you just need a change. I think maybe this is the case with me, and yeah, I'm enjoying everything,' Rashford told ESPN in an exclusive interview ahead of this weekend's Clasico at Real Madrid.\nAxed from the squad at Old Trafford under current head coach Ruben Amorim, Rashford made it his priority to join Barcelona after his loan spell with Aston Villa ended this summer.\n'I just believe that things happen when they're supposed to happen. It's not the first time I spoke with Barcelona about potentially coming here, but for whatever reasons it didn't happen in the past and now is my opportunity to make it happen,' Rashford said.\nAfter scoring twice during Barcelona's 6-1 win over Olympiakos in the Champions League on Tuesday, Rashford has set his sights on facing Real Madrid in El Clasico.\n'I feel like there's no time like the present now. So I just take things day to day. The key thing for me is just to continue to improve because when you retire, you're going to miss everything -- the good stuff, the bad stuff -- you're going to miss it about the sport. Every day, I just take it day by day and just try to improve from the day before,' Rasford added.\nAfter his year-long deal expires the following summer, there is an option to make his stay at Barcelona permanent. Even though his contract with Manchester United is untill 2028, Rashford is planning to extend his time in Spain.\n'Oh yeah, for sure. I'm enjoying this football club, and I think for anybody who loves football, Barcelona is one of the key clubs in the history of the game. For a player, it is an honour,' Rashford concluded. (ANI)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Cambodian Times news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Cambodian Times.\nMore InformationBOGOTA, Colombia: Colombia has recalled its ambassador from Washington after U.S. President Donald Trump said he would raise tariffs...\nLA PAZ, Bolivia: Centrist politician Rodrigo Paz won Bolivia's presidential runoff over the weekend, defeating conservative rival Jorge...\nWASHINGTON, D.C.: NASA said it will reopen bidding for its flagship moon lander contract after delays in Elon Musk's SpaceX Starship...\nTOKYO, Japan: Sanae Takaichi, leader of Japan's ruling Liberal Democratic Party (LDP), was sworn in on October 21 as Japan's first...\nTAIPEI, Taiwan: Taiwan's main opposition Nationalist Party, or Kuomintang (KMT), has elected former lawmaker Cheng Li-wun as its new...\nPARIS, France: In a bold, minutes-long strike on October 19, a group of thieves carried out one of the most daring museum robberies...\nBarcelona [Spain], October 24 (ANI): Out-of-favour England forward Marcus Rashford revealed that his summer loan deal with Barcelona...\nNew Delhi [India], October 24 (ANI): In a strong demonstration of its commitment to fair and equitable sharing of benefits and conservation...\nMumbai (Maharashtra) [India], October 24 (ANI): Punjabi singer-songwriter Harrdy Sandhu has come up with a new track 'Ki Haal Aa'....\n(251024) -- TOKYO, Oct. 24, 2025 (Xinhua) -- Ekaterina Alexandrova reacts during the women's singles quarterfinal match between Sofia...\n(251024) -- TORONTO, Oct. 24, 2025 (Xinhua) -- Lani Pallister of Australia competes during the women's 400m freestyle final at the...\n(251024) -- TORONTO, Oct. 24, 2025 (Xinhua) -- Kate Douglass of the United States competes during the women's 200m breaststroke final...",
  "word_count": 731,
  "scraped_at": "2026-02-14T01:59:14.385205",
  "_text_extracted": true
}