{
  "article_id": "125832d867b3",
  "url": "https://metro.co.uk/2026/02/11/discovery-switching-hbo-max-mean-snooker-fans-26835565/",
  "title": "What does discovery+ switching to HBO Max mean for snooker fans ? ",
  "date": "20260211T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports fans have a lot of streaming services to get their heads round these days and there is another change incoming as HBO Max launches in the UK next month.\nHBO Max is set to be the new streaming platform in the UK for TNT Sports content from Thursday March 26.\nThat will see a change from the current streaming platform discovery+, which shows a range of sports, including Premier League and Champions League football.\nSnooker fans may well have flicked on discovery+ as well, with a string of World Snooker Tour events shown on TNT Sports and its streaming platform.\nThe Triple Crown events are shown on there, alongside the BBC, while the Home Nations tournaments and a number of international events are shown on TNT Sports and discovery+ in the UK.\nThis season the big-money Saudi Arabia Snooker Masters, the recent World Grand Prix, the International Championship and the Xi’an Grand Prix have been among the ranking tournaments shown exclusively by the broadcaster.\nStill to come this season on TNT Sports is the Welsh Open, World Open and then the World Championship in April-May.\nWhat does the switch from discovery+ to HBO Max mean?\nThere is not much to worry about in terms of change, but do not expect a more affordable package to emerge from the switch either.\nThe price for the TNT Sports Plan on HBO Max will remain £30.99-per-month, as it has been with discovery+.\nThat gives viewers access to streaming TNT Sports 1-4 and all the live streams currently shown on discovery+ which will have moved to HBO Max.\nCurrent subscribers will just have to get the new app, but log-in details will remain the same.\nAs per TNT Sports: ‘discovery+ TNT Sports plan – From 26th March 2026, your subscription will continue on HBO Max. On 26 March, download the HBO Max app and sign in using your discovery+ email and password.’\nSome customers have access to TNT Sports through the likes of BT, Prime Video and EE. For how the move impacts those accounts, click here.\nSnooker on free-to-air television\nWhile you get a lot of snooker over the season through TNT, £30.99-per-month is not cheap.\nMore Trending\nThere is plenty of snooker to enjoy on free-to-air television over the remainder of the current season, though.\nThe Players Championship (Feb 17-22) and the Tour Championship (Mar 30-Apr 5) have a new home on Channel 5 and 5Action, having moved from ITV.\nThe Welsh Open (Feb 23-Mar 1) is shown on BBC Wales, then the World Championship (Apr 18-May 4) will be on the BBC.\nThe final two days of World Championship qualifiers (Judgement Days on April 14-15 this year) have also been shown without charge in recent years on World Snooker Tour social media.\nMORE: Ronnie O’Sullivan absence a boost for old rival who makes Players Championship draw\nMORE: Professional Snooker Players Association set out goals as membership grows\nMORE: Ronnie O’Sullivan ‘just not a very good player anymore’",
  "word_count": 497,
  "scraped_at": "2026-02-14T01:59:36.831199",
  "_text_extracted": true
}