{
  "article_id": "12695fa6fe08",
  "url": "https://www.caughtoffside.com/2023/07/28/ben-chilwell-interview-wannabe-chelsea-captain-chilwell-ready-to-run-through-a-wall-for-pochettino/",
  "title": "Interview : Ben Chilwell ready to run through a wall for Pochettino",
  "date": "20230728T150000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ben Chilwell admits he wants to be Chelsea captain. Watching him talk from Atlanta – relaxed, engaged and clearly focused ahead of the new season – there’s no doubt the 26-year-old has the right blend of charm and authority to thrive in the role. And whether he’s ultimately handed the captain’s armband or not, Chilwell is clearly the glue holding this young, newly-formed Chelsea squad together.\nChelsea manager Mauricio Pochettino hasn’t yet picked his new skipper following the departure of Cesar Azpilicueta to Atletico Madrid. Thiago Silva has worn the armband when he’s started games in pre-season and is a leading candidate. But Chilwell, Reece James, Kepa Arrizabalaga and Trevor Chalobah have all been captain at different points during the Premier League Summer Series in America.\nAffable Chilwell believes he has all the qualities to be Chelsea skipper, including the self-confidence to publicly declare he craves the captaincy.\n“I would love to be captain,” said Chilwell, who scored wearing the armband in the 5-0 win over Wrexham. “I’m sure you’ve had that answer off a few of the players. It’s Chelsea, so I’d love to be captain.\n“I was captain of the youth team at Leicester and thoroughly enjoyed it. Just having that role, I think it brings the best out in me and my game – having a little bit more pressure and trying to help people around me is one of my strengths.\n“Whether I get it or not, it’s not going to take away from my role. I don’t think you need an armband to be a leader, so whether I get it or I don’t I’ll continue to do what I’m doing.”\nChilwell has already taken several other teammates under his wing. And his blossoming relationship with fellow left-sided player Mykhailo Mudryk is going to be particularly important this new season.\nMudryk joined from Shakhtar Donetsk in January for a total package potentially worth €100m and by his own admission has only shown about “20 percent” of what he is capable of. The 22-year-old failed to score a Premier League goal in 15 appearances last season but has looked promising in pre-season and was on the scoresheet in the 4-3 victory over Brighton in Philadelphia.\nIt’s understood Pochettino has challenged Murdyk to come out of his shell in pre-season and be more vocal. And Chilwell is doing his part to make the Ukrainian winger feel at home at Chelsea.\n“With ‘Misha’ I have seen how good he can be, and I just want to try and help him fulfil that [potential] because I know how much he wants it,” said Chilwell. “So if I can help him in any way to reach the levels that we all know he can then why wouldn’t I do that?\n“I’ve told him he hasn’t fulfilled that yet for one reason or another. I literally had a conversation with him today after training in the changing room because he’s been on fire the last few days and obviously was on fire in the game against Brighton. And I just said he needs to keep that up now for the whole season.\n“He needs to decide when to cross, when to shoot, when to dribble, when to pass and hopefully I can help him along the way to try and get that decision-making [right] because he can be such a good player for us. We can all see the potential he has. It’s just trying to guide him and the last few days he’s been on fire in training. His decision-making has been bang on.”\nChilwell has plenty of sympathy for many of Chelsea’s high-profile January signings. The likes of Mudryk and Enzo Fernandez came in mid-season as part of a £300m+ spending-spree. They joined a fractured team in poor form, went straight into a congested fixture calendar and lost the manager who signed them, Graham Potter, within two months. This is the first pre-season, and arguably period of stability, they have had since signing for Chelsea.\n“I think the people who have been here a number of years, we don’t know what was going on in January – coming into a new club with everything that was going on, it can’t have been easy for them,” said Chilwell, who played 30 games for Chelsea last season in all competitions, scoring twice. “This pre-season is a clean canvas for everyone, but especially the boys who came in during the whirlwind of everything. I think everyone is really relishing it: new squad, new manager, everyone is excited for the new season. It’s just a fresh start really.\n“Everyone is really excited for it. The fact is we have got a manager now that is so passionate about where he thinks we can go, and as you guys know he is working us really hard, which is what we need. We are such a talented group and the fact we have now got a manager who is pushing us this pre-season as hard as he is, physically, that’s going to put us in good stead.”\nBut it’s not just the new January signings Chilwell is focused on integrating and motivating. He was also the first to talk to Wesley Fofana following his ACL surgery this summer – something Chilwell went through after suffering a partial ACL injury of his own in November 2021 during Chelsea’s 4-0 Champions League win over Juventus.\nAnd Chilwell has also been there to support Armando Broja, who is working his way back to full fitness after rupturing his ACL in a mid-season friendly with Aston Villa in Abu Dhabi last season during the World Cup break.\n“I spoke to [Fofana] the day after his surgery,” said Chilwell. “I have had conversations with him and did the same thing when Armando went through it. I was the first person to talk to Armando every morning. Anything he wanted to know about the ups and downs of going through an ACL injury, because I went through it literally the season before he did it.\n“I think it’s important I help these players that are going through exactly what I went through. I basically just let them know that anything they want to know about the injury, or any way they are feeling mentally, if they have anything they want to talk about I am always there for them.”\nThere is a clear pattern in Chilwell’s behaviour: he is constantly trying to communicate and inspire fellow players and putting the team first. He looks hungry and intent on leading by example to help Chelsea regain their serial-winner mentality and ultimately get back into the Champions League.\nConsidering his widespread dressing-room influence, that’s why it was so important for Chelsea that Chilwell extended his contract in April keeping him at Stamford Bridge until 2027. His new deal perhaps came as a slight surprise given the turmoil at the club at the time. Yet he committed his future to the club without hesitation despite some genuine interest from Manchester City.\n“Since I have come to Chelsea I have always felt pretty at home,” said Chilwell, who joined from Leicester in August 2020. “Obviously I won the Champions League in my first season, and after that seeing the reaction that it brought around the club I want to feel that again with Chelsea – not just in football but with Chelsea. I want to help Chelsea get back to winning titles and cups.\n“I know we’ll get there in the near future and I want to be one of the reasons that we get back to that, so that was my reasoning behind it. I am not going to run when things are going badly. I want to be one of the reasons that helps us get back to the best Chelsea.”\nChilwell’s perception of what Chelsea represents – which is naturally framed by winning the 2020/21 Champions League – compared to last season’s mid-table mediocrity are poles apart. The vibe at the club is very different right now, as is the make-up of the squad. For better or worse, it’s a new era.\nChilwell’s former Leicester and Chelsea teammate N’Golo Kante has joined Saudi Arabian side Al-Ittihad on a free transfer. And his close friend Mason Mount has been sold this summer to Manchester United. That puts even more pressure on him to be a driving force behind building a new Chelsea culture. At 26, Chilwell is now the third-oldest outfield player at the club so carries newfound seniority.\n“I’ve been told that a lot recently and I don’t like hearing that as a 26-year-old!” laughed Chilwell. “As for Mason, he was one of my closest friends on the team. On a personal level, you are going to miss one of your best mates that you spent a lot of time with at the training ground and away from the training ground.\n“I think I said it on my Instagram when he left, he was one of the reasons why I joined the club, so of course it’s sad for me personally to see him leave. But I am not going to comment on his reasoning for leaving. I just wish him the best and I am sure in his head he’s made the right decision. I am happy for him and hopefully he can go there and do well.\n“I was talking to Reece [James] about [all the changes at Chelsea]. There’s only a few boys who were here last season so we feel a responsibility to be the leaders of the group, to help these younger players and, more importantly, lead by example on the pitch. We want to be the players who can perform week in week out, help other players out around the training ground and help the younger players on their path and understand the demands of playing for Chelsea which is to win. That’s a must.\n“There are a lot of players here who are very talented but we need to also make sure that being at Chelsea means we win trophies. I am excited for the opportunity to be one of the most experienced players. It can only help me to have that pressure.”\nIt’s hard not to like Chilwell, who is set to play a vital role for Chelsea this season. Pochettino has already given him a new lease of life. Chilwell has impressed so far in pre-season training, topping Pochettino’s go-to and gruelling Gacon Test (intermittent sprinting, similar to the Bleep Test). And he even bagged himself a free dinner (yet to be cashed in) off the Chelsea manager by going the extra mile. Chilwell just looks fitter than ever and is itching to lead Chelsea back to glory with or without the armband.\n“We did the Gacon Test one day and we were meant to do 10 runs, but we got to the eighth and the manager, I still don’t know if he was doing a mental trick on us, said we could stop if we wanted,” said Chilwell. “Everyone was on their knees after the eighth one, and he said, ‘If everyone completes the next two, I’ll take you all out for dinner’. Of course we all finished and now we’re waiting for the dinner!\n“[With Pochettino] it’s not just a manager-player relationship, it’s more personal where you want to work for each other… after two or three weeks it’s pretty rare to feel like you want to run through a wall for someone.”",
  "word_count": 1912,
  "scraped_at": "2026-02-14T02:00:36.689321",
  "_text_extracted": true
}