{
  "article_id": "12a0fefe268c",
  "url": "https://www.justarsenal.com/real-madrid-0-1-arsenal-where-are-they-now/390068",
  "title": "Real Madrid 0 - 1 Arsenal - Where Are They Now ? - Just Arsenal News",
  "date": "20250408T111500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tuesday understandably brings back memories of 2006, when we became the first English side to win at the Bernabéu. One could argue it remains one of our greatest European nights. It should give every Gooner hope that anything can happen this week in Spain. Our squad back then was the first since Mr Wenger’s first full season in England to finish outside the top two, and travelled to the Spanish capital having to field a makeshift back four due to injuries.\nTo get us in the mood for our quarter-final, let’s look at the eleven Gunners who started in Madrid and where they are now…\nLehmann\nLittle did anyone realise at the time that our keeper would not concede a goal in any of the knockout rounds, setting a Champions League record for the longest time without conceding. Of course, it all went wrong in the final, when his sending-off forced Arsenal to play with ten men against Barcelona for over 70 minutes. After retirement, he returned to North London for a year as an assistant coach but left soon after Mr Wenger, when Unai Emery opted to bring in his own staff. The 55-year-old has been out of work since being dismissed by Hertha BSC for a leaked WhatsApp message, where he referred to a pundit as a “quota black guy”. He holds the branding rights for the ‘Invincibles’ name, allowing only the 2003/2004 squad to profit from the brand—with the support of Mr Wenger and his peers.\nEboue (RB)\nIn his first full season in England, a serious injury to Lauren saw Eboué start in the Champions League final—where (whisper it quietly) he dived to win the free-kick from which we scored. Of all the players on this list, his story post-Arsenal is perhaps the most heartbreaking. The Ivorian claims his wife made poor investments in his name, which led to a one-year ban from football for failing to pay an agent. Following a divorce (his spouse received most of his assets), he became homeless and bankrupt, with a significant toll on his mental health. At 41, he appears to be in a better place, having recently featured on AFTV. His son is currently in Chelsea’s youth academy.\nFlamini (LB)\nOf all the unlikely elements of our back four shutting out Real Madrid’s Galácticos over two legs, perhaps the most surprising was playing a central midfielder at left-back due to injuries. One of the few players Mr Wenger was open to re-signing long-term, Flamini added two FA Cup medals to his earlier success. By the time he retired, the Frenchman had already begun a business venture that makes him one of the most successful Gunners off the pitch. At 41, he is a co-founder of GF Biochemicals and holds a 60% stake in a company reportedly valued close to £10 billion.\nSenderos (CB)\nThe same month Sol Campbell famously walked out of Highbury at half-time, disappearing and not returning calls for days, Senderos stepped in. Campbell only returned for the second leg of our Champions League semi-final—arguably unfair on Senderos, who had been excellent in Europe. At just 20, his performance at the Bernabéu may well have been the finest of his career. It led many to believe he had a bright future in North London, though injuries and a loss of confidence ultimately curtailed his progress.\nToure (CB)\nHe went on to score the final European goal at Highbury and took on greater leadership responsibilities following our move to the Emirates. One of the first Gunners to make the switch to the Etihad following Manchester City’s takeover, he won trophies in Manchester, then Liverpool, and later in Scotland—maximising his career success. He did his coaching apprenticeship under Brendan Rodgers, following him from Celtic to Leicester. His first management role, with Wigan, was unsuccessful, but he remains committed to pursuing that path.\nSilva (CM)\nUnbeknownst to many at the time, the pressure to repay the debt of the new stadium led Mr Wenger to dismantle the Invincibles too soon. Silva became one of the few experienced leaders left in the squad during the transition into the Emirates era, though his leadership was underappreciated. In Greece, he added another double to his honours before becoming Director of Football at Panathinaikos. This role has long linked him with a similar future at Arsenal, though for now he serves as a Club and FIFA ambassador.\nFabregas (CM)\nSpain had long been aware of Fabregas thanks to his time at La Masia, but to see a 17-year-old perform like that in the Bernabéu during his first senior season made global headlines. He went on to be part of Spain’s golden generation (2008–2012), regarded as one of the best national sides ever. At Arsenal, he lacked experienced teammates to support him, which eventually forced his departure to seek the trophies he deserved. Arsenal declined a buy-back clause when he returned to England, despite North London being his preference. He is now head coach at Como, and on course to keep them in Serie A.\nReyes (LM)\nThe only Invincible no longer with us. After struggling with homesickness in England, he returned to play at the Bernabéu the following season. He went on to win five UEFA Cup/Europa League titles in Spain. Reyes tragically passed away in a car accident in 2019. He was just 35.\nLjungberg (RM)\nThis was the season he suffered a serious ankle injury from which he never fully recovered. In 2018, he returned to North London to work with our youth teams, eventually stepping up as interim manager after Unai Emery’s departure. He managed one win in six matches during that stint.\nHleb (AM)\nAfter leaving for Barcelona, Hleb became one of the most vocal players in regretting his departure from Arsenal. He made just five La Liga starts before being loaned out and eventually having his contract terminated.\nThierry Henry (Striker)\nThe man who ran through Real Madrid’s defence to score would later lead us to our only Champions League final. Many believe the nature of our defeat in Paris delayed his move to Barcelona by a year. As captain of a youthful side at the Emirates, it became clear he needed to leave to win the European Cup medal he deserved. Our greatest ever goal scorer would return on loan in 2012, adding two more goals to his tally. He has coached our youth squads and has never hidden his ambition to one day manage Arsenal. So far, he has coached in Belgium (as assistant), France, the United States, and earned a silver medal at the Paris Olympics as a coach.",
  "word_count": 1104,
  "scraped_at": "2026-02-14T02:02:35.585796",
  "_text_extracted": true
}