{
  "article_id": "12a12fe66fbe",
  "url": "https://thepeoplesperson.com/2023/06/04/these-three-stars-can-transform-united-without-exceeding-the-limited-transfer-budget-264890/",
  "title": "These three stars can transform United without exceeding the limited transfer budget",
  "date": "20230604T091500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This summer represents an unprecedented state of flux for Manchester United. The warmest months usually involve the club deciding who to sell and who to buy ahead of the upcoming season. This summer, however, it is the club itself who is potentially being sold and bought. Whether Old Trafford is set to welcome new overlords or, controversially, accept the continued reign of their current dictators, Erik Ten Hag needs reinforcements on the pitch.\nThe holes are obvious, with every man and their dog seemingly knowing what upgrades are required at Old Trafford. But while the positions are obvious, the players prospectively selected to fill those roles are less so.\nAdding to the uncertainty is the prospect of a limited budget. ‘Limited’ is a relative term as footballing finances do not translate to the real world, but The Athletic reports a budget of around £100 million will be available as a base for Ten Hag to shop with. This budget will remain the same, regardless of new owners, such is the restricted position United find themselves in from a Financial Fair Play perspective.\nThe club hopes to generate further funds through departures from Old Trafford, but this is dependent on the club’s ability to command significant fees from insignificant players on significantly higher wages than their new clubs may be willing to offer.\nAs such, when considering United’s prospects this summer, it appears prudent to plan for a £100 million list of essentials, which can then be supplemented as further money is raised by sales. The consensus which has emerged in recent months is that United require a centre forward, a central midfielder, a central defender, a right-back and a goalkeeper; most likely in that order of priority.\nI believe I have identified three players from that list who are paramount to a successful summer for Ten Hag, while operating in this base budget. The extra money can then potentially be used on the remaining positions.The shopping list requires a comprehensive summer tour of the Italian Republic with Serie A raided Viking-style. Hopefully John Murtough and Richard Arnold like pasta!\nList of Essentials:\nItem One: Kim Min-jae (26) – CB – Napoli — Transfer Fee = £43 million\nA centre-back may seem a counterintuitive option upon first glance, as the partnership of Raphaël Varane and Lisandro Martínez has formed a bedrock of stability for Manchester United to build from. Yet, Varane, despite being a Rolls Royce of a defender, cannot be relied upon to stay fit. The Frenchman was absent from fifteen games last year and has missed seventeen this season. Given how integral he is to the functionality of the United defence, he must have excellent cover in the squad.\nI will not devote any of my word count towards Harry Maguire, instead summoning every shred of energy I have into manifesting his departure from Old Trafford. His partner in crime, Chuckle Brother number two, Victor Lindelöf does not actually deserve to be painted in the same light. Lindelöf has performed admirably at times this season and is an excellent fourth choice centre-back, potentially third choice behind an ever-present defensive duo. With Varane’s susceptibility to unavailability however, United must delve into the market to secure a more capable deputy.\nNapoli have proved a revelation this season, securing their first Serie A title in over three decades. Fundamental to this revelatory form has undoubtedly been Victor Osihmen and Khvicha Kvaratskhelia, but Kim Min-jae has been an equally integral figure in the heart of defence.\nThe twenty-six year old has marshalled one of the best defensive units in Europe – only Barcelona have conceded fewer league goals than Napoli across the top five leagues – while his team have played an attacking and proactive brand of football. This style places increased pressure on defenders as they are often left isolated in transitions, but Min-jae has consistently displayed a combination of defensive ability and athleticism reminiscent of Varane. The South Korean international operates on the right-hand side of defence and thus fills in seamlessly for his French colleague, but has capably deputised on the left at times as well.\nReports claim Napoli are resigned to losing their prized defender, despite desires to keep him at the club. A time-sensitive release clause exists this summer, with Min-jae reportedly available for £43 million from 1st July to 15th July. After this date the release clause is void.\nManchester United must therefore move quickly and decisively if they are to secure the South Korean defender. Fabrizio Romano has suggested United are ‘big favourites’ for Min-jae, indicating Ten Hag has recognised the necessity of central defensive reinforcements as well. Murtough and Arnold must tick this essential item off the list early doors, as other fervent shoppers will undoubtedly be in the queue.\nItem Two: Adrien Rabiot (28) – CM – Juventus — Transfer Fee = £0\nOur second must-buy is the first choice we have to make with a constrained budget in mind. While names like Frenkie De Jong and Jude Bellingham would headline this list if money was no object, certain financial realities exist. Consequently, an option such as Adrien Rabiot whose contract expires this summer, becomes an essential. A deal was agreed with Juventus for the enigmatic Frenchman last year, but the club failed to reach personal terms with him and the move collapsed.\nThis indicates, however, the desirability the midfielder holds for Ten Hag and, without the financial burden of a transfer fee, more flexibility exists to agree a deal. Rabiot has performed excellently this season moreover, contributing eleven goals and four assists in addition to his defensive capabilities. An impressive World Cup performance will have only buttressed desires for his services.\nAccording to reports, United have made ‘direct contact’ with the player while L’Equipe claim the Frenchman is an ‘important target’ for the club. A burgeoning consensus amongst reports appears to confirm there is no smoke without fire for this deal. With good reason.\nManchester United have reverted to their impression of a sinking ship in the absence of Casemiro this season. Even with the Brazilian behemoth, United lack physicality and transitional ability in midfield. Christian Eriksen possesses technique but lacks physicality; Fred possesses physicality but lacks technical ability; neither player are capable dribblers, a trait sorely lacking in the centre of the pitch at Old Trafford. Rabiot offers a player capable of all three.\nRanking in the 74th percentile for blocks, 79th percentile for clearances, and 83rd percentile for successful aerial duels, Rabiot is a capable defensive midfielder. He would be able to serve as an effective Casemiro replacement; a captain capable of steering a ship through a storm rather than sinking it.\nSimultaneously, the Frenchman ranks in the 73rd percentile for successful take ons and 80th percentile for progressive carries. Rabiot is excellent at transitioning with the ball through midfield, utilising his physique and technical ability to good effect. The fact he sits in the 96th percentile for non-penalty goals is just the cherry on top. Rabiot would sit comfortably next to Casemiro, as well as in his place; a trait none of the existing cohort of United midfielders possess.\nWhile the French midfielder would not constitute the ideal option for this position, he offers the best compromise available on the market at a price which will enable money to be spent on the plethora of other necessities. Murtough and Arnold must be thrifty, as well as quick, when shopping this summer.\nItem Three: Lautaro Martínez (25) – CF – Inter Milan — Potential Transfer Fee = Unknown\nWhich brings us to the final essential item – a striker. If six months of watching Wout Weghorst comprehensively fail to do a viable impression of a professional footballer hasn’t ignited a deep yearning for a real centre-forward then nothing will. Anthony Martial remains an effective option, if fit. And that is a capital IF as the Frenchman has missed thirty one games this season alone through injury. Ten Hag has described Martial as his ‘type’ of forward but this preference is ultimately redundant if he’s unavailable.\nWhile names such as Victor Osimhen and Harry Kane have been floated, they constitute unlikely options, for differing reasons. Extracting Osimhen from Naples this summer will be like drawing blood from a stone, while relocating Kane from London to Manchester will drain the entire budget and add another thirty-year old to a squad already trending in the wrong direction age wise.\nIn the pursuit of a player who is more affordable, more available, and more age-friendly, other options must therefore be considered. Which is why another Italian club should be raided. Murtough and Arnold will have already enjoyed Naples and Turin as they complete this list of essentials. Now they must visit Milan.\nLautaro Martínez is currently enjoying back-to-back campaigns with twenty-five goals for the first time. This season he has additionally contributed ten assists. It represents a high rate of productivity for a striker, particularly when his defensive contributions are factored in.\nRanking in the 97th percentile for interceptions, 91st percentile for blocks, and 82nd for tackles, Martínez is a tireless worker who embodies the ‘defend from the front’ mentality. He also ranks in the 83rd percentile for progressive passes and 85th percentile for assists. It’s a selection of statistics indicating an impressively well-rounded skillset. Furthermore, in the previous five seasons, Martínez has missed just seven matches through injury; Martial has missed more than seven games in only the last two months.\nThe caveat to a seeming no-brainer of a deal is availability. Inter Milan, publicly at least, do not wish to sell. Javier Zanetti, the current Vice-President of the prestigious club, revealed his happiness with his Argentinian forward recently:\n‘I’m delighted for him; he’s making an extraordinary journey. He grows every year; he’s fundamental and an important reference on the team. Yes, for now, we are holding on to him…He’s very happy here; he has found his home and his family, and I hope it lasts as long as possible.’\nWhile Inter would not be the first club, nor the last, to publicly declare their desires to keep a player before selling them, it does indicate more of an ordeal required in securing Martínez’s services than Min-jae or Rabiot.\nInter are in a position of financial precariousness however. The club has reached the Champions League final and sit in third place in the league, and while these are both significant achievements in terms of generating money, reports in Italy indicate the Nerazzurri must bring in around ‘€500 million over the next five years in order to avoid serious financial collapse.’ It seems on-the-field achievements will not be sufficient alone.\nManchester United should capitalise on this moment of uncertainty to tick off the final essential item on Erik Ten Hag’s wish list. Two seasons ago, Tottenham agreed a £60 million deal for Martínez but were unable to agree personal terms because, well…lads…its Spurs. United will not face this same issues with attraction.\nThe acquisition of Rabiot on a free and the triggering of Min-jae’s release clause for £43 million leaves close to £60 million in the budget for a forward. Murtough and Arnold will be wise to invest this money in Lautaro Martínez to complete their Italian shopping spree.\nShopping done. Book the flight back to Manchester Airport and call it a day.",
  "word_count": 1888,
  "scraped_at": "2026-02-14T02:00:19.985037",
  "_text_extracted": true
}