{
  "article_id": "12b5226228d1",
  "url": "https://www.caughtoffside.com/2024/04/11/erik-ten-hag-man-united-2/",
  "title": "Sir Jim Ratcliffe sets deadline for Erik ten Hag decision at Man United",
  "date": "20240411T070000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United manager Erik ten Hag remains under pressure at Old Trafford despite a positive result against Liverpool at the weekend and new part-owner Sir Jim Ratcliffe will make a decision on the Dutch coach’s future before the end of the season.\nThe current campaign has been a disaster for the Manchester club as they currently sit sixth in the Premier League table with a very slim chance of making the Champions League.\nThe Red Devils were dumped out of that competition at the group stage earlier in the campaign, finishing bottom of their group, and their defence of their Carabao Cup trophy ended with a hammering off of Newcastle in the Round of 16.\nThe only thing left for Man United to play for is the FA Cup but Man City are seen as the favourites to win the competition.\nWhat is even more worrying for United fans are the performances as their team are often dominated in the games they play. Ten Hag will need to show something drastically different between now and the end of the season to save his job and even that may not be enough.\nMan United part-owner Sir Jim Ratcliffe set to make Erik ten Hag decision\nAccording to Football Insider, a decision on Erik ten Hag’s future at Man United will be made before the end of the 2023/24 campaign giving the Dutch coach some time to save his job.\nThe damage might already be done as Ratcliffe continues to change the footballing structure at Old Trafford after confirming his investment earlier this year.\nThe Ineos CEO has brought in some impressive figures behind the scenes in Manchester with Man City’s Omar Berrada, Newcastle transfer guru Dan Ashworth and Southampton chief Jason Wilcox all set to take up roles at Man United.\nThe next decision to be made will be the manager’s future and then onto the playing squad but the manager market will be very competitive this summer as Liverpool, Barcelona, Bayern Munich, Juventus and Napoli are all searching for new coaches so Ratcliffe will need to decide on Ten Hag as soon as possible.",
  "word_count": 354,
  "scraped_at": "2026-02-14T01:56:51.557298",
  "_text_extracted": true
}