{
  "article_id": "12ca3d9479e9",
  "url": "https://tribune.com.pk/story/2446049/bonmatis-barcelona-begin-wcl-defence",
  "title": "Bonmati Barcelona begin WCL defence",
  "date": "20231112T101500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bonmati’s Barcelona begin WCL defence\nBallon d'Or winner’s side expected to face threats from Chelsea, Lyon for coveted crown\nA Barcelona side led by Ballon d'Or winner Aitana Bonmati begin their title defence as the UEFA Women's Champions League group stage starts this week, with Chelsea and Lyon the leading threats to the all-conquering Catalans.\nBarcelona have become the dominant force in European women's club football in recent seasons, appearing in four of the last five Champions League finals.\nThey have won two of those, including last season when they came from two goals down to beat Wolfsburg 3-2 in Eindhoven.\nSince then several Barca stars have become World Cup winners, with six players from the club starting in Spain's victory over England in Sydney in August while Alexia Putellas came off the bench.\nBonmati, the standout player in last season's Champions League, was also named the best player at the World Cup before succeeding Putellas as winner of the Ballon d'Or.\n\"It is difficult to improve on this. It has honestly been a unique year,\" Bonmati said as she claimed that latter award. Her Barcelona and Spain teammate Salma Paralluelo came third in the Ballon d'Or ranking, while Sweden's Fridolina Rolfo, also of Barca, was fourth.\nGiven their recent record and the quality of their squad, it would be a surprise if Jonatan Giraldez's team did not reach this season's final, in Bilbao next May.\nThey are in Group A with Swedish champions Rosengard, Portuguese champions Benfica and Eintracht Frankfurt of Germany.\nElsewhere, Lyon will be desperate to reclaim a crown they had won six times in seven years before last season.\nThe perennial French champions lost in the quarter-finals on penalties to Chelsea and there have been changes at the club since then.\nLyon were bought by American entrepreneur Michele Kang, meaning they are now a separate entity from the Olympique Lyonnais men's side.\nThey continue to boast a fearsome squad that should allow them to compete, with a spine of Chile goalkeeper Christiane Endler, France centre-back Wendie Renard, US midfielder Lindsey Horan and former Ballon d'Or winner Ada Hegerberg up front.\nCoach Sonia Bompastor has also welcomed France forward Kadidiatou Diani from domestic rivals Paris Saint-Germain.\n\"We have regrets at what happened last season. There was a lot of frustration and disappointment at losing in the quarter-finals,\" admitted Bompastor recently.\n\"We want to give ourselves a chance of getting to the final and winning it. We have the quality to do that.\"\nLyon should top a group containing Slavia Prague, Austria's St Poelten and Brann of Norway.\nChelsea, meanwhile, were handed a tougher draw in Group D with Real Madrid, Sweden's Haecken and Paris FC, who eliminated Arsenal and German former champions Wolfsburg in qualifying.\nWith Manchester United also losing in qualifying, Chelsea are the only English club in the group stage as they look to go one better than 2021, when they lost the final to Barcelona.\nLong-serving manager Emma Hayes recently announced she would be leaving the club at the end of the season and so she is determined to go out on a high.\n\"I've taken this team to the top and I always said I wanted to leave at the top,\" Hayes said this week.\nChelsea's squad is formidable, led by Australia's Sam Kerr, the Ballon d'Or runner-up.\nThere is also England captain Millie Bright and winger Lauren James, a breakout star at the World Cup, while USA midfielder Catarina Macario and Canada's Ashley Lawrence have arrived to strengthen a team that lost to Barcelona in last season's semi-finals.\nMadrid, with Spain World Cup hero Olga Carmona and Colombian sensation Linda Caicedo, will hope to make a big impression this time too.\nThe remaining section looks the most competitive, with German champions Bayern Munich, PSG, Ajax and Roma together in Group C.\nThis is the third season since the straight knockout format was dispensed with and a 16-team group stage introduced.\nFollowing the exits of Wolfsburg, Arsenal and United in qualifying, there may soon be a growing clamour for the group stage to be expanded further.\nWhile women's football keeps growing in popularity, the prize money on offer from UEFA remains miniscule compared to the men's version.\nA total of 24 million euros ($25.6m) will be distributed to clubs, with the winners standing to earn around 1.5 million euros.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 750,
  "scraped_at": "2026-02-14T02:07:27.065944",
  "_text_extracted": true
}