{
  "article_id": "12caab535818",
  "url": "https://www.teamtalk.com/tottenham-hotspur/real-madrid-plotting-blockbuster-raid-tottenham-star-puts-levy-postecoglou-under-huge-pressure",
  "title": "Real Madrid plotting  blockbuster  raid on Tottenham , as exit conditions put Levy , Postecoglou under huge pressure",
  "date": "20240919T111500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nReal Madrid plotting ‘blockbuster’ raid on Tottenham, as exit conditions put Levy, Postecoglou under huge pressure\nFurther reports have talked up Real Madrid moving for Tottenham centre-back Cristian Romero, and what will determine whether the Argentine stays or goes has been revealed.\nRomero is a guaranteed starter with both Tottenham and Argentina and losing the 26-year-old would be a bitter pill to swallow for the north London club.\nHowever, according to numerous reports including the latest from Football Insider, Tottenham are at risk of losing Romero to Real Madrid in 2025.\nLos Blancos are seeking a ‘blockbuster’ signing at centre-back next summer and the two players rising to the top of their shortlist are William Saliba (Arsenal) and Romero.\nPer the latest from FI, Real Madrid are ‘watching Romero closely’. What’s more, whether the centre-back will stick or twist will reportedly hinge on the level of ambition Tottenham show.\nIt’s clarified Romero wishes to play at the highest level and compete for – and ultimately win – major trophies. Tottenham haven’t won a major trophy since lifting the League Cup in 2008 and are competing in the Europa League this term – not the Champions League.\nAs such, the pressure is seemingly on Postecoglou to deliver trophies and chairman Levy to spare no expense on high quality additions in the transfer market. Failure to do so could result in Romero angling for an exit if Real Madrid do come calling.\nREAD MORE: The 10 most expensive Tottenham sales and how they fared after leaving: Kane, Bale, Berbatov…\nTottenham’s plan to thwart Real Madrid\nA recent report from the Independent stated Saliba is Real Madrid’s favoured option between he and Romero.\nHowever, they also stressed Real Madrid believe prising Saliba out of the Emirates would be a difficult undertaking. As such, Romero may well be the player Carlo Ancelotti’s side wind up pursuing.\nA separate update from Football Insider recently revealed Tottenham’s plan to fend off interest in Romero.\nSpurs reportedly plan to sit down with the defender next summer in the hopes of ironing out a new contract extension. His current deal expires in the summer of 2027.\nThe newest update from FI stressed that if Tottenham are backed into a corner and reluctantly green light a sale, they will ‘demand a huge fee.’\nPrecisely how high Tottenham would aim is open to debate, though journalist Paul O’Keefe previously cited a monstrous £150m (€178m / $199m) price tag.\nIf Tottenham were to stick to their guns and demand such a lofty fee, they would almost certainly force Real Madrid into moving for an alternative.\nPerisic signs / Tottenham eye Boca Juniors midfielder\nIn other news, former Spurs star Ivan Perisic has joined PSV Eindhoven as a free agent.\nPerisic re-joined boyhood club Hajduk Split upon leaving Spurs earlier in 2024, though has returned to a bigger league through signing with Eredivisie champions PSV. The move also allows Perisic to play Champions League football once again.\nElsewhere, Tottenham are reportedly ‘determined’ to sign Boca Juniors midfielder Kevin Zenon.\nThe 23-year-old’s current deal with the Argentine giant contains a modest £13m release clause.\nFinally, former Spurs winger Erik Lamela has been surpassed in the salary stakes at AEK Athens.\nLamela became the Greek side’s highest paid player ever when joining over the summer. But following confirmation of Anthony Martial’s signing as a free agent, the former Man Utd striker has now taken top spot.\nRomero next? Every player to play for Tottenham and Real Madrid\nJonathan Woodgate\nWoodgate made just 14 appearances in all competitions during an injury-plagued two-year spell at Real Madrid and was sold to Middlesbrough in 2007.\nHe joined Tottenham in January 2008 and made a brilliant start to his Spurs career, scoring and producing a Man of the Match performance in their 2008 League Cup final win over Chelsea.\nBut the centre-back spent a lot of time on the sidelines due to his recurring injury problems and was released in 2011.\nSergio Reguilon\nA Madrid academy graduate, Reguilon made just 22 appearances for their first team before joining Tottenham in a £27.5million deal in 2020.\nThe left-back failed to cement a place in the starting line-up and has spent the last two seasons out on loan, playing for Atletico Madrid, Manchester United and Brentford.\nRoberto Soldado\nSoldado also came through the academy at Real Madrid, and he had successful spells at Getafe and Valencia before joining Tottenham in a £26million deal in 2013.\nBut the striker failed to live up to expectations during a two-year stint in north London, scoring just 16 goals in 76 appearances in all competitions.\nEmmanuel Adebayor\nAfter falling out of favour at Manchester City, Adebayor joined Real Madrid on a six-month loan deal in January 2011 and scored eight goals in 22 appearances.\nHe spent the following season on loan at Tottenham and his 18 goals earned him a permanent move to White Hart Lane.\nThe former Arsenal striker netted another 24 goals for the club before being released from his contract in September 2015.\nRafael van der Vaart\nVan der Vaart was deemed surplus to requirements by Real Madrid following the arrival of Mesut Ozil in 2010, and he joined Tottenham on transfer deadline day.\nThe former Netherlands international became a fan favourite during his two years at White Hart Lane and registered 28 goals and 18 assists in 77 appearances in all competitions.\nLuka Modric\nOne of two players that Madrid have bought from Tottenham, Modric completed a £30million move to the Spanish side in 2012 after a four-year stint in north London.\nHe has since made over 500 appearances for Madrid and has established himself as one of the greatest midfielders of all time.\nGareth Bale\nAfter winning the Premier League Player of the Year award in 2012/13, Bale left Tottenham and joined Real Madrid for a then-world-record fee of £85.1million.\nHe registered 106 goals and 67 assists in 258 appearances for Madrid, helping them win three La Liga titles, five Champions Leagues, a Copa del Rey, two UEFA Super Cups and three FIFA World Club Cups.\nThe former Wales international re-joined Spurs on a season-long loan deal in 2020 and scored 16 goals during his second spell in north London.",
  "word_count": 1047,
  "scraped_at": "2026-02-14T01:49:08.094100",
  "_text_extracted": true
}