{
  "article_id": "12ddabab5799",
  "url": "https://www.themag.co.uk/2025/09/mikel-arteta-dissects-what-happened-during-newcastle-1-arsenal-2-newcastle-united/",
  "title": "Mikel Arteta dissects what happened during Newcastle 1 Arsenal 2",
  "date": "20250929T090000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta dissects what happened during Newcastle 1 Arsenal 2\nMikel Arteta watched on as Arsenal won 2-1 against Newcastle United.\nNick Woltemade heading United into a first half lead.\nThen as the clock ticked down, Merino coming off the bench to head the equaliser on the 84th minute via the post.\nWith six of the eight added minutes gone, Gabriel then heading home from a corner to win the match.\nThis having followed three wins in a row at home for Newcastle against Arsenal.\nMikel Arteta speaking at his press conference following the match, quotes via the official Arsenal site:\nMikel Arteta asked about the winning the game so late:\n“Unbelievable feeling.\n“That’s what football is about and a team.\n“When you get what you deserve right at the end, it’s not a better feeling than that.\nI’d seen the action very clear and fast, so I thought the referee wasn’t going to intervene [and disallow the winning goal] but I don’t know because obviously we had the example of what happens in the first half with a penalty. Regardless of that, I’m so proud of the team, the way we played, the way we competed, the way we understood the game, how we reacted to very difficult situations and decisions and still found a way to win the game with the players coming from the bench, exceptional.\n“There are a few things that might be unpredictable with the line-up or the formation or whatever. There are certain things that are so predictable, what you have to do here to win a football match.\n“We certainly did that from the start to the end and on top of that, we added today so much quality from various ways to generate the amount of chances that we did. At the end we found a way to win it when I think we fully deserve to win the game.\n“You have to learn from the past and certainly we take some lessons and very different and sore moments in this ground.\nToday was an opportunity that the game brings you again in a really important week in the Premier League after all the tough places that we’ve already been very early in the season to show who we are, who do we want to be, our ambition and the way that we want to play. I think the team has done that today in a remarkable way.”\nMikel Arteta on the Gyokeres penalty decision:\n“I watched it live and then I watched it on the screen and for me it was a penalty.\n“We were instructed very clearly again this season that unless it’s a clear and obvious error the VAR is not going to intervene. It’s not, so that’s my opinion.\n“Thank God we found a way to win the game. The team is still emotionally very calm and very composed and that’s a lesson that we took as well probably from a few years ago.”\nMikel Arteta on closing the gap at the top:\n“I believe the conviction of the team that we are and that we can play various types of games and the team still can deliver and win it in a convincing way.\n“For me today it’s one of the most difficult grounds.\n“Again, praise to Newcastle, the way they play, compete, how difficult it is to play in this place but the team really took the game to a different level and I’m very proud to see that.”\nMikel Arteta on substitutes making the difference:\n“We certainly did that and I would have to make a few adjustments and substitutions as well for different reasons. The ones that are coming in, they really come in fully focused. My duty is to win the game for the team and all of them did it in an incredible manner.\n“Martinelli comes in and it shows from the beginning, his threat. Saliba comes in, 45 minutes and I think it was outstanding. Again, Martin comes in after a long period and delivers two goals that are goals. Mikel Merino comes in which is a massive threat in the box and delivers a winning moment, so credit to all of them.”\nMikel Arteta asked about silencing critics:\n“I don’t know, I think the way we played against Manchester City and Newcastle, two of the teams were outstanding, that’s my view on it, very clear.”\nNewcastle 1 Arsenal 2 – Sunday 28 September 2025 4.30pm\n(Stats via BBC Sport)\nGoals:\nNewcastle United:\nWoltemade 34\nArsenal:\nMerino 84, Gabriel 90+6\nPossession was Newcastle 36% Arsenal 64%\nTotal shots were Newcastle 8 Arsenal 20\nShots on target were Newcastle 3 Arsenal 7\nCorners were Newcastle 7 Arsenal 12\nTouches in the box Newcastle 17 Arsenal 43\nNewcastle team v Arsenal:\nPope, Livramento (Lascelles 77), Thiaw, Botman, Burn, Bruno, Joelinton (Barnes 94), Tonali, Gordon (Trippier 67), Woltemade (Osula 67), Murphy (Elanga 66)\nSubs:\nRamsdale, Krafth, Willock, Miley\n(Newcastle 1 Arsenal 2 – Instant Newcastle United fan/writer reaction – Read HERE)\nNewcastle United fixtures (All of the Champions League matches will also be available to watch on TV in the UK):\nWednesday 1st October: Union SG vs Newcastle United (5.45pm)\nSunday 5 October– Newcastle v Forest (2pm) Sky Sports\nSaturday 18 October – Brighton v Newcastle (3pm)\nTuesday 21st October: Newcastle United vs Benfica (8pm)\nSaturday 25 October – Newcastle v Fulham (3pm)\nSunday 2 November – West Ham v Newcastle (2pm) Sky Sports\nWednesday 5th November: Newcastle United vs Athletic Club (8pm)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 933,
  "scraped_at": "2026-02-14T02:26:56.619755",
  "_text_extracted": true
}