{
  "article_id": "12e9e7350e48",
  "url": "https://www.themag.co.uk/2024/09/fabian-schar-disaster/",
  "title": "Fabian Schar disaster",
  "date": "20240902T170000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fabian Schar disaster\nThis Fabian Schar blow has knocked me sideways.\nHopefully Newcastle United can recover from it.\nHowever, it has to be in the balance whether they can?\nA shocker for Eddie Howe, this Fabian Schar news.\nA case of everybody pulling together and getting through this.\nYes, I am talking about the nightmare of Fabian Schar having to be the Newcastle United first choice right-side central defender this season.\nWell, at least for these next four months anyway.\nYou know, just like has been pretty much the case ever since Eddie Howe arrived at the club.\nYou know, Fabian Schar who has been arguably THE best and most consistent Newcastle United player of the Eddie Howe era.\nYet now it is a disaster that he will be (still) playing week in week out in the weeks and months to come.\nI get the disappointment many Newcastle United fans feel with not more quality signings made this summer 2024 transfer window.\nHowever, I just don’t see how we are all supposed to be prostrating ourselves on the floor, bawling our eyes out, and nutting the pavement.\nAll of this because Newcastle United didn’t sign Marc Guehi.\nThat is what we are talking about here isn’t it. That is the reality. You can deny it all you want.\nYes we would all have loved more/other top signings, as is the case in every other transfer window, same as fans of any club, but that is what it boiled down to in the end.\nTruth is though, if Crystal Palace had accepted the widely reported/claimed fifth and final bid by Newcastle United of £70m for Marc Guehi, then this transfer window would have been (reluctantly by some!) deemed a success for NUFC.\nNewcastle United would then have been the Premier League club to make the very most expensive signing of this transfer window, exceeding the £65m reportedly paid for Dominic Solanke by Spurs.\nIt would also have taken Newcastle United’s summer 2024 total spending to a not insubstantial £134m, with £70m Guehi, frees Kelly and Ruddy, Pivas £1m, Osula £15m, Hall £28m and Vlachodimos £20m (this part of the PSR double which saw Forest willing to pay £35m for Elliot Anderson after he’d made only 13 Premier League starts).\nIndeed, £134m would have seen Newcastle United with the fourth biggest spend of all Premier League clubs, only Chelsea, Man U and Brighton spending more.\nIn these days of either everything brilliant or a disaster, for so many people, I think it would have certainly changed the narrative overall for sure.\nPeople can’t help themselves. There appears to be no middle ground, so those the most angry/frustrated about Guehi not signing, Newcastle United not spending more in this window, are intent on seeing free agent Lloyd Kelly as some bargain basement fringe signing – rather than the absolute bargain he is in reality and I would say a £30m valuation minimum. They also are in denial that NUFC have actually spent £28m on the excellent Lewis Hall, whilst £15m Will Osula means we do indeed have a raw young big and fast signing as our third striker, covering Isak and Wilson.\nAs I say, if Marc Guehi had been added for £70m, then I do think that the vast majority of Newcastle United fans would have, even if reluctantly, seen this transfer window as a decent one. Especially in light of having had to early on sell Minteh and Anderson to get us back inside PSR limits for the past three years due to all the money spent on signings and hardly anything coming in from sales, due to Mike Ashley and Steve Bruce leaving a squad that was all but worthless (including so many players who’d been given ridiculous long contracts but who weren’t even Premier League level and couldn’t be shifted due to the wages they had been put on (such as Fraser, Hendrick, Hayden, Lewis), apart from the key group of players that Eddie Howe has managed to rehabilitate.\nAnyway, back to Fabian Schar\nFabian Schar is a class player. The fact Steve Bruce didn’t rate him, says it all. Brucey playing the likes of Lascelles, Clark, Fernandez and even at times midfielder Hayden ahead of the Swiss superstar.\nWhen Eddie Howe came in, that all changed very quickly, Fabian Schar playing week in week out to help Newcastle United to the third best form of Premier League clubs in the entire 19 game second half of that 2021/22 relegation season. Then Schar starting 36 games in the 2022/23 fourth place Premier League season, starting 35 PL matches last season as the likes of him, Bruno and Gordon held things together as so many teammates were absent so often. Add in twice named on the bench and these last two full seasons, Fabian Schar not named in the NUFC PL matchday squad on three occasions.\nHe very rarely, if ever, misses matches through injury.\nFabian Schar is 32 and has just given up international football with Switzerland, in order to devote himself totally to Newcastle United.\nWhy is it suddenly a disaster that Fabian Schar will be a first choice player this season?\nI would even ask the question, is Marc Guehi a better central defender than Fabian Schar? Well I have seen Fabian Schar play the overwhelming majority of his matches for Newcastle United, including/especially the Eddie Howe era, and he has been fantastic. Last season he was superb in both the Premier League and Champions League, including when scoring and winning against PSG, as well as hammering Crystal Palace 4-0 at St James’ Park, when it could/should well have been 8-0 and Marc Guehi had a nightmare, as did many of his teammates.\nI am not saying Guehi isn’t a decent player and may indeed turn out to be a very very decent defender, however, I don’t think he is any world beater currently. People blindly say what a great season he had last year in the Premier League, most of them not even aware that he missed almost half of it with a knee injury and started only one PL match in the last four months of the season. He did well for England in the summer, however, they didn’t play anybody better than poor to average until outclassed by Spain in the final.\nA lot of Newcastle fans will point to his age and yes, aged 32 he has more football behind him than he has in front of him, so yes, Newcastle United do need to sign a younger right-sided central defender at some point BUT it hasn’t been a disaster that that point hasn’t been this summer.\nI would say that arguably, Fabian Schar remains Newcastle United’s best defender and if say fans were asked to name one NUFC defender they would like to be available all season (even if ignoring fact we appear to have more cover in the other defensive positions), I bet it would be Schar in most cases.\nYes it would have been a big positive to get another right-footed central defender of Schar’s level, or preferably better. However, quite clearly the Marc Guehi transfer wasn’t possible in the end and then a case of well who else was out there? If we could have got say a £15m or £20m deal or so on somebody close to Schar’s ability, who was willing to be cover, then fair enough. However, paying say £35m/£40m on somebody who is of lower quality than our first eleven choices, is a slippery slope in my opinion. One thing in Guehi’s favour as well, is that he is comfortable playing in either centre-back position, so he could have feasibly played instead of him AND alongside him if Eddie Howe wanted/needed that.\nA few other players the wrong side of 30, plenty more where they came from…\nAt 32, surely the age factor is surely a bit of a red herring, certainly for this season and I would think at least one more after that as well.\n33 – Virgin van Dijk (another Liverpool player Mo Salah is 32 and in 3-0 win at Man U yesterday, scored one and two assists)\n34 – Kyle Walker (other Man City players, Gundogan and Kevin de Bruyne both 33)\n39 – Thiago Silva (has just packed in at Chelsea and turns 40 this month)\n38 – James Milner (started on Saturday for Brighton at Arsenal)\nPace has never been Schar’s biggest attribute, I would say he is just the same as most other central defenders in that department. However, his ability on the ball and intelligent positioning and defending, I don’t see how that will suddenly disappear.\nBuying a different central defender just to appease Newcastle United fans would have been just daft. The way some fans go on, you’d think it was a case of Newcastle United having nobody to play up front at all and refusing to buy a striker.\nSpending money now on a half-hearted relatively expensive purchase as simply cover currently for Fabian Schar, wouldn’t have been my choice. This isn’t the Mike Ashley days and so long as Eddie Howe thinks it is the better option when you take into account PSR limitations, then I’d rather wait and get the right one in. The right long-term choice to at some point replace Fabian Schar as first choice, whether that signing be Marc Guehi or whoever.\nEverybody moaned when there was no money for spending in January 2024, well in four months time maybe the money not spent this past window might mean it will be (only 18 months left on his Palace contract) Marc Guehi (or an alternative) arriving in January 2025 for £50m or less and even possibly a new right wing first choice as well, maybe Almiron and/or others finding a buyer at that point to help make these incoming deals possible.\nI think that so many Newcastle United fans have worked themselves up into such a state of hysteria that they have equated the two positions. At right wing I think ideally we do need an out and out first choice, although in the meantime Barnes and/or Gordon could play there, with Murphy and Almiron as cover. However, this is NOT the case at right centre-back, we have a superb first choice in Fabian Schar, just as we have an excellent first option in every other position, from Nick Pope right through the team to Alexander Isak up front. Not all of those first choices in their positions are of the exact same quality, but I think most fans accept that each of the top options for those other positions are at least very good.\nSigned by Rafa Benitez for only £3m over six years ago, when the Spaniard discovered he had a relegation release clause in his contract at Deportivo La Coruna, Fabian Schar is arguably Newcastle United’s greatest ever value for money signing, a class act on and off the pitch.\nIf he starts another 35+ Premier League matches this season, that could be key to a very successful season for Newcastle United.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1870,
  "scraped_at": "2026-02-14T02:01:51.743575",
  "_text_extracted": true
}