{
  "article_id": "12efd763c7a6",
  "url": "https://tribune.com.pk/story/2582133/salah-sets-up-goal-on-liverpool-return",
  "title": "Salah sets up goal on Liverpool return",
  "date": "20251214T184500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Salah sets up goal on Liverpool return\nThe Reds thrash Brighton 2-0 at Anfield\nMohamed Salah set up a goal in Liverpool's 2-0 win against Brighton on Saturday as he returned to action after an explosive outburst cast doubt over his future at the Premier League champions.\nThe Egypt forward, the subject of intense scrutiny in the build-up to the game at Anfield, came off the substitutes' bench to huge cheers in the 26th minute, replacing injured defender Joe Gomez.\nThe home team, whose title defence has collapsed after a shocking run of results, were leading 1-0 at the time, with France forward Hugo Ekitike on the scoresheet after just 46 seconds.\nBrighton squandered a number of opportunities to level and Ekitike scored his second with half an hour to go, heading home Salah's corner.\nThe Egyptian superstar now has 277 goal involvements for Liverpool in the Premier League -- 188 goals and 89 assists -- a new record by a player for a single club in the competition, overtaking Wayne Rooney's mark for Manchester United.\n\"Mohamed is a great, great professional,\" Ekitike told the BBC. \"I look to him as an example. You can see how much he is involved in goals and assists.\n\"He is a legend here. To share the pitch is a blessing. That's the kind of player who makes us like to watch football.\"\nSaturday marked a dramatic change of mood for Salah, who last week accused Liverpool of throwing him \"under the bus\" after he was left on the bench for the 3-3 draw at Leeds -- the third match in a row that he had been named among the replacements.\nThe 33-year-old winger also said he had no relationship with manager Arne Slot in his extraordinary outburst and was omitted from the midweek Champions League trip to Inter Milan, which Liverpool won 1-0.\nSlot said at his pre-match press conference that he would hold talks with Salah and there was feverish speculation in the build-up to Saturday's match about what role the Egyptian would play.\nLiverpool made a lightning start, taking the lead in the first minute when Joe Gomez set up Ekitike, who thumped the ball past Bart Verbruggen.\nBrighton's Diego Gomez squandered a good chance and Brajan Gruda went close as the home crowd chanted Salah's name.\nLiverpool doubled their lead in the 60th minute when Ekitike headed home Salah's corner.\nThe Egyptian himself went close in stoppage time after he was set up by Federico Chiesa but he blazed over.\nHe was embraced by teammates at the final whistle and was applauded by fans.\nThe win -- Liverpool's first at Anfield since November 4 -- lifts Slot's men to sixth in the table, easing the pressure on the beleaguered coach.\nSalah departure\nSalah, who signed a new two-year contract at Liverpool in April, will now depart for the Africa Cup of Nations.\nThe length of his absence depends on how far Egypt go in the competition in Morocco, with the final on January 18.\nThe forward, who has been linked with a move to the wealthy Saudi Pro League, had invited his family to the Brighton game as speculation swirled over his future.\n\"I will be in Anfield to say goodbye to the fans and go to the Africa Cup,\" he told reporters last week. \"I don't know what is going to happen when I am there.\"\nSalah, third in Liverpool's all-time scoring charts with 250 goals, has won two Premier League titles and one Champions League crown during his spell on Merseyside.\nHe scored 29 Premier League goals last season as Liverpool romped to a 20th English league title, but has managed just four league goals this season.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 643,
  "scraped_at": "2026-02-14T01:52:59.295516",
  "_text_extracted": true
}