{
  "article_id": "12ff19d6ed69",
  "url": "https://www.sify.com/ai-analytics/how-ai-will-reduce-errors-at-fifa-world-cup/",
  "title": "How AI will reduce errors at FIFA World Cup",
  "date": "20260119T034500Z",
  "domain": "sify.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Adarsh explains how Semi-Automated Offside Technology will replace VAR at the upcoming FIFA World Cup for a more error free experience\nOne of the biggest injustices in sport, especially football, is how an error on the referee or linesman’s part can cost a team a win, or even worse, a championship. Despite their best efforts, the referees are only human, and humans are prone to make the occasional mistake.\nTechnology is supposed to negate human error. When the Video Assistant Referee or VAR technology was introduced, it was expected to at least minimize these errors. But if anything, it seemed to have compounded it.\nVAR woes\nThe perceived inaccuracies and the different interpretations of the rules meant that VAR gave inconsistent results and this was a conundrum which was worse than the occasional human oversight. VAR almost made it seem like football was not a level playing field anymore.\nSify Technologies – Digital Services\nOn top of that, the extended stoppages every time an offside decision needed to be checked meant that the game was never free flowing and this became annoying for both players and spectators alike. All of this meant that there was a lack of confidence in the system.\nAnd that is where the Semi-Automated Offside Technology or SAOT enters the picture.\nWhat FIFA is aiming to solve\nFor starters, VAR was not very accurate when it came to determining the exact point when the ball left the passer’s foot. Most football leagues use cameras that capture 50 frames per second and during fast-paced action, that frame rate is not enough to decide the exact moment of play.\nSecondly, VAR manually selects the furthest point on both the defender as well as the attacker and this was again something that led to inconsistences.\nOn top of this, certain offside decisions would take as long as 5 minutes for a decision to be taken as the camera angles or the uniqueness of the situation made it trickier for the referee to take a call.\nHow SAOT works\nWhile VAR used only the broadcasting cameras available at the stadium, SAOT employs the use of 12 dedicated cameras installed into the roof of the stadium. These cameras track every movement of the ball as well as 29 data points of every player.\nThese data points include extremities that are relevant for an offside decision, like the upper arms, toes, knees, and the head. In other words, the system knows the exact position of all the players at any given moment.\nAl Rihla has the aerodynamics of a champion\nAdditionally, the official ball of the 2022 World Cup – the Adidas Al Rihla – has been fitted with a sensor that records data 500 times every second, which is 10 times more accurate and a much more precise detection technique than using video replays to determine the moment when the ball leaves the player’s foot.\nAll player and ball data are processed in real time by AI (Artificial Intelligence) and the system alerts the referee every time an offside has been detected. This also removes human involvement during the data processing, thereby eliminating inconsistencies and speeding up the entire process.\nAccording to FIFA, a VAR decision on an average takes around 70 seconds to be taken. With SAOT, that number comes down to 25 seconds. This still seems like a lot but since 25 is the average, most decisions will be taken within 10-15 seconds which is hardly anything in the context of a football match.\nThe technology has been tested for almost 2 years now. Data collected during tests were analysed and confirmed by the MIT Sports Lab, with Victoria University also validating the limb-tracking technology. More insights into the technological capabilities of the multi-camera tracking system were provided by a research team at ETH Zurich.\nThe technology was officially tested at the FIFA Club World Cup earlier this year before being used during the UEFA Super Cup final as well as this season’s UEFA Champions’ League group stages. All the reviews and results have been positive and now it’s making its World Cup bow in Qatar.\nWhat FIFA has to say\nFIFA President Gianni Infantino is confident about the new technology. “At the 2018 World Cup, FIFA took the brave step to use VAR technology on the world’s biggest stage, and it has proven to be an undisputable success. Semi-automated offside technology is an evolution of the VAR systems that have been implemented across the world. This is the culmination of three years of dedicated research and testing to provide the absolute best for the teams, players and fans who will be heading to Qatar later this year.”\nPierluigi Collina, the chairperson of the FIFA referees’ committee, is equally positive about the AI-powered tech. “In terms of accuracy, it is important because when you are more accurate it’s good. In terms of time, it is more psychological. We felt something was needed, and that is why we wanted to offer something giving a quicker answer. We are aware that football is different and making a decision faster was important, and that’s why we worked in this direction.”\nThe final word\nFrom the looks of it and based on how it was implemented and received during this season’s Champions League, SAOT is an upgrade on VAR. But whether it is completely fool proof remains to be seen.\nThe World Cup has been known to throw up some unexpected situations and unwanted surprises and if anything, this technology might just provide some more of those during the Qatar spectacle. Either way, we are braced for an exciting tournament.\nDo you think SAOT will be a success in Qatar? Let us know in the comments section!\nIn case you missed:\n- Apple Intelligence to increase Global Reach with Multilingual Support\n- AI Chaos: Why OpenAI, Google and Microsoft Keep Shifting Strategies\n- From Curiosity to Utility: Inside 1.5 million ChatGPT Conversations\n- Why You Should Never Reuse Passwords\n- The Future of Online Marketing: Adobe introduces AI Agents\n- Is AI marking the End of the Web Traffic Era?\n- Suicide Notes, Extreme Diet Plans: ChatGPT’s Unfiltered Answers to Teens\n- AI on Trial: Copyright Law caught between Innovation and Litigation\n- Samsung’s Galaxy S25 Phone Might Shape the iPhone 17 Air\n- Agentic AI could be the Breakthrough Indian SMBs were Waiting For",
  "word_count": 1062,
  "scraped_at": "2026-02-14T02:09:43.001743",
  "_text_extracted": true
}