{
  "article_id": "13112c3e4300",
  "url": "https://metro.co.uk/2025/05/21/rio-ferdinand-blames-ruben-amorim-not-starting-man-utd-star-europa-league-final-23195161/",
  "title": "Rio Ferdinand blames Ruben Amorim for not starting Man Utd star in final | Football",
  "date": "20250521T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rio Ferdinand has questioned Ruben Amorim’s decision to start Mason Mount ahead of Alejandro Garnacho in Manchester United’s Europa League final defeat to Tottenham.\nSpurs finally ended their 17-year wait for silverware with victory in Bilbao, also securing qualification for next season’s Champions League in the process.\nUnited, hopelessly off the pace in the Premier League, end their season with nothing to show for it.\nAmorim placed his faith in Mount ahead of kick-off, naming the former Chelsea star in his starting XI.\nMount has struggled with injuries throughout his time at Old Trafford but shone in his side’s semi-final second leg victory over Athletic Bilbao, scoring twice to help his side book their place in the final.\nAmorim left Garnacho on the bench with Mount starting alongside Amad Diallo behind Rasmus Hojlund.\nGarnacho was eventually brought on with 70 minutes of the game remaining and was immediately involved, forcing a good save out of Guglielmo Vicario four minutes after his introduction.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Argentine was arguably United’s biggest threat during the time he was on the pitch, causing problems for Spurs and stretching their backline.\nSpeaking post-match, former United defender Ferdinand was convinced Amorim made a mistake in not starting the young winger.\nMore Trending\n‘That’s one thing I will question about the selection today for Man United,’ Ferdinand told TNT Sports.\n‘Ruben Amorim was responsible for bringing Mason Mount into that midfield and we didn’t have anyone running in behind.\n‘Garnacho has done that all season, you can say what you like about his end product and his finishing but he does give you that threat stretching teams and we didn’t really see at any point Spurs stretched int hat sense.’\nGarnacho has scored 11 goals and laid on 10 assists for United this term with only Bruno Fernandes outscoring him.\nMORE: ‘Far too easy!’ – Roy Keane blasts Man Utd star over Brennan Johnson’s winner for Spurs\nMORE: Micah Richards tells Man Utd to replace £19m signing after Europa League final defeat\nMORE: Alan Shearer blasts ‘embarrassing’ Ruben Amorim decision after Man Utd lose Europa league final",
  "word_count": 403,
  "scraped_at": "2026-02-14T02:09:11.451724",
  "_text_extracted": true
}