{
  "article_id": "132a09f813e3",
  "url": "https://monacolife.net/grimaldi-forum-to-host-uefa-mens-club-competition-season-kick-off/",
  "title": "Grimaldi Forum to host UEFA Men Club Competition Season Kick - Off",
  "date": "20240723T221500Z",
  "domain": "monacolife.net",
  "source_country": "Monaco",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "More than 700 VIP guests from the world of football will descend on the Grimaldi Forum next month for the ceremonial launch of the 2024/25 Union of European Football Associations (UEFA) Men’s Club Competition Season.\nLocal football fans should mark their calendars for 29th and 30th August, when the Grimaldi Forum will be the epicentre of the 2024/25 UEFA Men’s Club Competition Season launch.\nThe event will draw over 700 attendees, including representatives and members from all competing European clubs, the media, and plenty of footballing stars and legends.\nThe Champions League draw will occur on 29th August at 6pm, while the draws for the UEFA Europa League and UEFA Conference League will take place on the afternoon of 30th August.\nNew Format\nUEFA will also use the occasion to introduce its new league phase format for the first time.\nStarting this season, UEFA has expanded the Champions League group stage to include 36 clubs, adding four more teams to the previous line-up to give “more sides the opportunity to compete against the best clubs in Europe”.\nUnder the new system, teams will no longer play three opponents twice (at home and away). Instead, they will face eight different teams, with half of the matches at home and half away.\nMatch-ups will be determined by ranking teams into four seeding pots. Each team will then be drawn to play two challengers from each pot, resulting in one home and one away match per challenger.\nUEFA is enthusiastic about the change, stating: “This gives clubs the opportunity to test themselves against a wider range of opponents and raises the prospect for fans of seeing the top teams go head-to-head more often and earlier in the competition. It will also result in more competitive matches for every club across the board.”\nRead related:\nAS Monaco secure spot in UEFA Champions League and second place in Ligue 1\nMonaco Life is produced by real multi-media journalists writing original content. See more in our free newsletter, follow our Podcasts on Spotify, and check us out on Threads, Facebook, Instagram, LinkedIn and Tik Tok.\nPhoto credit: Manuel Vitali / Monaco Communications Department",
  "word_count": 357,
  "scraped_at": "2026-02-14T02:10:58.961768",
  "_text_extracted": true
}