{
  "article_id": "1349d492d4c6",
  "url": "https://www.caughtoffside.com/2024/08/29/man-utd-transfer-news-dortmund-officials-sancho-rumours/",
  "title": "Man Utd transfer news : Club officials address Jadon Sancho to Dortmund rumours",
  "date": "20240829T164500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rumours regarding Borussia Dortmund attempting to bring Jadon Sancho back to the club have been dismissed as ‘nonsense’ by club officials, according to reports.\nAfter a public falling out with Erik ten Hag, Sancho spent the second half of last season back on loan at Dortmund having left the club for Manchester United in the summer of 2021.\nThe England international looked rejuvenated in black and yellow, helping the club reach the Champions League final — where they lost 2-0 to Real Madrid at Wembley — and finish fifth in the Bundesliga to secure their place at Europe’s top table for another year.\nInitially, it looked like Sancho would remain at Old Trafford after he and Ten Hag seemed to put previous difficulties behind them, with the player enjoying a productive pre-season.\nHowever, the forward has failed to make the squad for either of Man Utd’s Premier League matches against Fulham and Brighton so far this season, while he played just seven minutes from the bench as the Red Devils lost the Community Shield on penalties to Manchester City.\nMan Utd transfer news: Sancho to Dortmund rumours ‘nonsense’\nSancho’s lack of minutes has sparked further rumours of an exit and predictably, given their history together, Dortmund were one of the clubs mentioned as potential suitors.\nHowever, German outlet Ruhr Nachrichten (via Get Football News Germany) claim to have asked the powers that be at Dortmund about a potential return to Signal Iduna Park for Sancho, with a blunt response branding the rumours as ‘nonsense’.\nJuventus and Chelsea appear to be Sancho’s most likely destinations if he is to leave Old Trafford before the summer transfer window closes, with the latter even reportedly considering a swap deal that would involve Raheem Sterling heading the other way.",
  "word_count": 295,
  "scraped_at": "2026-02-14T01:57:35.660420",
  "_text_extracted": true
}