{
  "article_id": "13603a207950",
  "url": "https://www.90min.com/posts/womens-world-cup-2023-group-g-players-to-watch",
  "title": "Women World Cup 2023 : Group G players to watch",
  "date": "20230619T140000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Women’s World Cup 2023: Group G players to watch\nSweden will expect to top Group G at the upcoming Women's World Cup ahead of Italy, who couldn't catch a break at Euro 2022, finishing dead last in their group.\nSouth Africa and Argentina, meanwhile, are looking to bounce back from their less-than-stellar performances at the 2019 tournament. Both teams have significantly improved and developed their players in the last four years.\nHere are 90min's players to watch from Group G.\n1. Mariana Larroquette - Argentina\nMariana Larroquette will bring creativity and goal-scoring opportunities for Argentina regardless of where she plays on the pitch.\nOften playing as a right-back or a winger, Larroquette played a vital role in Argentina's performances at their debut World Cup in 2019. They managed a remarkable 0-0 draw against former winners Japan, and an exhilarating 3-3 tie against Scotland, having been 3-0 down after 69 minutes.\nThey didn't play well enough to advance to the knockouts, but they certainly showed that they deserve to compete at the biggest stage.\nArgentina is renowned for being a resilient team that are difficult to break down defensively, and Larroquette, who has experience played club football in Norway, the United States, and Portugal, is no stranger to big games and high-pressure situations.\n2. Cristiana Girelli - Italy\nTalismanic striker Cristiana Girelli will lead Italy's charge in the World Cup, aiming to surpass their impressive quarter-finals finish from 2019,\nWith a recent milestone of over a hundred caps for Italy, Girelli brings a wealth of experience to the tournament. At 33 years of age, she has a remarkable record of 53 goals in 103 appearances for he country.\nHer impact at Juventus has been equally impressive, becoming the first player to score 50 goals for the club. Many of these goals came in crucial moments, whether it was securing league titles or delivering in important Champions League matches.\nItaly's approach to the World Cup will be to play with confidence without putting pressure on themselves. If they can embrace this mindset and allow Girelli to do what she does best—score goals—then they have a real shot at replicating their impressive performance from the 2019 tournament.\n3. Hildah Magaia - South Africa\nAfter missing out on a spot in the 2019 South Africa squad, Hildah Magaia has left nothing to chance this time around.\nMagaia played a pivotal role in the Banyana Banyana squad during the 2022 WAFCON in Morocco. She scored a crucial winning goal against Nigeria, securing a 2-1 victory. In the final against the hosts, Magaia then netted a brace, ultimately leading South Africa to lift the trophy. She finished the tournament as the joint-leading goalscorer,\nThe 27-year-old is already being compared to the legendary Bafana Bafana player, Mark Williams, and it's easy to see why. Her knack to scoring in various ways is a testament to her agility and finesse. Whether it's tap-ins, dinks, curling shots, or chips, she somehow manages to always find the back of the net.\n4. Kosovare Asllani - Sweden\nKosovare Asllani shines when she takes on the role of a second striker, forming a formidable attacking partnership with another centre-forward.\nWhile scoring goals is a crucial part of her game, veteran Asllani's true value lies in her ability to create. With her vision, she can thread the perfect pass to create scoring chances for her teammates.\nAsllani's proficiency in set-pieces is another standout aspect of her game. As a specialist in penalties and free-kicks she will offer Sweden valuable opportunities, particularly when teams that sit back.\nThe 33-year-old played a crucial role in the team's success during the last World Cup, where they achieved an impressive third-place finish and was arguably Sweden's best player at Euro 2022.",
  "word_count": 624,
  "scraped_at": "2026-02-14T01:50:37.799924",
  "_text_extracted": true
}