{
  "article_id": "1368c8afaacf",
  "url": "https://metro.co.uk/2025/01/13/carlo-ancelotti-says-one-real-madrid-star-played-well-barcelona-22346814/",
  "title": "Carlo Ancelotti says only one Real Madrid star played well against Barcelona",
  "date": "20250113T104500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Carlo Ancelotti said only one of his Real Madrid players performed to the required level during their Spanish Super Cup final defeat to Barcelona.\nKylian Mbappe put Madrid in front with a superb solo goal after five minutes but Ancelotti’s side still trailed 4-1 at half-time.\nLamine Yamal, Robert Lewandowski, Raphinha and Alejandro Balde all scored first-half goals to stun Champions League holders Real Madrid.\nBarcelona extended their lead further after the break through Raphinha before Hansi Flick’s side went down to ten men, Wojciech Szczesny sent off for a foul on Mbappe outside the box.\nReal Madrid got a goal back shortly after the red but there was to be no further comeback as Barcelona clinched the trophy for the 15th time.\nAncelotti was ‘sad and disappointed’ after the humbling defeat and said Mbappe was the only Real Madrid player to come out of the match with any credit.\n‘We have to look at the reality. We didn’t defend well,’ Ancelotti said in his post-match press conference.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We tried to press high and defend with a low block. They scored the goals easily, and we didn’t work hard, collectively or individually.\n‘We lost a lot of duels. That makes us sad and disappointed, but that’s football. We have to take that sadness home.\n‘I understand the sadness of our fans. We feel that, but we have to look forward, and prepare for the next game, and recover the good form we’d been in.’\nAsked if he was particularly disappointed with any of his players, Ancelotti added: ‘I won’t name anyone, I’m talking about the whole team.\n‘We didn’t defend well, we weren’t compact, and we have to defend better.\n‘We had an extra man [after Szczesny’s red card] and we couldn’t find solutions. But that doesn’t hurt more, I’m sad about the game as a whole.\n‘I’d focus on Mbappe, who had a very good game. It was a great move to score the goal. But the rest we should forget about, and look forward.’\nReal Madrid legend Luka Modric, meanwhile, said: ‘I’m sure we’re going to react after this tough defeat.\n‘We didn’t expect to lose like that, but it’s football. We’re sorry to the fans. We have to keep going, stay united, there’s a lot of season left.\n‘You can’t always win. If you have to lose a trophy, we’d prefer it to be this one.\n‘We have to congratulate Barcelona, they played a very good game, they were better and that’s all. We have to improve and correct our mistakes.’\nBarcelona boss Flick said he was ‘really proud’ of his team’s ‘unbelievable’ performance in the Supercopa final in Saudi Arabia.\nMore Trending\n‘I’m really proud,’ the ex-Bayern Munich boss said. ‘Proud for the team, the staff, the club, the fans, everyone.\n‘Today was an unbelievable match. For the coaches, not so much! But for the fans it’s really fantastic.’\nBarca captain Raphinha added: ‘We know what we have to do on the pitch. We believe in the boss and the boss believes in us.\n‘The important thing is we can fight for titles and win them.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Barcelona boss sends message to Arsenal over Ronald Araujo transfer interest\nMORE: Arsenal target Ronald Araujo tells Barcelona team-mates his transfer ‘priority’\nMORE: Arsenal working on January transfer bid for Barcelona contract rebel",
  "word_count": 629,
  "scraped_at": "2026-02-14T02:26:28.933489",
  "_text_extracted": true
}