{
  "article_id": "1370920b1739",
  "url": "https://www.caughtoffside.com/2024/10/11/liverpool-treatment-trent-alexander-arnold/",
  "title": "Liverpool slammed for their treatment of defender Trent Alexander - Arnold",
  "date": "20241011T063000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football pundits Ian Wright and Roy Keane have criticised Liverpool for failing to agree a new contract with Trent Alexander-Arnold.\nThe Liverpool right-back has entered the final year of his contract at the club and along with Mohamed Salah and Virgil Van Dijk, he can leave the club as a free agent at the end of the season.\nThe Reds star has been linked with an exit from the club with Real Madrid keeping a close eye on him.\nWright and Keane have slammed Liverpool for how they have dealt with the contract situation of Alexander-Arnold.\nWright told ITV, as reported by GOAL:\n“You can’t see anything happening in January, for sure, especially the way Liverpool have started the season, but for me, what he’s done for Liverpool up to this point… It’s different when people talk about Steve McManaman and Michael Owen, yeah, they won League Cups and European Cups and the FA Cup but he’s won the lot. He’s won the Premier League, the Champions League, the World Club Cup, the FA Cup, the League Cup, he’s won everything and he’s done it at his hometown club. Liverpool and FSG have got themselves into a position where he’s in his last year. It’s crazy.”\nThe right-back has made over 300 appearances for the club and have contributed greatly to their success in the Premier League and the Champions League.\nHe was one of their best players under Jurgen Klopp and helped them become a force in European football.\nThere is not another right-back like him in world football who can contribute actively with his assists and goals.\nReal Madrid have a habit of turning heads of Premier League stars and Alexander-Arnold could be the latest one.\nKeane added: “He’s in control of all of that. You’d like to think Liverpool are trying to get him on a contract. If not, then he’ll certainly be leaving Liverpool, going abroad, and if Real Madrid’s an option, that’s a good option to have.”\nLiverpool risk losing Trent Alexander-Arnold in summer 2025\nBy January, the Liverpool defender would be able to negotiate a pre-contract agreement with others clubs.\nWright and Keane have rightly criticised Liverpool for their treatment of Alexander-Arnold, who still remains one of their main players under Slot.\nA club that is usually run so well is under serious trouble of losing their star player for free.\nBetween now and the moment when his future will be decided, speculation will increase on where he could move.\nAlexander-Arnold will reportedly agree a contract extension at Liverpool if only they can match his ambitions and so far under Slot, they have managed to prove that they can compete on all fronts.",
  "word_count": 449,
  "scraped_at": "2026-02-14T01:51:57.649053",
  "_text_extracted": true
}