{
  "article_id": "1373f64aaae7",
  "url": "https://metro.co.uk/2026/01/04/jamie-carragher-sends-clear-message-manchester-united-board-ruben-amorim-26066952/",
  "title": "Jamie Carragher sends clear message to Man Utd board over Ruben Amorim | Football",
  "date": "20260105T004500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher has told Manchester United that Ruben Amorim is ‘not good enough’ to lead the club and is ‘barely competent enough to be a Premier League manager’.\nAmorim’s future in the Old Trafford hot-seat was thrown into fresh doubt after comments the Portuguese boss made after United’s 1-1 draw at Leeds United on Sunday.\nAmorim stressed after the Elland Road stalemate that he was the manager of United rather than a head coach amid reports of tension between him and those above him at the club.\nThe comments came after ex-Sporting boss Amorim appeared to criticise the club for not backing him during the January transfer window.\nBut Liverpool legend and ex-England defender Carragher says Amorim is in ‘no position’ to ‘question the people who appointed him’ given his poor reign as United manager.\nManchester United finished 15th in the Premier League last season and continue to underwhelm this term despite not having any European commitments.\n‘I don’t think he is in any position whatsoever to be questioning the people who appointed him,’ Carragher said on Sky Sports. ‘Because he’s not good enough.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He’s not good enough to be Manchester United’s manager. He’s barely competent enough to be a Premier League manager right now.’\nPressed on what might be the cause of Amorim’s gripes, Carragher suggested: ‘It can only be one of two things.\n‘It can either be about the January transfer market, that he’s not being backed. Or the people above him are questioning that he’s flip-flopping between systems.\n‘It started to look like he was getting somewhere with a back four, he went back to a five at the back against Wolves and it was possibly the worst performance from a team we’ve seen against Wolves this season.’\nManchester United legend Gary Neville has also had his say on Amorim’s comments, saying on his podcast: ‘Something has happened in the last week which means that Amorim is starting to unleash a little bit.\n‘It looks to me that he is not happy with something in the hierarchy. Obviously, something is annoying him, he’s obviously not feeling the support.\n‘He’s obviously letting go. When you say that you came to the club as a manager, I thought he was appointed as the head coach and quite clearly appointed to coach the team.\n‘Manager is a title that we don’t see anymore. Manager suggests that he’s saying he wants to manage more than just the training ground performance, he wants to oversee other parts of the club.\n‘I played under a manager and they basically have a greater say in what would be other parts of the club including recruitment, academy, style of play, pre-season friendlies and other things.\nMan Utd's next five fixtures\nJanuary 7: Burnley (A) – Premier League, kick-off 8.15pm, live on Sky Sports\nJanuary 11: Brighton (H) – FA Cup third round, kick-off 4.30pm\nJanuary 17: Man City (H) – Premier League, kick-off 12.30pm, live on Sky Sports\nJanuary 25: Arsenal (A) – Premier League, kick-off 4.30pm, live on Sky Sports\nFebruary 1: Fulham (H) – Premier League, kick-off 2pm, live on Sky Sports\n‘I think he’s suggesting that he needs to be given the ability to manage more departments of the club.\n‘I actually thought against Leeds, defensively United were very strong. I thought they were very solid in the game I thought they handled the atmosphere well.\n‘I thought they fully deserved the point out of the game that’s why I was surprised at the end to hear of Ruben Amorim’s comments because I thought you’ve got a point away from home.\nMore Trending\n‘You’ve just had a disastrous result against Wolves at home but there’s Burnley to go in three days, there’s no real need for a fire right now but there’s a fire being created.\n‘He’s always been authentic, he’s always had integrity in his press conferences. He’s always said what he believes and he thinks and he should do, he should carry on as he was but it does look like he’s now starting to point upwards which ordinarily does bring pressure with it.’\nAmorim may clarify his comments at his next press conference on Tuesday ahead of Manchester United’s trip to Burnley the following day.\nUnited have won just one of their last five games, a disappointing run that has left the Red Devils sixth in the Premier League, three points outside the Champions League places.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Alan Shearer makes prediction over Ruben Amorim’s future after rant against Man Utd hierarchy\nMORE: Paul Merson says Arsenal star could cost Mikel Arteta the Premier League title\nMORE: Rio Ferdinand highlights Manchester United’s £65m transfer mistake after Leeds draw",
  "word_count": 853,
  "scraped_at": "2026-02-14T02:21:57.230924",
  "_text_extracted": true
}