{
  "article_id": "137ab298fcf2",
  "url": "https://www.anglocelt.ie/2025/05/08/mikel-arteta-claims-arsenal-were-the-best-team-in-this-seasons-champions-league/",
  "title": "Mikel Arteta claims Arsenal were the best team in this season Champions League",
  "date": "20250508T141500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta claims Arsenal were the best team in this season’s Champions League\nBy Philip Duncan, PA, Paris\nAn emotional Mikel Arteta insisted Arsenal have been the best team in the Champions League this season and did not deserve to lose their semi-final as he revealed their defeat against Paris St Germain left his players in tears.\nArsenal’s hopes of silverware, and bid to win the Champions League for the first time, ended following their 2-1 defeat at the Parc des Princes on Wednesday.\nThe Gunners were already trailing by a goal in the semi-final, and despite forcing goalkeeper Gianluigi Donnarumma into two fine saves inside the first 15 minutes, they fell further behind when Fabian Ruiz opened the scoring after 27 minutes.\nAchraf Hakimi killed the tie in the second half before Bukayo Saka scored what would prove only a consolation in a 3-1 aggregate loss.\nHowever, Arteta told TNT Sports: “I don’t think there has been a better team in the competition so far from what I have seen, but we are out.”\nAnd later at his press conference when asked if he felt the best team had lost, he added: “Yes, and I am saying that because they (PSG) just told me that. Today I see how much my players wanted it because they were in tears.\n“We deserved much more. When you analyse both games, the MVP (Most Valuable Player), has been their goalkeeper.\n“The Champions League is decided in the boxes, and it’s won them the game. The result should have been very different. It gives me so much pride, but at the same time I’m so upset and so annoyed that we didn’t manage to do it.”\nArsenal’s sole hope of silverware rested on the European Cup after Liverpool were crowned Premier League champions with four matches remaining.\nThe Gunners have finished runners-up for the past two seasons in the league, and head into their final three matches again occupying second place.\nArteta has revived Arsenal’s fortunes on both the domestic and European stage with this their first Champions League semi-final appearances in 16 years. But his five-and-a-half-year tenure has yielded just one trophy – their 2020 FA Cup triumph.\nAnd when asked if he was concerned his current crop of stars do not have what takes to win trophies, Arteta replied: “Well, it depends. Two years ago, nobody believed that we could qualify for the Champions League, or even think that we could finish second and compete in the league. And the amount of points that we have scored in other years, makes you a champion.\n“The reality is you need something to lift, and to get that trophy, and the disappointment is that we don’t have it.\n“But we have the best example in the PSG dressing room with Marquinhos. Eleven times, he has tried to win the Champions League. Eleven times and let’s see if they win the final. You have to go up and down.\n“So we need to look in the mirror at somebody like this with that trajectory and if you want to be in sport and you want to be competing for trophies, you better be able to deal with that.”\nPSG have now beaten three Premier League sides in a row, with Arsenal following Liverpool and Aston Villa in succumbing to the French champions. PSG also beat Manchester City in the group phase.\nEnrique was asked to address Arteta’s claim that PSG had suggested the Gunners were the better team over two legs.\n“I don’t agree at all,” said Enrique. “Mikel Arteta is a great friend, but I don’t agree at all.\n“They played in a clever way, but in the two legs we scored more than them and that is the most important thing in football. Arsenal played a great match, and we suffered, but we deserved to get to the final.”",
  "word_count": 647,
  "scraped_at": "2026-02-14T02:11:36.685040",
  "_text_extracted": true
}