{
  "article_id": "13958f56df57",
  "url": "https://www.dutchnews.nl/2023/09/arsenal-4-0-psv-eindhoven-boszs-side-outclassed-on-cl-return/",
  "title": "Arsenal 4 - 0 PSV Eindhoven : Bosz side outclassed on CL return",
  "date": "20230921T000000Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal 4-0 PSV Eindhoven: Bosz’s side outclassed on CL return\nPSV Eindhoven were dealt a harsh lesson in finishing on their return to Champions League football as they slumped to a 4-0 defeat in London.\nPeter Bosz’s decision to name an attacking line-up backfired as his team were run ragged in the early stages and punished for failing to close down Arsenal’s fleet-footed front line.\nThe Gunners took an early lead when Bukayo Saka thumped in a rebound after Walter Benitez could only parry a shot by Martin Ødegaard in the eighth minute.\nTwelve minutes later Belgian winger Leandro Trossard drilled a shot into the right-hand corner to double the lead. And Gabriel Jesus made it three before half-time when he took down a cross by Trossard and fired it past Benitez.\nPSV improved in the second half, but were unable to stop Ødegaard rounding off a standout performance with a long-range shot into the bottom corner after 70 minutes.\nPSV’s next match is a reunion between striker Luuk de Jong and his former club Sevilla in Eindhoven on October 3.\nIn the other match in Group B, the Spanish side drew 1-1 at home to Lens. Sevilla went ahead with a header by Lucas Ocampos inside 10 minutes, but a fine free-kick by Angelo Fulgini midway through the first half earned the French visitors a point.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 283,
  "scraped_at": "2026-02-14T01:48:28.233717",
  "_text_extracted": true
}