{
  "article_id": "13ae9e89851e",
  "url": "https://www.caughtoffside.com/2023/04/27/arsenal-bottlers-or-man-city-brilliance-bit-of-both-opinion/",
  "title": "Arsenal bottlers or Man City brilliance ? Bit of both",
  "date": "20230427T103000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rival fans, former players and pundits alike will now be taking their positions in one of two camps – either Arsenal have thrown the title away, bottled it, choked at the crucial moment, or, they’ve ultimately come up against a Manchester City side that are miles ahead of them and we’re finally seeing that reflected as the season draws to a close.\nThe truth is probably somewhere in between, and it may well be that it is in part Man City’s brilliance that has caused Arsenal to panic, knowing that there was so little room for even the smallest slip-up, but there can be no denying that, even before last night’s game that seemed to show the gulf between the two sides, the nerves had begun to set in in Mikel Arteta’s youthful squad.\nEven if William Saliba had been fit, there may well have been too much for Arsenal at City, but it’s also true that if Arteta had made some better decisions and if the players had kept their cool, last night’s result might not have mattered nearly as much. The title was lost in that run of three consecutive draws against Liverpool, West Ham and Southampton, not at the Etihad Stadium last night.\nFor Arteta’s part, he’d been dealt a difficult hand with the Saliba injury, but still played it badly – it was abundantly clear that Rob Holding was not good enough to step in for such an influential player, and yet the Spanish tactician has persisted with him in this dire four-game run. Perhaps it’s inexperience, and we certainly need to remember that Arteta is a rookie compared to the likes of Pep Guardiola, Jurgen Klopp and indeed most other managers in the Premier League, but with hindsight it also looks like a tactical weakness, an inability to adapt the team’s formation and all-round approach, simply carrying on with the same system despite one of its most important components missing.\nSome of Arsenal’s most important players are not blameless either, however. We rightly praised Aaron Ramsdale’s late brilliance that saved the game at Anfield, but he’s gone down a level in recent games, particularly with that error against Southampton and arguably on last night’s opening goal by Kevin De Bruyne as well. Elsewhere, Bukayo Saka has been sensational for so much of the season, but has been a lot quieter when it mattered most, even forgiving him that penalty miss against West Ham. Thomas Partey has looked tired and dropped a level, and Gabriel Jesus and Oleksandr Zinchenko haven’t really looked like the experienced leaders they were supposed to be.\nCompeting with this Man City side is no mean feat – just ask Liverpool – but it’s also an undeniable fact that Arsenal got themselves into a very strong position and let it slip. They don’t come close to having the squad or the all-round resources of the reigning champions, but they are more than good enough to have swept aside West Ham and Southampton.\nChampions League football has been secured and that has to go down as an achievement, but there are still worrying similarities to how this same group of players threw away a top four finish last term. Two seasons in a row have now finished worse than they should have done, and this is with a club that already seems to have ‘bottling it’ embedded in its DNA. In Arteta they have a great young manager, and in Saliba, Saka and Martinelli they have some of the best young players in world football, but these experiences can be grating and hard to overcome. A huge opportunity has been missed which may not come again soon.",
  "word_count": 614,
  "scraped_at": "2026-02-14T01:50:29.466365",
  "_text_extracted": true
}