{
  "article_id": "13af6a8c2cec",
  "url": "https://www.90min.com/features/real-madrid-vs-barcelona-who-will-win-el-clasico-26-10-24",
  "title": "Real Madrid vs Barcelona : Who will win El Clasico ? ",
  "date": "20241026T034500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid vs Barcelona: Who will win El Clasico?\n- Real Madrid and Barcelona meet in El Clasico on Saturday night\n- Both sides enjoyed enthralling midweek wins in the Champions League\n- Barca currently lead La Liga title race by three points\nThe biggest game in Spanish and arguably world club football takes place on Saturday night as bitter La Liga rivals Real Madrid and Barcelona meet in El Clasico.\nThe pair of Spanish giants have dominated the nation's league standings throughout history and approach this fixture in buoyant moods after each securing their own monumental results in midweek Champions League action.\nBut who should fans expect to claim the points when the two European behemoths take to the Bernabeu turf this weekend?\nRecent form\nIt was undoubtedly tough to judge Barca's prospects this season after a dizzying end to the last campaign which included former manager Xavi Hernandez losing his job.\nHowever, his replacement Hansi Flick has overseen a wonderful start to the 2024/25 season, with the Blaugrana sitting pretty at the top of La Liga after winning nine of their first ten matches. The only blip so far has been a surprising 4-2 defeat at Osasuna, but memories of that defeat are fading quickly, especially after the thrashing they handed out to Bayern Munich on Wednesday.\nIn a fixture which has been more than just a tough watch for Barca fans in recent memory, Raphinha put the Catalan giants ahead inside the first minute and ended up with the match ball after bagging a hat-trick. Robert Lewandowski, who now has 15 goals this season, also netted before half-time against his former side.\nIt turned out to be a pretty easy night's work for Barca, though the same can't be said for Madrid's midweek result despite an eventually handsome scoreline.\nThe reigning Spanish and European champions were 2-0 down to Borussia Dortmund, the team they beat in last season's Champions League final, at half-time on Tuesday night. However, Antonio Rudiger's header kickstarted the comeback as Vinicius Junior bagged a treble of his own to rival compatriot Raphinha, with Lucas Vazquez also getting on the scoresheet.\nTheir revamped attack is yet to truly click despite goals coming regularly for new signing Kylian Mbappe, while Jude Bellingham hasn't struck at all so far this season, a marked difference from his electric start to his Los Blancos career last year.\nLast 10 results in El Clasico\nEven if Barca's recent form and performances have been more impressive than Madrid's, the recent head-to-head record points favourably in the direction of Carlo Ancelotti's side.\nLos Blancos have won the last four meetings with their fierce rivals, the most recent of which was a dramatic 3-2 success at the Bernabeu back in April this year. It was Bellingham who got the 91st-minute winner after his side had twice fallen behind.\nThat win helped Madrid go 11 points clear of Barca on their way to the La Liga title and was part of a breathtaking unbeaten run which can soar to record-breaking heights if they triumph on Saturday night.\nSince being beaten 3-1 by Atletico Madrid in September last year, Madrid have picked up 31 wins, 11 draws and no defeats. The current record for most consecutive matches without a loss in La Liga stands at 43 and is held by Barca, who achieved the feat between 2017 and 2018.\nBarca did beat Madrid in a pre-season friendly during the summer but their last competitive victory in this fixture came in 2023 as they took a 12-point lead on their way to the Spanish top-flight title.\nBiggest injury absentees\nWhile there will still be a number of the world's biggest stars in action on Saturday night, both Ancelotti and Flick have some big injury absences to deal with.\nFor the hosts, both goalkeeper Thibaut Courtois and winger Rodrygo have been ruled out of contention, meaning they will sit in the stands alongside Dani Carvajal and David Alaba. Brahim Diaz is back in training and could be involved for the first time mid September.\nThere's also a major issue between the sticks for Barca. Inaki Pena has looked wobbly since replacing Marc-Andre ter Stegen, who suffered an anterior cruciate ligament blow earlier in the season, and free signing Wojciech Szczesny is unlikely to be thrown in for his debut.\nOn top of that, Andreas Christensen, Eric Garcia, Ronald Araujo, Marc Bernal and Ferran Torres are all unavailable.\nKey battles to look out for\nThere are some truly mouthwatering individual battles to watch out for on Saturday night.\nBoth Vinicius and Raphinha bagged midweek hat-tricks and will be full of confidence, meaning it could be a tough night's work for both Jules Kounde and Lucas Vazquez, who will be tasked with keeping each team's dangerous Brazilians quiet.\nThe midfield battle is bound to be intriguing, too. Barca evoked memories of their famed Xavi-Busquets-Iniesta trio during the embarrassment of Bayern, with the crowd bringing out their most triumphant 'oles' as the likes of Pedri, Marc Casado and Fermin Lopez popped the ball around in the middle of the park.\nMadrid have their own ball-playing genius in the form of Luka Modric, but the engines of both Jude Bellingham and Federico Valverde will be crucial in disrupting the visitors' rhythm.\nReal Madrid vs Barcelona prediction\nThe world's best rivalries are often unpredictable when it comes to matchday. With such incredible talent in attack on display, the scoreline could be anything. There also hasn't been a draw in this fixture since December 2019, which points towards a winner one way or the other this weekend.\nGiven the free-flowing nature of their victory in midweek, Barca may well be slight favourites. Their ease in possession and form in the final third is tough to look past, even if Madrid often find a way to defy the odds.\nLos Blancos have their own piece of history they're chasing and could as easily put five goals past Pena as lose on Saturday night, but the Spanish champions are yet to click into gear and might get a wake-up call this weekend.",
  "word_count": 1018,
  "scraped_at": "2026-02-14T02:08:12.410548",
  "_text_extracted": true
}