{
  "article_id": "13c04c4aad7f",
  "url": "https://www.westmeathexaminer.ie/2023/06/28/arsenal-sign-kai-havertz-from-chelsea-and-look-set-to-add-declan-rice/",
  "title": "Arsenal sign Kai Havertz from Chelsea and look set to add Declan Rice",
  "date": "20230628T233000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal sign Kai Havertz from Chelsea and look set to add Declan Rice\nBy PA Sport Staff\nArsenal have signed Kai Havertz from Chelsea on a “long-term contract” and have reportedly moved closer to sealing a deal for West Ham captain Declan Rice.\nHavertz joins after three years with the Blues, during which he made 139 appearances, scoring 32 goals, including the winner in the 2021 Champions League final.\nThe news regarding the 24-year-old Germany international comes as it was reported that Arsenal had also agreed a £105million fee with West Ham for Rice.\nHavertz said on Arsenal’s official website: “It’s super exciting for me to be joining this amazing club and to be part of the Arsenal family. This club has such a big history, and I hope we can achieve lots of things.\n“The mentality in the Arsenal squad is very high and you can feel that. That was one of the reasons why it has been so hard to play against Arsenal recently.\n“The aim is to win trophies and I’m going to give everything to do that for the supporters and everyone at the club. I’m now looking forward to meeting all the players and the staff when we come back for pre-season.”\nThe former Bayer Leverkusen player posted a message on social media bidding farewell to Chelsea, saying he was writing “with a heavy heart…saying goodbye to the club that has become my second home, and to the incredible fans who have supported me throughout this amazing journey.”\nArsenal boss Mikel Arteta said: “Kai is a player of top quality. He has great versatility and is an intelligent player. He will bring a huge amount of extra strength to our midfield and variety to our play.\n“We welcome Kai and his family to Arsenal Football Club and we are all excited to start working with him when we start pre-season training soon.”\nHavertz’s signing could soon be followed by England midfielder Rice, with an agreement reportedly reached over a fee for the midfielder after two previous approaches were rebuffed by West Ham.\nManchester City ended their interest in Rice after Arsenal’s third bid.\nIt is believed Arsenal offered £100m and a further £5m in potential add-ons. It would make Rice the most expensive British player of all time and eclipse Arsenal’s previous record transfer.\nMeanwhile, a move for Ajax full-back Jurrien Timber is still being worked on as Arsenal aim to improve a squad that finished second in the Premier League last season, five points behind Pep Guardiola’s treble-winners City.",
  "word_count": 425,
  "scraped_at": "2026-02-14T01:56:02.402238",
  "_text_extracted": true
}