{
  "article_id": "13eab4f1033b",
  "url": "https://www.caughtoffside.com/2025/02/13/johan-bakayoko-liverpool-arsenal/",
  "title": "Exclusive : Liverpool seriously considering move for €50m Arsenal target who desperate for PL transfer",
  "date": "20250213T070000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool and Arsenal are among the strongest suitors for PSV winger Johan Bakayoko ahead of the summer, sources have told CaughtOffside.\nThe Belgium international has impressed a great deal in the Eredivisie, and has long been the subject of links with big moves away.\nBakayoko previously turned down big money to move to the Saudi Pro League and has his heart set on a move to English football next, CaughtOffside understands.\nLiverpool are seriously considering making a move for Bakayoko this summer, while Arsenal are also expected to be one to watch in the race for the 21-year-old, whose price tag would likely be in the region of €50-60m.\nSources also believe Newcastle United, Borussia Dortmund and RB Leipzig have been monitoring Bakayoko and could also come into the conversation.\nWhat next for Johan Bakayoko as long list of transfer suitors emerge?\nBakayoko clearly won’t be short of options this summer, with Liverpool understood to be big admirers of his qualities as they recently got a close look at him when the two teams met in the Champions League.\nLFC might find that they need a new signing in attack this summer as star player Mohamed Salah is now just a few months away from the end of his contract and a potential free transfer out of Anfield.\nArsenal also see Bakayoko as a stand-out option in attack, despite Mikel Arteta’s fondness for Nico Williams, so the Gunners could also try making a move that could be important to take the burden off Bukayo Saka to be their main man up front.\nNewcastle could also be seen as a tempting project for Bakayoko as he wants to play in the Premier League next and might get more guaranteed playing time in Eddie Howe’s side.\nStill, it will be interesting to see if the likes of Dortmund and Leipzig can also persuade Bakayoko as they are two clubs who have both done such excellent work with young players in recent times.",
  "word_count": 330,
  "scraped_at": "2026-02-14T01:58:05.351514",
  "_text_extracted": true
}