{
  "article_id": "141b435807fe",
  "url": "https://theathletic.com/5127803/2023/12/11/barcelona-girona-la-liga-xavi-araujo/",
  "title": "Barcelona Girona defeat unmasks several big problems for Xavi",
  "date": "20231211T104500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ronald Araujo ripped off the black mask protecting his broken jaw and threw it behind Inaki Pena’s goal. He’d had enough of it now the match was getting serious.\nAraujo’s action — in the 36th minute — epitomised Barca’s frustration against a team that was superior in every aspect on Sunday night. Girona came to Montjuic to show why they are the leading side in La Liga and their impressive display put Barcelona’s shortcomings in front of a mirror as they went two points clear of Real Madrid.\nAdvertisement\nWith this 4-2 defeat, Barca concluded a cycle of three crucial matches. Before victories over Porto and Atletico Madrid, pressure had grown over Xavi’s position as manager after a bad run that started with the 2-1 Clasico defeat against Real Madrid on October 28.\nAgainst Porto, they managed to heal some of their recent European trauma by qualifying for the Champions League knockout stages for the first time since 2021. Against Atletico, they produced one of their best performances of the season — it was long overdue — to defeat a team in excellent form. The last hurdle was surprise package Girona, who were playing the best football in La Liga.\nBarca used to be that team, playing with the same captivating confidence. Beating Girona would have been a way of saying they hadn’t gone away completely, a way to convince observers their recent slump in style was nothing fundamental.\nThings didn’t go that way. Girona overwhelmed Xavi’s side. Four major reasons explain what went wrong.\nFirst, there was the defence. Last season, Barca’s back line was the best in Spain, one of the best in Europe and a major reason the team won La Liga. Now they are conceding many more goals, especially in the first half of matches. They have conceded 18 goals in 16 games in the league. Over the whole of 2022-23, they let in just 20.\nA mistake by Andreas Christensen — bypassed too easily by a Yan Couto through ball — led to the first for Girona. There was nowhere near enough pressure on Miguel Gutierrez before he made it 2-1 and Jules Kounde was at fault as his weak challenge in a 50-50 saw the away side score their third of a famous night. They had never before beaten Barcelona.\nAraujo, wearing the captain’s armband, reacted angrily. He had already thrown off his face protection even before Girona’s second goal. Goalkeeper Pena, deputising while Marc-Andre ter Stegen is out with a back problem that requires surgery, was left exposed too often.\n🗣️ Xavi: \"The fans are angry, but today the match was not bad. The match was in our hands, but we did not take advantage of it. After 31 shots on goal we have to be more effective.\"\n— Barça Xtra (@XtraBarcaa) December 10, 2023\nBarca’s display was not much better in attack. The home side created many more chances than their opponents — 31 to Girona’s 15 — but they made a lot of mistakes in their finishing. For weeks now, the forwards have had a problem finding the net. They don’t combine well together and the team hardly looks for their main centre-forward Robert Lewandowski, who is out of form.\nAdvertisement\nThe Poland international, 35, has been erratic in the past few games. He loses possession, doesn’t help in pressing when Barca don’t have the ball, and generates very few openings. Even though he scored to level the match at 1-1 on Sunday, he was largely overlooked again and missed a simple chance that would have seen Barca draw level at 3-3 in stoppage time.\nGO DEEPER\nInside Girona's unlikely rise: Pep Guardiola's brother, Manchester City and table football\nThe third issue is the team appears short on ideas without the ball. In possession, Barca created chances and tired their opponents. Without the ball, they did not look strong. They struggled to put real pressure on Girona and found it difficult to contain them. Towards the end of the game, Lamine Yamal was alone in trying to win the ball back while his team-mates were practically static, with the scoreline weighing heavily on them. Girona, meanwhile, executed their pressing expertly.\nXavi’s selection and tactics were also predictable and easy to read. Girona’s manager, Michel, had a week to prepare for the match knowing which starting XI Barca would put out — it was obvious they would not make changes after last weekend’s 1-0 win over Atletico. Michel’s selection, however, provided something of a curveball, especially with Eric Garcia shifted to the right side of defence and Couto deployed ahead of him.\nGirona’s performance was excellent, but it also exposed all these pre-existing problems Barcelona are going through. Things are beginning to look worrying for a team that has already shown mental fragility, especially in their struggles to recover from that Clasico defeat.\nMichel said his side would “enter another dimension” with victory. Barca will have left feeling imprisoned by the painful image they saw in the mirror and fans could only watch as a team with a far, far smaller budget produced a supremely cohesive display — one that should convince everyone of their title credentials.\n(Top photo: David S Bustamante/Soccrates/Getty Images)",
  "word_count": 871,
  "scraped_at": "2026-02-14T01:54:16.871500",
  "_text_extracted": true
}