{
  "article_id": "1423e16b9a61",
  "url": "https://www.sohu.com/a/872519107_122328931",
  "title": "Messi Exits the Roster : Argentina New No . 10 Emerges , Aiming for Revenge Against Uruguay _ his _ has _ Beijing",
  "date": "20250318T064500Z",
  "domain": "sohu.com",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On March 18, Beijing time, Inter Miami officially announced that Lionel Messi has suffered a mild injury to his adductor muscle, which has led to his unavailability for Argentina’s upcoming World Cup qualifiers against Uruguay and Brazil. Though Messi assured fans that the injury is not severe, the national team faces a significant challenge as they prepare to compete without their star player. This article explores the ramifications of Messi's absence, the emergence of a new No. 10 for Argentina, and the team's quest for redemption against Uruguay.\nThe Impact of Messi's Absence\nMessi's injury leaves a considerable void in the Argentina squad, which is set to encounter Uruguay away from home and Brazil at Estadio Monumental, Buenos Aires. The last time Messi missed a match for the national team was in September 2022. Argentina secured a win against Chile but suffered a disappointing loss to Colombia. At that time, Paulo Dybala donned the iconic No. 10 jersey; however, like Messi, Dybala is also sidelined due to injury.\nThe challenge now rests on other talented players to step up in Messi’s absence. This scenario not only reflects the team's depth but also highlights the pressure on Argentine players during crucial matchups against rival teams.\nWho Will Wear the No. 10?\nWith both Messi and Dybala out, the spotlight shines on Lautaro Martínez, who could become the new No. 10 for Argentina. Currently playing for Inter Milan, Lautaro has excelled this season, scoring 18 goals and providing 3 assists. His contributions have been vital in helping Inter Milan achieve prominence in Serie A and advance in the Champions League and Coppa Italia.\nNotably, Lautaro shares the fifth spot on Argentina’s all-time top scorers list alongside Diego Maradona, boasting 32 international goals. His performance domestically has positioned him as a key figure in Argentina's lineup. With an estimated value of €100 million, Lautaro's rise demonstrates his crucial status within the national team. The decision to assign him the No. 10 jersey could symbolize both continuity and evolution in Argentina's football journey.\nThe Quest for Revenge Against Uruguay\nArgentina's last encounter with Uruguay ended unfavorably, with a 2-0 defeat in the World Cup qualifiers. As the two teams prepare to face off again, the necessity for redemption has never been more compelling. Historically, Argentina has been successful against Brazil in previous encounters, thus creating a foundation for confidence as they approach their next matches.\nThe South American World Cup qualifying standings currently show Argentina leading with 25 points, closely followed by teams like Uruguay, Ecuador, and Colombia. This solid position indicates that successful outings against Uruguay and Brazil could potentially secure their qualification ahead of schedule, contributing further to the nation's football legacy.\nConclusion\nThe absence of Lionel Messi from the Argentina squad presents both challenges and opportunities. With Lautaro Martínez poised to step into the pivotal No. 10 role, Argentina aims for victory against Uruguay and Brazil, not just for points but for pride. As fans eagerly await these matchups, they are left to ponder: Are they capable of achieving consecutive wins and moving one step closer to World Cup glory?\nTo stay up to date with Argentina’s progress in the qualifiers and the implications of these matches, consider following the games and engaging with fellow fans online. Who do you believe can fill Messi's shoes the best in these upcoming challenges?返回搜狐，查看更多",
  "word_count": 560,
  "scraped_at": "2026-02-14T02:02:35.601600",
  "_text_extracted": true
}