{
  "article_id": "1435ce87623f",
  "url": "https://www.teamtalk.com/liverpool/learn-price-sign-clutch-premier-league-attacker-exit-clause-revelation-fuels-slot-dream",
  "title": "Liverpool news : Slot in dreamland as multiple sources boost chances of blockbuster deal for  clutch  Premier League attacker",
  "date": "20251014T153000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool chances of blockbuster deal for ‘clutch’ Premier League star revealed as multiple sources share huge update\nLiverpool’s prospects of signing Antoine Semenyo as a successor to one of their greatest-ever players, Mo Salah, has received a significant shot in the arm after details of his exit clause were leaked and the chances of raiding Bournemouth were rated.\nThe 25-year-old Ghana international has emerged as one of the Premier League’s best players so far this season, having played a role in nine goals (six scored, three assists) in eight matches so far – a record that currently puts him second only to Erling Haaland. That form has alerted several top suitors to the Bournemouth star’s very sizeable talents and Semenyo is already being talked about as a major transfer target for many a top side ahead of the 2026 transfer windows.\nLast week, it emerged that Liverpool were among the huge admirers of the former Bristol City star, whose skills coach has revealed the player is ready to take his game to the next level and light up the Champions League.\nFurthermore, the Reds appear to have already landed a sizeable advantage over their many rivals for his signature, amid claims the Merseysiders are already in a ‘strong position’ to sign him.\nNow hopes of a move to Merseyside have been given a significant double lift after two sizeable updates came to light.\nFirstly, talkSPORT journalist Alex Crook has revealed that Semenyo does have an exit clause in the new contract he signed at the Vitality Stadium this summer.\nAnd while the Cherries are doing their best to keep details of the clause under wraps, they are understood to value the player in at least the £75m (€86m, $100m) bracket.\nIn addition, football finance expert, Stefan Borson, has also explained why a deal of that size for Semenyo – branded a ‘clutch player’ by Fraser Fletcher, who has also assessed the chances of him leaving in January – would be difficult for Bournemouth to turn down.\n“I think it’s clear that Semenyo is going to be one of the targets for the summer that everybody’s going to be interested in,” Borson told Football Insider.\n“I think £75m feels like the absolutely achievable level for a player that’s got the demand that he’s got and the quality that he seems to be demonstrating week in, week out.”\nSemenyo’s exit chances rated by sources\nWe understand that the Cherries will do their utmost to fend off any offers for Semenyo mid-season and would be confident of doing so, with Andoni Iraola’s side pushing to secure a first-ever season of European football for the club.\nAnd depending on the conditions of that exit clause, they could look to drive up his asking price to nearer the £100m mark, depending on the clamour for his signing and how the 30-times capped Ghana international performs over the remainder of the season.\nHigh demand will most certainly equal a high price – not that the Cherries are looking to cash in on their “clutch star”.\nTEAMtalk understands that Semenyo’s ability to play off either flank, cut in and score goals means he is emerging as their number one target to replace Salah at Anfield, with their scouts having made regular checks on his progress in recent weeks.\nAnd according to Fletcher, Semenyo’s ability to drift in from the right and deliver in clutch moments mirrors Salah’s game, making him an ideal understudy.\nSources suggest Liverpool’s recruitment team, led by former Bournemouth chief Hughes, is confident of leveraging past ties to lure the forward to Anfield.\nHowever, sources are adamant he will not be sold mid-season, particularly with Bournemouth having ambitions to secure the club a first-ever place in European football next season.\nWith the Cherries under no pressure to sell mid-season, and with manager Andoni Iraola building a project around his star man, a source told TEAMtalk: “Antoine’s integral to our vision.\n“We’re chasing Europe, and he’s not going anywhere easily.”\nFletcher then explains that Semenyo himself is torn.\n‘The former Bristol City gem, who once trialled at Crystal Palace, craves the chance to shine on the biggest stages – be it the Champions League or a Premier League title race.\n‘His 13-goal haul across all competitions last season was a prelude to his current dominance, but loyalty to Iraola, who has elevated him to new heights, weighs heavily.\n‘As January approaches, whispers of a potential move grow louder, with Semenyo’s camp open to exploring options if a top club meets Bournemouth’s steep demands.’\n‘However, a move mid-season is unlikely, though the Reds could very well look to make their move by the time summer 2026 rolls around.’\nThat view is also shared by the Cherries’ managing director, Thiago Pinto, who insists the club were thrilled when Semenyo committed for ‘one more year’ during the summer.\n“Antoine has been amazing this season,” Pinto told talkSPORT.\n“I think he’s a lovely player, a lovely boy. For us, it was amazing to feel that he would be happy to stay one more season, even if other clubs were around him.\n“I think he scored eight or nine goals this season, so we couldn’t be more happy.”\nLatest Liverpool news: Slot’s seven-man target list; shock Isak links\nIt’s not just on the wing where Liverpool plan to strengthen in 2026, with the Reds now formulating plans to revolutionise in the centre of defence.\nTo that end, Liverpool’s recruitment team are casting their net far and wide to land upon at least one new defensive signing in 2026, with a seven-man shortlist drawn up and with sources rating the chances of a January raid for the name at the top of his wishlist, Marc Guehi.\nIncredibly, one man who Liverpool only recently signed, Alexander Isak, is already being linked with the Anfield exit door amid stunning claims he could replace a legendary frontman at a European giant after just one season at Anfield.\nTEAMtalk has explained, though, why such speculation could be treated with a pinch of salt.\nOn the subject of Isak, another problematic night in World Cup qualifiers saw his nation, Sweden, lose 1-0 to Kosovo and leave them on the cusp of elimination.\nOff the back of that dismal night, the Swedish media has rated Isak’s “fail” display, rating him a concerning one out of five for his performance.\nHe wasn’t the only Liverpool star to get a media bashing, either, with Florian Wirtz also getting a ragged write-up from a series of German publications and with one brutally claiming the £116m star ‘didn’t succeed with anything’.",
  "word_count": 1105,
  "scraped_at": "2026-02-14T01:52:49.026091",
  "_text_extracted": true
}