{
  "article_id": "1496b5dacb00",
  "url": "https://www.winnipegfreepress.com/opinion/columnists/2025/05/02/real-madrid-criticism-at-fever-pitch",
  "title": "Real Madrid criticism at fever pitch – Winnipeg Free Press",
  "date": "20250502T234500Z",
  "domain": "winnipegfreepress.com",
  "source_country": "Canada",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid criticism at fever pitch\nCoverage of Los Blancos blistering as club struggles in title games\nAdvertisement\nREAL Madrid Club de Futbol enjoyed a few hours of quiet on Thursday.\nRead this article for free:\nor\nAlready have an account? Log in here »\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nREAL Madrid Club de Futbol enjoyed a few hours of quiet on Thursday.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 02/05/2025 (288 days ago), so information in it may no longer be current.\nREAL Madrid Club de Futbol enjoyed a few hours of quiet on Thursday.\nArchrivals Barcelona weren’t in action, having thrilled in the first leg of their Champions League semifinal against Inter Milan the night before. So at least the jealousy had cooled.\nQuite briefly, they weren’t even the top story at their own club. Real Madrid Baloncesto had that honour after losing their EuroLeague basketball series to Olympiacos. Misery, at least for one evening, had company.\nOh, and things are miserable at Real Madrid — the football version. Miserable, and very, very loud. (Except for Thursday.) The mood is so bad amongst the team, the press and the fans that you’d never know Los Blancos are just four points off the top of La Liga with five matches still to play.\nWorking backwards, it’s somewhat surprising that the most coherent complaints (it’s all relative) are coming from the supporters. And there’s a reason for that.\nThis Madrid squad has no Raul, no Casillas, no Sergio Ramos — no player, in other words, who is universally popular and beyond the criticism of the socios who own the club and feel entitled to being heard.\nThere may be elite, high-profile players in the team, but there are no favourites. Which means, perhaps fairly, that the public can blame everyone equally.\nJesus Vallejo, Lucas Vazquez and David Alaba were named the three most unpopular Meringues in a recent poll by Diario AS, but none exceeded 15 per cent of the votes. Eight players hit the 5 per cent mark. There’s plenty of anger to go around.\nBut we should really put this all into context.\nReal Madrid won La Liga and the Champions League last year. It was a good year. It might have even exceeded expectations, which are to win at least one of those trophies and contend for the other, at minimum.\nDavid Beckham, who’d won it all at Manchester United when he moved to the Spanish capital, was blown away by the standards at Madrid. This is an outfit where losing any game, at any point of the season, in any competition, is completely unacceptable. And there’s been some losing of late.\nLast weekend, they lost the Copa del Rey final to Barcelona. Intolerable. Eleven days before that, they lost their Champions League semifinal to Arsenal. Deplorable. In January, they lost the Supercopa de Espana to, extra disgracefully, Barcelona.\nThat said, the supporters haven’t quit on the season. Win out and they only need the slightest wobble from the Catalans to claim the title.\nIt’s the press that’s given up.\nThe country has a half dozen sports dailies and even more TV and radio programs, many of which are unapologetically partisan regarding Real Madrid. They’ll cheer from the media gallery and even serve as a club mouthpiece when things are good. When things are bad they’ll hiss, bay or bellow depending on what’s going on. They can be absolutely vicious.\nBut they’re not stupid. Eventually, after blaming this person or that, or attacking the match tactics, recruitment strategy or off-field distractions, they’ll typically arrive at the right conclusion.\nLate last month Alfredo Relano, the dean of Spanish sportswriting, correctly observed in AS that this Real Madrid team lacks courage, has no precision and, most importantly, has been badly built. Writing in Marca, Ruben Jimenez soberly conceded that the squad’s many problems were rooted in careless planning.\nIt was a not-so-subtle dig at the acquisition of Kylian Mbappé.\nWhile the France forward has notched an impressive 34 goals this term, he’s also upset the balance that was so integral to last season’s successes. Vinicius Junior isn’t scoring at quite the same clip; Rodrygo isn’t nearly as effective; Jude Bellingham is a shadow of the world-class midfielder who took La Liga by storm in 2023-24.\nInstead of signing Mbappé, who is nevertheless a top-five player in the world, the consensus is that Madrid would’ve been better off replacing Toni Kroos in the centre of the park and strengthening the back-line.\nThat they opted for the glamour and shirt sales of Mbappé is down to club president Florentino Perez, who might be the only figure who understands that Real Madrid don’t have to win every year to make a whole lot of money. Of course, that doesn’t mean he won’t play his own blame games when his plans go awry.\nThe club, through its media arm Real Madrid TV, meticulously analyzes referees at the best of times, and lately their criticism has been blistering.\nUpon learning the slate of referees for the upcoming round of matches, which includes Madrid’s home contest against Celta Vigo (7 a.m., Sunday, TSN 4), the channel railed against the official assigned to them as being responsible for “the biggest refereeing scandal in recent times.” What he did was disallow a Bellingham goal that came after the final whistle.\nIn February, Perez went so far as to send a letter to La Liga’s authorities in which he claimed “decisions against Real Madrid have reached a level of manipulation and adulteration… which can no longer be ignored.”\nThe situation has become so vitriolic that the referee for the Copa del Rey final nearly broke down when describing the abuses directed at his family — and that was before Real Madrid defender Antonio Rudiger was given a six-match ban for throwing an ice cube at him from the bench.\nGiven the threats to in-game and public safety one almost wishes Madrid would win comfortably against Celta, if only to lower the temperature.\nBut that’s exactly the problem, and exactly what Los Blancos want.\nReal Madrid may have enjoyed a bit of quiet on Thursday, but it was more a reprieve for everyone else. It’s gotten a whole lot noisier since, and it’s likely the volume will continue to squelch until the summer.\nIn the meantime, all we can do is plug our ears, stay out of Rudiger’s throwing range and maybe hope the basketball team is thumped by Valencia this weekend.\njerradpeters@gmail.com\njerradpeters.bsky.social\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.",
  "word_count": 1310,
  "scraped_at": "2026-02-14T01:52:20.880021",
  "_text_extracted": true
}