{
  "article_id": "14b02290dd41",
  "url": "https://www.anglocelt.ie/2023/06/08/john-stones-relishing-key-role-as-manchester-city-chase-treble-glory/",
  "title": "John Stones relishing key role as Manchester City chase treble glory",
  "date": "20230608T203000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Stones relishing key role as Manchester City chase treble glory\nBy Carl Markham, PA\nManchester City defender John Stones could cap a remarkable turnaround from a virtual outcast to being at the cutting edge of Pep Guardiola’s masterplan with a Champions League victory.\nThree years ago the 29-year-old’s future was uncertain. He had made just 24 appearances in the 2019-20 season and the club had spent over £100million on centre-backs Nathan Ake and Ruben Dias.\nThat summer Guardiola admitted there was a distinct possibility a player lacking confidence could leave and he did not play a minute in seven of the eight opening league games of the next season.\nBut over the course of three seasons he has turned things around so much he is now seen as an integral part of his manager’s latest tactical tweak, with the current fashion for a defender to play as a midfielder when the side is in possession.\n“It was probably one of the hardest times in my career,” said Stones of that period in 2020.\n“I literally went back to firstly looking at myself, being super-critical of myself and what I could do better on the football pitch, and then looking into every fine detail, down to what food, what training, what extras.\n“That’s come down to doing stuff here and then going home and doing work, even late at night, or straight after the training, finding these small margins, putting them all together to kind of break where I was at after coming back to playing.\n“Yeah, (it was a) big learning curve for me and maybe who I am today.”\nIn that time period a number of players have left, with Guardiola’s propensity for dispensing with full-backs a little too close for comfort at times for Stones.\nBut the former Everton defender never considered seeking opportunities elsewhere.\n“I never thought about that. I think as soon as you accept that or have that mindset then you have killed yourself,” he added.\n“I always wanted to stay, I have stayed and I absolutely love it. I wanted to prove to myself. I didn’t say to anyone ‘It was because I want to prove to you’.\n“I think, if anything, you have to prove to yourself first and foremost that you deserve to be here, you are good enough to be here, and what you bring to the team.”\nThe goals of Erling Haaland have helped propel City to a second Champions League final in three years where they start as strong favourites against Inter Milan in Istanbul.\nBut Stones’ role and that, to a lesser extent, of Rico Lewis in stepping forward has added another dimension to an already multi-layered team.\n“People have always said from a young age that they can see me playing in there. I still do love playing as a centre-half and I’ve absolutely loved this role as well,” said the Barnsley-born defender.\n“I think I have showed myself that I’m able to do it, maybe showing some attributes that I didn’t know that I had.\n“But the manager has seen (something) in me and ultimately I think I’m just trying to show what I can do in there and be able to help the team ultimately win with my attributes.”\nCity may be the favourites but Stones insists they will not be under-estimating Inter, a team who finished in third 18 points behind Serie A champions Napoli.\n“They’re in the Champions League final for a reason,” he added.\n“No matter who we’re playing, no matter what league they’re in, we give the team the respect that they deserve because even the FA Cup, let’s make an example of that, there’s giant-killers, smaller teams in League One and League Two that beat Premier League winners.\n“That’s where the respect (comes from) that every team deserves.\n“They’ve got incredible players. How they played in a big occasion, in a derby game in the Champions League semi-final (against AC Milan) is never easy.\n“We know what we’re up against, they are an incredible team.”",
  "word_count": 676,
  "scraped_at": "2026-02-14T02:07:02.901436",
  "_text_extracted": true
}