{
  "article_id": "14d1eaaefbf8",
  "url": "https://www.bbc.com/sport/football/articles/c041qv7ke7vo",
  "title": "Man Utd 2 - 0 Man City : Pep Guardiola refuses to blame officials after loss",
  "date": "20260117T191500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'No energy' and 'predictable' - Guardiola won't blame VAR for derby loss\n- Published\nManchester City were outfought by rivals Manchester United on Saturday lunchtime in a derby defeat that not only gave their neighbours a winning start to a new era, but also dealt a further blow to the Citizens' title hopes.\nCity's demoralising 2-0 loss at a raucous Old Trafford allowed the home faithful to deservedly claim the bragging rights over their closest geographical rivals as they revelled in the perfect start to Michael Carrick's tenure as interim head coach.\nBut for the blue half of the city, defeat leaves them clinging to the title race by their fingertips, potentially falling nine points behind leaders Arsenal by the end of the day.\nThis was City's sixth game in 17 days and boss Pep Guardiola felt a lack of energy contributed to the defeat, rather than referee Anthony Taylor's decision to not send off United's Diogo Dalot in the first half.\n\"The better team won,\" said the Spaniard. \"They had something we didn't have. We always talk about the energy we need. It's related to how you defend, some moments, some duels and some situations, but also with the ball.\n\"It's my 27th derby. I came here many times and [today] we were not at the required level to win this type of game.\n\"We try. We talk about that but we had that energy four days ago at Newcastle. Even at Sunderland and the three games we draw we played extremely good in many departments but today, no.\n\"Just accept it and move on.\"\nShould Dalot have been sent off?\nUnited scored twice in the second half through Bryan Mbeumo and Patrick Dorgu, and also had three goals ruled out for offside, hit the woodwork twice and forced visiting goalkeeper Gianluigi Donnarumma into a string of saves.\nThe hosts could have been reduced to 10 men inside the first 10 minutes when full-back Dalot caught Jeremy Doku in a knee-high challenge with his studs.\nReferee Anthony Taylor brandished a yellow card and the decision was supported by the video assistant referee (VAR).\nThe Premier League match centre explained the decision by saying: \"The referee's call of yellow card to Dalot for a reckless challenge was checked and confirmed by VAR - with the contact deemed to be glancing and not with excessive force.\"\nGuardiola said: \"It's a red card but it would be poor as a manager to analyse that as the reason for [losing] the game - it is what it is.\n\"For 85 minutes 10 against 11 I believe, but if we played with the energy that we did, we were nowhere near that. I could say that and blame [the decision], but we will not grow up and move forward.\n\"It happened and it is not a surprise. It happened in the past when I arrived here. Honestly, we have to look at ourselves. If the players have excuses, we will be in trouble in the future.\n\"We have to look at ourselves and today the analysis is simple - Manchester United were better and we have to accept it.\"\nFormer Premier League official Darren Cann told BBC Sport he thought Dalot was \"very fortunate to escape a red card\".\n\"It's a hard one to see at normal speed live on the pitch from the referee's angle but with the benefit of replays I do feel that Dalot is very fortunate not receive a red card,\" he added.\n\"Had the referee been invited to the screen I am sure he would have been shown a red card.\"\nEx-England striker Alan Shearer told BBC Sport: \"I think VAR got that terribly wrong. For me that was a clear red card.\n\"Forget about whether the contact was 'glancing' or not. I can understand why the referee hasn't given it, it might have been difficult for him to see it, but when the VAR has two professionals looking at that it should have been a very easy decision to give a red card.\"\nInterim United boss Carrick said: \"I have not seen it but I thought at the time Diogo got the ball and kicked it out. I did not think for one second it was a bad challenge.\"\nGuardiola says City were 'predictable'\nFollowing this loss and draws against Sunderland, Chelsea and Brighton, City are winless in their past four league games and have handed a major advantage to Mikel Arteta's Arsenal.\nCity are close to completing the £20m signing of Crystal Palace captain Marc Guehi to bolster their defence, but the arduous schedule now appears to be catching up with their front players.\nStriker Erling Haaland is in a barren run of form, scoring just once - from the penalty spot - in his past seven games and without a goal from open play since 20 December.\nThe Norwegian was out-battled by United defender Lisandro Martinez on Saturday, managing just 14 touches of the ball and failing to have a shot on target.\nPhil Foden has gone eight straight games without scoring while substitute Rayan Cherki, who scored late on at Newcastle during the week, was unable to influence the game.\nThis was just the sixth time in 364 Premier League games under Guardiola that Man City had just a single shot on target, they have never not had one in a game under him.\nCity's expected goal (xG) rate of 0.45 in the contest was the second lowest recorded in Guardiola's 364 games in charge in the Premier League.\nThe 54-year-old, whose birthday is on Sunday, told BBC Match of the Day: \"We were not good enough up front. We could not do it. I had a feeling we didn't have and they had it and they deserve it.\n\"Normally in the beginning of the game when they come to Etihad Stadium our rhythm is another one and it's normal doing that.\n\"Offensively we did not have the intention in the final third to score a goal, to make a cross, to make a movement. We were more predictable.\"\nCity will aim to get their season back on track with a trip to Bodo/Glimt in the Champions League on Tuesday.\nTactical analysis: Nunes a miss\nDespite boasting 68% of possession, City were limited to one shot on target and the second lowest xG of Guardiola's Premier League career.\nUnited looked to funnel City into wide areas before defending intensely with four players. On the left, for example, Bruno Fernandes, Patrick Dorgu, Kobbie Mainoo and Luke Shaw converged to reduce the time and space City had.\nThe number of players committed to the side the ball was on meant the space was on the far side, but City struggled to switch the point of attack, something Antoine Semenyo, Jeremy Doku and Rico Lewis do less of than some of their team-mates.\nPhil Foden on the right wing or Matheus Nunes have shown this ability in the past and the latter was a particular miss.\nCity lacked Nunes’ physical profile to help deal with United’s threat on transition by tracking the runs of Patrick Dorgu and aiding Rodri, who found himself having to deal with both Mbeumo and Bruno at times.\nWhen penned back, United defended in a way that gave time and space to the City centre-backs more than anybody else.\nBut, despite stopping numerous counter-attacks, when he had possession Abdukodir Khusanov struggled to take advantage of the spaces United left, as did Nathan Ake and Max Alleyne.\nTheir lack of ball-playing quality meant City struggled in a way they may not have done if they'd had the injured Josko Gvardiol, John Stones and Ruben Dias on the pitch.",
  "word_count": 1283,
  "scraped_at": "2026-02-14T01:55:32.913637",
  "_text_extracted": true
}