{
  "article_id": "14ff1af540df",
  "url": "https://www.90min.com/posts/man-utd-target-frenkie-de-jong-speaks-barcelona-future",
  "title": "Man Utd target Frenkie de Jong speaks out on Barcelona future",
  "date": "20230310T133000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd target Frenkie de Jong speaks out on Barcelona future\nFrenkie de Jong has cast doubt over a potential transfer to Manchester United by reaffirming his commitment to Barcelona.\nThe 25-year-old was linked with a move to Old Trafford throughout the summer amid a dispute over unpaid wages at Barca, but ended up staying in Spain despite United's best efforts to negotiate a deal.\nDe Jong previously worked under current United manager Erik ten Hag at Ajax and is known to still be in contact with his former manager.\n90min understands that United remain interested in luring De Jong to Manchester, as they look to re-establish themselves as a significant force in European football, but there's been no inclination that the Dutch midfielder will look to force a move away from Catalonia.\nIndeed, De Jong's latest comments to RAC1 indicate that he wants to remain at Barcelona for the time being and continue living out his childhood dream.\n\"I was calm, because I knew I wanted to continue at Barca and I haven't changed my opinion,\" De Jong said.\nREAD NEXT\n\"I had always dreamed of playing for Barca and I want to succeed as a Barca player. And now I'm calm and I want to continue at Barca.\"\nFurther explaining his motives for wanting to stay, he added: “I have never won the league. This is my fourth year here and it's the closest I've ever been, but there's still a long way to go. I want to win this league, it is the main goal we have and we will give everything to achieve it.”\nBarring a dramatic slip-up from Barcelona, De Jong looks to be in pole position to win that elusive La Liga title he craves. Real Madrid are currently nine points behind their bitter rivals in the table, with Xavi's side pulling clear after scooping 20 wins from 24 games.\nThat success hasn't been replicated in Europe, though, with Barcelona and De Jong crashing out to United in the Europa League knockout play-off round after being eliminated from the Champions League at the group stage.\nOn Barcelona's demise in continental competition, De Jong admitted that he \"expected to go much further in the Champions League\", adding \"...we have to do much better and this year we had a squad to do it, so we assume that it was our fault, we hope that next year we will do much better.”\nLISTEN NOW\nOn this edition of Talking Transfers, part of the 90min podcast network, Scott Saunders, Graeme Bailey & Toby Cudworth discuss Man Utd's transfer needs & strategy for this summer, Tottenham's interest in Emi Martinez, Liverpool scouting two rising Benfica stars & more.\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 463,
  "scraped_at": "2026-02-14T02:16:40.085125",
  "_text_extracted": true
}