{
  "article_id": "150f74014f40",
  "url": "https://www.lusakatimes.com/2024/06/26/zesco-united-supporters-cheer-access-bank-sponsorship/",
  "title": "Zambia : Zesco United Supporters Cheer Access Bank Sponsorship",
  "date": "20240626T070000Z",
  "domain": "lusakatimes.com",
  "source_country": "Zambia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "…10th league title loading\nBy Benedict Tembo\nMTN Super League gladiators Zesco United supporters are excited by Access Bank Zambia’s decision to renew the shirt sponsorship, as it will motivate the club to win the 10th league title.\nAccess Bank, which completed the merger with Atlas Mara Zambia on April 30 this year, today announced the increase in shirt sponsorship for Zesco to K2.8 million from last year’s K2.5 million.\nDuring the signing ceremony for the 2024-25 season sponsorship in Lusaka, Zesco supporters’ chairman Arthur Temba urged Zesco to deliver to the expectations of the stakeholders.\n“We want to be champions, and we ask that with this motivation, the club needs to win that elusive 10th title,” Temba said.\nHe said supporters are delighted by Access Bank’s decision to extend the sponsorship of their beloved club.\n“With this sponsorship, we are assured that our team will continue to perform on the pitch. As supporters, we pledge to continue supporting Zesco United to win, lose, and draw, as these are the three components of football,” Temba said.\nMeanwhile, Zesco Chief Executive Officer Charles Kalala said the decision by Access Bank to extend the shirt sponsorship to another season is a huge motivation to Zesco Limited management and players to work extra hard.\n“It is further an extra incentive to us as we journey on our progression of building successful teams through our developmental structures,” Kalala said.\nHe said success in football can’t be realized without sound financial and technical support.\n“Zesco United Football Club has, for the last two decades, been the torchbearer for Zambian football both at the local and international stage. In this period, the football club has firmed up its reputation as a powerhouse in the African game by achieving a semi-final finish in the 2016 CAF Champions League edition,” Kalala said.\nHe said the success was not by accident, as it was a combination of good leadership and sound financial and technical support from cooperating partners such as Access Bank Zambia Limited.\nKalala said Zesco is determined beyond words to deliver a 10th league title and move an extra step in CAF inter-club football next season.\nAccess Bank Deputy Managing Director Iheanyi Nwogu described the signing ceremony of the renewed sponsorship as another milestone in the bank’s journey of collaboration and support for sports in Zambia, a journey that reflects the financial institution’s shared values and mutual commitment to excellence, community development, and the pursuit of success.\n“Our coming together represents a new era of growth and opportunities, not just for our institutions but for the communities we serve. By combining our strengths and resources, we are better positioned to make a more substantial impact across various sectors, including sports, which is a vital part of our community and national pride,” Nwogu said.\nHe said since 2016, Atlas Mara, which has merged with Access Bank, has been a proud sponsor of Zesco.\n“Over the years, we have seen this partnership flourish. Today, I am delighted to announce that following our amalgamation, all the rights and obligations of Atlas Mara have now been assumed by Access Bank.\nThis therefore means that Access Bank has enjoyed this partnership with Zesco United Football Club for the last eight years and counting and remains committed to this partnership and now enhancing this legacy by increasing our sponsorship to K2.8 million for the 2024-2025 season,” Nwogu said.\nHe said the renewal of sponsorship is a testament to the bank’s unwavering belief in the potential and promise of the Ndola-based giants and the bank’s commitment to fostering the development of football in Zambia.\nNwogu said as part of the bank’s sponsorship with Zesco, it will also continue to actively promote financial literacy for the players.",
  "word_count": 622,
  "scraped_at": "2026-02-14T02:13:55.812317",
  "_text_extracted": true
}