{
  "article_id": "1514396e0ae3",
  "url": "https://global.chinadaily.com.cn/a/202410/09/WS6705e1d6a310f1265a1c69cd.html",
  "title": "Spain and Barcelona great Iniesta announces retirement after 22 - year career",
  "date": "20241009T030000Z",
  "domain": "global.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spain and Barcelona great Iniesta announces retirement after 22-year career\nAndrés Iniesta, who scored Spain's World Cup-winning goal in 2010 and was one of the key players who made Barcelona's tiki-taka thrive for so long, announced his retirement from soccer on Tuesday.\nThe 40-year-old Iniesta ended a 22-year career that also included two European Championship titles and four Champions League trophies.\n\"I never expected that this day would come, I never imagined it,\" an emotional Iniesta said in a ceremony near the Barcelona port. \"But all the tears from the last few days are tears of emotion, or pride, they are not tears of sadness.\nThey are tears of this kid who had the dream of being a soccer player and who succeeded after a lot of hard work, effort and sacrifice.\" Since leaving Barcelona in 2018, he had been playing with Vissel Kobe in Japan, and for the last year with club Emirates in the UAE Pro League.\nIniesta made his first-team debut with Barcelona in 2002, and appeared 674 times.\n\"It was something unique to be with the club of your life, to represent Barca, its fans and to wear that jersey,\" he said. \"It's something I'll always have fond memories of.\"\nKnown for his unique ball control and superb playmaking ability, Iniesta helped anchor a Barcelona midfield that also included Xavi Hernández and Sergio Busquets — in addition to Lionel Messi in attack — in a squad that thrived for many years with an enchanting and effective ball-possession style that became known as the tiki-taka.\n\"Iniesta, your football will live on forever,\" said Barcelona, which streamed the retirement ceremony live.\nIniesta won nine Spanish leagues with the Catalan club, as well as six Copa del Reys.\n\"One of the most magical teammates, and one of those I enjoyed playing with the most,\" Messi said of Iniesta on Instagram. \"The ball is going to miss you, and so will all of us. I wish you the best always, you’re a phenomenon.\"\nBarcelona rival Real Madrid expressed its \"recognition, admiration and affection for one of the biggest legends of Spanish and world football.\"\n\"Andrés Iniesta has enriched the sport through his football and his values, in addition to the numerous trophies he has won during his career,\" Madrid said.\n\"His iconic goal in the 2010 World Cup final in South Africa will forever remain in the memory of every Spanish fan.\"\nIniesta helped Spain dominate world soccer by sweeping up the 2008 and 2012 Euros and the 2010 World Cup, where he scored the extra-time winner in the final against the Netherlands with a right-footed shot from inside the area.\nIniesta said he will \"not be too far\" from soccer, and he is starting to prepare to be a coach at some point.\nIniesta was accompanied by his family in Barcelona. Also in attendance were Barcelona officials and members of the current squad including coach Hansi Flick.\nVideos of people talking about Iniesta, and with highlights of his career, were shown. Among those who talked about Iniesta were coaches Pep Guardiola, Luis Enrique, Vicente del Bosque and Louis van Gaal, who gave the midfielder his club debut.\n\"I was shaking all over those first few days,\" Iniesta said. \"I didn’t know what to do with myself. So many days eyeing the Camp Nou from La Masia (youth academy) and to finally get the chance to be there with all those players was spectacular.\" Iniesta said \"pride\" summed up his feelings as he was retiring.\n\"Pride of having fought and worked until the last day that I played,\" he said. \"The rest is history: Titles, defeats, bad times that we all have to go through. ... Pride and never giving up is what makes me very happy today. The only sad part is that I wished I would have played until I was 90.\"\nAP\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 714,
  "scraped_at": "2026-02-14T01:51:57.650227",
  "_text_extracted": true
}