{
  "article_id": "15179dbb944d",
  "url": "http://thepeninsulaqatar.com/article/27/05/2025/teenage-barca-star-yamal-signs-new-contract-to-2031",
  "title": "Teenage Barca star Yamal signs new contract to 2031",
  "date": "20250527T231500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\n(FILES) Barcelona's Spanish forward #19 Lamine Yamal is pictured during the Spanish Copa del Rey (King's Cup) semi-final second leg football match between Club Atletico de Madrid and FC Barcelona at Metropolitano Stadium in Madrid on April 2, 2025. (Photo by Thomas COEX / AFP)\nBarcelona: Barcelona's teenage star Lamine Yamal signed a new contract until 2031 with the Catalan giants on Tuesday after a spectacular season.\nThe 17-year-old winger is already one of the club's key players and helped them land a domestic treble of La Liga, the Copa del Rey and the Spanish Super Cup.\n\"Barcelona and Lamine Yamal have reached a deal to extend his contract to June 30, 2031,\" said the Catalan club in a statement.\n\"Lamine Yamal's renewal is a demonstration of the solidity of Barca's project. His emergence on to the world football scene is like few others, and it began with his debut on April 29, 2023, still at the age of 15.\"\nSpanish media reported the new deal makes him one of Barcelona's best paid players.\nAfter triumphing at Euro 2024 with Spain last summer, Yamal scored 18 goals and provided 25 assists in 55 matches across all competitions during a sensational campaign.\nOperating on the right flank and a prodigious dribbler, Yamal's skill and speed contributed greatly to Barca netting 102 league goals this season as they reclaimed the crown from rivals Real Madrid.\nYamal, who came through the club's feted La Masia youth academy and is often compared to all-time Barcelona great Lionel Messi, made his debut in 2023 under Xavi Hernandez at just 15.\nBy the end of the 2023-24 campaign he had emerged as the team's main attacking weapon, the bright spot in a poor campaign where Barca finished empty-handed.\nFollowing his exploits at the Euros, Yamal fitted Flick's attacking style to perfection and adding more consistency, showed he has become one of the world's best players.\nYamal put in two brilliant Champions League semi-final performances against Inter Milan but his team were edged 7-6 on aggregate and must wait to end their European drought.\n\"I will keep my promise and I will bring (the Champions League trophy) to Barcelona, we will not stop until we get it,\" pledged Yamal after the game.\nDespite his youth the winger has already played over 100 times for Barcelona.\nYamal, who turns 18 in July, follows team-mate Raphinha and coach Flick in signing contact extensions in the last few days.\nSpanish media report his contract includes various bonuses for different achievements, including winning the Ballon d'Or, as well as a significant pay rise.\nYamal is a candidate to win the trophy for the world's best player this year.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 515,
  "scraped_at": "2026-02-14T02:09:11.445055",
  "_text_extracted": true
}