{
  "article_id": "152798ae207c",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=312641",
  "title": "The NOW . THE Future . Puma Football Signs Germany & Arsenal Star Kai Havertz",
  "date": "20231017T023000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The NOW.THE Future. Puma Football Signs Germany & Arsenal Star Kai Havertz\nGlobal sports company PUMA has today announced a new long-term partnership with German International and Arsenal star Kai Havertz, who will become one of the faces of the FUTURE silo. Having taken the football world by storm from an early age PUMA are excited to sign a player regarded as the future of German football.\nWith more than 200 professional and over 39 international appearances to his name, Kai is renowned not only for his incredible skill and creativity on the pitch but also for his humility, and generosity off it.\nKai kicked off his career with Bayer Leverkusen and swiftly moved to make his mark in the Premier League, joining Chelsea for a huge transfer fee in 2020. It was there he etched his name in history, scoring the decisive goal in the 2020/21 Champions League final, at just 21 years of age. As of 2023, Kai has embarked on a new chapter with the two-time Premier League champions, Arsenal as he looks to add more success and silverware.\nUpon sealing the partnership, Kai expressed his excitement about joining PUMA.\nGrowing up in Germany PUMA has always been an iconic brand with some of the greatest players ever wearing their products. PUMA has always been an innovative brand when it comes to football boots and the way they work with athletes. When I met with the team and discussed plans for the future, I knew this was the right fit for me. They understand athletes and really want to be collaborate with their players; it really is a family atmosphere.\nWearing the FUTURE boot is the perfect fit for my game and is a boot I was eager to move into, there is no other boot like it. PUMA are not only excelling as a brand on the pitch but are making huge waves in other areas of sport and fashion. We are working on some exciting projects, and I am looking forward to what the future holds, said Kai Havertz.\nJohan Adamsson, Global Director of Sports Marketing and Sports Licensing at PUMA, said:\nWere thrilled to have Kai join our family and begin the next chapter of his career together. Kai has achieved so much already. With his quality and positive attitude, we are convinced he is going to remain at the heart of his Club and National team for many years to come. He is an elite athlete with very high aspirations both on and off the pitch and we look forward to working closely together across many exciting initiatives.\n( Press Release Image: https://photos.webwire.com/prmedia/8/312641/312641-1.jpg )\nWebWireID312641\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 465,
  "scraped_at": "2026-02-14T01:51:09.236496",
  "_text_extracted": true
}