{
  "article_id": "152851e1d15e",
  "url": "https://www.arsenal.com/news/tomiyasu-regrets-missed-chance",
  "title": "Tomiyasu regrets missed chance",
  "date": "20231004T020000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With the scores locked at 1-1, midway through the second half against Lens, Martin Odegaard’s corner found its way to the arriving Takehiro Tomiyasu in the penalty area. The Japanese defender caught his first time shot sweetly, but it flew straight at Lens keeper Brice Samba and away to safety.\nWithin three minutes the French side went up the other end, and netted what proved to be the winner. It was a pivotal moment in our group stage defeat on Tuesday night.\nAfter the game Tomiyasu discussed the missed opportunity, and the game in general. Here’s what he said in his post-match interview:\nOn the game…\nObviously it’s difficult to take because we could have taken three points, but we lost three points, so I am so disappointed with the result.\nOn the atmosphere and occasion…\nWe knew that it wouldn’t be an easy game for us. We created a lot of chances but we couldn’t score. Also for me I had a big opportunity to score, but I couldn’t score, so yeah I am so disappointed and it has to be a goal.\nOn whether it would have been a goal if he’d struck it either side of the keeper…\nThe goalkeeper told me it was a lucky moment because he didn’t react. I needed to put it into the net but I’ll have to score the next one\nOn what the team will learn…\nObviously now we have to move on from the defeat and we go to the match again on the weekend, so we have to focus on the game on the weekend.\nOn his thoughts ahead of facing Manchester City on Sunday…\nAbsolutely it’s a massive game for us. We have to focus on the next one and we have to do everything that we have to do and we can do.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 334,
  "scraped_at": "2026-02-14T02:25:00.755187",
  "_text_extracted": true
}