{
  "article_id": "15428fb4fb21",
  "url": "https://www.dailymail.co.uk/news/article-13754575/Former-Manchester-United-Angel-Gomes-stretchered-hospital-horror-collision-head-injury.html",
  "title": "Former Manchester United player Angel Gomes stretchered off the pitch and rushed to hospital after horror collision leaves him with serious head injury and saw the match delayed for 34 minutes",
  "date": "20240818T090000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United player Angel Gomes stretchered off the pitch and rushed to hospital after horror collision leaves him with serious head injury and saw the match delayed for 34 minutes\n- Players from both Lille and Reims sent best wishes to the stricken footballer, 23\nFormer Manchester United football star Angel Gomes is recovering in hospital after being stretchered off the pitch with a horrific head injury.\nThe midfielder, who helped England win the Under-17 World Cup in 2017 and the Under-21 European Championship six years later, was badly hurt while playing for current club Lille in the French top-flight Ligue 1 away to Reims yesterday evening.\nThe game was held up as 23-year-old Gomes was treated on the pitch for more than 30 minutes after colliding with Reims midfielder Amadou Kone in the 11th minute.\nHe was taken away on a stretcher as fans of both clubs chanted the ex-Red Devils footballer's name.\nThe game resumed with Kone sent off and 34 minutes added to the first half, with Lille going on to win 2-0.\nFormer Manchester United footballer Angel Gomes is recovering in hospital after being stretchered off the pitch with a horrific head injury while playing for Lille yesterday\nThe former England youth international was at United between the ages of six and 19\nGomes, now 23, helped England win the Under-21 European Championship in 2023 - he is pictured here celebrating alongside Emile Smith Rowe and Morgan Gibbs-White\nReferee Eric Wattellier instantly called for medical assistance after the collision and Gomes was then treated on the field for 17 minutes before eventually being transported to hospital.\nLille's players formed a circle around Gomes while he was receiving on-field treatment.\nKone, after being shown a straight red card for his dangerous foul, was pictured praying for Gomes from inside the Reims changing room.\nA club statement by Lille published during the half-time break confirmed that Gomes was conscious again.\nIt read: 'Angel Gomes has regained consciousness and has been transferred to hospital. All our thoughts are with him'.\nThe club's president Olivier Letang said afterwards: 'Angel Gomes is doing pretty well, but we'll wait to find out how he spends the night, with his additional tests, before saying that we have a definitive \"happy ending\".'\nLille head coach Bruno Genesio said he immediately knew the injury was serious and he was frustrated that the medical treatment on the field was not done faster.\nHe told reporters: 'We were very, very scared. The latest news is rather reassuring, but it's better to be cautious.\n'I was angry, because it's hard to see one of your players on the ground. We spend a lot of time together, we're a family, and to see one of our players attacked, because it is an attack, is very difficult to live with.'\nLille's French defender Bafode Diakite celebrates after scoring his team's first goal against Reims last night, with the jersey of his injured team-mate Angel Gomes\nLille players showed their distress as Gomes received treatment after his serious head injury\nGomes, 23, was injured 11 minutes into Saturday's game between Lille and Reims\nGenesio said some of his players were on the verge of tears during the ordeal.\n'Well done for getting the job done, because it's never easy, and a big thought for Angel - we're pleased to have the first reassuring news,' he added.\n'Angel asked if he was going to play on (next) Saturday, which is a good sign if he's got a sense of humour. For me the match was secondary tonight.'\nAfter the final whistle, both teams posed with a Reims jersey with the words 'Take care Angel' written in French.\nGomes, born in Edmonton in north London, played five Premier League matches for Manchester United between 2017 and 2020 before leaving for Lille and spending a year on loan to Portuguese club Boavista.\nWhen making his United debut as a 16-year-old in May 2017 against Crystal Palace, substituting on for Wayne Rooney, he became the club's youngest first-team player since Duncan Edwards in 1953.\nGomes has spoken publicly about his Christian faith, saying in an interview in 2020: 'I'm religious, I'm a Christian, so I'll pray before games and coming on to the pitch I'll always pray.'\nHe was at United between the ages of six and 19, progressing through the club's academy and featuring under managers José Mourinho and Ole Gunnar Solskjær.\nHis father Gil Gomes, 51, played for Portugal's Under-21s as well as clubs including Braga and Salford City.\nGomes is seen here playing for Lille against Turkish club Fenerbahce's former Manchester City striker Edin Dzeko in a UEFA Champions League clash on August 13 this year\nGomes, pictured taking the ball past Le Havre's Abdoulaye Toure on February 17 this year, played five Premier League matches for Manchester United between 2017 and 2020\nEngland's Morgan Gibbs-White, left, and Angel Gomes celebrate their 1-0 win in the Euro 2023 Under-21 Championship final against Spain at Georgia's Batumi Arena stadium in July 2023\nGomes, from Edmonton in London, is the son of former Portugal youth international Gil Gomes\nAngel Gomes signed for Lille in 2020 then spent a year on loan at Portuguese club Boavista\nGomes recalled in 2022 how he received a brutal dressing-down during their time at Manchester United which left him on the verge of tears.\nGomes told SPORTbible: 'I've never actually told this story before but one time, [Mourinho] took me to a cup game with the first team after I'd played with the Under-21s.\n'We were at the dinner table and he's come around speaking to everyone. He then looks at me and says, \"I am f***ed with you\".\n'He was saying, \"You were doing this and doing that but you should have done this and that\", and this was in front of the whole squad as well.\n'I'd had b*****kings in my time but not from the big boss. I just wasn't expecting it. I was taken aback. He eventually finished shouting and carried on with what he was doing.\n'I was stuck to my seat. Eventually some of the lads came over and said, \"Don't worry, just ignore him, he's trying to get a reaction from you - this is how he is.\"'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- New video shows man with backpack similar to Guthrie kidnapper\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Moment driver veers to target e-bike riders before killing teen\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl",
  "word_count": 1176,
  "scraped_at": "2026-02-14T01:51:48.875005",
  "_text_extracted": true
}