{
  "article_id": "1548b99b94d5",
  "url": "https://www.thenationalnews.com/news/mena/2025/05/14/saudis-celebrate-trump-visit-with-ai-generated-images-of-abu-ivanka/",
  "title": "Saudis celebrate Trump visit with AI - generated images of  Abu Ivanka  ",
  "date": "20250514T134500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Live updates: Follow the latest on Trump's Gulf trip\nSaudis were sharing AI-generated images of Donald Trump in local dress on Wednesday, reflecting the strong favourable impression made by the US President as he wrapped up his visit to the kingdom.\nMr Trump, who is on a four-day tour of the Gulf region, with stops in Saudi Arabia, Qatar and the UAE, was lavish in his praise of Saudi Arabia and its leadership after being received at Riyadh airport by Crown Prince Mohammed bin Salman on Tuesday.\nHe appeared to have made a strong impression with Saudi citizens, who responded with the highest expression of Arab hospitality by integrating him into local culture.\nThe AI-generated images showed Mr Trump in traditional attire: a white kandura buttoned at the neck, with the red-and-white scarf, and the keffiyeh, held in place with a black agal. Other photos showed his daughter Ivanka wearing a black abaya while drinking Arabic coffee.\nComments such as \"he looks like my father\" and \"Abu Ivanka [Ivanka's father] after drinking gahwa\" accompanied the photos.\nAbdulaziz Alshareef, 30, a marketing executive in the eastern city of Khobar, said Saudi Arabia's welcome of the US President was a reflection of Saudis' national pride and profound respect for the American people.\n\"As a proud citizen, I feel deeply honoured that our country had the opportunity to host the President of the United States and his esteemed delegation. Our culture is a powerful reflection of our national pride, whether it’s the simple act of offering Arabic coffee and dates, the fragrant scent of bukhoor, or our traditional attire and greetings,\" he said.\n\"These customs are more than rituals, they are expressions of hospitality, respect and identity that have been passed down through generations. To see our people integrate these cherished traditions in welcoming the President of the United States is deeply moving.\"\nMr Alshareef said witnessing the welcome given to Mr Trump had been \"truly uplifting\".",
  "word_count": 324,
  "scraped_at": "2026-02-14T01:49:39.551257",
  "_text_extracted": true
}