{
  "article_id": "154b7f7ad59b",
  "url": "https://www.teamtalk.com/news/liverpool-man-city-red-alert-elite-star-confirms-newcastle-exit-plan-chelsea-100-million-race",
  "title": "Liverpool , Man City on red alert as elite star confirms Newcastle exit plan ; Chelsea also in £100m race",
  "date": "20240324T201500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool, Man City on red alert as elite star confirms Newcastle exit plan; Chelsea also in £100m race\nPremier League giants Liverpool, Manchester City and Chelsea have all been given a major boost in their hunt to land Bruno Guimaraes, as the player has admitted he will be ‘moving’ on from Newcastle United at some point in the future.\nNewcastle showed their firm intent to sign the best players in January 2022 when they captured Guimaraes from Lyon in a £40million deal in January 2022. The central midfielder raised eyebrows as he swapped regular Champions League and Europa League football for Newcastle’s exciting project.\nThe move has worked out brilliantly for both Guimaraes and Newcastle. The Brazilian has established himself as an excellent all-round performer, while also emerging as a favourite for both Eddie Howe and the Newcastle faithful.\nGuimaraes has also been able to continue performing at a very high level with Newcastle, as the Magpies came up against Paris Saint-Germain, Borussia Dortmund and AC Milan in the Champions League group stage earlier this season.\nHowever, Guimaraes’ elite performances have attracted interest from several of Newcastle’s English rivals. In February, it emerged that Liverpool and Chelsea are both big admirers of the 26-year-old.\nOn March 16, reports claimed that Man City have opened dialogue with Guimaraes’ agent about a potential summer move.\nDON’T MISS – Next Liverpool manager’s to-do list: Five major tasks for Klopp successor, from contracts to transfers\nBefore Guimaraes featured in Brazil’s 1-0 win over England at Wembley on Saturday, the player was quizzed on his future.\nGuimaraes has insisted he is happy at Newcastle, though he has also put Liverpool, City and Chelsea on alert by revealing his desire to secure a transfer at some point in the future.\nBruno Guimaraes has ‘other goals’ after Newcastle\n“It’s always been my dream to play here [England]. I’ve always followed the Premier League, it was always my dream to be here,” he told reporters (via Sky Sports).\n“I think ever since I joined Newcastle everything’s been good in my life, professionally and personally.\n“I’m very happy to be playing amongst the best in the best league in the world. I absolutely plan to play here for a long time, but I have other goals as well of moving.\n“But this is something more down the line, I’m really happy to be here in the league.”\nThere are two key reasons why Guimaraes has been tipped to leave Newcastle this summer. The first is that Newcastle have struggled this campaign – mainly down to injuries – and are languishing in 10th place, which means they might not feature in any European competition next term.\nSecondly, Newcastle are under pressure to sell players in the summer to ensure they do not fall foul of Profit and Sustainability Rules.\nThe good news for Newcastle supporters is that it does not look like Guimaraes will be leaving St James’ Park this year.\nOn Tuesday, sources confirmed to TEAMtalk that Newcastle are far more likely to sell other players than key duo Guimaraes and Alexander Isak.\nGuimaraes does have a £100m release clause in his contract, though Newcastle do not expect it to be activated this summer.\nAs such, Newcastle can enjoy having the Rio De Janeiro-born ace in their team for at least another season before he pushes for a transfer to one of Liverpool, City or Chelsea.\nREAD MORE: Man City rebel blasts Guardiola for telling ‘lies’ in extraordinary rant as exit deal gathers pace",
  "word_count": 585,
  "scraped_at": "2026-02-14T02:10:47.910058",
  "_text_extracted": true
}