{
  "article_id": "155dca925a60",
  "url": "https://www.islingtontribune.co.uk/article/arsenal-boss-slegers-this-is-just-the-beginning",
  "title": "Arsenal boss Slegers : This is just the beginning",
  "date": "20250613T163000Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal boss Slegers: This is just the beginning\nMilestone for Gunners as European champs to play all WSL matches at Emirates\nFriday, 13th June 2025 — By Steve Barnett\nArsenal averaged crowds of over 34,000 at the Emirates last year [Neil Holmes/SPP]\nTHE “special journey” shared between Arsenal and their supporters marked another milestone this week when the club announced that they will host all 11 of their Women’s Super League home games at the Emirates Stadium next season.\nThe newly-crowned European champions staged nine league games in N5 during the 2024/25 campaign, averaging a crowd of just over 34,000 – and a high of 56,748 in the 5-0 win against north London rivals Tottenham Hotspur in February.\nHaving time and again set, and then smashed, attendance records in the WSL, it seemed almost inevitable that the country’s most successful club would once again be at the forefront of growing the women’s game.\nAnd the news that even more Gooners will get to watch even more games is the perfect way to continue the celebrations that sparked into life last month when Arsenal beat Barcelona in Portugal to capture their second European title.\n“I’m so proud of the journey we’ve been on with our supporters this season,” said Gunners head coach Renee Slegers. “From Borehamwood to the Emirates, on the road to every WSL and European destination we visited, and of course all the way to Lisbon, they’ve shown up and we’ve fuelled each other to an historic season for our club.\n“For us, this is just the beginning, and bringing every WSL match to the Emirates is another step for more supporters to be part of this special journey. We’ll come back next season with fire in our hearts, more determined, more ambitious, and more together than ever.”\nArsenal head coach Renee Slegers [Jay Patel/SPP]\nBoth Aston Villa and Leicester City hosted all their home WSL games at their main club grounds last term – Villa Park and the King Power Stadium respectively.\nAnd Everton recently announced that Goodison Park will become the home of the club’s women’s team as of next season, with the men’s team moving into the Toffees’ newly-built Hill Dickinson Stadium.\nBut no club can draw a crowd like Arsenal, who sold more than 415,000 tickets across 2024/25; up 20 per cent on the previous season.\nWith all of their WSL home games now moving to Ashburton Grove, Arsenal will introduce a season ticket for the Emirates for the women’s team for the first time.\nThe club will start the defence of their Women’s Champions League title at Meadow Park, with all their league phase games in the competition to be played in Borehamwood.\nDomestic fixtures in the Women’s FA Cup and FA Women’s League Cup will also be played at Meadow Park.\nLooking ahead to next season, the Arsenal Women Supporters’ Club said: “We are delighted to hear that all WSL home games will be played at [the] Emirates Stadium next season. This allows more people than ever to experience a WSL matchday and help Arsenal to build on the success we achieved in Lisbon.\n“We are also excited that Meadow Park will still be used for cup games.\n“We’ve experienced some great times at Meadow Park and look forward to cheering on the team from the North Bank next season.”\nArsenal’s director of women’s football, Clare Wheatley, added: “Our players and staff know what it means to walk out in front of a packed Emirates Stadium. It brings a sense of pride and belonging to all of us.\n“It fuels a relentless drive to win – and is a crucial part of how we create the best conditions for our women’s team to succeed.\n“We felt that winning connection all season, and to share in a Champions League win with our supporters in north London after returning from Lisbon inspired us all to push on.”",
  "word_count": 652,
  "scraped_at": "2026-02-14T02:21:20.322019",
  "_text_extracted": true
}