{
  "article_id": "158ddf7671c4",
  "url": "https://www.90min.com/posts/could-david-de-gea-rejoin-man-utd-free-agent",
  "title": "Could David de Gea actually rejoin Man Utd as a free agent ? ",
  "date": "20231026T161500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Could David de Gea actually rejoin Man Utd as a free agent?\n- De Gea left Manchester United in the summer on a free transfer\n- The Spaniard remains unattached after failing to find a new club\n- Rumours suggest United may look to bring De Gea back as cover for Andre Onana\nDavid de Gea's summer departure from Manchester United had been on the cards for a long, long time.\nThe Spaniard had been in lengthy negotiations with the Red Devils about extending his 12-year stay at the club, but it became apparent that De Gea's days as United's number one were somewhat numbered.\nConcerns over his distribution, as well as some high-profile handling errors, saw gossip columns rife with speculation over Erik ten Hag's desire to source a replacement. Those rumours proved to be well founded, with Andre Onana, a former disciple of the Dutchman's at Ajax, heading to the north west after just a single season at Inter.\nOnana's start at Old Trafford has been shaky - he made mistakes against Bayern Munich, Galatasaray and Brentford - but the 27-year-old may have hit a turning point after an injury-time penalty save against Copenhagen in the Champions League.\nTypically, with a potential upturn in fortunes around the corner, Onana may be out of United's side. He had announced his retirement from international duty with Cameroon, but reversed that decision after joining United - something that could leave a sour taste in the mouth when the Africa Cup of Nations gets underway.\nCould David de Gea return to Man Utd?\nOnana's possible departure for AFCON wasn't something United had really planned for when completing his signing. The multi-time Premier League winners thought they would have their number one goalkeeper around for what's usually a pivotal time in the season, with the fixtures coming thick and fast post-Christmas.\nA recent report suggested Onana would stay in Manchester to focus on improving his form, but the opportunity to represent his country in African football's most prestigiuous international tournament may prove too tempting a prospect.\nThe situation has led to speculation linking De Gea with a sensational, and surprising, return to Old Trafford. The Spaniard remains a free agent after leaving United in June - he's spurned down the advances of the Saudi Pro League in a bid to stay in Europe - and The Sun claimed that bosses are planning to approach De Gea about a potential return.\nWhether or not De Gea would have any interest in returning on that basis remains to be seen, but logic would suggest that he wouldn't want to go back over old ground so soon, nor would the deal make any real sense. To add weight to that notion, De Gea posted on social media X an emoji expressing surprise at the rumours - make of that what you will.\nNevertheless, he has been pictured in Manchester a number of times of late, first watching the women's team play in the Champions League before being pictured enjoying a coffee with Bruno Fernandes, Victor Lindelof, Tom Heaton and Raphael Varane.\nBut 90min understands that United's chief are satisfied with the signing of Turkey goalkeeper Altay Bayindir, who was formerly the first-choice goalkeeper at Fenerbahce.\nHe's currently playing understudy to Onana, with the aforementioned Heaton slated as United's third option, and is deemed to be more than ready to play first-team football if Onana is unavailable for any reason.\nWhy did De Gea leave Man Utd?\n\"I would like to express my unwavering gratitude and appreciation for the love from the last 12 years. We’ve achieved a lot since my dear Sir Alex Ferguson brought me to this club. I took incredible pride every time I pulled on this shirt, to lead the team, to represent this institution, the biggest club in the world was an honour only bestowed upon a few lucky footballers.\n\"It’s been an unforgettable and successful period since I came here. I didn’t think from leaving Madrid as a young boy we would achieve what we did together.\n\"Now, it’s the right time to undertake a new challenge, to push myself again in new surroundings.\"\nThose were the words of De Gea after his exit from United was confirmed, demonstrating the bond he formed with the club, players and supporters.\nDe Gea left for various reasons, ranging from United's desire to reduce his wages, to not being able to guarantee him regular first-team football in the long-term. The latter, primarily, was down to Erik ten Hag's desire to play out from the back and have a goalkeeper comfortable with distributing the ball short and with both feet.\nTen Hag also wanted a confident stopper who would operate as more of a 'sweeper keeper', patrolling the edge of the United penalty area to allow United's backline to push up. Onana is, and was, familiar with that role at Ajax and Inter, while De Gea's main strength is his shot-stopping.\nA parting of the ways seemed best for both parties, yet having failed to sign on the dotted line at Real Madrid or any other linked club, it remains to be seen what De Gea will do next.",
  "word_count": 864,
  "scraped_at": "2026-02-14T01:56:32.769649",
  "_text_extracted": true
}