{
  "article_id": "15c6316a81f6",
  "url": "https://www.dw.com/en/world-cup-spanish-fa-call-meeting-over-presidents-forced-kiss/a-66589820",
  "title": "Spanish FA call meeting over president forced kiss – DW – 08 / 21 / 2023",
  "date": "20230823T110000Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hermoso demands consequences over unsolicited kiss\nAugust 21, 2023Jenni Hermoso, the Spanish player who was forcibly kissed on the lips by federation boss Luis Rubiales, is now demanding action. The RFEF is to discuss its next move on Friday.\nDays after Spain's women won the World Cup for the first time in their history, all the talk continues to be about what happened at the award ceremony. When Jenni Hermoso, Spain's No. 10, stepped up to the podium to receive her winner's medal and congratulations from FIFA President Gianni Infantino, Spain's Queen Leticia and Luis Rubiales, the president of the Spanish Football Federation (RFEF), Rubiales kissed her on the cheek. But then he grabbed the head of the 33-year-old and pressed a kiss on her mouth.\n\"What was I supposed to do? I didn't like it,\" Hermoso said during a post-match livestream.\nHer reaction was mild in comparison to those of some others.\n\"It should not be assumed that kissing without consent is something that just happens,\" Spain's equality minister, Irene Montero wrote on X.\n\"It is a form of sexual violence that we women suffer every day and that has been invisible until now and we must not normalize it.\"\nSpanish Minister of Social Rights Ione Belarra was equally critical on the social media platform.\n\"We're all thinking, if they do this in front of all of Spain, what won't they do in private? Sexual violence against women must end.\"\nHermoso demands action\nNow, having had a few days to reflect upon what happened, Hermoso has issued a joint statement with the players' union Futpro in which she said the incident must have consequences for Rubiales. She and the union called on the RFEF to \"establish the necessary protocols, protect the rights of our female players and take exemplary measures.\"\nThe union said it rejected \"any attitude or behavior that violates the rights of female football players.\"\nFutpro, it said, was committed to ensuring that such actions \"never go unpunished, that they are sanctioned and that the appropriate measures are taken to protect female footballers from actions that we consider unacceptable.\"\nOn Wednesday, the RFEF announced that it had launched an internal investigation into Sunday's events and would hold an \"Extraordinary General Assembly\" on Friday.\nRubiales apologizes\n\"Surely I was wrong, I have to admit,\" Rubiales said in a video statement issued by the RFEF on Monday. \"It was without bad faith at a time of maximum effusiveness.\"\nRubiales has come under fire over the incident, including from acting prime minister, Pedro Sanchez.\n\"What we saw is unacceptable,\" Sanchez said. \"And the apologies offered by Mr. Rubiales are not sufficient, I would call them inappropriate, so he must continue taking further steps to clarify what we all saw.\"\nInitial absence of a sense of guilt\nIn the immediate aftermath of the incident, Rubiales had appeared to wonder what all the fuss was about.\n\"The kiss with Jenni? There are idiots everywhere. When two people share an unimportant gesture of mutual affection with each other, you can't pay attention to the crap that's being said,\" the RFEF boss told Radio Marca.\nThis also came after he had reportedly told the players in the dressing room that he was going to send the entire team to Ibiza as a reward for winning the World Cup title.\n\"In Ibiza we will then celebrate the wedding of Jenni and Luis Rubiales,\" he reportedly said.\nThis is not the first time Rubiales, who last year vehemently backed national team coach Jorge Vildas in the face of a revolt by more than a dozen players, has been the subject of controversy.\nLast year, Spanish media reported that he had allegedly held a party in early 2020 to which 8-10 women were invited. The reports alleged that the party wound up being an orgy and Rubiales subsequently billed it as a work event. Both the RFEF and its boss have denied the allegations.\nA year after players' revolt\nRubiales' post-match actions have wound up overshadowing a sporting success no one would have thought possible just nine months ago. This is because by the end of September 2022, there was essentially no team left, after 15 players temporarily quit the national team in protest. The reason they gave was their \"emotional and therefore (overall) health,\" which made it impossible for them to participate in the national team's games until \"the situation\" was corrected.\nAt the time, the main reason was apparently coach Jorge Vilda. The players who revolted accused him of failing to respect their privacy, ignoring the reserve players, and in general not creating a professional environment around the national team. A public dispute ensued with the RFEF, which supported Vilda and threatened the renegade players.\nTorn team, even in jubilation\nDespite the first World Cup title, it was clear on Sunday that a rift still runs through the team. While the players on the pitch formed a red jubilant cluster, a second crowd of euphoric people jumped up and down in front of the bench, separated from the first.\nWomen's and men's world champions\nStill, joy prevailed. Spain, which has already amassed an impressive collection of junior international titles in recent years, is now the first nation in the world after Germany to win both the men's and the women's World Cups.\n\"It was so hard, we tried to imagine it, but you can't imagine something like that. And now we are world champions. It's incredible,\" a teary-eyed Hermoso told German public broadcaster ZDF.\nLittle did she know she was about to unwillingly become a central figure in an incident that would overshadow this sporting success for days and maybe even weeks to come.\nThis article, which was adapted from German, was updated after the apology of Luis Rubiales, as well as after the announcement about the RFEF Extraordinary General Assembly, the response by Prime Minister Sanchez and the statement of Jenni Hermoso and her union.",
  "word_count": 991,
  "scraped_at": "2026-02-14T01:50:52.171675",
  "_text_extracted": true
}