{
  "article_id": "15f8ded7c254",
  "url": "https://www.nytimes.com/athletic/5825397/2024/10/08/premier-league-roundtable-october/",
  "title": "The Premier League season so far : Our writer verdicts",
  "date": "20241008T084500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The October international break, also known as the Premier League’s sacking season.\nEnough time has elapsed for owners to get twitchy, yet plenty of matches remain to make things right.\nThe 2024-25 campaign may only be seven gameweeks old but loads has happened — that draw between Manchester City and Arsenal, Cole Palmer’s four first-half-goals, Manchester United’s worst start to a Premier League season and, it is easy to forget, Everton squandering a two-goal lead in consecutive matches.\nAdvertisement\nAs teams take a two-week break from domestic action, our writers Carl Anka, Oliver Kay, Nick Miller, Tim Spiers, Duncan Alexander, Seb Stafford-Bloor and Jordan Campbell deliver their verdicts on what we have seen so far.\nWhat is your one main takeaway from the season so far?\nNick Miller: Uncertainty rules. The early weeks of the season have suggested we could be in for a proper title race, with Manchester City being Manchester City (for the most part), Arsenal continuing their excellence from last season and Liverpool being a bit better than expected. But City’s 115 charges loom: it might not be especially practical, but it would be nice if their punishment (assuming they’re found guilty) was imposed at the start of a season and wasn’t hanging over everything during a season like some giant megaboss version of VAR, not allowing us to enjoy anything because we know it could all be instantly invalidated.\nOliver Kay: Very little has changed. We can talk about a new season as a new start, but, for better or worse, whether it’s under a new manager (Brighton & Hove Albion, Chelsea and Liverpool) or the same one (Manchester United and others), most teams have picked up roughly where they left off. That’s great if you’re Manchester City, Arsenal or Aston Villa; it’s even encouraging if you’re Chelsea, who finished last season well. It’s not so good if you’re Manchester United or West Ham United.\nSeb Stafford-Bloor: That coaching changes need not necessarily lead to prolonged periods of transition. Enzo Maresca at Chelsea, Arne Slot at Liverpool; neither team has been perfect, but both have been much better than expected and have played with a clear-eyed style. Chelsea and Maresca are a particularly interesting example because they seem infinitely more cohesive, whereas — and surely I was not alone in thinking this — few people would have thought the answer to the issues at Stamford Bridge was more change.\nAdvertisement\nDuncan Alexander: That this might be the ‘Big Six’ era — or perhaps the ‘Great Eight’ if you chuck Villa and Newcastle into the mix — but really it’s the ‘Very Good’ Three of Liverpool, Manchester City and Arsenal that are still a step above everyone else. Liverpool under Slot have added control to their offering, Arsenal have added the sort of relentlessness that comes from coming so close to winning the league for two years in a row. City, though, are probably operating at a net loss, with Rodri out for the season — all of which should make this an absolute 2013-14 of a title race (legal decisions notwithstanding).\nJordan Campbell: That the more the top managers say this is the strongest Premier League they’ve ever seen (it was the same last year, and the year before), the less I believe them. Teams have more distinct identities, yes, but my theory is that these top coaches stroke the ego of their managerial counterparts so they continue playing expansive football against them. You’d rather rip them apart on the counter than toil to break down a low block, wouldn’t you?\nTim Spiers: A predictable lack of unpredictability. Liverpool, Manchester City and Arsenal occupy the top three spots, the promoted teams are struggling, Everton are doing Everton things, Tottenham Hotspur are either amazing or shambolic and their manager wouldn’t have it any other way, Manchester United aren’t being coached well and their summer signings, which were good on paper, aren’t working. Nothing is a surprise.\nThe early front-runner for player of the season is…\nAnka: A knee injury last season meant it took a little longer for Premier League viewers to get acquainted with Jurrien Timber’s game. And what a game it is. The 23-year-old is one of those multi-talented and multi-faceted footballers who bring us closer to the dream of “positionless” football that Johan Cruyff and others talked about.\nMiller: I wish I had a slightly less obvious answer to this, but it’s Palmer, isn’t it? He’s a fascinating character: I’d love to just follow him around for a day, just to see how he reacts to things. But he’s even more brilliant than he was last season, only this time in a different position: admittedly ‘off the left, drifting into the middle’ to ‘in the middle’ isn’t a colossal shift, but players have been flummoxed by less.\nAdvertisement\nKay: I’m inclined to say Palmer, too. But might I have said Erling Haaland before Palmer’s absurd one-man show against Brighton? Might there be a case for William Saliba and Gabriel, who are becoming synonymous for Arsenal in the same way Steve Bould and Tony Adams once were? Might there even be a left-field shout for Ryan Gravenberch or Bryan Mbeumo?\nStafford-Bloor: Palmer has a compelling case, clearly, but Bukayo Saka has been really good — not least because of how arduous his workload was over the summer. When Arsenal lost Martin Odegaard, so much of their creative burden fell on Saka’s shoulders and yet, to this point, there has been no real dip in their potency. Seven assists already tell part of the story, but he is also his team’s most dynamic carrier, and — importantly — has already faced Aston Villa, Tottenham and Manchester City.\nAlexander: Saka has assisted in all but one of Arsenal’s Premier League games this season (and ‘created’ an own goal against Leicester, which doesn’t officially count but morally sort of does). It’s a sensational start to the season, especially for someone who played so much at Euro 2024 and suggests that — somehow — he is still continuing to improve. And a few miles across London Palmer’s numbers are equally outstanding. Remember when England couldn’t produce left-footed players?\nCampbell: It’s impossible to look past the individual brilliance of Palmer, a player whose paper-thin physique and off-the-cuff style is so refreshing in an era of power and systems. But Kai Havertz is a man transformed, building on the last four months of last season when he became Arsenal’s first-choice striker. He has always been a unique, if frustrating talent, but he now feels fully understood by Arsenal, connecting their attacking play and leading their suffocating press. Crucially, he now looks like he wants to be the protagonist in every game and is adding the goals to prove it.\nSpiers: I’m amazed only Oli has mentioned Haaland. The guy scored 10 goals in his first five games — the best goalscoring start to an English top-flight season since Aston Villa’s Pongo Waring, friend of the statisticians, in 1930. He hasn’t netted in two matches and he’s still scored more goals than 10 other Premier League teams, and more than Manchester United and Southampton combined.\nWhich new signing has impressed you most?\nAnka: Nikola Milenkovic is your classic meat-and-potatoes centre-back who comes in, bolts things down and allows others to flourish. His arrival at Nottingham Forest means Murillo has a bit more security when he attempts to progress the ball out from the back, and it means Nuno Espirito Santo can spend more time transforming this side into a robust unit similar to those dreaded Wolves teams between 2018-21. Sometimes it’s nice watching a defender who relishes defensive work.\nMiller: I wasn’t really sure about Riccardo Calafiori when Arsenal signed him, partly because if they had £42million ($55m) going spare it felt like they should have put it towards an attacker rather than another defender who is comfortable shifting into midfield. But I was wrong: he’s been among the most fun players in the division so far, enjoyably chaotic without being a liability (yet), and has complemented the rest of the Arsenal defence brilliantly.\nAdvertisement\nKay: In terms of a potential top-level talent, probably Savinho at Manchester City. It’s only flashes of brilliance so far, but flashes of brilliance are not to be sniffed at when you’re starting in a Pep Guardiola team at the age of 20. I’m enjoying Milenkovic at Nottingham Forest, Emile Smith Rowe at Fulham and Iliman Ndiaye at Everton, too.\nStafford-Bloor: Dominic Solanke. He is exactly what Tottenham needed and the goals he has scored so far, all three of them from short range, describe the kind of instinct that they were missing in the penalty box. But watch the way he presses ball carriers and notice how difficult he makes it for opposing teams when they work their way out of their own ends. Rather than just running about manically and compromising the structure behind him, his work is precise and measured. Spurs have got this decision absolutely right.\nCampbell: Ndiaye. Everton have been a vacuum of hope the past few years, downtrodden and too often lacking any sort of X factor to get Goodison Park rocking. One player can sometimes change an entire mood and the Senegalese winger is starting to do that. His only thought is to be direct and dribble at the opposition full-back, as shown by his 10 dribbles against Newcastle United. If Sean Dyche can find a way to loosen his system and improve the supply to him, he could start to motor.\nSpiers: A common characteristic of a relegated team is that they don’t have a regular goalscorer — no player reached double figures for any of last season’s relegated sides. Liam Delap cost Ipswich Town £20million ($26.2m) and, with four goals already, he could end up being pound-for-pound the most valuable signing of the season.\nWhat’s been your game of the season so far?\nAnka: Manchester City 2-2 Arsenal. Over the past 18 months, this fixture had turned into bitty attritional affairs as Mikel Arteta wisely decided to sacrifice attacking endeavour for some control and stability. That changed on September 21 when we got a thriller between the two best sides in the land. It’s also becoming clear they don’t like each other very much, which only added to my enjoyment.\nMiller: In terms of the game I sat and watched and was captivated from beginning to end, it’s City 2-2 Arsenal. But as a game that really examined the fragilities of the human spirit, that exposed the sort of mental collapse that is possible in the right circumstances, it’s Everton getting to the 87th minute against Bournemouth 2-0 up, and still managing to lose 3-2.\nStafford-Bloor: Brentford against Wolves was some hysterical nonsense and, thematically, that helped to make a point. The quality has just not been very high this season and, while the Premier League has had its usual cartoonish moments off the field, that has not been balanced — yet — by anything particularly interesting on the pitch. Maybe the fixture computer has just sold us all a bad start.\nAdvertisement\nAlexander: Let’s crunch some of those numbers, shall we? The match with the highest combined xG (5.55) was Manchester United vs Spurs. The match with the highest xNarrative was Manchester City vs Arsenal. Palmer rattled in the first four-goals-in-a-first-half the Premier League has ever seen when Chelsea beat Brighton, but I’m going to go for Bournemouth vs Chelsea, a seemingly innocuous match that produced a Premier League record 14 yellow cards from Anthony Taylor, plus a handful for the benches for good measure. Tremendous, baffling coastal fun.\nHas anything surprised you so far?\nAnka: Chelsea have such talent within their squad that they were always going to come good. Yet the speed at which Maresca has them clicking has impressed me. Nicolas Jackson looks to have figured out some of the finer points of centre-forward play and Palmer is making a mockery of those who tried to claim his numbers were inflated by penalties. Cut through the outside noise. This is a team that works.\nMiller: Gravenberch fully repurposing himself as a holding midfielder. It feels like a happy accident from Liverpool’s perspective because they clearly didn’t think he was going to be this good, or else they wouldn’t have tried so hard to sign Martin Zubimendi in the summer. But he’s been tremendous, and a pleasing antidote to the prevailing modern feeling that the only way to fix things is in the transfer market.\nStafford-Bloor: Call me naive, but I did think Manchester United would be better and that, at the least, it would be possible to see a positive direction of travel. Is there anything there at all? It’s difficult to take too much from wins over an off-colour Fulham and highly-vulnerable Southampton, when competent teams are just making such short work of them. The Liverpool defeat could have been much, much worse. On a more efficient day, Tottenham could also have scored five or six at Old Trafford. Sunday’s draw with Aston Villa was an improvement, but only in the sense that it was not an outright disaster.\nAlexander: Some oblique alarm bells rang when 1990s-born tactician Fabian Hurzeler won manager of the month at his first attempt. It felt like a classic case of a decent start that owed more to muscle memory from the previous regime, especially after Brighton got Palmer-ed at Stamford Bridge. But the sensational comeback against Spurs at the weekend might be the moment Hurzeler showed that, despite being three months younger than the first text message sent on a mobile phone, he could have what it takes to succeed in Our League.\nCampbell: Nottingham Forest. Over the past few years Nuno’s stock had fallen and a perception had set in that he was an overly-cautious coach. Just one defeat in seven games, gaining four points against Liverpool and Chelsea, has redressed that. Look at the options that operate behind Chris Wood — Anthony Elanga, Morgan Gibbs-White and Callum Hudson-Odoi — and you see they have built a young, exciting core. The addition of Elliot Anderson behind them has added another young English talent to the group, which is heartening to see.\nSpiers: Teams refusing to abandon the principle of playing out from the back, even in the face of incomprehensible ineptitude. Obviously, there are long-term benefits to perfecting it, but in the meantime the stubborn persistence of some managers when their teams are conceding hilariously bad goals is kinda baffling.\nGO DEEPER\nPlaying out from the back: Why teams do it and is it worth the risk?\nOctober is sacking season — who do you fear for?\nAnka: Clubs within the top six have often taken turns holding the ‘crisis baton’. You never want to be the manager holding it during the international break, lest you have people nattering on about your job security for an additional week. Erik ten Hag was the one in possession after losing 3-0 to Liverpool in September. He appears to be in trouble again after a 0-0 draw against Aston Villa — an OK result but one which leaves Manchester United 14th in the Premier League.\nGO DEEPER\nAnalysing Man United manager alternatives to Erik ten Hag: Hoeness, Van Nistelrooy, Tuchel and more\nMiller: Leicester City haven’t started the season brilliantly, but I’m still slightly surprised at the heat Steve Cooper is getting from some of their fans. It’s only been seven games, but it does feel like we’re already in that scenario where the boulder is rolling down the hill and it’s going to be really, really difficult to stop it now.\nAdvertisement\nKay: Don’t underestimate the possibility of early-season panic at Leicester (Cooper) or Southampton (Russell Martin), but the pressure on Ten Hag at Manchester United looks far greater. The new regime at Old Trafford were minded to replace him at the end of last season and he needed a serious uplift this season if it was to be more than a stay of execution. I would say they have shown a slight improvement so far this season — not a popular view — but I must emphasise the word “slight”. Things will have to improve significantly and I just can’t see that happening at the moment.\nAlexander: We are heading towards a year since Gary O’Neil’s triumphant appearance on Monday Night Football cemented his tactical credentials in the nation’s mind, as did his defensive masterclass to beat Manchester City at Molineux. There are no defensive masterclasses at Molineux anymore.\nCampbell: Oliver Glasner. In winning six of their final seven games of last season Crystal Palace played some scintillating football. It looked like he had unlocked an energy within what is a vibrant squad. Any notions of Palace going supersonic and doing a Leicester this season have sadly been misplaced. Losing Michael Olise was always going to be a blow but they put in one of the worst first-half performances of the season against Manchester United, making it look like they were facing the blue half of the city. The Austrian should get time, and Palace were better against Liverpool, but if they keep squandering chances the winless run could get out of hand.\nSpiers: Ten Hag. If, after spending £600m, overseeing a club’s worst Premier League campaign last season and now presiding over their worst start this time around (eight points and five goals from seven games) isn’t enough for INEOS to look (again) for someone else to replace him, I’m not sure what is.\nWhat would you like to see more or less of in the rest of the season?\nAnka: I don’t think all of the things that make Jhon Duran such a potent attacking option off the bench would carry over if Unai Emery made him the starting striker. I do think Duran is one of the Premier League’s most entertaining strikers and I want to see how many inventive finishes he has in his locker.\nKay: Less time-wasting — although the first step towards that is less tolerance of time-wasting. Don’t just book a goalkeeper in the 88th minute when he’s wasted another 30 seconds before restarting play. It blows my mind that kicking the ball a matter of inches sees Declan Rice sent off for a second bookable offence, “delaying the restart”, whereas a goalkeeper can systematically waste time all afternoon before getting a yellow card in the last couple of minutes.\nStafford-Bloor: The moaning about refereeing is making the Premier League difficult to engage with. It is not so much the grumbling over mistakes, more the insistence — sometimes even across official club channels — that they are not mistakes at all, but the manifestation of some deep-rooted conspiracy. It’s becoming so performative.\nAdvertisement\nAlexander: The last international break was full of, yes, international football but also an overwhelming nostalgia for Premier League football from 15 years ago. That’s fine in and of itself (who doesn’t enjoy a goals compilation from any era, really?) but the idea the game now has been ‘ruined’ is baffling. The general level of entertainment in a contemporary match is way higher than it was in the 2000s — and, yes, that includes errors from playing out from the back. Don’t believe me? Go and watch a full match from 2006 on YouTube — there’s a reason these have considerably fewer views than the two minutes 38 seconds of long-range screamers.\nCampbell: Howard Webb’s Mic’d Up — and by that I mean less. The idea of transparency and accountability in the decision-making process sounded like a step forward for officiating but it often feels like working backwards from the outcome to find a justification. It is seeing referees lean further into the easy defence of ‘the player gave me no choice’ and ‘common sense isn’t in the rulebook’, which further inflames fans who believe there is a lack of autonomy for referees.\nSpiers: More clips on social media from CBS Golazo of them bantering Micah Richards! No but seriously, can we have some better punditry, please? Gary Neville, Alan Shearer, Ian Wright and Jamie Carragher set high standards but generally the rest muddle through talking about vibes, players being brilliant or bad and teams who just don’t want it enough. Perhaps I’m biased but seeing Rory Smith on the BBC’s Champions League show or our own James Horncastle on TNT Sports’ goals show was such a breath of fresh air — insight, knowledge and the ability to convey those opinions and arguments in a palatable and entertaining way. More please.\n(Top photos: Getty Images; design: Kelsea Petersen)",
  "word_count": 3441,
  "scraped_at": "2026-02-14T01:57:46.252706",
  "_text_extracted": true
}