{
  "article_id": "15ffd7742d70",
  "url": "https://www.westmeathindependent.ie/2025/02/07/roy-keane-questions-whether-marcus-rashford-will-rediscover-his-hunger-at-villa/",
  "title": "Roy Keane questions whether Marcus Rashford will rediscover his hunger at Villa",
  "date": "20250207T230000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Roy Keane questions whether Marcus Rashford will rediscover his hunger at Villa\nBy PA Sport Staff\nRoy Keane has questioned Marcus Rashford’s move to Aston Villa “if he lost the hunger at Manchester United”.\nRashford has joined Villa on loan for the remainder of the season after falling out of favour with United boss Ruben Amorim at Old Trafford.\nAmorim said he could not get Rashford to see football the way he does amid conjecture over the England forward’s application in training.\n“If he’s lost the hunger at Man United – how will he get it at Aston Villa?” former United captain Keane said on ITV ahead of the Red Devils’ FA Cup fourth-round tie against Leicester.\n“Once you lose the hunger it’s hard to get it back.\n“It’s sad but it’s been on the cards the last year or two, especially since the new manager’s come in. Clearly they didn’t get on.\n“The manager got no reaction from Marcus. The strange thing for me was I thought when Marcus was going to leave Man United he was going to go abroad and try something new.\n“A new adventure for him, a different league, a different challenge. To go to Villa surprises me a little bit.\n“I know Aston Villa are going along nicely, but you can’t compare them to Manchester United.”\nRashford played in the Portuguese’s first six matches but was dropped for the Manchester derby in mid-December, after which the 27-year-old revealed he was ready for a new challenge.\nHe did not play for United again following the Europa League trip to Viktoria Plzen on December 12th before joining Villa, who have qualified for the last 16 of the Champions League under Unai Emery.\nKeane’s fellow pundit Ian Wright said: “He’s going to a team that’s performing better. We can’t disrespect Villa, what they’ve done and what they’re trying to do.\n“If Marcus can go there and recapture it they can build around him. He’s a good player.\n“Everybody has been talking about his body language here (at United) and what’s going on.\n“He’s done great for Man United up to this point but maybe it’s time to leave. You hope he can recapture because if he doesn’t, then what?”",
  "word_count": 372,
  "scraped_at": "2026-02-14T02:26:28.925641",
  "_text_extracted": true
}