{
  "article_id": "160ffa08756d",
  "url": "https://www.wirralglobe.co.uk/news/23346108.lawyers-representing-liverpool-fans-escalate-claim-uefa/",
  "title": "Lawyers representing Liverpool fans escalate claim against UEFA",
  "date": "20230227T110000Z",
  "domain": "wirralglobe.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LAWYERS acting on behalf of Liverpool fans caught up in the chaos at last season’s Champions League final have escalated their claim against UEFA.\nAn independent review concluded earlier this month that UEFA bore “primary responsibility” for what almost led to a “mass fatality catastrophe” at the showpiece game in Paris last May.\nReds fans found themselves penned against stadium perimeter fences ahead of the match against Real Madrid due to the organisational failings, and were then tear-gassed by French police.\nLaw firm Leigh Day is representing more than 800 Liverpool supporters and has now submitted a formal letter before action on their behalf, setting out the legal basis of the claim.\n“Since the publication of the report, UEFA has issued an apology to fans and has said it will be announcing a ‘special refund scheme’, but we believe those who have suffered deserve more than the price of a ticket,” Leigh Day partners Clare Campbell and Jill Paterson said in a joint statement.\n“For a lot of our clients, the reason they are part of the claim is about accountability and part of that is redress.\n“Offering appropriate compensation is part of UEFA recognising the significant part it played in the chaos that unfolded at the 2022 Champions League final and the injuries and traumas that were suffered as a result.”\nFan group representatives met with UEFA officials in Liverpool on Tuesday and welcomed the governing body of European football saying it would implement all the recommendations of the report.\nUEFA has already issued an apology to Liverpool fans after it initially blamed them for creating the chaos by arriving late, and in some cases with counterfeit tickets.\nThe independent report said those initial accusations were “manifestly inaccurate”.",
  "word_count": 289,
  "scraped_at": "2026-02-14T01:34:40.912120",
  "_text_extracted": true
}