{
  "article_id": "1622e3f6506e",
  "url": "https://www.caughtoffside.com/2023/10/30/aston-villa-keen-on-21-year-old-la-liga-ace-who-is-intrigued-by-their-project/",
  "title": "Aston Villa keen on 21 - year - old La Liga ace who is intrigued by their project",
  "date": "20231030T073000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa are keen on signing Nico Williams from Athletic Club Bilbao.\nAccording to Dean Jones from Give Me Sport, the 21-year-old winger is intrigued by the project at the West Midlands club and it remains to be seen whether they can convince the player to join them in the coming months.\nAston Villa could certainly use more cutting-edge in the final third and Williams will add goals and creativity to the side. The Spaniard is versatile enough to operate anywhere across the front three and he could be an asset for Unai Emery.\nDean Jones believes that convincing Williams to leave Athletic Club Bilbao will not be easy, especially since it’s his boyhood club. In addition to that, his brother Inaki Williams plays for the club as well.\n“Sure, he has been intrigued by the Aston Villa project. But, with Nico Williams, I’m never completely sure that it’s actually the transfer that you’ve got to convince him of. I think it’s actually leaving Athletic Club that you’ve got to convince him of.\n“Obviously, it’s a club that is ingrained in the community, and players that play for them tend to play there for a very long time and sometimes their entire careers. The fact that his brother is also at the club means there are even more reasons for him to stay at Athletic Bilbao.\n“I think that it’s a particularly complicated situation. Also, there is the factor that Athletic Club believe they are close to Nico Williams signing a new contract.”\nThe Spanish club believe that they can convince him to sign a new contract soon and it will be interesting to see how the situation develops. It is fair to assume that a move to Aston Villa would be off the cards if the player signs an extension with the La Liga outfit.\nThe opportunity to join a Premier League club can be a tempting proposition for most players and Williams could be keen on trying out a new challenge. Regular football in the Premier League could accelerate his development and a top-class manager like Emery could help him fulfil his potential.\nAston Villa are hoping to put together a side capable of pushing for Champions League qualification and signings like Williams will certainly take them to the next level.",
  "word_count": 383,
  "scraped_at": "2026-02-14T01:56:32.767113",
  "_text_extracted": true
}