{
  "article_id": "1670cd6320ce",
  "url": "https://www.nytimes.com/athletic/5708051/2024/08/19/ranking-cristiano-ronaldos-biggest-tantrums/",
  "title": "Ranking Cristiano Ronaldo biggest and most theatrical tantrums",
  "date": "20240819T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Who is Cristiano Ronaldo?\nHe’s a Champions League, Premier League, La Liga, Serie A and European Championship winner.\nHe’s a five-time Ballon d’Or winner.\nHe’s the greatest international goalscorer in history.\nScratch that and remove the caveat. He’s arguably the greatest goalscorer in history, full stop.\nAnd he’s undoubtedly one of the greatest football players ever.\nHe’s also… a bit of a baby.\nAdvertisement\nAs much as Ronaldo is known for his incredible goalscoring ability, his childlike penchant for a tantrum is equally renowned. He’s a perfectionist who plays with his heart on his sleeve, which is likely how he could elevate himself above most of his competitors to become a habitual winner and one of the most recognised people on the planet.\nWith that said, a Ronaldo tantrum remains hilarious, and after his latest one in Al Nassr’s 4-1 Saudi Super Cup final defeat against Al Hilal on Saturday, The Athletic has rated Ronaldo’s greatest-ever tantrums…\nAl Nassr 1-4 Al Hilal, August 2024\nAfter Ronaldo put Al Nassr ahead on the verge of half-time in the Saudi Super Cup final against Al Hilal on Saturday, all looked to be well in the blue and yellow corner of Riyadh.\nWell, until Al Nassr collapsed catastrophically in the second half to lose 4-1. Once upon a time, Ronaldo would have been prone to a strop — comically throwing his toys out of the pram and throwing his arms about as his team-mates looked on at one of the greatest players ever losing his head.\nBut he’s 39 now, earning truckloads of money in Saudi Arabia. Surely that melodrama is behind him, right? Right?\nAfter Brazilian winger Malcom had put Al Hilal out of sight with their fourth in the 72nd minute, it was the cue for Ronaldo to tell his team-mates precisely what he thought of their performance. The forward signalled that Al Nassr had gone to sleep by putting two hands next to his ear before shrugging as if to say, ‘What more can I do?’.\nStill, the piece de resistance of this theatrical display was when he appeared to insinuate that his team-mates had emptied their bowels with a gesture it doesn’t take much imagination to conjure. To top it all off, footage later showed Ronaldo storming back towards the dressing room, opting not to collect his runner-up medal.\nAdvertisement\nTantr-o-meter: 9/10\nGO DEEPER\nOne year of Cristiano Ronaldo in Saudi Arabia\nEverton 1-0 Manchester United, April 2022\nWhile his Saudi stunts blur the line between hilarious and ridiculous, this particular instant was definitely a ‘WTF’ moment, but not in a good way.\nFacing a charged Everton crowd, particularly towards the end of the season, is never easy. While the atmosphere and eventual 1-0 defeat at Goodison Park might have unsettled Ronaldo, who was booked during the match for booting the ball into the stands out of frustration, his actions after the final whistle can’t be excused.\nAfter the referee had blown for full time, footage emerged on social media of Ronaldo walking down the players’ tunnel before knocking a mobile phone out of someone’s hand, with that phone then smashing on the floor. Ronaldo later apologised on social media for the “outburst”.\nNot cool, mate.\nTantr-o-meter: 6/10\nSerbia 2-2 Portugal, March 2021\nCristiano, you get the benefit of the doubt in this case. A tantrum was more than justified.\nAfter latching onto a loose ball inside the penalty area with the score at 2-2 in stoppage time, Ronaldo rounded the Serbia goalkeeper and tapped into an open goal.\nSerbia defender Stefan Mitrovic raced to clear and hacked the ball away near the goal line, leaving the officials — without the assistance of the VAR system — to declare it had not gone in and to continue playing. However, replays showed the ball had crossed the line. Naturally, Ronaldo went red with fury. He tore off his captain’s armband, threw it to the turf and stormed off the pitch.\nEven into his late thirties, it is almost heartening how being denied the glory of a winning goal still affects him this way. We don’t mind this one.\nTantr-o-meter: 7/10\nGO DEEPER\n130 v 108: breaking down the astonishing international scoring of Ronaldo and Messi\nValencia 0-2 Juventus, September 2018\nFresh from winning three successive Champions League trophies with Real Madrid, Ronaldo joined Juventus to end the Italian giants’ 22-year wait for their third triumph in the competition.\nAdvertisement\nSo when he received his first red card in 154 Champions League matches after the referee adjudged him to have pulled Valencia defender Jeison Murillo’s hair, it all became a little too much for the forward.\nVideo for UK readers\nVideo for non-UK viewers\nReferee Felix Brych showed Ronaldo the red card after discussing the incident with his assistant, and he was left in disbelief. Ronaldo argued with the referee, gesturing with his hands, shook his head and collapsed on the floor. He left the pitch in tears and had to be consoled by staff as he made his way down the tunnel.\nHe did end up having the red card rescinded after the match, with video footage demonstrating the incident was little more than a rub on the head. Still, the idea of watching on from the sidelines as his team-mates played in his beloved Champions League was enough to start the waterworks.\nTantr-o-meter: 6/10\nReal Madrid 3-0 Almeria, April 2015\nNow, this is vintage Ronaldo.\nIt’s no secret that Ronaldo loves scoring goals, and with this particular event falling right in the middle of his goalscoring prime, any game when he didn’t score gave those folks at Barcelona — namely Lionel Messi and Luis Suarez — an opportunity to either catch up or move ahead of him in the race to be the season’s top scorer.\nWith Madrid 2-0 up at the Bernabeu, the game had already been wrapped up, but Ronaldo hadn’t scored. So when right-back Alvaro Arbeloa came out of nowhere to get to a square pass across the box to tap in ahead of Ronaldo, the Portugal star was incensed.\nWhile his team-mates quickly converged on Arbeloa to celebrate his first goal of the season, Ronaldo stood alone in the goal and hammered the ball in the net before walking away towards the halfway line with the ball in hand.\n“I’m not upset about Cristiano’s gesture,” Arbeloa said after the game. “It’s normal that he should be angry; he didn’t score, and his ambition is always to score.”\nAdvertisement\nTantr-o-meter: 8/10\nPortugal 4-0 Spain, November 2010\nEvidently, Ronaldo hates nothing more than a team-mate stealing one of his goals. Yet while Arbeloa’s finish against Almeria was never Ronaldo’s to take, he was within his rights to be frustrated here.\nAny time Portugal face Spain there are fireworks and, considering Spain had won the World Cup a few months earlier, Ronaldo was especially keen to stick one to Portugal’s neighbours.\nAnd how he almost did. Faced with a one-on-one situation against Gerard Pique, Ronaldo twisted and turned his former Manchester United team-mate inside-out and moved into a shooting position inside the box. Then, Ronaldo scooped the ball over Spain’s goalkeeper, Iker Casillas, and the ball was sailing perfectly into the top corner… until team-mate Nani came out of nowhere to head it in on the line.\nBut the linesman ruled that Nani had been offside, ruling out what would have been the opening goal. In response, Ronaldo theatrically started spinning on the spot while punching the air, before throwing his captain’s armband on the floor and directing his ire towards Nani.\nPortugal went on to beat Spain 4-0, a historic result, but this match will go down in history (at least in Ronaldo’s mind) as the game where Nani stole what would have been one of Ronaldo’s greatest goals.\n“I touched the ball because I thought I wasn’t offside,” Nani said. “Everything happened so quickly. After having time to think about it, I apologised to Ronaldo. It was a great piece of play, and I shouldn’t have ruined it.”\nLegend has it that Ronaldo has never truly forgiven him.\nTantr-o-meter: 10/10\nManchester United 2-0 Manchester City, May 2009\nWith United cruising on their way to a 2-0 victory in the Manchester derby, Ronaldo was substituted by manager Sir Alex Ferguson shortly before the hour mark. While Ronaldo had opened the scoring with a deflected free kick, he was eager to add more goals to ensure he won the Golden Boot with Nicolas Anelka and Steven Gerrard in pursuit.\nGO DEEPER\nManchester United: What made Sir Alex Ferguson so successful?\nRonaldo was visibly shocked when his number was held up by the fourth official and sulked off the pitch before throwing the coat he had been handed on the floor of the United bench. While shaking his head, Ronaldo began tearing up at the prospect of losing out on the Golden Boot.\nAdvertisement\nAs it transpired, Anelka snatched the honour after scoring four goals in the final four games of the league season, and Ronaldo left for Real Madrid a few months later.\nIf only Fergie left him on, eh?\nTantr-o-meter: 6/10\nOverall winner: Portugal 4-0 Spain, November 2010\n(Top photo: VI Images via Getty Images)",
  "word_count": 1538,
  "scraped_at": "2026-02-14T01:51:48.874189",
  "_text_extracted": true
}