{
  "article_id": "16ba3808e339",
  "url": "https://www.foxnews.com/us/nebraska-aims-draw-crowd-90k-plus-womens-volleyball-event-break-world-record",
  "title": "Nebraska aims to draw crowd of 90K - plus for women volleyball event , break world record",
  "date": "20230830T194500Z",
  "domain": "foxnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "An attendance record of global proportions could be set Wednesday night when the University of Nebraska hosts a celebration of volleyball at Memorial Stadium.\nThe event will feature an exhibition between in-state Division II powers Nebraska-Kearney and Wayne State and a regular-season match between Omaha and the fourth-ranked Cornhuskers. Country artist Scotty McCreery will perform afterward.\nNebraska athletic department officials have taken aim at the women's sporting event attendance record of 91,648, set during a Champions League soccer match as Barcelona defeated Real Madrid 5-2 at the Camp Nou Stadium in 2022.\n\"If any place can do it, it's Nebraska,\" Huskers freshman outside hitter Harper Murray said.\nMemorial Stadium's official capacity is just over 85,000 for football, but that number will be higher for this event because seating on the field is available. The court is positioned on the north end of the stadium, which is the home field of the Huskers football team.\nThe American record attendance for a women’s sporting event is 90,185 for the 1999 World Cup soccer final between the United States and China at the Rose Bowl in Pasadena, California.\nNebraska has sold out 306 consecutive regular-season matches, though Wednesday's event won't count toward the streak because it is not being held on the team's Devaney Center court. The Huskers have led the nation in attendance every season since 2013, and eight of the top nine crowds in NCAA volleyball history are matches that have involved Nebraska.\n\"I keep flashing back to the USA soccer team playing at the Rose Bowl,\" Huskers coach John Cook said. \"That was a big moment for women’s sports and soccer really shot up. I think this is another great chance for that to happen in the sport of volleyball.\"\nNebraska has won five national championships in volleyball, and its program is one of the few in Division I that turns a profit — $1 million last year, according to athletic department CFO Doug Ewald.\nVolleyball Day in Nebraska tickets went on sale in late April, and more than 82,000 were sold in three days. Adults get in for $25 and children for $5.\nThe magnitude of the event prompted chancellor Rodney Bennett to cancel classes for the day. NCAA President Charlie Baker and Big Ten Commissioner Tony Petitti are scheduled to be on hand. So are Husker volleyball players who were part of iconic coach Terry Pettit's teams over four decades. High school teams from across a state stretching 430 miles border to border are being excused from classes so they can attend.\nCLICK HERE TO GET THE FOX NEWS APP\nVolleyball has surpassed basketball as the No. 1 girls high school team sport with 455,000 players in the United States. It's long been No. 1 in Nebraska. The state ranks 38th in population at just under 2 million; it's 25th nationally in number of high school volleyball players with 7,000.",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:13:11.437702",
  "_text_extracted": true
}