{
  "article_id": "16c2a8eeef03",
  "url": "https://www.eurohandball.com/en/news/en/mens-ehf-euro-2026-flash-quotes-13-january/",
  "title": "Comments from Men EHF EURO 2026 players and coaches , 13 January",
  "date": "20260113T110000Z",
  "domain": "eurohandball.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Men's EHF EURO 2026 flash quotes: 13 January\nHERNING – Comments from players and coaches at media calls and photoshoots ahead of the Men's EHF EURO 2026.\nSERBIA\nRaul Gonzalez (ESP) – Serbia head coach\nOn the preparation:\n“All players are healthy, we are ready, we had time to prepare, we are satisfied with the preparation. I think we are ready. We trained to play like a team, like a national team. I think this is our goal.\n“We have to prepare how to manage several games. But the focus is always on the first match. This one is the most important game because when you start to play in a competition, everybody has to be ready.”\nOn facing Spain and another Spanish coach in the opener:\n“It is not special for me to face Spain and Spanish coaches. This is more a matter for the media, not coaches. We play a lot of games, a lot of tournaments, we play at different places, in different competitions like Champions League, European League or European Championships.\n“When you work 20 years as a coach, you often play against the same coaches, and among them are many from Spain. So you have several friends on the other side.”\nOn the preliminary group in general:\n“We have to be concentrated in our group. You never know what will happen, because, in this kind of tournaments, the results are amazing. Everything is changing. One day you lose, the next day you win. You have to be focused and you have to be ready. In the first game, we have to give everything. Concentrate, focus — then we will see what happens.\n“I try to adapt the tactics to the players because it's easier. When a new coach is coming, everybody has to do everything like the coach wants. This is more difficult, I think it's better to know which kind of players you have and adapt everything to them.”\nDejan Milosavljev (SRB) – goalkeeper\nOn his goals and expectations:\n“All players are ready to play, this is the most important thing. But, of course, we have a very hard group with good opponents. Our first goal is to make it to the second group (main round).”\nOn the fact that Serbia beat Spain twice in the last four matches:\n“Spain have young and good players, and they are in a good shape. You never know what can happen in the first game of the tournament. Everything is possible. Therefore, I hope that we open this tournament in a good way.”\nOn Serbia’s experienced goalkeeper duo, including Vladimir Cupara:\n“In this tournament, and in general in modern handball, it's very important for the goalkeeper to stay on a good level and for a team to have two strong goalkeepers. This is one important key to win games.”\nOn the duel with Spain’s goalkeeper Sergey Hernandez:\n“Sergey is an amazing goalkeeper, he improved a lot in the last years in Magdeburg. I'm happy to play against Spain, against Sergey, of course. And I hope I will have a better game than him.”\nOn the cooperation with defence boss Mijajlo Marsenić in the national team and on club level in Berlin:\n“For me, it's very important because we know each other from Berlin. And we have also experience how and what we must do in the defence. And Marsenić is important because he is one of the oldest players in the team and how he shares the experience with the young players that we have.”\nMijajlo Marsenić (SRB) – line player\nOn Serbia’s goals at the EHF EURO 2026:\n“Our goal is to give our best in every game and to show everything we have on board, then we have a chance to reach the main round. And I think this team is really able to do that, though it's a very difficult group. But we have enough quality and potential in our team that we can simply play with every opponent in our group.”\nOn the opener against Spain:\n“We beat them twice, we lost twice in the last four matches, but this was qualification. It is something else when you play at such a big competition against Spain.\n“Spain have quality, Spain is very dangerous, normally they finish among the best five or six. So it will be a very difficult game, a very important game for us. And we have to give everything to simply have a good start.”\nOn the composition of the Serbian squad with players from clubs all over Europe:\n“We are always happy to play for the national team and to spend time together. And I think that many of us are very close friends in private life. And that means a lot, because we think similarly. It is always a pride and honour to play for the national team and to be on the court with friends.”\nSPAIN\nJordi Ribera (ESP) – Spain head coach\nOn his newly built team:\n“They are doing very well. In November we tested many of the young players, and they showed a good performance. Now in January we had a combination of young and experience players. Also in this constellation, they did a good job.\"\nOn the Spanish chances at the EHF EURO 2026:\n“We were drawn in the hardest group of the preliminary round with Germany, Serbia and Austria, and we will face even tougher teams when we make it to the main round, like France and Denmark. This will be a tough tournament for us. But with right focus and going step by step we can keep up. Right now, our only focus is on the first match against Serbia.\"\nOn facing teams with Spanish coaches, such as Serbia and Austria:\n“It is very typical, not only in Europe, but at Olympic Games and World Championships to face teams coached by Spaniards. This is normal for us, it happens at every competition.\"\nOn their chances of winning a medal:\n“Of course we dream of a medal, but the focus is always only on the next match and going step by step.”\nAlex Dujshebaev (ESP) – right back\nOn his goals:\n“The most important thing for me is that we are able to compete on the highest level to show everyone that we can fight in every game and that can prove we are a top team. Mainly it is to show our character and our big emotions in the games and I want that all the supporters feel just proud of our performances.”\nOn his impressions of the new players in the Spanish team:\n“We are in a process and we changed a lot. It's a different generation now, but I'm sure that the young guys that came to the team bring new energy.\n“For sure they are confident, we try to help them to help us as much as possible and I think they are developing quite well. “\nOn their opponents in the preliminary round, Germany, Austria and Serbia:\n“I think we play in the toughest group. It's one of the most difficult groups because I think every team can beat each other.\n“They are good teams, but we are focusing on the first game. We have to try to win the first points as that will give us a lot of confidence for the next games of the tournament.\nOn taking revenge against Austria for the EHF EURO 2024 defeat:\n“I don't think it's like about revenge, but for sure we will have on the mind that if we are not 100 per cent focused and if we don't perform on our best, we can lose again against them and we will try not to allow this.”\nOn their chances of winning a medal:\n“Why not? I'm sure that we are a competitive team which is able to do that. Of course, we know how difficult it will be because even if we advance to the main round, we will face some of the biggest teams in the world and a lot of medal candidates, but I think we are able to manage to be there.\nSergey Hernandez (ESP) – goalkeeper\nOn facing Dejan Milosavljev in their opener against Serbia, as in the TruckScout24 EHF FINAL4 final:\n“It's hard when you have a goalkeeper like him against you, especially when he's having a good day. His performance goes really, really high and it's always hard. It makes it harder to win.”\nOn bringing his personal flow from SC Magdeburg to the national team:\n“I hope I can continue like this. We'll see when the tournament starts, but it looks good so far.”\nOn his new role in the team, as Gonzalo Perez de Vargas and Rodrigo Corrales are not in the squad:\n“For me, it is the same as always. They are not here. Nacho (Ignacio Biosca) and me, we have to take the responsibility. I'm really sure we will manage to be at the same level as they were back in the years, hopefully.\n“And for me, it's just being in the goal and enjoy and help the team the best I can between the posts.”\nOn their preliminary round opponents Germany, Serbia and Austria:\n“It is definitely not the easiest group, but when you go to the European championship, you know what you're facing. Probably, it's the hardest event of the year.\n“Definitely, we have a really hard start, and in the next phase, we're also having quite hard opponents. But whether you play them now or later, it doesn't matter. We focus on our team and our performance, on delivering on the court.”\nNORTH MACEDONIA\nKiril Lazarov (MKD) – North Macedonia head coach\nOn their preparation tournament in Switzerland:\n“I’m satisfied with the team, with the players. We have to know that we can do always better, but we have time to make some things we know are good and we have two days more to start the European championship good prepared.”\nOn their first match, against Denmark:\n“We are playing the first match against the best team in the world in the last 10 years, Denmark. We are very excited to play against them.\n“They are at home, that will be very difficult for us, but we have nothing to lose in this match and we will try to enjoy this match.\n“I was speaking with my young players that it will be a new experience to play one country who loves handball, maybe it’s the best sport. In other countries football is the most famous sport, but here in Denmark yes, football, but handball is in the first place. That’s a big experience for everybody.”\nOn the change in generations in the Macedonian team:\n“The most important for us is that we are changing the generations step by step, and that is a very difficult process. Better selections than us have problems changing the generation.\n“We are a small country and we must go patient and step by step. In the last two years I’m very satisfied with this.\n“We already improved a lot of things and we showed this in the last two years that we can give one good match. But to have continuity we must show in the future just not one match, and that if you play the European championship or the world championship, you must be every second day good.”\nOn their goals for the tournament:\n“We must be very honest. Everyone has ambitions and everyone wants to win the matches, we must know that we have a very tough group, playing against Denmark in Herning. Also against Portugal who last World Championship was playing the semi-final. We saw that in the last tournament Portugal won (against) Egypt, Spain and Iran.\n“It’s very difficult to say ‘we want to go in the second round’. Everybody wants (that).\n“Also against Romania, also a good team with big traditions. Maybe in the last time they’re not at the top top level, but every year they are better and better.\n“We have to enjoy. I think that we are good prepared for this tournament, and we are very excited, and we are waiting to start the European championship to see where we are now with quality and good experience.”\nMartin Tomovski (MKD) – goalkeeper\nOn playing in Denmark, against Denmark:\n“It will be really challenging to play in Denmark, especially against one of the main hosts. Denmark is number one in the past years, so we can only enjoy this competition and give our best to make our country happy.”\nOn the fact that most of the team play club handball in North Macedonia:\n“In the past years the Macedonian league is getting better, so we have have a lot of players who are playing in the (Machineseeker EHF) Champions League. Not only in the last years, they have played before — I also played in the Champions League in Vardar.\n“All of that can only help us in the national team, with Lazarov’s experience as a player at first and now as a coach. We can only make a great atmosphere and enjoy everything on the court.”\nOn wanting to enjoy the tournament:\n“I know that of course we want to achieve more, to go to the next round, but we will go step by step, game by game, and we will hope for our best.”\nPetar Atanasijevikj (MKD) – left wing\nOn how the team feels before the tournament:\n“We are feeling very good. We are now in Silkeborg resting, we had training, we rested a little bit, and now we are training in Herning.”\nOn the preparation tournament in Switzerland:\n“It was a good tournament, we played Ukraine and Switzerland. Especially the game against Switzerland it was a good game, a fast game, and we know we can do everything if we believe.”\nOn the team’s strengths:\n“The team’s strengths are the teamwork, and believing in each other.\n“We all the time in the Macedonian league play amongst each other, but it’s good for the national team to play with each other, to know the players, to know everybody, to know how they’re thinking and have fun.”\nOn how they build their team spirit:\n“We just make fun, we drink coffee, we talk and that’s it. Very regular stuff.”\nOn the game he is most looking forward to in the preliminary round:\n“I’m most looking forward for the game against Portugal. I think we have a chance with them, just to show we can do something.”\nFilip Kuzmanovski (MKD) – centre back\nOn how they are feeling ahead of the tournament:\n“We have a hard group, but we play for Macedonia, we fight for Macedonia. We are a young team and we show something in this tournament.”\nOn being one of the older members of the team:\n“I want to show my experience for my players, my teammates. We are a long time together — three, four years we play together and we know everybody. This is the strong side for us. We show our best.”\nOn the match against Denmark:\n“We have motivation because we play against Denmark. For me, Denmark is the favourite for this title. We play in Denmark in this full hall, and this gives motivation. But our mentality when we play outside in a full house with a lot of (people) from Denmark, we have motivation to show our quality. We fight 60 minutes against Denmark.\n“In Denmark there are a lot of big names: (Mathias) Gidsel, (Simon) Pytlick, (Rasmus) Lauge, (Emil) Nielsen. This is hard, but this is also motivation, because these are the top five stars in this team.”\nOn the strengths of the Macedonian team:\n“Key for us is the defence. Without defence we can not win in these matches.”\nGERMANY\nAlfred Gislason (ISL) – Germany head coach\nOn the differences between the current team and previous tournaments:\n“What characterises this team more than before is that we have greater depth, especially in defence. In recent years we were extremely dependent on Johannes Golla and Julian Köster both playing together in the central defensive block.\n“Now we have more defensive specialists, which allows Golla and Köster to get more rest. That means we can play even more aggressively over the full 60 minutes. That is extremely valuable in a tournament like this, where we play every other day. I’m also impressed by how the new players, who are going into their first tournament, give the impression that they’ve been part of the team for ages.”\nOn the friendly wins against World Championship runners-up Croatia:\n“Of course I’m satisfied that we won both games, but for me the way in which we won them was even more important. When things weren’t going our way at times, we continued to play patiently, and we could always rely on players, coming from the bench. That makes us significantly more stable than in recent years.”\nOn their first opponents, Austria:\n“It feels like we’re always playing against Austria, in any tournament, in any qualification. They stick to their style of play, sometimes with very long attacking phases and a lot of seven-against-six. They are an awkward team to face, especially in an opening match. The most important thing for us is simply to impose our own style of play. That means one team wants to slow the tempo down, while the other wants to keep it high.”\nJohannes Golla (GER) – line player\nOn their preparation for the EHF EURO:\n“My feeling is that, compared to recent years, the team is really in a good condition. From the very first training session I’ve had a positive impression, both in terms of physical shape and mental freshness.\n“We have talked about our defensive work in conjunction with the goalkeepers, whom we have always been able to rely on in recent years. The two friendly wins against Croatia showed that we are capable of beating a strong opponent. That’s why I’m very, very happy with how the preparation has gone so far.”\nOn Germany’s objectives at the EHF EURO:\n“Reaching the semi-finals is of course somewhere in the back of our minds. From our experience at past tournaments, we know how much is required to get there and that you’re well advised to take each game as it comes.\n“We’re up against strong opponents, and we know how important it is to make a good start against Austria in order to settle into the tournament and, ideally, build a bit of momentum.\n“In tournaments like this, with a main round, you also know that you can’t really plan much anyway, because so many eventualities can occur. A team drops a point you didn’t expect, and suddenly everything looks different. That’s why it doesn’t make much sense to think too much about what might happen in five days’ time, but rather to focus fully on the next opponent.”\nJuri Knorr (GER) – centre back\nOn the mood within the team:\n“Of course it’s nice to beat Croatia twice [in friendly matches] and to look relatively solid in the process. It’s better than going into a European Championship on the back of defeats.\n“It’s a good feeling that we’re taking with us now, but we start the tournament on zero points. Even though we’ve beaten Croatia twice, everyone knows what awaits us and that those two wins won’t buy us anything on Thursday. But everyone also knows that we can be a very good team.”\nOn their opponents and objectives at the EHF EURO 2026:\n“Even the preliminary round group is incredibly tough. And what follows in the main round is the hardest tournament I’ve ever experienced in terms of the path to the semi-finals. Every main-round match is like a quarter-final. So if we progress, we effectively have four quarter-finals to play. That will be extremely tough, but I also believe that not many teams are particularly keen to play against us.”\nPhoto © kolektiff images",
  "word_count": 3339,
  "scraped_at": "2026-02-14T02:09:43.011920",
  "_text_extracted": true
}