{
  "article_id": "16e11966138e",
  "url": "https://www.67hailhail.com/news/to-be-honest-kyogo-furuhashi-reveals-how-he-really-felt-about-japan-snubs-at-celtic/",
  "title": "  To be honest  - Kyogo Furuhashi reveals how he really felt about Japan snubs at Celtic",
  "date": "20250303T211500Z",
  "domain": "67hailhail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kyogo Furuhashi left Celtic to join Rennes in the January transfer window.\nThe Japanese striker was an icon at the club as he helped Celtic win seven out of nine trophies during his time at the club.\nAnd now, after Kyogo made his £10m move to Rennes, the Japan international has spoken out on how he felt the move could help his international ambitions.\nIn an interview back in Japan, Kyogo has spoken about how he really felt about being snubbed by his country because he played his football in Scotland with Celtic.\nKyogo admits to ‘frustrating’ time at Celtic for Japan omission\nKyogo was omitted from many Japan squads over his time in Scotland but it was the World Cup announcement whilst at Celtic that really stung the former Parkhead favourite.\nKyogo told Lemino Football, “It was really frustrating, to be honest I think the announcement of the squad was on the day we were traveling for the Champions League away game.\n“I couldn’t let it dwell on me. To be honest, I was really depressed and frustrated, but I had to play in the Champions League, so I did my best to switch gears.”\nKyogo dreams of Japan call-up after Celtic exit\nKyogo has admitted that the main reason he left Celtic was to resurrect his Japan career and the former Hoops striker has reiterated that with Rennes, that is exactly what he will do.\nKyogo continued, “I think that if I can prove my strength here in France by playing every week I will be called up by the national team again and I will be able to show a different side of myself.\n“I cannot claim to be called up with certainty, but if he can demonstrate my ability at Rennes, it definitely adds to my chances.\n“I just want to make an impact here and create chances for my teammates. I’m very pleased we won in my opening game.\n“There are a lot of players in France with very high technical abilities and I know I will challenge myself every day.”\nSo far, the former Celtic striker has mustered just 83 minutes of football in Ligue 1 since his big move and in Rennes’ last two fixtures, Kyogo was an unused substitute.\nIt seems like the Japanese striker is struggling right now and if he’s not careful, it won’t be long until playing at Celtic won’t be used as the only excuse not to pick him for future national squads.",
  "word_count": 415,
  "scraped_at": "2026-02-14T01:58:05.308267",
  "_text_extracted": true
}