{
  "article_id": "17452d02009a",
  "url": "https://thepeoplesperson.com/2025/11/22/every-french-player-to-ever-play-for-man-united-301376/",
  "title": "Every French player to ever play for Man United - Man United News And Transfer News",
  "date": "20251122T101500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United captured fans’ imagination with the statement signing of youngster Leny Yoro in the summer of 2024.\nThe young Frenchman has been highly impressive and looks set to be a pillar of the United defence for years to come.\nThe Red Devils have a rich history of Frenchmen in their teams and here is a comprehensive list of every French player to feature at senior level for United.\nEvery French player to play for Man United\nFigures correct as of 29/12/25\n1) Patrice Evra\nThe left back enjoyed massive success at Old Trafford, winning numerous trophies including the Champions League in 2008.\nEvra is certainly one of the best defenders to play for the club and delighted fans with his passion, defensive prowess and his ability to attack opposition full backs at will.\n2)Mikael Silvestre\nAnother French fullback, Silvestre was a valuable squad member for many years at United.\nHe could also fill in at centre back and probably his biggest moment was scoring two headers in a victory over Liverpool in 2004.\n3) Anthony Martial\nSomewhat surprisingly, Martial appears third on the list of most appearance makers and has scored more goals than any other Frenchman at Old Trafford.\nMartial arrived to the club with a big reputation as a teenager but failed to consistently deliver on his talent.\nHe now plays in the Mexican league for Monterrey.\n4) Paul Pogba\nPogba is still one of the most divisive player amongst fans. For some he was the personification of elegance on the pitch and for others, he was a wasted talent.\nThe midfielder came through the academy but left in 2012 to go to Juventus. He was signed back for a club record fee in 2016 and spent six more years at the club.\nHe won the Carabao cup and Europa League in his first season back but failed to live up to his magnificent talent.\n5) Eric Cantona\nThere isn’t much to say about the mercurial genius that hasn’t already been written. Cantona quite frankly was the catalyst for United’s early Premier League successes and one of the most popular figures Old Trafford has ever seen.\nCantona would have been much higher up the list in appearances and goals if he hadn’t decided to retire at just 30 years old in 1997.\n6)Fabian Barthez\nThe eccentric World Cup winner joined United in 2000, one year after the great Peter Schmeichel left.\nHe did win a Premier League title in 2003 but he was never able to find the immaculate form of his earlier career in France.\n7) Louis Saha\nThe forward joined from Fulham in 2004 and largely impressed when he was on the pitch.\nRio Ferdinand famously claimed he was the most difficult United attacker to defend owing to his unique skillset.\nNonetheless, injury put a damper on his United career and he had to leave in 2008.\n8) Raphael Varane\nThe Real Madrid legend was finally signed in 2021. Varane was chased by United back in 2011 but he finally joined the Spanish giants.\nVarane was a Rolls-Royce of a defender who would win the Carabao Cup and FA Cup for the Red Devils.\nHis last appearance in competitive football would be pocketing Erling Haaland in the FA Cup final victory at Wembley in 2024.\n9) Laurent Blanc\nBlanc, like Barthez, was a decorated World Cup winner when he arrived at Old Trafford.\nHe signed at the club in the twilight of his career, but still managed to show his class from time to time.\nThe French defender would win a Premier League title in 2003 before hanging up his boots.\n10) Morgan Schneiderlin\nThe midfielder’s career failed to ever really take off at United.\nHe impressed in the Premier League for Southampton but could never really make the step up playing for such a big club like United.\n11) Leny Yoro\nUnited fans hope Yoro will soar up this list in years to come.\nThe 20 year old is calmness personified and seems to have all the tools necessary to be one of the best defenders of this generation. Hopefully plenty of those years if not all, are spent in Manchester.\n12) David Bellion\nBellion was brought in by Sir Alex Ferguson in the summer of 2023 but he was a gamble that did not pay off.\nThe pacey attacker showed the occasional glimpse of his talent but in truth was never cut out for this level.\n13) Gabriel Obertan\nObertan is a similar story of a punt by the great manager that just did not work out.\nHe did go on to play for Newcastle United in the Premier League after his time at Old Trafford but he never looked comfortable at the highest level.\n14) Willy Kambwala\nThe young defender came through the United academy and played well in the limited chances he got in 2024.\nErik ten Hag used him against Liverpool at Old Trafford in a 2-2 draw in April 2024 and he put in a stellar performance.\nNonetheless, he was sold that summer to Villarreal when the club received an offer that was too good to turn down.\n15) William Prunier\nPrunier is one of the strangest moments in United’s history. He was offered a trial in the 1995-1996 season but only played twice.\nHe generally played well on his debut vs Queen’s Park Rangers, hitting the post and notching an assist.\nThe Frenchman was terrible though in a big defeat to Tottenham Hotspur on News Years’ Day in 1996, being part of a team that conceded four goals.\nNonetheless, he was actually offered an extended trial period by Alex Ferguson but he rejected the chance and went to Copenhagen on loan instead.\n–\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 978,
  "scraped_at": "2026-02-14T02:03:26.526271",
  "_text_extracted": true
}