{
  "article_id": "175d45f55ddf",
  "url": "https://metro.co.uk/2025/03/21/ibrahima-konate-latest-liverpool-suffer-second-injury-blow-ahead-merseyside-derby-22765621/",
  "title": "Ibrahima Konate latest as Liverpool suffer second injury blow ahead of derby",
  "date": "20250321T080000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have been dealt another injury scare after Ibrahima Konate was forced off playing for France on Thursday night.\nLes Blues lost 2-0 to Croatia with Konate enduring a first-half to forget, responsible for a handball that resulted in a penalty being awarded against his side.\nWhile Mike Maignan kept the spot kick out, Konate was replaced at the break with the hosts leading 2-0 thanks to goals from Ante Budimir and Ivan Perisic.\nWhile the change was enforced, it was a disastrous first-half from the Liverpool man who was giving a dismal rating of 2/10 by Equipe before being replaced.\nDayot Upamecano was brought on for the Reds defender with France confirming on their social media accounts Konate ‘picked up a knock’ in the first period.\nWhile the extent of the knock has not been confirmed, it will spark concern for Liverpool who return to action at home to Everton in the Merseyside derby on Wednesday 2 April.\nArne Slot has already seen one of his key figures return to the club early during the international break with Ryan Gravenberch leaving the Netherlands camp this week.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe midfielder played in Sunday’s Carabao Cup final against Newcastle before travelling to link up with his Dutch teammates.\nIt later emerged however the former Bayern Munich star had been carrying a knock since the weekend.\nGravenberch returned to Liverpool for further assessment and missed last night’s 2-2 draw with Spain where club teammate Cody Gakpo was on target.\nIt also remains to be seen when Trent Alexander-Arnold will be available again.\nMore Trending\nThe England star suffered an ankle injury in the Champions League defeat to Paris Saint-Germain.\nThat blow cost him his place in Thomas Tuchel’s first England squad and in the team that lost to Newcastle.\nLiverpool are 15 points clear at the top of the Premier League with just nine games remaining.\nMORE: Riccardo Calafiori injury details revealed ahead of key Arsenal fixtures\nMORE: Premier League star ready to complete £50m transfer to Man Utd – on one condition\nMORE: Gus Poyet tells Arsenal to sign £30m Liverpool target to solve their ‘missing link’",
  "word_count": 409,
  "scraped_at": "2026-02-14T02:02:35.600202",
  "_text_extracted": true
}