{
  "article_id": "177fa8f7714b",
  "url": "https://metro.co.uk/2023/04/19/thiago-silva-criticises-chelsea-owners-after-champions-league-exit-18635146/",
  "title": "Thiago Silva criticises Chelsea owners after Champions League exit",
  "date": "20230419T030000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thiago Silva criticised Chelsea’s ownership following the club’s Champions League exit and suggests a poor transfer strategy has contributed to disharmony in the dressing room.\nChelsea were dumped out of the Champions League on Tuesday evening as Real Madrid ran out 2-0 winners at Stamford Bridge to secure their place in the semi final.\nFrank Lampard will take charge of Chelsea’s remaining seven games but the club are almost certain to miss out on Champions League football next season as they sit 17 points off fourth place in the Premier League.\nChelsea’s recruitment team are actively searching for Lampard’s permanent successor with both Julian Nagelsmann and Luis Enrique interviewed this month.\nBut Silva believes ‘indecision’ from Chelsea’s hierarchy has played a key role in the club’s downfall this season.\n‘I think the first step has been made. An incorrect step, but it has been made,’ Silva said.\n‘We can’t be blaming the managers if we don’t take responsibility. It’s a hard period for the club, with a lot of indecision.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Change of ownership, new players arriving – we had to increase the size of the changing room because it didn’t fit the size of the squad.\n‘A positive point is that there are amazing players in the squad but on the other hand there are always players that are going to be unhappy.\n‘There is always going to be someone upset because not everyone can play.\n‘The manager can only pick 11 from a squad of 30-something – that’s tough.\n‘Some can’t make the squad, we signed eight in January, we need to stop and put a strategy in place otherwise next season we could make the same mistakes.’\nSilva also dismissed suggestions that a new manager could immediately improve Chelsea’s situation.\n‘Everybody talks too much about replacing managers. I think we, as players, must also take responsibility,’ said the Brazilian.\n‘We have had three managers this season, plus a fourth with Bruno where we failed to win. We have lost today and with Lampard we have failed to win.\n‘Everybody is talking about the manager but we must look at what has been done wrong and try to change.’\nMore Trending\nSilva, who looked emotional on the pitch after the full-time whistle, also acknowledged that the defeat to Real Madrid is likely to be the last Champions League game of his illustrious career.\n‘It has been a very difficult season and a frustrating one for me personally,’ Silva said.\n‘It might have been my last match in the Champions League.\n‘I have only one year left on my contract and my career is reaching the end. It’s a very sad day.\n‘But I think we must continue working to try to win as many matches until the end of the season.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 537,
  "scraped_at": "2026-02-14T01:55:54.948856",
  "_text_extracted": true
}