{
  "article_id": "17873ea32713",
  "url": "https://www.winnipegfreepress.com/opinion/columnists/2025/04/11/all-or-nothing-for-barcelona",
  "title": "All or nothing for Barcelona – Winnipeg Free Press",
  "date": "20250412T003000Z",
  "domain": "winnipegfreepress.com",
  "source_country": "Canada",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "All or nothing for Barcelona\nAnything less than championship glory a tragedy for Spanish side\nAdvertisement\nTo continue reading, please subscribe:\nMonthly Digital Subscription\n$1 per week for 24 weeks*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $4.00 plus GST every four weeks. After 24 weeks, price increases to the regular rate of $19.95 plus GST every four weeks. Offer available to new and qualified returning subscribers only. Cancel any time.\nMonthly Digital Subscription\n$4.99/week*\n- Enjoy unlimited reading on winnipegfreepress.com\n- Read the E-Edition, our digital replica newspaper\n- Access News Break, our award-winning app\n- Play interactive puzzles\n*Billed as $19.95 plus GST every four weeks. Cancel any time.\nTo continue reading, please subscribe:\nAdd Free Press access to your Brandon Sun subscription for only an additional\n$1 for the first 4 weeks*\n*Your next subscription payment will increase by $1.00 and you will be charged $16.99 plus GST for four weeks. After four weeks, your payment will increase to $23.99 plus GST every four weeks.\nRewind to five months ago.\nRead unlimited articles for free today:\nor\nAlready have an account? Log in here »\nHey there, time traveller!\nThis article was published 11/04/2025 (308 days ago), so information in it may no longer be current.\nRewind to five months ago.\nOn a Champions League Tuesday, at home to Stade Brestois, fans of FC Barcelona whistled at unpopular midfielder Frenkie de Jong, whose substitute appearance lasted a mere six minutes.\nGiven the mood at the Montjuic stadium, you’d think the hosts would have lost to their French opponents. In fact, they won 3-0.\nFast forward to the present and de Jong is set to sign a contract extension with the Blaugrana. Yes, his performances have much improved, but it helps that his employers are no longer dead set on dumping his salary. Manager Hansi Flick is also in line for a fresh agreement — and likely a raise.\nOn Wednesday, it all seemed to come together when Barcelona demolished Borussia Dortmund 4-0 in the first leg of their Champions League quarterfinal.\nNot only did de Jong captain the team and play the full 90 minutes, but he also delivered a maestro’s performance in the centre of the park. Robert Lewandowski — the only Barca player to earn more than de Jong — scored twice; in-form Raphinha found the back of the net as well, as did teenage phenom Lamine Yamal.\nWhen asked about a prospective semi-final, Flick was apoplectic.\n“No, no, no, no, no, no, no, no!” he exclaimed in his post-match press conference. “We are definitely not qualified yet! You never know what’s going to happen because football is just a crazy sport.”\nIn those few remarks, he captured the caution, if not outright paranoia, that has become the default disposition of the club, its fan base and the partisan press since the departure of Lionel Messi in 2021.\nLess than 24 hours after the Dortmund triumph, the Sport website’s top three stories involved club president Joan Laporta, and the first mention of the last night’s victory was a piece that quoted Croatia legend Zvonimir Boban saying that Serie A leaders Inter Milan would’ve cut Barcelona to pieces.\nMeanwhile, Diario AS was gushing about PSG’s win over Aston Villa — the Parisians being managed by ex-Barcelona boss Luis Enrique.\nWhat gives?\nBack track those five months again, and a clearer picture of the insecurity surrounding the club starts to emerge. That November win over Brest took Barcelona from 10th to a still-unflattering sixth in the Champions League standings, while at the same time a woeful run in La Liga delivered just a single triumph from eight outings.\nThe iconic Xavi had been sacked as manager in the spring, and he’d not lost two games in a row the whole of the previous season. He’d also won the title the year before that — an accomplishment that guaranteed he’d get the axe if he didn’t see off the inevitable fight-back from archrivals Real Madrid.\nThere is simply no space in the Barcelona psyche that’s programmed to comprehend defeat to Madrid. It’s also unsavoury the other way around, but not nearly to the same degree. (A Spanish history lesson can best explain the reasons why, but only just.)\nThe 2022-23 title was forgotten the moment Madrid won the 2023-24 instalment. That’s the Barcelona way: self-perception is one extreme or the other.\nFrenkie de Jong is either useless or undroppable; Xavi is either a genius or a pretender; the title is either won or it’s lost.\nYou’re either a winner, or a loser. As Flick’s team has yet to win La Liga or the Champions League, it’s only the losses that matter.\nThose Messi juggernauts, which included Carles Puyol, Jordi Alba, Sergio Busquets, Andres Iniesta and, yes, Xavi, were insulated as soon as they delivered major silverware. When they delivered them again and again, and again, that insulation only thickened.\nMessi’s departure flicked that self-perception switch from up to down, and it’s been repeatedly toggled with ever since. And it’s not returning to the “up” position until another Primera Division trophy or European Cup — ideally both — have been added to the Nou Camp museum.\nPoint: Barcelona did just annihilate Dortmund. Counterpoint: After beating PSG in the first leg of last season’s Champions League quarterfinal, they lost 4-1 in the second and exited the competition.\nOne extreme, or the other.\nToday, Barcelona will face Leganes in Greater Madrid (2 p.m., TSN+). Win, and it won’t matter. That’s expected. Lose, and the paranoia will grow — that self-perception reinforced — and no one will care that they’re still in first place.\njerradpeters@gmail.com\njerradpeters.bsky.social\nOur newsroom depends on a growing audience of readers to power our journalism. If you are not a paid reader, please consider becoming a subscriber.\nOur newsroom depends on its audience of readers to power our journalism. Thank you for your support.",
  "word_count": 1006,
  "scraped_at": "2026-02-14T02:26:33.617391",
  "_text_extracted": true
}