{
  "article_id": "179e83d0d630",
  "url": "https://eplindex.com/138947/la-liga-star-admits-chelsea-dream-despite-major-interest.html",
  "title": "La Liga star admits Chelsea dream despite major interest",
  "date": "20251109T201500Z",
  "domain": "eplindex.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Report: Chelsea Dream Move On Etta Eyong’s Radar As Barcelona And Real Madrid Circle\nEtta Eyong has swiftly become one of the standout names in Spanish football this season. The 22-year-old Cameroonian striker joined Levante from Villarreal on September 1 for €3m, but his market value has soared after registering six goals and three assists in just 11 LaLiga matches. Only Kylian Mbappe has been involved in more goal contributions so far this term, a staggering statistic for a player who only recently broke into top-flight football.\nEyong’s story is one of persistence, belief and raw talent. His goal against Real Madrid in September, where he outjumped Thibaut Courtois, epitomised his combination of athleticism and composure. “I just had a feeling I was going to score against Real Madrid, so when it happened I wasn’t surprised,” said Eyong. “It was a special game for me. It’s a shame we couldn’t win the match, but I was glad my goal could give the Levante fans something to cheer.”\nEyong’s sharp rise has caught the attention of Barcelona and Real Madrid, with both Spanish giants reportedly tracking him closely. Mundo Deportivo claim he favours a move to Barcelona, though his admiration for English football keeps the Premier League in play.\nTennis Courts In Douala To Levante’s Leading Light\nEyong’s path to LaLiga has been anything but conventional. Born in Douala, Cameroon, he initially pursued tennis before switching to football after losing a youth final. His aunt, Manuella Bekombo, a forward for Cameroon Women, became his inspiration. “I owe a lot to my aunt,” said Eyong. “It was so fun to see her play, score some goals and celebrate with her friends. In football, you have a family and make lifelong friendships.”\nFinancial struggles made his dream difficult. Eyong often walked 10 kilometres home from training, but his belief never wavered. “I always believed in myself and would tell my parents, ‘Don’t worry, I’m going to make it!’” he recalled.\nAfter his grandmother, Odile Wanga, passed away in 2021, Eyong used his grief as motivation. “She always believed I would become a professional footballer,” he said. “My objective is to build a house for my father and pay the school fees for my younger brother and sister. That’s the best thing that I can do.”\nDiscovered by Cadiz in 2022, Eyong was initially a midfielder before being pushed into attack. His 14 goals for Cadiz B in 2023-24 earned him a move to Villarreal, where a decisive late header against Girona helped secure Champions League football worth £25m to the club.\nBarcelona, Real Madrid And Premier League Giants Monitoring Eyong\nLevante’s CEO José Danvila confirmed they rejected a €30m bid from CSKA Moscow, insisting Eyong will not leave in January due to FIFA regulations. “What I can tell you is that Barcelona and Real Madrid haven’t contacted Levante about Etta Eyong,” Danvila told Radio Marca. “We received one firm offer for the player, but it has already been rejected.”\nYet Europe’s elite are circling. Both Barcelona and Real Madrid are understood to be considering long-term striker additions. Real could target him in 2026 as Xabi Alonso continues to refine his 4-4-2 system. Meanwhile, Barcelona see Eyong as a possible heir to Robert Lewandowski, a player Eyong deeply admires. “Lewandowski has managed to score so many goals throughout his career,” Eyong said. “He is a great finisher and has intelligent movement. I can learn a lot from him.”\nEyong’s admiration for Chelsea legend Didier Drogba also fuels Premier League speculation. “Growing up, Chelsea was the English team I probably watched the most because of Drogba,” he revealed. “Chelsea have often signed incredible African players. As for joining Chelsea, why not? It would be a dream for me to play for Chelsea.”\nManchester United and Arsenal are also keeping tabs. “Manchester United is a very good team,” he said. “I used to love Robin Van Persie. He had everything – talent, style and confidence. And Wayne Rooney was another world-class striker.”\nEyong has studied two of the most clinical forwards in modern football, Harry Kane and Luis Suarez. “I am maybe a little like Kane in style,” he explained. “Like Kane, I have a lot of power and passion and can connect play from deeper areas.”\nHe also draws inspiration from Suarez’s intelligence and instinct. “He wasn’t just skilful, but also direct and clever with his movement. I don’t think there are many players with a bigger football brain than Suarez.”\nBeyond football, Eyong’s friendship with Brighton’s Carlos Baleba remains strong. Both grew up in Douala, and Baleba’s rise has given Eyong further motivation. “When people tell me what I’m worth, it means nothing to me,” said Eyong. “Success doesn’t come from the price others put on you, it’s about the effort you put in.”\nEyong’s confidence and humility make him one of the most intriguing young strikers in Europe. With Cameroon aiming for another AFCON title this winter, the forward has a platform to elevate his reputation even further. Whether his next chapter unfolds in Spain or England, Etta Eyong’s story has only just begun.\nOur View – EPL Index\nFrom a Chelsea supporter’s perspective, Etta Eyong feels like the kind of player the club should be prioritising. He is young, physically strong, quick and carries an aura of self-belief that has been missing from many forwards at Stamford Bridge in recent seasons. His admiration for Didier Drogba will instantly connect him with the fans, and his humility combined with a fierce work ethic mirrors the spirit Chelsea supporters appreciate.\nEyong’s story of perseverance is also inspiring. From his modest beginnings in Douala to scoring against Real Madrid, his journey reflects resilience and hunger. Those are qualities the Premier League demands. With his ability to link play, hold up the ball and finish clinically, he could adapt swiftly to English football.\nChelsea’s forward line remains a work in progress, and while the club invested heavily in the summer, Eyong’s combination of raw potential and character would fit into the project aimed at building a youthful, energetic squad. If he keeps scoring in Spain, his €3m bargain price could soon look like the best deal of the decade. For Chelsea fans dreaming of another Drogba-esque figure leading the line, Etta Eyong might just be that player.",
  "word_count": 1051,
  "scraped_at": "2026-02-14T01:49:57.609480",
  "_text_extracted": true
}