{
  "article_id": "17a269f39897",
  "url": "https://metro.co.uk/2023/07/07/jamie-carragher-digs-out-rio-ferdinand-over-man-utd-takeover-claim-19085982/",
  "title": "Jamie Carragher digs out Rio Ferdinand over Man Utd takeover claim | Football",
  "date": "20230707T131500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher has taken a swipe at Rio Ferdinand for claiming Manchester United’s takeover was imminent as the two ex-pros traded barbs off the back of Steven Gerrard’s move to Saudi Arabia.\nThe two former England team-mates have been at loggerheads in recent months, with Carragher branding the Manchester United legend a ‘clown’ over remarks he made during Inter’s Champions League semi-final first-leg win over AC Milan back in May.\nNow Ferdinand has called out the Liverpool legend over what he perceives as a hypocritical stance on Saudi Arabia’s recent big-money recruitment drive, claiming Carragher has stayed silent on Gerrard’s appointment at Al-Ettifaq despite criticising other deals.\n‘Jamie Carragher, where are you man? I heard a lot of talk, a lot of negativity, about Saudi. “Oh Bernardo Silva, I can’t believe it, it’s a disgrace, it needs investigating this league” etcetera,’ said Ferdinand on his FIVE YouTube show.\n‘Steven Gerrard’s gone, you used to carry his boots and his bag at Anfield to games. Your boy has gone over there. I’ve not heard a peep out of you, I’ve not heard how disappointed you are.\n‘I want to see you say, “I can’t believe Stevie’s gone there!” I’m actually buzzing for any of the guys that have gone out to Saudi.\n‘Because it’s Saudi, people are going mad. But all these other countries and leagues over the years have done exactly the same thing.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut Carragher feels Ferdinand has misrepresented his position, hitting back at the ex-United defender and underlining the dangers he believes the Saudi approach poses to the sport.\nResponding to the video on Twitter, he wrote: ‘Never criticised Silva, Karim Benzema, Ruben Neves or SG [Steven Gerrard], I don’t like Saudi trying to buy football like they have golf.’\nAlongside several ‘money-mouth’ emojis, Carragher continued: ‘I knew you’d be all over it Rio, like you were in Qatar! That’s why you refused to do the opening game for Match of the Day – didn’t want to criticise your paymaster!’\nFerdinand then responded: ‘Fake news. I’m a man that embraces all cultures – join the club, no need to fabricate James! I was never asked to do the opener.\nMore Trending\n‘I never saw uproar from you and others when the Premier League, Serie A, PSG, Barca, Real Madrid, Russia etc were plucking the best talent from other leagues. Keep the same energy!’\nCarragher then brought up Ferdinand’s sensational – but inaccurate – claims three weeks ago that a Qatar buyout of Manchester United was imminent, with the sale process still no further along.\n‘I wasn’t fabricating,’ he replied. ‘I was told that by a few people. Probably what happened with you over the Qataris buying Man United a few weeks ago! If you think the Saudi league buying players is the same as the other leagues we will have to disagree!’\nFerdinand hit back one more time, writing: ‘The facts are you disrespected the league / country / culture but kept [silent] when your two boys Stevie and [Robbie] Fowler went there 10 days later.’\nMORE: Rio Ferdinand reveals the ‘big issue’ holding up Manchester United sale\nMORE: Steven Gerrard’s Al-Ettifaq target Philippe Coutinho, Alvaro Morata and Jesse Lingard\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:07:08.869302",
  "_text_extracted": true
}