{
  "article_id": "17a38a6ae4eb",
  "url": "https://metro.co.uk/2025/12/29/chelsea-interested-re-signing-champions-league-winner-free-transfer-25897799/",
  "title": "Chelsea  interested  in re - signing Champions League winner on free transfer",
  "date": "20251229T104500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are exploring the possibility of re-signing Antonio Rudiger on a free transfer from Real Madrid, according to reports in Spain.\nRudiger ended his five-year stay with Chelsea to complete a move to the Bernabeu back in 2022 and the 32-year-old defender has proven to be a great piece of business for the La Liga giants.\nIn that time, Rudiger has made 163 appearances in all competitions for Madrid and helped Los Blancos win eight pieces of silverware, including the 2023/24 Champions League trophy.\nBut Rudiger is out of contract in the Spanish capital next summer and there is some uncertainty surrounding the German’s future, with a host of top clubs keeping close tabs on developments.\nSpanish newspaper AS report that Rudiger has ‘several options’ on the table should he fail to reach an agreement to extend his stay with Madrid beyond the end of the current season.\nWidespread reports in the Turkish media have claimed Galatasaray are eyeing a January transfer move for Rudiger thought the Super Lig champions have remained silent on the rumours.\nGalatasaray are also well stocked at centre-back, though, with Davinson Sanchez, Abdulkerim Bardakci and Wilfried Singo all well liked by head coach Okan Buruk.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAnd while Rudiger is ‘quite open to listening to potential offers’ from Galatasaray, the Turkish giants would have to see have strong competition to land the vastly experienced Germany international.\nThe report claims Paris Saint-Germain are among Rudiger’s many admirers as Luis Enrique believes centre-half would bring valuable experience and leadership to the dressing room.\nThe Saudi Pro League is mooted as another possible option for Rudiger, with Al Nassr and Al Hilal closely ‘monitoring’ the situation.\nChelsea are also said to be ‘interested’ in the idea of bringing Rudiger back for a second spell in west London.\nRudiger established himself as a fan favourite by the end of his time at Stamford Bridge, celebrated for his tenacity, bullishness and never-say-die attitude on the pitch.\nMore Trending\nDuring his time with the Blues, Rudiger lifted a total of five trophies, including the Champions League, the Europa League and the FA Cup.\nRudiger was twice named in the Champions League Team of the Season during his time with Chelsea. He was also the club’s sole representative in the 2021/22 Premier League Team of the Year.\n‘To be honest, in football you never know. I am very, very happy where I am now at Madrid,’ Rudiger told the German media when asked for an update on his future earlier this year.\n‘I am not thinking about leaving anytime soon, that’s all. But in football you just never know.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd cult hero Phil Jones names Chelsea legend as his ‘toughest opponent’\nMORE: ‘Signing of the season’ – Man City urged to make surprise transfer bid to sign former Chelsea star\nMORE: ‘Best in the league’ – Liverpool urged to make stunning transfer bid for Arsenal star",
  "word_count": 560,
  "scraped_at": "2026-02-14T01:59:31.508825",
  "_text_extracted": true
}