{
  "article_id": "17e5f84ed14a",
  "url": "https://theathletic.com/4299755/2023/03/13/ornstein-psg-neymar-conte-kane/",
  "title": "Ornstein : Neymar wants to finish career at PSG , Conte Spurs talks , Kane future",
  "date": "20230313T081500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain saw their aim of winning the Champions League end in disappointment for another season last week, losing 3-0 on aggregate to Bayern Munich in the first knockout round.\nThe aftermath has been familiar and included fresh scrutiny over the futures of their star attackers.\nKylian Mbappe is nearing the final year of his contract, Lionel Messi’s deal expires this summer and speculation also surrounds Neymar, who will miss the rest of the season following ankle surgery.\nClarity on Mbappe and Messi should arrive soon (the former must tell the club if he plans to sign a two-year extension and the latter will either renew or walk away as a free agent); Neymar’s situation is less pressing, given the forward is committed to PSG until 2027.\nAdvertisement\nNeymar is often linked with a return to Barcelona and moves elsewhere, but he has stayed at PSG and that looks set to remain the case — because the 31-year-old wants to finish his career there.\nSince joining from Barcelona in 2017 for a world-record £200million ($240m), Neymar has helped the Ligue 1 side reach their first Champions League final (in 2020) and has lifted 13 domestic trophies.\nDuring his spell at PSG, the club’s value, according to Forbes, has risen from $841million to $3.2billion and he has cemented his status among the sport’s most iconic figures.\nThe fact he was subject to the biggest transfer in football history means that it would take an enormous investment for any suitor to prise the Brazil international away from the French capital.\nBut irrespective of the finances involved, Neymar’s wish is to finish his playing days with PSG and help them achieve further success, particularly in the one tournament they are yet to conquer.\nNeymar, who has scored 118 goals in 173 appearances across all competitions for PSG, will be 34 when the 2026 World Cup takes place in Canada, Mexico and the United States, and 35 when his existing terms at the Parc des Princes end the following June.\nWhether the Santos academy graduate retires then or prolongs his stay in Paris beyond a decade will not be known until much later. As things stand, however, he does not plan to represent another team.\nNo talks over Conte’s future yet — and Spurs focussed on keeping Kane\nTottenham Hotspur recovered from a damaging run of results with victory over Nottingham Forest on Saturday, which was also timely for Antonio Conte as uncertainty mounts regarding his future.\nThe Italian’s contract as head coach expires this summer and even though it includes an option to extend by an additional 12 months, there is a good chance that he leaves after a difficult campaign.\nIt has led to increasing speculation about who Tottenham might recruit as Conte’s replacement — if he goes — and The Athletic reported last week that a shortlist of candidates has been compiled.\nAdvertisement\nHowever, no potential successors have been talked to so far and the intention is for that to remain the case until the club reach a decision in conjunction with Conte on whether or not he will depart.\nDespite both parties knowing the 53-year-old’s deal is coming to an end, various on and off-field factors mean the situation has yet to be brought to a head internally. As well as a packed fixture schedule, this season has been heavily disrupted for Conte by bereavements and illness.\nBut from early April it is expected that decisive conversations will be held between Tottenham and Conte to determine his position.\nShould it be resolved that he is to leave, discussions with prospective successors can begin and Spurs will hope to run a smoother process than that which eventually led them to hire Conte in 2021.\nMeanwhile, Tottenham’s talismanic striker Harry Kane is nearing the final 12 months of his terms and the hierarchy in north London are determined to secure an agreement to keep him for longer.\nThe 29-year-old is among the main options under consideration at Manchester United but as things stand Tottenham are not even contemplating a sale. Their total focus is on renewing the England captain’s deal and they are prepared to continue those efforts into 2023-24 if necessary.\nSpurs have entered initial dialogue with Kane, although at present the matter is not advanced.\nNike bucks trend for kangaroo leather\nNike will stop using kangaroo leather to make its football boots.\nKangaroo leather — or ‘k-leather’, as it is known — has traditionally been used in high-end football boots and soccer cleats because it is thought to be lighter, more malleable and more durable than cowhide.\nNike’s Tiempo Legend Elite and Tiempo Premier boots, due to be launched this summer, will not use kangaroo leather, and Nike will stop making any products featuring the material altogether in 2023.\nAdvertisement\nPuma announced last week that Puma King boots will start having ‘K-Better’ uppers, which is animal-free and contains at least 20 per cent recycled materials. The German manufacturer has also committed to stop using kangaroo leather by the end of 2023.\nA Nike spokesperson told The Athletic: “Nike divested of its only kangaroo leather supplier in 2021 and will stop making any product with kangaroo leather in 2023.”\nGrimaldo attracting interest from Premier League and beyond\nBenfica reached the last eight of the Champions League thanks to a 7-1 aggregate win over Club Bruges, with left-back Alejandro Grimaldo playing 180 minutes over the two legs for the Portuguese side.\nThe 27-year-old will be a free agent at the end of the season after deciding not to renew his contract with Benfica, reports Mario Cortegana.\nLigue 1 side Nice have made an appealing financial offer but a move to the Premier League is attractive and there have been talks with Fulham and Nottingham Forest.\nIn Spain, Real Sociedad and Valencia have sounded out a move. Grimaldo has also been linked with Borussia Dortmund in Germany and Bayer Leverkusen manager Xabi Alonso has shown interest too.\nGrimaldo has been included in Spain manager Luis de la Fuente’s provisional squad for this month’s Euro 2024 qualifiers against Norway and Scotland.\nForest likely to put back work on Peter Taylor Stand until 2024\nNottingham Forest return to the City Ground on Friday to face Newcastle United on the back of nine matches unbeaten in the Premier League at home.\nThe run has been credited, in part, to the atmosphere generated in the stands, with every match sold out in advance.\nAt the same time, the club have been weighing up the pros and cons of the best time to knock down their Peter Taylor Stand and put up a replacement that would increase the 30,000 capacity to 35,000 and bring the stadium more in line with demand.\nAdvertisement\nPlanning permission was granted last July but the downside is that the building work would mean Forest operating, in effect, with only three stands until everything was completed.\nThat work was initially due to start this summer but may now be put back until 2024 owing to the complexities of the planning permission and various other considerations. In the meantime, Forest have recently renovated the dressing rooms, which are situated in the relevant stand, and also the adjoining tunnel area.\nBirmingham City close to new temporary training ground\nBirmingham City are working on a temporary training ground relocation deal after a fire ripped through their base at Wast Hills, reports Gregg Evans.\nThe Championship club want to rent a site — the Elite Performance and Innovation Centre used by rugby union club Wasps before they went into administration — in nearby Henley-in-Arden until the end of the season.\nDiscussions are at an advanced stage and Birmingham hope a rental agreement can be finalised this week.\nBefore Saturday’s 2-0 win over Rotherham United, John Eustace’s side were forced to use changing rooms and the canteen at nearby Hayes Sports Group.\nAs some of the players’ boots and kit were lost in the fire, staff from the kit department have had to visit a launderette each day to get clothing prepared. Players looking for extra gym work have also used public facilities.\nAn electrical fault caused the fire, which started behind the kitchen, and repair work is required.\nWhile the practice pitches can still be used, some indoor parts of the building are unusable owing to smoke and water damage.\nInfantino keeps feet on the ground\nFIFA president Gianni Infantino sampled the atmosphere at Millwall’s ground, The Den, on March 4 but his weekend could have taken a different turn, writes Peter Rutzler.\nAdvertisement\nInfantino was in London for the annual general meeting of the International Football Association Board (IFAB), the body that oversees the laws of the game.\nThe meeting was held at the five-star Marriott County Hall Hotel, which sits on the opposite bank of the River Thames to the Houses of Parliament.\nAfterwards, he was given the option of going up the London Eye, the 135-metre-tall (443ft) Ferris wheel offering views over the city, but he opted for Norwich City’s 3-2 win over Millwall — the closest match available.\nFIFA’s director of media relations Bryan Swanson made last-minute contact to arrange the visit, with Millwall hastily required to accommodate nine delegates, who all left after 45 minutes to attend another engagement — missing three second-half goals.\n(Top photos: Getty Images; Design: Sam Richardson)",
  "word_count": 1558,
  "scraped_at": "2026-02-14T02:16:40.082727",
  "_text_extracted": true
}