{
  "article_id": "17e6cdf895d9",
  "url": "https://www.the42.ie/ian-graham-liverpool-6491974-Sep2024/",
  "title": "Arguments , compromise and the stress of chasing City : how the data revolution changed Liverpool",
  "date": "20240921T083000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "IAN GRAHAM FOUND himself in a room at Liverpool’s old Melwood training ground, looking across a table at the silent, impassive face of John Henry.\nOthers in the room chattered around him, until Henry unfolded his arms, leaned forward, and slowly put his arms on the table in front of him.\n“Ian, I have an advantage over you”, he said. “No, wait, I have a tremendous advantage over you. I know you’re a Liverpool fan and I know you’re going to come and work for us.”\nThis was 2012. Graham started working for Liverpool later that year, leaving Tottenham where he had worked as head of football research.\nHenry, who took over as the owner of Liverpool in 2010, had previously purchased the Boston Red Sox, whom he revived under the principles of Moneyball.\nGraham’s hire was the final act in finding another Billy Beane. Henry had already hired Damien Comolli as as sporting director, who in turn head-hunted a bright mind with whom he worked with at Tottenham, Michael Edwards.\nEdwards then recommended Graham, whose achievements included convincing Edwards of the virtue of using data to make major decisions in football.\nA measure of Grahan’s success at Liverpool and in the wider sport is evident in the title of his new book, How to Win the Premier League: The inside story of football’s data revolution.\n“Back in the early days at Liverpool, data [analysts] were seen as not knowing the game; data doesn’t add anything and makes ridiculous suggestions,” Graham tells The 42. “There was lots of sympathy for managers who have to work with data people.\n“Now it’s completely turned around in the last few years to say that data departments are full of geniuses, that they do this magic stuff and we can’t believe the complexity of it. That’s all wrong as well. There are smart people working at clubs, but for the most part they are just smart people, not geniuses, and it’s hard work.\n“It’s not mystical either. Any data analyst worth their salt should be able to explain in football terms without using maths or jargon how their analysis works and convince a football expert that it’s giving sensible opinions and results about players.”\nFenway Sports were happy to spend money at Liverpool, insists Graham, but they demanded evidence from the club as to why that money should be spent. Graham’s groundbreaking decision to build the Premier League’s first in-house analytics department played a huge role in justifying those outlays, and also of finding Liverpool an edge in the transfer market.\nIn his book, Graham describes the transfer market as being governed by “insanity” and cites an instance from his time at Spurs to support that view. In July 2008, Liverpool paid Spurs £19 million for Robbie Keane, and then sold Keane back to Spurs for £12 million six months later.\nTo find that edge in the market, Graham needed to find a way of identifying a good player, and so he developed a system to rate players’ qualities, which then allowed them to be ranked among hundreds of others in the same position.\nTo build his model, he asked himself a simple question: does this player improve his team’s chances of scoring a goal?\nOpta had recently published event data, which identified every action performed by a specific player, and where on the pitch it occurred. The volume of this information allowed Graham to look at thousands of previous examples to estimate a percentage likelihood of scoring a goal based on where the ball was on the pitch.\nFor example, he estimated that for every 1,000 times a team has possession just inside their own half, four goals were scored, meaning there is a goal probability of 0.4% when the ball is in that position.\nWhen the ball is on the edge of the opposition box he estimated that 1,000 instances would yield 17 goals – a goal probability of 1.7%.\nEstablishing these estimates then allowed him to assess any player’s impact. If a player passes the ball from just inside his own half to the edge of the opposition box, the goalscoring probability has gone from 0.4% to 1.7%, and so the player can be said to have increased his side’s chances of scoring by 1.3%. If the player attempts the pass and gives the ball away, he has decreased his side’s chances of scoring by 0.4%.\nGraham called this model Possession Value.\nThese were estimates and Graham consistently updated and refined them when better, more precise data was developed and became available. He also made other necessary adjustments, including more precise profiling of players – strikers, for instance, were separated as traditional target men (Andy Carroll, Christian Benteke) and hybrid players (Romelu Lukaku, Zlatan Ibrahimovic) – and there was also a tariff based on the quality of the league.\nGraham built an internal website on which these rankings were kept and updated weekly, and it was from these rankings that Michael Edwards drew up a shortlist of potential targets to be scouted. The brilliance of Graham’s work was to scale the quality and rigour of a scout’s eye test beyond what any traditional scouting department could cover.\nGraham quotes Dean Oliver, author of Basketball on Paper, whom he describes as one of his sports data heroes.\n“Your eyes see the game better than the numbers, but the numbers see all the game.”\nOf Liverpool’s starting XI from their successful 2019 Champions League final, all but two were signed using Graham’s Possession Value model. The exceptions were academy product Trent Alexander-Arnold and captain Jordan Henderson, signed before Graham came to the club.\nGraham says the key to its success at Liverpool was its implementation – the club insisted on the importance of using his data. This came from Henry down. Aside from Brentford and Brighton, whom Graham lauds, very few rival clubs were so insistent on using the data at their hands in every key decision.\nThere was another vital element to the success of Liverpool’s use of data: they never signed a player solely because of data. Graham repeats Edwards’ that if everyone at the club – the manager, the sporting director, the scouts and the data department – agrees on a player, that player will be a success. The club’s owners insisted that every signing be subject to the opinions of all sides of the house before it would proceed.\nOf course, not everyone always agreed. Edwards was so delighted with the success of Roberto Firmino that he named his dog after him, but it was only his doggedness that got Firmino to the club in the first place.\nGraham initially compared Firmino to other strikers in Europe, where he didn’t score highly, and was ranked well below Daniel Sturridge, who was already at Liverpool. Edwards, though, was insistent that Firmino was an undervalued gem, and told Graham to consider him as a No 10 instead.\nGraham re-adjusted his ranking and found that Firmino was one of the best-ranked No 10s in Europe. Edwards did the deal, but it was only until Jurgen Klopp was appointed that Firmino’s potential was unlocked. Klopp shifted from his traditional 4-2-3-1 to a 4-3-3 in which Firmino was used as a false nine, and with Mane and Salah outside of him, Liverpool went stratospheric.\nThat is also an insight into the shortest answer to the question posed in the title to Graham’s book.\nHow to win the Premier League? Just hire Jurgen Klopp.\nLiverpool’s “transfer committee” was derided by the media during Brendan Rodgers’ time as manager, but Graham explains that nothing actually changed when Klopp came in beyond the fact that he was able to deliver the club their first-choice targets. With Rodgers, Liverpool were left shopping further down their list.\nRodgers was never comfortable with the architecture around him at the club and the writing was on the wall from the moment of his unveiling interview, at which he said he wouldn’t work with a sporting director.\nLiverpool therefore lost out on targets while arguing over them. Graham says his biggest transfer regret at Liverpool was missing out on Diego Costa, lost amid the club’s prevaricating over Christian Benteke, whom Rodgers was desperate to sign and Graham was at pains to point out did not fit into Rodgers’ own system.\nKlopp, by contrast, was an ideal fit. He was used to it having worked in Germany and he was occasionally more open to compromise, most successfully in agreeing to sign Edwards’ favourite Mohamed Salah over his favoured target, Julian Brandt, in 2017.\nThen there was Klopp’s own, intangible factor. Graham says Klopp’s personality helped to get some signings over the line. Sadio Mane was also courted by Manchester United, who were offering a higher salary and Champions League football, but Mane instead picked Liverpool as he wanted to work with Klopp.\nIt’s a fascinating element in all of this: Liverpool’s data department could identify Klopp as the right candidate, but not even Graham could quantify his personality.\n“He scored 9.3 on our charisma factor”, smiles Graham. “Players need to respect the manager, but the manager has to have that connection with them so that when they’re dropped or when he asks them to change position, he takes them along on the journey with him.\n“That sort of stuff, I’m no good at that. I don’t really understand how it works, but I can see it when it does work.”\nLiverpool’s success lay in the fact they had a series of brilliant, hard-working people in a room together, filtering out their egos and pushing for what they believed to be the right decision for the club in a culture demanded by the club’s owners.\n“I’ve had shouting matches with Michael and with the scouting department,” he says. “I’ve been wrong on many occasions, they’ve been wrong on many occasions. They were kind of positive arguments because we always wanted to make the right decision. Michael certainly had those arguments with Jurgen as well.\n“Sometimes my preferred player who looked best in the data didn’t arrive because of character issues or the manager wouldn’t want to play him in the position where he’s strongest. All good reasons.\n“But I would always be arguing for the player because he’s a really good player for a sensible price. ‘The manager should fucking compromise and play him in his best position!’\n“It’s the same thing with Jurgen, managers have always got their preferred players. But he was willing to compromise on some of those signings.\n“Similarly with Michael, he’s a football expert, he spends a lot of time watching players on video. Sometimes he couldn’t believe when he’d log onto the system and the player was just above average for the Premier League, and won’t make a difference to Liverpool. ‘Like, how the fuck can you be saying this about this player? I’ve watched him and he’s gonna be a star!’\n“Sometimes he was right and sometimes he was wrong. But everyone was willing to give and take.”\nEventually, the arguments all became too wearing on all involved. Edwards left in 2022, though has since returned in an elevated role. Graham left a year later, and Klopp resigned this summer.\n“I wouldn’t say that Jurgen became too abrasive or more abrasive but it’s hard to work in that environment, where, with Manchester City as the rivals, you have to be perfect about every decision,” says Graham.\n“Those arguments were one of our strengths but it’s got a sell by date on it.\n“Michael left in 2022 and he was like, ‘I literally can’t go through another transfer window.’ Positive arguments, but arguing with the manager about who you should sign, arguing with the owners about what the budget’s going to be. Then you have to argue with players and agents and so on.\n“One year later, I was thinking, ‘I can’t go through another transfer window.’ By the time Jurgen left, he didn’t look like the same man as when he arrived. You could see the bags under his eyes.”\nManchester City exerted much of that intensity that ultimately became too much to bear.\n“They’re the best team the world’s ever seen,” says Graham of City. “And we’ve seen in the past at Manchester City and at other clubs as well, just spending money doesn’t necessarily get you the best team. It might get you the best team this season, but not the best team in the world for six seasons in a row, or longer. Pep is the best coach on the planet. He innovates his style every season. On the pitch, they are incredible to watch.”\nGraham demurs somewhat when I ask him to articulate Liverpool’s internal view of City.\n“Everyone wants to see a Premier League that’s fair and competitive,” he says. “It’s up to the Premier League to say whether Manchester City are within the rules or not. I’m not going to say anything. You can guess what my view might be, but I’m going to keep my counsel on that one.”\nGraham now runs his own sports consultancy business, Ludonautics. He remains excited about the possibilities of applying data to football and his message is spreading: a friend at the London School of Economics has published a paper saying data analysis is more useful in football than the stock market, as it’s less unpredictable.\nGraham says football is the most difficult sport to analyse, given its fluidity, speed and the fact it’s so low-scoring. Basketball is fast-moving but has so many scoring events its easier to analyse, he says, while baseball and American football are so stop-start that everything can be measured. “The ceiling of where data can get to in football is lower than in other sports,” he says, “but where we currently are, the floor is much lower in football than in other sports.”\nThe quality of data analysis hinges on the quality of data available, and the latter is improving all the time. The danger now is analysts will be buried beneath it. Uefa, for instance, now offers ‘pose data’, which captures a player’s location on the pitch every 40 milliseconds, and so has detail on the location of their feet, ankles, hips, shoulders, eyes, and ears.\nThis can be used to tell you what direction a player is looking when they make a decision on the pitch – there is gold-worthy information buried within that avalanche of data, but it will take a great prospector to mine it.\nAI is a whole new frontier with an enormous range of potential applications. One means in which Liverpool used it was to examine attacking and defensive set-ups at corners, so the AI model could then suggest the positions and runs players should make to increase chances of scoring.\nLiverpool would never have got their edge without data analysis, but they would have wasted it had they relied on the data alone.\nOne way to win the Premier League is to make sure some of the best people in their field get in a room together, and make them argue and compromise until they come to what everyone agrees is the best decision.\nFor Graham, his days of creative tension at Liverpool are in the past.\n“My quote about it is the Beatles were only together for 10 years,” says Graham. “They had loads of arguments, but they were a pretty good band.”\nIan Graham on…\nThe Irish player who scored highest on Liverpool’s models\n“We really liked Nathan Collins, but we knew he didn’t fit our style. He’s super effective in a low-block team but the set of things he’d be asked to do at Liverpool as a centre back is different to what he’s asked to do at Wolves and Brentford. But if we played more defensively, he’d definitely be on our list.”\nCaoimhín Kelleher\n“It’s quite unusual to have a young goalkeeper who is even just OK at shot-stopping and it’s rare for a 21 or 22 year old goalkeeper to be starting every game unless they drop down the divisions.\n“So being able to play Europa League and Cup games is a decent amount of experience for that young keeper and a very acceptable level of performance for a young goalkeeper as well.\n“It gets more difficult when the player turns 24 and is like ‘I’m a good goalkeeper. I need to be starting.’ If you want to play for your national team as well, you’d need to be starting. That’s a problem I don’t have to deal with that: Liverpool can deal with that on their own.”\nHis biggest transfer near-miss at Tottenham\n“The one at Spurs was [Mesut] Ozil. He could have been a Spurs player.”\nHis best pound-for-pound signing at Liverpool\n“Well, divide by zero and it’s Joel Matip, who was a free transfer. Then [Andy] Robertson. He is world class, and not that no one realised it, but none of our big six competitors were at all interested in Robertson.”\nHow to win the Premier League: The inside story of football’s data revolution by Ian Graham is published by Century and is available now.",
  "word_count": 2861,
  "scraped_at": "2026-02-14T02:05:23.742586",
  "_text_extracted": true
}