{
  "article_id": "17ed414612d9",
  "url": "https://www.westmeathexaminer.ie/2024/09/19/kevin-de-bruyne-a-doubt-to-face-arsenal-after-frustrating-night-for-man-city/",
  "title": "Kevin De Bruyne a doubt to face Arsenal after frustrating night for Man City",
  "date": "20240919T090000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kevin De Bruyne a doubt to face Arsenal after frustrating night for Man City\nBy Andy Hampson, PA\nKevin De Bruyne is doubtful for Manchester City’s upcoming clash with Arsenal after suffering an injury during their Champions League stalemate with Inter Milan.\nThe Belgium playmaker was withdrawn at the interval after struggling in the latter stages of the first half of Wednesday’s goalless draw with the Serie A winners at the Etihad Stadium.\nHe will now be assessed with the situation a major concern for the champions ahead of Sunday’s visit of their closest challengers in the Premier League over the past two seasons.\nManager Pep Guardiola said: “I don’t know (what the problem is). I haven’t spoken with the doctors yet. We’ll assess tonight, maybe tomorrow. I will have more info tomorrow.”\nCity failed to spark as a positive Inter, who created some of the best chances during the game, claimed a creditable draw in their first match of the competition’s new league phase.\nGuardiola, however, felt there was plenty to be pleased about against tough opposition.\nThe Spaniard said: “We faced a really, really difficult team – the champions from Italy. A class team in all departments.\n“I’m really, really satisfied for the game we played. I liked everything about my team today, everything.\n“We would have preferred to win – there are still seven games. We’ll see what happens.”\nGuardiola’s long-term future is uncertain with his contract due to expire next summer.\nThat led to one Italian journalist at his post-match press conference asking if he would ever consider coaching in Serie A but he reiterated his love of City.\nGuardiola said: “I love Italy but I really enjoy being here. I love English football. It is fantastic. I really enjoy it.\n“They leave you alone to get on with your job. That doesn’t happen anywhere else. This is a great club. I really feel good here. I am pleased to be here.”\nTwo of the best chances of the night fell to Inter’s former Manchester United pair Matteo Darmian and Henrikh Mkhitaryan but neither worked City goalkeeper Ederson.\nDarmian’s failure was particularly perplexing, with the defender sent clear on goal but bizarrely opting to backheel – to nobody – rather than shoot, while Mkhitaryan blazed over.\nInter boss Simone Inzaghi showed his frustration in animated fashion on the touchline.\nHe said: “I asked (Darmian), ‘What were you playing at?’ He said he could hear (Nicolo) Barella behind him but he backheeled to a defender.\n“I was more upset about Mkhitaryan’s miss. I really thought he would score. I fell into a state of despair.”\nDespite the spurned opportunities, Inzaghi felt the visitors could be proud of their display.\n“I said, ‘Well done guys’ – they put in a giant performance,” he said. “I asked them to play exactly as they did.\n“We all know what Manchester City are capable of. We knew we had to pull out all the stops and play a great game and we did it.”\nThere was further frustration for Inzaghi, who now has a Milan derby to prepare for at the weekend, with his team unable to get a flight straight home.\n“We’ll be flying home tomorrow,” he said. “Apparently Manchester Airport closes early so we’ll be staying in a hotel tonight.”",
  "word_count": 551,
  "scraped_at": "2026-02-14T02:25:58.985121",
  "_text_extracted": true
}