{
  "article_id": "18270d265fe6",
  "url": "https://www.wandsworthguardian.co.uk/news/national/uk-today/25315187.highest-paid-bbc-stars-full-salaries-revealed/",
  "title": "The highest paid BBC stars as the full salaries revealed",
  "date": "20250715T141500Z",
  "domain": "wandsworthguardian.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The BBC has released the full list of the highest on-air salaries for the 2024/25 period.\nThe salaries are published as part of the BBC's annual report and do not include people who are paid through independent production companies or the BBC’s commercial arm BBC Studios.\nThe highest earner for the period was former Match Of The Day presenter Gary Lineker, marking his final time on the list.\nThe 64-year-old, who left the BBC early at the end of the last Premier League season in May, was reported to have earned between £1,350,000 and £1,354,999.\nRadio presenter Zoe Ball was the second highest-paid, earning between £515,000 and £519,999, for her work on the Radio 2 Breakfast Show, which she left on December 20 last year.\nBall has since returned to a new Saturday afternoon show on the station, which she began hosting in May 2025.\nFull list of the highest-paid BBC stars\nBelow you can see the full list of all the highest-paid BBC stars and their salaries.\nThe equivalent salary band for 2023/24 is shown in brackets, with a description of the year-on-year change.\nMatch Of The Day pundit Alan Shearer was the third-highest earner with a salary of between £440,000 and £444,999.\nThe former Newcastle United striker will continue to analyse football on the BBC in the new season with Match Of The Day’s incoming presenters Kelly Cates, Mark Chapman and Gabby Logan.\nRecommended Reading\n-\nEastEnders legend lands role on foreign soap 20 years after 'brutal' BBC exit\n-\nChild star from Outnumbered 'secretly' marries long-term girlfriend\n-\nMatch Of The Day fans say it 'won't be the same' without Gary Lineker amid exit\nHis pay also covered work on the BBC’s coverage of European football competitions, such as the UEFA Champions League.\nBBC Radio 1 Breakfast Show presenter Greg James came fourth on the list, earning between £425,000 and £429,999, for work which also included his Radio 4 show Rewinder, while Fiona Bruce and Nick Robinson were the joint fifth-highest earners, with both earning between £410,000 and £414,999.\nBruce’s pay covered her work on Question Time and other presenting work on BBC One and coverage of the UK general election, while Robinson’s included his presenting work, Political Thinking and Today podcasts, and his work covering the UK general election.",
  "word_count": 383,
  "scraped_at": "2026-02-14T01:49:44.677443",
  "_text_extracted": true
}