{
  "article_id": "182ba8fbbfc2",
  "url": "https://www.caughtoffside.com/2026/02/13/aston-villa-newcastle-want-oscar-mingueza/",
  "title": "Aston Villa and Newcastle keen on Oscar Mingueza",
  "date": "20260213T174500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Celta Vigo defender Oscar Mingueza has been linked with a move away from the Spanish club, and multiple Premier League clubs are keeping tabs on his situation.\nAccording to Fichajes, Aston Villa and Newcastle United are interested in signing the defender, and it will be interesting to see whether they come forward with an offer to complete the deal.\nNewcastle need a quality long-term alternative to Kiran Trippier, who is expected to leave the club at the end of the season. Mingueza has proven himself in Spanish football and could be the ideal acquisition. He could compete with Tino Livramento for the starting spot. The competition for places will help both players improve and improve Newcastle as a team.\nOn the other hand, Aston Villa are looking to add more depth at right back as well. The 26-year-old Spanish international has the quality to thrive in English football, and he could be a very useful acquisition for both clubs. It remains to be seen how the situation unfolds.\nThe defender will be out of contract at the end of the season, and signing a player of his quality on a free transfer could prove to be a huge bargain. The opportunity to move to the Premier League will be quite exciting for him. The report claims that the player is ready to take on the physical demands of English football and prefers to move to the Premier League over some other European leagues.\nBoth Newcastle and Aston Villa could be exciting destinations for the defender, and it remains to be seen where he ends up. Aston Villa are currently pushing for Champions League qualification, and that could give them an edge in the transfer race.",
  "word_count": 285,
  "scraped_at": "2026-02-14T01:59:36.824108",
  "_text_extracted": true
}