{
  "article_id": "185a8e3c5eac",
  "url": "https://uk.style.yahoo.com/erling-haaland-injury-latest-pep-124708056.html",
  "title": "Erling Haaland injury latest : Pep Guardiola confirms Man City talisman WILL return at Southampton",
  "date": "20230408T053000Z",
  "domain": "uk.style.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erling Haaland injury latest: Pep Guardiola confirms Man City talisman WILL return at Southampton\nErling Haaland will return for Manchester City’s Premier League trip to Southampton, manager Pep Guardiola has confirmed.\nThe Norwegian goal machine suffered a groin injury after scoring his second hat-trick in a matter of days in the 6-0 demolition of Vincent Kompany’s Championship leaders Burnley in the FA Cup quarter-finals before the international break, and was subsequently forced to withdraw from his country’s opening pair of Euro 2024 qualifiers against Spain and Georgia.\nHaaland then missed last weekend’s top-flight meeting with Liverpool, though City did not skip a beat without their record-breaking talisman as they ran out comfortable 4-1 winners without him.\nHowever, the 22-year-old - who has notched an incredible 42 goals in just 37 appearances across all competitions in his first season in English football - returned to training on Wednesday and has experienced no setbacks since, meaning he will be in the team to face Southampton at St Mary’s tomorrow as City attempt to trim Arsenal’s title lead back down to five points before the Gunners head to Anfield on Sunday.\n“He trained the last two days, really good,” Guardiola said of Haaland at his pre-match press conference on Friday. “He will be ready.”\nAfter their visit to the south coast, City have the small matter of the first leg of their heavyweight Champions League quarter-final tie against Thomas Tuchel’s Bayern Munich at the Etihad Stadium on Tuesday night.\nHowever, Guardiola denied before the reunion with his former employers that Haaland needed more minutes under his belt to ensure that he is fully up to speed for such a high-profile fixture.\n“Bayern Munich is the last thought,” he said. “It’s Southampton. The Premier League is every day, every week. It depends on that.”\nGuardiola was also adamant that playing 24 hours before leaders Arsenal this weekend did not offer them any sort of advantage in the title race.\n“There is no advantage,” he said. “When we played a title race against Liverpool, sometimes we played before, sometimes late. We have to win our games.”",
  "word_count": 351,
  "scraped_at": "2026-02-14T02:24:37.524341",
  "_text_extracted": true
}