{
  "article_id": "186394c8f519",
  "url": "https://news.yahoo.com/epl-talk-what-is-the-point-of-liverpool-now-103051866.html",
  "title": "EPL Talk : What is the point of Liverpool now ? ",
  "date": "20230316T103000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EPL TALK: What is the point of Liverpool now?\nJurgen Klopp has the unenviable task of building a new dominant team, and he has many tough choices to make\nTHE awkward truth is, Liverpool have never been in this position before, not once, in their magnificently long and illustrious history.\nKenny Dalglish’s final days in the dugout might come close, as the haunted manager understandably struggled with the horrors of Hillsborough, but the circumstances were different. He came from the Boot Room. He was one of many.\nBut Jurgen Klopp stands alone at the crossroads, with little idea of where to turn next.\nThe Reds are expecting him to follow Sir Alex Ferguson, where no other manager in English football has gone before, and start again. Throw the dice and rebuild the monopoly. It’s never been done beyond the crumbling stands of Old Trafford.\nLiverpool were exceedingly successful at passing the baton in the Boot Room, from Bill Shankly to Bob Paisley, and then Joe Fagan to Dalglish, an unrivalled relay team. But Klopp has no one limbering up ahead of him. Steven Gerrard was trotting towards the starting blocks, but fell over at Aston Villa. Klopp has no successor and no discernible plan for change either.\nHe needs to be Ferguson, but looks a little like late-era Arsene Wenger. Against Real Madrid, there were echoes of old Arsenal, fading in the flickering shadows of a glorious past, unable to reboot or comprehend the upgrade required. The Reds are not even sure what the missing parts are and who should fill them. What are they striving to be? Who is going to take them there? What is the point of Liverpool now?\nThis isn’t an angsty call for Klopp’s head, just a downbeat reflection of the passage of time. Players age. Teams wither. Tactics move on. And the magnitude of Klopp’s challenge may still not be fully appreciated, even now.\nHe’s expected to “do a Ferguson”, even though no other manager has “done a Ferguson”, not Matt Busby, not Brian Clough, not anyone from Liverpool’s fabled Boot Room, not anyone in the modern era; i.e. build successive dynasties under a single manager. Wenger came the closest in the 1990s and then the 2000s, but never lifted the Champions League. What’s more, Klopp must “do a Ferguson” without access to the Manchester United manager’s superior resources at the time.\nThe playing style has also faltered. Like Bob Dylan switching from acoustic to electric, the Reds are transitioning from their characteristic genre of heavy metal into something tentative and uncertain. Had Nirvana continued after Kurt Cobain as a plinking, plonking lounge music duo, they might have looked like Liverpool in Madrid.\nThey lack clarity concerning their positions within the group, their responsibilities and direction. Darwin Nunez was the nominal target man, but was substituted again. Cody Gakpo started, but was shunted towards the right and further away from the forward line that finally clicked for the first time against Manchester United. The Reds went for broke with four forwards in the starting line-up, but Real managed twice as many shots on goal. Klopp prepared for the future by bringing on Harvey Elliott, but returned to a neglected past by bringing on Alex Oxlade-Chamberlain.\nExistentialism runs through the Liverpool line-up like Vinicius Junior. What is their function? Can they really reshape their destiny? Is decline inevitable? Is their cycle complete? Klopp cannot answer these questions, but it's worth a try at least.\nSalvage operation, or write off the spent parts?\nTry and pick Liverpool’s best XI. Their man of the match against Real Madrid is the easiest one. Alisson walks into most sides, let alone a side more schizophrenic than Mr Hyde after a night on the potions. The back four seems settled enough, sort of (we’ll return to the one who is a defender, sort of), which just leaves the other half of the pitch.\nKlopp has already selected 11 different players in central midfield this season. Who do you go with? He’s rotated the forward line since last summer. Who’s your front three? Does your gut still go with Roberto Firmino? He’s off soon. If Nunez and Gakpo can be trusted, what happens to Diogo Jota? Even then, Nunez’s rugged physicality doesn’t entirely overcompensate for his average goal return.\nMore in Sports\nWho are the heavy metal footballers of tomorrow or is Klopp turning the Reds into a freewheeling, jazzy number, filled with nifty improvisers and short passers? Who stays? Who goes? Do they press? Do they protect? Does poor Trent Alexander-Arnold realise he’s become the literal manifestation of all of the above?\nYes, he’s the one, the defender, sort of, the club’s identity crisis encapsulated in one man. Terrific on the ball, terrible in a foot race with Vinicius Junior, the most effective passer of his generation may be considered the least effective defender in his own back four.\nTeams are often built in the image of their most influential performers. United were like Roy Keane; filled with vein-bulging, goal-scoring winners. Arsenal were Thierry Henry; quick, elegant and sneakily tough. Chelsea were John Terry; resilient, committed and annoying.\nAnd Liverpool, this particular Liverpool, are Trent Alexander-Arnold; a colossal but confused talent wondering why the simple things can no longer be done, why body and mind are not quite doing as they’re told, why everything seems a little slower and harder.\nKlopp cannot solve these existential concerns overnight, but he can address them, by ruling on the purpose of this season, or what’s left of it. There will be no silverware and the top four remains a possibility, but an unlikely one. The manager may attempt another frantic salvage operation, squeezing what’s left from the drained batteries of Firmino, Jordan Henderson and Fabinho and hope there’s enough power left in the old guard.\nOr he writes off a spluttering vehicle and starts again, now, with fresh parts. Stick with the new forward line, including Gakpo and Elliott just behind, and consider Jamie Carragher’s comments about pursuing a new right-back. Alexander-Arnold can press and pass. Or he can defend. But it’s becoming a poignant struggle for him to do both.\nKlopp has emotional choices to make, but they could be made for him, by Manchester City, Chelsea and Arsenal. Liverpool’s next three fixtures. The trio gleefully await the opportunity to chip away at the brittle bones of old men. They will fast-track Klopp’s decision process.\nHis season ended in the Bernabéu. His next season starts now.\nNeil Humphreys is an award-winning football writer and a best-selling author, who has covered the English Premier League since 2000 and has written 26 books.\nFollow the new EPL season with the \"Footballing Weekly\" show on YouTube, Spotify and Acast.\nFor more football news, visit our Football page on Yahoo!\nYou can also follow us on Facebook, Instagram, TikTok and Twitter. Also check out our Southeast Asia, Food, and Gaming channels on YouTube.",
  "word_count": 1157,
  "scraped_at": "2026-02-14T01:53:35.636890",
  "_text_extracted": true
}