{
  "article_id": "18b970214b79",
  "url": "https://english.news.cn/europe/20250419/6265b03da678490dbe903cff8512b3c2/c.html",
  "title": "Ancelotti tight - lipped on his future ahead of Athletic Bilbao game - Xinhua",
  "date": "20250419T144500Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MADRID, April 19 (Xinhua) -- Real Madrid coach Carlo Ancelotti on Saturday refused to discuss his future when asked about rumors he would leave his job before the end of the season.\nAncelotti's time at Madrid appears to be drawing to a close after his side's defeat to Arsenal in the Champions League quarterfinals, with speculation that he will step down after next weekend's Copa del Rey final against Barcelona to accept an offer to coach the Brazilian national team.\nThe Italian was questioned about this on Saturday in his press conference ahead of Sunday's game at home to Athletic Bilbao, which on Thursday qualified for the semifinals of the Europa League.\n\"Brazil? There's no need to say anything,\" replied Ancelotti, adding, \"I don't want to talk about my future today. When the season is over, we'll talk to the club.\"\n\"I've always had a great relationship with the club, and what we've done and what we'll do, we'll do together. We've never had any conflicts, and we'll never have any,\" he insisted.\nAncelotti pointed out that Real Madrid plays the Copa del Rey final next weekend against Barca and is only three points behind the Catalan club in La Liga, while this summer also sees his side go into the FIFA Club World Cup as a favorite.\n\"We have to make an assessment for the future at the end of the season or whenever it's over. But when we're still competing for titles that are still important, talking about this isn't the right thing to do.\"\nHe also denied there was a conflict with some players in the squad or with club president Florentino Perez.\n\"We're hurt, like the fans, about being eliminated from the most important competition, but these things can happen in football. You can't always win. We have the same idea, and there's no confrontation with the club because we're in the same boat, both in good times and bad. And anyone who talks about confrontation isn't telling the truth,\" said Ancelotti.\n\"All I can do is thank these players because I had a great time, and I hope to continue having a great time,\" he concluded. ■",
  "word_count": 362,
  "scraped_at": "2026-02-14T02:26:33.608449",
  "_text_extracted": true
}