{
  "article_id": "18c1a6d119d3",
  "url": "https://thepeoplesperson.com/2024/04/13/three-plotlines-fans-talking-manchester-uniteds-trip-to-afc-bournemouth-278789/",
  "title": "Three things fans are talking about ahead of Manchester United trip to AFC Bournemouth - Man United News And Transfer News",
  "date": "20240413T074500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United take on AFC Bournemouth at the Vitality Stadium this evening, looking for revenge after suffering a humiliating 0-3 defeat at Old Trafford earlier in the season.\nThere have only been 21 meetings between the two sides in history, with the Red Devils coming out on top in 14, drawing three and losing the other four.\nLast year, Casemiro scored a spectacular, acrobatic goal to largely secure Champions League football for the Red Devils.\nThis time around, Erik ten Hag’s men will be looking to keep their slim chances alive of competing in Europe’s premier competition.\nHere are some storylines that the travelling fans will be debating on the long trip down to the south coast of England.\nDiogo Dalot’s likely milestone\nIn a season of darkness, Dalot’s emergence as a reliable right back for the club has been a welcome ray of sunshine.\nThe 25 year old is on course to make his 100th Premier League appearance for the Red Devils, becoming only the fourth Portuguese player to do so after Cristiano Ronaldo, Nani and Bruno Fernandes. An appearance would be his 149th in total for the Mancunian side.\nIn his own words, he is in the form of his life and has been vital for the club, playing both right and left back this season in a campaign of horrendous defensive injuries.\nIn a season of flux, he has been a welcome beacon of consistency.\nHis play has received plaudits from former United captain and right back, Gary Neville, who has claimed that the Red Devils have found their right back for the future.\nUnited reportedly came within a whisker of signing Jeremie Frimpong from Bayer Leverkusen last summer and had they done so, Dalot would almost certainly have not reached this milestone – at least not this season. Rumours are circulating again about Frimpong as we head towards another transfer window, so despite the great season, there are still question marks over the Braga man’s ability to hold down the role going forward.\nCan Rasmus Hojlund find form again?\nThis season has certainly been a rollercoaster for United’s young Danish centre forward.\nThe high for signing for his boyhood club in the summer would have been certainly tinged with the inability to score a Premier League goal until Boxing Day.\nNonetheless, the striker scored a remarkable five goals in six Champions League matches and then went on a streak of seven goals in six league matches during January and February.\nHowever, he picked up an injury after a brace against Luton and returned on St Patrick’s Day against Liverpool. Unfortunately, in the four games he has played since his return from injury, he has barely been involved.\nIn fact, in all four games he has only had one shot on target. What’s more, in the three games after the international break, he has only managed to complete a meagre total of 41 passes, highlighting his lack of involvement in games.\nWhatever happens in regard to United’s Champions League hopes and FA Cup destiny, United fans will be hoping Hojlund can add a few more goals to his total of 13 before the season is done.\nCan the Red Devils continue their fine run of form in Bournemouth?\nDespite the loss at Old Trafford, United actually have quite a good record against the Cherries away from home.\nIn the last five matches at the Vitality Stadium, United have won four.\nThe last loss came in a 1-0 defeat in November 2019 under Ole Gunnar Solskjaer.\nAs mentioned previously, the Red Devils secured a crucial 0-1 win away last May and also won in all three of Jose Mourinho’s visits to the south coast during the Cherries’ first spell in the Premier League.\nShould United lose, it would almost certainly extinguish any chance they have of making the top five, as they would likely fall 14 points behind both Aston Villa and Tottenham Hotspur with six games left to play.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 683,
  "scraped_at": "2026-02-14T01:56:51.555777",
  "_text_extracted": true
}