{
  "article_id": "18ede3ab7866",
  "url": "https://www.businesstimes.com.sg/lifestyle/sir-david-beckham-global-icon-achieves-ultimate-goal",
  "title": "Sir David Beckham : Global icon achieves ultimate goal",
  "date": "20250614T021500Z",
  "domain": "businesstimes.com.sg",
  "source_country": "Singapore",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sir David Beckham: Global icon achieves ultimate goal\n[LONDON] David Beckham’s knighthood is the culmination of years of tireless efforts to transcend football and turn himself into a global icon at the “intersection of sport, fashion and business.”\nHe had long dreamed of becoming a sir and King Charles III made it a reality when he announced his birthday’s honours list on Friday (Jun 13), marking the end of a decades-long journey travelled with his Spice Girl wife Victoria, creator of the eponymous fashion brand.\nThe honour, one of the highest bestowed by the UK state, “is a powerful symbolic marker”, Marie Agnes Parmentier, professor of marketing at the University of Montreal and author of several papers on “Posh and Becks”, explained to AFP.\nIt “reinforces his image as a respectable, committed, and, first and foremost, British man,” she added.\nThe knighthood could present new opportunities for the 50-year-old former Manchester United and Real Madrid player, “particularly in diplomatic, charitable or political spheres”, said Parmentier.\nThe former free-kick ace, from a modest East London background, diversified his career after retiring from football in 2013, but success was the result of planning long before he hung up his boots.\nNavigate Asia in\na new global order\nGet the insights delivered to your inbox.\n“I knew my career was going to end at some point and I wanted to have a career after football,” he said in the documentary series “Beckham”, which aired on Netflix in 2023.\nPioneer\nAt the height of his football career, Beckham was signing deals with top clothing and beauty brands, building an audience that cut across gender, age and nationality – becoming the first England player to crack the US market.\nThe successful brand was built on his always immaculate appearance and nearly-always exemplary off-field behaviour, coupled with an unwavering drive to become a pioneer.\nThis required a certain amount of courage, given that English football in the 1990s was generally the preserve of no-nonsense lads more interested in the pub than the catwalk.\nHis appearance in a sarong during the 1998 World Cup, revelations that he used make-up, and his eccentric hairstyles were all feverishly gobbled up by the UK’s tabloid press.\nBeckham is still capitalising on the fascination, almost 30 years later.\nHe unveiled his first collection for Hugo Boss in April, is the founder of the Inter Miami football club and the “Studio 99“ production company, and has been a Unicef ambassador for 20 years.\nHe is now best known not for football, “but for being Beckham, the brand”, said sociologist Ellis Cashmore.\nIt is a brand worth £500 million (S$870 million), according to The Times newspaper’s 2025 ranking.\nFrom outcast to hero\nThe Netflix show exposed the couple to an emerging younger audience, cementing their fame for the foreseeable future.\nBeckham “embodies a celebrity at the intersection of sport, fashion, entertainment and business,” explained Parmentier.\nThe couple’s enduring visibility “is based on a sophisticated media strategy and an ability to embody universal values such as work, family and style,” she added.\nBut it has been a long and bumpy road, Cashmore pointed out.\nIn 1998, Beckham was called the most hated man in England after he petulantly kicked out at Argentina’s Diego Simeone during their World Cup round of 16 game.\nBeckham was harshly sent off and England lost to their bitter rivals in a penalty shoot-out. Those who had bitten their tongue about his off-field flamboyance gave full vent to their feelings.\nNational headlines the next day included “10 Heroic Lions, One Stupid Boy” (Daily Mirror) and “You’re Just A Joke Becks” (Daily Mail).\nMonths of “hell” followed, with death threats, spitting and boos accompanying Beckham wherever he went.\n“Wherever I went I got abused, every single day,” he said.\n“I find it hard to talk through what I went through because it was so extreme. The whole country hated me.”\nBut the ordeal only sharpened Beckham’s focus.\nA year later, he finished second in the Ballon d’Or as he helped Manchester United claim an unprecedented treble, winning the Champions League, Premier League and FA Cup.\nIt was often said that Beckham’s career seemed to be scripted by a movie writer, never more so than when the fallen idol took his revenge by scoring the winning goal against perennial rivals Argentina in the 2002 World Cup, redeeming his national hero status.\nThe royal family were quick to embrace him, inviting Beckham to the weddings of Prince William and Kate Middleton in 2011 and Prince Harry and Meghan Markle in 2018.\nPrevious rumours of an impending knighthood came to nothing, but his star once again rose in 2022 after the death of Queen Elizabeth II.\nWhile other celebrities came under fire for skipping the queue to view her coffin, Beckham lined up with members of the public for almost 12 hours to pay his respects.\nSince then, it has seemed that “Sir David” was only a matter of time in coming. AFP\nDecoding Asia newsletter: your guide to navigating Asia in a new global order. Sign up here to get Decoding Asia newsletter. Delivered to your inbox. Free.\nShare with us your feedback on BT's products and services",
  "word_count": 865,
  "scraped_at": "2026-02-14T01:52:26.330585",
  "_text_extracted": true
}