{
  "article_id": "18f2046a616e",
  "url": "https://www.fcbarcelona.com/en/club/news/4272235/preview-arsenal-women-v-barca-women",
  "title": "PREVIEW | Arsenal Women v Barça Women",
  "date": "20250524T160000Z",
  "domain": "fcbarcelona.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PREVIEW | Arsenal Women v Barça Women\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link\nThe day has come - the most important of the season for the two clubs, FC Barcelona and Arsenal, as they meet in the final of the UEFA Women's Champions League. The blaugranes are making their fifth consecutive appearance in Europe's most prestigious club fixture as they search for a fourth trophy and the third in a row. Up against them are the English club who are previous winners also of the competition, albeit in a different format, claiming the title back in 2007.\nThree of the last four\nBarça Women's current golden run in the competition started back in 2021 with victory over Chelsea in the final in Gotënborg, Sweden. In 2023, after having lost the previous season to Olympique Lyonnais in the final, the blaugranes came back from 2-0 down to defeat Wolfsburg 3-2. Last season Barça overcame their big rivals Olympique in the final to take the trophy with a 2-0 victory in the San Mamés stadium in Bilbao.\nArsenal, former champions\nArsenal have been the surprise package this season in the competition, and are the only English club to have won the trophy in the UEFA Women's Cup format back in 2007. Despite losing in the first leg of the quarter-finals and semi-finals against Real Madrid and Olympique Lyonnais, the London side showed great character to come back and win in the second leg to progress to the final.\n2012, a special meeting\nRenee Slegers' Arsenal squad boasts former blaugrana Mariona Caldentey but come into the final as underdogs against Barça. The English club and the Catalan club have met on just four occasions over the years with the meeting in September 2012 particularly memorable, despite the 3-0 for Arsenal, as it was the blaugranes' first ever match in the Champions League.\nCentenary, possibly with the cup\nMore than a decade has passed since then and Barça Women have risen to become the dominant side in Europe in Women's Football. Saturday's final will be their 100th appearance in the Champions League and let's hope they can celebrate their centenary by bringing the trophy back to Barcelona.\n- label.aria.viber Viber\n- label.aria.whatsapp WhatsApp\n- label.aria.twitter Twitter\n- label.aria.facebook Facebook\n- label.aria.messenger Messenger\n- label.aria.link label.aria.tick Copy link",
  "word_count": 397,
  "scraped_at": "2026-02-14T02:09:11.450221",
  "_text_extracted": true
}