{
  "article_id": "18f79d90db63",
  "url": "https://www.teamtalk.com/nottingham-forest/sean-dyche-next-nottingham-forest-manager-three-reasons-why-marinakis-chosen-one",
  "title": "Nottingham Forest : Three reasons why Marinakis chose Dyche as new manager revealed as two former heroes return to club",
  "date": "20251021T123000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nottingham Forest\nPremier League • England\nThree reasons why Marinakis chose Dyche as new Nottingham Forest manager revealed as two former heroes return to club\nNottingham Forest have confirmed the appointment of Sean Dyche as their new manager on a two-year deal – and why owner Evangelos Marinakis has plumped for the former Everton gaffer over two other top candidates has been revealed.\nThe Tricky Trees find themselves in an awkward spot this season, just a matter of months after challenging for a Champions League place under Nuno Espirito Santo. But when the Portuguese was fired just a matter of weeks into the new season and replaced by Ange Postecoglou, who lasted just 39 days, Nottingham Forest have now turned to Dyche as their third manager of the 2025/26 campaign.\nDyche, who held talks with the Forest owner over the weekend and within hours of Postecoglou’s axing, has now reached full agreement on a contract to June 2027 at the City Ground.\nAnd being seen arriving at the club’s stadium on Tuesday morning, his appointment has now been confirmed by the club in an official statement – and with two popular former stars part of his backroom team.\nUltimately, though, Dyche will take charge at the club as Marinakis’ second choice, with the Greek initially making a beeline to prise Marco Silva out of Fulham.\nThe Forest owner knows the Portuguese well, having worked with him at his other club, Olympiakos, in the 2015/16 season.\nHowever, with Silva’s reluctance to ditch the Cottagers, coupled with the £13m exit clause attached to his deal, Marinakis decided to turn elsewhere.\nHaving paid off Nuno and then hired and fired Postecoglou, the club ultimately decided, in light of sailing too close to PSR headwinds, to opt for a manager currently unattached.\nTalks were also held with former Manchester City, Inter Milan and Italy coach Roberto Mancini – out of work since leaving his role as the national coach of Saudi Arabia in October 2024 – though it was deemed his style ultimately not suitable for where Forest are at as a club right now.\nGiven Forest now accepts they are in a relegation battle, and with Dyche very much seen as a survival specialist, having done so at Everton and before that, Burnley, his appointment was seen as the smart choice by the board.\nThe fact that his more methodical and measured playing style is better compared to the success they enjoyed under Nuno was also seen as a key factor.\nDON’T MISS 🌳 Trusted Italian reporter reveals surprise coach who has rejected Nottingham Forest job\nForest welcome Dyche and the return of two former heroes\nIn a statement on their X feed, Forest welcomed Dyche to the City Ground: “Nottingham Forest is delighted to confirm the appointment of Sean Dyche as the Club’s new Head Coach, following a thorough recruitment process led by Global Head of Football, Edu Gaspar, and Global Technical Director, George Syrianos.\n“The former Forest youth player joins the Club on a contract running until the summer of 2027 and will take charge of his first match on Thursday night as The Reds take on FC Porto in the Europa League.\n“Dyche will be joined by his experienced coaching team of Ian Woan and Steve Stone – both former Nottingham Forest players who together made more than 400 appearances for the Reds during the 1990s.\n“A respected and experienced Premier League manager, Dyche brings the perfect blend of character, tactical acumen and proven achievement to guide the Club through its next chapter.\n“Having managed more than 330 Premier League matches in his career to date, Dyche has built teams defined by defensive organisation, resilience, and strength from set pieces – qualities that align closely with the current squad’s attributes and the Club’s footballing identity.\n“As a former Forest youth player who lives locally, Dyche also has a deep understanding of the values and pride of Forest and its supporters.\n“With his character, tactical acumen and man-management skills, his appointment represents the best opportunity for a successful and competitive season across both domestic and European competitions.”\nForest news round-up: Elite Reds stars chased by Newcastle, Liverpool; Brazilian eyed\nOne of Dyche’s first tasks may well be to keep his top players intact at the City Ground, and after sources confirmed to TEAMtalk that Newcastle United are planning a raid for a star midfielder.\nLiverpool have also taken a shine to one of Forest’s best defenders, who is a transfer target of Real Madrid as well.\nOn the incoming front, sources have told TEAMtalk that the Reds are ready to compete with Leeds United for an exciting Brazilian prospect.",
  "word_count": 778,
  "scraped_at": "2026-02-14T01:59:14.388774",
  "_text_extracted": true
}