{
  "article_id": "19152e411197",
  "url": "https://www.arsenal.com/news/mertesacker-impressed-wilsheres-swift-impact",
  "title": "Mertesacker impressed by Wilshere swift impact",
  "date": "20230424T163000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Having seen Jack Wilshere steer his side into the FA Youth Cup final in his first season as under-18s head coach, Academy Manager Per Mertesacker has been impressed with the impression his former Gunners teammate has made so early in his managerial career.\nHaving called time on his playing days last summer aged just 30, Wilshere immediately put himself in the frame for the role having spent time learning the ropes at Hale End and London Colney last season.\nMertesacker admitted that he had his doubts as to whether Wilshere would have the desire to pursue a coaching career, but a little over 12 months since Jack first returned to the club, he is now on the verge of potentially claiming our first Youth Cup triumph since he was patrolling the midfield in the 2009 final.\nReflecting on when he first heard of Jack coaching ambitions, our former German defender said: “I was probably thinking he will not make that transition, but he proved me wrong in that sense. I had a perception about him, playing and being super-talented but probably not fulfilling his potential because of all the injuries.\n“But then with him switching to: ‘I’m committed, I’m working hard, I’m learning, I’m ready to train with the first-team and coach the academy teams in the evening’, that’s when I thought ‘If he can do that for half a year ...’ and he’s done that pretty consistently.\n“During his interview [for our under-18s head coach role], I was sitting there, Mikel was sitting there, Edu was sitting there. I was praying that Jack would turn up and be himself. That was the moment when the truth comes. It was brilliant to see him presenting himself, what he stands for, what he wants to be like, what coach he wants to be and how he wants to play.\n“I’m really pleased with his first year. His ambition naturally is one day to go somewhere and coach a first-team, but I’m not letting him at the moment. I think it’s important to be ambitious, but I think he respects the process so much more now.”\n\"To go on an FA Youth Cup run like he has - who could have done that?\"\nHaving experienced the highs of winning the competition and seeing first-hand how it can act as a springboard for success, Jack’s enthusiasm for the Youth Cup has been clear to see throughout our run to the final, increasing as each round is progressed from.\nWith just 10 months’ experience as a head coach, Per believes his under-18s manager has a lot more learning and developing to do, but is thrilled that he is enjoying success so early on in his coaching career.\n“Head coach is a big job,” he continued. “It’s not just about working on the grass and being a role model and an inspiration. It’s about how you deal with staff, with all the emails, with how you delegate.\n“He’s made a huge impact. Struggling, learning from moments in his first year, it’s amazing. But to go on an FA Youth Cup run like he has - who could have done that? I think he has done amazing in his transition.\n“We will have tough times together. But in terms of his first year in a head coaching position and the staff that have worked around him relentlessly, I think he has created a good energy.”\n\"We’re preparing the boys, and the club, for something we haven’t achieved for the last five or six years\"\nThat feel-good factor is something being experienced throughout the whole club right now, with the men’s team involved in a Premier League title fight, and the women’s side reaching the semi-finals of the Champions League having already lifted the Conti Cup.\nThe success at all levels is something that is helping Per enjoy his role even more as he aims to continue developing youngsters for our first-team, with Hale End graduates Bukayo Saka, Eddie Nketiah, Emile Smith Rowe, Reiss Nelson and Ethan Nwaneri all providing inspiration for the next generation that first-team football is within reach.\n“Clearly the first-team vibe, the women - it rubs off on the youth and the academy as well,” he added. “There’s a good vibe. I was even outside as well with the under-18s trying to help Jack in preparation for the big game on Tuesday.\n“It feels really positive. It sends a message to the rest of the organisation, to myself, that we need to be spot on developing strong, young individuals who can come with challenges, who can cope with pressure. I like that, setting standards at the highest level.\n“We have always been at the forefront of giving young players a chance. This is something that has been part of Arsenal DNA forever. That’s the responsibility I feel. When Arsene Wenger told me: ‘This is your job - you have to prepare yourself for it but we believe you are the right person,’ that meant a lot to me. To take that on means following in the footsteps of the past, but preparing for the future, and I think that kind of spirit I can feel at the moment.\n“We’re preparing the boys, and the club, for something we haven’t achieved for the last five or six years, and that’s great. We’re talking about the Champions League and, the Youth Champions League again, that’s something that excites me.\n“When I started, I thought I’d see stuff after two years but I got rid of that notion because you have to look at a 10-year cycle in the academy. I’m looking at the next three years thinking: ‘This is when the real work starts.’”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 976,
  "scraped_at": "2026-02-14T02:06:55.001194",
  "_text_extracted": true
}