{
  "article_id": "191e48589203",
  "url": "https://www.teamtalk.com/liverpool/identify-virgil-van-dijk-successor-liverpool-scouts-sent-familiar-hunting-ground-klopp-boost",
  "title": "Liverpool identify Virgil van Dijk successor as scouts sent to familiar hunting ground and Klopp given transfer boost",
  "date": "20230215T163000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool identify Virgil van Dijk successor as scouts sent to familiar hunting ground and Klopp given transfer boost\nLiverpool have landed on a centre-back who could replace Virgil van Dijk in Jurgen Klopp’s starting eleven, and he currently plays in a league the Reds are very familiar with.\nVan Dijk joined Liverpool from Southampton in January 2018. They paid £75million for the Dutchman, which made him the most expensive defender in the world at the time. The record was beaten when Manchester United spent £80m on Harry Maguire 18 months later.\nWhile Maguire’s place in the Man Utd team is usually a topic of controversy, Van Dijk has been a crucial reason for Liverpool’s success in recent years. He is widely recognised as one of the best centre-halves in world football. He possesses excellent positioning, pace and strength, all of which make it very hard for strikers to get past him. Van Dijk is also a brilliant passer and can set up Liverpool attacks with long-range diagonal balls.\nHe is now 31 years old. While he has the athleticism to play at the top level for a few more years, Liverpool must get to work on finding his eventual replacement in defence.\nThe Merseyside giants have already brought in Ibrahima Konate from RB Leipzig. He was tasked with becoming Joel Matip’s successor, but he has already taken the Cameroonian’s place.\nOn Sunday, Football Transfers suggested four players who could move to Anfield and eventually replace Van Dijk in the side.\nThey were RB Leipzig’s Josko Gvardiol, Benfica star Antonio Silva, Goncalo Inacio of Sporting Lisbon and, surprisingly, Jarrad Branthwaite. The last one would be controversial given the fact Branthwaite has been on Everton’s books since January 2020.\nThere has now been an update on Inacio’s situation from Portuguese newspaper Corriere da Manha. They claim Liverpool sent scouts to watch the 21-year-old in action during Sporting vs Porto on February 12.\nLiverpool backed to submit offer after scouting mission\nSporting lost 2-1 at home. Nevertheless, Liverpool officials left the match with a good impression and there is now the possibility of a bid arriving for Inacio in the summer transfer window.\nThis is not the first time Liverpool have gone to the Primeira Liga for new signings. In January 2022, they raided Porto for winger Luis Diaz. And in July last year, they brought in Darwin Nunez from Benfica in a club-record transfer. It could eventually be worth £85m.\nPortuguese clubs are usually great at holding out for big sums of money when selling their top players to Premier League clubs. But Liverpool should not have to break the bank for Inacio.\nThe Reds have been given a transfer boost by the fact Sporting are unlikely to qualify for the Champions League. They sit in fourth place, six points behind the top three, with those three sides due to make the UCL. As such, Sporting must sell one of their most valuable players to make up for the loss of not making Europe’s main club competition.\nAnd the report claims Inacio is the man who will leave. Liverpool will have to get near to his release clause to get Sporting to sign off on his exit. That stands at €45m (£40m).\nWhile spending £40m on a 21-year-old defender is risky, Inacio has good potential. And he could follow in the footsteps of other Portuguese players such as Ruben Dias and Bernardo Silva by making a big impact in England.",
  "word_count": 583,
  "scraped_at": "2026-02-14T01:38:21.203508",
  "_text_extracted": true
}