{
  "article_id": "191fae88beaf",
  "url": "https://www.france24.com/en/live-news/20230917-madrid-comeback-to-stay-perfect-ramos-enjoys-sevilla-return",
  "title": "Madrid comeback to stay perfect , Ramos enjoys Sevilla return",
  "date": "20230918T003000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid comeback to stay perfect, Ramos enjoys Sevilla return\nBarcelona (AFP) – Real Madrid came from behind to beat Real Sociedad 2-1 and climb back to the top of La Liga on Sunday, maintaining their perfect start to the season.\nIssued on:\nEarlier Sergio Ramos made his second Sevilla debut in a narrow win over Las Palmas, while Mason Greenwood played his first match for Getafe, on loan from Manchester United.\nAfter Barcelona put five past Real Betis in a flashy display on Saturday the onus was on Carlo Ancelotti's Madrid side to maintain their 100 percent record and they did, against the tricky Basque visitors.\nPropelled by the electric Takefusa Kubo, Real Sociedad took an early lead through Ander Barrenetxea, but Madrid hit back with goals from Fede Valverde and Joselu to earn their fifth win from five games.\nEngland international Jude Bellingham was unable to continue his excellent goalscoring form, after netting five goals in his first four Madrid matches, but remains the division's top goalscorer.\nMadrid start their Champions League campaign on Wednesday at home against Union Berlin, and despite losing Ballon d'Or winner Karim Benzema in the summer and star player Vinicius Junior to injury, remain a force to be reckoned with.\n\"We started by letting in a goal and the good thing is that we were capable of turning it around -- the bad thing is that we have to avoid that,\" said Ancelotti.\n\"We did it thanks to the commitment, energy and will of the team, we have an intensity that opponents find hard to cope with for 90 minutes.\"\nThe Basque visitors went ahead at the new-look Santiago Bernabeu after only five minutes, when Kubo stroked a fine pass into Barrenetxea's path.\nKepa Arrizabalaga kept out his first effort with a fine save but could not claw out the second.\nKubo then beat the goalkeeper with a brilliant strike but it was disallowed for offside.\nJoselu hit the crossbar with the goal gaping and Alex Remiro denied Dani Carvajal as Madrid found their footing.\nValverde slammed Real Madrid level less than a minute into the second half, lashing Fran Garcia's cut-back in off the post from outside the area.\nThe left-back created the second goal too, crossing for target man Joselu to nod the hosts ahead at the back post.\nSpain international Joselu was immediately taken off for Eduardo Camavinga, as Ancelotti sought more control of the game.\nThe Italian got it too, with the visitors effectively shut down, no longer finding spaces between Madrid lines.\n\"This is the Bernabeu and with our fans we turned it around,\" said Joselu.\n\"We're doing a bit of everything, we're confident in ourselves, there's a lot of quality in the squad and we came from behind again.\"\nMadrid lead Barcelona by two points, with both of Spain's giants unbeaten, although the Catalans drew their opening game against Getafe.\n'Die happy'\nSergio Ramos played for Sevilla for the first time since he left the club in 2005 as they earned their first win of the season over Las Palmas.\nThe 37-year-old centre-back started in the 1-0 victory at the Ramon Sanchez-Pizjuan, following his arrival from Paris Saint-Germain this summer.\nRamos, who left Sevilla for Real Madrid 18 years ago to the ire of many supporters in Andalucia, was cheered on his return.\nBelgian winger Dodi Lukebakio sent Sevilla ahead after 71 minutes and with Ramos patrolling, they kept their first clean sheet of the campaign.\n\"I felt a lot of emotion ... it was amazing to find my people again, my home, my fans, it's unique,\" Ramos told Movistar.\nThe defender admitted some nerves about how fans would treat him after playing at a rival club for so long.\n\"I had a few doubts at first but the reception I had on my arrival, I will take to the grave ... now I can die happy,\" he added.\nElsewhere Pacheta got off to a winning start as Villarreal's new coach thanks to Alexander Sorloth's 94th minute winner against Almeria in a 2-1 victory.\nGetafe edged Osasuna 3-2, with Greenwood making his debut, and his first appearance since January 2022.\nThe English striker, on loan at Getafe from Manchester United, was charged with attempted rape and assault in October 2022 but the charges were later dropped.\nGetafe coach Jose Bordalas sent Greenwood on in the 77th minute to applause from home fans at the club's Coliseum Alfonso Perez stadium.\nA group of Osasuna supporters greeted the 21-year-old's arrival to Spanish football with chants of \"Greenwood, die\".\n\"I didn't hear them so I have nothing to say,\" said Bordalas. \"I am very happy with the kid's debut.\"\n© 2023 AFP",
  "word_count": 781,
  "scraped_at": "2026-02-14T02:00:57.131313",
  "_text_extracted": true
}