{
  "article_id": "1920149b4ccd",
  "url": "https://www.bbc.co.uk/sport/football/65579937",
  "title": "Bournemouth 0 - 1 Manchester United : Casemiro overhead kick puts Red Devils on verge of top four",
  "date": "20230520T174500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bournemouth 0-1 Manchester United: Casemiro overhead kick puts Red Devils on verge of top four\n- Published\n- comments\nCasemiro's stunning overhead kick edged Manchester United a step closer to a top-four finish as they secured a narrow Premier League victory over Bournemouth.\nThe Red Devils need just one point from their final two games against Chelsea and Fulham to secure Champions League football at Old Trafford next season.\nIn a game lacking in clear-cut opportunities a piece of magic from Casemiro proved the difference at the Vitality Stadium.\nThe Brazilian midfielder picked up a beautifully weighted pass from Christian Eriksen and turned away from Marcos Senesi to acrobatically hammer home.\nWithout their top goal scorer this season, Marcus Rashford, who was absent from the squad with illness and missed the opportunity to equal his best tally of 17 goals in a single campaign, United struggled to mount regular goal threats.\nBut Casemiro's ninth-minute strike, combined with Liverpool's draw against Aston Villa, were enough to move United one point away from guaranteeing a top-four spot.\nUnited on track for Champions League return\nWith Liverpool trailing for much of their match against Villa, United's win looked like it could be enough to secure Erik ten Hag's side their place in next season's Champions League.\nBut a late Roberto Firmino equaliser means United must now wait until Thursday at the earliest to ensure the return of Europe's top competition to Old Trafford after a season-long absence.\nMeanwhile, as Red Devils fans also await news on who their new owner will be, there can be few complaints from supporters about the job Ten Hag has done.\nWinning the Carabao Cup, preparing to face Manchester City in the FA Cup final at Wembley on 3 June and on the brink of securing a top-four place is an impressive feat for the Dutch manager's first foray into the Premier League.\nWhile rumours are circulating about the future of long-serving goalkeeper David de Gea, the result at Anfield also means the Spanish shot-stopper has done enough to secure the Golden Glove, having kept 16 clean sheets this term.\nAll United's achievements come despite a poor away record - they have only earned eight points from nine top-flight away matches in 2023, and equalled the club record for most Premier League away defeats in a season (eight).\nAs was the case against Wolves last week, the Red Devils at times lacked urgency against Bournemouth with Dominic Solanke twice going close and David Brooks forcing a fingertip save from De Gea.\nBruno Fernandes saw a shot deflected wide and a second powerful effort saved by Neto but in Rashford's absence United's potency in front of goal was lacking.\nWout Weghorst hit a sweet strike late on but it was punched away by the Bournemouth keeper, meaning the Dutch striker's hunt for a first Premier League goal for the club continues.\n\"The only criticism is we didn't kill off the game, we had to produce that second goal but that's the way this team are. It is not easy scoring goals,\" Ten Hag told BBC Sport.\n\"It was a great goal from Casemiro. We pinned them back, didn't let them breathe in the first 25 minutes.\n\"I don't care what happens in Liverpool, it's about us. We have to do the job.\"\nCherries safe but defensive improvements needed\nMany pundits and fans had written Bournemouth off before the start of the season, tipping them to return straight back to the Championship.\nBut manager Gary O'Neil has done a fine job, meaning a relatively flat match at the Vitality did not matter as he has already seen his side move well clear of the relegation battle.\nBournemouth sit 14th in the league and face relegation-threatened Everton in their last game of the season at Goodison Park.\nThe Cherries have, however, conceded 70 Premier League goals in 2022-23, equalling their highest-ever figure from 2018-19 and O'Neil will have to solve those defensive frailties to ensure his side progress next season.\nBut they did well to limit United to just one goal on Saturday and spurned their own opportunities to level with Kieffer Moore's strike producing a fine stop from De Gea.\n\"We were good, we gave everything in a close game. We were right in it and had a big chance at the end,\" O'Neil told BBC Sport.\nWith their safety confirmed Bournemouth will now look towards building a squad that can further extend their stay in the top flight next year.\n\"I am very proud of the group, it was a big mountain we had to climb. We achieved something that not many people thought we could,\" said O'Neil.\nThe home fans also celebrated the return of Brooks to the starting 11 - for the first time in 598 days after he was diagnosed with stage two Hodgkin's lymphoma in October 2021.\n\"For his first game back after such a long time David showed some great touches. Pre-season will be big for him but I'm delighted to have him back. He will be a good option for us next season,\" said O'Neil.\nOur coverage of your Premier League club is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 881,
  "scraped_at": "2026-02-14T02:00:19.995304",
  "_text_extracted": true
}