{
  "article_id": "1926f98ac8e2",
  "url": "https://www.football.london/tottenham-hotspur-fc/transfer-news/pedro-porro-medical-new-striker-26106533",
  "title": "Pedro Porro medical , new striker signs plus other transfers Tottenham will seal on deadline day",
  "date": "20230131T081500Z",
  "domain": "football.london",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pedro Porro medical, new striker signs plus other transfers Tottenham will seal on deadline day\nHere is the state of play at Tottenham Hotspur as we reach transfer deadline day with plenty of matters still to be resolved at the north London club\nThe transfer window has reached its final day and there are a number of unresolved matters at Tottenham Hotspur ahead of the 11pm deadline.\nSpurs have so far brought in Arnaut Danjuma from Villarreal on loan with a £21m option to buy and finally look like they will successfully end their prolonged negotiations to bring Pedro Porro in from Sporting. Players are also set to leave the north London club before the deadline.\nHere's the current state of play at Tottenham as we approach the final hours of the January transfer window.\nREAD MORE: Pape Matar Sarr injury as Antonio Conte makes Tottenham loan decision on Oliver Skipp\nGoalkeeper\nThis looks to be a settled area of the team for this window at least. football.london understands that Spurs plan to secure a long-term successor to Hugo Lloris in the summer and it would take a remarkable opportunity to arise in the final hours for that timetable to shift forward.\nThe only movement could potentially be a loan for either Brandon Auston or Alfie Whiteman if one arises, although with the latter's contract up this summer any exit could signal the end of his time at the club.\nCentre-back\nWhen it comes to his centre-backs, Antonio Conte will not want to lose any of his current options unless someone else comes in and Spurs' Champions League non-locally trained numbers - they will be one over the limit of 17 after Pedro Porro's arrival - adds another level of complication.\nAt the moment Conte has six centre-backs, two for each position, so he can't really leave himself short. There may well be late offers for the likes of Davinson Sanchez and Japhet Tanganga, but replacing them at this late stage with Premier League-ready players is another thing.\nThose within Spurs had distanced themselves from links with Milan Skriniar in the past week with the Inter man heading to PSG. The north London club do have an interest in 21-year-old Bayer Leverkusen centre-back Piero Hincapie, who saw his value sky rocket after impressing at the World Cup with Ecuador.\nHowever, a summer deal is currently seen as more likely for anyone chasing the 6ft defender unless a still pricey loan-back agreement can be made with the Bundesliga club who are not keen on losing him this month.\nSpurs want to sign two centre-backs in the summer, one on the left and one for the right/centre, and while they will keep an eye out for any late opportunities to push one of those moves forward, that is deemed more unlikely than likely at this point.\nAcademy defender Malachi Fagan-Walcott, who made his first team debut in the Champions League under Jose Mourinho, has been linked with a deadline day move to Swindon Town.\nREAD MORE: Djed Spence chooses Rennes loan as Tottenham make decision on his long-term futureREAD MORE: Tottenham complete transfer for talented striker amid Pedro Porro problemsWing-backs\nThis is the department where all the attention currently rests, particularly on a certain Pedro Porro, who finally looks set to complete his move to north London, with his medical booked in for Tuesday, after a dramatic final few days.\nSpurs had been making gradual progress on a move for the 23-year-old Spaniard with a medical tentatively scheduled for Monday. The player had said goodbye to the Sporting fans after the Taca de Portugal final defeat against Porto on Saturday night and was expecting to fly to London.\nSimultaneously the Portuguese side were also closing in on a deal to sign former Arsenal full-back Hector Bellerin from Barcelona as a replacement for the outgoing Porro.\nThen, despite Tottenham meeting the full original asking price, believed to be around 45m euros (£39.5m), negotiations which had been difficult throughout the month took another turn in the wrong direction as the weekend came to a close with the medical cancelled.\nThe deal hung in the balance but talks between the two clubs on Monday brought a new breakthrough and the deal was pushed back on track for a deadline day move.\nIn terms of outgoings, both Emerson Royal and Matt Doherty are considered non-locally trained in the Champions League squad, so if Porro does put pen to paper as expected then offers would be looked at for both players.\nDoherty brings left-sided cover as well which Conte appreciates but Atletico Madrid have been looking for a right-back and he could fit the bill there.\nDjed Spence is set to join Rennes on loan for the remainder of the season. football.london understands that the loan is a straight one without an option to buy as Spurs believe Spence can still have a long-term future at the club as he continues to develop and the player was not keen on leaving the club permanently either as he believes he can have a long-term future in a Tottenham shirt.\nThe England U21 international chose Rennes from a group of five clubs that submitted loan offers, which also included Spanish side Atletico Madrid and Italian outfit Sassuolo, and he will link up with Spurs team-mate Joe Rodon at the French club for the remainder of the campaign.\nSpence arrived in France on Monday evening ready to have his medical on Tuesday morning before wrapping up the deal. The player will get plenty of game time with injuries in Rennes' right-back area, including captain Hamari Traore who is set for a spell on the sidelines.\nMidfield\nWith the senior players unlikely to be going anywhere in this window, the chances of movement resides with the younger players.\nHaving found minutes hard to come by, Oliver Skipp is understood to have been willing to head out on loan for the remainder of the season in order to get his match sharpness back with Crystal Palace, Fulham, Leeds and Bournemouth among the clubs keen to take the England U21 international, who missed the second half of last season with a pelvic injury.\nHowever, Conte is believed to have rejected any prospect of a loan move so far as he rates Skipp highly and is wary of leaving himself short on numbers in central midfield, which means the current chances of a transfer deadline day loan move for the homegrown young midfielder are slim unless the Spurs boss has a late change of heart.\nPape Matar Sarr requires a foreign player spot, but Conte has taken a shine to the 20-year-old and threw him in for his full Premier League debut in the north London derby. However, football.london understands that the talented young midfielder has missed recent games with a hip injury. He is expected to return to action early next month.\nAcademy product Harvey White is understood to have been told he can go out on loan again with a number of clubs having shown interest in the 21-year-old, who made his Premier League debut at Crystal Palace this month.\nSpurs could also consider a loan move for talented 18-year-old Alfie Devine. The player is ready for a loan deal but there is also a benefit if he stays as if he sees out the remaining four months of this season at Tottenham he would reach the amount of time to become a club trained homegrown player for the European squad from next season.\nAttack\nBryan Gil has now left the club on a loan deal, without an option, returning to the club Spurs signed the 21-year-old from only 18 months ago, Sevilla.\nLucas Moura's inflamed tendon problem across the season has been difficult to solve because the Brazilian will have good days when he feels little to no pain and others when it is quite the opposite. A little run of good days led to Friday night's goalscoring 45-minute return for the U21s and the player will be hoping he suffers no adverse reaction in the days ahead.\nWith Spurs not taking up the December option to extend Lucas' contract, he is a free agent in the summer and it is understood he would be open to a January move. However, unless a late deal for a replacement arises, it is difficult to see Conte sanctioning an exit for Lucas as well as Gil.\nSpurs have signed Danjuma to bolster Conte's attacking options and the club are also set to do the same for their academy.\nTottenham have completed the deal to sign young Chelsea forward Jude Soonsup-Bell, football.london understands.\nSpurs swooped for Soonsup-Bell after contract talks between the Blues and the striker, who turned 19 this month, stalled. The forward is highly regarded at Chelsea but is understood to have wanted a clearer path to first team football and with his contract running into its final six months the Blues had to let him go.\nHe underwent his medical with Tottenham on Monday and the deal is now understood to have been completed with the teenager moving across London on a free transfer but with Chelsea holding a sell-on clause. The move is expected initially to bolster Spurs' academy but with the prospect of a summer loan for Soonsup-Bell, who made his Chelsea debut under Thomas Tuchel in the Carabao Cup last season but comes to the end of his contract this summer.\nManchester City are also believed to have previously made a move for the youngster, while other clubs across Europe also made their interest known. Soonsup-Bell scored 23 goals in 25 games for Chelsea's U18s and has stepped up to the U21s, with two goals in his seven Premier League 2 matches so far this season.\nDane Scarlett will remain at Portsmouth for the remainder of the season after Spurs let the one-week period pass this month in which they could have recalled the teenage striker who was back in the starting line-up for Pompey this weekend.\nREAD NEXT:\n- Daniel Levy, Antonio Conte and a defining fortnight for Tottenham Hotspur\n- Daniel Levy and Fabio Paratici have Tottenham transfer duty as Conte shares special Sarr moment\n- Tottenham issue statement after Aaron Ramsdale incident at end of North London Derby vs Arsenal\n- Every word Conte said on Spurs' Arsenal defeat, Hugo Lloris error and supporter kicking Ramsdale\n- The Pedro Porro problem, that Qatar meeting and Leandro Trossard - Tottenham behind the scenes",
  "word_count": 1747,
  "scraped_at": "2026-02-14T01:59:41.729636",
  "_text_extracted": true
}