{
  "article_id": "193942b42796",
  "url": "https://thepeoplesperson.com/2024/08/29/the-truce-between-jadon-sancho-and-erik-ten-hag-was-a-sham-284807/",
  "title": "The  truce  between Jadon Sancho and Erik ten Hag was a  sham  - Man United News And Transfer News",
  "date": "20240829T231500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The ‘truce’ called between Erik ten Hag and Jadon Sancho which allowed the 24-year-old winger to return to the first-team at Manchester United has been described as a “sham” inside a shocking report by the Daily Mail.\nSami Mokbel (Mail Online) contends the ‘clear-the-air’ talks held between the pair in July were simply a “financial exercise designed to maintain the attacker’s value heading into the transfer window.”\nSancho spent the second half of last season on loan at Borussia Dortmund – the Bundesliga club where he firmly established himself as one of Europe’s most exciting young talents after relocating to Germany as a 17-year-old from Manchester City.\nIndeed, Sancho’s displays in his first stay at the Signul Iduna Park were so impressive they convinced Old Trafford officials to sanction a £73 million move to secure the then 21-year-old in a blockbuster deal in the first place, following a pursuit stretching over twelve months.\nThe winger has never truly settled in the red side of Manchester, however. He struggled in his debut season under Ole Gunnar Solskjaer and then showed little improvement under the Norwegian’s interim replacement, Ralf Rangnick.\nThe arrival of Ten Hag – a manager whose sides have always embraced technically gifted forward players – could have signalled a positive turning point for Sancho. But the 24-year-old’s poor performances persisted in the Dutchman’s first season in England with a sense emerging that, despite having grown up in the country’s youth system, Sancho was not well-suited to the physical rigours of Premier League football.\nIndeed, these struggles reached a peak when Sancho was excused from first-team duties at Old Trafford towards the end of 2022, and flew to Holland to train individually.\nTen Hag revealed the winger was working to overcome “physical and mental” issues – an admission the manager did not have Sancho’s permission to reveal given the sensitive nature of it. Mokbel states there were “real concerns” from the club’s HR department that Sancho had “grounds to make a legal complaint”. Ten Hag believed he was simply being supportive and the Dutchman’s candid approach to interviews has been commonplace throughout his career.\nThis was likely the beginning of a fraction between the pair, however, even if there were positive signs upon Sancho’s return to the first-team from his training programme in Holland. At a minimum, it was a warning of things to come through the medium of press-conferences.\nIn Sancho’s first game back, he came off the bench against Leeds United to draw his side level and rescue a point. Ten Hag described Sancho as a “magnificent player” in his interview after the 2-2 draw, revealing he was “proud” of the winger’s progress after a “difficult period”.\nThe positivity of this moment waned as the remainder of the season progressed, however.\nIn United’s final game of the season – a pivotal FA Cup final against local rivals Manchester City, who were vying to match the Red Devils’ historic treble winning season – Sancho started on the left-wing. He produced an anonymous performance and was substituted for Wout Weghorst in the 78th minute with his side desperately chasing a goal.\nTen Hag was spotted in an angry exchange with Sancho before he was taken off. The Dutchman was incensed by the 24-year-old with Alejandro Garnacho, four years Sancho’s junior, producing more in his thirty minute cameo than the English winger did throughout the entire game.\nAfter the match, James Ducker (The Telegraph) described how Sancho was on “borrowed time” after his performance, or lack thereof, at Wembley. “The 18-year-old Argentine [Garnacho] represents United’s future. Sancho, on this evidence, does not,” Ducker concluded.\nThis assessment proved impressively prophetic with events which unfolded just three months later.\nUnited began the 2023/24 season in unsteady fashion. An opening day 1-0 win over Wolves was as lucky as it was undeserved before Ten Hag’s side fell to a 2-0 defeat to Tottenham Hotspur in their next game. An away trip to Arsenal at the Emirates followed with the pressure already cranking up on the Dutch manager amid a mounting injury crisis less than a month into the new season.\nTen Hag chose not to include Sancho for the travelling squad. In his post-match interview, following a disappointing 3-1 loss – which could easily have been a win if not for Garnacho’s 88th minute disallowed goal – the 54-year-old manager revealed Sancho had “not trained well during the week.”\nIn response, Sancho launched an immediate rebuke on social media, describing this reasoning as “completely untrue” and revealing he felt he had been a “scapegoat for a long time”. It was a response as shocking as it was public; the type usually reserved for a heated dressing room exchange, rather than a social media account with over two million followers.\nTen Hag’s reaction was swift and decisive. He immediately banished Sancho from the first-team squad, forcing the winger to train with the club’s academy teams. The only route back into the fold at Old Trafford was “through an apology” to the Dutchman.\nSancho refused to do so with Mokbel revealing the 24-year-old felt “disrespected and, to a point, bullied.”\nA stand-off ensued with neither party willing to concede their side. Sancho would remain in exile from September until January with club executives agreeing a return to Borussia Dortmund on loan as a short-term compromise to an increasingly untenable situation.\nIndeed, the Daily Mail contends, certain members of the United dressing room “felt their relationship with [Sancho] was frowned upon by Ten Hag.” The report even suggests that one player became “so suspicious that he felt his friendship with Sancho was detrimentally impacting ongoing talks over a contract extension.”\nTen Hag is believed to have an approach some describe as cold with his players. While this works for some, it will not for others. It’s not the first time the Dutchman has experienced a run-in with a player, nor is it likely to be the last; as is the case for most high-level coaches.\nBut it’s not the first time a manager has raised an issue with Sancho’s conduct off the pitch either. In fact, Ten Hag is simply the latest in a long line of coaches who have taken ire with the winger.\nAt Dortmund, Sancho was repeatedly reprimanded for being late to training and team meetings. Club executives were critical of his decision to fly back to England after matches. The problem became so acute, Edin Terzic – Dortmund’s caretaker manager in the 2019/20 season (before assuming the full role in 2022) – instructed his staff to pay “special attention” to Sancho to ensure his timekeeping improved.\nIt’s a style of preferential behaviour a team like Dortmund are willing to afford their star players; one the size of United simply will not do so, nor would any one of Europe’s other big clubs.\nBut these issues with application and professionalism were not limited to club level. On the international stage, Sancho’s conduct has also annoyed his managers – at both senior and youth levels.\nThe winger was once dropped for an England U-19 match against Latvia after “turning up late to a team meeting”, mirroring persistent issues in Dortmund and Manchester.\nSimilarly, former Three Lions boss Gareth Southgate and his coaching staff were also reported to be unimpressed with Sancho “sulking after he was left out of the starting XI for the Euro 2020 opener.” The 24-year-old was described as acting “petulantly” after the omission from the first-team – a reaction which could describe the one last September after United’s defeat to Arsenal – with Southgate revealing it was a “lack of training form” which influenced the decision.\nRing any bells?\nSancho officially returned to Die Schwarzgelben on January 11 with a loan move sanctioned by United. The 24-year-old is “loved” in Dortmund and he, in turn, “loves it there”. It was the ideal landing ground for a player whose confidence was low as his fitness levels after four months in exile at Carrington.\nAnd this positivity off the pitch evidently helps Sancho to play more effectively on it.\nHe produced a number of excellent performances in Dortmund’s run to the Champions League final, particularly in the semi-final against Paris Sain-Germain where the Ligue 1 champions left-back, Nuno Mendes, was run ragged by Sancho.\nMokbel describes these matches as a “stark reminder” of the winger’s talents.\nBut the Daily Mail reporter does omit Sancho’s inconsistent performances in the Bundesliga, where he returned just two goals and three assists in fourteen games, as these were reminders of his time in Manchester. Indeed, he only scored once in Dortmund’s Champions League campaign.\nThere was hope amongst Old Trafford executives that Dortmund would be willing to convert Sancho’s loan move into a permanent one. But the club’s asking price – believed to be in the region of £40 million – was considered too costly for the German side and, instead, Sancho returned to England.\nIt is worth noting, however, that Dortmund have spent nearly £80 million this summer. Their most expensive outlay was a £24 million deal to sign Maximillian Beier from Hoffenheim, while the club also announced a record revenue for the 2023/24 season with a 24% increase in turnover.\nIs it that unrealistic, therefore, for Dortmund to spend £40 million on a talent they consider as elite as Sancho? With a hardball approach, the German club’s executives could likely have driven the price down even further for a player as keen to depart Old Trafford as Sancho reportedly is.\nIt’s far more likely that the biggest economic hurdle Dortmund were unable to jump was, in fact, the 24-year-old’s wage packet. Sancho reportedly earns a base salary of £250,000 a week at Old Trafford, with a further £50,000 in potential bonuses. He has two years remaining on this contract – one Dortmund would never be able to match.\nIt’s little surprise, therefore, that a permanent return to Germany never materialised, given the figures involved in both sides of the deal.\nThe same issue has reared its head in negotiations with Juventus with the Old Lady expressing an interest in signing Sancho on loan. The Italian side have offered a considerable fee for the deal but have requested United pay a portion of the 24-year-old’s salary to facilitate the move. Old Trafford officials are not interested in a loan without an obligation, particularly if it comes attached with further financial restrictions.\nSancho was believed to be “open” to a move to Serie A but reports suggest the move has stalled due to the finances involved, as well as Premier League rival Chelsea emerging as an alternative option.\nThe London club have approached United over the prospect of signing Sancho and Old Trafford executives have been locked in negotiations over the past few days. A deal in the opposite direction for Chelsea’s own unwanted English winger, Raheem Sterling, has been also discussed, with the possibility of a swap deal on the cards.\nFabrizio Romano, the Italian transfer expert, confirms the two clubs are “talking” over a deal.\nA source at Stamford Bridge reveals Chelsea would prefer a permanent transfer for a player they have hold a long-term admiration for. The club’s co-director of talent and recruitment, Joe Shields, is the figure “credited with unearthing Sancho ahead of his move from Watford to Manchester City in 2015” while new manager Enzo Maresca describes the winger as a player he “know[s] very well”.\nThe appeal of a return to London – Sancho was born in Camberwell, an area of the capital five miles from Stamford Bridge – is a strong one for the 24-year-old. As is the opportunity to prove himself in the Premier League after a disappointing three-year spell at Old Trafford; with Ten Hag likely to be number one on his list of people to prove wrong.\nIf United are able to agree a deal to sell Sancho to Chelsea permanently, it will represent a win for both the club and the player. And it will give some level of credence, Mokbel writes, to the “sham” of a reconciliation which saw Sancho reintegrated into Ten Hag’s squad.\n“This was never about Ten Hag letting bygones be bygones and restoring Sancho into his plans but rather a financial exercise designed to maintain the attacker’s value heading into the transfer window,” the Daily Mail reporter contends – “…nothing more than a means to an end”.\nIf the end is a permanent transfer to Stamford Bridge, removing a costly wage packet and an unhappy player from the Old Trafford dressing room who no other team is willing to sign, it’s hard to argue too strongly with the means.\nThis is professional football after all; it’s a cut-throat business.",
  "word_count": 2117,
  "scraped_at": "2026-02-14T01:48:56.586248",
  "_text_extracted": true
}