{
  "article_id": "19607b9e0776",
  "url": "https://metro.co.uk/2025/07/25/much-trouble-chelsea-injury-expert-explains-club-world-cup-hangover-threat-23750286/",
  "title": "How much trouble are Chelsea in ? Expert explains Club World Cup injury fears",
  "date": "20250725T141500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Just 34 days separate Chelsea lifting the Club World Cup and the start of their new Premier League campaign.\nWhether you’re in the camp heralding the tournament as a legitimate and prestigious accolade or sat alongside Jose Mourinho wondering what the point of it all was, Chelsea certainly benefited.\nTo the tune of almost £100million in prize money, to be precise, with another trophy after the Europa Conference League success in May putting an almighty spring in their step.\nSweeping aside Paris Saint-Germain in the final with new signing Joao Pedro already in fearsome form has sparked title talk in west London – perhaps justifiably so.\nThe win over the European champions was Chelsea’s 64th match of a 53-week season. Four players in Marc Cucurella, Moises Caicedo, Cole Palmer and Enzo Fernandez racked up over 4000 minutes of playing time with the squad receiving three weeks of precious holiday time to rest up and recuperate.\nChelsea will squeeze in pre-season games against Bayer Leverkusen and AC Milan the week before they open the new season against Crystal Palace on 17 August.\nWith fixture schedules relentlessly unforgiving ahead of next summer’s World Cup, player welfare remains a concern among coaches and their staff – if not the decision-makers at the top of the sport.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPep Guardiola sounded the alarm after his Manchester City side crashed out of the competition at the last 16 stage against Al-Hilal.\n‘Maybe in November, December or January it will be a disaster, we are exhausted and the World Cup has destroyed us,’ the City boss said.\n‘I don’t know, it’s the first time in our lives that this has happened. We will see when we come back.’\nMaresca and his staff guarded against overworking their players as best as possible – the Italian made full use of his squad out in the US, naming a different starting XI in each of their six games.\nAnd of course Chelsea will take the positives – more silverware, more money, team spirit through the roof and confidence flowing ahead of the new campaign. But once the party mood fades, will the hangover kick in?\nBy the time their key players are back at Cobham there will be just two weeks before their opener against Palace. While there will be the temptation to ease the likes of Palmer back in, plans will have been in place long before the Blues set out for the US in June.\nStephen Smith, CEO and founder of Kitman Labs which specialises in injury welfare and performance analytics told Metro: ‘It’s a hard balance. ‘The players will come off this hugely confident and go into the season wanting to compete from the opening week.\n‘It is a quick turnaround but Chelsea will want a full deck to work with for the opening weeks. Cole Palmer played over 4000 minutes with others also playing a significant number of minutes. Then there are players who had a lighter, more balanced season and that can put them in a strong position.\n‘They might think there are six or seven players who need rest but they will not want to be sitting on a sunbed too long, they will want to get back in and have a strong start to the season.\n‘I wouldn’t use the word disadvantage when talking about Chelsea’s preparations. They are coming in with a different baseline for their preparations given how little time they’ve have in comparison to other teams.\n‘But they will take a lot from their form at the Club World Cup, in giving players exposure to high quality games. I assume their training loads in the competition would have been lower too to allow for a little bit more rest than you would see int he latter stages of the Premier League too. So there will have been a plan in place at every stage.’\nHeavier workloads over the summer inevitably increase injury fears. According to Physio Room, Chelsea suffered 17 different injuries last season, enough to rank them eighth in an overall Premier League table. Omari Kellyman, signed from Aston Villa last summer, endured hamstring problems that prevented him from making his first-team debut with Wesley Fofana suffering more horrid luck.\nSmith explains ‘injury spikes’ are at their most common during two stages of the season, the opening weeks and in the busy festive period. While no side will be immune, the likes of Chelsea and City will be at more risk.\n‘What we normally see is players come back in for the first few weeks and we usually see a spike in injuries and that is generally what we will see across the Premier League compared to other portions in the year,’ Smith said.\n‘We see another spike around Christmas and New Year because there is so much congestion around that time period. So I think it’s likely we see that again, particularly with the teams who had a shorter preseason because of their involvement in the Club World Cup but hopefully it won’t have a huge impact.’\nChelsea boast considerable squad depth, almost able to field two different starting XIs for their domestic and European campaigns last season.\nMore Trending\nA huge step up in the quality of their European opponents in the Champions League this term may change that tact but the quality in the squad has improved again this summer with the additions of Liam Delap, Joao Pedro, Estevao Willian, Jamie Gittens and Dario Essugo with Andrey Santos also back from his loan.\nChelsea’s business is not done yet either with Dutch pair Jorrel Hato and Xavi Simons in their sights with interest remaining in Alejandro Garnacho.\n‘Chelsea have depth which helps. You can rotate a lot more than other clubs which will help them. They are also off the back of this successful season,’ Smith said.\n‘That reduces a lot of stress, strain and anxiety on the staff, the coach and the players internally. So there is a lot of pressure off them which can play out on the pitch too.’\nMORE: Chelsea transfer stance on Alexander Isak revealed after ‘odds slashed’ on deal\nMORE: Chelsea’s Premier League rivals enter race to sign £20m Raheem Sterling\nMORE: Rio Ferdinand backs Arsenal star to have ‘proper breakout year’ and drools over Max Dowman",
  "word_count": 1101,
  "scraped_at": "2026-02-14T02:02:51.946070",
  "_text_extracted": true
}