{
  "article_id": "1979d513465d",
  "url": "https://www.the42.ie/republic-of-ireland-nations-league-slovenia-6721766-Jun2025/",
  "title": "  It the whole calendar . I dont know who in charge but it definitely needs to be looked at  ",
  "date": "20250603T091500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ON WHAT IS an important day for the Republic of Ireland WNT, fixture scheduling and Nations League format confusion have become equally important discussion points.\nBoth Ireland manager Carla Ward, and team captain Katie McCabe, agree that the system needs to be reviewed. In the last week, McCabe has played in a Champions League final for Arsenal and a Nations League fixture for Ireland in Istanbul. The Ireland squad are heading to the USA in June to play two international friendlies, but she will not be available. Everything is packed in too tightly.\nThe Nations League is Ireland’s main concern at the moment, and the format has long been a source of confusion.\nIn truth, the Ireland women’s team is no stranger to convoluted qualification routes. Their path to the 2023 World Cup — and a first-ever major tournament — was far from linear. At one point, Denise O’Sullivan admitted that she found the whole system “really confusing” and that her teammates “tried to explain it 100 times” before she simply decided to detach from the diagrams and focus on the games in front of her.\nThe Nations League is running a similarly protracted line. Ireland’s yo-yo form between League A and League B has probably added to the confusion, but for now, they are in the second tier in what has been labelled the group of death.\nTonight, they face Group B2 leaders Slovenia in Cork’s Páirc Uí Chaoimh and thankfully, the aim is simple: win the game by four goals or more to achieve automatic promotion to League A. If they fall short in that mission, they still have a play-off route awaiting them in October.\nThere’s clarity with this fixture but broadly speaking, Ireland captain Katie McCabe feels the whole Nations League structure is chaotic.\n“It’s nuts — the set-up, the goals, points, relegation and promotion,” she begins ahead of tonight’s 6pm kick-off at Cork GAA headquarters.\nSimilar to the attitude that her teammate O’Sullivan adopted for the World Cup play-off, McCabe is intent on narrowing her focus to keep her mind clear.\n“All we can concentrate on is winning games and progressing performances game by game. I’ll let you all do the maths and we [will] focus on winning matches.\n“It’s the timing of the fixtures as well, like what we had to do last year all through the summer where you’re finishing a season and you’ve to kind of rest but kind of keep fit for the next block of games and it’s hard mentally and physically from a periodisation point of view to do that. So, the timing of the fixtures needs to be looked at as well in my opinion.”\nMcCabe helped Arsenal end an 18-year wait for Champions League success last week but left the celebrations early for Ireland’s crucial Nations League trip to Türkiye. She wanted to be available for international duty but feels the schedule is too congested.\nIt’s an issue which has become synonymous with McCabe’s club in recent years. Arsenal players including Leah Williamson and Beth Mead have suffered ACL injuries which are believed to be linked with the increased playing demands on female players.\n“It’s the whole calendar,” says McCabe. “I don’t know who’s in charge of it but it definitely needs to be looked at.\n“What it will create over time and we’ve already seen it in recent years is burnout in players and major injuries. You’ve got world-class players that will be sitting out of tournaments through injuries and we don’t want to see that. We want the best players in the world playing at tournaments on the biggest stage. I just hope it doesn’t cause too much more harm to us as players going forward.”\nBoth McCabe and Ireland head coach Carla Ward agree that returning to League A is their objective but there is an argument for staying in League B at the moment. The next promotion to the top tier would give them a better pathway to the 2027 World Cup.\nMcCabe stresses that League B is a difficult competition but wants to keep company with the best nations in world football. Ultimately, everyone in the Ireland camp is united in their ambition to get to the top tier.\n“We’ve discussed it as staff,” says Ward, “but it’s bonkers because if you stay in [League] B now, you are in a better position to win League A and get one less qualifying round to the World Cup. But how does that give motivation?”\n“We don’t want to think like that. We are naturally competitive and we want to win the group.\n“It needs looking at. As soon as the Nations League came along, it’s good because there’s no more friendlies. Every country is getting more competitive, but the structure to say that if we get promoted to League A, but then we get relegated, for example, we would be in a far weaker position than somebody in League B.”\nNow, that the confusing and tiring talk of scheduling and format structures is done, let’s reset to focus on this evening’s action. Ireland face a huge challenge in defeating Slovenia by more than four goals, but it’s the route they’re determined to take.\nA huge game awaits in Páirc Uí Chaoimh.",
  "word_count": 878,
  "scraped_at": "2026-02-14T02:11:36.675250",
  "_text_extracted": true
}