{
  "article_id": "19895301d8e7",
  "url": "https://allafrica.com/stories/202512150095.html",
  "title": "Morocco Boss Regragui Includes Injured PSG Star Hakimi in Cup of Nations Squad",
  "date": "20251215T094500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Morocco head coach Walid Regragui on Friday backed skipper Achraf Hakimi to make a full recovery from injury, after naming the defender in his 28-man squad for the 2025 Africa Cup of Nations, kicking off on 21 December.\nThe Paris Saint-Germain star was injured on 4 November when Bayern Munich striker Luis Diaz tackled him during the Champions League clash between the sides.\nHakimi was helped off the pitch at the Parc des Princes in Paris, with tests then showing he had suffered a severe sprain to his left ankle.\nSpeaking after the 2026 World Cup draw in Washington on 5 December, Regragui said: \"We hope Hakimi will be available for our first match against the Comoros. He's working as hard as he possibly can to be ready. He wants to be there in Morocco.\"\nKeep up with the latest headlines on WhatsApp | LinkedIn\nRevealing the squad and Hakimi's inclusion, Regragui added: \"The choices I've made are the results of 18 months of hard work and reflection. There's never total agreement about who should be in or out of the squad.\"\nMorocco bosses lodge complaint over officiating in World Cup semi against France\nHakimi, along with fellow defenders Nayef Aguerd and Noussair Mazraoui, goalkeeper Yassine Bounou, midfielder Sofyan Amrabat and striker Youssef En-Nesyri form the backbone of a team that has been tipped for victory at the 35th Africa Cup of Nations.\nThe biennial competition kicks off with Morocco's game on 21 December at the Prince Moulay Abdellah Stadium in Rabat against Comores.\nThe hosts will take on Mali five days later and Zambia on 29 December in the pool stages.\nSemi-finalists at the 2022 World Cup, Morocco were surprisingly knocked out by South Africa in the last 16 at the 2023 Cup of Nations in Cote d'Ivoire.\nBut since that disappointment they have regrouped, and are entering the tournament on the back of a world record 18-game unbeaten streak.\nThe tournament comes a few months after the under-20 side swept past the likes of France and Argentina to claim the World Cup in Chile.\nRegragui, who played in the Morocco side that lost in the 2004 Cup of Nations final against Tunisia, has resisted the temptation to promote several stars from the World Cup-winning squad.\n\"The group I've named knows each other well,\" Regragui told the Moroccan football federation website. \"The players know the system and how they're supposed to operate and behave in a competition setting. There are youngsters in the squad and there's a good balance between youth and experience.\"\nOn Friday, Mali unveiled its list of players for the tournament, where coach Tom Saintfiet will attempt to take the side to its first title at the Cup of Nations.\nIn 2023, under Eric Chelle, Mali's campaign ended in the last eight. They played more than 60 minutes of their quarter final against Cote d'Ivoire with an extra man following the dismissal of Odilon Kossounou.\nBut the hosts scored an equaliser in the dying seconds of regulation time and, as a penalty shootout loomed, claimed the winner with virtually the last kick of extra time to steal a place in the semi-finals.\nPSG and Morocco defender Achraf Hakimi claims 2025 Prix Marc-Vivien Foé\nNearly two years on, Chelle oversees Nigeria's footballing fortunes. The 48-year-old failed to steer the squad to the 2026 World Cup and will be seeking redemption at the Cup of Nations.\nNigeria, who are in Group C with Tunisia, Tanzania and Uganda, will play all of their first round matches in Fez in northern Morocco.\n\"Our players are suffering and we must find a cure,\" said Chelle. \"Instead of hurting, we must hurt our opponents.\"\nStriker Victor Osimhen added: \"Nigerians keep telling us we are a golden generation. But we have now failed twice in succession to qualify for the World Cup. If we are that good, how come we keep failing? Our squad is packed with great Nigerians playing for some of the best clubs in Europe. The time has come to translate that greatness into trophies.\"",
  "word_count": 675,
  "scraped_at": "2026-02-14T02:03:26.511397",
  "_text_extracted": true
}