{
  "article_id": "1994345a28dd",
  "url": "https://www.fourfourtwo.com/features/crystal-palace-v-manchester-city-live-stream-how-to-watch-premier-league",
  "title": "Crystal Palace v Manchester City live stream : How to watch the Premier League from anywhere in the world",
  "date": "20230310T194500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace v Manchester City live stream, match preview, team news and kick-off time for this Premier League match\nFind a Crystal Palace v Manchester City live stream for this Premier League clash\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nCrystal Palace v Manchester City live stream and match preview, Saturday March 11, 5.30pm GMT\nCrystal Palace v Manchester City live stream and match preview\nLooking for a Crystal Palace v Manchester City live stream? We've got you covered. Crystal Palace v Manchester City is on Sky Sports in the UK. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nManchester City will be aiming to put pressure on Premier League leaders Arsenal once again when they travel to Crystal Palace.\nThe Citizens are on a seven-match unbeaten run, winning the last three, but trail the Gunners by five points and might have one eye on next week’s Champions League last-16 clash with RB Leipzig.\nPalace risk being dragged into a fiercely contested relegation battle after a run of nine games without a win in the league left them 12th, five points above the drop zone.\nCity won the first meeting of the season 4-2 in August, when a John Stones own goal and Joachim Andersen strike gave the visitors a shock lead, only for an Erling Haaland hat-trick and Bernardo Silva goal to secure three points.\nKick-off is at 5.30pm GMT. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nCheick Docuoure misses out for Palace through suspension, while Sam Johnstone and Nathan Ferguson are injured.\nPep Guardiola has a full squad to choose from. Phil Foden has struggled with a foot problem of late, but is in the team to face Palace at Selhurst Park.\nCrystal Palace XI: Guaita; Clyne, Andersen, Guehi, Mitchell; Milivojevic, Lokonga, Ayew, Olise, Sckupp; Zaha.\nManchester City: Ederson; Akanji, Ruben Dias, Ake, Stones, Rodri, Gundogan, Bernardo Silva; Foden, Grealish, Haaland.\nForm\nCrystal Palace: LDDDL\nManchester City: WWWDD\nReferee\nRobert Jones will be the referee for Crystal Palace v Manchester City.\nStadium\nCrystal Palace v Manchester City will be played at Selhurst Park in London.\nKick-off and channel\nCrystal Palace v Manchester City kick-off is at 5.30pm GMT on Saturday 11 March. It will be shown on Sky Sports Main Event and Sky Sports Premier League in the UK.\nIn the US, kick-off time is 12.30pm ET / 9.30am PT. The match will be shown on NBC in the US. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and BT Sport are the two main players once again, but Amazon also have a slice of the pie in 2022/23.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing even more than the 175 games it aired last season. If you pick up a fuboTV subscription for the games not on Peacock Premium, you'll be able to watch every game.\n• Canada: The way to watch Premier League football in 2022/23 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season. Non-subscribers can access the action via a Fetch TV box and other friendly streaming devices.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAlasdair Mackenzie is a freelance journalist based in Rome, and a FourFourTwo contributor since 2015. When not pulling on the FFT shirt, he can be found at Reuters, The Times and the i. An Italophile since growing up on a diet of Football Italia on Channel 4, he now counts himself among thousands of fans sharing a passion for Ross County and Lazio.",
  "word_count": 954,
  "scraped_at": "2026-02-14T02:29:12.779565",
  "_text_extracted": true
}