{
  "article_id": "199b6e6ef057",
  "url": "https://www.france24.com/en/live-news/20231003-saka-injury-in-lens-defeat-a-worry-for-arsenal-boss-arteta",
  "title": "Saka injury in Lens defeat  a worry  for Arsenal boss Arteta",
  "date": "20231004T001500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saka injury in Lens defeat 'a worry' for Arsenal boss Arteta\nLens (France) (AFP) – Arsenal manager Mikel Arteta admitted his team's 2-1 Champions League defeat against Lens in France on Tuesday was \"a big lesson\" as he confirmed Bukayo Saka had been forced off with a muscle injury.\nIssued on:\nThe England winger limped off late in the Gunners' 4-0 Premier League win at Bournemouth at the weekend but recovered from that to start against Lens.\nHe duly set up Arsenal's opener for Gabriel Jesus, but went down just after the half-hour mark and had to be replaced by Fabio Vieira.\n\"He tried to back-heel a ball in the first half and he felt something, it was something muscular. He was uncomfortable to carry on so we had to take him off,\" said Arteta, who had seen Adrien Thomasson equalise for Lens before Saka came off.\nElye Wahi scored the winner for the hosts in the second half.\nThe injury raises fears that Saka, who has played in all but one of Arsenal's games this season and is their leading scorer, may not be fit to face Manchester City on Sunday.\nHis place in the England squad to play Australia and Italy this month could also be in doubt.\n\"It was big enough to stop him being able to continue and that is obviously a worry for us,\" said Arteta, who rejected suggestions Saka might have been rested here.\n\"It was a knock that he had the other day. He was perfectly fine. It was an action, it was the back-heel, that can produce that type of injury. Let's see what the extent of it is.\"\nHe added: \"He was really looking forward to playing. It was a big Champions League night. I painted a picture of the type of game that we would have to face today.\n\"It is the Champions League so it is difficult to win, very difficult to win away from home, and we take a big lesson from tonight.\"\n'Big teams punish you'\nThe result at the Stade Bollaert ended Arsenal's unbeaten record this season, providing a reality check ahead of the key encounter with City.\nArsenal, appearing in the Champions League for the first time since the 2016/17 season, slip a point behind Group B leaders Lens.\nThe Gunners, who hammered PSV Eindhoven 4-0 two weeks ago, next face a double-header against Sevilla.\nThe Spaniards twice let the lead slip in a 2-2 draw with PSV in the Netherlands on Tuesday.\nArteta felt his team had been in control against Lens before an error by goalkeeper David Raya helped offer the hosts an equaliser.\nHowever, the coach defended his fellow Spaniard, who was again preferred to Aaron Ramsdale in goal.\n\"Errors happen constantly in football. Every three or four seconds there is an error. We have to adapt to that,\" he said.\n\"Today we were most in control after the first goal. We dominated, we had two big chances to score before them and then the game turned around.\n\"It is what happens –- big teams punish you.\n\"Today we didn't punish them like we punished PSV and that was the difference.\"\n© 2023 AFP",
  "word_count": 532,
  "scraped_at": "2026-02-14T02:00:57.114813",
  "_text_extracted": true
}