{
  "article_id": "19aa488aa285",
  "url": "https://www.dw.com/en/euro-2024-does-croatia-have-a-problem-with-right-wing-extremist-hooligans/a-69411580",
  "title": "Are Croatian hooligans really right - wing extemists ? – DW – 06 / 19 / 2024",
  "date": "20240619T153000Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Are Croatian hooligans really right-wing extremists?\nJune 19, 2024Thousands of Croatian football fans have descended on Germany for Euro 2024. Past incidents have left them with the reputation of being inflitrated by right-wing extremists prone to violence. Is the reputation deserved?\nMichalis Katsouris was just 29 years old when he was stabbed several times in an Athens suburb on August 7, 2023. He later died in hospital.\nThe attack occurred during clashes between Greek and Croatian hooligans ahead of a Champions League qualifier between local side AEK and Dinamo Zagreb.\nVideos showing the street battles between the two groups circulated on the internet. The footage shocked even Dino Vukusic, an expert on fan behavior at the Ivo Pilar Institute for Social Sciences in Zagreb.\n\"That was a precedent,\" Vukusic told DW. \"It was the first time that a Croatian fan group was involved in such a tragic, fatal incident.\"\nBad Blue Boys\nA tragedy that never should have happened. The 200-some members of the \"Bad Blue Boys\" (BBB) ultras, supporters of the perennial Croatian champions, should not have been allowed to enter Greece in the first place. Guest fans were barred from entering the stadium for the match. Around 100 Croatians were arrested shortly after the incident.\n\"It was quite clear to me that something was amiss. The Bad Blue Boys have a code of honor that strictly prohibits the carrying of cold weapons [knives etc. as opposed to firearms],\" Vukusic said.\nThe Greek authorities found nothing to incriminate any of the Croatian ultras, including the five main suspects. All had been released by December 2023. A perpetrator has yet to be identified.\nMichalis' death came as a shock to the entire European football community. Aleksandar Ceferin, the president of European football's governing body, UEFA, declared that \"the cancer\" of hooliganism must be tackled.\n\"The problem is not just a Greek one, but a European one, the Slovenian told a joint press conference with the Greek prime minister.\nA European problem\nNews of Katsouris' death also made waves in Croatia. Although few official details about the status of the investigation were made public in the first few days, according to Vukusic, many Croatian media were biased in the reporting about the fans.\n\"We have brutal clashes practically every weekend somewhere in Europe, often with even more tragic consequences,\" he said. \"But this was presented as if it was an exclusively Croatian problem.\"\nAs Vukusic went on to explain, violence is part and parcel of the ultras' subculture. It has its rules and certain rituals – and these hardly differ, regardless of whether it is the Balkans or Western Europe.\nCroatian ultras, though, have a particularly bad reputation – for allegedly being right-wing extremists. This has been fostered by a number of incidents in recent years.\nAfter Croatian fans attracted attention with racist chants at a European Championship qualifier in Norway in March 2015, UEFA ordered that Croatia play their next match against Italy behind closed doors in Split. The night before the match, unknown persons used a chemical substance to burn a huge swastika into the pitch. This resulted in UEFA docking Croatia a point in their qualifying group, imposing a €100,000 ($107,000) fine of the FA and ordering the national team to play a further two matches behind closed doors.\nThe Bad Blue Boys, who are among the most notorious ultras in Europe, marched through Milan city center in 2022 prior to Dinamo's Champions League against AC Milan. They had their right arms raised in the fascist Ustasha salute, which is identical to the Nazi salute.\nAt a Croatian first division match between NK Rudes and Hajduk Split in the summer of 2023, a Nazi-era German imperial flag emblazoned with the number \"88\" was displayed. The 8 represents \"h,\" the eighth letter of the alphabet The \"88\" therefore stands for \"HH\", an abbreviation of the Nazi greeting \"Heil Hitler,\" the utterance of which is a punishable offense in Germany.\nDinamo supporters have a particular enmity with Hajduk Spilt, Croatia's other top club. There are frequent clashes between the BBB and the Torcida ultra group, which supports Hajduk. However, such incidents are unlikely to occur during EURO 2024 in Germany, as the Torcida supporters don't tend to support the national team.\n'Hardly any communication between fans, clubs and police'\nDespite the incidents that have occurred in the past, Aleksandar Holiga editor-in-chief of sports website Telesport, says it would be a mistake to paint all Croatian fans with the same brush.\n\"Such symbols and scandals happen in various countries, and in various contexts,\" Holiga told DW.\n\"They do have a political dimension; they do happen in public after all. However, they are mostly infantile, tasteless, completely out of place provocations.\"\nFan groups, Holiga added, are not a homogeneous group, neither politically nor in terms of other attitudes – but rather come from a cross-section of society at large.\nThat fateful night in Athens could also have been a turning point in Croatian football. In the aftermath of the tragedy, the Croatian government promised swift action, with much talk of new fan projects, educational measures, and increased prevention work.\nHowever, according to Vukusic, very little has actually been done.\n\"Above all, there is a lack of dialogue,\" he said.\n\"There is hardly any communication between fans, clubs and police in Croatia. Many problems could have been avoided in the past if they had sat down together in advance and discussed the procedures on match day. The Bundesliga has fan representatives. That would be a good thing (to have here).\"\nPositive developments\nVukusic also noted that there is a distinct lack of trust in state institutions. This, he said, was at least in part because the police often react to trouble disproportionately, thus encouraging violent reactions from the ultras – something that they should seek to avoid.\n\"There are possible solutions. First, we need a modern fan law. This should include a clearly defined requirement for the police to act proportionately,\" Vukusic said.\n\"We need to understand what a football match is, and what rules of conduct apply. Football is not theater. Football is a ritual.\"\nVukusic is critical of the Croatian media for tending to focus on everything that is wrong in Croatian football, while largely ignoring the positives.\nSuch positives include the fact that for the first time in years, there was actually a battle for the league title that went quite deep into the season. The authorities are also taking action to tackle criminal and mafia-like structures in the game. Not only is attendance up, but new stadiums are being built.\nThe influence of the fans of the big clubs is also on the rise. For the first time, the members of Dinamo Zagreb were given a vote to elect the club's president. This had already been the case at Hajduk Split for many years.\n\"Co-determination is important because it automatically improves the dialog with a club's management,\" Vukusic said.\n\"It becomes much more constructive; it's moving in the right direction.\"\nHowever, what still needs to happen is for concrete measures to be put in place to ensure that there will be no repeat of what happened in Athens last year.\nThis article was originally published in German.",
  "word_count": 1208,
  "scraped_at": "2026-02-14T02:25:33.960933",
  "_text_extracted": true
}