{
  "article_id": "19b21cdb0802",
  "url": "https://www.thenationalnews.com/news/us/2025/12/21/syria-strikes-us-rand-paul/",
  "title": "US has  no reason to be in Syria , Republican Senator Rand Paul says",
  "date": "20251221T194500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Republican Senator Rand Paul, making an appearance on the Sunday morning US political talk show circuit, has said that although “it's hard not to hit back” in Syria after the killings of three Americans, he wants the US to end its presence in the country.\n“There's no reason for us to be in Syria. We need to leave Syria and not be a tripwire to getting back involved in another war,” Mr Paul said during an interview on ABC's This Week.\nHe told This Week host Jonathan Karl that at most, the US has approximately 1,500 troops in Syria, and that they continue to be treated as target for nefarious groups.\n“Unfortunately in the Middle East they like nothing more than to kill an American. They do it for the celebrity nature of killing Americans,” Mr Paul said.\nHe usually pushes what many would consider a dovish approach to US military intervention, especially by Republican standards of the past few decades.\nOvernight on Friday, US and Jordanian forces launched an operation against ISIS in Syria, killing at least five members of the extremist group, including a cell leader. The strikes were a response to an attack in Palmyra last week in which three American personnel were killed, the Centcom and Pentagon chief Pete Hegseth said.\nMr Hegseth said in a post on social media that the attack – called Operation Hawkeye Strike – was an attempt to eliminate ISIS fighters, infrastructure and weapons sites.\n“This is not the beginning of a war – it is a declaration of vengeance,” he wrote. “The United States of America, under President [Donald] Trump’s leadership, will never hesitate and never relent to defend our people.”\nUS Central Command said US and Jordanian forces struck ISIS more than 70 times. The operation employed more than 100 precision munitions against known ISIS-affiliated sites, it said.\nUS-Venezuela tensions\nUS tensions with Venezuela also loomed large on Sunday's network and cable news shows, a day after the US said it had “apprehended” an oil tanker off the coast of Venezuela on Saturday, in a move Venezuela has described as “theft and kidnapping”.\nIt is the second time in two weeks that the US has intercepted a tanker in the region, and comes days after Mr Trump announced a blockade of “sanctioned oil vessels” heading to and leaving Venezuela.\nThe US has for months been building a major military force in the Caribbean with the stated goal of fighting Latin American drug trafficking, but taking aim at Venezuela.\nDemocratic Senator Tim Kaine told NBC's Meet the Press that he was frustrated with the Trump White House's approach. “We should be using sanctions and other tools at our disposal to punish this dictator who is violating the human rights of his civilians and has run the Venezuelan economy into the ground,” he said, referring to President Nicolas Maduro.\nCalling the country “bad news” and accusing Venezuela of “flooding the US with cocaine”, Republican Senator Lindsey Graham gave a strident defence of the White House's recent actions. “President Trump promised to secure our nation from the scourge of narco drug trafficking and the kingpin in our backyard is Maduro in Venezuela,” he said.\nOn ABC, Republican Mr Paul said he was not pleased with Mr Trump's decision to increase tension and not rule out military actions in Venezuela. “I'm not for any of this,” he said.",
  "word_count": 565,
  "scraped_at": "2026-02-14T02:12:17.557011",
  "_text_extracted": true
}