{
  "article_id": "1a0a6142c9d5",
  "url": "https://www.caughtoffside.com/2026/02/02/sandro-tonali-transfer-arsenal/",
  "title": "Sandro Tonali transfer : Agent on Arsenal links",
  "date": "20260202T213000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sandro Tonali’s agent has spoken out on the transfer rumours circulating about his client today as Arsenal and Chelsea are both linked with the Newcastle midfielder.\nTonali has shone during his time at St James’ Park and links with bigger clubs won’t come as too much of a surprise, though Arsenal’s interest did come slightly out of the blue earlier today.\nThe Italy international’s agent Beppe Riso has now addressed the speculation, denying any talks with Arsenal so far.\nThe Gunners could do with adding more depth to their midfield, and Tonali is the calibre of player who could surely challenge for a place in Mikel Arteta’s side.\nSandro Tonali transfer situation explained\nStill, for now it seems like the Arsenal links have been over-egged slightly, with the player’s agent playing the stories down.\nRiso did suggest, however, that this could be something he and his client look at in March.\n“I read it, but Newcastle won’t let Sandro leave in January, and we never talked to Arsenal about this,” Riso said, as quoted by Football Italia.\n“We will evaluate in March whether Newcastle are open to anything, but right now he is playing in the Champions League, it is not the right moment to talk about it.”\nChelsea rival Arsenal for Sandro Tonali transfer\nMeanwhile, Chelsea are now also being linked with Tonali by the Sun, who also mention Manchester City manager Pep Guardiola as being an admirer of the 25-year-old.\nIt will be interesting to see how this pans out, but Tonali may well find it easier to get more playing time at Chelsea or City than at Arsenal.\nArteta already has Declan Rice and Martin Zubimendi, whereas Tonali could be an upgrade on the inconsistent Enzo Fernandez at Stamford Bridge, or the ageing and injury-prone Rodri at the Etihad Stadium.",
  "word_count": 303,
  "scraped_at": "2026-02-14T01:59:36.849145",
  "_text_extracted": true
}