{
  "article_id": "1a19915823c9",
  "url": "https://pressgazette.co.uk/news/news-diary-8-14-april-alan-bates-at-post-office-inquiry-us-solar-eclipse-olivier-awards/",
  "title": "News diary 8 - 14 April : Alan Bates at Post Office inquiry , US solar eclipse , Olivier Awards",
  "date": "20240405T143000Z",
  "domain": "pressgazette.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A look ahead at the key events leading the news agenda next week, from the team at Foresight News.\nLeading the week\nThis week’s row over Scotland’s new hate crime laws may be replaced by a new front in the transgender debate next week as the final report from Dr Hilary Cass’ review into NHS gender identity services is published on Wednesday (April 10). Cass’ March 2022 interim report called for a ‘fundamentally different’ model of care for children with gender dysphoria, and its criticisms of the existing NHS services contributed to the closure of the Tavistock clinic last week and NHS England’s eventual decision to stop prescribing puberty blockers to under-18s. Activists and politicians on both sides of the debate claimed the interim report was in their favour: trans charity Mermaids hailed the call for reduced waiting times and a higher standard of care, while opponents seized on gaps in evidence and a subsequent NHS consultation which said most pre-pubescent cases of gender incongruence don’t persist into adolescence.\nOf particular interest this time around may be the review’s exploration of the reasons behind a huge jump in referrals over the last decade, including a disproportionate number of teenage girls and children who have autism or other types of neurodiversity. While the wide-ranging review is nearly four years in the making and is expected to contain a host of recommendations for service reform, the political and media focus on transgender issues means it’s also likely to be used as a springboard for more questions on policies for schools and single-sex spaces, regardless of any nuanced findings on NHS clinical models.\nThe penultimate phase of the Post Office Horizon IT inquiry begins on Tuesday (April 9) with a day of evidence from Alan Bates. The Justice for Subpostmasters Alliance founder’s story was told earlier this year in an ITV drama which exposed the victims’ story to a wider audience and sparked a fresh wave of outrage over the treatment of innocent subpostmasters by those at the top of the Post Office. His evidence to this stage of the inquiry, which covers governance, redress and the response to the scandal, kicks off a three-month period in which some of the most prominent figures from Post Office management, Fujitsu, government and the civil service will be questioned.\nAppearances by Paula Vennells next month and Fujitsu engineer Gareth Jenkins in June are likely to be among the most closely-watched, and the revelation this week about the former CEO’s potential knowledge of a ‘covert operations’ team will surely be high on the list of topics put to Bates next week. Business and Trade Committee chair Liam Byrne has separately promised to explore all available options for sanctions against Vennells when Parliament returns later this month.\nThe restoration of the Stormont Executive earlier this year has paved the way for the return of a key intergovernmental institution on Monday (April 8), as the North-South Ministerial Council meets for the first time since July 2021, when the DUP began a boycott in protest at the Northern Ireland Protocol. The council was established under the Good Friday Agreement to provide a platform for cooperation between ministers from Belfast and Dublin, and next week’s meeting is expected to focus on economics and plans for more regular sectoral-level meetings that have been on hold for the past two years.\nIt’s also expected to be the final official engagement for Leo Varadkar before he’s replaced as Taoiseach by Simon Harris on Tuesday (April 9) following his surprise resignation last month. Preparations for the gathering have been overshadowed somewhat by the arrest of former DUP leader Jeffrey Donaldson, though participants on all sides have been quick to stress the stability of the recently-returned institutions.\nLooking abroad\nEyes are on the skies in North America on Monday (April 8) as a total solar eclipse passes above parts of the continent, creating night-like darkness in localised areas for a few minutes as the Moon travels between the Sun and Earth at just the right plane. The Moon will become a black sphere ringed by the sun’s corona, and stargazers may be able to see Venus and Jupiter as well as the 12P/Pons-Brooks ‘devil’ comet in the dark sky. Those looking at the ground while they prep their solar glasses or homemade eclipse viewer may see eerie shadow bands form and animals and plants act abnormally.\nAlthough the last total solar eclipse in the US was in 2017, this year’s is especially rare due to its 115 mile-wide coverage. The Great North American Eclipse will begin on Mexico’s Pacific coast just after 11am PDT, and continue across 13 US states from Texas to Maine before entering southeastern Canada. Around 31 million people live within the path of totality, with another four million estimated to be travelling from across the US. Anyone who misses out this time – which no longer includes locked-down prisoners in New York following a settlement yesterday – will have to wait until 2044 for another opportunity, sparking the current tourism boom set to generate upward of $1 billion in revenue. It’s even worse in the UK – a full eclipse isn’t due here until September 2090. But if the skies are clear, lucky viewers in northern Scotland and parts of Ireland can catch the tail-end of the eclipse around 8pm, with a tiny sliver visible as far south as Manchester and Liverpool.\nThe conflict in Gaza is back before the International Court of Justice in the Hague next week, where arguments are scheduled on Monday and Tuesday (April 8-9) in a case brought by Nicaragua against Germany. Nicaragua claims Germany’s military aid to Israel and decision to stop funding UNRWA following Israeli accusations that a handful of workers at the organisation had been involved in the Hamas attack last October amount to participation in ‘the ongoing plausible genocide and serious breaches of international humanitarian law’ in Gaza. Like in South Africa’s case against Israel, next week’s proceedings don’t concern the actual merits of the claim, but Nicaragua’s request for provisional measures, in this case the immediate suspension of military assistance to Israel and resumption of UNRWA funding.\nSouth Koreans head to the polls on Wednesday (April 10) to vote in parliamentary elections that many see as a mid-term referendum on President Yoon Suk Yeol and his conservative People Power Party, which does not currently control the National Assembly. Barring a significant shift in polls, the PPP appears set to lose out again to the main opposition Democratic Party (DP). Voter dissatisfaction with mainstream politics appears to be behind a surge in support for the newly-created Rebuilding Korea party led by Cho Kuk, a minister under former President Moon Jae-in (DP) who is currently appealing a two-year prison sentence over a 2019 scandal investigated by Yoon back when he was a prosecutor. For Yoon, Wednesday’s elections may well define the last three years of his presidency, especially if opposition parties achieve a super majority allowing them to override his vetoes or even impeach him.\nAlso look out for:\nApril 8\n- Trial of Constance Marten and Mark Gordon resumes\n- Sentencing for men guilty of murdering footballer Cody Fisher\n- Sentencing for actor Jonathan Majors on assault charges\n- Josep Borrell press conference on Red Sea maritime security\n- New social security and pension rates take effect\n- Euro 2024 pre-tournament workshop\nApril 9\n- Wes Streeting speech to UNISON Health conference\n- Judgments in three ECHR climate change cases\n- Sentencing for NHS worker who poisoned young boy\n- Sentencing for parents of US school shooter Ethan Crumbley\n- Sweden hosts Nordic and Baltic foreign ministers\n- Arsenal and Manchester City play UEFA Champions League quarter-final first legs\n- Eid al-Fitr\nApril 10\n- European Parliament votes on Migration and Asylum Pact\n- COVID-19 Inquiry Module 3 preliminary hearing\n- Inquest opens into death of student linked to laughing gas\n- Sentencing for father guilty of killing five-week-old baby\n- Alejandro Mayorkas impeachment articles delivered to the US Senate\n- WTO publishes global trade forecast\nApril 11\n- Inquest hearing into death of Brianna Ghey\n- New minimum income required for UK family visas\n- Fumio Kishida addresses US Congress\n- Kristalina Georgieva Spring meetings ‘curtain-raiser’ speech\n- European Central Bank interest rate decision\n- Lithuania hosts Three Seas Initiative summit\n- UEFA Europa League and Conference League quarter-final first legs\n- The Masters begins at Augusta\nApril 12\n- UK GDP monthly estimate\n- Sentencing for men guilty of Euston funeral drive-by shooting\n- Results deadline in Nottingham Forest PSR appeal\n- Court hearing in Shell appeal against Dutch climate judgment\n- George and Amal Clooney address Skoll World Forum in Oxford\n- Coachella weekend one begins\nApril 13\n- The Grand National\n- Take That tour begins\nApril 14\n- Olivier Awards\n- Football League Awards\n- The Masters final round\nStatistics, reports and results:\nApril 8\n- ONS non-financial business economy\n- OECD consumer price indices\n- IHS Markit/REC Report on Jobs\nApril 9\n- BRC Retail Sales Monitor\n- WHO Global Hepatitis report\nApril 10\n- US consumer price index\n- PAMCo audience measurement figures\n- OMFIF Gender Balance Index\n- Italy economic and financial report due\n- Results from: Tesco\nApril 11\n- NHS England key services performance data and A&E indicators\n- OECD Official Development Assistance (ODA) figures\n- China consumer price index\n- OPEC monthly oil markets report\n- Results from: Fast Retailing\nApril 12\n- UK Index of Production\n- UK construction industry output\n- UK overseas trade\n- NOAA monthly global climate report\n- IEA monthly oil market report\n- Results from: JP Morgan, Citigroup, Wells Fargo, TATA Consultancy\nAnniversaries and awareness days:\nApril 8\nApril 9\n- Three years ago: The Duke of Edinburgh died\nApril 10\n- Siblings Day\n- World Homeopathy Awareness Week (to April 16)\n- 26 years ago: Good Friday (Belfast) Agreement signed\nApril 11\n- World Parkinson’s Day\n- Five years ago: Julian Assange arrested\n- Five years ago: Sudanese president Omar al-Bashir ousted\nApril 12\n- International Day for Street Children\nApril 13\n- Scrabble Day\nApril 14\n- World Chagas Disease Day\n- 10 years ago: mass kidnapping of Nigerian schoolgirls\nThe news diary is provided in association with Foresight News.\nEmail pged@pressgazette.co.uk to point out mistakes, provide story tips or send in a letter for publication on our \"Letters Page\" blog",
  "word_count": 1738,
  "scraped_at": "2026-02-14T02:10:47.908115",
  "_text_extracted": true
}