{
  "article_id": "1a1f38818c8f",
  "url": "https://www.myjoyonline.com/toughest-season-ive-had-as-manager-by-a-mile-slot/",
  "title": "Toughest season Ive had as manager  by a mile  - Slot",
  "date": "20260211T053000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nLiverpool boss Arne Slot says this season is the toughest he has had as a manager \"by a mile\" and his side are \"not performing to Liverpool's standards\".\nDefeat by Manchester City on Sunday leaves the Premier League champions sixth in the table - four points behind fifth-placed Chelsea.\nLiverpool are level on points with seventh-placed Brentford and would have dropped below the Bees on goal difference had Rayan Cherki's late third goal for City not been disallowed.\nSlot replaced Jurgen Klopp as Reds boss in June 2024 and led the club to a record-equalling 20th top-flight title in his first season in charge.\nHowever, they have struggled this term despite spending almost £450m on new signings in the summer, including a British record £125m for Alexander Isak.\nLiverpool have won 11, drawn six and lost eight games in the league so far in 2025-26.\nAsked by BBC Sport whether this was the toughest season he has had, Slot said: \"By a mile. All the other seasons I have managed, there was only positives.\n\"I don't think I have ever lost two games in a row [until now]. It's an exception for me, I am not used to it.\n\"I don't think we feel we've only lost two of our last 17. A draw feels like a loss.\n\"The players know what the standards of Liverpool mean and we aren't performing to those standards. They feel that disappointment.\"\nThe likelihood is five Premier League teams, rather than the usual four, will qualify for next season's Champions League.\nLast month, Slot said Liverpool would have an acceptable season if they \"improve in one box\" - but could have a special campaign if they \"improve in both boxes\".\nHowever, on Tuesday the Dutchman suggested his side will have to be \"close to perfection\" to secure Champions League football next season - and he is aware of the impact of missing out.\n\"If we don't have Champions League football [next season], it's definitely not been an acceptable season,\" former Feyenoord boss Slot added.\n\"When I arrived here and only signed Federico Chiesa, it was after a Europa League season.\n\"That does have an enormous impact on the way this club is run. I am completely aware of that.\"\nLiverpool travel to face Sunderland - who are unbeaten at home - on Wednesday at 20:15 GMT.\nSlot may be struggling for right-back options at the Stadium of Light, with Dominik Szoboszlai - who has been filling in at full-back - suspended after his late red card against Manchester City.\nConor Bradley is out for the rest of the season, Jeremie Frimpong has not featured since injuring his groin against Qarabag and Joe Gomez has been out with a knock.\nStriker Isak and centre-half Giovanni Leoni are also long-term absentees.\n\"It's different to lead the team after a loss or multiple losses and draws than a win but I don't think anybody in this building thinks I've completely changed,\" Slot added.\n\"There's still a possibility where we can do something special this season.\"\nHonesty & belief on show from defiant Slot - analysis\nThis was a news conference where Slot mentioned the \"setbacks\", \"hits\" and \"bad luck\" his side have faced this season.\nThere have been plenty of reasons, from long-term absentees to late goals to the time it has taken their new signings to adapt to life in the Premier League.\n\"Even if we sign a player [Jeremy Jacquet]) and he's not even playing for us he gets injured,\" Slot said, after Jacquet, who will join Liverpool for £60m in the summer, sustained a shoulder injury at the weekend while playing for Rennes.\nYet Slot stressed Liverpool's focus must remain on improving their performances, even if at times it feels like he has \"tried many different things\".\n\"The question is are we unlucky or is it part of who we are? That is something we can only find out in the upcoming three to four months,\" Slot said.\nIt did not feel as if he was making excuses - rather, Slot was refreshingly honest about the range of challenges his side have faced and admitting their flaws.\nThere was a little smile when he admitted this is the toughest season he has had in his career. Within that, a glimpse too into how challenging everything has been for him at one of the biggest clubs in the world.\nDefeat at Sunderland on Wednesday will only amplify the pressure on the Dutchman. Like he said, it would not be acceptable for Liverpool to miss out on the Champions League.\nBut there was a sense of defiance and belief too within Slot, who still believes Liverpool can do \"special\" things this season.\nIf not, then the voices around his future at the club will only grow.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n1 minute -\nAquafresh donates to National Chief Imam ahead of Ramadan\n26 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n28 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n2 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 1027,
  "scraped_at": "2026-02-14T01:53:15.562341",
  "_text_extracted": true
}