{
  "article_id": "1a437504220d",
  "url": "https://www.yahoo.com/now/pep-guardiola-happy-money-bank-132709060.html",
  "title": "Pep Guardiola happy to have  money in the bank  after Joao Cancelo departure from Man City",
  "date": "20230203T144500Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola happy to have ‘money in the bank’ after Joao Cancelo departure from Man City\nPep Guardiola defended his decision to let Joao Cancelo leave Manchester City for the rest of the season and said he would rather bank the money than be criticised for wasting huge amounts on a replacement now.\nGuardiola described the Portugal full-back as an “incredible” player in City’s last two Premier League-winning campaigns but nevertheless allowed him to join Bayern Munich on loan and without bringing anyone in.\nCity’s defensive resources were further depleted when John Stones was ruled out for up to a month with a hamstring injury, meaning he will miss Sunday’s game against Tottenham, the top-of-the-table clash with Arsenal and the first leg of their Champions League tie with RB Leipzig.\nGuardiola said Cancelo, who lost his place after the World Cup and did not even get off the bench in City’s last three games, was desperate to play but did not guarantee the former Juventus footballer will be part of his plans for next year.\n“First I wish him the best for the rest of the season,” he said. “Next season I don’t know what will happen. He has been an incredible figure in the last two Premier Leagues we won. After the World Cup, we made a pre-season and started to play in a different way in some patterns. I liked what I watched and I decided to give more time to players who I saw on the pitch who liked it.\n“Everyone has their own personality and he loves to play and is one of the players who trains the best. In this situation he didn’t play much in the last two or three games. We cannot say he didn’t play much because in the last years he was one of the players with the most minutes by far. He is a guy who needs to play to be happy and we decided together, all three parts, to let him go to Munich. He wants to play every single game and hopefully that can happen in Munich.\n“Bayern Munich wanted him because he’s beyond an exceptional player. I won’t say one bad word about him. I think his work ethic, love for football, passion, his quality and skills… what can I say? Everyone knows it.”\nCity sold left-back Oleksandr Zinchenko to Arsenal in the summer and have now lost Cancelo but Guardiola feels he has enough cover in the position with Nathan Ake, Rico Lewis, Aymeric Laporte and Sergio Gomez.\nHe said: “It happened one or two days before the transfer window - really pleased with the squad I have as always. Being not sure what to do, it’s better to have the money in the bank and not to be criticised for spending more.”\nGuardiola and director of football Txiki Begiristain had a discussion about whether to go into the transfer market.\nBut the manager added: “We talked. But, I said to Txiki, we could have gone and paid a huge amount of money, [instead] we’ll wait four months and we can do it. Next season we will see.”",
  "word_count": 522,
  "scraped_at": "2026-02-14T01:59:41.723800",
  "_text_extracted": true
}