{
  "article_id": "1a4691d67559",
  "url": "https://metro.co.uk/2025/04/12/la-ligas-response-real-madrids-special-request-ahead-arsenal-game-revealed-22896965/",
  "title": "La Liga response to Real Madrid special request ahead of Arsenal game revealed",
  "date": "20250412T110000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid made a request to get this weekend’s game against Alaves moved to allow them more rest ahead of their Champions League clash against Arsenal.\nThe reigning European champions are slated to play on Sunday, three days before they will attempt to stage another miraculous European comeback at the Bernabeu.\nAccording to Cadena SER, Real made their plea after La Liga had publicly released the schedule on March 20 bit it fell on deaf ears.\n‘As you well know, this match is strategically located between the two matches we will play against Arsenal in the Champions League quarter finals, on Tuesday, April 8 in London and Wednesday, April 16 in Madrid,’ read an email sent to La Liga, obtained by the Spanish radio station.\n‘Moving the match against Deportivo Alavés to Saturday, April 12 would allow us more time to adequately prepare for both that match and the decisive match on Wednesday, April 16 at the Santiago Bernabeu.\n‘We are convinced that our request is entirely reasonable and we trust that it can be met.’\nReal made contact with Alaves before submitting their request to bring the game forward by 24 hours and although their opponents were happy to accommodate them, Carlo Ancelotti’s side has been ordered to play the game as scheduled tomorrow.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nLos Merengues could well have done with an extra 24 hours to prepare given they are 3-0 down in the tie following a disastrous first leg at the Emirates Stadium and have several injury concerns ahead of the return fixture.\nArsenal, meanwhile, host Brenftord this afternoon still on a high from one of the most impressive results in their European history.\n‘Great, it’s been an unbelievable energy, it was a very special night,’ said Mikel Arteta when asked how his squad as reacted to a famous win.\n‘That’s over, and now the full focus is on Brentford, because it’s a game that is going to require the best of us.’\nHe added: Just one [day off]. I think they were very happy with that. Sometimes after winning you want to spend the next day in and around the team because you want to share that feeling.\nMore Trending\n‘But we had a day off because it was the best way to recover and prepare for the game against Brentford.\n‘It’s not about bringing them back. It’s now maintaining that energy and that momentum and using it towards Brentford and the very difficult game that we’re going to face against a team that, when you look at what they’ve done, it’s just incredible. It’s remarkable.\n‘It’s a beautiful story and they have earned it in the way they work, in the way they organise, in the way they believe, in the way they play. So big credit to them, it’s going to be a really tough test for us.’\nMORE: Alan Shearer’s Premier League predictions including Newcastle vs Man Utd\nMORE: Arsenal vs Brentford: Confirmed team news, predicted lineup and injuries\nMORE: Paul Merson names three Arsenal players Mikel Arteta must rest against Brentford",
  "word_count": 562,
  "scraped_at": "2026-02-14T02:02:35.582700",
  "_text_extracted": true
}