{
  "article_id": "1a4b71ed6edb",
  "url": "https://thepeoplesperson.com/2025/09/02/rasmus-hojlund-was-heartbroken-at-being-pushed-out-298455/",
  "title": "Rasmus Hojlund was heartbroken at being pushed out - Man United News And Transfer News",
  "date": "20250902T184500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United decided to address their lack of goals last season by signing Benjamin Sesko from RB Leipzig this summer.\nAs a result, Rasmus Hojlund was forced out, and he ended up joining Napoli on an initial loan, with the Serie A champions obligated to buy him should they qualify for the Champions League.\nAs per The Athletic, the Dane was heartbroken to leave his favourite club and he made it clear to all his teammates and staff that he was being forced out even though he wanted to stay.\nHe had made his point clear during pre-season, but after scoring a meagre four goals in the Premier League last term, it was inevitable that INEOS would try and find a more reliable option up front.\nHojlund was heartbroken\n“Hojlund was said to be heartbroken over the realisation his Old Trafford dream was over aged 22, especially when he started pre-season expecting to continue.\n“The episode demonstrates how Ratcliffe, Berrada, Wilcox and Amorim are operating without sentiment. That tension existed until the final weekend of the window, with Hojlund making sure people knew he was leaving against his instincts.”\nPart of the reason why the Denmark international was so upset was because he felt he was better than new signing Sesko.\nAnd the 22-year-old felt he could prove that to the head coach with his work on the training ground. However, INEOS did not want to offer a long rope to a player from the previous regime and thus, it all came to an end this summer.\n“Part of Hojlund’s motivation, it can be revealed, was that he considers himself better than the centre-forward United have agreed to pay €85million for.\n“He felt showing that in sessions might give Amorim pause for thought on his departure, despite Sesko’s arrival.\nFelt he was better than Sesko\n“But the decision had been made because Hojlund had suffered badly in front of goal during the last campaign — scoring 10 goals in 52 games but only four of those in the Premier League.\n“Hojlund represented the past in the eyes of the football leaders; a player who United overpaid for. Hojlund was tarred by being bought by previous recruitment staff in a way that Joshua Zirkzee, signed last summer, was not.”\nHis professionalism was appreciated behind-the-scenes, especially when one considers the way the rest of the bomb squad members have gone about trying to leave the club.\nHowever, it was clear that Rasmus Hojlund was not up to the standards required at Old Trafford, and now, hopefully, he can shine back in Italy, a league more suited to his strengths.\nFeature image Matt McNulty via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 449,
  "scraped_at": "2026-02-14T01:52:36.760786",
  "_text_extracted": true
}