{
  "article_id": "1a4f4311c311",
  "url": "https://www.fourfourtwo.com/features/nottingham-forest-vs-leicester-city-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match",
  "title": "Nottingham Forest vs Leicester City live stream , match preview , team news and kick - off time for this Premier League match",
  "date": "20230113T163000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNottingham Forest vs Leicester City live stream and match preview, Tuesday 3 January, 7.45pm GMT\nNottingham Forest vs Leicester City live stream and match preview\nLooking for a Nottingham Forest vs Leicester City live stream? We've got you covered. Nottingham Forest vs Leicester City is not being shown in the UK. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nForest booked their place in the semi-finals of the EFL Cup on Wednesday, and they have also boosted their Premier League survival chances in recent weeks.\nSteve Cooper's side head into this East Midlands derby two points above the bottom three.\nLeicester are above Forest in the table but the rivals are level on points, with the Foxes not out of relegation trouble yet.\nKick-off is at 3pm GMT. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nForest are without Willy Boly, Jesse Lingard, Moussa Niakhate, Omar Richards, Giulian Biancone and Cheikhou Kouyate. Taiwo Awoniyi also misses out, but Neco Williams is among the substitutes after a knock.\nLeicester are unable to call upon the services of James Justin, Ricardo Pereira, Boubakary Soumare, Jonny Evans, James Maddison, Ryan Bertrand and Kiernan Dewsbury-Hall. Ayoze Perez also misses out, but Dennis Praet is on the bench after passing a late fitness test.\nNottingham Forest XI: Henderson; Aurier, Worrall, McKenna, Renan Lodi; Yates, Freuler, Mangala; Gustavo Scarpa; Johnson, Gibbs-White.\nLeicester City XI: Ward; Castagne, Amartey, Faes, Thomas; Ndidi, Mendy; Albrighton, Tielemans, Barnes; Vardy.\nForm\nForest have lost just one of their last five games in the Premier League, climbing outside the bottom three in the process.\nLeicester have lost four of their last five matches in all competitions - the exception was a slender and unconvincing 1-0 victory over Gillingham in the FA Cup.\nReferee\nPaul Tierney will be the referee for Nottingham Forest vs Leicester City.\nStadium\nNottingham Forest vs Leicester City will be played at the 30,445-capacity City Ground in Nottingham.\nKick-off and channel\nNottingham Forest vs Leicester City kick-off is at 3pm GMT on Saturday 14 January in the UK. The game is not being shown in the UK.\nIn the US, kick-off time is 10am ET / 7am PT. The match will be shown on NBC in the US. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and BT Sport are the two main players once again, but Amazon also have a slice of the pie in 2022/23.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing even more than the 175 games it aired last season. If you pick up a fuboTV subscription for the games not on Peacock Premium, you'll be able to watch every game.\n• Canada: The way to watch Premier League football in 2022/23 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season. Non-subscribers can access the action via a Fetch TV box and other friendly streaming devices.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nGreg Lea is a freelance football journalist who's filled in wherever FourFourTwo needs him since 2014. He became a Crystal Palace fan after watching a 1-0 loss to Port Vale in 1998, and once got on the scoresheet in a primary school game against Wilfried Zaha's Whitehorse Manor (an own goal in an 8-0 defeat).",
  "word_count": 919,
  "scraped_at": "2026-02-14T02:29:04.530370",
  "_text_extracted": true
}