{
  "article_id": "1ab331b9e274",
  "url": "https://www.fourfourtwo.com/news/thomas-tuchel-reveals-the-truth-behind-harry-kanes-substitution-during-real-madrid-clash-and-its-a-worry-for-euro-2024",
  "title": "Thomas Tuchel reveals the truth behind Harry Kane substitution during Real Madrid clash - and it a worry for Euro 2024",
  "date": "20240509T124500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thomas Tuchel reveals the truth behind Harry Kane's substitution during Real Madrid clash - and it's a worry for Euro 2024\nThe England captain was brought off after 85 minutes before Bayern Munich capitulated late on\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nBayern Munich manager Thomas Tuchel has detailed why he chose to substitute Harry Kane against Real Madrid in the UEFA Champions League.\nThe former Spurs forward was replaced by Eric Maxim Choupo-Moting with just five minutes left to go before Joselu struck twice to flip the scoreline on its head.\nBayern were also left bewildered after the offside flag was seemingly prematurely raised inside the dying minutes, as Noussair Mazraoui teed up Matthijs de Ligt, only for the goal to be controversially chalked off.\nWATCH | How Bayern Munich Secured Harry Kane Transfer From Tottenham Hotspur\nWith many fans bewildered given Kane's late withdrawal, Tuchel provided detailed reasoning for his substitution at the Santiago Bernabeu.\n\"Kane was having back problems. It was no longer possible,\" Tuchel told TNT Sports.\n\"We started with a front four and all four had to go out with injury or cramp. The front four all said they had to go.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"It hurts. It’ll take a while to recover, but on the one hand it’s a loss where we left it all out on the pitch.\n\"Of course, it’s tough to accept. It’s part of reality. No regrets. But on the other, there were too many injuries, a few too many substitutions, too many cramps.\"\nLeft to dissect the decision made by the former Chelsea boss in the aftermath, Owen Hargreaves couldn't believe that with just a few minutes to go in a tightly-contested affair, Kane was the player chosen to be sacrificed.\n\"I'll tell you what was unexpected, Harry Kane going off the pitch. That's one of the biggest subs I've ever seen in a game of football of that magnitude,\" he said.\n\"To take off a guy that's scored 44 goals, who is the most durable player pretty much anywhere and you bring on another striker in Choupo-Moting. Maybe he wanted height for corners, I don't know.\n\"You cannot take him off. There's five minutes left in the game, there's ten minutes of extra-time, 15 minutes. I said to Scholesy straight away, they're going to score.\"\nFormer Manchester United team-mate Paul Scholes also agreed with the opinions of Hargreaves, admitting he was left confused at the tactics deployed by Tuchel.\n\"I thought Tuchel’s substitutions were strange. Kane was strange. Even if they get one goal, there’s still extra-time, and penalties to come as well, you know how strong he is.\n\"Kim was the stranger one. I thought they looked quite comfortable in the game up until that point. They go to three at the back. Kim coming off last week was a disaster for him and again he looked a little bit all over the place.\"\nMore Bayern Munich stories\n‘I really might not be where I am today without that performance’: Harry Kane picks the games that changed his life\nManchester United: Thomas Tuchel ignites rumours over potential Premier League move\nThe Bayern Munich 2024/25 home kit has been revealed, but fans of the German side will HATE it\nMatthew Holt writes freelance for FourFourTwo, amongst others, and boasts previous experience at GOAL and SPORTBible. He now works with us alongside his time at Manchester United and Reach PLC, aiding with online content for the website. Career highs include working at the FA Cup final, as well as scoring at Old Trafford in front of the Stretford End. A long-term sufferer of his beloved Scunthorpe United, he is often seen on the padel court, as well as occasionally as a six-a-side call-up.",
  "word_count": 739,
  "scraped_at": "2026-02-14T01:54:40.193969",
  "_text_extracted": true
}