{
  "article_id": "1aeaa0c65d01",
  "url": "https://www.abc.net.au/news/2025-05-08/len-blavatnik-dazn-warner-foxtel-nrl-afl-soviet-oligarch/105253268",
  "title": "The  Netflix of Sport  just acquired AFL and NRL rights . Meet the curious billionaire behind it all",
  "date": "20250507T201500Z",
  "domain": "abc.net.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 'Netflix of Sport' just acquired AFL and NRL rights. Meet the curious billionaire behind it all\nThere's an unorthodox tour bus that used to wind its way through the streets of London, not to Big Ben or Buckingham Palace.\nInstead, it took passengers past some of the city's most expensive real estate, stopping at the complexes owned by oligarchs and billionaires.\nAt each stop, the tour guides would explain how the properties' landlords — often people listed among the top 100 richest people in the world — had made their fortunes.\nLondon's full of oligarchs, but in Kensington Palace Gardens, you'll find one of, if not the wealthiest of them all: Len Blavatnik.\n\"Number 15, that's his house,\" the guide says, gesturing toward a grand, gated estate.\n\"He doesn't like to be called an oligarch.\"\nAn 1850s mansion reportedly purchased for $415 million, it has 13 bedrooms, nine bathrooms, its own gym, wine cellar, cinema and a unique indoor-outdoor pool. The pool starts inside the house and flows into the garden like something out of a Bond villain's lair.\nHe once told a captivated audience at Harvard Medical School how Prince William — his neighbour from just across the street — liked to come over and borrow his tennis court from time to time.\nBlavatnik owns townhouses and villas all around the world — including his own hotel in Miami Beach and the French Riviera — which he can easily scoot off to aboard his Boeing 777 plane or his 74-metre yacht.\nHe's also the proud majority owner of Warner Music, a company that accounts for around one-sixth of recorded music sales worldwide.\nHe owns a number of different investments through his private company, Access Industries, including shares in LyondellBasell, a global chemical giant, Clal Industries, an Israeli company involved in tech and construction, and Opendoor, a house-flipping website.\nHe's also backed hit stage productions like Hamilton and award-winning films like The Zone of Interest.\nOver the past decade, Blavatnik has been working towards his dream of creating the \"Netflix of Sport\" through his sports streaming service, DAZN (pronounced \"Da-Zone\"). Today, it's becoming a major player in the global sports scene, with around 20 million paid subscribers and 300 million monthly users across more than 200 countries.\nDAZN promotes itself as both the \"undisputed home of boxing\" and the \"home of European football\", but, much like Blavatnik's appetite for real estate, two homes are never enough.\nOver the past five years, the platform has been on a mission to bring in more sports in more regions.\nIt secured international rights to major events and leagues, including the NFL (outside the US and China), FIBA Basketball World Cup, PGA Tour, LIV Golf, Rally TV and Formula 1.\nNow that Blavatnik is adding the broadcasting rights to the NRL and AFL through Foxtel — Australia's two most iconic homegrown sports — it raises the question: how do these fit into DAZN's bigger global game plan? Do they have a place in its push to become a go-to platform for international sports streaming? And what's next for Australia's most prized sports content?\nFor someone with such a vast global footprint, the man remains almost completely opaque. There are no official or authorised biographies and he's given virtually no in-depth interviews about himself. Instead, a handful of journalists over his decades-long career have tried to piece together his story, uncovering fragments of his life as they went.\nWhen Background Briefing put some questions to him, his answer came back on the letterhead of one of Australia's most well-known defamation lawyers.\nSo, how do you begin to decipher the enigma that is Sir Leonard Blavatnik?\nFirst, you need to understand how he climbed into the ranks of the world's 30-something richest people.\nBefore the first billion\nBlavatnik's yacht, the Odessa II, is named after his birthplace. Born in the ancient port city in Soviet Ukraine in 1957, he actually grew up in Yaroslavl, a historic city a few hours north of Moscow.\nHe went on to attend the Russian University of Transport. That's because Blavatnik wasn't able to get into the Moscow State University due to systemic antisemitism, according to Tim Dziadko, a former editor of Forbes Russia.\n\"Like many Jews in the Soviet Union, he had trouble getting into the main universities. Even if you are an excellent student, they could deny you,\" he told Background Briefing.\nBlavatnik emigrated to New York City when he was 21, where he got an IT job at Macy's department store and did a master's degree at Columbia. By 1986, he had become a naturalised US citizen with his own investment company, Access Industries, through which he would eventually make much of his fortune.\n\"Len was very much a man of the world, even back then,\" one long-standing business partner told the Financial Times.\n\"He had been educated in the US, he understood money and international finance as if it were second nature.\"\nThen, in the late 1980s, Blavatnik's life changed after he bumped into an old friend.\n\"One of my classmates [in Russia] kind of asked me to come back,\" he later told an audience at Harvard.\n\"I was in a good situation where I already had made some money and I had some time.\"\nThe Soviet Union was collapsing, state assets were being privatised and Blavatnik's former classmate, now fellow oligarch, Viktor Vekselberg, was reading the tea leaves: Russia was open for business and there was money to be made.\nIt was enough to draw Blavatnik back, although he's quick to clarify to the Harvard audience: \"I never moved back, I spent a few weeks, a month.\"\nBlavatnik and Vekselberg began capitalising on the privatisation of the aluminium business, buying smelters and acquiring assets that were being auctioned off.\nPlanting a stake in the early aluminium industry of post-Soviet Russia wasn't easy. It was hyper-competitive and, alongside businessmen like Blavatnik and his partners, it also attracted organised crime.\n\"You had people settling business disputes using bazookas, you know, in the middle of the city,\" ABC's former Moscow correspondent, Monica Attard, recalls of the time.\n\"There were murders left, right, and centre to settle business scores. You had buildings being firebombed, cars blowing up, so it was really the Wild West.\"\nThere is no suggestion Blavatnik was involved in these types of violent business practices. The businessmen emerged unscathed and with an impressive market share.\nViktor Vekselberg would later tell the Financial Times this was the period where Blavatnik made the bulk of his fortune.\n\"He made his money [in Russia], almost all his money here, and then just made investments outside,\" he explained. \"All his main money, he made here in Russia, with me.\"\nA spokesperson for Access Industries denied that claim.\n\"It's a fact Mr Blavatnik has made multiple fortunes over the course of his career and far more in the West than in Russia,\" they said, adding that the break-up of the Soviet Union created substantial wealth for \"scores of Western businessmen\".\n\"It was a risky time for investors, and at the same time, Western economists and governments supported the privatisation policies to end state control of assets and increase private ownership, thereby promoting capitalism and preventing the resurgence of communism,\" they said.\nIn any case, Vekselberg and Blavatnik built an empire together and eventually teamed up with a member of Boris Yeltsin's inner circle, Mikhail Fridman, to form Access, Alfa, Renova (AAR), each with an equal share in the company.\nIn 1997, they all got into the oil industry. The businessmen acquired a 40 per cent stake in the state-owned Tyumen Oil Company (TNK) in Siberia for a bargain price. The tender process was widely criticised and eventually, Russia's state auditor found that although AAR was the highest bidder, it paid far less for TNK than what it was worth.\nThat audit went on to say that government officials responsible for the TNK tender also violated Russian law: AAR should not have been given the contract as it was controlled by foreign legal entities.\nRussian analysts would later express concerns about how cosy things appeared between those designing the government tender and those who won it; some noted the tender conditions closely matched assets already controlled by AAR. Not long after the sale went through, the official in charge of the tender was hired as an executive for TNK.\nWithin six years, TNK was fully controlled by AAR and the company was valued at over $24 billion.\nBP bought into the company, and together they formed TNK-BP. The merger created one of Russia's largest oil producers and turned Blavatnik and his associates into very wealthy men.\n\"They were heroes for us,\" recalls Maxim Barskiy, the former CEO of TNK-BP. \"The guys who made billions from nothing.\"\nMaxim remembers Blavatnik as charming, polite and easygoing. A consummate professional with deep strategic connections in the West. \"Very thorough, very detail-oriented, no emotions.\"\nHe rarely saw Blavatnik around the TNK-BP offices. \"He would just come to board meetings [from abroad],\" Barskiy says, \"to collect his dividends.\"\nThe corporate conflict\nPost-Soviet optimism began to fade in the 2000s as Vladimir Putin rose to power and relations between Russia and the West grew increasingly tense.\nThe merger between TNK and BP, once hailed as a landmark partnership, also began to fray. Instead of collaboration, the two sides found themselves locked in a battle for control of the company. The British and Russian sides of the business became very hostile.\nOn March 19, 2008, Russian security services raided TNK-BP's offices.\nIlya Zaslavskiy was a TNK-BP employee who was detained around this time. He believes that his detention was connected to the probe Russia's Federal Security Service was conducting into the company.\n\"I was accused of being a spy,\" he claimed. \" I felt like it was absolutely unfair, a massive fabrication.\"\nIlya says he wasn't permitted to leave the country and he and his family were placed under surveillance and routinely had to appear in court for two years. Eventually, he was charged with corporate espionage.\nHe believes his detention was directly tied to what he describes as a coordinated campaign of harassment by the Russian government, part of a broader effort to intimidate the British side of the TNK-BP joint venture.\n\"They were attacking the company on multiple fronts. Back tax claims, labour inspections, environmental claims, apparently wrong salaries and wrong visas for Brits and Americans,\" he said.\nBP executives alleged the Kremlin was waging an \"intolerable\" campaign of pressure against them. At the peak of hostilities, the CEO was managing the company from an undisclosed location, reportedly because he no longer felt safe — not even at BP's headquarters in London or in his own home.\nLeaked US embassy cables revealed that BP's own defence lawyer suspected the Kremlin was behind the attacks. That same lawyer also raised questions about whether the Kremlin was waging the campaign to benefit AAR, the consortium co-founded by Len Blavatnik and his business associates.\nHowever, other leaked US cables from the time speculate about a range of other possible explanations, including that the Kremlin was trying to drive down the share price for a Russian competitor or that the Russian government wanted to punish the British-owned company BP for political reasons.\nThey also note that Blavatnik had a limited operational role in the company and a seemingly good relationship with BP managers.\nA spokesperson from Access Industries said in a statement that neither he nor his company engaged \"the Russian government or Russian authorities to act on their behalf and did not engage in corruption with the Russian government or Russian authorities for their benefit\". AAR has also strenuously denied these allegations in the past.\nSeveral years later, in 2012, Russia's largest oil producer, Rosneft, struck a deal with TNK-BP to buy the company for $85 billion, the largest corporate transaction in Russian history. Blavatnik and his associates banked approximately $10 billion each.\nOnce you account for his aluminium endeavours too, Blavatnik walked away with an incredible fortune — likely the largest ever pulled out of Russia by any foreign investor.\nThe oligarch hunt\nOver the following decade, the global environment for businessmen in Russia changed dramatically. After Russia's annexation of Crimea in 2014 and its full-scale invasion of Ukraine in 2022, several of Blavatnik's former associates, including Mikhail Fridman and Viktor Vekselberg, were hit with Western sanctions.\nVekselberg's yacht, Tango, was seized and Fridman's London home was raided. Many of their global assets remain frozen.\nBlavatnik's neighbour, Roman Abramovich, was also targeted. He hasn't been able to return to his $180 million mansion in Kensington Palace Gardens — it's been closed off, even to cleaners.\nOther former associates of Blavatnik, such as Oleg Deripaska, Petyr Aven, and German Khan, were also sanctioned by Western governments.\nMany of the sanctions placed on his business associates — some of whom deny any links to the Russian president — were intended to prevent oligarchs from benefiting from their proximity to the Kremlin and to indirectly pressure the Russian government by targeting its influential supporters.\nIn December 2023, Ukrainian President Volodymyr Zelenskyy imposed sanctions on Blavatnik that aren't set to expire until 2033.\nBut his name has not appeared on any Western sanctions lists. During a debate in the House of Commons last October, the UK minister for state was asked by one of his own government's backbenchers about the department's assessment on sanctioning Blavatnik in light of Ukraine's sanctions. The minister declined to comment.\nA spokesperson for Access Industries said the Security Service of Ukraine has not explained why Blavatnik was sanctioned.\n\"Regarding the Ukrainian sanctions against Mr Blavatnik, they are not only unwarranted, but no rationale has ever been given for his sudden inclusion by the Ukrainian government,\" they explained.\nDavid Lingelbach is a professor of entrepreneurship and an oligarch researcher from the University of Baltimore. He says Blavatnik's perceived distance from Russia in his politics, business dealings and identity is important.\n\"The absence of proximity is what has made him less likely to be a target for sanctions,\" he said.\nBlavatnik holds dual US-UK citizenship and has never held Russian citizenship, having left the Soviet Union in 1978, before the Russian Federation became a state.\nBlavatnik says that he has entirely divested of any Russian assets and that he has never been close with Vladimir Putin.\nBlavatnik isn't a fan of being called an \"oligarch\".\n\"It is false, defamatory and malicious to label him an oligarch,\" an Access Industry spokesperson told the ABC, adding that they thought it falsely connected Blavatnik to the Russian regime.\nProfessor Lingelbach said the definition of \"oligarch\" was broader than that and could apply beyond Russia.\n\"Blavatnik is an oligarch. An oligarch is somebody who has significant wealth, or power, and uses one of those instruments to acquire the other. Blavatnik is clearly very wealthy and power-wise, his power is of the same general sort that Rupert Murdoch has. It's called agenda-setting power.\n\"He's maybe one of the most clever oligarchs of them all. He has a really strong indirect influence on a lot of people.\"\nDespite attempts to shed the label in the press, the moniker has stuck.\nGiveth and taketh away\nIn recent years, Blavatnik has forged a reputation as a philanthropist. However, his donations have in some cases courted controversy from critics who saw them as an exercise in reputation management.\nBy his own claims, Blavatnik has donated over $1 billion to charitable causes, especially in the arts, education and science.\nPrevious donations to Oxford raised controversy after critics penned an open letter urging the university to reconsider its acceptance, citing concerns with his political donations, relationships with now-sanctioned businessmen and the deals with Russian government corporations from which Blavatnik profited.\nFor his part, Blavatnik says his philanthropy is motivated by \"his belief that advancing innovation, discovery and creativity is key to improving the human condition.\"\nHe's funded everything from scholarship programs for IDF soldiers to awards ceremonies for science students. He's donated hundreds of millions of dollars to Yale, Harvard and Oxford universities, even setting up the $330m Blavatnik School of Government, which, amongst other classes, offers courses on public policy, cybersecurity and corruption.\nIn recognition of his extraordinary generosity, Queen Elizabeth awarded him a knighthood.\n\"I had a reunion of my [Russian] college friends,\" Blavatnik would later tell a room of scientists at Harvard.\n\"Nobody asked questions about business or anything, but they all wanted to know about the knighthood, about the queen.\"\nHis giving extends to politics as well. Blavatnik has contributed to Rishi Sunak's Conservative Party and Donald Trump's inauguration fund, and he has also made donations to Democratic Party candidates in the US.\n\"I think fundamentally, it's about legitimacy,\" Professor Lingelbach said.\n\"He works as a philanthropist. To subtly shape debates about various topics.\"\nIn 2023, Sir Len Blavatnik paused donations to Harvard University over dissatisfaction with how the institution handled alleged antisemitism during pro-Palestinian campus protests.\n\"In some ways, the withholding of philanthropic resources as a political statement is more powerful than the giving of the money in the first place,\" Lingelbach said.\nAn Access Industries spokesperson said Blavatnik was waiting for action from university leadership and believed Harvard had since made progress in how it addressed antisemitism, and he had reinstated some funding.\nLater that same year, he was named in a Washington Post investigation as a participant in a private group chat of US billionaires and business leaders who were discussing ways to shape public opinion on the war in Gaza.\nWithin that group, Blavatnik reportedly encouraged members to donate to New York Mayor Eric Adams's re-election campaign, praising Adams for his strong stance against antisemitism, particularly in relation to Adams's response to pro-Palestinian protests on campus at Columbia University.\nAn Access Industries spokesperson explained that Blavatnik was concerned about rising antisemitism and lawlessness on campus.\nThis influence has only grown further as he made a late career change to a media tycoon. The billionaire is regularly photographed rubbing shoulders with Hollywood movie stars and iconic musicians.\nHe bought into the UK arm of Mel Gibson's production studio, and a large stake in a Russian film and TV production studio called Amedia, but has since divested from both.\nThen there is Warner Music Group, one of Blavatnik's biggest triumphs, which he acquired in 2011 for $5 billion at a time of deep uncertainty in the entertainment industry. Since then, he's transformed it into a powerhouse now valued at nearly six times that amount.\nWhile this acquisition has provided the billionaire with serious cultural clout, there are other investments that haven't been without controversy.\nFoxtel isn't Blavatnik's first TV purchase\nIn 2015, Len Blavatnik purchased a controlling stake in Israel's Channel 13. At the time, it appeared to be a straightforward media investment. The broadcaster was struggling financially and Blavatnik — who already owned a cement factory in Israel — seemed to be expanding his local business interests.\nBut Blavatnik's motives were soon questioned, after his relationship with Israeli Prime Minister Benjamin Netanyahu came to light.\nNetanyahu, currently on trial for fraud, breach of trust and bribery, was accused of attempting to manipulate media coverage in his favour.\nIsraeli newspaper Haaretz reported that police interviewed both men during the probe. Blavatnik was not the target of the investigation and he has not been accused of any wrongdoing. Instead, investigators were looking into Netanyahu's dealings with a different businessman and in the end, no charges were laid in relation to that matter.\nAccording to Haaretz, Netanyahu told investigators that he personally asked Blavatnik to buy Channel 13, saying: ''Change the channel, because it's an awful channel … This is a national mission, even though you are going to make money.\"\nBlavatnik allegedly did not deny the claim.\nThe political controversy peaked when a former right-wing politician was appointed to a senior editorial role at the station, prompting a revolt from Channel 13 journalists. Staff held an emergency meeting and escalated the matter to the Israeli Supreme Court. Before a ruling could be issued, the network's board reversed the appointment.\nAccording to journalist and press freedom advocate Anat Saragusti, the backlash from inside the station was swift but effective. \"They decided to cancel this nomination. So this politician stepped down. Now they have a new editor-in-chief who's very qualified for the job,\" she said.\nSo why did Blavatnik get involved in the deal at all? Saragusti believes it came down to power.\n\"When somebody buys a media platform, it means that he wants to have influence on political decision-making, and he wants to have power,\" she said.\n\"But suddenly he found himself in the midst of a political storm.\"\nIn April, Blavatnik announced he was divesting 74 per cent of the company.\nIn a statement to the ABC, a spokesperson for Access Industries said: \"Mr Blavatnik has never been involved in the channel's editorial decisions and believes a free press is critical for democracy.\n\"We want to be unequivocally clear that Mr Blavatnik and Prime Minister Netanyahu have not been in communication for many years and are not friends.\"\nFrom media mogul to streaming giant\nThe news business might not be for Blavatnik anymore, but sport remains an enduring interest.\nThe billionaire bought into the sports streaming business back in 2007 by acquiring the Perform Group and developing it into a consumer-facing platform, DAZN.\nBy the time he started buying up sports rights, the major American and European players had already locked down the most valuable assets, such as the NBA and NFL in the US and the English Premier League in the UK. Making him a relative latecomer to the sports broadcasting industry.\nWhen Foxtel was up for grabs, it might've been hard for Blavatnik to pass on the opportunity to add a few more sports to his catalogue in a tight global market.\nFoxtel has no other satellite TV competitor, a steady cash flow from 1.2 million subscribers — some paying up to $140 for the product — and it's in a country with a long history of sports obsession.\nBut where Foxtel will really compete is with its streaming service, Kayo.\nDAZN launched with the ambition to become the \"Netflix of Sport\", but since then, Netflix itself has entered the sports rights arena alongside Amazon, YouTube and Stan.\nThese new players are creating a hyper-competitive environment. In 2025 alone, streaming platforms are projected to spend nearly $20 billion on sports rights, up from $15 billion in 2024, accounting for 20 per cent of all global sports content spending.\nWhat was once a contest between legacy broadcasters has evolved into a dizzying fragmentation of streaming services. Rather than TV channels holding exclusive rights to an entire sport, they're now divided.\nTake the NFL. Last year, Netflix bought the rights to show one live game on Christmas Day annually. Amazon now holds the exclusive rights to \"Thursday Night Football\" games. CBS and FOX have Sunday afternoon games. But NBC has Sunday night games. And on Monday nights, you'll need to watch the game on ESPN/ABC.\nAcross the year, to watch every NFL game live, you could need up to five different streaming services.\nThis year, Australia got its own glimpse of that, with AFL's Saturday football moving exclusively behind a paywall. Viewers are now required to have a Foxtel or Kayo subscription to watch the games live. For Victoria and Tasmania, that's all year round; for the rest of the country, viewers can watch Saturday games on free-to-air after round nine.\nSteve Molk, a media industry commentator, believes the country is at a critical juncture.\n\"If people are passionate enough about their sport and passionate enough about not paying for it, the horse has almost bolted,\" he said.\nBlavatnik's lieutenants will soon enter into negotiations with the NRL for their broadcast rights beyond 2028. How that deal progresses could be a sign of things to come and Molk thinks you could see parts of the viewing broken down into parts.\n\"State of Origin could get sold as a block to a streamer. Not exclusively, but in parallel with Nine,\" he says.\nAustralia's TV landscape is far more centralised than the US and, in part, that's due to Canberra's anti-siphoning laws, which give free-to-air television channels first dibs on any broadcaster rights.\nThe real shifts lie further down the track as more and more people aren't connecting TV antennas or watching free-to-air. That could lead to a scenario where broadcasters with lower ratings get to bid first, but they won't have the same commercial firepower or the ability to monetise a sport as effectively.\n\"Australia is a piece of the puzzle for Len Blavatnik, in wanting to make sure that he broadens his influence, broadens the opportunity to have bragging rights as much as anything else, to say, DAZN is everywhere,\" Molk said.\n\"And if they can build a proposition where they've got people that they can charge a premium to watch these games. Then why would you not?\"\nIt remains to be seen how this will affect Australian consumers' back pockets. For instance, in 2022, DAZN was streaming Bundesliga and UEFA Champions League for German audiences, and then — with one week's notice — announced a 100 per cent price increase from $25 to $50\nIn the past five years, Kayo has comparatively increased only 40 per cent.\nAs the NRL negotiations continue, Australian sport executives will be keeping an eye on how things are unfolding in France.\nLast week, DAZN settled a legal dispute with the top football league, Ligue 1, walking back a four-year, $2.8 billion exclusivity deal, only one year into the partnership. DAZN was withholding payments from the league, blaming poor support from Ligue 1 to promote its coverage and fight digital piracy.\nStreaming and broadcast revenue is critical for local leagues, and the fallout had reportedly plunged Ligue 1 clubs into crisis, leaving them unable to set budgets for the upcoming season.\nThe league is now seeking new partners or may even launch its own channel.\nGlenn Dyer, a media business analyst with over 50 years' experience, thinks they need to avoid repeating that in Australia.\n\"If they don't come to a truce soon, this is a real blunder from DAZN,\"he said.\n\"In the time since they signed in November, DAZN has had a shocker in France. If they face issues with subscriber numbers here, Foxtel/DAZN will be under pressure to avoid a similar situation with NRL and AFL.\"\nThe oligarch's new sport\nIn the meantime, Blavatnik's sights are most likely set on balancing the books at DAZN, which over the past five years have been in the red. Blavatnik alone has invested almost $7 billion in the company. In 2023, he put in an extra $827 million to support DAZN's expansion efforts.\nIt's investing heavily in sports betting integration, particularly through DAZN Bet, which includes in-play betting options. The service has launched in several European markets, including Germany, Italy, Spain, and the United Kingdom.\n(While Australian law does not prohibit streaming platforms from offering in-app betting services, live, in-play sports betting via the internet is illegal in Australia, so punters have to bet over the phone during a game).\nLocally, there is belt-tightening underway. Last week, Foxtel confirmed a round of job cuts had commenced.\n\"Our teams have had the difficult task of speaking with a number of highly skilled and highly valued people that will leave the Foxtel Group,\" a group spokesperson said.\n\"We are grateful to every team member that has helped us grow the business and put us in the position of strength we are in today.\"\nDAZN might not be out of the red just yet, but profitability is looking a lot closer thanks to a major cash injection from SURJ Sports Investments — a division of Saudi Arabia's Public Investment Fund (PIF) — which recently acquired a 10 per cent stake in the company, reportedly valued at over $1.5 billion.\nOnly a month or two earlier, DAZN finalised a deal with FIFA to exclusively broadcast all 63 matches of the 2025 Club World Cup.\nGlenn Dyer thinks Blavatnik's entry in the Australian market is a wise one.\n\"I think he's got a longer game.\"\nHe believes DAZN has its sights set on landing the broadcast rights for the 2034 FIFA World Cup in Saudi Arabia.\nThey may not score the rights exclusively, but it would solidify the brand as a global rights player, and Foxtel could become a critical pawn in the play.\n\"They provide cash flow,\" Dyer said.\n\"If you're going to pay a large amount of money to the Saudis, you need to be able to service that debt. You can repay it later or restructure it, but you need financial evidence, proof that you've got assets that can generate real cash.\"\nAnd in Dyer's view, those assets are the viewers.\n\"It'll be the Australian subscribers, Kayo, Binge, regular Foxtel households, even the 240,000 commercial premises, clubs and pubs. That's what DAZN will lean on to help finance the ambition it has for its future,\" he said.\n\"DAZN is still in the starting blocks; only time will tell as to whether they'll emerge as a winner in the race for global streaming rights.\"",
  "word_count": 4880,
  "scraped_at": "2026-02-14T02:11:36.686300",
  "_text_extracted": true
}