{
  "article_id": "1b428fe71da4",
  "url": "https://www.meathchronicle.ie/2025/01/17/that-means-a-lot-pep-guardiola-could-barely-believe-new-erling-haaland-deal/",
  "title": "That means a lot – Pep Guardiola could barely believe new Erling Haaland deal",
  "date": "20250117T181500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "That means a lot – Pep Guardiola could barely believe new Erling Haaland deal\nBy Andy Hampson, PA\nPep Guardiola admits he could scarcely believe the news Erling Haaland has signed a new nine-and-half year contract at Manchester City.\nThe prolific Norway striker, who has scored 111 goals in 126 appearances for City, has committed himself to the reigning Premier League champions until 2034, it was announced on Friday.\nIt is a deal of unprecedented length in the English domestic game and City manager Guardiola, who recently agreed his own two-year extension, thought he had misheard when told the details by director of football Txiki Begiristain.\nGuardiola said at a press conference: “I said, ‘Can you repeat?’ And he said to me (10 years). I said, ‘Sure?’ and he said, ‘Yes’. So, good news. That means a lot.”\nHaaland, who joined City from Borussia Dortmund in 2022, will be 34 if he sees the new contract through. His previous deal was due to expire in 2027.\nThe announcement, which will see Haaland paid a reported £500,000 per week, is a boost for the club amid a frustrating season in which they have fallen off the pace in the title race.\nIt also comes at a time of uncertainty as City await a verdict following an independent commission hearing into more than 100 charges related to alleged breaches of the Premier League’s financial regulations, which the club have always strenuously denied.\nGuardiola said: “It’s proof of confidence and trust for the club, it’s the trust for the club to Erling, because you never know what can happen in the next years.\n“But the club knows perfectly how professional he is and his commitment in every single game and every single day to show his talent.\n“Of course for him, in 10 years, you never know what’s going to happen. It’s a long, long time and always in the short careers, you have to say, ‘OK, we’ll see what happens’.\n“He proved what he wanted and the trust was with the club.”\nHaaland scored 52 goals in his first season at City as the club won the treble of Champions League, Premier League and FA Cup. He followed up with a further 38 last term as the title was retained and has netted 21 despite City’s troubles this season.\nHis future has often been the subject of speculation, but now he is pleased to have put that to an end, insisting he will remain “no matter what”.\n“I am really happy to have signed my new contract and to be able to look forward to spending even more time at this great club,” said Haaland, whose father Alf-Inge represented City in the early 2000s.\n“Manchester City is a special club, full of fantastic people with amazing supporters, and it’s the type of environment that helps bring the best out of everybody.\n“I also want to thank Pep, his coaching staff, my team-mates and everyone at the club as they have all helped me so much in the past couple of years.\n“They have made this such a special place to be and now I am City no matter what.\n“I’m going to stay for a long time so now I can fully focus on getting better.”\nHaaland has scored 79 goals in 87 Premier League appearances and the new deal opens up the possibility he could chase down Alan Shearer’s competition record of 260.\nAt his current rate of scoring – 0.908 goals a game for someone who averages 33 matches a season – he could reach 261 during the 2030-31 campaign.\nGuardiola said: “If you continue with the numbers since he arrived, yes (he will break it), though it will depend on the team and it will depend on him as well.\n“But it’s exceptional news for all of us. When one player decides to sign this type of contract that’s never been done before, it’s because he wants to show how desperate he wants to be here.\n“I think he visualises there is no better place that he could be right now in the next 10 years.”\nGuardiola also has no doubt the best is still to come from Haaland.\nHe said: “The contract itself will not make him improve. It’s himself or his desire. Of course he can improve on many things.”\nIt is shaping up to be a busy month for City, with the club also closing in on three notable signings.\nThe PA news agency understands a fee has been agreed with Eintracht Frankfurt for forward Omar Marmoush, while deals for defenders Abdukodir Khusanov and Vitor Reis, of Lens and Palmeiras respectively, are thought to be progressing.\nWith Guardiola himself having come under pressure this term, he feels the activity is a strong show of faith from the hierarchy.\nHe said: “They have shown it. The trust always has been there and I think the last two months, month and a half, in other environments, I would not be here. So, always it has been there.”",
  "word_count": 839,
  "scraped_at": "2026-02-14T02:26:28.932145",
  "_text_extracted": true
}