{
  "article_id": "1b5cf2548968",
  "url": "https://www.bbc.co.uk/sport/football/68759573",
  "title": "Vinicius Jr : How Real Madrid forward is leading football fight against racism",
  "date": "20240408T121500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vinicius Jr: How Real Madrid forward is leading football's fight against racism\n- Published\nBrazil had just beaten England 1-0 last month when reporters approached Vinicius Jr for an interview at Wembley's mixed zone.\n\"But are we going to talk about football?\" the Real Madrid forward smilingly responded.\nAfter the positive answer, he agreed to take a few questions. Having already known that he would be doing a press conference in Madrid a couple of days later that would be mostly dominated by his personal fight against racism, Vinicius wanted to avoid the topic in London.\nAnd so he did. But then, when speaking before Brazil's friendly match versus Spain, he broke down in tears while discussing the toll the racist abuse he continues to suffer in Spanish stadiums has had on him.\n\"I just want to play football, but it's hard to move forward. I feel sadder and sadder and have less and less desire to play,\" he said. \"At 23 years old, I have to teach many Spaniards what racism is.\"\nThat a superstar for both the biggest club and national team in the world had reached the point of even considering his future at this stage of his career only highlighted how far the situation has developed.\nLa Liga referred 10 racist incidents involving Vinicius to Spanish prosecutors last season, but little appears to have been done so far.\nWhen Real Madrid take on Manchester City on Tuesday in the Champions League quarter-finals, the number seven may not stand out as the most talented player on the Santiago Bernabeu pitch - although he comes into that conversation.\nBut perhaps he is the most important footballer in the world at the moment.\nHis fight goes way beyond football.\nOver recent years, Vinicius has become the leading black voice in challenging racism in football and, despite the emotional burden it has brought him, he has no intention of backing off.\n\"Vinicius is breaking the silence that used to surround this issue and was imposed by the football industry in the past,\" Marcelo Carvalho, founder and executive director of the Observatory of Racial Discrimination in Football, told BBC Sport.\n\"He's fighting against a system that is racist.\"\n'The most persecuted footballer in history?'\nHaving grown up in Sao Goncalo, the most dangerous city in Rio de Janeiro's metropolitan area, Vinicius had to overcome the odds to make it to the top.\nNone of this, however, prepared him for what he would face in Spain after leaving Flamengo for Real Madrid aged 18 in 2018, with relentless abuse from the stands, monkey chants and an effigy hung from a bridge directed his way.\n\"I've looked back a bit and I've never seen a player who has been persecuted like Vinicius,\" Real Madrid boss Carlo Ancelotti said last month.\nSuch is the severity of the situation that it has turned into a diplomatic issue, with the Brazilian government summoning the Spanish ambassador to explain the incidents and calling for measures to stop them.\nWhile the feeling of impunity remains, Vinicius acts on his own.\nLast year, the forward launched a campaign under the slogan \"Racism, don't pretend you don't see it\" on billboards across his country and even abroad for Black Awareness Day.\nHe has also helped to renovate several schools back home through his foundation and released an anti-racism manual to make the educational environment more inclusive.\nHe has been vocal on social media about racism cases involving other footballers as well.\n\"These initiatives are 100% his. What we do is [make them happen] and give him more strength to fight. We offer advice, but in the end it's his fight. He didn't start a war against racism out of nowhere. He suffered it,\" explained his agent Frederico Pena. \"He's combative. He always has been. It runs in the family.\"\nNo impact on his performance?\nUnhappy with the treatment he received from La Liga last season, Vinicius contemplated the idea of leaving Real Madrid, but it is now safe to say his relationship with the organisation has changed. There is an acknowledgement of recent efforts made by the league.\nWithin his entourage, there was some concern regarding the impact of racist abuse on his performances but, despite the criticism towards his on-field behaviour, Vinicius could be on the way to his best season so far.\nWith 18 goals and six assists for Los Blancos in this campaign, Vinicius is only behind Jude Bellingham in terms of numbers for the Spanish giants - the English midfielder has 20 goals and 10 assists.\n\"Obviously, the racism cases are affecting him in some way. We can see he's more reactive during games,\" Carvalho said of Vinicius.\n\"So while it's great to have someone as powerful as Vinicius involved in this fight, it's also dangerous for him to be in this position because of the pressure he can feel on the pitch and from other clubs and sponsors wanting to silence him.\"\nHe will be hoping to put all this aside versus City and, when the whistle blows, do what he does best: play football.",
  "word_count": 850,
  "scraped_at": "2026-02-14T02:25:26.769024",
  "_text_extracted": true
}