{
  "article_id": "1b62e2eb50d3",
  "url": "http://www.hngn.com/articles/267858/20250902/glory-survival-drive-premier-leagues-record-gbp3-bn-transfer-splurge.htm",
  "title": "Glory , Survival Drive Premier League Record GBP3 Bn Transfer Splurge",
  "date": "20250902T190000Z",
  "domain": "hngn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League clubs demonstrated their awesome financial power during the summer transfer window, spending more than GBP3 billion ($4 billion) on new signings.\nThe English top division has long enjoyed a competitive economic advantage over rival European leagues thanks to far more lucrative television contracts for both domestic and international rights.\nThe expansion of UEFA's European competitions has supercharged spending, with a record nine English teams involved in the Champions League, Europa League or Conference League this season.\nAnother consequence of the Premier League's financial power is the growing gulf between clubs in the top division and those in the second-tier Championship.\nFor the past two seasons all three promoted sides have gone straight back down, provoking a more proactive approach from Leeds, Sunderland and Burnley.\nAFP Sport looks at the reasons behind the Premier League's record window, which closed on Monday.\nLast season's top two sides, Liverpool and Arsenal, have spent big as they gear up for another title battle.\nLiverpool broke their own club record twice, paying an initial GBP100 million for Florian Wirtz before breaking the British transfer record to land Alexander Isak for GBP125 million on deadline day.\nBut the Reds have also brought in more than GBP200 million in sales to bolster their transfer kitty, with Darwin Nunez, Luis Diaz among a list of big names to leave.\nArsenal have backed Mikel Arteta to finally win the Gunners' first title since 2004 with a GBP250 million spend on eight players to add attacking strength and depth to their squad.\nChelsea have again been busy after winning the Conference League and Club World Cup.\nJoao Pedro has spearheaded the arrival of an array of attacking talent, including Liam Delap, Alejandro Garnacho, Estevao and Jamie Gittens.\nManchester City did the bulk of their business before the Club World Cup, signing Tijjani Reijnders, Rayan Cherki and Rayan Ait-Nouri, as Pep Guardiola's men hope to get back in title contention.\nBurnley, Leeds and Sunderland are determined to end the trend of promoted clubs being chewed up and spat out at Premier League level, with all three spending around GBP100 million or more.\nSunderland's recruitment has been particularly eye-catching. The club have landed former Arsenal and Bayer Leverkusen captain Granit Xhaka and highly rated Senegal international midfielder Habib Diarra for a club-record GBP30 million.\nThe Black Cats' gamble has paid off so far, with two wins from their opening three games. Last season it took until mid-October for one of the promoted sides to win two matches.\nLeeds have also taken four points from two home games against Everton and Newcastle, while Burnley beat Sunderland at Turf Moor and were only defeated at Manchester United on Saturday by a 97th-minute penalty.\nOne of the key changes that has driven up the gross spend by the Premier League is a surge in club-to-club business.\nNearly 40 percent of transfers were between English clubs, at a combined cost of around GBP1 billion, caused in part by the need to meet financial sustainability rules.\nFor accounting purposes, transfer fees paid out by clubs are spread over the course of a player's contract. By contrast, the entire fee received when players are sold goes straight on the books.\nBy selling to each other at the inflated prices paid by Premier League clubs, English sides are managing to keep themselves on the right side of the rules despite their huge outlays.\nThe downside is that players who have come through local academies are sold on to balance the books, which risks stripping clubs of their identities.\nJacob Ramsey's move from Aston Villa to Saudi-owned Newcastle was one such case for two clubs that have struggled to balance their ambition to compete at the top of the Premier League with staying within the financial rules.\n\"A sad day losing a top player and person and one of our own but it seems to be the way football is set up these days,\" said Villa captain John McGinn after Ramsey's departure.\nVilla manager Unai Emery has called for reform of the financial rules otherwise clubs like his \"will never be allowed to dream\".",
  "word_count": 686,
  "scraped_at": "2026-02-14T01:58:57.495159",
  "_text_extracted": true
}