{
  "article_id": "1beb1837a961",
  "url": "https://www.meathchronicle.ie/2024/02/18/erik-ten-hag-believes-manchester-united-are-heading-in-a-good-direction/",
  "title": "Erik ten Hag believes Manchester United are heading  in a good direction  ",
  "date": "20240218T114500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag believes Manchester United are heading ‘in a good direction’\nBy Carl Markham, PA\nManchester United manager Erik ten Hag does not think a six-match unbeaten run means their season has turned a corner but he believes they are “back in the race” for the top four.\nHaving won just twice in nine matches and lost five in December, United have now won five and drawn one of their last six.\nLast weekend’s victory at Aston Villa was important as it kept them within six points of fourth-placed Tottenham and with games to come against Luton, Fulham, Everton, Sheffield United and Brentford – not withstanding the Manchester derby in that sequence – maintaining that sort of form will push them closer to Champions League qualification.\n“First of all I think it is too quick to say we turned a corner. We are not there yet. We are still not in a position,” said Ten Hag.\n“We are back in the race, but we are not in the position we want to be because this club definitely wants to be a minimum of top four, so we have to catch up. But I think we are now in a good direction.”\nThe priority has to be securing Champions League football again, as Ten Hag admits United are not at the level of Manchester City, Liverpool or Arsenal.\nHowever, he knows taking the next step and re-establishing them as title challengers will take longer due to the investment they have made in young players with potential.\n“In the summer I think we were in a very good moment: we were third, winning one final and in another final,” he added.\n“Then you choose young players for the future and that has to do with FFP (Financial Fair Play – now Profit and Sustainability), then also you know it will take longer before you can go into the competition for the top position in the Premier League.”\nThe Dutchman was asked whether, during the toughest parts of the season, he had any doubts he would be able to get back on track a team which finished third last season and reached two cup finals, winning one.\nHe said: “I was convinced. Once the (injured) players are available then I knew the players have the quality to play for the top four and now we have to prove it. Across the whole season I was convinced of that.”\nContributing to their improvement has been the form of youngsters Alejandro Garnacho, 19, and 18-year-old Kobbie Mainoo.\nTen Hag admits if they continue their current progress they could end up saving the club millions in the transfer window.\n“Manchester United will always be a buying club but I think the club’s history, in its DNA, is to give opportunities to players from the academy,” he added.\n“There are players with potential and we have given them the time to develop and progress and we are mentoring them too because we saw their potential was higher.\n“We also take into account that they couldn’t bring the levels in that moment but you see when you give them the opportunity they progress so quickly and they bring the team to higher levels in the long term.\n“You assess the potential of the player and we were convinced of those players and I think we still have in the back of our squad young players who can make the step, like Kobbie and Garnacho have made in the last couple of months.”",
  "word_count": 585,
  "scraped_at": "2026-02-14T01:56:44.628146",
  "_text_extracted": true
}