{
  "article_id": "1c01e5d85975",
  "url": "https://www.france24.com/en/live-news/20230426-inter-see-off-juve-to-reach-italian-cup-final",
  "title": "Inter see off Juve to reach Italian Cup final",
  "date": "20230427T020000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inter see off Juve to reach Italian Cup final\nMilan (AFP) – Holders Inter Milan reached the Italian Cup final on Wednesday after beating Juventus 1-0 to go through to next month's showpiece 2-1 on aggregate.\nIssued on:\nFederico Dimarco poked home the only goal of an underwhelming game at the San Siro, meeting Nicolo Barella's pass which was intended for Edin Dzeko and rolling past Mattia Perin.\nIt was the Italian's fifth goal of the season for his boyhood club and one which continues Inter's strong campaign in cup competitions.\nSimone Inzaghi's side have already won the Italian Super Cup and will have the chance to retain the Italian Cup in Rome on May 24, most likely against Fiorentina.\nThey are also preparing for a blockbuster derby with AC Milan in the Champions League semi-finals.\nOn Thursday Fiorentina host Cremonese 2-0 ahead from their first leg and almost guaranteed passage to the final.\n\"My team deserved the final over the course of the two legs,\" Inzaghi told Mediaset.\n\"We've now got 10 games left in the season, let's hope that there's one more (final).\"\nProgress would have been more straight-forward for Inter had Lautaro Martinez managed to get his toe to an inviting Denzel Dumfries cross in the 67th minute.\nAnd Perin also pulled off a great save to deny Henrikh Mkhitaryan when he tipped aside the Armenian's stinging drive in the 73rd minute.\nJuve were surprisingly flat for a match against their arch-rivals which is usually a feisty affair full of controversy, and exit the competition with a whimper.\n\"We need to recharge our batteries, as we've lost four of the last five Serie A games and are out of the cup. We need to roll our sleeves up,\" said Juve coach Massimiliano Allegri.\nAllegri's team have lost their simplest route to European football next season and now have to earn a place in continental football via their Serie A placing or by winning the Europa League.\nJuventus are third in Serie A after having their 15-point penalty for illicit transfer activity revoked but are awaiting a potential new punishment from the Italian Football Federation which could bump them back down the league.\n© 2023 AFP",
  "word_count": 368,
  "scraped_at": "2026-02-14T01:55:54.931531",
  "_text_extracted": true
}