{
  "article_id": "1c025e54ea15",
  "url": "https://www.cityam.com/crystal-palace-face-fa-cup-final-amid-boardroom-battles-and-upheaval/",
  "title": "Crystal Palace face FA Cup final amid boardroom turbulence",
  "date": "20250514T094500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace face FA Cup final amid boardroom battles and upheaval\nCrystal Palace’s preparations for Saturday’s FA Cup final have been taking place against a backdrop of more discord in the boardroom.\nThe club’s biggest shareholder John Textor has made renewed attempts to purchase the combined 36 per cent stake of fellow American investors, Josh Harris and David Blitzer, with the timing of his latest approach going down badly with other directors, particularly chairman Steve Parish.\nTextor has been attempting to buy out Harris and Blitzer for over a year, but has yet to match their £150m-plus valuation of shares that cost them around £50m 10 years ago.\nSources with knowledge of the discussions have indicated that Textor’s renewed push for control of Crystal Palace relates to his plans to float the parent company of his multi-club operation, Eagle Football Holdings, on the New York Stock Exchange.\nEagle Football also owns French club Lyon, Brazilian champions Botafogo and Belgian side Molenbeek, and increasing its 45 per cent shareholding in Crystal Palace to a controlling stake would significantly increase the company’s value.\nParish, however, is backing a rival bid from New York Jets owner Woody Johnson, who attended last week’s 1-1 draw against Nottingham Forest at Selhurst Park as his guest, with multiple sources casting doubt on whether Textor will ever gain control of the club.\nIn keeping with the mood of uncertainty at Crystal Palace it is unclear whether Textor will be at Saturday’s FA Cup final, and he may prefer to attend Lyon’s last game of the season against Angers later in the day.\nBeyond the boardroom politics there has also been considerable change at executive level at Crystal Palace this season.\nSporting director Dougie Freedman left to join the Saudi Arabian club Al-Diriyah in March, while chief financial officer Sean O’Loughlin and chief operating officer Sharon Lacey both left the club last week.\nChannel 5 pockets snooker and darts\nFresh from bagging Club World Cup games, Channel 5 is set to snap up darts and snooker’s free-to-air rights in an attempt to capitalise on the growing popularity of both sports.\nCity AM has learned that 5 is close to securing live rights for nine tournaments from next year that are currently held by ITV, including darts’ UK Open and snooker’s Players Championship.\nThe new TV contract will see 5 broadcast several high-profile Professional Darts Corporation events such as The Masters, UK Open, European Championship, Players Championship finals, and at least seven World Series of Darts global events including the finals.\nTeenager Luke Littler won last year’s World Series of Darts finals in September on the way to claiming his first world title at the age of 17 at Alexandra Palace after Christmas.\nIt comes after 5 struck a sublicensing deal with Dazn to show roughly half of the matches at the Club World Cup, which starts next month, and as the channel leads the chase for live rights to four England T20 cricket internationals this summer.\nMatchroom, the promotions company run by Barry and Eddie Hearn which is the majority shareholder in the PDC and the World Snooker Tour, is hoping that Zhao Xintong’s historic victory at the World Championship in Sheffield last week will transform the sport on a global scale in a similar way to the way Littler has raised the profile of darts domestically.\nSnooker is a huge sport in China already, with the country having around 300,000 snooker halls and more than 150m TV viewers reported to have watched Zhao become the first Chinese world champion with his 18-12 demolition of Mark Williams at The Crucible last week.\nCricket coffers on sticky wicket\nThere are few signs of any competition to incumbent JioStar for the crucial Indian TV rights ahead of the next tender for global tournaments, which will take place next year, according to insiders involved in the process.\nStar Sports agreed to pay £2.2bn for rights to the World Cup and T20 World Cup between 2023 and 2027, but last year’s merger between Disney and Reliance Industries to create broadcasting monolith JioStar has taken out much of the competition, and rivals such as Sony and Warner Bros appear reluctant to challenge them.\nThe current Indian deal accounts for around 90 per cent of the International Cricket Council’s revenues, so a significant drop would have disastrous consequences for cricket’s finances – particularly outside the Big Three of India, England and Australia, whose domestic TV deals remain relatively strong.\nThe uncertainty surrounding future India-Pakistan meetings at ICC events due to the conflict in Kashmir has exacerbated the problem, as their guaranteed matches at World Cups contribute a large part of the value of the TV deal.\nIntriguingly, The Guardian reported earlier this week that JioStar’s head of sport, Sanjog Gupta, is the frontrunner to replace the outgoing Geoff Allardice as chief executive of the ICC, which the world governing body will hope would increase their chances of renewing the existing contract for 2028 to 2031 on reasonable terms.\nTNT final freebie plans thwarted\nTNT Sports has been prevented from making Arsenal’s Women’s Champions League final against Barcelona available for free later this month.\nThe broadcaster is planning to offer all men’s Uefa finals featuring Manchester United, Tottenham Hotspur and Chelsea available free to air via their Discovery+ channel, but a proposal to do the same for Arsenal’s clash with holders Barcelona on 24 May has been knocked back by global rights holders Dazn.\nTNT Sports sub-licenses UK Champions League rights from Dazn in a deal that allows it to co-broadcast one game per matchweek during the group stage as well as all the quarter-finals, semi-finals and the final.\nCity AM has learned that TNT wanted to make the final available for free to non-subscribers in order to ensure a bigger audience and to promote the women’s game as Arsenal seek to win the Champions League for the first time since 2007, but were unable to reach an agreement with Dazn. While positive discussions took place, talks are understood to have broken down over Dazn’s promotional demands.\nDazn made all of its women’s football rights available to stream for free via its app or YouTube in an innovative move last year, so fans will be able to watch the Champions League final without subscribing, but as a relative newcomer to the UK market its audience reach and viewing figures are limited.\nSub-licensing the Champions League rights to TNT Sports in a three-year deal which began this season was an acknowledgement of Dazn’s limited cut-through, and viewing figures for the competition have improved since.\nAll three men’s Uefa finals – the all-Premier League clash between United and Tottenham in Bilbao on May 21, Chelsea’s Conference League meeting with Real Betis in Wroclaw seven days later and the Champions League final between Inter Milan and Paris Saint Germain in Munich on 31 May – will be made available free-to-air by TNT.",
  "word_count": 1154,
  "scraped_at": "2026-02-14T02:11:36.683303",
  "_text_extracted": true
}