{
  "article_id": "1c0fa33724bf",
  "url": "https://www.90min.com/features/kai-havertz-role-arsenal-sexy-marouane-fellaini",
  "title": "Kai Havertz has found his role at Arsenal - he their sexy Marouane Fellaini",
  "date": "20240425T090000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kai Havertz has found his role at Arsenal - he's their sexy Marouane Fellaini\n- Arsenal thrashed Chelsea 5-0 in statement win on Tuesday\n- Former Blue Kai Havertz scored brace to take tally of goals to double digits for the season\n- Versatile German has proved polarising during his four years in England\nBy Sean Walsh\nThere were two staunch camps at odds when Kai Havertz joined Arsenal from Chelsea last summer.\nThe first consisted of the optimists, primarily those heavy on viewing the game through data, analytics, numbers and maybe above all else, crumbs of hope. The second were the pessimists, who had Havertz-fever beaten out of him after largely underwhelming in England since his 2020 arrival on these shores from Bayer Leverkusen. Neither side wanted to listen to the other.\nPredictably then, Havertz's time at Arsenal has now fallen somewhere in the middle. After 33 Premier League games for the Gunners, he's registered a completely respectable - if not admirable - 11 goals and five assists, a feat all the more impressive when you consider he blanked in his first six matches. But he's becoming a player who needs those stats to contribute anything meaningful to any given 90 minutes of action.\nHavertz is the paradoxical complete-but-nothing footballer. At 6ft4 and with technique that at times mirrors a sporting unicorn, he should be among the best players in the world. And yet he can only string, knit and piece together each thread of ability from time to time.\nIn full flight, Havertz is a multi-dimensional, two-way threat who can pass, dribble, header and score, bringing a unique blend of grace and grit. At his worst, Arsenal essentially play with 10 men.\nThe scale between the ceiling and floor has rarely been so wide for a consistent figure for a team competing for a Premier League title. The ceiling is the roof and the floor is the crust of the Earth, in this case. It's what makes Havertz so enamouring and fascinating, perhaps a reason why Mikel Arteta wanted him, perhaps a little representative of his young and ambitious team as a whole.\nHavertz's performance against former club Chelsea on Tuesday was on the right end of that maddeningly long scale. In the first half, he lacked the intensity and precision of the killer striker Arsenal have been longing, a lost cause inside the opposition box, verging more on donkey than unicorn. After the break, he delivered two dagger blows to the Blues that left them unable to spout his name in their social media updates as if he were their Lord Voldemort.\nTo really twist that knife, Havertz didn't hesitate to bring out his trademark, provocative, silly, smile-widening, Pingu-mimicking celebration. He won Chelsea their second Champions League, but this was where he confirmed he was all-in with Arsenal. Sixty-million down the drain, he scored again.\nArsenal remain in the market for a striker this summer and if they make the right move, then Havertz's place as a starter could come under threat. He shouldn't fret nor feel such pressure though. He has a use regardless of who's in the first XI, such is how Arteta is constructing this team with unique profiles.\nDuring Marouane Fellaini's time in the Premier League, he was the ultimate dual-threat in both boxes. You could bring him on when you were trying not to concede in order to add height and physicality to your team, you could bring him on when you were trying to score and play in a more direct manner.\nHavertz, far more chiselled technically and physically (and, arguably, more handsome, but I'm not here to judge) than the afro-haired menace, is a modern-day upgrade. In non-league, you can find multi-purpose target men who double up as no-nonsense defenders - this was actually Jurgen Klopp's role as a player, which kind of explains his manic approach to football at either end of the pitch - and Havertz is the luxury version of that offering.\nArsenal could have spent the Havertz money on a midfielder or forward who would have been a sure-fire hit. At least now he's not a bust. Arteta's men might not win anything this season, but they've set their squad up well to compete for titles for a long while.",
  "word_count": 714,
  "scraped_at": "2026-02-14T01:56:51.545081",
  "_text_extracted": true
}