{
  "article_id": "1c1aeb96e4d0",
  "url": "https://www.caughtoffside.com/2024/11/14/pedro-goncalves-manchester-united/",
  "title": "Manchester United poised to make move for Sporting star with 18 goals , 17 assists as Ruben Amorim first signing",
  "date": "20241114T204500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are already planning for future transfer activity under the guidance of their new manager, Ruben Amorim. Reports suggest that Sporting Lisbon’s standout winger, Pedro Goncalves, is on the club’s radar for the next summer window.\nAmorim, who recently signed a contract with United through 2027 earlier this month, has expressed a keen interest in bolstering the squad.\nManchester United monitoring Pedro Goncalves\nAccording to the Mirror, the Red Devils are closely monitoring Goncalves, a player who played a vital role in Amorim’s successful tenure at Sporting.\nSporting Lisbon, however, has made their stance clear by setting an €80 million valuation on their star player, who remains contracted with the club until 2027.\nGoncalves, who is currently an injury concern for Sporting, was a standout performer last season, scoring 18 goals and contributing 17 assists over 49 appearances in all competitions, aiding Sporting in securing the league title.\nHis impressive form has carried into the current season, where he has already netted five goals and provided six assists in 12 matches, solidifying his status as one of the best players in Portuguese football.\nAmorim’s respect for Goncalves is well-documented, having praised the winger’s talent and adaptability during his final press conference at Sporting after an exciting 4-2 comeback win against Braga.\nThe 39-year-old manager emphasised the player’s’ potential to thrive in any team and hold his own among the world’s elite, underscoring his high-level capabilities.\nRuben Amorim will not raid Sporting in January\nWhile United supporters may be eager to see a swift transfer, Amorim has confirmed that there will be no pursuit of Sporting players during the January window.\nNonetheless, he hinted that the summer could present an opportunity for such moves, positioning Goncalves as a key potential signing to bolster United’s attacking options.\nAnother player Amorim could turn to is Viktor Gyokeres, who recently scored a hat-trick against Manchester City in the UEFA Champions League.",
  "word_count": 318,
  "scraped_at": "2026-02-14T02:02:07.194838",
  "_text_extracted": true
}