{
  "article_id": "1c33f034773a",
  "url": "https://www.themag.co.uk/2025/10/jose-mourinho-newcastle-united-press-conference-speaks-ahead-of-st-james-park-clash-benfica/",
  "title": "Jose Mourinho Newcastle United press conference - Speaks ahead of St Jame Park clash",
  "date": "20251021T084500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jose Mourinho Newcastle United press conference – Speaks ahead of St James’ Park clash\nThe Jose Mourinho Newcastle United press conference has taken place.\nThe Benfica boss speaking to journalists on Monday night.\nThis was ahead of Tuesday night’s game at St James’ Park\nBenfica having already lost their first two matches in the Champions League.\nA home defeat to Qarabag getting the last manager sacked, then new manager Jose Mourinho losing with Benfica at Stamford Bridge.\nJose Mourinho Newcastle United press conference – 20 October 2025:\n“I worked with Sir Bobby Robson for six years.\n“There was not a single day when he did not show his pride and passion for Newcastle, the city, the region and the football club.\n“I have never hidden how dear Newcastle is to me because of the influence of a legendary person at this club.\n“St James’ Park is a fantastic place to play football.\n“People do not come here to watch the game, they come here to play it with them.\n“It’s not just the stadium…it’s this club, the history, the passion and the fans.\n“With the economic power they have with the owners now, it is a team that is very close to even bigger things.\n“It is a very special club because of the culture in this region, it is very different culturally to London and to Manchester.\n“I love playing here.\n“I said to my players: ‘It’s beautiful here and you will feel that atmosphere tomorrow evening.’\n“We are coming up against a very, very strong, very physical team.\n“Uninformed people may be misled by their current league position but they are a tremendous team.\n“Newcastle are doing everything right.”\nJose Mourinho asked if he would like to manage Newcastle United…?\n“I don’t think they need a coach now.\n“I hope that they don’t need one in the next years either.\n“That would mean everything goes well for the club and for Eddie, which is what I wish.\n“On top of that, in this moment of my career, there wouldn’t be another club where I could be happier and more motivated than I am at Benfica. I wouldn’t change Benfica for any club.”\nSpeaking to Sir Bobby…\n“I exchanged a few words with Bobby [A bust of Sir Bobby as you enter St James’ Park reception] as I came in here today.\n“It is a great emotion and when I walk in here, I feel close to him.\n‘One thing he gave me was the opportunities.\n“He took me to Barcelona and it was an incredible experience for me and that door is a huge door that was opened by Sir Bobby.\n“The second thing is what I learned at the football level AND at the human level.\n“The third thing is the trust he put in me. I tried to pay him back with everything I gave. I don’t know if I ever did but I tried to give him everything that I had. That for me is enough.”\nConfirmed Newcastle United fixtures to 20 December 2025 (All of the Champions League matches will also be available to watch on TV in the UK):\nTuesday 21 October: Newcastle United vs Benfica (8pm)\nSaturday 25 October – Newcastle v Fulham (3pm)\nWednesday 29 October – Newcastle v Spurs (8pm) ITV and Sky Sports\nSunday 2 November – West Ham v Newcastle (2pm) Sky Sports\nWednesday 5 November: Newcastle United vs Athletic Club Bilbao (8pm)\nSunday 9 November – Brentford v Newcastle (2pm) Sky Sports\nSaturday 22 November – Newcastle v Man City (5.30pm) Sky Sports\nTuesday 25 November: Olympique Marseille vs Newcastle United (8pm)\nSaturday 29 November – Everton v Newcastle (5.30pm) Sky Sports\nTuesday 2 December – Newcastle v Spurs (8.15pm) Sky Sports\nSaturday 6 December – Newcastle v Burnley (3pm)\nWednesday 10 December – Bayer Leverkusen v Newcastle United (8pm)\nSunday 14 December – Sunderland v Newcastle (2pm) Sky Sports\nSaturday 20 December – Newcastle v Chelsea (12.30pm) TNT Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 677,
  "scraped_at": "2026-02-14T02:26:56.609331",
  "_text_extracted": true
}