{
  "article_id": "1c612bc03cef",
  "url": "https://metro.co.uk/2025/06/07/former-tottenham-star-warns-man-utd-60m-transfer-hijacked-23354844/",
  "title": "Former Tottenham star warns Man Utd that £60m transfer could be hijacked",
  "date": "20250607T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Tottenham midfielder Jamie O’Hara has suggested his former club could hijack Manchester United’s transfer move for Bryan Mbeumo.\nThe Red Devils have reportedly agreed personal terms with the Brentford star, who has indicated his desire to join United in the summer window.\nBut United have so far been unable to agree a fee with Brentford with the Bees rejecting an initial bid worth £45m plus £10m in add-ons.\nUnited have since increased their offer – more than £60m – but O’Hara has argued Spurs could dive in at the last minute to sign Mbeumo instead.\nBrentford manager Thomas Frank is thought to be the leading contender to replace Ange Postecoglou, who was dramatically dismissed on Friday.\nIf Frank gets the Spurs job, O’Hara has suggested it may put the club in a position to swoop in for Mbeumo, given their time together at Brentford.\nJamie O’Hara would ‘love’ Bryan Mbeumo at Spurs\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpeaking on Sky Sports about Frank being the No.1 candidate to take over from Postecoglou, O’Hara said: ‘I really like Thomas Frank.\n‘I think the time has come for him to have a big opportunity. He’s put a really good team together with Brentford.\n‘Bryan Mbeumo, Yoane Wissa, Kevin Schade were absolutely fantastic for them this season.\n‘Look, can we hijack Manchester United’s move for Mbeumo if we get Frank? I’d love him at the club.\n‘He’s a really good manager. He’s organised, his teams play good football and they press. I think he’d be a good appointment.’\nSpurs beat United in the Europa League final at the end of the 2024-25 season to book their spot in the Champions League.\nThe result meant United missed out on European football for the first time in a decade and they’re rumoured to have a small summer transfer budget.\nMore Trending\nUnited have already spent a large chunk of their budget on Wolves star Matheus Cunha, forking out £62.5m to bring the Brazilian to Old Trafford, although it has been spread over three payments in the next two years.\nIt’s thought they will still have the funds left to land Mbeumo, even after ruling out the sale of Bruno Fernandes to Al-Hilal for £100m.\nMbeumo shined for Brentford in the 2024-25 season, scoring 20 goals across 38 Premier League matches.\nThe 25-year-old Cameroon international has been with Brentford for the last six years, joining the west London club from French side Troyes.\nMORE: Newcastle make move for £50million Chelsea transfer target after Bryan Mbeumo picks Man Utd\nMORE: Bruno Fernandes has already named the striker who would be perfect for Man Utd\nMORE: Cristiano Ronaldo makes ‘very difficult’ Lionel Messi claim ahead of Club World Cup",
  "word_count": 501,
  "scraped_at": "2026-02-14T01:58:41.953228",
  "_text_extracted": true
}