{
  "article_id": "1c816f98fd43",
  "url": "https://www.empireofthekop.com/2025/10/31/merson-salah-must-start-liverpool-villa/",
  "title": "Paul Merson : Mo Salah must start for Liverpool against Aston Villa",
  "date": "20251031T160000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson has implored Arne Slot to select one Liverpool player in particular in his starting line-up to face Aston Villa on Saturday.\nThe 47-year-old changed almost his entire XI for the midweek Carabao Cup defeat to Crystal Palace, with many of his regular starters not even on the bench for that game as the Dutchman evidently prioritised tomorrow’s fixture and the Champions League visit of Real Madrid next Tuesday.\nIt meant that Mo Salah wasn’t given the chance to immediately rebuild momentum after he ended his six-game streak without a goal by scoring a late consolation against Brentford last weekend, although the subsequent rest should have him primed for action tomorrow night.\nMerson: Salah must start against Villa\nIn his weekly Premier League predictions column for Sportskeeda, Merson made the case for Liverpool’s number 11 to start against Villa, backing him to score even though his form this season has been unusually subdued.\nThe pundit wrote: ‘Another big question is whether or not Mohamed Salah starts this game for Liverpool. I think he does. If you want chances falling to players in games like these, Salah is still certainly one of them. I know he hasn’t been scoring goals, but they can’t leave him out of this game.’\nSalah is still one of Liverpool’s likeliest sources of goals\nHaving sat out the Palace game on Wednesday, it seems almost certain that the Egyptian will start against Villa, particularly with Slot’s attacking options lessened by the near-definite absence of Alexander Isak through injury.\nFor all the criticism that Salah has taken in recent weeks, he’s still Liverpool’s joint-second highest scorer this season with four goals (alongside Cody Gakpo), and his underlying shooting statistics are nowhere near as bad as what some pundits might have you think.\nAs per FBref, the 33-year-old is only slightly underperforming on his xG of 4.4 in all competitions, while none of his teammates have had more shots on target (SoT) than his 13, and his SoT percentage of 44.8% is the second highest of any Reds forward.\nMerson highlighted the importance of having the Egyptian on the pitch to finish chances which might fall to LFC, and he has a point – very few players in world football would’ve had the technique to score the magnificent goal that Salah plundered against Brentford last weekend.\nWe’d be shocked if our number 11 isn’t in the starting XI to face Aston Villa, against whom he has five goals and four assists in the teams’ last six meetings, and he’ll hopefully have a weight lifted from his shoulders after netting at the Gtech Community Stadium six days ago.\nYou can watch Slot’s full pre-Aston Villa press conference via Empire of the Kop on YouTube:",
  "word_count": 456,
  "scraped_at": "2026-02-14T01:52:49.008530",
  "_text_extracted": true
}