{
  "article_id": "1cc3877f4afd",
  "url": "https://www.teamtalk.com/manchester-united/amorim-masterclass-gyokeres-greenlights-man-utd-transfer",
  "title": "Man Utd transfer news : Amorim masterclass as Gyokeres greenlights move",
  "date": "20250605T181500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nAmorim masterclass as Gyokeres greenlights transfer to Man Utd\nViktor Gyokeres is open to joining Manchester United despite the club’s lack of Champions League football, and a report strongly suggests Ruben Amorim is at the heart of the matter.\nThe signing of a potent new striker was and still remains a high priority for Man Utd entering the summer transfer window. The Red Devils originally lined up Liam Delap of Ipswich Town, though the 22-year-old ultimately chose to sign for Chelsea.\nUnited’s lack of European football played a big part in that decision. Delap believes starring in the Champions League next season can thrust himself into contention for England at the 2026 World Cup.\nWith the Delap deal resigned to the scrapheap for United, it is Matheus Cunha who will become signing No 1 this summer.\nThe Brazilian could quickly be followed by Bryan Mbeumo who has chosen to sign with United ahead of Arsenal, Tottenham and Newcastle.\nThe latest on Mbeumo can be found here, and if the Brentford ace is landed, attention will spring back to the striker position.\nSporting CP’s Viktor Gyokeres remains a dream target for Ruben Amorim. The United boss helped turn Gyokeres into the deadly weapon he’s become during their time together in Lisbon.\nGyokeres scored 54 goals and provided 13 assists in just 52 appearances this season. His exploits helped fire Sporting CP to a league and cup double.\nHowever, Gyokeres can leave Sporting for a fee around the €70m / £59m mark via a verbal pact made between he, his agents and Sporting’s hierarchy last summer.\nThat figure is someway below the Swede’s €100m release clause, though the flipside of the pact was Gyokeres would remain in Lisbon for the 2024/25 season. Given Sporting ended the campaign with two major trophies, the decision has been vindicated.\nThere has been speculation Gyokeres would look unfavourably on reuniting with Amorim given United’s lack of Champions League football next year.\nBut according to a fresh update from reporter Ben Jacobs, Gyokeres will look past the absence of UCL football, just as Cunha and Mbeumo have.\nWriting for talkSPORT, Jacobs declared: ‘Viktor Gyokeres is open to a move to Manchester United even without Champions League football.’\nAmorim would reportedly ‘relish’ the chance to field Gyokeres at the tip of his new-look attack. And per the report, the United boss appears to have played a part in getting the green light for Man Utd.\nEver since moving to Old Trafford in November of last year, Amorim has reportedly ‘kept in contact’ with the 27-year-old.\nMan Utd don’t have free run at Viktor Gyokeres\nUnderstandably given the jaw-dropping numbers Gyokeres has put up of late, Man Utd are not alone in eyeing a deal.\nArsenal have narrowed their striker search down to two, with Gyokeres one and Benjamin Sesko the other. From a United perspective, they’ll hope Arsenal move for the RB Leipzig ace instead.\nElsewhere, Jacobs listed Chelsea, Liverpool and Juventus as circling over the Swede. Gyokeres also had interest from the Saudi Pro League, though does not favour a switch to the SPL at this stage in his career.\nAnother factor that is working against Man Utd at present is their inability to finance a move prior to player sales.\nThe Red Devils do have freedom to sign Cunha and Mbeumo, but additions beyond that hinge on sales.\nAs such, United must hope Gyokeres is still on the market by the time they’re in position to strike a deal later in the window.\nLatest Man Utd news\nIn the event Gyokeres eludes Man Utd, a cheaper alternative could come in the form of PSG’s Goncalo Ramos.\nMan Utd are understood to have been ‘offered’ the Portuguese striker who is surplus to requirements at the quadruple winners.\nThat news was delivered in a report from the Daily Mail who also insisted recent links between Man Utd and two strikers should not be taken seriously right now. The two frontmen in question are Sesko and Aleksandar Mitrovic.\nElsewhere, Man Utd could soon raise much-needed capital through the sales of Antony and Jadon Sancho…\n🔴⚫️ Perfect Antony transfer unlocked once Florian Wirtz joins Liverpool\n🔴⚫️ Man Utd in dreamland with best-case scenario expected in Sancho sale",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:58:41.960638",
  "_text_extracted": true
}