{
  "article_id": "1cc7076a9f03",
  "url": "https://www.geo.tv/latest/572537-neymar-lionel-messi-reunion-hopes-dashed-as-brazil-reveals-unexpected-plans",
  "title": "Neymar , Messi reunion hopes dashed as Brazil reveals unexpected plans",
  "date": "20241104T084500Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "November 04, 2024\nNeymar's potential future with Saudi Pro League club Al Hilal sparked rumours recently, particularly about a potential reunion with his former Barcelona and Paris Saint-Germain (PSG) teammate Lionel Messi at Major League Soccer club Inter Miami.\nHowever, recent report from Brazil indicate a surprising alternative for the Brazilian forward, hintinng that his next destination may not be the expected collaboration with the Argentine football legend, according to Bolavip.\nDuring an interview with TV show Panico, Osvaldo Nico, the vice-president of the Board of Directors for Neymar's former club Santos, said: \"Neymar arrives at Santos in June. That is the conversation we are having.\"\nThis revelation is surprising given the other rumored alternatives.\nSince transferring to Al Hilal from PSG in mid-2023, the 32-year-old Brazilian footballer's time at the Saudi club has been marred by injury, limiting his appearances to the sidelines.\nHe currently holds one of the highest-paying contracts in global football, reportedly earning over $100 million annually in Saudi Arabia — a sum no other club, especially Santos, could realistically match.\nHowever, the emotional connection Neymar has with his former club may prove to be a decisive factor.\nNeymar debuted for Santos in 2009, at the age of 17, quickly rising as the team’s star player. He spent five years with the club.\nDuring this time, Neymar led the team to six titles, including a Copa Libertadores. Across 225 appearances, he tallied 136 goals and 69 assists, catching the eye of Barcelona, who reportedly paid up to $90 million for his transfer in 2013 — though the exact fee remains unconfirmed.\nA decade after Neymar’s departure, Santos find themselves in a vastly different position. The once-dominant Brazilian club is grappling with a historic low, having faced relegation for the first time in 2023.\nNeymar's potential return could be a lifeline, sparking a resurgence and laying the groundwork for the club's return to elite status.\nReflecting on Neymar’s potential influence, Nico shared: \"Everyone played well with Neymar at Santos; even (Ze) Love and André scored goals. He is going to Santos.”",
  "word_count": 344,
  "scraped_at": "2026-02-14T01:49:13.395037",
  "_text_extracted": true
}