{
  "article_id": "1cd797fc9874",
  "url": "https://www.namibian.com.na/african-stars-ask-fifa-to-reverse-ban/",
  "title": "African Stars ask Fifa to reverse ban",
  "date": "20240620T094500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Namibia premiership champions African Stars have approached Fifa to get their transfer ban revoked after settling their debt with Ghanaian striker Peter Ernest Adiwo, the club’s chairman Salomo Hei says.\nThe club was recently slapped with a ban from signing new players nationally and internationally, following Stars’ failure to settle its financial obligation towards their ex-player.\nStars were initially sanctioned to pay Adiwo N$180 000 after he approached Fifa over claims of unfair dismissal.\nFifa’s Disciplinary Committee found that Stars had breached their agreement with the Ghanaian and ruled that failure to compensate him during the prescribed period led to the transfer ban.\nSpeaking to Desert Radio this week, Hei said Adiwo had been paid the funds owed to him.\n“In the meantime, what transpired is that the player continued and approached Fifa while he received the money. We obviously did not receive the audience, as the merit of the matter was given to Fifa,” Hei said.\nHei further said the initial communication from Fifa was done via an email address normally not used by the club, which caused the delay in handling the matter.\n“We are dealing with the matter this week so that things get back to normal and have the ban lifted, upon us honouring the obligation set by Fifa,” Hei said.\nHe added that the current situation is a concern for the team’s management but they intend on resolving the matter with the hope of signing new players in the upcoming transfer window.\n“We had a player that had a short-term working contract. We even wanted to renew the papers of this player. His papers were then not renewed for different reasons, one being that he is an international player,” Hei said of how the club found itself in hot water.\n“His work permit being turned down is not only a Namibian phenomenon but a practice all over the world.”\nThe club’s figurehead wants the issue dealt with so that they can focus on plans for the upcoming season.\nTo that end, Stars has lined-up a pre-season engagement in Botswana, where they are invited to take part in a series of preparatory matches.\nHei said it is imperative for the club to embark on a pre-season drive, to ensure they are well prepared for a consecutive Confederation of African Football Champions League campaign.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 491,
  "scraped_at": "2026-02-14T01:57:18.888976",
  "_text_extracted": true
}