{
  "article_id": "1cf429340f38",
  "url": "https://www.themag.co.uk/2023/06/yankuba-minteh-set-to-sign-for-newcastle-united-with-medical-booked-report/",
  "title": "Yankuba Minteh set to sign for Newcastle United with medical booked - Report",
  "date": "20230602T110000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Yankuba Minteh set to sign for Newcastle United with medical booked – Report\nIt looks like Yankuba Minteh has won the race to be the first Newcastle United signing of the summer.\nThe teenager has been a sensation in Danish football this season, making his debut on 10 September 2022 as a substitute for Odense Boldklub against Copenhagen and scoring the winner only three minutes later. The 18 year old winger delivering goals and assists on a regular basis.\nNow over in Denmark, B.T. have reported that a transfer fee of around 50m Danish Krone (approximately £6m) has been agreed with Newcastle United and that a medical is scheduled.\nThe OB official site making an official announcement on Friday morning:\n“OB are close to selling Yankuba Minteh.\n“OB has for a long time been in close negotiations with a foreign club about the sale of Yankuba Minteh and the negotiations have now reached such a stage that Yankuba Minteh will not be in the squad when we meet FC Midtjylland tomorrow [Saturday].”\nWith the player’s departure imminent, B.T. quote the Odense Boldklub Director of Football, Bjorn Wesstrom:\n“It is a difficult decision, but with the risks and opportunities in this case, I have concluded that it is overall the best decision for OB that he [Yankuba Minteh] sits out the match against FC Midtjylland.”\nThat match is being played on Saturday and clearly the risk of injury potentially preventing this sizeable transfer fee, figuring highly in the decision.\nA month ago the Danish media reported that a move for Yankuba Minteh to join Newcastle United was very close and expected to be announced in the near future.\nThat looking even more certain when Yankuba Minteh was interviewed by Viaplay and asked about the reported Newcastle United potential move and whether he was interested – 25 April 2023:\n“Of course I want to go to Newcastle.\n“It is a big club in the Premier League and they are doing something good.\n“They are fighting for a place in the Champions League.\n“I am ready to take the next step and it will only be good for me.”\nYankuba Minteh moved from his native Gambia in summer 2022 and as well as his sensational form in Danish club football, has already been involved with the Gambia national senior squad. Called up for friendlies in November 2022.\nNewcastle United have already shown a very clear strategy of targeting younger / young players, with their best years ahead of them.\nAs well as those in their early 20s ready to go straight into the first team squad, such as Isak, Bruno, Botman and Gordon.\nNUFC also bringing in a host of teenagers, the likes of Garang Kuol.\nThe Danish media report this Friday morning saying that their information is that an initial loan deal is expected to follow next season, if / when the move to Newcastle United is completed.\nNewcastle United are also in the process of massively expanding their recruitment / scouting department, searching for talented players in the UK and all around the globe.\nExciting times for both now and especially what could be possible in the future.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 541,
  "scraped_at": "2026-02-14T01:48:17.240976",
  "_text_extracted": true
}