{
  "article_id": "1d1bfb8236dd",
  "url": "https://www.caughtoffside.com/2023/05/31/pep-guardiola-sweating-over-the-fitness-of-four-major-man-city-stars-ahead-of-the-fa-cup-final/",
  "title": "Man City news : Four stars have injury concerns ahead of the FA Cup final",
  "date": "20230531T150000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With only a few days to go until the first all-Manchester FA Cup final, Pep Guardiola has injury worries over four major first-team stars.\nThe domestic showpiece represents stage two of what could be a remarkable treble for the club, though neighbours Man United and Erik ten Hag have their own domestic double to think about.\nNothing would surely give the Dutchman greater pleasure than being able to put a spoke in City’s attempts at emulating the great Man United side of 1999 who are, to date, the only English side that have won the treble of Premier League, FA Cup and Champions League.\nCity also have a date with Internazionale of Milan in the Champions League final a week after their derby date at Wembley, so Guardiola won’t want to risk playing anyone that isn’t 100 percent, potentially ruling them out of the European showpiece by so doing.\nKevin De Bruyne, Jack Grealish, Manuel Akanji and Ruben Dias are the quartet that have “niggles” according to Guardiola.\n“We had four, five players with niggles, not injuries. They were not fit for a few days,” he was quoted as saying by the Manchester Evening News.\n“[…] I don’t know. Wednesday they will train, or recovery session tomorrow. Hopefully, right now I don’t know.\n“The guys who are in Manchester, Ruben didn’t train for ten days, Jack Grealish neither. After Brighton Kevin felt the same feelings as before weeks ago.\n“They couldn’t play a few games. Not a big issue. I think they will be ready. They have to be ready in the training sessions.\n“That’s why today was so important to see these players how they are. Phil [Foden] is in incredible form, Riyad [Mahrez] play really well, Cole [Palmer] so active in many things.\n“We have to play who feels better in the final. That’s why it was good today to play with these guys and rest the other ones. Hopefully other players can recover.”\nGiven that City probably have the best squad depth of all of the teams in the Premier League, were any of the four unable to make it, Guardiola knows that he will be able to bring in others that can do a job.\nIt’s a luxury that not many managers can afford and it may be his saviour as he attempts another shot at football history.",
  "word_count": 392,
  "scraped_at": "2026-02-14T02:00:19.987963",
  "_text_extracted": true
}