{
  "article_id": "1d213df2700d",
  "url": "https://www.teamtalk.com/arsenal/declan-rice-position-becomes-clearer-as-fabrizio-romano-names-date-for-arsenal-to-unleash-opening-bid",
  "title": "Declan Rice position becomes clearer as Fabrizio Romano names date for Arsenal to unleash opening bid",
  "date": "20230601T220000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nDeclan Rice position becomes clearer as Fabrizio Romano names date for Arsenal to unleash opening bid\nDeclan Rice reportedly wants to stay in the Premier League, with Arsenal set to make their opening bid after the Europa Conference League final.\nThe future of the defensive midfielder has dominated the back pages in recent weeks after it became obvious he would leave West Ham. The 24-year-old has spent his entire professional career with the Hammers, making 204 Premier League appearances. He has enjoyed 244 outings in all competitions and found the net on 15 occasions.\nBut, with the England international ambitious to play Champions League football and his contract up next summer, the time is now right to depart.\nUnsurprisingly, several top clubs have expressed an interest, with Manchester United also thought to be keen.\nHowever, German giants Bayern Munich have recently emerged as suitors, with former Chelsea boss Thomas Tuchel now at the helm.\nA report in the Mirror earlier this week claimed the Bundesliga champions are ready to table a £95m bid for the star.\nHowever, with the East End outfit unlikely to entertain any offers below £100m, they might need to reconsider that number.\nBut it may be immaterial, with Mail Sport claiming on Thursday that Rice wants to remain in England.\nHe is said to be settled in London and wants to continue to live in the capital. That puts the Gunners firmly in the driving seat as regards luring him to the Emirates before the start of next season.\nIt will all come down to price, however, with the report adding that the north Londoners will offer £90m.\nWith that bid likely to be firmly rejected, it will then be up to the Arsenal hierarchy to come up with the goods.\nRice swansong to usher in Arsenal bid\nRice’s contribution to West Ham’s Premier League activities has ended but he still has one game left to play.\nDavid Moyes men take on Fiorentina in the Europa Conference League final on June 7.\nRice will take his place in the starting XI as the capital outfit look to claim their first European trophy since the 1964-65 season.\nAnd, according to Fabrizio Romano, Arsenal will see the final whistle of that match as the green light to act.\nThey will submit their opening offer, with West Ham set to hold firm in their pursuit of £120m.\nMoyes has always quoted that figure when asked about the Kingston upon Thames-born ace.\nUnited could well enter the equation, with a bidding war between the two clubs certainly a possibility.\nBoth Arsenal and the Red Devils enjoyed much-improved campaigns and are looking to build on their success.\nMikel Arteta’s side finished second after a battle with Manchester City for the title.\nAnd United could still walk away with two trophies, with the EFL Cup already in the bag.\nThey face City in Saturday’s FA Cup final, with Pep Guardiola’s charges still gunning for a treble.\nRice would fit into either side but if reports about his preferred choice of city are true, then Arsenal hold all the aces.",
  "word_count": 522,
  "scraped_at": "2026-02-14T01:48:17.242111",
  "_text_extracted": true
}