{
  "article_id": "1d31c835f507",
  "url": "https://www.fourfourtwo.com/features/the-most-iconic-goal-celebrations",
  "title": "The most iconic goal celebrations",
  "date": "20240119T163000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The most iconic goal celebrations\nFrom trademark moves to rehearsed routines and improvised moments of madness or rage, a look at some of the most iconic goal celebrations over the years...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSome players celebrate every goal in exactly the same way. Others improvise with moments of madness, occasional rage and sometimes provocation.\nAnd the bigger the goal or the occasion, often the more epic the celebration. Frequently, it is the important strikes which are accompanied by the most memorable reactions.\nFrom the brilliant to the boring, the arrogant to the amusing and the poignant to the provocative, a look at football's most iconic goal celebrations...\n32. Erling Haaland\nErling Haaland likes to express himself in different ways after his many goals, but for a time the Norwegian was best known for his trademark 'zen' celebration.\nThe pose comes from his love of meditation and was bizarrely mocked by the entire Paris Saint-Germain team in 2020 after their Champions League win over his old club Borussia Dortmund. A few years on, however, Haaland is a treble winner. Who's laughing now?\n31. Bafetimbi Gomis\nAfter scoring for Swansea City against Manchester United in 2015, Bafetimbi Gomis got down on his knees and crawled like a panther.\nThe celebration, which once scared a ball boy in Saudi Arabia, has been used by Gomis throughout his career. The celebration is thought to date back to his time at Saint-Ettiene, where he emerged as a young player, as homage to Salif Keita. One of the club's greatest, Keita was nicknamed \"the Black Panther\".\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n30. Vincenzo Montella\nDue to his small stature and trademark goal celebration, which saw him spread his arms wide like wings as he swooped from side to side, Vincenzo Montella was nicknamed \"The Little Aeroplane\".\nBest known for spells at Roma and Sampdoria, Montella put his celebration to good use in a successful career which yielded 228 club goals, plus three in 20 appearances for Italy.\n29. Temuri Ketsbaia\nTemuri Ketsbaia's bizarre celebration for Newcastle United against Bolton Wanderers in 1998 is more memorable than anything the Georgian did on the pitch in his three years at the club.\nAnnoyed at being left out of the starting line-up after injury, Ketsbaia popped up with a late winner at St. James' Park, threw his shirt into the crowd, tried to take his boots off and then proceeded to kick the advertising hoardings in a moment of rage. Ashamed of the incident, he claims to have never watched it again.\n28. Robbie Keane\nRobbie Keane scored 325 goals in an impressive club career and a record 68 for the Republic of Ireland. He was a great player, but his celebration was not quite so good.\nConsisting of a cartwheel, a forward-roll and a machine gun finale, it was amateur gymnastics at best. Playground stuff really. But he stuck to it throughout his career and it became his trademark.\n27. Raul\nUntil he was overtaken by Cristiano Ronaldo and later by Karim Benzema, Raul Gonzalez was Real Madrid's all-time top scorer with 323 goals for Los Blancos.\nThe former Spain striker kissed his ring finger after scoring, which might not be the most exciting celebration, but it became his trademark. He also famously put his finger over his lips after netting in a Clasico against Barcelona at Camp Nou in 1999.\n26. Facundo Sava\nFacundo Sava's time at Fulham was unremarkable in terms of his ability and contribution on the pitch, but the Argentine striker stood out in another way.\nSava would keep a mask in his sock and put it on for the celebration if he scored, which was only on seven occasions for the Cottagers. He had started the custom in Argentina, once donning a wolf mask after a late winner against Estudiantes. At Fulham, he used a Zorro mask and later a more traditional black and white face covering. He revealed he had been sent more than 250 masks by fans throughout his career.\n25. Edinson Cavani\nEdinson Cavani has scored hundreds goals in an impressive career – including 104 at Napoli and 200 at Paris Saint-Germain.\nThe Uruguay forward celebrates with his trademark bow and arrow celebration, which he says is a nod to his country's native people.\n24. Craig Bellamy\nCraig Bellamy was in the news ahead of Liverpool's Champions League clash against Barcelona at Camp Nou in 2007 for attacking team-mate John-Arne Riise with a golf club during a short trip to Portugal.\nBoth players started the game and fittingly, the pair scored the goals in an impressive 2-1 win for the Reds. After Bellamy's goal, the former Wales striker celebrated with an imaginary golf swing. Many of Liverpool's players laughed, but Riise later called it disrespectful.\n23. Samuel Eto'o\nJose Mourinho caused controversy in 2014 when he questioned the age of striker Samuel Eto'o. \"We have Eto'o but he is 32 years old, maybe 35, who knows?\" the Portuguese said in a press conference.\nThe Cameroonian responded brilliantly by scoring in Chelsea's next game, against Tottenham, and celebrated by the corner flag as he mimicked an old man in pain and struggling to walk.\n22. Julius Aghahowa\nMany players have celebrated with somersaults or back flips over the years, including Miroslav Klose, Obafemi Martins, Nani, Tresor Lomana LuaLua and Jose Dominguez – but none quite like Julius Aghahowa.\nThe Nigerian came to the world's attention at the 2002 World Cup, where he scored the Super Eagles' only goal – in a 2-1 loss to Sweden – and celebrated with six back flips and a somersault. Impressive, if a little showy.\n21. Alan Shearer\nWhen Alan Shearer scored, you always knew what was coming next: one arm raised in the air and a big grin as he ran off on his own.\nThe former Newcastle United, Blackburn and Southampton striker was mocked for the celebration by Micah Richards on a BBC Match of the Day podcast with Gary Lineker, but said it was \"better than good\" and reminded the former Manchester City defender he had done it 260 times, in reference to his Premier League goals record. You can't argue with that.\n20. Tim Cahill\nTim Cahill spent eight years at Everton between 2004 and 2012 and the Australian midfielder became known for his iconic goal celebration.\nCahill's boxing the corner flag routine was apparently first used by Australia team-mate in a friendly against Jamaica in 2005, but it was popularised by the midfielder and became his trademark.\n19. Jimmy Bullard\nWith Hull City 4-0 down to Manchester City on Boxing Day in 2008, manager Phil Brown took the unusual step of giving his half-time team talk on the pitch.\nSo when Jimmy Bullard levelled at 1-1 late on in the same fixture the following season, the midfielder re-enacted the scene, pointing at his team-mates and gesturing as they sat on the pitch. Superb.\n18. Emmanuel Adebayor\nEmmanuel Adebayor moved from Arsenal to Manchester City in 2009 and, upset by the nature of his exit from the Gunners, produced one of the Premier League's most infamous celebrations when he netted against his old club in a 4-2 win in September.\nAfter scoring a header to make it 3-1 to City, Adebayor turned and sprinted 90 yards to celebrate in front of the Arsenal end, sinking to his knees in front of the travelling supporters. Furious fans ripped out seats and had to be held back. Adebayor later apologised.\n17. Pierre-Emerick Aubameyang & Marco Reus\nAfter Pierre-Emerick Aubameyang scored to give Borussia Dortmund the lead against Schalke in 2015, the Gabon international and team-mate Marco Reus donned Batman and Robin masks in the celebrations.\nDortmund then scored a second through Henrikh Mkhitaryan a minute later and Reus made it 3-0 not long after that. Aubameyang later revealed that the masks were hidden behind the goal at the beginning of each half by his translator.\n16. Robbie Fowler\nUpset at constantly being targeted by rumours of drug use, Robbie Fowler hit back with a controversial celebration after scoring a penalty against Everton in April 1999.\nThe Liverpool striker kneeled down in front of the opposition supporters, held a finger to his left nostril and put his nose to the white of the byline as if he was snorting cocaine. He was hit with a four-match ban.\n15. Diego Maradona\nAfter a quick exchange of passes just outside the area with a couple of his team-mates, Diego Maradona took a touch and then powered a left-footed drive into the top corner.\nIt was an extraordinary goal, but the celebration raised suspicions as Maradona raced to the side of the pitch and screamed into a television camera, his eyes bulging. Days later, he was sent home for failing a drugs test and never played for Argentina again.\n14. Eric Cantona\nEric Cantona scored with a brilliant chipped effort for Manchester United against Sunderland in 1996 after beating two players, running forward and playing a one-two with Brian McClair – but his celebration is equally iconic as the goal itself.\nThe French forward, collar up, puffed out his chest and simply stood and span around slowly with an air of arrogance as he milked the applause before raising his arms. Classic Cantona.\n13. Mario Balotelli\nDuring his time at Manchester City, Mario Balotelli was regularly on the front pages of the tabloids for all manner of controversies off the pitch.\nAfter scoring in a derby against Manchester United in October 2011, the Italian hit back as he revealed an undershirt. \"Why always me?\" it read. City won the game 6-1 and that moment is remembered as one of the most iconic moments in the fixture's history.\n12. Fabrizio Ravanelli\nFabrizio Ravanelli's trademark goal celebration saw the former Italian striker pull his shirt over his head and run around the field.\nThe former Juventus and Middlesbrough striker celebrated every goal in that way and was unsurprisingly opposed to FIFA regulations introduced in 2004 which ruled that a yellow card be given for any player removing their shirt. Luckily for him, he was almost at the end of his career by then.\n11. Diego Maradona & Claudio Caniggia\nClaudio Caniggia scored a hat-trick for Boca Juniors in a 4-1 win over fierce rivals River Plate at La Bombonera in July 1996 and amid the wild celebrations, the forward famously shared a kiss on the lips with team-mate Diego Maradona.\nRiver had just had won the Copa Libertadores, while Boca were enduring a difficult season. But winning the Superclásico lifted their spirits and produced one of the most famous goal celebrations in Argentine football history.\n10. Lionel Messi\nLionel Messi points two fingers to the sky after every goal to remember his maternal grandmother, who first took him to play football when he was a child and argued with the coach that he should play – despite his small stature.\nBut after his 500th Barcelona goal gave the Blaugrana a 3-2 win at Real Madrid in added time in 2017, the Argentine produced a special celebration as he took off his shirt and held it up to the crowd at the Santiago Bernabeu. Iconic.\n9. Peter Crouch\nPeter Crouch has said he first did his robot dance at a house party at David Beckham's house. In England's 6-0 friendly win over Jamaica ahead of the 2006 World Cup, he showed it off to the world.\nGiven his 6 foot 7 inch (2.01m) lanky frame, the dance is pretty amusing. Crouch has admitted he would never would have done it if VAR had been around back then – for fear of having a goal ruled out afterwards. So we should be glad it wasn't.\n8. Andres Iniesta\nAfter scoring the most important goal in the history of Spanish football, Andres Iniesta peeled off his shirt to reveal a message for his friend. \"Dani Jarque, always with us,\" it read.\nEspanyol captain Jarque had passed away in 2009 after suffering a cardiac arrest at a training camp in Italy. After Iniesta's winner against the Netherlands in the 2010 World Cup final, the midfielder remembered his friend. In the celebrations after the match, team-mate Jesus Navas pulled off his shirt to reveal an identical message for Antonio Puerta, who had passed away after collapsing on the pitch in a Sevilla game against Getafe in 2007.\n7. Cristiano Ronaldo\nCristiano Ronaldo shouted \"Siuuu\" (which means yes in Portuguese) following his 2014 Ballon d'Or win and the superstar forward has bellowed out the cry after every goal he has scored since.\nRonaldo runs to the corner or the side of the pitch, leaps in the air and stretches out his arms. The celebration has become a global phenomenon, imitated by players all over the world and children everywhere. Cristiano's \"calma\" celebration for Real Madrid against Barcelona at Camp Nou in 2012 was also iconic.\n6. Jurgen Klinsmann\nJurgen Klinsmann arrived in England with the reputation of a diver, but won over plenty of his critics by showing his sense of humour on his debut for Tottenham in 1994.\nAfter scoring a header for Spurs in a 4-3 win at Hillsborough, Klinsmann threw himself to the ground in a mock dive and his team-mates followed suit in a memorable celebration.\n5. Roger Milla\nCameroon were one of the best stories at the 1990 World Cup and no player summed up the joy of their football more than 38-year-old striker Roger Milla.\nMilla scored four goals for the Indomitable Lions at Italia 90 as they reached the quarter-finals and celebrated each one by running to the corner flag and performing a little dance. Timeless.\n4. Wayne Rooney\nIn the build-up to Manchester United's Premier League game against Tottenham in 2015, Wayne Rooney appeared on the front page of a tabloid newspaper, apparently \"knocked out\" on his kitchen floor after a friendly boxing match with former team-mate Phil Bardsley.\nAfter scoring an impressive goal to put United 3-0 up against Spurs, Rooney responded by throwing a few imaginary punches and then comically falling backwards in a knockout blow.\n3. Paul Gascoigne\nAhead of Euro 96, England's players had faced criticism after pictures were published of the players on a night out in the Far East, having alcohol poured down their throats.\nAfter scoring a brilliant solo goal against Scotland, Paul Gascoigne lay down on the Wembley pitch as Alan Shearer, Steve McManaman and Jamie Redknapp poured liquid down his throat from a water bottle in a re-enactment of the \"dentist's chair\" routine. Epic.\n2. Marco Tardelli\nThis one is pure passion. Fists clenched, Marco Tardelli ran towards the Italian bench, screaming \"gol, gol\" after scoring against West Germany in the 1982 World Cup final.\nLater, he said: \"After I scored, my whole life passed before me – the same feeling they say you have when you are about to die.\" The Tardelli cry remains one of the most iconic moments in World Cup history.\n1. Bebeto\nAfter scoring against the Netherlands in the 1994 World Cup quarter-final, Brazil's striker Bebeto celebrated by rocking an imaginary baby alongside team-mates Romario and Mazinho.\nDays earlier, the player's wife had given birth to their third child. The celebration has been imitated on numerous occasions since, but the original is always the best. Brazil went on to win the World Cup eight few days later.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 2763,
  "scraped_at": "2026-02-14T02:25:18.577616",
  "_text_extracted": true
}