{
  "article_id": "1d3658d9d978",
  "url": "https://www.themag.co.uk/2024/06/newcastle-united-concerns-about-psr-maybe-for-a-year-or-two-but-not-for-long/",
  "title": "Newcastle United concerns about PSR ? Maybe for a year or two but not for long … ",
  "date": "20240612T121500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United concerns about PSR? Maybe for a year or two but not for long…\nNow we are in between seasons, we wanted to get a Newcastle United fans snapshot of opinion.\nThe idea is to get a range of views of what various Mag writers (Newcastle United fans) think about what has happened and the current position.\nThen most importantly, what is going to happen at Newcastle United moving forward.\nSo we have sent various regular and irregular contributors sets of questions, including some the same as others, some different.\nNext up we have Rex N:\nHow worried are you about PSR/FFP affecting Newcastle United’s chances in the 2024/25 season?\nFrom a recent article that The Mag were kind enough to host, it might be obvious that I am chilled overall.\nThere is enough value in older players to generate sufficient funds to provide development, combined with the Staveley consortium generating extra sponsorship and commercial revenues. We also have a market that Ashworth was unable to incorporate, out of contract players.\nHow worried are you about PSR/FFP affecting Newcastle United over the course of the next decade?\nLet’s start by saying revenues have increased from £140 million under Ashely to significantly over £300 million under new ownership. I don’t think that accounts for the current year will contradict that assertion.\nJust an example but the Saudi PIF have a stake in Carnival Cruises, amongst other high value tertiary/service industries. The wage ratio has already come down from around 95% to about 75%.\nWhat better way to do a pre-season tour of Australia and Japan than on a cruise after a flight on a Saudi airline?\nFFP, PRS and any future guise will change. The system is not fit for purpose but may become so.\nWorried? Maybe for a year or two but not for long.\nThree words to describe how you currently feel as a Newcastle fan?\nShort term, “twitchy“. What will happen in the transfer market this year?\nMedium term, “cautious“, knowing that there are some tough decisions on squad with top defenders out for the start of next season and aware of financial constraints.\nLonger term “excited” seeing how the current ownership consortium has invested wisely in the squad, boosted revenues and knowing there is more to come.\nThree words to describe Eddie Howe?\n“Best British manager”, justified by league tables.\nI was tempted to have one of the words as “God”, since Bruno told us his future is in God’s hands.\nKK had that status and I’ll give Eddie the leeway to prove that he can be more omnipotent than the last God.\nIs it still a Premier League big six, or is it seven (incl NUFC), or is it an eight (incl NUFC and Villa)?\nThings change over time.\nIn Freddie Shepherd’s days I always argued that we should hang on the coat tails and take advantage of any slips from those in the hot seats. It would have been a similar strategy from any of those on the periphery.\nFor the time being, it looks like a big three, obviously Man City (once nowhere near the four), Arsenal (back in after finally getting a post-Wenger direction) and the former Liverpool manager, Klopp, remembering that Rafa also won a Champions League with them.\nMan U no longer have Ferguson but have revenues. Despite that, they can’t afford to pay adequate compo for a Sporting Director so can they realistically be counted?\nThe Russian rug has been pulled from under Chelsea.\nSpurs did OK this year but can they push on? They don’t have another Kane to sell.\nVilla have a manager we shortlisted.\nOK, it’s me being me but there is that top three. We are among the challengers.\nNone of the rest of us can claim anything, probably for the next few seasons until any of us can achieve Champions League qualification for a few years in a row – but let’s enjoy the battle.\nWhat do you think Eddie Howe’s first choice eleven will be next season, with all the current squad available and the summer signings you think will be made. So if you think in a position a summer signing will be Eddie’s first choice, please just put ‘summer signing’.\nWhich part of the season do we mean? It will change over time as Eddie gives players a chance to adapt to the Premier League.\nSorry about the qualifications but the situation will be fluid, particularly carrying injuries:\nPope\nLivramento, Schar, Burn/Kelly/Botman(?) Hall\nTonali, Joelinton, Bruno/Rabiot/Miley (depending on transfer market)\nRaphina, Isak, Gordon (or Barnes if the Liverpool connection has not been overhyped).\nAs for the bench, it’s Fantasy Football time.\nWhat do you see as the minimum this season?\nExpecting investment, pressure will be on Eddie.\nPresuming he will be backed, Europa League, whether by league position or a domestic cup (without relegation).\nHand on heart, where do you think Newcastle will finish in the 2024/25 Premier League?\nIt will change over time but without UEFA distractions and the injuries that can go with it, top five.\nThe best five NUFC performances last season (in order)?\nYou have to put home to PSG at the top of the list.\nManUre away in the League Cup hinted at breaking the mould\nWest Ham at home was a marker for resilience\nCompleting the double over Villa hinted at better things\nThe Spurs demolition, another Septic target.\nOutside those top five, the eight goals from eight players against Sheffield United hinted at a top four place had we not suffered so much through injuries, culminating in a record Premier league tally against the same opponent home and away.\nThe five most important Newcastle players for this 2024/25 season (in order)?\nThe Mag can set challenging tasks!\nJoelinton, given how we suffered from his absence.\nBruno, especially avoiding a suspension in the second half of the season.\nIsak, whose goals make him a realistic challenger for the two places above him.\nGordon for threat and consistency and a good challenger for any of the places above him.\nSchar for his consistency after having been written off by some pie muncher who once managed NUFC.\nWhat do you think should happen with VAR, what changes or get rid of altogether?\nLearn from where other sports have been successful, such as tennis, cricket and mostly rugby.\nFirstly, change the rules so that if a foot overlaps with the defender, benefit of the doubt is given to the attacking side so onside. At the same time, adopt semi-automated offsides.\nDecisions to be made public over the stadium PA system.\nBoth sides to be allowed three appeals per half, an extra appeal per half in extra time in cup competitions. If an appeal is considered “vexatious”, the team captain can be given a yellow card.\nIf a decision can not be made within a minute, including at least three camera angles, the decision is not “clear and obvious”.\nPress a magic button and have a 62,000 capacity enlarged St James’ Park in place, or a brand new 80,000 capacity stadium just up the road at Castle Leazes ?\nA subject close to my heart.\nWhen tickets have been available, my kids get priority. So being greedy, more chance to go myself if we got the 80,000 stadium. Memories are with my late father at the current SJP.\nUltimately, the higher figure is best for the future of the club, even if it can’t be at the current SJP. With the Reubens having invested in Newcastle as a whole, there could be extra spin-offs for hotels and conference facilities being integrated into a totally new stadium.\nAt the risk of stirring a hornets’ nest, I would be happy with a “Sela St James’ Park” hosting concerts, rugby, cricket, boxing events if it gives us an edge.\nIf we ask a different question for our kids, we may come up with a different answer to the one which tugs at our heart strings. Will the current SJP be adequate when my children introduce their children to NUFC? There is only one answer and I would like my ashes to be scattered at our future long-term home.\nUpcoming 2024/25 season, would you rather win League Cup or finish Premier League top four?\nTop four gives us the ability to invest and reinvest.\nAs things stand, what could this NUFC squad be capable of next season?\nThis squad, top eight. With a few additions, top four. The key will be who we buy to improve on the older squad members that we sell.\nYour thoughts on Sandro Tonali as he is set to be available to play from the end of August 2024 onwards?\nHe is a talent, he should be hungry.\nOne of my biggest mistakes came when I was one of the flavours of the month with Radio 5 and slated Joey Barton for being sent off against Liverpool. His rehabilitation was remarkable. Tonali has manned up and served his punishment. The simple message to Tonali is “inspire us”.\nHe has my backing and from my social circle, has backing elsewhere.\nScale of 1-10, how interested in England at the Euros?\nInterested in two of the 26 man squad, unless we sign anyone else in it. Let’s go for one out of ten.\nHow much of a difference, if any, does it make having two NUFC players in the squad and/or England playing at SJP for a change in the warm up friendly v Bosnia?\nPlayers in the squad, yes. I hope that SJP hosting generated extra revenue for FFP/PRS purposes.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1615,
  "scraped_at": "2026-02-14T01:57:18.901609",
  "_text_extracted": true
}