{
  "article_id": "1d382bedcb2c",
  "url": "https://www.justarsenal.com/shearer-picks-four-arsenal-stars-in-his-combined-starting-xi-with-man-city/376404",
  "title": "Shearer picks four Arsenal stars in his combined starting XI with Man City",
  "date": "20240921T194500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alan Shearer has revealed his combined starting XI of Arsenal and Manchester City players ahead of this weekend’s Premier League clash.\nFor some time now, Arsenal and City have been the top two clubs in the Premier League, competing for the title in consecutive seasons.\nThis weekend’s match could be one of the most-watched fixtures in European football, with the Gunners eager to secure a win.\nBoth teams have started the season in excellent form, but City had more players featured in Shearer’s combined starting XI.\nAs revealed by The Sun, Shearer named Gabriel Magalhaes, William Saliba, Jurrien Timber, and Bukayo Saka from Arsenal, with the other slots going to City.\nHe predicted the match’s result, saying:\n“I am going for a draw in this one.\n“It’s a long week with both teams having played in the Champions League as well, so a draw for both teams isn’t a bad result, even though Man City are at home.\n“Liverpool have dropped points already, Arsenal have dropped two points already at home to Brighton, but I don’t think a draw would be a disaster for either team.”\nJust Arsenal Opinion\nWe do not need to have more players in Shearers combined XI to win that game and hopefully, the boys will get the job done.\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 288,
  "scraped_at": "2026-02-14T02:20:44.348234",
  "_text_extracted": true
}