{
  "article_id": "1d55c3fb0ae0",
  "url": "https://allafrica.com/stories/202507070761.html",
  "title": "Africa : CAF Unveils Technical Study Group for TotalEnergies CAF Wafcon , Morocco 2024",
  "date": "20250707T173000Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- TSG to be led by Raul Chipenda and will feature Shilene Booysen, Lamia Boumehdi and Clementine Touré, among others\n- Team to share technical & tactical insights on all 26 matches\n- Group to produce a post-tournament technical report\nThe Confédération Africaine de Football (\"CAF\") has unveiled the Technical Study Group (TSG) for the TotalEnergies CAF Women's Africa Cup of Nations (WAFCON) Morocco 2024.\nThe Technical Study Group (TSG) of the WAFCON 2024 Confédération Africaine de Football (\"CAF\") is a team of experienced football experts, former coaches, technical directors, instructors, and analysts, tasked with studying, analysing, and documenting CAF competitions.\nThey will analyse tactical trends, playing systems, and individual and team performances, producing detailed technical reports that summarize these observations. These reports not only highlight strategies and best practices but also provide practical recommendations to CAF Member Associations, coaches, and development departments to help elevate the standard of the game across the continent.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nIn addition to analysis and reporting, the TSG will select official awards such as \"Woman of the Match,\" \"Best XI,\" and the tournament's best player, goalkeeper, or young talent. They will also contribute to CAF's broader technical strategy by supporting coaching education, creating learning materials, and sharing findings from tournaments through workshops and courses.\nUltimately, the TSG's work helps align CAF's development initiatives with CAF's development strategy, ensuring continuous improvement in coaching standards, player development, and the overall quality of football in Africa.\nThe TSG members for WAFCON 2024, led by the director of CAF Technical development division, Raul Chipenda, are also tasked with providing a Fair play report after each match.\nMeet the TotalEnergies CAF WAFCON 2024 Technical Study Group:\nSheryl Botes (South Africa)\nA senior CAF coaching instructor and long-standing women's football advocate, Botes brings decades of experience in technical development, coach education, and tournament analysis across the continent. Currently, Sheryl is serving as the head coach of the Uganda women's national team.\nLeah Sweetness (South Africa)\nWith a strong background in women's football development, Sweetness is a CAF-certified instructor and former player dedicated to nurturing young talent and advancing the women's game in southern Africa. She is the TSG lead for the COSAFA Zone.\nLamia Boumehdi (Morocco)\nA former coach of the Morocco U20 Women's National Team, Boumehdi has been instrumental in the rise of Moroccan women's football, contributing both at club and national levels with a focus on technical excellence and youth progression. She guided TP Mazembe to a first ever CAF Women's Champions League title 2024.\nRadia Fertoul (Algeria)\nA former head coach of the Algerian women's national team, Fertoul is a respected tactician with rich experience in North African football. She has also served as a development coach and mentor for young female athletes.\nJacqueline Shipanga (Namibia)\nOne of the most recognisable figures in Namibian football, Shipanga is a CAF and FIFA coaching instructor and former Brave Gladiators coach, known for her leadership in both technical and administrative roles. Shipanga is the technical director of the NFA, the only women to occupy the role in our continent currently.\nShilene Booysen (South Africa)\nBooysen is a highly regarded tactician with experience coaching South Sudan's women's national team and as a former analyst for Banyana Banyana. Her deep analytical approach makes her a key member of the group.\nClementine Touré (Côte d'Ivoire)\nShe is the former head coach of Côte d'Ivoire's women's national team, Touré is a trailblazer in African women's football. She led Equatorial Guinea to the 2011 FIFA Women's World Cup and has vast experience at WAFCON level. She also served as TSG in both 2019 and 2023 FIFA Women World Cups.\nBernadette Anong (Cameroon)\nA former Indomitable Lioness and current coach, Anong is deeply involved in talent development in Cameroon. She brings a blend of tactical insight and player-centred analysis to the TSG. Anong was part of the coaching staff that lead the Cameroon women national team to their First World Cup and Olympic qualifications.\nThe TSG's work will be published in a post-tournament technical report that will inform future training, talent identification, and development programmes across the continent.\nAs the TotalEnergies TotalEnergies CAF Women's Africa Cup of Nations (WAFCON) Morocco 2024 kicks off on Saturday, 05 July, the TSG team will be at the heart of CAF's mission to deepen the understanding of the women's game and further elevate its standards.\nFor more information on the TotalEnergies CAF Women's Africa Cup of Nations, Morocco 2024, visit www.cafonline.com.\nFor further Inquiries:\nCAF | Communication Department",
  "word_count": 756,
  "scraped_at": "2026-02-14T01:49:44.683967",
  "_text_extracted": true
}