{
  "article_id": "1d882685e13e",
  "url": "https://www.themag.co.uk/2023/05/will-brighton-be-allowed-to-play-in-champions-league-if-finishing-top-four-newcastle-united/",
  "title": "Will Brighton be allowed to play in Champions League if finishing top four ? ",
  "date": "20230502T114500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Will Brighton be allowed to play in Champions League if finishing top four?\nOne interesting developing sideshow in the EPL is that Brighton now have a huge say in who ends up in the top five.\nThey have to play all of the current top five with the exception of Scousepool.\nSo not only is a top five finish entirely in their own hands but they could also have a huge impact on the top five placings as a whole.\nHowever, maybe the most interesting question is, what will happen in the event that Brighton get a Champions League place? Will they be able to take it?\nAs things currently stand, Tony Bloom’s other club Union Saint-Gilloise (USG) are involved in the four team Jupiler Pro League Championship Play-offs in Belgium. The previous points accumulated of all teams are halved and they then play six extra games in a mini league set-up to decide who are the Belgian Champions and who gets the European places.\nThe team in first place after these extra six games each are played, enters the Champions League at the final preliminary stage. Second placed enters the Champions League at the second preliminary round of the Champions League, third place enters the Europa Conference league at the second preliminary round… are you still with me?\nThe fourth placed team will then play against the winners of the Jupiler Pro League European Play-Off Championship (the next four highest placed teams in the Jupiler Pro League – also playing in a six match mini league) for the final Europa Conference league place.\nThere are even more complicated scenarios involving cup winners and teams finishing top before the play-offs but ending in fourth position… but let’s not go there!\nBefore round one of the play-offs, USG and Genk were level on 38 points, Antwerp 36 points and Club Brugge 30 points. With only 18 points to play for, that puts Club Brugge at a severe disadvantage and they have already lost their first match against Genk. USG are up next against Antwerp.\nShould USG end up in one of the two Champions League places, then that will be very interesting should Brighton also secure a Champions league slot.\nClubs owned by the same person or legal entity can’t play against each other in a UEFA competition. In this scenario, the club finishing highest in their national league takes the Champions League slot, presumably the unlucky club dropping into a lower ranked competition.\nHowever, you may or may not remember that RB Leipzig and RB Salzburg successfully argued that after board level restructuring and other ‘reorganisation’ in staffing and accounting, that the people making the decisions and exerting influence were not the same people at both clubs…\nTony Bloom, while holding the controlling stake in both clubs, has apparently no decisive voting rights at USG. That power officially lies with the minority stakeholder Alex Muzio.\nWhile you can be fairly certain that someone like Tony Bloom will have dotted all of the Is and crossed all of the Ts in terms of UEFA’s rules, is the separation between ownership and decision making credible?\nOf course there is nothing to stop a disgruntled EPL team heading to the courts with this should Brighton deprive them of their rightful Champions League slot. I can’t imagine NUFC’s owners doing that as I imagine that the much rumoured KVO takeover will be along similar lines… majority ownership with minority voting rights.\nIf I was a betting man, I would suggest that such a challenge would come from one the European Super League founders.\nYou can already see Klopp getting worked up about it now.\nHaving watched the Scousepool vs Spurs match I think that Liverpool were very lucky to win the game, finish the game with ten men on the pitch and a manager in the dugout.\nI used to like Jurgen Klopp when he first arrived in the EPL: with his talk of heavy metal football and vision for how the game should be played, he was a breath of fresh air.\nWhy couldn’t we couldn’t Newcastle United have a manager like that?\nMoving on a good few years, he’s become like the embarrassing old uncle at the wedding reception.\nClippety should really have a word with himself.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 729,
  "scraped_at": "2026-02-14T02:12:37.692668",
  "_text_extracted": true
}