{
  "article_id": "1d901f05f8b6",
  "url": "https://www.nytimes.com/athletic/6177382/2025/03/06/club-world-cup-teams-clubs-2025/",
  "title": "What teams think of the 2025 Club World Cup : Opportunity , concerns and financial benefits",
  "date": "20250306T060000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The expanded Club World Cup begins in 100 days, with the 32-team tournament taking place in the United States from June 14.\nIt is the first time the club edition of the World Cup will mirror the national team version of the tournament. There have been worries about the additional workload on players — FIFPro and the World Leagues Association threatened legal action in May last year. There are also concerns over high ticket prices.\nAdvertisement\nFIFA announced there will be $1billion (£775m) in prize money for the Club World Cup, which will be distributed among all 32 clubs. FIFA president Gianni Infantino said, “All revenue generated by the tournament will be distributed to the participating clubs and via club solidarity across the world, as FIFA will not keep a single dollar.”\nSo how do the clubs themselves feel about the tournament? The Athletic has approached teams and senior figures at clubs for their perspective on the competition. Fifteen of the teams involved responded to our enquiries. Unless otherwise noted, those spoken to did so under the condition of anonymity as they did not have permission to speak.\nHere, we share their perspectives on the Club World Cup.\nChelsea (England)\nChelsea have been taking the tournament seriously for a long time.\nThe first indication was the decision to part ways last May with head coach Mauricio Pochettino because they did not want any uncertainty over the role going into the Club World Cup. Pochettino was given only a two-year deal with an option for another 12 months in 2023. His replacement, Enzo Maresca, was handed a five-year deal.\nSenior players who departed on loan in the January window, including Joao Felix and Renato Veiga, have clauses that mean they can return before it begins (loan agreements normally last until June 30), giving Chelsea the strongest squad possible.\nChelsea have not agreed a front-of-shirt sponsor for this season but believe being on display in America can help their bargaining position in ongoing talks with interested parties. They also see it as a genuinely good opportunity to win some silverware.\nSimon Johnson\nSeattle Sounders (U.S.)\nThe Sounders look at the Club World Cup as a “generational” opportunity. After playing in the 2022 Club World Cup in Morocco, Seattle see this tournament as a showcase for the city, the fanbase and the club.\nAdvertisement\nWith a chance to play in front of their home supporters against Atletico Madrid and Paris Saint-Germain, the Sounders believe it’s a rare opportunity to showcase themselves as a marquee franchise in MLS and one of the top clubs in the Americas.\nSeattle will also host several games at the 2026 World Cup, including a U.S. men’s national team group-stage game, and believe the tournaments are a chance to advertise the city’s support for soccer across the globe. In a way, it’s putting the Sounders in the shop window for potential players and new fans.\nPaul Tenorio\nJuventus (Italy)\nLike most Italian teams, Juventus regard the United States as a key market for winning hearts, minds and the commercial revenue that tends to follow in their wake. The club’s executives, though, are inclined to take the radical step of treating the Club World Cup not as a month-long marketing activation but as an actual sporting competition.\nPartly that is a practical approach: the tournament is busy and geographically widespread, leading executives at the club to believe that opportunities for commercial events will likely be limited.\nBut it is also rooted in the circumstances of Juventus and Italian football as a whole, which executives believe means the team enters the tournament with more in common with the South American contingent than the giants of the Premier League and Champions League.\nThe best way to appeal to a new audience, Juventus feel, is to prove that they can compete with Manchester City, Real Madrid and Bayern Munich. And that means taking the tournament as seriously as possible.\nRory Smith\nAl Ahly (Egypt)\nAl Ahly are looking forward to the tournament and want to present themselves to a wider audience, especially considering they will open the tournament against Inter Miami.\nThe record 12-time CAF Champions League winners want to face the best teams in the world and view the Club World Cup as an opportunity to test themselves against different opponents on the global stage — similar to the previous versions of the competition where they finished in third place on four occasions. It’s also a learning experience off the field as the tournament will allow the club to interact and connect with teams from around the world.\nParticipating in the Club World Cup is viewed as a crowning of Al Ahly’s domestic and continental achievements in the past couple of years.\nAdvertisement\nEven if their chances of winning the whole thing are slim, they are heading to the U.S. to do their best.\nAhmed Walid\nWydad AC (Morocco)\nFor Wydad, the Club World Cup represents an opportunity in many ways. The first and most obvious is money: last year, 30 per cent of their revenue came from participating in the CAF Champions League, but this year they didn’t qualify, so a financial gap needed to be filled. The roughly $50million (£39m) they will earn just for participating in the Club World Cup will plug that gap and then some.\nThat money will, they hope, allow them to close the gap slightly with European teams on player trading. If they negotiate with a potential signing and a European team made any kind of offer, they simply couldn’t compete. With this additional income, they hope this will change. They look to the basketball arm of their club, which can attract American players because there is less of a financial disparity between them and some European clubs.\nInterestingly, they could also parlay their appearance at the Club World Cup into a conversation about being part of a multi-club ownership group. To this point, European-based models, such as Red Bull or City Football Group, have mostly shown little interest in acquiring an African club for a variety of reasons — sporting, economic, organisational — but the hope is that a decent showing at this tournament might make them more attractive as a takeover target.\nNick Miller\nMamelodi Sundowns (South Africa)\nWhen Sundowns goalkeeper Ronwen Williams was nominated for the Yashin Award at the Ballon d’Or ceremony in 2024, he told The Athletic that the Club World Cup “…can help people realise the gap isn’t quite as big as it seems”.\nHe wasn’t referring to non-Africans. Instead, he believes the competition can help players from his continent realise how talented they are.\nAdvertisement\nTo say Williams is excited about travelling to the United States is an understatement. “We can’t wait to be a part of it, to try to open doors for African football,” he said.\nSundowns have become one of the most talked-about clubs in Africa over the past decade due to investment from mining tycoon Patrice Motsepe, who is also the president of the Confederation of African Football (CAF). While the club have won nine of the last 11 South African Premiership titles, they have only lifted one CAF Champions League trophy, back in 2016.\nThe Club World Cup has been high on their agenda for some time, with weekly meetings centred on media engagement and ticketing.\nThe U.S. gives Sundowns the opportunity to globalise their brand in new markets. With a significant African diaspora in the U.S., Sundowns hope to engage new fans who can identify with the club’s story as well as the abilities of their players.\nSimon Hughes\nPalmeiras (Brazil)\nPalmeiras are still waiting on clarity for certain elements of the tournament — like how the prize money will be distributed. But they are understanding, given it is the first edition of the tournament, and they have been impressed by how quickly FIFA have responded to their other queries.\nThe club view it as an important tournament both in sporting and marketing terms, given the global visibility. They are aiming to make the most of the opportunity commercially and have worked on their squad in a bid to go far in the tournament.\nMario Cortegana\nFluminense (Brazil)\nFluminense lost 4-0 against Manchester City in the final of the Club World Cup in 2023 but are animated by the opportunity to test themselves against other global heavyweights.\nThe club do not expect a huge surge in sponsorship income — there are strict rules governing the number of brand logos visible on shirts, for instance — but expect to reap more indirect benefits from increased international brand recognition.\nThe prospect of a showpiece match against Borussia Dortmund, plus the realistic possibility that Fluminense will progress from a fairly weak group (Sundowns and South Korean side Ulsan are their other opponents), also proved to be a big draw with transfer targets in the last Brazilian off-season.\nJack Lang\nAdvertisement\nBotafogo (Brazil)\n“It has been many years since Botafogo have competed on a global stage,” John Textor, the majority owner and chairman of Eagle Football Holdings Limited, Botafogo’s leading shareholder, tells The Athletic. “So the chance to play the best teams in the world, in the biggest media market in the world, is incredibly important as we try to reestablish our reputation among the world’s greatest clubs.\n“Our fans are excited, too, for these very same reasons. Our club is known as ‘the most traditional’ and ‘the glorious’ based on its historic reputation as a ‘grandfather’ of Brazilian football, so they have yearned for the return of our club to a position of global prominence. We are just starting to rebuild that reputation, forgotten for many years, and this opportunity in the United States is the first step. Truth be told, our fans will expect much more. They expect us to win.\n“It’s a huge story in Brazil. Four big clubs, all participating against the best in the world… it’s been many years since Brazil has seen such an opportunity.”\nMatt Slater\nFlamengo (Brazil)\nJose Boto, Flamengo’s director of football, told The Athletic: “Flamengo views the creation of the new Club World Cup with great enthusiasm and congratulates FIFA for this initiative, which is a milestone in the evolution of global football. Bringing together the best clubs in the world in an innovative format is a great step towards further strengthening club football and providing a unique experience for players and fans.\n“For us, it is an honour and a privilege to have the opportunity to represent Brazil and South American football at this event. We are confident that the United States, with its world-class sporting infrastructure, will offer modern and optimal facilities for the competition, providing all the necessary conditions for a tournament of the highest level.\n“The history of hosting major events, such as the 1994 World Cup and various editions of the Olympic Games, is a benchmark of attendance and public enthusiasm on U.S. soil. In addition, the proximity of the 2026 World Cup further reinforces the interest and growth of football in the region.\nAdvertisement\n“We believe this edition of the Club World Cup will be an absolute success, both in terms of infrastructure and audience, further consolidating football as a truly global phenomenon.”\nMario Cortegana\nManchester City (England)\nCity are embracing the revamped format and the chance to add a new trophy to their collection.\nAlthough more games seem to be the last thing they need this season, the money involved appeals to the more financially minded members of the hierarchy, while Guardiola’s stance is similar to his outlook on pre-season tours: he and his players will go wherever the club need them to.\nOnce they’re there, they’ll try to win.\nSam Lee\nReal Madrid (Spain)\nThe board at Real Madrid are generally in favour of the Club World Cup, but president Florentino Perez, head coach Carlo Ancelotti and some players have highlighted their concerns over the calendar. They were also surprised by how late the dates were confirmed, along with venues and who they would face.\nHowever, they issued a statement in June last year after Ancelotti expressed his doubts in an interview: “At no time has Real Madrid questioned its participation in the new Club World Cup to be organised by FIFA. Our club will play, as planned, this official competition that we face with pride to make our millions of fans around the world dream again with a new title.”\nDespite their doubts, they consider the tournament to be very important for marketing and finances. If they win the final, it could be worth around €100million (£84m; $108m) to them. Madrid also have a good relationship with FIFA.\nSince the pandemic, all of Real’s pre-seasons have taken place in the U.S. and it is undoubtedly the market that attracts and interests them the most.\nMario Cortegana\nBayern Munich (Germany)\nBayern are really popular in the U.S. and are looking forward to spending time directly with their fans and fan groups over there — they have offices in America, so there’s a big opportunity to show their best face in a competitive environment. Given German football’s restrictions and the staging of competitive games abroad being a non-starter, this is a rare chance to do something different.\nAdvertisement\nThere is some trepidation about the tournament’s popularity and a bit of bewilderment over the timing of their games — a couple of them kick off at 3am CEST, which hardly suits their domestic fans. There have already been murmurs of discontent from ultra groups in response to that scheduling as well as some of the exorbitant ticket prices being charged.\nBayern are braced for tension. Playing in front of long-distance fans is one thing, but taking competitive matches away from season ticket holders and pricing them out of attending is a new issue for German football and one that will not be resolved quietly.\nSebastian Stafford-Bloor\nParis Saint-Germain (France)\nSources close to the hierarchy at Paris Saint-Germain admit the organisation behind the Club World Cup has not been perfect, but they think it is a positive for football’s ecosystem. There is also a belief that it would be the wrong tournament to target over workload concerns. The Club World Cup already exists — it is only being revamped — and it is only going to run every four years.\nThere is also positivity over the deal with DAZN and the addition of new commercial partners — and the potential redistribution of money from the tournament. For PSG, the income will be significantly higher than what would be generated from a pre-season tour.\nHowever, there are concerns over filling the stadiums in the U.S. Sources at PSG hope there will be a significant push — possibly even involving President Donald Trump — to shift tickets before the tournament kicks off. In all, it is viewed by those close to the hierarchy as a potential cherry on the cake for the season.\nMario Cortegana\nBorussia Dortmund (Germany)\nFinancially, the Club World Cup comes at a convenient time for Dortmund. They sit 10th in the Bundesliga and only have an outside hope of playing Champions League football — and benefiting from its riches — next season. The payday FIFA is promising the participating clubs will be invaluable, then, particularly with the squad due to undergo a major rebuild in the summer\nAdvertisement\nSocially, it’s an opportunity. Dortmund are among a group of clubs at the top of German football who believe that the domestic game should be doing more to grow itself and that other teams in the division should be spending more time in fertile markets, including the United States. And, given there is no hope at all of ever playing Bundesliga games outside Germany — fan power makes that impossible — this will be as close as the club gets to being able to export an authentic version of themselves.\nHow successful will the tournament be? The club are not sure. Kick-off times are inconvenient for German supporters and it’s unclear what kind of traction the competition will have with U.S. supporters.\nOne strange technical detail to add: Chelsea midfielder Carney Chukwuemeka is on loan at Dortmund, but that deal — provided it is not made permanent — will expire between the end of the Bundesliga season and the start of this tournament. He has started promisingly in Germany, with a few exciting cameos, but that may not be relevant in Dortmund by the summer.\nSebastian Stafford-Bloor\nAtletico Madrid (Spain)\nThe Club World Cup is seen as a big opportunity — on lots of different levels.\nSenior figures at Atletico were very proud to have qualified, especially qualifying ahead of Barcelona as one of the two clubs involved from La Liga, and believe it demonstrates the club is part of the European elite.\nLast summer’s €200million investment in new players — including €75m for Argentine World Cup winner Julian Alvarez and €42m on England international Conor Gallagher — was also made knowing that a deep squad would be required for what was going to be a very long season for Diego Simeone’s side.\nClub CEO Miguel Angel Gil Marin and president Enrique Cerezo attended December’s draw in Miami and Atletico are very keen to promote the club brand in the U.S., having visited in pre-season regularly in recent summers.\nAdvertisement\nGil Marin and Cerezo will probably sell their majority stake within the next five years. Atletico are part-owned by U.S. investment manager Ares Management Corporation, which increased its share last summer. Winning a prestigious international tournament on American soil would make the club even more valuable to interested buyers.\nDermot Corrigan\nRed Bull Salzburg (Austria)\nThe club’s individual approach might be better reflected through the prism of the Red Bull network as a whole, for whom the U.S. is a big footballing focus.\nLast summer, RB Leipzig were delighted with the reception they received around their games in New York and Miami, where they played Aston Villa and Wolverhampton Wanderers and held a range of coaching seminars and activation events. It was the first time the club had toured outside Europe and given the ideological opposition and cynicism they face domestically, the U.S. sports culture — combined with Red Bull’s existing presence in MLS and across international sport — is an easier environment in which to operate.\nExpect Salzburg to embrace those opportunities in much the same way. They have not had an easy season and might not be much of a factor in the tournament itself — a group with Al Hilal, Pachuca and Real Madrid looks tough — but there’s plenty of enthusiasm about exporting the brand.\nSebastian Stafford-Bloor\nInter Miami (United States)\nSince signing Lionel Messi, owner Jorge Mas has spoken about the club’s ambition to become a global brand. The worldwide proliferation of pink Inter Miami jerseys is a testament to the progress made.\nThe Club World Cup offers a chance to put the actual soccer product on a stage for the world to see.\n“It’s a difficult group that presents challenges, but I am very hopeful to compete,” Mas said last year. “A good tournament for the team would be to make it out of the group stage and compete. Our first objective is to make it out of the group stage and then compete with those who qualify to the next round.”\nAdvertisement\nMessi acknowledged the value of the tournament for a league and a team that are still trying to gain respect in the eyes of the world.\n“This is very important for the club, especially, to participate for the first time in a World Cup that will take place in the country and for MLS to have two teams is a wonderful thing,” Messi said in an interview with Apple Music. “Everything that’s happening creates an opportunity for MLS to keep growing in football, as a league, and for other players to have the opportunity to come and keep growing.\n“Football is different from the sports they are accustomed to watching in the U.S. and it should be managed differently. It’s a different sport and this is an opportunity to change the chip, to shift, and for MLS to continue maturing.”\nPaul Tenorio\n(Top photo: Brennan Asplen/Getty Images)",
  "word_count": 3375,
  "scraped_at": "2026-02-14T02:11:32.329487",
  "_text_extracted": true
}