{
  "article_id": "1dbfc7c5c7cf",
  "url": "https://www.businesstimes.com.sg/lifestyle/modric-bemoans-cruel-late-draw-italy-euros",
  "title": "Modric bemoans  cruel  late draw with Italy at Euros",
  "date": "20240624T231500Z",
  "domain": "businesstimes.com.sg",
  "source_country": "Singapore",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Croatia’s Modric bemoans ‘cruel’ late draw with Italy at Euro 2024\nLUKA Modric said Italy’s last-gasp equaliser was a “cruel” way for Croatia to be pushed to the brink of elimination from Euro 2024 on Tuesday (Jun 25).\nThe 38-year-old became the oldest goalscorer in European Championship history when he prodded home in the 55th minute to put Croatia on track to reach the knockout phase for a fifth straight major tournament.\nBut Mattia Zaccagni’s curling strike in the eighth and final minute of added time snatched Italy a 1-1 draw which put the defending champions into the last 16.\n“We kept battling right until the end but unfortunately football was merciless with us tonight,” said Modric. “It was cruel, but that’s part and parcel of football.”\nCroatia finished third in Group B behind runners-up Italy and Spain.\nThey will be knocked out of the tournament on Wednesday morning if England do not beat Slovenia 3-0 or by four goals, or if Denmark fail to defeat Serbia.\nNavigate Asia in\na new global order\nGet the insights delivered to your inbox.\nCroatia, semi-finalists at the last World Cup in 2022, were the better side for long periods against Italy in Leipzig, missing chances to score a second goal late on.\n“It’s hard when you lose like this to find the words to describe how you feel,” added Modric, whose goal came less than 60 seconds after he had a penalty saved by Gianluigi Donnarumma.\n“Perhaps it’s unfair because we all really fought for Croatia right from the first whistle until the last. We should be proud of the way we represented our country tonight.”\nModric is playing in his fifth Euros and has also appeared at four World Cups.\nBut he said he would not be retiring from football yet, as he continues to perform at the highest level after also winning his sixth Champions League title with Real Madrid earlier this month.\n“I’d like to keep playing forever but there will probably be a time I’ll have to hang up my boots,” Modric said. “I’ll keep playing on, I don’t know for how much longer.”\nHis first European Championship ended with an agonising quarter-final exit at the hands of Turkey in 2008, when Croatia took the lead in the 119th minute in extra time, before conceding an equaliser and then losing on penalties.\nModric admitted that this latest heartbreak against Italy ranked alongside that loss 16 years ago.\n“It’s hard to actually to outdo the Turkey game from 2008 but this game probably runs it pretty close. It’s certainly a sad day for us and the Croatian national team.” AFP\nDecoding Asia newsletter: your guide to navigating Asia in a new global order. Sign up here to get Decoding Asia newsletter. Delivered to your inbox. Free.\nShare with us your feedback on BT's products and services",
  "word_count": 477,
  "scraped_at": "2026-02-14T02:13:55.815666",
  "_text_extracted": true
}