{
  "article_id": "1dc31b182931",
  "url": "https://www.thenationalnews.com/news/mena/2025/12/23/australian-state-set-to-pass-strict-gun-laws-and-protest-ban/",
  "title": "Australian state set to pass strict gun laws and protest ban",
  "date": "20251223T071500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Australia's most populous state was set to approve laws cracking down on guns and giving authorities the power to ban protests after the country's deadliest mass shooting in decades.\nFather and son Sajid and Naveed Akram are accused of attacking a Hanukkah event on Bondi Beach, killing 15 people in what authorities have said was an anti-Semitic terrorist attack.\nFacing growing political pressure over the attack, state and federal governments have proposed radical changes to gun laws and a broad hate speech ban.\nThe government of New South Wales – where the shooting took place – has recalled its parliament to introduce what it called the “toughest firearm reforms in the country”.\nAlthough Australia tightened gun laws after a 1996 shooting that killed 35 people, a police firearms registry showed more than 70 people in New South Wales, which includes Sydney, each own more than 100 guns. One licence holder has 298 guns.\nThe new rules will cap the number of guns a person can own to four, or 10 for exempted users like farmers. The legislation will also ban the display of “terrorist symbols”, including the flag of ISIS, which was found in a car linked to one of the suspected gunmen.\nAnd it will give authorities the power to prohibit protests for up to three months following a terrorism incident.\nThe reforms are expected to pass the upper house of the New South Wales parliament on Tuesday evening or early Wednesday.\nPremier Chris Minns said the laws “will be a clear message and clear progress to keep the people of New South Wales safe”.\nA broad coalition of protest groups has vowed a constitutional legal challenge to the anti-protest laws.\nPalestine Action Group Sydney, one of the groups involved in the challenge, accused the state of having “pushed through legislation without due process, attacking our fundamental right to protest”.\nIt also accused the state of making “unsubstantiated and plainly dishonest links between anti-Semitism and the Palestine solidarity movement”.",
  "word_count": 330,
  "scraped_at": "2026-02-14T01:49:57.603523",
  "_text_extracted": true
}