{
  "article_id": "1dfe9f51fadf",
  "url": "https://www.90min.com/arsenal-women-vs-juventus-women-preview-predictions-lineups-21-11-24",
  "title": "Arsenal Women vs Juventus Women : Preview , predictions and lineups",
  "date": "20241121T120000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal Women vs Juventus Women: Preview, predictions and lineups\n- Arsenal host Juventus in the UEFA Women’s Champions League on Thursday night\n- The Gunners beat the Italian side 4-0 last week in the reverse fixture\n- Another win will place them within touching distance of qualification for knockout rounds\nArsenal return to UEFA Women’s Champions League action this weekend with the visit of Italian giants Juventus.\nThe Gunners made it six games unbeaten under interim manager Renee Slegers with a north London derby victory against Tottenham over the weekend. Her side will be full of confidence ahead of Thursday’s European clash at the Emirates, and they could put themselves within touching distance of qualification with a victory this week.\nArsenal faced Juventus only last week in the reverse of this fixture and emerged with a comfortable 4-0 victory, with Frida Maanum and Mariona Caldentey among the goalscorers. They will be hopeful of achieving a similar result this time out ahead of the November international break.\n90min brings you a full preview of Thursday’s Champions League clash at the Emirates…\nWhat time does Arsenal vs Juventus kick off?\n- Location: London, England\n- Stadium: Emirates Stadium\n- Date: Thursday 21 November\n- Kick-off: 20:00 GMT / 21:00 CET / 15:00 ET / 12:00 PT\n- Referee: Ewa Augustyn (POL)\nArsenal vs Juventus H2H record (all games)\n- Arsenal: 2 wins\n- Juventus: 0 wins\n- Draws: 1\n- Last meeting: Juventus 0-4 Arsenal (12 November 2024) - UWCL\nCurrent form (all competitions)\nHow to watch Arsenal vs Juventus\nArsenal team news\nVictoria Pelova is Arsenal’s long-term absentee as she continues her recovery from an ACL injury sustained over the summer. Defender Amanda Ilestedt is also still sidelined following the birth of her baby.\nSlegers made one change to the starting lineup over the weekend from the side that beat Juventus last week as Caldentey returned to the team. Beth Mead dropped to the bench on Saturday, so the interim boss may look to rotate again with another international break around the corner.\nArsenal predicted lineup vs Juventus\nArsenal predicted lineup vs Juventus (4-2-3-1): Van Domselaar; Fox, Williamson, Catley, McCabe; Walti, Little; Caldentey, Foord, Maanum; Russo\nJuventus team news\nDefender Cecilia Salvai is the only major doubt for Juventus after she underwent surgery to repair the femoris tendon in her right thigh earlier this month. While an exact timeline for her recovery hasn’t been revealed by the club, it is unlikely she will be available for Thursday’s meeting with Arsenal.\nMax Canzi made a number of changes to his starting lineup in their league match against Sassulo over the weekend, including Martina Lenzini, Estelle Cascarino and Pauline Peyraud-Magnin, who could all return to the team on Thursday.\nJuventus predicted lineup vs Arsenal\nJuventus predicted lineup vs Arsenal (3-4-3): Magnin; Lenzini, Calligaris, Cascarino; Bergamaschi, Caruso, Schatzer, Boattin; Cantore, Vangsgaard, Beccari\nArsenal vs Juventus score prediction\nIf last week’s meeting between the two teams is anything to go by, this should be another comfortable victory for Arsenal. Last time out, they scored four against the Italian side without response.\nThis week, they have the home advantage at the Emirates and no WSL game to factor in this weekend. Victory on Thursday night would put Slegers' side within touching distance of qualification for the knockout rounds, something the interim boss will be desperate to achieve.",
  "word_count": 561,
  "scraped_at": "2026-02-14T02:05:30.917719",
  "_text_extracted": true
}