{
  "article_id": "1e211e132273",
  "url": "https://www.caughtoffside.com/2023/10/04/man-united-transfer-news-jadon-sancho-dortmund-return/",
  "title": "Man United transfer news : Jadon Sancho Dortmund return",
  "date": "20231004T090000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United winger Jadon Sancho is facing an increasingly uncertain future at Old Trafford, according to the latest from Fabrizio Romano in his exclusive Daily Briefing column.\nSancho has had a difficult start to the season for Man Utd, and is now out of the squad altogether after Erik ten Hag recently criticised his performances in training.\nThis led to the England international hitting back at the Red Devils manager on social media, in a statement which has since been removed, and Romano has made it clear that the player still needs to apologise in order to be involved in the squad again.\nStill, it seems any talk of a potential return to Borussia Dortmund is slightly premature, according to Romano, who insists that there still needs to be some clarity on Dortmund’s January transfer window plans, which could hinge on how the club perform in their Champions League group.\n“A lot of you keep asking me for updates on Jadon Sancho, and to be honest the situation is still more or less the same – the only way for Sancho to return to the Manchester United team is to apologise to Erik ten Hag and his coaching staff,” Romano said.\n“For the moment, there is no change at all, Ten Hag and his whole coaching staff want Sancho to apologise. Until then, Sancho will keep training with the youth team, not the first-team.\n“A move away in January now remains a very concrete possibility – we know that this is increasingly an option for Sancho, it’s becoming increasingly concrete. It’s being discussed internally, though it’s not yet clear which clubs will be in the race and whether it would be a loan or a permanent transfer.\n“From what I’m hearing, at the moment Borussia Dortmund have not started concrete contacts to bring Sancho back, but it’s still very early. We will see in the next months. There’s no clarity yet on Dortmund’s strategy for January as it also depends on their UCL group outcome.\n“There are many things to clarify, but one thing is clear for Sancho – apologise, or leave the club in January.\n“There’s also more on Sancho in Ben Jacobs’ column here.\n“One final point I want to make is that, despite Manchester United having a few problems like this now, with Sancho and also recently with Cristiano Ronaldo and Paul Pogba, I think it’s bad luck, it’s not on Man United. It’s not easy in modern football with lot of rumours, a lot of stories. For sure when you move to Man United there’s lot of pressure, it’s normal, but I honestly don’t think they picked the wrong players.”",
  "word_count": 444,
  "scraped_at": "2026-02-14T01:56:32.781649",
  "_text_extracted": true
}