{
  "article_id": "1e24e7cee589",
  "url": "https://www.lewrockwell.com/2023/07/chuck-baldwin/three-important-news-items-most-of-the-media-forgot-to-tell-you-about/",
  "title": "Three Important News Items Most of the Media  Forgot  To Tell You About",
  "date": "20230714T060000Z",
  "domain": "lewrockwell.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Three Important News Items Most of the Media “Forgot” To Tell You About\nJuly 14, 2023\nOnly the most naïve Americans have not awakened to the reality that the mainstream media in this country is—on the whole—one giant propaganda machine. They tell you only what they want to tell you, and then they tell you what you’re supposed to think about it. And every bit of it tilts toward the far-left, progressive, warmongering, Zionist, anti-America, anti-Christian, “woke,” fascist/socialist agenda.\nPart of the mission of this column is to tell what is mostly untold, support what is mostly unsupported and oppose what is mostly unopposed.\nAccordingly, here are three important news items that were conveniently ignored by most of the mainstream media.\nReport Number One: Armed Las Vegas Worker stopped likely mass shooter in his tracks.\nA gunman wearing a helmet and carrying an “AR-15 style rifle” was caught on camera at the entrance of an upscale Las Vegas apartment complex before an armed employee of the building opened fire and stopped him in his tracks.\nQuestions on how the incident played out remained unanswered for days as media coverage was minimal despite the worker having foiled what appeared to be a mass shooting attempt, Heritage Foundation senior legal fellow Amy Swearer claimed.\n“Normally when you have some sort of video like this, especially when it’s what appears to be an active shooting situation, that’s something that makes national news. I’ve never seen that not pick up steam of some sort,” Swearer told Fox News Digital.\n“What’s bizarre here is the hand waving, ‘Nothing to see here. Move along, folks,’” Swearer continued.\nThe suspect, identified as Andrew Warrender, walked toward the main lobby of the apartment complex at 3:13 p.m., according to the arrest report citing surveillance footage, and allegedly shot his weapon at an employee.\nHe attempted to fire another shot but appeared to have a malfunction.\nHe aimed his weapon again at the employee, but no bullet was discharged.\nWarrender then walked toward the front entrance to leave the apartment complex but was shot by the employee.\nThe employee held Warrender at gunpoint with his Smith & Wesson 9mm handgun until police arrived, saying he “felt everyone’s life in the area was in danger” and “he used deadly force to protect innocent citizens.”\nThe vast majority of the news media conveniently overlooked this report. Then again, they rarely report any of the more than 1.6 million times each year that a “good guy with a gun” thwarts a would-be crime, i.e., murder, assault, robbery, rape, kidnapping.\nJosu García de Albeniz (25) from Spain, a Karate Fitness Gasteiz Karate exponent collapsed from a cardiac arrest at the entrance of a music festival. He later died in hospital. Alia Zuidema (21) from Michigan, a former high school basketball player died suddenly after a “medical emergency.”\nThese are the two latest reports of athletes recorded in Good Sciencing’s list. Good Sciencing is maintaining a non-exhaustive and continuously growing list of mainly young athletes who had major medical issues in 2021 and 2022 after receiving one or more doses of Covid injections. As of April 2023, Good Sciencing had recorded 1,884 athlete cardiac arrests or serious issues since January 2021. There are another 55 cases that Good Sciencing is still investigating or awaiting further information.\nSince January 2022, Crispin Miller has been recording “died suddenly” cases worldwide that are reported in corporate media in a particular week. In his latest compilation, he recorded 57 New Zealanders who were reported as unexpectedly or suddenly losing their lives between 19 and 26 June. You can view Crispin Miller’s latest compilations by following the links on his summary Substack article HERE. It’s important to note that Crispin Miller makes no attempt to investigate whether the incident is related to covid injections, he merely records relevant details as stated in the report.\nIn another tragic incident noted by Crispin Miller, a class 12 student of a school in Kolkata, India, died after collapsing on the campus. The girl suddenly collapsed after the assembly session around 9:30 am. “She was then attended by the school doctor who found her pulse rate to be very low. She was declared brought dead when taken to the nearby Belle Vue Clinic,” a police officer said. A case was lodged in connection with the death and the body was sent for post-mortem. “It’s still not known whether the girl was suffering from any illness. It seems that she died of a cardiac arrest, but the exact reason behind her death could be known only after the completion of the post-mortem,” the officer said.\nIn Ukraine, a lawyer was killed in a “vaxxident.” In Odessa, the prosecutor suddenly died at the wheel. According to local Telegram communities, an uncontrolled car rammed several parked cars. The deceased is a high-ranking law enforcement officer of the city R. Bershavsky. No age or cause of death reported.\nIn Russia, Theatre and cinema actor Mikhail Lozhkin, died suddenly at the age of 36. The cause of death was not noted.\nIn Belgium, two footballers “died suddenly.” Former football player and ex-Red Devil Cédric Roussel passed away on Saturday at the age of 45. He collapsed on a terrace in Bergen on Saturday, first aid was of no avail. And Stéphane Demol, former defender, died following a heart attack. He was aged 57.\nIn Germany, on 21 June a truck driver was found dead in his cab. He had parked his vehicle in a parking lot on Tuesday evening to spend the night there. The parked truck with the corpse in the cab had been discovered by local residents, who alerted the police. The man apparently died during the night of a natural death, police said. No age or cause of death was reported.\nIn Iceland, last Saturday morning, emergency services were notified of a discovery of a dead person. He was found on the ground by a bicycle. A doctor was on the scene and pronounced the person dead. No age or cause of death was reported.\nOn 28 June, Paweł Kotwica, a well-known Polish sports journalist, died suddenly during the final match of the Handball Champions League in Cologne. He fainted suddenly when his beloved team from Kielce fought for the first place with SC Magdeburg on Sunday. Several minutes before the end of the match. Despite immediate medical assistance, his life could not be saved. He was less than 51 years old.\nMark Crispen Miller’s series of lists titled ‘In memory of those who died suddenly’ for the week of 19 to 26 June goes on and on. It’s tragic to see.\nThe only reasonable explanation for these ubiquitous cardiac arrests is the adverse, life-threatening consequences associated with taking the Covid vaccinations. The timeline, the similarity of heart-related deaths and injuries to healthy, young adults and the common denominator of the mass acceptance of the Covid shots make it unreasonable to assume anything else could be the cause of this Covid-era phenomenon.\nReport Number Three: Pentagon reveals military suicide numbers.\nAmerica’s military suicide crisis shows no signs of easing, as active-duty US soldiers killed themselves at a rate of more than one per day in this year’s first quarter, up 25% from 2022’s pace, a new Pentagon report has shown.\nActive-duty suicides rose to 94 in the January-March period from 75 in the same quarter a year earlier, the US Department of Defense (DOD) said in its latest report on the trend. The total was the highest for any three-month period since 2021’s April-June quarter, when there were 97 military suicides.\nMilitary suicides have risen sharply in the two-plus decades since America’s “war on terror” began following the September 2001 terrorist attacks on the World Trade Center and Pentagon. There were almost 29 suicides per 100,000 troops in 2020, up from 17.5 a decade earlier.\nThe active-duty figures don’t include reservists or veterans. Nearly 17 former US troops kill themselves each day, on average, according to government data. There were 41 suicides by reservists in the latest quarter, unchanged from a year earlier.\nIn the active-duty ranks, suicides among US Army troops in the January-March quarter jumped 32% from a year earlier, to 49. The Marine Corps so [sic] a larger increase, with the number of suicides surging by 75%, to 14.\nActive-duty suicides have exceeded 300 for each of the past five years, and the first-quarter total puts the military on pace to come closer to 400 such deaths in 2023.\nI do not believe that it is a coincidence that the radical surge in suicides among our nation’s military personnel—active duty and inactive—began with G.W. Bush’s immoral and unconstitutional “war on terror” in the early 2000s.\nThe military establishment keeps saying that these extremely high rates of suicide among its members are “not acceptable,” but they do absolutely nothing to change the overall “war on terror” mantra under which today’s servicemen labor.\nThe horrifying acts of inhumanity and barbarism witnessed and participated in by our fighting men as a result of Washington’s unconscionable “war on terror” and the brazen hypocrisy, duplicity and anti-Christian persecution by the military hierarchy takes a huge psychological toll on our troops. Add to that the current “woke” agenda that is being shoved down the throats of these brave and patriotic men, and it is little wonder why the Pentagon is not coming close to meeting its annual recruitment goals and why so many military personnel are so despondent and guilt-ridden that they are making the tragic and heart-breaking decision to take their own lives.\nI’ve counseled enough of our “war on terror” soldiers to have a small insight into what these brave and honorable men have seen, have been forced to do and are living with. All I can say is, what the White House, Congress and Pentagon (of both political parties) are doing to America’s young men and women in our nation’s military is nothing short of criminal. No wonder more and more veterans are telling their children and grandchildren to NOT join the U.S. military.\nI suppose after reading about these three new items, you can understand why the mainstream media “forgot” to report them.\nAmerica’s news media and America’s pulpits have this in common: Both are mostly known for what they don’t say.\nReprinted with permission from Chuck Baldwin Live.\nCopyright © Chuck Baldwin Live",
  "word_count": 1730,
  "scraped_at": "2026-02-14T01:48:22.652593",
  "_text_extracted": true
}