{
  "article_id": "1e27647713da",
  "url": "https://www.brightonandhovenews.org/2023/12/01/brighton-and-hove-albion-are-chasing-european-glory-says-dunk/",
  "title": "Brighton and Hove Albion are chasing European glory , says Dunk",
  "date": "20231201T190000Z",
  "domain": "brightonandhovenews.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brighton and Hove Albion captain Lewis Dunk said that the Seagulls were dreaming of Europa League glory after winning a place in the knockout stages on a historic day for the club.\nAlbion guaranteed a top two finish in Group B with a game to spare after their 1-0 away victory at 10-man AEK Athens.\nJoao Pedro’s 55th-minute penalty proved the difference against the Greek champions as Albion set aside a disjointed display to progress before their final group fixture at home to Marseille on Thursday 14 December.\nDefender Dunk is determined to finish in first place in the pool so that Brighton advance directly to the last 16 and avoid a knockout round play-off against a team falling out of the Champions League.\nHe told the club’s website: “The next game, we’ve got to win. We’ve got to top the group. I think that’s massive. You miss a round out.\n“That’s our next aim in this competition but who knows how far we can go?\n“We want to win it and you’ve got to dream big to achieve it. We’re going to set our sights on reaching the final and winning it.”\nBrighton have been enjoying their maiden European adventure but were second best in the first half at the AEK Arena. They were fortunate not to fall behind when Steven Zuber’s shot deflected off Dunk and struck a post.\nThe contest turned during a pivotal 10-minute second-half spell when Pedro converted a VAR-awarded penalty after being fouled by AEK captain Damian Szymanski and Mijat Gacinovic was dismissed for a second booking.\nAfter back-to-back successes over four-time European champions Ajax, Albion jubilantly celebrated another famous win with the travelling fans.\nEngland international Dunk, who made his senior debut when the Seagulls were a League One side, acknowledged the visitors were forced to dig deep.\nThe 32-year-old skipper spoke about the result, saying: “It’s massive. I think you can see in the celebration at the end what it means. It’s a historic day for the football club.\n“We came into this tournament to qualify out of the group and we’ve done that tonight.\n“It wasn’t the prettiest of our performances but sometimes you’ve got to win like that and it’s all credit to us.”\nPedro’s successful spot-kick was his fifth goal in the competition and backed up his match-winning brace as a substitute in Saturday’s 3-2 Premier League victory at Nottingham Forest.\nDunk, whose right shoulder was taped up at full-time, was sent off at the City Ground and will miss the trip to Chelsea on Sunday because of suspension.\nHe said: “(I’m) just nursing a few injuries but you just get on with them. (It’s) frustrating not to be out there (at Stamford Bridge). It’s my fault and I’ve got to deal with that myself.”",
  "word_count": 466,
  "scraped_at": "2026-02-14T02:17:09.414573",
  "_text_extracted": true
}