{
  "article_id": "1e78bed48df3",
  "url": "https://www.france24.com/en/live-news/20240520-liverpool-confirm-slot-will-replace-klopp-as-manager-1",
  "title": "Liverpool confirm Slot will replace Klopp as manager",
  "date": "20240520T201500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New Liverpool boss Slot admits he could not resist lure of club\nLondon (AFP) – Arne Slot said the chance to work at one of the world's biggest clubs was \"difficult to ignore\" after Liverpool confirmed on Monday that the Feyenoord coach would be their new manager.\nIssued on: Modified:\nJust 24 hours after Jurgen Klopp's emotional farewell at Anfield, the Premier League club said in a statement that the Dutchman would take up the position of head coach on June 1, subject to a work permit.\nThe club did not specify the length of Slot's contract but it was widely reported in the British press that he had signed a three-year deal.\nThe new manager's arrival was an open secret, with Liverpool reportedly agreeing a compensation deal worth up to £9.4 million ($12 million) with Feyenoord.\nSlot, 45, confirmed Anfield was his next destination at his final pre-match press conference at the Eredivisie club on Friday.\n\"It is certainly not an easy decision to close the door behind you at a club where you have experienced so many wonderful moments and worked successfully with so many wonderful people,\" he told Feyenoord's website on Monday.\n\"But as a sportsman, an opportunity to become a head coach in the Premier League, at one of the biggest clubs in the world, is difficult to ignore.\"\nKlopp, 56, announced in January that the 2023/24 season would be his last at Anfield, and took charge of his final game on Sunday, a 2-0 win against Wolves.\nIn his farewell speech to the crowd, the German urged fans to throw their full support behind his successor, leading them in a chant of \"Arne Slot, na na na na na\".\n\"You welcome the new manager like you welcomed me,\" he said. \"You go all-in from the first day. And you keep believing and you push the team.\"\n- Feyenoord success -\nSlot, linked with a move to Tottenham last year, became Feyenoord boss in 2021 after impressing in his first managerial role at AZ Alkmaar.\nHe led the Dutch giants to the inaugural Europa Conference League final at the end of his first season, which they lost 1-0 to Jose Mourinho's Roma.\nSlot then delivered just a second league title in 24 years to De Kuip last season before penning a new three-year deal.\nFeyenoord have enjoyed a strong season, winning the Dutch Cup and coming second to an all-conquering PSV Eindhoven side in the league.\nUnder Slot, Feyenoord have delighted the fans at De Kuip with an attacking brand of football and Slot has won praise from Klopp himself.\n\"I like the way his team plays football. If he is the one, I like that he wants it,\" Klopp said last month.\n\"It's the best job in the world, best club in the world. Great job, great team, fantastic people. A really interesting job.\"\nLiverpool captain and fellow Dutchman Virgil van Dijk has hailed Slot's attacking mindset, saying it would suit the philosophy at Anfield.\nSpeaking about the future under the new boss, Van Dijk said: \"It is all about sticking together and giving him the chance of showing what he is capable of with the other guys who will come in.\n\"He probably knows already but everyone knows our expectations are always huge and it is about managing that in the right way and getting the maximum out of all of our players.\"\nSlot has huge shoes to fill at Anfield after Klopp restored Liverpool to the elite of English and European football during his nine-year reign.\nUnder his leadership Liverpool won a sixth Champions League crown and a 19th league title, as well as a clutch of other trophies.\nInitially, Bayer Leverkusen boss and former Liverpool midfielder Xabi Alonso was the favourite to succeed Klopp at Anfield.\nHowever, Alonso committed to staying at Leverkusen as he led them to a first-ever Bundesliga title.\nLiverpool finished third in the Premier League, qualifying for next season's Champions League, and won the League Cup in Klopp's final season.\n© 2024 AFP",
  "word_count": 675,
  "scraped_at": "2026-02-14T02:25:33.977712",
  "_text_extracted": true
}