{
  "article_id": "1e9a597ee248",
  "url": "https://www.caughtoffside.com/2023/08/14/stan-collymore-believes-newcastle-united-are-looking-the-real-deal/",
  "title": "Collymore column : Newcastle are the real deal , time for big baby Richarlison to grow up and why Raheem Sterling can be one of Mauricio Pochettino most important Chelsea players",
  "date": "20230814T134500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In his exclusive column for CaughtOffside, former Liverpool attacker Stan Collymore discusses some of football’s biggest talking points, including the Premier League’s new stoppage time rules, Richarlison’s chance to fill Harry Kane’s shoes and Newcastle’s incredible opening day performance against Aston Villa, plus much more.\n—————————————————————————–\nNew stoppage-time rules major cause for concern…\nI completely understand why supporters may want more on-field action, but it’s a 90-minute game and the good has to be taken with the bad. Of course, not every game is going to be one to remember, but you don’t go to the cinema to watch a film and if you don’t like the film, then start making demands. Potentially not enjoying it is the gamble you take when you decide to watch that film, or in this case, that game of football.\nWe need to get back to the more simple times; when games were 90 minutes long and there was a few minutes added on for injuries or other delays. What we have created now is certainly an integrity issue. We face the possibility of teams knowing what is needed from a game before it’s even finished. Just imagine it; it’s the Premier League’s final day of the season and although all games are supposed to kick off at the same time, and end within a couple of minutes of each other, we could now have a situation where a team is playing for 10 or 15 minutes longer than another, and if they know that a draw is good enough to keep them up, or to win them the title, or to qualify for Europe, then they will stop going all guns out and instead opt to sit back and get 11 men behind the ball. It really would make a mockery of the sport. That’s my biggest concern.\nTime for Richarlison to grow up…\nRicharlison now has to try and fill the void left by Harry Kane, and that’s not going to be an easy task.\nHe certainly talks a good game and doesn’t shy away from having a pop at any fans or pundits who criticise him, either on social media or on television. But now is not the time for talk, he needs to let his football do the talking because up until this point, he hasn’t put in anywhere near enough effort or shown anywhere near enough desire to really master his craft. He’s a senior Brazil international and came from Everton with all the hype behind him so he should be standing there and shouting from the rooftops about how he’s ready to lead Spurs’ line and to be Ange Postecoglou’s main man.\nIf I was his manager, I would put my arm around him and tell him how good he is, I would say everything he wants to hear and then watch to see what he does to discover whether or not he can score those 20 goals a season. Richarlison needs to grow up, stop being a big baby and really embrace the challenge that awaits him because my word, it’s a big one!\nNewcastle United are the real deal…\nI have been so critical of the Magpies in recent months but I am happy to admit that the team, and Eddie Howe, are proving me wrong. They were simply sensational against Aston Villa on Saturday afternoon. The irony is, Newcastle did to Villa what Villa did to them at home at the end of last season when they won 3-0.\nAlthough Villa were far from at their best, I won’t take anything away from Newcastle – they were excellent.\nI was actually quite disappointed with how Unai Emery set up. It wasn’t just how he started his Villa team, it was how he continued. There is nothing wrong with travelling to St. James’ Park, setting your defence up with a high line and saying ‘Let’s have a good go!’ – but when it clearly isn’t working, change it. Admit you got it wrong, sit back a little deeper and try to work your way back into the game. We didn’t see that from Emery or Villa last weekend. The same as we didn’t see it from Jurgen Klopp when the exact same thing happened to Liverpool when Villa tore them apart 7-2 three years ago. Newcastle run riot for almost the entire game.\nSandro Tonali was excellent and worthy of special mention. He got his debut goal and looks the real deal. Physically, he is a monster. He looks like he can ride tackles from opposition players and travel box-to-box effortlessly. I was really impressed, and for £55 million, which is what Newcastle paid AC Milan for him, it wouldn’t surprise me if, come the end of the season, we’re sat here saying the Italian is the ‘signing of the season’.\nAlexander Isak is proving me wrong…\nI went on record last season and questioned Alexander Isak’s ability to be Newcastle’s main striker. I didn’t think he has the physicality required to be the Magpies’ lone striker but he certainly proved me wrong on Game Week One.\nHe is very lean and I would still like to see him bulk up a bit, and it will be interesting to see how much the Champions League group stage takes out of him.\nCan he come back from mid-week European games and cope with the notoriously tough away fixtures the Premier League has to offer? – I’m not sure. We will have to wait and see, but like I say, I was really impressed with him last weekend and if I were Howe, I would be expecting 20 Premier League goals this season because I think that could now be a realistic milestone for the Sweden international to reach.\nRaheem Sterling could be one of Mauricio Pochettino’s most important Chelsea players…\nRaheem Sterling had a really good game against Liverpool on Sunday. It looks like Mauricio Pochettino has come in and put his arm around him and said ‘I don’t care what other managers have said, you’ve got a future here with me!’\nIt’s easy to forget, but Sterling is now one of Chelsea’s most senior players. He will be 29 years old at the end of the year so I would like to see him not only continue to fight for his place at Stamford Bridge but also take on a leadership role. He can be an experienced and important voice in the dressing room and a player all the younger ones coming through can look up to, and that may be why Pochettino has put so much faith in him early on.\nOverall, Sterling, along with Enzo Fernandez, looked great and I am expecting to see a lot more from both as the season goes on.",
  "word_count": 1130,
  "scraped_at": "2026-02-14T02:10:09.489246",
  "_text_extracted": true
}