{
  "article_id": "1ea8968de83d",
  "url": "https://menafn.com/1109100020/Edgy-Ancelotti-Not-In-The-Mood-To-Talk-After-Heavy-Barca-Loss",
  "title": "Edgy Ancelotti Not In The Mood To Talk After Heavy Barca Loss",
  "date": "20250117T074500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Edgy Ancelotti Not In The Mood To Talk After Heavy Barca Loss\nAncelotti, who said Real had found the solution after their humbling defeat, gave short answers in a tense press conference, very different from the light and relaxed image the veteran Italian coach usually gives in his meetings with the press.\nHe declined to respond to a question about Real making a move to sign players in the January transfer window and gave an abrupt answer when asked about his players' attitude and their commitment in the humbling defeat by old rivals Barca.\n\"Let's make one thing clear: this is a press conference, not a debate. I debate with my coaching staff and my players. Opening a debate here does not seem to me to be the most appropriate place,\" an edgy Ancelotti said on Wednesday.\n\"(Playing at home against Celta) is an important opportunity to come back from the bad game we played, which hurt us a lot but didn't sink us. We want to react and I hope it goes well, that the reaction is strong after the bad game the other day.\"\nSunday was the second time Barcelona have thrashed Real this season, the first being a 4-0 demolition job in La Liga at the Santiago Bernabeu stadium in October.\nOff the back of a remarkable 2023-24 season in which Real won the Champions League and La Liga double, they have been struggling to keep up the same level this campaign, mainly in the Europe's elite club competition where they are languishing in 20th place with only nine points from six games.\nThey are second in La Liga on 43 points, one point behind Atletico Madrid and five ahead of third-placed Barcelona.\nAsked if the pressure and growing criticism were getting under his skin, Ancelotti said he did not let the noise interfere with his job and that he was focused on getting his side back on track.\n\"I don't follow the wave of criticism, that one day you're the best in the world and another day you're the dumbest,\" he said.\n\"I have the necessary balance, which experience has given me, to know who I am and not get carried away by the wave. I don't think I'm the best, but I don't think I'm the dumbest either.\n\"(Sunday's defeat) is a step backwards, but we have to move forward. There is a season left in which we are well positioned in all competitions. It was a bad game, we made a lot of mistakes. We have evaluated it and found the solution. We have to move on.\n\"The good thing about football is that after a bad game, after a defeat like that, there is a chance to do well, which is tomorrow, and it gives you the opportunity to focus a lot on what you have to do and not on the bad things you have done.\"\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 540,
  "scraped_at": "2026-02-14T02:26:28.932516",
  "_text_extracted": true
}