{
  "article_id": "1edf96c213e9",
  "url": "https://www.football.london/arsenal-fc/transfer-news/arsenal-transfer-news-jorginho-fresneda-26113476",
  "title": "Arsenal transfer news : Late Jorginho move eyed from Chelsea as Ivan Fresneda decision made",
  "date": "20230131T064500Z",
  "domain": "football.london",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal transfer news: Late Jorginho move eyed from Chelsea as Ivan Fresneda decision made\nAll the latest Arsenal transfer chatter from the last 24 hours, including updates on Jorginho, the Gunners' move for Moises Caicedo and Martin Zubimendi.\nIt's deadline day and any last ditch attempts to bolster Mikel Arteta's Arsenal squad must be secured by 11pm tonight.\nThe north London outfit have already made two signings this month, bringing in Belgian winger Leandro Trossard from Brighton, as well as Polish centre-half Jakub Kiwior from Serie A side Spezia. Moises Caicedo has been the subject of two rejected bids worth £65million and £70million in recent days\nWith that being said, football.london takes a look at the latest news on the Gunners' pursuit of Caicedo and a surprise approach for Chelsea midfielder Jorginho.\nREAD MORE: 'Sell him' - Chelsea and Arsenal fans react as Edu plots Jorginho January transfer swoop\nShock Jorginho approach\nArsenal are considering a move for Chelsea midfielder Jorginho football.london understands. The Gunners are in the market for a midfielder before the January transfer window closes on Tuesday evening following a long-term injury to Mohamed Elneny.\nArsenal are now thought to be looking at a deal to bring in Jorginho as an alternative. Chelsea are understood to be willing to let the Italian international leave before the window closes if the fee is suitable as they near a deal for Benfica's Enzo Fernandez. Jorginho has just six months remaining on his contract so would potentially be available for a lower fee, but it is not thought that a move is advanced at this stage.\nThe interest does not necessarily mean that Arsenal are giving up hope of signing Caicedo before the window slams shut at 11pm on Tuesday. As things stand they are still optimistic that a deal could be agreed if Brighton bring in a replacement midfielder.\nRead full story here\nZubimendi blow\nArsenal target Martin Zubimendi will stay at Real Sociedad this transfer window football.london understands.\nZubimendi is thought to have been another player the Gunners were looking at bringing in this month, however, Real Sociedad are adamant he will stay at the Reale Arena in order to help their push for a Champions League place. This means a deal for Spaniard looks highly unlikely at this stage.\nRead more here\nNo Fresneda move\nFresneda had been mooted as a potential target for the Gunners and football.london understands there was a genuine interest in the Spaniard, although transfer guru Fabrizio Romano has now reported that Fresneda won't be leaving Valladolid before Tuesday night's deadline. Taking to Twitter, Romano said: \"Understand Iván Fresneda will stay at Valladolid in January unless there are twists in the final hours.\n\"Arsenal & Borussia Dortmund wanted Spanish talented RB but deal was never done, Fresneda is now expected to stay and help Valladolid. Next step: top club move in the summer.\"\nFresneda was also captured reassuring Valladolid fans that he would not be leaving over the weekend. After stopping to sign some shirts for some Valladolid supporters, the 18-year-old said, as per The Metro: \"No, I’m not leaving, calm down.\"\nREAD NEXT:\nMoises Caicedo to Arsenal transfer state of play as Gunners remain hopeful of late move\nArsenal handed major Moises Caicedo transfer boost amid Brighton's Yasin Ayari transfer deal\nThree Moises Caicedo transfer alternatives Arsenal can target if Edu can't secure deadline move\nFind the footballs on the football.london website to win cash prize, vouchers and TV worth £3,000\nArsenal news and transfers LIVE: All the latest news, rumours and gossip from the Emirates Stadium",
  "word_count": 595,
  "scraped_at": "2026-02-14T01:59:41.730017",
  "_text_extracted": true
}