{
  "article_id": "1ef8057aa176",
  "url": "https://www.caughtoffside.com/2024/03/15/inside-spain-manchester-united-tour-of-spain-barcelona-sales-and-antoine-griezmann-insult/",
  "title": "Inside Spain : Manchester United tour of Spain , Barcelona sales , and Antoine Griezmann insult",
  "date": "20240315T024500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside Spain is a weekly instalment brought to you by Football España, providing an insight into all of the major stories coming out of the rich and intense climes of La Liga and beyond.\nIt was largely regarded as a good week for Spanish football, even if Villarreal didn’t quite pull off a brilliant four-goal comeback against Olympique Marseille, Spain will have three sides in the Champions League quarter-finals, more than anyone else.\nThe most dramatic was Atletico Madrid’s penalty shoot-out win over Inter. Diego Simeone has now fathered 7 of Atletico’s 12 Champions League quarter-finals, and is yet to lose a home knockout tie. The penalties of course involved Antoine Griezmann in obscene fashion making it clear that he thought Alexis Sanchez would miss, although he has reportedly apologised to the Chilean.\nBarcelona also got an excellent win over Napoli, coming through 3-1 at home and returning to the quarter-finals for the first time in four years. It earns them an extra €15m which was vital for their financial woes, but nevertheless they will still require sales. This week it emerged that the Blaugrana would consider offers for close to a €100m for star defender Ronald Araujo.\nCholo Simeone loves to be the underdog. pic.twitter.com/4Dxl3vAf04\n— Football España (@footballespana_) March 14, 2024\nSporting Director Deco did meet with his Manchester United counterpart, John Murtough in Madrid on Monday, but Araujo was not brought up according to the latest reports, rather Ansu Fati, Alejandro Balde and Frenkie de Jong.\nUnited also met with Getafe, Atletico Madrid and Real Madrid while in the Spanish capital, and while Barcelona have cooled their interest in Mason Greenwood fearing public backlash, Atletico are still interested, as are Getafe. In order to stay in Spain though, Murtough made it clear they would be selling to the highest bidder, around €50m they hope, rather than loaning the problematic forward again.\nIn other news, the prosecutor and the victim in the Dani Alves rape conviction are set to appeal the decision, asking for the sentence to be extended beyond the four and a half years. In lighter legal news, Real Madrid-bound Kylian Mbappe is reportedly threatening to sue a kebab shop in Marseille for likening their round roll to Mbappe’s head – ‘Don’t you have anything better to do?’ responded the irate owner.",
  "word_count": 386,
  "scraped_at": "2026-02-14T02:17:27.957193",
  "_text_extracted": true
}