{
  "article_id": "1f0b7788aca2",
  "url": "https://metro.co.uk/2025/04/30/paul-parker-argues-man-utd-may-end-a-better-season-arsenal-23002117/",
  "title": "Paul Parker argues Man Utd may end up having a better season than Arsenal",
  "date": "20250430T163000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Parker has argued that Manchester United may end up having a better season than Arsenal if they manage to win the Europa League.\nThe Red Devils face a trip to Athletic Bilbao on Thursday night for the first leg of their semi-final clash, looking to continue their hunt for silverware.\nLike United, Arsenal only have one chance left of landing a trophy this term, with the Gunners having reached the last four in the Champions League.\nThe Champions League is, of course, more prestigious than the Europa League but Arsenal lost 1-0 at home to PSG in the first leg on Tuesday.\nArsenal must now produce a comeback at the Parc des Princes in the second leg to reach the Champions League final – where they’d play either Barcelona or Inter Milan – if the north Londoners turn things around.\nFormer United right-back Parker has told Metro that his former club would’ve had a more successful season than Arsenal if the Gunners miss out on the Champions League trophy and United win the Europa League.\n‘Yeah, it would be (a more successful season for United if that happened),’ he said via iGaming.com, comparison site of the best online casinos.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s making me chuckle, really. Arsenal have been there – flickering at the top – all the PR stunts they’ve been throwing out there. They’ve been doing everything to pump themselves up.\n‘If you’re an Arsenal fan, you’d be a bit disappointed really. You want them (the team) to give you something to cheer about, not them telling you to cheer.\n‘When you look at it, United have been awful this season, but if they were to win it (the Europa League) – there would be no argument. They’d have a bit of silverware.\n‘At this moment in time, you have to say United have a good chance of winning it (the Europa League).\n‘I don’t think Arsenal can fight back (against PSG) in the Champions League.’\nUnited have underperformed in every other competition – particularly in the Premier League – with the club sat 14th in the table with four games left.\nUnited failed to reach the FA Cup quarter-finals, eliminated by Fulham in the fifth round, although they did triumph over Arsenal in the third round.\nIn this season’s Carabao Cup, Ruben Amorim’s side were knocked out in the last eight while Arsenal went one round further to the semi-finals.\nParker’s comments come despite Arsenal being second in the Premier League table, with 28 more points and 12 places above United.\nArsenal were involved in a Premier League title race with Liverpool for much of the season before Arne Slot’s side ended up running away with it.\nLiverpool were crowned champions of England on Sunday with a 5-1 victory over Spurs and have 15 more points that second-placed Arsenal.\nIt means Arsenal’s painful wait for the Premier League title goes on, with Mikel Arteta’s side finishing as runners-up in 2023 and 2024 respectively.\nMore Trending\nArsenal have not landed the top-flight trophy since 2004, with United last crowned English champions in 2013.\nDiscounting Community Shields, Arsenal have not won a major trophy since the FA Cup in 2020.\nUnited, meanwhile, have won a number of trophies in recent years including the FA Cup in 2024 and Carabao Cup in 2023.\nAmorim’s team will face either Tottenham or Bodo/Glimt in the Europa League final this term if they manage to progress past Athletic Bilbao.\nMORE: PSG star in ‘race against time’ to be fit for Arsenal return leg after missing training\nMORE: Man Utd dominate Athletic Bilbao to take control of Europa League semi-final\nMORE: Arsenal open talks to sign £25m Roma star ahead of Newcastle and PSG",
  "word_count": 673,
  "scraped_at": "2026-02-14T02:09:01.848205",
  "_text_extracted": true
}