{
  "article_id": "1f515f06b524",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/164087/chelsea-fcw-vs-everton-fcw-womens-super-league-preview-team-news-how-to-watch",
  "title": "Chelsea vs . Everton , Women Super League : Preview , team news",
  "date": "20251207T114500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea Women return to Kingsmeadow this weekend looking to steady themselves after back-to-back 1–1 draws. Unbeaten they remain, but the rhythm has dipped, and with the league table tightening above and below, this is the kind of match where control and composure matter more than spectacle.\nChelsea FCW vs. Everton FCW, Women’s Super League: Preview, team news, how to watch\nControl first, composure always\nEverton arrive in a difficult moment, sitting near the bottom of the table after a stuttering start. Still Brian Sørensen’s side still have the athleticism and structure to frustrate opponents when given space to defend. The Blues know that, regardless of form, this fixture has a way of becoming awkward if not handled with authority from the start.\nDate / Time: Sunday, December 7, 2025, 14.30 GMT; 9:30am EST\nVenue: Kingsmeadow, Kingston Upon Thames, UK\nReferee: Emily Heaslip\nForecast: Light rain with a gentle breeze\nOn TV: none (UK); none (USA); elsewhere\nStreaming: BBC iPlayer (UK); ESPN+ (USA)\nChelsea team news: We were hoping for the worse as we headed to Stamford Bridge to face Barcelona in a Women’s Champions League group match. And they decided to prove us all wrong with a 1-1 draw that could have very well been our first ever home win against the Catalan giants.\nHeading back into domestic football, our two injury concerns are Erin Cuthbert and Wieke Kaptein — the former leaving a Scotland vs. China match early due to a concussion and the latter returning to Cobham following a Netherlands vs. Portugal game. Erin won’t feature given protocols have to be followed after a head injury. Meanwhile Wieke will need a fitness test before we decide whether she can take part in this Everton encounter.\nEverton team news: Everton’s summer window brought in a handful of players expected to form the spine of their rebuild. The standout additions were former Aston Villa full-back Maz Pacheco, Japanese international right-back Rion Ishikawa, creative midfielder Ruby Mace, and forward Yūka Momiki, whose versatility has already made her a regular fixture this season. Winger Rosa van Gool has also seen meaningful minutes since arriving from Ajax, giving Brian Sørensen more pace and directness out wide.\nToffees boss Sørensen stressed in the press conference ahead of the Sunday match that Everton have almost a full squad available for the first time in a while. There are no new injury concerns coming out of the international break, with only existing long-term absences such as defender Megan Finnigan continuing to miss out, so the Everton boss will be able to pick more or less his strongest side for this one.\nPreviously: A late Lauren James goal gets us the three points at home.",
  "word_count": 448,
  "scraped_at": "2026-02-14T02:03:26.517693",
  "_text_extracted": true
}