{
  "article_id": "1f7911bf05e5",
  "url": "https://www.sounderatheart.com/2025/06/club-world-cup-preview-atletico-madrid/",
  "title": "Club World Cup preview : Atlético Madrid",
  "date": "20250612T040000Z",
  "domain": "sounderatheart.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As if the arrival of the reigning European and South American champions to Puget Sound didn’t represent stiff enough opposition for the Seattle Sounders, the Rave Green will also be visited by Spanish royalty during the Club World Cup.\nWell, OK, perhaps \"royalty\" isn’t the ideal word here, since Atlético Madrid have for more than a century defined themselves in passionate, loathing opposition to Real Madrid, the crosstown rivals who’ve actually, officially received benediction from the monarchy.\nBut Los Rojiblancos (the Red-and-Whites) are a European powerhouse in every sense: 11-time La Liga champions, bristling with both elite talent and a hard, menacing edge epitomized by Diego “El Cholo” Simeone, one of the longest-serving managers in the game’s top echelon.\nHow they qualified: UEFA rankings (sixth)\nCoach: Diego Simeone\nDomestic league: Spain’s Campeonato Nacional de Liga de Primera División (La Liga)\nHow they performed in 2024-25: Third place in La Liga, UEFA Champions League round of 16, Copa del Rey semifinals\nTransfermarkt value: €508.5 million (US $580.9 million)\nGroup stage matches: vs. PSG, June 15, noon; vs. Sounders, June 19, 3 PM; vs. Botafogo, June 23, noon\nKey players\n- Julián Alvarez: The Argentine striker arrived from Manchester City last summer with the outsized expectations inherent to a $110 million transfer and just about fulfilled them, bagging 29 goals and seven assists across all competitions. A well-rounded frontrunner, he can finish, he can playmake and he’s fully adept at the defensive work Simeone requires.\n- Alexander Sørloth: Another pricey 2024 acquisition come good, the Norwegian international slotted smoothly into Atleti’s game model, finishing just behind Alvarez with 24 goals – one every 78 minutes on average. Tall, tough, clever, strong in the air, Sørloth can create danger off the bench or from the start.\n- Antoine Griezmann: Versatile, creative and committed, the French attacker is Atleti’s all-time leading scorer, a trusted Simeone disciple and, let’s not forget, a 2018 World Cup winner. The longtime LAFC target is still doing the business at the top level with 25 goal contributions in the just-concluded season, and recently signed a contract extension through June 2027 as a result.\n- Rodrigo de Paul: You may have read about Leo Messi’s *actual* bodyguard, a burly, bearded guy named Yassine Cheuko. On the pitch, however, it’s de Paul who’s taken up the job for the Argentina national team, providing the hard running and nasty temperament that greases the rails for the GOAT, most memorably on their 2022 World Cup run. He does plenty of that for Atleti, too, diving into the dirty work with gusto and inflicting something on the spectrum between annoyance and misery on opponents.\n- Jan Oblak: The Slovenian might just be the best goalkeeper in the entire tournament. You never know when those might come in handy.\nRoster\nStyle of play\nAn MLS sicko might say Atleti are the Philadelphia Union of Spain: tenacious, direct, happier without possession, dangerous in transition and proudly, unabashedly, even brutally physical, intent on forcing opponents to play the game on their terms. Simeone, an infamous hard man over his own accomplished playing career, set the tone on arrival in 2011, energetically (and occasionally maniacally) prowling the sidelines in his trademark black suits, demanding full, relentless commitment from his troops.\nGranted, that comparison falls apart a little bit when we account for the generally deeper block, usually in a traditional orthodox 4-4-2 shape, long preferred by Simeone, as well as the club’s more recent efforts to evolve into a more proactive side capable of using the ball to good effect – “more control and less fury,” in the words of The Athletic’s Dermot Corrigan. Yet it’s useful in terms of conveying the muscular, ill-tempered tone both teams seek to impose on their matches, and the distinct challenges that entails.\nAtleti based its identity on defensive solidity and ferocious intensity as they sought to clamber into the dominant, bipolar La Liga aristocracy of Real Madrid and FC Barcelona, then looked to add extra clubs to the bag once that position was consolidated. And it’s more or less worked, with the likes of Griezmann, Alvarez and de Paul quite adept at knitting patterns of play to create chances and regulate tempo.\nOne fact to impress your friends\nAtleti’s most enjoyable nickname is ‘Los Colchoneros,’ or ‘the mattress makers,’ which dates back to the club’s founding in the early years of the 20th century, when they began to use their now-signature red-and-white striped jerseys. It’s said that the pattern was the same as that used to upholster mattresses, thus the fabric was cheap and readily available.\nAre you dealing with some hardcore soccer geeks who already know about the mattress thing? Then lure them into a debate about the arcane specifics of the IFAB rule regarding Alvarez’s “double touch” penalty kick, a key factor in Atletico’s controversial Champions League exit at the hands of Real in the round of 16 earlier this year, and the law change it prompted.\nOr titillate them with excerpts from Simeone’s books, like “El Efecto Simeone: La motivación como estrategia” (The Simeone Effect: Motivation as a strategy) or “Creer: El desafío de superarse siempre” (Believe: The challenge of always improving).\n“Football is like hunting,” he declared in the former. “One second can change it all, but it's not just any second, it's a flash. The prey is there and suddenly then it's not. In an instant it's over -- you won't have the chance again.”\n“I relate football with boxing, with a street fight,” he wrote in the latter. “In both cases there is always one moment, a second, in which someone shows fear in their eyes, in their body.”\nHow likely are Sounders to get a result?\nNot very! It’s a steep, treacherous hill for SSFC to climb. On the one hand, they’ll have to match Atleti’s physicality and be up for a knife fight. Yet on the other, they’ve got to be supremely disciplined and mindful, because the Spaniards are built to instigate and exploit even the most fleeting of errors.\nWhat are their chances of winning the whole thing?\nOpta's 'supercomputer' predictions give the Rojiblancos a modest 5.1% probability, well back of the leading favorites Paris Saint-Germain, Manchester City and Bayern Munich. That sounds a bit low, especially considering they beat PSG on the road in Champions League action in November. The gambling-inclined might even talk themselves into betting on Atleti as a dark-horse contender.\nWhat makes this team interesting?\nWhen it comes to Atlético Madrid, there’s always plenty to chew on, both on the pitch and off it.\nA club once synonymous with underachievement and dysfunction has painstakingly reinvented itself over the past decade or so, escaping chronic instability to become an established powerhouse with sheer force of will – and, let’s face it, a sequence of murky financial arrangements and sponsorships has helped, too, bankrolling dramatically increased spending on salaries and transfer fees, as has their 2017 move from ramshackle Estadio Vicente Calderón into the gleaming Estadio Metropolitano.\nFor decades Atleti stewed resentfully in Real’s shadow, and some semblance of that dynamic remains in place: The crosstown rivals have faced off half a dozen times in the Champions League, including tow finals, and Los Rojiblancos have never eliminated RMCF. Yet they’re a case study in ramping up to elite status on a sustainable basis, without massive, ongoing infusions of billionaire or sovereign wealth fund cash.\nWin, lose or draw, the team reliably shows up and makes their adversaries earn every goal, every point, on every matchday, in the process somehow managing to make mind games, hard tackles and defensive discipline beautiful. This summer, they might even play some pretty soccer, too.\nCharles Boehm has covered all levels of soccer in North America and beyond for more than two decades, including his current role as MLSsoccer.com's National Writer. A native Texan, he made Washington, D.C. his home following a pedestrian NCAA Division III college career and subsequent Peace Corps stint in the small, soccer-crazed island nation of Grenada, where he coached and played in the Grenadian Premier League. Find him on Bluesky at @cboehm.bsky.social, or Instagram and Threads at @charlesboehm.",
  "word_count": 1358,
  "scraped_at": "2026-02-14T01:58:41.944477",
  "_text_extracted": true
}