{
  "article_id": "1f8caf69ba58",
  "url": "https://metro.co.uk/2025/04/21/graeme-souness-sends-warning-aston-villa-marcus-rashford-transfer-22948151/",
  "title": "Graeme Souness sends message to Aston Villa over Marcus Rashford transfer",
  "date": "20250421T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Graeme Souness has issued a word of warning to Aston Villa as they consider signing Marcus Rashford on a permanent transfer from Manchester United.\nRashford left his boyhood club United in January after being frozen out by new Old Trafford boss Ruben Amorim, joining fellow Premier League side Villa on loan until the end of the season.\nAston Villa are not obligated to sign Rashford permanently but may decide to do so given the 27-year-old’s encouraging performances in recent weeks.\nRashford scored a brace to send Villa into the FA Cup semi-finals earlier this month and also impressed in the club’s narrow Champions League quarter-final defeat to PSG.\nUnai Emery has been pleased with Rashford’s performances at Villa Park but Souness has questioned whether the England international has ‘done enough’ to earn a permanent transfer in the summer.\nWriting in a column for the Daily Mail, Souness said: ‘The question I’d be asking as Aston Villa consider whether to sign Marcus Rashford permanently is this: “Can you trust him?”\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Has he really pulled up any trees in his time on loan? Unai Emery will know more having seen him up close. He has started him in key games but has he really done enough?\n‘Aston Villa know this is a huge transfer for Manchester United. If they pay the £40m fee it gives United greater headroom with Profit and Sustainability to buy in the summer, so why should Villa do United any favours?\n‘They know how desperate United are so they’ll likely bid low. Villa won’t want to match his wages as they’ll have everyone else knocking on the manager’s door asking for over £300,000 a week.\n‘They know United need to sell him and they’ll also have to weigh him in to go. But you are still wondering what has changed?\n‘This is a Manchester boy who had to leave his boyhood club. They gave him a big, big contract and he let them down big time.\n‘What is different in his life? Are the same people supposedly responsible for looking out for him, still around?\n‘And if he signs, how long is it before he reverts to the same moody individual who struggled to turn up for Manchester United.\n‘Can you trust him is the biggest question. Aston Villa are a huge football club that have to be in the Champions League and for that you need players you can rely on.’\nRashford has been at Manchester United since the age of seven, making over 400 appearances for the Red Devils.\nMore Trending\nBut he hardly played following Amorim’s arrival at Old Trafford, with the ex-Sporting Lisbon boss questioning his intensity in training.\nA return to United looks incredibly unlikely while Amorim is still at the helm so there is a possibility Rashford leaves both United and Villa in the summer.\nPSG, who knocked Villa out of Europe, are believed to be one of a number of European clubs interested in signing Rashford.\nAston Villa face top-five rivals Manchester City on Tuesday night before meeting Crystal Palace at Wembley for a place in the FA Cup final.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Wayne Rooney names ‘top five players’ in the Premier League this season\nMORE: Man Utd move step closer to signing Premier League star ahead of Arsenal and Chelsea\nMORE: Leeds and Burnley promoted to Premier League – and SEVEN teams can still make play-offs",
  "word_count": 639,
  "scraped_at": "2026-02-14T01:58:31.711496",
  "_text_extracted": true
}