{
  "article_id": "1fa9d58c754a",
  "url": "https://theathletic.com/4757831/2023/08/11/premier-league-hope-o-meter-2023-24/",
  "title": "Premier League hope - o - meter 2023 - 24 : How every club fans are feeling",
  "date": "20230811T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If you think you’re excited about the start of the new Premier League season, you should speak to an Aston Villa fan. They’re about ready to pop. All of them. Well, almost all of them.\nIn a survey conducted by The Athletic this week (before the developments on Thursday and Friday which brought the transfers of Moises Caicedo and Harry Kane closer to being completed), we asked how supporters of each of the 20 teams are feeling about the new season. Ninety-nine per cent of Villa respondents said “optimistic”, making them the most positive bunch in the division.\nGO DEEPER\nJordan Henderson: I strongly believe that me playing in Saudi Arabia is a positive thing\nThey’re far higher than fans of treble-winning Manchester City (83%), higher than big-spending Newcastle (91%, down 5% on last year), who they play first, and a world away from Tottenham (79%), who they finished a point above last season.\nSo what’s going on? Here’s The Athletic’s Villa writer Jacob Tanswell.\n“Aston Villa believe they are going places,” he says. “Confidence in a manager has not been as emphatic as it is for Unai Emery for some time, with his work in transforming Villa from relegation candidates less than a year ago to a club aiming to crash the top six, pretty startling.”\nAdvertisement\nEmery is one of three Basque managers in the Premier League this season, with followers of Andoni Iraola’s Bournemouth (97%) and Mikel Arteta’s Arsenal (90%) also in high spirits. There was a fourth until Tuesday evening, when Julen Lopetegui left Wolves. He had spent much of the summer agitating about his position and has now been replaced by Gary O’Neil. All of which explains why Wolves’ optimism levels (40%) are so low.\nVilla’s run from the wrong end of the table to seventh also brought with it the reward of European football. They play a two-legged Europa Conference League play-off later this month.\n“Emery is a European specialist and, as shown by the changes to Villa’s power structure, is the chief figurehead in which the club is being built in his image,” says Jacob. “The three acquisitions this summer — Youri Tielemans, Pau Torres and Moussa Diaby — all have European experience and are the type of gold-standard quality fans have been yearning for.\n“Empowered by the arrival of Monchi, the president of football operations, Villa do not want to sit still. Clearly, everyone connected with the club feels the same way, hence the near unequivocal excitement.”\nThere is one sobering issue: influential attacker Emiliano Buendia has suffered an ACL injury, though that could now bring further signings.\nTransfers play a key role in shaping how fans feel about their team’s chances and that is certainly the case at West Ham, where only 8% of supporters say they are optimistic about the new season. In the four years of conducting this survey that level of despair has only been matched once: by West Ham fans in 2020 (they would go on to achieve a club-record 65 points). The Athletic’s Seb Stafford-Bloor was at the 4-0 friendly defeat by Leverkusen and wrote on the tensions between head coach David Moyes and recently appointed technical director Tim Steidten. Did it really all feel so glum?\nAdvertisement\n“The summer after a major trophy should be so exciting. Getting over that hill should show a fanbase all the possibilities that lie in the valleys beyond. And yet, while West Ham’s gears have started to move in recent days, with the signing of Edson Alvarez and deals for James Ward-Prowse and Harry Maguire expected to follow, so much of the discourse has still been about what’s wrong with the club,” he says.\n“But this is not solely about this summer, the sale of Declan Rice or even the improvements needed ahead of the season. Instead, this negativity has built up over the past 18 months and has been provoked by the drop in Premier League standards during that period and the gathering uncertainty about the club’s footballing future.\nWhat kind of football team and club do West Ham want to be? A counter-puncher, or a possession side? A smart recruiter or a statement-maker?\n“This is about direction. The reason that the working relationship between David Moyes and Tim Steidten has been such a hot topic is because it characterises the confusion over what the club’s long-term objective actually is — and until supporters have a proper sense for what that is, it is very difficult for them to be invested and optimistic. Transfers are important, yes, but understanding the broader strategy is more so.”\nTransfer grumbles were also in evidence at Liverpool, where the new player in the international transfer market, Saudi Arabia, has left Jurgen Klopp with holes in his midfield and only 52% of Liverpool fans feeling optimistic. That figure is likely to significantly change if the club can complete a deal for Caicedo after agreeing a £110m fee with Brighton in the early hours of Friday morning.\n“The level of concern stems from the fact that Liverpool simply haven’t done enough so far in the transfer market,” says The Athletic’s James Pearce. “Rewind to early July and the mood was buoyant after the signings of midfield duo Alexis Mac Allister and Dominik Szoboszlai for a combined total of £95million.\nAdvertisement\n“However, then Liverpool’s pre-season was disrupted by unwanted interest from Saudi Arabia. Losing captain Jordan Henderson and Fabinho in quick succession wasn’t part of Jurgen Klopp’s plan.\n“Signing a new holding midfielder became the priority but Liverpool have had three bids rejected for Southampton’s Romeo Lavia and the saga has dragged on. The absence of a specialist No 6 has been a big worry for supporters.\n“However, the mood could be transformed after the dramatic turn of events which saw the club agree a fee with Brighton for Caicedo.\n“The only other worry had been the lack of depth at centre-back. Virgil van Dijk and Ibrahima Konate remain the first-choice pairing, but the level of cover isn’t sufficient with Joel Matip and Joe Gomez as back-up. There’s been much to admire about Liverpool as an attacking force in pre-season but the fear is that firepower could be undermined by defensive vulnerability.”\nThe mood is even darker across Merseyside with only 26% of Everton supporters feeling optimistic about the season ahead.\n“After two years of battling relegation, optimism levels are understandably low on the blue half of Merseyside,” says our Everton correspondent Patrick Boyland. “Dreams of Europe, which characterised the early part of Farhad Moshiri’s tenure, are now a distant memory. Most supporters are aware money is tight and that progress is likely to be incremental at best because of those constraints.\n“Everton’s signings so far have been solid yet unspectacular, with loan signing Arnaut Danjuma joining 38-year-old free agent Ashley Young through the door. If they can conclude a deal for Youssef Chermiti, the 19-year-old striker from Sporting Lisbon, he will offer promise for the future but will need a degree of patience as he continues to develop and acclimatise.\nAdvertisement\n“Given the struggles of recent seasons, more is needed to steer clear of trouble this time around. There remains a reliance on Dominic Calvert-Lewin bucking the trend of the last two years and staying consistently fit, while the injury to last season’s top scorer Dwight McNeil has also dampened optimism.\n“Off the field, transformative change remains a work in progress. A deal with U.S.-based MSP Sports Capital is yet to be finalised, with long-standing chairman Bill Kenwright still in situ as part of an interim board.\n“The professionalism of Sean Dyche and his staff offers a crumb of comfort, but supporters want to see tangible evidence the club is heading in the right direction again long-term.”\nIt looks like another long season ahead and that feeling is mirrored at Sheffield United. While fellow arrivals from the Championship Luton (90%) and Burnley (86%) are feeling pumped, only 17% of Sheffield United fans feel optimistic — and even that seems high.\n“A couple of questions spring to mind about this statistic,” says The Athletic’s Richard Sutcliffe. “When was the survey taken? And have mischievous Sheffield Wednesday fans been allowed to vote? These are the only explanations as to why 17 per cent of United supporters allegedly responded with feelings of optimism ahead of a season that is shaping up to be so dire that Derby County’s 11-point record low for the Premier League already feels to be under threat.\n“This has been a horrendous week for United. Losing one key player is bad enough. But two feels careless, especially so close to the start of the new campaign. With the departure of Iliman Ndiaye and Sander Berge surely went any hopes of Yorkshire’s sole representative staying up.\n“Along with Tommy Doyle and James McAtee, who returned to Manchester City at the end of last season, Ndiaye and Berge were the heartbeat of the team that clinched promotion in such emphatic fashion. No wonder Wednesday fans are looking forward to this Premier League campaign with such glee.”\nAdvertisement\nBut after 1,000 words of going round the houses let’s cut to the chase: what the hell are Chelsea fans so happy about?\nYes, they’ve got a new, high-calibre manager and have spent significantly again but the squad surely looks bloated and last season was… really bad.\nWe have summoned The Athletic’s Chelsea writer Simon Johnson to explain.\n“Chelsea fans are clearly feeling upbeat this season. That may bring those from outside of Stamford Bridge some mirth, but I do not blame Chelsea followers for being more optimistic,” he says. “They have every reason to look on the bright side after the misery of 2022-23, which saw the team set a new club low for Premier League points (44) in a season. Things should get better from such a disappointing benchmark.\n“But there is more to it than that. Pre-season has gone well under new head coach Mauricio Pochettino with three wins and two draws. The style of play is entertaining, the team spirit and harmony is stronger, plus Nicolas Jackson and Mykhailo Mudryk appear ready to inject some real speed and threat into the attack.\n“Clearly, no one should be getting too carried away either. Chelsea face a challenge just to qualify for the Champions League, let alone being crowned champions. Young players new to the league will be prone to mistakes and the loss of Christopher Nkunku for at least 16 weeks with a knee injury (confirmation coming after the survey was conducted) is a significant setback.\n“But the club already seem better equipped to finish a lot higher in the table and will give Chelsea supporters more incentive to watch them play again.”\nSo there you have it, if the Premier League table is decided purely on positive thought Villa will be champions, Bournemouth will join new-look Chelsea in the Champions League and West Ham will be rivalling Derby’s record-low points record. Let the games begin.\n(Top photos: Getty Images; graphic: Eamonn Dalton)",
  "word_count": 1838,
  "scraped_at": "2026-02-14T02:00:36.685284",
  "_text_extracted": true
}