{
  "article_id": "1fb1f6427652",
  "url": "https://www.caughtoffside.com/2025/07/13/leeds-in-talks-callum-wilson/",
  "title": "Leeds United hold talks with Callum Wilson over summer move",
  "date": "20250713T233000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United have been linked with former Newcastle United striker Callum Wilson, who is currently a free agent after his contract with the Magpies expired.\nAccording to TBR Football, Wilson is one of several options on Leeds’ shortlist as they seek to bolster their attacking department. Leeds have held talks with him regarding a potential move.\nLeeds need Callum Wilson\nWilson has consistently performed in the Premier League and could be a smart signing, especially on a free transfer. He brings experience and goal-scoring ability. Wilson has scored 88 goals in the Premier League.\nDespite his contributions to Newcastle—helping them win the EFL Cup and qualify for the Champions League—recurring injury problems have hindered his consistency. If he can remain fit, he would be a valuable asset to most Premier League teams.\nWilson will be hoping to revive his career with regular football, and Leeds could provide him with that opportunity. As one of the biggest clubs in the country, the chance to join them will be appealing to the player.\nMeanwhile, Leeds must improve their squad to survive in the Premier League. They need more goals, and signing a reliable forward like Wilson would be a shrewd move.\nAlthough he was once important to Newcastle, he is no longer central to their plans, which is why his contract was not renewed. A move away makes sense for Wilson, who is looking for a fresh start. Burnley are keen on Wilson as well.\nSigning Wilson on a free transfer would be a wise decision\nIf Leeds can secure a deal with the player, it would be a smart move, especially given their need to strengthen multiple areas of the squad. Signing a proven striker like Wilson on a free would allow them to invest more in other departments and build a competitive side for the Premier League.\nIt remains to be seen whether Leeds can finalise an agreement with the 33-year-old striker.",
  "word_count": 322,
  "scraped_at": "2026-02-14T02:02:51.949063",
  "_text_extracted": true
}