{
  "article_id": "1fb7189272ab",
  "url": "http://www.chinadaily.com.cn/a/202312/20/WS658241d7a31040ac301a8979.html",
  "title": "Club World Cup expansion raises player welfare fears",
  "date": "20231220T023000Z",
  "domain": "chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Club World Cup expansion raises player welfare fears\nConcerns grow over lack of rest as FIFA announces new 32-team format\nA 32-team World Cup for clubs is FIFA's big play to change the face of soccer. If successful, it could follow the English Premier League and Champions League as one of the most popular and lucrative sports competitions in the world, generating billions of dollars.\nConversely, it could spark a backlash from players and coaches, who already complain about the congested match calendar.\n\"I am not against new competitions, I am against the lack of time to recover year by year. This should change,\" Manchester City manager Pep Guardiola said on Monday, in Jeddah, Saudi Arabia, where his team is aiming to win the last Club World Cup before it is rebooted.\nWorld players' union FIFPRO went further after FIFA announced the dates of the first edition of the expanded tournament, which will be hosted by the United States from June 15 to July 13, 2025.\n\"The extreme mental and physical pressures at the pinnacle of the game are the principal concerns of players with multiple club and national team competitions, leading to exhaustion, physical injuries, mental health issues, diminished performance, and risks to career longevity,\" FIFPRO said.\nOn Sunday, FIFA said the dates would be \"harmoniously aligned with the international match calendar\" to ensure sufficient rest for players ahead of the start of domestic leagues.\nBut a significantly expanded tournament in 2025 means top players face three straight years of major competitions during the usual offseason, given the European Championship and Copa America are being staged in 2024 and the next World Cup is in 2026.\nIt is planned that the Club World Cup will be held every four years after 2025.\n\"Clubs play a fundamental role in world football, and the Club World Cup will be a major milestone in providing clubs from all confederations with a fitting stage on which to shine at the highest level of the game,\" FIFA president Gianni Infantino said.\nWill it work?\nIt is a peculiar quirk of soccer that a global club event has never captured the imagination of fans and teams around the world.\nIn its current format, the European and South American champions enter at the semifinal stage and have to play just two games to win the title.\nMore often than not, the final is between those two continents, with European teams dominating the modern era. Only Brazilian team Corinthians has broken Europe's winning run in 16 years.\nThe sense of formality likely hasn't helped the tournament capture wider interest, with teams from Asia and Africa not expected to upset giants such as Real Madrid, Barcelona and Liverpool.\nThe fact it is staged in the middle of the European season does not help.\nOwning the offseason\nThe 32-team tournament addresses those issues, with 12 European and six South American teams participating. Asia and Africa will have four teams each, plus four from North and Central America and the Caribbean. Oceania has one place, with the final slot allocated to a club from the host country.\nThe tournament will be staged during the offseason for many leagues, which is when major tournaments are traditionally played. With no competition from the likes of the English Premier League, the Club World Cup has the potential to own the space around the event.\nTeams will be split into eight groups of four, with two from each group advancing, leading to a knockout stage from the round of 16 through to the final.\nFIFA considered a six-game tournament with eight group winners advancing to the quarterfinals. The concern was that would create too many dead games in the group stage.\nQualifying criteria\nFIFA has established a qualifying criteria based on winning each confederation's biggest title, such as the UEFA Champions League, and ranking points for performance in that competition. Man City, Madrid and Chelsea have already qualified as the most recent UEFA Champions League winners.\nBayern, Paris Saint-Germain, Inter Milan, Porto and Benfica are also set to take part via their ranking points, FIFA said.\nCopa Libertadores winners from the last three seasons — Brazil's Palmeiras, Flamengo and Fluminense — have also qualified.\nSeattle Sounders, along with Mexico's Monterrey and Club Leon have qualified via CONCACAF Champions Cup wins. From Asia, Saudi Arabia's Al Hilal and Japan's Urawa Red Diamonds are guaranteed places.\nAfrican entrants include Al Ahly of Egypt and Wydad Casablanca of Morocco.\nOceania will be represented by New Zealand team Auckland City.\nCountries are capped to two teams unless more than two win a continental title. The first expanded tournament will be without storied English teams Liverpool and Manchester United.\n'A bit crazy'\nFIFPRO has called for discussions to introduce player health and safety regulations as a \"matter of urgency\".\nA report this year by the world players' union analyzed the impact of what it described as \"extreme calendar congestion\" last season when the World Cup was staged in Qatar in November and December. It said 43 percent of World Cup players surveyed experienced \"extreme or increased mental fatigue\".\nLast season, Manchester United and Portugal midfielder Bruno Fernandes made 70 appearances for club and country, including a run of 20 consecutive games. Manchester City and Spain midfielder Rodri played in 10 different competitions.\n\"If you look at it, it's a bit crazy — the rest that we get and the risk of injuries. If we have these many games for so long, the games will lose the energy, lose the intensity,\" City midfielder Bernardo Silva said on Monday. \"No complaints, but the amount of games makes it complicated to be fit all the time and for our energy levels to be proper.\"\nTo add to the demands on players, the rebooted Club World Cup comes at the end of the first season of the revamped UEFA Champions League, which sees teams play eight games in the first phase, rather than six.\nIntercontinental Cup\nWhile the Club World Cup has been expanded, FIFA will also hold an annual Intercontinental Cup. It appears to replace the current Club World Cup, and will see the Champions League winner face the winner of a playoff between the champions from the other confederations.\nAgencies Via Xinhua\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 1110,
  "scraped_at": "2026-02-14T01:48:34.026608",
  "_text_extracted": true
}