{
  "article_id": "1fd05ee7258b",
  "url": "https://www.teamtalk.com/manchester-united/ruthless-ten-hag-demands-man-utd-weaken-chelsea-signing-talisman-puts-seven-first-team-stars-up-for-sale",
  "title": "Ruthless Ten Hag demands Man Utd weaken rival by signing talisman ; puts seven first - team stars up for sale",
  "date": "20230620T221500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nRuthless Ten Hag demands Man Utd weaken rival by signing talisman; puts seven first-team stars up for sale\nErik ten Hag is ‘adamant’ Man Utd must weaken a top four rival by poaching one of their finest stars, while the ruthless Dutchman is poised to axe as many as seven first-teamers, per a report.\nThe Red Devils took giant strides forward under Ten Hag last season, both ending their six-year trophy drought and securing a return to the Champions League.\nHowever, rather than rest on his laurels, Ten Hag appears determined to double down and make sweeping changes to his squad.\nIndeed, additions at goalkeeper, centre-back, central midfield and striker are all wanted. Regarding the midfield pursuit, the Telegraph echo the claims Man Utd are primed to go back in for Chelsea’s Mason Mount.\nThe 24-year-old fell out of favour at Stamford Bridge last season and looks destined to leave this summer.\nMount is a player who has split opinion during his career thus far, though it cannot be argued he’s been one of Chelsea’s stand-out performers since becoming a regular starter back in 2019.\nIndeed, the homegrown star is a two-time Chelsea player of the year and averages better than a goal contribution once every three games for Chelsea (70 in 195).\nYet with no contract extension in sight and personal terms with Man Utd not a problem, a surprise switch to Old Trafford is on the horizon.\nUnited have already seen an opening gambit worth £40mm knocked back. According to the Telegraph, Ten Hag is ‘adamant’ Mount be brought to Old Trafford and an improved bid worth £50m is in the works.\nChelsea will reportedly hold out for closer to £70m, though their bargaining power is weakened by the fact Mount is about to enter the final year of his deal.\nWith the player on board with moving, Chelsea’s position weak and Ten Hag insistent Mount be bought, the signs all point towards an agreement ultimately being reached.\nSigning Mount would also have the added advantage of weakening Chelsea who are expected to bounce back after a truly dismal campaign.\nMuch is expected of Mauricio Pochettino and one of the most expensively assembled squads in world football. However, the Argentine may have to make do without Mount in his ranks.\nSeven-man clear-out coming\nElsewhere, the Telegraph bring news of a potential seven-man exodus from United’s first-team.\nPhil Jones and Axel Tuanzebe have already seen their exits as free agents confirmed by the club. However, seven stars who are under contract are also on the chopping block.\nThe Telegraph list Harry Maguire, Eric Bailly, Alex Telles, Fred, Scott McTominay, Anthony Elanga and Anthony Martial as those Ten Hag plans to jettison out of Old Trafford.\nOf the seven, the only player Ten Hag would not mind if a buyer can’t be found for is McTominay. The rest, per the report, are up for sale and Man Utd are ‘urgently’ looking to get rid.\nIf and when those players are axed, United will channel the funds received straight into new signings – including for Mason Mount.",
  "word_count": 522,
  "scraped_at": "2026-02-14T01:50:37.797389",
  "_text_extracted": true
}