{
  "article_id": "1fd72183dc86",
  "url": "https://www.aol.com/lamine-yamal-17-might-already-193801146.html",
  "title": "Lamine Yamal , at 17 , might already be the best soccer player in the world",
  "date": "20250311T201500Z",
  "domain": "aol.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona's Lamine Yamal, at 17, might already be the best soccer player in the world\nLamine Yamal is 17 years old and sometimes — when he's not scoring Champions League goals, or flooring defenders, or leading Barcelona to the top of La Liga — he looks it. He still wears dental braces. He gets his secondary school exam scores in June. His cheeky, boyish grin gleams with teenage innocence.\nAnd at other times, like Tuesday night, he looks like the best soccer player in the world.\n[Yahoo Fantasy Bracket Mayhem is back: Enter for a shot to win up to $50K]\nBecause even at 17, he might be. That's no longer a reactionary, exaggerated claim. Yamal sparked Barca into the Champions League quarterfinals Tuesday, and added to a growing-but-already-quite-large sample size of greatness.\nFirst, he ghosted past two Benfica defenders, eliminating both with a single feint. Both scrambled as he found Raphinha, perhaps with a bit of good fortune, at the far post for this Round of 16 second leg's opening goal.\nLAMINE YAMAL WHAT HAVE YOU JUST DONE?! 🤯\nThe 17-year-old finds Raphinha after a run for the ages 😳 pic.twitter.com/VQqHGQWZrO— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) March 11, 2025\nThen, 16 minutes later, he drove diagonally away from goal, and still flipped a curling shot into the far corner.\nBarca went on to beat Benfica 3-1 on the night, and 4-1 on aggregate.\nLAMINE YAMAL STUNS BENFICA...AGAIN 🤩🔥 pic.twitter.com/Jr6XPl9p6D\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) March 11, 2025\nYamal has been doing all of this semi-regularly for over a year now. He did it at the Euros. He's done it all across Spain. He's contributed to 45 goals for club and country since last February. And again: he is only 17.\nWhen he helped lead Spain to a European championship last summer, he was talked about as the future. When he scored or created a goal in every knockout-round game, he was a breakout star but also still a prospect. There were cute stories about how, as a minor, local laws technically wouldn't allow him to \"work\" past a certain hour. There were predictions — seemingly overzealous at the time — that someday, he could be as good as Lionel Messi.\nAnd now?\n\"I think it's silly to compare him to Messi, because Messi is unique and there will never be anyone like him,\" Gavi, Yamal's Spain and Barcelona teammate, said in January. \"Everyone is their own person and writes their own story.\"\nBut then he continued: \"Lamine, for me, is the best today.\"\nThere's a hesitance to anoint him because there are dozens of great players whose résumés are more extensive. There is Rodri, the reigning Ballon d'Or winner. There is Mo Salah, who, in his eighth year at Liverpool, has had the best 2024-25 season of anybody in world football. There are Kylian Mbappé and Vinicius Jr., who have been doing Lamine-like things for much longer.\nBut Yamal, at least on occasion, looks like a more complete player. He leads La Liga in assists and goal-creating actions. His progressive dribbling numbers are nearly on par with Vini's. And so is his sauce. Some of his on-ball skills are mind-boggling. His personal list of \"defenders I made look silly\" is already ridiculously long.\nOh, and he is making teammates better. He has contributed to Raphinha's career year; he has helped prolong the exploits of Robert Lewandowski. He also defends, and is doing all of this within a Barca team that might, in large part thanks to him, be the best in Europe and the Champions League favorite.\nHe is on a Messi-like trajectory. That doesn't mean he'll equal the GOAT — careers aren't linear, and injuries can interfere — but that's no longer an outlandish thing to say.\nAnd although he probably doesn't quite have the \"best in the world\" throne yet, he very well could by the end of the year.",
  "word_count": 654,
  "scraped_at": "2026-02-14T02:18:17.727744",
  "_text_extracted": true
}