{
  "article_id": "1fd7d6ffceb9",
  "url": "https://theathletic.com/5332344/2024/03/12/arteta-arsenal-knockout-games-champions-league/",
  "title": "Arteta has struggled in knockout games – beating Porto would be a huge step forward",
  "date": "20240312T061500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal host Porto this evening looking to overturn a 1-0 deficit from the first leg and advance to the Champions League quarter-finals.\nArsenal have been knocked out at the last-16 stage in their last seven appearances in the competition, so the match is partly about reasserting their credentials in the Champions League.\nAdvertisement\nThe team now, compared to the one that was eliminated at this stage in every season from 2010-11 to 2016-17, is completely different. So is the manager.\nMikel Arteta the player featured in five of those seven seasons, so he will very much feel that he has a sense of unfinished business in this competition.\nGO DEEPER\nArteta, the Arsenal player: 'He walked in like a little general - little Napoleon'\nArteta the manager needs this. After a series of disappointing exits in the Europa League, this is a chance to establish himself at European football’s top table.\nIn Arsenal’s outstanding recent run, the one outlier is the 1-0 first-leg defeat in Porto. Arsenal looked unusually inhibited and Arteta has hinted that the knowledge they did not have to win the match in Portugal was a factor in their underwhelming performance.\n“We’re going to have to tweak a few things to generate much more than we did,” the Arsenal manager told the media on Monday. “It’s the level of the Champions League. You are facing top teams. The fact that there are two games plays in your mind and we have to be better tomorrow.”\nJust as Arsenal are looking to banish the memories of those last-16 Champions League exits, Arteta is looking to move on from some ignominious eliminations during his time as manager.\nIn Arteta’s first season as manager, Arsenal were knocked out of the Europa League in the last 32 by Olympiacos. A goal from Youssef El-Arabi in the last minute of extra-time, followed by a jaw-dropping miss by Pierre-Emerick Aubameyang, saw Arsenal eliminated on away goals.\nThat tie was overshadowed by other events. First, it was during that second leg when Arteta and several other members of the club’s staff contracted the nascent coronavirus, precipitating the shutdown of the Premier League and European football.\nSecond, when football returned, Arteta led his team to FA Cup glory. Europa League failure was largely forgotten when Arsenal triumphed over Chelsea in an eerily empty Wembley in the summer of 2020.\nAdvertisement\nIn 2020-21, Arteta enjoyed his best European campaign to date, leading Arsenal to the Europa League semi-finals. They were knocked out, however, by Unai Emery’s Villarreal. For Arteta, it must have been a chastening experience to be defeated by his predecessor.\nThere was a sense that perhaps the novice manager had overthought this particular coaching duel — in the first leg, Arteta started Granit Xhaka at left-back and Emile Smith Rowe as a false nine. The experiment was not successful.\nMore on Mikel Arteta, the man who rebuilt Arsenal…\n- Rondos, 3-2-5 and positional games — inside his training sessions\n- Intensity, a settled defence… and Declan Rice — How his team has evolved\nIt seems an age ago now, but Arsenal’s dismal league form that year meant they did not qualify for Europe the following season. They returned to the Europa League in 2022-23, but were once again eliminated in their first knockout tie — a last-16 encounter against Sporting Lisbon.\nThe response from the Arsenal fans was relatively sanguine, with their team still in an unexpected fight for the Premier League title. They might have been out of all the cup competitions, but captain Martin Odegaard emphasised there were still “11 finals” to play. Arsenal supporters’ greatest regrets from that tie are the injuries to William Saliba and Takehiro Tomiyasu that derailed their title challenge.\nWinning the FA Cup in his first season has staved off a greater examination of Arteta’s record in knockout football. The value of that trophy cannot be overstated: it won buy-in from fans and the hierarchy, and was effectively the life raft Arteta clung to during the difficult winter of 2020.\nIn the four seasons since that FA Cup triumph, Arsenal have not been beyond the fourth round of that competition. They were also knocked out in their first game of the Carabao Cup in 2022-23 (third round) and only made it to the fourth round this season. There has been a sense that, when it comes to cup competitions, Arsenal have had bigger fish to fry.\nAdvertisement\nThe return to Champions League football has changed that. Arsenal are, at last competing on two fronts of equal importance again. As transformative as a first Premier League title in 20 years would be, Arsenal have never won the Champions League — so Arteta has an opportunity to write history.\nGO DEEPER\nArsenal's 2023: The title challenge, back among Europe's elite, and the Rice effect\nGiven Arsenal’s relentless domestic form, the best advice to offer Arteta might be to keep it simple. There is something about the high-stakes crucible of cup football — the all-or-nothing death-or-glory face-off with another manager — that can bring out the Spaniard’s tendency to tinker.\nIn pairing Jorginho and Declan Rice in midfield, with Kai Havertz operating as the attack’s focal point, Arsenal have found a formula that is working. It may be prudent to stick with it.\nAt least if Arteta does choose to mix it up, he has a squad with the appropriate depth and flexibility to handle a few changes. That has been a necessary part of the team’s evolution and has given the manager the variety he craves.\nArteta has done an extraordinary job at Arsenal. Perhaps because of the absence of that piece of crowning silverware, the sheer scale of his rebuild is sometimes underplayed. It’s not just about the huge turnover in playing personnel — he has played a crucial role in reigniting the atmosphere at the Emirates Stadium and re-establishing the connection between the club and its fans. In those respects, his legacy at Arsenal is already assured.\nTo reach the next phase of his coaching career, to be discussed in the same breath as his mentor Pep Guardiola or his rival Jurgen Klopp, something more is required. It’s not just about landing a massive trophy — it’s about consistently arriving in the latter stages of competitions, contesting semi-finals and finals. It’s about demonstrating that your team is capable of repeatedly competing on more than one front.\nArteta knows all of this. Asked how hungry he was to be in the quarter-finals, he said, “Now, a lot, because I haven’t had my dinner! And we have to achieve something that we haven’t done for 14 years.”\nArteta and his Arsenal team will hope that they are headed for unchartered territory — starting with a victory over Porto.\n(Top photo: Diego Souto/Getty Images)",
  "word_count": 1134,
  "scraped_at": "2026-02-14T02:17:27.960039",
  "_text_extracted": true
}