{
  "article_id": "1ffc6939c5c7",
  "url": "https://www.caughtoffside.com/2023/04/25/explosive-26-year-old-newcastle-star-likely-to-be-sacrificed-in-howe-reshuffle/",
  "title": "Newcastle news : 26 - year - old star likely to be sacrificed in Howe reshuffle",
  "date": "20230425T214500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s bound to be an important transfer window for Eddie Howe and Newcastle United this summer, as the club look to improve on what’s already been a fabulous 2022/23 campaign for the Magpies.\nEvolution not revolution is the order of the day at St. James’ Park, and if the club can get their recruitment spot on, there’s every reason to believe that they will be going places next season.\nWhether they’ll also have a Champions League campaign to negotiate will be known shortly, and that being the case, having a strong squad is imperative.\nOf course, there will always be casualties when clubs look to progress, and one fan favourite looks like he could be on his way out of the club come season’s end.\nFootball Insider quote sources as saying that if a suitable offer is received, the club will allow Allan Saint-Maximin to leave.\nThe 26-year-old hasn’t been part of Howe’s plans of late, and his 26 appearances in all competitions have only yielded one goal, per WhoScored.\nIt’s that sort of output that has meant the explosive and exciting 26-year-old hasn’t featured as much as perhaps he would’ve liked.\nGiven how well the team have played in his absence, he can hardly have any complaints either.\nHowever, injuries permitting, he’s destined to have a number of years left in the game and to that end he really needs to be given the stage to showcase his enviable talents.\nIf that’s not to be at St. James’ Park, there’ll surely be plenty of clubs willing to give him the opportunity.",
  "word_count": 262,
  "scraped_at": "2026-02-14T01:55:54.934561",
  "_text_extracted": true
}