{
  "article_id": "200040fecae0",
  "url": "https://theathletic.com/4259653/2023/03/01/derby-days-glasgow-rangers-celtic/",
  "title": "Derby Days , Glasgow : The Old Firm",
  "date": "20230301T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic is attending some of the most ferocious derbies across Europe, charting the history of the continent’s most deep-rooted and volatile rivalries. The series opened in Greece with the Derby of the Eternal Enemies. The second takes us to Scotland. This is the story of Rangers versus Celtic.\nAdvertisement\nSunday afternoon, Hampden Park, Glasgow: blue sky, sunshine, fireworks, smoke and errors.\nThe Old Firm are back on stage, edition 433 of a derby dating back to 1888. The sights and sounds of a rivalry rooted in religious and political difference as well as sporting achievements are as familiar as ever. Green and blue, Catholic and Protestant, republican and unionist. Roll up, roll up.\nAt its end, Celtic are lifting the Scottish League Cup in a stadium half-deserted — the Rangers half. The losers have not stayed around to acknowledge the victors because to do so would be a denial of all you are meant to stand for.\nMutual respect? That’s not a concept called off the bench on days like these. Rangers fans unfurl a banner that begins with the number ‘24’ but, for legal reasons, we will go no further. Celtic fans respond with one of their own: ’22 Trophies in 11 years: We set the standard’.\nTit for tat: it is the rhythm of the Glasgow derby.\nIn the green half of the ground, it remains packed and vibrant, the fog from the bangers that have been let off is drifting upwards and out. The support below is accustomed to celebration. They are singing about their Grand Old Team and what it means “if you know your history”.\nNot many in Glasgow don’t. It is either handed down directly or absorbed in the air of west Scotland, a cultural osmosis. This matters on a daily basis to the fanatics and on Old Firm afternoons it matters to all. There are moments when you can think it is like going to the theatre and discovering the audience, set and backdrop command more attention than the play.\nAnd, of course, it is the environmental energy which has so often sparked the action and fuelled the rivalry for over a century, but even the traditional, hostile atmosphere cannot stir a dull opening 40 minutes. Rangers are sluggish and Celtic do not have quite enough to sweep them aside.\nAdvertisement\nBoth teams are trying to find their footing on a surface previously criticised. Both have managers — Ange Postecoglou (Celtic) and Michael Beale (Rangers) — who want to see their teams produce modern, technical football. There will be 10 yellow cards shown somehow, but there is not one grisly tackle in the match. These are Champions League clubs. Celtic pushed Real Madrid early in the season. Rangers reached the Europa League final last year. Both clubs have Foundations doing admirable outreach work.\nAnd it is 2023, not 1980.\nThat May, there was one of those infamous Old Firm cup finals here, when the pitch was invaded by rioting supporters and mounted police were summoned to try to quell a vicious outbreak. ‘Shame’ was the cry afterwards; it’s been heard a lot down the years.\nIn 1980, there were 25 players used and 24 of them were Scottish. Both managers, John Greig (Rangers) and Billy McNeill (Celtic), were Scottish. They were also club legends, steeped in the fixture.\nOn Sunday there were three Scots in the starting XIs. There were 11 other nationalities, the managers were English and Australian and the goalscorers came from Japan and Colombia.\nAnd yet.\nOnce Kyogo Furuhashi had put Celtic 2-0 ahead with his second goal on 56 minutes, Rangers woke up, got one back from Alfredo Morelos and, as the volume increased, the pace quickened to recognisably derby-day levels. This was the spectacle, this was the Old Firm drawing you back in, keeping you watching.\nThere was no Rangers equaliser, though. No extra time. The players shook hands.\nSwapping shirts? Not in this fixture. It is the same with half ‘n’ half scarves — not here (though among Celtic merchandise on sale was one that read: ‘Shut Your Hole, Fatboy’, a reference to a recent taunt from Celtic’s Greg Taylor to Morelos, the Gers’ once-talismanic striker).\nImmediately you are back in that old antagonism. As Tommy Burns, a former Celtic player and manager, once said: “You’re exhilarated and nauseated all in one.”\nAdvertisement\nTerry Butcher, an outsider who became Rangers captain and dived head-first into the rivalry, franked that opinion: “It can be very intoxicating, as well as weird, spooky, strange and scary.”\nBoth men understood that, in Glasgow, football has been the vehicle through which old enmities, some ancient, are played out.\nTwenty-seven minutes before Sunday’s kick-off, the Green Brigade at the Celtic end started chanting ‘Ooh, ah up the ’Ra’, a reference to the IRA. It was particularly crass and insensitive in a week in which the so-called ‘New IRA’ had purportedly claimed responsibility for an attempt to murder a police officer, John Caldwell — who was taking a children’s football session — in Omagh, Northern Ireland.\nTwenty-six minutes before kick-off, the Union Bears dressed in black at the other end responded with the ‘Billy Boys’ chant, which has in the past caused Rangers to be sanctioned by UEFA, such is its bloody lyrical content.\nIrish history and Northern Ireland’s modern Troubles are the curtain you must look behind to see what the Old Firm is about.\nWhat does Furuhashi or Morelos make of all this? Bewildered?\nIt does not matter. They are passing through and, when they are gone, the Old Firm and everything it symbolises will still be at Ibrox and Parkhead and Hampden Park shouting its head off. Familiarity breeds feelings seemingly as intense as always.\nThe tone that surrounds the fixture can be summed up in one word: hysteria.\nTrying to locate some peace and quiet at Hampden in an Old Firm cup final week is a task but in the basement, beneath the hullaballoo in the stands above, is the Scottish Football Museum. There it is silent but for the odd clicking Pathe newsreel footage and the voice of Scottish Football Association guide Andy Kerr.\nKerr’s wide brief is the long history of the game in Scotland. Within it, the Old Firm occupies a significant space: a contested space. Beyond Glasgow, it also counts.\nAdvertisement\n“It’s never not been in the top two in the world,” Kerr says of the Old Firm derby’s global status, and there certainly have been times when that has felt accurate. Whether it remains so is worth consideration.\n“You can have El Clasico, Der Klassiker, the Derby d’Italia,” Kerr says, “people still aren’t prepared for how intense Old Firm matchdays are.\n“That’s especially so here at Hampden when you have a true 50-50 divide among the fans. When you have a real 50-50 here, neutrals are not prepared for the sheer vitriol and the atmosphere that can be generated.”\nOn Sunday, both clubs had 20,000 fans; when they play each other at home, they reduced opposition tickets to 800. “Very parochial in one way, and for the home team I think it’s an advantage,” Postecoglou said last week.\nKerr, like most in Scotland, is aware the intensity can have malevolent downsides. Vitriol is not alluring. But in the beginning, he says, the religious and political divisions that have come to define the Old Firm were absent. Glasgow was a different city and football’s role was new.\nIt is said frequently the term ‘Old Firm’ has an economic derivation — and Kerr acknowledges the self-conscious money-making nature of the rivalry — but, at the start, he says the term was a mark of friendship.\nOn the old original Scottish Cup beside Kerr — 150 years old in 2024 — Queen’s Park, the long-time tenants at Hampden Park, are listed as winners of six of the first nine finals. They were the city’s foremost club, the establishment club. Determinedly amateur in ethos, Queen’s Park shunned what they viewed as the tawdry development of professionalism.\nWhen Rangers, founded in 1872, and Celtic, founded in 1887, came along, they were challengers, not just on the pitch but to an attitude. They were not dominant. “Rangers’ oldest Glasgow derby is actually with Queen’s Park,” Kerr says.\nAdvertisement\nThe first game against Celtic was played in 1888 on Glasgow Green and Celtic came out on top. There was no pitch invasion, no riot, no finger-pointing afterwards. Instead, Kerr says: “At the end of the game the players all had dinner together, they had a toast to a good rivalry, also to a good friendship.\n“The term ‘Old Firm’ can be traced back to a description of them as ‘old, firm friends’. Over here, there’s a cartoon of a man with a sandwich board reading: ‘Patronise the Old Firm’. There’s another cartoon which was similar. It was meant as firm friends — friends who have known each other for a long time.\n“If you were looking for a pun, it then took on a business meaning and the two have often been aligned when it comes to making money and business. The two clubs will often vote with each other.\n“A game that showed how it was before sectarianism really kicked in was the 1909 Scottish Cup final, an Old Firm Cup final, played here. At the time, there were rumours clubs were purposely drawing games so they could get more money from a replay. With Hampden being the largest stadium in the world then, the potential to exploit that was there. There’s no evidence to say it actually happened.”\nThat Cup final was drawn 2-2. There was a replay, which ended 1-1. The referee had the decision to play extra time or not. He decided not to. Conspiracy theorists will have noted those score-lines.\n“The fans had waited around in anticipation of extra time,” Kerr says, “and when there was no sign of either team or referee coming back the fans of both took out their anger on the stadium itself. The Scottish FA decided to withhold the cup. Apart from the World Wars, that’s the only time the Scottish Cup has not been awarded.”\nThe world around these challengers was changing. For decades, there had been constant emigration from Ireland to Britain, to industrial cities such as Glasgow. Celtic had been formed by Irish immigrants as a sports club and as a means of expression. In Ireland, the fight for independence from the British Empire was reaching a crucial phase and, while those in green were supportive, those in blue were not. Glasgow, after all, was known as the ‘second city of the Empire’. There was a clash of identities and football was now embroiled.\nAdvertisement\nAs World War I and the 1916 Easter Rising in Dublin approached, religious and economic schisms in Ireland manifested themselves on the River Clyde when the Belfast-based shipyard Harland & Wolff opened a new yard in Glasgow. It refused to employ Catholics, regardless of ability.\nReligion has shaped Glasgow for hundreds of years. Historically, Protestants ‘protested’ against the rule of the (Catholic) Pope in Rome across Europe. Scotsmen such as John Knox were at the forefront of this struggle and they won. Scotland became ‘Protest-ant’, a fact visible today in the towering Knox Monument at the magnificent Glasgow Necropolis.\nIt is adjacent to the city’s Museum Of Religious Life & Art, which is beside a statue of a man on a horse called William III (the man, not the horse). William of Orange, as he was known, won a battle in Ireland in 1690 — the Battle of the Boyne — which cemented the Protestant ascendancy in Ireland.\nAll this may seem of dubious relevance, but last year that statue was vandalised. The green, white and gold colours of the Irish flag were painted onto its base. For a while, it had a security cordon.\nKerr mentions the significance of the shipyard’s employment practices and, after the Easter Rising and Irish independence in 1921, “a pamphlet produced by the Church of Scotland that was vehemently anti-Catholic”. These were hugely influential in the life of Scottish society.\n“After that, basically there was no turning back. Rangers and Celtic has had a sectarian nature: Rangers are typecast as Protestant and Celtic as Catholic.”\nGiven the Old Firm derby has existed for 135 years, to list its sectarian incidents would break the internet. Even the last 35 years or so would give an algorithm a headache.\nIn 1987, for example, there was another ‘Shame Game’. It was at Rangers’ ground, Ibrox, and the match finished 2-2. But the four goals are remembered less than the three red cards and one court case that followed.\nAdvertisement\nButcher, the England international and a major piece of the Graeme Souness revolution at Ibrox, was one of those dismissed. Butcher had arrived from Ipswich in 1986. In his autobiography he recalled his first game against Celtic at Ibrox when both sets of players prepared beneath the main stand: “We weren’t allowed to warm up on the pitch in case it inflamed the fans.”\nAs an outsider, Butcher sounds like he was in a constant state of shock at encountering something he says went “far beyond football and sometimes, I thought, far beyond religion… It is more than a passion, it is a way of life.”\nIn the ’87 game, he was sent off, as was teammate and fellow Englishman Chris Woods. Celtic’s Frank McAvennie walked too. In the days before substitute goalkeepers, a third Rangers Englishman, Graham Roberts, went in goal to replace Woods, where he ‘entertained’ the home fans. All four were charged with a breach of the peace.\nThey later appeared at Glasgow’s Sheriff’s Court, where Butcher and Woods were found guilty. Due to McAvennie’s blond hair and Rangers’ ‘Teddy Bears’ nickname, the case was known as ‘Goldilocks and the Three Bears’.\nButcher, probably correctly, felt the verdict was a political statement. The British government had already intervened after the 1980 riot, banning alcohol at Scottish grounds, a situation which continues. The need for government intervention in a football match is one measure of toxicity.\nThe hatred did not cease, however. Souness’s ‘revolution’ after his appointment as Rangers’ player-manager in 1986 was based on signing firstly Englishmen and then, momentously, a Catholic.\nRangers had not signed one for decades, regardless of ability, but Souness went to Nantes and got Mo Johnston, a Catholic striker who had played for Celtic before moving to France. It prompted an Old Firm convulsion.\nSouness, who was hardly shy of confrontation, had grown up in Edinburgh, a less volatile city. He had been firm friends with Peter Marinello, a Catholic who joined Hibernian and Arsenal, and he was a football man who had been away from Scotland as a player in England and Italy.\nAdvertisement\nSouness was interested in football success, not cultural supremacy. As he explained: “I remembered the words of Jock Stein, a Protestant who went on to become Celtic’s most successful manager.\n“He said if there were two star boys coming through in Glasgow, one a Catholic, the other Protestant, he could afford to concentrate all his efforts on signing the Protestant because he knew Rangers would not be competing for the Catholic.\n“Kenny Dalglish is an obvious example. The fact that he was a Protestant did not deter Celtic from signing him. It was a one-sided argument and it was Rangers who were losing out for all the wrong reasons.”\nPlenty of Rangers supporters thought they were the right reasons. Some tore up season tickets, others refused to include Johnston’s goals in results; attitudes which, in the 1960s saw Alex Ferguson leave Rangers because he married a Catholic, endured.\nFast forward to 2016 and, at Celtic Park, effigies were hung to symbolise Rangers’ 2012 liquidation, their relocation to Scotland’s fourth tier and long climb back to the derby. A few months ago, ‘HaHa 66’ graffiti appeared, mocking the 66 Rangers supporters who died in the 1971 Ibrox disaster. In 2019, as Celtic captain Scott Brown was boarding the team bus after a match at Ibrox a Rangers fan asked: “How’s your sister?” Brown’s sister died of cancer in 2008.\nIt was the same year current Scotland manager Steve Clarke, a Catholic, spoke out publicly about sectarianism after abuse at Ibrox. “Where are we living?” Clarke asked. “The Dark Ages?”\nClarke spoke for a section of Scottish society and for some fans who dislike the term ‘Old Firm’ because of the attachment implicit within. They want nothing to do with their rival; there are Celtic fans who proclaim Rangers are no more due to liquidation, while Rangers supporters erupted when informed the club would be participating in a friendly against Celtic in Australia during the World Cup. The game was cancelled.\nAdvertisement\nThere is also a view that the monopoly of the two Glasgow clubs is negative for Scotland — there has been no alternative league champion since Ferguson’s Aberdeen in 1985.\nAnd then there is Neil Lennon. After another ‘shame game’ in 2011 — the one where the coaches Lennon and Ally McCoist squared up to each other on the touchline after a game featuring three red cards and 12 yellows. The Scottish government called “a summit” to discuss what they saw as an unravelling situation. The previous Old Firm meeting had seen 230 arrests and the Scottish Police Federation chairman Les Gray said: “We simply don’t have the money and resources to do this. This madness can’t go on.”\nBut it did. Lennon and others were targeted with explosive devices for which two men were jailed for five years each. The devices came through the post, one to Celtic’s training ground, Lennoxtown.\nMurderous intent is, dismally, not merely a threat. In October 1995, teenager Mark Scott was walking back from Parkhead wearing his Celtic scarf when he passed a Loyalist (Protestant) bar. Jason Campbell, who was 21 and a Rangers supporter, ran up to Scott and slashed his throat. Scott died. He was 16. Campbell received a 15-year sentence.\nScotland was shocked and Scott’s friend, Cara Henderson, set up the anti-sectarian charity Nil By Mouth. It is still going.\nAttaching the Old Firm to sectarian violence when it occurs away from a stadium is hazardous, but NBM estimated that eight-15 murders had occurred between 1990 and 2005 connected to sectarianism.\n“Thank God, Scottish society has become less violent,” says NBM director Dave Scott. “Recent governments have tried to tackle it through initiatives such as the Violence Reduction Unit. The riots of the 1980s, I think, have today been replaced by attitudes and antagonisms, so it’s not necessarily about punch-ups.\nAdvertisement\n“And in an increasingly secular world, people do not necessarily identify as Catholic and Protestant any more. But they will tell you they have been born into a Celtic family or a Rangers family. So you are still born into this eternal ‘them and us’.”\nNil By Mouth operates in schools and workplaces offering a counter to sectarianism.\n“As we phrase it,” Scott adds, “the Old Firm derby is a cocktail of passion, pantomime and poison. For the people around it, it is the biggest football match on the planet. It’s like a sporting crack cocaine: there’s nothing that gives fans the high of a victory over the other one or the comedown of a defeat.”\nIt feels necessary at this point to return to football and footballers.\nCeltic were champions of Europe in 1967, the first British and northern European club to win the continent’s greatest trophy. Six days later Rangers contested the European Cup Winners’ Cup final against Bayern Munich, losing 1-0 in extra time. Glasgow’s reputation as a capital of football was deserved. Imagine the quality of the derby then.\nDalglish, Souness, Jimmy Johnstone, Willie Henderson, Brian Laudrup, Henrik Larsson, Paul Gascoigne and so many more have graced both teams then and since.\nAnd on Monday morning in elegant George Square, Glasgow resumes another rhythm, the working week, when Celtic and Rangers fans overlap on trains, buses and at work or college. They get on. It happens.\nIt had been that way last Tuesday at Hampden when Beale and Postecoglou entered a room for the televised element of their press conference. They walked in together, sat down together and had their photographs taken together. In the still images, they looked stiff and there was much comment on their apparent discomfort.\nBut if you were in the room, as The Athletic was, you would not have said that. The atmosphere was amicable. Each manager spoke well.\nAdvertisement\n“There’s nothing like this rivalry,” Beale said. “I’ve obviously been at Liverpool–Everton, the Sao Paulo derbies are big, Palmeiras, Corinthians, Santos — no away fans there, to give you an example of how feisty it is.\n“They’re big, but amongst derbies this stands tall.”\nUnfortunately for Beale, around the same time, one of his players, Fashion Sakala, was referring to Celtic as “the other mob”. It does not appear to have gone down well at Celtic.\nSakala comes from Zambia but his remark is already part of the historical lexicon of Glasgow’s derby.\nYou could tell that in a newsagent off George Square. On the back page of the Daily Record, the headline read: “2-1 To The Other Mob.”\nOn it goes. Game 434 is next month.\nExplore the venues, from the stadia to where to eat and stay when visiting Glasgow, in our interactive Google Map:\n(Photos for top image: Michael Steele/Getty Images; Ian MacNicol/Getty Images; Ian MacNicol/Getty Images; Mark Runnacles/Getty Images)",
  "word_count": 3594,
  "scraped_at": "2026-02-14T01:46:30.513365",
  "_text_extracted": true
}