{
  "article_id": "20105fd14261",
  "url": "https://www.ocregister.com/2025/02/17/among-questions-for-lafc-where-does-the-production-come-from/",
  "title": "Among questions for LAFC : Where does the production come from ? ",
  "date": "20250217T213000Z",
  "domain": "ocregister.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Year Four for the Los Angeles Football Club under head coach Steve Cherundolo begins Tuesday on the frozen terrain near Denver.\nBetween the ongoing work of the front office and the technical staff, the club appears set up for success again, though that’s never a guarantee as LAFC supporters remember from Bob Bradley’s fourth season in charge.\nThere’s no reason to anticipate a 2021-type stumble from this Cherundolo-led group, but even in the best of situations, it’s always a fight for MLS teams to avoid falling off the pace.\nHere are the top questions as action gets underway:\nWho makes up for all the lost production?\nWingers score at LAFC. That’s been the club’s M.O. since it was founded.\nLast year, the duo of Mateusz Bogusz and Denis Bouanga accounted for the most goal production in MLS behind only Miami’s Lionel Messi and Luis Suarez.\nBogusz’s breakout season (20 goals and 12 assists in all competitions) was considerably more than projected. No one had him finishing in the neighborhood of what Carlos Vela would have produced during his talisman days in black and gold.\nAfter transferring Bogusz to Cruz Azul, LAFC did the same last Friday when it moved Cristian Olivera (14 goals and four assists in all competitions) to Brazilian club Grêmio.\nNext-man-up honors obviously go to French striker Olivier Giroud, who underperformed after joining in the summer. Arriving at preseason camp “fit and bright,” Cherundolo said Giroud’s “adjustment period is over” and he’s been happy with the 38-year-old’s performance.\nWhen the move becomes official, Cherundolo can also call upon Turkish forward Cengiz Ünder, who sources confirm will join LAFC on loan from Fenerbahçe as a third Designated Player through the summer window.\nFree agent signing Jeremy Ebobisse is highly capable and young players David Martínez and Nathan Ordaz need to contribute. If he stays fit, Martínez is in line for a significant uptick in minutes from his first season. Cherundolo also noted that midfielders Mark Delgado, Timothy Tillman and Odin Holm should chip in.\nWhat if Giroud doesn’t produce?\nThere’s no bigger question mark about a single player on the squad than the French World Cup winner. Should he do what everyone around LAFC hopes he will, problem solved. But the alternative – inconsistent goal contributions, showing his age in games, not staying fit – raises all sorts of issues that could become obstacles along the way.\nWhere is LAFC strong?\n1) Depth.\nAcross the roster, LAFC is poised to go at least two-deep at nearly every position as it aims to make a third straight 50-plus-match run.\n2) The back line.\nA variety of playmaking fullbacks and strong center backs constitute options for Cherundolo as he assembles the team’s defensive formations.\nWhat is the biggest on-field area of concern?\nWhen LAFC is operating at full bore, the midfield’s ability to control games (press, counter-press and play with the ball) creates transition opportunities and, ultimately, goals. The midfield saw the most upheaval coming into 2025. The new group must mesh and deliver for the Black & Gold to make good on lofty expectations.\nIs Antoine Griezmann ever actually signing with LAFC?\nThe MLS secondary transfer window (July 24-Aug. 21) should yield that answer. Griezmann is currently scoring goals for Atlético Madrid as La Liga and UEFA Champions League games take place. The French star’s long-whispered arrival would complete the “French Connection” that LAFC began piecing together since the arrival of Bouanga in the summer of ’22. Where English and Spanish-speaking voices once dominated the dressing room, French quickly rocketed up the charts. Bouanga has enjoyed plenty of chances to converse with the likes of Giroud, Ebobisse, goalkeeper Hugo Lloris and center back Maxime Chanot. He has repeatedly said he would love for Griezmann to join the group.\nHas Carlos Vela’s time with LAFC come to an end?\nVela and the club are quiet about his future for now, but there’s little reason to think that the Mexican forward – the face of the franchise since 2017 – will suit up for LAFC. Does that mean his affiliation with the club is over? Not necessarily. As the team’s eighth season gets underway, odds are far better that LAFC will erect a statue in Vela’s honor than sign him to the roster, like it did late last year.",
  "word_count": 718,
  "scraped_at": "2026-02-14T01:52:15.336957",
  "_text_extracted": true
}