{
  "article_id": "203910a7f6a0",
  "url": "https://theathletic.com/4319577/2023/03/17/manchester-united-juventus-europa-league-draw/",
  "title": "Manchester United and Juventu  attritional  Europa League draw analysis",
  "date": "20230317T141500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United face six-time Europa League champions Sevilla in the quarter-finals of the competition and then a potential semi-final clash against Juventus or Arsenal’s conquerors, Sporting.\nErik ten Hag’s side beat Real Betis 5-1 on aggregate to reach the last eight and will be heading back to Spain in April in their quest to win the Europa League.\nUnited have already faced three Spanish sides in this campaign — Real Sociedad, Barcelona and Real Betis — but have never beaten Sevilla in European competition.\nAdvertisement\nBayer Leverkusen against Union Saint-Gilloise, the Belgian side of which Brighton owner-chairman Tony Bloom is a majority shareholder, and Feyenoord against Jose Mourinho’s Roma complete the last eight.\nQuarter-finals (April 13/20)\nManchester United v Sevilla\nJuventus v Sporting\nBayer Leverkusen v Union Saint-Gilloise\nFeyenoord v Roma\nSemi-finals (May 11/18)\nJuventus or Sporting v Manchester United or Sevilla\nFeyenoord or Roma v Bayer Leverkusen or Union Saint-Gilloise\nFinal (May 31)\nJuventus/Sporting/Manchester United/Sevilla v Feyenoord/Roma/Bayer Leverkusen/Union Saint-Gilloise\nHere’s what our experts — Carl Anka, Sebastian Stafford-Bloor and Tomas Hill Lopez-Menchero — made of it all.\nWho do you think will lift the trophy in Budapest? Let us know in the comments below…\nGame on! What is your instant reaction to the draw?\nStafford-Bloor: Without trying to be contrary, I’m starting to really like Union Saint-Gilloise’s chances. A trip to Leverkusen won’t be easy, not least because there’s really no knowing what Xabi Alonso’s side will be week-to-week, but Union carry a superb counter-press and they’ll hassle Leverkusen’s young ball-carrying defenders into mistakes. Beyond that, they’ll be a match for most of these teams. Interestingly, among those still left in the tournament, who’s actually playing well?\nAnka: Congratulations to Jose Mourinho. Roma have ended up in the slightly more favourable side of the bracket and he should be backing himself to win a repeat of last year’s Europa Conference League final against Feyenoord. Anyone looking to win this competition, though, will need a lot of managerial chicaneries and a bit of luck with injuries.\nHill Lopez-Menchero: The quarter-finals and semi-finals may be more exciting than the final itself. Juventus-Sporting Lisbon and Manchester United-Sevilla would not have looked out of place as the showpiece event in Budapest and the resulting semi-final clash is also certain to produce fireworks. Whichever team progresses from that side of the draw will have fully earned their place in the final.\nAdvertisement\nManchester United against Sevilla. What do you think?\nAnka: This is an oddity. The last two defeats United have had in Europa League knockout games were against Villarreal in the 2021 final and Sevilla in the 2020 semi-final. United should have more than enough to get past a poor-looking Sevilla side, but the Spanish team have such a formidable record in this tournament that Erik ten Hag will probably be asked if he thinks there’s any hoodoo the nation has over his club.\nGO DEEPER\nA guide to Seville for Manchester United fans: Where to eat and drink and explore\nHill Lopez-Menchero: One Manchester United fans would have wanted to avoid given Sevilla’s pedigree in the competition. Jorge Sampaoli’s side have struggled in La Liga and are just two points above the relegation zone but that means they will relish a big European tie even more — even if United still have to be considered favourites.\nStafford-Bloor: United will have no problem at all. Even with their special ownership of the Europa League, Sevilla’s season is a mess and they were extremely fortunate to hold out against Fenerbahce. They’ve been resilient so far, as the various wounds of Marko Dmitrovic attest to, but United will be too strong. It’s a surprise Sevilla have made it this far.\nWhat is the tie you’re most looking forward to?\nHill Lopez-Menchero: Juventus against Sporting. The Italians have previous against Portuguese sides — they were beaten home and away by Benfica in this season’s Champions League and were knocked out of the round of 16 by Porto in embarrassing fashion in 2021. Ruben Amorim’s team represent another stern test and they will not fear Juventus after the way they knocked Arsenal out of the competition.\nAnka: Feyenoord v Roma might not be easy on the eye but it will be full of players in the “ones to watch” category. Arne Slot will want some payback from the Europa Conference League final and his team are in a promising title race in the Netherlands (top and three points ahead of second-place Ajax). Roma have some fun attacking pieces (keep an eye on whether Tammy Abraham makes another move this summer) and Mourinho appears to have got the starting XI working in an efficient manner. They say styles make fights in boxing. This should be an intriguing match-up.\nStafford-Bloor: Juventus v Sporting. Sporting are fun, but they’re also solid. Amorim’s football isn’t necessarily the most attractive, but the craft he has at the top of the pitch — particularly in Marcus Edwards and Pedro Goncalves — gives them this irrepressible quality when they have the ball and the momentum. It will be interesting to watch Juventus try to stand up to that.\nAdvertisement\nWho has the toughest route to the final?\nStafford-Bloor: Manchester United, Juventus, Sporting and Sevilla couldn’t have had it much tougher. Let’s call that the attritional side of the draw.\nAnka: The victor of Manchester United v Sevilla will face the winner of Juventus v Sporting. Whoever emerges from that quartet will arrive at the final scarred, bruised and with at least one player being linked to a move away to a Champions League heavyweight in the summer.\n4 – Man Utd are only the second side ever to face four different sides from the same country in a single season in a major European competition (Real Sociedad, Barça, Betis, Sevilla), after Leeds Utd in the 2000-01 Champions League (Barça, Real Madrid, Deportivo, Valencia). Hola. pic.twitter.com/F3v3rCQR8T\n— OptaJoe (@OptaJoe) March 17, 2023\nHill Lopez-Menchero: Union Saint-Gilloise are huge underdogs in this competition. It could be worse for the Belgian team, but they will still have their work cut out against Bayer Leverkusen in the quarter-finals. An impressive Feyenoord side or Roma lie in wait if they come through that tie. They couldn’t, could they?\nWhich player should we look out for?\nHill Lopez-Menchero: Federico Chiesa could be hugely important for Juventus, despite his persistent injury problems. The winger’s late strike put the finishing touches on the Italian giants’ last-16 win against Freiburg and he appears desperate to make up for lost time after a long spell out with an ACL injury.\nStafford-Bloor: Victor Boniface. A young, 6ft 4in (193cm) Nigerian forward who plays as the No 9 in Union Saint-Gilloise’s front three. He can look a touch awkward with the ball but that’s really a misconception. He’s dynamic and incisive in possession, finishes well, and — together with his supporting attackers — is a huge threat on the break. Don’t expect him to stay in Belgium for much longer.\nAnka: Feyenoord captain Orkun Kokcu’s talent levels are fast approaching “too good for the Eredivisie”. The 22-year-old sits at the base of Slot’s 4-2-3-1 and acts as his side’s midfield metronome. Clever on the ball and aggressive off it, there are shades of a young Christian Eriksen to him.\nWho is going to win this year’s competition?\nAnka: I think I’m contractually obligated to say Manchester United here!\nStafford-Bloor: I’ll stick to my guns and say Union Saint-Gilloise (but hedge my bets by also saying Sporting).\nHill Lopez-Menchero: I would say Sevilla, but they have been in shaky form all season. It feels as if Juventus could be the anti-heroes and claim a European trophy in a season in which they have made headlines for all the wrong reasons. They will have to do it the hard way, however.\n(Top photo: FABRICE COFFRINI/AFP via Getty Images)",
  "word_count": 1310,
  "scraped_at": "2026-02-14T02:16:40.063384",
  "_text_extracted": true
}