{
  "article_id": "205bb871f239",
  "url": "https://www.caughtoffside.com/2023/08/31/inside-spain-latest-on-the-spain-kiss-scandal-barcelona-registration-drama-and-real-madrid-injury-crisis/",
  "title": "Inside Spain : Latest on the Spain kiss scandal , Barcelona registration drama and Real Madrid injury crisis",
  "date": "20230831T184500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside Spain is a weekly instalment brought to you by Football España, providing an insight into all of the major stories coming out of the rich and intense climes of La Liga and beyond.\nSomehow, it got worse. President of the Spanish Football Federation Luis Rubiales topped of his week of lying in the name of Jenni Hermoso, putting together a ‘sorry if you were offended apology’ which he pressured her to be in, and then failing to heed the warnings of the Spanish Government to resign by acting out a Leonardo di Caprio scene from the Wolf of Wall Street. His shouting ‘I’m not resigning’ may have been applauded by most of the Federation Assembly, but it was met with horror by the rest of Spain.\nLess than 24 hours later he was suspended by FIFA for 90 days, and now the Ministry for Sport has taken the matter to a tribunal. If they get the verdict they want, that it was a ‘very serious infraction’, Rubiales could be out of the game for 2-15 years. After he spun his story that Hermoso had consented during a conversation on the podium where he said ‘just a peck?’ and she responded ‘OK’, Hermoso came out with a public statement denying that, saying she felt vulnerable and was the victim of sexual assault.\n#ÚltimaHora ?? Luis Rubiales no dimitirá como presidente de la RFEF:\n?? \"No voy a dimitir, no voy a dimitir\". pic.twitter.com/VsHwl1T0mA\n— Relevo (@relevo) August 25, 2023\n79 players have signed a document put together by her union, which states that they will be pursuing action against him, and that they will not be playing anymore until change happens. Since, UEFA player of the Year Aitana Bonmati and Sarina Wiegman demanded better at the Champions League draw.\nA video was released of Hermoso laughing off the incident on the team bus after, seemingly demanding that not only she process the incident and complain about it immediately, but also that she be miserable after winning the World Cup. It looks as if the applause and the player strike will cost both Rubiales and Manager Jorge Vilda their jobs. The RFEF regional bosses have demanded his resignation, and yet somehow Rubiales remains. His mother did go on hunger strike in a church for two-and-a-half days, demanding an end to the ‘witchhunt’ and that Hermoso change her story, but left out the back door and has ended it.\nSarina Wiegman, England women's head coach, has paid tribute to Spain's World Cup-winning side after picking up the UEFA Women's Coach of the Year award.pic.twitter.com/bZKdyibdIC\n— Football España (@footballespana_) August 31, 2023\nElsewhere Barcelona still haven’t signed Joao Cancelo – President Joan Laporta is using his own personal funds to push through the final deals of the transfer window, and it is strongly believed that Ansu Fati’s move to Brighton will facilitate the arrival of Joao Felix on loan from Atletico Madrid. If 16-year-old Lamine Yamal, man of the match in a 4-3 win over Villarreal, continues his form, he might not see much game time.\nReal Madrid continued their flawless start with another Jude Bellingham goal in a 1-0 win over Rafa Benitez’s Celta Vigo, but is quickly losing people around him. After Thibaut Courtois and Eder Militao tore their ACLs, Vinicius Junior has a muscle tear which will keep him out for six weeks and probably the Madrid derby. For their part, Atletico Madrid just recorded their biggest ever away La Liga win, firing seven past Rayo Vallecano in an incredible performance.",
  "word_count": 591,
  "scraped_at": "2026-02-14T01:50:52.139819",
  "_text_extracted": true
}