{
  "article_id": "206f659f33ed",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-13029471/kyle-walker-annie-kilner-relationship-drama-timeline-lauryn-goodman.html",
  "title": "Full timeline of Kyle Walker and Annie Kilner drama",
  "date": "20240131T203000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Full timeline of Kyle Walker and Annie Kilner drama after shocking revelation he fathered a second child with Lauryn Goodman\nThe last month has seen Kyle Walker's relationship with Annie Kilner dramatically collapse - with more twists and turns being revealed with every passing day.\nHis two-year marriage to Annie, who he met as a teenager, is in tatters after his infidelities were brought to light.\nThe Manchester City and England full-back was named as the father of influencer Lauryn Goodman's five-month old daughter.\nThe footballer, 33, had already fathered a son, three year-old Kairo, with Goodman following an earlier separation from Annie, 30, in 2020.\nHe has since issued a grovelling apology and pleaded for forgiveness while both sides' families have come out all guns blazing to support their loved ones.\nAnnie shares three children with Kyle and is heavily pregnant with her fourth.\nHere MailOnline gives a complete timeline of the marriage breakdown and everything that has happened since:\nThe last month has seen Kyle Walker's relationship with Annie Kilner dramatically collapse - with more twists and turns being revealed with every passing day\nThe Manchester City and England full-back was named as the father of influencer Lauryn Goodman 's five-month old daughter this month\nEarly years - Kyle and Annie are childhood sweethearts\nKyle and Annie first met in their hometown of Sheffield when she was 15 and he was 17.\nShe has previously described their early bond as 'love at first sight'.\nKyle and Annie have three sons together, Roman, 11, Riaan, seven, and Reign, five.\nThe brunette beauty does not show their faces on social media and they are kept out of the spotlight.\nAnnie has previously spoken of her desire to have a daughter someday and admitted to OK! magazine: 'I really want a little girl. I love my boys, but I'd really like a daughter as I'm outnumbered in this house.'\nKyle and Annie first met in their hometown of Sheffield when she was 15 and he was 17. She has previously described their early bond as 'love at first sight'\n2016: First claims of Kyle's infidelity emerge\nDuring Euro 2016, Walker was caught messaging Playboy model Carla Howe, while he was in France with the England team.\nThe text message exchange is said to have taken place before England's 1-1 draw with Russia in their opening group match, while he was at the team hotel in Chantilly.\nThe footballer first met the model at a party, where they reportedly exchanged numbers.\nHowever, when she found out he had a partner and a child, a source told the newspaper that she stopped messaging him.\nThe friend said: 'She found out Kyle has a girlfriend so now ignores his messages as she doesn't want it to go any further with him.'\nDuring Euro 2016, Walker was caught messaging Playboy model Carla Howe, while he was in France with the England team\nApril 2019 - Kyle and Annie split amid further infidelity claims\nAnnie and Kyle have had a complicated past and in 2019 split after he was caught in a cheating scandal.\nAt the time he was dumped by the ex-glamour model after an alleged string of romps with reality TV star Laura Brown.\nA friend of the Ex On The Beach star claimed that Brown confessed to Kilner about the supposed sexual encounters which happened in the back of Walker's £200,000 Bentley Bentayga.\nKilner reportedly kicked Walker out of their £3.5million mansion following the scandal before they later got back together.\nAn insider told the Sun that after Brown found out Walker had a girlfriend she wrote to her to say: 'He's a rat, he was always funny and a nice guy to me but when I found out he was actually with you and kids I'm not that girl to keep seeing him I know you've been together long time but it's no excuse for him'.\nShe told a friend at the time: 'I felt exploited. Because he's a rich footballer he felt that he could treat me how he wanted.'\nAnnie and Kyle have had a complicated past and in 2019 split after he was caught in a cheating scandal\nApril 2020: Claims of Kyle hosting pandemic sex party\nDuring the pandemic Kyle allegedly hosted a sex party with two escorts.\nThe footballer and a friend, paid £2,200 for Louise McNamara, 21, and a 24-year-old Brazilian call girl to visit his Cheshire home.\nThe escorts left on the same day Sheffield-born Walker told fans to stay indoors.\nSingle mother-of-one Louise said she did not recognise the footballer at first and was sent a message from her boss saying they had a 'high profile client'.\nShe says she left the flat with the other woman at around 2am.\n'Kyle really should know better,' Louise told The Sun.\n'On the one hand he's inviting strangers round to his house for sex and the next day he's lecturing everyone on the need to stay safe.'\nWalker apologised for the incident.\nHe said: 'I want to take this opportunity to issue a public apology for the choices I made last week.\n'I understand that my position as a professional footballer brings the responsibility of being a role model.\n'As such, I want to apologise to my family, friends, football club, supporters and the public for letting them down.'\n2020 - Lauryn gives birth to son Kairo with Kyle\nKyle had a son, Kairo, now three, with social media star Lauryn during a temporary split from Annie in February 2020 when they had a short dalliance\nKyle had a son, Kairo, now three, with social media star Lauryn during a temporary split from Annie in February 2020 when they had a short dalliance.\nDespite being married to Annie, Walker reportedly bought Lauryn a £2.5million seaside mansion in Sussex last year.\nShe previously accused Annie of treating her boy like an 'outcast' and acting like he's a 'dirty secret' after she commented on Kyle's 'three sons' instead of four.\nThe spat kicked off following Manchester City's recent treble victory, with Lauryn sharing a snap of Kairo wearing his father's team's kit.\nShe wrote on Instagram: '2023 what a special year, history made. I understand we have skipped a few chapters here…@kairowalker always supporting.'\nHowever, Annie seemingly hit back at Lauryn's post with a snap of her own, which showed her sons Riaan, Roman and Reign with their dad on the pitch, captioning the snap: '3 is the magic number.'\nShe added: 'Winning the champions league with Your daddy. All these memories you get to have with your daddy. Nothing and no one will ever take that from you. We've got you 3.'\nFurious at the post, Lauryn then lashed out at Annie, branding her a 'wicked stepmother' who is trying to 'eradicate' her son's 'existence'.\nNovember 2021 - Walker and Kilner marry in secret\nAfter the news of Lauryn's first child Annie and Kyle got back together and married in secret in November 2021.\nIt was reported at the time that it was a small ceremony.\nIn June 2020, it was reported that Kyle popped the question to Annie with a floral proposal at her home\nMarch 2023 - Lauryn announces second pregnancy\nLauryn revealed she was expecting her second child in March last year\nLauryn revealed she was expecting her second child in March last year.\nSharing a photo of herself and son Kairo on Instagram, Lauryn's baby bump could be seen as she posed in a bikini during a beach break.\n'FYI…It's a BABY! Family completed 2023,' she captioned the post.\nSpring 2023 - Kyle allegedly flashes and kisses woman\nThere was trouble last spring when Man City star Kyle allegedly flashed and kissed another woman in a Vodka Revolution bar.\nHe was seen apparently pulling down his trousers in the venue, believed to be in Wilmslow, Cheshire, during 90 minutes of alleged lewd behaviour.\nNot long afterwards Annie shared an Instagram post with her thousands of followers which read: 'I think it's important to remember that no matter how good you are to people, it won't make them good to you.'\nIn March CCTV footage showed Kyle pulled down his trousers to flash at a bar, fondled a blonde woman's breasts and kissed her in shameful moments caught on video.\nThe Manchester City defender appeared to grind behind the woman, who was not his wife Annie. Punters on a night out were reportedly shocked by the horrific behaviour which went on for around 90 minutes until 7pm.\nIn response, one of the two women in his group screamed and pointed as Walker laughed with a friend.\nThe star then appeared to expose himself again after just a few minutes - and only a few feet away from two other women sitting in a booth at the bar, according to The Sun's report.\nHe is then said to have walked over to shake their hands and say hello. More footage from the night seems to show him 'pawing' at one of his female friends' breasts and kissing her.\nWalker is a father to three children with Kilner (pictured), who is currently pregnant with their fourth\nAugust 2023 - Lauryn gives birth to a daughter with 'another footballer'\nIn August 2023, Lauryn gave birth to a daughter with 'another footballer' and did not publicly disclose her second child's name.\nShe hinting the initials were KW on Instagram.\nThen after Annie said her and Kyle had split Kyle confirmed he was the father of Lauryn's second child.\nWhile her footballer husband was away with his club, Annie would receive a message from Lauryn in which his mistress revealed the truth about their relationship and the parentage of her second child.\nSpeaking to the Sun, Lauryn claimed that she concluded the father of her children was lying to both the women in his life in December and despite his attempts to patch things up by trying to FaceTime her on Christmas Day she said: 'No, this is done, this is too toxic'.\nAccusing the footballer of 'gaslighting' her, Lauryn, who lives in Brighton, said she decided to speak to Annie on the day after Boxing Day, while Kyle was away with the team playing Everton in the Premier League.\nShe claims that Annie, who lives in the couple's £2.5million mansion, told her she suspected Lauryn's daughter was Kyle's and that her friends had told her she was 'crazy'.\nLauryn said: 'Kyle had denied she was his daughter many, many times. I don't think Annie wanted to believe it was true, which is understandable.\n'She kept asking for proof so I showed her the DNA test but even then she doubted it was real until I pointed out my daughter's name on the paperwork.\n'Annie and I later FaceTimed and my daughter was there.'\nThe model said that Annie 'kept cool and calm' when she was handed the proof as she had 'suspected' that Kyle was the father to Lauryn's second child.\nJanuary 2024: Annie announces split from Kyle after two years of marriage\nIn the second week of January Annie announced her separation from footballer husband Kyle after two years of marriage\nIn the second week of January Annie announced her separation from footballer husband Kyle after two years of marriage.\nThe brunette exchanged vows with Manchester City and England right-back Walker in December 2021 following a 12-year relationship, during which they welcomed three children.\nBut in an Instagram post Kilner confirmed she has dumped her childhood sweetheart - an 81 cap England international.\nWalker, who is expected to play a pivotal role for Gareth Southgate's team at the European Championships in June, is also believed to have moved out of their £2.4million mansion.\nShe wrote: 'Sadly, after many years of marriage and three wonderful children together, I have decided to take some time away from Kyle.\n'I do not wish to comment on the position any further. For now, I ask that the privacy of myself and my 3 young children be respected during this difficult time.'\nAt the time it was claimed the couple had been having arguments about his involvement with Lauryn.\nA source said at the time: 'Kyle and Annie have been arguing. She said she'd had enough because of all the ongoing stuff with Lauryn.\n'There was another legal meeting involving her and Kyle this week. It's put a real strain on them.\n'Annie has done nothing wrong apart from trust him. She wants to keep things together.'\nJanuary 2024: It is revealed that Kyle is the father of Lauryn's second child\nA week after Annie and Kyle's split came to light Kyle was revealed as the father of Lauryn's second child\nA week after Annie and Kyle's split came to light Kyle was revealed as the father of Lauryn's second child.\nHe had been rumoured to be the biological dad since the reality star, 32, gave birth to the tot last August, which she claimed to have welcomed with 'another footballer'.\nAfter Lauryn had continued to drop not-so-subtle hints regarding her daughter's paternity.\nHowever sources close to the couple at the time said Annie had known for some time the baby was Kyle's and it did not spark her decision to take a break from the marriage.\nA friend said: 'Kyle and Annie have been on the rocks for some time.\n'There are lots of historic issues between them, as well as his dalliances with Lauryn, that has led to the break up.\n'They are both putting on a united front for the sake of the three children they share together, who are their main concern.\n'The marriage isn't 100 per cent over, it could be rescued, but there needs to be lots of healing first.\n'They need to take a break from the relationship to restock and reevaluate.'\nThe friend added: 'Kyle is no longer in contact with Lauryn.\n'Her stirring behind the scenes have really affected Annie and had a detrimental impact on her health.'\nJanuary 2024: Kyle issues public apology to Annie and pleads for forgiveness\nLast week Kyle broke down as he admitted to making 'idiot choices and idiot decisions' while fathering a secret child during his marriage to 'best friend' Annie\nLast week Kyle broke down as he admitted to making 'idiot choices and idiot decisions' while fathering a secret child during his marriage to 'best friend' Annie.\nIn a rare interview about his personal life, Walker was close to tears as he reflected on moving away from their family home in Cheshire and spending enforced time away from his three children with Kilner, who is currently pregnant with their fourth.\nHe told The Sun: 'What I've done is horrible and I take full responsibility. I made idiot choices and idiot decisions. I can't begin to think or imagine what Annie is going through. I've tried to ask her but there's pain and hurt.\n'The man that's meant to love, care and be there for her, did this.'\nHe admitted he wanted to 'curl up in a ball' after his relationship with Goodman came to light in January.\nHe added: 'When I met Annie at 17, I never envisaged my private life being like this. I never thought I would be a father of six.\n'The only person to blame is me. I have roles and responsibilities that I'm aware of and I've made stupid choices. But I need to own up to my mistakes — I owe it to everyone.\n'My actions have caused a lot of pain to a lot of people. I'm sorry because, as a family, this isn't meant to happen.'\n'My little boy goes to sleep with me every night and to not have him... I'm used to being away for long periods of time with England,' he said, his voice breaking.\n'We say goodnight on FaceTime. But to know that I'm not with him because of my mistake - mistake is probably the wrong word, my choices - that's what pains me.'\nJanuary 2024: Lauryn brands Kyle a pathological lair and narcissist\nThis week Lauryn broke her silence after Kyle insisted they didn't have a relationship and called fathering a second secret child with her an 'idiot decision'\nThis week Lauryn broke her silence after Kyle insisted they didn't have a relationship and called fathering a second secret child with her an 'idiot decision'.\nIn a rare interview about his personal life, Walker was close to tears at the weekend as he confessed his two-year marriage to Annie is in tatters after he was named as the father of Goodman's five-month old daughter.\nWhile he insisted the affair was not a proper relationship, Goodman was quick to claim the footballer was lying, taking to Instagram on Monday to share a post detailing the definition of a 'pathological narcissist', who spends their life 'lying' and 'gaslighting' those around them.\nWalker had claimed there was 'no relationship' between the pair, saying: 'to have a relationship with someone… would she even know how many sugars I have in my coffee, if I have sugars? She couldn't tell you'.\nYet the mother-of-two refuted this, sharing a 'there are receipts' meme while pointedly writing: 'Flat white no sugars please' in a nod to Walker's comments.\nJanuary 2024: Annie Kilner's sister launches attack on Lauryn\nAlso this week Annie's sister condemned Lauryn for her ongoing 'torment and cruelty' after Kyle was confirmed as the father of her baby daughter\nTaking to Instagram on Monday evening, Kilner's sister Sian slammed Goodman for continuing to antagonise the mother-of-three despite being aware of her pregnancy\nAlso this week Annie's sister condemned Lauryn for her ongoing 'torment and cruelty' after Kyle was confirmed as the father of her baby daughter.\nTaking to Instagram on Monday evening, Kilner's sister Sian slammed Goodman for continuing to antagonise the mother-of-three despite being aware of her pregnancy.\nShe wrote: '@lauryngoodman91 When does your torment end? My sister who is now 7 months pregnant, has faced your cruelty for almost 5 years now.\n'What's your goal? To see how much stress you can put on a pregnant woman? To create a false victim narrative around what you did? You clearly lack empathy but this level of evil is out of control and harms everyone – especially the children.'\nRubbishing Goodman's claim that she and Walker enjoyed a loving relationship - an allegation the footballer denies - she added: 'Stop accusing others: your true self is revealed. The so-called 'loving relationship' is a facade.. It's not fooling anyone so why don't you just give us all a break and stop.\n'Also, He has one sugar, Nestle Coffee Mate and semi-skimmed milk. But that's the coffee you get at home... Not the ones in hotels or Air B&BS.'\nSian also shared a photo of herself with Kilner on an overseas holiday, wit the accompanying caption: 'A queen doesn't let her crown slip.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- New video shows man with backpack similar to Guthrie kidnapper\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Moment driver veers to target e-bike riders before killing teen\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl",
  "word_count": 3283,
  "scraped_at": "2026-02-14T01:48:39.898227",
  "_text_extracted": true
}