{
  "article_id": "2075ec0c33ae",
  "url": "https://www.themag.co.uk/2024/10/chris-wood-nonsense-resurfaces-yet-again-newcastle-united-nottingham-forest/",
  "title": "Chris Wood nonsense resurfaces yet again",
  "date": "20241026T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chris Wood nonsense resurfaces yet again\nHere we go again…\nLeicester v Nottingham Forest on Friday night.\nYates gives Forest the lead, Vardy equalises, so 1-1 at the break.\nThen the fun starts.\nTwo minutes into the second half and forest take the lead again.\nChris Wood scores, an Elliot Anderson assist.\nA certain section of Newcastle United fans take to social media, the meltdown starts.\nOn the hour mark Chris Wood makes it 3-1 to Forest and the meltdown now goes to another level amongst these people.\nSome Newcastle United fans going to ridiculous extremes with their comments.\nApparently, if only Eddie Howe hadn’t sold Chris Wood, Yankuba Minteh and Elliot Anderson, Newcastle United would have won the lot – Premier League, Champions League, World Cup…\nAmongst the more rational Newcastle United fans going up against this ludicrous behaviour, I saw this comment from EastStandFlags (@Michael Gallon) on Twitter/X:\n‘When we sell better players than Anderson and Minteh over the next five years please stop commenting on every good performance they have for their new teams……it’s football – players come and they must go.’\nWe all know why Eddie Howe and Newcastle United sold Yankuba Minteh and Elliot Anderson, NUFC ended up in a position where they had to bring in £50m+ in PSR terms by 30 June 2024, in order to stay withing the latest three year (PSR) limits.\nI want though to concentrate on the other ‘worst ever transfer decision in Newcastle United’s entire history’…\nWe have this bizarre situation where these very same people who said Eddie Howe buying Chris Wood for £25m in January 2022 was an embarrassing disgrace, now those exact same fans claiming that Eddie Howe selling Chris Wood in June 2023 for £15m was ALSO an embarrassing disgrace!\nAs rational Newcastle United fans you will no doubt know the following, or should do.\nSequence of events that led to Eddie Howe and Newcastle United signing Chris Wood on 12 January 2022:\nMike Ashley had ran Newcastle United into the ground over a period of a decade and a half.\nThe 2021/22 campaign was for sure going to end up as Ashley’s third relegation in 13 Premier League seasons that had kicked off under his ownership.\nWith the ‘help’ of Steve Bruce, Newcastle United without a single win and certainties for relegation, until 7 October 2021, Saudi Arabia PIF and the Reubens bought the club.\nSteve Bruce then belatedly sacked and Eddie Howe appointed on 8 November 2021.\nEddie Howe getting the squad properly fit and focused and performances clearly improving, however, still struggling to put a decent run of wins together. Matters not helped by Ashley and Bruce seeing Newcastle United having only one Premier League level striker and when Callum Wilson picked up a serious injury on 27 December 2021, signing a striker had become an absolute necessity in January 2022.\nNo club wants to lose their main striker in the middle of a season and so this was always going to be a massive ask for Eddie Howe and Newcastle United.\nThey ended up signing 30 year old Chris Wood for £25m and were ridiculed for it, by pretty much all outsiders, as well as large numbers of Newcastle United fans.\nEddie Howe and Newcastle United were actually only able to buy Chris Wood, due to him having a £25m release clause in his contract, Burnley were desperate to hang on to him.\nThe rest as they say, is history.\nEddie Howe overseeing an astonishing transformation, as his January signings and the players he inherited, came together to not only avoid relegation, but somehow produce the third best form of all Premier League clubs across the entire 19 games of the second half of that 2021/22 Premier League season.\nChris Wood made 17 PL appearances, starting 15 and off the bench in another two, scoring two goals.\nMany of those Newcastle United fans who had ridiculed the decision of Eddie Howe to sign Chris Wood, then used those two goals as ‘proof’ of what a poor signing he had supposedly been.\nOn the other hand, other Newcastle supporters understood that Eddie Howe had used Chris Wood as a key part of that survival but in a very unselfish role that saw Wood defend from the front, as well as help other NUFC players to score goals, with his movement and taking defenders away out wide etc.\nThese fans pointed to the key fact, that in his 15 PL starts that season, Chris Wood helped United pick up a remarkable 29 points.\nI think all parties understood that Chris Wood playing as number one striker was always going to be for a very limited time, unless potentially relegation had happened.\nAlexander Isak was signed for a club record £59m plus £4m potential future add-ons in August 2022, with Callum Wilson having returned to full fitness to be number two striker, Chris Wood finding himself third choice.\nNewcastle United finished fourth that 2022/23 season, Isak and Wilson scoring 28 goals between them in a combined 38 PL starts and 15 PL sub appearances.\nChris Wood only played 437 Premier League minutes in that 2022/23 season for Newcastle United, four PL starts, 14 PL sub appearance, scoring two goals.\nHalfway through that 2022/23 season, Chris Wood moved on the initial loan to the City Ground, fair to say Forest fans were less than excited about the signing of a now 31 year old striker and one Premier League goal in seven PL appearances (five starts and two as a sub) before injury brought his season to an end, did little to change that. When Chris Wood moved to Forest in January 2023, I don’t recall any Newcastle United fans saying this was a poor decision, quite the opposite.\nTwenty one goals since then, have for sure changed the opinion of many Forest fans, seven goals already this season, to go with the 14 from last season – which included of course the hat-trick at St James’ Park.\nGood luck to him, Chris Wood did a great job for Newcastle United, NUFC banked £15m of the initial £25m outlay, now he is showing again what a decent striker he is, with his goals and performances at Forest.\nChris Wood is proving what a great eye Eddie Howe has for signing players!\nHowever… now I see that a number of Newcastle United fans are using Chris Wood to beat Eddie Howe.\nApparently the decision to not keep Wood, is yet more clear ‘proof’ that Eddie Howe doesn’t know what he is doing and why he is supposedly holding Newcastle back.\nI would put my last penny on these Newcastle United fans who are slagging off Eddie Howe for having sold Chris Wood, are the exact same ones who slagged off Eddie Howe and NUFC when Wood was signed in January 2022, also the same ones who didn’t give Chris Wood any credit for what he did for Newcastle in that first half season playing for us, and certainly they weren’t saying it was a stupid move when Wood was let go in January 2023.\nThe fact that Chris Wood has continued to do well at Forest, is simply for me yet another reminder of what a great judge of players Eddie Howe is.\nYou can only really start with one centre-forward at a time and Eddie Howe signed an even better one in Alexander Isak.\nWhilst Chris Wood has scored 22 goals in 47 Premier League appearances for Forest, Alexander Isak has scored 32 goals in 58 PL appearances for Newcastle United. In case you were wondering, Callum Wilson since the start of the 2022/23 season, scoring 27 goals in 51 PL appearances.\nThe finances and PSR situation at Newcastle United simply didn’t allow Eddie Howe to keep all three, nor would Chris Wood have settled for third choice striker.\nIt is simply embarrassing for any Newcastle United fans to use Chris Wood to have a go at Eddie Howe.\nIt actually totally sums up how some NUFC fans change their opinions continually, based on the week by week situation.\nSome numpties even saying how much better it would have been if we had kept Chris Wood, rather than sign an ‘injury prone’ Alexander Isak. Totally ignoring the fact that Isak was named in 109 matchday La Liga squads out of a maximum possible 114, in his three full seasons at Real Sociedad before signing on at NUFC.\nChris Wood was a great signing by Eddie Howe for Newcastle United and he also moved him on at the right time as well.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1451,
  "scraped_at": "2026-02-14T01:57:46.240245",
  "_text_extracted": true
}