{
  "article_id": "208124a5c490",
  "url": "https://www.meathchronicle.ie/2025/04/24/newcastle-boss-eddie-howe-returns-to-work-after-recovering-from-pneumonia/",
  "title": "Newcastle boss Eddie Howe returns to work after recovering from pneumonia",
  "date": "20250424T160000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle boss Eddie Howe returns to work after recovering from pneumonia\nBy Damian Spellman, PA\nNewcastle boss Eddie Howe has returned to lead the club’s battle for Champions League qualification after recovering from pneumonia.\nThe Magpies announced on Thursday morning the 47-year-old, who was admitted to hospital on April 11th after feeling unwell for several days and has missed the Magpies’ last three Premier League games, was back behind his desk.\nA statement said: “Newcastle United are delighted to confirm that Eddie Howe has returned to his duties at the club’s training centre.\n“Eddie had recently been hospitalised with pneumonia and has now returned to work after a period of recovery.\n“We thank supporters for their warm wishes.”\nHowe, who was appointed as Newcastle’s head coach in November 2021 a matter of weeks after Amanda Staveley’s consortium had completed its takeover at St James’ Park, had stayed away from the training ground because of illness in the run-up to the home clash with Manchester United on March 13th.\nHe was unable to attend his pre-match press conference and assistant Jason Tindall, who stood in for him that day, has since taken charge of the team along with coach Graeme Jones.\nThe pair presided over back-to-back home victories against the Red Devils – after which Howe sent congratulations from his hospital bed – and Crystal Palace which lifted Newcastle up to third place in the table.\nHowever, Saturday evening’s 4-1 defeat at follow contenders Aston Villa, coupled with subsequent results elsewhere, left the club sitting in fifth, which would be good enough to secure Champions League football for next season, with five games remaining.\nTindall was happy to bear the brunt as his former Bournemouth team-mate, whom he has worked alongside for 17 years, eased his way back to health.\nHe said after the Palace game: “The last thing Eddie needs or wants is the stress of having to think about football and tactics and everything else that he would need to to try to manage from home because that won’t get him better in a quick enough period.”\nHowe’s return will provide a welcome boost ahead of Saturday’s must-win clash with Ipswich, who are all but mathematically certain to join Southampton and Leicester in slipping out of the top flight whatever happens on Tyneside this weekend.\nThe former Cherries boss became the first Newcastle manager to lead the team to major domestic silverware for 70 years last month when a 2-1 victory over Liverpool at Wembley secured the Carabao Cup.\nThat simply served to enhance the reputation of a man who guided the club out of relegation trouble in his first season and then renewed their acquaintance with European club football’s most prestigious competition 12 months later after an absence of two decades.",
  "word_count": 463,
  "scraped_at": "2026-02-14T01:55:09.083170",
  "_text_extracted": true
}