{
  "article_id": "20851fa97405",
  "url": "https://www.teamtalk.com/news/tottenham-motor-towards-harvey-elliott-transfer-frank-holds-direct-talks-liverpool-star-decides",
  "title": "Tottenham transfers : Frank motors towards Liverpool transfer raid after  direct talk , as star makes feelings clear",
  "date": "20250810T071500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham motor towards signing of ‘special Liverpool talent’ as Frank holds ‘direct talks’\nTottenham Hotspur have been given belief that a deal for Harvey Elliott is there to be done after positive talks with Thomas Frank, while a transfer journalist has revealed why Liverpool will ‘reluctantly’ allow the 22-year-old to move on.\nThe Liverpool star looks likely to follow a raft of other stars in departing Anfield this summer after failing to convince Arne Slot he was worthy of regular football last season. And while Elliott continued to make important contributions off the bench, his only two starts in the Premier League last season came after the Premier League title was already mathematically won.\nDespite a lack of minutes for the club he supported as a boy, Elliott‘s stock remains high after helping England Under-21s win the UEFA Under-21s Championships, and being crowned Player of the Tournament.\nAnd since returning from his summer break, the attacking midfielder has found himself linked with moves to Aston Villa, Newcastle, West Ham and, most recently, RB Leipzig.\nHowever, with Tottenham having lost James Maddison for a large portion of the season to a torn ACL injury, it is Tottenham who are pressing hardest for a deal.\nAnd after it was reported that Spurs are ‘making significant progress’ towards a deal after Frank held direct talks with his entourage, including the player’s Liverpool-supporting father, there is now a growing feeling that a move to north London is a strong possibility for the former Fulham youngster.\nWith Champions League football also on offer – something Leipzig cannot provide – there is now a strong sense of optimism that a firm offer for a player, branded a “special talent” by former Reds striker Neil Mellor, will be launched in the coming days.\nIN-DEPTH ➡️ Ranking all Premier League clubs by transfer net spend in 2025: Tottenham just behind Liverpool…\nSpurs backed to sign Harvey Elliott as Liverpool demands emerge\nIt is understood that Liverpool are seeking a £40m package to sell Elliott this summer, though any arrangement would need to contain a buy-back clause, triggered after two years.\nAlternatively, the Reds have told sides they would accept a £50m fee without any such clause attached. Spurs would, understandably, prefer the latter, though will try and drive Liverpool’s asking price down.\nSpeaking on the Inside Track podcast, journalist Pete O’Rouke thinks a deal is there to be done for Frank’s side.\n“Reluctantly, Liverpool would consider letting Elliott go for the right fee,” O’Rourke stated.\n“There’s been talk of £40million plus a buy-back clause, or a £50million fee without a buy-back clause.\n“RB Leipzig seem to be the ones leading the chase for Elliott right now, and they’ve opened talks with Liverpool to discuss a potential deal for the 22-year-old.\nElliott himself hinted at the end of last season that he will likely need to move on to further his career.\n“If I had it my way I would be here [at Liverpool] for the rest of my career, it’s as simple as that.\n“I love everything about the club, but at the same time, I kind of need to be selfish and see what’s best for me. I have big ambitions. I want to get in the World Cup squad,” he said in the wake of Liverpool’s title success.\n“I want to keep being successful as a player. It’s something I still need to review. I need to have a talk with everyone and review the situation. we have many new players who have come in so whether it blocks the path for me I’m not sure. It’s something I need to have a look at and decide.”\nTottenham back out of £35m striker deal; Liverpool told bluntly Isak deal is OFF\nOn the subject of Maddison replacements, Tottenham are reportedly also targeting a former Real Madrid playmaker to plug the gap – and one report even claims a €40m bid has already been lodged.\nMeanwhile, a prolific Premier League striker is determined to join Newcastle United, with talks ongoing over a move to St James’ Park – but only after Tottenham Hotspur decided not to pursue their interest, according to two reliable sources.\nOver at Anfield, the Reds have been rocked by new claims this weekend that Newcastle United’s Saudi owners have furiously warned Alexander Isak he will NOT be allowed to leave this summer, with the club taking an extremely dim view of his efforts to manipulate an exit to Anfield.\nElsewhere, Liverpool continue to “closely monitor” Bradley Barcola’s situation at PSG this summer, it has been confirmed by a trusted source, though their chances of a deal do not look high with the player’s verdict on a move to Anfield coming to light.",
  "word_count": 789,
  "scraped_at": "2026-02-14T02:02:51.937298",
  "_text_extracted": true
}