{
  "article_id": "2088a93034cc",
  "url": "https://www.teamtalk.com/arsenal/kenan-yildiz-arsenal-juventus",
  "title": "Arsenal transfers : Gunners target  ambitiou move for £76m Turkish Del Piero",
  "date": "20250501T194500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal target ‘ambitious’ move for £76m Turkish Del Piero and get instant response\nArsenal are interested in signing Kenan Yildiz, according to an Italian report, which has revealed the response that Juventus have given to the Gunners.\nWhile Arsenal still have hopes of getting past Paris Saint-Germain in the semi-finals of the Champions League this season despite the 1-0 home defeat in the first leg, the north London club are already planning for the summer transfer window.\nWith Liverpool having won the Premier League title with relative ease, Arsenal are aware that they need to strengthen their squad to stay competition next season, especially with Manchester City and Chelsea also set to get stronger.\nTEAMtalk understands that Arsenal are determined to sign a number nine this summer, with Newcastle United striker Alexander Isak manager Mikel Arteta’s dream target.\nSigning a wide player is also on the Gunners’ agenda, and the Italian media has revealed that Arsenal are keen on a summer deal for Yildiz.\nAccording to TuttoJuve, Arsenal are among the clubs that are interested in signing the Juventus winger, who has been labelled the ‘Turkish Del Piero’.\nChelsea are said to be ‘determined to move with a powerful offensive’ for Yildiz, who has played predominantly as a left winger for Juventus this season.\nThe report has noted that the 19-year-old Turkey international is ‘also on the ambitious shopping list of Manchester City, Arsenal, Liverpool and Manchester United’.\nTEAMtalk’s Italian football correspondent, Rudy Galetti, reported on March 19 that Man Utd had made initial contact for Yildiz.\nSources told TEAMtalk at the time that although Juventus consider Yildiz a key player in their team, the Serie A giants are willing to cash in on him and would consider offers of €90million (£76.4m, $1016m).\nTuttoJuve’s report, though, has stated that Juventus have ‘already communicated’ their position – Yildiz ‘cannot be sold’ in the summer transfer window.\nREAD MORE ➡️ Arsenal striker targets: EVERY option linked for the summer 2025 transfer window\nWhat Alessandro Del Piero said about Kenan Yildiz\nYildiz is of the most talented wingers in Europe and has a bright future ahead of him.\nThe 19-year-old has already been compared to Juventus and Italy legend Alessandro Del Piero, who himself has been hugely impressed with the Turkey international star.\nTMW quoted Del Piero as saying about Yildiz in October 2024: “He’s a guy with his head on his shoulders.\n“He always approaches the game in the best way, and in training, he’s someone who gives his all.\n“From what I’m told, he’s very humble and aware that at his age, he still has everything to prove, and he wants to do it through work.\n“These are the characteristics that then bear the best fruit, I wish him the best because he deserves it.”\nFormer Napoli and Atalanta manager Bortolo Mutti also rates Yildiz highly.\nMutti told TMW in December 2024: “They’ve compared him to Del Piero, and he’s similar in terms of characteristics, but I hope he’s just Yildiz.\n“He’s growing and already managing to be a protagonist in a really complicated championship at 19.\n“He can become a champion; he’s got the numbers, it must be said. He has great qualities.\n“Compared to Del Piero, his football is more physical, the plays are rarer, and you have less possession of the ball to invent something.”\nLatest Arsenal news: Celtic raid, Osimhen advice\nArsenal are interested in signing Celtic’s best player, according to a report.\nA Real Madrid star is set to leave this summer, amid interest from Arsenal, according to claims in Spain.\nMeanwhile, Victor Osimhen has been told not to join Arsenal.",
  "word_count": 610,
  "scraped_at": "2026-02-14T01:58:31.684009",
  "_text_extracted": true
}