{
  "article_id": "2098673b71a8",
  "url": "https://www.aol.co.uk/articles/tottenham-why-thomas-frank-preach-114633492.html",
  "title": "Tottenham : Why Thomas Frank is right to preach patience as fans make frustration known",
  "date": "20260102T121500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham: Why Thomas Frank is right to preach patience as fans make frustration known\nThomas Frank’s return to Brentford was always going to be an emotional occasion, and so it proved as tensions reached fever pitch in the away end at the Gtech Community Stadium.\nTottenham’s travelling support found their voice on a chilly and utterly uninspiring evening of football in west London, showering Frank and his players with boos at the end of a drab 0-0 draw in which Spurs managed just two shots on target.\nThis was a cold, hard reality check for Frank after the fleeting optimism of their victory over Crystal Palace last weekend.\nStill, while he acknowledged supporters’ frustrations, he was quick to underline the importance of his side’s clean sheet in his post-match press conference.\n“What we need to understand is the acknowledgement of the defensive side of the game, which we have done excellent today against a team that just scored three against Liverpool, three against Man Utd, so on and so on,” said Frank.\nThe Dane’s assessment of Spurs’ plight this season has often been at odds with what supporters want to hear. There is a significant disconnect between where Frank believes the club currently stands and where it aspires to be.\nThis means that while sections of supporters are unhappy with the pragmatic, reactive style of play Frank has introduced, he is not going to bend to the will of those calling for a more attacking philosophy.\nA solid defensive base has to be the foundation of a successful side, Frank asserts. It is only from there that you can begin to play with more fluidity and freedom.\n“I think if you as a team are not strong defensively, that is not the same as you can't play offensive football. It's just impossible to compete over a long season. Impossible.\n“It's not that we don't want to play offensive or attacking football. I just think when we're not, how can you say, on the top of the game we would like to be, we work very, very hard on that.\n“But by working hard on that, if you struggle scoring goals, let's say that, or create enough chances, you can't open up too much because then you need to score too many goals.”\nFrank is playing to his strengths, coaching a reliable, solid defensive unit. But he is also playing to his squad's strengths.\nThe majority of Spurs’ best players are defenders, so in the continued absence of attackers Dejan Kulusevski and Dominic Solanke through injury, it makes sense for Frank to lean on what he knows best.\nFlair was always going to be in short supply under Frank, so it can come as no surprise that this is the direction of travel as he tries to steady a team that lurched from Europa League glory to a 17th-place league finish last season.\nFrank is reigning in expectations. The harsh reality is that Spurs are not a Champions League club, and the belief they will become one in the space of half a season is misguided. There can be no quick fix for the underlying problems at the club.\nIn an increasingly competitive Premier League, Spurs’ squad is some way off those teams they seek to compete with.\nIt is not the supporters’ job to curb their ambitions - that is Frank’s responsibility and while it may not make him popular, his words of warning are what Spurs need if they want sustained success.",
  "word_count": 583,
  "scraped_at": "2026-02-14T02:03:26.500264",
  "_text_extracted": true
}