{
  "article_id": "209f3770530f",
  "url": "https://www.chroniclelive.co.uk/news/news-opinion/this-newcastle-united-victory-isnt-31307481",
  "title": "  This Newcastle United victory isnt just about football - it about hope , resilience and a city reborn  ",
  "date": "20250328T234500Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'This Newcastle United victory isn’t just about football - it’s about hope, resilience and a city reborn’\nNewcastle United fans share their congratulations after Magpies' Carabao Cup victory ahead of the Newcastle city centre bus parade\nAhead of the trophy parade through Newcastle city centre tomorrow, we have spoken to fans young and old as well as civic leaders, Chronicle colleagues and our former editors about what the victory means to the city, this newspaper and all of us.\nTomorrow's Chronicle front page is a specially designed message of thanks and praise to the club for a success that has changed the narrative and lifted all our hearts. In my 18 years at the Chronicle, so many of my biggest story memories centre around Newcastle United.\nThe night Keegan came home in 2008. After a mad shift breaking the news online in our very early days of live blogging, I hot footed it up to St James’ Park after work and was moved to tears by the roar of unity and emotion to celebrate his return.\nThe moment the takeover was confirmed in 2021. It was during social distancing restrictions and working from home times so I was overseeing our coverage from my kitchen table. When we sent the push notification to say the takeover was confirmed I heard my neighbour cheering through the wall and took such pride in breaking this story to Tyneside.\nAnd then the cup win. I’ve cried four times (so far): when Dan Burn scored, when I saw my 14-year-old son’s reaction to the win, and then reading our heroic 85-year-old NUFC columnist John Gibson’s words on the final whistle.\nThen, a little while later, watching our NUFC editor and social media editor in tears on their YouTube channel. Pride and passion across every generation in our brilliant city. Thank you so much to Eddie Howe and his team - inspirations for generations to come.\nThat's my message, but there are many more below. Enjoy the messages of hope, praise and delight below and please add your own in the comments - let's make this a day for our city to remember.\nNUFC superfan Betty Brown, 96, of Alnwick, Northumberland\n“The sight of Eddie Howe and the team winning was the ultimate utmost joy. To see grown men dashing to each other, not only hugging but planting a little kiss was ultimate joy.\n“I feel happiness. To call it joyful could be the greatest understatement there is. It’s all very exciting times still and there’s a warm fuzzy feeling after all this time that the victory came.”\nBishop of Newcastle, Helen-Ann Hartley\n“NUFC’s remarkable victory in the Carabao cup is a story that speaks to the heart of our NE region: grit, determination, talent, passion and resilience. The match had all the emotions right up to the final whistle and the sheer joy unleashed at the end was phenomenal.\n“Well done NUFC, the players and coaching and support staff, the supporters: the massive team behind the team. As Eddie Howe once said: ‘I want to play football that entertains and excites.’ To that I add the word inspires.\n“Thank you Eddie. Thank you to the team. Howay!”\nAdam Stoker, speaking on behalf of Wor Flags\n\"It’s probably a cliché but it really does mean everything. As the final whistle blew at Wembley I looked round and saw tears everywhere. People I’ve known most my life who rarely show emotion and have followed this club everywhere were bawling their eyes out. It just shows how special this moment was to our city and its people.\n\"Bruno’s words spoke to us all. We’ve had a generation who’ve grown up and died without knowing Newcastle United having success, and that’s why it means so much that this time, was finally the time.\n\"We’re all absolutely thrilled that the whole city will be able to celebrate this achievement together with a parade. It’ll be an incredible day for families and friends, so a huge thank you to those who have made this happen.\n\"We’ll of course be looking to pay our own tribute very soon.\"\nCoun Rob Higgins, Lord Mayor of Newcastle\n“As a passionate and lifelong football fan myself I was thrilled to be part of the wonderful Toon Army cheering the lads on to success at the Wembley final. The atmosphere was amazing and showed the true passion that we all feel for our region and our football club.\n“At the outset of my Mayoral year I said that the dream I have is that after such a long wait Newcastle would deliver a trophy during my year in office and I thank Eddie Howe and everyone associated with the club for making that dream come true. It will live with me forever.\n“This success has not only created a wonderful feel good factor in the city but will bring so many other benefits to everyone in our community and I am confident that it is just the beginning of even more success in the years to come. As first citizen of our great city I therefore look forward to giving our team the wonderful homecoming that they all so thoroughly deserve!”\nChi Onwurah, Newcastle Central and West MP\n“Through talent and determination this Newcastle United team have overturned decades of disappointment to light Wembley with Geordie Joy. I want them to know that the impact of their win will be felt in our homes and our hearts far into the future. NUFC is an important part of the Toon’s culture, economy, reputation and mood – their win means so much to all of us.”\nCatherine McKinnell MP, Newcastle North MP\n“The atmosphere in the Utilita Arena family fanzone as we watched the end of Newcastle’s long wait for a major trophy was just incredible.\n“It only got better outside St James’ Park as the Magpies gathered to celebrate. I watched the game and joined in the celebrations with my family, and shared the joy at seeing a Newcastle team finally lift a cup at Wembley.\n“The celebrations on Saturday will be so well deserved, and I know we’re all looking forward to welcoming the trophy to the city, along with Eddie Howe and his history making players.”\nChief Constable of Northumbria Police, Vanessa Jardine\n“I’d like to say a huge congratulations to Newcastle United and their fans. The club is such an important part of the fabric of our wonderful communities here in the North East and, as a keen football fan myself, I know what this means for the city of Newcastle.\n“So, for all those of a black-and-white persuasion, enjoy and cherish this moment.”\nKim McGuinness, North East Mayor\n“The fans in the city and the wider North East are all bursting with pride for this team and the success they’ve brought to the city. It’s been a long time coming but our hope and belief has been rewarded. I know this will be a memory Geordies will cherish for years to come.\n“This is a region known for our love of sport and football is at the heart of that. It’s so inspiring for young footballers here to have a club putting our region on the map.\n“I can’t wait to celebrate their victory this weekend and for the team to see what it means to us all.”\nCoun Henry Gallagher, Sheriff of Newcastle\n“I’m a long time season ticket holder in the Leazes corner. So I’ve seen relegations and promotions, and all the disappointments.\n“I was there at Wembley! After each goal I hugged complete strangers around me. Then at the final whistle I put my hands on my head and just thought, “What is this? This doesn’t happen to us!”\n“In his post-match interview, when Bruno spoke of those who had been born and died not seeing NUFC win a trophy, I knew then that he gets it. He gets us, the supporters.\n“The joy the win has brought to the area is incalculable. So thanks to Eddie, Jason and the lads, and all at the club for everything you have done. You have put us back on the football map.”\nCoun Karen Kilgour, Leader of Newcastle City Council\n“Saturday promises to be the type of day generations of Geordies have only ever been able to dream of becoming a reality.\n“I’m still pinching myself that I have lived to see the team I have supported my entire life lift a trophy at Wembley. Eddie Howe and his team have brought more joy to our city than they can ever imagine, and they have immortalised themselves in the history of our city.\n“Like all fans, I’ve been walking on clouds since that special day in London, and I can’t wait to relive it all again with tens of thousands of other supporters as the squad steps up to receive the adulation they deserve.\n“Congratulations again to the entire Newcastle United squad. You will forever be heroes to our city.\nAmanda Hopgood, Leader of Durham Council\n“Congratulations to all at NUFC on the amazing victory at Wembley in the Carabao Cup final. For every fan who has waited decades for this, thank you - the feeling when the final whistle went in the stadium was electric and I’m not ashamed to say I, like many others present that day, had a few tears.\n“The feeling and boost this has given the fans, the club, the city and the wider region is priceless.”\nDJ Schak\n“After years of heartbreak and longing, Newcastle United has finally lifted the Carabao Cup, and the city is alive with joy. The streets are filled with chants, tears, and pure elation as black and white scarves wave high in the air.\n“This victory isn’t just about football—it’s about hope, resilience, and a city reborn. For too long, Newcastle has carried the weight of disappointment, but now, that darkness has lifted. Smiles replace sorrow, and belief is stronger than ever. This triumph belongs to every Geordie, every fan who never stopped dreaming. Newcastle is back, and the future is bright!”\nAndrew Cushin\n“It’s one of those .. “I’m lost for words moments” neither me, or thousands of others for that matter, have ever experienced anything like this… it gave me feelings of how proud my dad would’ve been, family that have supported Newcastle for decades … I’m proud that they got to witness it. The memories of what Eddie Howe and that team have achieved in winning the carabao cup will echo through the ages as the first of many trophies to be brought back to Tyneside … long may the success continue, Howay the toon!”\nNeil Benson, editor of the Chronicle 1993-96\n“I joined the Chronicle in September 1993, when Kevin Keegan’s Entertainers were swashbuckling their way up the Premier League.Over the next few years, barely a day went by without a big story from St James’s Park - from stellar performances on the pitch to a catwalk fashion show starring new signings Ginola, Ferdinand, Hislop and Barton, and, biggest of all, the homecoming of Alan Shearer.\n“The only thing missing was a trophy. Those wonderful days left an indelible mark on me and my two sons, who saw their first Newcastle match 26 years ago and were instantly hooked.\n“Since then, we’ve had more than our share of near misses and disappointments. But when the final whistle blew on Sunday, March 16, my boys and I shed the sweetest of tears.\n“Thank you Eddie Howe, your coaching staff and your magnificent players. You’ve given every fan a joy we’ll never forget.”\nPaul Robertson, editor of the Chronicle 2002-11\n“Oh how I cried. Tears of unbridled joy at NUFC’s triumph but also for those whom I had hoped to share this moment no longer with us.\n“It was the first Wembley appearance I missed out on a ticket but, with just a tinge of regret, I was so proud watching on as the magnificent display of scarves and full-throated singing turned the national stadium into Geordieland, a level of support matched by the application of Eddie Howe, his staff and the players who outfought, out-thought and outplayed the best side in England.\n“Dan Burn’s header, Joelinton’s tackles, Trippier’s calmness, Isak’s firepower - you could name everyone for a colossal performance - I am sure I’m not alone in having watched the match highlights many times over.\n“Hope to belief, despair to joy. Thank you Newcastle United for restoring my faith.”\nSophie Barley, ChronicleLive editor\n“What a year to remember for our city. The boost this win has given can be seen everywhere you go in Newcastle. Flags are flying, glasses are being raised and celebrations are continuing.\n“All Geordies will remember where they were the day Newcastle won the cup. I watched the game with my partner and four-month old baby girl. Four months old and she’s already seen her team win a cup.\n“A fantastic day for NUFC fans and a win they all deserve. The Town Moor celebrations is a fantastic idea and will be an occasion fans will never forget. Well done and thank you NUFC - Howay the lads!”\nAlastair Machray MBE, former Chronicle journalist and Football Pink Editor. Editor of the Liverpool Daily Post and Echo, 1995-2020\n“I worked on ‘The Pink’ with Gibbo and Alan Oliver. The great days of newspapers. We pushed the deadlines for Gascoigne, Beardsley, Waddle.. and Keegan. We won nowt.\n“Newspapers took me to Liverpool. I brought up my son as a Newcastle fan in a world of jubilant Red and feisty Blue. We marvelled at Ginola, Ferdinand, Asprilla…and Shearer. We won nowt, still. And the Reds patted our heads and called us their ‘second team’.\n“It got dark. Reds appointed Klopp. They signed Salah. They won the Champions League. It sold a million papers and broke the internet. We appointed Steve Bruce and signed Jeff Hendrick. And won nowt, obviously.\n“Then new owners came, We made two key signings: Howe, and Hope.\n“I’m old now, and sometimes have a nap. I often dream about newspapers. And when I wake, I remember. We won the Cup. We beat Liverpool in the Final. And I ring my son.”\nJohn Gibson, Chronicle columnist\n\"Winning the Carabao Cup is a wonderful release of soaring pride because we Geordies are no longer the world’s greatest authorities on failure!\nI was there as a little lad standing on the road side just down from the Central Station to watch Newcastle parade the FA Cup in 1955, the players perched on top of the sunroof of a single decker, and was in the coach behind the main one carrying the players in 69 when we brought back the Fairs Cup from Budapest so there will be a tear in the eye when Eddie and the lads take to the streets.\nWe have waited an awful long time but it was done in such style against the best team in the Premier League. What a way to announce that Geordies are on the march again. We kept the faith.\nLee Ryder, chief Newcastle United writer\n“This is history, right here, right now - so soak up every single moment of it and be present. Having been with the team through relegations, political battles, bust-ups and media bans this was the complete opposite end of the spectrum.\n“As the final whistle at Wembley I ensured I took in the moment and it was absolutely magical. A dad picked up his little lad and hoisted him in the air and screamed ‘get in!’, an OAP with a flat cap waved his fists in delight and another fan put his hands to his face, sat down and wept with joy. It was the end of 70 years of hurt and we were living in it.\n“After the game I was lucky enough to shake Eddie Howe’s beer soaked hand as he came in for the Press conference fresh from the celebrations and then I was able to grab a word with Wembley hero Dan Burn.\n“I shook his hand and said ‘Thanks for the memories’ and he looked like a man who was just starting to appreciate the enormity of the achievement.\n“In 90 plus minutes, the players had gone from a popular bunch of grafters to club legends. Congratulations to everybody at Newcastle United.”\nAaron Stokes, Newcastle United Editor\n\"It still doesn’t feel totally real, does it? The dust may be starting to settle after the Wembley heroics but the memories of that day continue to dominate the thoughts of all those who support Newcastle United.\n\"It’s a pleasure to cover this football club and an honour to be able to report on days such as Sunday March 16th. Hopefully we don’t have to wait another 70 years for the next one - and hopefully I can cry a little less next time the lads lift a trophy…\n\"That famous Sunday in London was a special occasion to witness in the flesh and I’m sure the Saturday celebrations across the city and at the Town Moor will be just as memorable for those who support this amazing football club. Congratulations to everyone at Newcastle United - and also to every single person who has wasted years to be able to enjoy this feeling of being CHAMPIONS!\nRoss Gregory, Chronicle Live Head of Sport\n\"As a journalist, it’s been an absolute privilege to be part of the team that has covered such a historic occasion for the club and the city. The response to the Chronicle has been incredible.\n\"To witness this achievement by the club more than 40 years after my first game was one of the greatest feelings of my life. I think I speak for everyone who was there in saying it was an unforgettable experience, seeing, hearing, feeling those celebrations in Wembley in that hour after the final whistle.\n\"Huge congratulations go to Eddie Howe, his staff and the players. They might not realise it yet but they are living legends and deserve every accolade, drink bought and statue built that’s coming their way.\"",
  "word_count": 3020,
  "scraped_at": "2026-02-14T01:49:31.512578",
  "_text_extracted": true
}