{
  "article_id": "20bc6bdb03a4",
  "url": "https://apnews.com/article/asian-champions-league-0ff842a56b196adf00b0b54d0195d5b8",
  "title": "Yokohama advances to Asian Champions League round of 16 in Kevin Muscat last game as coach",
  "date": "20231213T183000Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Yokohama advances to Asian Champions League round of 16 in Kevin Muscat’s last game as coach\nYOKOHAMA, Japan (AP) — Yokohama F. Marinos of Japan reached the round of 16 in the Asian Champions League on Wednesday with a 3-0 victory over Shandong Taishan of China.\nYokohama advanced as the Group G winner ahead of second-place Shandong, which also advanced, and the eliminated Incheon United of South Korea. All three finished with 12 points.\nIt was the final game in charge for Yokohama coach Kevin Muscat, who is stepping down more than two years after succeeding current Tottenham manager Ange Postecoglou. Muscat led the team to the Japanese title in 2022.\nThe Brazilian trio of Elber, Anderson Lopes and Yan Matheus scored for Yokohama.\n“We prepare for our brand of football,” said Muscat, an Australian. “We prepare for winning games, so it’s not surprising that we needed two goals and we got three and could have had more.”\nThe 10 group winners and the six best second-placed teams advance to the knockout round. The tournament is divided into two geographic zones until the final. West Asia finished its group stage in November.\nOn Tuesday, Ventforet Kofu became the first team from Japan’s second tier to progress past the group stage.\nKawasaki Frontale gave Japan three teams in the knockout stage though defending Asian champion Urawa Reds was eliminated after collecting just seven points from six games.\nSouth Korea also has three teams in the second stage, which starts in February. They are Pohang Steelers, Jeonbuk Motors and Ulsan — with seven continental titles between them.\nBangkok United of Thailand completes the eight teams from the eastern zone.\nMelbourne City — Australia’s sole representative — was eliminated after conceding a late goal against Zhejiang of China on Tuesday.\n___\nAP soccer: https://apnews.com/hub/Soccer",
  "word_count": 301,
  "scraped_at": "2026-02-14T02:10:33.605316",
  "_text_extracted": true
}