{
  "article_id": "20c89bd84491",
  "url": "https://www.nytimes.com/athletic/6765979/2025/11/01/tottenham-chelsea-preview-prediction-manager/",
  "title": "Tottenham Hotspur vs Chelsea : Season aims , set pieces , views of manager , and prediction",
  "date": "20251101T153000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur host Chelsea on Saturday in the pick of the Premier League games from the weekend.\nThey are fierce rivals and will be hoping to compete at the top end of the Premier League as the season wears on. After nine games, Spurs are third while Chelsea are in ninth.\nBut how does each club view the season so far? What are the expectations? How do fans feel about the manager? What does each team have to fear about the other? And just how intense does the rivalry feel right now?\nAdvertisement\nHere, The Athletic’s experts Jay Harris and Simon Johnson answer a series of questions ahead of the game.\nHow has the season gone so far?\nJay Harris: It has been an encouraging start despite Wednesday night’s defeat to Newcastle United in the Carabao Cup. Spurs are third in the table and look far more compact than they did under former head coach Ange Postecoglou. They have a newfound resilience, demonstrated by scoring late equalisers against Bodo/Glimt, Brighton & Hove Albion, and Wolverhampton Wanderers. Thomas Frank has done a solid job so far, especially when you consider James Maddison, Dejan Kulusevski and first-choice striker Dominic Solanke are all injured.\nSimon Johnson: It can perhaps be best summed up by their best performance of the season against Liverpool, followed by the worst in their next home league game against Sunderland. Chelsea have been consistently inconsistent so far, with even performances during the 90 minutes fluctuating from one extreme to another. The latest example of this came just three days ago when they led 3-0 against Wolverhampton Wanderers at half-time and hung on to win 4-3. Chelsea’s poor disciplinary record — they have had six red cards in the past nine games — has been a major negative. But one of the things that makes going to a Chelsea game so interesting is you never know what is going to happen, for better or worse.\nWhat’s the mood like at the club?\nJay Harris: Frank and his coaching staff deserve a lot of credit for tightening up the defence, but the supporters are becoming frustrated with the side’s struggles to create chances from open play. Mohammed Kudus has made an immediate impact, but it is taking Xavi Simons longer to settle. The biggest issue is the pairing of Joao Palhinha and Rodrigo Bentancur in central midfield. Fans want to see Frank be more adventurous by dropping one of them and regularly starting Lucas Bergvall or Pape Matar Sarr instead.\nAdvertisement\nSimon Johnson: Neither too high nor too low. Chelsea have won five of their last six games in all competitions, which is not a bad run at all. The manner of their 2-1 home defeat to Sunderland was really disappointing, though. It was their last league game, so that has put them under even more pressure to get a good result at Spurs, especially as they have dropped to ninth in the table.\nHow do the fans feel about the manager?\nJay Harris: Postecoglou was a divisive figure towards the end of his reign, but a significant section of the fanbase wanted him to stay after their Europa League success. Fans quickly warmed to Frank because of his clever tactical approach in different games. Defeats to Bournemouth and Aston Villa upset the supporters, as they have only won three of their last 18 home games, but they recognise this squad is still a work in progress.\nSimon Johnson: It still feels like a potpourri of opinions. There is a contingent that sees recent results and worrying defensive displays as more evidence that Chelsea are not making much progress under the Italian. Others remain positive, with Maresca still in credit for how he finished last season, plus given some sympathy for the injury issues he has had to navigate.\nHow do you both feel about set pieces ahead of Saturday’s game?\nJay Harris: Fabian Schar scored from a corner in slightly bizarre circumstances for Newcastle, but otherwise, Spurs are excellent at defending set pieces. Frank’s side boast the best record in the Premier League as they have only conceded once. They have scored five times from set pieces, which is less than Chelsea (8) and Arsenal (9), but highlights the threat they pose. An interesting subplot to this game is that Bernardo Cueva, Chelsea’s set-piece coach, worked under Frank at Brentford for four years.\nSimon Johnson: It has to be a major concern for Chelsea. They struggle against long throw-ins as we have seen against Brentford, Sunderland and Wolverhampton Wanderers (in the Carabao Cup). Chelsea’s players are also guilty of switching off and being outmuscled in general. In saying that, Maresca’s side are second only to Arsenal in scoring from set pieces themselves, so they can certainly give as good as they can get.\nAdvertisement\nHow have Chelsea coped with Cole Palmer’s absence?\nSimon Johnson: Any team is going to miss a player as good as Palmer. Chelsea have particularly felt the England international’s absence when facing a back five. His magic can obviously help break such teams down. It is to their credit that Chelsea are joint top scorers in the Premier League (with Tottenham and Manchester City), especially when you consider they have also had injury problems up front to deal with.\nAnd have Spurs adapted to the injuries they’ve suffered, such as Maddison, Kulusevski and Solanke?\nJay Harris: Tottenham are over-reliant on set pieces to score, and that is due to the absence of this influential trio. Kulusevski was their best player last season until he suffered a foot injury in March. They sorely miss his ability to glide past defenders and carve open defences with clever passes.\nSolanke is a pressing machine who can drop deep to link the play or run in behind centre-backs. He is an all-round threat compared to Richarlison, who looks clunky on the ball. The Brazilian has three goals in 15 appearances this season — and he scored two of them on the opening day against Burnley.\nMaddison is capable of producing moments of magic to win games. He will probably miss the majority of the season due to an ACL injury, but there is hope Solanke and Kulusevski will return over the next few weeks.\nBoth clubs have impressive young players — who should we keep an eye on for Saturday?\nJay Harris: Bergvall is an excellent midfielder who grows in stature every week. The Sweden international will become undroppable if he scores and creates more goals. Simons has been around for a long time, but it is easy to forget he is only 22. He will be a huge problem for opposition defences once he adjusts to the physicality of English football. I also have a small confession. I was in the stands at Stamford Bridge for last week’s defeat to Sunderland with a couple of friends who are Chelsea season-ticket holders. It was an underwhelming performance, but Josh Acheampong caught my eye. The 19-year-old’s confidence to dribble out of defence is impressive for somebody who is so young and inexperienced.\nSimon Johnson: I am going to sound like a broken record this season, but the answer to this every week will be Estevao Willian. It is too early to say he is on Palmer’s level, but there are similarities in the way they look a cut above the rest. He has already scored in the Premier League, Champions League and Carabao Cup. Another one to look out for is Jamie Gittens. He got off to a slow start to his Chelsea career after joining from Borussia Dortmund last summer. He has begun to show his quality in recent weeks, though, and will be full of confidence following his three goal involvements (one goal, two assists) at Wolves in midweek. Chelsea generally have impressive young players, though — against Wolves, according to Opta, they became the first Premier League side with four scorers aged 21 or younger in a match in all competitions — Estevao (18), Gittens (21), Tyrique George (19) and Andrey Santos (21).\nWhat is your club aiming for this season?\nJay Harris: Frank wants Spurs to compete in multiple competitions, which is why Wednesday’s exit from the Carabao Cup will be so frustrating. The minimum they should be aiming for is to reach the last 16 of the Champions League and to finish in the top six in the Premier League.\nAdvertisement\nSimon Johnson: The objectives have not changed. Chelsea do not expect to win the Premier League, but the club want to challenge for longer and finish closer to top spot. They also intend to do well in the three cup competitions. As far as the latter goes, they have reached the quarter-finals of the Carabao Cup, where they have a very winnable tie against League One Cardiff City. By winning their last two games, Chelsea have also put themselves in contention for a top-eight finish in the Champions League group stage. Meanwhile, the FA Cup obviously does not start for Chelsea until the new year.\nHow big does the rivalry feel ahead of Saturday?\nJay Harris: Spurs’ recent record against Chelsea is abysmal. Postecoglou lost four times to them, including that infamous 4-1 defeat in November 2023. Spurs were 2-0 up at home after 11 minutes last season but somehow lost 4-3. One of the lowest moments of Postecoglou’s reign came at Stamford Bridge in April when he cupped his ears to the Tottenham supporters after Pape Matar Sarr scored, only for the goal to be disallowed. Lots of Spurs fans will tell you that only misery awaits them against Chelsea, so it will be huge for Frank if he beats them at the first attempt.\nSimon Johnson: No matter how bad Tottenham are or how many times Chelsea beat them, it never diminishes. It is the one fixture no Chelsea head coach can afford to lose because of how much it means to the fanbase. There is a greater need for Chelsea to get the three points this season, with Spurs sitting above them in the table and looking likely to be a contender for one of the Champions League qualifying positions.\nWhat should Spurs fear most about Chelsea?\nJay Harris: No matter how badly Chelsea are performing, they tend to find a way to beat Spurs.\nSimon Johnson: Perhaps that the goals can come from anywhere rather than relying on one individual. Chelsea already have 10 different scorers in the Premier League. So it is not as if Tottenham can relax if they keep one or two players quiet.\nAnd what should Chelsea fear about Spurs?\nSimon Johnson: The topic has already been covered above, but Tottenham’s threat from set pieces. Frank has also made Tottenham frugal at the back. That will ask questions of Chelsea’s ability again to unlock a well-organised back line.\nJay Harris: Wilson Isidor scored Sunderland’s opener last weekend from a throw-in. With Cristian Romero a doubt due to an adductor injury, Chelsea need to prepare for Kevin Danso to launch the ball into the box from a throw-in at every opportunity.\nAdvertisement\nWhat’s your prediction?\nJay Harris: Spurs have the joint-second-best defensive record in the league, and I struggle to see Chelsea breaking them down without Cole Palmer. I’m going to say 2-1 Spurs, with at least one of their goals coming from a set-piece.\nSimon Johnson: I can see this being a tight affair with honours ending even. One subplot to look out for is whether Chelsea can avoid a red card in a fixture as intense as this one. It has to be a worry after five players were sent off in the previous nine fixtures.",
  "word_count": 1950,
  "scraped_at": "2026-02-14T01:52:49.007753",
  "_text_extracted": true
}