{
  "article_id": "20e37427c6d1",
  "url": "https://tribune.com.pk/story/2505884/man-united-sack-ten-hag-after-woeful-start",
  "title": "Man United sack Ten Hag after woeful start",
  "date": "20241029T011500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United sack Ten Hag after woeful start\nEx-striker Nistelrooy will take over as manager on an interim basis\nManchester United have sacked manager Erik ten Hag in what the club said on Monday was a unanimous decision, with the team languishing 14th in the Premier League table after nine games and showing no sign they are on a path back to former glory.\nUnited assistant manager and ex-striker Ruud van Nistelrooy will take over on an interim basis at Old Trafford while they search for a new manager, the club said in a statement.\nVan Nistelrooy tops the list of favourites to permanently replace Ten Hag, which also includes former Barcelona boss Xavi, Sporting manager Ruben Amorim, Brentford's Thomas Frank, ex-Chelsea boss Graham Potter and Ipswich Town's Kieran McKenna.\nAppointed in April 2022, Ten Hag led United to two domestic trophies - the League Cup in 2023 and the FA Cup in 2024.\nBut the 54-year-old's job was the subject of speculation most of last season as United suffered a worst-ever eighth place Premier League finish and exited the Champions League at the group stage and the Dutchman was again in the hot seat.\n\"I don't think anyone will be truly shocked,\" former United defender turned pundit Gary Neville told Sky Sports, with United having had eight managers since Alex Ferguson retired.\nTheir terrible start to this season has come despite more than 600 million pounds ($779.28 million) being spent on new players since Ten Hag took charge ahead of the 2022-23 campaign.\nUnited have won four of their 14 games in all competitions so far this term and endured damaging 3-0 losses against Liverpool and Tottenham Hotspur at Old Trafford.\nThey have achieved 11 points from nine matches in the Premier League, which the club said was far off target to achieve their goal of a fourth-place finish. \"Erik ten Hag has left his role as Manchester United men's first-team manager,\" United said in a statement. \"Ruud van Nistelrooy will take charge of the team as interim head coach, supported by the current coaching team, whilst a permanent head coach is recruited.\"\nUnited next host Leicester City in the League Cup fourth round on Wednesday and Chelsea in the Premier League on Sunday.\nWith British billionaire and INEOS chairman Jim Ratcliffe taking over football operations last season, the club stuck with Ten Hag to have continuity at a time of change but United did not see any momentum to believe they were on the right path. The poor start to this season has also seen United draw their first three Europa League games from winning positions, most recently being held 1-1 at a Fenerbahce side managed by former United boss Jose Mourinho on Thursday.\nSunday's 2-1 Premier League loss at lowly West Ham United in which Ten Hag's side failed to capitalise on numerous chances only increased the media speculation that he would be sacked.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 511,
  "scraped_at": "2026-02-14T02:11:06.620875",
  "_text_extracted": true
}