{
  "article_id": "210c202c73e9",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/2023/4/29/23703979/liverpool-fc-jurgen-klopp-quote-manchester-united-7-0-epl-champions-league-goals-qualification",
  "title": "Jurgen Klopp : Hey , Remember That Time We Beat Manchester United 7 - 0 ? ",
  "date": "20230429T121500Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2022/23 campaign has really been one of feast and famine for the mighty boys in Red. Although Liverpool sit a modest 7th in the league table, the Reds beat Bournemouth 9-0 earlier in the year, and had two lopsided away wins, 6-1 over Leeds United, and 7-1 over Rangers, all either tying or breaking records in the process.\nJurgen Klopp: Hey, Remember That Time We Beat Manchester United 7-0?\nAfter three wins on the trot, it’s time to reflect back upon the things that really matter. Like tonking Man United.\nAnd then there was the 7-0 humiliation over Manchester United, which was also a record defeat for the rivals down the M62, and one which will live long in the memories of Liverpool supporters.\n“I always thought I would have time for these things after my career,” Klopp said in a pre-match press conference yesterday.\n“So this season, if we don’t do something really special, will be remembered for the 7-0 against United. I hope when people speak about it in a few years they will look back on it and [say], ‘that is the year we beat United 7-0’ and that they could say something nice on top of that. And after that we qualified still for whatever.\n“That will be nice, but if not then we have to take that as well.”\nAs of this writing, Liverpool only control their destiny as far as the Europa League spots are concerned. To qualify for the Champions League, Liverpool will likely have to win their remaining six matches and have a bit of help along the way.\nEnding the season with 9 consecutive wins and 11 unbeaten—or 29 out of the last 33 available—would be a huge accomplishment, especially considering Liverpool only had 12 wins out of 27 league matches prior to this current run.\nMost teams would be rightfully written off at this point in the campaign, but we have seen Jurgen Klopp’s Liverpool secure Champions League football on the last day of the season on 3 separate occasions. That includes the season when the Reds went on a similar run, winning 8 of the last 10, and needing an Alisson Becker headed goal at the death to keep Champions League hopes alive.\nHowever, if the Reds fail to qualify for the biggest club competition, we will always have the 7-0 over United to look back upon with fond memories. Indeed, the fact that we were so shit, and United were “back” (with one whole League Cup!) makes the victory all the sweeter.",
  "word_count": 425,
  "scraped_at": "2026-02-14T02:24:37.519367",
  "_text_extracted": true
}