{
  "article_id": "211dbd102be8",
  "url": "https://metro.co.uk/2025/09/28/newcastle-vs-arsenal-live-premier-league-latest-score-confirmed-lineups-24279790/",
  "title": "Newcastle vs Arsenal LIVE : Premier League latest score and goal updates",
  "date": "20250928T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal won 2-1 at Newcastle United on Sunday in a Premier League clash packed with plenty of drama and controversial moments.\nThe Gunners were denied a first-half penalty when Nick Pope appeared to hack down Viktor Gyokeres – which was initially given before VAR intervened and referee Jarred Gillett went to the monitor – with replays showing that Pope touched the ball before bringing the striker down.\nNick Woltemade handed Newcastle the lead in the 35th minute but Arsenal felt it shouldn’t have counted – as the German appeared to push Gabriel Magalhaes before he headed past David Raya – but VAR deemed it to be minimal contact.\nMikel Merino came off the bench and equalised with six minutes of normal time to go, with Newcastle then denied a penalty by VAR before Gabriel scored a 96th-minute winner from a corner as Arsenal moved up to second in the top-flight table to close the gap to Liverpool to two points.\nHere’s how it all unfolded..\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nMetro at the Match: Newcastle 1-2 Arsenal\nMetro at the Match returns to bring you all the analysis from the biggest games of the season.\nHere are our team’s key takeaways from Newcastle 1-2 Arsenal.\nArsenal’s squad depth wins game\n‘Subs, replacements, finishers – call them what you want – but one thing is clear: Arsenal’s squad depth will be a vital tool in their bid to win the title this year. Gabriel Martinelli last week and Mikel Merino this around, Arteta’s second-half changes continue to get his side goals when they need them most.’ Ben Fleming – Sports Reporter.\nThiaw looks a great addition\n‘In a transfer window awash with sagas, Malick Thiaw arriving at Newcastle from AC Milan went under the radar. The defender was fantastic here, dealing with Gyokeres impressively. Physically imposing and technically good on the ball.’ – Phil Haigh – Sports Reporter.\nArteta’s team selection back under microscope\n‘Mikel Arteta’s team selection is back under the microscope after the benching of William Saliba on Sunday, particularly given the struggles of his replacement Cristhian Mosquera, who was hauled off at the break. Arteta said Saliba’s fitness still has to be managed – so why was he given the full 90 minutes against Port Vale in midweek?’ – Ben Fleming – Sports Reporter.\nWoltemade a new hero but Magpies still blunt\n‘Newcastle have struggled for goals so far this season and they weren’t exactly free-flowing in attack on Sunday. Nick Woltemade has made a decent start and the giant German is a threat in the air, but Magpies fans will be relishing the return to fitness of Yoane Wissa to spark some attacking verve.’ – Phil Haigh – Sports Reporter.\nWas it a penalty?\n‘Viktor Gyokeres was felled by Nick Pope and a penalty given but the Newcastle goalkeeper was saved by VAR as he got a slight touch on the ball. The decision remained debateable. Clear and obvious error? Surely not.’ – Phil Haigh – Sports Reporter.\nEze shines for Arsenal\n‘Finally deployed in a central attacking position, Eberechi Eze was a bright spot for the Gunners. Martin Odegaard has made that position his own in recent years, but Arteta may soon be forced to consider if his captain is the best man for the job in the coveted No10 role.’ – Ben Fleming – Sports Reporter.\nThat’s all from us!\nThanks for joining our live blog today! Stay with Metro for all the best reaction to this game and more.\nOh – and make sure you pick up a copy of our newspaper tomorrow morning.\nSee you soon!\nFULL TIME: Newcastle 1-2 Arsenal\nThat was pure Barclays, as some might say.\nWhat a game of football… Arsenal turn it around with two late goals to take all three points at St James’ Park. They’re up to second and have closed the gap to Liverpool to two points!\nGabriel scores 96th-minute winner!\n90+6: OH. MY. WORD. ARSENAL HAVE DONE IT!!!!!\nGabriel Magalhaes scores a header from a corner and the Gunners have turned it around from 1-0 down. This is a massive result!!!\nBarnes on for Newcastle\n90+4: Barnes comes on for Newcastle, replacing Joelinton.\nEight minutes added on!\n90+3: There’s eight minutes added on, by the way. Are we set for even more drama?\nTrossard comes off\n89: Lewis-Skelly comes on for Trossard. Is Arteta playing for a point?\nTwo more yellows\n89: Just before the Arsenal goal, Joelinton was booked and Burn has also now just been shown a yellow card. Really feisty out there…\nNewcastle denied a penalty!\n87: More drama here – blimey – this has been a controversial game!\nThe ball clearly hits Gabriel on the arm inside the Newcastle box but he gets away with it following a VAR check after it appeared to hit his shin first.\nMerino equalises for Arsenal!\n84: GOAL! Another Arsenal substitute saves the day. It’s Mikel Merino!\nArsenal take a short corner and Merino gets on the end of Rice’s cross, flicking a brilliant header into the bottom corner.\nPope had no chance with that one. 1-1 at St James’ Park!\nChance for Gyokeres!\n82: Gyokeres slips and wastes another Arsenal chance. He’s been poor, again.\nChange for Arsenal – Odegaard has come on for Zubimendi.\nLivramento stretchered off\n76: Livramento is stretchered off with what looks to be a knee injury. He’s replaced by Lascelles.\nChance for Gyokeres!\n71: Gyokeres shoots from a tight angle but it takes a deflection and drops wide of the post. Newcastle still leading 1-0 here.\nArsenal make double change\n70: Saka and Calafiori head to the bench. The Arsenal duo are replaced by Martinelli and Merino.\nNewcastle make triple change\n67: Eddie Howe is taking off Murphy, Gordon and goalscorer Woltemade.\nThey’re replaced by Elanga, Trippier and Osula. Looks like Newcastle are going with a back five.\nChance for Murphy!\n64: What a run from Newcastle’s Murphy but it’s great defending from Rice to block his shot.\nNewcastle defending well\n63: Wonder how long it’ll be before Arteta makes an attacking change because Newcastle are defending so well here.\nTrossard dives!\n60: Trossard dives inside the box, trying to win a penalty. No chance.\nChance for Timber!\n59: Pope is having the game of his life. Another top save denies Timber’s header inside the box.\nChance for Joelinton!\n58: Newcastle almost take a 2-0 lead… Gordon picks out Joelinton but his shot goes just wide of the far post.\nMORE: Former referee blasts VAR decision as Arsenal denied penalty at Newcastle\nMORE: ‘Embarrassing!’ – Les Ferdinand blasts Arsenal star after win over Newcastle\nMORE: Unai Emery sends message to Harvey Elliott after hauling him off at half-time",
  "word_count": 1136,
  "scraped_at": "2026-02-14T02:26:56.620239",
  "_text_extracted": true
}