{
  "article_id": "213024d94e1a",
  "url": "https://www.fourfourtwo.com/news/manchester-united-beat-record-previously-set-by-real-madrid-as-staggering-stats-are-revealed",
  "title": "Manchester United beat record previously set by Real Madrid - as staggering stats are revealed",
  "date": "20240215T214500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United beat record previously set by Real Madrid - as staggering stats are revealed\nManchester United have taken the crown for one record - but it might not be one they're too keen on having\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester United have beaten a European record that Real Madrid previously held, though it highlights the mismanagement at the club in recent times.\nWith Sir Jim Ratcliffe's 25 per cent shareholding now accepted by the Premier League and FA, his first task of business seems in addressing the lack of success on the pitch despite the over-inflated transfer fees paid on incoming players.\nIndeed, the cost of their squad exceeded £1bn in 2023, as highlighted in a new UEFA report.\nA UEFA-commissioned European Club Finance and Investment report revealed that, last year, the Manchester United squad was \"the most expensive ever assembled\" in football. In total, the report highlighted Manchester United had spent £1.21bn in combined transfer fees on their squad at the end of the 2023 financial year.\nThat figure beats the previous record of £1.13bn, set by Real Madrid in 2020. That squad, though, had just won the La Liga title and were in the middle of winning five Champions League trophies in less than a decade.\nDespite such significant spending, meanwhile, Manchester United were only able to win the Carabao Cup under Erik ten Hag. They were knocked out of the Europa League in the quarter-finals, while Manchester City beat them in the FA Cup final.\nAnd though they managed to finish third in the Premier League, it means the 75 points they amassed came at a cost of £16.13m per point, a staggering figure when considering that they spent £82m on Antony, £80m on Harry Maguire, £73m on Jadon Sancho and £70m on Casemiro.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThat total doesn't include any of the signings that joined the club in the summer of 2023, though the Chelsea squad was only calculated up until June 2022. While the report says that the Blues squad also cost more than £1bn, none of the £850m transfer fees spent from the summer of 2022 until August 2023 counted in the final figures.\nManchester City and Real Madrid also featured in the £1bn-plus squad cost, with the report highlighting their spending, too.\nMore Manchester United stories\nWho is Dan Ashworth? Newcastle director tipped to join Manchester United amid INEOS reshuffle\n'I rejected Manchester United': Portugal superstar reveals he turned down Red Devils move – because it wasn’t ‘the right time’\nManchester United co-owner Sir Jim Ratcliffe wants exciting young star as his first signing: report\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 621,
  "scraped_at": "2026-02-14T01:56:44.630075",
  "_text_extracted": true
}