{
  "article_id": "215145a7099f",
  "url": "https://www.uefa.com/returntoplay/news/0280-17d41ec484ee-05fcab4e5d9d-1000--club-final-ticket-sales-launched/",
  "title": "Ticket sales for 2023 UEFA club competition finals launched | Inside UEFA",
  "date": "20230421T231500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ticket sales for 2023 UEFA club competition finals launched\nFriday, April 21, 2023\nArticle summary\nTickets for the finals exclusively on sale on UEFA.com with Prague from €25, Budapest from €40 and Istanbul from €70\nArticle top media content\nArticle body\nTicket sales for all three upcoming men’s UEFA club competition finals have started exclusively via UEFA.com/tickets and will run until 28 April at 14:00 CEST.\nAs usual, fans of the participating teams and the general public are being allocated the majority of the tickets. Tickets will not be sold on a first come, first served basis but through a lottery that will be conducted after the application period has ended.\nIn the ticket portal, applicants can choose whether they want to enter the lottery in any case or only if their team qualifies. For the lottery, the ticket quota will be allocated fairly between these two groups of applicants, taking account of the number of applications received within each group.\nTickets will be delivered by means of the official UEFA mobile tickets app a few days before the match. Ticket holders will need to download the official app, which is available for Android and iPhone users. The app allows fans to securely download, transfer, keep and assign guest tickets anytime and anywhere. The FAQ section of the app includes videos on how to use mobile tickets.\n2023 UEFA Europa League final\nThe 2023 UEFA Europa League final will be played at Budapest's Puskás Aréna in Hungary on Wednesday 31 May, kicking off at 21:00 CEST.\nA total of 46,800 tickets out of 63,000 are available directly for fans and the general public to purchase. The two teams that reach the final will receive 15,000 each, while the remaining tickets are being offered for sale to fans worldwide via UEFA.com/tickets. Each successful applicant will be able to purchase up to four tickets in the allocated price category.\nThe sale and allocation process for tickets reserved for the fans of the finalist teams is being arranged with the clubs involved. The remaining tickets are for the local organising structure, UEFA, UEFA’s member national associations, commercial partners and broadcasters.\nTicket prices for the general public are: Category 4: €40; Category 3: €65; Category 2: €100; Category 1: €150\nAccessibility tickets for disabled spectators cost €40 (all tickets are priced at the Category 4 rate and come with one complimentary companion ticket).\n***\n2023 UEFA Europa Conference League final\nThe 2023 UEFA Europa Conference League final will be played at the Eden Arena in Prague, Czechia, on Wednesday 7 June, kicking off at 21:00 CEST.\nA total of 13,000 tickets out of 18,000 are available directly for fans and the general public to purchase. The two teams that reach the final will receive 5,000 each, while the remaining tickets are being offered for sale to fans worldwide via UEFA.com/tickets. Each successful applicant will be able to purchase up to four tickets in the allocated price category.\nThe sale and allocation process for tickets reserved for the fans of the finalist teams is being arranged with the clubs involved. The remaining tickets are for the local organising structure, UEFA, UEFA’s member associations, commercial partners and broadcasters.\nTicket prices for the general public are: Category 4: €25; Category 3: €45; Category 2: €85; Category 1: €125\nAccessibility tickets for disabled spectators cost €25 (all tickets are priced at the Category 4 rate and come with one complimentary companion ticket).\n***\n2023 UEFA Champions League final\nThe 2023 UEFA Champions League final will be played at the Atatürk Olympic Stadium in Istanbul, Türkiye, on Saturday 10 June at 21:00 CEST (22:00 local time).\nA total of 47,200 tickets out of 72,000 are available directly for fans and the general public to purchase. The two teams that reach the final will receive 20,000 each, while the remaining tickets are being offered for sale to fans worldwide via UEFA.com/tickets. Successful applicants will be notified by email and will be able to purchase up to two tickets in the allocated price category.\nThe sale and allocation process for the tickets reserved for the fans of the finalist teams will be arranged with the clubs involved. The remaining tickets are for the local organising structure, UEFA, UEFA’s member associations, commercial partners and broadcasters.\nTicket prices for the general public are: Category 4: €70; Category 3: €180; Category 2: €490; Category 1: €690\nAccessibility tickets for disabled spectators cost €70 (all tickets are priced at the Category 4 rate and come with one complimentary companion ticket).\n***\n2023 UEFA Women’s Champions League final\nTicketing details for the 2023 UEFA Women’s Champions League final on 3 June in Eindhoven in the Netherlands were announced on 13 February and fans were able to purchase tickets via the Royal Dutch Football Federation (KNVB) website. Any remaining tickets will go on sale on 15 May at 12:00 CEST.\nTicketing terms and conditions\nAll ticket holders are bound by the ticketing terms and conditions and UEFA will take action in case of any breaches. Online applications will be verified with the competent authorities to ensure that anyone banned from attending football matches cannot purchase tickets. Sales of tickets for the 2023 UEFA Champions League final, 2023 UEFA Europa League final and 2023 UEFA Europa Conference League final will be conducted exclusively on UEFA.com. UEFA urges all football fans to refrain from purchasing tickets or hospitality packages from unauthorised sellers, agents or websites, as such tickets may be counterfeit or invalid and an unaware purchaser may be refused admission to the stadium.",
  "word_count": 925,
  "scraped_at": "2026-02-14T01:55:54.943702",
  "_text_extracted": true
}