{
  "article_id": "216495930993",
  "url": "https://kawowo.com/2024/07/02/cecafa-kagame-cup-2024-draw-date-teams-and-format-revealed/",
  "title": "Regional giants Simba , Yanga , Merriekh opt out of Kagame Cup 2024",
  "date": "20240702T220000Z",
  "domain": "kawowo.com",
  "source_country": "Uganda",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Council of East and Central Africa Football Associations (CECAFA) has confirmed that twelve teams instead of earlier confirmed 16 will compete in the forthcoming Kagame Cup.\nRegional traditional giants Simba, Yanga and Azam are not part of the 12 teams for the tournament set to run in July 9-21 in Dar es Salaam at the Azam Complex in Chamazi and KMC Stadium in Kinondoni.\nSudan’s Al Merriekh and as well as Burundi’s Vital’O miss out and won’t be part of the draw to be held on Wednesday July 3rd in Dar es Salaam.\n“Although we had initially planned to have 16 teams, we have been forced to reduce on the numbers and also change the dates because of some challenges. But we believe this tournament will give our teams in the Zone a good platform to prepare well ahead of the 2024/2025 CAF Champions League and CAF Confederation Cup,” says the CECAFA Executive Director John Auka Gecheo.\nZambian side Red Arrows will be the only guest side that will play in the tournament.\nFormat\nThe twelve teams will be placed in three different groups with four teams each. The top teams from each group and the best runner-up will automatically qualify for the semi-final stage.\nSC Villa will represent Uganda but there is no holders Express FC who last won the trophy, the last time the tournament will be played.\nConfirmed teams\nCoastal Union FC, Singida Black Stars FC (Tanzania)\nAl Hilal, Al Wadi FC (Sudan)\nGor Mahia FC (Kenya)\nSC Villa (Uganda)\nDjibouti Telkom FC (Djibouti)\nDekedaha FC (Somalia)\nAPR FC (Rwanda)\nJKU SC (Zanzibar)\nEl Merriekh Bentiu (South Sudan)\nRed Arrows FC (Zambia)",
  "word_count": 276,
  "scraped_at": "2026-02-14T02:10:54.414087",
  "_text_extracted": true
}