{
  "article_id": "2175385475fc",
  "url": "https://thethaiger.com/thai-life/entertainment/blackpink-ends-individual-contracts-with-yg-entertainment",
  "title": "BLACKPINK ends individual contracts with YG Entertainment",
  "date": "20231229T093000Z",
  "domain": "thethaiger.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "BLACKPINK ends individual contracts with YG Entertainment\nYG Entertainment has announced that the four members of BLACKPINK will not be renewing their individual contracts and will pursue their own independent activities, marking the end of negotiation discussions about their contracts. The South Korean news agency reported today (December 29).\nYG Entertainment officially stated, “Hello, this is YG Entertainment. Recently, we renewed our contract for the group activities of BLACKPINK members. And we have decided not to proceed with additional contracts for individual activities.”\nThey also added, “We will do our best to support the group activities of BLACKPINK, and we will support individual activities of the members with a warm heart. Thank you.” Before this, BLACKPINK had signed a special contract for group activities on December 6. Since then, Jennie announced to her fans on December 24 that she will establish Ode Atelier (OA) for her individual activities.\nIn related news, back in early October, Lisa received a prestigious cultural ambassador leader award from Thailand’s Culture Ministry. The celebrated singer from Buriram has been recognised for her significant contributions to promoting Thai culture on an international stage.\nNot only that, BLACKPINK is the second girl group to officially visit Buckingham Palace after the Spice Girls in 1997. During the dinner, King Charles commended the group for their global influence in promoting environmental sustainability.\nAlso, BLACKPINK’s Lisa creates a buzz appearing at a UEFA Champions League match in Paris, joined by Frederic Arnault, reigniting relationship rumors. Lisa, staying in Europe after royal honours and a cultural award, continues to captivate fans with her global ventures. The sighting at the football match fuels speculation about her personal life, contrasting earlier breakup rumours. Netizens eagerly track Lisa’s European journey, adding excitement to her post-royal engagement activities.\nLatest Thailand News\nFollow The Thaiger on Google News:",
  "word_count": 302,
  "scraped_at": "2026-02-14T02:10:33.589347",
  "_text_extracted": true
}