{
  "article_id": "218e55c71b92",
  "url": "https://easternmirrornagaland.com/we-have-to-be-more-hungry-dortmund-head-coach-edin-terzic-ahead-of-ucl-final/",
  "title": "  We Have To Be More Hungry : Dortmund Head Coach Edin Terzic Ahead Of UCL Final",
  "date": "20240601T113000Z",
  "domain": "easternmirrornagaland.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Home\n- ‘We have to be more hungry’: Dortmund head coach Edin Terzic ahead of UCL final\nShare\nNEW DELHI — Borussia Dortmund will face the ultimate test at Wembley Stadium when they go head to head with the most successful team in European club football history. Ahead of the UCL final, Dortmund head coach Edin Terzic acknowledged the pedigree of their opponents and stated his side is “not here to see Madrid win their next trophy.”\n“We know they are by far the most successful team in this competition. We have had only two defeats this season, but we also see we are ready to compete on the highest level. If you break it down to one game, then everything is possible. They have a role as the favourites, but we weren’t favourites against Atlético or Paris either,\" said Dortmund coach Edin Terzic to TNT Sports ahead of his club's third UEFA Champions League final.\nDortmund's road to the #UCLfinal pic.twitter.com/LvWJte036n\n— UEFA Champions League (@ChampionsLeague) May 31, 2024\nIf we are brave and not here to see Madrid win their next trophy, then we’re going to have a chance,\" he added.\nBorussia Dortmund are on a fairy tale run in this Champions League campaign which began with them being placed in the group of death which included Paris Saint Germain, AC Milan and Newcastle United. The men in yellow finished at the top of the group and went on to beat PSV (3-1 agg), stage a comeback against Atletico Madrid (5-4 agg) and Paris Saint Germain (2-0 agg) to book their spot in the finals.\n\"Hopefully, we're going to have the best performance of the season. This is needed, If you want to win the Champions League, you have to beat the champions and we are playing against the final boss. We know it is going to be a very special game for us and our fans. It is about playing the game, and not the occasion.\nWe are the team with the most clean sheets in the competition and this is one of the key reasons why we are here. It is going to be crucial that we do it tomorrow one more time. Then we have chances to beat Real Madrid.I don't mind who are the favorites tomorrow. If they are more experienced, we have to be more hungry. Let's get it on,\" he added.\nOn what could mount to be a record-extending night for Real Madrid on their hunt for their 15th UEFA Champions League final, the narrative of the night revolves around two German legends Marco Reus and Toni Kroos who will be representing their respective clubs for the last time.",
  "word_count": 448,
  "scraped_at": "2026-02-14T02:10:54.440702",
  "_text_extracted": true
}