{
  "article_id": "219f2762dac7",
  "url": "https://theathletic.com/4994583/2023/10/26/when-does-a-striker-peak/",
  "title": "Just when does a striker peak ? Any time between 19 and 35",
  "date": "20231026T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In an age of increasingly advanced statistical analysis in football, one of the questions data analysts have been tasked with in recent years is working out precisely when a footballer peaks. Traditionally, there’s been a belief that it’s just before 30 for outfielders and slightly later for goalkeepers.\nAdvertisement\nBut there are tales of huge outliers: some footballers are fully formed in their teenage years and then decline rapidly. Others are steady performers until they hit 30 and then explode into world-class performers.\nHere, then, is an attempt to demonstrate that footballers can peak at any time. Below is a list of 17 different footballers who peaked at 17 different ages. We could use advanced metrics (or simply opinions) here but, for the sake of simplicity, this simply uses the oldest metric in the game: goals.\nTo keep things broadly comparable, all 17 players are strikers who reached their goalscoring peak in the last 30 years in the Premier League, La Liga, Serie A or the Bundesliga, although goals from other leagues are also shown on the graph below.\nThere are, of course, many other strikers who could have been selected and a preference has been given to players who enjoyed a fairly dramatic or obvious peak. All the players are either retired or over the age of 35 and their ages have been taken at the start of each campaign.\nGO DEEPER\nThe key contract situations at every Premier League club\n19: Ronaldo (Barcelona, 1996-97)\nArguably only Pele has been a more fully-formed footballer at such a young age. At 17, Ronaldo won the World Cup with Brazil, albeit without getting onto the pitch, and was 17 at the start of his 30-goal season for PSV in 1994-95.\nTwo years later came Ronaldo’s most famous season, scoring 34 goals in 37 games in his only season at Barcelona. His time at Barca was more complex than is often portrayed – he was regularly late back from international duty, didn’t always attend events with the rest of the squad, complained about Bobby Robson’s “outdated” tactics and was jeered by supporters towards the end of the season, who felt he didn’t care about the club. It wasn’t an entirely happy campaign.\nGO DEEPER\nBobby '90: Ronaldo, Pep & relying on Mourinho — analysing Bobby's Barcelona\nAt this age, Ronaldo was a pure individualist — his memorable goal against Compostela, when he ran past almost the entire defence, is the best example. His speed, combined with his technical ability in tight spaces and his calm finishing, often rounding the goalkeeper, made him almost unstoppable.\nAdvertisement\nThe reason his peak came so early, of course, was largely due to injuries, although spending a few seasons playing against better defenders in Serie A also limited his goalscoring return. He was still a ruthless penalty-box striker at Real Madrid but, by then, he’d lost the speed which made him the best in the world.\n20: Robbie Fowler (Liverpool, 1995-96)\nIt’s arguable that no other footballer of the modern age has played on for so many years after his peak. Fowler was still scoring goals in 2012 in Thailand, 15 years after his best goalscoring campaign for Liverpool.\n“When I look back, I can’t quite believe what happened to me,” he later remembered. “It’s frightening sometimes to think about what I achieved in those early years. I didn’t realise I was that good.” He was voted Young Player of the Year by the PFA twice in a row and became the first player in English history to score 30 or more goals in all competitions in his first three full seasons.\nFowler’s decline, a little like Ronaldo’s, was largely about injuries. He fractured his ankle early in his career, which caused major problems later on, and also had issues with his Achilles tendon, his knee ligaments and later, most troublingly, his hip. By his own admission, Fowler tended to take a while to get up to full speed upon his return and while criticised for gaining weight later in his career, he says it was the opposite: he often returned from injuries underweight and was too easily shoved off the ball.\nThere were also tactical issues. Michael Owen emerged and managers — particularly Gerard Houllier, but also Sven-Goran Eriksson — felt Owen needed to play off a target man like Emile Heskey rather than another finisher. Fowler’s personal relationship with Houllier was difficult, which led to his departure from Anfield in 2001. He started well at Leeds, who were about to go through a financial crisis, and eventually came good at Manchester City after a poor start, before a surprise return to Liverpool under Rafael Benitez.\nAdvertisement\nBy that point, Fowler’s peak was over a decade beforehand but, amid so many injury problems, he deserves great credit for his longevity.\n21: Andrew Cole (Newcastle, 1993-94)\nThe most impressive thing about Cole’s 34-goal season in 1993-94 is that it was his first top-flight campaign. He’d joined Newcastle six months beforehand, scored 12 goals in 12 games to help secure their promotion, then promptly carried that form into the Premier League. He finished alone as the Premier League’s top scorer and top assister in 1993-94, a feat that would not be repeated until Harry Kane did it in 2020-21.\nCole was a true all-rounder, offering speed in behind, finishes with both feet and an ability to make the right runs to score with his head, too. But Cole was also a difficult character, something of an outcast who struggled to connect with team-mates and often infuriated his manager. After one particularly big argument, Newcastle boss Kevin Keegan decided to sell him to Manchester United, in part because he wanted more of an all-rounder up front.\nAt Old Trafford, Cole was certainly a success in terms of honours and 93 goals in 195 Premier League games certainly isn’t to be sniffed at. But unlike at Newcastle, he didn’t quite have the side built around him and Sir Alex Ferguson later loaded up on strikers, which meant Cole and his best strike partner, Dwight Yorke, were rotated with Ole Gunnar Solskjaer and Teddy Sheringham. A little surprisingly, he never scored 20 league goals in a season for Manchester United,\nAnd, like others, injuries caught up with him. It’s notable that, according to Martin Hardy’s book Touching Distance, about Keegan’s reign at Newcastle, Cole’s determination to play on through injuries was what first attracted Keegan when seeing him play for Bristol City. “He’s got a hamstring injury and he’s carried on,” Keegan remembers saying. “They’re the kind of players I want at Newcastle United. Sign him.”\n22: Pippo Inzaghi (Atalanta, 1996-97)\nYou think of Inzaghi and you think of him as a veteran in a Milan shirt, or perhaps in his supposed peak in a Juventus shirt. But Inzaghi’s best goalscoring campaign came in his sole season at Atalanta, all the way back in 1996-97, before he’d made his international debut.\nThat, a little surprisingly, was the only time he reached the 20-goal mark in a single campaign. At Juventus, he started well in 1997-98, but over the next 18 months, he suffered from Zinedine Zidane being woefully out of form and Alessandro Del Piero suffering badly from injuries and a lack of confidence. It didn’t help, too, that Del Piero and Inzaghi disliked one another.\nAdvertisement\nHis move to Milan brought an improvement, although Inzaghi was rarely the main man, with the attack largely based around the wonderful Andriy Shevchenko. Again, injuries caused problems, and later in his career Inzaghi retained his classic poaching instincts but wasn’t anywhere near as quick as during his early years. In that sense, he was similar to Cole.\n23: Fernando Torres (Liverpool, 2007-08)\nBy now, the picture of strikers who peaked early is becoming clear — they’re almost exclusively players who emerge in their teenage years, are based around speed, and then encounter physical problems that mean they struggle to replicate their earlier form.\nTorres’ drop-off was particularly staggering. At 17, he was playing for Atletico’s first team; at 19, he was their captain; and at 23, he scored 24 goals in his debut campaign for Liverpool, following that by scoring the winner in the Euro 2008 final.\nTorres famously failed to replicate that form after moving to Chelsea for a then British record £50m, but there were warning signs at Liverpool. He was constantly ruled out for lengthy periods with muscle problems. There’s also an intriguing scene from a documentary about Spain’s World Cup success, where Torres says he was warned that if he played at World Cup 2010, despite being in serious pain, it could compromise the rest of his career. That, seemingly, is what happened.\n24: Diego Costa (Atletico Madrid, 2013-14)\nSix, nine, 10 — and then, suddenly, 27 goals in a La Liga-winning Atletico Madrid side. Where did that come from?\nThe answer actually seems quite simple. Diego Costa only started playing organised football relatively late, at 15.\n“He always had the potential to become a great player but he lacked the 300 games,” said Atletico’s former director of football Jesus Garcia Pitarch, quoted in Fran Guillen’s book about Costa, The Art Of War.\nAdvertisement\n“That’s the number of games an 18-year-old would have played at youth level. Diego’s problem was that he had never been in an organised team and no experience of the dressing room. If things had been different, there’s no doubt he would have exploded onto the scene much earlier. He was always going to be great, it was just going to take him a bit longer than other people.”\nAnd yet, in the context of other strikers, we’re also talking about a player who peaked early — at 24. Still playing at 35 for Botafogo in his native Brazil, he’s scored only 16 league goals since turning 30. For that, once again, injuries seem to blame. Costa’s formative years were troubled by knee injuries and he certainly took risks with his body at certain points, most notably starting in the 2014 Champions League final and lasting barely five minutes. That was a sad way for that campaign to end, particularly as it was to prove Costa’s peak.\n25: Hernan Crespo (Lazio, 2000-01)\nYou think of Crespo as a permanently prolific striker, but he actually only scored more than 16 goals in a season twice — in his final year with Parma and his first with Lazio, when he finished top goalscorer in Serie A.\nCrespo’s less impressive second season at Lazio was partly due to the loss of both Pavel Nedved and Juan Sebastian Veron, with their replacement, Gaizka Mendieta, proving hugely underwhelming. Crespo also suffered from injuries in that second season, which would become a theme of his mid-twenties.\nCrespo also started moving club almost every year. In 2003, he went to Chelsea; in 2004, on loan to Milan; in 2005, he went back to Chelsea; in 2007, he moved to the city of Milan on loan again, but this time to Inter, before joining them permanently in 2008. Then there was a single year with Genoa and a swansong with Parma. But Crespo never truly felt settled for much of his career and peaked much earlier than we might have expected.\n26: David Villa (Valencia, 2008-09)\nA clinical finisher whose peak years coincided with Spain’s dominance at international level, Villa peaked slightly earlier than most forwards, although at the same age as, for example, Sergio Aguero.\nThere’s a similarity between the two players — both were short, explosive players who were far more than pure speedsters but who depended on acceleration in their best years. Both, in a sense, found their game slightly constrained when they were later coached by Pep Guardiola.\nAdvertisement\nVilla was fielded from wide at Barcelona and almost had to re-learn attacking movements to the benefit of the team rather than himself, while Aguero initially found Guardiola wanted more all-round qualities rather than someone who exclusively ran in behind, which took a couple of years for him to learn.\n27: Gonzalo Higuain (Napoli, 2015-16)\nAt Real Madrid, Higuain was considered something of a nearly man, which is somewhat harsh considering he scored 107 goals in 190 games, most of which came when the side was dominated by Cristiano Ronaldo.\nAt Napoli, Higuain scored 17 goals in his first season, 18 in his second season, then more than those two combined, 36, in his third and final season. One of the main factors in his improvement – and subsequent decline – was seemingly his diet.\nDuring his brilliant goalscoring run it was reported that Higuain had started using the services of dietician Giuliano Poser, who had also worked with his Argentine team-mates Lionel Messi and Sergio Aguero. He was supposedly eating more fish and meat and no sugar at all. “I feel much better,” said Higuain. “I should continue – I’ve lost four kilos.\n“When he arrived in Italy he was 79 kilos and now he’s 75,” confirmed a club medic. “Avoiding mayonnaise and tomatoes on the day of the game has been key.”\nBut later in that campaign, Napoli president Aurelio De Laurentiis suggested he hadn’t been sticking to the diet. “We cannot depend solely on one player and we cannot demand more from Higuain, but it’s true that when someone puts on one and a half kilos too much, it’s like running with a block of concrete,” he said. Higuain nevertheless still netted 36 goals, an all-time Serie A record.\nBut upon his move to Juventus, he was again criticised for being overweight. His manager, Max Allegri, acknowledged that “he did not present himself here in ideal condition”.\nAdvertisement\n“It is better if you keep calling me fat, I will continue to score goals,” responded Higuain. But weight issues continued to dog him. After making a loan switch to Chelsea, the first photos he posted in Chelsea training kit on Instagram prompted former Milan team-mate Suso to suggest he needed to ask for larger trousers. When he returned to Juventus and played under former Napoli coach Maurizio Sarri, he was supposedly put on his old diet and told to return to 75 kilos again, but Sarri never managed to rediscover Higuain’s peak years.\n28: Luis Suarez (Barcelona, 2015-16)\nLuis Suarez’s career arguably featured four different peaks for four different clubs: a staggering 35-goal season in his final full campaign at Ajax, a 31-goal campaign in his final season at Liverpool, a 40-goal season for Barcelona and then, finally, a more modest but more crucial 21-goal season as Atletico Madrid won a surprise La Liga title.\nBut why did Suarez peak with Barcelona in 2015-16? Well, there are a few factors. With Ajax, he was playing from the right flank and therefore arguably would have scored even more playing through the middle. With Liverpool, his two best campaigns were interrupted by bans, first for racially abusing Patrice Evra, then for biting Branislav Ivanovic. His debut campaign with Barcelona started late because of another ban for biting, this time on Italy’s Giorgio Chiellini at the 2014 World Cup.\nBut in 2015-16, it all came together. Not only was Suarez playing with Neymar and Lionel Messi but he’d established himself as the side’s central striker, with Messi returning to the right after Suarez had initially been forced to play from wide, a la David Villa, to accommodate Messi’s central positioning.\nAt this point, Suarez felt like a true all-rounder. His fighting spirit was combined with an athleticism and a dribbling ability that made him so difficult to stop — in later years he declined physically and became a slightly clumsy, pure battler.\n29: Dries Mertens (Napoli, 2016-17)\nA classic late developer, Mertens peaked late for two reasons. First, he admits he was physically underdeveloped in his early years. “When I got to 18, I had a body like a guy who was 15,” he once acknowledged.\nBut the more important reason was that Mertens spent much of his career as a winger and then became a striker. After Napoli sold Gonzalo Higuain to Juventus in 2018 and then Arkadiusz Milik suffered a serious injury, Maurizio Sarri gambled on the intelligence of Mertens over the physicality of Manolo Gabbiadini. He took to the role instantly.\nAdvertisement\n“Before, I would always have said that an assist was as satisfying as a goal,” he said. “But now I see that, as a striker, when you don’t score, (people say) you played shit. When you score, even if you played shit, you’re good. That’s all people see when you’re playing as a striker, so it’s important to score goals. So from now on, I’m scoring goals.”\nMertens had always been a popular player, but his goalscoring form ensured he went up in the estimations of everyone. “The way Mertens is playing as a No 9 is remarkable,” said his Belgium manager at the time, Roberto Martinez. “His way of interpreting the new role and his movement are just fantastic. He’s become a real master of the No 9 position.”\nInitially, Mertens was considered a false nine, but he ensured that was a short-lived phase, thanks to his goals. “I think I know what people want to say when they use that ‘false nine’,” Mertens said, “Because I’m not a big guy who can (hold up) the ball. But football changes and the way teams play changes. I think with the goals I’ve scored now, I think we can leave the ‘false’ and say I’m just a No 9.” With 28 goals, he was only one goal away from finishing as Serie A’s top goalscorer in 2016-17.\n30: Edin Dzeko (Roma, 2016-17)\nSo who beat Mertens to that honour? Well, it was tricenarian Edin Dzeko at Roma, eight years after his previous best return of 26 goals for Wolfsburg. In between those peaks, Dzeko was a consistent performer for Manchester City, but one who was generally regarded as a Plan B, or a foil for Sergio Aguero.\nDzeko’s first campaign in Rome, under Rudi Garcia, had been very difficult — he seemed an awkward fit for Garcia’s flexible approach and he had a habit of missing very simple chances. But the appointment of Luciano Spalletti — perhaps surprisingly given Spalletti had arguably invented the false nine position during a previous spell at Roma — transformed Dzeko’s game.\n“If someone were to design a perfect striker on a computer, they’d come up with Edin,” Spalletti said at the start of the season. “Obviously he needs to improve in some aspects but he’s physically strong, tall, quick and has good technique. He’s perfect. He needs to improve the aggressive side of his game, that’s where he can get better. He has the qualities of a scrapper but he doesn’t always use them.”\nSure enough, Dzeko started becoming more of a battler — but seemed more intelligent, too.\nAdvertisement\n“I’m not a boy anymore,” Dzeko explained to The Independent after his rejuvenation. “I can’t run like I could 10 years ago. I’m older, but I’m much (more) clever because I have so many games behind me. Some balls I went for like crazy at 21 years old, maybe this time I wouldn’t go for. When you have more experience, you have to play more with your head.”\nHe carried forward that ability for many years — to the extent that he started last season’s Champions League final for Inter at the age of 37.\n31: Antonio Di Natale (Udinese, 2009-10)\nAnother late bloomer in Serie A, Di Natale was more in the Mertens than the Dzeko mould. Early in his career, he was considered a lively wide attacker. Then he became regarded as something of a second striker, before eventually becoming the main man. He won the Capocannoniere in campaigns he’d started aged 31 and 32.\nIt wasn’t until 24 that he made his Serie A debut for Empoli, before a legendary 12-year spell with Udinese. He ended with 209 goals – only three other players have scored more, including Francesco Totti, whose longevity became something of an inspiration for Di Natale. “The example to follow is that of Francesco Totti,” Di Natale said. “He’s 38, but he says he feels like he’s 27.”\nWhereas Di Natale’s early days were marked by speed into the channels and finishes from tight angles, he later became a goal poacher, an expert at timing his runs into the danger zone. As he slowed down, his goalscoring return accelerated. He never lost his knack of scoring beautiful goals, however, particularly delicate efforts from outside the box, including free kicks.\nHe did acknowledge, though, that the standard of opposition had changed by his final days. “I used to play against Paolo Maldini, Alessandro Nesta, Fabio Cannavaro and Lillian Thuram,” he said. “I remember being unable to sleep the night before a game. Now everything has changed.”\n32: Robert Lewandowski (Bayern, 2020-21)\nForgive the slight gerrymandering here. The numbers above show Robert Lewandowski’s 2020-21 campaign should have started when he was 31. But because of the Covid-delayed start to that campaign, August-born Lewandowski was actually already 32.\nAdvertisement\nThis technically means he started two different campaigns at the age of 32. In 2020-21, he scored 41 goals in 29 games, and in 2021-22, he scored 35 goals in 34 games.\nThey are the best two goalscoring campaigns in an absurdly consistent career. Only once in his last 13 seasons — his first at Bayern — has Lewandowski failed to reach the 20-goal mark.\nBut it’s that 2020-21 campaign that stands out, primarily because he surpassed the famous 40-goal record set by Gerd Muller in 1971-72, a tally which for years seemed beyond the dreams of any modern player. He did it with a goal in the 89th minute of the last game of the season. “I didn’t even dream of scoring so many goals in one season, I can’t quite grasp what this record means,” he told Kicker magazine.\nBut how did he keep on getting better? Well, for a fuller answer, see The Athletic’s ‘My Game In My Words’ with the man himself.\n“Ten years is a lot of time in football to get better and work on your weaknesses,” he explained in that interview. “Back in 2010, the potential was there… it’s about getting to the point when you can do those things on the pitch automatically, when they become a part of you. Then the communication between your brain and your feet happens instantly, without the loss of data or a time lag. And then you find the right finish.”\n33: Karim Benzema (Real Madrid, 2021-22)\nThe alternative case study here would be Zlatan Ibrahimovic, but his late peak was — at least in part — because he was playing for an all-conquering PSG side in a weaker league than he participated in during his twenties.\nBenzema, in stark contrast, spent 14 years at Real Madrid, making a comparison between seasons somewhat simpler. Benzema was always a good goalscorer, scoring 37 league goals combined in his first two seasons at Lyon. He also hit 20+ goals on two occasions in his first nine years with Real Madrid.\nAdvertisement\nBut during that period Benzema, while always playing as a No 9, was a facilitator for Cristiano Ronaldo rather than the main man. “When Cristiano was here, we had a different style of play, I was providing more assists,” Benzema explained. “He really helped me on and off the pitch. But I knew that I could do more and when he left, it was time to change my game, change my ambitions.”\nAfter Ronaldo’s departure, Benzema’s goalscoring numbers exploded. From five in 32 league games in his last season alongside Ronaldo, Benzema subsequently hit 21, 21, 23, 27 and 19.\nHis 2021-22 peak doesn’t even include the 15 goals in 12 Champions League matches, which included hat-tricks against both PSG and Chelsea in the knockout phase, as well as winners in the second leg against Chelsea and in a remarkable comeback against Manchester City. He later won the Ballon d’Or, too, becoming the oldest winner since Stanley Matthews.\n“There are more and more players in this situation, who get better and better after they turn 30,” Benzema said midway through his best season. I take good care of myself. I pay a lot of attention to what I do. I get as much rest as I can. I work harder. I find the time to work properly and I think experience helps. That is why I feel great today, both technically and mentally speaking.\n“When I was 19 or 20, I was obsessed with football, with being on the pitch. And then, little by little, you realise that being on the pitch is not everything. There are a lot of other important things around it. Eating well, sleeping well, getting enough rest, working in the gym, so many things that I did not used to do.”\n34: Aritz Aduriz (Athletic Bilbao, 2015-16)\nThere was always something about Aduriz that never quite made sense. He was a brilliant target man and arguably the finest header of a ball in La Liga, yet he was only 5ft 11in (180cm). And therefore in his younger days, it always felt like there was something slightly lacking from Aduriz’s game, like you wanted him to develop into more of an all-rounder. When football moved away from two-striker systems, Aduriz’s limitations meant he became regarded as a Plan B, to Fernando Llorente at Athletic Bilbao and then Roberto Soldado at Valencia.\nSomehow, by the time Aduriz was a veteran, his limited game almost became easier for managers to accept. Returning to Athletic, who are constrained by their policy of only using Basques and were suddenly a little light on centre-forwards after Llorente departed, prompted an improvement into a genuinely prolific striker for the first time.\nAdvertisement\n“I have never seen this,” said his manager Ernesto Valverde. “Usually you think: ‘He’s 35, he has to drop at some stage’, but you look at him and you just don’t want the league to finish ever. He’s incredible.”\nThere was a neatness about Aduriz’s numbers. Having never previously scored more than 12 in a league campaign, he returned to Athletic at the age of 31 and then scored 14, 16, 18 and then 20 goals in his first four campaigns. That final campaign included another 10 in the Europa League. His hold-up play and aerial ability was as good as ever but he became a better poacher on the ground.\nAmid jokes that he took some kind of ‘magic potion’, Aduriz was more realistic. “People say goals are innate but that’s debatable,” Aduriz said. “In football, like in life, I think you’re learning continuously. I was always a late developer.” His retirement was enforced by the news he needed a hip replacement — a sad way to go, but somehow a measure of quite how old he was.\n35: Fabio Quagliarella (Sampdoria, 2018-19)\nFor many years, Fabio Quagliarella was the ultimate ‘scorer of great goals rather than a great goalscorer’. Clever flicks, perfect volleys, long-range screamers: Quagliarella could score any type of goal.\nApart from, arguably, poacher’s goals. Quagliarella was a second striker, a link man and a lively runner into the channels. Suddenly, in his mid-thirties, he became a prolific goalscorer, winning the Capocannoniere as Serie A’s top goalscorer in his 20th season. “If someone had told me what was going to happen, I would have called them mad,” he said. “When you’re a forward, you always dream of being the top scorer, but it’s hard to do in Serie A, especially when Cristiano Ronaldo’s in his first season here.” He also became, like Aduriz, the oldest-ever goalscorer for his national side.\nIn one sense, Quagliarella’s physical limitations at 35 helped him – now he was less mobile, he was forced to stay in the box more and found that, actually, it rather suited him. It’s also worth pointing out that some of his earlier seasons were compromised by an unsettling five-year experience with a stalker.\nBut Quagliarella was also quite blunt about the level of competition he faced, too. He pointed out that when he first played in Serie A in the mid-2000s, he was battling against the best defenders in the world. By the autumn of his career, the level of Serie A had dropped and centre-backs were picked for their passing ability as much as their defensive skills.\nHere’s an interactive comparison graph using the 17 aforementioned players – type their names into the box at the top to see how their careers differ. One highlight is comparing Ronaldo with Quagliarella – near-identical records between the ages of 29 and 32, but entirely contrasting either side.\nThere are a couple of obvious patterns and conclusions to draw from the above tales.\nThose who peaked early generally emerged in countries which had strong leagues, relied on their pace, then suffered from injury problems.\nThose who peaked a little later often had to move abroad to reach their peak.\nAdvertisement\nAnd those who peaked very late attributed it to constantly learning and developing their game. Often, this was combined with a change of role, becoming a proper striker rather than a wide attacker.\nOverall, data suggests the actual answer to the original question is that strikers peak, on average, at the age of 27. But that’s simply the average and in reality, it can be up to eight years before that, and eight years afterwards, too.",
  "word_count": 4925,
  "scraped_at": "2026-02-14T01:51:09.225454",
  "_text_extracted": true
}