{
  "article_id": "21a54dde5a52",
  "url": "https://www.themag.co.uk/2025/12/eddie-howe-bayer-leverkusen-press-conference-with-key-messages-ahead-of-wednesdays-match-newcastle-united/",
  "title": "Eddie Howe Bayer Leverkusen press conference with key messages ahead of Wednesday match",
  "date": "20251209T200000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe Bayer Leverkusen press conference with key messages ahead of Wednesday’s match\nThe Eddie Howe Bayer Leverkusen Press Conference has taken place.\nThe Newcastle United Head Coach speaking to the media ahead of Wednesday night’s game.\nUnited facing Bayer Leverkusen at 8pm (UK time) tomorrow at the BayArena.\nEddie Howe and his players hoping to make it four wins from six in the Champions League.\nA win would guarantee the minimum of a play-off place and put them in a great position to compete for top eight and automatic progress to the knockout stages.\nEddie Howe Bayer Leverkusen press conference – 9 December 2025:\n“We are excited by this game.\n“It is a great stadium and we are looking forward to the challenge Leverkusen will bring.\n“I have been relatively pleased with our performances in the Champions League this season, but Leverkusen are an outstanding football team, they play a really good style and never deviate from their identity.\n“It will be a test of how far we have come.”\nEddie Howe on striker Nick Woltemade returning to play in his native Germany:\n“He has done brilliantly.\n“I have just had the pleasure of half an hour with him on the way here and he is a great person and a great character.\n“On the pitch he has done really well, he has fitted in superbly and really bought into the team ethos.\n“We need to try and create more for him as a team but the chances he has got he has invariably done well with them.”\nEddie Howe on team selection with the Mackem match to follow on Sunday:\n“I think we will pick a team that will be strong tomorrow and strong on Sunday.\n“We have a few injuries to our backline which has been the case for a few games now.\n“We don’t necessarily have the depth at the moment, but we come here with a strong squad and we are ready for both games this week.”\nEddie Howe on Yoane Wissa:\n“He looks positive, body language is very good.\n“He’s been boosted by coming on the pitch [against Burnley] and he’s ready to take on minutes.\n“The challenge we have now is limited training times between games, which we have to get right.\n“He showed the qualities he had in those twenty minutes and he will only get better.”\nEddie Howe on a big week ahead:\n“It has been an intense week.\n“We finished the game on Saturday and immediately prepare for the next one.\n“We are having to cram a lot of work into a short period of time.\n“We are excited by this one and looking forward to the challenge.\n“It’s a tough game for us.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 468,
  "scraped_at": "2026-02-14T02:27:05.514503",
  "_text_extracted": true
}