{
  "article_id": "21e833a8f93f",
  "url": "https://thepeoplesperson.com/2024/02/20/galatasaray-keen-on-man-united-academy-sensation-shola-shoretire-276340/",
  "title": "Galatasaray keen on Man United academy sensation Shola Shoretire - Man United News And Transfer News",
  "date": "20240220T174500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have moved on quite a few academy stars, either temporarily or permanently, since Erik ten Hag took charge.\nIt represents a pure profit and is invaluable in terms of FFP rules but with the club known for its youth-first approach, there have been reservations about the new trend.\nSome stars like Anthony Elanga and James Garner have already made United rue the decision of selling them while fans were upset that Isak-Hansen Aaroen left in January.\nThe likes of Hannibal Mejbri and Alvaro Fernandez could also be on their way and as per Turkish outlet Aspor, Shola Shoretire could be about to follow suit.\nShola on his way out\nThe Red Devils had initially planned to offer the 20-year-old a new deal before sending him out on loan or even selling him.\nBut nothing transpired during the winter transfer window, but come summer, the United academy graduate could be leaving for Galatasaray on a two-year loan.\nShoretire has been linked with moves to Championship clubs but joining the Turkish giants and playing in the Champions League would represent a significant step-up.\nThe defending Turkish champions had wanted to sign Christian Eriksen in January but now seem to have moved on to younger targets for the long haul.\n“Galatasaray is planning to add Shola Shoretire, who plays for Manchester United, to its squad for the new season.\n“The yellow-reds aim to rent the 20-year-old football player for 2 seasons. The English team was keen on loaning out the successful midfielder to Galatasaray.\n“Shola Shoretire is keen on joining the yellow-red team. The transfer is expected to be clarified in the coming days. With this transfer, Galatasaray will replace Dries Mertens with a talented and young star.”\nShola’s missed opportunity\nThe England U19 international got his big break under former manager Ole Gunnar Solskjaer and made his United first-team debut when he came on against Newcastle United back in February 2021.\nHe then proceeded to break the long-standing record of Norman Whiteside when he made his European debut against Real Sociedad in the Europa League at the age of 17 years and 23 days, surpassing the previous record by 108 days.\nThe academy graduate has scored nine times and assisted a further four goals in 12 appearances for United’s reserve side.\nHe has made it to the matchday squad under Ten Hag for Premier League, Carabao Cup, and Europa League matches but is yet to make an appearance under the Dutchman.\nInjuries have curtailed his progress and it seems to be increasingly likely that Shoretire’s future lies away from Old Trafford.",
  "word_count": 431,
  "scraped_at": "2026-02-14T01:56:44.625594",
  "_text_extracted": true
}