{
  "article_id": "21f490f99eba",
  "url": "https://metro.co.uk/2025/05/04/chelsea-vs-liverpool-live-premier-league-latest-score-confirmed-lineups-23021460/",
  "title": "Chelsea vs Liverpool LIVE : Premier League latest score and confirmed lineups",
  "date": "20250504T151500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea boosted their top-four hopes as they dispatched off the new Premier League champions Liverpool with a 3-1 win at Stamford Bridge.\nThe Blues applauded Arne Slot’s side onto the pitch ahead of kick-off, but the home fans had reason to celebrate after just three minutes when Enzo Fernandez finished off a well-executed move with a composed finish.\nEnzo Maresca’s side still have plenty to play for this season as they look to secure a top-five finish and a return to the Champions League next season.\nAnd that dream was handed a boost after the break when Virgil van Dijk’s attempted clearance cannoned off Jarrell Quansah and into the Liverpool net after 56 minutes.\nMore Trending\nVan Dijk made for a tense final few moments when he headed home from Alexis Mac Allister’s corner in the 85th minute.\nBut Chelsea held on, even managing to add a third deep in injury time when Cole Palmer got a well-deserved goal from the penalty spot after Moises Caicedo was tripped by Quansah.\nThe result moves Chelsea level on points with Newcastle on fourth after Eddie Howe’s side drew 1-1 with Brighton earlier on Sunday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRelive all the action from Stamford Bridge below with Metro’s matchday blog:\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nThat’s all for today!\nA great win for Chelsea who end their sorry recent record against Liverpool in style. That will do us for today’s coverage from Stamford Bridge, but stay tuned across Metro for all the reaction and analysis from the weekend’s action.\nUntil next time…\nCole Palmer speaks to Sky Sports\nOn his goal drought: ‘I just felt normal. Obviously it happens, I went three months without scoring but it just gives me more fight and motivation to do more for myself and for the team.\n‘Social media nowadays is full of idiots, the trolls and whatever. I don’t pay any attention to that. I’ve scored today and I’m happy but it’s only one and I’ve got to keep improving and try and reach new levels.\n‘Getting chances and not scoring, it feels like you’re letting your team down. I feel like I am mentally strong anyway. I feel pride in helping the team and if I’m not doing that, I’m not happy.’\nOn today’s performance: ‘I felt confident, I was trying things, first time passes, playing forward. When you have got him [Moises Caicedo] in front of you, it’s a dream. From the start of the season, he has been our best player, he wins the ball back all the time, he’s humble, nice to everyone and everyone loves him.’\nRace for Champions League hotting up\nChelsea’s win moves them level on points with Newcastle in fourth with just three games remaining.\nNottingham Forest play Crystal Palace tomorrow and can draw level with both sides on 63 points with a win.\nThe streak is over\nChelsea recorded a victory over Liverpool for the first time since March 2021 (1-0 in Premier League), ending a run of 10 games without a win against the Reds in all competitions (D7 L3).\nFULL-TIME: Chelsea 3-1 Liverpool\nAnd the full-time whistle follows shortly after – a superb performance from the hosts which hugely helps them in their bid to qualify for the Champions League.\nIt’s just Liverpool’s third league defeat of the season.\nGOAL! Chelsea 3-1 Liverpool (Palmer, 90+6 mins)\nAnd he makes no mistake! Chelsea secure all three points in style!\nIt’s a deserved goal for Palmer, too, who has run the show at Stamford Bridge today.\nChelsea 2-1 Liverpool\n90+5 mins: PENALTY! Quansah’s game goes from bad to worse as he trips up Caicedo in the area. Superb work from the Chelsea midfielder to knick in and win the ball.\nPalmer will take it to secure all three points…\nChelsea 2-1 Liverpool\n90+4 mins: Liverpool pouring numbers forward but Chelsea are solid… so far. The home fans trying to roar their team over the line for what would be a huge three points.\nChelsea 2-1 Liverpool\n90+2 mins: Into the second of five minutes of added time and it’s more good defending from Caicedo to snuff out a potential chance from Liverpool on the edge of Chelsea’s area.\nChelsea 2-1 Liverpool\n88 mins: A change for Chelsea as James makes way for Fernandez. The Blues looking to hold onto this lead as we approach injury time.\nChelsea 2-1 Liverpool\n86 mins: Palmer with another effort but it’s safely into the gloves of Alisson.\nGOAL! Chelsea 2-1 Liverpool (Van Dijk, 85 mins)\nA way back?\nVan Dijk powers home Mac Allister’s cross from the corner and Liverpool pull one back.\nChelsea 2-0 Liverpool\n82 mins: Chiesa on for Tsimikas who now qualifies for a Premier League medal, with this his fifth league appearance.\nChelsea 2-0 Liverpool\n81 mins: POST! Palmer has done everything but score today and he’s so unlucky again. A great turn of pace to get inside the box but his effort from a tight angle comes back off the inside off the post.\nChelsea 2-0 Liverpool\n80 mins: SAVE! Madueke’s effort is blocked before Sancho is teed up by Fernandez, but Alisson does well to close down the angle and smother the strike.\nChelsea 2-0 Liverpool\n78 mins: CHANCE! Salah is onside and rises well at the backpost but his header at the backpost drifts just wide of the post with Sanchez beaten.\nA change for Chelsea after that as Lavia is replaced by Gusto. Another impressive performance from the midfielder on his return from injury.\nChelsea 2-0 Liverpool\n73 mins: Tsimikas whips in a corner from the right, but Fernandez brings the loose ball away and Chelsea can break.\nNeto storms into the area, but a loose touch allows a retreating Jones to make the all-important interception.\nA change for Chelsea moments earlier, too, as Sancho replaces Jackson.\nChelsea 2-0 Liverpool\n69 mins: A double change for Liverpool again as Endo and Elliott make way for Mac Allister and Szoboszlai.\nChelsea 2-0 Liverpool\n68 mins: A good spell of possession for Liverpool, but the visitors are struggling to create a host of clear-cut opportunities against this resolute Chelsea defence.\nWell… now they do create a chance but it’s a poor header from Nunez who miscues it well wide of the target.\nChelsea 2-0 Liverpool\n64 mins: Palmer looks to collect Neto’s cross inside the box, but a last-ditch challenge from Jones prevents the chance.\nMORE: Ruben Amorim says he has to remove ‘really intelligent’ Man Utd star from training\nMORE: Brentford star targeted by Man Utd after starring against Red Devils\nMORE: Ruben Amorim ‘really concerned’ about Manchester United star after 4-3 defeat to Brentford",
  "word_count": 1178,
  "scraped_at": "2026-02-14T02:26:38.645541",
  "_text_extracted": true
}