{
  "article_id": "221dfab90938",
  "url": "https://www.dailymail.co.uk/femail/article-14014781/Rodris-secret-keeping-feet-floor-Ballon-Dor-winner-dating-trainee-surgeon-met-university-8-years-says-reminds-hes-Rodrigo.html",
  "title": "Rodri secret to keeping his  feet on the floor : Ballon Dor winner has been dating trainee surgeon he met at university for 8 years and says she reminds him he  still Rodrigo  ",
  "date": "20241029T163000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rodri's secret to keeping his 'feet on the floor': Ballon D'or winner has been dating trainee surgeon he met at university for 8 years and says she reminds him he's 'still Rodrigo'\n- READ MORE: Rodri WINS the Ballon d'Or as Real Madrid boycott Paris ceremony\n- LISTEN NOW: It's All Kicking Off!, available wherever you get your podcasts. New episodes every Monday and Thursday\nHe was crowned the best player in the world of football last night - and there to support Rodri as he collected his Ballon d’Or award was his glamorous girlfriend Laura Iglesias.\nThe Manchester City star, 28, and his partner of eight years, a medical student who is thought to be training to become a surgeon, prefer to keep their relationship away from the public eye.\nBut at last night's occasion, the couple - who met one another at university - put on a glittering display as they hit the red carpet together ahead of the ceremony at the Theatre du Chatelet.\nArriving on crutches, required due to his ACL injury, Rodri looked smart in a suit, white shirt, and bow tie alongside his girlfriend, who dressed to impress in a black sleeveless gown, teamed with a shimmering necklace and silver clutch bag.\nPosing for photographs arm-in-arm, the pair were all smiles ahead of the Spain midfielder receiving his honour. Rodri became the first Premier League player to win the award since Cristiano Ronaldo in 2008.\nHe was crowned the best player in the world of football last night - and there to support Rodri as he collected his Ballon d’Or award was his glamorous girlfriend Laura Iglesias (pictured together)\nYet while Rodri is fast becoming a legendary footballer, his girlfriend isn't keeping with the likes of the traditional WAGs and instead prefers to keep out of the spotlight.\nBut whilst Laura, whose Instagram account is private, doesn't show off her celebrations and support for her boyfriend to the world, she does make sure he sees her cheering him on.\nThe four-time Premier League winner previously revealed: 'When I get to score, I always have a video of Laura celebrating the goal at home and I always watch it in a locker room.'\nSuch is their support for one another, that in his early days at City, he'd also take every opportunity he could to speak to his girlfriend whilst she was studying in Spain and he was playing in England.\nSpeaking to The Players' Tribune, Rodri previously confessed that his regular chats and FaceTimes with his partner - even when on the team bus - would annoy his teammates.\n'I’d call her after every game, win or lose,' recalled the sportsman. 'When we won, it was no problem, because the boys would be rowdy and celebrating and they wouldn’t notice.\n'But when we lost, I was still just my normal self. I had no filter. When I speak to my missus, it’s like my brain flips back to being in uni. I become Rodrigo again,' he explained, after crediting his partner for 'always' keeping his 'feet on the floor'.\nThe Manchester City star, 28, and his partner of eight years (pictured), a medical student who is thought to be training to become a surgeon, prefer to keep their relationship away from the public eye\nThe couple (pictured after Manchester City's victory in the UEFA Champions League 2022/23 final match) met one another at university\nYet while Rodri is fast becoming a legendary footballer, his girlfriend isn't keeping with the likes of the traditional WAGs and instead prefers to keep out of the spotlight\nHe recalled how he would talk loudly, asking what she was up to and speaking 'like two teenagers'.\n'Everyone was so annoyed. They would be trying to grab the phone from me: \"He will call you back! Rodri, hang up the phone! He has to go now! Bye-bye!\"' They wanted to kill me, but I didn’t care.\n'When I leave the pitch, my goal is to always make sure that my feet are on the floor. I think sometimes people misunderstand that part of me.'\nDespite all his success, the footballer - who is estimated to earn £220,000-a-week - enjoys a modest lifestyle, including driving old cars, staying off social media and even living in student halls.\nAfter passing his driver's test, Rodri bought a second-hand Opel Corsa from an elderly lady, reported The Sun.\nUnlike many footballers, the midfielder believes it's 'crazy' to purchase expensive cars when all that matters is that they can take you to your destination, according to Rodri's university friend Valentin Henarejo.\nThe sportsman also proved his humble nature when studying at Jaume I University in eastern Spain, where he met Laura while also playing for Spanish professional football club Villarreal.\nRodri later completed his degree in Business Administration while playing for Manchester City, reported Footboom.\nLaura supported her boyfriend by appearing in a clip shared by the official website of Manchester City, in which Rodri and his partner tried their hand at golf together (pictured)\nRodri and Laura attend the 67th Ballon D'Or Photocall at Theatre Du Chatelet on October 30, 2023 in Paris\nAttending his matches isn't the only time that Laura, who don't have any children with her partner, supports her man; she was seen with him at the French Open in May 2024 (pictured)\nThe footballer and his glamorous girlfriend arrive at the PFA Awards in Manchester in August 2024\nDuring his studies, the footballer lived in student halls, with his friend Valentin previously telling Marca about their time together in the shared accommodation.\nThe pal said: 'People were shocked when they saw Rodri, who was playing in the top flight but still living at the university residence.\n'After the first few days of getting to know him, there was normality He shared a space with everyone, he liked being with his friends and sitting on the sofa with everyone.\n'But, of course, at the start it was strange seeing him playing table tennis or doing his washing.'\nRodri and his university pal Valentin, who celebrated his friend's win on his social media page today, appear to still be friends to this day, with the latter sharing sweet snaps with the footballer and Laura to his Instagram account.\nOne photo in front of the picturesque sea, showed the beaming couple posing with their uni friend, who captioned the picture: '\"I'm around, shall we eat together today?\" I hope you always get these calls and these surprise visits, partner.'\nAnother selection of images from 2022, showed Valentin alongside Laura, watching one of Rodri's football matches, with the caption explaining: '\"Catch up\" trip in full swing.'\nAttending his matches isn't the only time that Laura, who don't have any children with her partner, supports her man; she was seen with him at the French Open in May 2024.\nTwo years earlier, Laura supported her boyfriend by appearing in a clip shared by the official website of Manchester City, in which Rodri and his partner tried their hand at golf together.\nThe four-time Premier League winner previously revealed: 'When I get to score, I always have a video of Laura celebrating the goal at home and I always watch it in a locker room.'\nRodri celebrates with his girlfriend after the team's victory in the UEFA Champions League 2022/23 final match\nThe couple attend the second round match of Carlos Alcaraz of Spain during day 4 of the 2024 French Open in May\nThe description for the footage read: 'With the games coming thick and fast as we enter the business end of the season, we caught up with Rodrigo and his partner Laura as they tried their hand out at the driving range.\n'As they got into the swing of things at the Trafford Golf Centre, both Rodrigo and Laura chatted about meeting as University students back in Spain.'\nDuring the video, Laura opened up about how her boyfriend is 'very passionate with everything', adding: 'In every game, he's so competitive', before praising him for being 'good in everything'.\nThe couple also shared a funny moment from their home life, with Rodri recalling: 'I was at home, I just cut a little bit of my finger, and I just start bleeding, I need a tissue or something, and she was just like shaking.\n'I was like, if you do this in the theatre, what are you going to do?' he added, with the duo sharing a laugh together at the the memory.\nLast night, a hobbling Rodri was crowned the best player in world football after Real Madrid boycotted the ceremony when they learned Vinicius Junior would not win the Ballon d’Or.\nThe footballer helped City to a fourth straight league title this year and was an integral member of Spain’s European Championship winning side. He has lost only one club game in 18 months.\nReal withdrew their 50-strong delegation just hours before the ceremony after Vinicius, the Brazil winger who had been the bookies’ favourite for the prize, was reportedly tipped off that he hadn’t won.\nReal won team of the year and Carlo Ancelotti was named men’s coach of the year, but no one was present to collect the awards.\nThe 28-year-old Spanish midfielder hobbled down the red carpet with his partner Laura Iglesias\nA hobbling Rodri has been crowned the best player in world football at the Ballon d'Or in Paris\nAppearing at the event on crutches as he recovers from an anterior cruciate ligament injury, the Spaniard received gentle boos from Vinicius advocates\nSoaking in the adulation on Monday night, the visibly emotional midfielder said: 'Incredible night for me today. If you will let me, I would like to speak in my language of my country.\nIn Spanish, he added: 'I always said that one of my key things is that I try to improve every day.\n'I was a traditional midfielder but when I realised I needed to get better in terms of assists and goals. You have to be like a striker because we always play in the frontal area. That is the key to improving every day.\n'People don't know me much, I am just a normal guy. I try to enjoy my profession, try to be a good person, a leader, and learn every day from the best.\n'I am a calm person until I get upset. I am a normal guy and try to say... that you don't need to be crazy and try to do your best.\n'I am feeling much better. A big big injury, it's part of life and sport. I try to look at the best part of this and be positive.'\nIn the two most excruciating moments of the glamorous affair, Carlo Ancelotti won Men's Coach of the Year while Real bagged Men's Team of the Year. Both prizes went uncollected after every club representative decided to join Vinicius in his boycott.\nMeanwhile, Aitana Bonmati clinched the Women's Ballon d'Or, Lamine Yamal walked away with the Kopa Trophy and Emi Martinez secured the Yashin Trophy.\nHarry Kane picked up the Gerd Muller award for goalscoring and Emma Hayes then won the Women's Coach of the Year award.\nIn what was the worst kept secret in football, Rodri pipped the likes of Vinicius and Jude Bellingham to the prestigious prize, much to the ire of Los Blancos.\nAfter news broke earlier today that the selection panel had chosen the midfielder as this year's victor, Real and Vinicius decided to pull the plug on their trip to the gala, held at the Theatre du Chatelet.\nRodri was rewarded for his role in Spain's Euro 2024 win and in City's Premier League triumph\nThe Spanish giants had hoped that if their Brazilian forward was not given the nod, right-back Dani Carvajal might be handed the gong after winning La Liga, the Champions League and the Euros.\nBut when it was leaked today that Rodri was in fact the winner, Real reacted furiously and not a single club representative was there to watch their team win several honours at the event and their players place highly in the main list.\nAmid the furore, Ballon d'Or organisers urged on Monday afternoon ahead of the ceremony: 'No player and no club knows the winner of this year’s Ballon d'Or yet.'\nThe rumours proved to be true, however, and Rodri will take the famous prize back to Manchester to cap a glorious year.\nAppearing at the event on crutches as he recovers from an anterior cruciate ligament injury, the Spaniard received gentle boos from Vinicius advocates as he hobbled down the red carpet with his wife Laura Iglesias.\nShowing the kind of poise that has taken City to a glut of trophies since his arrival, Rodri paused with his crutches and waved at the crowd for a couple of seconds, placating the masses.\nAhead of his triumph tonight, he said: '[I'm] feeling good. It's the first month of recovery. It's a long way to go but happy to be here.\n'It's a pleasure to be nominated. It's always a huge step for me. Last year was my first year. I don't know anything, let's see what happens.'",
  "word_count": 2200,
  "scraped_at": "2026-02-14T01:51:57.630729",
  "_text_extracted": true
}