{
  "article_id": "2223813577eb",
  "url": "https://zeenews.india.com:443/people/david-beckham-drops-pictures-with-shah-rukh-khan-sonam-kapoor-expresses-gratitude-2689382.html",
  "title": "David Beckham Drops Pictures With Shah Rukh Khan , Sonam Kapoor ; Expresses Gratitude",
  "date": "20231118T030000Z",
  "domain": "zeenews.india.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Shah Rukh Khan Hosts David Beckham, Footballer Expresses Gratitude For A Warm Welcome\nBoth Sonam and SRK hosted Beckham at their respective residences in Mumbai. They also penned a heartfelt welcome note for him on their Instagram handles.\nTrending Photos\nNew Delhi: During his India trip as a UNICEF Goodwill Ambassador, football legend David Beckham managed to take some time off his work to meet Bollywood personalities like Shah Rukh Khan and Sonam Kapoor.\nBoth Sonam and SRK hosted Beckham at their respective residences in Mumbai. They also penned a heartfelt welcome note for him on their Instagram handles. And now a while ago, Beckham took to his social media and expressed his gratitude to SRK and Sonam for their warm hospitality.\nAddressing SRK as his friend, Beckham wrote, \"Honoured to have been welcomed into this great man's home. To enjoy a meal with @iamsrk, @gaurikhan, their beautiful children and close friends - what a special way to end my first visit to India... Thank you my friend - you and your family are welcome any time in my home...\"\nOn receiving a grand welcome from Sonam and her husband Anand, Beckham wrote, \"@sonamkapoor and @anandahuja - you hosted me with such warmth and kindness this week, thank you for the amazing evening you created at your - see you again soon.\"\nHe also shared pictures with SRK and Sonam who turned hosts for him in India.\nPrior to paying visit to Sonam and SRK, Beckham attended the India vs New Zealand World Cup semi-final match in Mumbai's Wankhade stadium.\nConsidered one of the best footballers of all time, Beckham has represented England at national level and made over 100 appearances for them between the years 1996 and 2009. The midfielder also represented iconic football clubs like Manchester United, Real Madrid, AC Milan, Paris Saint Germain and LA Galaxy in his decorated career. With these clubs, he has won prestigious titles like the Premier League, La Liga, Ligue 1 and UEFA Champions League titles.\nStay informed on all the latest news, real-time breaking news updates, and follow all the important headlines in india news andworld News on Zee News.\nLive Tv",
  "word_count": 361,
  "scraped_at": "2026-02-14T02:07:27.061017",
  "_text_extracted": true
}