{
  "article_id": "222419005fd8",
  "url": "https://www.thenationalnews.com/news/us/2025/07/21/ice-detention-report-abuses/",
  "title": "Migrants at US detention centre forced to eat  like dog , report says",
  "date": "20250722T031500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Migrants at a detention centre in Florida were forced to eat “like dogs”, with their hands tied behind their backs, an international watchdog said in a report on Monday.\nHuman Rights Watch, which gathered testimony from detainees, relatives and lawyers, documented alleged abuses at three centres in southern Florida and said people were subjected to degrading treatment, lack of medical care and overcrowding.\nFormer detainee Harpinder Chauhan,56, a British entrepreneur and father of two, recounted an incident in April in which dozens of men were denied food for hours. They were allegedly crammed into a single cell with their feet shackled and hands tied behind their backs.\nFood was eventually given to them on chairs, but they remained restrained, recalled Mr Chauhan, who Human Rights watch said was taken into Immigration and Customs Enforcement (ICE) custody because of problems with his taxes. “We had to bend over and eat off the chairs with our mouths, like dogs,” said Mr Chauhan. He was eventually deported back to the UK.\nThe ICE's assistant secretary for public affairs Tricia McLaughlin described the allegations in the report as \"lies\".\n\"Any claim that there are subprime conditions at ICE detention centres are false,\" she told The National.\n\"All detainees are provided with proper meals, medical treatment, and have opportunities to communicate with their family members and lawyers.\"\nAccording to Human Rights Watch, Mr Chauhan had lived in the US since 2016 and first entered the country on an E-2 investor visa. ICE officers detained him on February 11 after he ran into tax problems.\nHe and other former and current detainees described filthy, overcrowded centres where migrants are treated poorly. One woman spoke of being held at Krome North Service Processing Centre, which is usually reserved for men in South Florida.\n“There was only one toilet, and it was covered in faeces,” she said. “We begged the officers to let us clean it, but they just said sarcastically, ‘Housekeeping will come soon.’ No one ever came.”\nAnother man said the intake centre he was kept in was freezing. “They turned up the air conditioning … You could not fall asleep because it was so cold. I thought I was going to experience hypothermia,” he said.\nUnder President Donald Trump, the number of people detained by ICE has increased dramatically as he continues to crack down on illegal immigration. As of late last month, an average of 56,000 people were being held in immigration detention centres per day, a 40 per cent increase from the same time last year and the highest in US history.",
  "word_count": 429,
  "scraped_at": "2026-02-14T01:49:44.674571",
  "_text_extracted": true
}