{
  "article_id": "22519ef9c1e3",
  "url": "https://www.dailymail.co.uk/news/article-13531777/Germany-0-0-Scotland-Fans-home-abroad-pack-pubs-fan-zones-settle-tournament-opener-150-000-supporters-descended-Munich-Euro-2024-finally-kicks-off.html",
  "title": "Germany 2 - 0 Scotland : Wirtz case scenario for Scots fans as Euro 2024 hosts snatch two early goals in Munich after 150 , 000 supporters descended on city with thousands more packing out pubs across the united kingdom ",
  "date": "20240614T194500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Germany battered sorry Scotland 5-1 in tonight's Euro 24 curtain raiser\nScottish football fans started filing out of the Munich Football Arena well before the final whistle tonight as their side crashed to a 5-1 defeat against Germany after the team conceded three first half goals against the hosts.\nThe Tartan Army were in full voice as Scotland kicked off Euro 24 this evening but were soon left with their heads in their hands after an early battering.\nFlorian Wirtz gave the Germans a lead after just ten minutes before talented youngster Jamal Musiala doubled their lead.\nThings turned from bad to worse for the Scots when Ryan Porteous gave away a penalty for a dangerous tackle on Ilkay Gundogan and duly received a red card.\nThis was the signal for thousands of Scottish supporters to leave the stadium in droves and the side will have to dust themselves down ahead of their next match against Switzerland on Wednesday.\nScottish fans look devastated in Munich as they watched their side get battered by Germany\nScots at the Munich Football Arena watch on in shock as their side crashed to a 5-1 opening match defeat to Germany\nThe Tartan Army did have something to cheer about in Munich as an Antonio Rudiger own goal saw them reduce the deficit\nEmre Can pictured celebrating after piling on the misery once more, getting himself on the scoresheet in added time to secure a 5-1 win\nScottish players celebrate a consolation goal after Antonio Rudiger put the ball in his own net late on\nNiclas Fullkrug celebrates his goal to send Germany 4-0 up against the Scots\nKai Havertz slotted home a penalty to break Scottish hearts and send the hosts 3-0 up at half time\nScottish fans looked stunned as they watch their side concede early goals at the BAaD, Glasgow\nScots at the BAaD, Glasgow have their heads in their hands as the national team go 3-0 down against hosts Germany by half time\nA Scottish fan pictured shouting at a screen at the BAaD, Glasgow, as supporters come to terms with their side's poor first half showing\nReferee Clement Turpin awarded Germany a penalty after consulting the video review system\nScotland's Ryan Porteous is shown a red card for his tackle to add to Scottish misery\nPorteous is consoled by Anthony Ralston as he walks off the pitch at Munich having been sent off\nScotland fans react to their side going down early to Germany in the tournament's opening match\nScottish fans look glum as their side conceded three first half goals in Munich\nScottish supporters experienced Euro heartbreak conceding a handful of goals early on\nGermany's Jamal Musiala celebrates his side's second against Scotland tonight\nScotland fans cheer their side on at Munich Football Arena tonight\nScottish fans watch on in Glasgow as their country face Germany in the opening Euro match\nFlorian Wirtz put Germany 1-0 up against Scotland early in tonight's big opening match\nGerman players celebrate after their side took the lead against Scotland\nScotland's Kieran Tierney battles with Germany's Jamal Musiala in tonight's match\nHome fans meanwhile were in dreamland as Niclas Fullkrug made it four with a wonderful finish before an Antonio Rudiger own goal gave the Scots something to cheer late on.\nEmre Can then piled on the misery once more, getting himself on the scoresheet in added time to secure a 5-1 win on a glorious opening night for the hosts.\nFans home and abroad packed out pubs and fan zones this evening as they settled in for the tournament opener after 150,000 supporters descended on Munich earlier today.\nMany felt the team were 'humiliated' at the hands of the Germans and had embarrassed supporters with a lacklustre performance.\nAmong the first to leave were David and Elena Strachan from Falkirk.\nMr Strachan, an accountant, said: 'It was an embarrassing first half. Their goalkeeper only touched the ball once.\n'I don't know what has happened, but we should've seen the warning signs. Scotland played four friendly games before this tournament and they were mediocre.\n'The team had four months to prepare for tonight's match and this is the show that they put on. Embarrassing.'\nBut Ms Strachan added: 'We have booked for the next Scotland match, so we will be staying on.\n'But I'm also fed up with what happened at the ground. We waited for one-and-a-half hours to get in and we got there early.'\nAnother fan John Miller, 24, from Dundee, added: 'What a s*** show. Disgraceful. Tactics wrong. The team let us down.\nBut Steve Hudson from Windsor said: 'I am worried that I'm leaving early. In case we have a miracle and score 5 goals.'\nThe Scotland team pose for photos ahead of tonight's curtain raiser in Munich\nScotland fans at Marienplatz in Munich today ahead of the match against Germany tonight\nScotland fans at Marienplatz in Munich today ahead of the match against Germany tonight\nScotland fans at Marienplatz in Munich today ahead of the match against Germany tonight\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at Marienplatz in Munich today ahead of the match against Germany tonight\nFirst Minister of Scotland John Swinney appears eager to enjoy some questionably poured pints ahead of Scotland's opening Euros game in Marienplatz square\nFormer First Minister of Scotland Alex Salmond with Scotland fans in Munich this morning\nA Scotland fan pours beer on his face in the Marienplatz square before tonight's match\nScotland fans at Marienplatz in Munich today ahead of the match against Germany tonight\nThe party ended early for one Scotland fan pictured slumped on the pavement in Munich\nA Scottish fan pictured with his head in his hands and a half finished pint just hours before the kick off in Germany\nA large group of Scotland fans pictured chanting as they ride an escalator before tonight's match against Germany in Munich\nA Scotland fan pictured raising a bottle ahead of his country's match against Germany tonight\nA Scot wearing a tartan kilt and a football shirt pictured playing the bagpipes at Olympiapark in Munich this afternoon\nOne Scotland fan placed a finish box of beers in his head and danced with fellow football supporters in Munich today\nAnother group donned patriotic face paint and retro Scottish kits as they danced in the Marienplatz, Munich\nA group of Scottish fans draped in the national flag get ready to cheer on their team in Munich this afternoon\nScotland fans pose with customised flags before tonight's opening match of Euro 2024\nA crowd of Scotland fans pictured outside the Munich Football Arena this afternoon\nOne Scotland fan, with a beer by his side, is pictured taking it all in outside the stadium ahead of tonight's match\nA Scot pictured in his football top in Munich as the Tartan Army descend on the German city\nMeanwhile back home fans marched along the streets in Dunfermline to support Scotland ahead of the opening match of the Euros tonight\nA Scotland fan pictured tucking into a pint in Dunfermline this evening\nTwo Scots in kilts grab pints pre-match at the BAaD, Glasgow this evening\nA pair of Scottish fans get at the BAaD, Glasgow ready to cheer on their country in tonight's opening Euros match\nScotland and Aston Villa stars John McGinn (foreground) and Scott McTominay (background) pictured arriving at the stadium ahead of tonight's game\nScottish goalkeeper Angus Gunn walks into the Munich Football Arena this evening\nMatch Referee Clement Turpin (left) and Assistant Referee Nicolas Danos (right) arrive at the stadium prior to the UEFA EURO 2024 group stage match between Germany and Scotland\nScotland manager Steve Clarke inspects the pitch just over an hour before his side open their tournament against Germany\nMembers of the Scotland squad walk out onto the pitch a couple of hours ahead of the game\nScotland and Liverpool left back Andrew Robertson pictured on the pitch pre-match\nScotland's Billy Gilmour and Liam Kelly (right) pose for a photo on the pitch before the match\nScotland's Lyndon Dykes (pictured, right, with Liam Cooper) will miss the tournament due to injury\nBilly Gimour, Ryan Porteous and Liam Cooper of Scotland inspect the pitch prior to the Euro 2024 group stage match between Germany and Scotland\nLaura Taylor pictured getting ready to support her husband Greg Taylor at the stadium tonight\nThe Tartan Army's fanatics invaded the German city in a rowdy riot of colour and noise as Euro 2024 finally got underway.\nThe festivities ahead of the opening match against the hosts forced warnings of overcrowding and the sounds of bagpipes screamed through the German city's streets.\nAs the home nation hope to kick off their campaign with a striking victory, British supporters painted the streets blue as they arrived on mass wearing kilts and boozing on Buckfast.\nThe great and the good from the northern nation flooded to Europe - with everyone from Sir Alex Ferguson to First Minister Jon Swinney joining the celebratory ranks as they posed for photos alongside travelling pals.\nSetting the bar for the competition's festivities, The Tartan Army lived up to their anthem 'No Scotland No Party' as they crossed the continent in campervans and even by bike to cheer on Steve Clarke's side.\nAnd while songwriter Nick Morgan's tune admits 'nobody's saying we're gonna win it' the hoards of fans have shown their steadfast commitment to enjoy the evening - packing the Marienplatz supporters from this morning.\nBut the day has not all been smooth sailing - in Berlin cops descended on a fanzone alongside bomb-sniffing dogs and disposal experts after a suspicious object was discovered in the viewing area just hours before kickoff.\nAnd an 'urgent' update on Muenchen, Munich's official portal, revealed there would be no screening in the square and the Olympic Park fanzone was also full.\nMunich's statement said: 'Marienplatz is currently overcrowded. There will definitely be no public viewing there. Please spread out elsewhere in the city! The Fan Zone is also about to close due to overcrowding. Please do not go to the Olympic Park anymore!'\nPolice officers blocked off entrances to the square to ensure emergency services could still get access if needed, while the city’s main train station was also shut.\nThe Scottish FA estimated back in March that 100,000 fans would travel to Germany, but there are now estimated to be double that figure in the country.\nUp to 70,000 Scots were thought to descended on Marienplatz today, and an estimated 150,000 were believed to be ticketless.\nMany filled pubs and bars but no trouble has been reported, with the Scots largely creating a joyous atmosphere as they revelled in a rare opportunity to travel abroad to see their team play in a major tournament.\nAmong them, Manchester United legend Sir Alex Ferguson posed for photos alongside face-painted fans while he enjoyed a continental meal in the sun.\nAnd even the usually-serious politicians made the most of the festivities, with First Minister John Swinney and Westminster SNP leader Stephen Flynn enjoying a pre-match beer in a bar on Marienplatz square.\nElsewhere, former First Minister and current leader of the Alba Party Alex Salmond was spotted taking part in the festivities as he posed up with other Scotland fans while eagerly brandishing a bottle of scotch whisky. He was later seen joining other members of the Tartan Army in a football chant before lighting up a cigar amid a huge crowd.\nScotland played in Euro 2020 but that was held in several different countries and there were also travel restrictions due to the pandemic.\nBefore that, their country had not qualified for a major tournament since the 1998 World Cup in France.\nAn 'urgent' update on Muenchen, the city's official portal, to supporters in the Munich area\nScotland fans pose with a flag outside the stadium tonight\nA pair of Scotland fans, including one in a tartan hat, prepare to cheer their team on in Munich\nScotland fans tuck into pints in the stands of the stadium as they get ready for their country's opener against Germany tonight\nScotland fans wave flags and sing songs outside the Munich Football Arena this afternoon\nA pair of Scotland fans lift up a knitted football doll as they pose for a photo outside the stadium\nScottish bagpipe players entertain fellow football fans at Marienplatz in Munich this afternoon\nThousands of Scotland fans get ready to watch the match tonight against Germany on a screen at Olympiapark, Munich\nScotland supporters soak in the sun in Munich this afternoon ahead of the match against Germany\nFootball fans pictured at Olympiapark in Munich today ahead of the opening match of the Euros\nScottish fans wave scarves as they get ready to support their country in tonight's curtain raiser in Munich\nScots pictured outside the Munich Football Arena ahead of tonight's fixture against Germany\nScottish and German fans get checked by police as they file into the Reichstag fan zone in Berlin to watch the match\nScotland fans pictured in the team's kit with the Munich Football Arena in the background, where this summer's Euros kicks off\nA Scotland fan waves the national flag in a sea of football supporters at the Olympiapark in Munich this afternoon\nOne Scottish fan is pictured in his kilt as crowds pour into the venue this evening to watch the opening game of the tournament\nTwo Scotland fans wave a flag outside the stadium in Munich which will host tonight's curtain raiser\nA pair of Scotland fans at Olympiapark grasping pint glasses as they get ready for tonight's match\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGerman fans dressed in tartan kilts as they get ready to cheer their side on at the opening game of their home tournament\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nThis is also the first time Scotland have played a European Championship match abroad since 1992.\nIn raucous scenes captured live on German television, one fan's genitals was exposed when his pals lifted up his kilt.\nThe presenter on Welt TV was left aghast as his penis was revealed to viewers at about 8pm last night. The man was wearing a Germany shirt but it was not immediately clear who he was supporting.\nThe group - who also planted a sticker on the head of the presenter, Welt chief reporter Steffen Schwarzkopf - were among tens of thousands of members of the Tartan Army who flocked to Germany to have a party and cheer on their heroes.\nMailOnline has translated what Mr Schwarzkopf told viewers in German, which was: 'Really, really traditional, I would say. I'm not just talking about their football jerseys, but naturally also about the Scottish skirts, the kilts, that are worn here.\n'They are part of it. What is surely also part of it is the beer. But what I also see relatively often - I won't necessarily wear this to the game tomorrow [as the reporter points to the Scotland sticker a fan stuck to his shirt] - what I also see and think is quite pretty is the Germany jersey on top and the Scottish kilt on the bottom.'\nA fan then pulled up the kilt to reveal the man's genitals, and the reporter said: 'Oh my God.' He then said the shirt and kilt mix 'shows a little bit what the mood is like here and it is, in the end, a pure advertisement for Germany what we can see here'.\nA later report on the Welt website said the presenter 'mingled with the kilt-wearers who had travelled there in a celebratory mood - and gained some deep insights'.\nElsewhere in the football-mad city one cheeky fan revealed he had sneaked off to watch the game while his wife was distracted shopping in Marks & Spencer.\nA man is seen on the TV station Welt wearing a Germany shirt and a kilt in Munich yesterday\nOne of the Scotland fans then lifts up the man's kilt and exposes his genitals live on television\nWelt chief reporter Steffen Schwarzkopf says 'oh my God' after the fans lift up the kilt last night\nThe Scotland fans were in a raucous mood as they had a party in Munich yesterday evening\nThe fans also put a sticker on the shirt of Welt chief reporter Steffen Schwarzkopf in Munich\nA cheeky Scotland fan has revealed how he sneaked off to Euro 2024 while his wife was shopping to join the Tartan Army's raucous partying in Germany\nSpeaking to the BBC about his sneaky trip to the continent, the white-haired Scottish scamperer said: 'My wife doesn't care I'm here.'\n'So how have you managed to get here without your wife knowing,' the reporter asks the Tartan Army fanatic. 'She went out shopping - she went to Marks & Spencer and I sneaked out,' replies the man, before bursting out laughing.\nThe good-natured celebrations have even prompted old enemies to reconcile - spoon-bender Uri Geller recieved more than 11,000 letters of hate from Scots fans after he ruined their chances at Euro 96 by moving the ball with his mind.\nBut, speaking today to MailOnline, he would use his mystic powers to spur Scotland to victory - although he admitted that even he is 'not a miracle worker'.\nThousands more are watching from home as Scots try to will the national men's football team on to victory as they kicked off against Germany in tonight's Euro 2024 opening match.\nThe game in Munich is the first of 51 to be played over the next month to decide the next European champions, with the final at Berlin's Olympic Stadium on July 14.\nOne hilarious video showed a plane full of Scots on the way to Munich - with one lone woman with her headphones on in the middle, looking thoroughly miserable.\nOne hilarious video showed a plane full of Scots on the way to Munich - with one lone woman with her headphones on in the middle, looking thoroughly miserable\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nIt comes after some outlets in Munich ran out of beer earlier this week - including Woerners' bar in the city's Marienplatz, just hours after some had fans arrived.\nAt London Heathrow Airport this morning, Scotland fan Cameron Moffat, 30, told MailOnline that he was excited to be flying to Munich.\nMr Moffat, who turns 31 tomorrow, said: 'It'll be a bit of a party. First to Munich and then me and my pals are out to Cologne as well.\n'It's a bit expensive but it's not happened for a wee while. I'll see the sights but I imagine it'll be too busy to do anything - plenty of the Tartan Army out there.\n'I have tickets to the Switzerland game but the opener was unaffordable. The Olympic Park fanzone is where we're aiming for. Come on the Scots.'\nAlso at Heathrow today was Scotland fan Ian, 62, who met fellow supporters Alan and Dan on the way to the airport.\nHe said Scotland had a 'very good' chance at the competition and thought there would be a big upset against Germany tonight. 'It's a big one,' he told MailOnline. 'They should be careful what they wish for.'\nGermany are third favourite to win the tournament behind France and England and while the odds appear to be stacked heavily against Scotland beating them, many supporters have been hoping their side can take something from tonight's game.\nScotland have never beaten Germany in a competitive fixture and have won only one of their last nine matches - a 2-0 friendly win over minnows Gibraltar at the start of the month.\nTheir fears for tonight's result sunk even lower today after Ludwig the psychic sausage dog predicted that Germany would be victorious - picking Portugal as tournament winners.\nKnown as the 'Dachshund Oracle', Ludwig was offered three small bowls containing his favourite chicken treats.\nTo determine the result, he was tasked with choosing one of three bowls - one was adorned with the German flag, one with the cross of St Andrew and one with both together, in case there was a draw.\nLudwig did not hesitate in going to the German bowl, his decision serving as a potential indicator of tonight's match winner.\nBut Scots may still hold out some hope as the pampered pooch is still proving his mettle in the competition - and he is, after all, from Germany himself.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nFans arrived in Munich earlier determined to enjoy the game whatever the result - with many packing bottles of Buckfast in their luggage and many were drinking it in the city square ahead of tonight's match.\nOne TikTok video under the account 'thebuckiebus' showed a car loaded up with boxes of Buckfast bottles, with the caption: 'Jam packed and Germany bound!'\nBut not everyone got to finish their bottle – with fan Craig Ferguson accidentally dropping and smashing his on the ground during a live interview on Sky News.\nAsked by reporter Rob Harris for his prediction for the Germany match, Mr Ferguson – who has a ticket - began to speak when the bottle slipped out of his hands.\nAs the crowd gasped, Mr Ferguson – who had spent 41 days walking to Germany from Glasgow to raise money for charity - said: 'Sorry, I'm so sorry mate.'\nThe 20-year-old, who has raised more than £60,000 in aid of men's mental health and suicide prevention, had been handed a Buckfast as he arrived in Munich.\nBut after he dropped the bottle in front of the onlookers, Mr Harris reassured him: 'Many more drinks to come.'\nSpeaking to a packed media conference at the Munich Arena yesterday evening, manager Steve Clarke said every one of his players was 'desperate' to be picked to play in tonight's clash.\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nGermany fans play football at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans pose with a football at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\n'Everyone is fully fit, flying, desperate to be selected and ready to go,' he said.\n'The enormity of the opener, however, is a bit of a sideshow and hopefully we don't get too involved in that.\n'It's a difficult game. One of the mantras I've always had is respect everyone and fear no one.\n'We have respect for the host nation, we know they're a good team but hopefully we can show everyone we're a good team as well.\n'I can enjoy it. I've been lucky enough to be involved in big matches, the Champions League final for example, it was nice to be involved in the last Euros.\n'I can enjoy it, but I'll enjoy it even more once we've got four points on the board.'\nIt is the second successive Euros for the Scots under Clarke and he said: 'I think we should all be proud that we're here.\n'It's been a long time since 1998 when we actually travelled abroad to appear in a tournament like this.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nA Scotland fan plays the bagpipes at a train station in Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland and Germany fans pose for a photo with a replica trophy at Marienplatz square today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fan Cameron Moffat, 30, at London Heathrow Airport today on his way to Munich\n'That's why everyone is so excited. We're proud we've been able to do back-to-back European Championships and hopefully by the end of this we'll be even more proud at having done something a little bit more special in regards to Scottish football.'\nAsked about Germany, who are unbeaten in four games this year after an unconvincing 2023, Clarke said: 'They're a good team, I think people were trying to talk them down a little bit.\n'I think Julian Nagelsmann found, like I did, it takes a while to find your best squad and team formation.\n'When the draw was made I expected it to be a tough game and nothing has changed my mind.'\nClarke admitted the invasion of the Tartan Army will 'give us a big boost'.\nThe former Kilmarnock and West Brom boss added: 'They're going to be behind us in every minute of every game and that's really important for us.\n'We've had a little taste of it already at our base in. I'm sure there will be a few around in Munich tonight that we won't see. We hope they will enjoy themselves and behave themselves.'\nThe team were accompanied on their trip to Europe by their stunning wives and girlfriends as they jetted off to Munich Football Arena.\nThe Euros 2024 is set to kick off tonight but all eyes are on the SWAGS as they settle in to Munich, Germany (pictured: Cam Reading in Munich ahead of the Euros 2024 opener)\nSWAGS include Laura MacFarlane (pictured centre right) who recently married Greg Taylor in a lavish ceremony in Ibiza earlier this month\nJack Hendry's model girlfriend Robyn Keen has already hit the friendly skies ahead of the big match\nFootball fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans wave flags pre-match today\nGermany fans pose at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nA Scotland fan plays the bagpipes after disembarking from a train in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nThe women – dubbed 'the SWAGs' – include Celtic defender Greg Taylor's wife Laura Scott, John McGinn's wife, social worker Sara McGinn, and midfielder Ryan Christie's fiancée Georgie Bell.\nJack Hendry's model girlfriend Robyn Keen has already hit the friendly skies ahead of the big match.\nMeanwhile Scott McTominay 's new flame Cam Reading has shared fun updates from the German capital and doesn't appear to be slowing down.\nElsewhere Greg Taylor's wife Laura MacFarlane has showed herself having a swell time in Munich with a group of pals.\nFirst Minister John Swinney, who is at the match, told Holyrood during First Minister's Questions yesterday it was 'great to see Scotland back in Europe where we rightly belong'.\n'As First Minister I want to wish Steve Clarke's team the best of luck and wish the huge numbers of Scotland supporters making the journey a safe and memorable trip,' he said.\n'I know the Tartan Army will be an absolute credit to Scotland. I know the team will be a credit to Scotland because they have inspired so many of us by their success in getting to Euro 2024.'\nScottish Conservative leader Douglas Ross, Scottish Labour leader Anas Sarwar and Scottish Liberal Democrat leader Alex Cole-Hamilton also wished the team good luck ahead of kick-off.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nCaptain Andy Robertson said he wants Scotland to achieve 'legendary' status by reaching the knockout stages of Euro 2024.\nScotland sides have played at eight World Cups and three European Championships without being able to get past the first stage.\nSteve Clarke's side reached the 2020 Euros - the first major tournament for the country since the 1998 World Cup in France - but again fell short by losing to Croatia and the Czech Republic either side of a goalless draw with England at Wembley.\nLiverpool left-back Robertson, who revealed he is in a good place physically and mentally after a scare in training on Monday, was bold in his ambitions at a media conference at the Munich Arena yesterday.\nHe said: 'The first Euros was massive for us, now we want to compete. Last time we felt in the England game we did pretty well but let ourselves down in the other two or thought we could do a bit better.\n'We don't want to have any regrets this time. What's the worst that can happen? We go into a long list of teams that have failed to make it out the group so let's start from that point and move on from it.\n'We believe we can be the team to make history. We have put ourselves in a good position by qualifying first and foremost and let's see what we can do.\n'We're excited by the challenge, we're excited about what's ahead and if we perform the way I know we can perform then I'm confident we can make history.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans at the Marienplatz in Munich today ahead of tonight's match with Scotland\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes after disembarking from a train in Munich today\nA Germany fan on an escalator in Munich today ahead of the match with Scotland tonight\nGermany fans play football at Marienplatz square in Munich this morning\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans at the Marienplatz in Munich today ahead of tonight's match with Scotland\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScottish supporters (left to right) Ian, Alan and Dan head out to Germany from Heathrow today\nScotland fans at Glasgow Airport this morning as they head to Germany for Euro 2024\n'We know what is at stake. As I said, what's the worst that can happen? You join the list of good Scotland teams that failed to make it out the group.\n'The flipside to that is we can be the first team to do that.\n'We have lots of incentives to do well but that is the main one, to become a legendary squad, the first team to make it to the knockout stages.\n'That is driving us forward but we are in a difficult group and we have to be at our best to have a chance of doing that.'\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl\n- Moment driver veers to target e-bike riders before killing teen\n- Chilling police interview of ISIS fanatic plotting UK attack",
  "word_count": 6042,
  "scraped_at": "2026-02-14T01:48:52.512278",
  "_text_extracted": true
}