{
  "article_id": "226c35cbee00",
  "url": "https://www.justarsenal.com/arsenal-v-brighton-review-tough-point-earned-after-declan-rice-red-carded/374745",
  "title": "Arsenal v Brighton Review - Tough point earned after Declan Rice red - carded",
  "date": "20240831T183000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We had yet another must win game at home to unbeaten Brighton, and the only change from Villa was Trossard starting against his old side.\nArsenal started purposefully and went straight in the attack, but with a few stray passes which dampened our pressure, but Raya didnt have much to for the first 15 minutes except for a couple of weak efforts from the Seagulls.\nThe 17th minute saw out captain Martin Odegaard given a gilt edged chance just a few yards out but didnt catch it right and the keeper easily saved it.\nThe next 20 mins saw 80% possession for the Gunners before Brighton had a small flurry of action in our half. A few minutes later and there was panic in the Arsenal box as a headed clearance mistake from Havertz saw the ball land at Mitoma’s left foot, but luckily he scuffed his shot.\nIt was not long after that a a bit of brilliant skill from Saka saw him send the ball over the defence to a running Havertz, who calmly lobbed the ball over the keeper to give us a well deserved lead.\nThere was only 7 minutes left in first half but enough to see Rice get a yellow card for a late tackle, and one for Partey who wasnt happy at being wrong footed..\nThe second half continued with the feisteness and just a few minutes in and suddenly Declan Rice gets his second yellow card after kicking the ball away after his first foul, despite getting a boot in the shins for his trouble. That looked dubious to me, and then we had our noses rubbed in it when Joao Pedro got the equalizer straight away.\nCalfiori was brought on for Trossard to shore up the defence but Brighton were on the front foot and nearly scored again with our defence in disarray.\nThe next 15 minutes saw the Seagulls in control with Arsenal trying to force a way through despite being a man down.\nThere were battles all over the pitch with fouls going in everywhere and Timber was the next name in the book.\nMartinelli was brought on, surprisingly replacing Odegaard, and suddenly we saw Havertz break into their box but the keeper got a foot to it and Sakas follow up was also blocked. Seconds later Havertz and Saka combined again but our starboy fluffed his golden chance to take the lead.\nTimber got a knock with ten mins to go and Zinchenko came on in his place, with the game still hanging in the balance.\nBoth sides were looking for a break but BHA had the lions share off the ball. It looked like Arteta had decided to try and hold on for a point with the Seagulls shooting from everywhere.\nThere were six added minutes to endure as Raya made a great and brave save in his box as Brighton kept up the pressure.\nI’ve lost count of the cards being given as we approach te whistle, but we managed to hang on for the point.\nA tough game indeed, but both sides remain unbeaten….\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 593,
  "scraped_at": "2026-02-14T01:51:48.866197",
  "_text_extracted": true
}