{
  "article_id": "227663f0b44f",
  "url": "https://www.caughtoffside.com/2024/10/23/ben-chilwell-transfer-dortmund/",
  "title": "Euro giants eyeing Chelsea star for January transfer window , Blues very keen to sell",
  "date": "20241023T064500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Borussia Dortmund are reportedly showing an interest in the potential transfer of Chelsea left-back Ben Chilwell, while they also have Bournemouth’s Milos Kerkez on their list in that position.\nDortmund could probably do with signing a new left-back after they had Ian Maatsen on loan from Chelsea last season, though the Dutchman didn’t end up staying with the club this summer, instead moving to Aston Villa in a permanent transfer deal.\nIt now looks like the Bundesliga giants could try raiding Chelsea again, however, with Chilwell in their sights as the Blues are very keen to let the England international go, according to Team Talk.\nChilwell could end up being a fine signing for Dortmund or other top clubs, but the big question mark will be over his fitness, as he’s had numerous injury problems during his time at Stamford Bridge.\nStill, if Chilwell can stay fit and get back to his best, it’s easy to imagine him being an asset for a club like Dortmund, while there would also surely be options for him at other big clubs.\nBen Chilwell transfer: Could Man United still be in the running?\nCaughtOffside have been told that Chilwell is also still on Manchester United’s list of left-back targets for this January, so it could still be that we’ll see him stay in the Premier League.\nMan Utd could do with Chilwell as an upgrade on the injury-prone and inconsistent Luke Shaw, though one imagines Chelsea would rather sell the former Leicester City man abroad if possible.\nDortmund might also be seen as a more tempting option for Chilwell, who’d get the chance to play Champions League football there, whereas United are only in the Europa League and enduring a difficult season under Erik ten Hag, whose long-term future as MUFC manager remains in some doubt.",
  "word_count": 303,
  "scraped_at": "2026-02-14T01:57:46.243628",
  "_text_extracted": true
}