{
  "article_id": "22add1a30841",
  "url": "https://www.uefa.com/returntoplay/news/0282-184524672186-2ce00254e159-1000--patience-pays-off-for-zwayer/",
  "title": "Patience pays off for Rotterdam referee Zwayer | Inside UEFA",
  "date": "20230616T221500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Patience pays off for Rotterdam referee Zwayer\nFriday, June 16, 2023\nArticle summary\n‘Good things come to those who wait,’ as the saying goes. A career path that began at the tender age of 13 will reach a new peak for German referee Felix Zwayer when he takes charge of Sunday’s UEFA Nations League final.\nArticle top media content\nArticle body\nThree decades of refereeing will doubtless stand the 42-year-old Berlin-born match official in good stead when he manages the crunch encounter between Croatia and Spain at the Stadion Feijenoord in Rotterdam – and Zwayer is confident that he is in prime shape to handle one of European national team football’s biggest occasions.\n“I’m extremely happy that UEFA has put its trust in me, and I feel that I’m ready for this match,” he told UEFA.com.\n“It’s a big game, the latest in a series of finals that have been taking place in recent weeks. I’m very proud to have the chance to hopefully perform as well as the referees that have taken charge of the other finals.”\nEarly fascination\nZwayer has travelled a long road in refereeing, setting off on his adventure just as he entered his teens. “I was a player, and I attended an indoor football tournament,” he recalled. “I was immediately fascinated by the two guys who were in charge of matches. I went straight home and told my parents that I wanted to be a referee.”\n“I started doing research and found out that the minimum age to become a referee at this time was 14. I was disappointed at this because I still had a little time to wait. My elder brother had already reached that age, and he had started refereeing. I wrote a letter to my local federation asking about the possibility to start a little earlier. Happily, they accepted my request – and I was hooked immediately.”\nZwayer’s path that would eventually lead him to the top began with youth matches before he graduated to refereeing adult football games at the age of 17. He rose gradually through the amateur and semi-professional ranks, arriving in Germany’s second division in 2007. Two years later, the door opened onto the German top-flight Bundesliga, and his international badge followed in 2012.\nKey domestic and international assignments have followed over the years, including the 2018 German Cup final between Bayern Munich and Eintracht Frankfurt – doubly special because the match took place in Zwayer’s hometown Berlin’s Olympiastadion, as well as on his 37th birthday.\n'You must nurture your own style'\n‘Be yourself’ is Zwayer’s recipe for success. “You must nurture your own style and be able to fit your refereeing to your personality,” he said. “And in developing your own style, it’s important that you have people around you who believe in you and are ready to support your development along your career path. You move step by step and set goals when it’s necessary.”\nHe agrees that being a referee provides crucial tools to deal with life and its various facets. “All the skills you learn as a referee can be used in your private life and your job,” he emphasised. “I’ve been able to make good use of all the experiences I’ve had over 30 years.”\nZwayer deploys such skills in professional life outside of football as a real estate manager in a company that he owns with three partners. “I do enjoy the chance of going to our office and being involved in this other part of my life,” he said.\nTeamwork takes priority\nZwayer will be accompanied in the Netherlands on Sunday by assistant referees and compatriots Stefan Lupp and Marco Achmüller, as well as fourth official Ivan Kruzliak (Slovenia). The video assistant referee (VAR) team will be headed by Marco Fritz (Germany), alongside two assistant VARs, Sven Jablonski (Germany) and Stuart Attwell (England).\n“It’s not possible for a referee to officiate on his own. Given all of the decisions that have to be taken in a match, you need your team alongside you,” Zwayer reflected. “And referees’ teamwork is not just a matter of taking decisions – it’s also about giving each other confidence, advice and support in difficult situations. You must all be on the same wavelength.”\nThe experienced referee team for Sunday’s encounter in Rotterdam began their preparations for the final well in advance. “We studied the teams in the semi-finals,” Zwayer said. “Players, performances, tactics, all possible aspects – this means, for example, that we’ll be fully aware of what might change for a team between the semi-final and the final.”\n“I actually love to go to the stadium for the pre-match training session. You get used to the venue and its environment, the people working there, the facilities. It means that as you get closer to the kick-off on the day, you’re already tuned in about what to expect.”\n“Then, in the dressing room, my assistants and I will prepare for the match in whatever way is best for each of us. We know each other extremely well because we’ve worked together for a long time. Each of us knows how the other is feeling or what to say at a given moment. I personally like to put on headphones and listen to music in the dressing room – and that’s also because my colleagues don’t particularly like the music that I like to listen to!”\n‘Joy, pride and passion’\nWhile sharpening his focus on the duties ahead, Zwayer will be determined to enjoy the instant as Sunday’s kick-off becomes imminent. “When you line up with the teams,” he said, “It’s important to feel the joy, pride and passion, to savour the achievement of being there. I know that I will also think of my family, because they always give me the strength to do my very best.”\nQuality time with his wife and their two daughters aged five and two helps Zwayer relax at home. A lover of all sports, a keen badminton player and an enthusiastic cook, he also appreciates a wide range of music – and particularly relishes the special atmosphere of open-air concerts. “They’re very similar to big football matches in many ways,” he explained. “A large audience, the atmosphere building up, the anticipation of a special moment to come…and then the performance finally happens.”\n‘No doors are closed’\nThe assignment for Sunday’s final at Rotterdam’s famous ‘De Kuip’ is helping Felix Zwayer envisage new horizons while keeping his feet firmly planted on the ground. “You never know what’s going to happen,” he said. “It’s important to go from match to match. I’ve had good times and bad times as a referee, but I’ve always managed to bounce back after disappointments.”\n“When you get to high levels as a referee, you dream of taking part in major tournaments, and there’s a big event just around the corner – EURO 2024 in my country next summer. I will continue to do my best and give my all, and I hope that my performances might make me one of the candidates for selection.”\n“The appointment for the Nations League final is definitely an important step for me – because it shows that no doors are closed to me for the future…”",
  "word_count": 1207,
  "scraped_at": "2026-02-14T01:53:41.885624",
  "_text_extracted": true
}