{
  "article_id": "22b814a0e151",
  "url": "https://theathletic.com/5035508/2023/11/07/fantasy-premier-league-tips-fpl-injuries/",
  "title": "Fantasy Premier League tips : How to deal with FPL injuries before internationals",
  "date": "20231107T133000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As far as Fantasy Premier League weekends go, Gameweek 11 was a rough one — not least because of the number of injuries.\nWe saw the highly owned Erling Haaland and Dan Burn substituted at half-time with injuries — and these are only the standout names.\nSo how should we deal with injuries in FPL and why is the upcoming international break significant?\nAdvertisement\nHaaland among injured attackers\nThe most significant fitness problem of the weekend came at the Etihad Stadium, where Manchester City’s Haaland (£14.0m) delivered just two points before his substitution. Nearly 6.5 million FPL managers had captained him.\nPep Guardiola hasn’t ruled him out of the midweek Champions League tie against Young Boys or the trip to Chelsea on Sunday.\nThe City manager rarely gives much away about his players’ availability in press conferences and Haaland’s involvement in Gameweek 12 may hinge on whether he is fit enough to train before the game. This is an issue as information may not be available by the deadline.\nHowever, we may find clues elsewhere on his fitness, including pictures of him in training. If he is selected in the Norway squad for their matches against the Faroe Islands and Scotland, that would also suggest he will be not out for a prolonged period.\nAccording to Transfermarkt, Haaland has never missed a game due to an ankle injury, so this is not a recurring problem. Given the information we have, he’s likely to be a hold.\nUnless you are worried about being priced out of transfers, don’t make any moves until Friday evening or Saturday morning once we have the fullest possible picture of player availability from the press conferences.\nManchester City’s upcoming fixtures are trickier than usual — they sit third from bottom in the Fantasy Football Hub Fixture Analyser over the next four gameweeks.\nThey face Chelsea, Liverpool, Tottenham Hotspur and Aston Villa, but when fit, you can back Haaland to score against anyone.\nSome fantasy managers have taken a calculated risk to go without Haaland in recent weeks and haven’t been too badly punished. If you are chasing, then there is an argument for selling, especially with the looming Blank Gameweek 18 for the Club World Cup.\nAdvertisement\nAvoid using the armband on him in Gameweek 12 in case he does miss out and try to have a good first substitute in the wings. His Gameweek 13 fixture against Liverpool is almost three weeks away.\nOdegaard and midfield conundrums\nElsewhere, another Norwegian missed out altogether in Gameweek 11 — Martin Odegaard (£8.4m). Like Guardiola, we cannot trust Mikel Arteta to give us news in his press conference. He deceived us about Bukayo Saka’s (£8.6m) availability against Chelsea just last month.\nShould he be fit, Odegaard remains a sound FPL pick for Arsenal’s upcoming run of games against Burnley, Brentford, Wolverhampton Wanderers and Luton Town. They sit second in the fixture ticker over this period.\nSaka remains the best Arsenal asset, so the switch makes sense as a luxury move if you have no other issues in your squad, but if the pair continue to share penalty duties, then it diminishes the gap between them.\nSaka is also an obvious replacement if James Maddison (£8.1m) has a significant problem after being substituted on Monday night against Chelsea.\nGiven Spurs’ implosion in that game and their defensive injuries, mounting suspensions and upcoming tricky fixtures, it might be the perfect excuse to jump off Maddison anyway, particularly if you’re doubled up with Son Heung-min (£9.6m).\nAnge Postecoglou has been coy on his players’ availability, but if Maddison is fit, you would expect him to be named in the England squad, so keep an eye on that news.\nWith Spurs’ clash away at Wolves being the lunchtime kick-off on Saturday, we may find out whether Maddison has travelled for that game before the FPL deadline.\nReplacements needed in defence\nAn injured Haaland is just the beginning of some FPL managers’ problems. My squad is falling apart, with six further players flagged, including four of my defenders!\nAdvertisement\nBurn (£4.7m) and Matty Cash (£5.2m) both departed before the 60-minute mark in Gameweek 11 with injuries. They joined Sven Botman (£4.6m), who has been sitting on my bench with a long-term injury since the last international break.\nWith three defenders needed as a minimum each gameweek, some surgery will be required here. We should get an informative prognosis on Cash, who would be joining up with the Poland squad if fit during the break.\nAston Villa’s favourable fixtures continue in the next three gameweeks, with Cash remaining one of the most attacking defenders in the game this season.\nNewcastle United’s Botman and Burn have the longest return-to-play schedules, so the recommendation is always to replace the players who will be most likely to be absent for the longest period.\nThe options in the budget defender price bracket aren’t the most enticing, but the obvious replacements may be right in front of us: Jamal Lascelles (£4.0m) has already proven to be a viable replacement for Botman, with three clean sheets in five.\nThe long-term injury for Burn could see Trippier move to the left flank and a run in the side for Tino Livramento (£4.3m), too. Keep an eye on the tactical setup in the Champions League this midweek against Dortmund.\nThe turn in Spurs fixtures, plus the defensive suspensions, means it’s time for Cristian Romero (£5.0m), Micky van de Ven (£4.7m) and Destiny Udogie (£4.8m) to make way, too.\nWe should note that Crystal Palace have kept four clean sheets in the last six gameweeks. Joachim Andersen (£5.0m) is the pick of the bunch, with two goals and an assist this campaign.\nTyrick Mitchell (£4.6m) is a viable alternative with Palace topping the fixture ticker over the next four gameweeks.\nAlternatively, goalkeeper Sam Johnstone (£4.6m) could be the ideal replacement for anyone who has Mark Flekken (£4.5m) or Neto (£4.5m) (both injured) in their squads, or the out-of-favour Matt Turner (£4.1m).\n(Top photos: Getty Images)",
  "word_count": 1002,
  "scraped_at": "2026-02-14T02:25:08.306210",
  "_text_extracted": true
}