{
  "article_id": "22bf2b970bb0",
  "url": "https://www.fourfourtwo.com/news/manchester-city-transfer-news-man-city-in-eye-watering-raphinha-bid-to-rebuild-attack-report-barcelona-signings-rumours-gossip-paper-talk-mcfc",
  "title": "Manchester City in eye - watering bid for Barcelona star Raphinha : report",
  "date": "20250122T134500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City in eye-watering bid for Barcelona star Raphinha: report\nManchester City are looking to bring in-form Raphinha back to the Premier League, as Pep Guardiola spends big as he reshapes his side\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City want the in-form Raphinha from Barcelona, as Pep Guardiola continues to rebuild his team.\nThe Premier League champions have endured a tough campaign and are in a fight for Champions League football. After losing 2024 Ballon d'Or winner Rodri to a season-ending injury, Guardiola has suffered the worst run of form in his career, addressing the problems with new signings this January.\nAbdukodir Khusanov has signed from Lens and has the potential to help rebuild the defence, while a deal has been completed for Omar Marmoush, ranked at no.9 in FourFourTwo's list of the best strikers in the world right now.\nPep Guardiola's Manchester City spending spree could break huge records, with Raphinha targeted next\nTransfer expert Ben Jacobs told FourFourTwo exclusively that this January, Manchester City look like breaking the total spent by Premier League clubs overall this time last year.\n“It was £112 million spent by Premier League clubs last January: now Man City could be on course to surpass that,” he said on January 13. “The Kusanov deal is done; they still would like to add Vitor Reis from Palmeiras.” A £29.4m deal has since been confirmed by Sky Sports.\nNow, Fichajes have reported that City are readying a bid of £84m for Barcelona superstar Raphinha.\nRanked at no.5 in FourFourTwo's list of the best left-wingers in the world right now, the Brazilian has been reborn under new coach Hansi Flick and is 16/1 to win the 2025 Ballon d'Or. With Barça struggling with financial issues, a huge bid for the former Leeds United man might be tempting to fund squad improvements of their own.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nArsenal have been frequently linked with the winger over the years, while Chelsea were said to be in the race for Raphinha when he left Elland Road.\nHowever, speaking to FourFourTwo last year, Raphinha's agent at the time of his move to Catalonia, former Chelsea and Barcelona midfielder Deco, claimed that his client has already rejected other Premier League clubs in favour of the Camp Nou.\n“Actually, I didn’t push hard,“ Deco told FourFourTwo exclusively. “Leeds wanted to sell Raphinha.\n“Then bids came in, even bigger than Barcelona’s. The owner of Chelsea [Todd Boehly] called me and insisted a lot, putting pressure on me – he really wanted to sign Raphinha. The only thing was that the owner of Leeds had promised, in a desperate moment for Leeds, to sell Raphinha to Barcelona for a certain amount.\n“I did waive my fee because I thought Raphinha deserved to be happy where he dreamed of playing. He wanted to go to Barcelona, and Barça wouldn’t match Chelsea’s figures. It was an effort I made so that the player could be here.”\nThis certainly suggests that City would struggle to tempt Raphinha away from Spanish football – especially as he's been playing so well for the Blaugrana, who would probably look to sell a number of players before even entertaining a bid for their player of the season right now. This will be one to look at over the summer, but with City refusing over the years to be drawn into bidding wars, it may be a non-starter.\nRaphinha is worth €80, according to Transfermarkt. City take on Paris Saint-Germain as Champions League action returns tonight.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 770,
  "scraped_at": "2026-02-14T02:02:19.847654",
  "_text_extracted": true
}