{
  "article_id": "22c23821c79c",
  "url": "https://www.arsenal.com/news/invincibles-week-nine-wins-row-clinched",
  "title": "Invincibles This Week : Nine wins in a row clinched",
  "date": "20240318T113000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Each week, we'll reminisce about our incredible Invincible season 20 years on by looking back at what was going on at the club on and off the pitch, as well as remembering key news stories and the pop culture buzz at the time.\nLast week, Blackburn Rovers were beaten to extend our winning run to eight league games and continue to put pressure on the chasing pack. Bolton Wanderers would be next to visit Highbury as we tried to create a piece of top-flight history.\nSetting the scene\nHaving remained unbeaten in our opening 28 matches of the campaign, the game against the Trotters allowed us the chance to go level with Leeds United's 1973/74 team and Liverpool's 1987/88 side who held the record of the longest undefeated start.\nAiming to stop us from joining that illustrious group was Sam Allardyce’s Bolton, who sat comfortably in mid-table but on a five-game winless run and still reeling from losing to Middlesbrough in the League Cup final a few weeks previously.\nWenger’s words\nFollowing the Bolton game, our next five fixtures would see us tackle Manchester United and Liverpool in league action, a Champions League two-legged affair with Chelsea and a meeting with the Red Devils in the FA Cup semis. The magnitude of those matches wasn’t lost on Wenger.\n“This is a crucial stage of the season, but we know that we have the hunger, the required quality and at the moment we have a good togetherness,\" he wrote in his programme notes before the Bolton game. \"I always think that it's terrible not to have pressure at this stage of the season, but fortunately we find ourselves in this type of situation with positive pressure, and we've shown in the past that we can handle it well.\n“The next few weeks are the most important of my career, and what makes me optimistic is that we have never gone into a period such as this in such a good shape physically, mentally and with this confidence. These are three important ingredients to be successful.”\nFrom the dressing room\nWith the PFA Player of the Year awards soon to be handed out, Dennis Bergkamop discussed whom he might vote for, seeing as he couldn’t select any of his teammates.\n\"A few of us have just been talking about Shaun Wright-Phillips, he's having a good year,” he said. “I remember a few games this season when he has changed the game. I'm quite surprised how well he's been doing, and as he's still young maybe he will win the young players' award.\n\"As for a surprise, outside the club I think Edwin van der Sar has had a good season, and has saved Fulham a lot of points. He's done well against us as well by the way. But really I don't think there is one name that immediately jumps out, apart from Arsenal players, of course.”\nOn the pitch\nGAME 29: ARSENAL 2-1 BOLTON WANDERERS\nMarch 20, 2004\nExquisite finishes from Robert Pires and Bergkamp were enough to keep us nine points clear at the top of the Premiership after another tense encounter with Bolton.\nAnything other than a convincing home victory looked unlikely once we had strolled into a two-goal lead after 24 minutes, but Allardyce’s team were nothing if not resilient. Ivan Campo hauled the Trotters back into the match and they threatened at the death to emulate the previous season's fightback against us.\nWith little room to manoeuvre, we were limited to long-range shots early on. Even so, Thierry Henry almost gave us a sixth-minute lead when Patrick Vieira slid the ball through to his compatriot 30 yards out. Henry turned, found a yard of space and clattered a fierce shot against the crossbar.\nFifteen minutes later the deadlock was broken. Edu found Bergkamp on the edge of the box and the Dutchman laid the ball off for Pires who curled an unstoppable shot into the top corner.\nThe goal ignited us as much as it rocked our opponents. Jussi Jaaskelainen was threatened from all angles and Bolton seemed ready to crumble. Another goal seemed inevitable and it duly arrived after 24 minutes. Pires sent Henry clear down the left-hand channel who squared for Bergkamp and the Dutchman crashed home a first-time shot.\nFive minutes before the break, Bolton though, reduced the deficit. We half-cleared a corner only for Bruno N'Gotty to volley the ball back into the box. It fell for Campo and the Spaniard beat Jens Lehmann with a rising shot.\nStelios Giannakopoulos headed against the bar with stoppage time approaching as Bolton attacked with renewed vigour. What looked like being a rout suddenly looked less cut and dried for the Gunners and so it proved in a tense second half, but we held on to draw level with those legendary Leeds and Liverpool teams.\nLine-up: Lehmann, Lauren, Campbell, Toure, Cole, Gilberto (Ljungberg 69), Vieira, Edu, Pires (Cygan 88), Bergkamp, Henry. Subs not used: Stack, Kanu, Reyes.\nWhere we stood\nWhat the press said\n\"Arsenal are considered so far ahead of their rivals that, like Tiger Woods and Michael Schumacher, the talk is not of whether they will win but what records will follow as a result of their incredible victories.\" - The Observer\n\"Arsenal are becoming a statistician's delight as well as a football purist's.\" - Independent on Sunday\n'It should come as no surprise that a team who collect records as consistently as Best Mate wins Gold Cups, confirmed, with this victory, their place in next season's Champions League.\" - Daily Telegraph\nElsewhere this week\nThe first leg of our Champions League quarter-final with Chelsea ended 1-1, with Pires heading in an equaliser to cancel out Eidur Gudjohnsen’s opener at Stamford Bridge.\nSol Campbell revealed that he was in early talks to extend his contract at the club.\nJermaine Pennant saw his loan at Leeds United extended by another month. He had made 26 appearances and scored once by this point since arriving at Elland Road in August.\nImage of the week\nThe starting line-up from our game against the Blues pose for their traditional pre-match photo at Stamford Bridge. Having grabbed an away goal courtesy of Pires' 17th strike of the campaign and Marcel Desailly suspended following his late red card, Gooners would have fancied their chances of reaching the last four in the return leg at Highbury a fortnight later.\nWenger agreed, suggesting: \"We have a good opportunity. It was important for us to score a goal to come back. It was a great result for us. When we gave the goal away we needed to show a lot of character.”\nUK number ones\nOfficial top 40: Cha Cha Slide - DJ Casper\nAlbum chart: Call off the Search - Katie Melua (sixth week at no. 1)\nBox office: Starsky & Hutch\nIn the news this week\nLeeds United’s future was saved after a Yorkshire-based consortium completed a £25 million takeover of the cash-strapped club.\nCoca-Cola recalled its entire UK supply of bottled water Dasani after levels of bromate were found to exceed legal standards. It never returned to British shelves.\nChristopher Eccleston is announced as the ninth actor to play The Doctor in Doctor Who ahead of its reboot in 2005 after a 16-year hiatus.\nFind out what happened next as we attempted to become the first team to make it 30 matches unbeaten - against Manchester United no less\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1266,
  "scraped_at": "2026-02-14T02:10:47.912306",
  "_text_extracted": true
}