{
  "article_id": "22c29d2f7077",
  "url": "https://theathletic.com/4400966/2023/04/13/sevilla-manchester-united-europa-league/",
  "title": "Sevilla are a club in a state of chaos – on and off the pitch",
  "date": "20230413T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was almost 5pm at Sevilla’s Fibes Palacio de Exposiciones y Congresos on December 29 and Sevilla’s annual shareholders’ meeting was about to start.\nUp the steps and in through the glass doors strode former club president Jose Maria Del Nido Benavente, accompanied by his two sons Adrian and Miguel Angel. There were broad smiles and firm hand clasps as they were met in the foyer by friendly directors and supporters.\nAdvertisement\nTen minutes later, up the same steps and through the same door came current Sevilla chief Jose Castro, flanked by his fellow directors. Walking quietly beside Castro was Sevilla vice-president Jose Maria del Nido Carrasco — son of the former president and now a close ally of his father’s sworn enemy.\nInside, as Castro and his board took their seats on the podium, supporters of Del Nido senior chanted “out, out”. Voices were raised on all sides. As private security tried to calm the situation, Miguel Angel Del Nido shouted: “You are kicking out our family.”\nDel Nido senior did not hold back when it was his turn to speak from the floor.\n“You are the cancer of our club,” he said, pointing to Castro. “There is no doubt I will be Sevilla president again. Viva Sevilla!”\n“The cancer is you,” Castro replied. “You tried to trick your own son. You don’t care about Sevilla, you just care about yourself.”\nThe meeting led to no real progress in the bitter and personal battle for control of one of Spain’s oldest and most successful football clubs.\nMeanwhile, Sevilla’s team are stumbling through its worst season of the 21st century, with the next stop being Thursday’s Europa League quarter-final first leg at Manchester United.\nRaised voices and fighting between different factions have not been uncommon at Sevilla annual general meetings over the years. In the late 1990s, one aggrieved shareholder got everyone’s attention by waving a pistol in the air.\nDel Nido senior has been attending since his own father was a club vice president in the 1970s. After working as a lawyer for former Atletico Madrid owner Jesus Gil, he became Sevilla president himself in 2002, then oversaw the most glorious era in the club’s history. He then had to step down in 2013, having been jailed for the misappropriation of public funds.\nAdvertisement\nCurrent president Castro took over the position, representing a rival grouping of families. Since Del Nido senior was released from jail in 2017, he has openly and regularly tried to regain the position. But Castro has maintained power by careful management of the different blocks owning shares in the club, which since 2018 has included U.S. investors 777 Partners.\nA ‘pact of shareholders’ negotiated in November 2019 brought some peace by sharing board positions among the different families. Del Nido junior agreed to back Castro and became the club’s second-most influential figure. His father remained locked out, even though he was the biggest individual shareholder in the club (24% of shares).\n777 Partners, or ‘Los Americanos’ as they are known in Seville, were invited into the club by Castro and now own about 15% of shares. But they have since switched to back Del Nido senior’s attempt to return as president, as the current board has refused to hear their ideas for modernising the club’s off-pitch activities. The group, which owns other clubs including Genoa, Standard Liege, Hertha Berlin, Red Star and Vasco da Gama, has also complained of a complete lack of transparency over decision-making at Sevilla and is concerned about the club’s debt growing significantly, while the squad’s value has fallen dramatically.\nGiven the fluid shareholding situation and the possibility for shifts in alliances, there was plenty of tension going into the AGM. One tally in the local media said both Castro and Del Nido had the backing of 38% of club shares, so the many individual smaller shareholders held the balance of power.\nInside the large business auditorium, nine directors sat on a stage, including members of the Andalusian capital’s wealthy and influential Guijarro, Carrion and Ales families. Del Nido junior sat at Castro’s side, while his father and two brothers were down below.\nAdvertisement\nSome of those at the top table shifted uncomfortably as Sevilla’s director general Jose Maria Cruz detailed the club’s financial figures for the 2021-22 campaign, including overall losses of €24.8m (£21.8m, $27.1m).\nCruz pointed out these losses were €17m less than the previous year’s. But still, the overall picture was clearly negative. “These are losses which hurt, bad results which reflect the club’s situation,” he said.\nA majority of shareholders agreed and voted against approving the club’s annual financial report. However, the most important vote was still to come — a motion for the board to resign immediately.\nThis was defeated 63.5% to 21.4% after Del Nido senior was not allowed to vote through the use of a legal manoeuvre, based on that 2019 pact. The tactical victory for Castro was met by a mix of cheers and whistles from those assembled. But the board survived.\nDel Nido senior and his allies were never going to accept this defeat and immediately took a case to the local commercial courts. They want a judicial administrator appointed to oversee the choice of a new board. That attempt had an initial setback in February, but the legal process is continuing.\nA club source, speaking anonymously to protect their position, says that such legal battles will take years to conclude, but adds that the team has been sheltered from the boardroom battles.\nHowever, the evidence of the past 12 months suggests otherwise.\nSevilla were the only team to push Real Madrid in the 2021-22 La Liga title race. Then came a drift over the second half of last season and a disastrous summer transfer window has been followed by a historically awful 2022-23.\nJulen Lopetegui was sacked as coach in October after just one win in their first 10 games across La Liga and the Champions League. There was no substantial improvement under replacement Jorge Sampaoli — they fell down to the Europa League and remained close to the relegation zone domestically.\nAdvertisement\n“A total cleanout of the club, from the boardroom to the dressing room,” read a banner as more than 1,000 fans, gathered from different ‘pena’ official supporters groups, protested outside the stadium before the La Liga game against rivals Cadiz in late January.\nThere was more anger at the stadium after a Copa del Rey exit to Osasuna, then stupefaction at an appalling display in a 6-1 La Liga defeat at Atletico Madrid. The last straw for Sampaoli was a 2-0 defeat at relegation rivals Getafe, with his players having been either unable or unwilling to take on his complex tactical ideas.\nThat led to the hiring of a third coach of the season. Jose Luis Mendilibar is definitely not one to over-complicate things. The 62-year-old Basque has used the same direct style over two decades coaching at Athletic Bilbao, Valladolid, Eibar, Osasuna and Alaves. He has joined with a simple mission — avoid what would be a first relegation since 1999-2000.\nThat task is complicated by how the level of Sevilla’s squad has fallen over recent years. The transfer policy under Monchi’s two terms as sporting director, going back two decades, was to buy cheap, sell expensive, reinvest and repeat — with great success in cases from Dani Alves to Ivan Rakitic to Carlos Bacca. But that policy changed when they saw an opportunity to win what would have been only the club’s second La Liga title.\nSo in 2020 and 2021 they added older players like Papu Gomez, Erik Lamela and Thomas Delaney and brought Rakitic back from Barcelona. That has not worked out, and they were left with lots of ageing players on significant salaries with little or no resale value.\nLast summer’s transfer window was the worst of all. Departing central defenders Jules Kounde and Diego Carlos were not adequately replaced. Risky bets on mid-career players like Adnan Januzaj and Kasper Dolberg did not come off. Worst of all was the Isco fiasco — the former Real Madrid player lasted just six months of an expensive two-year contract.\nMonchi is an institution at Sevilla, working autonomously to build teams that won multiple Europa League trophies under both Del Nido senior and Castro, but he has been increasingly questioned in recent times.\nAdvertisement\nThe Andalusian always wears his heart on his sleeve and has been through an emotional rollercoaster over the past 12 months. After the recent Cadiz game, he confronted the referee at half-time, then cried inconsolably in the stands after Sevilla won thanks to a last-minute Rakitic penalty.\nPara los que no lo entendían, estas imágenes ayudan a entender las de Monchi mosqueao a pie de campo en el descanso. pic.twitter.com/kVNYkBWuwW\n— RafaVividor (@RafaVividor) January 22, 2023\nAll the stresses and strains have clearly taken a toll. In media interviews, Monchi has declined to say whether he will stay for 2023-24, while a club source speaking on condition of anonymity to protect their position told The Athletic this week that his future remains “up in the air”. Castro has also dodged questions over the issue.\nThe feeling at Sevilla that everything which can go wrong will go wrong continued in last Friday’s La Liga game at home to Celta Vigo.\nMidfielder Pape Gueye, a January arrival who has really made a positive impact, was shown a (very soft) second yellow in the first half. Mendilibar’s 10 men seemed set for victory when Marcos Acuna’s 30-yarder gave them a 2-0 lead on 81 minutes. But they still managed to concede two injury-time goals, dropping two more points which means they are only five points above the drop zone. Acuna then got himself sent off for dissent — their 11th red card in 28 La Liga games this season.\nThursday’s trip to Old Trafford offers a chance for respite and Sevilla know the Europa League is ‘their’ competition, having won it four times in the past decade. The main focus for the club is to avoid relegation and rebuild in the summer, but the two games against United are an opportunity for everyone to pull together. If Mendilibar’s side can stay in the tie at Old Trafford, the Sanchez Pizjuan will be heaving for the second leg.\nDel Nido senior’s latest legal case will be heard on April 18, just two days before that return against United. Everyone is aware that, whatever happens over the remainder of the season, the summer will bring big changes. Mendilibar is on a short-term contract until the summer. Swingeing cuts will be required to get the wage bill under control. Many players know they are not wanted, while others in the dressing room wonder if the Sanchez Pizjuan is still the career springboard it has been.\n“Sevilla are in the middle of a perfect storm,” says another source, who asked not to be named to protect relationships. “Everyone is more concerned with saving their own heads than with the situation of the team or the club.”\n(Top photo: Fran Santiago/Getty Images)",
  "word_count": 1852,
  "scraped_at": "2026-02-14T01:59:46.863238",
  "_text_extracted": true
}