{
  "article_id": "22de7f6a9431",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/jamie-websters-rough-nights-pubs-30651751",
  "title": "Jamie Webster  rough night in pubs before chance meeting",
  "date": "20241226T083000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Webster's 'rough nights' in pubs before chance meeting on flight\nThe Liverpool musician started on Merseyside's pub circuit and is now taking his songs around the world\nJamie Webster has had another astonishing year. The singer-songwriter released his third album, 10 For The People, in March and performed at festivals across the UK.\nThis included Glastonbury in June, which marked his third successive year performing at Worthy Farm. Jamie's biggest live show yet took place over the summer in Sefton Park where over 3,000 people watched him perform at In The Park, with a star-studded cast of extras including Ricky Tomlinson, Dave McCabe from the Zutons and Ian McCulloch of Echo and the Bunnymen.\nThe 30 year-old has also been taking his music across Europe and Australia, where he performed in Sydney, Melbourne, Brisbane and Perth this month. It’s a far cry from Jamie’s early gigs, which were done in pubs across Merseyside in between his job as an electrician.\nJamie used to pack up his car with a PA system and guitar and do everything by himself. The Pacific in Bootle was one of his regular destinations, which he remembers fondly despite some tricky situations he had to navigate.\nSpeaking previously to the ECHO, Jamie said: “The pubs was just covers, maybe one of two of my own tunes if I had the bol****s”. He also remembered one pub where “some of the lads used to try and fight with me and my mates”. On another occasion, a police raid disrupted the set.\nThis time was also where Jamie got some of his most pointed criticism. He said: “[There was this girl] and I thought she was going to go the toilet, but before she did she made a beeline right to my face and said ‘you're f***ing s***e’.\n“By the end of the night, her fella asked if I knew any Pink Floyd so I played ‘Another Brick In The Wall’, ‘Wish You Were Here’. He brought all his mates in, singing and dancing and she was left red faced all night.\n“I'll never forget that. I've played some of the roughest, readiest, rambunctious nights. It was a proper apprenticeship - my Hamburg years almost.”\nA few years later Jamie was performing at the Cross Keys and the Slaughter House in the city centre. He was also a big attraction at Boss Nights, which focussed on the chants and wider fan culture of Liverpool FC.\nHe said: “I’d drive into town and play the gig and then get in at 1-2 in the morning. The next day on Saturday, if I wasn't working for my dad, I'd be going and doing a job for one of my mates.”\nDuring this time, Jamie began to give up on making it as a musician full-time, and sought instead to earn enough money to follow the reds around Europe. Things changed when he flew out to Madrid to perform in the city before the Champions League final between Liverpool and Tottenham.\nOn a club flight out to the Spanish capital, he was introduced to Dave Pichilingi who was said to be helping with the production at events planned in the build up to the game. On the flight Jamie says the pair started talking about music, eventually showing Dave videos of his own songs.\nIt later emerged that Mr Pichilingi ran Sound City Festival and his own record label and passed his contact to Jamie to potentially get in touch when back in Liverpool. But after seeing Jamie play to thousands at the fan park ahead of the match, he’d received a message offering a record deal in principle almost instantly after coming off stage.\nJamie said Mr Pichilingi was confident he could cross him over to a more music orientated audience, steering him away from the football events where he’d made his name. “I’m forever in his debt as nobody else was knocking on the door. Not one person coming up to me [to ask about recording my own music].”\nHis first single, Weekend in Paradise, was released in 2020 after years being tested on the pub circuit. In a later ECHO interview, Jamie said his now wife Rachael stopped in her tracks when she first heard it.\nJamie said: “It's a surreal thing. I remember playing 'Weekend In Paradise’ in the pubs before it was released, and I used to do it to test the waters. I'd play it in between two big sing-along songs. I remember playing it in the Slaughterhouse one night, I think it was 2018, and everyone was dancing. They were clapping their hands, jumping up and down. A few mates of mine who were in there were singing the words.\n\"There were maybe about 20, 30 people. I remember at the end of the song, people running up to me, asking me who played that song, and who was that song by, because they thought it was a cover.\n“My wife, Rachael, I've been with her nearly eight years, so long before any single releases or anything like that. I used to write songs, as she sat on the couch or whatever. I always remember with ‘Weekend In Paradise’, she completely stopped what she was doing when I sang it to her. We were in a log cabin somewhere in the Lake District.\n“She stopped what she was doing and she was like, that is unbelievable. Rachael is my biggest fan along with my mum. For her to get so excited about something like that - they were all moments that you look back to.”",
  "word_count": 932,
  "scraped_at": "2026-02-14T02:14:55.042475",
  "_text_extracted": true
}