{
  "article_id": "22e04d90aa2a",
  "url": "https://www.fourfourtwo.com/news/new-tottenham-signing-reveals-there-are-many-more-spurs-fans-than-arsenal-in-north-london",
  "title": "New Tottenham signing reveals there are  many more  Spurs fans than Arsenal in North London",
  "date": "20250606T101500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe North London derby is a truly global affair these days but the streets of the capital are full of Tottenham Hotspur shirts according to Spurs’ latest signing.\nSpurs brought Austrian defender Kevin Danso in on loan in January and have exercised their option to purchase him outright for €25 million at the end of the 2024-25 season.\nDanso was a late substitute in Spurs’ Europa League final win against Manchester United and was blown away by the response of the supporters at the team’s victory parade after their victory in Bilbao.\nKevin Danso plays to the gallery\nThe Spurs defender has been discussing the Europa League win with Austrian media and said that the parade in North London was the moment that brought it all home.\n“That’s when I really realised that I’m a European trophy winner,” he told Kleine Zeitung, as relayed by Sport Witness.\nA victory parade might not be the most representative sample when it comes to understanding the social dynamics of a sporting city but Danso has been in the capital long enough to have learned how to get Spurs fans on board.\n“If you don’t live in London, you might not realise how big Tottenham is,” he said.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“Many people think North London is Arsenal. But in my opinion, there are many more Tottenham fans than Arsenal.\n“It was an incredible feeling to see how much joy we brought to the fans. Winning something with a club like Tottenham makes the feeling even sweeter.”\nStyria-born Danso, 26, played junior football for Reading and Milton Keynes Dons before graduating into the professional game at Augsburg in Germany.\nHe returned to England for a brief loan spell with Southampton just before the coronavirus pandemic and was sold to Lens in 2021.\nAnge Postecoglou took up the chance to sign him on loan in the January transfer window with Spurs’ injury problems growing and affecting them particularly badly in the centre of defence.\nThe Austrian featured in ten Premier League matches as Spurs gradually shifted their focus to their Europa League campaign.\nThey finished in a dismal 17th place but qualified for next season’s Champions League, where they’ll join the top five teams in England, as Europa League winners.\nDanso came on as a substitute in the final in Bilbao, replacing goalscorer Brennan Johnson with 12 minutes remaining.\nThe Europa League was the first trophy of Danso’s career and he apparently intends to celebrate by performing an Adele song at his official Spurs initiation.\n“She’s a Spurs fan,” explained the defender, who admits to being unable to sing despite owning a karaoke machine for some reason.\nSpurs meet Arsenal in a pre-season friendly at the end of July. The game in Hong Kong will be the first North London derby played overseas.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.",
  "word_count": 623,
  "scraped_at": "2026-02-14T01:58:41.957701",
  "_text_extracted": true
}