{
  "article_id": "22e2a5e9ea4a",
  "url": "https://www.twtd.co.uk/ipswich-town-news/45301/mckenna-a-really-good-day-for-us",
  "title": "McKenna : A Really Good Day For Us - Ipswich Town News",
  "date": "20230728T214500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Friday, 28th Jul 2023 19:22\nBoss Kieran McKenna hailed the Blues’ victorious Innsbruck Cup campaign “a really good day” and a “great experience”, Town having beaten RB Leipzig 1-0 and drawn 1-1 with fellow Bundesliga side Werder Bremen to carry off some pre-season silverware.\nThe 60-minute games complete the Blues’ pre-season friendly programme with the Championship season proper starting at Sunderland a week on Sunday.\n“Really good day for us, a really good exercise, pretty much exactly what we wanted, really,” McKenna said.\n“We wanted a tactical challenge of two ball-playing teams who were going to really test us, especially in our out-of-possession game, but on our in-possession game as well.\n“From a mental point of view, we were going to have to show resilience and character because the games wouldn’t all go our way and we were going to get 60 minutes into everyone in the squad and we were going to have to manage the game in a different way than we always have to do.\n“It was a great experience for all of those things. A great experience for the players and a good day.”\nThe game against Champions League qualifiers Leipzig, who finished third in Bundesliga last season, was different to Town’s previous pre-season matches in that the German side saw most of the ball, which McKenna says was the thinking going into the match.\n“That was the plan,” he said. “Preston and Luton were two really tough games but games where I would have thought we would have the lion’s share of possession.\n“But that’s not going to be the case every game this year and we need to have different strings to our bow and be adaptable and be able to work to different game plans, and be good on all moments of the game.\n“Today gave us a good chance to practice that, a big credit to the players because we didn’t really have any preparation time after Tuesday night, we just had some video meetings and had a game plan which was different for the two games and it was a great test of their ability to out and execute game plans against really good teams, and that’s an asset that we’re definitely going to need this season.”\nGeorge Hirst’s third goal in four friendlies won the the game but McKenna didn’t want to single out any particular player.\n“I think you could pick out so many individual performances today, so it’s probably not the time to speak about anyone individually, but the goal was really good,” he said.\n“We won the ball back high, a good cross from Leif [Davis] and George was a handful in the game and it was a really good header.”\nMcKenna disputed the suggestion that the different XI which took on Werder Bremen, 13th in the Bundesliga last season, took a while to find their feet.\n“I think we’ve got to be realistic, a couple of people have said that to me about the second game, but we were playing against a really good Bundesliga team,” he continued.\n“The players did really well in the first half but the other team are going to have the ball and have chances, and it’s going to be the same this year when we play top teams.\n“I’m not sure I really agree in terms of having to find our feet in the second game, it was just tough and it’s going to be tough this year and we need to get used to times when we’re not going to be dominant in the game.\n“And the players stuck at it really well, it was a long day, they’ve been in the stadium a long time, it was hot and they stuck to it really well, they never went under, we never stopped trying to play and we still had some good moves in the first half and some good moments. I was happy with the whole game.”\nReflecting on pre-season overall, he added: “It’s been good, it’s been hard work, staff and players, so credit to everyone involved.\n“We wanted to stretch the players and I think we’ve done that with the training block in the first few weeks and the games programme, especially the last 10 days.\n“It’s stretched the staff as well in terms of how hard everyone’s worked, but I think that sets us up well for the season.\n“A good pre-season doesn’t guarantee anything in the season but it’s much better than having a bad pre-season.\n“And I think we’ve had a good pre-season. The players have worked well, we’ve had lots of competitive minutes and we’re continuing to develop as a team, so it gives us the best chance that we could have given ourselves to start the season well.”\nThe Blues’ task now is to take that into the season proper, which he says can’t be taken for granted.\n“Exactly, and you don’t get too carried away,” he said. “Maidenhead played well against us in pre-season, so it’s pre-season, you don’t get too far ahead of yourselves.\n“But I think what I do see is that as the challenges get higher, the players are up for it. They feel like they want to take that next step as a team and the tougher the opponent, the more excited they are to go and challenge themselves, and I think that hopefully bodes well for the season ahead because we’re going to have to step up, and I think the players are really looking forward to the challenge.”\nMcKenna says he’ll get updates on Massimo Luongo (adductor) and Nathan Broadhead (quad) suffered knocks in the previous two friendlies, while keeper Christian Walton missed out today with a foot problem and Cameron Humphreys stayed behind remained behind due to concussion protocols having suffered a blow to the head at Preston.\n“Cameron should be training on Monday with his concussion,” McKenna said “Massimo and Nathan, we’ll see how they’ve got on in the last few days and Christian has a little problem with his plantar fascia, so we’ll have to see how he is next week.”\nHarry Clarke also wasn’t with the squad due to an achilles tendon problem which has been causing the right-back a problem since last season.\nAmong those to impress in the first match was Elkan Baggott and McKenna was asked whether the 20-year-old might be kept with the squad rather than sent out on loan as he said would probably be the case at the start of pre-season.\n“I think we’ll have those conversations with Elkan now that pre-season’s done because we’ve had a good spell of time with him,” he said.\n“I think he’s improved over the course of the pre-season, to be honest. I think in general, the players do improve when they spend time in this group with how the boys train, with the players around them and the way that the coaching staff are working with them. He’s improved even in the five weeks or whatever to this point.\n“He’s a young player, like a Cameron Humphreys, who we think has a future in the game and a future at the club and it’s about finding that next right step for them this season. Is that going to be staying with the group or is it going to be continuing to gain some more exposure to first-team football?\n“We’ll have those conversations with Elkan next week and reach the right decision for the club but also for the player because he’s someone we care about we want to keep progressing.”\nEarlier today, CEO Mark Ashton said he is anticipating two or three more signings this summer and McKenna says the areas where he wants to strengthen have been identified for some time rather than any decisions having made as a result of pre-season.\n“I think we’ve pinpointed that quite a while ago,” he continued. “But that ends the fixture part of pre-season, so it’s probably a good time to sit down now and have a look and I’ll get updated on where we’re at.\n“We’ve said all along we want to keep improving the squad but we’ve also said we’ve got a good group of players here with a chemistry and understanding, who are ready to go and try and compete next season.\n“It’s about bringing in the right players, who are going to add to the group so we need to be patient with that, we need to work hard, we need to make as good decisions as we possibly can and we continue to try and work in that logical way.”\nTown now have nine days before they make their long-awaited return to the Championship at Sunderland.\nMcKenna says the squad will have a bit of downtime before working on their preparations for the game.\n“We’ll travel tomorrow, so there’s a chance for the players to have a… I don’t know if you’d call it a weekend off, but we won’t be training,” he said.\n“And then we build into it next week. We’ll get a good training block next week to build up to the game, it’s going to be a long week with the game on the Sunday, so we’ll manage the load appropriately but I think the excitement’s going to build, not just for Monday but for the season ahead.”\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nEven if he can't answer a question directly, he still explains his thinking as far as he can, without giving anything away and gives context to the decision process, rather than just bat the question away and get tetchy like some of our previous managers.\nI cannot wait for the season to begin, but I must admit the injury worries are taking the shine of things somewhat for me.\nIt’s all to play for now. There may be some bumps along the way but I am so looking forward to the new season\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1684,
  "scraped_at": "2026-02-14T01:48:22.648922",
  "_text_extracted": true
}