{
  "article_id": "22f1733f3858",
  "url": "https://www.heraldscotland.com/news/23580928.celtic-champions-league-narrative-matt-oriley-isnt-buying/",
  "title": "The Celtic Champions League narrative Matt ORiley isnt buying",
  "date": "20230611T060000Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Last season’s Champions League campaign was a mostly chastening experience from Celtic’s perspective but Matt O’Riley can’t wait to do it all again.\nThe Danish international started all six games in different midfield roles, realising an ambition that was sparked from the moment he moved from MK Dons for what now looks like an absolute steal of just £1.5m in January 2022.\nA winless sojourn through a group containing Real Madrid, Shakhtar Donetsk and RB Leipzig was the sole low point in an otherwise stellar season for Celtic but for O’Riley, a self-confessed football anorak, that chance to test himself against some of the greats of the game was a moment to cherish.\nRetaining the Scottish Premiership title provides the club with automatic passage once more to the group stage and, assuming he doesn’t move on this summer, O’Riley will again be a key figure as they look to punch above their weight and try to compete with Europe’s elite.\n“I like watching football just because I like watching football,” admits the Hounslow-born player. “But there are always little bits when you’ve played at Champions League level where you look at it and wonder what you would do in that scenario.\n“Or a player does something and you think you might have done something different. There’s always some sort of analytical side of it for me. But at the same time I do just like watching good players playing. Just by watching you can learn from them.\n“I wouldn’t say there was a key battle [in the Champions League that stands out]. They’re all different tests to be honest. I played three times as a number 8 and three games as a number 6. So I played half and half in different positions. In the Champions League I probably performed better playing deeper.\nREAD MORE: Jindřich Trpišovský happy at Slavia Prague amid Celtic links\n“As a 6 in our team in Scotland, you’re usually up against a team with 11 men behind the ball and you have to break them down. In the Champions League the games tend to be a bit more stretched out. The 6 can get forward and be a bit more of a box to box player. I really enjoyed that aspect of it.\n“In terms of players I faced, there were lots of different challenges in the shape of guys like [Luka] Modric and [Toni] Kroos and then there was someone like [Mykhailo] Mudryk [formerly] at Shakhtar who was very direct. Those were the most enjoyable games for me in the season just because your levels were always pushed.”\nWatching the recent Real vs Manchester City semi-final did make O’Riley wonder about what might have been. But he refutes the notion that the last 16 is now unreachable territory for a Scottish side.\n“I find it tough to watch those games sometimes as I’m thinking, ‘we could be there if we’d performed better’. But obviously they deserved to be there more than we do as they performed better. I watch all of those games more from a learning perspective as I can see little bits from each one.\n“For example in the first leg between City and Madrid the tempo was actually really slow. That was probably because the players respect each other so much and know that if any mistake is made you’re going to get punished. We found that out ourselves.\n“I never see it that way [that Scottish clubs can’t progress beyond a certain stage]. Everyone on the pitch is a human being and you’ve all got a chance to win a football match.\n“Of course these clubs probably have more money but that doesn’t mean too much. We’ve signed a lot of players on cheap fees and they’re probably now worth ten times the amount. It’s all perspective and opinions. We just worry about what we do. I’m not saying we’ll win it – although we obviously could if it all went well – but if you perform well and don’t think too much about outcomes and expectations then you’ve always got a chance.”\nO’Riley is one of those whose value will have risen multiple times given his performances over the past 18 months. The 22 year-old has gone from being relatively unknown in League One to claim the most Premiership assists - 12 – in the season just ended.\n“When the team gets better and you naturally play better then your [individual] level should coincide with that if things are going well,” he added. “If you’re just generally a person who wants to improve and you live and breathe football – and I think I do that – then you should improve, especially given the right foundation that we have.\nREAD MORE: Brendan Rodgers on Celtic redemption trail as fans 'thaw' on ex boss\n“I knew I would get better as a player as the level was higher than at the club I was at previously. But I didn’t know what else to expect to be honest. I didn’t know the size of the club and the intensity of the fanbase. I didn’t realise when you went out on the street I would get recognised as much as I do. I wasn’t used to that at all, although I got used to it after a couple of months.\n“It was a big change but one that I really enjoyed as I’m actually playing for a club where it means so much to the people in the city and the fans. Naturally you want to do well for them as well.”\nO’Riley, speaking before manager Ange Postecoglou left for Tottenham Hotspur, hoped the crux of the squad would stick around and gave an insight into his own position this summer.\n“I’m very process-oriented in the sense that I’m learning a lot here and trying to perform well,” he added. “So I feel that I’m in a really good place to just continue to develop.\n“I don’t know what will happen this summer with outgoings and comings in. But if we do lose players then I’m sure the recruitment team will bring in good replacements as we saw in January and over the last 18 months or so. I’d say around 90 percent of the signings have been successful which is pretty rare in football. That shows the recruitment has been good.”",
  "word_count": 1060,
  "scraped_at": "2026-02-14T02:07:02.896867",
  "_text_extracted": true
}