{
  "article_id": "2301bf25e86f",
  "url": "https://www.fourfourtwo.com/features/best-french-players-ever",
  "title": "Best French football players ever",
  "date": "20231221T170000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Best French players ever\nThe list of world-class players to have played for Les Bleus is a lengthy one - but who tops it?\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nIt must be wonderful for French football fans to debate the country’s best ever players, for they have been truly spoilt over the years with a multitude of world-class performers in every position.\nOf course, we can’t talk about the best French players ever without discussing their long list of deadly strikers, but this is a country that has produced a wide range of different talents, including some of the best defensive players the game has ever seen.\nSo, without further ado, let’s get stuck in – Patrick Viera-style.\n32. Paul Pogba\nFor many, Paul Pogba will always be a bit of an enigma – a player that has delivered outstanding performances together with some pretty average ones. Manchester United fans rarely saw the best of him, while the four-year ban he received from the Italian Anti-Doping National Tribunal in February 2024, after he failed a drugs test, epitomised the career of a man who promised so much but only delivered on an inconsistent basis.\nHowever, that world-class talent and midfield powerhouse was still evident on occasion - most notably on the international stage. When on song, Pogba was simply unplayable. He always had game – just not the consistency.\n31. Nicolas Anelka\nNicolas Anelka always seemed to be on the move – club-wise, not necessarily on the pitch. That was one of the criticisms that he’d sometimes face – was he always up for it? On his day, however, this electric striker was unplayable, one of the reasons why so many clubs wanted a piece of him, including Real Madrid, Liverpool, Manchester City and Chelsea.\n30. Bacary Sagna\nThe number of world-class defenders to have represented France is remarkable – and you can include Bacary Sagna in this sizeable group. The former Manchester City and Arsenal star spent a decade shutting down attacks in the Premier League, those colourful dreadlocks bouncing as he jumped into tackles and made overlapping runs.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n29. William Gallas\nJose Mourinho summed William Gallas best when he said: “He’s the kind of player that when you have him in your squad, instead of having 22, you have 24 or 25.” Whether the former Chelsea and Arsenal man was playing on the right or the left, he offered more than just versatility – he was a leader who could raise the level of the whole team.\n28. Frank Leboeuf\nElegant is not a word you’d use to describe many of the central defenders in the Premier League during the 1990s, but this stylish defender was one of the first foreign players to really light up England’s top division in the middle of the decade. Calm on the ball, he had a thunderous strike, too, and he enjoyed a penalty.\n27. Patrice Evra\nThe combative left-back was a defining figure in Manchester United’s back four for almost ten years. As well as being reliable in defence, he caused many a problem for opposition defenders with his frequent venturing forward. His winning mentality and desire were two of his other great attributes, which made him one of the Premier League’s best ever defenders.\n26. Hugo Lloris\nHugo Lloris may have produced a howler in the World Cup final in 2018, but this fine shot-stopper has also made many a crucial save for his country, helping them to go deep into tournaments. It should not be forgotten that the Tottenham legend was regarded as one of the first keepers to become that sweeper-keeper that many would later follow.\n25. David Trezeguet\nStriker David Trezeguet's golden-goal winner to snatch the Euro 2000 title – that famous quick spin and shot – will be forever etched in France football history. The former Juventus forward was blessed with great pace and agility, and his keen eye for goal made him one of the country’s all-time leading goal-scorers.\n24. David Ginola\nDavid Ginola. A player blessed with movie star looks and style both on and off the pitch. On it, he had the lot: pace, strength, and a ferocious shot. The former Tottenham and Newcastle winger could shoot and cross with both feet, too, and although he wasn’t the most prolific goal-scorer, he was a genuine box office talent.\n23. Claude Makelele\nThe defensive midfielder, who spent most of his career with Nantes and then Chelsea, is the type of player that any top side needs. He played a key role in helping Chelsea to storm to the Premier League title in 2004-05. His then-manager Claudio Ranieri described him as the “battery” of the team. He was exactly that – one that never went flat.\n22. Robert Pires\nRobert Pires won two Premier League titles and three FA Cups during his time at Arsenal, where he became a fan-favourite. It’s easy to understand why, for he possessed a wonderful array of skills and tricks that would prize open defences and get fans off the seats. His link up play with Thierry Henry and Dennis Bergkamp was a joy to watch.\n21. Antoine Griezmann\nThe versatile attacker may have worn some questionable haircuts, some of which no doubt made him a target, but he’d normally have the skill and talent to back it up. As well as being a constant goal threat, the Atletico Madrid star has never shied away from doing the more ugly work.\n20. Emmanuel Petit\nWatching Emmanuel Petit parole the midfield alongside his Arsenal teammate and fellow Frenchman, Patrick Viera, was a fearsome sight. A key member of the Gunners’ double-winning side in the 1997-98 season, the defensive midfielder could slice through defences as well as do the dirty work. Goals were few and far between, but he did notch in the 1998 World Cup final.\n19. Jean Tigana\nMali-born Jean Tigana enjoyed his best years at Bordeaux, where he made over 250 appearances in the 1980s. He was a player for every manager, with a top class attitude and a tireless work ethic that helped France to win the 1984 European Championship. Michel Platini grabbed the headlines, but Tigana’s influence that year was huge.\n18. Bixente Lizarazu\n‘Liza’ was another player to enjoy football immortality with the national side, when France won the World Cup in 1998 and then the European Championship two years later. The all-action left-back spent more than 10 years with German giants Bayern Munich, a glittering spell that saw him collect 16 trophies.\n17. Olivier Giroud\nWas Olivier Giroud underrated, or, after years of proving people wrong, did he finally get the credit he deserved? It’s probably fair to say the centre-forward splits opinion, but this is a player who equalled Thierry Henry's all-time scoring record for France at the 2022 World Cup – and he only made his senior debut at the age of 25.\n16. Jean-Pierre Papin\nJean-Pierre Papin was a predator inside the box, the type of player you’d put your house on when a chance fell his way. Although he was one of an elite crop of players who failed to claim silverware with his country, the former Ballon d’Or winner has arguably been the greatest player to wear a Marseille shirt.\n15. Just Fontaine\nJust Fontaine, born in Marrakesh, Morocco, is best known for his transcendent performance at the 1958 World Cup in Sweden, where he scored an incredible 13 times in just six matches. A born finisher who dominated the 18-yard box, the two-footed striker had legs like tree-trunks – which he used to good effect.\n14. Raymond Kopa\nBorn Raymond Kopaszewski, the son of Polish immigrants became a French hero at Reims, but lost the European Cup final to Real Madrid. If you can’t beat them, join them – the playmaker headed to the Bernabeu and won the trophy three times, one of them against Reims. ‘Little Napoleon’ also won the Ballon d’Or in 1958.\n13. N’Golo Kante\nDespite his size, many have described N’golo Kante as a monster in midfield, for his ability to break up play and cover ground rapidly. He played a key role in Leicester’s remarkable Premier League triumph in 2015/16, after which he was snapped up by Chelsea, where he won the title again the following season.\n12. Didier Deschamps\nYou could tell Didier Deschamps would be a fine manager long before he hung up his boots. A key member of Les Bleus’ World Cup winning side in 1998, the hard-working midfielder would kickstart attacks time and time again, and his reading of the game and organisational skills were second to none.\n11. Laurent Blanc\nThe classy defender represented his country for over a decade, during which time he played in three World Cups and amassed 97 caps. A clam presence at the back, he won both the World Cup in 1998 and European Championship in 2000. He picked up trophies wherever he went, and enjoyed successful periods with Marseille, Manchester United and Barcelona.\n10. Franck Ribery\nFranck Ribery is one of the greatest-ever French players to have never won an international trophy. When the ball arrived on the wing, he was a player who would get fans off their seats. A fine dribbler, he could go wide or cut inside – but he was rarely predictable. Ribery won everything at Bayern Munich but international honours eluded him.\n9. Karim Benzema\nLike a fine wine, Karim Benzema got better over time. The Real Madrid legend announced his international retirement shortly after France lost to Argentina in the 2022 World Cup final. France has produced some of the best strikers of all time, but natural goal-scorers like this are hard to replace. He filled his trophy cabinet during a glittering career at the Bernabeu.\n8. Kylian Mbappe\nThe explosive striker was just 19 years old when he won the World Cup with France in 2018, after which he very quickly established himself as one of the best and most feared strikers in the world. His hat-trick in the 2022 final against Lionel Messi’s Argentina underlined his status as world football’s new top dog.\n7. Marcel Desailly\nHow much would a peak Marcel Desailly, a Champions League winner in France and Italy, go for in today’s game? This was a player who had it all: a tough tackler, a leader, technical ability, speed and strength. Put that all together and you had one of the best centre-backs of a generation.\n6. Lilian Thuram\nBlessed with great speed, strength and agility, Lilian Thuram offered far more than just defensive qualities. He was part of an iconic crop of world-class players in the 1990s and although he only won two domestic titles, he was a key member of the French side that conquered the world in 1998, before adding European Championship honours two years later.\n5. Eric Cantona\nThe former Manchester United talisman was always on the back pages, but occasionally on the front, too. This beguiling footballer had a way of finding trouble, something that probably cost him an extended run in the national side. Even so, he was a player who possessed incredible skill, vision and creative flair.\n4. Patrick Viera\nPatrick Viera, one of the Premier League’s best-ever midfielders, was the complete midfielder. Box-to-box and touchline-to-touchline, the 1998 World Cup winner was an unstoppable force at his peak – a leader, a winner and constantly hungry to drive his team forwards. Three times a Premier League champion with the Gunners, he was the beating heart for his nation for almost a decade.\n3. Thierry Henry\nArsenal fans had to it good when Thierry Henry was at his peak. He wasn’t just a great goal-scorer – he was a scorer of great goals. Headers, volleys, solo efforts, tap-ins, free kicks… the genius that was Henry would tease defenders and leave even the best centre-backs chasing shadows. He top-scored in four Premier League seasons for the London club.\n2. Michel Platini\nMichel Platini was deadly in front of goal, and possessed the mentality of a winner. That enabled him to excel everywhere he went, and to produce one of the greatest-ever individual performances at an international tournament when he led his country to Euro 84 triumph on home soil with nine goals in five matches.\n1. Zinedine Zidane\nZinedine Zidane was an artist. Impossible to mark, he could win matches in a heartbeat. The number ten had it all: control, vision, a decent turn of pace, and two wonderful feet. The Real Madrid playmaker won it all, too, including the 1998 World Cup, in which he scored twice, and the European Championship. ‘ZZ’ was, quite simply, a genius.\nMichael Weston is a journalist who has worked for The Football Association, where he created content to support the men's European Championships, The FA Cup, London 2012, and FA Women's Super League. He has also been a regular contributor to Golf Monthly since 2008, interviewing many of golf's biggest stars, including six world number ones.",
  "word_count": 2285,
  "scraped_at": "2026-02-14T01:51:13.770852",
  "_text_extracted": true
}