{
  "article_id": "23315d92f501",
  "url": "https://www.eastbaytimes.com/2024/08/26/bay-fc-acquires-decorated-menlo-park-native-ahead-of-playoff-push/",
  "title": "Bay FC adds Abby Dahlkemper , Menlo Park native & USWNT World Cup winner",
  "date": "20240826T213000Z",
  "domain": "eastbaytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bay FC has added a local superstar and former World Cup winner to the roster as the first-year franchise attempts to qualify for the NWSL playoffs.\nThe team announced on Monday morning that it had acquired Menlo Park native Abby Dahlkemper from the San Diego Wave FC for $50,000 in allocation money.\nIn Dahlkemper, a three-time league champion, the team has added a veteran presence on the back line. She has been capped 83 times for the U.S. women’s national team, helping win the 2019 World Cup and take bronze in the 2021 Tokyo Olympics.\n“She’s won multiple NWSL championships and her experience and leadership is really going to make a difference here on our team,” Bay FC coach Albertin Montoya said during Monday’s press conference. “I consider her one of the best center backs in the league.”\nDahlkemper, 31, dominated at Atherton’s Sacred Heart Prep as a youngster, being named the 2010 California Gatorade girls soccer player of the year. She scored 48 goals and had 23 assists in three varsity seasons, according to statistics kept by MaxPreps.\nAs a professional, the Peninsula native was named to the NWSL Best XI first team every year from 2017-19 and was named the defender of the year in 2017.\nDahlkemper could be available for Tuesday’s match against FC Barcelona Femení.\n“We’ll make a decision on Abby after today’s practice,” Montoya said. “We’re going to see how she’s feeling, and we’d love to have her play for a half if she’s available.”\nBarcelona, the defending Champions League winners, will be the titanic first test of a new-look Bay FC team on Tuesday.\nThe team (6-11-0) looked rusty in its return from a three-week hiatus, allowing two goals in the opening 10 minutes at Utah en route to a 2-1 loss.\nDahlkemper wasn’t the only move that Matt Potter – Bay FC’s head of football and interim sporting director – made after the game.\nBefore the Dahlkemper blockbuster, Bay FC sold goalkeeper Lysianne Proulx to Italian side Juventus for a yet-to-be-publicized transfer fee.\nProulx had appeared in six regular-season matches and made 26 saves since coming over from Melbourne City FC of Australia, but had not started since May. She was an alternate on Canada’s Olympic roster.\nAlthough Bay FC will hope that Dahlkamper can anchor an improved defense, the team will ultimately need to score some goals if it is to play a competitive game against Barca.\nFortunately for the home team, they have a player who knows a thing or two about the Spanish giants.\nAsisat Oshoala scored 85 goals during five seasons with Barca, and was a nominee for the 2022 Ballon d’Or trophy awarded to the best player in the world.\nShe joined Bay FC in February, and is looking forward to facing her friends and former teammates, some for the second time in a month since several of them played for Spain against Oshoala’s Nigeria in the Olympics.\n“It’s always fun, and being on the other side feels a bit different,” Oshoala said, before wryly adding. “I hope I don’t give a lot of wrong passes to them, thinking they’re still my teammates.”",
  "word_count": 525,
  "scraped_at": "2026-02-14T01:57:35.667673",
  "_text_extracted": true
}