{
  "article_id": "234d2e33d529",
  "url": "https://www.teamtalk.com/liverpool/what-liverpool-journalists-saying-arne-slot-throws-in-the-towel",
  "title": "Arne Slot : What Liverpool journalists are saying after Dutchman throws in the towel",
  "date": "20251030T021500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nWhat Liverpool journalists are saying about Arne Slot after Dutchman throws in the towel\nLiverpool paid the price for Arne Slot’s bizarre team selection for the League Cup clash with Crystal Palace on Wednesday night and the journalists who specialise in covering the Reds have had their say.\nSlot named a starting eleven almost entirely full of fringe players and youngsters for the fourth round tie with Palace on Wednesday night. Liverpool have a dismal recent record against the Eagles having won just one of their last four encounters, and two of their last eight when factoring in the end of Jurgen Klopp’s reign too.\nBeating Oliver Glasner’s well-drilled side is hard enough, but doing so with the squad Slot named – there were no senior players on the bench – was almost impossible.\nPredictably, Liverpool were routed 3-0 at Anfield and closed perhaps their most realistic route to silverware this season.\nLiverpool losing certainly did not come as a shock to the Daily Mail’s Lewis Steele who predicted as much pre-match.\nStraight after the team sheets were revealed and long before the match even kicked off, Steele – who is the Mail’s Merseyside correspondent – wrote on X: “Well at least Liverpool going out gets me a few midweeks off work, cheers.”\nAfter the full-time whistle blew, Steele took what could be considered a shot at Slot for not taking the League Cup seriously.\nHe wrote on X: “‘You’re getting sacked in the morning’ and ‘Arne give us a wave’ being chanted by the Crystal Palace fans, who also sing ‘can we play you every week?’.\n“Three wins against Liverpool for them this season. Oliver Glasner shows what you can do by taking the cups semi-seriously.”\nLiverpool reporter, David Lynch, also adopted the view Liverpool never stood a chance once Slot named his team.\nFurthermore, Lynch suggested Slot has now ramped up the pressure on his own side for the upcoming clashes with Aston Villa, Real Madrid (Champions League) and Manchester City.\nLynch wrote on X: “Think that result and performance was baked in from the moment the teamsheets dropped here, and so it was a big call from Arne Slot to leave so many out.\n“But it won’t look like a smart decision if Liverpool don’t see the benefits across the next three – a huge week coming up.”\nOne of The Athletic’s Liverpool writers, Gregg Evans, was a touch more forgiving with his verdict.\nHe wrote: “Did Slot make a mistake by leaving out so many senior players? We will only really know the answer to that question at 10pm on Saturday.\n“The crunch Premier League game with Aston Villa at Anfield was always more important than this game.\n“Slot’s saying is that “nothing good comes from a defeat” but if the players who sat out this game return fit and in fine form, this defeat will be quickly forgotten.\n“With so much pressure on the champions to get back up and running in the Premier League after four consecutive defeats, it made sense to rest players.\n“Slot needed to give minutes to the likes of Joe Gomez, Wataru Endo and Federico Chiesa in case they are needed more often in the run-up to Christmas.\n“And if he did not play young Rio Ngumoha and Trey Nyoni here, then when else would they get their chance with so much riding on every remaining Premier League game?\n“By naming a handful of senior players — Alexis Mac Allister, Andrew Robertson and Milos Kerkez all started — it gave Liverpool a fighting chance. They had decent control of the game for the majority of the first half but were cut open by sloppy mistakes.\n“This season will not be defined by the Carabao Cup, though, but Anfield will not be as forgiving if things do not go their way at the weekend.”\nWill Arne Slot be sacked?\nAccording to two prominent journalists, the answer to that question is a resounding NO.\nSpeaking earlier this week, Fabrizio Romano said on his YouTube channel: “Liverpool absolutely internally… and when I say internally it’s the hierarchy, the ownership, al the people at the club, really, really trust Arne Slot.\n“They are 100 percent convinced that Arne Slot is the best manager to handle this situation.\n“Obviously it’s been a poor start to the season, but Liverpool are convinced everything will be okay, that it’s going to take some time to assess the squad with the new signings, to change something, to be back to the attitude from last season.\n“But Liverpool have full trust in Slot. There is very good communication on a daily basis between the directors, all the people at the club in the management, and Arne Slot.\n“There is no problem, no bad relationship, and no problems between the players and Slot.\n“So [the issues] are really from a tactical point and also mental, obviously. But it’s not a problem between Slot and the players or Slot and the management.”\nThe BBC’s chief football writer, Phil McNulty, concurred with the assessment Slot is NOT in danger of being fired despite the disastrous run of form.\nResponding to questions in a Q&A held on Wednesday, McNulty wrote: “Slot is under the same pressure as every Liverpool manager – and that is the pressure to win games. Pressure for his job? Not a chance.\n“Slot won the title in his first season after succeeding Jurgen Klopp, and while he needs wins as quickly as possible, Liverpool is not the sort of club to panic, even if the next sequence of results go badly.\n“I would agree, however, that they need to show signs of becoming more resilient and balanced, because I think they are a dysfunctional, soft touch at the moment. And, Hugo Ekitike apart, their big signings have not yet delivered.\n“Slot however still has plenty of credit in the bank and Liverpool is a calm club internally, not given to hasty, panicky decisions, certainly not when it involves a manager who won the Premier League last season.”\nWhen asked if Slot could be in danger if the poor form persists all the way to Christmas, McNulty replied: “Of course, Slot would be under heavy scrutiny if the current dreadful run continues until Christmas, as any manager of a club of Liverpool’s stature would be. He would be under pressure – but not, in my opinion, for his job.\n“Liverpool’s owners are measured. They saw Slot win the title in his first season and I am sure there will be an acceptance and understanding that there has also been a lot of change in the summer.\n“What he needs now is for established stars and new acquisitions to simply play better. He also needs to find his best team as I am not sure he actually knows.\n“I also think the presence of both Hugo Ekitike and Alexander Isak gives him a conundrum, on how to best utilise those two players. So far Ekitike has delivered. Isak has not.”\nLatest Liverpool news – Deal cancelled? / Chiesa must go / £88m Tottenham raid\nIn other news, Fabrizio Romano has confirmed a deal Liverpool made over the summer has not panned out as the player expected, and there are growing suggestions the move could be aborted.\nElsewhere, TEAMtalk has outlined the six reasons why Federico Chiesa must leave Liverpool despite the Italian openly admitting he wants to stay.\nIn Chiesa’s case, he may need to start thinking with his head and hot just his heart.\nFinally, a stunning report claims Liverpool could sign Tottenham’s best player for £88m.",
  "word_count": 1272,
  "scraped_at": "2026-02-14T01:49:53.044013",
  "_text_extracted": true
}