{
  "article_id": "236c501accd1",
  "url": "https://www.liverpoolfc.com/news/special-hugo-ekitike-describes-frankfurt-return-liverpool",
  "title": "  Special  - Hugo Ekitike describes Frankfurt return with Liverpool",
  "date": "20251023T101500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Reaction'Special' - Hugo Ekitike describes Frankfurt return with Liverpool\nHugo Ekitike shared his feelings about a ‘special’ experience as he returned to Eintracht Frankfurt with Liverpool on Wednesday night.\nThe France international spent a season-and-a-half with Eintracht before making the move to the Reds during the summer.\nHe returned to his old club with his new team on matchday three of the Champions League’s league phase - and was on the scoresheet at Deutsche Bank Park.\nEkitike coolly dispatched an equaliser for Arne Slot’s men after they had gone a goal down in the first half, sparking a comeback that led to a 5-1 win.\n“It was a great feeling,” the No.22 told TNT Sports post-match. “Obviously it was something special for me to come back, I would say at home. I know everybody here.\n“It was a special game for me. Obviously to win was also important. And to score my first goal also in the Champions League. I’m really happy.”\nHe said of the Bundesliga outfit: “I have so much respect for them, they made me the player I am right now. I wouldn’t be here if I didn’t come to Frankfurt.\n“I just came to be respectful. I’m grateful for what they gave to me. I will keep what I learned there, and the values they gave me, with me all the time in the future.”\nEkitike’s finish in Germany was his sixth goal for Liverpool since arriving in July.\nAsked why he has been able to settle so quickly at the club, the forward replied: “I think it’s because obviously I feel good. I have very good teammates, good staff, I love my life here.\n“I just hope I’m going to keep going because it’s [about] consistency in football. I feel really good, they help me a lot. I’m calm and I’m just doing my thing.”",
  "word_count": 310,
  "scraped_at": "2026-02-14T01:52:49.018038",
  "_text_extracted": true
}