{
  "article_id": "23aada62eef0",
  "url": "https://metro.co.uk/2025/06/09/viktor-gyokeres-rejects-55m-transfer-man-utd-arsenal-chelsea-talks-23368225/",
  "title": "Viktor Gyokeres rejects £55m transfer after Man Utd , Arsenal and Chelsea talks",
  "date": "20250609T141500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Viktor Gyokeres has rejected an offer worth almost £30m-a-year after holding talks with Manchester United, Arsenal and Chelsea.\nA number of top clubs have expressed interest in signing Gyokeres, who scored an impressive 54 goals for Sporting Lisbon last season.\nPremier League giants Man United, Arsenal and Chelsea have all held talks with Gyokeres’ representatives as they look to win the race to sign one of the most highly-rated strikers in Europe.\nBut Gyokeres has also attracted interest from further afield and Saudi Pro League side Al Hilal recently make a stunning contract proposal to the 27-year-old.\nFrench outlet L’Equipe say Al Hilal ‘went on the offensive’ for Gyokeres after Victor Osimhen made a U-turn and rejected their advances.\nOsimhen was believed to be close to agreeing a deal with Al Hilal but decided to snub the Saudi giants in favour of staying in Europe.\nThe Nigerian spent last season on loan at Galatasaray after being exiled by Napoli boss Antonio Conte.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe likes of Chelsea, Arsenal and Manchester United have all been linked with Osimhen, who scored 37 goals last season for Turkish champions Galatasaray.\nOsimhen’s transfer snub led Al Hilal in the director of Gyokeres but the Sweden international has also rejected a lucrative move to Saudi Arabia.\nAl Hilal were ready to offer Gyokeres a contract worth £30m-a-year before bonuses and indicated to Napoli they were willing to pay around £55m to strike a deal.\nShould Viktor Gyokeres join Man Utd or Arsenal?\nArsenal\nIt’s obvious why a move to the Emirates Stadium might appeal to Gyokeres. Arsenal clinched a third successive second-place finish in the Premier League and they have come so close to winning the title without an out-and-out striker.\nGyokeres would be an immediate upgrade on Mikel Arteta’s current options, which include ex-Chelsea forward Kai Havertz, the injured Gabriel Jesus and makeshift striker (at least since Arsenal’s injury crisis) Mikel Merino.\nMore than just a goalscorer – as 12 assists so far this season shows – Gyokeres would also thrive in an Arsenal team that requires more from their forwards than just a poacher.\nPlayers speak glowingly of Arteta and Arsenal would be a stable environment for Gyokeres to continue his development and perhaps be the difference for a team who have aspirations of winning trophies on the regular over the next few years.\nManchester United\nOld Trafford was immediately tipped as Gyokeres’ future destination when Ruben Amorim left Sporting Lisbon to replace Erik ten Hag.\nGyokeres’ incredible first season came under Amorim and the ex-Sporting boss looks set to welcome a new striker to the club this summer after being left underwhelmed by expensive but struggling signings Rasmus Hojlund and Joshua Zirkzee.\nThe chance to reunite with Amorim will be tempting for Gyokeres, who would also be joining one of the biggest clubs in the world despite their recent struggles.\nThe problem, of course, is Manchester United – having finished 15th in the Premier League – will be without Champions League football next season.\nLouis Sealey | Deputy Sports Editor, Metro\nBut Gyokeres rebuffed Al Hilal’s tempting offer as, like Osimhen, he sees his long-term future in Europe.\nOf the Premier League clubs keen on signing Gyokeres, Manchester United appear to be leading the race, not least because of Amorim’s relationship with his former Sporting star.\nArsenal chief Andrea Berta is a known admirer of Gyokeres but Mikel Arteta is believed to be favouring a move for Benjamin Sesko to bolster the Gunners’ attack.\nMore Trending\nChelsea have also shown interest in Gyokeres and are expected to sign another forward despite already welcoming Liam Delap to Stamford Bridge in a £30m move from Ipswich Town.\nSerie A winners Napoli, La Liga outfit Atletico Madrid and Italian giants Juventus are all monitoring Gyokeres’ situation in Sporting.\nStaying in Lisbon for another season is an outside possibility despite Gyokeres’ uncle recently suggesting his nephew could snub the widespread transfer interest to stay put.\nGyokeres has scored 97 goals in 102 appearances for Sporting Lisbon since being signed from Championship side Coventry City in 2023.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Tottenham urged to sign Arsenal and Chelsea transfer target to replace Son Heung-min\nMORE: Man City target forgotten Chelsea star to replace cult hero Scott Carson\nMORE: 15-year-old wonderkid snubs Chelsea transfer to stay at relegated club",
  "word_count": 792,
  "scraped_at": "2026-02-14T01:58:41.949443",
  "_text_extracted": true
}