{
  "article_id": "23bafa2c0169",
  "url": "https://www.themag.co.uk/2025/09/dundee-schoolkids-newcastle-v-barcelona-tickets-cancelled-as-newcastle-fans-lose-season-tickets-newcastle-united/",
  "title": "Dundee schoolkids Newcastle v Barcelona tickets cancelled as Newcastle fans lose season tickets",
  "date": "20250911T173000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dundee schoolkids Newcastle v Barcelona tickets cancelled as Newcastle fans lose season tickets\nBBC Sport have now revealed that Dundee schoolkids have lost their Newcastle v Barcelona tickets.\nThe tickets cancelled due to, according to the BBC; ‘The tickets came from unauthorised re-selling from fans who have now had their season tickets cancelled.’\nBBC Sport going on to quote a Newcastle United spokesman:\n“The relevant season tickets have also been cancelled with immediate effect and without refund.\n“These tickets will be made available to Newcastle United supporters through the club’s existing ticket sale process.”\nIt all sounds a little unlikely, 45 season ticket holders all selling their tickets on AND enough profit to be made for both those season ticket holders and whoever was selling the tickets to the schools, in an overall package where each kid was paying less than £300 to get coach travel and staying in a hotel.\nPlus the same school had done a similar trip to the last Newcastle Champions League match, against AC Milan in December 2023.\nPlus, there was at least one other Dundee school (probably at three in total) who also had a coachload of Newcastle v Barcelona tickets…\nBBC Sport update on Newcastle v Barcelona tickets- 11 September 2025:\nNewcastle United have cancelled tickets purchased by a school nearly 200 miles away for the Champions League home game against Barcelona.\nForty-five tickets for the group match at St James’ Park on 18 September were bought by the High School of Dundee.\nLisa Mole, chair of the Newcastle United Supporters Trust, said that “stung” – only days after 110,000 fans had been in an online queue for the remaining seats.\nA school spokesman said the school purchased the tickets in good faith after being “approached”.\nBut it is understood that the tickets came from unauthorised re-selling from fans who have now had their season tickets cancelled.\nA Newcastle spokesman said: “The relevant season tickets have also been cancelled with immediate effect and without refund.\n“These tickets will be made available to Newcastle United supporters through the club’s existing ticket sale process.”\nThe Mag report earlier today – 11 September 2025:\nThere has now been a BBC update on Newcastle v Barcelona tickets going to Dundee schools, rather than sold to Newcastle fans.\nOn Wednesday morning we reported on a Dundee school (High School of Dundee) having been handed a load of Newcastle v Barcelona tickets.\nThen it emerged that it was multiple Dundee schools that were receiving coachloads of tickets, with the Harris Academy in Dundee also openly promoting their kids coming to St James’ Park next Thursday, with it looking all but certain that at least three Dundee schools (see below) in total have each been given access to a stash of Newcastle v Barcelona tickets.\nThis coinciding with over 100,000 Newcastle United members failing to get Newcastle v Barcelona tickets in the ballot and/or queue sale.\nWhen digging deeper, it turned out that the High School of Dundee had also received more than 50 tickets for the last big SJP Champions League match, when Newcastle United hosted AC Milan in December 2023.\nAll very strange.\nThough this does fit in with a more general problem Newcastle United members are facing, seeing the Newcastle United owners supplying tickets to large groups of non-NUFC fans for whatever reason…\nNow the BBC have reported on the issue and had a response from the High School of Dundee about how they got hold of these gold dust Newcastle v Barcelona tickets (and presumably how they got tickets for previous NUFC Champions League match(es)) – 10 September 2025:\nIt is understood that Newcastle (United) did not supply any tickets directly to the school group.\nRegarding the Barcelona game tickets, a spokesman for the school said: “The High School of Dundee was approached by an approved provider and the tickets were bought as part of a group package.”\nWell, this BBC update simply raises more questions than answers.\nAll the tickets at every Newcastle United home match are controlled by…Newcastle United, the club are always the ultimate ‘provider’ of every ticket sold. Obviously the club are bound by rules to make a certain number of tickets available for away fans but as for all the rest of the tickets, it is Newcastle United who decide who they are sold to and who ultimately is able to buy them.\nThe first big question, who is this ‘approved provider’ that has access to seriously large numbers of NUFC home match tickets and then approaches schools (and presumably other organisations) offering to sell them tickets.\nThe second big question is then why are the Newcastle United owners doing this, selling coachloads of tickets to neutral non-NUFC supporting people, rather than selling these gold dust tickets to Newcastle United fans? Newcastle United fans who have already had to pay £37 each year to be a member, simply to apply for tickets each match AND the vast majority of matches aren’t successful in getting a ticket.\nSurely the only rational conclusion as to why the Newcastle United owners are doing this, is to make more money.\nThat the club very likely have this ‘approved provider’ selling tickets on their behalf to non-Newcastle United fans, which ultimately sees the ‘approved provider’ making money from their margin and then the club receiving more money than these seats would usually be sold for.\nAs I said above, otherwise it just doesn’t make sense. Every single Newcastle United home match is massively oversubscribed, demand far exceeding supply, so there is absolutely no need to have an ‘approved provider’ helping the club simply to fill the seats, as these tickets could be sold many times over to those in the match by match ballots and queue sales.\nNo wonder the club refuse to say how many (how few…) tickets are made available to Newcastle United members each match. The clear implication is that the club know that fans would be appalled at how few tickets are made available each game, otherwise why not be open and transparent if nothing to hide? The past claims by the club of how often members are successful in ballots, simply doesn’t match the actual experience of members when it comes to how often they get tickets, certainly not when it comes to all of the Newcastle United members I know.\nIf there is a valid reason why the Newcastle United owners do sell so many tickets to non-NUFC fans (who aren’t members), then they should come come out and tell us, if it isn’t simply about making more money by denying Newcastle fans all of these tickets.\nThe Mag report – 10 September 2025:\nJust when you thought things couldn’t get even stranger…\nAfter running that Dundee school story this morning, here at The Mag we received an email from a parent of a pupil at the High School of Dundee.\nThe parent was unhappy due to the fact that we were specifically referring to this as Newcastle v Barcelona tickets being supplied to a private school in Dundee that charges up to £20k a year per pupil.\n‘I was just wondering if you were going to do an article that mentions how two state secondary schools in Dundee have also been allocated 50 tickets per school for the Newcastle v Barcelona match? Harris Academy and St Johns School. It is not just private schools that get offered these tickets.’\nSupplying a coachload of Newcastle v Barcelona tickets to non-NUFC fans at a random school in Dundee was beyond belief.\nSurely it couldn’t be true that the Newcastle United owners are supplying coachloads of tickets to multiple Dundee schools for any game at St James’ Park, never mind NUFC’s biggest and most glamorous match of the season???\nWe asked the Dundee parent who sent this email whether they could show us anything to back up this bizarre claim. The parent replied that they had it verbally on good authority, as the information came from parents who have children at these two other schools, but that they didn’t want to send on any letter/documentation on the Newcastle v Barcelona tickets trip, in case they got into trouble.\nWell…\nI happened to have a contact up in Dundee and asked if they could see if they could find out anything.\nNo confirmation on St Johns School in Dundee, as yet. It doesn’t help either when their official school website is a single page and you can’t search for any info.\nAs for Harris Academy, a state school in Dundee?\nThey actually have a very decent official school website (though not quite at the levels of the £20k per pupil per year one!).\nThis is what is on the Harris Academy site, a newsletter for pupils…\nCan’t see exactly how many Newcastle v Barcelona tickets this Harris Academy in Dundee has been handed but safe to say it will surely be at least a coachful.\nAs yet there is nothing I have seen to back up the claim that at least one more (a third) Dundee school (St Johns) has received Newcastle v Barcelona tickets, BUT I think that you have to accept this is very very likely to be the case, when that parent flagged up these two other Dundee schools and has been proved correct on the other (Harris Academy).\nNo wonder there is so little transparency from the Newcastle United owners on how many Newcastle United members there are AND how many tickets the members are allocated each match.\nIf coachloads of kids and teachers in Dundee who don’t support Newcastle United and aren’t members are being handed all these Newcastle v Barcelona tickets, how many are NUFC handing to other groups and individuals who aren’t fans, aren’t members? Match after match, including/especially the very biggest games.\nI can only imagine how disheartening this must be for the 100,000+ Newcastle United members who failed to get tickets for next week’s Champions League match and indeed, face such a struggle to get tickets for any match at St James’ Park.\nThe bare minimum they deserve is honesty and transparency from the Newcastle United owners, why won’t they tell us where all the tickets go to each match and exactly how many (how few!!!) are left over for Newcastle United members…\nThe Mag report earlier today – 10 September 2025:\nNewcastle v Barcelona tickets have dominated recent days.\nNewcastle United fans desperate to be at what most supporters will consider the biggest match of the season.\nLast week the match by match selling of Newcastle v Barcelona tickets kicked off. In the ballot, a lucky few thousand getting tickets as 100,000+ Newcastle United members entered the ballot.\nOn Tuesday (9 September 2025) it was the queue sale for Newcastle United members.\nWhen that sale opened at 10am, well over 100,000 Newcastle United members (Adults pay £37 each season and kids £20 to be a member, which you need to be to to enter the ballot and/or the queue sale) were in the queue.\nThe final few thousand Newcastle v Barcelona tickets were very quickly sold out to those at the front of the queue, over 100,000 behind them in the queue left ‘disappointed’.\nImagine then how these 100,000+ Newcastle United members felt on Tuesday night when this came to light via NUST (Newcastle United Supporters Trust)…\nWe have been inundated with messages regarding a school in Dundee being given 45 tickets for the Barcelona fixture.\nWith >100k in today’s member sale queue and countless tickets on 3rd party sites at vastly inflated prices, we completely understand the ongoing frustration from… pic.twitter.com/aT8UPgXOsV\n— Newcastle United Supporters Trust (@nufctrust) September 9, 2025\nAs you can see, 45 tickets handed to the High School of Dundee, which is a private school that currently charges (see here) up to £20,606 (and 40p!) per year for each pupil.\nSo, 100,000+ Newcastle United members paying £37 (£20 for kids) a year membership end up with no tickets, then find out a coachload of tickets are being given to a random £20k a year school in Dundee.\nQuite ironic that it is £20 a year membership for Newcastle United supporting kids who are denied Newcastle v Barcelona tickets, whilst kids in Dundee who aren’t Newcastle fans can get tickets, due to their parents paying £20k a year for the school fees.\nAs Newcastle United members will tell you, it is a common thing that when you are lucky enough to get tickets via ballots/queue sales. Especially if you end up in the Milburn/Leazes corner, you will time after time see large groups of people, including kids not from Newcastle.\nHow do you automatically know these people aren’t United Newcastle fans? Well, when United are scoring goals it is quite clear that these are neutrals who have got hold of precious tickets because they don’t react when NUFC score. Even worse, when this happens to be a match against one of a group of certain Premier League clubs, some of these ‘neutrals’ are reacting positively to goals, just not the ones scored by Newcastle United!\nIf you think this is all exaggeration and this episode is just a one-off with a random school in Scotland.\nHow about the most recent Champions League match at St James’ Park in December 2023, when if Newcastle United won their final group game against AC Milan they were guaranteed to progress to the knockout stage.\nYou might recognise this school that got over 50 tickets for that match, on a trip that included coaching at the Academy at…Sunderland.\nHigh School of Dundee official site – 23 December 2023:\n‘Amazing Football Experience For HSD Pupils.\nPupils from HSD travelled down south this month for an incredible football-themed trip, which included a training session at Sunderland and a Champions League game!\nMore than 50 pupils and staff made the trip to Newcastle, where they were given a chance to train with Sunderland coaches at their Beacon of Light training facility.\nThey then visited the Metrocentre before heading to St James’ Park to watch Newcastle take on AC Milan.\nThe pupils got the chance to soak in the famous atmosphere as they enjoyed the thrilling match which ended in a 2-1 victory for the Italian side.’\nAll Newcastle United fans, all Newcastle United members, know all too well that demand massively outstrips supply, when it comes to tickets. They know they are competing with so many other NUFC fans.\nHowever, to then have their noses rubbed in it with stuff like this, the Newcastle United owners doing this, so many tickets going to people who aren’t NUFC fans.\nIs this simply a money making exercise, instead of getting £60 or so from Newcastle fans, are the club selling these packages to groups of non-Newcastle fans for £150 a ticket, £200 a ticket?\nOr is it simply because one of the Newcastle United directors or senior staff has some attachment to this £20k a year school in Dundee, maybe they are an ex-pupil or mates with the headteacher? That of course doesn’t explain why so many other large groups of neutrals get so many tickets match after match.\nThe transparency from the club is non-existent.\nThey won’t even say how many Newcastle United members there are, how many apply in ballots for a match, how many tickets are made available to NUFC members for each of the matches.\nOther clubs such as Arsenal and others do this, why not Newcastle United?\nThen you have all the tickets that every match end up on third party reselling sites, where do they come from and why are the Newcastle United owners doing nothing about that?\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 2629,
  "scraped_at": "2026-02-14T01:49:53.054538",
  "_text_extracted": true
}