{
  "article_id": "23e29c571904",
  "url": "https://metro.co.uk/2024/05/03/jurgen-klopp-provides-diogo-jota-virgil-van-dijk-liverpool-injury-updates-20768591/",
  "title": "Jurgen Klopp provides Diogo Jota and Virgil van Dijk Liverpool injury updates",
  "date": "20240503T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Virgin van Dijk is a major doubt for Liverpool’s Premier League game against Tottenham on Sunday, Jurgen Klopp confirmed.\nLiverpool’s title hopes have been all but dashed following a defeat against Everton and a draw against West Ham last weekend.\nThe Reds, though, have now officially secured Champions League football after Tottenham’s 2-0 defeat against Chelsea on Thursday evening.\nKlopp, now, will host Spurs as he returns to Anfield for his penultimate home league fixture before departing at the end of the season.\nHowever, the German looks set to be without the services of his captain after Van Dijk, who has missed just two league games this season, was absent for Thursday’s training session.\n‘Virgil wasn’t in team training yesterday, he’ll be in parts of team training today so we’ll have to wait and see there,’ Klopp confirmed at his pre-match press conference on Friday.\nElsewhere, Conor Bradley could be in contention to return to the squad after his ankle injury, but the game will come too soon for Diogo Jota who is still recovering from an injury he picked up against Fulham at the end of April.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Diogo is not back in team training yet, Conor is,’ he added.\nLiverpool fell to a dramatic 2-1 loss against Spurs back in September, a game overshadowed by VAR controversy after Luis Diaz’s goal was incorrectly ruled out.\nAnd as Klopp prepares to welcome their north London opposition to Merseyside, the 56-year-old is keen to right the wrongs from their previous encounter.\nMore Trending\n‘I don’t want to make it the biggest subject but I cannot forget the Tottenham game – it was just so strange,’ he said.\n‘Simon Hooper [who refereed the game in September] was standing next to me against Everton and I tried to get it out of my head but I couldn’t.\n‘It was not Spurs’ fault that night, they just played the game but I would like to win that game for 500 reasons and the way we lost that previous one is one of them.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mauricio Pochettino tells Chelsea to ‘fix situation’ between club and key player\nMORE: William Gallas names the Premier League club Jose Mourinho should join this summer",
  "word_count": 441,
  "scraped_at": "2026-02-14T02:01:16.469357",
  "_text_extracted": true
}