{
  "article_id": "23e78261b7ae",
  "url": "https://news.yahoo.com/epl-talk-manchester-city-treble-charge-terrifying-100010133.html",
  "title": "EPL TALK : Why Manchester City treble charge is terrifying",
  "date": "20230427T103000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EPL TALK: Why Manchester City’s treble charge is truly terrifying\nThey are flirting with perfection, yet the feeling is not of admiration, but of inevitability like the Marvel movie franchise\nIT’S hard to pinpoint the moment when Manchester City morphed into elite football’s version of the Marvel movie franchise, but their omnipresence feels just about complete.\nAcclaimed director Martin Scorsese famously claimed that the “theme park” movies of Marvel were killing cinema, a reasonable assessment that sparked a backlash from those with different interpretations of cinema, movies and theme parks. But a casual visit to any cineplex would validate his concerns.\nMarvel and Manchester City have worn down their competition through the relentlessness of their expensive products, a pair of industrial complexes with the same goal: to own their respective industries. Pep Guardiola’s beautiful bruisers are almost there, which seems an absurd statement to make.\nFootball matches are pinball machines stuck on the multi-ball function, too many moving parts coming from too many directions, all at once. They are impossible to manipulate. And yet, City came alarmingly close against Arsenal. They didn’t bother with the unpredictable variables of multi-ball. They ran over the machine. The Gunners’ personnel and tactics meant nothing. The second-best team in English football were cut down.\nPep Guardiola’s jazzy artists have gone heavy metal, but in a streamlined, Mad Max kind of way. They now come with spikes and battering rams. Kevin de Bruyne and Erling Haaland can move in a straight line and cut through anyone. City were always technically ahead, but now they boast physical control, too.\nAnd how do we feel about this? The eternal quest for perfection has universal appeal and should be embraced by all, theoretically. What’s not to like?\nCertainly in the early years of Guardiola’s era, it was great fun, rather like the initial flourish of the Marvel movies. De Bruyne was Captain America, endearing, formidable, devoted to the cause and willing to take one for the team, despite his elevated status. Ilkay Gundogan was a bit of a Winter Soldier and Jack Grealish’s story arc now has a redemptive feel to it, the cheeky scoundrel embracing his Iron Man-like playboy persona, before learning the true value of sacrifice.\nAnd as City’s Treble challenge gets upgraded from possible to probable – in light of their 4-1 win over Arsenal – a crescendo feels imminent. They have their Thor in Haaland, a celestial being not of this earth, and are assembling for the endgame, a pinnacle beyond all others since Manchester United’s Treble in 1999.\nAnd then what?\nDomination feels repetitive and cynical\nThe trouble with an unstoppable industrial complex is just that. It’s industrial. No matter how slick and shiny the enterprise, the dominance can begin to feel repetitive, cynical and engineered, a unique spectacle brought to you by the only player in town. A unique spectacle that feels just like the last one.\nTo really strain the Marvel analogy, Secret Invasion is about to be released, a TV series about Nick Fury pulling together a team of unlikely heroes to deal with extraterrestrial Thingies from the planet Thingy and so on. And the show will be flawlessly produced by a vast crew of creative talents, just like the previous series flawlessly produced by a vast crew of creative talents.\nLuckily, there’s always the welcome distraction of football, where Guardiola and his vast crew of creative talents are ready to deal with the latest existential threat from the people of Arsenal, who intend to destroy City’s territory. The show will be flawlessly produced and chillingly executed with a regimented efficiency that’s high in quality, but low in jeopardy.\nAnd just as Marvel is likely to play on every screen near you, Manchester City will play all the major venues in the FA Cup, the English Premier League and the Champions League for the foreseeable future. It’s progress on a remorseless scale with no obvious end in sight.\nOf course, there were similarly hysterical concerns about one team’s omnipotence at the turn of century, when Manchester United won their Treble in 1999. (Full disclosure, I was one of them, lamenting a one-team league and obsessing over Roy Keane’s vein bulging.)\nBut to state the bleeding obvious, this is different. United won the EPL title on the final day of the season by a single point. Only Bayern Munich’s schoolboy defending at corners gifted the Red Devils the Champions League in stoppage time, having been outplayed for most of the final. Like Arsenal this season, United required peak performances almost weekly.\nBut City have spent periods of this season coasting through opponents like a yacht owner strolling among his guests, handing out caviar and wondering if he should join the others in the jacuzzi. The opulence of City’s surroundings was enough to keep the party ticking over. They could become the first team to win the Treble after a journey often spent in a lower gear.\nAnd it’s grossly unfair, for many reasons. It’s unfair that many neutrals would rather one of the nicest guys in football, de Bruyne, didn’t lift another EPL trophy, despite his obvious vitality, elegance and humility, because of that other stuff surrounding City, the stuff that has nothing to do with him or his team-mates (even if it's the stuff that pays their wages.)\nIt’s unfair that Guardiola still believes his City tenure will be judged with a caveat, even if he completes the Treble. It’s unfair that Haaland is human and emasculates the rest of us.\nBut it’s also unfair that City could potentially come back and do this all again next year. It’s unfair that they could conceivably buy Harry Kane, Jude Bellingham or Declan Rice on a whim, just for a giggle. It’s unfair that they do not particularly need any of them, but could deny rival bidders anyway, thanks to their financial superiority.\nCity are not going to party like it's 1999. Unlike United then, City will keep going. Their power does not feel temporary. They are flirting with the terrifying prospect of perfection. And yet, the really scary part is still to come. For Guardiola's team, total control may become a way of life.\nNeil Humphreys is an award-winning football writer and a best-selling author, who has covered the English Premier League since 2000 and has written 26 books.\nFollow the new EPL season with the \"Footballing Weekly\" show on YouTube, Spotify and Acast.\nFor more football news, visit our Football page on Yahoo!\nYou can also follow us on Facebook, Instagram, TikTok and Twitter. Also check out our Southeast Asia, Food, and Gaming channels on YouTube.",
  "word_count": 1106,
  "scraped_at": "2026-02-14T01:50:29.466530",
  "_text_extracted": true
}