{
  "article_id": "2406e1fe8a1a",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/only-stay-away-10-more-33333331",
  "title": "He only had to stay away for 10 more days , but now he banned for three more years",
  "date": "20260130T144500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "He only had to stay away for 10 more days, but now he's banned for three more years\nDaniel Lloyd was recognised twice in two days\nA man who tried to get away with breaking his ban from football matches was rumbled when he was spotted by stewards. Daniel Lloyd, 42, from Birkenhead, was already subject to a three-year football banning order, which was due to expire on September 27 2025.\nHowever, on September 17, he went to a football match at Anfield Stadium when Liverpool faced Atletico Madrid in the Champions League, ten days before his ban was set to end. Stewards recognised Lloyd and, as he was being ejected from the stadium, he shouted a homophobic comment at one of the staff.\nJust two days later (on September 19) Lloyd breached the order again when officers saw him on Anfield Road close to the stadium, which he was prohibited to enter under the banning order. He was there before the Merseyside derby against Everton, which kicked-off later that day.\nPolice arrested Lloyd on suspicion of a public order offence. He was also arrested on suspicion of two counts of breaching the banning order.\nLloyd pleaded guilty at Sefton Magistrates Court yesterday, Thursday, January 29, for a public order offence and breaching a banning order on two occasions.\nHe has now been banned from attending all football matches in the UK for three years. He was also fined.\nSuperintendent Pete Clark said: “Lloyd showed a clear disregard to his previous banning order where he breached it twice, just weeks before it was due to expire.\n“We will take action and identify those who commit hate crime in any form, and this includes abusive behaviour which could incite violence and cause distress to others.\n“I hope this sends a clear message that this behaviour will not be tolerated and act as a deterrent to others that we will put you before the courts to be prosecuted.”\nTo report a hate crime contact Merseyside Police social media desk via Twitter @MerPolCC or Facebook Merseyside Police CC. You can also call 101 or contact the independent charity Crimestoppers anonymously on 0800 555 111.\nIf, for any reason, you do not wish to report a hate crime to the police, the independent charity Stop Hate UK to run a 24/7 confidential helpline for all victims of hate crime on 0800 138 1625 or www.stophateuk.org.\nYou can also download the Stop Hate UK reporting app on Google Play or the Apple App Store.\nAcross Merseyside, there are also have a number of third party reporting centres including fire stations, citizens advice bureaus and hospitals. A list of locations can be viewed here: merseyside-third-party-hate-crime-reporting-centres.pdf\nYou can report an incident of discrimination in football - whether it took place online or at a grassroots, non-league or professional game – by downloading the Kick It Out app.\nYou can also report any incidents via their online form here: https://www.kickitout.org/forms/online-reporting-form.\nFor the latest news and breaking news visit liverpoolecho.co.uk/news\nGet all the big headlines, pictures, analysis, opinion and video on the stories that matter to you by signing up to our daily and breaking newsletter.\nSign up to our breaking news newsletter here.\nFollow us on X @LivECHONews or on Bluesky @liverpoolecho.co.uk - official Liverpool ECHO accounts - real news in real time.\nWe're also on Facebook/theliverpoolecho - your must-see news, features, videos and pictures throughout the day from the Liverpool ECHO.",
  "word_count": 574,
  "scraped_at": "2026-02-14T01:50:01.807227",
  "_text_extracted": true
}