{
  "article_id": "241dc5f2b747",
  "url": "https://www.the42.ie/george-weahs-son-signs-for-juventus-6107851-Jul2023/",
  "title": "Sons of footballing legends make moves to Juventus and Inter",
  "date": "20230702T151500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TIMOTHY WEAH signed for Juventus from Lille on Saturday, the USA international following in his father’s footsteps to Serie A, while French international striker Marcus Thuram signed for Inter Milan on a free transfer.\n“Timothy Weah has officially become a Juventus player. The American arrives on a permanent deal from Lille,” the Italian club said in a statement.\nThe son of 1995 Ballon d’Or winner and current president of Liberia George Weah, the 23-year-old will replace Colombia winger Juan Cuadrado who is set to leave as a free agent.\nWeah senior starred for Monaco, Paris Saint-Germain and then AC Milan, where he won league titles in 1996 and 1999 and was Africa’s top scorer in Serie A until Victor Osimhen overtook him last season.\nHis son, who has played 29 times and scored four goals for the USA, is Juve’s first new signing of the summer after a troubled season.\nJuve finished seventh in Serie A after a 10-point deduction for illicit transfer activity which means they might not have European football next term despite earning a spot in the Europa Conference League.\nThe Turin giants could be banned from Europe for a season by Uefa for allegedly misleading European football’s governing body when negotiating a “settlement agreement” following breaches of Financial Fair Play rules.\nJuve are hoping to hire as their new sporting director Cristiano Giuntoli, the man who built a series of strong Napoli teams including last season’s Scudetto winners while balancing the books.\nGiuntoli has another year left on his contract with Napoli but is aiming to conduct the summer transfer window for Juve, who have posted losses for five straight years and whose most recent annual accounts were €254.3 million in the red.\nMeanwhile, Marcus Thuram, son of 1998 World Cup winner Lilian, signed a five-year deal with last season’s Champions League finalists worth a reported €6.5 million a season.\nInter secured his services on the back of his most successful season for Bundesliga side Borussia Moenchengladbach in which he scored 13 goals — he became a free agent at the end of the campaign.\n“Marcus Thuram signs for Inter,” read a statement on the club’s website.\n“The forward, who was born in 1997, joins the Nerazzurri following four seasons with Borussia Moenchengladbach.”\nThuram will play up front alongside Lautaro Martinez after picking the country of his birth rather than Paris Saint-Germain, replacing veteran Edin Dzeko who signed for Turkish giants Fenerbahce last week.\nHe was born in Parma where his father played for five seasons, winning the Uefa Cup and Italian Cup in 1999 as part of a star-studded outfit which also featured Italian icons Gianluigi Buffon and Fabio Cannavaro.\nBuffon and Cannavaro got the better of Thuram senior at the 2006 World Cup, beating France in the final on penalties.\nThuram senior had wanted his son to take up either fencing or judo but he defied his father.\nThuram junior also suffered World Cup heartache at the hands of Martinez and Argentina in last December’s thrilling World Cup final.\nFrance lost on penalties following a thrilling 3-3 draw in which they were 2-0 behind at half-time, with 10-times capped Thuram setting up the equaliser which took the game to extra time.\nThuram may yet have to battle with Romelu Lukaku for a place in Inter’s starting line-up, as the Belgium striker is in discussions to stay in Milan despite his loan from Chelsea ending this week.",
  "word_count": 572,
  "scraped_at": "2026-02-14T01:56:02.394250",
  "_text_extracted": true
}