{
  "article_id": "243612b7865c",
  "url": "https://theathletic.com/4436569/2023/04/25/england-replacements-leah-williamson/",
  "title": "Leah Williamson is injured , so who could replace her at the World Cup ? ",
  "date": "20230425T043000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s been a worrying few weeks for England head coach Sarina Wiegman. Chelsea defender Millie Bright was sidelined with a knee injury just before the April international window and last week, Leah Williamson tore her anterior cruciate ligament in Arsenal’s Women’s Super League defeat to Manchester United. Williamson’s injury will keep her out of the World Cup.\nAdvertisement\nWiegman now faces the potential of a potentially era-defining tournament without her two starting centre-backs. There is more optimism around Bright returning to the fold in time for the tournament but England’s disappointing recent performances against Brazil and Australia highlighted her importance.\nWilliamson has played different roles this season for club and country. She was expected to be used in a holding midfielder role for the remainder of the season at Arsenal as Kim Little had been ruled out indefinitely but regardless of where Williamson would have played in Australia and New Zealand, Wiegman has a gap in her defence.\nSo who are the top options to start alongside Bright for England this summer?\nAlex Greenwood\nGreenwood is already part of Wiegman’s squad and the fact she’s left-footed makes her a natural replacement for Williamson, who plays at left-sided centre-back — even though she’s right-footed — when paired with Bright. Greenwood has played in this role many times for England and is starting there for Manchester City. While she can also play at left-back, she is the favourite to take Williamson’s place.\nGreenwood’s passing range is one of her biggest assets. Williamson’s strong ability on the ball was important to how England played and Greenwood could offer similar attributes. Her stats for forward passes, long-range passes and passes into the attacking third are similar to Williamson’s, with her passes forward per 90 minutes actually slightly higher than the Arsenal defender. Greenwood leads the WSL for passes into the final third (124), carrying on last year’s form when she finished top (217).\nGreenwood is also one of England’s best set-piece takers and her versatility is an asset. Defensively, she isn’t as strong as Williamson.\nGreenwood is the natural replacement for Williamson and one we will probably see Wiegman look to for the World Cup but there are other options.\nAdvertisement\nLotte Wubben-Moy\nWilliamson’s Arsenal team-mate can play at left or right centre-back and was part of England’s Euro 2022 winning squad. It’s been a stop-start season for Wubben-Moy who has stepped in to cover Williamson when she missed games with an injury earlier this season. She will now be expected to play the rest of the season for Arsenal alongside Rafaelle Souza.\nWubben-Moy had dropped in and out of the England squad after the Euros after not getting much game time, but injury among the rest of the squad has provided her with opportunities.\nThe 24-year-old’s greatest asset is her passing ability. Last season, she finished third in the league for pass completion percentage and fifth for passes into the final third. This season, she has the sixth-highest total distance for progressive passes — Greenwood leads the way by (11,197m) and Manchester United’s Maya Le Tissier (9,930m) has achieved the second-highest.\nThis season, she’s struggled with a few errors in key games, but Wubben-Moy’s passing ability makes her a strong choice to slot in in Wiliamson’s absence, but she needs strong performances in Arsenal’s remaining games this season to try and challenge for that starting spot.\nThe minutes that Wubben-Moy will get in the remainder of the season will boost her chances of not only making the England squad for the World Cup but also of feasibly starting in Wiegman’s team.\nJess Carter\nCarter has played everywhere across the back line this season. The versatile defender is more likely to feature as a left-back for England or right-sided centre-back if Bright is missing, but she may well be forced into a less familiar position if England are without both defenders.\nCarter has played as part of a back three and back four for Chelsea but is most comfortable at full-back. She has played in important matches for Chelsea over the last few seasons across the WSL and Champions League, and manager Emma Hayes has helped develop her into one of the league’s best defenders.\nCarter’s strengths are in her defending. She’s physical and is good at reading the game. She excels at winning tackles and interceptions and leads the way among her WSL counterparts. She is also very strong in the air. Carter’s weakness is her ability on the ball and we saw in England’s recent games that she was unable to get forward and provide opportunities for Lauren Hemp and Chloe Kelly.\nAdvertisement\nMaya Le Tissier\nLe Tissier has been part of Wiegman’s refreshed squad since the Euros. Her move to Manchester United from Brighton has taken her game to another level and she’s been a key part of their defence this season, though the 21-year-old is still inexperienced in international football. Le Tissier has featured in friendlies for England, playing at right-back and right-sided centre-back, but it’s unlikely she will be thrown into starting at the World Cup — unless Wiegman is forced to look for a more inexperienced option.\nLe Tissier’s profile is very similar to Williamson’s as she is strong on and off the ball. She is good at playing passes forward and currently joint top, alongside Ella Toone, for the number of successful through balls in the WSL this season. She averages 9.2 passes into the final third per 90 minutes this season, matching Bright and just behind Wubben-Moy. Le Tissier’s biggest weakness is in the air, where she has the lowest aerial win rate of all of England’s centre-back options.\nLe Tissier probably will make Wiegman’s squad and provide an option for the England coach, but given her inexperience other defenders will likely be ahead of her.\nEsme Morgan\nMorgan has also been part of a rejigged post-Euros England squad and, like Le Tissier, has mainly played at right-back or right-sided centre-back. She struggled in England’s recent game against Australia and, at 22, is short on international senior experience.\nHowever, Morgan has good passing ability, with more passes into the final third than Bright and Le Tissier. A high percentage of her passes are also forward. She is defensively strong too. Morgan has been one of the best passes of the ball throughout her time in the WSL and especially before her injury in 2021, which kept her out for nearly a year.\nIn 2020-21, she finished the season with the third-highest pass completion rate (88.5 pre cent) and the third-highest percentage of dribblers tackled (75 per cent).\nMorgan’s physicality is one of her biggest weaknesses and she needs to get more game management experience to be trusted as one of England’s starting defenders, but she is part of a strong depth of talent.\n(Top photo: Charlotte Tattersall – MUFC/Manchester United via Getty Images)",
  "word_count": 1147,
  "scraped_at": "2026-02-14T01:59:46.859905",
  "_text_extracted": true
}