{
  "article_id": "244f0abebbbb",
  "url": "https://www.managingmadrid.com/2024/12/6/24314858/pedja-mijatovic-critiques-real-madrids-mentality-hunger-and-leadership",
  "title": "Pedja Mijatovic Critiques Real Madrid Mentality , Hunger , and Leadership",
  "date": "20241206T200000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pedja Mijatovic, the hero of Real Madrid’s seventh Champions League title and former Sporting Director under Ramon Calderon, spoke to Spanish radio station Cadena Ser discussing the problems in this current version of Real Madrid.\nPedja Mijatovic Critiques Real Madrid’s Mentality, Hunger, and Leadership\nPedja Mijatovic highlights the team’s mental fragility, loss of hunger, and Mbappe’s struggles under pressure, calling for a shift in leadership and approach under Carlo Ancelotti.\nMentality\n“I see a team that is more mentally fragile. The main problem this season is precisely the team’s greatest virtue of last year, this mental strength. They have a lot of footballing quality but they are quite fragile in terms of the mental aspect every time they concede a goal and that did not happen in previous years when there were comebacks. It is more a mental issue than a footballing one”\nLack of Hunger\n“This squad is less hungry because they have won everything they could win. This whole context has made them comfortable and comfort in football is a major problem that kills you. They don’t live the atmosphere like when there was a bit more hunger”\nKylian Mbappe\n“Mbappe is a player under pressure and anxious who wants to do important things to show that he is a superstar. This anxiousness causes enormous stress on the field. He must calm down and it wouldn’t be a bad idea if he stayed on the bench for some games and saw what the atmosphere is like there. He has to get used to the demands of Real Madrid and not have the team adapt to him”\nCarlo Ancelotti\n“My feeling is that he wants to please everyone and some young players who deserve an opportunity when he decides it, not when it is demanded of them. I think that a conflict or anger could benefit the team, We need the pacifist Ancelotti to send someone to hell... to see the team’s reaction. Until a year ago, the other thing worked, but now something different is needed”",
  "word_count": 338,
  "scraped_at": "2026-02-14T01:52:10.166129",
  "_text_extracted": true
}