{
  "article_id": "24653e277046",
  "url": "https://www.gdnonline.com:443/Details/1370763/City-rally-to-beat-Real",
  "title": "Football : City rally to beat Real",
  "date": "20251211T013000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – Nico O’Reilly’s opportunistic strike and Erling Haaland’s penalty helped Manchester City to fight back to beat Real Madrid 2-1 in a tense Champions League contest at the Santiago Bernabeu last night.\nRodrygo opened the scoring with a low shot from a counter in the 28th minute, with City looking exposed almost every time Madrid ventured forward for the first half an hour.\nBut Madrid pressed the self-destruct button, first when goalkeeper Thibaut Courtois spilled a relatively easy header from Josko Gvardiol, with O’Reilly converting the rebound in the 35th minute.\nThen, eight minutes later, defender Antonio Ruediger conceded a penalty by wrestling Haaland to the ground as he went to meet a cross in the six-yard box, with the Norwegian striker making sure with the resulting penalty.\nThe result moved Pep Guardiola’s City to fourth place in the group with 13 points from six matches, while Madrid slipped to seventh with 12 points, increasing scrutiny on manager Xabi Alonso as Real’s dismal run extended to just two wins in eight matches across all competitions over the past five weeks.\nMeanwhile, Noni Madueke scored twice and Gabriel Martinelli netted the other as Arsenal kept up their 100 per cent run to stay top of the standings with a comfortable 3-0 triumph at Belgium’s Club Brugge.\nArsenal’s sixth win in as many group games all but confirms a top-eight finish, meaning they will skip the knockout phase playoffs in February and move straight into the round of 16 in March.\nIt was a satisfying night at the Jan Breydelstadion for the under-strength Gunners, who had lost at Aston Villa at the weekend and made five changes to freshen up an injury-stricken squad.\nIt included a first run-out in almost a year for Brazilian striker Gabriel Jesus, who got a half-hour’s action as a second-half substitute.\nBayer Leverkusen’s Alex Grimaldo bagged an 88th-minute goal to rescue a 2-2 draw for the hosts against Newcastle United.\nNewcastle thought they had done enough to get back into the top eight after coming from a goal down to lead 2-1 before Spain international Grimaldo charged into the box to level with two minutes left to play.\nJuventus registered their first home win of this season’s Champions League but were made to battle before overcoming Pafos 2-0 at home thanks to second-half goals from Weston McKennie and Jonathan David.\nThe sides were level on points going into the game and Pafos proved more than a match for their more illustrious Italian opponents for long periods, but Juventus are now on nine points while the Cypriots remain on six.\nThe first half brought plenty of chances but no goals, with Pafos creating most of the danger, and Juventus went in at the break with boos from their own fans ringing in their ears.\nJuventus found the opening goal through McKennie in the 67th minute and David doubled their lead six minutes later to bring an end to the visiting side’s brave attempt to cause an upset in Turin.\nParis St Germain played out their first goalless draw of the season at Athletic Bilbao but stayed in the driving seat for direct qualification for the last-16 after a string of fine saves by home goalkeeper Unai Simon denied the French champions.\nLuis Enrique’s side had the clearest chances after being under pressure in the first half, but Simon produced several superb saves and Ousmane Dembele’s absence was once again felt up front by the visitors.\nThe result left PSG in third place in the 36-team league with 13 points from six games while Athletic are 28th on five points, two points from the playoff places.",
  "word_count": 608,
  "scraped_at": "2026-02-14T02:03:26.514040",
  "_text_extracted": true
}