{
  "article_id": "2470626f858b",
  "url": "https://menafn.com/1107179466/7-0-Thrashing-By-City-History-Says-Coach-Rose-As-Leipzig-Seek-Revenge",
  "title": "7 - 0 Thrashing By City  History  Says Coach Rose As Leipzig Seek Revenge",
  "date": "20231003T123000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "7-0 Thrashing By City 'History' Says Coach Rose As Leipzig Seek Revenge\nLeipzig, Germany: RB Leipzig coach Marco Rose said last season's 7-0 thrashing by Manchester City was \"history\" as the two sides prepare to meet again in the Champions League in Germany on Wednesday.\nCity's rampant victory in their home leg of the last 16 tie, with Erling Haaland scoring five goals in 60 minutes, was one of the English side's key victories on the way to winning the Champions League for the first time last season.\n\"It wasn't part of the preparation for the game, because it's history,\" Rose said in Leipzig on Tuesday.\n\"Everything came together for them in that match and of course we were hugely dissatisfied with the size of the result.\n\"But we're in a new season and we're doing pretty well right now.\"\nLeipzig have won seven of nine games in all competitions this season and come into the match fresh from a 2-2 home draw with German champions Bayern Munich.\nRose said his side could draw positives from the home leg against City last season, where Leipzig fought hard to draw 1-1.\n\"We know that we played very well at home and for that to happen again tomorrow, we have to run a lot and we have to suffer.\"\nRose said \"yes\" when asked if City were the best side in the world.\n\"But that doesn't help us and it doesn't help City,\" he added. \"It's football and we will play 11 against 11.\n\"We know City's quality. We will need a top performance and a slice of luck.\"\nCity come into the match in a rare run of poor form, having lost two games in a row for the first time since January.\nThe English champions are also missing midfielders Kevin de Bruyne and Bernardo Silva.\nRose however praised City's squad depth, saying \"even when de Bruyne and Bernardo Silva are missing, then in comes (Mateo) Kovacic, then in comes Phil Foden, who has developed really well.\"\nRose said he was looking forward to seeing Josko Gvardiol, who moved from Leipzig to City in the summer, calling the Croatian centre-back \"a great player and a great guy.\"\nThe Leipzig coach confirmed wing-back Benjamin Henrichs will miss the clash through injury, while Spanish international forward Dani Olmo is also ruled out as he continues his recovery from injury.\nFormer Chelsea forward Timo Werner is however set to make a return from a back complaint.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 468,
  "scraped_at": "2026-02-14T02:00:57.116568",
  "_text_extracted": true
}