{
  "article_id": "249439562bd8",
  "url": "https://www.teamtalk.com/arsenal/gunners-receive-180million-boost-trio-leave-bump-significant-transfer-budget",
  "title": "Arsenal receive £180million boost as trio could leave to bump up significant transfer budget",
  "date": "20230530T181500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal receive £180million boost as trio could leave to bump up significant transfer budget\nArsenal will reportedly have £180million to spend this summer, and that could be bumped up by the departures of three first-team players.\nArsenal came close to winning their first Premier League title since the 2003/04 Invincibles season this term. Indeed, they led the league for the majority of the season.\nWhile a late slip, caused by a few poor results, meant Manchester City overcame them and won the title by five points, the season was a huge cause for celebration.\nIndeed, it was a massive step in the right direction for Mikel Arteta’s side to even be fighting for the title. They missed out on Champions League football to rivals Tottenham the season prior, and finished eighth in back-to-back seasons before that.\nArteta has to take a lot of credit for the performances of his side this season. He’s built a culture based around wanting to win, both in the incumbent players and new arrivals.\nYoung stars Bukayo Saka and Gabriel Martinelli have grown into two of the club’s most influential players and Martin Odegaard was one of the best midfielders in the league this season.\nWhat’s more, the signings of Gabriel Jesus and Oleksandr Zinchenko brought with them a knowledge of how to win.\nAdding more experienced stars to the fold next season could allow Arsenal to match their feat, or even go a step better, as they’ll hope to do.\nArsenal given £180million boost\nArteta will look to do that with his significant budget for next season. Indeed, it seems he’s been rewarded for his efforts this term, as the Daily Mail reports he’ll have £180million to improve his squad.\nHaving added some very useful players with less money last season, he should be able to do so more successfully the more he has to spend.\nArteta might be able to boost the funds available to him even further, too.\nThe report names a trio that could bring in good money. Firstly, Kieran Tierney, who has been on Newcastle United’s radar for much of this season and will reportedly bring in £30million if he’s to leave.\nRob Holding is also named, and while he’ll not be very expensive, he’s only under contract until 2024, so selling now and guaranteeing a fee makes sense.\nThe player that will likely command the biggest fee is Thomas Partey. The report suggests he ‘could’ depart – two Italian clubs are reportedly on his tail, and given he cost around £45million, he should bring in a good sum.\nRice and Caicedo could replace Xhaka and Partey\nGranit Xhaka’s exit is also mentioned. While the other players are just possible exits, it seems more than likely that Xhaka will be leaving the club this summer, with Bayer Leverkusen confident of snaring him.\nXhaka and Partey were mainstays in the Arsenal side this season. They were two of the three midfielders that appeared most – Martin Odegaard the other.\nThe Gunners are looking to keep their skipper under lock and key, but if the others depart, they’ll have to be replaced.\nDeclan Rice and Moises Caicedo have both been linked with the Emirates outfit this season. With the funds that they’ll have at their disposal, they could sign both players.\nTheir midfield would be stronger than it was this season if both of those men are to join.",
  "word_count": 572,
  "scraped_at": "2026-02-14T01:48:17.243600",
  "_text_extracted": true
}