{
  "article_id": "24a8bd152b42",
  "url": "https://www.twtd.co.uk/ipswich-town-news/48281/mckenna-tottenham-a-massive-part-in-my-development",
  "title": "McKenna : Tottenham a Massive Part in My Development - Ipswich Town News",
  "date": "20241108T181500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Friday, 8th Nov 2024 17:22\nTown boss Kieran McKenna says his 14 years with Sunday’s opponents Tottenham as a player and a coach played a massive part in his development.\nMcKenna, 38, was with Spurs from 2002-2009 as a player, immediately moving into coaching when his career was cut short by a hip injury when he was on the cusp of making a competitive first-tam debut.\nThe Northern Irishman cut his teeth on the training ground in the Spurs academy and was U18s coach when he departed for a similar role at Manchester United in 2016.\n“It was a massive part of my development,” he reflected ahead of his first visit to the North Londoners as a manager. “I think probably more as a person and as a man than my footballing philosophy in many ways.\n“I went there at 14 years old on a plane from Ireland with three other young footballers, all hoping to make their way across the water in the game, and I was travelling over and back there from then.\n“I moved over there when I’d just turned 16 years old. I've lived in England ever since and spent a large chunk of that time at Tottenham Hotspur, both as a player and as a coach.\n“So it's definitely had a massive bearing on me as a person. It's a great club and one that I've got a fondness for.\n“From a football perspective, as a player it was my opportunity and my access to the professional game in England. And I'm always grateful for those who gave me that opportunity.\n“And definitely from a coaching point of view, as I've said before, I was very blessed to be there at the time that I started there as a coach because I think from an academy level, the club were, I would say, country-wide leaders at that time in terms of how they developed players.\n“The foresight that they had in coaching, tactical things and technical things was probably the best in the country at that time. And we had some brilliant players.\n“And also I had access to some top managers who definitely have influenced me as a coach and as a manager.\n“So, in every different aspect, some of the people that I'm still friends with today, the area and the football club was a big part of my life.”\nQuizzed on whether there was one individual at Spurs who had the greatest impact, McKenna considered.\n“It's hard to limit it to one, to be honest,” he said. “If you twist my wrist, I'd probably say Alex Inglethorpe. I could certainly mention[former Tottenham academy manager, now technical director at The FA] John McDermott in that breath.\n“In the same breath, I think Alex Inglethorpe was the youth team manager at the time and has gone on to be academy manager at Liverpool.\n“In my first steps as a coach, he was the one I shadowed day-to-day and learned the essence of what being a coach was.\n“And the level that he was working to was really, really high and he was fantastic with me as a 22-year-old, to bring me in, to give me access to his way of working, the players he was working with at the time who have gone to have big careers, and he’s stayed a friend since. So there are many, many, but if I say one, I'd probably say Alex.”\nAsked about a highlight of his time with Spurs, McKenna perhaps surprisingly overlooked his goal in a November 2005 2-0 reserves victory over the Blues at Portman Road.\n“You're delving deep into the archives at this stage!” he smiled. “I scored a good back-post header in pre-season, Dimitar Berbatov's first game of English football. I think I got us the winner out against Bordeaux in pre-season. So, very, I guess, sad in some ways if that's your highlight.\n“I played at Celtic Park and playing at Celtic Park was a big one, at 18, with Jacques Santini in his first couple of games. Celtic Park is a massive stadium and a club I had an affiliation with as well. That was a pretty special one.\n“So there were some nice moments around the first team, some great development through the academy and the reserve teams, and, of course, disappointment with the injury. But I was very well looked after by the club and very appreciative of that.\n“The day-to-day, the coaching experiences, the academy in my time there was a fantastic place to be. I think they were probably my first steps there, when I came out of a playing career, unsure exactly what the next steps would be.\n“I had a lot of support there to give me an introduction to the coaching route and I think pretty I much went on crutches from my last surgery to within a few days coaching on crutches in a group that included Harry Kane, Andros Townsend, Ryan Mason, Stephen Caulker, Adam Smith, John Bostock and probably four or five others that I do a disservice who have gone on to have very, very good careers as well.\n“And access to that group, I think the first tournament we went to, that's one area that Tottenham was ahead of other academies in terms of we were going to a lot of international tournaments with the group.\n“Probably getting ahead in terms of technical, tactical things that were being done on the continent because of that access.\n“The first tournament we went to with that group with Alex Inglethorpe and John McDermott, we won the tournament. It had nothing to do with me, but it was great to be part of it; we played against Barcelona in the semi-final and Sporting Lisbon in the final.\n“Probably that first access to top-level coaching, top-level players, top-level European opposition and methodologies. I remember the trip like it was yesterday, and I was absolutely hooked on coaching from that point, from seeing it done at that level, and that was a big part of me getting the bug that I still have today.\n“So that was a very, very early memory, but as a coach, probably a big one in terms of setting me on my way.”\nMcKenna says his transition from playing to coaching was virtually immediate: “Literally a few days. I went into my last surgery, it was my second major hip operation as well as some other little operations around the area, so I went into it knowing that it was pretty much make or break. And when I came off the anaesthetic, the surgeon said that it was a break.\n“From there, I pretty quickly reassessed and made my judgments that I already had started deliberating on before going in for the surgery. So when the surgery didn't go as we hoped and the surgeon wasn't able to get the result that he wanted, I already pretty much made my mind up by that point that that was the route I was going down.\n“So, it was a matter of days before I was out there and soaking up as much as I could and learning as much as I could.\n“It’s an age old adage, but the second best thing to playing is coaching and my only goal at that time was just to coach and try and help the young players.\n“There was no better atmosphere to do it in. The first environment you have coaching experience in is absolutely huge.\n“When they talk about the development of young English coaches, young English managers, for me, the first exposure to what coaching is, what it should look like has the biggest effect, more than any coaching courses or anything else.\n“The first coaches that you’re exposed to that show you what the profession is about have a massive impact and I was very, very lucky with the quality of the people that I had that exposure to early and it set me on the right path, I think.”\nAsked what the players made to him hobbling out to start his first training session on his crutches, he said: “I think they all understood the situation. I was 22, they were 17, 18, so I’d played with a large majority of them on the reserve side.\n“They knew my journey, they knew my character as well, I'd captained a lot of them in the reserve side and they knew the struggle that I'd had with injuries.\n“And they knew that I was taking the step into coaching. So, they were great. You can tell with the careers that so many of them went on to have that it was a pretty special youth team group and a privilege to be around.”\nTottenham had a wide variety of managers and head coaches during his 14 years at the club.\n“When I started my coaching career, it would have been Harry Redknapp, so I went from in my playing career, David Pleat, Glenn Hoddle, Jacques Santini, Martin Jol, Juande Ramos, Harry, Tim Sherwood, André Villas-Boas, Mauricio Pochettino. Quite an eclectic mix,” he recalled.\n“Harry was good, everyone knows what a good people person he is. I was injured in his whole time at the football club, so I think he’d probably barely seen me, I might have trained once in between the two surgeries, so he didn’t know me as a player.\n“But everyone knows what a positive character he is, he put his arm round me a couple of times when I was out with the injury and told me how good a player he thought I was. He probably hadn’t seen me play, but that’s good old Harry, he’s trying to make me feel better. He was very supportive as everyone was.”\nMcKenna was at Spurs at a time when Pochettino was turning them into a side which would finish runners-up in the Premier League in 2016/17, having been third the year before and also in the following campaign, and then reached the final of the Champions League in 2019 before losing to Liverpool.\nDoes he believe the club is in a similar position now under Ange Postecoglou, having made a strong start to the season?\n“The Mauricio period was a very good period for the club and certainly one that had an impact on me,” he said. “As a coach, having good access to how he worked was inspirational at the time.\n“I think they've made clear signs of progress, in my opinion, in terms of building an identity, building a playing style, building a culture, which I think their manager spoke really clearly about. They were the big priorities for him.\n“And if you get those things in place, I think you get a better chance to compete for trophies on a regular basis. And they seem to be making positive steps in that way.\n“It's a club that I want to see do well, not this weekend, but I think it's clear to see that they're building some good things there and anyone who goes there is going to be up for a big challenge.”\nWould he have enjoyed playing in Postecoglou’s Tottenham side? “I wouldn't have been fast enough! I’ve seen how much they sprint. I would have had the engine for it, but I definitely wouldn't have been fast enough. So, I don't think I would have got picked too often.\n“But they're a very good side, there’s no doubt about it. I think the football that they play and the ethos that he's built there in terms of their identity are things that the supporters are rightly very much behind.\n“And I think he's done some very impressive work over the year and a half that he's been there. And we know the scale of the challenge going there on Sunday, but it's one that we're looking forward to.”\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 2022,
  "scraped_at": "2026-02-14T02:08:26.321573",
  "_text_extracted": true
}