{
  "article_id": "24c495a1f7c7",
  "url": "https://www.empireofthekop.com/2024/01/06/arteta-wants-fa-cup-replays-scrapped/",
  "title": "  Has to be considered  - Arteta plea ahead of Arsenal v Liverpool will likely get Klopp approval",
  "date": "20240106T180000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta may have irked Liverpool fans and Jurgen Klopp in the past, but they’d likely be on board with one viewpoint he’s communicated ahead of Arsenal’s FA Cup clash against the Reds this weekend.\nThe two clubs drew 1-1 at Anfield in the Premier League a fortnight ago, and a repeat scoreline on Sunday would necessitate a replay on Merseyside the week after next, throwing a spanner in the works in terms of their upcoming mid-season break.\nThe Gunners boss was asked whether replays should be scrapped altogether in football’s oldest tournament, replying (via RTE.ie): “I think so. We will see what happens because with the new format of the Champions League. There will be more games (to play) so I don’t know how we are going to fit them in.\n“The (mini) break will be minimal and we have plans for both scenarios. We want to win the game (v Liverpool) and we will try to win the game, but that (cancelling replays) has to be considered.”\nKlopp has been quite outspoken on the topic of fixture congestion already this season, so he’d likely nod in agreement with Arteta’s plea for FA Cup replays to be discontinued for good.\nIndeed, when Liverpool were held to a 2-2 draw by Shrewsbury in the fourth round in 2020, necessitating a rematch at Anfield during that season’s winter break, the Reds boss delegated the fixture to under-21 coach Neil Critchley, with a youthful LFC side winning 1-0 while the first-team players were rested.\nAs it stands, Round 4 is the latest juncture at which FA Cup ties are replayed, with every match thereafter settled on the day.\nThe topic of replays in the competition is a thorny one with no easy answer – while the likes of Liverpool and Arsenal would surely prefer to see them binned altogether, clubs lower down the pyramid justifiably argue that the earnings from such fixtures make a huge difference to their finances.\nIt’d be impossible to please every stakeholder, given the contrasting perspectives, but we’re fairly sure both Klopp and Arteta won’t complain if this is the last season in which drawn FA Cup matches up to the fourth round go to a replay.\nOne (theoretically) simple solution to that, then – beat Arsenal tomorrow, Reds!",
  "word_count": 381,
  "scraped_at": "2026-02-14T02:20:21.487470",
  "_text_extracted": true
}