{
  "article_id": "24c9ae305f03",
  "url": "https://www.france24.com/en/live-news/20240315-champions-league-quarter-final-tie-by-tie-guide",
  "title": "Champions League quarter - final tie - by - tie guide",
  "date": "20240315T133000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League quarter-final tie-by-tie guide\nParis (AFP) – AFP Sport takes a look at each tie after Friday's draw for the quarter-finals of this season's UEFA Champions League:\nIssued on:\nArsenal (ENG) v Bayern Munich (GER)\nThe standout storyline here will be the return of former Tottenham Hotspur talisman Harry Kane to London as Bayern head to the Emirates Stadium for the first leg.\nBayern are the obvious favourites on the basis of their recent history in the Champions League, given that the six-time European Cup winners are into the quarter-finals for the 12th time in 13 years. Arsenal, in contrast, beat Porto on penalties in the last 16 to reach the last eight for the first time since 2010.\nHowever, Mikel Arteta's team are enjoying a fine season and are currently top of the Premier League, while Bayern are off the pace at the top of the Bundesliga in what is their final season under Thomas Tuchel -- Champions League winner as coach of Chelsea in 2021 -- before he departs in the summer.\nBayern have won four Champions League knockout ties against Arsenal in the last two decades, including a 10-2 aggregate win in the last 16 in 2017.\nAtletico Madrid (ESP) v Borussia Dortmund (GER)\nThis tie brings together the two teams who are arguably the least strong remaining in the competition on paper, with both currently in a battle to qualify for next season's Champions League via their domestic leagues.\nHowever, Dortmund topped their group ahead of Paris Saint-Germain, AC Milan and Newcastle United, before beating PSV Eindhoven in the last 16. Champions League winners in 1997, they are aiming to reach the semi-finals for the first time since losing the final in 2013.\nAtletico, three-time losing finalists in the competition, reached this stage after beating last season's runners-up Inter Milan on penalties at the end of an enthralling last-16 tie.\nDiego Simeone's side are formidable at home, where they have lost just once in 21 games this season in all competitions. They have often struggled on their travels though, meaning securing a positive result at home in the first leg may well be crucial.\nReal Madrid (ESP) v Manchester City (ENG)\nThis is obviously the tie of the round, bringing together the last two winners of the competition as they meet for the third season running in the competition, and the fourth time in the last five campaigns.\nCity are clearly the benchmark in European football just now, even if they currently sit third in the Premier League. They won the Champions League for the first time last season after blowing Real away in the semi-finals with a stunning 4-0 win in the second leg in Manchester. This is their seventh consecutive appearance in the quarter-finals.\nReal had beaten City in the semi-finals in 2022 on the way to winning the trophy for a record-extending 14th time. Carlo Ancelotti's team are on course to comfortably win La Liga and appear perhaps the best-equipped side to stop City, although they struggled to see off RB Leipzig in the last 16.\nThe Spanish giants have also struggled with injuries this season and may find it hard to cope with such an accomplished City side over two legs, just as they did in last season's encounter.\nParis Saint-Germain (FRA) v Barcelona (ESP)\nThis pairing immediately brings up memories of the remarkable last-16 tie between the clubs in 2017, when PSG won 4-0 at home in the first leg only to lose 6-1 in the return in a stunning implosion.\nBarcelona went into the 88th minute of the second leg needing to score three times and duly did so. The Catalan club's coach at that time was Luis Enrique, now in charge of PSG.\nThe French club responded to that humiliation by signing Neymar from Barcelona later that year, activating the Brazilian's 222 million-euro release clause in a world-record transfer. They then eliminated Barca in the last 16 in 2021, when Kylian Mbappe netted a hat-trick in the first leg at the Camp Nou.\nLionel Messi left Barcelona for a two-year spell in Paris at the end of that season, and there is little love lost between the clubs now.\nFive-time European champions Barca are in the quarter-finals for the first time since 2020, when they lost 8-2 to Bayern behind closed doors in Lisbon.\nPSG have never won the Champions League and this is their last chance to do so before Mbappe departs at the end of the season when his contract expires.\n© 2024 AFP",
  "word_count": 758,
  "scraped_at": "2026-02-14T02:10:47.913933",
  "_text_extracted": true
}