{
  "article_id": "24e02ddddb1d",
  "url": "https://www.90min.com/arsenal-injuries-rice-odegaard-havertz-latest-chelsea-clash",
  "title": "Arsenal injuries : Rice , Odegaard and Havertz latest ahead of Chelsea clash",
  "date": "20241108T201500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal injuries: Rice, Odegaard and Havertz latest ahead of Chelsea clash\n- Arsenal take on improving London rivals Chelsea at Stamford Bridge on Sunday\n- Martin Odegaard, Declan Rice and Kai Havertz among players with knocks\n- Mikel Arteta's side looking to get back on track after drop off in form and results\nMikel Arteta has cast doubt on the involvement of Declan Rice when Arsenal take on Chelsea at Stamford Bridge on Sunday, and is also unsure whether Martin Odegaard, Kai Havertz or Mikel Merino will be fit to play.\nThe Gunners are enduring an uncharacteristically sticky patch of form, recently losing to Bournemouth and Newcastle in the Premier League before slipping to a 1-0 defeat to Inter in the Champions League.\nLiverpool also left a recent visit to the Emirates Stadium with a well-deserved point, though Arsenal's drop off in form has coincided with a troubling number of injuries to key players.\nBukayo Saka has spent time on the sidelines, alongside Jurrien Timber, Riccardo Calafiori and Takehiro Tomiyasu, who has played just six minutes of Premier League football in 2024/25.\nCaptain Odegaard has missed two months of action because of an ankle injury, returning as a substitute against Inter on Wednesday, while Rice missed that game due to a toe problem. As for Havertz and Merino, they were withdrawn at San Siro because of a blow to the head and illness respectively.\n\"I have to be very vague on that one because there’s no clarity on whether he’s going to be fit for the weekend,\" Arteta told reporters, when asked whether Rice would be available for the clash with Chelsea.\n\"[Whether he has a broken toe is] for the doctor, what I can say is that he hasn't trained yet and it is not clear whether he’s going to be available or not to play.\"\nThe Spaniard was more optimistic about a potential start for Odegaard in west London, saying: “Everybody that is in the squad is going to be fit and available to start the game, so then it will be a decision whether it is too early or the right moment for him to make that step again.\n\"We'll have to wait until tomorrow to see how they react,” he concluded when probed on the condition of Havertz and Merino. \"Kai had quite a nasty cut and he could not continue. With Mikel, to be fair the day before he wasn't feeling great and we decided to sub him at half-time.\"\nChelsea have their own injury worries ahead of Arsenal's visit, with Cole Palmer struggling with a knee issue picked up at Manchester United, but are in higher spirits than the Gunners in terms of results - Thursday's romping 8-0 win over Noah in the Conference League building on an impressive start to the Premier League season that sees Enzo Maresca's side sit ahead of Arsenal in fourth.",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:02:07.197252",
  "_text_extracted": true
}