{
  "article_id": "252ffa0c6c75",
  "url": "https://www.caughtoffside.com/2024/10/28/carragher-trent-alexander-arnold-claim/",
  "title": "Jamie Carragher makes exit claim about Liverpool star following 2 - 2 draw against Arsenal",
  "date": "20241028T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football pundit Jamie Carragher believes Liverpool right-back Trent Alexander-Arnold will leave the club to join Real Madrid.\nThe English defender has entered the final year of his contract at Anfield and he has been constantly linked with a move to Real Madrid.\nThe right-back, who was crucial in Liverpool’s equaliser against Arsenal at the Emirates Stadium, has spoken about his desire to win the Ballon d’Or in the future and Carragher believes that he can only fulfill that dream if he joins the La Liga giants.\n‘My first thoughts when I read that was you’re not going to win that as a right-back for Liverpool. Ballon d’Or winners usually play for Real Madrid or Barcelona – that’s where the best players in the world go,’ Carragher told Sky Sports.\n‘When asked about his ambitions, whether he would pick the Champions League, World Cup or Ballon d’Or, he chose the Ballon d’Or, which I thought was a bit strange or bizarre.\n‘You’d think he’d pick the World Cup or Champions League as it’s a team game. But yeah, he’s got massive ambitions – and why not? You’ve only got one career. He’s a unique full-back, absolutely amazing.\n‘I think Virgil van Dijk and Mo Salah will actually stay. But the longer it goes on, I think he’ll move to Real Madrid. There will be a lot of frustration with supporters if this carries on and he doesn’t sign a contract.’\nAlexander-Arnold has been one of the pillars of the Liverpool team in recent years and under former manager Jurgen Klopp, he has emerged as one of the best right-backs in the game.\nHis attacking nature as a right-back separates him from all the other players in his position and Liverpool have benefitted a lot from his versatility.\nTrent Alexander-Arnold has interest from European giants\nReal Madrid, along with Barcelona and Bayern Munich, have been linked with a move for the Premier League star and it remains to be seen what decision he makes over his future.\nThe La Liga champions have the edge over other clubs since Alexander-Arnold’s close friend Jude Bellingham plays for them and the fact that they compete to win the Champions League every season makes them the most attractive destination.\nLiverpool face concerns over the future of two other players, Mohamed Salah and Virgil Van Dijk, but they would be more worried about Alexander-Arnold since the right-back has a lot of football left in his career and his quality will be almost impossible to find in the market.",
  "word_count": 421,
  "scraped_at": "2026-02-14T02:14:47.094043",
  "_text_extracted": true
}