{
  "article_id": "253a0b7e5a5e",
  "url": "https://www.teamtalk.com/manchester-city/outstanding-ace-tipped-messi-level-impact-statement-mls-transfer",
  "title": "Man City transfers :  Outstanding  ace tipped to have near Messi - level impact with statement move",
  "date": "20241031T193000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\n‘Outstanding’ Man City ace tipped to have near Messi-level impact with statement transfer\nManchester City star Kevin De Bruyne has been backed to follow in the footsteps of world-renowned players such as Lionel Messi, David Beckham and Zlatan Ibrahimovic by bringing yet more fans to Major League Soccer.\nDe Bruyne has been an incredible servant to Man City, having registered 103 goals and 171 assists in 388 matches since joining the club from Wolfsburg in August 2015. The attacking midfielder has played a key role in City winning a host of silverware including six Premier League titles, one Champions League, two FA Cups and five League Cups.\nHowever, De Bruyne’s time at the Etihad could be coming to an end. His contract expires at the end of the season and City are unsure whether to renew it amid his injury problems.\nOn Saturday, it emerged that the playmaker has opened talks with San Diego FC over a potential switch to MLS.\nBruce Arena, who formerly managed David Beckham at LA Galaxy, has labelled De Bruyne an ‘outstanding person’ while discussing top stars who have improved the quality and following of football/soccer in the US.\n“I mean, if they come here with the right attitude, I think it’s a real plus. I’ve met De Bruyne a couple of times,” Arena said on talkSPORT.\n“He’s an outstanding person. If he decides to come here, I think he’ll have the right attitude and bring a lot to the league.\n“I think Messi’s done a fabulous job. Zlatan [Ibrahimovic] has done a great job.\n“Robbie Keane was here and did an outstanding job. So the contributions from those type of players is huge.\n“So I think it’s only a positive to MLS.”\nDON’T MISS: Guardiola reacts to Man Utd pursuit of Amorim and sends classy Man City message to fired Ten Hag\nDe Bruyne weighing up options\nDe Bruyne is keeping his options open in case City opt against renewing his contract.\nOver the summer, the Belgium captain was linked with a move to Saudi Arabia, and he admitted he would consider such a proposal due to the massive sums on offer.\nHowever, Messi’s switch to Inter Miami has helped MLS become more glamorous, and this could entice De Bruyne to reject the Saudis and join a club such as San Diego instead.\nCity already have Phil Foden in their squad, but they will probably need another top player too in order to help replace De Bruyne’s huge influence.\nSources have confirmed to TEAMtalk that the Citizens are tracking both Florian Wirtz and Jamal Musiala.\nCity want to rival Real Madrid for Wirtz, who is expected to leave Bayer Leverkusen at the end of the campaign.\nMusiala will be harder to sign as Bayern Munich hope to build their team around him.\nMan City news: Amorim rejection, Ballon d’Or insight\nMeanwhile, reports have explained why Ruben Amorim did not join City or Liverpool before reaching an agreement to manage Manchester United.\nThere was a clear connection at City, as Sporting CP’s director of football Hugo Viana is due to replace Txiki Begiristain. But the City hierarchy felt Amorim would not fit in ‘stylistically’ with the first-team squad if he came in to succeed from Pep Guardiola.\nLiverpool, meanwhile, were put off by the fact Amorim is determined to play a back three. This was supposedly a ‘deal-breaker’ for the Reds.\nElsewhere, Ballon d’Or chief Vincent Garcia has explained how Vinicius Junior’s Madrid team-mates affected his chances of winning the coveted trophy, allowing Rodri to become the first ever recipient from City.\n“Obviously, Vinicius surely suffered from the presence of [Jude] Bellingham and [Dani] Carvajal in the top five because, mathematically, that took some points away from him,” Garcia said.\n“This also sums up Real Madrid’s season, which took between three and four players and the juries distributed their decisions among them, which benefited Rodri. What I can guarantee is that no one at Real Madrid or at Manchester City was aware.”",
  "word_count": 673,
  "scraped_at": "2026-02-14T02:01:51.711119",
  "_text_extracted": true
}