{
  "article_id": "2544ca468ada",
  "url": "https://www.unitedinfocus.com/transfer-news/man-utd-chase-for-bryan-mbeumo-hits-new-milestone-after-star-made-decision-to-join-red-devils/",
  "title": "Man Utd chase for Bryan Mbeumo hits new milestone after star  made decision  to join Red Devils",
  "date": "20250703T010000Z",
  "domain": "unitedinfocus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are still persisting with a deal to sign Brentford star Bryan Mbeumo.\nThe transfer window is underway, and Manchester United have one signing to show for their efforts. That won’t be enough for Ruben Amorim to secure better results next season, but Ineos will maintain their work in progress will take more time.\nUnited signed Matheus Cunha from Wolves in a deal that will see the Brazilian move to Old Trafford this summer. More players are expected to follow suit with Diego Leon travelling to Manchester, where he will finally become a United player.\nThere will also be departures at Old Trafford this summer. Several of the United players who spent last season on loan have been linked with moves away, including Antony and Marcus Rashford.\nUnited fans are eager to see the progress speed up. There is excitement that next season will be a better season for the Red Devils, even though it will be a second consecutive year without Champions League football.\nOne month since Bryan Mbeumo decided Manchester United\nAs one of the best attackers in the Premier League, it shouldn’t come as a surprise that many teams were chasing the Cameroon international’s signature this summer.\nNewcastle were closely monitoring Mbeumo’s situation and Tottenham considered a move after appointing Thomas Frank as manager.\nHowever, a month ago, it emerged that Mbeumo had decided to join United over other clubs.\nThe update came from The Athletic’s David Ornstein, who exclusively revealed Mbeumo decided to join United with both clubs expected to open talks. Arsenal were another noted interested party that proved unsuccessful in their attempts to sign the 25-year-old forward.\nThat means we are still waiting on United and Brentford to reach an agreement that would see Mbeumo move to Old Trafford.\nBrentford have delayed proceedings by rejecting United’s initial two offers.\nLast week, United’s second bid for Mbeumo was rejected, worth £55 million plus an additional £5 million.\nBrentford’s director Phil Giles has since said Mbeumo is happy to stay.\nA third offer is expected to include more favourable bonuses to complete the deal.\nUnited were bound to accelerate interest in players once it reached July and we are likely to see that happen in the coming days.\nAlthough it is becoming a saga, Mbeumo is still expected to become a United player this summer.\nIt remains to be seen which striker United will sign to join Brentford’s talisman.\nMbeumo enjoys knuckleball practice with YouTuber\nJeremy Lynch is a YouTuber who creates content around football.\nIn one of his latest videos, Lynch performs the knuckleball shot with Mbeumo.\nMbeumo shows his skills by hitting the top corner with his knuckleball attempts.\nHopefully, it won’t be long before Mbeumo is doing this for United.",
  "word_count": 458,
  "scraped_at": "2026-02-14T01:58:41.939525",
  "_text_extracted": true
}