{
  "article_id": "2589f1fb29ae",
  "url": "https://www.thenews.com.pk/print/1141608-manchester-united-sir-jim-ratcliffe-agrees-deal-to-buy-25pc-stake-for-about-1-25bn",
  "title": "Manchester United : Sir Jim Ratcliffe agrees deal to buy 25pc stake for about £1 . 25bn",
  "date": "20231225T033000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United: Sir Jim Ratcliffe agrees deal to buy 25pc stake for about £1.25bn\nLONDON: British billionaire Sir Jim Ratcliffe has agreed to buy a 25% stake worth about £1.25bn in Manchester United, BBC reported.\nAs part of the deal, Ratcliffe’s Ineos Group will take control of the club’s football operations.\nRatcliffe, 71, will also provide $300m (£236m) for future investment into the club’s Old Trafford stadium.\nThe announcement comes 13 months after the club’s owners, the Glazer family, stated they were considering selling to “explore strategic alternatives”. The American family bought the club for £790m in 2005. The only other publicly declared bidder, Qatari banker Sheikh Jassim bin Hamad Al Thani, withdrew his offer to buy 100% of the club in October.\nUnited have struggled on the pitch this season and have not won the Premier League since 2013, while there have been regular protests against the Glazer ownership.\nManchester-born Ratcliffe is chairman of petrochemicals company Ineos and says he is a “lifelong supporter of the club”. He tried and failed to buy Chelsea last year.\nIn a statement, he said: “Whilst the commercial success of the club has ensured there have always been available funds to win trophies at the highest level, this potential has not been fully unlocked in recent times.\n“We will bring the global knowledge, expertise and talent from the wider Ineos Sport group to help drive further improvement at the club, while also providing funds intended to enable future investment into Old Trafford.\n“We are here for the long term and recognise that a lot of challenges and hard work lie ahead, which we will approach with rigour, professionalism and passion. We are committed to working with everyone at the club -- the board, staff, players and fans -- to help drive the club forward.\n“Our shared ambition is clear: we all want to see Manchester United back where we belong, at the very top of English, European and world football.”\nThe club say the deal is “subject to customary regulatory approvals” but are “hopeful it will be completed as soon as possible”.\nRatcliffe has agreed to buy 25% of the club’s class B shares, largely held by the Glazer family, who own 69% of the club, and contain almost all the voting rights, and up to 25% of its class A shares, which are listed on the New York Stock Market.It means the Glazer family will retain a majority stake in the club. Taking on sporting control at the club means Ineos will oversee the men’s and women’s football operations and academies. They will also get two seats on the Manchester United PLC and Manchester United Football Club boards.\nSubject to necessary approvals, Ratcliffe will delegate his seats on the PLC board to John Reece, a shareholder of Ineos, and Rob Nevin, chairman of Ineos Sport.\nOn the UK club board, he will delegate his seats to former British Cycling chief Sir Dave Brailsford and former Juventus and Paris St-Germain executive Jean-Claude Blanc.\nUnited’s executive co-chairmen and directors, Avram Glazer and Joel Glazer, said: “Sir Jim and Ineos bring a wealth of commercial experience as well as significant financial commitment into the club.\n“Through Ineos Sport, Manchester United will have access to seasoned high-performance professionals, experienced in creating and leading elite teams from both inside and outside the game.\n“Manchester United has talented people right across the club and our desire is to always improve at every level to help bring our great fans more success in the future.”\nIneos already owns French Ligue 1 club Nice and Swiss club Lausanne.\nIts sporting portfolio also includes high-profile sailing team Ineos Britannia -- led by Sir Ben Ainslie -- which is aiming to win the 2024 America’s Cup for Great Britain.\nIneos also has a five-year partnership with Formula 1 team Mercedes, owning a third of the team -- and took over the British-based Team Sky in cycling in 2019.\nFans opposed to the Glazers’ continued involvement at United have held a series of protests inside and outside Old Trafford over the last 12 months of a process which people close to it confidently predicted would be concluded by the end of last season.The past decade, since legendary manager Sir Alex Ferguson retired in 2013, has seen inconsistency on the pitch despite a high transfer spend, and several big name managers hired and sacked.\nUnited are again inconsistent this season under Dutch manager Erik Ten Hag, having lost 13 of their 26 games in all competitions, sitting eighth in the Premier League and having finished bottom of their Champions League group and been knocked out of the EFL Cup.\nIn January, Ratcliffe’s firm Ineos officially stated an interest and said the company had “formally put ourselves into the process”.Ineos and Sheikh Jassim submitted their first bids for United in February, with the Qatari consortium saying their offer “plans to return the club to its former glories”.\nBy March, both parties had entered second, revised bids after a deadline was extended at their request, amid confusion.\nElliott Investment Management and leading private equity group Carlyle, both based in the US, also entered the race but were only willing to purchase a minority stake.\nThe potential sale reached a third round of bidding in April, with Thomas Zilliacus saying he had also submitted a bid to buy the club.\nHowever, the Finnish entrepreneur declined to enter another offer, saying he would not participate “in a farce” and instead decided to keep his earlier second bid on the table.\nAlthough the Glazer family did not respond following the deadline on 28 April, there had been increasing confidence in the Ineos camp that their efforts to take over at Old Trafford would be successful after it emerged its bid put a higher overall value on the club than Sheikh Jassim, because he was paying more for a smaller stake.\nIn May, Sheikh Jassim made an improved fourth bid of nearer to £5bn for 100% of United, in an offer that would clear the almost £1bn debt of the club and included a separate fund for the club and local community.\nSheikh Jassim withdrew from the process to buy United in October after further talks broke down.\nRatcliffe had already amended his initial plan to buy the Glazers’ 69% shareholding and reduced it to a ‘majority’ stake. However, it was only when he reduced it again, to 25%, that the potential for an agreement increased.\n-\nJames Van Der Beek's Final Conversation With Director Roger Avary Laid Bare: 'We Cried'\n-\nJaden Smith Walks Out Of Interview After Kanye West Question At Film Premiere\n-\nMichelle Obama Gets Candid About Spontaneous Decision At Piercings Tattoo\n-\nWhy Halle Berry Wasn't Ready For Marriage After Van Hunt Popped Question? Source\n-\nBunnie Xo Shares Raw Confession After Year-long IVF Struggle\n-\nBrooks Nader Reveals Why She Quit Fillers After Years\n-\nTravis Kelce Plays Key Role In Taylor Swift's 'Opalite' Remix\n-\nHow Jennifer Aniston's 57th Birthday Went With Boyfriend Jim Curtis\n-\nJoJo Siwa Shares Inspiring Words With Young Changemakers\n-\nJames Van Der Beek Loved Ones Breaks Silence After Fundraiser Hits $2.2M\n-\nDisney’s $336m 'Snow White' Remake Ends With $170m Box Office Loss: Report\n-\nTravis Kelce's Mom Donna Kelce Breaks Silence On His Retirement Plans\n-\nPremiere Date Of 'Spider-Noir' Featuring Nicolas Cage Announced\n-\nPedro Pascal's Sister Reveals His Reaction To Her 'The Beauty' Role\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters",
  "word_count": 1264,
  "scraped_at": "2026-02-14T01:56:38.139240",
  "_text_extracted": true
}