{
  "article_id": "2598c6ebc3d9",
  "url": "https://www.con-telegraph.ie/2025/02/24/arne-slot-refuses-to-believe-premier-league-title-is-in-liverpools-hands/",
  "title": "Arne Slot refuses to believe Premier League title is in Liverpool hands",
  "date": "20250224T094500Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot refuses to believe Premier League title is in Liverpool’s hands\nBy Carl Markham, PA\nLiverpool head coach Arne Slot refused to consider the prospect that the Premier League title was theirs to lose after a 2-0 victory over Manchester City sent his side 11 points clear at the top.\nFirst-half goals from Mohamed Salah, his 30th of the season, and Dominik Szoboszlai were followed by a disciplined defensive performance after the break to secure a first league victory at the Etihad Stadium since November 2015.\nAlthough second-placed Arsenal have a match in hand, Slot’s team would have to lose three times – they have suffered one league defeat all season – in their last 11 matches to even offer the chance of being overtaken, and then only if Mikel Arteta’s side were able to win every game.\nBut Slot is refusing to look beyond Wednesday’s visit of Newcastle despite joyous fans singing about winning the league at the final whistle.\n“The fans can sing whatever they want, but we know as a team how hard we have to work for every single win,” he said.\n“It is only three days ago someone asked me if we had a dip on Wednesday (in a 2-2 draw with Aston Villa). I don’t believe that as well as I’m calm now about this win.\n“You can ask every single question you want, but it is so hard to judge the league table before every single game is played.\n“In my opinion, Villa and City away (Liverpool’s last two matches) are two very difficult games so you can drop points there.\n“In every other league having a lead like this would be very comfortable – except for this one because this league every single game gives you a lot of challenges.”\nSlot did admit, however, the long-awaited league win at City – something predecessor Jurgen Klopp never managed against Pep Guardiola – felt important.\n“If you play away at the Etihad and win it is always a big win, no matter what the league table looks like because if you play away against a Pep team it is almost impossible to have more ball possession than his team has,” he added.\n“We knew we had to defend a lot and that is what we did really well and there were some good moments in the counter-attack that went for us in the game.”\nSlot was asked whether, in his maiden season, he ever envisaged being in this position.\n“No, because you never think like that. If you start somewhere you don’t think where you are (going to be) in terms of points at the end of the season,” he said.\n“What we do know is no-one saw us a title contender when we started in the beginning of the season and I think no-one in the world of football expected City not to be so close to the one that leads the league if they are not the one that leads the league.\n“Two years ago Liverpool played Champions League and wanted to compete for the league and that was difficult and they ended up sixth.\n“Last season they were in the Europa League and were competing until five, six, seven or eight games before the end.\n“What I was curious was about can we do both? Until now we are doing quite a good job in both competitions, but also we have quite a difficult draw in the Champions League (against Paris St-Germain).”\nGuardiola was asked whether he now expected Liverpool to win the league, but he could not bring himself to say so, although he suggested they were the only team who could lose it.\n“How many points advantage for them over Arsenal? It’s a lot. How many games have they lost?” he said.\nWhen pushed as to whether he saw their rivals as champions-elect he added: “I didn’t say yes.”\nCity are now 20 points behind Liverpool and their main concern is, at the very least, maintaining their fourth place to qualify for the Champions League.\n“If it doesn’t happen it’s because we were not good enough, not because a lack of hunger and desire,” he said.\n“We saw it against Newcastle (a 4-0 win last weekend) and we saw it again today. It is so tight with four or five teams and Nottingham (Forest), Newcastle, Aston Villa are so good.\n“It’s not enough, but I recognise my team in the last two games in the Premier League – they were brilliant against both Newcastle and Liverpool.\n“The pace today, the rhythm, the pressing, the solidarity for most of them playing in difficult positions, I approve it and it was really good.”",
  "word_count": 783,
  "scraped_at": "2026-02-14T02:14:59.448998",
  "_text_extracted": true
}