{
  "article_id": "25dcfb5041f7",
  "url": "https://www.the42.ie/5-uncapped-players-who-could-be-set-for-an-ireland-call-up-6181949-Sep2023/",
  "title": "5 uncapped players who could be in line for an Ireland call - up",
  "date": "20230930T123000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "IRELAND BOSS Stephen Kenny has admitted his team’s chances of group qualification for the 2024 Euros are all but over following the recent home loss to Netherlands.\nSo, from an Irish perspective, the upcoming clashes against Greece (13 October) and Gibraltar (16 October) are dead rubbers.\nWith Nations League games prioritised over friendlies these days, it is rare enough to be involved in a fixture with nothing meaningful at stake.\nConsequently, as unappealing as they seem, these two matches could be an invaluable chance to experiment with younger players as Ireland plan for more important encounters in the long term.\nAhead of the upcoming squad announcement, below, we have looked at some inexperienced players who could be given a chance in addition to assessing how some of the more established names are getting on at club level.\n5 uncapped players who could earn an Ireland call-up\nLiam Scales\nThere is plenty of competition at centre-back in Stephen Kenny’s squad, so breaking in is not easy but Scales might be set for an opportunity. He has been involved before, of course, but has yet to play. Nonetheless, not too many Irish players have Champions League group stage experience under their belt and the former Shamrock Rovers man performed commendably despite Celtic’s recent 2-0 loss away to Feyenoord. He has generally exceeded expectations with the Bhoys this season and his ability to play full-back and wing-back is another bonus. Having looked surplus to requirements under Ange Postecoglou, he has capitalised on injuries to other defenders and taken his chance following Brendan Rodgers’ appointment as manager, featuring four times this season in the Scottish Premiership and keeping a clean sheet on each occasion.\nAndrew Moran\nUnderestimate Andrew Moran at your peril. Frequently written off as too small in his schoolboy days, he became accustomed to proving people wrong. Anyone who watched him star for Ireland U21s recently at Turner’s Cross will be aware of his talent, while even more exceptional was his outstanding display for Blackburn midweek, registering two goals and two assists as they outclassed Cardiff in the League Cup. Boss Jon Dahl Tomasson heaped praise on the Brighton loanee, and the Dane certainly rates the 19-year-old, playing him in five Championship games so far this season (three of which were starts). And while a degree of caution naturally needs to be exercised when discussing such a young player, Moran is an exciting prospect and the type of creative attacking midfielder that Ireland have sorely lacked in recent years.\nJonathan Afolabi\nThere are several League of Ireland players Stephen Kenny sees as having great potential — Derry’s Brian Maher and Shamrock Rovers’ Neil Farrugia come into this category, having both featured in Ireland’s Bristol Training Camp last May. Bohemians’ Jonathan Afolabi is also highly rated, having been called up to the squad for the Netherlands match after a couple of injury withdrawals. The 23-year-old has had an excellent season with Bohemians, recovering from a difficult few years where a move to Celtic never fully paid off while a period of instability didn’t do much for his confidence either, with stop-start loan spells in the Scottish Championship and League One hampering early progress that saw him named in the 2019 Uefa European Under-19 Championship Team of the Tournament in attack, alongside Ferran Torres and Félix Correia, as Ireland made it to the semi-finals. Afolabi certainly won’t be top of the pecking order, but he is the type of physically imposing striker Stephen Kenny invariably favours up top, and he could serve as ample backup to Evan Ferguson and Adam Idah, both of whom have struggled with injury problems in recent times.\nFinn Azaz\nAzaz has featured in all eight of newly promoted Plymouth’s Championship games amid a solid start to the season — they are 12th in the table at the time of writing. The Aston Villa loanee already has two goals to his name, including one in last weekend’s 6-2 win, when a Norwich defence that included Shane Duffy was given a torrid time. Having stood out in a previous loan spell with the club in League One last season, scoring eight goals from 39 appearances in all competitions, the 23-year-old appears to have seamlessly made the step up to England’s second tier, so there’s no reason why he can’t do the same for international football ultimately.\nSammie Szmodics\nBorn in England, Szmodics has a Longford-born grandmother and a Hungarian-born grandfather leaving him with multiple options at international level. He originally received a squad call-up as far back as May 2021 but had to wait until March of this year after finally receiving international clearance following issues with his passport. However, so far Kenny has resisted the temptation to call on the 28-year-old since that development. That might be about to change, however, following an excellent start to this campaign — his five goals have left him among the top scorers in the Championship. That clinical edge might be exactly what’s required to help take the Irish team to another level.\n5 in-form Ireland players\nEvan Ferguson\nHaving established himself as a Brighton first-team regular last season, Ferguson has built on that promising start this year. If he hadn’t already, the phenomenal hat-trick against Newcastle felt like the Meath native truly announcing himself as one of the outstanding talents in world football. Nonetheless, the injury that ruled him out of the France and Netherlands qualifiers seems to have curbed his momentum somewhat. He made his first start since then last Sunday in the 3-1 defeat of Bournemouth but was replaced at half-time. However, that minor setback is unlikely to impact his remarkable confidence and admirable mentality — it’s been a long time since an Irish player has had such a high ceiling and the former Bohemians youngster is expected to go to the very top of the game if he can avoid injuries. And already this season, he has made a considerable impact, with four goals from three starts.\nFesty Ebosele\nA completion of Festy Ebosele’s wonderful MOTM performance from Sunday last !🇮🇪\n— Rep of Ireland Player Tracker (@reptracker) September 28, 2023\nHe’s really taking his game to the next level.pic.twitter.com/ro5nW4MYSy\nUsed mainly as an impact sub for Udinese last season, this year, the Enniscorthy native appears to have gone up a level. Aided by the departure of Tottenham-bound rival wing-back, Destiny Udogie, the 21-year-old has caught the eye in Serie A, prompting Stephen Kenny to hand him a senior debut in the last international window. It has not been a good start to the season for his team — they are 18th in the table after six games — but Ebosele has come on well regardless, featuring in every game so far and starting on four occasions.\nAaron Connolly\nAfter a difficult period in which Connolly’s young career to some observers looked in danger of petering out prematurely, the Galway native is starting to show glimpses again of the type of form that earned him rave reviews at Brighton in the first place. In Liam Rosenior, he has a coach who has known him since his early Seagulls days and has shown considerable faith in the young striker following underwhelming loan spells at Middlesbrough and Venezia, and the manager has been rewarded for this support, with five goals so far this season despite four of his eight appearances coming from the bench. His potential remains sky high — as Rosenior said recently: “Aaron’s capable of anything he wants in his career if he stays on track… He’s not 100% fit, which is scary.” And the Galway native is well aware that some people wrote him off all too soon: “I feel like a lot of people retired me from playing for Ireland at 23 years of age,” Connolly told Sky Bet during the week. If he can maintain his current form, the talented forward will surely earn far more caps than the nine he already has under his belt.\nAlan Browne\nOne of the most underrated Irish players at both club and international level, Browne is not as flashy as some but possesses a faultless attitude and work-rate. He was among the standout players after being handed a start as a midfielder in the loss to Netherlands following a stint at right wing-back for the France game in Matt Doherty’s absence through suspension. He has been similarly good for Preston this season, starting all eight of their Championship games so far. It would be great to see the Cork native grace the Premier League and it is not inconceivable. While Ryan Lowe’s side would not be considered among the favourites from promotion, their early form is promising as they sit third in the table, just a point off leaders Leicester City.\nJason Knight\nAnother midfielder who tends to be underappreciated at times, albeit Knight badly needed a move last season after Derby failed to secure promotion from League One at the first attempt. The subsequent switch to Bristol City has worked out well so far — Nigel Pearson’s side are ninth in the Championship. And alongside fellow Irish stars Mark Sykes and Max O’Leary, Knight has been an integral figure, starting all eight league games since the campaign’s outfit, while the 22-year-old also registered a brace in the Robins’ emphatic 5-1 League Cup victory against Oxford last month.\n5 Ireland players who’ve had a frustrating start to the season\nCaoimhín Kelleher\nThere was a widespread expectation that Kelleher would leave Liverpool in the summer, with even Ireland boss Stephen Kenny suggesting a move would be beneficial to the under-utilised player. However, with no concrete offers materialising, the 24-year-old looks set for another campaign as the Reds’ number two. He has made two appearances, one apiece in the Europa League and EFL Cup, wearing the captain’s armband for the final 10 minutes of their win over Leicester on Wednesday after Curtis Jones departed the action. “We are happy he is with us, and hopefully he stays for a long time,” Pep Lijnders said of Liverpool’s “world-class” goalkeeper during the week. However, he is unlikely to be Ireland’s number one so long as he stays a reserve at Anfield.\nAndrew Omobamidele\nIt’s been an odd season so far for Omobamidele. The 21-year-old initially appeared sporadically for Norwich, with his two Championship appearances both coming from the bench. Owing to this lack of game time, he was initially left out of Ireland’s squad for the crucial qualifiers against France and Netherlands before belatedly earning a call-up. Around that period, he also became the second most expensive Irish player ever, securing a Deadline Day move to Premier League outfit Nottingham Forest for €23 million. He is still waiting to make his debut for Steve Cooper’s side though and with Ireland’s wealth of options at centre-back, he could be in danger of once more missing out on a call-up for the upcoming fixtures.\nMatt Doherty\nAfter a difficult season in which game time was in short supply at both Spurs and Atletico Madrid, Doherty’s return to Wolves in the summer looked a good move on the face of it. However, the Dubliner has had to endure more frustration. Despite scoring a brace during his second debut for the club in the 5-0 League Cup win over Blackpool last month, boss Gary O’Neil has used the 31-year-old quite sparingly so far. He has featured just twice this season in the Premier League — coming off the bench on both occasions — and he was also unfortunately part of their embarrassing 3-2 loss to second-tier Ipswich in the midweek League Cup tie. With Ebosele impressing in Italy, Doherty is in danger of losing his place in the Ireland starting XI if he continues to struggle for regular game time.\nGavin Bazunu\nBazunu’s first season as a Premier League footballer last year did not go as well as he would have hoped, culminating in the youngster losing his place in the team during the run-in amid Southampton’s unsuccessful fight to avoid relegation. The Dubliner has since regained his place following the Saints’ demotion to the Championship. New boss Russell Martin launched an impassioned defence of Bazunu early in the season on the back of criticism from fans. However, the former Shamrock Rovers starlet has looked short on confidence at times, though he has not been helped by a far-from-solid defence that has shipped 19 goals from eight games — more than any other team in the Championship as it stands.\nMichael Obafemi\nIt is now over a year since Obafemi’s outstanding display in the 3-0 Nations League win over Scotland suggested he could become a key player for Ireland at international level. It has been a very frustrating 12-plus months for the player since then. He fell out of favour at Swansea last season, with then-manager Russell Martin at times heavily critical of the striker. However, he still earned a good move to Vincent Kompany’s Burnley back in January, but he has yet to really get going for the Clarets. All 12 of his Championship appearances for last season’s title winners came from the bench, while a hamstring injury has meant he has yet to play a minute of action in this campaign. Consequently, the Dublin-born attacker has been missing during a crucial point in Stephen Kenny’s reign, and he is not expected to feature in the upcoming squad as a result of his persistent fitness issues.",
  "word_count": 2239,
  "scraped_at": "2026-02-14T02:00:57.119574",
  "_text_extracted": true
}