{
  "article_id": "25ed0477dbbb",
  "url": "https://theathletic.com/4866740/2023/10/29/manchester-united-altay-bayindir/",
  "title": "Altay Bayindir analysed : Is he a challenger for the Man Utd No 1 shirt ? ",
  "date": "20231029T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“We are happy with our goalkeeping group, definitely with Andre (Onana). He was in one semi-final of the Champions League (with Ajax), last year he was in the final of the Champions League (with Inter Milan); he has the capabilities to be one of the best goalkeepers in the world.”\nErik ten Hag’s words — delivered after Manchester United’s 3-2 defeat to Galatasaray in October — was an attempt to protect his No 1 goalkeeper. Until a match-winning penalty save against Copenhagen on Tuesday night, the Cameroonian had encountered a difficult start to his United career, prompting discussion about whether the club would have been better off retaining David de Gea.\nGO DEEPER\nOnana isn't the first Man United goalkeeper to endure a tricky start - just ask Schmeichel and De Gea\nTen Hag appears committed to his No 1, but his use of the term “goalkeeping group”, rather than “No 1 goalkeeper” when protecting him is worth consideration. While Onana is Ten Hag’s first choice and 37-year-old Tom Heaton provides veteran experience as the club’s third choice, English football fans are yet to be acquainted with Altay Bayindir.\nAdvertisement\nUnited signed the Turkish goalkeeper on September 1 for a fee thought to be £4.3million ($5.2m), but he has still to make an appearance for Ten Hag. The most recent international break offered little chance for fans to get a look at Bayindir either, with the 25-year-old not adding to his six caps for the Turkish national team.\nTen Hag’s use of Onana in United’s third-round victory over Crystal Palace in the League Cup is a sign that Bayindir will be more of a No 2 than a domestic-cup goalkeeper this season. Still, with the 2023 Africa Cup of Nations starting in mid-January, Bayindir could have a role to play in 2023-24.\nSo what kind of goalkeeper is Bayindir? Allow The Athletic to provide a cheat sheet…\n“Bayindir is a solid all-round keeper with plenty of room to grow, yet with significant amounts of experience from some of the most intense football games played on Earth under his belt,” says Ozgur Kurtoglu, a Turkish freelance journalist.\n“He is very outgoing and can express himself well,“ says Bagis Erten, columnist for 10haber and production manager for Eurosport Turkey. “This is very rare in Turkey.\n“And he is handsome, so his fanbase is much more diversified than an ordinary football player. He likes to have dialogue both on and off the field. He is not very aggressive but not silent either.”\nFirst spotted by Bursaspor’s youth academy, he played for several youth teams before breaking through at Ankaragucu in 2016. He spent three years at the club, becoming their starting goalkeeper partway through the 2018-19 season before signing for Fenerbahce in the summer of 2019.\n“Fenerbahce has a local goalkeeper tradition. They are looking for someone to take the jersey after (former club and national team legends) Rustu Recber and Volkan Demirel,” says Erten.\n“In his early years, Altay had this potential. In a team like Fenerbahce that plays possession football, it is essential to stand well against counter-attacks. Altay is world-class on one-on-one.\nAdvertisement\n“But his passing ability — which is indispensable in the possession game — is weak. That’s why there were moments, especially last season, when fans protested against him.”\nA solid performance in a gritty 0-0 draw away against Galatasaray helped endear Bayindir to the Fenerbahce fanbase, and as the years passed he became known as a capable shot-stopper.\nA hip issue meant the 25-year-old missed the final 10 games of 2022-23. Still, after featuring in 26 games, Bayindir conceded one non-penalty goal fewer than his expected goals on target (xGOT) — a measure of how many goals an “average” goalkeeper is expected to concede if facing the same volume and type of shots.\n“When Bayindir left Fenerbahce, the club had just failed to win the league for the 10th year running, but ended their 11-year cup title drought,” says Kurtoglu.\n“When he played his way into the national team, the fans’ adoration escalated, but an error or two later cost him the No 1 to Ugurcan Cakir from fierce rival Trabzonspor.”\nAt the time of writing, Turkish national team coach Senol Gunes is alternating between Bayindir, Cakir and 34-year-old Mert Gunok from Besiktas as he decides on a goalkeeper for Euro 2024. Cakir has the slight edge (he started the last two games during the October international break), but Bayindir could play himself back into contention if he puts together impressive performances for United.\nOnana is still to confirm his availability for Cameroon and the AFCON in the New Year but, if he were to play and Bayindir took over, Ten Hag would get a goalkeeper who is willing to get onto the ball inside and outside the penalty area. The 25-year-old is not likely to venture towards the halfway line during United corners like the adventurous Onana, but he is comfortable venturing outside the penalty area to make short passes when needed.\nAdvertisement\nBayindir’s passing repertoire is not at the same level as Onana’s. He can make many short passes to centre-backs on either side of him, but he is not comfortable making a chipped through ball to the full-backs that many modern managers ask from their goalkeepers in order to beat the first wave of pressure.\nA look at his defensive actions from last season is also encouraging. The cluster of red dots outside the penalty area below is evidence of a brave goalkeeper, someone willing to race off his goal line to make clearances and cut out counter-attacks.\nHowever, while Bayindir makes an effort to pass out from the back and play in the modern sweeper-keeper mould, his execution in these facets can sometimes be lacking. There is a reason why he is not quite the first choice for Turkey in this summer’s European Championship, and why he is unlikely ever to supplant Onana for the No 1 spot when both men are available to Ten Hag.\n“His reflexes are excellent, both on the line and one-on-one. Sometimes, he shows some hesitation when going for the ball early (as you can see by the reduced defensive actions within his penalty area). But his real problem is putting the ball into play,” says Erten.\nBayindir can pass, but his accuracy when playing out from the back can decline when he is put under pressure. In addition, there’s a fragility to his game not dissimilar to Dean Henderson during his spell at Old Trafford.\n“While good with both feet and an eye for distribution to go with it, he has some trouble with decision-making when it comes to owning the air, more so on crossed free kicks than corners, which has been costly in the past, but not something he can’t evolve and improve with Onana at Carrington,” says Kurtoglu.\n“But he’s an exciting recruitment that could turn out to be great, with the right help and handling.”\nWhether that help and handling can be found at United during a turbulent period under Ten Hag is another question. But for now, the United manager has an understudy who is ready, willing and able to step in when the time comes.\nGO DEEPER\nWhy Manchester United, English soccer's most successful team, is deeply mired in futility\nGO DEEPER\n'It started with a horse': The bizarre row that sparked United's decline\n(Top photo: Valentyn Ogirenko/AFP via Getty Images)",
  "word_count": 1240,
  "scraped_at": "2026-02-14T01:51:09.218405",
  "_text_extracted": true
}