{
  "article_id": "25f87fe96ae9",
  "url": "https://theathletic.com/4269244/2023/03/02/real-madrid-barcelona-copa-del-rey/",
  "title": "Real Madrid 0 - 1 Barcelona : Xavi side edge tight Copa Clasico ( part one ) ",
  "date": "20230302T224500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Clasicos go, you could say this will be a long one — the second leg of Real Madrid and Barcelona’s Copa del Rey semi-final comes in over a month’s time, on 5 April.\nAnd as Clasicos go, it wasn’t much of a classic, but on Thursday night it was Xavi’s Barca who earned an early advantage, hanging on to beat their rivals 1-0 in a tight game at the Estadio Santiago Bernabeu.\nHere, The Athletic picks out some of the talking points and key moments of the match.\nAdvertisement\nBarca don’t crap themselves (ahem)\nEver since 2006-07, when a Fabio Capello-coached Madrid made up a five-point deficit to overtake Barcelona and become La Liga champions, Bernabeu fans and pundits have loved to talk about a ‘cagometro’ (crap-ometer) that measures how Barca doubt themselves when things start to go wrong.\nBlaugrana fans always reject the idea, but Xavi saying three different times at the pre-game news conference that Madrid were favourites for this game seemed to show how the Catalans’ confidence had been hit by their two defeats in four days to Manchester United in the Europa League and Almeria in La Liga.\nMadrid’s fast start looked designed to test Barca’s mettle, and Carlo Ancelotti’s team were well on top in the opening 15 minutes, with Luka Modric missing a super chance and Karim Benzema having a goal ruled out for a close but correct offside decision.\nBut Barca, bit by bit, interrupted Madrid’s flow, winning free kicks and making the game scrappier, with Franck Kessie and Gavi particularly effective in this. It worked in their favour as Ferran Torres took advantage of Eduardo Camavinga’s mistake for the opening goal, too.\nIt was not a goal for the tiki-taka purists but did suggest that this Barca team was not going to crumble when the pressure came on. And Barca’s performance overall suggested Madrid are going to have to do something special themselves to eat into their rival’s seven-point lead in the La Liga standings.\nDermot Corrigan\nCamavinga slip-up sees fast start fall flat\nAncelotti could not have asked for a better start from his side: Madrid’s press was relentless, Modric became an extra forward at times and Barcelona barely had a chance to breathe. That was summed up when Frenkie de Jong tried to surge forward but was stopped by a Vinicius Junior headlock — leading to a Barca free-kick and a bemused reaction from the Brazilian when he was shown a yellow card.\nAdvertisement\nBut that was all undone by Barca’s opening goal in the 26th minute, which stemmed from a mistake by Eduardo Camavinga. The France midfielder under-hit a backpass that Ferran Torres easily intercepted. The former Manchester City forward then offloaded for Kessie, who slotted home via comical interventions from Eder Militao and Nacho Fernandez. The goal was eventually given via the VAR, having initially been ruled out for offside.\nCamavinga lost possession on a number of occasions during Real’s 5-2 comeback win against Liverpool, and his first-half performance at the Santiago Bernabeu showed why he has yet to fully establish himself in midfield. The 20-year-old’s best displays this season have come when playing at left-back, and he will need to show more composure if he is to convince Ancelotti he is worthy of a regular starting spot in his preferred position.\nTomás Hill López-Menchero\nMadrid fans bring dodgy banknotes\nThis was the first Clasico since news emerged a few weeks ago that prosecutors are investigating payments totalling €1.4million (£1.2m; $1.3m) that Barca made between 2016 and 2018 to a company owned by Jose Maria Enriquez Negreira. At the time, he was vice president of the Spanish football referees committee.\nGO DEEPER\nInside Barca's day of chaos as new scandal breaks - this one looks really bad\nEnriquez Negreira has denied ever favouring Barcelona in terms of refereeing decisions. Barca have admitted to having hired an “external consultant” who provided reports “related to professional refereeing”.\nAround 50 Real Madrid fans held a public display in the build-up to kick-off outside the ground, with the intention of throwing fake bank notes bearing the face of Barcelona president Joan Laporta towards the visitors’ team bus as it passed by. Police officers were on hand to contain the demonstration, but within the ground too, fans were keen to make the affair a focus of their attention.\nGuillermo Rai\nAdvertisement\nRonald the right-back locks down the left\nBarcelona have now won three of the last four Clasicos, and it’s no coincidence that Ronald Araujo wasn’t around for that one defeat (in this season’s first La Liga meeting).\nMany of the recent matches between Spain’s two great clubs have revolved around an electric left-hand side, and tonight’s Copa encounter was no exception. Xavi perhaps could have predicted as much: 44% of Real Madrid’s attacking touches have come down that flank in La Liga this season, the most of any side in the Spanish top flight.\nThe source of that bias is clear. In his last seven games, Vinicius Jr has attempted 94 take-ons, at an average of over 13 per match. Under Araujo’s watchful eye tonight, the Brazilian dared to try just five.\n1 – Since 2010, #RealMadrid ⚪️⚪️ failed to make a single shot on target for the first time at home in all competitions, and for the first time this happens in #ElClásico since 2013/14 season. Blank. pic.twitter.com/gv13XNJTyL\n— OptaJose (@OptaJose) March 2, 2023\nThat individual battle has clearly been a source of concern for Ancelotti, and he even tried moving Vinicius Jr into more central areas, in an attempt to drag the Uruguayan inside. Drafting Raphinha in to help with the overlapping full-back, however, saw Xavi’s back-line confidently deal with the rotations.\nVinicius Jr is no stranger to a tussle, but none have been quite so fruitless as Thursday’s showdown with one of Europe’s most accomplished defenders.\nThom Harris\nOh, Ansu!\nIn the second half, Barca were defending well but unable to find a second goal to really take control; their few chances to counter-attack not coming off.\nThen came a clear chance for 2-0. Torres ran Camavinga on the outside and pulled back perfectly for Kessie, whose shot looked goalbound… but hit Ansu Fati and deflected wide.\nIt was just typical of how things have been going for Fati, with all his struggles for fitness, form and confidence. Maybe Kessie’s shot was going to hit the post and needed a flick to divert it goalwards, but it never looked like Fati was going to take advantage.\nAdvertisement\nIt was not a dreadful miss — not at all — but still the sensation was all so different from a few years back, when every ball Fati touched around the box seemed to fly into the net. This was just another reminder that seems so long ago now.\nDermot Corrigan\nBenzema still hit-and-miss\nIt was always going to be hard for Benzema to match the heights of last season when he helped Madrid to a La Liga-Champions League double with a career-best 44 goals in 46 appearances. But while the Frenchman is still Real’s joint-top scorer this season with 18 efforts in all competitions — the same as Vinicius Jr — there is something missing from his performances.\nBenzema started brightly here, producing some fine link-up play to stretch Barcelona’s defence and create space for his team-mates. But the 35-year-old faded after Barca’s opening goal. He showed less all-round quality in the second half and seemed to go missing as Real searched for an equaliser.\nAncelotti brought on Rodrygo for Nacho in the 67th minute as he tried to give his team a cutting edge and youth player Alvaro Rodriguez was given a cameo late on, but it was no use. Madrid have struggled to replace Benzema when he has been absent through injury this season, with Mariano Diaz the only other out-and-out striker in the first team.\nIt is no surprise that Madrid are looking to sign another forward this summer given blunt performances like this but, in the meantime, they need Benzema to rediscover his best form. On Thursday, they didn’t manage a single shot on target.\nTomás Hill López-Menchero\nDon’t play Barca at their own game\nThroughout an intense opening 26 minutes, it almost looked as if Barcelona and Real Madrid had swapped shirts.\nAs a tenacious trio of Vinicius Jr, Federico Valverde and 37-year-old Modric snapped and hacked at heels deep into enemy territory – contesting 15 ground duels, completing four tackles and committing three fouls in a fractious first half – Barca, kings of the high turnover, were forced to taste their own medicine.\nFor Xavi’s side, however, it was a case of quality rather than quantity.\nBarça lead at the Bernabéu 😅\nFranck Kessié's effort ricochets off Éder Militão to put the visitors ahead in the tie.. pic.twitter.com/BhIS45d8J8\n— Football on BT Sport (@btsportfootball) March 2, 2023\nNo team in Spain have won the ball within 40 metres of the opposition goal more often than Barcelona this season, and a coordinated attack on Camavinga was some of their finest work.\nAdvertisement\nExpertly boxing their opponents into an awkward wide space, the trap was triggered as a loopy throw-in found the Frenchman with his back to goal, sparking Gavi and Kessie into life.\nManchester United almost completely avoided engaging with Barcelona in their own defensive third, going quick and direct as often as they could. It didn’t take Real Madrid too long to find out why.\nThom Harris\n(Top photo: Jose Breton/Pics Action/NurPhoto via Getty Images)",
  "word_count": 1591,
  "scraped_at": "2026-02-14T01:46:30.511527",
  "_text_extracted": true
}