{
  "article_id": "26291b7a5e27",
  "url": "https://www.mirror.co.uk/sport/football/transfer-news/transfer-news-live-caicedo-cancelo-29087941",
  "title": "Transfer Deadline Day LIVE : Man Utd offered Bayern star , Jorginho to Arsenal and Fernandez to Chelsea latest",
  "date": "20230131T150000Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "January transfer deadline day is the most frantic date in the football calendar, and we got plenty of late, late drama.\nArsenal confirmed the signing of Chelsea midfielder Jorginho for £12million, while Manchester United manager Erik ten Hag swooped for Marcel Sabitzer on loan from Bayern Munich, with a deal confirmed right at the death.\nChelsea were another team to leave it late, British record fee for Enzo Fernandez. The Blues are understood to have sealed an eleventh-hour deal for the Argentina international for a British record fee, having already spent more than £100m earlier in the window.\nTottenham have finally got their man in Pedro Porro, the Sporting Lisbon wing-back, while he arrives Matt Doherty is a shock exit, heading to Atletico Madrid on a free.\nThe deadline has passed for Premier League clubs to make transfers, they can still pick up free agents. One name to keep an eye on is Ghana forward Andre Ayew, who could yet complete a move to Everton.\nFor all the fall-out from a busy transfer deadline day, follow our Mirror Football live blog below...\nGoodnight!\nThat's unfortunately all we've got time for this evening.\nJoin us bright and early tomorrow morning for even more of the transfer window fall-out.\nLa Liga chiefs bemoan Prem spend\nLa Liga officials have called for further regulation after accusing Premier League clubs of \"doping\" and \"cheating\" with their record-breaking January spending.\nTop-flight clubs in England were extraordinarily busy during the winter transfer window and forked out a reported £815million.\nFernandez sends Boehly message\nEnzo Fernandez has thanked Todd Boehly and Chelsea for \"doing everything they could\" to get his £107million move over the line.\n\"I am grateful to Chelsea and its ownership for doing everything they could to make me a part of this project,\" Fernandez told Chelsea's website during his first interview since the move. Fernandez, who arrived on Wednesday to complete his move, also highlighted that his ambition is to instantly compete for the \"biggest trophies\" with the big-spending Blues.\nEverton consider Isco swoop\nAlongside talks for Andre Ayew, Everton are reportedly aiming to seal the services of another free agent on the form of Isco.\nThe Spaniard was meant to move to German side Union Berlin on deadline day only for the deal to collapse. As per The Times, Everton are now considering a swoop for the Spaniard with Sean Dyche desperate to bolster his side.\nChelsea prepare summer sales\nChelsea are ready to cash-in on up to six members of their squad following what has been an eye-watering January spend at Stamford Bridge.\nThe Blues rounded off a huge £323m winter splurge on deadline day with Benfica and Argentina star Enzo Fernandez becoming the eighth player to arrive in West London throughout the month. Their stunning business leaves current boss Graham Potter with a hugely bloated squad to choose from for the remainder of the campaign.\nFernandez squad number revealed\nChelsea have revealed that deadline day signing Enzo Fernandez is set to wear the number five shirt during his time at Stamford Bridge.\nThe Blues have also shared images of the Argentine wearing his new kit for the first time:\nAyew flies in for talks\nWhilst the transfer window has been shut for nearly 24 hours, deals could still potentially go through. One of the players that could arrive is former West Ham and Swansea forward Andre Ayew.\nAccording to The Mail, The Ghanaian is flying into the UK to hold talks with a couple of sides. Everton are thought to be among those, whilst Nottingham Forest have also been credited with an interest in him.\nCancelo handed Bayern debut\nMan City defender Joao Cancelo has been handed a quickfire debut for Bayern Munich having been named in their starting XI for tonight's game.\nThe German champions take on Mainz 05 in the German Cup with Cancelo having been named in the Bayern line-up.\nHe completed a move to the Allianz Arena on deadline day.\nModric hands Liverpool Bellingham boost\nStaying in Spain and Ballon d'Or winner Luka Modric appears to have handed Liverpool a huge boost in their attempts to sign Jude Bellingham.\nAccording to AS, the Croatian midfielder has decided to stay with Real Madrid for a further year. He is out of contract this summer but negotiations between him and Real are expected to be straight-forward.\nThat could potentially alleviate Los Blancos' need to enter the market for another midfielder - namely Bellingham.\nBarcelona prepare Roberto offer\nBarcelona are reportedly set to offer former Arsenal target Sergi Roberto a new contract to stay at the Camp Nou.\nThe 30-year-old sees his current deal expire in the summer but as per Mundo Deportivo, the Spanish giants are set to hand him a year's extension with the option of a further season.\nThe utility man has neen linked with a move to the Premier League on occasions in the past with Arsenal noted as admirers.\nHarrison underwent Leicester medical\nLeeds star Jack Harrison reportedly started a medical with Leicester City only for Jesse Marsch's side to pull the plug.\nThe Foxes were linked with a move for the wideman over the final days of the window. As per The Athletic, Harrison travelled to Leicester's training ground and started a medical before Leeds decided not to proceed with a sale.\nArsenal sent £100m Caicedo warning\nBrighton warned Arsenal off Moises Caicedo in January by insisting they wouldn’t even sell the midfielder for £100million. Caicedo returned to training on Wednesday at Brighton after failing to secure a move away from the club during the transfer window.\nThe Seagulls rejected two bids from Arsenal for the Ecuador international, the second worth around £70m. Caicedo informed Brighton in an open letter on social media last week that he wanted a move but his post backfired back.\nIt infuriated Albion so much they point blank refused to sell Caicedo to the Premier League leaders. Brighton officials also told Arsenal's sporting director Edu that not even £100m would prise Caicedo away.\nPSG hit out at Chelsea\nFrench giants PSG have reportedly slammed Chelsea as a \"Class-A circus\" after Hakim Ziyech's failed move to the Parc des Princes.\nThe Moroccan winger was expected to join the French gianrs on-loan until the end of the season only to see a move fall through at the final moment. According to The Telegraph, relations between the two clubs have hit rock bottom with PSG left furious and blaming Chelsea for the embarrassment.\nEnzo Fernandez pens farewell statement\nChelsea signing Enzo Fernandez has penned an emotional statement to former club Benfica after sealing his record-breaking move to Stamford Bridge.\nTaking to social media, he said: \"May the press not tarnish what we built together because it was something wonderful that I had never imagined. Thank you to everyone who works to make the institution even greater than it is.\n\"Thank you to my colleagues for always treating me in the best way and make me feel at home. Thanks to the club's management and especially to Roger Schmidt and his entire team for their trust and daily respect. I was very happy. Thank you, I carry Benfica forever in my heart.\"\nZiyech could still leave\nToday has been a bad day for Hakim Ziyech, who thought he was leaving Chelsea for Paris Saint-Germain, only to see his hopes dashed in a mess of paperwork.\nThe Moroccan winger could still leave Chelsea, however, with reports in Turkey suggesting that Besiktas are keen to sign him.\nThe Turkish transfer window is still open for another week.\nWolves seal Traore deal\nWolves have made the signing of Boubacar Traore permanent.\nThe Mali international arrived on loan from Metz in September and has since made nine appearances for the club.\nWolves have liked what they've seen and have now chosen to sign the 21-year-old.\nRyan Reynolds struggles with Wrexham arrival\nRyan Reynolds struggled to get to grips with the pronunciation of Wrexham's new signing Eoghan O'Connell.\nThe Welsh side, who currently sit top of the National League as they eye a return to the Football League, added the centre-half on deadline day.\nO'Connell was signed from Charlton for an undisclosed fee and could make his debut this weekend against Altrincham.\nCoutinho could still leave Villa\nThe European transfer window is shut – but Philippe Coutinho could still leave Aston Villa.\nGoal Brazil has spoken to the playmaker’s agent, Kia Joorabchian, who says they’re still working on a transfer.\nCorinthians remain interested in signing the 30-year-old, but the money involved could be problematic, with Coutinho’s wages and Villa’s desire to recoup some of the fee they paid Barcelona holding things up.\nFernandez flying to London\nEnzo Fernandez's transfer to Chelsea has been confirmed - but we're yet to get the full unveiling from the Blues.\nIt seems that could be on its way later today, with the 22-year-old midfielder flying from Portugal to London.\nEnzo Fernández, on his way to London #CFC pic.twitter.com/QCpXmy0Whi\n— Fabrizio Romano (@FabrizioRomano) February 1, 2023\nAyew heading for talks\nThe window may have closed, but Premier League sides can still sign free agents.\nAndre Ayew is one of those players available - and he's flying into London to hold talks with Everton and another club after being released by Al Sadd.\nThe 33-year-old striker has previously played for West Ham and Swansea.\nHaaland agent details exit plan\nErling Haaland's agent Rafaela Pimenta refused to deny the striker has an exit clause in his Manchester City contract - but admitted she would have to say \"yes\" to Barcelona president Joan Laporta.\nBarca boss Xavi headed a club delegation flying out to Germany to hold a meeting with the striker a year ago as the Blaugrana considered the possibility of a move for Haaland.\nThe Catalan club held a meeting with Mino Raiola, who had represented Haaland before he passed away last year, in December 2021.\nMaguire told a loan could have been good\nFormer Manchester United striker Louis Saha has suggested a loan exit could have benefited club captain Harry Maguire.\n“A loan move may have been a good option for him to show that he’s worth another try because he’s still a key player and he’s Manchester United’s captain,\" the Frenchman told The Games Cabin.\n\"Even if Erik ten Hag isn’t playing him often, I expect that Ten Hag still respects the player and wants to see him improve. It’s still possible for him to contribute.”\nArsenal's Caicedo hopes take a hit\nArsenal's hopes of signing Moises Caicedo this summer may have taken a hit following their recent approach.\nThe Gunners were looking to bolster their midfield options in January - eventually signing Jorginho from London rivals Chelsea on deadline day.\nThey begun pursuing the Italian when it became clear they weren't going to be successful in chasing the Ecuadorian.\nHerrera makes Bilbao move permanent\nAthletic Club have completed the permanent signing of Ander Herrera from Paris Saint-Germain.\nHerrera, who was already on loan from PSG in Bilbao, has now signed a contract until June 2024 with the Spanish side after they utilised a clause in the loan agreement.\nCedric speaks after Arsenal exit\nCedric Soares has spoken for the first time after joining Fulham on loan from Arsenal.\n\"I feel great,\" the Portugal insternational said.\n\"I wanted this deal to happen, so we all pushed in the same direction, and I’m really happy and pleased to be here.\"\nEnzo Fernandez's Chelsea shirt number\nIt appears Enzo Fernandez will take the vacant number five shirt at Chelsea.\nThe number was previously worn by Jorginho, who completed his departure for Arsenal earlier on deadline day.\nOther players to wear five for Chelsea in the Premier League era include Kurt Zouma, Michael Essien and Frank Leboeuf.\nTen Hag pushed for Henderson Man Utd return\nErik ten Hag attempted to persuade goalkeeper Dean Henderson to return to Manchester United from his loan spell at Nottingham Forest in January.\nUnited had to react to the decision of Newcastle to recall Martin Dubravka from his loan spell at Old Trafford, prompting them to draft in Jack Butland from Crystal Palace on a loan deal for the remainder of the campaign.\nHenderson has previously spoken out against his treatment by his parent club.\nCaicedo back in Brighton training\nMoises Caicedo has returned to Brighton training after failing to secure a move away from the club, according to The Express.\nThe Ecuador midfielder was the subject of interest from Arsenal, but has remained at the Amex Stadium for the remainder of the season.\nIt remains to be seen whether he will feature this weekend, with Roberto De Zerbi's team taking on Bournemouth in the league.\nAyew set to arrive in England\nAndre Ayew is expected in England in the next 24 hours, with Everton eyeing up a deal for the Ghana international.\nSean Dyche's side could complete a move for the former West Ham and Swansea man outside the window, as he is a free agent after leaving Al-Sadd.\nAccording to The Mail, Ayew's chances of joining the Toffees are rated at 50/50, with interest from other Premier League sides.\nRiver set for huge Fernandez windfall\nEnzo Fernandez's former club River Plate are set to receive a whopping £26.75million after the Argentina international completed his move from Benfica to Chelsea.\nThe midfielder completed a £107m switch to Stamford Bridge after protracted negotiations between the Blues and Benfica.\nThe fee is a record for Chelsea, trumping the £97.5m they paid for Romelu Lukaku in 2021, and also a new Premier League record.",
  "word_count": 2262,
  "scraped_at": "2026-02-14T01:59:41.729057",
  "_text_extracted": true
}