{
  "article_id": "263104b18680",
  "url": "https://punchng.com/psg-risk-champions-league-ban-as-mbappe-reports-club-over-unpaid-wages/",
  "title": "PSG risk Champions League ban as Mbappe reports club over unpaid wages",
  "date": "20240820T161500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain are at risk of being banned from the Champions League after Kylian Mbappe reported the club to the French Professional Football League and UEFA over unpaid wages.\nThe French superstar, who left PSG for Real Madrid earlier this year after seven successful years in Paris, claims the club owes him a substantial sum of money from the final year of his contract.\nAccording to Le Monde, Mbappe is still owed £46.8 million by PSG, which includes three months of unpaid wages and a £30.6 million signing bonus that should have been paid in February. Additionally, the forward is seeking an ‘ethical bonus’ to compensate for the missed payments, as reported by L’Equipe.\nAs reported by GiveMeSport on Tuesday, Mbappe initially sent PSG a formal notice earlier this summer, but with no resolution in sight, he has escalated the issue to the LFP and UEFA. The potential consequences for PSG could be severe.\n“The LFP have the power to impose a number of different punishments on them, including either a transfer ban or stripping them of their UEFA license which would prevent them from taking part in future Champions League competitions,” GiveMeSport said.\nThis development adds a dramatic twist to Mbappe’s departure from PSG, which had appeared amicable. The forward left the French capital after winning six Ligue 1 titles but was unable to secure a Champions League trophy with the club, a key reason for his move to Real Madrid.\nMbappe’s move to Madrid has positioned him closer to winning the Champions League than ever before.\nLast season, Real Madrid claimed both the La Liga title and the Champions League trophy, solidifying their status as one of the most formidable teams in football.\nWith Mbappe joining a squad already featuring stars like Jude Bellingham, Vinicius Jr, and Dani Carvajal, expectations are sky-high for the Spanish giants.\n“If PSG are banned from the Champions League, the one positive is that they wouldn’t run the risk of coming up against their former hero and his new team,” GiveMeSport added.",
  "word_count": 339,
  "scraped_at": "2026-02-14T01:57:35.679617",
  "_text_extracted": true
}