{
  "article_id": "2643812273f8",
  "url": "https://www.teamtalk.com/news/man-utd-second-chance-sign-chelsea-striker-deal-90-percent-done-before-sesko-sources",
  "title": "Man Utd get second chance to sign Chelsea striker they had deal 90 % done for before Sesko",
  "date": "20260207T153000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd get second chance to sign Chelsea striker they had deal 90% done for before Sesko – Sources\nManchester United may soon have the chance to sign the striker they had a deal 90 percent completed for last summer, and who they prioritised before landing back-up option, Benjamin Sesko.\nLiam Delap’s former suitors – of which Man Utd are one – are keeping a very close eye on developments at Stamford Bridge, with sources informing our insider, Graeme Bailey, that the striker is effectively playing for his Chelsea future in the second half of the campaign.\nChelsea snapped up the 22‑year‑old from Ipswich Town in the summer after activating a clause worth around £30million, and there was genuine optimism that Delap would push his way into the starting XI and use the platform to force his way into England’s World Cup plans.\nBut the season has unravelled in frustrating fashion. Delap suffered a hamstring injury in August during the home derby with Fulham, ruling him out for two months and leaving him chasing fitness and rhythm ever since.\nHis first goal did not arrive until January – ironically, also against Fulham – and he has struggled to build momentum, returning just one goal in 15 Premier League appearances.\nWe revealed earlier this week that Chelsea have reignited their interest in FC Porto sensation Samu Aghehowa, and while The Blues are thrilled with the impact of summer signing Joao Pedro, there are growing concerns about the overall depth and reliability of their forward line.\nIncoming striker Emmanuel Emegha hopes to stake his claim, but nothing is guaranteed.\nMeanwhile, Nicolas Jackson, who is loaned to Bayern Munich but expected to return at season’s end, is not viewed internally as a long‑term option, placing even more scrutiny on Delap’s performances.\nSources have informed us that the remainder of the season will be crucial in determining whether Delap is part of Chelsea’s long‑term project.\nThe club insist publicly that he remains a key figure, but privately there is an acceptance that a Chelsea centre‑forward who isn’t scoring will not keep that role indefinitely. Despite his struggles, Delap’s market opportunities remain strong.\nMan Utd, Newcastle and Everton all pushed hard for his signature before his move to Stamford Bridge, and all three clubs are understood to be monitoring the situation closely should Chelsea decide to listen to offers. Brighton and Sunderland are also watching.\nOf those listed, it’s unquestionably Man Utd who are the ones to watch given the Red Devils fully intended to sign Delap prior to landing Benjamin Sesko instead.\nA deal for Delap was ’90 percent done’ according to The Daily Mail back in October, and only Man Utd missing out on Champions League football after losing the Europa League final to Tottenham scuppered the move.\nDelap placed great emphasis on UCL football when choosing his next club, and defeat to Spurs resulted in the frontman rejecting Man Utd in favour of Chelsea. It was never a case of Man Utd pulling the plug and turning to Sesko – Delap was always their No 1 striker target entering the summer window.\nFor now, the message from inside Chelsea is clear: Delap has time to put things right, but the pressure is on – and his future in west London may hinge on what he delivers between now and May.\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nBiggest transfer stories today – New Liverpool winger / Man Utd contact Juventus ace / Man City double deal\nIn other news, The Athletic have confirmed Liverpool will push to sign a top-class new winger in the summer transfer window, with Bradley Barcola and Yan Diomande among four options being firmly considered.\nElsewhere, Man Utd have initiated contact with the representatives of Manuel Locatelli as they try to set up a summer deal.\nFinally, Man City haven’t given up hope of convincing Pep Guardiola to stay for one more season and reports claim a sensational double deal that’ll sting both Manchester United and Liverpool could sway the Spaniard.\nREAD MORE: Ranking the 15 biggest transfers ready to happen in summer 2026: Salah, Alvarez, Wharton",
  "word_count": 707,
  "scraped_at": "2026-02-14T01:59:36.841522",
  "_text_extracted": true
}