{
  "article_id": "26468f0b90cf",
  "url": "https://www.themag.co.uk/2023/09/this-wasnt-the-champions-league-group-i-was-hoping-for-this-is-why-newcastle-united/",
  "title": "This wasnt the Champions League group I was hoping for - This is why",
  "date": "20230904T091500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This wasn’t the Champions League group I was hoping for – This is why\nA lot of people will be looking at the outcome of the Champions League group draw and come to the conclusion that we won’t get out of the group.\nFootball is to an extent a lottery mixed with a war game. Helmuth von Moltke the Elder may well have said “no plan ever survives first contact with the enemy”: though never in the concise manner above.\nHowever, the point remains true. It’s how the players and the coaches adapt to what is happening in front of them on the pitch that counts. And to do that they need to have gamed all the possible scenarios.\nI would dare to say that PSG without Mbappe is not such a special team and that should he be unable to play, for whatever reason, the opposing team in that Champions League match will have a decided advantage over the other teams in the group. While one man doesn’t make a team: when the team is built around him, and he isn’t there, then they are only as good as the sum of their collective parts.\nNewcastle United on the other hand are a team who are actually better than the sum of their collective parts. The squad last year played way above the level that everyone expected they were capable of.\nThe other teams in our group have more European experience but they don’t have experience of playing against Newcastle United. It’s a case of European pedigree versus the unknown quantity of playing against us.\nPeople make a great deal of teams being cowed by the atmosphere in SJP but top level European teams are used to this type of hostile environment. While the backing of the fans is important, it’s what happens at pitch level that will determine the outcome.\nCan we get out of this Champions League group?\nI think we have as much chance as anybody else. For me it’s a learning process.\nIt’s not just about the dark arts of football but about learning how to kill off a game when you are ahead. And that is something we have yet to perfect, as we showed against Liverpool.\nI only hope that our current run of form is part of some elaborate Eddie Howe mind game to lull the opposition into a false sense of security.\nWould I have preferred a different Champions League group? Hell yeah. I would have liked us to be able to stroll out of the group being able to preserve our energy for the EPL.\nI would have loved to have had PSV, Feyenoord, or Antwerp in our group as (living in Belgium) I could easily mingle with the home supporters and travel without having to take time off work (I work for a building company with fixed holidays so this is not an option).\nParis is not an option as I speak only enough French to order a beer.\nDortmund is too far and I think that tickets will be impossible to get even as a ‘home’ fan. Like in Newcastle: demand always outstrips supply at big European clubs.\nI think the fantasy of following Newcastle round a series of top European stadia will remain, for all but a select few, just that. A fantasy. And that most fans will be, like me, watching on television with a selection of cold beers and savoury snacks.\nMaybe this is where the fanzone at SJP will come into its own: providing a focus for people who are unable to make the journey but still want to take part in the experience.\nWhen we played against Club Brugge there were probably more Geordies in the fanzone on the Markt than in the Jan Breydel stadium. Maybe people are just going to have to make do with a fanzone either in Newcastle or away if they want to soak up the atmosphere.\nEither way, the lads running around on the pitch need to start putting in a few three point performances or we won’t be back in Europe next year.\nGiving your rivals a nine points head-start is very noble but never a great idea.\nYeah okay we have had a tough start and last year we probably wouldn’t have expected much more than this… but when you have a project that has gone ahead of schedule you need to make sure that things don’t slip backwards.\nAfter the opening day success against Villa things have just not clicked on the pitch. Everyone seems to be having a bad run of form at the same time, we are losing the ball too much, the forwards are not getting enough service and to cap it off, the Rolls Royce defender is in the garage for a service.\nI don’t think we would have been quite so easy to beat at the Amex if Botman had been marshalling the centre of our defence. Amusingly NUFC.com made him their man of the match!\nLuckily the international break is upon us and Eddie has time to regroup.\nThis not a time for falling for the blind panic whipped up by football writers looking to hook people with a catchy headline: or social media induced mass hysteria?\nWhile the queue of people lining up to write Newcastle United off as a flash in the pan may be growing ever longer let’s just touch base with reality for a moment.\nThe fans are not ready to turn on Eddie and the boys.\nHe is not x number of games away from the sack as some might have you believe.\nIt was not another shameful or embarrassing display.\nThough let’s be clear, it wasn’t great.\nMuch has been made about Bruno’s Kinder Egg addiction, dip in form and social media spat with a fan. If I were Eddie I would get Bruno sorted with a Kinder sponsorship deal, give him a big hug and tell him to pay less attention to ‘like hungry’ losers.\nThe echo chamber of social media paints us, Newcastle fans, as either entitled or incapable of any rational analysis of what has happened in the last four games.\nSadly sometimes people are too focused on making clickbait videos or sensationalist posts, which are divorced from reality, to think about how this makes us look to the outside world.\nAs others here on The Mag have pointed out: from the same fixtures last year we didn’t fare much better. The difference being that the stumbles were spread out over the course of a year, we always remained hopeful, and the football was light years ahead of what we had endured during the Ashley years.\nThis year we have a certain level of expectation that we will at least match what we achieved last season.\nConfucius famously wrote that if you want to move a mountain you need to begin by carrying away small stones. I don’t think his views on larger stones are recorded.\nWe have now started on the larger stones, the difficult 2nd LP or whatever ever other analogies you want to use.\nNot everything will work, we may not even end up challenging for a top four place this season, but let’s not forget this is a journey.\nIf winning the EPL or the Champions League are the eventual destination, we are at the point of having filled up the car and are now trying to figure out how to enter the information into the SatNav / GPS.\nObviously, if by Xmas we are in the same position we were two years ago, I’ll be at the front of the queue calling for a change in the manager!\nHowever, until then we just need to chill the f… out and trust in the process that, saved us from relegation, that has got into the Champions League and that has restored our faith in the club.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1335,
  "scraped_at": "2026-02-14T02:20:10.968824",
  "_text_extracted": true
}