{
  "article_id": "26532462c644",
  "url": "https://www.bbc.com/sport/football/articles/cd75ny1j55xo",
  "title": "Fifa Club World Cup 2025 : Draw pairs Manchester City with Juventus ; Chelsea face Flamengo",
  "date": "20241206T003000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Club World Cup draw pairs Man City with Juventus; Chelsea face Flamengo\n- Published\nDefending champions Manchester City will face Juventus in the group stage of the Fifa Club World Cup next summer, while Chelsea meet Brazilian side Flamengo.\nPep Guardiola's City, who beat Brazilian side Fluminense to win the tournament for the first time in 2023, begin their title defence against Morocco's Wydad and also play Al Ain of the United Arab Emirates in Group G.\nChelsea, winners of the 2021 final, were also drawn alongside Mexico's Club Leon and Tunisian side Esperance Sportive de Tunisie in Group D.\nThe revamped Fifa Club World Cup, which has been expanded to 32 teams, will take place in the United States between 15 June and 13 July next year.\nFifa Club World Cup 2025 draw in full\nGroup A: Palmeiras, FC Porto, Al Ahly, Inter Miami\nGroup B: Paris St-Germain, Atletico Madrid, Botafogo, Seattle Sounders\nGroup C: Bayern Munich, Auckland City, Boca Juniors, Benfica\nGroup D: Flamengo, Esperance Sportive de Tunisie, Chelsea, Club Leon\nGroup E: River Plate, Urawa Red Diamonds, Monterrey, Inter Milan\nGroup F: Fluminense, Borussia Dortmund, Ulsan, Mamelodi Sundowns\nGroup G: Manchester City, Wydad, Al Ain, Juventus\nGroup H: Real Madrid, Al Hilal, Pachuca, Salzburg\nInter Miami in curtain-raiser after taking controversial spot\nA complex and lengthy draw ceremony was held across two separate Miami locations and lasted more than 90 minutes, during which a new Club World Cup trophy was revealed.\nThere was also a video message from incoming US president Donald Trump, whose daughter Ivanka drew the first team.\nLionel Messi's Inter Miami will take on Egyptian side Al Ahly at the Hard Rock Stadium in the opening match, staged in Miami.\nElsewhere, Paris St-Germain were drawn against Atletico Madrid in Group B, while Bayern Munich meet Benfica in another all-European group-stage match-up.\nTeams will play each other once in the group phase and the top two will progress to the knockout stage.\nTeams from each of the six international football confederations will be represented at next summer's tournament, including 12 European clubs - the highest quota of any confederation.\nThe European places were decided by clubs' Champions League performances over the past four seasons, with recent winners Chelsea, Manchester City and Real Madrid guaranteed places.\nAl Ain, the most successful club in the UAE with 14 league titles, are owned by the country's president Sheikh Mohamed bin Zayed Al Nahyan - the older brother of City owner Sheikh Mansour.\nReal, who lifted the Fifa Club World Cup trophy for a record-extending fifth time in 2022, will open up against Saudi Pro League champions Al-Hilal, who currently have Neymar in their ranks.\nOne place was reserved for a club from the host nation, which Fifa controversially awarded to Inter Miami, who will contest the tournament curtain-raiser. Messi's side were winners of the regular-season MLS Supporters' Shield but beaten in the MLS play-offs, meaning they are not this season's champions.\nHow does the new Club World Cup work & why is it so controversial?\n- Published7 April 2025\nMatches will be played across 12 venues in the US which, alongside Canada and Mexico, also host the 2026 World Cup.\nFifa is facing legal action from player unions and leagues about the scheduling of the event, which begins two weeks after the Champions League final at the end of the 2024-25 European calendar and ends five weeks before the first Premier League match of the 2025-2026 season.\nBut football's world governing body believes the dates allow sufficient rest time before the start of the domestic campaigns.\nThe Club World Cup will now take place once every four years, when it was previously held annually and involved just seven teams.\nStreaming platform DAZN has secured exclusive rights to broadcast next summer's tournament, during which 63 matches will take place over 29 days.\nRelated topics\n- Published16 August 2025",
  "word_count": 649,
  "scraped_at": "2026-02-14T02:11:20.844244",
  "_text_extracted": true
}