{
  "article_id": "26583d5e7d46",
  "url": "https://www.nytimes.com/athletic/6778392/2025/11/06/dominik-szoboszlai-liverpool-captain/",
  "title": "Dominik Szoboszlai : Future Liverpool captain ? ",
  "date": "20251106T083000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There is a story from Dominik Szoboszlai’s early years that sums up his relentless drive.\nWith his mind focused on breaking a fitness-test record at his first professional club, Red Bull Salzburg, Szoboszlai climbed onto a treadmill and ordered the pace to be cranked up — again and again — until that milestone was finally eclipsed.\nAdvertisement\nThe numbers the then-teenage midfielder recorded that day remain unbeaten at the Austrian team, and the anecdote underlines that, when Szoboszlai sets his mind to something, there’s rarely a way of stopping him.\nThat has been proved again in the early months of this season.\nOver the summer, when Liverpool supporters were composing their predicted line-ups ahead of the opening game against Bournemouth at Anfield, many chose to exclude the Hungary international from their starting XI. With Florian Wirtz coming in as the second-most expensive player in the club’s history, Szoboszlai was seen as facing a challenge in simply retaining his place. Yet rather than be cowed by the increased competition, the 25-year-old has gone to a new level.\nHead coach Arne Slot has played him for every minute of all 10 Premier League matches and their four Champions League games — including a period at right-back when Liverpool were in dire need of cover in that position.\nHis versatility and consistency make him the most reliable player in the team right now, and after another blockbuster display against Real Madrid in Tuesday’s 1-0 Champions League win, he’s now recognised as one of the most important, too.\n“What you see is what you get from Dom,” Liverpool’s centre-back and captain Virgil van Dijk told reporters after the Madrid game. “He is very important. The energy he brings on the pitch is incredible, the quality that he has is outstanding, and he is learning each and every game and he is developing into the player we all feel like he could be.\n“He is already showing that for the country he is playing for, and it is about keeping on doing it for the rest of the season. Keep your head down and keep performing.”\nFew doubt Szoboszlai will allow himself to be distracted, even if his performances have inevitably led to queries over if, and when, the champions will try to extend a contract which expires in June 2028. Preliminary discussions are taking place with Liverpool over a possible new deal for Szoboszlai, although club sources are downplaying that any agreement is imminent. His fellow midfielder Ryan Gravenberch is also out of contract in 2028 and has his own strong case for improved terms given his excellent form.\nAdvertisement\nGiven his displays this term, it would not be a surprise if Liverpool also consider Szoboszlai as a contender for the captaincy should Van Dijk leave when his own deal expires at the end of next season, by which time the Dutch defender will be a week away from turning 36 years old.\nHis status in the team makes Szoboszlai an obvious candidate, especially with Andy Robertson and Ibrahima Konate’s contracts running out next June, and both Alisson and Mohamed Salah on course to also be out of contract in summer 2027. Should most or all of them depart, it would leave him as one of the most senior players at Anfield.\nSzoboszlai is more of a performance leader than a vocal presence, but he knows what it’s like to carry a team, having been appointed Hungary’s youngest-ever skipper in 2022, when he was just 22.\nAs Robbie Fowler, the former Liverpool striker, put it on Prime Sport’s coverage of the Madrid match on Tuesday: “He might not be a shouter, or get the crowd going in that way, but he leads by example by how he runs on the pitch.”\nOf course, there is a long way to go before such a decision has to be made but Liverpool are a club who pride themselves on an ability to successfully plan and prepare for the future.\nThere is no players’ leadership group at Anfield in the Slot era, in the way there was under Jurgen Klopp, with Van Dijk firmly ensconced as the squad’s leader, and Robertson as his vice-captain. But having established himself as a regular starter since joining from Germany’s RB Leipzig in the summer of 2023, Szoboszlai now feels ready for additional responsibility.\nHe recently became a father and is happily settled in the area with his family, and could see himself staying at Liverpool for an extended period. He loves Anfield, the connection he has with the fans and appreciates the level of support provided to the team. “I would say this is the happiest I have been in my career so far, on and off the pitch,” he told Liverpool’s official website in the summer. “I think I have found the right people around me, not only in football, outside of football too.”\nAdvertisement\nThe ability to handle the big moments and bounce back from tough times is what separates those who succeed and fail at Anfield. Szoboszlai already has a Premier League winner’s medal and is pumped up to add more to his collection. He is close with Salah, and the pair have clear similarities in their desperation to play every minute they can and prove their quality.\nOne of the defining images from last season was that of Szoboszlai spread out on the turf, face down, at the final whistle against City at the Etihad Stadium in February, having run himself to a standstill in delivering a man-of-the-match performance in a 2-0 Liverpool win — their first in the league at that ground for nearly a decade. As he climbed to his feet, he was greeted by City manager Pep Guardiola, who wanted to show his appreciation.\nHe will be expected to deliver the same sort of intensity on Sunday when Liverpool return to east Manchester, although that prospect should not faze him. Last season, when Liverpool’s lead physical performance coach, Ruben Peeters, was asked by Belgian publication GVA which player had impressed him the most through his fitness levels, he identified Szoboszlai. “His ability to run and the intensity with which he plays football from the first to the last minute are unprecedented,” Peeters said.\nAgainst Madrid on Tuesday, his numbers were again impressive: top for shots on target (five), passes (40) and crosses (three), and second for touches (55). He pressed high, covered ground superbly, tracked runners and provided the perfect assist for Alexis Mac Allister to score the winner. The only disappointment was not marking the performance with a goal of his own, with keeper Thibaut Courtois repeatedly thwarting him.\nRarely do hard-working midfielders receive the appreciation their efforts deserve from supporters, who typically focus on goalscoring heroes. It was only when City fell apart last season without long-term injury absentee Rodri that the Spaniard really started to get the credit he deserves. Declan Rice may continue in the brilliant early-season form that has started to get him properly recognised at Arsenal, yet he may still never be seen as the star man.\nSzoboszlai, though, is now receiving the praise he deserves from those who watch Liverpool every week.\nHe could do with converting more of the big chances that fall to him, but what he lacks in prolific goalscoring form, he makes up for in all-round commanding midfield play.\nHe is Liverpool’s player of the season so far but it feels like his Anfield journey is only just getting started.",
  "word_count": 1248,
  "scraped_at": "2026-02-14T02:03:26.535815",
  "_text_extracted": true
}