{
  "article_id": "2663f642574e",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/46127.html",
  "title": "Champions League Semi - Finals : 2nd Leg",
  "date": "20250506T214500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "You can try to find the updated link in the article archive or in the News section.\nReader Comments (179)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 06/05/2025 at 18:58:00\nOnly 17 and he's already played over 100 games... that is insane.\nMind you, if we had a decent manager at the time instead of David Moyes, then perhaps Wayne Rooney's development would have been as impressive…\n2 Posted 06/05/2025 at 19:17:59\nThe one we had was selling him to Newcastle, then went running to his mam when the Mancs came in with an equally derisory offer, crying \"They've took our boy, Mum!\"\n3 Posted 06/05/2025 at 19:27:13\nWe'll see what happens with Branthwaite... the noise seems to have subsided at least.\n4 Posted 06/05/2025 at 19:39:24\n50 Appearances\n15 goals\n24 Assists!\nI think that shows how unselfish he is.\n5 Posted 06/05/2025 at 19:41:53\nI have a hunch that he might follow Jonathan Woodgate to Real. (That worked out well, didn't it?)\n6 Posted 06/05/2025 at 20:12:38\nBut I shouldn't be so critical.\n7 Posted 06/05/2025 at 20:18:28\n8 Posted 06/05/2025 at 20:20:58\n9 Posted 06/05/2025 at 20:22:17\n10 Posted 06/05/2025 at 20:22:32\n11 Posted 06/05/2025 at 20:39:16\nJarrad might not be at his best, but he is still by far our biggest asset. Take a look at this Quansah fella across the park, this guy was picked above Jarrad by Southgate (!!??) — he is having a nightmare every time he plays for the RS.\nI don't know you personally, Paul, but I reckon we both know a quality player when we see one.\n12 Posted 06/05/2025 at 20:44:38\n13 Posted 06/05/2025 at 20:49:14\nEven 'kopites' come down hard on Quansah on 606. Was Southgate trying to make some sort of statement? But to who? When he reaches his prime Jarrad will have left little Gareth far behind in the centre-half stakes.\n14 Posted 06/05/2025 at 20:49:44\n15 Posted 06/05/2025 at 20:49:58\nInter dominated and Inzaghi definitely learnt a lot from first leg. Big halftime for Herr Flick\n16 Posted 06/05/2025 at 20:51:46\n17 Posted 06/05/2025 at 20:53:25\n18 Posted 06/05/2025 at 20:54:31\nDumfries has been everywhere.\n19 Posted 06/05/2025 at 20:56:11\n20 Posted 06/05/2025 at 20:57:50\nThe Inter tactics have been spot on.\nBarca now relying on genius\n21 Posted 06/05/2025 at 20:59:50\nAt speed it looks like he gets it, but it's an optical illusion.\n22 Posted 06/05/2025 at 21:01:23\nIsn’t that what VAR is for?\n23 Posted 06/05/2025 at 21:03:36\n24 Posted 06/05/2025 at 21:04:44\n25 Posted 06/05/2025 at 21:05:23\n26 Posted 06/05/2025 at 21:07:05\n27 Posted 06/05/2025 at 21:08:40\n28 Posted 06/05/2025 at 21:09:14\nIt seemed clear and obvious on the slo-mo that the defender's foot is contacting the Milan player's foot, pushing it onto the ball.\nThe defender made no contact with the ball.\nPenalty was the correct decision. I'd say watch it again but you should have seen that already!\n29 Posted 06/05/2025 at 21:11:30\n30 Posted 06/05/2025 at 21:13:24\n31 Posted 06/05/2025 at 21:14:00\n32 Posted 06/05/2025 at 21:14:57\n33 Posted 06/05/2025 at 21:16:16\n34 Posted 06/05/2025 at 21:16:27\n35 Posted 06/05/2025 at 21:16:40\n36 Posted 06/05/2025 at 21:16:49\n37 Posted 06/05/2025 at 21:17:26\n38 Posted 06/05/2025 at 21:18:16\n39 Posted 06/05/2025 at 21:19:08\n40 Posted 06/05/2025 at 21:19:47\n41 Posted 06/05/2025 at 21:19:54\n42 Posted 06/05/2025 at 21:20:00\n43 Posted 06/05/2025 at 21:20:21\n44 Posted 06/05/2025 at 21:20:22\n45 Posted 06/05/2025 at 21:20:56\n46 Posted 06/05/2025 at 21:21:03\n47 Posted 06/05/2025 at 21:21:13\n48 Posted 06/05/2025 at 21:21:19\n49 Posted 06/05/2025 at 21:21:23\n50 Posted 06/05/2025 at 21:21:49\n51 Posted 06/05/2025 at 21:22:36\n52 Posted 06/05/2025 at 21:23:39\n53 Posted 06/05/2025 at 21:24:09\n54 Posted 06/05/2025 at 21:28:56\n55 Posted 06/05/2025 at 21:29:10\n56 Posted 06/05/2025 at 21:29:11\n57 Posted 06/05/2025 at 21:29:34\n58 Posted 06/05/2025 at 21:29:47\n59 Posted 06/05/2025 at 21:30:01\n60 Posted 06/05/2025 at 21:30:15\n61 Posted 06/05/2025 at 21:30:30\n62 Posted 06/05/2025 at 21:30:58\nThat’s the rule I believe.\n63 Posted 06/05/2025 at 21:32:00\n64 Posted 06/05/2025 at 21:32:21\n65 Posted 06/05/2025 at 21:37:28\nGame of two halves.\n66 Posted 06/05/2025 at 21:37:58\n67 Posted 06/05/2025 at 21:38:28\n68 Posted 06/05/2025 at 21:38:46\n69 Posted 06/05/2025 at 21:38:51\n70 Posted 06/05/2025 at 21:42:07\n71 Posted 06/05/2025 at 21:44:28\n72 Posted 06/05/2025 at 21:47:50\n73 Posted 06/05/2025 at 21:48:26\n74 Posted 06/05/2025 at 21:49:01\n75 Posted 06/05/2025 at 21:53:11\n76 Posted 06/05/2025 at 21:53:39\n77 Posted 06/05/2025 at 21:53:54\n78 Posted 06/05/2025 at 21:54:52\n79 Posted 06/05/2025 at 21:56:28\n80 Posted 06/05/2025 at 21:56:40\n81 Posted 06/05/2025 at 21:57:13\n82 Posted 06/05/2025 at 21:58:45\n\"Fillipo remember that time when you were 2-0 up in a Champions league semi at home and the your team screwed it all up and you went down 2-3 v Man Utd? Same shit just happened to me. But I have a cunning plan.\"\n83 Posted 06/05/2025 at 21:59:03\n84 Posted 06/05/2025 at 22:00:22\n85 Posted 06/05/2025 at 22:03:08\n86 Posted 06/05/2025 at 22:03:53\n87 Posted 06/05/2025 at 22:08:27\n88 Posted 06/05/2025 at 22:10:08\n89 Posted 06/05/2025 at 22:10:39\n90 Posted 06/05/2025 at 22:10:54\n91 Posted 06/05/2025 at 22:19:52\n92 Posted 06/05/2025 at 22:22:54\n93 Posted 06/05/2025 at 22:31:55\n94 Posted 06/05/2025 at 22:39:43\n95 Posted 06/05/2025 at 22:40:40\n96 Posted 06/05/2025 at 22:42:38\nAllez, Allez Paris\n97 Posted 06/05/2025 at 22:44:40\n98 Posted 06/05/2025 at 22:50:07\n99 Posted 06/05/2025 at 23:26:37\nThe premier league teams just distribute the money to mainly players who aren't capable of what we have seen over the last couple of weeks in the champions league.\nI bet that inter squad cost less than the average prem team.\n100 Posted 07/05/2025 at 00:22:49\n101 Posted 07/05/2025 at 01:04:28\nInter players are paid well. Martinez for example 300k plus per week. But to your point one time Everton target Dumfries — now a title winner and preparing for his second CL final is paid 80k per week — same amount as Michael Keane. So Inter pay similar wages to say Arsenal but then there is a huge drop off in wages in Serie A whereas most EPL teams outside the top six pay wages a little less than Inter. That is crazy. People like Holgate shouldn’t be earning anywhere close to players at Inter earn. God knows if we’d signed Dumfries we’d probably have paid him twice what Inter do.\n102 Posted 07/05/2025 at 03:39:29\nI was referring more to the transfer fees involved. As you say we probably matched the valuation for Dumfries and besides the likes of Martinez is there a player in the inter squad that they have paid massive amounts of money for.\n103 Posted 07/05/2025 at 05:56:46\nDumfries would have been a snip at the reported price he went for. At the time I thought we were dithering (not Moyes!!!!), but despite the supposed lure of the Premier League, he was probably holding out for something bigger and better in Europe.\n104 Posted 07/05/2025 at 07:39:34\nMartinez cost €25m in 2018. Expensive for a player bought direct from south America but worth every penny.\nThis works for them because Serie A produces good players at much lower cost than Premier Lesgue players\nSigning other Premier Lesgue players provides terrible value - and often very mediocre players too\n105 Posted 07/05/2025 at 07:49:58\n106 Posted 07/05/2025 at 08:33:50\nLast night's game was absolutely brilliant for every single football lover in the world, bar the Barcelona fans. It was a throwback to a time when football wasn't mostly about defending.\n107 Posted 07/05/2025 at 09:04:37\nBrilliant games to watch. I hope tonight’s game is just as good. I hope PSG go all the way.\nAndrew, it was widely reported that both clubs and the player had agreed terms. It was the FSW who pulled the plug and opted for Patterson. That’s what I heard.\n108 Posted 07/05/2025 at 09:08:36\nI watched an interview on the BBC News this morning with two survivors of the Bradford fire tragedy. Very moving accounts.\nI wonder if I Heysels will be mentioned later this month and if UEFA will recognise it at the final in Munich on 31st May, just 2 days after the 40th anniversary.\nBack to last night, a total joy to watch. I had hoped for a Barcelona v PSG final, but Inter deserve their place. Big shoes to fill for tonight's Arsenal v PSG match, but there have been some great matches in the latter stages of this competition.\n109 Posted 07/05/2025 at 10:26:11\nI’d love to know who really gave the go-ahead for the signings of Patterson and Mykolenko, right after the sale of Luca Digne, Colin.\nBenitez only lasted another few weeks after we signed three players who weren’t ready yet in that January transfer window\n110 Posted 07/05/2025 at 10:46:54\n111 Posted 07/05/2025 at 10:54:34\n112 Posted 07/05/2025 at 11:24:12\nTraditionally, we associate the Italian teams with negative tactics and defending. Maybe Napoli in the 80s were an exception, but they had Maradona. I know we talk about it being a team game, and it is.\nBut every now and then, you get a player who is effectively a one-man show. Cruyff was probably similar in his prime. A player who has a turn named after him, that we still teach kids today.\nI say that, but I'm not sure the knees and ankles could handle a perfect demonstration now.\nI'm looking forward to watching the winger Doue play for PSG tonight. He has been exiting to watch in this competition. If Arteta is brave tonight, he will play Declan Rice in a more advanced position. He impacts the game more there as opposed to when he is held back as a holding player.\n113 Posted 07/05/2025 at 14:44:13\nYes, I think Johann Cruyff was a special player who most football fans looked forward to watching, together with three or four players in that great Dutch team of the time.\nI think Arteta has been playing Rice in a more forward position in the last couple of games and he made two or three attacking moves with the ball in that game v PSG last week so he might have to let him off the hook completely tonight to get through to the final.\nThat was a very good game last week and I hope we get another one tonight.\n114 Posted 07/05/2025 at 14:59:01\nIf Cruyff had gone to the World Cup in Argentina in 1978, the Dutch would probably have won it.\n115 Posted 07/05/2025 at 15:08:41\nYes, I going to mention that — Cruyff and another Dutch player had fallen out with the Dutch manager and refused to go to Argentina with the Dutch team.\n116 Posted 07/05/2025 at 15:20:08\nRuud Gullitt was on The Overlap last week, worth a look, he was saying Cruyff was a genius as a player and manager.\nHe said he was way ahead of his time with his formation and tactics.\n117 Posted 07/05/2025 at 15:23:00\nHe/they were so shook up that he didn't want to leave them for a few weeks. The police ordered him to be quiet about the kidnap attempt, so the public reason went back to his fallout with the coach.\nCruyff was particularly forthright, even for a Dutch person (my wife is Dutch, so I have good experience of this!), as some of us will remember when he was part of the World Cup panel on ITV.\n118 Posted 07/05/2025 at 15:29:37\nI know we'd been looking at Patterson for a while, and it was Kenwright that negotiated the deal, described by Rangers as 'a pleasure to deal with'.\nIt looked to me like Digne wanted to leave, and Ferguson states this in his book. Benitez didn't like him and it seemed a win-win to get a higher earning player off the books.\nBut then we spent more money on the two replacements that weren't as good!\n119 Posted 07/05/2025 at 15:54:59\nWe sold a very good fullback who wasn't really fancied by Benitez, and replaced him with two very inexperienced full-backs who were not quite ready, and we took a player from Villa to allegedly help the Luca Digne transfer go through a bit smoother.\nA few weeks later, Benitez was gone and suddenly Frank Lampard was the manager, and in came Dele Alli.\n\"How not to run a football club\" is how most people viewed it, unless you were fortunate enough to be involved in football, because rumour had it that Everton usually got things right…\n120 Posted 07/05/2025 at 16:07:38\nDuncan correctly asserted that we needed a strong central midfielder. The rest is history, to our cost.\n121 Posted 07/05/2025 at 16:09:47\nPT and Christy, it was Cruyff who made me a Barca supporter around 1974 or 75, as Sheedy made me an Evertonian a decade later. Barca came through Chicago on a summer tour, as many top teams did at that time, and they played some Bundesliga team in a mudhole called Hanson Stadium, which hosted probably eight games every weekend between the local ethnic semipro clubs. While every other player on the pitch was skidding around in the muck, Cruyff seemed to glide over the top of it, playing keepy-uppies. Then lit up a cig at halftime, right on the bench. I was hooked.\nI saw Pele on the same pitch, probably that same summer, when his Santos played Lazio. He scored two goals and fell down in the mud.\n122 Posted 07/05/2025 at 16:12:49\nMe and me Dad were watching him do that turn in the 1974 World Cup, Cruyff sent us into another room and we were only watching! Even his book is an absolute cracker.\n123 Posted 07/05/2025 at 16:22:46\nPersonally I think it starts with massive investment into the academy. The longer we wait to do this, the longer we go without reaping the rewards.\nIt's nearly 10 years since Moshiri took over. If we'd switched focus to the academy at that point - we could now realistically expect a crop of high quality players aged between about 18 and 24.\n124 Posted 07/05/2025 at 16:26:07\nIf you didn't know them, you would consider them rude. But they are just very direct and don't hold back. They make Scousers appear like diplomats.\nWhy we let Digne go is still beyond me. It could only have been through necessity to sell, or the manager's own ego??\n125 Posted 07/05/2025 at 16:37:13\nIt seemed to me that Benitez thought he knew more about transfers than the DoF, more about fitness than the physios (I think he knackered Calvert-Lewin) and nothing about keeping up with football's evolution. Moshiri was another thick, rich owner who fell for the 'he won the Champions League' history lesson.\n126 Posted 07/05/2025 at 16:41:43\nAnybody heard anything?\n127 Posted 07/05/2025 at 17:21:36\n128 Posted 07/05/2025 at 18:05:17\nI honestly put it down to the fans and some exceptional contributions from a few players and a few managers.\nThis summer is the start of a rebuild that should end in a team which competes for cups and Champions League spots.\n129 Posted 07/05/2025 at 18:12:16\n130 Posted 07/05/2025 at 18:24:14\nI heard he didn’t rate Digne, and although I have got no evidence, I don’t believe he would have been responsible for the signings of Patterson or Mykolenko.\nBenitez the most incredibly divisive managerial appointment was given £1.5 million, to begin with after being promised more money if he cut the wage-bill.\nHe cut the wage-bill, got crucified for getting rid of an injury prone Rodriguez, a player that the club simply couldn’t afford, and was allowed to sign Rondon, on a free transfer, as a reward!\nPatterson was getting talked about for a long time, and probably a lot longer than the six months Benitez, was manager, and there is evidence of Bill Kenwright, playing a major part in the negotiations, just like he was allegedly involved in the Deli Ali, deal.\nThe club, was a shambles, an absolute fucking shambles. It was full of nepotism and was nothing short of a gravy-train, for a lot of very mediocre footballers, directors of football, coaches, directors, chief executives and a complete conman acting as a chairman.\nLet’s hope that Bramley-Moore, is the catalyst because there is so much about Everton, that I can’t identify about the club, I first started supporting, over 50 years ago.\n131 Posted 07/05/2025 at 18:44:16\nIt's a miracle we didn't go out of business, as would have happened if we'd been relegated.\n132 Posted 07/05/2025 at 19:16:11\n134 Posted 07/05/2025 at 19:34:59\nPatterson vs Dumfries\nFunes Mori vs Van Dijk\nGodfrey vs Gabriel\nDion Dublin vs Angel\nGerrard vs Martyn\n135 Posted 07/05/2025 at 19:38:07\nQuick get rid of him, Bill, give him a few quid and makes sure there is something written down, just in case he decides to tell everyone who else it was besides the players… 😂\n136 Posted 07/05/2025 at 19:38:15\n137 Posted 07/05/2025 at 19:53:42\n138 Posted 07/05/2025 at 19:56:08\nYou know me and many others to know what this club of ours means to us. And it is ours. No-one will ever take it away from us.\nI was uncomfortable with Benitez, but thought give it a go. I think the dogs talked me around. But it went sour quickly. It was always going to.\nThis club has hung us out to dry and taken our loyalty for granted. I always say that dogs have unconditional love that humans can only hope for and talk about. I feel like that about Everton no matter what they put me through.\nA lot of people, fellow Evertonians included, struggle to understand me. Like you, I've struggled to identify with what Everton became in recent decades.\nBut as the words to When Skies Are Grey say, please don't take my Everton away. They may have tried, but they can't. Us the supporters will refuse to accept that. Our club. Not theirs.\n139 Posted 07/05/2025 at 19:56:20\n140 Posted 07/05/2025 at 19:57:25\nBrill song; brill setting; brill viewing; brill thinking.\n141 Posted 07/05/2025 at 20:00:39\nEverton spent around £1.5M in that summer transfer window, and I don't believe there was any more money available[ if there was, then surely it would have been spent?\nI remember bumping into Brands in Manchester, and asked him why was he shopping when he should have been working on signing us some new players?\n\"We won't be spending much money, unless things change towards the end of the window\" he replied, and things never changed because we signed a very unfit Solomon Rondon.\n143 Posted 07/05/2025 at 20:07:05\nWhat a song, it reminds me of the great time I had with my mates and my kids in Germany, attending the 2006 World Cup, and as we all know…. You have got to be a little bit crazy, to be a toffee!\n144 Posted 07/05/2025 at 20:07:17\n145 Posted 07/05/2025 at 20:11:58\n146 Posted 07/05/2025 at 20:18:19\nClickbait bullshit mate.\n147 Posted 07/05/2025 at 20:28:59\n148 Posted 07/05/2025 at 20:32:00\n149 Posted 07/05/2025 at 20:34:08\n150 Posted 07/05/2025 at 20:36:33\n151 Posted 07/05/2025 at 20:57:04\nHis mum was his agent (fierce looking woman) and he had a high pitched girly voice. Good player though.\nJoe 144, Beto be right\n152 Posted 07/05/2025 at 21:00:34\nThe Rangers chairman congratulated Bill Kenwright for the excellent way he negotiated the deal with him over Patterson.\nDanny (124),\nIt was the necessity to sell and get his high wages off the books we'd got a few good years out Digne and he hadn't been playing all that good for the last 12 months he was here and we made a decent profit on him.\n153 Posted 07/05/2025 at 21:18:40\n154 Posted 07/05/2025 at 21:20:56\n155 Posted 07/05/2025 at 21:27:01\n156 Posted 07/05/2025 at 21:28:43\n157 Posted 07/05/2025 at 21:29:29\n158 Posted 07/05/2025 at 21:31:48\n159 Posted 07/05/2025 at 21:33:43\nBack to the penalty, why do players do those silly run ups?\n160 Posted 07/05/2025 at 21:39:14\n161 Posted 07/05/2025 at 21:39:30\n162 Posted 07/05/2025 at 21:43:33\nI love football, which means I get a sickening feeling when I see decisions like that, especially on a game of such magnitude, and I'm pretty certain I could end up not watching football in the future because of these very selective and subjective decisions.\n163 Posted 07/05/2025 at 21:43:33\nWenger survived by qualifying for the Champions League for quite a few years. I think Arsenal will give him another season, perhaps two.\n164 Posted 07/05/2025 at 21:49:28\nThe weird thing was investing the proceeds in Mykolenko and Patterson - both of whom seemed to cost twice as much as you might expect.\nI don't believe for a moment that Dumfries was going to join us once Inter wanted him, but there were plenty of more obvious candidates around for the kind of money spent.\n165 Posted 07/05/2025 at 21:50:06\nMost VAR penalty reviews look at ways to give a pen. They are not objective enough nor do they use common sense.\nLast night's penalty was the same: defender got a decent touch but the attacker put his foot across to make sure there was contact. VAR is killing the game and more often rewards the cheat.\n166 Posted 07/05/2025 at 21:50:25\nWenger might have had the lowest net spend in the division, and but for his brilliance, there is no way Arsenal would have been able to build the fantastic Emerites Stadium, whereas I’m sure Arteta has spent over £800 million, and hasn’t got that much to show for it.\nPeople say he’s Pep-light, but just I see a man, who spent a long time playing for a cautious manager, whilst he was a player, and although I understand how hard it must be playing without a recognised centre forward at this level, I just don’t see enough intensity, in Arsenal’s play on a regular basis?\nI thought it was a penalty when I saw it from the other angle Sean, but when Rice, got booked when giving away the free kick which led to the first PSG goal, my thoughts after seeing the replay, were exactly the thoughts you had on last night’s penalty, mate\n167 Posted 07/05/2025 at 21:59:24\nArsenal played okay but this is Champions League and they have hit their glass ceiling.\n168 Posted 07/05/2025 at 22:03:47\nI read something towards the beginning of the season regarding how young this Arsenal team is. Of course that doesn't mean they will necessarily get better but I think Arsenal will give Arteta time to see.\nIf Arteta's management style has been influenced by Davey Moyes... I don't think I've ever seen it... no matter what I've been drinking/smoking!\n169 Posted 07/05/2025 at 22:07:46\nYes, Patterson's price seemed to go up each timeI read the papers and I doubt there was any other clubs interested in signing him.\nAs for Mykolenko, the first game he played against Hull City in the FA Cup, I thin most of us thought \"Oh for fuck's sake! What have we bought?!?!\"\n170 Posted 07/05/2025 at 22:10:07\nNext season in the Premier League is going to be very interesting, and it wouldn't surprise me to see a shift in power that moves slightly away from the teams that have dominated the last few seasons. That's a big shout, especially with regards Manchester City, but I can see Chelsea, Newcastle and Villa, getting a lot closer, and they are definitely not far away now\nDon't you see a lot of caution in Arteta's young team at times, Brendan?\nI do and although I believe it can be a sensible approach, sometimes I get the feeling that Arsenal are way too rigid and play to orders just a little bit too much.\n171 Posted 07/05/2025 at 22:11:04\nI think it was as soon as he heard Kenwright talking about football!\n172 Posted 07/05/2025 at 22:13:14\nShocking miss by Saka. He had time to take a touch. He didn't need to hit it first time. Hes a great player, but a more experienced player would have used the time to compose himself.\nIve been impressed by PSG, but tonight they looked nervous and the occasion seemed to get to them.\nI think Inter might do them in München.\nThe atmosphere created by the Parisians made me jealous and start to imagine what the new Everton Stadium will be like under the lights when we get back into Europe.\n173 Posted 07/05/2025 at 22:17:18\n174 Posted 07/05/2025 at 22:19:19\nPSG made 10 changes on the weekend to rest players for tonight. Arteta played a full strength team against Bournemouth. Why?\nThe Red Shite had the league won 🤮🤮 and Arsenal qualified for Champions League next season. I think the lack of intensity was because they were jaded.\n175 Posted 07/05/2025 at 22:21:24\n176 Posted 07/05/2025 at 22:22:19\n177 Posted 07/05/2025 at 22:44:38\nThere's a lot of them about.\n178 Posted 07/05/2025 at 22:46:42\nThey came out fighting but getting that first goal was crucial. They couldn't get one at the emirates which they should have to take to Paris but blew it.\nPassing wise they are great to watch like Man.City but they do suffer from doing one pass too many.\nThey are iffy on defense which is why they dropped so many points this season and basically handed the title to RS way back.\nLewis -Skelly has burst on the scene in the Prem. but had a poor game today making a few bad passes and getting caught in his own third.\nThey need a few new buys which I am sure they will get but maybe Arteta will be replaced. Dyche is available… LOL.\n179 Posted 07/05/2025 at 23:18:59\nSpurs - lousy all season. Beat Bodø/Glimt and then United and win more trophies.\nGot to hurt in NW London.\n180 Posted 08/05/2025 at 06:37:05\n181 Posted 08/05/2025 at 09:36:51\nThere was actually an interesting debate about European competitions.\nQuestioning whether it should be named the Champions League, as most involved are not their nations' champions. I'm all for reverting to the old format. The counter argument was that it would be too small and over quickly. So what? Make the Europa League (previously the UEFA Cup) a bigger competition.\nAnd dismissal of the Europa Conference. It's a competition. It's a trophy and a journey that most of us would be more than glad to experience.\nIn my lifetime there were always 3 European competitions in the European Cup (the true champions competition), the UEFA Cup and the European Cup Winners Cup.\nIt didn't matter which one we were in. No one snubbed the Bayern Munich semi final or dismissed the Rotterdam experience.\nA lesser profile one, but this is what it means to follow Everton in Europe.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 4564,
  "scraped_at": "2026-02-14T01:55:13.642454",
  "_text_extracted": true
}