{
  "article_id": "266b21cb5501",
  "url": "https://www.managingmadrid.com/2024/9/30/24258087/out-of-control-30-september-2024",
  "title": "Out of Control : 30 September 2024",
  "date": "20240930T094500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nOut of Control : 30 September 2024\nPost Derbi Edition of the Daily Merengue\nShoutout to the mods who do a fantastic job, Valyrian Steel, Felipejack, Juninho, NeRObutBlanco and yours truly, Kung_Fu_Zizou\nThe Obscene Derbi\nReal Madrid remain undefeated and 3 points off the top while maintaining a 2 points lead over Barcelona’s title rivals.\nFede’s performance was incredible.. One might say the entire gameplan hinged on his performance. It wasn’t a great game. The game was under control for the most part but neither side probably thought they might lose the game until Militao scored.\nLunin might be making a return to the Champions League\nHopefully Courtois didn’t suffer too much damage. He’s a major part of our strategy. Those big saves he makes early in games have helped us avoid starting games on the backfoot.\nAtletico Madrid doing themselves no favours.\nWe all appreciate a captivating villain but what’s happened during the derbi and the comments made after the fact.. Lower than a snake’s belly.\nUtterly repugnant.\nEmbarrassing as it may be, I expected better from Cholo. The envy of the mattress makers just overflows and everything they do is justified by whatever they may have in lieu of a conscience.\nPlayers celebrate at every away stadium. From Messi taking his shirt off in front of the Bernabeu faithful after breaking their hearts with a last minute winner to Ronaldo’s famous “calma” celebration at Camp Nou.\nHowever Atletico fans are unique in that they have to be excused for behaving like animals and not held to the same standards as other fans.\nI hope they ban them for the entire season.\nPragmatic Carlo Takes The Draw\nIt’s no secret that Carlo feels light on resources. Lighter than he actually is. Perhaps he’s now become extra sensitive to the threat of injury which is alive every 90 minutes.\nCarlo did better than last season. But this is a new season. We’re not top of the table. We’re accumulating draws like we do trophies.\nThere’s no guarantee that we will win El Clasico or that the mattress makers will be any more docile when they visit the Bernabeu.\nThat said. It’s always better not to lose. We took a point against an inferior opponent.\nUP NEXT..\nLOSC LILLE\nCarlo probably had the Lille game in mind when making his subs. It won’t be an easy game but the return of Camavinga is like having 2 extra players. He can fill in everywhere on the pitch which will improve Carlo’s 2nd half strategy.\nCarlo was worried about his players when making subs. He’s on record intimating that Arda is rather fragile compared to his fellow young teammates. He was never going to throw him on in a game that physical. And Camavinga hasn’t played this season so he will need to be eased back.",
  "word_count": 502,
  "scraped_at": "2026-02-14T02:25:58.978632",
  "_text_extracted": true
}