{
  "article_id": "266efedc7b99",
  "url": "https://www.teamtalk.com/chelsea/blues-relieved-thiago-silva-rejects-rival-interest-sign-with-former-club",
  "title": "Chelsea relieved as Thiago Silva rejects rival interest to sign with former club",
  "date": "20240424T151500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nChelsea relieved as Thiago Silva rejects rival interest to sign with former club\nThiago Silva will snub interest from rival Premier League sides when leaving Chelsea this summer, with a report revealing a ‘verbal agreement’ with one of the defender’s former clubs has been struck.\nSilva, 39, is unquestionably among the greatest centre-backs of his generation. The legendary Brazilian has won 113 caps for his country and lifted 29 major honours during his glittering club career.\nSilva embarked on a brand new chapter in his career when moving to the Premier League with Chelsea in 2020.\nThe defender was aged 35 at the time and little was expected in the way of longevity in west London.\nHowever, fast forward four years and Silva has been among the Blues’ top and most consistent performers since the turn of the decade.\nWhat’s more, he finally lifted his first ever Champions League title with Chelsea in 2021 and was named the club’s player of the year for the 2022/23 season.\nHowever, all good things must come to an end and Silva and Chelsea have mutually agreed to part ways when the current campaign concludes.\nSilva’s existing contract expires on June 30 and he’ll leave Stamford Bridge as a free agent at that time. The subject of where he’d go next has hit the headlines of late.\nEXCLUSIVE: Cole Palmer advised over shock Chelsea exit as Boehly is given stark Pochettino warning\nPremier League interest in Silva\nIndeed, a long-rumoured return to Brazil with boyhood club Fluminense has regularly been touted. However, journalists Eduardo Burgos and Rudy Galetti both suggested staying in Europe – and even in England – was a possibility.\nSilva was understood to be courting interest from unnamed Premier League sides as well as clubs in Serie A. Interest also formed from MLS and the Saudi Pro League.\nChelsea have a chequered history with letting players go too soon. The likes of Declan Rice, Jamal Musiala, Kevin De Bruyne and Mohamed Salah were all on Chelsea’s books once upon a time.\nHAVE YOU SEEN: The ridiculous XI of players Chelsea sold before they hit their prime: Salah, De Bruyne, Ampadu…\nThe idea of Silva starring for a Premier League rival next term won’t have been a palatable one for the Blues. Thankfully for those of a Chelsea persuasion, they’ll be spared that scenario.\nSilva to return to Fluminense\nGoal report Silva has verbally agreed to return to Fluminense to round out his career in his home country.\nSilva will reportedly make the move once his contract expires at the end of June and as such, will join Fluminense mid-way through the Brazilian domestic season.\nSilva was on Fluminense’s books as a youth team player between 1998-2000. He later starred for the club while on loan in 2006 and later after signing outright between 2007-09.\nSilva has racked up over 800 career appearances in club football alone. 150 of those came with Chelsea and his free agent signing four years ago will be looked back on as incredibly shrewd acquisition by the Blues.\nDON’T MISS: Chelsea make contact for thriving RB Leipzig star but face PSG competition",
  "word_count": 530,
  "scraped_at": "2026-02-14T01:51:24.792525",
  "_text_extracted": true
}