{
  "article_id": "2672ff8af5a9",
  "url": "https://thepeoplesperson.com/2023/10/17/sir-jim-ratcliffe-criticised-manchester-uniteds-signing-of-casemiro-270833/",
  "title": "Sir Jim Ratcliffe criticised Manchester United signing of Casemiro - Man United News And Transfer News",
  "date": "20231017T221500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sir Jim Ratcliffe reportedly questioned Manchester United’s signing of Casemiro when he visited the club a few months ago in the midst of the takeover process.\nThe 70-year-old is closing in on a minority investment at United, almost 11 months after the Glazers kickstarted a strategic review.\nFollowing the withdrawal of Sheikh Jassim Bin Hamad Al Thani from the sale, the door opened for Ratcliffe to swoop in.\nThe decision of whether to ratify selling a 25% stake in United to the INEOS billionaire is expected to be put to a vote during a board meeting on Thursday.\nHe is expected to be granted full sporting control, which means the British businessman could have a huge influence on crucial matters such as transfer budgets and recruitment.\nA report covered by The Peoples Person indicated that there are already plans in motion to kickstart a radical overhaul of United’s football operations.\nThe likes of ex-Monaco sporting director Paul Mitchell and French executive Jean-Claude Blanc have been earmarked for possible backroom roles under Sir Jim.\nIn March, representatives from INEOS led by Sir Jim himself visited United’s Carrington training complex where they were subjected to presentations about the inner workings of the club including its financial shape and long-term strategies to improve the squad.\nThe Guardian reports that during this excursion, Sir Jim raised his concerns about United’s poor transfer planning and especially pinpointed the signing of Casemiro last summer as an unwise move.\n“Sir Jim Ratcliffe questioned Manchester United’s recent transfer policy during his visit to the club in March, with the prospective new minority owner citing the previous summer’s acquisition of Casemiro as an example of what he views as questionable recruitment.”\n“Ratcliffe suggested the choice of the players signed by United in the past few seasons had not always been the most prudent.\n“As an example he pointed to Casemiro’s purchase for €60m the previous August from Real Madrid. The midfielder was 30 years old and was given a four-year contract of about £350,000 a week.”\nJamie Jackson added that Sir Jim is satisfied with United’s commercial performance, but firmly believes investment in the squad can be significantly improved.\nCasemiro enjoyed a superb first season with the Red Devils and was crucial to his side’s winning the Carabao Cup and finishing within the Champions League places.\nThis term however, the Brazilian midfielder has demonstrated a sharp decline from his usual dominant displays despite scoring four goals across all competitions.",
  "word_count": 410,
  "scraped_at": "2026-02-14T01:56:32.774794",
  "_text_extracted": true
}