{
  "article_id": "2683a36dc3da",
  "url": "https://metro.co.uk/2026/02/07/they-celebrated-far-much-john-terry-slams-arsenal-reaction-chelsea-win-26755169/",
  "title": "  They celebrated far too much  - John Terry slams Arsenal reaction to Chelsea win | Football",
  "date": "20260207T100000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Terry has hit out at Arsenal’s reaction to their Carabao Cup semi-final victory over Chelsea, accusing Mikel Arteta’s players of ‘celebrating far too much’ and ‘showing the pressure’.\nHolding a 3-2 lead from the first leg, Arsenal found themselves in the driving seat to advance through to this year’s final – but they were made to work for it at the Emirates on Tuesday night.\nThe visitors, starting out with a back five, managed to keep the Gunners’ chances to a minimum across what was largely a turgid and cagey affair in north London.\nBut Arteta made a double substitution with 20 minutes remaining of the second leg and the change worked wonders, with ex-Chelsea man Kai Havertz coming on and scoring deep into stoppage time to send the home crowd into a frenzy.\nOnly Manchester City – who got the better of Newcastle in their semi-final – stand between Arsenal and the club’s first piece of major silverware since their FA Cup triumph in Arteta’s debut season way back in 2020.\nLiam Rosenior’s Chelsea, meanwhile, will look to bounce back from the disappointment when they return to Premier League action away to lowly Wolves later today.\nReflecting on Chelsea’s 4-2 aggregate defeat, club legend Terry felt his former side left it ‘far too late’ to try and overturn the deficit away from home in the second leg.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think against Arsenal, this year the two games I’ve seen, we’ve outplayed Arsenal,’ the ex-Chelsea and England captain said in a video on his TikTok page.\n‘So going into those games, I’ve never feared Arsenal anyway, in the league or in any competition.\n‘I think it’s different if we’re in the Champions League semi-final, I think you’re approach then becomes a little bit cautious.\n‘But it’s the Carabao Cup, we’ve won it many times and we had nothing to fear, I don’t think, going into that. I think the pressure was on Arsenal in the week and I think we made it very easy for them at home as well, so disappointed with that, I think we left it far too late.’\nTerry then turned his attentions to Arsenal’s celebrations after the second leg, which he felt were over the top given ‘wasn’t the Champions League final’.\nAccording to Terry, the reaction demonstrated how Arteta’s players are ‘showing the pressure’ and ‘feeling the nerves’ with so much expectation on their shoulders this season.\n‘I just want to talk on Arsenal’s celebrations after… let’s not forget, it’s the Carabao Cup, it’s not the Champions League final,’ he went on.\n‘They celebrated far too much for me, I think that showed the pressure that’s on them at the moment.\n‘I’ve said it before, Arsenal are looking the best team by far in the Premier League so far and I think they’ve got the best squad in the Premier League so far.\n‘They’ve got a lot of strength in depth and I think they’ve been the best, but also, it certainly wasn’t the Champions League final that they’ve qualified to, it’s the Carabao Cup final.\n‘Yes, it’s the first competition you can win, I think it’s really important, but that just showed me where the Arsenal team are at at the moment.\n‘They can feel the nerves and I know every Arsenal fan out there is feeling what I’m feeling, that there’s still a chance.’\nWere Arsenal's celebrations over the top?\n-\nYes\n-\nNo\nTerry – a five-time Premier League winner with Chelsea – believes Manchester City and Liverpool are still in contention in the top flight, despite Arsenal’s six-point lead at the summit.\nMore Trending\nHe added: ‘Manchester City have not got going yet, Liverpool have not got going, and those two teams face each other this weekend.’\nArsenal can increase their advantage at the top of the table to nine points with victory at home to eighth-placed Sunderland this afternoon.\nHowever, the hosts could be without two of their key men in Bukayo Saka and captain Martin Odegaard, who have both been nursing minor injuries.\nMikel Merino is a certainty to miss the clash and is set for a lengthy spell on the sidelines due to a broken foot.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Wolves vs Chelsea: Predicted lineup today and confirmed team news\nMORE: Arsenal vs Sunderland: Predicted lineup today and confirmed team news\nMORE: Joe Cole makes bold title claim as Arsenal lead Man City ahead of Liverpool clash",
  "word_count": 812,
  "scraped_at": "2026-02-14T01:59:36.843826",
  "_text_extracted": true
}