{
  "article_id": "26a09fc52ed6",
  "url": "http://www.greekherald.com/news/278547973/being-there-at-18-is-something-to-be-valued-yamal-aims-to-achieve-ballon-dor-dream",
  "title": "  Being there at 18 is something to be valued ...: Yamal aims to achieve Ballon dOr dream",
  "date": "20250902T180000Z",
  "domain": "greekherald.com",
  "source_country": "Greece",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ANI\n02 Sep 2025, 20:41 GMT+10\nBarcelona [Spain], September 2 (ANI): Following a memorable 2024-25 season with Barcelona, teenage football sensation Lamine Yamal opened up on his dream to win the Ballon d'Or award, the highest individual honour in the sport, saying that being there at the age of 18 is 'something to be valued' and he hopes of fulfilling his dream.\nYamal was sensational for Barca in the 2024-25 season, delivering 18 goals and 25 assists across 55 matches across all competitions, playing a massive role in their domestic treble of La Liga, Copa del Rey and Spanish Super Cup. He also took the Spain Euro Championship title last year.\nHe emerged as the 'Best Young Player' in the competition. The only setback was the club's UEFA Champions League dreams being crushed in the semifinal against Inter Milan.\nYamal joined stars like Ousmane Dembele, Jude Bellingham, Erling Haaland, Harry Kane and Kylian Mbappe, among others, as one of the nominees for the football's top individual prize, which is a Golden Ball.\nCurrently on international duty with Spain, Yamal admitted that he dreams of securing the coveted prize and expressed how delighted he was to be nominated for the award. The ceremony for the 2025 Ballon d'Or will take place on September 22 at the Theatre du Chatelet in Paris.\nSpeaking to RTVE, the teenage attacker said, as quoted by Goal.com: 'As a team, winning the Champions League with Barca would be incredible, and individually, every player wants to win the Ballon d'Or, and anyone who tells you otherwise is lying. Being there at 18 is something to be valued, and I hope it happens.'\nYamal will be in action next against Bulgaria for Spain in the World Cup Qualifiers. Their second qualifying game of the September international break is against Turkey on Sunday. Spain will be eyeing the prize, which they won once back in 2010, when it takes place in Canada, Mexico and the USA from June 11 next year. (ANI)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Greek Herald news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Greek Herald.\nMore Information\nnull in null\nBEIJING, China: Chinese President Xi Jinping will host more than 20 world leaders at a regional security summit in China next week....\nNew Delhi [India], September 2 (ANI): Waiel Awwad, West Asia Strategist and Journalist, said that the US saw the outcome of the Shanghai...\nNew Delhi [India], September 1 (ANI): Air India Express launched direct flights from Ahmedabad and Chandigarh, connecting directly...\n(250901) -- ANKARA, Sept. 1, 2025 (Xinhua) -- A man shops at a supermarket in Ankara, Trkiye, Sept. 1, 2025. Trkiye's economy grew...\nNew Delhi [India], September 1 (ANI): Tata Motors reported a sharp rise in electric vehicle (EV) sales in August 2025, with a 44 per...\nNew Delhi [India], September 1 (ANI): Households globally are increasingly shifting from physical assets to financial assets, and India...\nBarcelona [Spain], September 2 (ANI): Following a memorable 2024-25 season with Barcelona, teenage football sensation Lamine Yamal...\nOn September 1, the OSCEs 57 member states unanimously decided to wind down the OSCE Minsk Group by the end of the year. Created...\nManchester [UK], September 2 (ANI): More than two hours after announcing the exit of Ederson, Manchester City confirmed the arrival...\nABU DHABI, 2nd September, 2025 (WAM) -- Khalifa University of Science and Technology and HENSOLDT France, subsidiary of global leader...\n(250902) -- NEW YORK, Sept. 2, 2025 (Xinhua) -- Alexander Bublik of Kazakhstan serves during the men's singles fourth round match against...\nShare article Print article Turkey's peace process is advancing. In August 2025, three months after the Kurdistan Workers' Party...",
  "word_count": 646,
  "scraped_at": "2026-02-14T01:52:36.761191",
  "_text_extracted": true
}