{
  "article_id": "26c02b6014f6",
  "url": "https://www.barcablaugranes.com/2024/12/11/24316978/borussia-dortmund-barcelona-champions-league-team-news-match-preview-lineups-score-prediction",
  "title": "Borussia Dortmund vs Barcelona , Champions League : Team News , Preview , Lineups , Score Prediction",
  "date": "20241211T044500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Borussia Dortmund vs Barcelona, Champions League: Team News, Match Preview\nHansi Flick returns to a happy hunting ground looking for a much-needed win to help boost his team’s European position and morale\n*Standings at beginning of Matchday 6\nCompetition/Round: 2024-25 UEFA Champions League, League Phase, Matchday 6\nBarcelona Outs & Doubts: Marc-André ter Stegen, Ansu Fati, Andreas Christensen, Marc Bernal (out), Ronald Araujo (doubt)\nDortmund Outs & Doubts: Waldemar Anton, Niklas Süle (out), Karim Adeyemi, Maximilian Beier (doubt)\nDate/Time: Wednesday, December 11, 2024, 9pm CET/WAT (Barcelona & Nigeria), 8pm GMT (UK), 3pm ET, 12pm PT (USA), 1.30am IST (India, Thursday)\nVenue: Signal Iduna Park, Dortmund, Germany\nReferee: François Letexier (FRA)\nVAR: Dennis Higler (NED)\nOn TV: TUDN (USA), TNT Sports 4 (UK), SuperSport (Nigeria), Movistar (Spain), others\nOnline: Paramount+ (USA), discovery+ (UK), Movistar+ (Spain), Sony LIV (India), others\nFollowing a wild and disappointing draw away to Real Betis to complicate their situation at the top of the La Liga table at the weekend, Barcelona return to action for a monster UEFA Champions League League Phase clash against Borussia Dortmund at the Signal Iduna Park on Wednesday night.\nBarça come into this one after wasting two more points as their league form continues to deteriorate, but their European exploits have been immune to their struggles: the Catalans have won four League Phase games in a row, including a dominant victory over Brest in the middle of all of the domestic chaos, so there is hope that they can recapture their early-season magic when the Champions League anthem blasts through the Westfalenstadion speakers.\nBut beyond just the need to return to their best and regain their confidence for future games, Wednesday’s tie has a real impact on Barça’s European future: a fifth consecutive win would represent a massive step towards a Top 8 finish and an automatic spot in the Round of 16, especially with that win coming against another direct Top 8 rival in Dortmund.\nHansi Flick knows the importance of this win, and he’s thankful he gets to do it in Dortmund: if there’s one coach who doesn’t really mind having to face the Yellow Wall, one of the most intimidating atmospheres in all of football, it’s the German boss, who dominated this fixture while manager of Bayern Munich.\nFlick has won all of his five meetings with Dortmund by a combined score of 15-6, twice at Borussia’s home. The coach knows exactly what to expect from his opponent, which hasn’t changed much from a tactical standpoint since Flick last faced them.\nNow coached by their former midfielder Nuri Sahin, Dortmund remain a high-intensity, attack-minded, high-pressing machine when playing at home, and that has made them almost unstoppable in front of their fans this season. Only Bayern Munich have managed to avoid defeat when visiting Dortmund, and they suffered quite a bit against the home team’s press and needed a late equalizer to escape with a point.\nEuropean nights are always special in Dortmund, and the importance of the game for both teams will give the crowd even more reasons to turn this into a spectacular atmosphere. Barça have not played well on the road at all lately apart from their win in Mallorca, and the way they suffered against Betis was a small preview of what Borussia could do to them if they are not at their best.\nThis should be nuts.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-2-3-1): Peña; Kounde, Cubarsí, Iñigo, Balde; Casadó, Pedri; Yamal, Olmo, Raphinha; Lewandowski\nDortmund (4-2-3-1): Kobel; Ryerson, Can, Schlotterbeck, Bensebaini; Nmecha, Gross; Malen, Sabitzer, Gittens; Guirassy\nPREDICTION\nI’m really scared of Dortmund in front of their fans, but I’ll choose to trust Flick to have the right formula and for the players to respond after the recent dip in form: 3-2 Barça in a wild one.",
  "word_count": 633,
  "scraped_at": "2026-02-14T02:28:28.508048",
  "_text_extracted": true
}