{
  "article_id": "26d27ec53f60",
  "url": "https://theathletic.com/5280346/2024/02/18/world-cup-2026-ticket-price-sale-date/",
  "title": "World Cup 2026 : How do I get a ticket ? Are tickets for sale ? How much do tickets cost ? ",
  "date": "20240218T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The next World Cup will be jointly hosted by the U.S., Canada and Mexico and will take place from June 11 to July 19, 2026.\nIt will be the first tournament to include 48 teams, expanded from the previous number of 32.\nThat means there will be more games than ever — 104 in total.\nThe tournament is a long way off, so details on tickets are thin on the ground, but this is what we know so far.\nAdvertisement\nWhere are the matches?\nThe World Cup will take place across 16 cities in three countries, more than any tournament before.\nThree of these locations are in Mexico: Monterrey, Guadalajara and Mexico City.\nTwo others are on either coast of Canada: Vancouver and Toronto.\nThe remaining 11 are in the USA: Miami, Boston, San Francisco, Seattle, Philadelphia, Los Angeles, Atlanta, Houston, Kansas City, Dallas and New York City.\nThat U.S. list gives the nearest big city to each stadium. Some venues are located in lesser-known settlements nearby, such as East Rutherford in New Jersey for New York and Santa Clara for San Francisco.\nHow does the tournament work?\nSince 1998, World Cups have had 32 teams, enabling a neat symmetry, but this one is bigger and 48 teams means a somewhat more complex format is necessary.\nThe tournament used to have eight groups of four teams in which each country played each other once. The top two in each group then progress to four knockout stages — a round of 16, then quarter-finals, semi-finals and the final.\nThe USA, Canada and Mexico all qualify automatically. The remaining 45 slots will be filled through qualifying competitions, which take place separately on each continent.\nIn 2026, there will still be four teams in a group and the top two will still progress to the next stage, but there will be 12 groups rather than eight.\nAnd the eight best third-placed teams — of 12 — in the groups will also progress, a similar format to the European Championships (which has 24 teams).\nThirty-two teams will progress to the knockout stage, meaning an extra knockout round, before the tournament continues from the round of 16 as it has in previous tournaments.\nWhere are the biggest games?\nThe U.S., Canada and Mexico will play their three group games in their home country.\nAdvertisement\nMexico City’s Azteca Stadium, which hosted the 1970 and 1986 World Cup finals, will host the tournament’s opening game. The U.S. will host 78 matches overall, while Canada and Mexico will host 13 each.\nAll of the quarter-finals and both the semi-finals will be in the U.S., along with the final. The quarter-finals will be in Boston, Los Angeles, Miami and Kansas City, while the semi-finals will be in Dallas and Atlanta.\nThe 23rd World Cup final will take place at the MetLife Stadium in East Rutherford, New Jersey, on the outskirts of New York City, on July 19, 2026.\nThese stadiums are split into three regions, west, central and east, in an attempt to minimise travel for fans. Nevertheless, the distances within regions are vast, with Kansas City and Mexico City (1,385 miles apart) in the same region, as well as Toronto and Miami (1,239 miles apart).\nAre tickets on sale?\nNo.\nWith more than two years to go until the tournament kicks off, there is little public information about tickets.\nA page on the FIFA website simply allows people to register their details to receive information about tickets when it is available. The Athletic contacted the tournament organisers for comment.\nHow will the ticketing process work?\nWe don’t know for sure, but looking at previous World Cups as well as similar events like the European Championships, it is possible to make some educated guesses.\nTickets for major tournaments are essentially split into three categories.\nFirst, there are tickets allocated to member associations — the two countries playing against each other in a given match. These are generally given to supporters on the basis of loyalty, for example by points built up from following the country in qualifiers.\nHow easy these will be to get hold of varies greatly depending on the country — they will be in high demand for the host countries, but easier to come across for nations far away with less of a travelling following.\nAdvertisement\nThe second category is those tickets given over to sponsors and other members of what FIFA likes to call the “football family”.\nThis does not just mean VIPs in glitzy hospitality boxes. For last year’s Champions League final in Istanbul, only about 40,000 went to fans of Manchester City and Inter Milan. The remaining 35,000 went to sponsors and all sorts of other people with links to UEFA. A small number of these may make their way into the hands of ordinary fans through tickets and giveaways.\nAs the tournament progresses and the games get more glamorous, the demand from sponsors and other “neutral” supporters will get higher.\nThe third is the rest. These are the tickets the public can buy without being a member of any country’s loyalty scheme or part of the football family.\nHow will these general sale tickets get allocated?\nWe don’t know for sure but can take a look at how Germany, the host of this summer’s European Championship, is allocating tickets.\nThere have been two stages of ballots in which people can select to buy several tickets in four different categories. Cheaper tickets are generally in higher demand, so it is likely to be easier to get a ticket by entering the ballot in a more expensive category.\nUEFA has not released details of further ticket sales. Still, there will likely be a limited amount of tickets on general sale between now and the tournament beginning in June, likely for the matches featuring less glamorous teams at bigger stadiums.\nDemand for tickets in Germany has been extremely high for several reasons.\nFirst, attending live football matches is a huge part of German culture, so demand from locals is high.\nSecond, the tournament is the only European Championship or World Cup in Western Europe taking place between 2016 and 2028, except Euro 2020, which took place across the continent but saw travel heavily restricted by Covid.\nThis means huge numbers of football fans across Europe want tickets for Germany.\nAdvertisement\nIt remains to be seen how strong demand will be for World Cup 2026, particularly in cities like Kansas City and Houston, which are not normally associated with football — but things in the U.S. are changing quickly in that respect.\nHow much do World Cup tickets cost?\nWe don’t know yet, but we can look at precedent.\nIt is often hard to give a definitive answer to this question because tournament organisers often sell some tickets at low prices, which are in reality very difficult to get hold of, with most fans paying far more.\nAn analysis by German sports consultancy Keller Sports in 2022 found that an average ticket at the Qatar World Cup was £286, rising to £684 for the final. This was a 46 per cent increase on the tournament in Russia in 2018.\nExcluding restricted view tickets and a special category only available to Qatari nationals, group stage tickets ranged in price from 40 Riyals ($11) to 800 Riyals ($213).\nThis steadily increased in price as the tournament progressed, with final tickets costing between 750 Riyals ($200) and 5850 Riyals ($1,560).\nThere may also be tickets available on secondary resale sites where prices are likely to be far higher.\nThese sorts of platforms are often risky to use in Europe, with football organisations not cooperating with them because of deeply engrained cultural norms against very high ticket prices.\nBut in the U.S., this taboo is not in place and it was perfectly possible to buy a Super Bowl ticket through a credible reseller — if you have $10,000 to spare.\nIt remains to be seen which approach the World Cup will take.\nHow much do tickets cost compared to the Super Bowl and other major events?\nThe cheapest face-value tickets for this year’s Super Bowl sold directly by the NFL were about $2,000, far higher than for any major football match.\nTickets changed hands for about five times this on the secondary market.\nAdvertisement\nTickets for the final are likely to reach similar eye-watering prices, but if you are not too picky about which game you go to, you will likely be able to get tickets for early World Cup games at far more affordable prices.\nIs it possible to attend every game at the World Cup?\nFootball YouTuber Theo Ogden, known as Thogden, attended every game of the Qatar World Cup in 2022, the first person in history to do this at a tournament.\nThis was possible because of Qatar’s tiny geographical size, although he did have to miss half of several of the games to fit them all in.\nBut there’s absolutely no chance of anyone repeating the same feat in 2026.\nOver a manic 17 days from June 11 and June 27, the entire group stage will be completed — all 72 games of it. The last four of those days will have six games on each of them, spanning the entire continent of North America.\nWith vast distances between stadiums, fans will have to plan their games carefully.\n(Top photo: Charly Triballeau/AFP via Getty Images)",
  "word_count": 1569,
  "scraped_at": "2026-02-14T02:07:39.551602",
  "_text_extracted": true
}