{
  "article_id": "26d3b626630d",
  "url": "https://www.arsenal.com/news/every-word-mikel-artetas-pre-wolves-presser-3",
  "title": "Every word from Mikel Arteta pre - Wolves presser",
  "date": "20251212T124500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has spoken to the media ahead of our clash against Wolves in the Premier League at Emirates Stadium.\nOur boss was speaking at the Sobha Realty Training Centre and provided an update on the team, facing Wolves and the return of Gabriel Jesus.\nHere's everything Mikel had to say, with a video for the full presser still to come:\non William Saliba:\nWe have to wait and see. Yesterday we didn’t train, so we have an extra day between this afternoon, let’s see if he can be available or not. It remains the same. If you asked me for the Everton game, I think he will be fit; for tomorrow, I don’t know.\non Jurrien Timber:\nAgain, depends how he feels today. It was a knock that he picked, and he wasn’t feeling comfortable. So again, I think it’s a matter of days, but whether it’s tomorrow or not we’ll see.\non Declan Rice:\nLet’s see how he is today. He was ill, that’s an illness, normally in a few days it gets resolved, but we have to wait and see.\non Leandro Trossard:\nAgain, another one that is a matter of days. It sounds boring, but it’s the reality, so we don’t know.\non keeping the momentum going after midweek:\nFor sure, after any defeat, you want to put it right straight away. We certainly did that, put ourselves in a great position in the Champions League, and now it’s about Wolves, focusing back on the Premier League after what happened and the result that we had against Villa, it’s a massive opportunity for us again to win the game and put ourselves in a good position.\non facing a Wolves team without a win this season:\nIn any Premier League match and especially against a team that is fighting against results, I know the manager really well and how he’s going to push and get the players ready to [try to cause a shock]. From our side, we’re going to go full gas from the beginning and we know what we have to do.\non if we have to beat Wolves to win the league:\nAt the end, you’re going to have to have over 90 points probably to win it, so that means winning a lot of football matches and tomorrow we have three points that we have to earn.\non winning two of the last five in the league:\nHopefully tomorrow we’ll change that and there will be a different [form table] and in the last one, we are the best. So we try to win every game and that’s the only thing that we can do in terms of being as consistent as possible.\non the Opta supercomputer making us favourites to win the league:\nThe only thing we can do is increase the probability of winning the next match by doing things that we do really well and preparing the best possible way.\non guarding against complacency:\nWell, showing them [our players] the team that they are, the game they had against Villa a few weeks ago, and understand that a team in that position have to react and have to show their teeth, and that’s a very dangerous thing, especially in this league when every team has the quality that they have. So from our side, that’s not going to happen.\non more open play goals in recent matches:\nThis is football, and it has waves, and you try to analyse the last five games or ten games and the sample is that small that you get very, very confused. At the end, even 40 games is not enough to have a sample of what your team looks like because it’s too small. But the fact that we have the resources to score from various positions with different players in different manners, that’s a great thing. We want to be the best in every situation, that’s what we try to do.\non Gabriel Jesus returning and fighting for his spot:\nWe know his quality, a player who has given us so much and he comes with the energy that came the other day. He’s certainly a player who has to be pushing and aiming for that, that’s for sure.\non if his side are getting enough credit:\nI don’t know, that’s not for me to judge. We’re in a very strong position in the three competitions that we’ve been involved in so far, and that’s what we have to continue to do at the end. The credit has to come at the end of the season, that’s when we’re going to measure what we’ve done, but in order to achieve that, you have to be achieving, every single day, the objectives that you want. So far, I think we are in a very strong position.\non Christian Norgaard playing centre back:\nI think that comes to the mentality of the players, the intelligence of a player like Christian as well, and how to fulfil that role. In the morning, you tell him, surprisingly, that he needs to play in that position because we don't have any other player to play in there. Then you need to fulfil that role. But we have a lot of examples of players that have played in different positions, like Mikel [Merino], like many others, and that's great because that gives us an edge.\non if he is enjoying this season:\nI do enjoy it a lot because of the people that are around us and how we live and work together. Obviously, winning a lot helps because it's a different profession when you win or you lose. I feel privileged to be where I am and keep going.\non if we can win the quadruple:\nWell, it's only the three points of tomorrow, and I think that's enough for the supercomputer in my mind.\non Viktor Gyokeres and the club adapting to his style:\nI think the two things have to merge. I think we have to put the player in the best possible condition to explode and fulfil his potential, and then there are certain things that within the role, in the manner that we play, has to be fulfilled, and that's a combination of both. Then it's not only that. I think, more importantly, is the connections and the players around him at the end, those interactions, that understanding, how it develops, and before the injury, I think he was in a great place. I think it took him a while at the beginning because it's a different league, different demands, he had no pre-season, and now he's starting to get some momentum. The goals will come and we're going to be very pleased with him.\non having a week with no midweek match:\nWell, three things. Make sure that we can give some rest to players, mentally and physically. Then start to re-activate everybody and start to work on things that you don't have time to work on. Then start to be in the best possible physical and emotional mindset to do what is required to be ready.\non any fresh injuries from Wednesday:\nNo.\non what Saliba’s issue is:\nIt was something quite small. It came from an ankle injury that he had and then he started to modify the way he was running and he started to overload an area, which is something common. But at some point he was uncomfortable continuing to be able to train and play and we had to stop it. He looks better but we'll have to wait and see if it's enough for him to be able to train with the team.\non if he would consider selling Gabriel Jesus:\nI don't consider that, especially with the situation that we have right now. I think Gabriel has a lot to offer to the team and he's proven that straightaway in the first minute that he was available to play he's put so much to be in this position again and now the focus is to be with us.\non Ethan Nwaneri’s attitude:\nIn the same manner that other players have to cope with this kind of situation, preparing in the best possible way, I think he's doing it. His attitude has been excellent and when he's got the chance to play, he proved that I'm wrong, that he needs to play more minutes and help the team as much as possible.\non him asking to play in the behind-closed-doors friendly:\nEthan's attitude on that is exceptional. He wants to train and he wants to be outside and he wants to be in touch with that ball. In that sense, he's top.\non how impressed he’s been with Martin Zubimendi:\nVery impressed because I know the difficulty of coming into this league and doing what he's doing immediately. First of all, you have to earn the role within the team and that's not easy to do. Then it's a different way of playing, a different league. But as you said, the variety of actions and involvements that he has in the game is exceptional. His defending metrics are incredible and I had no doubt that he could produce that, but this is the Premier League and you have to prove it. Then attacking-wise as well, the positions he takes, the way he's opened up teams in many ways, his goal threat, the capacity to assist. He's improved on set-pieces as well and he has a lot to improve in that area as well. He's a player that is never going to be satisfied. You can tell when I praise him individually, it's never enough, he's never satisfied with his performance, but that's what makes him as well.\non if he thought Zubimendi would need an adaptation period:\nYes. But I think the fact that he could prepare for a longer period because he sort of knew that he was coming, I think that helped. It wasn't something immediate that happened. So we talked a lot about how he was going to be needed, the challenges that he was going to face. But as well, his abilities and capacities were going to fit so well within the team and he's proven that on the pitch.\non if Viktor needs goals to get into form:\nYes, probably the thing that's going to unlock [him] is goals. He's so used to that that I think he needs that for himself, for his confidence. At the end, we're going to judge his performances based on that as well. That's logical. But for the rest, I think he's in a really good place. I think physically he's in a good place and now he needs to start to convert the chances that he's getting.\non if Manchester City are back to their best:\nThere are a lot of teams involved when you look at the table. We know the situation with other clubs as well. With Manchester City, it's always the case that you expect them to have the quality that they have, the experience that they have in the competition. The focus has to be on one.\non Arsenal In the Community Celebrating 40 years:\nThat's something remarkable, probably amazing. The moment that the club started to do that, we probably could never have imagined where we're going to be 40 years later. But that shows where it's coming from. I think the consistency in doing those things is the most difficult when a lot of people engage or jump into things for a very short period of time and it's very difficult to be consistent. I think the impact that the club is having in our community and in a lot of people's lives is something exceptional and it needs a lot of praising.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1993,
  "scraped_at": "2026-02-14T01:52:59.297986",
  "_text_extracted": true
}