{
  "article_id": "26e62d1d83c2",
  "url": "https://www.teamtalk.com/liverpool/disastrous-signing-crossed-suitors-wishlist-recent-approach-move-totally-ruled-out",
  "title": "Disastrous Liverpool signing crossed off suitor wishlist after recent approach , with move  totally  ruled out",
  "date": "20230301T134500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nDisastrous Liverpool signing crossed off suitor’s wishlist after recent approach, with move ‘totally’ ruled out\nArthur Melo has ended up in a new stalemate after seeing one of his potential escape routes after his Liverpool spell vanish into thin air, according to reports in his homeland.\nLiverpool signed Arthur on loan from Juventus back in September to increase their depth in midfield. However, the Brazil international has barely been able to make any impact. He debuted in a Champions League loss to Napoli, but has never featured since.\nInjury issues have prevented him from making his Premier League debut. Therefore, the chances of Liverpool utilising their option to buy him are slim.\nAt the age of 26, Arthur will find himself at a career crossroads in the summer. He has represented big clubs like Barcelona and Juventus in the past, but might not actually be up to that standard anymore.\nHence, Juventus might be looking for a new buyer for the midfielder after his time with Liverpool. One option that has been speculated would be to return to his first club, Gremio.\nBut according to UOL, the Brazilian outfit “totally rule out” the prospect of offering Arthur a second spell.\nREAD MORE: Nine players Liverpool could let go this summer as Jurgen Klopp plans a huge squad rebuild\nAlthough they did recently make an approach, they have learned that Arthur would still cost too much. Besides, Gremio believe they have enough depth in their own midfield anyway.\nIt perhaps symbolises Arthur’s fall from grace. He was Gremio’s most expensive export when he left for Barcelona and remains so to this day, but now he might not even be of enough use to them.\nAccording to UOL, it is likely that Arthur will stay in Europe next season. It surely won’t be with Liverpool, though, while Juventus are unlikely to reintegrate him.\nArthur Melo needs new solution after Liverpool nightmare\nHence, his agents will have to explore what options might be available to him. Clubs might be sceptical about what Arthur can offer after his latest experience, or at least be concerned about his physical status.\nYet he is at an age where he should be approaching his prime. Sadly for Arthur, given that his spells with Barcelona, Juventus, and soon Liverpool, are behind him, perhaps he has already passed it.\nIt remains to be seen how much of an impact he will get to make for Liverpool between now and the end of the season. Their midfield might be suffering, but that doesn’t mean he will be the answer, if he ever was.\nStill, after paying to have Arthur’s services for the season, they might as well find some use for him when they can.\nIt isn’t likely to be the start of any long-term plan involving him, but Arthur just needs to take one step at a time at this moment. Further down the line, despite being under contract with Juventus until 2025, he will have to find a new place to play his football.\nAt least he might not be Liverpool’s problem for much longer.\nREAD MORE – Transfer Gossip: Liverpool in meeting for World Cup winner to replace flop linked with former club",
  "word_count": 541,
  "scraped_at": "2026-02-14T01:59:41.693831",
  "_text_extracted": true
}