{
  "article_id": "2711f6c0c3ae",
  "url": "https://www.empireofthekop.com/2025/11/16/sinama-pongolle-liverpool-arsenal-transfer-snub/",
  "title": "Sinama - Pongolle explains why he snubbed Arsenal for Liverpool",
  "date": "20251116T134500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A former Liverpool striker has explained what ultimately persuaded him to sign for the Reds, despite previously been ‘convinced’ he would join Arsenal.\nIn 2001, a French teenager named Florent Sinama-Pongolle was one of the most highly-rated prospects in world football, having starred for his country as they won the Under-17 World Cup that year.\nUnsurprisingly there were plenty of top-end Premier League clubs vying to sign him, and despite the presence of his compatriot Arsene Wenger in north London, a conversation with a family member eventually swayed him to Merseyside instead.\nSinama-Pongolle explains why he chose Liverpool over Arsenal\nIn an interview with FourFourTwo, Sinama-Pongolle outlined just how close he’d been to joining Arsenal until learning that his cousin Anthony Le Tallec (also a Le Havre teammate at that time) was bound for Liverpool and duly changing his mind.\nThe now 41-year-old recalled: “I went to London to meet Arsene Wenger. He showed me the training ground, explained the project, and in my mind I was convinced; but then I spoke to my Le Havre teammate Anthony Le Tallec, and he told me he was going to Liverpool.\n“After hearing that, I felt the best thing was for us to keep playing together, so in the end I decided to move to Anfield instead.”\nSinama-Pongolle made a vital contribution to Champions League triumph\nSinama-Pongolle and Le Tallec seemed to come as a package in the early 2000s – they played together for France underage teams and Le Havre before signing for Liverpool in 2001 and, after two years back on loan with the Normandy club, relocating to Merseyside simultaneously.\nNeither of them were unable to capitalise upon their lofty reputations while at Anfield, but the former made a vital contribution on one of the stadium’s most memorable nights of the 21st century.\nWe all remember Steven Gerrard’s late piledriver against Olympiacos in December 2004 to spare the Reds from Champions League group stage elimination, but the comeback that night began with Sinama-Pongolle equalising off the bench shortly after half-time.\nWithout that goal, the glory in Istanbul five months later would’ve been someone else’s rather than Liverpool’s. He was unfortunately injured at the time of the famous triumph over AC Milan, but he’d already played his part in getting his team there.\nThe Frenchman could’ve won two Premier League titles and several FA Cups under Wenger had he stuck with his initial choice of Arsenal, but we imagine that he wouldn’t have swapped being part of a Champions League-winning squad for anything in his career.\nYou can watch Slot’s full post-Man City press conference via Empire of the Kop on YouTube:",
  "word_count": 441,
  "scraped_at": "2026-02-14T02:12:17.577844",
  "_text_extracted": true
}