{
  "article_id": "27616cb25521",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-forward-offered-lifeline-ligue-1-duo-ten-hag-picks-replacement",
  "title": "Man Utd forward offered lifeline by Ligue 1 duo as Ten Hag picks replacement for definite leaver",
  "date": "20240212T154500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd forward offered lifeline by Ligue 1 duo as Ten Hag picks replacement for definite leaver\nAhead of his departure from Manchester United in the summer, two suitors have already come forward for Anthony Martial, according to a report.\nMan Utd will decline the option to extend Martial’s contract for another year, meaning he will be available on a free transfer by the end of the season.\nIt will be a disappointing end to a once-promising Man Utd career, which we recently explored the highs and lows of in anticipation of his nine-year stay coming to a conclusion.\nWhile Martial’s Man Utd exit seems a foregone conclusion, where he will go next remains to be seen. But some clues are starting to emerge.\nFor example, Martial’s former club Monaco are becoming interested in offering him a second spell, according to The Sun.\nMonaco previously enjoyed Martial’s services for two years, in which he scored 15 goals from 70 games, before selling him to Man Utd for a record fee for a teenager in 2015.\nThey are not the only contenders to take him back to Ligue 1, though, since another suitor from the most recent transfer window hasn’t gone away.\nIndeed, Marseille are keeping an eye on how Martial recovers from injury, which scuppered their chances of signing him in January.\nMartial is not expected to be back in action for another month, but will be hoping to add to his 317 Man Utd appearances and 90 goals before he is released.\nEither Marseille or Monaco would be allowed to negotiate a pre-contract agreement with Martial right now if they wanted to, but it seems the decision will wait until the summer.\nLigue 1 return on cards for Martial\nDuring his time in Ligue 1 before, between spells with Lyon and Monaco, Martial scored 11 goals from 52 appearances.\nAs a Premier League player, he has scored 63 goals from 209 appearances, but the last season in which he hit double figures was 2019/20.\nHis departure from Man Utd is arguably overdue, but at the age of 28, he should still have several years of his playing career ahead of him, in which he will hope to prove at another club that he can still be an asset.\nEither Monaco or Marseille could have European football on offer next season. The former are currently in Ligue 1’s Champions League places, and the latter are only a handful of points away from UEFA territory with 13 games of the season still to go.\nMartial has played in the Champions League and Europa League for Man Utd, even winning the latter in 2016/17, so what Monaco and Marseille qualify for next season might be a factor to consider when choosing his next club.\nFor now, there are no details about the length of contract or salary that could be on offer from either suitor.\nThey will have to take into account his injury history, which has been a factor preventing his progress with Man Utd, and measure it against his ability when at his best.\nIN DEPTH – The eight Manchester United players who are out of contract at the end of the 2023-24 season\nWho could replace Martial?\nAlthough he has only started five Premier League games this season, Martial would leave a void in the Man Utd attack.\nThe only other recognised centre-forward at Erik ten Hag’s disposal is Rasmus Hojlund, who is starting to find his feet after a challenging start to his Man Utd career.\nA new striker will need to arrive in the summer and with that in mind, The Sun refers to Ten Hag’s interest in reuniting with his former Ajax frontman Brian Brobbey.\nBrobbey returned to Ajax in 2022 after a short spell with RB Leipzig and would be another long-term investment at the age of 22.\nHe has scored 17 goals in 28 games for an inconsistent Ajax side this season, backing up a 14-goal campaign last time out.\nPreviously, during his first spell at the club, Brobbey scored six goals from 17 appearances under Ten Hag.\nBrobbey would not be the first player with an Ajax past that Ten Hag has tried to reunite with, after bringing the likes of Lisandro Martinez, Antony and Andre Onana to Man Utd.\nDON’T MISS – Ratcliffe approves signing of £60m winger who’s chosen Man Utd",
  "word_count": 736,
  "scraped_at": "2026-02-14T01:51:19.064088",
  "_text_extracted": true
}