{
  "article_id": "2761f5b529d7",
  "url": "https://metro.co.uk/2025/05/01/harry-maguire-channels-inner-lamine-yamal-sensational-display-man-utd-victory-23012149/",
  "title": "Harry Maguire channels his inner Lamine Yamal with sensational display in Man Utd victory | Football",
  "date": "20250501T230000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim hailed Harry Maguire’s winning mentality after the Manchester United centre-half transformed into a tricky winger to help his side beat Athletic Bilbao in the Europa League.\nThe England defender has developed a knack for scoring crucial goals for United, often finding himself thrown up top as an emergency striker when things get desperate.\nMaguire scored a thrilling winning goal against Lyon in the quarter-finals last time out but turned provider on Thursday night to set up United’s opener in Bilbao in the first leg of their semi-final.\nFinding himself out on the right wing, Maguire left his marker in a daze as he twisted and turned his way around him, reaching the byline before lifting a perfect cross into the box.\nManuel Ugarte was first to it, nodding across goal to midfield partner Casemiro who converted from close range.\nBarcelona’s Lamine Yamal produced a sensational wing display in the Champions League on Wednesday night against Inter Milan with Maguire doing his best to channel the Spanish sensation tonight.\nSpeaking after the 3-0 win in the Basque Country, United boss Amorim paid tribute to Maguire’s silky wing play, praising him from bouncing back from his toughest moments in a United shirt.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHe’s a good winger!’ Amorim said.\n‘Sometimes there are moments in life, Harry has had some difficult moments in everything he did where everthing he did was wrong.\n‘Now everything he does is good for the team so he has to enjoy it.’\nMore Trending\nFollowing Casemiro’s opener, Bruno Fernandes scored twice as United sealed a comprehensive 3-0 win ahead of next week’s return leg in Manchester.\nMaguire said post-match: ‘It’s a great start. To come here and get a result and three goals, a clean sheet, it’s a great start. We can’t hide from that.\n‘All the pressure will be on us now, everyone will expect us to go through, so we need to prepare well, and if we do we will give ourselves a great opportunity to reach the final.\n‘It has been a great night for us, but one foot in the final, it’s still not done.’\nMORE: Rio Ferdinand singles out ‘sensational’ Man Utd star after win over Athletic Bilbao\nMORE: Tottenham dealt blow as star is pictured on crutches during Bodo/Glimt clash\nMORE: Chelsea ‘dream’ transfer target who’d cost £49m revealed ahead of summer window",
  "word_count": 446,
  "scraped_at": "2026-02-14T02:09:01.841759",
  "_text_extracted": true
}