{
  "article_id": "2776e0860683",
  "url": "https://www.nytimes.com/athletic/6821966/2025/11/20/steve-mcclaren-jamaica-world-cup/",
  "title": "Inside Steve McClaren Jamaica reign : World Cup failure , paying for staff flights and a hostile end",
  "date": "20251121T121500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The excitement of Jamaica potentially qualifying for just their second World Cup was palpable on the gridlocked streets of Kingston three hours before kick-off. Fans in a variety of yellow shirts, with flicks of green, creating a joyous kaleidoscope of expectation.\nWafting through the air was the smell of the jerk chicken and curry goat being cooked outside the city’s National Stadium, while inside dancehall blasted over the speakers.\nAdvertisement\nVictory over the tiny Caribbean island of Curacao would secure a place at the tournament in North America next summer. Hope was in the air. But it quickly turned to tension, and, in the end, a mix of anger and disappointment.\nWhile Curacao celebrated a 0-0 draw which meant they became the smallest nation to reach the World Cup, a deflated Steve McClaren read out a handwritten statement, announcing his resignation as Jamaica’s head coach.\nThe question of what McClaren, the former England manager and Manchester United assistant, will do next is likely answered on the operating table.\nThe 64-year-old has been managing an arthritic ankle for two years and doctors have recommended fitting a replacement through surgery, which will require four to six months of recovery. He had a procedure last year but has still required steroids and painkillers when leading sessions with Jamaica, a situation that became more pressing when he lost the services of his assistant this summer for the Unity Cup, the first phase of World Cup qualification and the Concacaf Gold Cup after Paul Simpson left to become head coach of the United States’ under-16s.\nMcClaren enjoys the more active work with players, but it took a physical toll — Ian Burchnall, rather than McClaren, has been on the training pitch assisting during the past three camps. That is partly behind his decision to quit rather than lead Jamaica into March’s intercontinental play-offs, where they have been drawn against New Caledonia in the play-off semi-final. Win that and they will face DR Congo in the final for a place in North America next year.\nOf course, a major factor in the Englishman’s swift resignation was the disconnect with fans that simmered as the match with Curacao went on, and erupted into anger at the final whistle. Players got into verbal altercations with supporters and even police. It would have been difficult to continue after that. And so, surprise bookended McClaren’s Jamaican tenure.\nAdvertisement\nIt was a shock when he left Manchester United to go to the Caribbean, even if the trade in weather was understandable. And there were stunned faces as the Jamaica Football Federation (JFF) president Michael Ricketts told reporters in the tunnel of the National Stadium that McClaren’s offer of resignation had been accepted.\nMoments later, McClaren came into a small press conference room, sat behind a table and looked up at the standing media and television cameras to read his statement. Having jotted some thoughts in anticipation, he had tears in his eyes as he spoke about taking “deep reflection” and deciding to allow for “new energy and a different perspective” for those matches in March.\nMcClaren did not take any questions, bringing to mind Roy Hodgson’s exit from England after Euro 2016. Hodgson had lost to Iceland, the nation Curacao have just overtaken as the smallest to qualify for a World Cup.\nThe former Middlesbrough manager knows about failure on the international stage already, of course, missing out on European Championship qualification with England in 2008. It is reasonable to think that was on his mind when he mentioned, on the eve of this game, how he had suffered “ridicule” in his career in answer to a suggestion that his calmness on the touchline could be taken for complacency. “You want to come into our hotel and our meeting rooms, there’s no complacency,” he said.\nAs bedlam exploded in the stands when VAR overruled the award of a Jamaica penalty in stoppage time, McClaren remained stoic on the sidelines, his steadiness a counter to the fans’ emotional highs and lows.\nDuring his time with Jamaica, McClaren took on much more than team selection. Sources with knowledge of the situation, who asked to speak anonymously to protect their positions, explained how his role came to incorporate logistics. On several occasions, he intervened when players and staff needed flights and hotels to be booked and paid for.\nAdvertisement\nIn September, at the start of the second phase of World Cup qualification, the JFF told the players they would no longer cover upgrades to business class on flights to and from Jamaica. It had been the case that players’ match fees provided the funding for the long-haul journeys, but this was removed.\nAs a result, players have covered the extra cost themselves to ensure they can lie down during long-haul travel.\nOn one occasion, the JFF initially pushed back on Dujuan ‘Whisper’ Richards being called up as a late replacement for Demarai Gray, who left October’s camp injured. Richards eventually flew to join Jamaica in Curacao a day before the game, once his agent Craig Butler covered the cost of the flights. He eventually got the money back from the JFF.\nPeople close to the squad say JFF staff lack the expertise to arrange visas and plan routes, sometimes picking multiple changes to reduce cost.\nFinance was also at the heart of Simpson — McClaren’s former assistant — leaving in August. He was initially owed a salary by the JFF, which was only reimbursed once he had taken the call to join the U.S. youth setup.\nWhen McClaren requested that Richard Hartis, who McClaren had worked with at Manchester United for two years between 2022 and 2024, join him for the World Cup qualifying camps as Simpson’s replacement in a dual role as No 2 and goalkeeping coach, he was turned down by the governing body. So McClaren picked up the tab himself for Hartis’ flights and hotel. Hartis has yet to receive a wage.\nThe JFF has accrued a debt over the course of the past few years, which influences its decisions. World Cup qualification would wipe this out. FIFA has not yet confirmed prize money levels for the 2026 World Cup, but in 2022 a total pot of $440million (£336m at today’s exchange rates) was split between the 32 teams based on how far they progressed.\nAdvertisement\nThe JFF has improved standards since McClaren has been in charge, upgrading training equipment and no longer conducting sessions on cricket pitches. But the use of widespread football technology, such as GPS tracking, is still absent.\nThere is the internal politics, too, over which players should be selected and included. Those in the hierarchy have their preferences and communicate them, while stories of some players breaking curfew remain. Ricardo Hepkins, a personal chef, took to Instagram after Tuesday’s game to say he saw three players in Kingston’s Raw Bar until 2am on Sunday night, hours before a 10am training session on Monday morning. The JFF did not dispute this when asked about it by The Athletic.\nBringing together players born and raised in Jamaica with those who have been recruited after living all their lives abroad has been another challenge. McClaren was sceptical that the talent in the country was better than in Europe, but others close to the squad felt he could have found untapped quality had he spent longer in Jamaica. McClaren tended to fly from his home in Yorkshire a few days before camps started.\nThese various spinning plates are why former head coach Heimir Hallgrimsson warned McClaren that he would not last two months in charge when the pair shared a phone call last summer.\nMany in Jamaica feel they should have qualified above Curacao who, led by former Netherlands head coach Dick Advocaat, tap extensively into the Dutch football system. They are a nation of 185,000 people. Jamaica’s population is around 15 times bigger.\nBut McClaren’s side toiled during Tuesday’s game. The pitch cut up, restricting passing football, and some of Jamaica’s players looked nervous.\nEarly in the first half, a chant went up for “Whisper”, the 20-year-old Chelsea winger who was born in Port Royal, Jamaica, and has provided excitement when previously featured. It was also borne from a general desire for more homegrown talents to be given a chance.\nAdvertisement\nIt was Richards who burst into the box to win a penalty in stoppage time, only for VAR to overrule.\nJamaica had struck the woodwork three times by that stage, all from high balls into the box: first Greg Leigh’s header from Ethan Pinnock’s long throw, then Shamar Nicholson hitting the bar with his header from Dexter Lembikisa’s cross, and finally Bailey Cadamarteri heading against the post.\nSome close to the squad feel Jamaica should play fast and dynamic football, to suit the players and the fans, dozens of whom climbed from their seats to sit on the high wall behind the bleachers.\nDonald Oliver, a journalist for the Jamaica Observer, told The Athletic: “There is frustration among those who observe the football that he picks the team based on brand names, as opposed to the boys who we think would run hard, work, push, a little bit more endeavour.\n“Jamaicans are casual, by nature, but not necessarily with their football. They want the speed to be shown when they’re playing the game.”\nKathya Davis, of Love 101 FM, a radio station based in Kingston, explained: “As Jamaicans we expect a sort of aggression or firmness. I don’t think we’re getting that.”\nAmari’i Bell, who has collected 29 Jamaica caps since 2021 but was injured for this camp, says: “You can see from when he came in the tactical element, the way we build, the way we press, has been different, probably elevated in a sense.\n“He always likes to have fun, which is needed, he brings good vibes to the camp, which is a huge part of Jamaican culture. You may have your own idea on things but as a coach you need to adapt.”\nThe pre-match consensus was that qualifying for the World Cup would have boosted morale across the island after the devastation of Hurricane Melissa, one of the strongest storms ever recorded in the Atlantic, which hit the south-western coast of Jamaica last month. At least 45 people were killed, according to the New York Times, and thousands of families have been left homeless.\nAdvertisement\nOn the eve of the game, McClaren had said: “We’re doing it a lot for selfish reasons, but when you’ve looked at the horrific scenes of the last two weeks, we know the effects of what that hurricane has done for many, many people on the island, and we want to do it for them.”\nOliver, who has won awards for his work and has visited the areas affected by Hurricane Melissa, thought McClaren visiting the sites affected might have created a bond that meant, in testing moments during the Curacao game, fans would have stayed with him. McClaren did enquire about assisting those affected but the time between the storm hitting and camp starting was too tight, meaning he did not go.\nOliver spoke of the burden of reporting on what people were going through. “Quite a few people are still without electricity, which is the least of problems where some people are without homes,” he said. “I’ve seen houses flat, a number in the rural area are made out of board or zinc. Montego Bay is known as the tourist capital of Jamaica and there’s an area there called Catherine Hall — the entire community was flooded.”\nLorenza Stafford, whose family lives in Saint Elizabeth on the south-east of the island, said it had been hard for his family.\n“My mother’s roof, my uncle’s roof, and my brother’s were blown off, the road is basically destroyed,” he told The Athletic. “The children are not going to school. One of my sisters is traumatised, she is afraid to come out of the house, because when it was happening, she was seeing everything. Persons died.”\nEven in these difficult times, football has provided a salvation.\nStafford was helping to clear blocked roads when a Manchester United match was going on. “A person was watching it in the car and someone saw and said, ‘Turn it up’. And people started to surround the vehicle, listening to the match. And we’re excited. And then they just stop on the street, get food, start to share, and the people celebrate. That’s how we are.”\nAdvertisement\nMcClaren’s interest in taking charge of Jamaica originated when he took part in a FIFA initiative after Covid-19 to examine youth pathways across the world and was tasked with Jamaica, as well as other countries, by Arsene Wenger.\nRavel Morrison, who has 21 caps for Jamaica, said on a podcast last year that McClaren had told him, when the pair crossed paths at Derby County in 2021-22, he would manage the Reggae Boyz one day.\nHe beat Steve Bruce and Darren Moore to the job, and went viral when being filmed saying, “seal it up”, a term a colleague had greeted him with earlier. McClaren was unapologetic about trying to embrace the dialect as a means of connecting.\nHe has known heartache in big moments before. England being defeated by Croatia is the obvious example, but losing the big-money Championship play-off final to Queens Park Rangers when in charge of Derby was also painful, especially after McClaren had the team playing excellent football, including at the showpiece event at Wembley.\nHe knows joy in crunch moments too, though, as assistant to Sir Alex Ferguson on that unforgettable Champions League final night in Barcelona that clinched Manchester United’s historic treble and, more recently, in supporting Erik ten Hag in the FA Cup final against Manchester City. He had input into the tailored tactical approach that day.\nThose who know him say that, despite the issues, he is invigorated by football and feels he would be a great No 2 to a younger head coach, or be well-placed to become a club’s technical director, having learned even more by experiencing the game in the CONCACAF region.\nOn his career ledger, the successes of winning the Eredivisie with FC Twente and the League Cup with Middlesbrough balance the tougher times at Newcastle United and Nottingham Forest.\nWhile McClaren’s dream of leading a team out at the World Cup is over for now, the players he has managed for the past 18 months could still make it to the United States, Canada and Mexico.\nBut it will be under a new manager.",
  "word_count": 2431,
  "scraped_at": "2026-02-14T02:09:38.461662",
  "_text_extracted": true
}