{
  "article_id": "27b6775df351",
  "url": "https://www.cafonline.com/caf-confederation-cup/news/super-sunday-billed-for-totalenergies-caf-confederation-cup/",
  "title": "Super Sunday billed for TotalEnergies CAF Confederation Cup",
  "date": "20231123T194500Z",
  "domain": "cafonline.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Super Sunday billed for TotalEnergies CAF Confederation Cup\nThe return of CAF Inter-Club competitions officially resumes this week, as clubs from across the continent kick off their quest for continental glory.\nWith the TotalEnergies CAF Champions League resuming this Friday, a jam-packed Sunday is on the cards for eight mouth-watering encounters in the TotalEnergies CAF Confederation Cup.\nWith the official draw pitting the 16-teams into their respective groups of four, it is now down to the two-legged group matches to determine who will advance to the knockout stages of the competition.\nKicking off the action on Sunday afternoon will be Modern Future, who welcome South African outfit, SuperSport United to Egypt. United are led by former Kaizer Chiefs coach, Gavin Hunt who guided them to the CAF Champions League final in 2021.\nA fixture running concurrently on Sunday afternoon will be in Tunis when Club Africain plays host to Ghana’s Dream FC.\nLater in the evening, Egyptian giants Zamalek, who lifted the CAF Confederation Cup title in 2019, welcome Libyan side Abu Salem in another fixture taking place in Egypt on Sunday.\nIn Nigeria, Rivers United who are the only club left to fly the Nigerian flag in this season’s CAF Inter-Club competition plays host to Academica do Lobito of Angola in a late afternoon fixture, as they face a side that is looking at making a name for itself on the continent.\nAnother late afternoon tie takes place in Congo as Diables Noirs faces Stade Malien of Mali.\nConcluding the Super Sunday fixtures will be two contests taking place in the northern part of the continent.\nIn Algeria, USM Alger welcomes Al Hilal Benghazi of Libya – side that has shown tremendous improvement in continental football over the last few seasons.\nA north versus south tie will then sum up the fixtures in Morocco, as former champions RS Berkane welcome South African debutants, Sekhukhune United.\nTotalEnergies CAF Confederation Cup Fixtures | Sunday, 26 November:\n13h00 GMT | Modern Future vs SuperSport United\n13h00 GMT | Club Africain vs Dreams FC\n16h00 GMT | Zamalek FC vs Abu Salem\n16h00 GMT | Segrada Esperanca vs CO Coyah\n16h00 GMT | Rivers United vs Academica do Lobito\n16h00 GMT | Diables Noirs vs Stade Malien\n19h00 GMT | USM Alger vs Al Hilal Benghazi\n19h00 GMT | RS Berkane vs Sekhukhune United\nTotalEnergies CAF Confederation Cup Groups:\nGROUP A: Al Hilal Benghazi, Modern Future, SuperSport United, USM Alger\nGROUP B: Abu Salem, CO Coyah, Segrada Esperanca, Zamalek\nGROUP C: Academica do Lobito, Club Africain, Dreams FC, Rivers United\nGROUP D: Diables Noirs, RS Berkane, Sekhukhune United, Stade Malien",
  "word_count": 437,
  "scraped_at": "2026-02-14T02:20:16.284226",
  "_text_extracted": true
}