{
  "article_id": "27c8e8cfcbdf",
  "url": "https://www.themag.co.uk/2025/12/absolutely-shameful-as-media-sink-to-new-low-with-newcastle-united-reporting/",
  "title": "Absolutely shameful as media sink to new low with Newcastle United reporting",
  "date": "20251229T210000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Absolutely shameful as media sink to new low with Newcastle United reporting\nI know we should be used to how Newcastle United are covered by the media but this really stuck in the throat.\nSadly, so many journalists and their bosses act like desperate NUFC YouTubers.\nWilling to say absolutely anything to get attention and therefore money.\nThey have never been deeper than they are now when it comes to scraping the barrel.\nThey will say and do absolutely anything to be as negative as possible because they know that going over the top gets them noticed.\nThis headline popped up on my Newcastle United feed – ‘Four ways Newcastle United can save their miserable season’, an article by Mark Douglas on i news.\nWho exactly is this aimed at?\nIt surely can’t be Newcastle United fans.\nUnless you have just started supporting NUFC two minutes ago.\nAny Newcastle United fans who would use ‘miserable’ as the best word to describe this season, well, all I can say is that you should hang your heads in shame.\nYou think this is miserable???\nJust how entitled are you?\nYou seriously can’t be a proper fan of the club if this is what you would say.\nIt has been an up and down season so far, for sure.\nIt has been frustrating too many times.\nYes, some of it has been miserable, but then that happens every season, you lose some matches.\nIs it honestly a ‘miserable’ season so far, when Newcastle United have played 27 matches, won 12 of them, drawn 6, lost 9?\nIf I thought this is what genuine Newcastle United fans believe, we might as well all give us now.\nAny Newcastle fan who would say this season has been miserable, you are an embarrassment to us all. We look down on how the likes of some Man U, Liverpool and Arsenal fans behave, how entitled they come across when things aren’t going their way. For me, Newcastle United fans are far worse if they are claiming this season so far is miserable and crying on like that.\nThe first season when I went to every Newcastle United home game as a kid was the 1977/78 season, I think that means this is my 49th season then of regularly going to St James’ Park, more or less every home game, plus many away matches down the years.\nA few facts on Newcastle United seasons from the 1977/78 season onwards…\nThat very first season (1977/78) when I went every home match, Newcastle United were relegated ages before the end of the season AND they then pulled the brilliant old Leazes end down after the final home match. That was a miserable season.\nIn my near half century of regular going to SJP, I have seen United relegated four times in total, all four of those seasons were miserable.\nTwo of those relegations came during the 15 seasons we kicked off under Mike Ashley. In reality, all of those Mike Ashley seasons were miserable, as NUFC were just treading water at best, trying to just survive, whilst the FCB filled his pockets. Even the fifth place finish in 2011/12 was miserable in reality, as we found out it didn’t make any difference, Ashley refused even a penny of net spend to try and build on that by mistake breakthrough season. United were almost relegated the season after finishing fifth, only reaching safety when winning the very last away game of the season.\nUntil Eddie Howe came along, in my 45+ years of going to the matches, I had never once seen Newcastle United get to the semi-final of the League Cup. THAT is miserable! I have now seen United reach three League Cup semi-finals!!\nAfter the 2006/07 season, the next 16 seasons saw Newcastle United play in European competition in only one of the seasons. That was miserable.\nUntil Eddie Howe worked his magic, we had seen no Champions League football for over two decades, that was miserable! Now we are enjoying our second UCL campaign in three years.\nUntil Eddie Howe worked his magic, Newcastle fans hadn’t been to a cup final for 24 years. THAT was miserable! We are now one step away from a third final in four seasons.\nTo put this really into perspective…\nIf you really this has been a ‘miserable’ season so far, what about this?\nNewcastle United are one round from Wembley in the League Cup, on the brink of potentially heading into the last 16 knockout stages of the Champions League, plus only six points off the Champions League qualifying spots in the Premier League.\nEven more staggering…\nThis is the first EVER season in the entire history of our football club, when Newcastle United head into the new year, still in the Champions League AND in all three domestic competitions.\nIf you are feeling miserable, I pity you.\nPut it this way, whilst I hate to ever compare ourselves to them, any Sunderland fan who has supported them for 50 years or less, if their club was in the position Newcastle United are currently in, they would say that it is the best EVER season they have experienced up to this point.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 885,
  "scraped_at": "2026-02-14T02:09:38.444366",
  "_text_extracted": true
}