{
  "article_id": "27d13c0c3811",
  "url": "https://www.caughtoffside.com/2026/01/07/arne-slot-press-conference-ahead-of-arsenal-vs-liverpool/",
  "title": "Arne Slot press conference ahead of Arsenal vs Liverpool",
  "date": "20260108T001500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool manager Arne Slot gave his press conference ahead of the Thursday night game against Arsenal in the Premier League.\nThe Dutch tactician spoke to reporters about Hugo Ekitike’s fitness and other key issues ahead of this big game and we’ve got the full transcript for you below, as well as video from our YouTube channel.\nRead on for Slot’s press conference in full…\nArne Slot press conference ahead of Arsenal vs Liverpool\nOn Hugo Ekitike…\nHe has not trained with us until now and let’s see if he can today. I have said two/three days ago he won’t be out for long but the games come fast so he is in between with the team and it might take him one or two days extra.\nNine games unbeaten, we’ve had two draws too many, Leeds and this game, Fulham, in terms of when we conceded the goal. We’re not where we want to be but we have a talented squad and if everyone is available then we can do special things. We’ve shown that this season with some impressive wins but we’ve also had impressive draws or losses in a negative way, so we’ve not had consistency. The consistency hasn’t been there this season.\nOn the importance of the Arsenal game\nA lot of importance on this game, we have a lot to play for in PL, but also FA Cup and in Champions League and they are knockout games, where you can face teams like Arsenal and for that reason it is important to see where we are in a one-off game against a very good Arsenal, they have been even better than years before.\nArsenal’s strengths? Interesting, they have so many, maybe that is it! They don’t have many weaknesses, hardly concede, open play, set-pieces, good build-up, long ball, they have the complete package and they deserve to be on top this season.\nOn what it would mean to win\nIt would mean a lot, it tells you you can compete in latter stages with any other team. We have shown that already, we beat Arsenal at home and other games we’ve beaten strong teams but we also know that it is a special game for them, we have to be ready, they are in a positive vibe at the moment and it is obvious we aren’t. Everyone, I think, is looking forward to this. Always nice to be part of games with Arsenal, Man City, Real Madrid…\nCan it still be a special season? Of course. This club has shown so many times when they haven’t had the best league form they can still win a trophy. It is always possible because we have a good and talented group, we’ve shown this already this season.\nReal Madrid, Atletico, Aston Villa – look at their run – we’ve shown we can compete with almost every team. Maybe one exception but that was disallowed goal, City away. All other games we’ve been competitive against everyone but we’ve not had the consistency against teams we usually beat. So we are 14 behind Arsenal and have some players out but we have enough to go there and make it a proper match.\nOn Marc Guehi transfer\nVinny always asks about transfers! He knows I don’t speak about transfers in public! It’s no use in that question. We don’t talk about players who are not ours.\nOn the game at Anfield\nWe look at that game [at Anfield in August] as well but that was the start, with new players for both teams, we did well defensively that game and you need to do well defensively to even have a chance to win it. Of course the fans help but our away fans will be a big help for us as well.\nWe watch that August game but Arsenal have played a few others since then. Under Mikel, it is the same so much with some new things but we can expect a similar team and way of playing. Their fans will be up for it. They are top, incredible team and manager, so they look forward to this but so do we.\nOn consistency\nIt is annoying because you think it is harder to play these best teams in the world than the teams who aren’t after league titles or CL. The last 9 games, people have liked our games v Aston Villa and Brighton. I can tell you why but I don’t make the opponents wiser, we have to find a way to find the answer.\nOn being a joy to watch\nAgainst Fulham I don’t think people thought it was a joy to watch. Against PSG, it was for me. People tell me we need the extra pass, the second goal v Fulham was 17 passes we needed before we scored.\nI find it hard to hear [we’re boring] but it is not that I disagree, I would use a different word but I take it into account. I am known for attacking football and we are still trying to do so, but possession doesn’t mean you play attacking football, we are struggling to create a lot of chances but I have said many times we’re not the only team that struggles. I don’t think we are creating less than other teams who are doing well.\nBut I don’t like to hear [we’re boring] because I want to play an attractive style of football. We have to find a way to play it against teams who don’t want to and that is something we haven’t found enough. We are working on this every day.\nOn Harvey Elliott\nIf you want to ask about a Villa player, ask Unai Emery. Liverpool has no recall option.\nOn squad depth\nFirst of all, I am happy with the squad we have, it is in line with me, Richard Hughes and ownership. This group is talented if everyone is available, nothing positive from injuries but maybe if I could think about the narrative that is always there that we spent so much in the summer. No, we replaced and spent a bit more than came in. No-one wanted to hear it but maybe now for the first time people do see that we have replaced with very good players.\nSo even last game and the one before I could impact off the bench, Frimpong with an assist and the starters are incredible football players, so this club is in a very good place if everyone is available. The short future and mid to long-term future.\nOn centre-back options\nAm I happy with number of options? Joe Gomez is back now, a big help. No manager in the world tells you he is happy they only have 2 fit but we have Leoni, an unbelievable talent, who is back next season.\nAs much as has been said about the spending, it is not that there is no limitation to that spending. This club has always tried to do smart things. In an ideal world you have more than 2 centre-halves available but you have to accept that situation. I know Jurgen Klopp also had problems there and played midfielders there at times. Nat Phillips played a lot! So that has been LFC for all these years.",
  "word_count": 1213,
  "scraped_at": "2026-02-14T02:27:10.766110",
  "_text_extracted": true
}