{
  "article_id": "27d226e76815",
  "url": "https://metro.co.uk/2025/10/22/jose-mourinho-names-best-player-pitch-newcastle-united-beat-benfica-24490626/",
  "title": "Jose Mourinho names  best player on the pitch  as Newcastle United beat Benfica",
  "date": "20251022T113000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jose Mourinho hailed Anthony Gordon as ‘the best player on the pitch’ in Newcastle United’s 3-0 win against Benfica in the Champions League on Tuesday night.\nA first-half goal from Gordon and a double from substitute Harvey Barnes after the break has made it back-to-back wins for Eddie Howe’s side in the Champions League.\nGordon posed a constant threat to Benfica and opened the scoring from close range, while Barnes rounded off two excellent counter-attacks.\nMourinho says Gordon’s performance was ‘tremendous’ and admits his players struggled to cope with Newcastle’s physicality throughout the game.\n‘We conceded three goals from transitions,’ Mourinho said after Benfica’s defeat at St James’ Park.\n‘The first. I wouldn’t call it a transition, but it was a quick attack in which Dedic lost to the best player on the pitch, who had a tremendous game, Anthony Gordon, on the diagonal.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The second goal was a transition, the third goal another transition. In that period, we struggled. They’re a team with fantastic physicality, quality, and rhythm.’\nMourinho also described Howe’s ability to bring Barnes on as a second-half substitute is a ‘total luxury’.\nMore Trending\n‘Every set-piece is very difficult to control but we did,’ Mourinho said.\n‘In the second half it was different with the second goal, and then with the changes that Eddie made, bringing fresh people, Barnes on the bench is luxury, to have Barnes on the bench is total luxury, and they killed us in transition, in speed, intensity, we couldn’t cope with that.\n‘I knew that, I knew that perfectly, so I was expecting the first half to be winning or at least a draw so we could keep compactness in the second half and keep in control.\n‘The moment you are losing 2-0 against them they have a completely different danger than we have and in the end I think the result is fair.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Sean Dyche faces tough start at Nottingham Forest against formidable Porto\nMORE: Antonio Conte admits Napoli ‘mistake’ after Rasmus Hojlund and Kevin de Bruyne transfers\nMORE: ‘Dangerous player’ – Pep Guardiola praises Arsenal flop after Manchester City beat Villarreal",
  "word_count": 428,
  "scraped_at": "2026-02-14T01:52:49.019705",
  "_text_extracted": true
}