{
  "article_id": "27d5e5bf317e",
  "url": "https://theathletic.com/4110455/2023/01/21/jurgen-klopp-1000-games/",
  "title": "Jurgen Klopp 1 , 000 games of change : Can Liverpool manager adapt again ? ",
  "date": "20230121T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“Work hard, be curious, nosy, look around corners and try to find solutions for problems you don’t have in this moment but you will have in the future.”\nOn the eve of his 1,000th game as a manager, Jurgen Klopp is explaining what advice he would give to his younger self as he set out on what has become one of the great coaching careers.\nAdvertisement\n“Most importantly, be busy, learn the game,” he says. “Coaching is like with golf. The moment you think you’ve got it, the game will tell you differently. You always have to develop and that’s what I like most about it. It wasn’t for one second boring. It’s the best thing I can imagine to do.”\nIt is closing in on 22 years since Klopp took charge of his first game, a 1-0 victory against MSV Duisburg on February 28, 2001, in the German second tier. In total, he has managed Mainz for 270 matches, Borussia Dortmund for 319 and Liverpool for 410. Klopp has won 538 of those games — 53.9% — drawn 239 and lost 222. He has won two Bundesliga titles, the German Cup, two German Super Cups, the Champions League, UEFA Super Cup, FIFA Club World Cup, FA Cup, Premier League, EFL Cup and the Community Shield.\nKlopp’s 999 games so far have been marked by challenges, mostly overcome, and in rare cases by his absence — there are four Liverpool games he did not attend due to either ill health (Sunderland 2016 and Chelsea 2022), a fixture clash (Aston Villa, EFL Cup 2019) or in the case of the 2020 FA Cup replay with Shrewsbury, his decision to take his first team on a promised winter break instead. These are all counted as part of his reign.\nIt is an extraordinary CV and yet as he approaches game 1,000 against Chelsea at Anfield today, he is still searching for solutions, trying to fix a Liverpool team who have slipped to ninth in the Premier League and look a shadow of the side who were still chasing a quadruple in May last year.\nEven for a manager of his standing, the pressure rarely eases.\n“The best advice from a 55-year-old perspective is ignore the outside world as long as they’re not with you,” Klopp concluded. “They have no clue about your situation, so why would you ask them?”\nHere, The Athletic analyses how he has changed over his managerial career, the solutions he has used and whether he can adapt again at Anfield.\nAdvertisement\n‘I’ll do it’ – Klopp’s first impression\nKlopp’s managerial journey began in February 2001 with a conversation with Mainz’s sporting director Christian Heidl.\nMainz were drifting towards relegation from the second division and the search for a replacement for Eckhard Krautzun led Heidl to one of his own players: Klopp.\nHeidl wanted the club to return to the system and identity implemented by former manager Wolfgang Frank, who coached Mainz between 1995 and 1997 and then 1998 to 2000.\nFrank was an admirer of Italian coach Arrigo Sacchi and brought his principles to Germany, which were revolutionary in the country as the system removed the popular sweeper and featured a 4-4-2 formation involving attacking football, pressing, movement and individual initiative.\nKlopp had formed an important part of Frank’s backline as a player and studied his methods of combining the correct attitude with tactics and organisation, first-hand.\nA pause followed Heidl’s offer… “I’ll do it,” came the response, and so ended the playing career of Klopp as his new venture into management began.\nAmong Klopp’s strengths are his abilities as a motivator and man-manager. As he would later demonstrate at Melwood, he considers first impressions important, the basis of any relationship. From his first team meeting, his now former team-mates bought in.\nConvincing a fanbase and those on the outside can take longer and scepticism was illustrated by only around 3,500 people attending his first game in charge against MSV Duisburg.\n“He was full of strength, fire and emotion. He was enthusiastic and didn’t care about what the outside thought, he just wanted to win games. He had this phrase: ‘We have to fight for success. We have to believe in success and then we will get success’,” says former club president Harald Strutz.\nMainz won 1-0, the first of six wins in seven games.\nAdvertisement\n“If we had lost one more I think we would have been relegated,” Klopp reflected yesterday. “Five out of the first seven (would still have been) an outstanding number but no one would have recognised it. We would have gone down to the third division and a promising coaching career would have been finished before it started. I was lucky that didn’t happen.”\nThey were ugly wins, far from the free-flowing sides Klopp went on to produce. Short-term measures were necessary. It was 4-4-2 and Klopp and his coaching staff simplified sessions, training without the ball and working on defensive shape. Within a week, he felt his side were 70 per cent better off the ball.\nThe first area Klopp likes to address is the defensive unit, creating a strong base to build from. Defending relies less on technical quality so regardless of the talent at his disposal, Klopp can begin to implement his system and build cohesion.\nOnce that was established and safety was secured and the job his permanently, Klopp built his team step-by-step until his players understood his attacking philosophy with tactical preparation at the centre of sessions.\nHe took Frank’s principles and made tweaks. Fitness was crucial to overwhelm opponents, allowing his side to defend zonally and press aggressively. In possession, the aim was to dominate play but with vertical penetration and fast transitions. Stability then led to tactical flexibility and improved performances.\nIn 2001-02, they suffered defeat on the final day to miss out on promotion by one point. Klopp broke down in tears after the match but declared they would be back. The following season, they missed out on promotion on goal difference (by one goal). This would have crushed many teams and individuals.\nHowever, the defiance and belief remained. Klopp addressed a huge crowd of Mainz supporters after the second promotion heartbreak. He invited them to attend the club’s first training session of the following pre-season. An estimated 10,000 went.\nAdvertisement\nThere was no criticism of his players, it was just back to business. Innovative training methods were used to keep everything fresh.\n“He was able to motivate and modify the players and supporters with his methods because he could develop his team technically and mentally all the time. He would explain everything to the players, like why some were not playing, but they loved him and that was special. Tactically it was similar to now, playing out of defence and attacking quickly,” says Strutz.\nPromotion to the Bundesliga was achieved in 2003-04 (on goal difference). Mainz was not a dominant force so setbacks and readjustments were required. They lost seven games in a row during the middle of their first season in the Bundesliga (2004-05). The club and players’ faith never wavered, though, and they finished 11th. On top of this, qualification for the UEFA Cup was secured via the Fair Play Award.\nThey came 11th again in the second season in the top flight (2005-06), but the third season (2006-07) proved one too many. Eleven points in the first half of the season meant sleepless nights and constant tweaking, trying everything tactically, and psychologically off the pitch via psychologist Hans-Dieter Hermann. Yet, it was the traditional 4-4-2 which he reverted to that provided hope and an upturn in form. However, it was not enough and Klopp’s side were relegated.\nThe aim was to return to the top flight straight away, but once again they suffered final day heartbreak in their quest for promotion. Klopp had only agreed to stay if promotion was achieved, so 20,000 people flocked to Gutenbergplatz (a square in Mainz) to thank him. He left a blueprint and one he would carry with him and further develop at Borussia Dortmund.\nResurrection and exhaustion – Klopp at Dortmund\nKlopp had made a decent start at Borussia Dortmund, taking seven points from his first three league matches. A week later, the radical overhaul of the team’s playing style — an all-action, pressing and gegenpressing game designed to “run the opposition into the ground”, as captain Sebastian Kehl put it — was put to its severest test in the derby at home to Schalke, by far the most important fixture in the BVB calendar.\nIt didn’t go according to plan. An experienced Schalke side played through Dortmund’s press to expose the youthful centre-back pairing of Mats Hummels and Neven Subotic.\nAdvertisement\nThe visitors were 3-0 up within 54 minutes at Signal Iduna Park and Kevin Kuranyi nearly made it 4-0 when his header hit the bar. Up in the stands, Klopp’s wife Ulla thought about packing suitcases in anticipation of getting chased out of town.\nBut then, it happened: a magical combination of good luck and resilience that paved the way for Klopp winning over the team and supporters for good. Subotic scored a goal to get the crowd going. Alex Frei added a second from an offside position (there was no VAR at the time). A minute before the end, Dortmund were awarded an extremely soft penalty. Klopp couldn’t bear to watch as Frei converted. 3-3. “An epic, worthy of a 1,000-page novel, a resurrection”, according to the newspaper Frankfurter Allgemeine Zeitung. “Some wins haven’t felt this good,” a relieved Klopp said after the final whistle. Thanks to that draw, the whole city started believing in a better future.\nKlopp warned that he “wasn’t a messiah, just a coach”, and that it would take time to find consistency. His warnings were proved correct when Udinese beat them 2-0 in Dortmund in the first round of the UEFA Cup, calmly hitting them on the break. “I’ve never seen a team I was involved with play this badly,” Klopp said.\nKlopp’s team won 2-0 in Italy two weeks later but were knocked out on penalties. Problems in Europe, where teams were either used to pressing opponents, more technically proficient or both, would remain a feature of his early years in Dortmund. They were knocked out in the group stage in the Europa League in 2010-11 and the same happened in the Champions League the following season. It took until his fifth season at the club before he was able to crack it in Europe.\nA 1-1 draw at Manchester City in October 2012 saw him switch right-sided midfielder Jakub Blaszczykowski into a more central role and press slightly deeper. Dortmund’s more refined but still super-intense game was a revelation: they blew away Jose Mourinho’s Real Madrid in the semi-final (four goals from Robert Lewandowski in the 4-1 home win in the first leg) and only lost to Bayern Munich in unfortunate circumstances in the final at Wembley.\nDomestically, they had by then won back-to-back titles (2010-11 and 2011-12) as well as the German Cup in 2012, but a series of high-profile departures (Lewandowski and Mario Gotze in particular), as well as opponents adapting to or copying their game, saw them lose ground. Their own stadium programme wondered whether Klopp’s plan had been “decoded” the week Pep Guardiola’s Bayern Munich beat them 3-0 at Signal Iduna Park in November 2013. There was also a suspicion that his team’s high-work rate resulted in a raft of injuries. Germany winning the World Cup in 2014 — and the Dortmund quintet of Roman Weidenfeller, Hummels, Erik Durm, Kevin Grosskreutz and Matthias Ginter arriving late for pre-season — didn’t help matters.\nKlopp’s reign reached a nadir when Dortmund went into the 2014-15 winter break in a relegation spot. “Systemic errors crept in our game and we were very vulnerable to counter-attacks,” assistant coach Peter Krawietz recalled later. Psychologically and physically, the team looked exhausted. But their underlying performances had actually been better than anyone realised at the time. Dortmund were still ranked the second-best team in Germany by analysts, including Liverpool’s former head of data Ian Graham. As it turned out, they had mostly been unlucky.\nAdvertisement\nThings picked up in the second half of the season after the return of some injured players and a chance to practise a few basics in the winter break. Dortmund rallied to finish seventh but a demoralising 3-0 defeat by Juventus in the second leg of the last 16 in the Champions League showed the party was over. BVB played without any sense of rhythm and were second to every ball. “Their football was invisible,” newspaper Sueddeutsche Zeitung wrote.\nSoon after, Klopp and Dortmund’s bosses Hans-Joachim Watzke and Michael Zorc got together and agreed that a rebuild was necessary. Since Dortmund had missed out on the Champions League and lacked the resources to invest in new stars, changing the man in charge was seen as the most sensible option.\n‘We are Liverpool’ – Klopp galvanises the Kop\nKlopp’s introduction to his Liverpool squad included writing the word “TERRIBLE” in block capitals on a whiteboard. This, he said, is how teams would feel after playing his Liverpool side, who would run further and quicker than them, press ferociously and hit opponents on the counter.\nKlopp reduced holiday time and increased the intensity of training sessions. The change was starkly illustrated by Adam Lallana, an early Klopp favourite, collapsing into the new manager’s arms after he was substituted in the German’s first game against Tottenham in October 2015.\nHowever, Liverpool were still a far cry from the team who would go on to beat Tottenham in the Champions League final in Madrid in 2019.\nLallana’s exhaustive efforts at White Hart Lane that day were the highlight and Liverpool already looked different than they had at the end of Brendan Rodgers’ reign. While some players felt the early training sessions could be a bit repetitive, they largely bought into Klopp’s heavy-metal vision.\nKlopp taught the squad about the high, medium and low press, identifying a “pressing victim” in the opposition, the importance of staying compact — an issue that has troubled his team this season — and why the best moment to win the ball back is just after it has been lost.\nAdvertisement\nThe next time Lallana would throw himself into Klopp’s arms was three months later in celebration after his late winner against Norwich in a 5-4 thriller. By that time, Klopp’s formation had changed from a 4-2-3-1 in his opening gambit to the 4-3-3 that has since become his favoured shape. Even for bumps in the road, and they were plentiful in the early days, his tactical ideology was taking shape. Off the pitch fans were, as he had set out, trading in doubt for belief.\nA 3-1 win against Chelsea in his third Premier League game on October 31, 2015, was a glimpse into how Liverpool would blow their rivals away at times, but defeat by Crystal Palace at Anfield on November 8 led to fans leaving before the final whistle. Klopp said he felt “pretty alone” as supporters headed for the exits. They then beat Swansea in their next home league game and against West Brom on December 13 fans stayed until the end and supported the team who were 2-1 down heading into stoppage time. Divock Origi equalised and Klopp and his players went onto the pitch, joined hands beneath the Kop and thanked the supporters for their support. This was a key moment in the unity Klopp was building at the club.\nThe most important competition in Klopp’s first season proved to be the Europa League. Liverpool reached the final in Basel and a crazy comeback win against his former side Borussia Dortmund at Anfield in the quarter-finals felt like the first big European night at the club in years.\nThey lost the final to Sevilla after a second-half capitulation fans had come to know and hate. Klopp told his players this was just the start, not the end. He picked up their spirits at the team hotel in Switzerland by grabbing the microphone and singing a rendition of “We are Liverpool, tra-la-la-la-la”.\nThen, in the summer of 2016, three key players joined Liverpool for the start of Klopp’s first full season in charge: Sadio Mane, Joel Matip and Georginio Wijnaldum. Klopp had met but not signed Mane while at Dortmund and his goals that season were crucial to Liverpool qualifying for the Champions League.\nRecruitment extended beyond the work of the manager, aided by daily contact with Fenway Sports Group’s Mike Gordon and sporting director Michael Edwards. Klopp also added to his backroom team with nutritionist Mona Nemmer joining from Bayern Munich and Andreas Kornmayer arriving as the new head of fitness.\nKlopp does not always get his own way on transfers, and he missed out on players like Gotze and Ben Chilwell, while he pushed for Julian Brandt before he and Gordon were persuaded by Edwards that Mohamed Salah was the best option in the summer of 2017.\nKlopp had criticised the extravagant spending of Liverpool’s rivals, including Manchester United’s signing of Paul Pogba, saying “I want to do it differently”. But that changed with the £75million ($93m) signing of Virgil van Dijk in January 2018, making him (at the time) the world’s most expensive defender, and the £66m ($81.8m) spent on goalkeeper Alisson Becker in the summer of 2018, aided by the £140m ($173.5m) sale of Phillipe Coutinho to Barcelona in January 2018. “Did I change my opinion? Yes. That is true. But it is better to change your opinion than never have one,” Klopp said.\nAdvertisement\nVan Dijk’s speed allowed Liverpool to play a higher line and Andy Robertson to push even further forward, aiding his ability, along with Trent Alexander-Arnold, to contribute an extraordinary number of assists during Klopp’s reign.\nIn Klopp’s first full season of 2016-17, Liverpool only just made the top four. They finished the season in fourth, one point above Arsenal on the final day. After winning a play-off against Hoffenheim to get into the Champions League, Liverpool would go on to reach the final in 2017-2018. Defeat to Real Madrid was painful — and the errors made by Loris Karius would make Alisson’s signature all the more important — but it was in that season when Liverpool began to truly look like Klopp’s team.\nBlowing teams away and pressing the opposition into defeat became customary with an established front three of Mane, Roberto Firmino and Salah at the heart of everything good.\nFirmino had initially joined Liverpool as an attacking midfielder and Klopp had other options, such as Daniel Sturridge and Christian Benteke, but decided that it would be Firmino who would be trusted in what became his trademark position, the false 9, due to his ability to “split” the pitch in half, shepherding the opposition towards the touchline before others backed up the press.\nTo accommodate Salah, Mane had been moved from the right, where he had starred in his first season, to the left and even before Countinho’s departure they had become Liverpool’s key attacking threats, destroying teams on the counter-attack, with the trio delivering a devastating 11-second box-to-box counter against West Ham in November 2017.\nWhen Liverpool lost in that final in Kyiv, Klopp promised fans the team would return the following year and win it. He kept that promise and, at his own third time of asking (after also losing the 2013 final with Dortmund), Liverpool won the Champions League final in June 2019. A 2-0 win against Tottenham gave Klopp his first piece of silverware at Liverpool. The semi-final second-leg comeback against Barcelona is perhaps his best game of all while in charge at Liverpool.\nIt was during the 2019-20 campaign where Klopp finally masterminded a Premier League title win. He achieved this with changes to both his team and coaching staff.\nAdvertisement\nKlopp’s assistant, Zeljko Buvac, left the club in April 2018 and was later replaced by Pep Lijnders, who was convinced to return to Liverpool in the summer of 2018.\nWinning the Premier League in 2020 was Klopp’s crowning achievement. Liverpool fans had waited 30 years for a 19th top-flight title. The end of that wait, amid a pandemic, was storybook.\n“Bad. Really bad. I can’t remember a worse game, not only at Liverpool. A really low point.”\nMatch number 998 for Klopp laid bare the array of problems he’s wrestling with. Liverpool weren’t just beaten by Brighton, they were embarrassed after being comprehensively outfought and outplayed in every department last weekend.\nFrom the dizzy heights of last season when Klopp came close to masterminding an unprecedented quadruple, the decline has been swift and startling. They have already lost six league games — three times as many as in the whole of 2021-22.\nLiverpool have never finished lower than fourth in the Premier League during a full campaign with the German at the helm — even fighting back to third in the calamitous, injury-ravaged 2020-21 season aided by an emotional goal from Alisson — but that impressive record is under serious threat.\nWhy has Klopp’s reign veered so alarmingly off track? Talk to players and staff at Kirkby and they point to a number of contributory factors.\nNot least the physical and mental impact of playing a gruelling 63 games in all competitions last season during a season which ended in heartache as they missed out on the Premier League title on the final day and lost the Champions League final to Real Madrid in Paris.\nThat was then compounded by a shortened pre-season with the 2022-23 campaign starting early to accommodate the World Cup. Klopp prefers Europe-based training camps to prepare his players, but commercial commitments meant Liverpool headed to the Far East last July to play games in Thailand and Singapore.\nAdvertisement\nIt was in Asia when the injury problems started to mount and there’s been no let-up since. Diogo Jota, Luis Diaz, Naby Keita, Curtis Jones, Alex Oxlade-Chamberlain, Arthur Melo, Ibrahima Konate, Firmino and Van Dijk have all suffered significant setbacks.\nThat saps morale. Klopp feels like it’s a vicious circle. Having fewer options increases the need to rush players back into action and means they are more susceptible to breaking down again. Unable to rotate as much as he would like, that increases the injury risk for those who have the greatest demands placed on them.\nOne theory that’s been repeatedly trotted out this season is that Klopp’s Liverpool have simply been “found out”. The most ludicrous of all is the suggestion that Lijnders’ book somehow gave away secrets which opponents have used to their advantage.\nThe reality is that teams have long since known how to stop Liverpool, but actually doing so was difficult to pull off because of the energy, intensity, organisation and quality they were up against. That’s no longer the case.\nKlopp famously said that counter-pressing is “the best playmaker” and Liverpool have been a pale shadow of the team they used to be off the ball. A glaring weakness in midfield has shone a light on the transfer activity of a club which has previously been acclaimed for its shrewd recruitment.\nLiverpool were decisive last summer in granting Mane the move he wanted to Bayern Munich and replacing him with Darwin Nunez. They also brought in two exciting youngsters as squad players in Fabio Carvalho and Calvin Ramsay.\nBut their failure to add an elite midfielder to the mix has cost them dear. Klopp wanted Monaco’s Aurelien Tchouameni but the Frenchman chose Real Madrid instead. With other targets such as Jude Bellingham unattainable, Liverpool only pursued an alternative late on in the summer window after the injury crisis deepened. The loan signing of Melo from Juventus was a cheap option and hasn’t worked out.\nAdvertisement\nKlopp admitted he would like to take more risks in the transfer market at times, but he’s restricted by the financial constraints of FSG and their self-sustaining business model. That can be a source of frustration, especially when rivals are spending heavily, but his relationship with the owners, who are in the process of seeking new investment, remains strong.\nHe had initially vowed to have a sabbatical when his previous contract expired in 2024. However, a conversation with his wife Ulla at their kitchen table in Formby led to an unexpected change of heart as he penned an extension last April to keep him at Anfield until 2026.\nKlopp is adamant he’s still “full of power” and the next phase of his managerial journey is going to be intriguing. He’s faced with trying to do something he hasn’t done previously — build a second trophy-winning machine at the same club.\nFor all the talk about Liverpool being an ageing team, a more accurate description would be that of a club struggling to handle a period of transition.\nThe squad is evolving. Over the past 12 months, Klopp had signed the £180m ($223m) attacking trio of Luis Diaz (26 years old), Nunez (23) and Cody Gakpo (23). Konate is only 23 and Klopp is excited about the huge potential of youngsters like Harvey Elliott, Stefan Bajcetic and Ben Doak.\nThe coming summer will be pivotal. James Milner, Firmino, Keita and Oxlade-Chamberlain are all out of contract. The rebuild will be stepped up and the priority will be the midfield revamp, with Bellingham and Matheus Nunes topping their wish list.\nHow Klopp handles the challenge of phasing out senior players whose best days are behind them will go a long way to defining the latter years of his Anfield reign. A ruthless streak will be required.\n“I am loyal but I am not too loyal,” he insisted. “At Dortmund, it was clear when I left I said: ‘Something has to change here’. Either the manager position changes or a lot of other things change. If nobody tells me, I will not go (from Liverpool). So that means maybe there’s a point where we have to change other stuff. Until then we stick together and we fight.”\nAdvertisement\nKlopp’s stated mission is to once again make Liverpool “the team no one wants to play against”. With the financial might of state-owned Manchester City and Newcastle United, a resurgent Arsenal and Manchester United, and free-spending Chelsea, that’s not going to be straightforward. The ground has shifted.\nYet staff at Kirkby speak of a man who is just as hungry, driven and passionate as when he first walked into Melwood in October 2015.\nThose who know him best don’t believe he will ever manage another major European club side. By the time his contract expires at Liverpool, he will be 59.\nThe milestone of 1,000 games in management comes at arguably the toughest time Klopp has endured at Anfield. Currently, it’s a real battle to find solutions to an array of problems.\nBut his bond with the supporters remains as strong as ever and that means everything to him. “It was a game where the crowd could have turned and they didn’t. That’s the basis and we have to work with that,” Klopp said in reference to that wretched defeat at Brighton.\nIt’s been some journey since those first steps at Mainz. He’s proved himself to be the most transformative figure in Liverpool’s history since Bill Shankly. Now it’s about ensuring the best times haven’t already come and gone.\n(Writers: Andy Jones, Raphael Honigstein, Caoimhe O’Neill, James Pearce)\n(Top image: Sam Richardson for The Athletic. Images: Getty Images)",
  "word_count": 4595,
  "scraped_at": "2026-02-14T01:53:21.840787",
  "_text_extracted": true
}