{
  "article_id": "27e19ebb64ae",
  "url": "https://www.empireofthekop.com/2024/10/10/liverpool-request-svilar-transfer-rumours/",
  "title": "Liverpool have  requested  information on Roma goalkeeper Mile Svilar",
  "date": "20241010T181500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to reports from Italy, Liverpool are showing a strong interest in a player who’s wowed a long-time nemesis of the Reds.\nThe goalkeeping department at Anfield is already in for an overhaul in 2025 with Giorgi Mamardashvili arriving from Valencia and Caoimhin Kelleher possibly being granted his publicised wish to become a first-choice elsewhere.\nHowever, that mightn’t strictly be the limit of the ins and out in terms of shot-stoppers on Merseyside next year.\nVOTE for Empire of the Kop as Best Club Content Creator (Premier League) here: Football Content Awards\nOR on X with the FCA’s one-click X link with:\nI am voting for @empireofthekop in @The_FCAs for #BestClubContentCreator (Premier League)\nLiverpool lodge request over Svilar\nA report from AS Roma Live has claimed that Liverpool have already ‘requested’ information on Roma goalkeeper Mile Svilar, who’s valued in the region of €35m-€40m (£29.3m-£33.4m) by the Giallorossi.\nIt’s thought that the Serie A outfit could demand an even higher amount if the 25-year-old continues to impress at the Stadio Olimpico, and the player himself is believed to have no desire to leave his current club unless they were to accept a big-money offer for him.\nA good goalkeeper, but we already have plenty of those\nSvilar was playing Champions League football at Benfica not long after his 18th birthday, performing so well in two games against Manchester United that then-Red Devils manager Jose Mourinho gushed: “This kid is amazing, he’s a talent, he’s a superhero. Respect to Benfica for playing him straight away.”\nDespite that early promise, though, he never truly established himself at the Estadio da Luz and hasn’t yet done so for Roma. In five full seasons of first-team football across those two clubs, he’s never played more than 21 matches in a single league campaign (Transfermarkt).\nHe’s enjoyed a decent start to 2024/25, conceding less than a goal per game (seven in nine matches) and racking up three clean sheets (Transfermarkt), and he actually contributed towards knocking Arne Slot’s Feyenoord out of the Europa League earlier this year with two saves in the Giallorossi’s penalty shootout triumph in the knockout play-off round.\nWhile Svilar has a lot counting for him, he doesn’t stand out as a player who Liverpool desperately need at this moment in time. Even if Kelleher goes next year, we’d still have two quality goalkeepers in Alisson Becker and Mamardashvili, and possibly Vitezslav Jaros in reserve too.\nThis is a transfer rumour that we’d take with a pinch of salt until such time that it’s corroborated by a reliable source closer to home.",
  "word_count": 430,
  "scraped_at": "2026-02-14T01:51:57.649307",
  "_text_extracted": true
}