{
  "article_id": "27eab826bf95",
  "url": "https://metro.co.uk/2025/10/13/cole-palmer-vs-florian-wirtz-granit-xhaka-names-better-player-two-24412071/",
  "title": "Cole Palmer vs Florian Wirtz : Granit Xhaka names the better player of the two",
  "date": "20251013T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cole Palmer or Florian Wirtz? Sunderland midfielder Granit Xhaka has made his choice between the Premier League stars.\nPalmer has had a frustrating start to the season, with the Chelsea talisman currently sidelined with a groin problem.\nWirtz is struggling in a different way, as he continues his search for his first goal contribution in a Liverpool shirt since his summer move from Bayer Leverkusen.\nA huge amount was expected of the Germany international when he arrived at Anfield in a move worth a guaranteed £100m, plus £16m in add-ons, but it has been a fairly slow start to life in England.\nXhaka, though, played with the 22-year-old at Leverkusen and thinks his uneventful start for the Reds will not last, expecting big things from his former teammate.\nIn fact, he would take Wirtz over Palmer, despite the Englishman’s brilliant last two seasons, which have seen him score 37 Premier League goals for Chelsea.\n‘Between Palmer and Flo Wirtz, let’s say with Flo Wirtz, I had the joy to be with him for three years,’ the Swiss midfielder told Sky Sports. ‘You will, a lot of English people will enjoy him because he’s unbelievable, not just with the ball, but the work without the ball.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I didn’t see many No. 10s on his level without the ball and with the ball.\n‘To be in this age 20-21 to have this mentality, the work to put (in) day by day, before the training and after the training, to be angry if you don’t win a training session, this is Florian Wirtz.\n‘I saw him for two, and I have a lot of respect for Palmer as well, but because I was with Wirtz for two years and I know how much he can bring to the Premier League.\n‘Hopefully not against us, Sunderland, but the rest of the year I wish him just the best because he deserves that.’\nGermany manager Julian Nagelsmann has defended Wirtz’s start at Liverpool, pointing out that while he hasn’t scored or assisted a goal yet, he has been creating chances for his teammates.\n‘Even though he hasn’t scored any goals, he is still the player who creates the most chances in the Premier League,’ Nagelsmann said.\nMore Trending\n‘It’s not his fault if his teammates don’t convert them, and the statistics don’t even tell the whole story. He hasn’t always had it easy – he’ll have to work hard now too.\n‘Wirtz needs to get used to the league. I saw him playing with total freedom. He knows what he’s capable of and how things work.’\nPalmer’s groin issue has kept him out of the current international break and the BBC report that he is not expected to return to the pitch until November.\nThat will mean he misses Premier League meetings with Nottingham Forest and Sunderland, a Champions League clash with Ajax and a Carabao Cup last 16 trip to Wolves.\nMORE: Patrick Vieira rates Arsenal’s title chances after ‘really strong’ Mikel Arteta statement\nMORE: Why Mohamed Salah missed Egypt’s World Cup qualifier ahead of Liverpool vs Man Utd\nMORE: ‘He has quality’ – Zinedine Zidane praises Arsenal and Chelsea’s £84m transfer target",
  "word_count": 583,
  "scraped_at": "2026-02-14T01:52:49.026922",
  "_text_extracted": true
}