{
  "article_id": "27fb175a2639",
  "url": "https://www.justarsenal.com/is-kieran-tierney-too-good-to-sit-on-the-arsenal-bench/344089",
  "title": "Is Kieran Tierney too good to sit on the Arsenal bench ? ",
  "date": "20230710T203000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After ensuring the arrival of Havertz, Rice, and Timber, Arsenal is rumoured to shift its attention away from acquisitions and towards departures.\nKieran Tierney is one player rumoured to be departing. Oleksander Zinchenko’s stellar performances at left back cost the Scottish international his spot in Arteta’s starting lineup last season. In his advice to the Arsenal left defender, the ex-Scotland legend Kenny Miller emphasised the need for a new beginning for him in order to rescue his career.\nAccording to Miller, Tierney is a world-class player who should be on the pitch every single week if he wants to realise his potential and avoid wasting away at Arsenal. As per Football Scotland, Miller said, “I think he needs to now. He’s had his injury problems over the course of his career, but for me, when he plays, he’s a world-class left back. There’s no getting away from it.\n“To play regularly, he probably needs to step away from Arsenal, and there will be loads of teams who are interested; there will be loads of suitors; there’s no doubt about it. Newcastle are a team who have been constantly linked with him.\n“He was linked with Real Madrid at one point. He’ll have any number of admirers. He should go and play more regularly. It doesn’t seem to affect his performances at international level, but when you’re playing week in, week out, there’s a different edge to your game. There’s potentially more in from what we’ve seen.\n“If he’s not going to be getting a game, he’s too good to be a sitting part of a squad. He’s one of our best players. A move to Newcastle with everything going on at that place would be a big step; they have Champions League football as well. If he moves, he’ll have a number of options.”\nMost Gooners now approve of Tierney’s departure and would likkely agree that he should be playing much more often than he does now. Do you believe Miller’s advice will give Tierney’s agents the push they need to find him a new home and bring Arsenal some good money to reinvest in the team?\nDarren N\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 383,
  "scraped_at": "2026-02-14T02:00:36.702596",
  "_text_extracted": true
}