{
  "article_id": "28110879d864",
  "url": "https://www.caughtoffside.com/2024/12/06/real-madrid-arsenal-star-different-level/",
  "title": "Arsenal defender Gabriel Magalhaes is being targeted by Real Madrid",
  "date": "20241206T103000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid’s interest in Arsenal defender William Saliba has been well documented in the media.\nJust like they have signed Raphael Varane in the past, they are looking to make the young French defender a part of their setup after being impressed by his consistent performances for the last two seasons.\nCarlo Ancelotti need more options in defense after struggling with injuries to key players like David Alaba, Eder Militao and Dani Carvajal.\nNow, another Arsenal player has impressed the European champions and it is none other than Saliba’s central defensive partner Gabriel Magalhaes.\nAccording to Fichajes, Real Madrid are keen on signing Brazilian centre-back Gabriel.\nThe set-piece specialist has been one of the best players for Mikel Arteta’s side this season.\nNot only is he a great defender but also a threatening presence from set-pieces, just like former Real Madrid captain Sergio Ramos.\nHowever, both Saliba and Gabriel are considered unsellable by the Gunners and Real Madrid have no chance of signing either of them.\nThey form one of the best central defensive partnership in world football and their record for the last two seasons is a proof of that.\nFlorentino Perez, the president of Real Madrid, often gets his transfer targets like he has shown in the recent past with the signings of Jude Bellingham and Kylian Mbappe.\nIt is not going to be the case with Saliba and Gabriel though, as Arsenal have no intention of selling them now or in the near future.\nArsenal consider Saliba and Gabriel unsellable\nThey both are crucial to Arsenal’s hopes of challenging for the Premier League and the Champions League.\nThe Gunners beat competition from Tottenham and Manchester United to sign Gabriel and it would be difficult to replace him in the market, that is why they will entertain no offers from Real Madrid for the Brazilian defender.\nIt could only happen if the centre-back pushes for a move away from the Emirates Stadium but that is highly unlikely since he is happy at the club and determined to challenge once again for the league title this season.\nArteta has praised the Arsenal defender by claiming that since joining the club, he has gone to a completely different level and taken his game to world class category.",
  "word_count": 377,
  "scraped_at": "2026-02-14T01:58:00.754993",
  "_text_extracted": true
}