{
  "article_id": "28116db8eb76",
  "url": "https://www.namibian.com.na/liverpool-glory-would-boost-salahs-ballon-dor-chances-slot/",
  "title": "Liverpool glory would boost Salah Ballon dOr chances : Slot - Sport",
  "date": "20250225T184500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot says Mohamed Salah will have a “far better chance” of winning the Ballon d’Or if runaway Premier League leaders Liverpool win silverware this season.\nThe Egyptian superstar, 32, is favourite to win the award, regarded as the top individual prize in football, after a sensational campaign so far.\nSalah, who is yet to sign a new deal to keep him at Anfield beyond the end of this season, has scored 30 goals and provided 21 assists in all competitions during the current campaign.\nBut Liverpool manager Slot said Tuesday that despite those stellar numbers, the club need to win major trophies to help their forward win his first Ballon d’Or.\n“It’s a good thing that Mo is in the discussion because it means he does well and it means we are doing well,” the Dutchman said on Tuesday.\n“But for him to stay in that discussion, he should bring in the same performances as he’s done for seven or eight months now.\n“And I think, in general, someone that wins the Ballon d’Or needs to win something as well, so it’s a great challenge that is in front of us, but also in front of him.”\nLiverpool, who host Newcastle on Wednesday, are 11 points clear of second-placed Arsenal at the top of the Premier League with 11 games to go but Slot said he does not fear complacency.\n“We all know these players are so long in this competition, even much longer than me, so they know how difficult every single game is, and if you have to play 11, it’s still a long way to go,” he said.\nLiverpool are also in the final of the League Cup, where they will face Newcastle again, and will meet Paris Saint-Germain in the last 16 of the Champions League.\nSlot was asked at his pre-match press conference whether Salah’s current form could be compared with that of Cristiano Ronaldo and Lionel Messi at their peak but he shied away from direct comparisons.\n“He (Salah) has had some outstanding seasons here at Liverpool, and we hope he can continue this for a longer period of time, but to do that he first has to extend his contract of course,” he said.\nThe Liverpool boss was also asked whether Salah’s red-hot form would make it easier or more difficult for the club to agree a new deal.\n“You can look at it in both ways,” he said. “You can say the better he does, the more expensive he might become, and if he would do really worse, we would have second thoughts if we wanted to extend his contract.\n“So I think for everyone it’s the best that he brings in the performances he does now. Maybe only for the one that has to pay him it’s not the best, but for everyone else it’s the best.”\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:14:59.447813",
  "_text_extracted": true
}