{
  "article_id": "281f72d2cd40",
  "url": "https://www.nytimes.com/athletic/6078681/2025/01/21/champions-league-barcelona-best-game-liverpool-alvarez/",
  "title": "Champions League Briefing : A Barcelona win for the ages . Why did City sell Alvarez ? Can anyone stop Liverpool ? ",
  "date": "20250122T111500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool and Barcelona became the first teams to reach the knockout stage of this season’s Champions League, doing so in contrasting styles.\nArne Slot’s side enjoyed a fairly drama-free evening in beating Lille at Anfield, but Barcelona did it the hard way in Lisbon with an incredible 5-4 win, having been 4-2 down in the 77th minute.\nAdvertisement\nAfter six weeks off it was an entertaining Champions League night of drama as the group stage nears its climax.\nHere are the main talking points from what were the first games in January in either the Champions League or the European Cup since 1968.\nBarcelona-Benfica was a thriller for the ages\nGame of the season in the Champions League so far? Undoubtedly. How about the game of any Champions League season? For group-stage matches at least, it’s got to be in the conversation.\nNine goals, a 30-minute hat-trick, an unlikely comeback, a last-gasp winner, comedic errors and a dressing-down on the pitch at full-time, all played out in teeming rain in Lisbon, made this a night to remember.\nBenfica were brilliant for 77 minutes, having taken the game to Barcelona from the off, establishing a second-minute lead when Greek striker Vangelis Pavlidis scored the first of his three goals in the opening half an hour.\nYou may remember Pavlidis notching both of Greece’s goals in their famous 2-1 victory at Wembley last year but sadly for the 26-year-old, his contribution here won’t be remembered as fondly because, well, Benfica messed it up.\nBarcelona’s defence was fragile throughout but with a honking 75 per cent possession and 22 shots, they were a constant threat at the other end in a high-octane thriller.\nTheir late comeback started with Robert Lewandowski scoring his second penalty of the night in the 78th minute, to narrow the deficit to one.\nThen with four minutes left, Eric Garcia produced a dramatic header from Pedri’s perfect cross to make it 4-4, before Raphinha broke away in the 96th minute, all on his own in the Benfica half, to brilliantly send ‘keeper Anatoliy Trubin in the opposite direction with a cool and composed finish.\nVideo for UK readers\nOH MY WORD, RAPHINHA WINS IT FOR BARCELONA 🤯\nAgainst all odds, it's 5-4! What a turnaround!\n📺 @tntsports & @discoveryplusUK pic.twitter.com/yao5ovmBq3\n— Football on TNT Sports (@footballontnt) January 21, 2025\nVideo for U.S. readers\n90+6 WINNER FROM RAPHINHA TO SEND BARCA THROUGH 🤯🔥 pic.twitter.com/F3YuS6Z2YD\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) January 21, 2025\nJust seconds earlier, Benfica wanted a penalty and the VAR had a long look, but Barcelona weren’t to be denied. It was an utterly breathless finish and the drama continued after the final whistle when Benfica manager Bruno Lage, formerly of Premier League side Wolves, got the team in a circle on the pitch, Phil Brown-style, and let them know exactly what he thought of them throwing away a two-goal lead. And it wasn’t “unlucky lads, we go again next week”.\nAdvertisement\nJust what was Wojciech Szczesny up to?\nA bonkers match will also be remembered for some calamitous goalkeeping.\nAs the pouring rain rolled down Wojciech Szczesny’s cheeks after he gifted Benfica a second nightmare goal in the space of just eight minutes, the 34-year-old goalkeeper could have been forgiven for lamenting how he might have been on a Dubai beach instead if he hadn’t heeded Barcelona’s call to come out of retirement.\nBarca’s ridiculously high line is risky, but it’s a lot riskier if the keeper races out of his area to take out team-mate Alejandro Balde, allowing Pavlidis to score into an empty net.\nVideo for UK readers\nDefensive disaster for Barcelona at the back as Vangelis Pavlidis pounces to put Benfica back in front in a flash 💥\n📺 @tntsports & @discoveryplusUK pic.twitter.com/1Esp5nbASB\n— Football on TNT Sports (@footballontnt) January 21, 2025\n“He is a goalkeeper with experience and personality and we have thought about him for this match,” Hansi Flick said on the eve of the game. Well, he wasn’t wrong about personality – a pumped-up Szczesny then also took out Pavlidis when conceding the penalty that completed the striker’s early hat-trick.\nNot to be outdone, Trubin came up with a gaffe of his own in the second half when he kicked the ball straight at Raphinha’s head and it rebounded improbably into the net to make the score 3-2.\nSzczesny did make amends at the end, though. He had conceded from all four of Benfica’s first four shots on target, but made a crucial save for their fifth when Angel Di Maria raced through on the break in the dying moments with the score at 4-4.\nCan anyone stop Liverpool?\nThere was a lot less drama at Anfield, but that’s generally how things have been in the Champions League for serene Liverpool this season.\nA 2-1 victory over Lille wasn’t without its difficulties – 10-man Lille briefly threatened to end Liverpool’s 100 per cent record when Canadian striker Jonathan David equalised – but it took just five minutes for parity to be restored via unlikely match-winner Harvey Elliott.\nAdvertisement\nIt was only a second goal of the season for Elliott, who has been restricted to just 292 minutes in all competitions, partly due to missing a couple of months with a broken foot.\nEarlier, who else but Mohamed Salah had put Liverpool in front with a smart finish, scoring his 50th European goal for the club.\nVideo for UK readers\nMO SALAH DOING MO SALAH THINGS! 🇪🇬👑#UCLonPrime pic.twitter.com/8sOvMd1OjW\n— Amazon Prime Video Sport (@primevideosport) January 21, 2025\nVideo for U.S. readers\nMo Salah bags his 50th goal in Europe for Liverpool 👑 pic.twitter.com/0SKTxlJYXE\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) January 21, 2025\nIt’s seven wins from seven for Slot’s team who have conceded just two goals and are assured of being seeded for the last 16 of the competition in March, where they will face a play-off winner — specifically, one of the teams ranked from 15th to 18th.\nIf they earn a draw in their final group match at PSV next Wednesday they can secure top spot, although with a trip to in-form Bournemouth following three days later in the Premier League, expect some rest and rotation.\nLille, who beat Real Madrid and Atletico Madrid earlier in the competition, still have a chance of squeaking into the top eight when they host Feyenoord on Matchday 8.\nThis was pure, unadulterated Atletico Madrid\nYou’re Bayer Leverkusen, Europe’s in-form team having won 12 on the bounce, a run that included victories over Bayern Munich and Inter Milan.\nYou’re a goal up at Atletico Madrid and heading for No. 13. You’re also a man up, with the hosts down to 10.\nThen what happens? You get Diegoed, that’s what. You get Simeoned.\nAtletico revelled in their backs-to-the-wall predicament, caring not for things like possession (30 per cent) or shots on target (just two needed to score two goals).\nAdvertisement\nThey lost Pablo Barrios as early as the 25th minute, when his yellow card for raking his studs down Nordi Mukiele’s calf was upgraded to a red via the help of a touchline replay.\nWhen Mukiele set up Piero Hincapie to head Leverkusen in front before half-time, Xabi Alonso’s team were being all 2023-24 and heading to second place in the table.\nBut the second half was pure Atletico. Julian Alvarez scored a solo goal on the break to level things up. Then Hincapie saw red for tangling with Simeone’s son Giuliano (who, just like his dad in the old days), did some expert meddling, including getting in a scrape with Granit Xhaka and theatrically zipping his own lips shut when the referee had words).\nAnd then in the 90th minute, Alvarez beautifully wriggled past keeper Matej Kovar to score a memorable winner.\nVideo for UK readers\nJULIAN ALVAREZ SURELY WINS IT FOR ATLETICO ⚽️\nCool as you like from the Argentine as he rounds Oblak to slot into the empty net to put Atleti 2-1 ahead 🔥\n📺 @tntsports & @discoveryplusUK pic.twitter.com/78ifniZy10\n— Football on TNT Sports (@footballontnt) January 21, 2025\nVideo for U.S. readers\nNEVER COUNT ATLÉTICO MADRID OUT 🔴⚪\nJulián Alvarez called game! 💥 pic.twitter.com/vt5GAmZhlE\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) January 21, 2025\nIt was Alvarez’s sixth goal in the Champions League this season and kind of makes you wonder why a team that has struggled for goals at times this year would have sold him. Manchester City, we’re looking at you.\nOh, and the winning goal was set up by substitute Angel Correa, who had previously scored stoppage-time winners against Real Madrid, Paris-Saint Germain and Athletic Bilbao this season, to affirm himself as a particularly super sub.\nThe pressure mounts on Nuri Sahin at Dortmund\nBorussia Dortmund went into their trip to Bologna having won just one of their previous eight matches in all competitions, failing to keep a clean sheet since November and dropping to 10th in the Bundesliga.\nAdvertisement\nThings were going well when Serhou Guirassy just about sent a cheeky Panenka penalty over ‘keeper Lukasz Skorupski.\nVideo for UK readers\nGuirassy with a cool panenka penalty to give Dortmund the lead in Bologna 😎\n📺 @tntsports & @discoveryplusUK pic.twitter.com/XM9LYWDDOW\n— Football on TNT Sports (@footballontnt) January 21, 2025\nVideo for U.S. readers\nSerhou Guirassy pulls off a CHEEKY Panenka in Bologna… but just barely! 😱 pic.twitter.com/qhed6mctoB\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) January 21, 2025\nHowever, Thijs Dallinga equalised in the 71st minute and then, a minute later, Aston Villa loanee Samuel Iling-Junior fired home a rebound to give Bologna their long-awaited first win in the Champions League.\nThree points would have put Dortmund third in the table. Instead, they are 14th and, while they will qualify for the play-off round at least, it looks increasingly unlikely that head coach Nuri Sahin will be the man who leads them there.\nTuesday’s results\n- Atalanta 5 Sturm Graz 0\n- Monaco 1 Aston Villa 0\n- Atletico 2 Bayer Leverkusen 1\n- Benfica 4 Barcelona 5\n- Bologna 2 Borussia Dortmund 1\n- Club Brugge 0 Juventus 0\n- Liverpool 2 Lille 1\n- Crvena Zvezda 2 PSV 3\n- Slovan Bratislava 1 Stuttgart 3\nWhat’s next?\nThe remaining nine fixtures for Matchday 7 of the eight-round group stage take place on Wednesday.\n- RB Leipzig vs Sporting (5.45pm BST/12.45pm ET)\n- Shakhtar Donetsk vs Brest (5.45pm BST/12.45pm ET)\n- Milan vs Girona (8pm BST/3pm ET)\n- Arsenal vs Dinamo Zagreb (8pm BST/3pm ET)\n- Celtic vs Young Boys (8pm BST/3pm ET)\n- Feyenoord vs Bayern Munich (8pm BST/3pm ET)\n- Paris-Saint Germain vs Manchester City (8pm BST/3pm ET)\n- Real Madrid vs Red Bull Salzburg (8pm BST/3pm ET)\n- Sparta Prague vs Inter Milan (8pm BST/3pm ET)\n(Photos: Getty Images)",
  "word_count": 1794,
  "scraped_at": "2026-02-14T02:11:27.602101",
  "_text_extracted": true
}