{
  "article_id": "282394664677",
  "url": "https://theathletic.com/4646456/2023/06/28/lionel-messi-tata-martino-inter-miami/",
  "title": "Lionel Messi and Tata Martino : The questions and shortcomings of the Barcelona and Argentina years",
  "date": "20230628T210000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tata Martino glared at the Spanish reporter, whose question had clearly unnerved the Argentine manager.\n“Do you think that the nudge and the positive reports that Leo Messi gave the club have helped you to be here?” the reporter asked. “And is your objective to keep Messi happy?”\nIt was July 26, 2013, the day that Martino was introduced as FC Barcelona’s new manager. Three days prior, Martino had told reporters in Rosario, Argentina that Lionel Messi and his father/agent Jorge had perhaps had a say in Barça’s decision to hire him.\nAdvertisement\n“The details of how the situation developed, I’m not sure about,” Martino said during a news conference in Rosario, which is both Martino and Messi’s hometown. “But I have no doubt that Jorge and Lionel may have spoken to the club’s executives, whom I’m sure asked (the Messis) for their opinion, and that’s how we’ve gotten to this conclusion.”\nNow facing the Spanish press, the notion that Martino had been given the job by Messi and his father didn’t sit well with him. Messi was already a global superstar whose personality and skill had been masterfully managed by Pep Guardiola. But whispers and rumors had begun to circulate about Messi’s future at Barcelona.\nClearly Martino did not want to be part of a power struggle with Barcelona’s No. 10. Messi would later deny that he had played a role in Martino’s hire.\nRead more: Lionel Messi is joining MLS: What to know about his contract, jersey number, tickets and more\n“I have nothing to do with Martino’s signing nor do I have to give any explanations,” Messi told Spanish reporters shortly after Martino’s appointment. “I don’t know him personally, I’ve never met him. Not him nor Luis Enrique, the other one they’ve been talking about.”\nMessi did praise Martino’s curriculum vitae, though, citing the title Martino had recently won with Newell’s Old Boys (where Messi played at the youth level), as well his work with Paraguay at the 2010 World Cup. Martino became a hero in Paraguay after leading them to the quarterfinals in South Africa. However, knowing how Messi had responded, Martino had to backtrack.\n“(Messi) said something that is true,” Martino replied sternly to the Spanish reporter. “We’re both from Rosario, and basically, from Newell’s (Old Boys), and we don’t know each other. That’s first and foremost. And it’s true what I said in Rosario — I assumed that perhaps some sort of consultation had taken place. But evidently that wasn’t the case based on what he said. I wasn’t in those conversations so I can’t disagree with him.”\nAdvertisement\nThen Barcelona director of football Andoni Zubizarreta, who was seated next to then Barcelona president Josep Maria Bartomeu, adjusted his own microphone and quipped, “Leo Messi had nothing to do with the hire of Tata Martino.”\nNext question.\nIt wasn’t at all inconceivable that the Messis would recommend a familiar name during a difficult situation. Pep Guardiola had left Barcelona for Bayern Munich after winning three Liga Liga titles and two Champions League finals. Guardiola’s chief assistant, Tito Vilanova, succeeded him and immediately won his own domestic championship before falling ill to cancer.\nWhen Vilanova stepped down, Martino was hired practically out of the blue. Martino himself admitted that he was surprised by Barcelona’s approach. The club had not hired a coach from outside Europe since 1983, when legendary Argentine Cesar Luis Menotti managed the side for one season. That Barcelona team featured Diego Maradona.\nMartino, like Menotti, would be tasked with managing a generational talent under the brightest lights, and also like Menotti, Martino would last just one season at Barcelona.\nPerceptions of Messi’s ego and the way Martino managed his Argentine compatriot were constantly in the news. One such instance came after a match against Real Sociedad. Messi had scored a goal and Barcelona were winning comfortably 4-1, so Martino substituted Messi in the 80th minute.\nMessi walked off visibly upset and avoided eye contact with Martino before sitting in the Barça dugout. In the postgame news conference, Spanish reporters jumped all over Messi’s reaction, which of course made headlines throughout Spain. And Martino defended his controversial squad rotation policy.\n“You all know as well as I do that Leo never wants to leave the pitch,” Martino told reporters after the game. “But my job is to take care of him.”\nAdvertisement\nMessi later followed up by taking a swing at the Spanish press. “I didn’t make any gesture when Martino subbed me,” Messi said. “Nobody likes to go off but we have to accept it because it’s the best for our team. I won’t accept that certain media tell lies about everything that happens with me.”\nWhether Messi was happy or not in Barcelona was daily fodder in Spain. There were also reports that the Barcelona dressing room was not happy with Martino, particularly because he had demoted Xavi Hernández, then nearing the end of his legendary playing career with Barcelona, to the bench. Xavi, now Barcelona’s coach, defended Martino and denied that the players were turning on their manager.\n“We’ve never doubted Martino, ever,” Xavi said following a 3-1 loss to Real Sociedad in 2014. “He’s a winner and if he has surprised us it’s been for the best.”\nAfter leaving Barcelona, Martino told Clarín in Argentina that he had not taught Messi anything that season, nor had he contributed anything to the Catalan club. The only thing he learned, Martino said, was how to be around a group of stars.\n“I made some monumental mistakes with Barcelona,” Martino said. “I’ll tell you in another life.”\nMartino referred to Barcelona’s star-studded team as “the best players in the world.” Over the course of his coaching career, Martino has coached many big-name players. His firm hand was and still is a staple of Martino’s coaching style. Naturally, reporters speculated that he had butted heads with Messi as a result.\nIn a 2020 interview with former Spain manager Vicente del Bosque, Zubizarreta claimed that Martino had once told Messi at a Barcelona training session, “I know you can call the president and he’ll fire me, but damn, you don’t have to demonstrate that every day. I already know.”\nMartino categorically denied Zubizarreta’s story. “If I had something to say then or now, I would’ve said it to the player,” Martino told Telemundo. “Those words never came out of my mouth.”\nIn 2018, Martino addressed the stories about his relationship with Messi in further detail.\nAdvertisement\n“I never did what Messi told me to do. That myth was created by so many people,” Martino told a group of reporters. “I don’t have to deny it. What actually happened squashes it.”\nBut after achieving historic success under Guardiola, Barcelona didn’t win enough under Martino, who resigned in front of reporters immediately after Barcelona’s 1-1 draw with Atletico Madrid on the final match day of the 2013-2014 season. The draw was enough for Diego Simeone’s side to win La Liga by three points over the Catalans.\nAtletico also eliminated Barcelona from the Champions League quarter finals that year, and Real Madrid beat Barcelona in the Copa del Rey final.\nIt wasn’t long before Martino was reunited with Messi, though. He took over the Argentina national team after the 2014 World Cup in Brazil, in which Argentina lost the final 1-0 to Germany.\nThe status of Messi’s relationship with Martino has always been debated in Argentina and Spain. It was always speculative at best, however, as neither Messi nor Martino ever broached the subject.\n“Martino knew how to manage Messi,” TyC Sports Argentina commentator Ariel Senosiain told The Athletic.\n“The problem was that he didn’t win anything with the Argentina national team. But Martino built two different teams in 2015 and 2016. Those teams understood how to maximize Messi’s best qualities.”\nOn Wednesday, Martino was named the head coach of Messi’s new club, Inter Miami, likely prompting the debate about their relationship yet again. Senosiain said that Martino has developed very few close relationships with his players off the pitch. “His job is to make the player better. Because of his profession, he’s not interested in being friends with the players,” Senosiain added.\nMartino and Messi have both evolved significantly since their time as player and coach for Barcelona and Argentina. Messi is now a world champion after so many years of disappointment with Argentina, but his two seasons with PSG were awkward off the pitch and disappointing on it.\nAdvertisement\nMessi struggled to settle in Paris and couldn’t lead PSG to a Champions League title, which was the objective when he was signed in the summer of 2021.\nMessi is now at a stage in his career where his family’s happiness outweighs the chase for trophies. At 36, a new adventure in MLS and the American dream in Miami will suit Messi.\nMartino, in turn, has just dealt with perhaps the most frustrating four years of his career. As Mexico’s manager, Martino was under constant pressure after the Mexican side’s form dropped considerably over his tenure. Mexico was eliminated from the group stage of the World Cup in Qatar, which hadn’t happened since 1978.\nMartino was jeered by Mexico’s fan base and criticized constantly by the Mexican press. After winning a Gold Cup title in 2019, his first summer in charge, Martino ultimately failed in his objective to coach Mexico to their best-ever finish at a World Cup.\nHe told The Athletic in April that he has “a weakness” for MLS, particularly the league’s willingness to make big strides in order to improve. Martino also addressed Messi’s impending move to South Beach.\n“Players of that class transform leagues,” Martino said of Messi. “In MLS, a league that continues to take steps forward, and one that seeks a level of excellence any time it makes changes, to welcome the best player in the world would be incredibly impactful.”\nInterestingly, Martino and Messi have shared more disappointments than successes. Martino has previously referred to his year in Barcelona as a failure, managing only to win a Supercopa.\nArgentina hadn’t won a trophy in 21 years when Martino took over after that devastating World Cup final loss in 2014. He was expected to end that drought. But Argentina lost both the 2015 and 2016 Copa América finals to Chile in penalties. In 2015, Messi left the pitch in tears after the final whistle. In 2016, he abruptly retired from the national team immediately after the final. Messi’s brief retirement, and a series of reported disagreements with the Argentina Football Association’s newly created regulatory committee, prompted Martino to leave his post.\nAdvertisement\nAt Barcelona, and again with Argentina, Martino dealt with his team’s reliance on Messi’s brilliance. Martino managed Messi at the height of what became known as Messidependencia. Fans and pundits believed that Barcelona couldn’t win without Messi on the pitch and that Argentina couldn’t find a philosophy of play other than: give the ball to Messi.\nIf an injury knocked Messi out of a Barcelona or Argentina match, Messidependencia became an immediate storyline. Senosiain said that Martino’s Argentina teams learned how to win with Messi. The style of play remained the same despite Messi’s absence.\n“When we win there’s no such thing as Messidependencia. “When we lose, there’s Messidependencia,” Martino said in 2015 before a World Cup qualifier against Brazil. “The best player in the world is always important.”\nMessi scored 13 times in 20 games with Argentina under Martino. In 2019, former Argentina midfielder Lucas Biglia told TyC Sports that the national team hadn’t had a defined identity since Martino left the job. Jorge Sampaoli had been fired after crashing out of the 2018 World Cup in the second round.\n“We’ve gone through three managers in less than two years,” Biglia said. “When you don’t have an identity you begin to play based on what’s easy. What was easy for us? Giving the ball to Messi and waiting for the No. 10 to beat 15 players and score a goal.”\nMartino, who won an MLS Cup with Atlanta United in 2018, will again have to address that issue when he begins coaching Inter Miami, which is currently among the worst teams in MLS, last in the league’s Eastern Conference. It wouldn’t surprise anybody if Inter Miami’s awestruck players resorted to Messi-ball.\n“Martino can lean on his experience with Atlanta and having coached in MLS, so you’d assume it’s going to go well for him,” Senosiain said. “Obviously this time he’s starting from the bottom of the ocean. He couldn’t have asked for a worse start.”\nAdvertisement\nOne thing is certain, however. Messi and Martino will arrive in Miami as changed men, with different goals in mind. A life in the United States is a chance for Messi to enjoy his football again, and to bask in his well-deserved fame and success.\nFor Martino, a return to MLS can prove that he hasn’t lost his touch as a manager, in a league where he maintains considerable equity.\nThough Messi and Martino can’t make up for past shortcomings, they can end their time together on a more positive note and perhaps still claim some trophies.\n(Top photos: Francois Nel/Getty Images, PEDRO PARDO/AFP via Getty Images; Design: Sam Richardson)",
  "word_count": 2209,
  "scraped_at": "2026-02-14T01:50:37.773036",
  "_text_extracted": true
}