{
  "article_id": "28451e2e2cdd",
  "url": "https://www.justarsenal.com/is-martin-keown-right-about-lack-of-sympathy-for-arsenal/387686",
  "title": "Is Martin Keown right about lack of sympathy for Arsenal ? ",
  "date": "20250226T180000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal has been considered one of England’s biggest clubs for a long time, and the Gunners are determined to continue adding to their trophy cabinet. This season, they find themselves once again in the Premier League title race, a position they have often occupied in recent years. However, it has not been an easy season for Arsenal, as injuries have continued to plague the squad, making it increasingly difficult for them to win games consistently.\nWhile some clubs may receive sympathy when faced with such challenges, Arsenal has not enjoyed the same level of understanding. Despite facing numerous external factors beyond their control, the Gunners have not been afforded the same support from fans and pundits as some other clubs might receive in similar circumstances. The struggles Arsenal faces seem to be met with a harsher outlook.\nMartin Keown addressed this recently, expressing his thoughts on Arsenal’s current situation. He said, as quoted by Football Insider: “Arsenal still come second. In fact, they finished the season even better than they did before. This year, only their second year in six years in the Champions League, I don’t see them falling away like Villa are. Villa are eighth right now and we can give those sorts of teams ‘oh ok’ but Arsenal don’t get any sympathy for that do they? They’re still in the top two right now, so they are making progress, but they have to build this squad.”\nKeown’s words highlight the fact that, despite the challenges Arsenal is facing, they remain in a strong position, sitting in the top two of the league. The team has made progress, but the constant struggle with injuries has made it harder for them to achieve their full potential. Nonetheless, Arsenal must continue to build their squad and improve, with the ultimate goal of winning trophies and overcoming the difficulties they face along the way.\nIt has been tough for Arsenal to win games at times, often due to factors outside of their control. However, the team must continue to push forward, focusing on performing at their best and doing everything they can to keep winning, no matter the situation. The determination to succeed remains at the heart of their efforts as they aim for more silverware.\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.",
  "word_count": 425,
  "scraped_at": "2026-02-14T02:02:19.828078",
  "_text_extracted": true
}