{
  "article_id": "288550c7e628",
  "url": "https://theathletic.com/4190819/2023/02/13/champions-league-best-bets-picks-bayern-psg-show-value-ahead-of-massive-round-of-16-clash/",
  "title": "Champions League best bets , picks : Bayern , PSG show value ahead of massive Round of 16 clash",
  "date": "20230213T194500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League is finally returning after an unusual layoff due to the 2022 FIFA World Cup. This year’s competition is going to be harder to gauge than anything we have ever seen. The number of matches still left to play in nearly every league, plus the grueling fatigue for so many of these players has to be factored in.\nAdvertisement\nWe’ll be going to the matchups I believe have the best value and have the easiest outcome to forecast.\nAC Milan-Tottenham Hotspur\nSpurs and Milan are two sides that have been struggling since the reboot in 2023. Milan has only won twice in nine matches in all competitions in 2023 and Spurs have been inconsistent, beating Manchester City and then getting pummeled by Leicester within a week.\nThis tie has a lot of injuries between both French national team goalkeepers being out in Hugo Lloris for Spurs and Mike Maignan (Milan). Spurs midfielder Rodrigo Bentancur just tore his ACL this past weekend on top of other missing links. As far as Milan goes, Zlatan Ibrahimović will not be ready alongside Ismaël Bennacer but defender Fikayo Tomori will return for the Italian giants.\nMilan has recently switched to a 3-5-2 formation after letting in nine goals in two matches to Sassuolo and Lazio. With this setup, they have only conceded one in two matches against Inter and Torino. However, Inter had a bevy of chances and dominated most of that match. Take into account that Stefano Pioli is rumored to bench the good athletes in Alexis Saelemaekers at right wingback for Davide Calabria and Malick Thiaw at centerback for Simon Kjær. These are physical and positional downgrades considering the type of shape the ladder is in.\nAntonio Conte knows Pioli very well with a 7-3-1 record against his clubs. I trust Conte and his experience, albeit shaky, in this competition over Pioli who has struggled tactically throughout the new year. Going up against his kryptonite might be too much for the Rossoneri and I have them bowing out to Spurs.\nSpurs to advance -165.\nRafael Leão and Theo Hernandez are a great linkup and can expose that Spurs backline on top of the threat Son Heung-Min, Harry Kane and Ivan Perišić present for Milan, I anticipate a few goals at San Siro.\nOver 2.5 goals in the first leg -105.\nOdds update live and are from BetMGM.\nPSG-Bayern Munich\nThis matchup has produced some of the more entertaining football in this competition in recent years. It’s a surprise that Kylian Mbappe has made the squad for PSG in this first leg despite initial reports stating that he would be absent. Oh, and his fellow teammate named Lionel Messi will also be a go for this one.\nAdvertisement\nBayern has had a great stretch in league play as of late and with all the attacking talent at PSG, I can see the two teams combining for four goals in this one. Both teams have a team total of over 1.5 goals around even odds. Taking those numbers into account I do fancy some goals here:\nOver 3.5 goals +125 for the first leg.\nBayern has proven to get back on track with 11 goals in their past three matches and PSG has a weakened defense and midfield. I expect Bayern to bring pressure and create many opportunities. PSG conceded three goals to Monaco over the weekend so the vulnerability is there. My favorite bet for leg one:\nBayern total goals over 1.5 -110.\nBenfica-Brugge\nDon’t want to bet much on this, I expect goals if anything in the first leg.\nBenfica will more than likely advance to the next round (-400). Brugge has been the surprise of the competition, allowing just four goals in the group stage so they can put in a tough match for Benfica. There is too much juice on one side to advance in this so my advice would be to parlay Benfica advancing with another team like Spurs or even a Bayern/PSG who are still at -175 and +125. Bayern-Benfica has you at -104 and PSG-Benfica is at +181.\nBorussia Dortmund-Chelsea\nChelsea are the biggest mystery left in the tournament. Chelsea did relatively well in its group with Thomas Tuchel and Graham Potter managing matches. Their league form has been awful and yet people cannot stop making parallels with their past two UCL winning sides. Lowly league play with a talented side and an interim manager at the helm. However, this new ownership has splashed a record amount of money in January and is expecting a smooth transition into Europe’s biggest competition. The Blues have one win in eight matches in 2023 and Dortmund are in fantastic form with wins in all six matches this calendar year.\nAdvertisement\nTwo of Dortmund’s home matches during the group stage ended with under 2.5 goals. The only match going over was a 3-0 win over Copenhagen. I anticipate this first match to be lower scoring with Chelsea’s lack of finishing and Dortmund playing well. However, I do see Chelsea scoring 1 goal exactly (+150). It won’t be a prolific performance, but I can see the visitors putting in one.\nI think Chelsea to advance at -160 is a bit juicy for a volatile squad, but if the Blues escape Germany with a result it will bode well for a return to Stamford Bridge where a young Dortmund side will have to deal with that type of atmosphere.\nPicks for next week’s matchups\nFrankfurt-Napoli\nNapoli to advance -250.\nFrankfurt will prove to be incredibly tough as they have been since the start of last season, but Napoli’s overall quality will be too much. Expect some overs to be hit in this tie.\nLiverpool-Real Madrid\nMadrid to advance -160.\nEarlier rematch of last year’s final, these two have been subpar as well in 2023, but Real Madrid from top to bottom have a better rounded squad so I like them.\nInter Milan-Porto\nPorto to advance +125.\nInter have an incredibly shaky defense at times and have gotten next to no production from Romelu Lukaku. Inter can beat anyone on a good day, but the drama within that dressing room makes -175 to advance to be a little high for that. Porto at +125 to advance is a nice play to go by considering their experience at that level.\nRB Leipzig-Manchester City\nMuch drama surrounding Manchester City and they’re overwhelming favorites at -700. Do Leipzig shock the world and hand the favorites an early exit? I won’t be touching any futures for this matchup and nor do I like anything nine days out of a match to place a singular bet.\nChampions League futures\nMuch like Villarreal last year, I think we are going to see another surprise team making a deep run. As far as favorites go Manchester City is at the top of the list for BetMGM with odds at +185. City is the clear favorite yet again and this year has even more controversy surrounding the club. There have been reported rifts in the dressing room between manager Pep Guardiola and some players, as we saw as a result of loaning out fullback João Cancelo to Bayern Munich, plus the clubs’ financial investigation with the Premier League.\nThere is no serenity in Manchester at the moment on top of a drop-off in league form. I’m not sure why City has been given such a sizeable gap over other clubs in the futures market.\nAdvertisement\nPSG and Bayern are top favorites in this competition, but they are relatively close in terms of future odds and obviously seeing either side advance would shrink that number substantially despite not knowing the next matchup. Take Bayern +550 or PSG +750 now before it’s too late.\nNapoli at +1000 is my “dark horse”. Napoli deserves a ton of praise for their massive lead in league play. It will have the advantage of having more rest in between matches throughout the season. On top of dominating its group during the fall, Napoli has everything you need to make a deep run. Victor Osimhen and Khvicha Kvaratskhelia are among the best duos in Europe, they can simply decide a tie on their own. For me, Napoli has the best odds that go this long and has every ingredient to win in Europe. Tough at home, modern play-style, high-end talent and a manager who has been in difficult moments to ride this ship in Luciano Spalletti.\nChampions League winner odds\nEuropa League\nArsenal, Barcelona, Juventus and Manchester United. You don’t find bigger names than that in this competition.\nEuropa League winner odds\nArsenal (+400) is so fantastic and despite some poor form it won’t affect my judgment of them as a squad. I love their starting XI and manager Mikel Arteta has been phenomenal. My issue is priority. This is a competition they can win, but if this Premier League chase continues at the rate it’s at, why would you risk stars for injury during this competition? I anticipate some sort of squad management that will allow Arsenal to suffer at some point. For that reason alone I think this is where the bet is dangerous as the favorite.\nUnlike Arsenal there is depth in Xavi’s Barcelona squad and it does have a healthier lead in the league. The Barcelona defense has been stout all season long and I expect that to continue in this competition. Plus, Barcelona has Robert Lewandowski in the attack. This is a tournament that he should dominate. Barcelona is at +450 because its opponent is the third favorite, Manchester United (+800). If Barca advances, the odds will shrink.\nBarcelona (+450) are my choice to win the Europa League based on overall talent and La Liga becoming increasingly in its favor. Also, -185 to advance against United is a nice number to parlay with another future team to advance that I mentioned above.\nAs for Manchester United and Juventus, the squads have been sound defensively as of late but the inconsistency of the Bianconeri and their pragmatism will end up costing them against the top sides in this competition. United has made real strides on the pitch, but there are too many holes for them to lift this silverware over a Barcelona, the matchup will ultimately be the demise.\nLet me know who you guys think will win these competitions below!\n(Photo of Kingsley Coman: Michaela Rehle / AFP via Getty Images)",
  "word_count": 1739,
  "scraped_at": "2026-02-14T01:59:41.715252",
  "_text_extracted": true
}