{
  "article_id": "2894ad5e4477",
  "url": "https://www.the42.ie/liverpool-manchester-city-6631507-Feb2025/",
  "title": "Liverpool easy win over City makes poor comparison with spectacle of Klopp / Pep classics",
  "date": "20250223T211500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THERE MUST HAVE been times over the last couple of years that Liverpool thought to themselves they could end up taking Manchester City’s Premier League titles in the eerie quiet of some walnut-walled courtroom . . . and of course that may still happen.\nBut today’s bit of crown-snatching played out inside an equally stilted atmosphere, with the swathes of empty seats and driving rain of the final few minutes merely stripping away the subtlety of the scene.\nThere was no sense at any point here of a genuine contest; it was a day without a flint or spark.\nLiverpool must have dreamed of one day inflicting some kid of shattering blow to their great rivals, but they were denied that kind of catharsis today.\nCity couldn’t be broken, because they arrived broken.\nWith Erling Haaland injured and Pep Guardiola muttering gravely of how “nothing is eternal”, this was merely a day for Liverpool to turn up, execute their gameplan, and collect the spoils.\nMohamed Salah spoke afterwards of their “big players” needing another league title, and he, along with Alisson, Van Dijk, Trent Alexander-Arnold, and Andy Robertson today collected the yield on a long-term investment. No remaining Premier League characters have done more to drain City of energy over the years.\nThat yield now looks certain to be another league title. Liverpool are 11 points clear with 11 games to play, seven of which are at Anfield. Yes, Arsenal have a game in hand, but, also, Arsenal have no strikers and little apparent appetite for a fight. The fates are conspiring almost comically in their favour now: including Arsenal, the six sides that started the weekend immediately below Liverpool all lost.\nThe game itself proved a depressing comparison to the heyday of this rivalry, back when Jurgen Klopp was snorting on the touchline and Guardiola’s players could still run. That series of classics were generally adrenal rumbles like Hearns/Hagler, whereas this was the equivalent of two men having a very long and intense thumb war.\nThe entire opening quarter was entirely a construct of the two managers. City kept the majority of the ball, trying to break down Liverpool’s block. When they failed, Liverpool would then stand still and try to pick their way past City’s pressing structure, and when they did, it eventually forced City to try and do the same to Liverpool’s. It was like watching two company departments set escape rooms for the other on a team building retreat.\nUltimately Arne Slot’s Department of Efficiency won the war. Here he reprised his set-up against Aston Villa in midweek, again picking an extra midfielder instead of a forward, setting up in a kind of 4-2-2-2. This allowed him pick his two best pressing midfielders – Curtis Jones and the inexhaustible Dominik Szoboszlai – and their energy ultimately led to the first goal, with Jones trapping Rico Lewis at right-back and forcing a corner.\nThis allowed Liverpool’s coaching staff use some more brain power, as MacAllister, Szoboszlai, and finally Salah swept through a corner routine that looked suspiciously like a move Bournemouth used to undo Arsenal earlier in the season.\nSalah and Luis Diaz stayed wide in Liverpool’s set-up, which allowed Jones and Szoboszlai canter through midfield and into the provincial-sized space behind City’s high line. This was the genesis of the second goal: Szoboszlai ran offside but dragged Nathan Ake sufficiently deep to keep Salah onside, who then ran onto the ball and squared it to Szoboszlai, who rifled the ball into the net with his left foot. That Ederson dived – no, could hardly stoop – felt emblematic of City’s resistance.\nSalah, meanwhile, has now hit 30 goals for the fifth different season at Liverpool, and this was the 11th league game in which he has scored and assisted. He is turning in an all-time season, and will win the Ballon D’Or if Liverpool can get over the line in the Champions League.\nLiverpool finished the game with only 34% possession, but it felt like they gave City the ball out of a twisted kind of charity. While they sat deep, Liverpool were never under true stress, and it was jarring to see a Guardiola side look so laboured against the deep-blocks they built their reputation on disassembling.\nThe mind turned to Klopp pleading with the other 18 Premier League sides a few years ago to attack City, as sitting in one’s own penalty area against them was like “trying to win the lottery.” Not so anymore.\nGuardiola won’t need to win the lottery to fund his side’s rebuild, and the process has already started, with Omar Marmoush, Nico Gonzalez, and Abdukodir Khusanov playing today. If you’re being kind, they were no more anonymous than the tenured players whom City will soon send to the exit.\nPerhaps these teams will meet next season as equals, but today that feels a remote prospect. City have released Liverpool from their stranglehold: they might not find them so easy to catch again.",
  "word_count": 833,
  "scraped_at": "2026-02-14T02:14:59.451371",
  "_text_extracted": true
}