{
  "article_id": "28d77ce5f9d7",
  "url": "https://toffeeweb.com/season/23-24/comment/reports/44708.html",
  "title": "Stamford Bridge massacre hugely damaging to Blues run - in",
  "date": "20240416T011500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea 6 - 0 Everton\nEverton were expected to be tight and make it hard for a poor mid-table Chelsea side to score. But Cole Palmer had other ideas in what was a horrendously embarrassing first half for a sad and sorry looking Everton side.\nEverton were without Dominic Calvert-Lewin for tonight's clash with Chelsea at Stamford Bridge as the striker is sidelined following a recurrence of his hamstring niggle.\nIdrissa Gana Gueye is also missing from the squad but Arnaut Danjuma returns after playing a full game for the Under-21s on Friday following an extended period of recovery from an ankle injury sustained at Fulham nearly 3 months ago.\nDele Alli, who hasn't played for Everton at all this season, and is presumably still recovering from groin surgery back in January, makes an appearance as a guest pundit for Sky Sports.\nThe home side kicked off with Everton in lurid salmon pink. Onana giving away an early free-kick for Chelsea, overhit behind. Everton won an advanced free-kick that Tarkowski headed toward Beto but he was crowded out\nTarkowski was next to be penalized despite what looked like a foul on Ashley Young. Madueke drove forward to force a corner for Chelsea that Palmer delivered but Everton cleared.\nChelsea attacked again and got very close to the Everton goal before Madueke was stalled. Everton pressed Chelsea high but Doucorure got himself offside with the entire back line to look along. But Everton then won a corner from a Chelsea mistake, Branthwaite needing a glancing header at the near post but getting too much on it.\nSome tremendous work saw Coleman fire in a cross that Beto had to bury but could only scoop over the Chelsea bar off his knee from 4 yards out! Everton continued to press high but were called offside again.\nEverton stifled another Chelsea attack to surge upfield again, but Chelsea resisted and moved the ball up efficiently to find Palmer who made no mistake after nutmegging Branthwaite and picking the bottom corner past a despairing Pickford drive.\nEverton got another advanced free-kick and just wasted it, overhit, and how Chelsea did not score on the counter will remain a mystery as the rock-solid Everton defence was, er, rocking.\nChelsea got a free-kick wide left that was eventually worked inside, Pickford parrying out Jackson's shot only for Palmer to nod it back past him as easy as you like. A shocking start for Everton.\nEverton won another corner but Garner's delivery was too strong. Everton tried to get some control but shocking turnovers by Beto and Garner spoilt that plan. and just put them on the back foot again.\nGarner tried to get the ball back from Palmer but could only catch him late him for the first yellow card. Then the dismal display got 1,000 times worse as Pickford gifted the ball to Palmer who simply lobbed it over the Everton keeper for his hat-trick, probably in record time.\nMcNeil did well to beat his man and get in a cross but it was easily cleared. A lovely cross from Young was headed in very well by Beto but he had got himself offside yet again.\nYoung then tripped Gallagher and he got a yellow card. Caicedo then wiggled his way through and fired well wide. Chelsea could easily have been given a penalty when Branthwaite pushed Jackson over but Paul Tierney said no and it was not reviewed.\nColeman was caught by Mydruk who was booked and From the free-kick, Tarkwoski's low cross was just touched away from Beto and behind by Chalobah. A couple of corners followed with plenty of pushing and shoving that led to nothing.\nBeto worked his way in but just could not hit his shot with any power whatsoever. While at the other end, a bobbling ball fell for Jackson who controlled it well, turned and fired just inside the near post, beating Pickford for a shocking 4th goal.\nYoung put in another good cross that won an Everton corner, headed wide by Onana to bring an absolutely disastrous half to an end.\nSean Dyche made three changes at the break. Gomes tried to release Beto with a decent forward ball but the big man went to ground: no foul. Gomes then got forward himself thanks to Patterson's good work but his shot was deflected wide. The corner was headed just wide by Branthwaite.\nEverton got forward again but Patterson's cross was poorly overhit. Tarkowski made the most ridiculous late challenge on Jackson and was lucky it was only a yellow card.\nEverton were getting more possession but Patterson lost it high up the field and Chelsea countered through Mudryuk feeding Palmer but this time Pickford saved well with his feet. Worryingly, Branthwaite was withdrawn with some problem, Keane replacing him.\nChelsea came forward and a dangerous cross in was pushed out bizarrely by Pickford onto Jackson then off Tarkowski and just the right side of the post, could so easily have been another goal conceded. A series of Chelsea corners were repelled but first Docucore catching Palmer's heel and then Madueke fouled, Tarkowski taking ball and man as Paul Tierney had been playing advantage before signalling the spot-kick.\nThe Chelsea players had a right ding-dong over who would take it, Palmer eventually rolling it in. Keane had to take out Jackson on the counter for an obvious yellow, could have also been a red.\nBeto somehow got forward and lashed his shot over the angle. Everton tried to play forward but were pushed back again with the ball worked to Mudryuk but Pickford saved easily.\nGomes had brought back a lot of composure to Everton's play but his supporting players just lacked the quality to profit from his presence. Everton won a couple more corners but nothing came of them.\nEverton were holding their own until some final subs by Chelsea that saw Gilchrist lash in another awful parry by Pickford in added time. Patterson then went off with an injury, Godfrey replacing him.\nAnd 7 minutes of added time, despite a Beto shot that needed saving, only helped to consolidate the huge embarrassment of this dreadful loss.\nChelsea: Petrovic, Gusto, Chalobah, Silva, Cucurella, Caicedo (89' Gilchrist) , Gallagher, Mudryk [Y:40'] (70' Chilwell), Palmer (80' Casadei), Madueke (72' Chukwuemeka), Jackson (89' Deivid Washington).\nSubs not Used: Bettinelli, Badiashile, Dyer, George.\nEverton: Pickford, Coleman (46' Patterson (90+3' Godfrey)), Tarkowski [Y:53'], Branthwaite (57' Keane [Y:65']), Mykolenko, Garner [Y:28'] (46' Harrison), Onana (46' Gomes), Young [Y:36'], McNeil, Doucouré, Beto.\nSubs not Used: Virginia, Danjuma, Chermiti, Warrington.\nReader Comments (318)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 1189,
  "scraped_at": "2026-02-14T01:51:24.800749",
  "_text_extracted": true
}