{
  "article_id": "28e59f996afb",
  "url": "https://metro.co.uk/2025/01/20/arsenal-hero-names-proven-goalscorer-sign-in-a-heartbeat-this-january-22393937/",
  "title": "Arsenal hero names proven goalscorer he would sign  in a heartbeat  this January",
  "date": "20250120T114500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Perry Groves says he would take Victor Osimhen ‘in a heartbeat’ at Arsenal if the opportunity arose before the January transfer deadline.\nArsenal opted against signing a proven goalscorer last summer, with Mikel Arteta putting his trust in Kai Havertz after the German’s success as a false No.9 in the back-end of last season.\nBut calls for the Gunners to bring in an out-and-out centre-forward have intensified once again this month, with Mikel Arteta’s men sitting six points adrift of Premier League leaders Liverpool – who have a game in hand over their rivals.\nGabriel Jesus’ recent season-ending injury has only fuelled this speculation, with a host of top strikers linked with move to the Emirates after the Brazilian’s devastating setback, from Newcastle’s Alexander Isak to RB Leipzig’s Benjamin Sesko.\nSpeaking after Arsenal’s north London derby win over Tottenham, Arteta revealed for the first time that the club would actively look to strengthen up front before the end of January window.\nAsked whether Arsenal were on the hunt for a player to replace Jesus in attack, the Arsenal head coach told TNT Sports: ‘Yes, for sure.\n‘Because we lost two players, big players, Bukayo [Saka], who can be out for up to three months, that’s a long time, and Gabi, who is going to be out for a long, long, long time.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAsked if Arsenal will push to make a signing before the January deadline, the Spaniard replied: ‘We are going to try, for sure.\n‘We are actively looking at. I think we have lost two very, very important players, we have 14 players in the squad, and we play every three days.\n‘We will try but let’s see who we can get.’\nEx-Arsenal winger Groves – who won two league titles with the Gunners – believes his former club need to bring in ‘two or three’ squad additions if they are to challenge for the title in the second half of the season.\nAddressing the situation on talkSPORT, Groves said: ‘If they want to win the title, this is the time when you’ve got to go and buy probably two or three players. If you have to pay £20m over the top, £30m…\n‘This isn’t just about short-term for this next four or five months. If it goes well over the next four or five months and you win the title then you can kick on for the next two or three seasons. Sometimes in football you have to basically go short-term.\n‘If you look at Liverpool against Brentford, they bring on [Darwin] Nunez, [Harvey] Elliott, [Curtis] Jones, [Federico] Chiesa and they all go and have an impact on the game.\n‘We’re looking at 2-2 [against Aston Villa], you want someone to come and have some dynamism to come and create, and the only option he’s got is Raheem Sterling and Raheem Sterling’s confidence is completely gone.\n‘Raheem Sterling doesn’t believe, when he gets the ball, that he’s going to go past the full-back and create a chance.\n‘Arsenal have to sign two players because you have to be seen to be wanting to go and chase that title.\nMore Trending\nNapoli striker Osimhen has been among the many attacking players linked with Arsenal this month after catching the eye on loan with Turkish champions Galatasaray.\nAsked whether he would take Osimhen at Arsenal, Groves replied: ‘In a heartbeat. You’ve got Gyokeres, obviously, they’re talking about Isak…\n‘You ain’t going to get Isak because Newcastle have now had their bad result at the weekend, they’re still looking to get into the Champions League so you ain’t getting Isak.\n‘If it means you pay over the odds or even if you take a player on loan, any centre-forward at the top level… you would be licking your lips thinking you could make a massive difference to that Arsenal side.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ruben Amorim reveals two-word message from Sir Alex Ferguson before Man Utd lost to Brighton\nMORE: Arsenal legend ‘interested’ in surprise return to the club\nMORE: Brighton star Carlos Baleba celebrates right in front of Bruno Fernandes after beating Man Utd",
  "word_count": 756,
  "scraped_at": "2026-02-14T02:02:19.849761",
  "_text_extracted": true
}