{
  "article_id": "29145e6d1495",
  "url": "https://www.caughtoffside.com/2023/12/12/transfer-news-pochettino-chelsea-future-gyokeres-arsenal-man-utd-cb/",
  "title": "Transfer news : Pochettino Chelsea future , Gyokeres Arsenal , Man Utd CB",
  "date": "20231213T003000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on the Daily Briefing, a subscription service. If you would like to receive Ben Jacobs’ exclusive articles via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\nPochettino’s teething problems at Chelsea but Spurs happy with Postecoglou\nBoth Mauricio Pochettino and Ange Postecoglou are safe in their jobs as it stands but they face different circumstances and challenges.\nThere is an appreciation at Chelsea and Spurs that both managers have inherited a series of challenges and are currently hampered by injuries. That’s the one part they share in common.\nPostecoglou quickly won over the fanbase, and that has helped, but it’s clear the injured James Maddison is a big loss.\nSpurs’ win over Newcastle was a huge boost, but even during a run of four losses and a dramatic draw against Manchester City, Tottenham led in every game and had spells of dominance. Even with nine men they weren’t far off getting a draw against Chelsea. It’s far too early to be judging the Spurs project since it’s not just Postecoglou, but a series of executives that have recently come in. Everyone at Spurs is very happy with Postecoglou even if results have been harder to come by of late.\nPochettino is under more pressure than Postecoglou, and part of that is the level of expectation at a club like Chelsea.\nMy understanding is that it was agreed when Pochettino joined that an end-of-season review, a kind of two-way appraisal, would take place.\nAnd Chelsea’s senior leadership still feel Christopher Nkunku’s return from injury, and thus his first Chelsea minutes, will make all the difference.\nThe owners also know they can’t keep chopping and changing, especially right before a window, since it paints a picture of an unstable club and might put some players off.\nPochettino hasn’t lost the support of either the owners or the dressing room. His main short-term concern is keeping the fan base on side, and a loss to Sheffield United would certainly cause a meltdown amongst some supporters.\nThe other factor is just Pochettino is learning to adapt to the model. And that has led to teething problems. The key question is really whether Pochettino continues to buy into the Chelsea project since if he doesn’t it’s the beginning of the end. His relationship with Behdad Eghbali will pretty much define everything.\nProviding it is in tact (and it wasn’t for example with Thomas Tuchel), Chelsea plan to be patient with Pochettino barring the kind of string of losses no manager usually survives.\nThe aim this season, as I understand it, is to qualify for the Champions League, but Pochettino will be judged on progress not solely points or league position. And he will be judged on whether he’s a ‘fit’ which sadly for Chelsea Tuchel and Graham Potter weren’t. A fit is not easy to find because Chelsea’s project is ambitious and in many ways exciting but also not easy to just walk into and succeed.\nWhy Chelsea have decided not to rival PSG for Gabriel Moscardo\nGabriel Moscardo is looking likely to join PSG, who are making progress on a deal. Moscardo and Corinthians don’t really want a January exit, but that won’t prevent a transfer if the 18-year-old is signed then loaned back.\nLuis Campos has already confirmed Moscardo is on PSG’s radar. At the time of writing nothing is done, but PSG have been optimistic since late November.\nChelsea actually had a bid for Moscardo rejected over the summer, and they are getting a bit of a reputation for trying for pretty much every top Brazilian in the industry.\nLiverpool have also been out scouting thoroughly in Brazil recently. It’s a priority market right now for many top clubs.\nChelsea have, as it stands, decided not to rival PSG for Moscardo. We heard some reports in Brazil saying a deal was done to take Moscardo to Stamford Bridge, but this was firmly denied by those close to both the player and Chelsea.\nChelsea know they have to be a bit more economical now with transfers, especially if they want to move for an elite striker. Perhaps Moscardo was the kind of deal they would have pushed more aggressively last January, but the priority now is outgoings, to keep the squad size the same or get it smaller, and to get a bit more proven talent for the second half of the season. That’s why PSG should now have a relatively clear run to get Moscardo over the line.\nViktor Gyokeres impressing Arsenal and Chelsea but January move looks unlikely\nViktor Gyokeres is flying for Sporting right now with nine league goals in 12 games. And if he is to leave then clubs are going to have to trigger (or better) his €100m release clause. He only joined Sporting in July and Ruben Amorim has been clear to his board that he doesn’t want to lose his star striker mid-season.\nAmorim will have seen Benfica spend all of last January trying to keep hold of Enzo Fernandez only for the Portuguese club to agree to sell him to Chelsea with only about three minutes left of the window. Amorim doesn’t want a saga, and luckily for him Gyokeres is settled and happy to see out the season and maybe even stay into 2025. Enzo pushed for his Benfica exit. Gyokeres is only just settled at Sporting.\nBoth Arsenal and Chelsea have scouted Gyokeres, which is normal, but probably only the latter would have the financial muscle or some might say audacity, to move mid-season.\nBut Gyokeres is not Chelsea’s top striker target. Victor Osimhen is still being explored, and Ivan Toney has divided opinion internally at Stamford Bridge but certainly some fans. Chelsea won’t make any final decision until right at the start of the window after they have seen Nkunku play a few games.\nArsenal, much like with any pursuit of Joao Palhinha at Fulham, won’t spend a crazy fee in January but could be one side to watch for Gyokeres over the summer.\nJonathan Tah attracting Premier League interest\nI don’t expect Jonathan Tah to go anywhere in January, not with Leverkusen flying. He also won’t be a bargain in the summer because a €20m release clause previously in his contract has now seemingly expired.\nSeveral Premier League clubs are across Tah, whose contract expires in 2025, so this summer might be the time for Leverkusen to accept a fee if the player doesn’t want to renew.\nBut Leverkusen CEO Fernando Carro told me they only want to lose a maximum of two players this summer, meaning Tah, Edmond Tapsoba and Piero Hincapie’s futures may all be intertwined.\nTah has been looked at by Chelsea, who want a centre-back, Spurs and West Ham, with the latter also admiring Hincapie. Manchester United also want a centre-back. I am not sure Tah is top of their list. As Fabrizio Romano rightly said a few weeks back, Nice’s Jean-Clair Todibo is a big target.\nA lot of Leverkusen players will reconsider leaving if they qualify for Champions League football. Xabi Alonso’s impact shouldn’t be underestimated even if a big English club comes calling.",
  "word_count": 1199,
  "scraped_at": "2026-02-14T01:56:38.158009",
  "_text_extracted": true
}