{
  "article_id": "2918055b4144",
  "url": "https://news.yahoo.com/manchester-city-vs-real-madrid-104949986.html",
  "title": "Manchester City vs Real Madrid live stream : how to watch Champions League semi - final anywhere online , team news",
  "date": "20230518T081500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City vs Real Madrid live stream: how to watch Champions League semi-final anywhere online, team news\nWatch Manchester City vs Real Madrid live stream\nYou can find a free stream of Manchester City vs Real Madrid on Servus TV in Austria. It's Paramount Plus in the US (7-day free trial), DAZN in Canada and BT Sport in the UK. Football fans in India can watch a tonight's Champions League semi-final second leg on Sony Ten 2 or via Sony LIV. Remember to use a VPN if you're trying to watch your usual free stream from abroad. Full details on how to watch a Manchester City vs Real Madrid live stream tonight just below.\nThe teams are in and Manchester City are unchanged from the first leg as Pep Guardiola goes with the same XI that picked up a 1-1 draw in Madrid. That means Kyle Walker keeps his place after impressing on the right-hand side of a back three alongside Ruben Dias and Manuel Akanji. John Stones and Rodri are the defensive midfielders, with Bernardo Silva, Kevin De Bruyne, Ilkay Gundogan and Jack Grealish in support of Erling Haaland up front. Julian Alvarez, Riyad Mahrez and Phil Foden are on the bench.\nReal Madrid, meanwhile, make one change as Eder Militao comes in for Antonio Rudiger as expected at centre-back. David Alaba is the Brazilian's central partner, with Eduardo Camavinga continuing as an auxiliary left-back and Dani Carvajal on the right. Further forward, it's as expected with Toni Kroos, Luka Modric and Fede Valverde a central midfield three, with Karim Benzema, Rodrygo and Vinicius Junior up top. Marco Asensio is on the bench.\nManchester City vs Real Madrid: match preview\nSo, it all comes down to this. A week after a fascinating tactical battle at the Bernabeu comes the main course between Manchester City and Real Madrid – winner takes all. Or a place in the final, at least, against Inter Milan. Blistering strikes from Kevin De Bruyne and Vinicius Junior leave the scoreline at 1-1, with a mouthwatering European clash to saviour.\nThere's an argument to suggest that this Manchester City's most important fixture in recent memory – yes, even more so than the 2021 final they lost to Chelsea. Following last season's injury-time calamity against Real Madrid, Pep Guardiola's side will be more determined than ever to slay their Blanco ghost and knock out the 14-time champions who have history on their side. Guardiola frequently speaks of City as a Champions League underdog because of their lack of European pedigree, but at some point his side's tactical mastery and vast array of supreme talent must emerge victorious against one of the continent's giants. Erling Haaland's march towards goalscoring immortality continues apace – father Alfie might be disappointed there will be fewer Madrid fans to goad from the stands at the Etihad – while Guardiola has promised \"I won't overthink it\" for this one. The Premier League title is all but sewn up, time to set De Bruyne, Jack Grealish and Bernardo Silva off the leash and attack.\nTheir opponents may be marginal favourites, but Real Madrid have done this so many times. No team in tournament history have reached more semi-finals than los Blancos who have the enviable talent of winning when rarely seeming to play well. Again last week they struggled to involve top scorer Karim Benzema in the play and scored at a point when City were starting to dominate. Antonio Rudiger's limpet-like man-marking job tried to get a rise out of Haaland, but it seems likely Carlo Ancelotti's first-choice centre-back Eder Militao will return from suspension tonight. Ancelotti rested plenty of first-team stars for the weekend 1-0 defeat of Getafe – Benzema, Toni Kroos, Luka Modric, Rodrygo and Vinicius Junior all got the afternoon off – so it's not hard to see where Madrid are placing all their chips. Expect more of the same, soaking up pressure, convincing the opponent that there's no real danger, than stabbing them through the heart with a Benzema goal. No side plays possum quite like Real Madrid.\nFollow our guide to get a Manchester City vs Real Madrid live stream tonight and watch the Champions League online from anywhere.\nFREE Man City vs Real Madrid live stream\nServus TV – in Austria – is the place to find a free live stream of Manchester City vs Real Madrid. The second leg kicks off tonight at 8pm BST.\nOutside Austria? Use our No.1-rated VPN to unblock Servus TV when travelling away from home. It's a easy-to-use app – details below.\nHow to watch Manchester City vs Real Madrid from outside your country\nIf you're abroad right now and struggling to tap into your usual coverage of the game, you'll want a VPN. This'll help you circumvent the geo-blocking that will try to stop you watching a Manchester City vs Real Madrid live stream in particular parts of the world.\nThey're a useful means of getting around this issue, are cheap, and easy to set-up as well. Here's how it's done.\nUse a VPN to watch Manchester City vs Real Madrid second leg from anywhere\nExpressVPN is the world's top VPN right now\nWe've taken the time to try out all the biggest VPN providers and we found ExpressVPN to be the pick of the bunch. It works with lots of devices and offers super fast connections across its many servers.\nThrow in its robust set of security features and ExpressVPN is the best all-round VPN for streaming - and perhaps best of all, it has a 30-day money back guarantee plus 3 months FREE when you subscribe for a year.\nAccess ExpressVPN via your laptop, iPhone, tablet, Android phone, PlayStation, Xbox and plenty more. Express is a do-it-all service that also benefits from 24/7 customer support.\n- Try ExpressVPN 100% risk-free for 30 days\nHow to watch Manchester City vs Real Madrid: live stream UCL soccer in the US without cable\nSoccer fans can watch Manchester City vs Real Madrid on both CBS and Paramount Plus in the US, with kick-off set for 3pm ET / 12pm PT on Wednesday afternoon.\nCBS is the official US broadcaster for the 2022/23 UCL season. Paramount Plus live streams every game, while select fixtures are shown on CBS.\nHow to watch Manchester City vs Real Madrid without cable\nA subscription to Paramount Plus is available from just $4.99 a month for its ad-supported \"essential\" plan, or $9.99 per month for its ad-free tier.\nIf you sign up today, you can get a 7-day Paramount Plus FREE trial, which would let you live stream Manchester City vs Real Madrid.\nAlternatively, if you don't have CBS on cable, you can get the channel on a streaming-only basis via FuboTV from $74.99 per month after a 7-day FREE trial.\nOutside of the US? If you're unable to access coverage because you're out of the country, consider using a VPN as outlined below - we rate ExpressVPN as the best of the best.\nHow to watch a Manchester City vs Real Madrid live stream in the UK\nIn the UK, BT Sport is providing exclusive live coverage of Manchester City vs Real Madrid. Coverage starts at 7pm GMT on BT Sport 1, ahead of the 8pm kick-off.\nBT now has a £30 Monthly Pass, so you can get everything BT Sport has to offer without a long-term commitment.\nThe BT Sport app will let subscribers watch Manchester City vs Real Madrid on any number of devices, including mobiles, tablets, consoles and smart TVs.\nIf you're currently outside the UK and want to watch the Champions League like you would at home, don't worry about geo-blocks on your account – simply grab a VPN and follow the instructions above to live stream the action.\nRelated: how to watch a Premier League live stream\nManchester City vs Real Madrid live stream: how to watch UCL soccer online in Canada\nIn Canada, soccer fans can watch Manchester City vs Real Madrid on streaming service DAZN. Kick-off is scheduled for 3pm ET / 12pm PT on Wednesday.\nAnd it's a real bargain too - DAZN costs CA$24.99 a month or $199.99 a year. Away from home? No problem.\nUse a VPN to watch Man City vs Real Madrid on DAZN while abroad.\nNot only do you get every single UCL game, but DAZN is also the Canadian streaming home of Europa League and EFL Championship soccer, Six Nations rugby and WTA tennis.\nIt also comes with support for iOS, Android, Apple TV, Chromecast, Amazon Fire TV, Android TV, Roku, Xbox One, PS4, and laptop/PC streaming (including Mac devices).\nHow to watch Manchester City vs Real Madrid: live stream Champions League in Australia\nFootie fans in Australia can watch Manchester City vs Real Madrid on Stan Sport, but be warned that kick-off is set for 7am AEDT bright and early on Thursday morning.\nThe streaming service is showing every single Champions League match ad-free, and it's also the place to watch the Europa League and Europa Conference League, international rugby and Formula E.\nA subscription costs $10 per month (on top of a $10 Stan sub), but you can take advantage of a 7-day FREE trial.\nIf you're outside Australia and want to tune in to Stan Sport, you can use one of the top VPNs and watch the coverage from another country.\nMore sport: how to watch an F1 live stream\nHow to watch Manchester City vs Real Madrid: live stream Champions League in New Zealand\nFootball fans can watch Manchester City vs Real Madrid on Spark Sport in New Zealand, with kick-off set for 9am NZDT on Thursday morning.\nSpark Sport offers a 7-day FREE trial so you can try before you buy, and once that expires, a subscription costs $24.99 per month, and includes every UCL game, plenty of Black Caps cricket action, Europa League football, the European Rugby Champions Cup, F1, MotoGP, NFL and WTA tennis.\nSpark Sport is available via web browsers on your PC or Mac, plus Apple and Android mobile devices, Chromecast, Apple TV, selected Samsung, Sony, Panasonic and LG TVs, and select Freeview streamers.\nManchester City vs Real Madrid: live stream Champions League online in India\nManchester City vs Real Madrid is being shown on Sony Pictures Networks in India, with coverage stretching across the Sony Ten 2 TV channel and over-the-top streaming service Sony LIV.\nYou can live stream Champions League games with a mobile-only plan, which costs Rs 599 for a year, or a LIV Premium plan, which costs Rs 999 for a year.\nAnyone outside of India who wants to watch their home Champions League coverage can just pick up a good VPN and follow the instructions above to safely live stream the action.",
  "word_count": 1794,
  "scraped_at": "2026-02-14T02:19:46.300601",
  "_text_extracted": true
}