{
  "article_id": "291c3ed5dab1",
  "url": "https://www.bbc.com/sport/football/articles/cp8qmeleld4o",
  "title": "Naomi Girma : Chelsea sign united states defender for world record fee",
  "date": "20250126T134500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea sign Girma for women's world record fee\n- Published\nUSA defender Naomi Girma said joining Chelsea was an \"easy choice\" after completing her move from San Diego Wave for a women's world record fee.\nThe 24-year-old has signed a contract until summer 2029 after the Women's Super League (WSL) leaders this week agreed to pay San Diego about £900,000.\n\"I'm so happy and really excited to be here. It doesn't feel real,\" said Girma,, external who was introduced to fans at Stamford Bridge before Sunday's 1-0 WSL win over Arsenal.\n\"There are a lot of things about Chelsea that made me want to come here - the culture, the winning mentality, staff and players.\n\"It's a top environment to learn and grow in. Right now, that's what I'm looking to do.\"\nThe fee broke the previous record of £685,000, when Bay FC signed Racheal Kundananji last February.\nChelsea set the British transfer record in signing Mayra Ramirez for £384,000 in January 2024.\nGirma told BBC Sport: \"I'm really excited to play alongside Millie (Bright).\n\"There are so many players in this team that have so much experience, a lot of young players who have been amazing as well, so [I am] just really excited to be in with the group.\"\nDefender Bright told BBC Sport: \"We're really lucky to have her. We feel really grateful that she chose us.\n\"It sends out a statement to the rest of the league and Europe about the direction we are going in and the titles that we want to win.\n\"She is going to be a fantastic addition and we can't wait to get started with her.\"\nChelsea manager Sonia Bompastor said after the Arsenal game that Girma has a \"small injury\" and would not be fit for the trip to Aston Villa on 2 February.\nGirma helped San Diego win the National Women's Soccer League (NWSL) Shield in 2023 and was named US Soccer's female player of the year.\nShe was part of the USA side that won gold at the 2024 Olympics in Paris.\nGirma is Chelsea's first signing of the January transfer window after they fought off competition from Lyon.\nChelsea made her a priority target after losing defender Kadeisha Buchanan to a season-ending knee injury.\n'A statement of intent' – analysis\nEmma Sanders, BBC Sport women's football news reporter\nGirma's talents are no secret and she is widely regarded as one of the best female footballers.\nFormer Chelsea boss Emma Hayes, now the USA manager, said last year Girma was the world's best centre-back and she will no doubt be pleased to see her old club scoop her up.\nHaving enjoyed a taste of silverware with the USA and San Diego, Girma arrives in England with ambitions to win more trophies, particularly in the Champions League, and is believed to have had discussions with Hayes about what to expect from Chelsea.\nLyon offered higher wages and were prepared to match the transfer fee that Chelsea eventually had accepted by San Diego, but Girma's preference was always to join the Blues.\nIt is manager Bompastor's most significant signing to date and the club believe Girma will take them one step closer to a first European title.\nThe long-term deal agreed is also a statement of intent from Chelsea – that they are able to attract the world's best talents and, hopefully, keep them.",
  "word_count": 564,
  "scraped_at": "2026-02-14T02:02:19.844985",
  "_text_extracted": true
}