{
  "article_id": "292b1533a454",
  "url": "http://thepeninsulaqatar.com/article/17/12/2023/man-united-defiant-show-against-liverpool-earns-them-a-draw",
  "title": "Man United defiant show against Liverpool earns them a draw",
  "date": "20231217T220000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nLiverpool's English defender #66 Trent Alexander-Arnold (C) and Manchester United's Scottish midfielder #39 Scott McTominay wait with Referee Michael Oliver for the outcome a VAR review in to a possible Manchester United handball, during the English Premier League football match between Liverpool and Manchester United at Anfield in Liverpool, north west England on December 17, 2023. (Photo by Paul ELLIS / AFP)\nLiverpool missed a chance to return to the top of the Premier League as troubled Manchester United finally showed some fighting spirit in a gritty 0-0 draw on Sunday.\nUnited had Diogo Dalot sent off for dissent in the final seconds of stoppage time at Anfield, but Liverpool had long since run out of ideas in the face of the visitors' defiant display.\nHaving started the weekend in top spot, Liverpool kicked off in third place after wins for Arsenal and Aston Villa earlier on Sunday.\nJurgen Klopp's side dominated a dour clash against their hated rivals, but lacked the cutting edge required to extend their winning run in the league to four matches.\nLiverpool sit in second place, one point behind leaders Arsenal ahead of their summit meeting with the Gunners at Anfield on Saturday.\nWhile Liverpool were left frustrated after failing to win at home for the first time in 12 games in all competitions, for United the result was a step in the right direction after another dismal week.\nRavaged by injuries and missing suspended captain Bruno Fernandes, United showed the kind of tenacity absent for much of a turbulent campaign.\nLast weekend's home humbling by Bournemouth was followed by a 1-0 defeat against Bayern Munich on Tuesday that condemned United to a meek Champions League group stage exit.\nErik ten Hag's team were back at Anfield for the first time since being hammered there 7-0 in March, an abject surrender that ranked among the most humiliating defeats in the club's history.\nThey remain without a win at Anfield since 2016, but after so many chastening visits over the last seven years, the under-fire Ten Hag left grateful for small mercies as United avoid more embarrassment.\nIn keeping with the toxic nature of English football's most bitter rivalry, Liverpool were forced to \"utterly condemn\" the fans who bombarded United's team bus with missiles before the game, leading to a window being smashed by a glass bottle.\nThat ugly scene was followed by a scrappy game equally short on appealing qualities.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 473,
  "scraped_at": "2026-02-14T02:10:33.598652",
  "_text_extracted": true
}