{
  "article_id": "29342a041483",
  "url": "https://cosafa.com/cosafa-womens-under-20-championship-expanded-to-five-teams/",
  "title": "COSAFA | COSAFA Women Under - 20 Championship expanded to five teams",
  "date": "20241111T133000Z",
  "domain": "cosafa.com",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "COSAFA Women’s Under-20 Championship expanded to five teams\nThe COSAFA Women’s Under-20 Championship will be played as five-team tournament with a slightly adjusted format after Zambia were added to the field this year for the return of the regional competition for the first time since 2019.\nZambia join hosts South Africa, Lesotho, Mozambique and Botswana as the participating teams, with an extra day added to the competition to accommodate the five sides. It will now be played in Johannesburg from November 19-24.\nThe teams will meet each other in a round-robin format, earning three points for a win and one for a draw. They will play four games each.\nThe team that manages to garner the most points at the end of the fixtures will be declared the winner.\nThere will be an informal draw to place teams in positions A1, A2, A3 etc and populate the fixtures, and two games per day, with November 21, midway through the competition, a rest day.\nEast African guest nation Tanzania are the only previous winners of the regional Under-20 competition when they claimed the crown in 2019, beating Zambia 2-1 in the final.\nThe COSAFA Women’s Under-20 Championship is one of a record five women’s tournaments that will be staged by COSAFA in 2024, cementing the organisation’s reputation as the leading zone on the African continent when it comes to the development of the female game.\nCOSAFA has already hosted the recently completed HOLLYWOODBETS COSAFA Women’s Championship, CAF Women’s Champions League | COSAFA Qualifier and Girls African Schools Football Championship tournament in the Under-15 age-group.\nStill to come is the COSAFA Women’s Under-20 Championship and COSAFA Women’s Under-17 Championship, which is scheduled for Maputo, Mozambique in December.\nAll these tournaments are vital for the growth of women’s football on and off the pitch, including the development of coaches, referees and administrators.",
  "word_count": 309,
  "scraped_at": "2026-02-14T02:20:49.377247",
  "_text_extracted": true
}