{
  "article_id": "2962d248ba36",
  "url": "http://thepeninsulaqatar.com/article/23/01/2025/man-city-step-up-rebuild-with-signing-of-marmoush-for-59-million",
  "title": "Man City step up rebuild with signing of Marmoush for £59 million",
  "date": "20250123T150000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\n(Files) Frankfurt's Egyptian forward #07 Omar Marmoush reacts after the German first division Bundesliga football match on January 17, 2025. (Photo by Kirill Kudryavtsev / AFP)\nLondon: Manchester City on Thursday announced the signing of Eintracht Frankfurt forward Omar Marmoush, with Kyle Walker joining AC Milan on loan, as the club step up their rebuild during a disappointing season.\nEgypt forward Marmoush has signed a four-and-a-half-year contract with the Premier League champions for an initial fee of £59 million ($72.6 million) with add-ons worth a potential £4 million.\nHe is City's third signing of the January transfer window following the arrivals of defenders Abdukodir Khusanov and Vitor Reis as manager Pep Guardiola reshapes his squad.\nThe 25-year-old, who scored 37 goals in 67 games for Bundesliga side Frankfurt, said signing for City was \"an amazing feeling\".\n\"With Pep, his technical staff and the world-class facilities here, players have everything they need to improve,\" he said. \"That was really enticing for me when I had the chance to come here.\n\"And I cannot deny I also want to win trophies. City have been the most successful club in England for many, many years, so I know I am joining a winning environment and winning culture.\"\nDirector of football Txiki Begiristain said Marmoush, who has 35 international caps, was an \"accomplished and exciting forward\".\n\"He's had an outstanding season, and every time we have watched him, he has influenced matches,\" he said.\n\"He has all the attributes a top-class attacker requires. He has outstanding pace and awareness, and he is exceptional in front of goal. He can also play a number of different positions, which is a really valuable asset.\"\nMarmoush's arrival at the Etihad comes during a frustrating season for City by their sky-high standards.\nThe club, Premier League champions for the past four seasons, are currently fifth in the table, 12 points behind leaders Liverpool and realistically out of the title race.\nDefeat at Paris Saint-Germain on Wednesday means Guardiola's side are in danger of missing out on the Champions League knockout stages for the first time since the 2012/13 season.\nThe 2023 European champions must beat Club Brugge next week to qualify for the play-off round after letting a two-goal lead slip in their 4-2 defeat in Paris.\nCity struggles\nCity started the current campaign strongly but hit the buffers in late October, winning just one in 13 matches in all competitions.\nGuardiola admitted earlier this month that he may have made a mistake by turning down the option of strengthening his squad in the summer transfer window.\nMarmoush, who has scored 20 goals for Frankfurt this season, fills the void left by the sale of Julian Alvarez to Atletico Madrid in August, significantly boosting Guardiola's attacking options.\nCity have been hit by a spate of injuries this season, particularly in defence.\nEarlier this week they announced the signing of teenage defender Vitor Reis from Brazilian club Palmeiras for a reported fee of around £30 million.\nIt followed the arrival of Uzbekistan defender Abdukodir Khusanov from Ligue 1 side Lens for about £34 million.\nBut Walker is ending his long association with the club, set to join AC Milan on loan for the remainder of the season.\nThe England right-back, 34, has endured a difficult campaign at City and has not started a game since their derby loss to Manchester United on December 15.\nLast week City announced that forward Erling Haaland had signed a blockbuster new deal keeping the prolific forward at the Etihad until 2034.\nThe club are splashing the cash even as they wait to learn the outcome of a major disciplinary case.\nCity faced an independent commission hearing last year to examine more than 100 charges from the Premier League concerning alleged breaches of its financial rules, charges the club have always strenuously denied.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 707,
  "scraped_at": "2026-02-14T02:18:11.285851",
  "_text_extracted": true
}