{
  "article_id": "2981adcb8033",
  "url": "https://www.caughtoffside.com/2024/04/19/former-man-city-player-manager/",
  "title": "Former Man City player tipped to become future manager of the club",
  "date": "20240419T084500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola is predicting significant advancements in management for Man City legend Ilkay Gundogan.\nThe German footballer is currently playing for Barcelona after leaving the club last summer.\nAfter one of the most incredible football seasons ever, Gundogan ended his spectacular tenure in east Manchester as City ultimately captured both domestic and European glory.\nAfter defeating Arsenal to win the Premier League, Man City defeated Manchester United in the FA Cup final.\nLater, in the Champions League final in Istanbul, Rodri scored the crucial game-winning goal to complete a historic treble for the team.\nA recent story has described the sentiment of returning to the club in the future, but in a completely different capacity.\nPep Guardiola and “members of his circle” think that Ilkay Gundogan, the former captain of the team, would lead the Etihad Stadium team in the future as their manager, according to information provided by Manchester City insider “Tolmie’s Hairdoo” on X.\nThe now-Barcelona midfield player reportedly completed his coaching qualifications at the City Football Academy and was in charge of drawing attention to the box formation that one of Man City’s youth team was using.\nPep Guardiola and Ilkay Gundogan are also rumoured to have talked about John Stones’ transition into the position, which has been extremely successful for the England international and the team.\nGundogan has shown his intelligence at Man City\nThis shows how intelligent and useful the midfielder has proved to be in Man City’s tactical changes under Guardiola.\nAt this time, neither Guardiola nor Man City appear to be in a rush to have talks on a contract extension, even though Guardiola’s current deal is set to expire at the end of the next season.\nIn Gundogan, Man City know they have an option for the future once the player hangs up his boots and decides to step into management.",
  "word_count": 309,
  "scraped_at": "2026-02-14T01:51:24.796899",
  "_text_extracted": true
}