{
  "article_id": "29871cde6beb",
  "url": "https://allafrica.com/stories/202505150041.html",
  "title": "Africa : From Freetown to Fame - How Momoh Kamara Lit Up Egypt",
  "date": "20250515T061500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "At just 20 years old, Momoh Kamara has emerged as the undisputed heartbeat of Sierra Leone's U20 side at the TotalEnergies CAF U-20 Africa Cup of Nations (AFCON) Egypt 2025.\nHis combination of poise, power and precision has not only helped the tournament debutants reach the quarter-finals, but has also turned him into one of Africa's brightest young stars.\nKamara's exploits--from a stunning hat-trick against hosts Egypt to a commanding all-round midfield display across four matches--have earned him the Player of the Group Stage and Top Scorer accolades , with four goals to his name.\nWhile Sierra Leone's run ended in heartbreak against Morocco, Kamara's story is just beginning.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nFrom Kambia to Cairo: A Journey Fuelled by Grit\nBorn in Kambia Town and raised in the tough neighborhoods of East End Freetown, Kamara's journey is a testament to perseverance.\nHe began honing his craft at Mattia Football Club, a grassroots outfit known for producing raw talent. A move to Diamond Stars FC and later a stint with Leixões SC B in Portugal added polish to his natural game.\nHis first real taste of international spotlight came during the WAFU Zone A qualifiers, where he led Sierra Leone to their maiden U20 AFCON qualification, bagging the Best Player award in the process.\n\"I played barefoot in the streets, dreaming of this,\" Kamara said.\n\"To be here, representing Sierra Leone, and to lead the team to our first AFCON is something I'll never forget.\"\nA Breakout Tournament\nIf the qualifiers hinted at his potential, Kamara's performances in Egypt confirmed it. After a cagey 0-0 opener against Zambia, Kamara exploded in the second match--scoring a sensational hat-trick against the host nation.\nHe added another goal against South Africa, finishing the group stage as the tournament's leading scorer.\n\"Momoh is different,\" said coach Mohamed Lamin Kamara. \"He has the heart of a lion and the feet of an artist. He doesn't just play football--he lives it. He makes others better.\"\nDespite Sierra Leone falling 1-0 to Morocco in the quarter-finals, Kamara stood tall, delivering yet another mature performance against one of the continent's top teams.\nHis impact was recognized as he was named in the CAF Technical Study Group Best XI for the group phase.\nAmerican Dream: From Freetown to Minnesota\nKamara's talents haven't gone unnoticed. Ahead of the tournament, he sealed a move to Minnesota United FC 2 in the USA's MLS NEXT Pro, on loan from Mattia FC, with a purchase option.\n\"Joining Minnesota is a big step,\" Kamara said. \"It's the next challenge. But I know I can handle it. Playing in Egypt gave me confidence that I can thrive anywhere.\"\nAmos Magee, MNUFC's Head of Player Development, called him \"a creative and determined young talent with a real nose for goal.\"\nHis signing is being closely watched in MLS circles, with many predicting he could soon make the jump to Minnesota's first team.\nA Future Built on Ambition\nKamara has already earned two senior caps for Sierra Leone, debuting during the 2026 FIFA World Cup qualifiers. As interest from European clubs grows, he remains grounded.\n\"My focus now is to keep growing, to help my club and country,\" he said. \"I dream of playing in the Champions League one day. But for now, I'm working every day to improve.\"\nHis maturity off the pitch mirrors his intelligence on it. He speaks like a veteran, yet plays with the hunger of someone who knows where he came from.\nMore Than a Star\nFor Sierra Leone, Kamara represents more than just goals and glamour. He symbolizes the potential of a nation often overlooked in African football. His rise is inspiring a new generation of players back home.\n\"He's not just our leader on the field,\" said teammate Alpha Turay. \"He's a role model for the entire country.\"\nAnd as the dust settles on Sierra Leone's historic U20 AFCON campaign, Momoh Kamara leaves Cairo not just as a breakout star--but as a name Africa won't soon forget.",
  "word_count": 674,
  "scraped_at": "2026-02-14T02:11:36.682368",
  "_text_extracted": true
}