{
  "article_id": "29950affe2f6",
  "url": "https://metro.co.uk/2025/11/01/jamie-carragher-hails-absolutely-fantastic-chelsea-star-tottenham-win-24589647/",
  "title": "Jamie Carragher hails  absolutely fantastic  Chelsea star after Tottenham win",
  "date": "20251101T201500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher was full of praise for Chelsea as they beat London rivals Tottenham 1-0 in the Premier League.\nJoao Pedro’s first-half goal was enough to separate the sides in north London and send Chelsea back into the top-four of the Premier League.\nBrilliant work from Moises Caicedo created the opening for Pedro’s winner and Carragher described the £115m signing as an ‘absolute monster’ in Chelsea’s midfielder.\nChelsea had a number of chances to put the game to bed but did not require a second as Thomas Frank’s Spurs created very little, suffering yet another defeat at home.\nTottenham’s expected goals of 0.05 was their lowest in a Premier League game since Opta began collecting the data in 2012.\nWhile Carragher was critical of ‘awful’ Spurs, he was impressed by Chelsea and reserved special praise for Caicedo.\n‘This was one of those goal when it’s not about the goalscorer… it’s all about Caicedo,’ Carragher said on Sky Sports commentary. ‘He’s an absolute monster in midfield.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He makes challenge after challenge and basically gets Chelsea that goal. It’s absolutely fantastic from Caicedo and exactly what Chelsea have deserved.\n‘I upset Chelsea fans – not for the first time – by saying Declan Rice was just ahead of this man [Caicedo]\n‘But right now we are watching two of the best midfielders in world football, there’s no doubt about that. There’s no shame in being behind Rice, in my eyes. They’re both absolutely fantastic.’\nTurning his attentions back to the game, Carragher added: ‘The difference between Chelsea and Tottenham on the ball is night and day.\n‘Spurs were so poor going forward. They were awful. This is a big result for Chelsea, but lot for Thomas Frank to ponder. They have a big problem in this stadium.’\nEx-Tottenham midfielder Jamie Redknapp was also full of praise for Caicedo, insisting his performance against Spurs was ‘out of this world’.\n‘When I look at Chelsea, at least there’s a bit of excitement and flair,’ Redknapp said. ‘Tottenham just look paceless.\n‘They didn’t have any idea how to get up the pitch and it was just too easy for Chelsea.\n‘If we analyse the Premier League this year there is just one outstanding side. Arsenal are head and shoulders above.\n‘The rest are struggling. No-one is finding that consistency and that is why it is up for grabs for Chelsea this season.\n‘They have confidence and there is an excitement about watching Chelsea, but I have to be honest, any team would have fancied their chances at Tottenham today.’\nBut Redknapp was hugely disappointed by his former club’s display, adding: ‘It didn’t look hard to play against Spurs tonight.\n‘That was as easy as it gets. If it was a boxing match, they’d have stopped it. Tottenham were so poor.\n‘I actually thought they’d have a real go tonight but that was one of the worst performances I’ve seen from Tottenham.\nMore Trending\n‘They have won three home games in the last year and I would probably put that as number one because if you flip it to some of the other games, like last season when they lost 4-3, at least they had a real go.\n‘They got after teams, it could have gone either way and it was exciting. That today, they never laid a glove on Chelsea.\n‘They had no idea to play out, they had no understanding and they were missing challenges. they made it so easy for Chelsea.’\nChelsea and Tottenham are both in Champions League action in midweek, with the former visiting Qarabag and the latter hosting Copenhagen.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd fan ‘heartbroken’ as haircut hopes fade following Nottingham Forest draw\nMORE: Ruben Amorim demands ‘much more’ from Manchester United star after Nottingham Forest draw\nMORE: Scott Parker makes Arsenal Premier League title prediction after Burnley defeat",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:59:14.376475",
  "_text_extracted": true
}