{
  "article_id": "29a3a04029f1",
  "url": "https://metro.co.uk/2025/12/16/john-terry-tells-chelsea-sign-chelsea-legend-free-transfer-january-window-25530443/",
  "title": "John Terry tells Chelsea to sign Chelsea legend on free transfer in January wind",
  "date": "20251216T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Terry has urged Chelsea to abandon their transfer policy of signing young players and make a move for club legend on a free when the January window reopens.\nThe Blues are likely to reinforce their squad next month in a bid to arm Enzo Maresca with the tools required to sustain a top four challenge and make it through to the latter stages of the Champions League.\nAnd while a number of the club’s most recent attacking recruits have struggled to make an impact it is in defence where Chelsea look particularly short of numbers.\nWesley Fofana, who has struggled with a number of injury issues since his move from Leicester, and Trevoh Calobah, who was handed a Chelsea lifeline this time last year after he was recalled from a loan spell at Crystal Palace, are the current first choice pairing.\nThiago joined Chelsea as a free agent five years ago and after initially struggling following his arrival, he quickly adjusted to the demands of the Premier League and became a club legend, playing an integral part in their Champions League triumph under Thomas Tuchel.\nThe 41-year-old left Stamford Bridge last year but his links with the club remain strong given his two sons are currently enrolled in Chelsea’s academy.\nThiago’s contract with Fluminese expired recently and Terry believes the veteran centre-half would add the experience currently lacking in Maresca’s team.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHe said: ‘Thiago Silva is available. Listen to me, a man with great experience, a man with a great relationship with our football club.\n‘His two kids are in our academy, no doubt he’s going to be back in London with his family for Christmas I would love to see this man back at our football club, playing alongside these players.\n‘I’m not saying he has to play every week with the experience he can bring playing next to someone like that probably goes back to my role in 2017 under Antonio Conte when we won the league.\n‘I didn’t play but I had a role to play within the group. Be that buffer between the players the manager, the owners and have that bit of experience.\n‘Sometimes when you’re going through a tough spell or when you’re going through a good spell as well you know what to say and what to deliver and he certainly brings that as well.\n‘Thiago Silva back to Chelsea would make everyone very happy, me included.’\nRather than dip into the market in January for another up and coming talent, Terry’s former Chelsea teammate Gallas believes a more experienced defender would serve Maresca better, as it did when Frank Lampard brought Thiago Silva to the club as a free agent.\n‘For me, it’s always a problem with a club that doesn’t have experienced players in the team,’ Gallas told OLGB.\nMore Trending\n‘So when we speak about Chelsea, we know Thiago Silva was the captain of Chelsea, was a player who had more experience, and at the same time, he was helping the young defenders who were around him.\n‘When he left, yes, they didn’t buy an experienced defender, that’s why the defenders have made some mistakes.\n‘The problem is when you are on the pitch, when you play against the big clubs, you need someone who is leading the defensive line. When I look at Chelsea, when they play, no one is leading that defense line.\n‘That is a problem because all the players, all the defenders, are focused about what they have to do and not about the defensive line.’\nMORE: Manchester United begin talks to sign £35m Said El Mala ahead of Tottenham\nMORE: £2,500,000,000 from Chelsea FC sale will be handed to Ukraine\nMORE: Carlos Baleba speaks out on Manchester United transfer speculation",
  "word_count": 680,
  "scraped_at": "2026-02-14T01:59:31.523737",
  "_text_extracted": true
}