{
  "article_id": "29b479600833",
  "url": "https://thechronicle.com.gh/todays-uefa-champions-league-fixtures-previews-14/",
  "title": "Today UEFA Champions League Fixtures & Previews - The Ghanaian Chronicle",
  "date": "20250916T013000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal open Champs League campaign at Athletic Bilbao\nClashing in competitive action for the very first time, Arsenal and Athletic Bilbao open their 2025-26 Champions League league phase campaigns today at the San Mames Stadium.\nThe Gunners have only been on an upward trajectory in Europe since returning to the elite, while their hosts are competing in the Champions League proper for just the third time ever.\nThe lack of European silverware continues to bedevil all associated with Arsenal, who have not conquered the continent in any shape or form since winning the 1994 UEFA Cup Winners’ Cup, but there is a sense that Mikel Arteta‘s men are now genuine contenders for Champions League stardom.\nNow entering a new European campaign on the back of a £250m summer spending spree, Arsenal harbour realistic ambitions of a Premier League and Champions League double, having amassed a respectable nine points from their first four games in the English top flight.\nDespite missing Bukayo Saka, William Saliba and Kai Havertz before losing Martin Odegaard to another shoulder problem, Arteta’s men made extremely light work of Ange Postecoglou’s Nottingham Forest on Saturday lunchtime, easing to a 3-0 win .\nLikely rearguard alterations on Arsenal’s end could see the Gunners lose some of their well-documented defensive steel, but a Nico Williams-less Athletic are not well-placed to capitalise.\nEven without Odegaard and Saka pulling the strings, Arteta’s men still possess offensive quality in abundance, and we can only envisage the visitors making a triumphant start to another Champions League campaign.\nCredit: sportsmole.co.uk\nTottenham welcome Villarreal to North London\nBoth recent winners of the Europa League, Tottenham Hotspur and Villarreal aim to take the first step towards Champions League glory in Tuesday’s league phase opener in North London.\nTottenham conquered the second-tier tournament last season to return to the big time, while the visitors’ fifth-placed La Liga finished sufficed for UCL football.\nSet to reap the rewards of his predecessor’s hard work, Thomas Frank leads Tottenham into Champions League battle on Tuesday after Ange Postecoglou masterminded Spurs’ run to Europa League supremacy last season, their first major trophy in a long and torturous 17 years.\nSpurs already have one UEFA defeat next to their name this season, but they came out of their Super Cup loss to Paris Saint-Germain with a certain amount of credit, and the pre-game statistics make for pleasant reading thanks to last year’s Europa League success.\nIndeed, Tottenham have avoided defeat in each of their last 20 UEFA competition games played at home, while they have only failed to score in one of their last 16 continental matches – an inconsequential 1-0 loss to AZ Alkmaar in last year’s Europa League last-16 first leg.\nThanks to Spain’s high UEFA coefficient ranking, Villarreal’s fifth-placed La Liga finish last season was enough to earn them a ticket back to the Champions League, but Marcelino‘s men have started to lose their way at an inopportune time.\nVillarreal’s atrocious record against English clubs in the Champions League and Spurs’ pitiful performances vs. Spanish teams adds another layer of intrigue to this battle, where the hosts have our vote to defy their old La Liga struggles.\nCredit: sportsmole.co.uk\nR. Madrid kick-off their bid to win 16th trophy against Marseille\nReal Madrid will kick off their bid to win a 16th Champions League trophy when they welcome Marseille to the Santiago Bernabeu for Tuesday’s league phase meeting.\nThis will be the first meeting between the two sides since Cristiano Ronaldo netted braces in home and away victories in the 2009-10 group stage.\nAfter falling at the semi-final stage at the Club World Cup, Real Madrid have dusted themselves off to make a perfect start to their first La Liga campaign under former Bayer Leverkusen boss Xabi Alonso.\nLos Blancos carried significant momentum into the international break after they recorded victories over Osasuna, Real Oviedo and Mallorca.\nThe league leaders will now turn their focus to their European campaign, and they will be keen to better last season’s league phase campaign when they had to settle for an 11th-placed finish following five wins and three defeats in eight matches.\nReal Madrid will aim to maintain their 100% record against Marseille, having won each of their previous four head-to-head encounters, scoring at least three goals in all bar one of those matches.\nMarseille will not be content with taking part in the league phase, as they look to reach the Champions League knockout rounds for the first time since reaching the quarter-final stage in 2011-12.\nMarseille may have beaten Lorient with consummate ease on Friday, but they have lost narrowly in both of their Ligue 1 road trips, which will not inspire confidence ahead of a daunting visit to the Santiago Bernabeu.\nCredit: sportsmole.co.uk\nWith the Champions League set to return on Tuesday, Juventus will host Borussia Dortmund on Tuesday at Allianz Stadium.\nThe Italian home side will hope to continue their perfect start to the campaign, with the club beating rivals Inter Milan 4-3 in Serie A on Saturday, while the Bundesliga visitors won 2-0 against Heidenheim on the same day.\nThe hosts’ Champions League performances last term were poor considering they finished 20th in the league phase with nine points, but while they were entered into the round of 16 playoff round, they squandered their lifeline by losing 4-3 on aggregate against PSV Eindhoven in February.\nJuve failed to score in three of their final four games in the league phase, and though they did beat Bundesliga opponents RB Leipzig 3-2 in October 2024, they were beaten 1-0 by Bundesliga side Stuttgart in the same month.\nThe White and Blacks have triumphed in their past six home fixtures – all six were in Serie A – but they suffered two defeats at Allianz Stadium in their four most recent European matches at the ground.\nJuventus showed their vulnerability against Inter, and given Dortmund have been strong away from home, they should be confident of creating opportunities.\nThe hosts should also be confident that they can threaten BVB’s ravaged backline, so it would not be surprising if the two sides played out an entertaining draw.\nCredit: sportsmole.co.uk\nFIXTURES\nPSV 17:45 Union Saint-Gilloise",
  "word_count": 1032,
  "scraped_at": "2026-02-14T02:09:24.925373",
  "_text_extracted": true
}