{
  "article_id": "29c5619ecc91",
  "url": "https://www.90min.com/posts/man-utd-best-and-worst-players-in-draw-with-liverpool",
  "title": "Man Utd best and worst players in draw with Liverpool",
  "date": "20231217T214500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd's best and worst players in draw with Liverpool\n- Man Utd drew 0-0 with Liverpool at Anfield on Sunday\n- Onana and Mainoo impressed with their performances\n- Amrabat once again struggled in the middle of the park\nWell, that wasn't a particularly fun game of football, was it?\nMan Utd and Liverpool played out an utterly dire 0-0 at Anfield on Sunday but, with the dust now settled on the game, United fans will no doubt be happy with the point they garnered through it.\nA few of Erik ten Hag's men did put in rather stoic performances in a game many expected Man Utd to lose.\nHere's Man Utd's best and worst players from the draw, according to 90min's player ratings.\nMan Utd's best player vs Liverpool\nKobbie Mainoo: 7/10\nAnother week, another classy performance from the 18-year-old.\nKobbie Mainoo has played beyond his years since breaking into the Manchester United starting XI recently, and he continued to show composure on and off the ball in the biggest game of his young career at Anfield on Sunday.\nThe midfielder put in a fearless, combative, performance.\nHonourable mention\nAndre Onana: 6/10\nAfter receiving pelters for his UEFA Champions League form once again in midweek, Andre Onana was back to his best in the Premier League this weekend.\nThe ex-Inter goalkeeper made eight saves to keep his sixth clean sheet of the 2023/24 league season so far.\nMan Utd worst player vs Liverpool\nDiogo Dalot: 2/10\nFull credit to Diogo Dalot for getting needlessy sent off just to give us something to talk about after the game.\nThe two yellow cards were harsh, but they were enough to sully what was a pretty good performance up until the 93rd minute of the clash at Anfield.\nDishonourable mention\nSofyan Amrabat: 3/10\nMainoo's performance in middle of the park is perhaps even more remarkable when you consider just how poor his midfield partner Amrabat was.\nThe Moroccan once again struggled to stamp his authority on a Premier League game, managing to complete a measly 57% of his passes and losing seven duals on Sunday.",
  "word_count": 354,
  "scraped_at": "2026-02-14T01:56:38.153809",
  "_text_extracted": true
}