{
  "article_id": "29d6cd2cca00",
  "url": "https://theathletic.com/4490621/2023/05/06/chelsea-cobham-dominic-solanke-academy/",
  "title": "Dominic Solanke the latest reminder why Chelsea academy graduates remain coveted",
  "date": "20230506T051500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lost at the Emirates Stadium on Tuesday, amid the latest humiliation in a hellish season, was the fact that, against Arsenal midweek, Frank Lampard named a starting XI without a single Cobham graduate in it for the first time in either of his stints as Chelsea head coach.\nIt was, in one sense, simply a product of circumstances.\nAdvertisement\nReece James and Mason Mount, the two enduring homegrown pillars of Lampard’s initial 18-month spell in charge from the summer of 2019, were both unavailable due to injury. Conor Gallagher and Trevoh Chalobah are regarded as squad options rather than ironclad starters — both did come on in the second half.\nBut, in another, it was a glimpse of a possible future a significant number of Chelsea supporters hope never comes to pass.\nMount’s ongoing contract impasse could well lead to an acrimonious departure from Stamford Bridge this summer. Chalobah’s wildly fluctuating amount of first-team minutes has created uncertainty about his future despite signing a long-term extension as recently as November, while Gallagher had an opportunity to join Everton in January, is coveted by other Premier League clubs and remains arguably the most saleable asset in a bloated senior squad.\nGO DEEPER\nLiverpool, Bayern or Chelsea – what happens next with Mason Mount?\nOf the seven Cobham products to have featured for Chelsea in the domestic top flight this season, the only two who appear truly secure at Stamford Bridge are James and Armando Broja, the 21-year-old striker currently working his way back from an ACL injury sustained in December. Lewis Hall, their big academy breakthrough story of 2022-23, enters the final two years of his contract this summer and is yet to commit to an extension, with Ben Chilwell and Marc Cucurella ahead of him in the left-back pecking order and many more names blocking the path to his favoured midfield role.\nIt only takes a cursory glance at the matchday squads of Chelsea’s recent opponents to realise that all the players listed above will, at a bare minimum, have alternative career opportunities in the Premier League.\nOn Tuesday it was Eddie Nketiah, in the Cobham ranks between the ages of nine and 15 but now a valued backup striker in an Arsenal squad chasing the title. The previous midweek against Brentford it was Matthew Cox, a now 20-year-old goalkeeper released by Chelsea at 14 who, last summer, signed a six-year contract with their west London neighbours. In the game before that it was Billy Gilmour, signed from Scottish heavyweights Rangers at 15, then sold at 21 a year ago and now finally beginning to win the trust of Roberto De Zerbi and earn real minutes in a spectacularly polished Brighton & Hove Albion side.\nAdvertisement\nAll in all, nine Premier League clubs other than Chelsea have given league minutes this season to players who once honed their skills at Cobham — and that list does not include Tino Livramento, who only returned to Southampton training at the end of March after an ACL injury last April that curtailed his impressive first-team breakthrough in 2021-22.\nThis weekend away to Bournemouth they are likely to come up against two more familiar faces: Chris Mepham, a centre-back Chelsea released at 14 who went on to break through down the road at Brentford before earning a £12million move to his current club in January 2019, and Dominic Solanke, the former Cobham golden boy who illustrates better than most the tensions that will always exist at Chelsea in the realm of youth development.\nSolanke’s slow-burn trajectory since leaving Stamford Bridge at age 19 in the summer of 2017 makes it easy to forget just how highly rated he once was — at Cobham and beyond.\nOver the course of a 2014-15 season in which he and Tammy Abraham scored 41 goals apiece in a Chelsea academy side that won the UEFA Youth League and FA Youth Cup, the 17-year-old Solanke also made his first-team debut off the bench late in a 6-0 Champions League win over Slovenian side Maribor, was named England Men’s Youth Player of the Year for 2014 and accepted an invitation to train with Roy Hodgson’s senior national-team squad.\nWhat happened next was documented in an illuminating interview Solanke gave to The Athletic in September 2021.\nAn underwhelming loan spell at Dutch club Vitesse Arnhem in 2015-16 did not bolster his case for accelerated promotion to the Chelsea first-team squad and, when he returned, Belgium international Michy Batshuayi was signed for £33million to give new head coach Antonio Conte a more proven alternative option to Diego Costa up front.\nAdvertisement\nSolanke lost an entire year of development to a contract standoff with Chelsea, then made an ill-advised career decision to join a rising Liverpool in the summer of 2017 weeks before they signed Mohamed Salah to complete an explosive front three with Sadio Mane and Roberto Firmino. It was only upon moving to Bournemouth in January 2019 for £17 million that he found the space to grow and progress as a professional.\nEven his trajectory on the south coast has been far from linear.\nHe waited more than a year to score for the club, then netted 44 times in 86 Championship appearances across two seasons, only to struggle in front of goal for long stretches of the first half of this one following their return to the top flight. Bournemouth fans still grumble about his finishing at times, while doing more work for the team in deeper areas has also hampered his scoring production. But three goals and three assists in April have helped power the late-season surge that looks like it has kept Bournemouth safe from relegation.\nOnly 25, Solanke finally appears to be establishing himself as an attacker of legitimate Premier League quality with room to refine and expand his game further as he accumulates more experience against the domestic elite.\nIt would be valid to look at Solanke’s current level and argue that, while still some way short of his former academy strike partner Abraham’s feats with Roma in Italy’s Serie A and European competition, he could be a serviceable home-grown squad option for Chelsea. It would also be valid to analyse his career and contend that he is exactly the type of talent produced at Cobham — in other words: good, but not great — the club should be selling in order to help fund signings.\nIn that sense, Solanke is representative of many other young footballers who make their way through the age groups at Chelsea’s base in the Surrey countryside south of London, and emblematic of the choices with bigger strategic implications that their co-owners Todd Boehly and Behdad Eghbali will need to begin making as soon as this summer.\nChelsea’s new owners rebuffed almost all offers for the club’s most coveted academy talents last summer, shortly after completing their takeover, only sanctioning Gilmour’s move to Brighton after the young Scot pleaded to be allowed to leave.\nAdvertisement\nLevi Colwill was loaned out rather than sold, and both he and Broja committed to new contracts. The decisions by the now-departed Marina Granovskaia to sell the likes of Abraham, Fikayo Tomori and Marc Guehi were characterised as errors that would not be repeated.\nIt is also notable that, amid the vast, destabilising turnover of key personnel in virtually every other department of the club, the positions of academy leaders Neil Bath and Jim Fraser have actually been strengthened. Both came away from early conversations with Boehly and Eghbali convinced of the new owners’ commitment to putting Cobham’s brightest talents at the heart of their plan for operating the club.\nGO DEEPER\nHow is Chelsea's new transfer policy impacting the pathway for their academy talent?\nBut these assurances have jarred with Chelsea’s unprecedented spending in the past two transfer windows, the majority of it aimed at recruiting elite young first-team talent. The club now face both logistical and financial pressures to trim a bloated squad, and recent Cobham graduates are among the most saleable assets — not to mention the most tempting ones on whom to cash in, given that they would represent pure profit in the accounts.\nChelsea’s historic five-year FA Youth Cup winning streak may have ended in 2018, but Cobham’s reputation within football as one of the game’s best finishing schools for top-level talent has only grown stronger since. Beyond the web of academy old boys that stretches across the Premier League is a blue enclave in Serie A that features Abraham, Tomori, Jeremie Boga, Ola Aina and Samuel Iling-Junior.\nThen there is Jamal Musiala at Bayern Munich, the most agonising example of another notable trend that Solanke’s acrimonious exit foretold: talented teenagers who, on the advice of family, agents or both, hold off on signing professional terms to maintain greater agency over their futures and pursue what they deem to be the best avenue for career progression.\nThese painful defections began to poke holes in the Roman Abramovich era strategy of cashing in on academy talent rather than cultivating it in the second half of the 2010s, and they represent the worst-case scenario outcome for Boehly and Eghbali’s more business-minded view of how Chelsea should operate.\nRelatively high wages and the dream of playing first-team football at Stamford Bridge remain compelling enough reasons to stay for some, but Cobham’s best young talents and those advising them increasingly want evidence of clear individual development plans before they will agree to commit themselves to pro contracts — evidence that becomes much more difficult to provide when the club appear to be stockpiling more top young talent than it can realistically use.\nAdvertisement\nTechnical director Christopher Vivell has been tasked with leading the search for a developmental partner club somewhere in Europe, but nothing is imminent on that front. Until one is found, developmental signings as well as academy prospects are at risk of stagnating without sufficient challenges at Cobham.\nThe fruits of Bath and Fraser’s brilliant long-term work are on display on a weekly basis in the Premier League in the form of Solanke and others, and there is nothing to suggest that will change anytime soon.\nIf anything, rival clubs in England and on the continent are becoming more, rather than less, conscious of the depth of young talent at Cobham. Every high-profile success story strengthens the belief within the game that Chelsea academy graduates are better equipped than most to make the step up to men’s football.\nProducing a steady stream of accomplished footballers for lesser clubs and selling them for significant profits is a perfectly valid measure of elite academy success. So, too, is assimilating at least some of these players into your own first team, allowing them to help ground the identity of the club and contribute to a more stable long-term dressing room culture — even if they fall short of blossoming into global superstars.\nFor much of Abramovich’s reign, the latter path was sacrificed at the altar of aggressive transfer spending on more proven commodities to fuel yearly trophy challenges.\nIt worked to a degree that many Chelsea fans would probably be inclined to look upon very fondly, particularly when set against the disastrous unravelling of this season. Boehly and Eghbali, however, want the club to be developers as well as acquirers of top talent, planning for tomorrow while also winning today.\nIt is a very difficult path to tread, and their appetite to walk it will be tested as soon as this summer.\nWe are about to find out what academy success looks like post-Abramovich, and whether it will be seen more in Chelsea blue or the colours of their opponents.\n(Top photos: Getty Images)",
  "word_count": 1948,
  "scraped_at": "2026-02-14T02:00:20.001554",
  "_text_extracted": true
}