{
  "article_id": "29db04fd2148",
  "url": "https://www.bbc.co.uk/sport/football/66837176",
  "title": "Newcastle historic Champions League campaign 20 years on",
  "date": "20230919T070000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Alan Shearer wheeled away, arm aloft in typical style, to celebrate yet another Newcastle United goal, something felt different.\nAt the San Siro in March 2003, Shearer had just scored his second to put Sir Bobby Robson's Magpies in front against Inter Milan in the Champions League, before Ivan Cordoba levelled minutes later.\nNewcastle had battled hard across two group phases in that campaign to show they were equals to Juventus, Inter and Robson's former club Barcelona.\nThough they would ultimately fail to progress further, drawing 2-2 with an elite side in an iconic stadium created memories that will last a lifetime.\n'An iconic moment'\nOn Tuesday, Newcastle return to face AC Milan in their first Champions League appearance for 20 years, evoking all those memories again.\n\"What a game,\" former defender Steven Caldwell tells BBC Sport. \"The San Siro is the stadium you think of if you grew up watching Italia 90; it is the stadium of my generation.\n\"To see what it was like was amazing. It was an iconic moment for a football club that I love.\n\"It was a proper football match; there was a lot on the line, high stakes, against a world-class team. For us to compete was so incredible, we were so close, right in it, it could have gone either way.\"\nBy the time Newcastle made it to Milan, they had more than left their mark in the competition, becoming the first team to lose their first three group games against Dynamo Kyiv, Feyenoord and Juventus and still progress, with famous wins against all three in the reverse fixtures.\nBack then, there were two group stages in the Champions League. And as they went to San Siro, Newcastle needed a victory as, after a heavy defeat by Inter in the first game, a sobering loss to Barcelona in the Nou Camp rain had followed before successive wins over Bayer Leverkusen.\nThe draw was compounded by another loss to Barcelona at home and the dream ended, but the night in Italy has become famous for the atmosphere than the football.\n\"The San Siro had an aura; it was an iconic, mythical place. Watching Newcastle play there was not on the horizon,\" Matthew Philpotts, writer for the True Faith Fanzine, says.\n\"It was about the experience as much as the result. Shearer's goal in front of the away end is etched on the memory. It seemed like everyone you knew was in Milan. The sheer number of fans was impressive.\"\n'The squad was unique, combustible and difficult to play against'\nRobson had masterminded a meteoric rise after replacing Ruud Gullit as manager in September 1999. The Dutchman's reign had ended after a dispute with Shearer reached boiling point, the manager dropping the striker for a derby defeat by Sunderland, and the club were heading into the abyss.\nBut the squad Robson built, mixing youthful exuberance with the experience he inherited, was as unpredictable as it was talented. They finished fourth in 2002.\n\"We had a lot of really energetic players like Jermaine Jenas, Kieron Dyer, Craig Bellamy and Laurent Robert,\" Caldwell recalls. \"The balance of that with Alan [Shearer], Shay [Given], Gary [Speed], was really unique and it made us difficult to play against.\n\"That squad was combustible. It wasn't the same kind of people; it was hard to keep everyone on track and Bobby did that excellently.\"\nThe speed of the turnaround, driven by the sheer force of County Durham-born Robson's personality and passion for his club, initially caught up with Newcastle.\nAfter making light work of Bosnian side Zeljeznicar Sarajevo in the qualifiers, a 2-0 defeat in Kyiv was compounded by a retrospective ban for Bellamy, before they were beaten at home by Feyenoord and, perhaps unluckily after a Shearer header was wrongly ruled offside, Juventus away.\nVictory over the Old Lady at St James' Park re-lit the fire. Defender Andy Griffin was the unlikely hero, helping Newcastle win by a single goal, with a little help from a deflection off goalkeeper Gianluigi Buffon.\n\"People will remember me for that goal and that game. Whether I scored the goal or not, it doesn't matter,\" Griffin asserts. \"The fact I started against Juventus, played 90 minutes and was involved in the goal and a win, was good enough.\n\"[Buffon] made a bit of a blunder. We managed to keep a clean sheet; people talk about the goal, but I put in a very good tackle right at the end when someone was through on goal. I almost pride myself on that as opposed to the goal.\"\n'It was an emotional rollercoaster'\nShearer inspired them at home to Kyiv but it was the match away at Feyenoord which went down in folklore. Newcastle were 2-0 up thanks to Bellamy, back from his ban, and Hugo Viana before the Dutch side hit back quickly to level. Needing a goal to have any chance of progression, Bellamy scored in stoppage time to send everybody wild.\n\"It was crazy,\" Caldwell recalls. \"It is not often you lose yourself and become like a fan. We were so engrossed in the game.\"\n\"It was very much an emotional rollercoaster,\" adds Griffin. \"The final whistle went and our celebrations had to be put on hold because we had to wait for the result from Kyiv. Juventus beat Kyiv, which meant we qualified for the second group phase.\n\"We are all in the changing room, singing 'we are Champions League' and dancing around, totally enjoying the moment. It was one of the best games and highest highs I experienced.\"\nBellamy would get sent off in the defeat at home by Inter, incurring another ban. Nobody embodied the difficult nature of that squad more, but Robson was the man to get the best from him when it mattered.\n\"Bellamy was a feisty little character,\" chief scout Charlie Woods, says. \"That was what made him so good. His contribution to the team was huge.\n\"Bobby wanted Shearer to play between the lines of the 18-yard box and he'd get Dyer and Bellamy to make runs in behind and get balls into the box. Alan was a great finisher.\n\"Bobby's man management was always great. He knew when to have a go and when to put his arm around people when it was necessary. He dealt with Bellamy superbly.\"\nFor two decades, Robson's team has been immortalised for their exploits, but the anticipation on Tyneside as Eddie Howe's men look to emulate them is palpable.",
  "word_count": 1082,
  "scraped_at": "2026-02-14T02:20:10.966958",
  "_text_extracted": true
}