{
  "article_id": "29e2a29738ff",
  "url": "https://www.fourfourtwo.com/person/coaches-managers/eddie-howe-admits-facing-long-and-hard-newcastle-united-decision-this-month-as-cup-hero-hails-never-say-die-attitude",
  "title": "Eddie Howe admits facing  long and hard  Newcastle United decision this month as cup hero hails never say die attitude",
  "date": "20260112T123000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe admits facing 'long and hard' Newcastle United decision this month as cup hero hails never say die attitude\nAaron Ramsdale has been waiting a long time to make his mark at Newcastle United. On Saturday, five months into his loan spell from Southampton, the moment arrived.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nRamsdale saved three penalties in the Magpies’ shootout victory over Bournemouth in the FA Cup third round at St James’ Park.\nIt was another game to test the patience and blood pressure of Newcastle fans. Only days earlier, they witnessed their side snatch victory in a seven-goal thriller against Leeds United in the 12th minute of stoppage time.\nHarvey Barnes was the hero then, and he thought he was again, scoring to make it 3-2 at the end of extra time, only for Marcus Tavernier to pop up at the other end seconds later. Suddenly, Ramsdale was in the spotlight and Newcastle needed a hero. He duly delivered.\nAaron Ramsdale hails Newcastle United 'Goalkeeping Union'\nVictory is welcome, especially as it required another late rescue mission, with Anthony Gordon’s late penalty forcing extra time after a hectic second half, but it came at a cost. Newcastle face Manchester City in the Carabao Cup semi-final first leg on Tuesday and will now do so with tired legs and minds. Tino Livramento is also out after picking up a hamstring injury.\nWith every passing game, Newcastle’s soft centre becomes more and more worrisome. Yet they are still in both domestic cup competitions, remain in control of their Champions League destiny and sit sixth in the Premier League. Ramsdale says the team “sticks together” and the fans drive them on.\n\"We never say die”, he said after the game. “It's four wins on the bounce, late goals. We've done a completely new way today of going to penalties. It probably would have been nice to have got it done in the 90 minutes with the game on Tuesday, but again, it just shows we all stick together. We dig each other out in tough times.\n\"The crowd at this stadium, when we need it, is phenomenal and that's shown again as well as in the week.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nEddie Howe admitted he had mixed emotions after progressing. Newcastle have not had a midweek free since August and face 10 games in the next 34 days; going all the way was the last thing they needed.\n“The one thing we didn't want was extra time, we were well aware of that before the game, but we're 2-1 down with a couple of minutes left, so at that moment, we wanted extra time, we wanted to stay in the competition,” Howe said.\n“We knew as soon as we scored that goal that it was going to be an extra burden on the players. Some players, we didn't want them to go through that – Sven Botman would be one, Malick Thiaw, we didn't want them to go through the 30 minutes, Sandro Tonali was having cramp issues, so that's why I say there's a cost for us going through today.\n“But at least we did go through, at least there's a positive to come from it, and now I need to think long and hard about the team for Tuesday night.\"\nManchester City represents the latest huge occasion in Newcastle’s modern history as they look to defend their Carabao Cup trophy. Despite making the headlines, Ramsdale is far from guaranteed to keep his place with Nick Pope fighting to play, though he has played in all domestic cup matches this season.\nWhatever happens, he insists there is no rivalry with Pope or any goalkeeper at Newcastle. He understands the competition and is enjoying working with his England team-mate and John Ruddy.\n\"[It is the] best ever [goalkeeper’s group],” he added. “The amount of quality, age and experience in the group [is impressive]. Big Fraser Forster [former Newcastle and Celtic goalkeeper] has just signed for Bournemouth and as we were walking out, he said, ‘What a group you've got’. He knows me, Popey and John.\n\"We spend a lot of time together on the training pitch, off the training pitch. Everyone's there for each other.\n\"Popey was making sure at the end there I had whatever I needed. And you will never understand what a goalkeeper goes through unless you're a goalie.\n\"People say that you can't be happy for another goalie but you actually can. We made the decision to do this when we were eight, nine years old and we all knew what the situation was. The Goalkeeper Union at this place is strong.\nBut now Ramsdale hopes he has made strides at Newcastle, a place he says he is “in love with”. With so much football still to be played, he could have many more opportunities to secure a permanent move to Tyneside.\n\"I knew the situation coming in,” he said. “I had a fight on my hands with Nick. There were no promises that I would even get in the team. Obviously, with Nick having a little injury it brought me to the forefront.\n\"Now there's some little sort of indent in club’s history. It's not a massive one, it's only the third round of the FA Cup, but I've helped the team in this instance to get through and I look forward to more days like this, hopefully, for me at this football club in the future as well.\n\"I fell in love with it before I even signed. Playing up here, the atmosphere, My personality with the fans allows me to be myself and allows me to have the energy and attitude I have. So I didn't need to play or experience it - I already felt it.”\nIt was another pulsating afternoon, so typical of Newcastle this season. Now they walk, battered and bruised, into another big game, and they’ll just keep coming. If they are to compete on all fronts, they need to find easier ways to win.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1145,
  "scraped_at": "2026-02-14T02:09:43.012920",
  "_text_extracted": true
}