{
  "article_id": "2a2218782b7e",
  "url": "https://metro.co.uk/2025/04/26/watch-barcelona-vs-real-madrid-tv-channel-live-stream-22976972/",
  "title": "How to watch Barcelona vs Real Madrid : TV channel and live stream | Football",
  "date": "20250426T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bitter rivals Real Madrid and Barcelona meet tonight in the final of the Copa del Rey.\nBoth teams are still in with a chance of a domestic double, while Hansi Flick’s men also remain in Champions League contention and have a semi final first leg against Inter to look forward to next week.\nFor now, however, attention centres on tonight’s showdown which takes place at the Estadio de La Cartuja in Seville.\nWith tensions running high, following a row over who will referee the match Carlo Ancelotti’s men go into the final seeking to salvage an underwhelming campaign.\nReal are four points adrift of Barcelona in LaLiga with five games to go and were last week knocked out of the Champions League by Arsenal.\nBarca have won the two previous meetings between the clubs this campaign – 4-0 at Santiago Bernabeu and 5-2 in the Spanish Super Cup final in Saudi Arabia.\nBarcelona vs Real Madrid Team News\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBarcelona boss Hansi Flick has backed Ferran Torres to fill the void left by injured top scorer Robert Lewandowski.\nLewandowski, who has hit 40 goals in all competitions this term, is sidelined with a thigh issue sustained in last weekend’s 4-3 victory over Celta Vigo.\nFormer Manchester City forward Torres is the joint leading scorer in this season’s Copa del Rey, having struck five times, including a hat-trick in the 5-0 quarter-final victory away to Valencia and the decisive goal in the two-legged semi-final success against Atletico Madrid.\n‘Ferran in the cup, in every game, has shown that he can play as a (number) nine,’ Flick told a press conference. ‘He knows how we want to play in this position.\n‘We want to win the title and we want to give everything for that. We know it will be tough and they have a fantastic team. We are up against one of the best sides in the world.’\nReal, meanwhile, will be boosted by the return of Kylian Mbappe. The France international striker hasn’t feautred since limping off against Arsenal last week.\nHow to watch Barcelona vs Real Madrid\nViewers in the UK will be able to watch the game which will be will be broadcast on Premier Sports 1. Coverage starts at 8.55pm GMT ahead of an 9pm kick-off.\nWill Real Madrid vs Barcelona go ahead?\nReal Madrid have branded comments made by match officials set to take charge of their Copa del Rey final against Barcelona ‘unacceptable’ after the referee broke down in tears at a press conference.\nIn a strongly-worded statement, the reigning LaLiga champions suggested referee Ricardo de Burgos Bengoetxea and VAR Pablo Gonzalez Fuertes should be removed from Saturday’s El Clasico in Seville.\nReal later announced they had ‘never considered refusing to play’ the silverware showdown at Estadio La Cartuja in response to media ‘rumours’.\nBilbao-born De Burgos Bengoetxea cried in front of the media as he revealed the pressure Real’s television channel has put referees under.\nThe 39-year-old is the latest in a line of officials to be criticised on Real Madrid TV this season.\nMore Trending\nA video released this week pointed out the win percentages of Barca and Real when he has taken charge of their games, the fact he has never refereed in the Champions League or FIFA tournaments and his supposed mistakes.\nDe Burgos Bengoetxea said ‘it’s not right what we are going through’ during an emotional press conference, while VAR Gonzalez Fuertes warned officials could take action over the broadcasts.\nReal seemingly boycotted their official media appointments on Friday before complaining of ‘clear and manifest animosity and hostility’ towards the club from referees but that match will go ahead.\nMORE: Luis Enrique sends message to Arsenal and Mikel Arteta after shock PSG defeat\nMORE: Aaron Ramsdale picks out ‘crucial battle’ in Arsenal’s Champions League semi-final with PSG\nMORE: Wojciech Szczesny fails ‘fight’ to quit smoking 10 years after Arsenal incident",
  "word_count": 703,
  "scraped_at": "2026-02-14T02:09:01.857688",
  "_text_extracted": true
}