{
  "article_id": "2a24c4a8ee26",
  "url": "https://www.newsandstar.co.uk/features/23632296.james-trafford-cumbrian-farm-premier-league/",
  "title": "James Trafford : from a Cumbrian farm to the Premier League",
  "date": "20230705T101500Z",
  "domain": "newsandstar.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "He’s about to become the county’s most expensive footballer – and is now a European champion.\nAnd it all started for James Trafford on a Cumbrian farm.\nThe goalkeeper is one of English football’s rising stars, hero for England Under-21s in the European Championships final and on the brink of a £19m Premier League move.\nTrafford, who is close to joining top-flight newcomers Burnley from Manchester City, has enjoyed a steady rise to the top since his boyhood days in his home county.\nThe son of James and Alison Trafford and brother of Charlotte – a farming family from Greysouthen – James junior went to Dean Primary School and was initially an outfield player at Cockermouth Football Club and when he had academy trials at Carlisle United.\n“I was always a midfielder or striker,” Trafford said last year. “Then there was this session when they only had one goalie, and asked if anyone wanted to go in goal.\n“My dad had a pair of gloves in the car and I was like, ‘Yeah, I’ll go in goal’.”\nTrafford reckons he would not have made the grade as an outfielder – but his goalkeeping ability was instantly clear.\nSo much so that, by the time he was 12, Manchester City – who’d been watching him since he was nine, according to his then Carlisle coach Ben Benson – made their move.\nIt meant that Trafford, after one year in secondary school at Cockermouth, was going to see his life change dramatically.\nUpon signing for City, he was enrolled in St Bede’s College, where the Premier League champions educate their young players – while Trafford moved away from home at such a young age, to live with a host family, later moving into academy digs in his teens.\nThe News & Star visited the Traffords as the 12-year-old keeper prepared to make his exciting move to the Premier League. He posed for photos and dived for shots between the goalposts in the garden where he always practiced.\n“For a farmer’s lad from Greysouthen to end up at Man City... we’re extremely proud of him,” said dad James that day.\n“He helps us get the sheep into the field – it’s one of his favourite jobs – but I’ve never said that he must farm. You’ve got to let them go their own way, and he’s been focused on football from such a young age.”\nMum Alison added: “At first I wasn’t happy at the thought of him being away from home, but he will come back every Friday and have plenty of time to spend with his friends and family.\n“We’re very comfortable with how he will be looked after at Man City. It’s something he really wants to do. You can’t hold him back.”\nTrafford himself was thrown a surprise party by his Cockermouth School pals before he left, and the youngster spoke of his excitement at his big move.\n“The night dad told me lots of clubs were watching me [Newcastle United and Manchester United had also been interested], I didn’t believe him,” he said. “But I’m not nervous. I’m looking forward to the experience.”\nThere were inevitable headlines about Young Trafford joining the Old Trafford club’s rivals – while the fledgling goalkeeper thrived at City.\nAmong the legions of young players such a club takes on, he kept rising through the age levels, representing City domestically and overseas, also playing for England youth teams, eventually earning a youth team scholarship and then professional status.\nThe last three years have been landmark spells in Trafford’s career. In 2020/21 he found himself on City’s bench for FA Cup and Champions League games, earning the praise of (and saving penalties in training from) Pep Guardiola and enjoying the company and guidance of another Cumbrian keeper in Scott Carson.\nThe 2021/22 season then brought a professional debut, on loan in League One with Accrington Stanley. That was followed by a half-season switch to Bolton Wanderers, where his reputation grew as one of the country’s most promising young keepers.\nThat was underlined in a full-season loan at Bolton in 2022/23, where Trafford kept 26 clean sheets in 52 games, helped the Trotters to the play-offs and the Papa John’s Trophy, and also pushed his way to the forefront with England’s Under-21s.\nAlong the way the Cumbrian farmer’s lad has never forgotten his roots and has often kept in touch with the News & Star as he has progressed.\nOne such time was last summer, before Bolton’s pre-season friendly at Carlisle United. He recalled his childhood days training with the Blues’ academy at Dalston’s Caldew School – “the coldest place on earth” – and, amid his football ambition, insisted the game was not the be-all and end-all.\n“I just go with the flow,” he said. “I’ve always just played footy ‘cos I enjoy it.\n“I probably got quite serious when I was 15 or 16 and realised how good I was. But even now, if I didn’t still love it I’d just go and work on the farm with my dad.\n“I can live off not too much money, unlike some people. I don’t do too much with my money. I spend most of it on food. Ice cream – I love ice cream. With this new contract [he signed a three-year deal at Man City last year], I’ll just buy more ice-cream...”\nThe latter comment went viral, but since then it is Trafford’s goalkeeping that has dominated people’s thoughts – and on Saturday he became a national hero, saving an injury-time penalty as England defeated Spain in the European Championships final in Georgia, having not conceded in all six of their tournament games.\nHis performances in the championships, which married sharp shot-stopping with distribution and positioning which are the hallmarks of his Man City upbringing, have seen Trafford described as a breakout star of the Euros: something which the finale renders totally undeniable now.\nIt has all been enough, clearly, to consolidate the interest of a man as illustrious as Vincent Kompany, who wants Trafford at Burnley. Reports last week suggested a deal of around £15m, potentially rising to £19m, had been agreed, with just the finer details remaining to be finalised, Burnley appearing to have beaten other suitors in the top two divisions to the punch.\nOnly a decade ago, he was helping his dad herd sheep and clutching onto turkeys at the auction marts. Now he's an England hero for all-time and getting ready to hold onto shots on the glittering stage of the Premier League: a young Cumbrian doing his family and home county proud, and with an ever-brighter future opening up.",
  "word_count": 1111,
  "scraped_at": "2026-02-14T02:07:08.870510",
  "_text_extracted": true
}