{
  "article_id": "2a2c78b7609a",
  "url": "https://www.uefa.com/uefachampionsleague/news/0280-17d1170f7f71-1d68f60751c4-1000--highlights-report-city-ease-through-to-last-four/",
  "title": "Bayern 1 - 1 Man City ( agg : 1 - 4 ): Haaland scores again as City ease through to Champions League semi - finals",
  "date": "20230419T234500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern 1-1 Man City (agg: 1-4): Haaland scores again as City ease through to Champions League semi-finals\nWednesday, April 19, 2023\nArticle summary\nThe Champions League's top scorer Erling Haaland – who else? – struck again as Man City drew 1-1 with Bayern to complete a 4-1 aggregate win.\nArticle top media content\nArticle body\nMan City are through to the UEFA Champions League semi-finals for the third season running after a 1-1 draw in Munich completed a 4-1 aggregate triumph against Bayern.\nKey moments\n37': Haaland fires penalty over bar\n57': Norwegian finishes swift City counter\n83': Kimmich converts spot kick for Bayern\nMatch in brief: Mixed fortunes for Haaland\nLooking to become only the fifth team in Champions League history to overturn a first-leg deficit of three goals or more, Bayern immediately took the game to City. It was not until the 17th minute that they carved out a clear opening, however, Leroy Sané racing in behind only to dink wide with just Ederson to beat.\nCity were in the unusual position of ceding possession, but their patience looked to have paid off when Dayot Upamecano was adjudged to have handled inside the penalty area. Erling Haaland – he of 47 club goals this season, no less – stepped up, but blazed over.\nThough Kingsley Coman and Eric Maxim Choupo-Moting also threatened as half-time loomed, City stood firm. They might have pulled further clear early in the second half had Haaland applied a more emphatic finishing touch to a smooth counterattack from his side.\nBayern weren't \"surfing the momentum\" as Thomas Tuchel had hoped, but they were still in this. Or so they thought. Just 16 seconds after Coman had flashed across goal, Kevin De Bruyne slotted to Haaland, who danced past Upamecano before stroking the ball beyond Yann Sommer.\nBayern continued to pour forward and did eventually pull one back when Joshua Kimmich slotted his spot kick down the middle after Manuel Akanji had been penalised for handball, but time was up.\nPlayStation® Player of the Match: Kevin De Bruyne (Man City)\n\"An amazing display. His vision and awareness is top level. He dictates the game for City. A joy to watch.\"\nUEFA Technical Observer panel\nPhilip Röber, Bayern reporter\nHave City conceded as many chances in a match this season, or at all during the reign of Pep Guardiola? Bayern's game ticked all the right boxes, except for their finishing – for the fifth successive match, they have failed to score more than one goal. They will wonder what might have been, but there were positive signs regarding how Thomas Tuchel will shape his side for the rest of this season and beyond.\nMatthew Howarth, Man City reporter\nThis was a very different City performance to the one fans have grown accustomed to witnessing in the Champions League – conservative, even cautious at times – but with Haaland in their ranks the visitors were always going to create opportunities to add to their healthy first-leg advantage. The Norwegian missed his first-half spot kick, but he made amends in emphatic style after the interval to end Bayern's hopes of an unlikely comeback.\nJoleon Lescott, BT Sport\n\"This was a massive result, massive performance. City should have won but this was an outstanding display. They were resilient and showed they don't always have to dominate possession.\"\nReaction\nJosep Guardiola, Man City coach: \"Of course, three years in a row in the semi-finals of the Champions League. The finishing from Erling was really, really good. He is so young. The experience that we have in this competition, the players feel it a lot, they want to do really well.\"\nBernardo Silva, Man City midfielder: \"Now the team are very consistent and we feel we have a chance in every competition. When you're a little kid you work to get to these moments as a football player and we're going to enjoy it.\"\nThomas Tuchel, Bayern coach: \"I think we had City on the hook again, even more so than in Manchester. But, like last week, we never had that moment of luck which you need to turn this around. I am very satisfied with how we performed.\"\nJoshua Kimmich, Bayern captain: \"It is really annoying that we didn't take the lead with all the chances that we had. I would have liked to see how this match had gone if we had made it 1-0 in the first half.\"\nKey stats\n- Haaland is the fastest (27 appearances) and youngest (22 years 272 days) player to score 35 Champions League goals. He has struck 48 goals for City in his debut season.\n- This result ended City's ten-game winning streak in all competitions (F38 A5).\n- Haaland had successfully converted all seven of his penalties for City prior to this miss from the spot.\n- The Norwegian international is 2022/23 Champions League top scorer with 12 goals, eight of which have come against German opposition.\n- City will face Real Madrid in the Champions League semi-finals for the third time in just their fourth last-four appearance.\n- Bayern had won 16 of their previous 18 Champions League home games, including all four this season without conceding a goal.\n- Kimmich had not scored a Champions League goal since October 2020.\nFantasy star performers\nKevin De Bruyne – 8 points\nJoshua Kimmich – 7 points\nNathan Aké – 6 points\nLine-ups\nBayern: Sommer; Pavard (Stanišić 77), De Ligt, Upamecano, João Cancelo (Davies 63); Kimmich, Goretzka; Sané (Mané 63), Musiala (Müller 71), Coman; Choupo-Moting (Tel 71)\nMan City: Ederson; Akanji, Rúben Dias, Aké (Laporte 66); Stones, Rodri; Bernardo Silva, De Bruyne (Walker 88), Gündoğan, Grealish; Haaland (Álvarez 84)\nWhat's next?\nMan City will face holders Real Madrid in the semi-finals, playing the first leg away from home on Tuesday 9 May. The Manchester return will take place on Wednesday 17 May.",
  "word_count": 980,
  "scraped_at": "2026-02-14T01:50:29.479481",
  "_text_extracted": true
}