{
  "article_id": "2a2f67eb94d1",
  "url": "https://www.marketscreener.com/quote/stock/AMAZON-COM-INC-12864605/news/Amazon-com-2024-Letter-to-Shareholders-49584589/",
  "title": "Amazon com : 2024 Letter to Shareholders",
  "date": "20250410T103000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "|\nMarket Closed -\nNasdaq\n04:00:00 2026-02-13 pm EST\n|\nAfter hours\n04:21:15 pm\n|\n|\n198.79 USD\n|\n-0.41%\n|\n|\n198.72 |\n-0.03%\n|\nAmazon com : 2024 Letter to Shareholders Published on 04/10/2025\nat 06:10 am EDT - Modified on 04/10/2025\nat 06:11 am EDT\nPublicnow\nDear Shareholders:\n2024 was a strong year for Amazon.\nOur total revenue grew 11% year-over-year (\"YoY\") from $575B to $638B. By segment, North America revenue increased 10% YoY from $353B to $387B, International revenue grew 9% YoY from $131B to $143B, and AWS revenue increased 19% YoY, from $91B to $108B. For perspective, just 10 years ago, AWS revenue was $4.6B; and in that same year, Amazon's total revenue was $89B.\nAmazon's operating income in 2024 improved 86% YoY, from $36.9B (an operating margin of 6.4%) to $68.6B (an operating margin of 10.8%). Free Cash Flow, adjusted for equipment finance leases improved from $35.5B in 2023 to $36.2B.\nApart from the financial results, we made our customers' lives meaningfully better and easier. In our Stores business, we substantially expanded selection, continued lowering prices (independent research firm, Profitero, found Amazon the lowest-priced online U.S. Retailer for the eighth year in a row), and for the second year in a row, we shipped at record speed to our Prime members. AWS launched a slew of new infrastructure and AI services that make it even easier to build remarkable customer experiences, including our latest custom AI silicon (Trainium2), a new set of frontier foundation models in Amazon Nova, and significant expansion of available models and features in our leading Generative AI (\"GenAI\") services Amazon SageMaker and Amazon Bedrock. Prime Video continued to offer compelling original shows, including new seasons for Fallout, Reacher, The Boys, and The Lord of the Rings: Rings of Power, movies like Road House, The Idea of You, and Red One, live sports like Thursday Night Football and UEFA Champions League in Europe (with the NBA and NASCAR coming in 2025), and new selection, highlighted by Apple TV+ joining Prime Video Channels. We launched a series of new Kindle devices that included a new color version, a larger Scribe option, and our fastest Paperwhites ever (the collection of which drove the highest Kindle unit sales for a single quarter in over a decade). And, we continued to add more selection, price transparency, and same day shipping for Amazon Pharmacy.\nThese accomplishments are a subset of what the team launched in 2024, but represent a lot of invention, hard work, and thoughtful execution across Amazon. I'm thankful for my teammates and their delivery this past year (some of which you can see in our 2024 results, others of which won't be visible for the next\nfew years).\nA Why Culture\nEvery year in my annual letter, I try to share insight into what makes Amazon tick. At the highest level, we're aiming to be Earth's most customer-centric company, making customers' lives better and easier every day. This is not easy to do in general, let alone year after year. In fact, it's actually quite hard, especially with the rapid rate of change in technology, customer habits, and new products from large and small companies alike. If we want to have a chance at succeeding in our mission, we have to constantly question everything around us.\nWe've had this long-held philosophy at Amazon about two-way and one-way door decisions. A two-way door decision is one where if you get the decision wrong, you can walk back through that door, revert to where you were, and there are few (if any) ramifications. You can make these decisions quickly and locally. A one- way door decision is one where it's quite difficult (if not impossible) to walk back through that door if\nyou get the decision wrong, so these decisions are made more methodically. But, both of these constructs assume the door is unlocked. A lot of invention is about trying to open doors that have historically seemed bolted shut. And, over the past 30 years, we've found one of the most important keys to unlock these doors has been a simple question: \"Why?\"\n\"Why does this customer experience have to be this way?\" \"Why can't it be better?\" \"What are the constraints- why must we accept them?\" \"Why can't we invent around that?\" \"Why will it take so long to get to customers?\" Why?\nMy Dad has told me that I was the kind of kid who kept asking why, perhaps to an annoying extent. He's also reminded me how shortly after I joined Amazon in 1997, he tried to persuade me to work somewhere more traditional (and on the east coast closer to family)-only to realize that I'd already found the perfect fit.\nThat's because Amazon is a Why company. We ask why, and why not, constantly. It helps us deconstruct problems, get to root causes, understand blockers, and unlock doors that might have previously seemed impenetrable. Amazon has an unusually high quotient of this WhyQ (let's call it \"YQ\"), and it frames the way we think about everything that we do.\nStarting in 1995, we asked why can't we offer customers every in-print book?\nThen, we asked, why limit ourselves to in-print-why can't we also offer every out-of-print book?\nWhy not offer every book, ever written, in any language-all available within 60 seconds on a device that's light and fits in the palm of your hand (Kindle)?\nWhen we offer reviews, why must they all come from professional \"experts?\" Customers are great resources and will be brutally honest. Why not include customer reviews even if they sometimes dissuade a purchase?\nWhy not offer more than Books? What about Music, Video, Electronics, Tools, Kitchen, Apparel, Home Furnishings?\nWhy not practically everything?\nWhy should we be the only sellers of these items? Millions of third-party merchants and small sellers offer similar or unique items. Why not let customers choose the selection, price, and delivery speed they prefer from among these millions of sellers?\nAfter struggling for a couple years to create awareness for sellers' selection, we asked ourselves why not show their selection on the same product detail pages as our first-party selection (where all the traffic was)?\nWhy not allow our sellers to also store items in our fulfillment network, enable those items to have fast, Prime delivery, and fulfill those items for sellers (a program called Fulfillment by Amazon)?\nWhy not experiment with relevant advertisements in our store to expose customers to new sellers and items (versus only what our algorithms might surface based on past purchases)?\nWhy does every company need their own capital-intensive datacenters and infrastructure? Why should every development team keep reinventing services like compute, storage, database, and analytics? Why should builders spend 80% of their time on the undifferentiated heavy lifting vs. their unique customer experience? Why not build a set of services (AWS) to solve that for internal and external builders?\nWhy do I have to buy a physical video to watch a movie? Why do I need cable or linear TV to watch amazing TV shows (Prime Video)?\nWhy can't I get my Prime shipping benefits on other websites than just Amazon (Buy with Prime)?\nI can go on. But, you get the idea. Every one of these Whys have led to significant invention, and every one of them have made customers' lives better and easier. Some of these seem obvious now. But at the time, these were provocative questions that required curiosity, risk-taking, experimentation, and persistence to make these into success stories.\nEnabling a Why Culture\nIf you believe having high YQ is critical to inventing for customers, how do you enable it? In my opinion, it's not solved with one mechanism. It needs to be built deeply into your culture and leadership team, and has to be fiercely protected over time if you're lucky enough to be successful. Here are a few of the strategies we employ.\nCreate leadership principles that set the tone. We have 16 Leadership Principles that guide our behavior. They're all integral underpinnings to our YQ, but I'll touch on three in particular:\nAre Right a Lot\n\"Leaders are right a lot. They have strong judgment and good instincts. They seek diverse perspectives and work to disconfirm their beliefs.\"\nWhen we first instituted this leadership principle, some people incorrectly assumed it meant that the best leaders were the ones whose ideas were chosen (i.e. they were right, a lot). It led to some people overly digging in and fighting for their ideas. There's nothing wrong with pushing for what you believe. But, in my experience, the best leaders want to hear others' views. They don't wilt or bristle when challenged; they're intrigued. Effective leaders change their minds when presented with new compelling information (which makes it ironic how people dismiss politicians as \"flip-floppers\" when they change their position). Ultimately, leaders are responsible for getting to the best answer for customers, regardless of whose original idea is chosen.\nLearn and be Curious\n\"Leaders are never done learning and always seek to improve themselves. They are curious about new possibilities and act to explore them.\"\nIn the nearly 28 years I've been at Amazon, the biggest difference in the relative growth of companies and individuals has been their aptitude to learn. At a certain point, some leaders seem to lose their thirst to learn. It's hard to know the reason in each case, but it's as if some people find it too exhausting, too time- consuming, or too threatening to not have all the answers. Regardless, the day we stop learning at Amazon is the day we risk undermining what we're capable of building in the future. People with high YQ are always curious how they can get better, become wiser, and incorporate their new knowledge into better customer experiences.\nHave Backbone; Disagree and Commit\n\"Leaders are obligated to respectfully challenge decisions when they disagree, even when doing so is uncomfortable or exhausting. Leaders have conviction and are tenacious. They do not compromise for the sake of social cohesion. Once a decision is determined, they commit wholly.\"\nWe don't just empower people to challenge one another, we obligate them to do so if they disagree. Questioning, asking the hard questions, forcing the discussion (versus silently thinking a mistake is being made) is necessary to getting to better answers for customers. \"I told you so\" has no currency at Amazon. It's also important to focus on the second part of this leadership principle: disagree and commit. While constructive debate is useful; at some point, teams need to make a decision and take action. From that point on, everybody-even those who advocated for a different solution than the one chosen-must commit to making that decision a success. That means the team goes all in-no pocket-vetoing nor hedging between other options. That's the only way we can preserve speed and confidence that if an issue is heavily debated, the team will ultimately pull together.\nCreate norms that support the Why. Similar to how our Leadership Principles guide our behavior, we've built norms over the years that guide how we work. Here are a few examples:\nNarratives. We stopped presenting information to each other inside the company via powerpoint in 2004. Given how high level powerpoints are, we found that powerpoint was easy for the presenter to prepare, but harder for the audience to understand the substantive issues. Instead, we moved to writing narratives with a maximum of six pages in the body. Narratives are harder for the presenter (it's hard to write a thoughtful six- page document that highlights the key issues in enough detail to be crisp and clear), but much easier for the audience to engage with and ask the right Why questions.\nWorking backwards documents. When we build services or features, before we start coding, we write Press Release and Frequently Asked Questions (\"FAQ\") documents. The Press Release is intended to ensure that what we're proposing building is remarkable to customers (so we don't get to launch and ask \"wait, why did we think customers would find this interesting?\"). And, the FAQ is designed to force ourselves to ask the\nhard questions about which customers will use this capability, what they'll like most, what they'll be most disappointed with, why are we drawing the launch line where we are, why is it better than current alternatives, how should we think about pricing, what pricing dimensions we recommend, and why have we made the architectural decisions we have. The Press Release and FAQ are how we work backwards from customers, and how we push ourselves to ask questions customers would if they were in these meetings.\nBe together whenever possible. There are many paths that can lead to breakthrough innovation. Occasionally, a lone genius comes up with a brilliant idea, and everyone else simply executes it. While that can work, it's not how we typically operate. Amazon invention is deeply collaborative. It starts with a seed of an idea, then a group of smart, mission-driven people refine, challenge, and build on it together. And, we've found that this process is far more effective in person than remote. Of course, you can invent with everybody remote (and some cultures seem to prefer that). However, in my experience, it doesn't compare to being in the same room. The energy, the pace, the spontaneous brainstorming, the willingness for people to jump in, the way ideas evolve in real time, and the post-meeting iteration is much better when in the same room-and yields better outcomes for our customers and teams. With what's happening in AI right now, and the likelihood that every customer experience we've ever known will be reinvented, there has never been a more important time, in my opinion, to optimize to invent well.\nTolerating messy meetings. It's hard to \"schedule\" innovation. You can't book 60 minutes to invent Amazon Prime, or AWS, or Alexa+, or Fulfillment by Amazon, or Regionalization in our Fulfillment Network, or Project Kuiper. These inventions are borne out of somebody asking why we can't change what's possible for customers, and then they take on a life of their own, often meandering down multiple dead ends before getting to a final destination. This might bother some regimented folks. But, when we're inventing, we accept the process being beautifully imperfect.\nOperate like a startup (in our case, the world's largest startup). We strive to operate like the world's largest startup. What does that mean?\nFirst, whatever we're contemplating building has to be focused on solving a real customer problem or meaningfully improving a customer experience. Companies can get off track prioritizing technology because they're excited about the technology. Great startups are on a mission to change what's possible for customers.\nSecond, we have a disproportionate need for builders. These are inventors. They're people constantly dissecting customer experiences, even ones that seem pretty good today, and asking why they can't be better. They're divinely discontent (maybe annoyingly so for team members proud of what they've previously built), and never feel like the job is done.\nThird, we want owners. One of the strengths of Amazon over the first 30 years is that we've hired really smart, motivated, inventive, ambitious people who have been great owners. And, that means that our teammates are constantly asking themselves, \"What would I do if this was my own money?\" \"What would I do if I started this company and I was the majority owner?\" \"Hey, I know I've only been asked to own a part of this project, but I'm not sure if the other parts are being driven well-should I stick my nose into this and make sure or just trust somebody's got it?\" Owners feel accountable. They care deeply about the quality and effectiveness of what they own, and view the company's mission as their mission (we want missionaries, not mercenaries). That's part of what our effort to increase the ratio of individual contributors versus managers is about. We want flatter organizations where our owners doing the work feel like they own the two-way door decisions (which are the vast majority), can move rapidly, and are fully accountable for solving the Whys of their customer experiences.\nFourth, speed disproportionately matters for every business, in every industry, at all times. It's a false binary to argue that you can move fast ordeliver high standards. If you want to be fast, you can be fast, and still be high quality. We've done it for many years (though we can still be faster). Speed is a leadership decision. The leadership team has to believe it's a priority, reinforce it constantly, organize and remove structural barriers, and build in modular ways that enable pace. But, speed does not happen unless the entire company and culture embrace it. We have this persistent feeling, throughout the company and in every business in which we operate, that there are closing windows all around us. We operate in fiercely competitive market segments, with highly talented, well-funded, ambitious companies at every turn. Customers are always looking\nfor something better. We spend a lot of time identifying how to unlock these experiences for them as quickly as possible, and know if we don't, somebody else will.\nAnother way to gain speed is to eliminate bureaucracy. There is a difference between process and bureaucracy. When you're running something at scale, you need mechanisms to deliver the right experience and constant improvement for customers. However, as companies grow and add more managers, unneeded processes get layered on that add little value. Last fall, I asked teammates across the company to send me bureaucracy examples that they were experiencing. I've received almost 1,000 of these emails, and read every single one. Builders hate bureaucracy. It slows them down, frustrates them, and keeps them from doing what they came here to do. As leaders, we don't always see the red tape buried deep in our organizations, but we can sure as heck eliminate it when we do. We've already made over 375 changes based on this feedback. We need to move fast, and we are committed to rooting out bureaucracy that ties up time and dispirits our teammates.\nFifth, you have to be scrappy. As businesses succeed and get larger, they sometimes forget how things got started. We built Amazon Simple Storage Service (S3) with 13 people; Amazon Elastic Compute Cloud (EC2) with 11 people. Managers can confuse themselves that the way to grow and get ahead is to accumulate large teams. Historically, we've had periods where we've allowed this thinking to hold sway. But, it's not the way we fundamentally think about building teams and products, and have adjusted to reflect that again. Our best leaders get the most done with the least number of resources required to do the job. They pride themselves on being lean.\nSixth, you have to be willing to take risks. This sounds easier than it is. You need clever enough people to identify worthwhile bets. And if you have these inventive, ambitious builders with high standards, they're not used to failure. They suspect external (and maybe internal) ridicule awaits them if they try something very different that doesn't work out. So, people often play it safe. But, you can't achieve something extraordinary for customers by playing \"not to lose.\" If your Whys take you down an invention path that delivers an experience that doesn't look like what's been done before, let customer obsession be your compass. You rarely, if ever, change the world by doing the same thing as everybody else.\nAnd finally, you have to care most about delivering compelling results for customers. It's not how charismatic you are. It's not whether you're really good at managing up or sideways. What matters is what we actually get done for customers. That's what we want to reward.\nNext generation Whys\nWhile the team and I feel quite optimistic about the progress and potential of our existing businesses, we have plenty of new Whys we're asking. Below are a few of them and some quick thoughts.\nWhy is AI so important? Will it really have as much impact as some claim and when?\nGenerative AI is going to reinvent virtually every customer experience we know, and enable altogether new ones about which we've only fantasized. The early AI workloads being deployed focus on productivity and cost avoidance (e.g. customer service, business process orchestration, workflow, translation, etc.). This is saving companies a lot of money. Increasingly, you'll see AI change the norms in coding, search, shopping, personal assistants, primary care, cancer and drug research, biology, robotics, space, financial services, neighborhood networks-everything. Some of these areas are already seeing rapid progress; others are still in their infancy. But, if your customer experiences aren't planning to leverage these intelligent models, their ability to query giant corpuses of data and quickly find your needle in the haystack, their ability to keep getting smarter with more feedback and data, and their future agentic capabilities, you will not be competitive. How soon? It won't all happen in a year or two, but, it won't take ten either. It's moving faster than almost anything technology has ever seen.\nOK, I buy AI is big; but why invest this much this quickly?\nFundamentally, if your mission is to make customers' lives better and easier every day, and you believe every customer experience will be reinvented by AI, you're going to invest deeply and broadly in AI. That's why there are more than 1,000 GenAI applications being built across Amazon, aiming to meaningfully change customer experiences in shopping, coding, personal assistants, streaming video and music, advertising, healthcare, reading, and home devices, to name a few. It's also why AWS is quickly developing the key primitives (or building blocks) for AI development, such as custom silicon AI chips in Amazon Trainium to provide better price-performance on training and inference, highly flexible model-building and inference services in Amazon SageMaker and Amazon Bedrock, our own frontier models in Amazon Nova to provide lower cost and latency for customers' applications, and agent creation and management capabilities.\nThere is also substantial capital investment required. In AWS, the faster demand grows, the more datacenters, chips, and hardware we need to procure (and AI chips are much more expensive than CPU chips). We spend this capital upfront, even though these assets are useful for many years (in the case of datacenters, for at least 15-20 years). We only start monetizing this capital investment many months after we spend the capital, and over many years-which leads to attractive long-term FCF and ROIC (as people have seen in AWS over the last several years). But in periods, like now, of unusually high demand (our AI revenue is growing at triple digit YoY percentages and represents a multi-billion-dollar annual revenue run rate), you're deploying a lot of capital. We continue to believe AI is a once-in-a-lifetime reinvention of everything we know, the demand is unlike anything we've seen before, and our customers, shareholders, and business will be well-served by our investing aggressively now.\nWhy do chips and AI have to be this expensive for customers?\nAI does not have to be as expensive as it is today, and it won't be in the future. Chips are the biggest culprit. Most AI to date has been built on one chip provider. It's pricey. Trainium should help, as our new Trainium2 chips offer 30-40% better price-performance than the current GPU-powered compute instances generally available today. While model training still accounts for a large amount of the total AI spend, inference (which are the predictions or outputs of the models) will represent the overwhelming majority of future AI cost because customers train their models periodically, but produce inferences constantly in large-scale AI applications. Inference will become another building block service, along with compute, storage, database, and others. We feel strong urgency to make inference less expensive for customers. More price-performant chips will help. But, inference will also get meaningfully more efficient in the next couple of years with improvements in model distillation, prompt caching, computing infrastructure, and model architectures. Reducing the cost per unit in AI will unleash AI being used as expansively as customers desire, and also lead to more overall AI spending. It's like what happened with AWS. Revolutionizing the cost of compute and storage happily led to lower cost per unit, and more invention, better customer experiences, and more absolute infrastructure spend.\nWhy have personal assistants not yet taken off ? How can Alexa help?\nA great personal assistant can answer virtually any question andget things done on your behalf. There have been no digital solutions that can do both yet. That is, until Alexa+ arrived. Alexa+ is not only comparably intelligent to the leading chatbots, but can take a plethora of real actions for you. She can play music, play video, move media from one of your devices to another, set alarms and timers, control your smart home, order across hundreds of millions of ecommerce items, make reservations for restaurants or Ubers, order concert tickets, alert you when your favorite artist announces a tour, find a plumber to fix your sink, and memorize whatever you've done on Amazon. This is pretty game-changing for consumers, and just the start of what Alexa+ will do. We have over 600 million Alexa devices out there today, and expect Alexa+ to play an even more vital role in the lives of these hundreds of millions of customers in the future.\nWhy can't we get items to customers even faster? Does it matter?\nEvery year, people ask whether we've reached the law of diminishing returns on speed of delivery. Our data shows this not to be the case. When we promise faster delivery times, customers complete purchases at a meaningfully higher rate and shop with us more frequently. Amazon Prime started with unlimited, free, two- day delivery for a million products; it's now grown to over 300 million items, with tens of millions available\nin one day (or better). An increasing number of deliveries happen same day. This speed improvement is primarily due to our regionalization redesign of our fulfillment network, our new placement algorithms, and the introduction of our innovative same-day fulfillment centers. Although we've set speed records for two consecutive years, we're still honing these innovations, and have others planned. And, don't forget Prime Air, our drones that will get items to customers inside an hour. We are not done improving speed.\nWhy can't people in small towns enjoy the same fast delivery speeds as people in cities?\nAs some other companies are abandoning small-town customers due to cost to serve, we're going the other way-we're investing to serve our rural customers even better. We've already expanded Same-Day and Overnight Delivery to dozens of smaller cities and towns across the U.S., with more coming. This expansion will provide even faster Amazon delivery speeds for many millions of customers, particularly in less densely populated areas, enabling us to deliver over a billion packages each year to customers living in 13,000 zip codes spanning 1.2 million square miles.\nRelated, why can't we help the hundreds of millions of people without broadband connectivity?\nThere are about 400-500 million households around the world, most in small, rural towns that don't have access to broadband connectivity. They can't leverage the Internet to learn, shop, do business, access entertainment, and communicate the same way people take for granted in bigger cities. This digital divide is what Project Kuiper, our low Earth orbit satellite network, aims to solve. We're just launching our first production satellites, and will ultimately have over 3,200 in orbit over the next few years. While capital- intensive to launch, we believe Kuiper will be a meaningful operating income and ROIC business for us.\nWhy does healthcare have to be so stressful?\nHealthcare, especially in the U.S., is quite frustrating. It's hard to get fast appointments with primary care physicians, often harder with specialists. There's a lot of waiting around. Physicians spend only a few minutes with patients. Then, patients have to drive somewhere (often not close) to get their medications. And, when they get to the pharmacy, they're often surprised by the pricing, what's covered by their insurance, and what you can easily access that's not behind a locked shelf. Customers deserve better. It's why you see such positive customer sentiment and growth for Amazon Pharmacy and Amazon One Medical, and we continue to iterate quickly on selection and transparency for Amazon Pharmacy, and physical clinic capacity for One Medical.\nThese are some of the Why questions we're asking ourselves right now, and I'm excited about the future inventions to come. We're not going to be bored any time soon.\nWhen I first started working, I thought it was unfathomable that my Dad worked at the same place for\n45 years. How could that be? That's so long. I used to tell my friends that would never be me. Now, with almost 28 years and counting at Amazon, I have to answer those same friends with their own Why question.\nAfter all these years, why are you still at Amazon?\nI'm obviously a Superfan, but there are several compelling parts to working at Amazon. First, I'm not sure that any company prioritizes customers as relentlessly as we do. Lots of companies say they will; few follow through. Second, it's challenging to find a company where you can make a bigger impact on the world than you can at Amazon. Third, we make significant long-term investments and bets in both inventions and people. This allows our teams to iterate on ideas, and make the right long-term decisions for customers and the company. And, I've never encountered a more intelligent, creative, ambitious, hungry, hard-working, and missionary group of teammates than we have at Amazon. In my opinion, this is a remarkable set of qualities to have at a company. And, for builders who want to change the world, and who have fire in their belly, there's no better place to be than Amazon.\nWe operate like the world's largest startup in large part because of our culture of Why. We don't always get everything right, and we learn and iterate like crazy. But, we're constantly choosing to prioritize customers, delivery, invention, ownership, speed, scrappiness, curiosity, and building a company that outlasts us all. It remains Day One.\nSincerely,\nAndy Jassy\nPresident and Chief Executive Officer\nAmazon.com, Inc.\nP.S. As we have always done, our original 1997 Shareholder Letter follows. What's written there is as true today as it was in 1997.\n1997 LETTER TO SHAREHOLDERS\n(Reprinted from the 1997 Annual Report)\nTo our shareholders:\nAmazon.com passed many milestones in 1997: by year-end, we had served more than 1.5 million customers, yielding 838% revenue growth to $147.8 million, and extended our market leadership despite aggressive competitive entry.\nBut this is Day 1 for the Internet and, if we execute well, for Amazon.com. Today, online commerce saves customers money and precious time. Tomorrow, through personalization, online commerce will accelerate the very process of discovery. Amazon.com uses the Internet to create real value for its customers and, by doing so, hopes to create an enduring franchise, even in established and large markets.\nWe have a window of opportunity as larger players marshal the resources to pursue the online opportunity and as customers, new to purchasing online, are receptive to forming new relationships. The competitive landscape has continued to evolve at a fast pace. Many large players have moved online with credible offerings and have devoted substantial energy and resources to building awareness, traffic, and sales. Our goal is to move quickly to solidify and extend our current position while we begin to pursue the online commerce opportunities in other areas. We see substantial opportunity in the large markets we are targeting. This strategy is not without risk: it requires serious investment and crisp execution against established franchise leaders.\nIt's All About the Long Term\nWe believe that a fundamental measure of our success will be the shareholder value we create over the long term. This value will be a direct result of our ability to extend and solidify our current market leadership position. The stronger our market leadership, the more powerful our economic model. Market leadership can translate directly to higher revenue, higher profitability, greater capital velocity, and correspondingly stronger returns on invested capital.\nOur decisions have consistently reflected this focus. We first measure ourselves in terms of the metrics most indicative of our market leadership: customer and revenue growth, the degree to which our customers continue to purchase from us on a repeat basis, and the strength of our brand. We have invested and will continue to invest aggressively to expand and leverage our customer base, brand, and infrastructure as we move to establish an enduring franchise.\nBecause of our emphasis on the long term, we may make decisions and weigh tradeoffs differently than some companies. Accordingly, we want to share with you our fundamental management and decision-making approach so that you, our shareholders, may confirm that it is consistent with your investment philosophy:\n-\nWe will continue to focus relentlessly on our customers.\n-\nWe will continue to make investment decisions in light of long-term market leadership considerations rather than short-term profitability considerations or short-term Wall Street reactions.\n- We will continue to measure our programs and the effectiveness of our investments analytically, to jettison those that do not provide acceptable returns, and to step up our investment in those that work best. We will continue to learn from both our successes and our failures.\n-\nWe will make bold rather than timid investment decisions where we see a sufficient probability of gaining market leadership advantages. Some of these investments will pay off, others will not, and we will have learned another valuable lesson in either case.\n-\nWhen forced to choose between optimizing the appearance of our GAAP accounting and maximizing the present value of future cash flows, we'll take the cash flows.\n-\nWe will share our strategic thought processes with you when we make bold choices (to the extent competitive pressures allow), so that you may evaluate for yourselves whether we are making rational long-term leadership investments.\n- We will work hard to spend wisely and maintain our lean culture. We understand the importance of continually reinforcing a cost-conscious culture, particularly in a business incurring net losses.\n- We will balance our focus on growth with emphasis on long-term profitability and capital management. At this stage, we choose to prioritize growth because we believe that scale is central to achieving the potential of our business model.\n- We will continue to focus on hiring and retaining versatile and talented employees, and continue to weight their compensation to stock options rather than cash. We know our success will be largely affected by our ability to attract and retain a motivated employee base, each of whom must think like, and therefore must actually be, an owner.\nWe aren't so bold as to claim that the above is the \"right\" investment philosophy, but it's ours, and we would be remiss if we weren't clear in the approach we have taken and will continue to take.\nWith this foundation, we would like to turn to a review of our business focus, our progress in 1997, and our outlook for the future.\nObsess Over Customers\nFrom the beginning, our focus has been on offering our customers compelling value. We realized that the Web was, and still is, the World Wide Wait. Therefore, we set out to offer customers something they simply could not get any other way, and began serving them with books. We brought them much more selection than was possible in a physical store (our store would now occupy 6 football fields), and presented it in a useful, easy- to-search, and easy-to-browse format in a store open 365 days a year, 24 hours a day. We maintained a dogged focus on improving the shopping experience, and in 1997 substantially enhanced our store. We now offer customers gift certificates, 1-ClickSM shopping, and vastly more reviews, content, browsing options, and recommendation features. We dramatically lowered prices, further increasing customer value. Word of mouth remains the most powerful customer acquisition tool we have, and we are grateful for the trust our customers have placed in us. Repeat purchases and word of mouth have combined to make Amazon.com the market leader in online bookselling.\nBy many measures, Amazon.com came a long way in 1997:\n-\nSales grew from $15.7 million in 1996 to $147.8 million - an 838% increase.\n-\nCumulative customer accounts grew from 180,000 to 1,510,000 - a 738% increase.\n-\nThe percentage of orders from repeat customers grew from over 46% in the fourth quarter of 1996 to over 58% in the same period in 1997.\n-\nIn terms of audience reach, per Media Metrix, our Web site went from a rank of 90th to within the top 20.\n-\nWe established long-term relationships with many important strategic partners, including America Online, Yahoo!, Excite, Netscape, GeoCities, AltaVista, @Home, and Prodigy.\nAttachments - Original document\n- Permalink\nDisclaimer\nAmazon.com Inc. published this content on April 10, 2025, and is solely responsible for the information contained herein. Distributed via , unedited and unaltered, on April 10, 2025 at 10:10 UTC. DurationAuto.2 months3 months6 months9 months1 year2 years5 years10 yearsMax. PeriodDayWeek\nAmazon.com, Inc. is one of the world leaders in on-line distribution of products to the general public. The group also operates a marketplace activity, allowing individuals and distribution companies to conduct their purchase and selling transactions for goods and services. The activity is organized around three families of products and services:\n- electronic and computer products: toys, cameras, computers, laptops and peripherals, TVs, stereo systems, readers, wireless communication products, etc. Amazon.com also offers kitchen and garden equipment, clothing, beauty products, etc.;\n- cultural products: books, musical products, video games and DVDs;\n- other: primarily Internet interface and application development services.\nNet sales break down by source of income between sales of services (58.7%) and sales of products (41.3%).\nNet sales are distributed geographically as follows: the United States (68.3%), Germany (6.4%), United Kingdom (6%), Japan (4.3%) and others (15%).\nTrader\nTrader This super rating is the result of a weighted average of the rankings based on the following ratings: Global Valuation (Composite), EPS Revisions (4 months), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nInvestor\nInvestor This super composite rating is the result of a weighted average of the rankings based on the following ratings: Fundamentals (Composite), Global Valuation (Composite), EPS Revisions (1 year), and Visibility (Composite). We recommend that you carefully review the associated descriptions.\nGlobal\nGlobal This composite rating is the result of an average of the rankings based on the following ratings: Fundamentals (Composite), Valuation (Composite), Financial Estimates Revisions (Composite), Consensus (Composite), and Visibility (Composite). The company must be covered by at least 4 of these 5 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.\nQuality\nQuality This composite rating is the result of an average of the rankings based on the following ratings: Capital Efficiency (Composite), Quality of Financial Reporting (Composite), and Financial Health (Composite). The company must be covered by at least 2 of these 3 ratings for the calculation to be performed. We recommend that you carefully review the associated descriptions.\nESG MSCI\nESG MSCI The MSCI ESG score assesses a company’s environmental, social, and governance practices relative to its industry peers. Companies are rated from CCC (laggard) to AAA (leader). This rating helps investors incorporate sustainability risks and opportunities into their investment decisions. Last Close Price 199.60USD Average target price 282.17USD Spread / Average Target +41.37%\nMore than 20 years at your side\nOur Experts are here for you\nOUR EXPERTS ARE HERE FOR YOU Monday - Friday 9am-12pm / 2pm-6pm GMT + 1 Select your edition All financial news and data tailored to specific country editions |",
  "word_count": 6664,
  "scraped_at": "2026-02-14T02:11:32.319565",
  "_text_extracted": true
}