{
  "article_id": "2a82e5d0820e",
  "url": "https://www.themag.co.uk/2023/12/what-has-happened-since-newcastle-3-luton-1-is-truly-remarkable-complete-transformation-x2-newcastle-united/",
  "title": "What has happened since Newcastle 3 Luton 1 is truly remarkable - Complete transformation ( x2 ) ",
  "date": "20231223T121500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What has happened since Newcastle 3 Luton 1 is truly remarkable – Complete transformation (x2)\nOn 6 January 2018 the match ended Newcastle 3 Luton 1.\nThe FA Cup third round match was notable for a number of reasons, other than a Mike Ashley going nowhere Newcastle United managing a home cup win over a League Two side.\nA very impressive crowd of 47,069 for such a match had seen the attendance bolstered by Luton bringing 7,500 fans, pretty much their average home attendance (they had 8,476 for the next Luton home League Two match that followed).\nIt was only a fifth FA Cup win in eleven seasons under Mike Ashley, Newcastle United fans left dreaming of a first ever FA Cup progression under Ashley beyond the fourth round. It wasn’t to be, getting Chelsea away and hammered 3-0, the FA Cup dreaming ending in January, as had become the norm.\nAnyway, fast forward to the present day and what has happened since Newcastle 3 Luton 1 is truly remarkable – Complete transformation (x2).\nFor both clubs, can it really be only five years ago…?\nAll the enthusiasm and hope for Newcastle fans had pretty much dissolved completely by that point, after Rafa Benitez had initially given hope by staying in 2016 after relegation. It had been quite astonishing as Newcastle United fans broke records, filling St James’ Park every week in the second tier, averaging over 51,000 in the Championship. However, the Mike Ashley promises to Rafa Benitez on what would happen if / when getting promotion, had absolutely dissolved. Ashley refusing to honour what he had pledged to the manager once getting back into the Premier League, Rafa and the fans realising this was a lost cause as the owner refused any proper investment on or off the pitch back to what we had all come to expect under his ownership.\nPut the smile back on your face though Newcastle United and Luton fans, as this tale has very happy endings with what has followed on from Newcastle 3 Luton 1 back on 6 January 2018…\n2017/18 season\nNewcastle United finished somehow in the top half, despite the lack of investment that had been essential. Rafa Benitez overseeing a tenth place in the Premier League against all odds, the seventh best defensive record in the PL, a key factor.\nLuton Town win promotion from the fourth tier, ending up second in League Two.\n2018/19 season\nRafa Benitez once again manufactured safety by some distance, again, NUFC with the seventh best defensive record. By this point we all knew the writing was on the wall, Mike Ashley determined to force the manager out and bring in his usual low quality desperate character, who would accept having no say on transfers in or out, or indeed anything else important.\nNewcastle finished 13th but actually on 45 points, one more than the previous season.\nHowever, there were clear signs of building something far better despite the lack of investment. Rafa had been at last allowed a substantial (by Ashley standards) signing on the final day of the January 2019 transfer window. In the final 26 Premier League matches of that 2018/19 season, Newcastle had the eighth best form. Whilst in the final 16 matches, Newcastle had the fifth best form and the fifth highest total of goals. Almiron’s £20m signing in the January had allowed Rafa to play far more attacking football in many games as he helped the attacking play massively and loan signing Rondon and £1.8m capture Perez scored for fun.\nLuton Town win promotion as champions in League One, rising to the Championship.\n2019/20 season\nMike Ashley forced Rafa Benitez out at the end of his contract and depression descended on Tyneside as Steve Bruce was appointed. Ashley took control of transfers and suddenly spent relative fortunes, using the finances that had been denied Rafa Benitez. That investment and some incredible luck in many games, saw Newcastle United overcome the damage caused by appointing Bruce. Survival in 13th place.\nLuton Town just about handle the step up, flirting with relegation but eventually ending the season sixth bottom and safe.\n2020/21 season\nA case of pretty much same again, Steve Bruce stumbling along with the same combination of luck and Ashley allowing more investment. The likes of Callum Wilson arriving, who guaranteed goals when fit. Whilst January loan signing Joe Willock went on a scoring spree that astonished him more than anybody else, everything he got on the end of went in. All of this somehow coming together to give 12th place and safety. However, under the chaos of Ashley and Bruce, it always felt like NUFC were increasingly like a drunk stumbling along a cliff top, at any time this could all come crashing down.\nHaving survived that first season after promotion, Luton Town show clear improvement, ending up seven places higher than the previous season, in 12th.\n2021/22 season\nIt all came crashing down. It was quite clear that with zero wins as we got to October, Ashley and Bruce were relegating Newcastle United. No question. Then out of nowhere, after we’d all pretty much wrote it off, the takeover happened, Ashley and Bruce left, Eddie Howe arrived. The rest, as they say, is history. Astonishing second half of the season form once Eddie Howe got things sorted, the third best in the Premier League, saw Newcastle United transformed from relegation certainties to 11th place and more than just safety.\nProgress again, this time ending up sixth but losing out in the play-offs, Premier League football denied.\n2022/23 season\nNewcastle United soaring under Eddie Howe, a fourth place finish and Champions League football, plus a first cup final in 24 years. Astonishing.\nYet more progress again, this time ending up third AND going up through the play-offs. Defeating Sunderland in the semi-finals and then drawing with Coventry at Wembley in front of more than 85,000 and dramatically winning the penalty shootout. Top tier football returns for the first time since 1992.\n2023/24 season\nMore of the same under Eddie Howe, despite a crippling list of missing players United find themselves now top six. Failure for many now is seen as failing to qualify for the last 16 of the Champions League in the final half hour of the sixth and final group match, with then similar heartbreak in the quarter-finals of the League Cup. So close to progress in both despite that crippling missing list and such fine margins going against NUFC.\nLuton fans enjoying Premier League football for the first time, a tough ask to stay up but sitting third bottom currently and with a game in hand on those above them. Performances have improved and unlucky not to get points to match that. Plenty of room for optimism although staying up is clearly a massive challenge.\nA final look back at Newcastle 3 Luton 1…\nFive of the Newcastle United players who featured that day back in January 2018, are still on the club’s books. Lascelles, Ritchie, Dummett and Manquillo all started back then, Whilst Isaac Hayden came off the bench in that FA Cup win over Luton. Only the following month after that Luton match, Rafa Benitez unearthed yet another brilliant bargain, Martin Dubravka arriving in February 2018.\nEddie Howe is doing a remarkable job, as you all know of course, and whilst of course the haters will hate and for example, say every club has injuries. Fact is that Eddie Howe went to Chelsea on Tuesday with such limited options and no positive subs he could make in midfield or attack. Seven of the eleven who started he (Howe) inherited and then an eighth in Ritchie came off the bench.\nI have no idea of how many players remain at Luton Town from back in January 2018 but I guess not quite as many getting games as is the case at Newcastle United, proving yet again just what a brilliant job the NUFC Head Coach is doing in such challenging circumstances this season.\nSo Newcastle United travel to Luton this afternoon and we await to see what happens, I wonder what will happen to both clubs in these next five or so years, when we get to 2028/29 and we can look back on these intervening seasons…\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1398,
  "scraped_at": "2026-02-14T01:56:38.142075",
  "_text_extracted": true
}