{
  "article_id": "2aa1b4d9143a",
  "url": "https://www.teamtalk.com/liverpool/transfers-journalist-guarantees-87m-yan-diomande-interest-push-button-explosive-transfer",
  "title": "Liverpool : Journalist  guarantee £87m winger is on FSG radar with Hughes  willing  to push button on explosive transfer",
  "date": "20260213T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJournalist ‘guarantees’ £87m winger is on Liverpool’s radar with Hughes ‘willing’ to push button on explosive transfer\nA trusted journalist who specialises in all things Liverpool has offered his personal word that the Reds are looking to sign a winger this summer and having confirmed a €100m-rated star is someone they are strongly considering, as a new Saudi Arabian side explodes into the mix over a potential move for Mohamed Salah.\nThe Reds have endured a difficult title defence despite lavishly spending some £440m (€505m, $600m) on new players over the summer to create what, on the surface at least, looked a dream starting XI for Arne Slot. But with his new-look side taking time to gel, Liverpool have been way off the pace this season, and now face a battle to bring Champions League football back to Anfield next season.\nAnd while plans are now being drawn up for the summer transfer window, finances of which will be impacted by whatever European competition the Reds find themselves in next season, it is looking increasingly likely that a new winger will be among their very top needs.\nThat search is likely to intensify should Salah, as expected, depart Anfield after nine, largely glorious years, to begin a new chapter in Saudi Arabia.\nWhile the Egyptian’s legendary status is secure on Merseyside, a drop-off in form this season, coupled with an unwelcome public outburst after the 3-3 draw at Leeds, suggests a parting of ways now looks like the best course of action for all concerned.\nReplacing one of their greatest ever players will be no easy feat, but one name that has been thrust into the spotlight in recent months is Yan Diomande.\nThe 19-year-old Ivorian has registered eight goals and six assists from just 23 appearances for RB Leipzig this season; form that has thrust him into the €100m (£87m, $118.5m) bracket.\nNow, assessing the links towards the player, Liverpool FC journalist David Lynch is adamant he is a player on their radar and has talked up the prospects of a new winger arriving at Anfield this summer.\n“Definitely Diomande is being watched really closely,” Lynch told Anfield Index. “That’s not to guarantee they will go for him, but he’s definitely on Liverpool’s radar, but he’s on the radar of a lot of clubs.\n“I can guarantee that he’s definitely being watched. The wing position is something Liverpool are eyeing now, I’d be surprised if next summer passes without a winger being added. So, he’s on that radar, but it’s kind of up to him now to keep that level going to keep showing he’s ready to make that jump.”\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nYan Diomande has already dropped Liverpool transfer hint\nLynch went on to explain that while Diomande is the sort of player FSG may not have moved for in the past, he is someone who could very much be on their radar, and amid claims that sporting director Richard Hughes is ready to push the button on a giant summer raid, having identified the star as his preferred wing addition at Anfield.\n“A few years ago, you’d say he’s only 19, he’s not got very many games behind him at all, not a big record of production, but Liverpool kind of have to move earlier now because everybody else is moving earlier,” Lynch commented.\n“Previously, I would have said he’s not ready for Liverpool to spend big money on him now, but it’s very hard to predict that these days because the whole kind of approach has changed a little bit and they’re willing to go a little bit earlier.”\nLiverpool are not alone in their admiration for the teenager, who joined Leipzig in a bargain €20m (£17m, $23m) deal from Leganes last summer.\nWith sources describing Diomande as the Red Bull group’s greatest discovery since Erling Haaland, the young winger has also been linked with big-money moves to Manchester United and Bayern Munich.\nHowever, the Reds have already scored a major advantage over their rivals after it emerged that the player has already outlined his ambitions of moving to Anfield.\nIn January, the Ivory Coast international winger publicly stated his admiration for the Reds and his wishes for a future move during a live broadcast on his Instagram page.\nDiomande said: “I want to play at Anfield, I want to play for Liverpool. I’m a big Liverpool fan. My father’s dream is to see me play for Liverpool.”\nNew Saudi force in for Mo Salah; big Konate contract revelation\nMeanwhile, claims that Salah will bring his long and distinguished Liverpool career to an end this summer have been addressed by Fabrizio Romano – and while a second journalist has played down claims of a lucrative move to Al-Ittihad, a new Saudi Arabian force looks set to throw their hat into the ring for his signature.\nAnother young winger linked with the Reds is Bournemouth star Eli-Junior Kroupi, though sources have now revealed that interest from some of Europe’s biggest sides has prompted the Cherries to open talks with the star over a double-your-money deal.\nAnd despite links to both Liverpool and Arsenal, they are not the sides currently at the front of the queue, with sources confirming a long-standing interest from a European super-power.\nElsewhere, Liverpool will need to act quickly if they are to win the race to sign a player billed as Slot’s dream target at Anfield this summer after Romano confirmed Real Madrid were now making a beeline for his signature, though TEAMtalk sources can reveal the Merseysiders may have a slight advantage.\nAnd finally, FSG are now more confident than ever that a new deal can be agreed with Ibrahima Konate as they look to keep him out of Real Madrid’s clutches and with one of the club’s loudest voices now personally involved in helping to sway the Frenchman.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 1028,
  "scraped_at": "2026-02-14T01:59:36.825614",
  "_text_extracted": true
}