{
  "article_id": "2ab5aeca8f8b",
  "url": "https://www.90min.com/arsenal-identify-psg-transfer-specialist-potential-edu-replacement",
  "title": "Report : Arsenal identify PSG transfer specialist as potential Edu replacement",
  "date": "20241118T141500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Report: Arsenal identify PSG transfer specialist as potential Edu replacement\n- PSG football advisor Luis Campos has been touted as a sporting director target for Arsenal\n- Campos was behind the transfers which led to Ligue 1 titles for Monaco and Lille\n- Arsenal are still in the early stage of the recruitment process for Edu's replacement\nArsenal's search for a new sporting director has led them to reportedly consider Paris Saint-Germain's football advisor Luis Campos.\nThe outspoken Portuguese transfer specialist was hired as an outside consultant by PSG in July 2022 after establishing a lofty reputation at their French competitors, Monaco and Lille. Both clubs wrestled the French top-flight title out of the capital club's iron grip with a glut of players recruited by Campos.\nFollowing the shock resignation of Edu, Arsenal are thought to be considering the 60-year-old as a potential successor according to Sky Sports. The club are still at an \"early stage\" in the process of finding a new sporting director, with Edu's assistant Jason Ayto taking on more responsibilities for the January window.\nThe report also named Bayer Leverkusen's Simon Rolfes as a candidate alongside Roberto Olabe, whose confirmed exit from Real Sociedad is a boost for the Gunners.\nUnless he agrees an extension with PSG, Campos will be out of contract in June 2025, shortly before the summer window opens. A potential move for any candidate was discussed by Arsenal manager Mikel Arteta at a US summit with the club's co-owners, Stan and Josh Kroenke, during November's international break. Club directors Tim Lewis and Richard Garlick were also involved in the talks.\nCampos spent three years behind the scenes at Monaco between 2013 and 2016, overseeing a glittering array of low-cost, high-profit arrivals including the likes of Bernardo Silva, Fabinho and, most notably, Kylian Mbappe. Less than 12 months after his final transfer window, Monaco pipped PSG to the league title and reached the Champions League semi-finals.\nLille also profited from Campos' keen eye for recruitment to win the 2020/21 Ligue 1 crown. Rafael Leao, Victor Osimhen and Jonathan David - to name only three - all arrived in northern France during his time at the club.\nWhile Campos has been rightly lauded for unearthing hidden gems at sides operating below the elite level, his spell at PSG has led some to question whether his skillset translates to those shopping in more expensive markets, which may be a consideration for an aspirational Arsenal outfit.",
  "word_count": 410,
  "scraped_at": "2026-02-14T02:08:26.319054",
  "_text_extracted": true
}