{
  "article_id": "2abcc2e78647",
  "url": "https://www.caughtoffside.com/2024/01/31/attacker-with-14-goals-last-season-has-asked-to-leave-man-utd-this-month/",
  "title": "Amad Diallo has asked to leave Manchester United in January",
  "date": "20240131T081500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Amar Diallo is reportedly keen on securing a loan move away from Manchester United before the January transfer window closes.\nThe 21-year-old was on loan at Sunderland last season and he was outstanding for them in the Championship. He managed to score 14 goals across all competitions and picked up four assists along the way as well.\nHowever, he has struggled for game time so far this season and he wants to play more often. A report from Football Insider claims that the player has already requested the club hierarchy to let him leave on loan during the second half of the campaign.\nDiallo is highly rated around Europe and he has a bright future ahead of him. Manchester United must focus on his development and allow him to leave if they cannot provide him with first-team opportunities.\nSitting on the bench at Old Trafford is unlikely to benefit him. With that said, the Red Devils are currently lacking in depth in the wide areas. They have already allowed Jadon Sancho to leave on loan and it remains to be seen whether they are ready to weaken the squad further.\nThe likes of Marcus Rashford, Alejandro Garnacho and Antony are all ahead of Diallo in the pecking order and it remains to be seen whether the 21-year-old can force his way into the starting lineup.\nThe report claims that Diallo is keen on a return to Sunderland this month. However, Manchester United will demand that the Championship club pay most of his wages during the loan spell and it remains to be seen whether Sunderland are prepared to accept those terms.",
  "word_count": 271,
  "scraped_at": "2026-02-14T01:48:39.898359",
  "_text_extracted": true
}