{
  "article_id": "2acfab792370",
  "url": "https://playingfor90.com/club-world-cup-team-profile-top-10-things-to-know-about-ulsan-hd-01jw6msa9vj4",
  "title": "Club World Cup team profile : Top 10 things to know about Ulsan HD",
  "date": "20250608T010000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ulsan HD arrive at the Club World Cup still searching for their first victory in the competition. After two winless campaigns and a tough draw featuring Mamelodi Sundowns, Fluminense and Borussia Dortmund, can the K League champions finally turn promise into progress on the global stage?\n1) Who will Ulsan HD face at the Club World Cup?\nUlsan HD have been drawn into Group F and these are their group stage fixtures:\n17 June: vs Mamelodi Sundowns. Inter&Co Stadium, Orlando.\n21 June: vs Fluminense. MetLife Stadium, New Jersey.\n25 June: vs Borussia Dortmund. TQL Stadium, Cincinnati.\n2) Domestic success\nUlsan HD are five-times K League champions. Their very first title came in 1996, winning the league again in 2005, while the Tigers' best period is, well, right now, claiming the trophy in each of the last three seasons, having been runners-up the previous three years beforehand.\nOnly Jeonbuk Hyundai Motors (9), Seongnam FC (7) and FC Seoul (6) boast more top-flight Korean titles.\n3) Champions League triumphs\nOn top of this, Ulsan HD have twice been crowned kings of Asia. Their maiden title came in 2012, smashing Al-Ahli 3-0 in the final, before reclaiming the trophy in 2020, defeating Iranian outfit Persepolis 2-1 in Al Wakrah, Qatar.\nThey are one of six different Korean clubs to have won the Asian Champions League, a joint-record alongside Japan. Ulsan HD are the only club to have won the competition twice without tasting a single defeat en route.\n4) Past Club World Cup expirence\nAs two-times AFC Champions League winners, Ulsan Hyundai have previously featured at two editions of the FIFA Club World Cup, but with absolutely no success.\nOn debut in 2012, they were dumped out in the quarter-finals by Monterrey, before also losing to Sanfrecce Hiroshima in the match for fifth place. Then, almost a decade on, the Tigers experienced a strong sense of déjà vu in Qatar.\nIn February 2021, a Mexican outfit once again ousted them at the first hurdle, this time Tigres UANL, before losing to Al-Duhail in the fifth-place play-off. Thus, it's currently played four lost four at this competition, conceding 11 goals, thereby leaving room for improvement this summer.\n5) An underwhelming 2025 so far\nIn further bad news for Ulsan HD supporters, this calendar year hasn't gone particularly well so far.\nLast time out, on 31 May, they were beaten 3-1 by fierce rivals Jeonbuk Hyundai Motors, despite taking an early lead through veteran Lee Chung-yong in Jeonju; more on him shortly. This leaves them third in the K League, six points adrift the leaders and team who've just beaten them, having played 19 of their 33 fixtures.\nMeantime, Ulsan HD have also endured a catastrophic AFC Champions League campaign. They lost six of their seven league stage fixtures, their sole victory coming on the road against Shanghai Shenhua in December, thereby suffering an ignominious early exit.\n6) Association to Hyundai and rebrand\nSince being founded in 1983, this club have gone through a few name changes. Back then, they were called Hyundai Horang-i and based in Incheon before, in 1990, moving a whopping 200 miles to the opposite side of the country, as was more common with Korean franchise clubs at the time.\nAfter relocation, they were known as Ulsan Hyundai, before removing the name of the world-famous car manufacture from their name in 2023, albeit they are still owned by HD Hyundai Heavy Industries.\n7) Ulsan HD players to watch: Erick Farias\nStriker Erick Farias only moved to South Korea from Juventude in his native Brazil as recently as March, but has instantaneously establish himself as a key figure in this team.\nThe 28 year old has scored nine goals in 15 appearances for Ulsan HD, averaging a goal every 11 minutes, most-notably bagging a brace as they fought back from 2-0 down to defeat Gimcheon Sangmu 3-2 last month, all three goals coming in the final 18 minutes.\n8) Ulsan HD players to watch: Lee Chung-yong\nMeantime, many of the teams at this Club World Cup contain a player you'd completely forgotten about, and this side are no different.\nLee Chung-yong made 105 Premier League appearances for Bolton Wanderers and Crystal Palace between 2009 and 2018, while he also has 89 international caps for the Taegeuk Warriors to his name. Since 2020, Lee has returned home and been a key figure in Ulsan HD's recent dominance of Korean football. Now 36 years old, if all goes to plan, he'll reach 200 appearances for the club during the group phase of this tournament.\n9) Manager Kim Pan-gon: one year in charge\nHead coach Kim Pan-gon took over as manager almost exactly 12 months ago, replacing Hong Myung-bo after he was re-hired as national team boss. Well, despite leading them to the title last November, Kim is a man under pressure, having won just 20 of his 43 games in charge overall.\n10) Can Ulsan HD claim their first-ever Club World Cup win?\nThe Tigers' Club World Cup campaign commences against Mamelodi Sundowns in Orlando, before facing Fluminense in East Rutherford and then Borussia Dortmund in Cincinnati.\nAs outlined earlier, the Korean club have lost all four matches they've ever played in this competition, a trend that could be set to continue stateside this summer, with their opener appearing to be the most-winnable fixture.",
  "word_count": 890,
  "scraped_at": "2026-02-14T01:52:26.342003",
  "_text_extracted": true
}