{
  "article_id": "2b0e61b725dd",
  "url": "https://www.caughtoffside.com/2024/10/26/man-united-villa-antony-chukwueze/",
  "title": "Man United flop could hold key to Aston Villa move for Serie A ace",
  "date": "20241026T111500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are ready to listen to offers for winger Antony as the January transfer window approaches, with the Brazilian potentially available both on loan or permanently.\nErik ten Hag has apparently given the green light for the £85m signing (Sky Sports) to be moved on, though he still insisted on playing him ahead of Amad Diallo in the recent Champions League draw at Fenerbahce.\nChukwueze holds key to Antony departure\nThat’s one of many strange decisions that the Dutchman appears to have made of late, and it’s little wonder that the squad aren’t putting together any sort of decent run at present.\nSources have advanced to CaughtOffside that many top European clubs have shown a concrete interest in Antony, in particular the Serie A giants Juventus and AC Milan.\nBoth have apparently been continuously monitoring his situation of late, and the Rossoneri look likely to be favourites in any deal, loan or otherwise, if it comes down to a straight fight between themselves and the Bianconeri.\nThat’s because sources have also told CaughtOffside that Milan’s 25-year-old Nigerian winger, Samu Chukwueze, is being courted by the likes of Fulham, Wolverhampton Wanderers, Aston Villa and West Ham United.\nIf Chukwueze were to transfer to any of the Premier League clubs mentioned, with sources suggesting that Villa hold all the aces thanks to the player’s previous relationship with Unai Emery at Villarreal, and Villa’s current trajectory, then Milan will definitely swoop for Antony.\nWith football ever changing, Man United might well have a new man in the dugout before the January transfer window in any event, and they might take a broader view on Antony’s suitability to the Red Devils.\nHow many times before have we seen a player resurrect his career at the same club with only a change of manager being the catalyst for getting the best out of them…",
  "word_count": 310,
  "scraped_at": "2026-02-14T01:57:46.240084",
  "_text_extracted": true
}