{
  "article_id": "2b3fe9e3c07a",
  "url": "https://www.90min.com/posts/champions-league-tv-your-guide-tuesday-wednesday-games-11-4-2023",
  "title": "Champions League on TV - your guide to Tuesday & Wednesday games",
  "date": "20230410T231500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League on TV - your guide to Tuesday & Wednesday games\nThe Champions League quarter-finals are upon us and the draw has thrown together a group of mouth-watering ties.\nThis truly is the most wonderful time of the year for football lovers. The conclusion to Europe's premier club competition is almost always enthralling, and the really good stuff tends to begin at this stage.\nOur lives this April will revolve around these belting European fixtures, and here's everything you need to know about the upcoming Champions League quarter-final first legs.\nBenfica vs Inter\nRoger Schmidt's Benfica have to be regarded as one of the very best teams to come out of Portugal in recent times, but they were beaten by Porto ahead of their clash with Inter.\nSchmidt's side have dazzled in this competition thus far, beating out PSG and Juventus to top spot in the group stage before waltzing beyond Club Brugge in the round of 16. They're favoured to bypass the Nerazzurri in the last eight, with Simone Inzaghi's side currently enduring a miserable domestic run. Inter have won just one of their last six Serie A outings.\nHowever, their form in the cups under Inzaghi will give some supporters hope they can pull off the upset here. Inter's performance in the Champions League has gradually improved since they returned to the competition in 2018 following a six-year hiatus, and are the current Coppa Italia and Supercoppa Italiana holders.\n- Location: Lisbon, Portugal\n- Stadium: Estádio da Luz\n- Date: Tuesday 11 April\n- Kick-off Time: 20:00 BST / 15:00 ET / 12:00 PT\n- Referee: Michael Oliver (ENG)\n- VAR: Pol van Boekel (NED)\nHow to watch on TV\nManchester City vs Bayern Munich\nIt's a cracking batch of fixtures, but this has to be the standout tie, right?\nMan City's duel with Bayern Munich had Twitter tacticos salivating at the mouth when the draw was made, but the appointment of Thomas Tuchel in Bavaria has since sent them into overdrive. A chess match of the highest quality beckons at the Etihad.\nTuchel's begun his stint at the Allianz Arena with back-to-back Bundesliga wins, but his side were knocked out of the DFB Pokal by Freiburg last week. This is not an imperious Bayern outfit, but a very good one. The former Chelsea boss will need to use all of his nous if the German side are to progress beyond a City outfit that have rediscovered their irresistible groove at a critical point in the season.\n- Location: Manchester, England\n- Stadium: Etihad Stadium\n- Date: Tuesday 11 April\n- Kick-off Time: 20:00 BST / 15:00 ET / 12:00 PT\n- Referee: Jesús Gil Manzano (ESP)\n- VAR: Juan Martínez Munuera (ESP)\nHow to watch on TV\n- Man City vs Bayern Munich - Champions League: TV channel, team news, lineups & prediction\n- Man City predicted lineup vs Bayern Munich - Champions League\n- Bayern Munich predicted lineup vs Man City - Champions League\nReal Madrid vs Chelsea\nMore of the same, please!\nThese two sides played out a cracking quarter-final this time last year as Real Madrid surrendered a 3-1 advantage on home soil before eventually scraping through in extra-time. Barcelona's standing in La Liga means the cups have taken on even greater significance for the Champions League masters this term, and how can you possibly write them off after what they achieved last season?\nChelsea, meanwhile, are in a spot of bother. Sure, they've got cash and plenty of talent, but they're still short (not literally) in a couple of key areas which has compromised squad balance.\nFrank Lampard is back at the helm on an interim basis following the sacking of Graham Potter, and Blues supporters are dreaming of their midfield legend spearheading a miraculous continental run akin to 2012 which he was involved in.\n- Location: Madrid, Spain\n- Stadium: Santiago Bernabéu\n- Date: Wednesday 12 April\n- Kick-off Time: 20:00 BST / 15:00 ET / 12:00 PT\n- Referee: François Letexier (FRA)\n- VAR: Tomasz Kwiatkowski (POL)\nHow to watch on TV\n- Real Madrid vs Chelsea - Champions League: TV channel, team news, lineups & prediction\n- Real Madrid predicted lineup vs Chelsea - Champions League\n- Chelsea predicted lineup vs Real Madrid - Champions League\nRead the latest Champions League news here\nMilan vs Napoli\nFamiliarity renders this a very difficult tie for Serie A leaders Napoli, who have taken the continent by storm this season despite losing three stalwarts in the summer.\nLuciano Spalletti has worked a mini miracle in Naples this season, and a Scudetto/Champions League double cannot be written off. They will soon be crowned the champions of Italy, but domestic rivals Milan pose a serious threat to their continental ambitions.\nThe Rossoneri thrashed a Victor Osimhen-less Napoli 4-0 in their recent league meeting, and Stefano Pioli's side will take all the confidence in the world into this tie despite their Serie A indifference. Milan have got the pedigree, astuteness, as well as a superstar in Rafael Leão to advance into the last eight. They'll host the first leg at San Siro on Wednesday night.\n- Location: Milan, Italy\n- Stadium: San Siro\n- Date: Wednesday 12 April\n- Kick-off Time: 20:00 BST / 15:00 ET / 12:00 PT\n- Referee: István Kovács (ROU)\n- VAR: Bastian Dankert (GER)",
  "word_count": 894,
  "scraped_at": "2026-02-14T02:09:52.178735",
  "_text_extracted": true
}