{
  "article_id": "2b5c5bc6ecdf",
  "url": "https://www.the42.ie/premier-league-preview-9-6463807-Aug2024/",
  "title": "Catch up on Premier League drama quicker than it takes Daniel Wiffen to win Olympic gold",
  "date": "20240816T074500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MOMENTS OF HISTORY and glory were created in mere seconds and minutes at the Olympics this summer.\nSo, in a desperate attempt to benefit from Daniel Wiffen’s slipstream, here is a sharp refresher on the events that mattered for Premier League clubs in a summer dominated by Euro 2024 and Ireland’s athletes in Paris:\nThe hearing to examine the 115 charges of allegedly breaching financial rules against four-in-a-row champions Manchester City has been brought forward to next month. An outcome is expected in early 2025.\nPep Guardiola travelled to the United States to watch the Boston Celtics win the NBA Championship, but he was still able to squeeze in time to persuade Kevin De Bruyne not to leave for Saudi Arabia. He put up less of a fight when Ipswich Town asked if they could have Kalvin Phillips on loan.\nIpswich’s manager, Fermanagh’s Kieran McKenna, only turned 38 in May and has brought the Tractor Boys from League One to England’s top flight with back-to-back promotions since 2022/23.\nIn that same time, Chelsea have spent an estimated €1.32 billion on signing 35 players under owners Clearlake Capital. Ten more arrived this summer and the most recent was Pedro Neto, who joined from Wolves on a seven-year contract for a little over €60m.\nAcademy graduate Conor Gallagher may or may not still be holed up in a Madrid hotel as he waits for his transfer to Atletico to be signed off. Apparently, Chelsea are just waiting for the Spanish club to accept more money for the permanent signing of Joao Felix.\nHe was on loan at Stamford Bridge for the second half of the 2022/23 season and played under Graham Potter and Frank Lampard during those six months. The current boss is now Enzo Maresca, who replaced Maurico Pochettino on 1 July.\nPochettino, by the way, is set to be named the United States head coach after his former colleague Matt Crocker, now the US sporting director, approached him.\nThe pair worked together at Southampton, who are also back in the Premier League and have a trio of Republic of Ireland internationals hoping to make an impact.\nGavin Bazunu will have to bide his time, though, as he recovers from the ruptured Achilles tendon that will see him sidelined until the new year. Will Smallbone will likely feature from the start in midfield while Ryan Manning may have to wait for an opportunity to impress.\nWhether he takes it is another matter.\nThey have Newcastle away at 3pm tomorrow and Eddie Howe will have to turn his attention away from trying to signing England centre back Marc Guehi from Crystal Palace for €68m.\nArsenal spent €20 million less than that on defender Italian international Riccardo Calafiori from Bologna. The 22-year-old is versatile and can play in the middle or on the left. Manager Mikel Arteta reasoned that his addition was needed as William Saliba played every minute of every game as the Gunners finished as runners-up last season.\nLuke Shaw did not play as much for Manchester United and the club confirmed that he is injured. Again. At least he made it back to fitness for the final of the European Championships. Which England lost. Again.\nUnited play Fulham in the opening fixture of the season tonight.\nThe 2024 FA Cup winners – some of their fans may only just have stopped watching highlights of Kobbie Mainoo’s goal from Wembley – decided not part with Erik ten Hag by mutual consent after positive talks in Ibiza.\nInstead, the new INEOS regime – CEO Omar Berrada and sporting director Dan Ashworth are now in situ and no longer gardening or in a workplace tribunal – have backed their man.\nLeny Yoro joined from Lille and, perhaps in a nod to one of the club’s great players, suffered a broken metatarsal in pre-season. Dutch striker Joshua Zirkzee arrived from Bologna and Ten Hag added two more former players when Matthijs de Ligt and Noussair Mazraoui bid farewell to Bayern Munich.\nThe Germans – now managed by Vincent Kompany – were keen on getting Bruno Fernandes but the United captain this week signed a new contract until 2027.\nLiverpool have a new manager but no new signings. Virgil Van Dijk, Trent Alexander-Arnold and Mo Salah are also all in the final year of their contracts but yet to agree new terms. It looked like Caoimhin Kelleher would be heading out the door when he spoke of wanting to be number one in May but the fact he remains adds intrigue at Anfield.\nArne Slot will be hoping their season gets up and running with a win away to Ipswich in the early kick off tomorrow. Oh, looks like Ipswich have just agreed a €13m fee for Blackburn’s Ireland international Sammie Szmodics, so he could well be involved.\nIt might just be the first time many of us get to see how the Premier League’s Match Centre account on X – formerly Twitter – works.\nControversial and match-defining decisions from referees and VAR will now be explained in real time on the social media platform, meaning all of that outrage can be distilled and consolidated into one helpful pit of bile. All the while you are scrolling on your phone as you watch a game that is not actually available as part of the €110 TV subscription that includes Sky, BT, Premier Sport and Amazon, but is definitely not a dodgy box.\nNottingham Forest were one of the most vocal critics of VAR last season and have since parted ways with former referee consultant Mark Clattenburg.\nTheir manager is still Nuno Espírito Santo (we checked) but he probably won’t be by the time they host Ipswich on 30 November.\nThe Premier League might even have introduced semi-automated offsides by then as the plan is to do so after the autumn international break.\nEverton were another who had their issues with those in power but they stayed up too, despite their 10-point deduction, and captain Seamus Coleman has been able to welcome fellow Ireland international Jake O’Brien to the club after he signed from Lyon.\nHis debut on the opening day won’t see him face off against Evan Ferguson, though, as he’s still injured and will have to wait to impress his new boss at Brighton following Roberto De Zerbi’s exit.\nThe Italian’s successor, Fabian Hürzeler, is just 31 years old, meaning the Premier League now has a manager who is actually younger than the competition. Football may not have started in 1992 but Hürzeler was only born in February 1993.\nAnd before you take your jaw from the floor, Belgium midfielder Amadou Onana has left Goodison Park and was Champions League-bound Aston Villa’s most expensive summer signing at just shy of €60m.\nWhat else?\nSpurs signed Dominic Solanke from Bournemouth for €64m, who in turn have agreed a €47m deal with Porto to replace him with Evanilson.\nAaron Wan Bissaka has slide-tackled his way back to London from Old Trafford to join West Ham, while Brentford could have an all-Irish centre back partnership should they get a deal for Dara O’Shea over the line in time for him to link up with Nathan Collins when they face Crystal Palace.\nSo, just some of the storylines that will quickly be swamped by the drama – and Stick to Football episodes – to come.\nYou might even have got through these updates in less time than it took Wiffen to win gold in the men’s 800-metre freestyle final.",
  "word_count": 1251,
  "scraped_at": "2026-02-14T02:08:01.867321",
  "_text_extracted": true
}