{
  "article_id": "2ba9f34700f7",
  "url": "https://www.empireofthekop.com/2023/04/19/dean-jones-conor-gallagher-liverpool-50m/",
  "title": "Dean Jones claims Liverpool would need to pay £50m for Conor Gallagher",
  "date": "20230419T090000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One transfer expert has revealed the ‘ballpark figure’ Liverpool would need to pay if they’re to sign reported target Conor Gallagher this summer.\nThe Chelsea midfielder is on a five-man midfield shortlist at Anfield (Football Insider), with Fabrizio Romano telling CaughtOffside that he’s ‘aware’ of speculation that the Reds are ‘eyeing up’ the 23-year-old, whose current club ‘will consider bids as they need to sell some players’.\nHowever, Dean Jones has now highlighted one significant obstacle (other than the Blues’ asking price) which could make it rather difficult for Jurgen Klopp’s side to land the England international.\nThe journalist and transfer specialist told GIVEMESPORT: “I’m told around £50m is the ballpark figure Chelsea would be looking at for Gallagher. There are other factors that will determine where he ends up if he does indeed leave.\n“One of the key factors will be that he’s very much a local lad and isn’t keen to leave the area. Anyone I speak to that knows him seems to think he’d still prefer to stay in London.”\nAccording to Football Transfers, the 23-year-old’s market value is €42.9m (£37.8m), so while £50m may seem a little over the odds, it’s not outrageously excessive either for a player who was dubbed ‘extraordinary and outstanding’ by his former boss Thomas Tuchel (chelseafc.com).\nIt’s also worth noting that the midfielder has joined clubs outside the capital before, playing for West Brom and Swansea, although both of those were loan spells away from Chelsea.\nA temporary move in search of regular first-team football is one thing; a permanent switch away from London for someone who’s now established in the Premier League is another matter.\nLiverpool could certainly do a lot worse than moving for Gallagher, who’s proven that he can make his mark in the English top flight, scoring 12 times in 92 appearances in the division (Transfermarkt).\nHe’s also had plenty of exposure to the Champions League this season, featuring eight times in Chelsea’s run to the quarter-finals and starting the 0-2 home defeat to Real Madrid last night as the Blues exited the competition (Transfermarkt).\nHowever, if his preference is to remain in or near London – as Jones has suggested – that could unfortunately make it rather difficult to persuade him to Merseyside.",
  "word_count": 377,
  "scraped_at": "2026-02-14T01:55:54.948164",
  "_text_extracted": true
}