{
  "article_id": "2baedab62688",
  "url": "https://theathletic.com/4386218/2023/04/06/barcelona-real-madrid-copa-del-rey/",
  "title": "Barcelona will still win La Liga – but this Clasico defeat is going to sting for some time",
  "date": "20230406T073000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was a moment towards the end of Barcelona’s 4-0 thrashing by Real Madrid that summed up the entire match for the hosts.\nWith five minutes left plus stoppage time at the Camp Nou, Barca’s Ronald Araujo made his way towards Vinicius Junior and engaged in a heated argument before pushing the Madrid player to the ground. With that, it was clear this particular Clasico was over for Xavi’s side.\nAdvertisement\n“Every time we play each other, it’s a very healthy duel,” Araujo said afterwards. “Today I got a bit annoyed because he (Vinicius Jr) was talking to the fans and annoying my team-mates the whole game. He’s a great player, but he has to focus on playing more. If he dedicates himself only to playing football, he’s going to be even better.”\nThe head-to-head duels between the Brazil forward and the Uruguay defender have become a key feature of recent Clasicos, with Araujo playing at right-back to counter Vinicius Jr’s threat. It has always been a rivalry between two players with a shared respect that has fascinated fans of both clubs — and that Araujo has usually won.\nWhen Vinicius Jr stared Araujo down following last night’s argument, however, it signalled the end of the struggle between Barcelona and Real Madrid for 2022-23 after a total of five Clasicos this season.\nOnly half of the near-95,000 people in attendance at the Camp Nou were still present for the final whistle. By the time Karim Benzema completed his hat-trick, as Madrid overcame a 1-0 first leg deficit to cruise into next month’s Copa del Rey final against Osasuna, the stadium had emptied of many disillusioned fans.\nBarcelona forward Ansu Fati quickly left the field of play while team-mate Alejandro Balde rested his hands on his thighs and kept his eyes firmly fixed on the turf. Gavi put his hands on his hips and appeared inconsolable as he made his way to the tunnel.\nSergio Busquets — acting as captain — tried to encourage his team-mates. This had been his 10th Clasico in the Copa del Rey, and was possibly his last. If he does decide to leave when his contract expires in the summer, this was a cruel way for the Barca-Madrid rivalry’s record appearance-maker to go out.\nGO DEEPER\n‘Busquets won’t be eternal’ – Barcelona's plan to replace a legend\nAll around, there were looks of disbelief as players headed for the dressing room.\nMadrid had advanced to the Copa del Rey final for the first time since 2014, by embarrassing Barca in their own backyard. It was the first time Madrid had scored four in a game against their arch-rivals since May 2008 (a 4-1 win in La Liga) and the first time they had done that at the Camp Nou since January 1963 (a 5-1 league victory).\nAdvertisement\nAll in what will be the last Clasico at this famous old stadium for some time, as it shuts down this summer for extensive renovations that will see Barcelona play their home games elsewhere all next season at least.\n“It’s a heavy defeat that hurts us, the Barca supporters and me as coach and the man in charge,” Xavi said. “We have to be united after a complicated night to digest, we competed better than the result says, the second half penalised us a lot.”\nXavi will have to forget about a potential La Liga-Copa del Rey double now, but what will sting Barcelona the most is that this was a totally unexpected result, for several reasons.\nOne, because the Catalan giants had been far superior in last night’s first half. Despite having important players out injured, they pinned Madrid in their own half with intensity and high pressing. Vinicius Jr’s goal before half-time was a surprise, but not a concern for the Barcelona fans, who had seen how well their team were playing compared to their 1-0 first leg win at the Santiago Bernabeu last month.\nTwo, because those supporters have become used to seeing their team play with an incredibly solid defence. Barcelona have conceded just nine league goals this season — the fewest of any team across the top flights in Spain, England, Germany, Italy and France. Only two of those have come at the Camp Nou… one a penalty and the other an own goal. However, Madrid have now scored nine goals against their arch-rivals in all competitions this season.\nThree, because Xavi seemed to have got the measure of Madrid counterpart Carlo Ancelotti. He had beaten the Italian in the clubs’ previous three encounters, with his side playing in a variety of ways to get those wins. They had put on an exhibition in the Supercopa de Espana final in January, ground out a 1-0 win in the first leg of this semi-final and shown their efficiency in the most recent league Clasico three weeks ago.\nGO DEEPER\nBarca's Franck Kessie and Sergi Roberto may have won La Liga. You had to be there\nFour, because the players seemed to let their heads drop as Madrid’s goals kept flying past Marc-Andre ter Stegen into the net. It was a defeat that had as much to do with mentality as football — and it had previously seemed as if Barcelona had got rid of those problems this season.\nAdvertisement\nAnd finally, because they conceded four times at home to a side who have been inconsistent this campaign and who trail them by 12 points in La Liga.\nThis defeat hurts in Barcelona because, having been eliminated from the Champions League at the group stage and then the Europa League play-offs to qualify for the last 16, they seemed to have recovered from those blows and found a way to be dominant at home. Instead, they were undone in a way they hadn’t been for some time.\n“If we win La Liga and the Supercopa de Espana it will be a good season,” Xavi said. “If we win those two titles, what happened today won’t tarnish the season.”\nBut this loss will sting for some time — just as it did for Madrid when Barcelona beat them by the same scoreline at the Bernabeu in La Liga last season. More concerning for fans will be how they have previously suffered in the immediate aftermath of big defeats this campaign, such as when they lost 1-0 away to struggling Almeria three days after being knocked out of the Europa League by Manchester United.\n“Madrid have a great team, it’s no coincidence that they have won the Champions League, they showed it today,” Xavi added. “The message is that we won 4-0 a year ago and didn’t win anything, this year we lost 4-0 but we can win La Liga and we have already won the Supercopa.”\nThe looks on the Barcelona players’ faces at the end of last night’s game said it all.\nAll that is left to do is count down the league games until they are crowned champions for the first time in four years. But this thrashing will provide an uncomfortable caveat.\nGO DEEPER\nReal Madrid's gamble on the right may have cost them La Liga — here it dismantled Barcelona\n(Top photo: Lluis Gene/AFP via Getty Images)",
  "word_count": 1204,
  "scraped_at": "2026-02-14T02:09:52.180716",
  "_text_extracted": true
}