{
  "article_id": "2baf71d6ccf8",
  "url": "https://www.thenews.com.pk/latest/1161178-why-did-cristiano-ronaldo-lionel-messi-give-away-their-golden-ballon-dor-trophies",
  "title": "Why did Cristiano Ronaldo , Lionel Messi give away their golden Ballon dOr trophies ? ",
  "date": "20240224T163000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why did Cristiano Ronaldo, Lionel Messi give away their golden Ballon d'Or trophies?\nCristiano Ronaldo, Lionel Messi have very few commonalities, giving away their trophies is one\nCristiano Ronaldo and Lionel Messi have a lot in common despite having separate legendary careers that included several Ballon d'Or victories.\nThough for different reasons, the two similarly have a habit of giving away all of their golden balls. After winning the World Cup, contributing to Paris Saint-Germain's victory, and having a significant impact on Major League Soccer with Inter Miami, Messi set a milestone by collecting a record-breaking eighth Ballon d'Or last year, according to The Mirror.\nLike Messi, Ronaldo did not keep any of his five Ballons d'Or in his own trophy case. He earned his final one in 2017. Rather, all 13 Ballon d'Ors that the former Barcelona and Real Madrid stars have together won have been donated.\nMessi has all eight of them at Barcelona's museum at Camp Nou, including the final one he won back from the team as a token of gratitude for their part in his career. On the Portuguese island of Madeira, Ronaldo has a private museum where he has kept four of his five Ballon d'Or awards.\nRonaldo's trophies have been donated to celebrate his accomplishments on the island where he was born and raised, rather than honouring the legacy of a club. Nevertheless, he decided to give the Make-A-Wish Foundation, which grants wishes to kids facing terminal or life-limiting illnesses, his 2013 trophy.\nIn addition, Atletico Madrid co-owner and richest man in Israel, Idan Ofer, paid £513,000 for a piece of football history when the award, which was Ronaldo's second, went up for auction in London in 2017.\nRonaldo defeated Messi and Franck Ribert to win the prize, garnering a 28% vote share, despite Real Madrid's failure to win either La Liga or the Champions League that season.\nAt the height of his abilities, the Portuguese player (who currently plays in the Saudi Pro League for Al-Nassr) scored 55 goals in 55 games across all competitions during the 2012–13 season.\n-\nBreezy Johnson engaged at Olympics after emotional finish line proposal\n-\nOlympics men hockey game: McDavid, Crosby power Canada past Czechia\n-\nEx-Arsenal footballer Thomas Partey charged with additional rape counts\n-\nChloe Kim set for historic halfpipe gold showdown at Milano Cortina\n-\nVladyslav Heraskevych disqualified from Winter Olympics 2026 over helmet controversy\n-\nThomas Tuchel set for England contract extension through Euro 2028\n-\nMilano-Cortina 2026: Assessing Italy’s Winter Olympics economic growth\n-\nVictor Wembanyama’s historic first half tops Tim Duncan, sparks massive NBA reactions",
  "word_count": 435,
  "scraped_at": "2026-02-14T02:13:34.143763",
  "_text_extracted": true
}