{
  "article_id": "2bb621439036",
  "url": "https://www.thecable.ng/kills-everything-home-based-oliseh-criticises-exclusion-of-npfl-players-from-afcon-squad",
  "title": "  Kills everything home - based  -- Oliseh criticises exclusion of NPFL players from AFCON squad",
  "date": "20231222T081500Z",
  "domain": "thecable.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sunday Oliseh, former Super Eagles captain and head coach, has faulted the absence of outfield players of the Nigeria Premier Football League (NPFL) from the country’s provisional list for the upcoming African Cup of Nations (AFCON).\nOn Wednesday, the Nigeria Football Federation (NFF) officially released the Eagles’ 40-man list for the forthcoming continental tournament in Ivory Coast.\nThe list includes six goalkeepers, 13 defenders, eight midfielders and 13 forwards.\nOnly three goalkeepers in the squad are from the NPFL: Amas Obasogie of Bendel Insurance, Ojo Olorunleke of Enyimba and Sporting Lagos’ Christian Nwoke.\nAdvertisement\nThe exclusion of outfield Nigerian league players spurred a heated debate on social media, particularly among journalists.\nAdding his voice to the debate, Oliseh, in a post on his X account on Thursday, said the absence of home-based players could be excused if Nigeria had “superstars like in the 90s and early 2000s playing at the very top world club sides, champions league”.\nHe then described the exclusion of NPFL players in the Eagles’ AFCON list as an attempt to “kill everything” that is “home-based in favour of football business”.\nAdvertisement\n“If we had superstars like in the ’90s and early 2000s playing at the very top world club sides, Champions League, etc, one could understand the absence of home-based in a 40-man call-up,” Oliseh wrote.\n“Haba, dem just want kill everything wey be home-based in favour of football business! Time we acted!!”\nJose Peseiro, Super Eagles head coach, is expected to chisel down the 40-man list to 27 players before the January 3, 2024, deadline.\nThe 34th edition of AFCON is billed to kick off on January 13, 2024, in Ivory Coast.\nAdvertisement\nThe Super Eagles of Nigeria are in Group A alongside the hosts, Equatorial Guinea and Guinea-Bissau.\nNigeria will take on Equatorial Guinea in their opening game before facing Ivory Coast and rounding off the group stage with the Guinea-Bissau tie.",
  "word_count": 318,
  "scraped_at": "2026-02-14T02:10:33.591610",
  "_text_extracted": true
}