{
  "article_id": "2be49f627b96",
  "url": "https://www.teamtalk.com/arsenal/ramp-up-e80-million-double-signing-contact-made-lethal-striker-explosive-winger-eyed",
  "title": "Arsenal transfers : Gunners ramp up €80m double signing as  contact made  for lethal striker and  explosive  winger eyed",
  "date": "20250215T154500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal ramp up €80m double signing as ‘contact made’ for lethal striker and ‘explosive’ winger eyed\nArsenal have ‘made contact’ for the potential signing of Atalanta striker Mateo Retegui and are also hoping to land Spanish talent Yeremay Hernandez, according to reports.\nSources have confirmed to TEAMtalk that Arsenal are gearing up for a big summer as they look to hand Mikel Arteta a squad capable of winning the Premier League and Champions League. Arsenal remain in the mix for the Premier League title this season but must catch favourites Liverpool, who have a seven-point lead prior to Saturday’s matches getting underway.\nArsenal bolstered their defence and midfield last summer by bringing in Riccardo Calafiori and Mikel Merino, but they had a quiet January window and did not sign any senior players.\nThis means Arteta will have plenty of money to spend in the summer, with a centre-forward and winger both wanted.\nAs per the latest from CaughtOffside, Arsenal have stepped up their attempts to capture a new striker by ‘making contact’ with Atalanta over Retegui.\nThe Italy star has been in ‘superb’ form this season, having netted 23 goals in 34 appearances so far, and this has caught Arsenal’s attention.\nArsenal and Manchester United are the clubs showing the ‘strongest interest’ in Retegui, but it is Arteta’s side who have moved first.\nAtalanta have told the Gunners they will need to pay €60million (£50m / $63m) to sign Retegui. That is a fee well within Arsenal’s reach and Emirates chiefs are now expected to draw up a suitable offer.\nThe report states that Paris Saint-Germain, Aston Villa, Juventus and Napoli like Retegui too, but Arsenal are in a good position to win the transfer chase.\nArsenal also pursuing Spain U21 starlet\nA separate report from Spanish source Fichajes has outlined Arsenal’s interest in another attacker, Deportivo La Coruna winger Yeremay.\nHe is a Spain U21 international who mainly operates as a left winger but can also play on the right flank or as a No 10 if needed.\nYeremay is an ‘explosive’ player who looks to take opponents on before shooting or setting up a team-mate, and Arsenal have identified him as a target to bolster their winger ranks.\nArsenal are showing ‘great interest’ in Yeremay and are ready to ‘bid strongly’ to secure his services.\nDeportivo – who currently play in Spain’s second tier – want €20m (£16.7m / $21m) before selling their prized asset.\nYeremay has chipped in with nine goals and three assists in 23 matches for Deportivo this campaign and is also on Chelsea’s radar.\nDON’T MISS: Sublime forward ‘tells team-mate he’s joining Arsenal’ after Arteta ‘accelerates’ talks\nArsenal transfers: Kane sent advice; Real Madrid raid\nMeanwhile, Louis Saha has given his verdict on Bayern Munich striker Harry Kane completing a shock move to Arsenal.\nSaha says he ‘could never’ see the Tottenham ‘legend’ joining Arsenal, even if he does ‘prefer the lifestyle in London’ (to Bavaria).\nArsenal might have to deal with a big offer from Real Madrid this summer for centre-back William Saliba.\nFabrizio Romano has revealed that Madrid view Saliba as the ‘Jude Bellingham of defenders’, though Arsenal consider him a ‘crucial’ player for the future.\nIN FOCUS: Who is Mateo Retegui?\nWhen Retegui was first called up by Italy in March 2023, he was seen as an unorthodox solution to their striker shortage. Few, at the time, would have been able to predict how he would develop over the next couple of years – precisely because not many Italians will have known who he was.\nIndeed, Retegui was born in Argentina and was still playing his club football in South America when his international call-up – made possible because of his grandparents – arrived.\nYet Retegui made the most of it, scoring on his debut against England and then his second cap against Malta: the first Italy international to score in both of his first games for the country since 1968.\nThe striker earned a move to Serie A with Genoa in the summer of 2023 and by the end of the season – after scoring nine goals from 31 games – was named in Italy’s Euro 2024 squad.\nAnd since a summer transfer to Atalanta, the attacker’s form has exploded. By the end of November, Retegui has 14 goals from 19 games to his name – including his first two Champions League goals.\nA turbocharged striker willing to work on or off the ball, Retegui is just over 6′ tall and makes the most of his physicality. He is capable of leading a line himself or playing in a strike partnership, thanks to his ability at playing with his back to goal or when charging forwards.\nAnd with predatory instincts in front of goal, his hunger is converting into a lethal goalscoring rate.\nAreas to improve include his control of the ball, but the variety of ways he can finish chances make him a major threat up front. Of his first 14 goals for Atalanta, five have been right-footed, three left-footed, four headers and two penalties.\nAt the age of 25, Retegui is approaching his peak years and it appears he could be playing at a higher level than anyone would have predicted when he was a diamond in the rough in Argentina.",
  "word_count": 888,
  "scraped_at": "2026-02-14T01:52:15.337792",
  "_text_extracted": true
}