{
  "article_id": "2c22b371835d",
  "url": "https://www.gdnonline.com:443/Details/1336683/Riffa-upbeat-ahead-of-Al-Arabi-challenge",
  "title": "Football : Riffa upbeat ahead of Al Arabi challenge",
  "date": "20241105T000000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bahrain's Riffa are set to lock horns with Al Arabi of Qatar tonight in the 2024-25 AGCFF Gulf Club Champions League.\nThe match is scheduled for an 8pm kick-off and it will be played at Khalifa Sports City Stadium in Isa Town.\nIt will be both teams’ second fixture in Group B of the eight-team competition’s preliminary round, and Riffa will be looking to bounce back from a 1-3 defeat in their opening assignment of this stage against Al Ettifaq of Saudi Arabia, played last month in Dammam.\nRiffa head coach Hitham Jatal from Syria said that his side is ready for the match and that they are hoping to put on a good performance in front of their home crowd.\n“Our preparations started immediately after the completion of our league schedule and we are well-prepared,” Jatal said last night through an interpreter during his pre-game Press conference at the match venue.\n“Our players have had enough recovery time ahead of this game.\n“We know that Al Arabi are not an easy team, but we will do our best. We have the determination to win this championship, and we want to do well to make our fans happy.”\nRiffa midfielder and Bahrain international Ali Haram is looking forward to getting a home-field boost in the contest.\n“This is a very difficult group and we are expecting a tough match tomorrow,” Haram said through the interpreter during the same conference.\n“We will be amongst our people and in a field that we are accustomed to, so hopefully we will play much better here than if we were outside Bahrain.”\nMeanwhile, Al Arabi head coach Anthony Hudson, who coached Bahrain’s under-23 Olympic and senior men’s national teams during the first half of the 2010s, is upbeat ahead of the game despite having faced some recent challenges with their squad.\n“In the last two or three weeks we’ve been missing some key players but they’ve returned, and then we’ve had suspensions and a couple of injuries, but we arrive here with a team that I am fully confident with,” Hudson said in his own Press conference.\n“We have enough information about Riffa from the games they’ve played so far and I am familiar with some of their players.\n“Tomorrow is going to be a tough game, Riffa are a good team – an organised team – and every match away from home like this is going to be difficult.”\nRiffa, Arabi, and Ettifaq are joined in Group B by Al Qadisiya of Kuwait. Group A features Al Nasr of the UAE, Ahli Sanaa of Yemen, Dhofar of Oman, and Duhok of Iraq.\nThe competition is being organised and run by the Arabian Gulf Cup Football Federation (AGCFF) and is in its new format this season.\nFollowing tonight’s fixture, Riffa host Qadisiya on November 27. They then fly to Kuwait City for their return match against Qadisiya on December 4, which will be their last fixture in the tournament this calendar year. They resume their campaign on February 5 at home against Ettifaq, before flying to Doha to wrap up their schedule against Arabi on February 18.\npatrick@gdnmedia.bh\nTop stories for today:\nCar crash death suspects ‘were in abnormal state’\n‘Connecting People’ focus on labour rights\nA regional hub for investments",
  "word_count": 547,
  "scraped_at": "2026-02-14T02:11:20.856930",
  "_text_extracted": true
}