{
  "article_id": "2c34676d693c",
  "url": "https://theathletic.com/5151306/2023/12/26/jose-mourinho-roma-manager-future/",
  "title": "Jose Mourinho : the future or a Roman relic ? ",
  "date": "20231226T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“The day I go, I’m taking it with me,” Jose Mourinho vowed.\nRoma’s owners, the Friedkin family, bought him a Vespa shortly after his appointment. It’s the same model of scooter as the one he is riding in a piece of street art by Harry Greb, depicting Mourinho as Gregory Peck’s character in 1950s movie Roman Holiday, but with a scarf in the club’s red and yellow around his neck and a sticker of the Lupetto, their wolf’s head crest, on the fender.\nAdvertisement\nParked in Roma’s Trigoria training ground, Mourinho recently said there’s space for it “because there aren’t many cups” taking up room. Mourinho, as he recently reminded city rivals Lazio’s coach Maurizio Sarri, has accumulated a personal collection of 26 in his career. Roma count only 16 in almost a century of existence.\nAmong them is a “cup and a half” delivered by Mourinho; the inaugural Europa Conference League trophy and memories of a Europa League final lost, unjustly in his opinion, on penalties to Sevilla in May this year. At the end of that shootout, Mourinho got a lift down to the parking lot and shouted “it’s a f***ing disgrace, man” at the match officials.\nBack on the pitch, he huddled his players together in front of the Roma fans, told them he was proud of them, and, amid fevered speculation about his future, gestured his intention to stay by pointing to the turf on which he stood, eliciting cheers from the crowd. As he ventured down the tunnel, he tossed his runners-up medal to a kid to complete the Mourinho show.\nWhen Mourinho joined Roma two and a half years ago and took his gifted cream Vespa for a spin around Trigoria, he insisted that, unlike Audrey Hepburn in that film, he was not in Italy for a Roman “holiday”.\nAt the time it was hard to envision him being around for long.\nManchester United had sacked Mourinho in December 2018 after two and a half years. Tottenham then got rid after 18 months. Some thought Mourinho might have gone quicker at Roma after the humiliating 6-1 defeat to Norway’s Bodo/Glimt early in his first season. In the end, Mourinho may not only see out his contract, which expires in June – he actually desires to go beyond it.\nNever before has he committed to a club for more than three campaigns. This time last year, he claimed to have turned down the chance to manage his motherland of Portugal following the World Cup. “Hearing him say I was the only man for the job and that he would have done everything possible to bring me home was very nice,” Mourinho said, in reference to the president of the Portuguese football federation.\nAdvertisement\nThen, in the summer, Mourinho told a story, without naming the Saudi Pro League let alone specifying one of its clubs, about receiving “the biggest offer, the craziest ever made to a coach in the history of football and I turned it down. I turned it down because I had given my word to my players, my fans and my owner.”\nLoyalty is one of those old-school values that dies harder in Rome than elsewhere in football. Roma are the club of Francesco Totti, who rejected Real Madrid and far greater prospects of winning the Champions League and the Ballon d’Or to stay in his hometown.\nMore than anyone else, Mourinho has filled the vacuum left by Totti’s personality cult since his 2017 retirement. It is the perfect place for him – the Eternal City, once bent to the will of ambitious generals out to become emperors. If the Stadio Olimpico was sold out 36 games in a row it was only partly down to a competitive ticketing strategy. The rest was down to Mourinho.\nDuring an underwhelming 1-1 draw with Fiorentina earlier this month, when the nine men of Roma were fortunate to scrape a point, a banner emerged in the stadium’s Curva Sud (South Stand). “Eyes inebriated by red and yellow,” it read. “A soul pervaded by Romanness. Jose Mourinho for life.”\nA soon to be 61-year-old from Setubal, just south of Lisbon, is now considered one of them. And he does understand them. Mourinho keeps handing debuts to academy graduates — 13 in total — presumably because he has seen the old choreography in the Sud depicting all the Romans to have played for Roma. He appreciates how much it means to the fans to watch the team and see their city reflected back at them.\n“The situation here is different from all the others,” he said, knowing exactly what he was doing.\n“I’ve given debuts to players at all the clubs I’ve worked in. But the boys here are Roma fans. They all are — with the exception of Joao Costa, who came here from Brazil. The rest are Romanisti, they’re kids who used to show up outside the training ground hoping for an autograph or go to games.\nAdvertisement\n“They experience it differently. When (19-year-old) Niccolo Pisilli scored (on his senior debut against Sheriff Tiraspol, in this month’s Europa League group finale) he ran under the Curva and cried. He cried in the dressing room. I had to step outside, otherwise I would have cried too.”\nMourinho has not, as club legend Daniele De Rossi feared, become “fed up” with the fans and the media after two and a half years back in Serie A. Far from it: nobody could argue that having him in charge of Roma has been anything other than a good thing.\nOnly last weekend, Sky Italia’s sideline reporter Marco Nosotti had to apologise to his colleague Angelo Mangiante, the channel’s man in Rome, after he was caught off-mic saying Mangiante was an “a**e licker” for the way he framed a question to Mourinho after a 2-0 away defeat against Bologna.\nThe awkwardness one imagines at the Sky Italia Christmas party speaks to the context of awe that still surrounds Mourinho. Not even Roma’s last title-winning coaches, Nils Liedholm (1982-83) and Fabio Capello (2000-01), achieved the kind of adulation he enjoys, which overflows into idolatry.\nThe sense among the fans is they’re lucky to have him; that, without him, players such as Paulo Dybala and Romelu Lukaku would never have joined Roma. And to the league, Mourinho is its one transcendent star, the only personality in the division whose words and actions make headlines around the world.\nWhen he left the first time around, for Real Madrid in the summer of 2010, it was as a treble winner with Inter. No Italian club then lifted a European trophy until he returned and won the inaugural Conference League in his debut year with Roma. It was the club’s first piece of silverware in 14 years, their first European final since 1991 and winning it brought more than 100,000 fans onto the streets to see Mourinho pass by the Colosseum on an open-top bus. He swiftly followed it up by reaching the Europa League final.\n“It was the first time in Roma’s history the club made back-to-back European finals,” Mourinho knowingly observed. “So you can imagine how hard that was. If you think about the number of teams that have done three in a row, you’re going to find legendary teams. If you say to me, ‘Are you going to have a go?’. We’ll have a go.”\nAdvertisement\nHow curious, then, that Roma’s American owners, the Friedkins, seem in no hurry to offer this Imperator a contract extension. Six months now remain on Mourinho’s deal and yet fears of a Saudi-backed Newcastle United or even old flames Chelsea coming in for him are not urging them into action. Although, why rush if Mourinho is sincere about his desire to stay?\nIt’s an uneasy situation, unprecedented for Mourinho, too. At other clubs, he has usually been rewarded with a contract extension on the back of success in his first year. But not in Rome. By his third year in previous jobs, he has either left in triumph or been sacked after everything turned toxic — “A Mourinho season” to borrow his 2016 Chelsea successor Antonio Conte’s description.\nWhat’s unique about the present is Mourinho asking for permission to stay on. “I want to carry on coaching here,” he said after the weekend’s loss.\nHe’s even willing to make concessions. “With our financial fair play (FFP) limitations, we need to invest in youth and potential rather than in established players with no room for improvement. I’ve spoken to the owners and I want to continue to manage Roma. The fans are one of a kind. Separation would be hard for me and if it were to happen it wouldn’t be my decision.”\nThis is simultaneously a sign of weakness, a bending of the knee, but also an immense power play because Mourinho knows the supporters will take his departure almost as badly as the previous owner’s decision to retire Totti. It is Julius Caesar refusing to give up his army and renounce his Imperium.\nIf the Friedkins do intend to make a change, they’ll have to risk a popularity slump.\nJustification isn’t lacking. In three and a half years of ownership, they have spent more than €800million on acquiring the club, injecting money into the project and delisting Roma from the stock exchange. It’s a similar figure to what Inter’s embattled owners Suning invested, without a more commensurate return on the pitch as happened at San Siro.\nThe Friedkins made Mourinho the highest-paid coach in the league. The transfer spend in his first summer, which included a borderline club record fee for Tammy Abraham, was €113million (£98m; $124m) net at a time when football was only beginning to emerge from the pandemic years. The wage bill, by some estimates, is Serie A’s third-biggest. What return have the Friedkins got for all that?\nAdvertisement\nTo the fans, the memories Mourinho made by winning the Conference League and making a Europa League final 12 months later are close to the maximum. Intangibles like pride are through the roof and the passion does have a tangible manifestation in gate receipts and merchandise sales. But what if these achievements, such as lifting what Lazio supporters term a ‘coppetta’ — a tin-pot trophy, the least prized of UEFA’s three club competitions, that didn’t exist until two years ago — are really the minimum in terms of bang for the Friedkins’ buck.\nSuch are the economics of modern football that sustainability tends to come before stacking up less renowned silverware, and while finishing in the top four brings less prestige than parading a trophy down Via dei Fori Imperiali, it opens up project-pivoting revenue.\nAnd Roma need revenue.\nLook at their losses for the last four years: €204million in 2019-20, €185m in 2020-21, €219m in 2021-22 and an estimated €102m last season. Some of the red ink is down to Covid-19 and the mess successive now former sporting directors Monchi and then Gianluca Petrachi made of things. But the net transfer spend in Mourinho’s first season also goes some way to explaining the strict FFP settlement agreement imposed on the club.\nFinishing sixth twice in a row (Juventus’ 10-point deduction bumped Roma up from seventh last season) is disappointing and they sit in the same position now.\nItalian clubs who spent time outside the Champions League (as was the case with Roma when Mourinho took over) have emphatically bounced back. Lazio, who have finished above Roma in both seasons of Mourinho’s tenure, losing only one of the five derbies so far, missed qualification in 2020-21 and 2021-22 but returned last season as Serie A runners-up.\nNapoli fell short of the Champions League in 2019-20 and 2020-21 but made it back in 2021-22 by finishing third under a former Roma coach in Luciano Spalletti and with some former Roma players plus guys signed from Empoli, Fulham, Fenerbahce and later Dinamo Batumi in Georgia. They then won the league last season, becoming the fourth different champions in four years. Could Roma not have challenged for the Scudetto, particularly when its past two winners, Napoli and AC Milan, managed it on smaller wage bills than theirs?\nAdvertisement\nThen again, it’s almost a decade since Mourinho won a league championship (with Chelsea in 2014-15) and while some would argue his subsequent clubs — United, Spurs and Roma — have not been in any position to contend, it is worth remembering that as the 20th anniversary of his Porto side winning the Champions League approaches, this is a man for whom impossible was nothing.\n“I am a victim of all I have done before,” Mourinho said at his unveiling as coach of Roma. “I am a victim of how people look at me now, unfortunately.”\nNot through the inebriated eyes of the Romanisti, who see him as their hero he isn’t. Nor through those of his players. Mourinho has struck up an empathy with this group of ragazzi, who have been able to take his brand of tough love in ways the squads at United and Spurs couldn’t. The number of late goals Roma score is proof of the bond between them.\nTeam spirit did not fracture when he dropped five players after that 6-1 defeat against Glimt and then sold four of them; nor when he claimed after a defeat to Sassuolo that the team had been “betrayed by a player”; nor when he called Abraham “privileged”; nor when he questioned the pain threshold of their injured players; nor when he brought on Renato Sanches and took him off 18 minutes later in that recent loss to Bologna.\nReaching those two finals has eclipsed the embarrassment of defeats to newly-promoted teams, to Glimt (twice), Ludogorets and Slavia Prague, and a home Coppa Italia exit to relegation-bound Cremonese. It has been used in mitigation for the behaviour of Mourinho and his staff towards match officials which has led to more than 20 sendings off for him and his assistants, and thousands of euros worth of fines.\nLowlights include Mourinho wearing a wire to protect himself from referees and fourth officials and giving an entire post-match interview to Italian broadcaster DAZN in Portuguese, because evidently his Italian isn’t “polished enough” after he was placed under investigation for saying the designated referee for Sassuolo-Roma “does not have the emotional stability for a game of this level”.\nRoma have, in some respects, allowed Mourinho to be the full Mourinho and whatever you make of the football — it’s pretty much what you’d expect, only with a back three — he is entitled to channel Maximus Decimus Meridius and ask, “Are you not entertained?”. He still has ‘rizz’ aplenty and the Premier League misses his personality.\nAdvertisement\nBack on the pitch, the team is only three points from the top four, and fifth may be enough to qualify for the Champions League if Serie A maintains its place at the top of the UEFA co-efficient table. The trouble is Roma, currently sixth, next face Juventus, Atalanta and Milan in the league. Given they have only won four of 26 games against the top six in Mourinho’s two and a half years it’s hard to expect much, especially in Turin and San Siro, as Roma’s away form has been poor, losing half their eight games and only scoring nine goals.\nRegardless of injuries to Abraham and Chris Smalling, the many suspensions, the late-August arrival of Lukaku on loan from Chelsea and the brittleness of Dybala — the latter pair former Serie A MVPs with other clubs — Roma shouldn’t be in midtable or finishing second in a Europa League group featuring Slavia, Swiss side Servette and Sheriff, who play in the Moldovan league.\nAs January nears, the Friedkins could drop by the Temple of Janus in the Roman forum.\nThe god of two faces, Janus looks both to the past and to the time ahead.\nIs Mourinho the future, or a relic?\nMourinho claims he is willing to change for the club. At his unveiling, on the Caffarelli terrace overlooking the city, he talked about “time”. “In football, the word doesn’t seem to exist,” he said. “But here it does. What the ownership want is not success today and then problems tomorrow. They want to create a sustainable system. They want to leave a legacy.”\nBut is repeatedly not qualifying for the Champions League sustainable on this wage bill, and with his salary without the tax break?\nWhat kind of legacy is a team with an average age of 29.3 (without Smalling, Lukaku and Dybala) when Bologna, with their young coach and fresh team (24.6), are not only beating you but threatening to take the Champions League place you covet, too? Populism aside, what use is promoting kids if, as was the case with Benjamin Tahirovic, Cristian Volpato and Filippo Missori, they end up being sacrificed on the transfer market to help the club become FFP compliant?\nAdvertisement\nRoma’s general manager, Tiago Pinto, has skilfully built some flexibility into the squad ahead of next summer. Rui Patricio and Leonardo Spinazzola are on course to be out of contract, and the loans of Lukaku, Sardar Azmoun, Diego Llorente and Rasmus Kristensen will be over. Free-transfer signings Evan N’Dicka and Houssem Aouar could be sold for profit.\nThe relative potential to reshape the team and go in a different direction is there, if the Friedkins so decide.\nMeanwhile, Mourinho’s Vespa waits on its kickstand, poised for another spin over the bumpy cobbles in the event his Roman holiday is extended. Equally, it could be shipped home to London. The future is uncertain.\nMourinho calls to mind Jep Gambardella, a character in Paolo Sorrentino’s Oscar-winning 2013 film The Great Beauty, which captures the decadence of Rome like no other motion picture.\n“We’re all on the brink of despair,” he says. “All we can do is look each other in the face, keep each other company, joke a little… Don’t you agree?”.\n(Top photo: Alessandro Sabattini/Getty Images)",
  "word_count": 3000,
  "scraped_at": "2026-02-14T01:56:38.138418",
  "_text_extracted": true
}