{
  "article_id": "2c3d1cb4e99a",
  "url": "https://punchng.com/napoli-have-won-important-matches-without-osimhen-spalletti/",
  "title": "Napoli have won  important matche without Osimhen – Spalletti",
  "date": "20230411T201500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Coach Luciano Spalletti on Tuesday said Napoli had won ‘important matches’ without Victor Osimhen as the club prepare for the Champions League quarter-final, first leg match against AC Milan after the Super Eagles striker failed to recover from a thigh injury.\nNapoli’s star player and Serie A’s top scorer had been in a race against time to play in Wednesday’s fixture at the San Siro and was left out of the squad before Spalletti’s outfit travelled to Milan.\nNapoli have been hammered at home by Milan and earned an unconvincing win at lowly Lecce since Osimhen picked up his injury on international duty.\nBut Spalletti pointed to his team winning every game when Osimhen was last injured in the autumn as evidence the absence of the 24-year-old will not hurt his side.\n“The strength of a team is never just the sum of its various parts. It’s the sum of all its qualities, how they co-exist and the way the team works together.\n“Our team up to now has shown it can play regardless of the formation picked at the beginning of the match… We’re at this point because we’ve won important matches without Osimhen, so I expect the same thing,” Spalletti told reporters.\nTaking Osimhen’s place could be Italy’s Giacomo Raspadori who did participate with the rest of the squad in Tuesday’s training.\nHe is Napoli’s only fit striker as Italy’s champions-elect also announced on Tuesday that Giovanni Simeone had suffered a hamstring injury.\nTurkish coffee with Guardiola\nSimeone had come on for Raspadori as a second-half substitute in Napoli’s 2-1 win at Lecce on Friday before having to leave the field injured in the final 10 minutes.\n“I need to assess Raspadori because he’s only had today for proper team training. We’ve got another half a day in which to see who will play in that position,” Spalletti said.\nSpalletti also had time to launch a cheeky reply to Pep Guardiola, who on Monday joked to reporters that he did not want to speak about Napoli because Spalletti was “sensitive”.\nThe 64-year-old was not impressed when, after Napoli beat Eintracht Frankfurt in the last 16, he was asked if he was flattered by Guardiola proclaiming his side the best in Europe, saying it was “a game that people play to put pressure on other teams”.\nSpalletti jokingly stood up in honour of Guardiola, considered one of the all-time great coaches, while telling reporters he had “learned so many things from him”.\n“For me Guardiola is like Klopp or other great coaches… it’s an honour when a coach like Guardiola speaks well of Napoli and says nice things about how we play football,” Spalletti said.\n“If you then say that we can win Champions League that’s another thing entirely.\n“We’re not that team that has to worry about showing what it’s made of in this competition. We’ve already shown enough, we’ve got the result we wanted and that’s made history for us.\n“That said, I hope I can have a laugh with him about this with him about it (at the Champions League final in June) over a nice Turkish coffee.”\nAFP",
  "word_count": 523,
  "scraped_at": "2026-02-14T01:59:46.863979",
  "_text_extracted": true
}