{
  "article_id": "2ca4c4e446d0",
  "url": "https://www.arsenal.com/news/every-word-artetas-pre-athletic-club-presser",
  "title": "Every word from Arteta pre - Athletic Club presser",
  "date": "20250915T221500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After touching down in Bilbao for our opening game of the 2025/26 Champions League season, Mikel Arteta was whisked straight to the San Mames Stadium for his pre-match press conference.\nThe boss was asked about being back in his homeland, using last season's disappointment to push us forward, injury updates and much more.\nHere is everything he had to say:\non the feeling in the camp ahead of a new European campaign:\nWe’re excited to start again from scratch in a beautiful place, in a stadium that is going to generate something special. We’re looking forward to that and I’m very excited again to step by step build some momentum, and start to have some wins.\non team news:\n“Gabi [Jesus], Kai [Havertz], Ben [White] and Martin [Odegaard] are still out, unfortunately.\non the games becoming more around set-pieces:\nIt’s the evolution of the game. The game is faster, the spaces are smaller and everybody is trying to take advantage of other aspects of the game that are obviously key to winning football matches. In the end, you have to dominate everything nowadays in football to give yourself the best chance to win the games.\non whether he feels the rivalry towards him being an ex-Sociedad player:\n“Yes, of course. We landed in Bilbao, that’s normally where I land when I go back home to San Sebastian, it’s an hour's drive from there. All my family is from there, and you just sense the passion, the rivalry, the football atmosphere. It’s great to be here - I’ve never been in this stadium before, so it’s a good experience.\non whether Martin Odegaard is with the travelling party:\nNo, he’s back home.\non whether he will need to rotate this season:\nIt will depend on the availability of the squad and the form of the players. Unfortunately, we have a few players already out, so that is already limited in certain positions. But hopefully we’ve come to the point where the competition and the level of performance of the players is so high that we are able to do that very efficiently to win more football matches. That’s our objective.\non whether Gyokeres can be rotated:\nWell, let’s see it. Against Forest at the end, Mikel [Merino] played as a nine. We have Leo [Trossard] who can play there, we have other options and other formations that we can adjust to that. At the moment, Victor is doing really well, so I’m really happy with that.\non how Bukayo Saka’s injury is progressing:\nI think there are still quite a lot of things to go through. It’s very early to understand when and which week he’s going to be available. But he will certainly be pushing to be available as quickly as possible.\non whether we can go one step further this season and win the Champions League:\nYeah, like the rest of the teams, that have done the same [strengthen] and continue to do that and have won it on many occasions. That’s the aim in the beginning but we all know that it’s going to be a really long journey. The margins in this competition are super small and you have to be at your very best from day one to give yourself the best possible chance.\non learnings from last season:\nThat we are good enough, that we can compete against any opposition on the day. And on top of that, two things have to go your way. You need to have a full squad available when it comes to the most critical moments in the season, and then the ball has to go in at the right moment or with the right decision, it has to because the margins are so small.\non whether the squad strengthening was due to us struggling for numbers at the semi-final:\nWhen we were training and we had eight or nine fit players, or we were going to games with 13 players, and at that level it’s extremely difficult. But I think even with those conditions we did really, really well. We gave ourselves an unbelievable chance and we were very unlucky in the semi-final not to get through.\non if losing in the semi-final is driving us forward:\nWell, it is that and that moment you get deflated, you have to understand what you need to do to put yourself back in the same position and start actions that actually matter to give yourself the chance to achieve that, and that’s it. You take a lot of learnings from it. It’s painful because it’s not only what we feel, it’s about the expectation that we created and the real conviction that we had within the club, the team, that we could go all the way because we showed a very high level of consistency and quality throughout the competition and learn from it and try to be better.\non whether he feels the squad is ready to win the Champions League:\nIt’s not that simple. You are so willing to do it and you want to be better. I sense a very clear intention that they want to be better every single day and that’s the start and the end, and there is nothing else to control. Create the energy and belief amongst the players, the understanding and the feeling that we can compete against any opposition and certainly they have that.\non if his family will be at the game:\nAll of them, no, but a big majority will come and we’re looking forward to that.\non if there is pressure to win the Champions League given we’ve not done so:\nThat tells you with our long history how difficult it is because we haven’t won it yet and that’s the opportunity, that’s how I see it. The pressure is the opportunity that thrives, that energy, that willingness to be better every single day, to make decisions that are in that direction. Every decision has to be with those standards and with those expectations and let’s give us the best chance to try to do it.\non whether getting knocked out ultimately helps teams eventually get over the line:\nThe big clubs try seven, eight, nine times and they win two. So in this competition, it’s going to be one and you’ll fail much more than you succeed. That’s the nature of that, that’s the history of our club and that’s what we want to change.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1104,
  "scraped_at": "2026-02-14T02:09:24.925693",
  "_text_extracted": true
}