{
  "article_id": "2caedba7a498",
  "url": "https://www.hurriyetdailynews.com/ankaragucu-president-gets-lifetime-ban-for-punching-referee-188666",
  "title": "Ankaragücü president gets lifetime ban for punching referee",
  "date": "20231215T124500Z",
  "domain": "hurriyetdailynews.com",
  "source_country": "Turkey",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Turkish Football Federation has permanently banned the former president of a Turkish football team who punched a referee on the field moments after a game.\nThe federation late on Dec. 14 said it banned Faruk Koca, who has resigned as president of MKE Ankaragücü, for punching referee Halil Umut Meler on Dec. 11 night.\nMeler, who was discharged from the hospital on Dec. 13 with a small fracture near his eye, was attacked shortly after the final whistle of a 1-1 draw between Ankaragücü and Çaykur Rizespor in Türkiye's top league.\nThe federation had initially suspended all league games in response to the incident before announcing that matches would resume on Dec. 19 in Türkiye, which has been selected to co-host the 2032 European Championship with Italy.\nFootage showed Koca rushing onto the pitch with a group of men and knocking out Meler with a blow to the left side of his face. Meler was kicked several times in the ensuing melee.\nKoca appeared to be incensed at Meler for sending off one of his players and then awarding a stoppage-time goal that allowed visiting Çaykur Rizespor to leave the capital with a 1-1 draw.\nMeler released a statement on Dec. 12 saying Koca had threatened his life. \"Faruk Koca told me and my fellow referees: 'I will finish you.' He said, 'I will kill you,' addressing me in particular.\"\nKoca, a former member of parliament who represented Ankara for almost a decade with the ruling Justice and Development Party (AKP), later resigned as president through the club's website. Justice Minister Yılmaz Tunç confirmed Koca's arrest and questioning, along with two others involved in the incident.\nMeler is on UEFA’s elite list and has previously officiated in the Champions League, as well as taking charge of West Ham’s Conference League semi-final first leg against AZ Alkmaar last season.\nRecommended",
  "word_count": 310,
  "scraped_at": "2026-02-14T02:07:27.049765",
  "_text_extracted": true
}