{
  "article_id": "2cb3feadf53b",
  "url": "https://www.teamtalk.com/manchester-united/tim-sherwood-trolls-man-utd-duo-catching-casemiro-bug-ten-hag-special-request-to-fans",
  "title": "Tim Sherwood rips Man Utd duo apart for  catching Casemiro bug  as Ten Hag makes special request to fans",
  "date": "20240428T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd: Tim Sherwood trolls duo for ‘catching Casemiro bug’ as Ten Hag makes special request to fans\nErik ten Hag has once again come in for heavy criticism in the wake of Manchester United’s disappointing 1-1 draw at home to Burnley on Saturday, with pundit Tim Sherwood negatively comparing the performances of two of their players to under-performing Brazilian Casemiro.\nThe Red Devils have endured a bumpy old season under the Dutchman, whose job has come under serious scrutiny off the back of a hugely-underwhelming campaign. While their return to the Champions League resulted in both Galatasaray and FC Copenhagen both finishing ahead of them, the latter going through to the knockout stages with group winners Bayern Munich, it is Manchester United’s woeful Premier League campaign which has disappointed the most.\nAs a result, and with United having four games left to better their worst-ever total in Premier League history of 58 points (they currently sit sixth on 54), they have now fallen a distant 13 points adrift of Aston Villa in fourth, meaning there will be no return to the Champions League for United next season.\nMore disturbingly, they could yet only qualify for UEFA’s third-tier competition, the Conference League, further placing Ten Hag’s future as United boss in serious peril.\nAs a result, it comes as no shock to see new minority shareholder Sir Jim Ratcliffe ordering a thorough audit into the performances of Ten Hag with newly-appointed technical director Jason Wilcox set to decide whether the Dutchman should continue as boss next season.\nTo that end, the likes of Gareth Southgate, Ruben Amorim and Roberto De Zerbi have all been touted as possible successors in the United dug-out.\nSherwood digs out Man Utd midfield pairing\nResults such as disappointing 1-1 draws at home to relegation-threatened Burnley do not help Ten Hag’s cause. Having struggled to get past an even worse side in Sheffield United in midweek, eventually prevailing 4-2, the Red Devils then wasted another great chance to add another win to their season’s tally at home to Vincent Kompany’s Clarets.\nAnd while Antony eventually broke the deadlock after 79 minutes, Andre Onana conceded a late penalty which Zeki Amdouni converted to earn their Lancashire neighbours a share of the spoils.\nReflecting on the performance, Sherwood has torn into United and Ten Hag for a lack of playing style and identity, with the buck ultimately stopping with the manager.\nHowever, the pundit, speaking to Sky Sports, also feels the Red Devils failed to get a grip on the game in the engine room, with both starting midfielders Kobbie Mainoo and Christian Eriksen both withdrawn after struggling to make a telling impact.\nAccusing Mainoo and Sherwood of ‘jogging around the pitch’, Sherwood stated: “It was another bad performance. Another performance without any style or playing identity.\n“No DNA, which Dan Ashworth will be looking for when he comes in and Jason Wilcox.\n“They’ve got their work cut out there, that’s for sure. They need to see a playing identity. Ten Hag has not just come into the job, he’s been there long enough. He has his own players.\n“I can’t see what they do. In possession, they are all about moments and out of possession they are a shambles. They really are. The worrying thing is that the midfield does not run, when the ball gets played behind them their heads start wobbling.”\nTen Hag calls on Man Utd fans to go easy on young side\nSherwood continued: “That’s down to the manager telling them and identifying it.\n“Kobbie Mainoo, I like him, I really like him, but he has caught the Casemiro bug where he is jogging around the pitch. Christian Eriksen is the same – he is one of the most honest players you’re ever going to find.\n“I think it is a culture there. Not willing to run. They aren’t running enough. They need to be able to run.\n“If I was Kobbie’s agent or youth-team coach I would say to him, ‘when you first went into the team you ran around with a desire. You’re not doing that at the moment. Don’t fall into the trap of what they’re doing, you don’t have good examples there’.\n“Manchester United want to be like Arsenal and Man City but they are miles away from that.”\nWith boos ringing out around Old Trafford, Ten Hag has pleaded with Manchester United fans to stay patient with his young side.\n“We have some very young players and that’s why we built this club back,” Ten Hag said. “That takes time, and we build this by bringing in young players.\n“Rasmus Hojlund, Alejandro Garnacho, Kobbie Mainoo – they are all in the first season of the Premier League and the Premier League gets more intense year by year.\n“We have seen the data and it’s much more intense than last season, especially when you see over the last four or five seasons. Those players have to adjust and that takes time.\n“I am sorry for everyone. So, I am very impatient but there we need patience and fans they need patience. We built here a team, and they need experience.\n“The mental [side], when you get fatigue you have to keep focus until the end.\n“Also, this season there was an extra effect that they do extra time (added on). It is often seven, eight, nine, 10 minutes so bringing more minutes in the game, to keep tempo in the game as well.\n“Therefore, it is intense and more volume and that is a limit they have to cross, and they only get it by experiences.”\nTen Hag makes Champions League admission\nThe United boss has also conceded that the Champions League is out of his side’s hands now and suggests the Europa League – and Thursday night football – looks more likely for his players next season.\n“That is the facts,” said Ten Hag when asked if the Europa League looks more likely. “It is not easy to get fourth when you’re so far behind. We needed to win.\n“The past few weeks we’ve got in winning positions and then given it away. The gap is too big in this phase of the season.”\nThe United boss once again witnessed his side fail to hold on to a winning position, with their recent 4-3 loss at Chelsea – having led 3-2 heading towards full-time – leading to serious questions over their mentality as a group.\nHAVE YOU SEEN? Ten Hag sack: Five left-field contenders to become next Man Utd manager analysed\nWith Amdouni’s penalty hitting the net on 87 minutes, it was a case of another two big points dropped.\n“I’m very frustrated. In phases of the game, we did very good but in the end you have to take the three points. We gave it away and it’s very frustrating,” Ten Hag added. “We were in a winning position and again we gave the game away\n“In the final minutes of the game, it is so unnecessary.\n“We are so not lucky with the refereeing. We concede so many penalties. This one was justified, but on the other hand I have seen two or three penalty situations and at a minimum one was 100 per cent a penalty.”",
  "word_count": 1217,
  "scraped_at": "2026-02-14T02:13:49.313607",
  "_text_extracted": true
}