{
  "article_id": "2cc504fe8603",
  "url": "https://www.fourfourtwo.com/news/manchester-city-boss-pep-guardiolas-on-air-rant-to-gary-lineker-after-fa-cup-semi-final-win-vs-chelsea-unacceptable",
  "title": "  Unacceptable  – Pep Guardiola on - air rant to Gary Lineker after Manchester City FA Cup semi - final win vs Chelsea",
  "date": "20240421T013000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City boss Pep Guardiola's on-air rant to Gary Lineker after FA Cup semi-final win vs Chelsea: 'Unacceptable'\nManchester City manager Pep Guardiola used his post-match interview with Gary Lineker to go on a rant about scheduling\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City manager Pep Guardiola used his post-match interview with Gary Lineker on the BBC after Saturday's FA Cup semi-final win over Chelsea at Wembley to go on an extraordinary rant about scheduling.\nCity edged out Chelsea thanks to Bernardo Silva's 84th-minute goal, but only after the Blues had missed a number of good chances to take the lead.\nGuardiola's side looked tired after their exertions in the Champions League on Wednesday night, when they played 120 minutes against Real Madrid in the teams' quarter-final second leg and crashed out on penalties at the Etihad.\nFollowing Manchester City's 1-0 win at Wembley, Guardiola joined BBC presenter Lineker at pitchside and wasted no time in airing his grievances at having to play on Saturday when all the other FA Cup semi-finalists were free from midweek action.\n\"It's unacceptable,\" he said when asked by Lineker about the match. \"It's really unacceptable. Coventry, [Manchester] United and Chelsea don't play in the week, [but] they let us play today. Next week, on Friday it would be better. Instead of Saturday, put it on Friday to let us have a recovery.\n\"It's impossible, for the health of the players! It's not normal. Honestly, it's not normal. We didn't have the courage to tell you, to FIFA we shut up, but it's not possible. It's unacceptable – 120 minutes.\n\"All of you are football players. The emotion against Madrid, the quarter-final, we lose and everything. So honestly, I know this country, it is special for many things but it is for the health of the players. I don't understand how we survived today.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAnd when asked by Lineker if he had spoken to the Football Association to air his concerns, Guardiola replied: \"Gary, you think us demanding is going to change something? The only power I have is to say here. It's not going to change anything. I know it for many years. But why we play today and not tomorrow, with one day off, when Coventry and United and Chelsea don't play in the mid-week? Why?\n\"Why don't you have one more day for the health of the players? For me, as a manager, tell me how you prepare for this game against Chelsea in their best moment of the season? How? It's impossible. There is no chance.\"\nMore Manchester City stories\nDid Manchester City fans cost the team their place in the Champions League?\nSteve McManaman exclusive: “Manchester City are just as strong as last year – the winners of their tie with Real Madrid should become European champions”\nPep Guardiola tipped to replace Gareth Southgate as next England manager odds shift\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 682,
  "scraped_at": "2026-02-14T02:07:51.323491",
  "_text_extracted": true
}