{
  "article_id": "2cf722898f50",
  "url": "https://www.90min.com/posts/womens-world-cup-2023-group-f-players-to-watch",
  "title": "Women World Cup 2023 : Group F players to watch",
  "date": "20230618T150000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Women’s World Cup 2023: Group F players to watch\nFrance enter the 2023 Women's World Cup aiming to put an end to off-field turmoil under the guidance of a manager new to the women's game who took charge in March.\nIt's also a new era for Brazil without midfielder Formiga, who has played in every single edition of the World Cup bar one.\nMeanwhile, Jamaica and Panama will be eager to cause upsets by challenging the European and South American powerhouses.\nHere are 90min's players to watch in Group F.\n1. Selma Bacha - France\nComing through the youth ranks at Lyon, Selma Bacha has been making waves since her senior career breakthrough at 17.\nDespite missing out on the 2019 World Cup, her debut for France in 2021 paved the way for a regular starting spot.\nLast summer, Bacha showcased her talent at the Euros in her first major tournament with Les Bleus, impressing against the Netherlands in the quarter-finals especially.\nAlthough she favours playing at left-back, she can seamlessly transition to midfield or out wide, providing a constant threat to the opponent's defence.\nKnown as a player who gets things done, Bacha's magical left foot helps with her trickery and pinpoint accurate crosses. You can always count on her style, flair and pure panache on the pitch.\n2. Eugenie Le Sommer - France\nUnlike Bacha, Eugenie Le Sommer has been a France international for 14 years.\nBut under previous boss Corriane Diacre, Le Sommer was one of many who were shunned from the national team. The Lyon star was easily one of the best players in Europe and didn't get called up for nearly two years.\nAfter Diacre was sacked due to complaints about her management style, Herve Renard was brought in. He immediately reinstated several players Diacre refused to call up, including Le Sommer. The two-time AFCON winner said the team needed her \"incomparable experience\" and football intelligence.\nLe Sommer wasted no time proving Renard right. In a friendly against Colombia, she banged in two goals and showed off her high press, aggression and ability to exploit opposition weaknesses. It's no surprise she's France's top goalscorer across both men's and women's teams.\nThe 34-year-old has been out of the team for so long for off-field reasons and France have really missed her presence. This World Cup will be a chance for everyone to see she's still got what it takes.\n3. Geyse - Brazil\nGeyse is no stranger to the big stage, leaving her home country at 19 to play in Europe, first joining Madrid CFF before playing with Benfica.\nGeyse's talent was undeniable during her time at Benfica, netting an impressive 16 goals in just four matches in the Portuguese second division. Her goalscoring prowess caught the attention of many, leading her back to a second stint at Madrid CFF.\nIn 2022, Geyse took her skills to Barcelona following a stellar season where she finished as the joint-top scorer in the Spanish top flight. She was responsible for almost half of Madrid's goals with her lethal eye for goal. Since her move to the Catalan club, she's won a league title, a Champions League and the Spanish Super Cup.\nEarlier this year at Wembley when Brazil played England in the Finalissima, she lit up the pitch, with almost every single Brazil attack going through her. Despite the loss, she was a handful for the Lionesses' back line, one of the best defences in the world.\nAt her best, Geyse brings goals, excitement and an electrifying presence, which is exactly what Brazil and football fans will want to see in Australia and New Zealand.\n4. Khadija 'Bunny' Shaw - Jamaica\nKhadija 'Bunny' Shaw is an absolute sensation in football right now.\nAt just 26 years old, Bunny Shaw is making waves at both club and national level. She recently bagged the CONCACAF W Player of the Year award and scooped a couple of WSL Player of the Month wins this season.\nShaw's versatility is a game-changer. She can wreak havoc on the wing or dominate as a forward.\nShe has already cemented her name in the record books as Jamaica's all-time leading goalscorer across both men's and women's football with a tally of 55 goals. It's no question she is the driving force behind Jamaica's hopes at the upcoming tournament.\nThe Reggae Girlz made history in 2019 by qualifying for their first ever World Cup and they're hungry for more. Last year's CONCACAF competition showcased their potential, securing a third-place finish after impressive victories over Haiti and Mexico.\nShaw's experience and incredible performances will be crucial for Jamaica at the World Cup as they aim to build on their historic qualification.\n5. Marta Cox - Panama\nWhen describing Marta Cox's style of play, Panama coach Ignacio Quintana said: \"She plays like she talks - very directly.\"\nCox, who plays for Liga MX side Pachuca, is an attacking midfielder who has only one thought in mind when the ball is at her feet - get forward.\nShe enters this World Cup in good form for Panama, having scored an audacious bicycle kick during the World Cup qualification playoffs to help them qualify for the tournament.\nThe 25-year-old's competitive nature and fearless attitude embodies how Panama will hope to play against their tough opponents in Group F.",
  "word_count": 888,
  "scraped_at": "2026-02-14T01:50:37.804093",
  "_text_extracted": true
}