{
  "article_id": "2cfef974fbdd",
  "url": "https://metro.co.uk/2025/04/08/arsenal-vs-real-madrid-live-champions-league-predicted-lineups-team-news-injuries-22867510/",
  "title": "Arsenal vs Real Madrid : Champions League predicted lineups , team news and injuries | Football",
  "date": "20250408T063000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal welcome Real Madrid to the Emirates in a mouth-watering Champions League quarter-finals showdown tonight.\nWith Liverpool almost certain to be Premier League champions, Europe’s premier competition represents Arsenal’s only hope of ending their five-year trophy drought.\nWhile he may deny it, European success is clearly Mikel Arteta’s priority as the manager rested several key players for the 1-1 draw at Everton on Saturday.\nMartin Odegaard, Gabriel Martinelli and Bukayo Saka should come back into the line-up, with the England winger set to make his first start since December after recovering from a hamstring injury.\nIn the continued absence of Kai Havertz and Gabriel Jesus, Arteta must once again choose whether to deploy midfielder Mikel Merino as a makeshift striker or start natural forward Leandro Trossard who scored against the Toffees.\nIt’s at the back where the Gunners have real problems however, with Gabriel Magalhaes out for the rest of the campaign while Riccardo Calafiori is not expected back for a few weeks as he recovers from a knee issue.\nJakub Kiwior partnered William Saliba at centre-back against Everton, but Ben White and Jurrien Timber could also fill-in with the former finally back to full fitness.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAs for Real Madrid, there were questions over whether some of their biggest stars could play after being investigated by UEFA over their behaviour toward Atletico Madrid fans.\nVinicius Junior has escaped punishment, while Kylian Mbappe and Antonio Rudiger were slapped with suspended one-game bans, meaning they are free to face Arsenal.\nGoalkeeper Thibaut Courtois has missed the last three games due to a calf issue but has been named in the squad travelling to the Emirates.\nBut should he not be fit in time, and with No.2 keeper Andriy Lunin out, Carlo Ancelotti will be forced to start 19-year-old Fran Gonzalez in-between the sticks.\nKey defenders Dani Carvajal and Eder Militao remain sidelined with knee injuries, while Dani Ceballos – who previously spent time on loan at Arsenal – also misses out.\nAurelien Tchouameni is suspended for the first-leg after accumulating three yellow cards but England superstar Jude Bellingham is ready to go.\nPredicted Arsenal XI to face Real Madrid\nRaya, Timber, Saliba, Kiwior, Lewis-Skelly, Partey, Rice, Odegaard, Saka, Merino, Martinelli\nPredicted Real Madrid XI to face Arsenal\nCourtois, Vazquez, Asencio, Rudiger, Alaba, Valverde, Camavinga, Bellingham, Rodrygo, Vinicius Jr, Mbappe\nWhere to watch Arsenal vs Real Madrid? Kick-off time and TV channel\nThe first-leg of the Champions League quarter-final between Arsenal and Real Madrid kicks-off at 8pm on Tuesday, April 8.\nMore Trending\nThe match will be broadcast live on Amazon Prime Video, with coverage starting at 6.30pm.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Manchester United and Tottenham face Europa League elimination\nMORE: Arsenal training invaded by Atletico Madrid fans who shouted at Mikel Arteta\nMORE: Real Madrid insider ‘freaking out’ over ‘leaked’ line-up vs Arsenal",
  "word_count": 543,
  "scraped_at": "2026-02-14T02:02:35.586108",
  "_text_extracted": true
}