{
  "article_id": "2d04b0374560",
  "url": "https://metro.co.uk/2025/04/29/luis-enrique-confirms-injury-blow-psg-hero-ahead-arsenal-second-leg-22996911/",
  "title": "PSG star Ousmane Dembele suffers injury blow ahead of Arsenal second leg | Football",
  "date": "20250429T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ousmane Dembele picked up a hamstring injury that has left him a doubt for Paris Saint-Germain’s return leg against Arsenal next week.\nThe France international silenced the Emirates with a superb strike after four minutes at the Emirates on Tuesday night, taking his tally to the season to 32.\nHis goal sealed a 1-0 win for the visitors, leaving them in control of the semi-final tie at the halway stage.\nThe former Barcelona star was replaced midway through the second-half by Bradley Barcola and while he didn’t appear to be any discomfort as he left the pitch, it was later confirmed his withdrawal was enforced.\nRMC Sport report Dembele will now be monitored in the coming days.\nPSG boss Luis Enrique was thrilled with his side’s performance in London but admitted his star forward will now be a doubt for the second leg in Paris next week.\nEnrique said in his post-match press conference: ‘I don’t know anything. The medical tests will take place tomorrow.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s nothing serious, it’s quite minor, but there’s a doubt for the return match.’\nHe added to Canal+: ‘We’re a real team. If Ousmane can play, that’s good. If he doesn’t, we’ll see a team.’\nPSG star Achraf Hakimi spoke to Dembele after his withdrawal, later revealing his teammate is hopeful of being available next week.\n‘We did a good job. It’s not over yet. We had a good first match, and the second one remains in Paris. We have to improve every match.\n‘Dembele? I spoke with him. He’s calm. I hope he’ll be with us.’\nMore Trending\nPSG have already eliminated Liverpool and Aston Villa from the Champions League knockout stages this season.\nThe French champions also came from behind to beat Manchester City in the initial league phase.\nPSG, who clinched the French title at the beginning of April, are in action away to Strasbourg on Saturday. Arsenal, with little to play for in the Premier League with Liverpool wrapping up the title on Sunday, taking on Bournemouth.\nBoth sides will be expected to make plenty of changes ahead of next week’s second leg.\nMORE: Ousmane Dembele injury update ahead of Paris Saint-Germain vs Arsenal\nMORE: Arsenal make approach to sign Manchester United attacking target with £66m clause\nMORE: Gary Lineker names the two teams he wants to reach the Champions League final",
  "word_count": 445,
  "scraped_at": "2026-02-14T01:49:31.504143",
  "_text_extracted": true
}