{
  "article_id": "2d08d37c01fa",
  "url": "https://www.teamtalk.com/news/huge-decision-made-darwin-nunez-barcelona-transfer-arne-slot-tells-second-star-reach-next-level",
  "title": "Liverpool transfers : Slot sends Darwin Nunez clear message over Barcelona links as huge plans are made for Cody Gakpo",
  "date": "20240706T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Huge Liverpool decision made on Darwin Nunez to Barcelona transfer, as Slot tells second star he’ll help him reach ‘next level’\nNew Liverpool manager Arne Slot has made his feelings perfectly clear over the future of Darwin Nunez amid claims he could be sold to Barcelona this summer, while another Reds star, currently excelling at Euro 2024, has been talked up for a prominent role at Anfield.\nSlot’s work as the new Liverpool manager began in earnest this week, taking up his position inside their their state-of-the-art AXA training complex at Kirkby. However, it was not until the arrival of the first eight first-team stars for pre-season training on Friday, together with the new manager’s first press conference later that afternoon, that it truly felt that the new era had begun.\nFresh from leading Feyenoord to two trophies in two seasons, Slot will hope to enjoy similar success at Anfield, where he inherits a star-studded squad who finished third in the Premier League last season and now have a return to the Champions League to look forwards to.\nAnd with money at his disposal this summer, a series of in-depth conversations with new sporting director Richard Hughes and CEO of football Michael Edwards have already been held over which positions – and which players – to target on the transfer front this summer.\nDON’T MISS ➡️ Liverpool line up dazzling Dutch duo as breathtaking €100m double deal explodes into life\nTo that end, TEAMtalk sources have revealed that a left-sided centre-half and a new midfielder are very much top of the new manager’s thinking. A new attacker is also seen as desirable if the right opportunity opens itself up, while a new goalkeeper will also be sought with Caiomhin Kelleher pushing to join Adrian in leaving Merseyside this summer.\nArne Slot makes Liverpool vow over Darwin Nunez exit talk\nHowever, player retention will also be key to Liverpool’s plans. A number of big-name first-team stars now have less than a year remaining on their current deals and tying the likes of Virgil van Dijk, Mo Salah and Trent Alexander-Arnold to extensions will be right at the top of the club’s to-do list this summer.\nInevitably, there could also be some players shown the door, with Slot likely to want to stamp his mark on the Reds squad.\nAnd one player strongly linked with an exit in recent months is Nunez, with the Uruguayan striker proving something of an inconsistent figure over his two years at Anfield and having gone 10 games without a goal over the back end of last season.\nHaving moved in a deal which will ultimately top £85m – a Liverpool club record- Nunez has scored 33 goals in 96 appearances for the Reds so far. A figure that undoubtedly could have been higher but for the player’s recklessness in front of goal, the Uruguay striker has served a reminder of his abilities by shining for his country at this summer’s Copa America.\nWith Uruguay through to the quarter-finals, having claimed a maximum nine points from the group stages, they now face a juicy quarter-final against Brazil, where Nunez will hope to get the better over Reds teammate Alisson Becker.\nA long-term target for Barcelona, those rumours have grown louder in recent months in the wake of the player’s decision to delete all association with Liverpool off his Instagram page, forcing Klopp into a hasty denial over his potential exit in the latter days of the German’s reign.\nDespite that, Slot insists he will soon reach out to Nunez to make it clear he will have a starring role to play at Liverpool next season and that he has zero intentions of cashing in on the star.\n“I just told him that, from what I saw, he played multiple positions and what positions – or position – I see him playing,” said the Liverpool head coach. “I assume he’ll fit really well into this playing style because I like him. I’ve told him that already, he’s one of the players I’ve spoken to.\n“He might have had some struggles with finishing opportunities, but he came a lot of times into those positions. I think he could fit in really well, but it’s normal at a club like this that there are many more players who could play in his position.\n“It’s clear for him which position he’s going to play. It’s clear for me as well and me telling him made it clear for him.”\nSlot sets out Liverpool aims and makes Cody Gakpo pledge\nIn his first press conference as manager, Slot has made clear why he was tempted by the oppotunity to move to Anfield.\n“I got a feel for the club,” he said. “It was before they won the Premier League and Champions League under Jurgen. Everyone was positive even back then without the team winning trophies.”\nSlot aims to continue Klopp’s fine work at Anfield and has set out his stall of bringing the Premier League trophy back to Anfield again.\n“Our aim should be that we want to win and be on top of the league,” he said. “We want to be there for 38 games.\n“But to get in that position, it takes a lot of hard work on a daily basis to come in here and improve and improve and improve and improve. That’s what we have to do.”\nAnother man who looks set to play a key role under Slot is Cody Gakpo, with the Netherlands star shining bright at Euro 2024 and having helped his country into the quarter-finals, they face Turkey on Saturday evening.\nREAD NEXT ➡️ Six Liverpool issues Arne Slot needs to fix next season to turn Reds into title challengers\nGakpo has scored three goals and provided one assist so far under Ronald Koeman, serving a reminder why Liverpool were tempted to spend €45m (£40m) on him in January 2023.\n“I am hoping he will step up even more. We are hoping and expecting him to do even better. He has been impressive and had a good tournament so far,” Slot said of his countryman.\n“We’ve inherited a good team. With the way I look at football, I can see how important it is to work on a daily basis. Not all players have the same level they have at their clubs. There is already a really good team. Few good signings last year.\n“Normally you see things will improve. I was hoping if people looked at my team, it wasn’t 4-2-3-1 or 4-3-3. It’s a lot of freedom to take different positions. A lot of freedom when we have the ball. When we don’t have the ball, we want to be really aggressive.\n“I wouldn’t say I prefer 4-3-3 or 4-2-3-1. If you asked me, I’d have said we played 4-3-3. Full-backs have different roles. I’ve seen a lot of games and training sessions, but you know them better if you are with them. We do need to find things to improve.”",
  "word_count": 1169,
  "scraped_at": "2026-02-14T02:25:54.615817",
  "_text_extracted": true
}