{
  "article_id": "2d2c19cab74e",
  "url": "http://thepeninsulaqatar.com/article/18/03/2024/ac-milan-consolidate-second-spot-fiorentinas-match-at-atalanta-postponed",
  "title": "AC Milan consolidate second spot , Fiorentina match at Atalanta postponed",
  "date": "20240317T234500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAC Milan's American forward #11 Christian Pulisic (R) celebrates with teammates after scoring his team second goal during the Italian Serie A football match between Hellas Verona and AC Milan, at the Marcantonio Bentegodi stadium, in Verona, on March 17, 2024. (Photo by Piero CRUCIATTI / AFP)\nMilan: AC Milan consolidated second place in Serie A on Sunday by beating Verona 3-1 after Juventus were held by Genoa, while Fiorentina's match at Atalanta was postponed after the club's general manager Giuseppe \"Joe\" Barone was taken ill.\nGoals shortly before and after half-time by Theo Hernandez and Christian Pulisic put Milan two ahead before Samuel Chukwueze volleyed the away side out of sight with 11 minutes remaining.\nSunday's win moved Milan three points ahead of third-placed Juve in the race for Champions League football.\nStefano Pioli's team trail runaway league leaders Inter Milan by 13 points, however they are all-but guaranteed a spot in next season's revamped edition of Europe's top club competition.\nAC Milan's French defender #19 Theo Hernandez celebrates scoring his team's first goal during the French L1 football match between AS Monaco and FC Lorient at the Louis II Stadium (Stade Louis II) in the Principality of Monaco on March 17, 2024. (Photo by Piero CRUCIATTI / AFP)\nMilan sit 14 points above fifth-placed Roma who host Sassuolo later, and with Italy favourites for an extra place in the Champions League next term the seven-time European champions have a massive cushion with nine fixtures remaining.\n\"We played very well as a team and we created a huge amount. It was a really positive performance,\" said Pioli to DAZN after his team's fifth straight win in all competitions.\nVerona put on a good show and Tijjani Noslin's unstoppable strike in the 64th minute gave the hosts hope they could pull off another good result after winning their previous two matches.\nInstead, Verona stay two points above the relegation zone with a potentially huge clash at fellow strugglers Cagliari coming up after the international break.\nJuve meanwhile continued their poor run of recent form with a largely uninteresting goalless draw with Genoa in Turin.\nMassimiliano Allegri's side were league title contenders in January but one win in their last eight matches has left them 16 points behind Inter.\nJuve's woes continue\nJuve were frustrated by their stubborn opponents and were booed off by home fans at both half-time and the final whistle.\n\"I am happy with what the team is doing,\" insisted Allegri. \"We did really well in the first half of the season, but we are not doing enough now. We have to be in the top four come May 26.\"\nJuventus' Serbian forward #09 Dusan Vlahovic at the end during the Italian Serie A football match between Juventus and Genoa at the Allianz Stadium in Turin on March 17, 2024. (Photo by MARCO BERTORELLO / AFP)\nJuve could have claimed the win despite their underwhelming display as Dusan Vlahovic twice went close with second-half headers while Samuel Iling-Junior and Moise Kean both had efforts strike the woodwork.\nVlahovic was sent off in stoppage time for dissent meaning he will miss Juve's next fixture against Lazio. A big draw for promoted Genoa put Alberto Gilardino's side 10 points above the relegation zone.\nSerie A confirmed to AFP that Fiorentina's fixture in Bergamo had been postponed \"to a later date\" due to Barone's illness, which Italian media reported may have been a heart attack.\nThe Gazzetta Dello Sport report that Barone was whisked to Milan's San Raffaele Hospital by helicopter from the hotel where Fiorentina stayed pre-match.\nPioli said \"I wish him good luck\" after hearing of the news.\nBarone, who was born in Sicily in 1966 but moved to New York City when he was a child, is a long-time colleague of Fiorentina president Rocco Commisso.\nFiorentina are eighth in Serie A, four points behind Atalanta who sit in sixth and the division's Europa Conference League spot.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 726,
  "scraped_at": "2026-02-14T01:48:46.205448",
  "_text_extracted": true
}