{
  "article_id": "2d325b130a9b",
  "url": "https://theathletic.com/4197002/2023/02/15/real-madrid-eden-hazard/",
  "title": "Eden Hazard : Real Madrid record signing is now an outsider who looks set to leave",
  "date": "20230215T061500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Real Madrid’s players and staff celebrated Club World Cup victory in Morocco’s capital Rabat on Saturday, Eden Hazard watched the pictures on TV back at home.\nWhile other injured members of the squad, such as his close friend Thibaut Courtois or Lucas Vazquez, had flown to the North African nation for the final against Saudi Arabian side Al Hilal, Hazard stayed in Spain.\nAdvertisement\nIt might seem like a minor detail — left-back Ferland Mendy also did not take the 90-minute trip — but this was just the latest chapter of a story in which Hazard has become increasingly distanced from Madrid’s first team.\nThe now 32-year-old Belgian joined for an initial €100million (£88.3m; $107.6m) from Chelsea in the summer of 2019 and is still Madrid’s record signing. The deal that took him to Spain’s capital included further add-ons worth up to a reported €160m. Though not all of these have been triggered, the cost has exceeded the €101m the club eventually spent on 2013 buy Gareth Bale.\nSince Hazard’s arrival, he’s made 73 appearances, scored seven goals and provided 11 assists.\nHe has a contract that runs until 2024, but his relationship with the club’s current manager Carlo Ancelotti has become progressively more fractious and his future appears not to lie at the Santiago Bernabeu.\nThere is a meeting planned this month with Hazard and his agents, after which a likely outcome will be both club and player agreeing to a parting of ways. It’s expected to be an amicable one; Hazard is well-liked within the dressing room and the coaching staff have no complaints about him. But for a long time now he has not really been considered part of the main group, and Hazard knows this.\nSo, how has it gone so wrong for Hazard?\nThings didn’t get off to a good start after the move from Chelsea.\nHazard was unveiled as the most expensive player in Madrid’s history but arrived for his first pre-season overweight, something he himself admitted later. Then, the week before what was supposed to be his La Liga debut, he suffered a hamstring injury.\nIt took him a while to get back to form when he returned from that, but when he did he excited fans with great performances, especially against Eibar and Paris Saint-Germain.\nAdvertisement\nHowever, then came the match that many now see as the biggest turning point in Hazard’s Madrid career. It was when PSG came to Madrid for their return Champions League group fixture on November 26, 2019. Both Madrid and Hazard believe his serious problems started with an injury picked up in a tough challenge from compatriot Thomas Meunier.\nThe area affected was Hazard’s right ankle, which he had previously undergone surgery on which included having a metal plate fitted. Now there was a new, small fracture that ruled him out for three months. He returned to action in the February, but then relapsed and had to undergo surgery in the US just before the outbreak of COVID-19 halted football almost everywhere for months.\nThe pandemic lay-off meant Hazard missed fewer matches than he might have, with the league postponed until the summer and the European Championship put back a year to 2021. But when La Liga resumed behind closed doors in the June, it was clear Hazard was no longer the same.\nIt’s turned out that he never would be.\nThat plate in his ankle bothered Hazard physically and psychologically, and it began to entangle him in a depressing cycle of being out of action due to the same problem, not playing his best or suffering a new injury.\nHazard decided he wanted to have another operation in March 2021 to remove the plate, but Madrid advised against it. A year went by in these conditions. Hazard was unhappy and he wasn’t performing well in the few appearances he did manage to make. Then, in March last year, the club agreed to the player’s wishes and the plate was taken out.\nIn total, according to Transfermarkt data, Hazard has suffered 18 injuries in his three-and-a-half seasons as a Madrid player, totalling 498 days out and missing 77 games. By contrast, in his seven seasons at Chelsea, he suffered 13 injuries, spent 198 days out, and missed 21 matches.\nGO DEEPER\nSpanish football has a racism problem. This is how Vinicius Jr became the focus of abuse\nAll this has left Hazard in a very delicate position.\nHe has always wanted to see out his Madrid contract because both he and his family have felt very comfortable in the city and at the club. However, recently something has changed.\nAdvertisement\nSources close to the Belgian, who wished to speak anonymously in order to protect relationships, told The Athletic that dealings with Ancelotti are now almost non-existent. They say Hazard feels let down by the Madrid manager over what he considers to be promises over playing time that have not been kept. They say Hazard feels ignored by the Italian and that he’s been left disappointed by a breakdown in their relationship.\nIt is certainly true that, in late December, Ancelotti said Hazard “will be one of the players who will play more in this second part of the season”. Since then, with two minor injuries in between, Madrid’s No 7 has only been on the pitch for 67 minutes of action — and that all came in a Copa del Rey match against third-tier side Cacereno. He has not played in La Liga since September 11.\nSources on Madrid’s coaching staff, speaking anonymously to protect their positions, told The Athletic they see Hazard’s frustration as normal, as something that usually happens when a player does not get to play. They share the same view of him as the rest of the dressing room — a good guy who has been unlucky but one who has always behaved positively on a personal level, without creating any problems within the group.\nThe solution now lies in a way out, it seems.\nAt the recent World Cup, Hazard captained a Belgium side who crashed out at the group stage, playing 125 of the 270 minutes across their three matches — including just three in the finale against Croatia when qualification for the knockout phase was at stake.\nIn an interview with Spanish news outlet Marca before the tournament, he said he would leave Madrid in summer 2023 if they asked him to do so. And at this month’s scheduled meeting between the player and his agents, a roadmap for his departure is likely to be drawn.\nIt is expected that Madrid will communicate to him that the best option would be to go. The board have been trying to get him to leave since the summer of 2021 — sometimes with leaks to the media that did not correspond with reality. Despite reports linking Hazard with Juventus, a return to Chelsea, Arsenal or more recently Al Nassr of Saudi Arabia, he has never had offers or serious talks with any team about moving on.\nOne of the reasons why Madrid want Hazard gone is his high salary.\nAdvertisement\nSources with knowledge of his contract, who wished to speak anonymously to protect their position, say his maximum yearly wage would be €15million after tax, a total that includes income from image rights and performance bonuses — although it is unlikely he has come close to fulfilling the latter.\nHazard is out with a knee problem and while he is expected to return to training soon there is little chance of seeing him play at Anfield next Tuesday when Madrid play Liverpool in the first leg of a Champions League last 16 tie.\n“I think he will return to training with the team on Thursday, after the inflammation he had in his knee,” Ancelotti said yesterday.\n“I treat him like everyone else, there is nothing special for anyone.”\nAt this point, no one doubts that Hazard, a Premier League legend, has the sympathy of team-mates, and that his childhood dream of playing for Real Madrid has turned into a nightmare.\n(Top photo: Diego Souto/Quality Sport Images/Getty Images)\nThe Athletic’s Spanish football coverage has expanded…\n- La Liga news, La Liga table; La Liga fixtures and results\n- Dermot Corrigan is joined by four new writers…\n- Real Madrid news from Mario Cortegana and Guillermo Rai\n- Barcelona news from Pol Ballús and Laia Cervelló Herrero",
  "word_count": 1404,
  "scraped_at": "2026-02-14T01:59:41.711086",
  "_text_extracted": true
}