{
  "article_id": "2d549ccacfad",
  "url": "https://www.themag.co.uk/2026/02/the-game-is-lost-it-isnt-coming-back-newcastle-united-premier-league/",
  "title": "The game is lost … it isnt coming back",
  "date": "20260209T091500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The game is lost…it isn’t coming back\nThe scoreline in the Newcastle United semi final away leg against Manchester City wasn’t a surprise. It was a reminder of our place in the hierarchy.\nPSR has cemented football into a closed shop.\nThe elite have built their untouchable highly paid 25-man squads over decades of Champions League money, commercial dominance and global reach with zero financial constraints and now the ladder has been pulled up behind them.\nPut simply, Newcastle United cannot catch them.\nNot under the current rules. Not under the proposed rules and not without breaking the system that now exists solely to protect those already at the top.\nWe are constrained by revenue, not ambition. As a result we cannot build the squad depth and strength required to compete on all fronts.\nLet’s face it, our player recruitment results in either young promising, but not risk free, players coming onboard (Tino, Hall, Wolf, Isak etc), or alternatively established B grade players. Either way, if we get it wrong (and we do) we cannot “do a Manchester City” and buy our way out of it like the “great” Pep does, we have to live with our decisions in the knowledge that when a player does produce the goods they will be tapped up and destabilised – leaving us with no option but to sell, as the player goes on to double their wages and sit on the bench for a large chunk of their career. Europe, the league, the FA Cup and Carabao Cup.\nWe have to choose, as we simply cannot compete across all competitions and if we try, the result is we fail at everything, as this season is proving. The elite do not make that choice. They rotate international-quality players like spare parts and strip other clubs of talent without breaking sweat. Sell a hotel here, a women’s team there. As for 115 charges… no bother. Just carry on guys.\nSo, Newcastle United are what the system allows us to be. A second-tier club. One that might win the odd cup. One that might flirt with Europe. One whose real achievement is avoiding relegation while trying to grow.\nAnd we are not alone. Aston Villa. Brighton. West Ham. Brentford. Any club with short term momentum and ideas will eventually get stripped. Their best players are picked off by the septic six like vultures over a carcass. Build, rise, get dismantled, slide back down. Repeat. We will never be allowed to succeed – change of manager, new DoF, ambitious CEO, it doesnt’ matter. Put simply, we cannot compete financially over an extended period of time in buying and retaining the best players, and that is all that matters.\nCherry on the cake? The corruption is no longer even subtle. Sky’s narrative always bends toward the big clubs and unsettling our players. PGMOL’s decisions somehow align with the “Big 6” too often to be coincidence, the Premier League creates rules to protect the elite yet “rules” become guidelines and are not enforced when it suits the septics. The house always wins.\nYes, the Premier League claims one club, one vote. But everyone knows the truth. The top six will never vote for anything that allows competition to catch them. And most of the rest are just grateful to survive, so are happy to stay with the status quo. The result is a cartel disguised as a league.\nPromoted teams are set up to fail. Even with money, they cannot spend it. They cannot pay wages. They cannot retain talent. They exist temporarily until their best players are stripped and they sink back into the Championship.\nI have never been less excited about the future of English football. It is boring. It is uncompetitive. And it is fixed.\nI will always support Newcastle United. That will never change, it’s in my blood!\nBut the game is lost.\nIt isn’t coming back.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 666,
  "scraped_at": "2026-02-14T02:09:42.988334",
  "_text_extracted": true
}