{
  "article_id": "2d549a682303",
  "url": "https://theathletic.com/5300699/2024/03/01/bernsteins-manchester-city-dickov-royle-keegan/",
  "title": "David Bernstein Manchester City memories : A merger , Cityitis and a bar bill for the ages",
  "date": "20240301T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Before the money started pouring in, the influx of Abu Dhabi wealth and the takeover that changed the landscape of English football, who knew the ‘Manchester City Dons’ might have been a real thing?\nDavid Bernstein, the former City chairman, has just pulled up a chair at his house in Finchley, north London, and is telling a story about a merger idea that he has done exceedingly well to keep secret all these years.\nAdvertisement\nThe idea came from Wimbledon. They had been homeless since selling Plough Lane and grown weary of ground-sharing with Crystal Palace at Selhurst Park.\n“They wanted to merge with Manchester City and form a new club,” says Bernstein. “Wimbledon were in the top division at the time, whereas we were in the league below. So we would get a place in the Premier League without having to worry about winning promotion, while they would take on our fan base, our history and traditions.\n“It was a quick way for us to get back into the Premier League, taking all the risk out of it, but there would have been riots. City’s fans would have wanted me hanging from a lamppost outside Maine Road and rightly so. I mean, come on, the Manchester City Dons? I would have been shot at dawn if I had even entertained the idea.”\nBernstein’s chairmanship lasted five years and a lot was packed into that time given it started with the nadir of City’s 1998-99 season in the old third division, then took in back-to-back promotions, a relegation, another promotion and all sorts of politics, heartache and tragicomedy.\nHe left the club, in not ideal circumstances, five years before Sheikh Mansour’s takeover and has just written a book — We Were Really There: The Rebirth of Manchester City — that can make it feel at times like we are talking about two completely different clubs. Yes, they still wear blue shirts, their postcode still begins with M and you might see the occasional inflatable banana in the stands, but Bernstein’s memoirs are a reminder that there is a lot more to City’s story than just the sheikh, the superstars and the schadenfreude of displacing Manchester United, the old enemy.\n“I wanted to give the younger generation of City fans, below the age of 30 to 35, the chance to realise the club’s revival actually started in 1998, not when the Abu Dhabi people came in,” says Bernstein. “They have done a fantastic job but, without everything that happened in this five-year period, they would never have had the foundations for what has happened since. So I hope our younger fans read it and understand there is more to the club’s history.”\nHe makes a good point given the changing face of a club where “Typical City” used to mean something very different to winning titles and blitzing opponents. Do modern City fans understand what came before the trophies, the riches, the glories? Do they even care?\nAdvertisement\nEqually, there are fans of a certain generation who will always feel indebted to Bernstein for taking on the chairmanship from Francis Lee and becoming the public face of the club.\n“I took over at a really rough time, an all-time low, just as the club were going down to the third level of English football,” he says. “The fans were in a riotous mood. They were threatening to burn down my predecessor’s factory. In a strange way, that may have helped me because everything was so bad, so amateur, there was no longer any resistance to change.\n“When I took over as chairman, with the approval of the board and the shareholders, I had almost a free hand to change the place from top to bottom.”\nA quarter of a century on, the modern-day City have a gleaming stadium, a village-sized training complex next door and all sorts of other new developments going up.\nAll of which is a far cry from Bernstein’s memories when City were languishing in the third division and playing at Maine Road, among the terraced streets of Moss Side.\nThe club shop, he recalls, was “the size of a table”. The offices were contained in a house in Platt Lane. At one point, his son, Richard, was asked if he fancied going to a game at Watford to scout a player. “Richard was very keen on football,” says Bernstein, “but he would be the first to admit he’s not a professional scout.”\nAs for the boardroom, that was not even in operation. “It was being used on matchdays to entertain the players’ wives. I knew that had to change straight away. A football club’s boardroom is important. It’s where serious work is done and serious decisions are made. So I had the old boardroom table brought up from the cellars, or wherever it had been left to rot.\n“We polished it up and, from that moment on, we used the boardroom seriously.”\nAdvertisement\nCan it really be that the club of Pep Guardiola, Erling Haaland and Kevin de Bruyne were, 25 years ago this week, drawing 1-1 against Chesterfield, in between games against Macclesfield Town (a 2-0 win) and Northampton Town (0-0) in what is now League One?\n“We had to change what was really a failed organisation,” says Bernstein. “It was always a great club with a great history and wonderful fans, but it was in a mess. It had been left behind by everyone generally, but Manchester United in particular. They were in a different world to us.\n“In my first season, we managed to lose to York City and Lincoln City. And Wycombe Wanderers, twice. We staggered on until Christmas and then we played Stoke City at Maine Road. We went 1-0 down and, at half-time, there was a bit of a fight in the dressing room. We came out, won 2-1 and, from then on, the momentum never really stopped.”\nAlong the way, Bernstein cemented himself as a popular figure with the loyal City fans who saw it as a badge of honour to stick with the club during their lowest moments.\nAlthough he grew up in London, Bernstein was born in Lancashire, adopted City at the age of 11 and on the day of his bar mitzvah, the Jewish coming-of-age ceremony, he was glued to a black-and-white television watching them win the 1956 FA Cup. Bernstein understood what the fans were feeling because he was one himself.\nIt was Bernstein, for example, who took issue when the Daily Mirror published a now-infamous back page showing the empty stands of Maine Road after City had lost to Mansfield Town, in the Auto Windscreens Shield, in front of a record-low crowd of 3,007. “You can criticise the board, or even the players, but not the supporters,” came the chairman’s response.\nLater, when City had returned to the Premier League, Bernstein pushed, unsuccessfully, for legal action against Roy Keane, then United’s captain, for his X-rated tackle on Alfie Haaland (Erling’s father) during a Manchester derby at Old Trafford.\nAdvertisement\nKeane, who held a grudge against Haaland, was charged by the Football Association after writing in his autobiography that his studs-up assault on the Norwegian was premeditated. He was given a five-match ban and fined £150,000.\n“I won’t watch him on television to this day,” says Bernstein. “If he is on as a pundit, I turn the channel over and wait until the match starts before switching it back on again.\n“Frankly, I think it’s dreadful that he is accepted the way he is. Some people like notoriety, I suppose. They like people who go to extremes. They like bad boys. I’m not so keen on a footballer who, publicly, in cold blood, goes out to maim a fellow professional and then stands over him and says, ‘Take that, you bastard’.”\nThe saddest part, perhaps, is that Bernstein’s relationships soured with the two managers whose time at City had provided him with “lifetime highlights”.\nIn particular, he writes in his book about his regret that everything ended so badly with Joe Royle, who was sacked and took legal action against the club. Yet Bernstein’s memoirs also appear to confirm, as widely reported at the time, that a booze culture had developed during the 2000-01 season when Royle’s City were relegated.\nIn an upstairs office, Bernstein still has the bar bill from the Forest of Arden hotel, near Birmingham, on New Year’s Eve before the team played Coventry City the following day. The previous day, Royle’s team had lost 4-1 at home to Charlton Athletic.\n“They celebrated the New Year in style,” Bernstein writes. “According to the bill the hotel submitted for payment, the Manchester City management team and backroom staff purchased 49 whiskies or Southern Comforts, 56 vodkas, 61 gins, 24 rums, 19 Baileys, 20 brandies, nine schnapps, 33 beers or lagers, four ciders, three bottles of wine, 10 glasses of Champagne, one bottle of Moet et Chandon and three pina coladas. They also ordered 11 Cuban cigars. The tab was closed at 1.37am.”\nAdvertisement\nAs for the next manager, Kevin Keegan, that relationship was never perfect. The two men eventually fell out over the club’s transfer policy, culminating in a highly publicised row over the proposed signing of Robbie Fowler from Leeds United.\n“That was one of the reasons I gave up something I loved,” says Bernstein, who felt the club’s majority shareholders, John Wardle and David Makin, had taken the manager’s side. “I used to get the train to Manchester twice a week and every time I arrived at Piccadilly station, the adrenaline started pumping. I absolutely loved it. Then, suddenly, it started to feel like a long journey.\n“I could see this becoming Mission Impossible. I started to think, ‘I’m not looking forward to this journey’, and once that happened I knew I may as well get out. I will be a fan until my last breath but, as often happens in football, it’s a volatile sport, with so much passion, and your relationships can suffer.”\nBernstein’s final game at Maine Road was a 5-1 defeat to Arsenal in which Arsene Wenger’s team were four up inside 20 minutes and Thierry Henry gave Richard Dunne such a chasing that the City defender asked Keegan if he could be substituted at half-time.\nIt was February 2003, six months before the Community of Manchester Stadium, now the Etihad, became City’s home. “I did the deal for that stadium,” says Bernstein. “I worked like mad with my colleagues to do the whole thing and then I left the club and never saw the final product. I felt very sad about that.”\nNow 80, Bernstein still watches every City match on television, or occasionally in person when they are playing in the capital. He has felt “separated” from the club, he says, since criticising the arrival of Thaksin Shinawatra, the former prime minister of Thailand who bought City in 2007 then went on the run from the Thai authorities and sold it on to Abu Dhabi.\nIf there is any regret about no longer being involved in any way, it never transcends into bitterness. Bernstein went on to become the Football Association chairman, as well having a brief spell on the board of Aston Villa, but his book is dedicated to his years in Manchester and he sounds exactly what he is: a fan of nearly 70 years.\nAdvertisement\n“I used to say my ambition, my dream, was to have two great sides in Manchester, like the Milan of northern England,” he says. “I hoped that City could get into that top group, a bit like Tottenham, but I never thought we would become the dominant side, that we would overtake United, Liverpool, Arsenal, Chelsea and Tottenham, leave them all trailing, win maybe four championships in a row, the Champions League and the FIFA world championship.”\nIt has been an epic run, though it is not lost on Bernstein that City are facing 115 charges for alleged breaches of financial rules. “All I can say is that I would be very saddened if it was proven against them,” says Bernstein of the possibility the outcome could tarnish City’s legacy. “It would be extremely sad because we are talking about a team that could become the greatest club side of all time.”\nIf so, the new generations of City fans should not overlook what went before and the fight for respectability that began, on Bernstein’s watch, among the puddles and potholes of the old third division.\nAsk Bernstein to name the most important goal in the club’s history and he will not pick out the one scored by Sergio Aguero to win City’s first Premier League title, or Rodri’s winner in last season’s Champions League final.\nNo, his choice goes back to the final game of his first season as chairman. The date was May 30, 1999 — four days after Manchester United had won the Treble — and City were at Wembley.\n“We were playing Gillingham in the play-off final — and we’re going to beat Gillingham, surely,” says Bernstein. “All season, our fans had chanted, ‘We’re not really here’, in self-mocking disbelief that it had come to this. We had to win and, with a couple of minutes to go, all I could hear were the Gillingham fans singing, ‘Going up! Going up! Going up!’.\n“We were 2-0 down and there were City leaving fans in tears. I had never been more emotionally invested in a football match in my life and I was thinking, ‘Blimey, this is going to be hard work next year’.”\nRoyle used to call it ‘Cityitis’. That day, however, the team found the antidote.\nAdvertisement\nKevin Horlock scored in the first minute of stoppage time. Paul Dickov wrote himself into City lore with the equaliser 90 seconds later and goalkeeper Nicky Weaver was the hero of the penalty shootout.\n“If we hadn’t come up that season, it would have been impossible for the new stadium deal to happen,” says Bernstein. “And, without the new stadium, the Abu Dhabi people would never have come in.\n“That Gillingham game was, without question, the most important in the club’s history.”\n‘We Were Really There, The Rebirth of Manchester City’, by David Bernstein, is out on March 11 from Pitch Publishing\n(Top photo: John Walton/EMPICS via Getty Images)",
  "word_count": 2393,
  "scraped_at": "2026-02-14T01:51:19.047096",
  "_text_extracted": true
}