{
  "article_id": "2d96fe2823f9",
  "url": "https://metro.co.uk/2024/04/08/seven-premier-league-fixtures-will-decide-title-race-20605775/",
  "title": "The seven Premier League fixtures that will decide the title race | Football",
  "date": "20240408T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Premier League title race remains finely poised after the weekend’s latest round of matches, with just one point now separating Arsenal, Liverpool and Manchester City.\nLiverpool’s profligate draw at Old Trafford has allowed Arsenal to claim top spot after their own 3-0 victory at Brighton – a result which bumps up their healthy goal difference even more – while City are breathing down their necks after coming from behind against Crystal Palace.\nWith just seven games left of the season, there are only a maximum of 21 points still up for grabs – while all three teams have to grapple with the demands of European football too.\nDefending champions City may have – on paper at least – the easiest run-in but they are the only side still competing in three competitions, and all three title challengers face some enormous hurdles.\nLet’s take a look at the remaining fixtures and the key matches that will decide the destination of the Premier League title…\nARSENAL\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nCurrent position: 1st | Points: 71 | Goal difference: +51\nArsenal's remaining matches\nApril 9 – Bayern Munich (home) – UCL\nApril 14 – Aston Villa (home) – PL\nApril 17 – Bayern Munich (away) – UCL\nApril 20 – Wolves (away) – PL\nApril 23 – Chelsea (home) – PL\nApril 28 – Tottenham (away) – PL\nApril 30/May 1 – Potential UCL semi-final 1\nMay 4 – Bournemouth (home) – PL\nMay 7/8 – Potential UCL semi-final 2\nMay 11 – Manchester United (away) – PL\nMay 19 – Everton (home) – PL\nArsenal have built on last season’s title challenge and look like a more mature and composed side this time around, while their defence is playing at an extraordinarily high level.\nMassive European games against Bayern Munich and then potentially Manchester City or Real Madrid in the Champions League semi-final will bring a level of pressure and prestige that few players in the squad are used to handling – and which could impact their domestic form.\nAll of Arsenal’s away games look challenging, particularly a trip to Molineux just a few days after playing in Bavaria. Trips to Old Trafford, as seen this weekend, have the capacity for pure madness, too.\nBiggest game remaining: The north London derby\nUndoubtedly the most eye-catching Premier League game left for Arsenal is a trip to face north London rivals Tottenham. Last season’s 2-0 win for the Gunners was their only victory in their last nine Premier League visits to N17, while Spurs have a strong record against the top six this season. They also have two weeks’ rest before the game.\nWhat the pundits are saying:\n‘The managers are going to play a big part. Pep Guardiola’s done it, Jurgen Klopp’s done it – Mikel Arteta hasn’t done it.\n‘But with the better goal difference, you have to make Arsenal favourites right now. They’re in good form and teams look like they can’t score against them.\n‘But when they go to Tottenham, that is going to be the game. If Arsenal can go there and get three points, they’ll deserve to win the title.’ — Jamie Redknapp on Sky Sports\nLIVERPOOL\nCurrent position: 2nd | Points: 71 | Goal difference: +42\nLiverpool's remaining matches\nApril 11 – Atalanta (home) – UEL\nApril 14 – Crystal Palace (home) – PL\nApril 18 – Atalanta (away) – UEL\nApril 21 – Fulham (away) – PL\nApril 24 – Everton (away) – PL\nApril 27 – West Ham (away) – PL\nMay 2 – Potential UEL semi-final 1\nMay 5 – Tottenham (home) – PL\nMay 9 – Potential UEL semi-final 2\nMay 11 – Aston Villa (away) – PL\nMay 19 – Wolves (home) – PL\nLiverpool racked up 28 shots against Manchester United at Old Trafford on Sunday but somehow conspired to only draw the game, with the result seeing them slip back down to second place.\nUnlike their title rivals, Jurgen Klopp’s side do not have Champions League football to contend with and have also landed in the kinder half of the Europa League draw. Atalanta, who are sixth in Serie A, await in the quarter-final before either Benfica or Marseille in the semi-finals.\nA run of four away games in a row, starting in Bergamo and ending in east London, feels like a pivotal period for Liverpool’s title challenge, while matches against fourth-placed Tottenham and fifth-placed Aston Villa are also huge tests.\nBiggest game remaining: The Merseyside derby\nDespite Liverpool’s remarkable record against Merseyside rivals Everton, the derby already feels like a potential banana skin. Klopp has already mentioned it on several occasions and he knows the Toffees – who have performed better than their league placing suggests – will do everything possible to try and rain on their title parade.\nWhat the pundits are saying:\n‘One thing about Liverpool is they have four away games after facing Atalanta – it could be their downfall.\n‘Four away games is not nice. There are other things that can effect you such as being away from home. Liverpool will also not like going to Goodison Park.’ — Theo Walcott on BBC Radio 5 Live\nMANCHESTER CITY\nCurrent position: 3rd | Points: 70 | Goal difference: +40\nMan City's remaining matches\nApril 9 – Real Madrid (away) – UCL\nApril 13 – Luton Town (home) – PL\nApril 17 – Real Madrid (home) – UCL\nApril 20 – Chelsea (neutral) – FA Cup\nApril 25 – Brighton (away) – PL\nApril 28 – Nottingham Forest (away) – PL\nApril 30/May 1 – Potential UCL semi-final 1\nMay 4 – Wolves (home) – PL\nMay 7/8 – Potential UCL semi-final 2\nMay 11 – Fulham (away) – PL\nMay 19 – West Ham (home) – PL\n*Tottenham (away) still to be scheduled, likely last week of the season\nOf the three teams still competing for the title, Manchester City perhaps have the easiest Premier league fixtures but the most demanding volume of games with both Champions League and FA Cup ties to contend with.\nThey could hardly have asked for an easier fixture between their quarter-final ties against Real Madrid, though, with Luton Town having given up 46.5 Expected Goals on their travels – which is 10 more than the next worst.\nWith four of their last seven Premier League matches against bottom-half sides, it is hard to look too far past City, though West Ham and Brighton – on their day – are capable of upsets.\nBiggest game remaining: Tottenham away\nMore Trending\nFor all three sides, fourth-placed Tottenham are probably the most challenging side they have left to face. That is particularly true of City, with Spurs something of a bogey team. They may have won in north London in the FA Cup earlier this year, but Pep Guardiola’s side had never previously even scored a goal at the stadium and Ange Postecoglou’s side are capable of causing plenty of problems.\nWhat the pundits are saying:\n‘I’d probably go with Manchester City. They’ve done it. Their reaction to last week [drawing with Arsenal], they’ve really used their squad. For their experience, Pep Guardiola, Kevin De Bruyne… I’d probably want to be there.\n‘I went with Liverpool last week. Am I allowed to change my mind?! I think Man City will win all their [remaining] games.’ — Roy Keane on Sky Sports\nWho will win the Premier League title?\n-\nArsenal\n-\nLiverpool\n-\nManchester City\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Red-hot Arsenal look far too strong for struggling Bayern Munich\nMORE: Arsenal’s William Saliba told he’s the same level as Tottenham star",
  "word_count": 1338,
  "scraped_at": "2026-02-14T02:20:27.916481",
  "_text_extracted": true
}