{
  "article_id": "2daf526282e5",
  "url": "https://punchng.com/osimhen-deal-close-as-united-set-to-trigger-release-clause/",
  "title": "Osimhen deal close as United set to trigger release clause",
  "date": "20250424T023000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are ready to trigger Victor Osimhen’s €75m (£64m/$86m) release clause after reportedly reaching an agreement in principle with the Nigerian striker over a potential summer transfer.\nAccording to Tuttosport, the Red Devils have already agreed basic salary terms with Osimhen’s representatives and are prepared to meet the release clause in his Napoli contract as manager Ruben Amorim looks to strengthen his attacking options.\nThe 26-year-old Nigeria international has been in stunning form during his loan spell at Turkish giants Galatasaray this season, scoring a remarkable 30 goals and providing seven assists in just 35 appearances across all competitions.\nOsimhen was heavily linked with a move to the Premier League last summer, with both United and Chelsea among his suitors, but he ultimately joined Galatasaray on a season-long loan after his relationship with Napoli deteriorated and no club met the Italian side’s asking price.\nDespite Galatasaray’s desire to sign him permanently following his impressive performances, United appear to have stolen a march on their rivals in the race for the prolific striker’s signature.\nThe Old Trafford club are experiencing a difficult campaign under Amorim, currently sitting 14th in the Premier League table ahead of this weekend’s match against Bournemouth, and view Osimhen as a necessary addition to improve their fortunes next season.\nOsimhen has established himself as one of Europe’s most lethal forwards in recent years, having scored 76 goals and registered 17 assists in 133 appearances for Napoli before his loan move to Turkey. He also boasts an impressive international record with Nigeria, netting 26 times and providing 11 assists in 41 appearances for the Super Eagles.\nThe Nigeria international scored his 170th goal in the 5-1 win over Konyaspor in the Turkish Cup on Tuesday.\nThe potential deal for Osimhen could be facilitated by the departure of several United attackers, with reports suggesting that Rasmus Hojlund could be offered to Napoli as part of the transfer. The Danish striker has struggled at Old Trafford, scoring just eight goals in 45 matches this term.\nMarcus Rashford, Jadon Sancho, and Antony are also rumoured to be on the transfer list as United look to fund their summer rebuild, while speculation continues to surround the future of Alejandro Garnacho.\nUnited’s chances of landing Osimhen could be boosted if they secure Champions League football for next season. Their most realistic route to the competition appears to be via the Europa League, where they face Athletic Bilbao in the semi-finals, with the first leg scheduled for next week.",
  "word_count": 416,
  "scraped_at": "2026-02-14T01:58:31.707744",
  "_text_extracted": true
}