{
  "article_id": "2dba53f48296",
  "url": "https://thepeoplesperson.com/2025/11/09/owen-hargreaves-makes-exciting-man-united-prediction-after-2-2-draw-vs-spurs-300916/",
  "title": "Owen Hargreaves makes exciting Man United prediction after 2 - 2 draw vs . Spurs - Man United News And Transfer News",
  "date": "20251109T133000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United midfielder Owen Hargreaves has made an exciting prediction about the club’s league finish, following Saturday’s draw with Tottenham Hotspur.\nUnited’s unbeaten run continues\nUnited’s unbeaten streak remains intact after the dramatic 2-2 draw with Spurs. The run currently stands at five games, stretching back to the 2-0 victory over Sunderland at the start of last month.\nBryan Mbeumo gave United the lead in North London before Mathys Tel and Richarlison struck late to flip the game on its head and leave the visitors staring down the barrel of a gun.\nReduced to 10 men after Benjamin Sesko was withdrawn with an injury, all signs pointed to United suffering a fourth defeat of the 2025/26 Premier League season.\nHowever, Matthijs de Ligt came up clutch, towering over everyone to head home a superb Bruno Fernandes cross, with the clock at 90+6.\nThe result left United in seventh place in the table after 11 games played.\nSpeaking on TNT Sports, Hargreaves predicted that United will finish in the top four. The 2008 Champions League winner explained that United have some relatively comfortable fixtures coming up, and this, combined with the fact they’re not in Europe, could see them get over the line.\nHargreaves makes United prediction\nThe former United midfielder said [as quoted by Metro], “Last season they would have lost this game and, to be fair, it was a game they probably should have won. They had comfortable control of it and they probably just dropped a little too deep.”\n“You’ve got to credit Spurs as well, they pushed bodies forward, got bodies in the box, and kept crossing it, but I thought United lost a bit of control when Maguire and Casemiro and then Sesko went off. But I think he (Amorim) will be happy in the sense they they got a goal late in the game and they are still in a decent position.”\nHargreaves continued, “There is no European football and if you look at the fixtures coming up – Everton, Palace, West Ham, Wolves – after those, they’ll be second, I think and they’ll be in a position where they can strike. If you look at that with no European football, Man Utd will finish in the top four.”\n“They have a huge advantage. There’s only one game a week, pretty much. You think about all the other teams, Spurs and Chelsea, everybody has European football. Amorim has got time on the training pitch and he’s a great coach, we know that from his time at Sporting.”\n“Last season was tricky trying to navigate all the fixtures, but if you look at who they are going to play in the next five, six games, and the way they’ve been playing – unbeaten in five – and the squad that they have, it’s settled.”\nOn the imminent absences of Amad and Mbeumo due to the Africa Cup of Nations, Hargreaves noted that this can be mitigated by Amorim having more time with the other players on the training ground, ensuring the impact of the pair is replicated during matchdays.\nFeatured image Alex Pantling via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 544,
  "scraped_at": "2026-02-14T02:03:26.534582",
  "_text_extracted": true
}