{
  "article_id": "2dc16d4460af",
  "url": "https://www.citizen.co.za/news/messi-magic-five-things-look-for-club-world-cup-kicks-off/",
  "title": "Messi magic ? Five things to look out for as Club World Cup starts",
  "date": "20250614T141500Z",
  "domain": "citizen.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AFP Sport picks five things to look out for on the pitch.\nDespite concerns over ticket sales and player fatigue, FIFA’s new expanded Club World Cup will throw up several intriguing storylines this summer in the United States.\nALSO READ: With Kane’s curse broken, Bayern eye Club World Cup treasures\nAFP Sport picks five things to look out for on the pitch as teams compete to conquer the world and claim their share of $1 billion in prize money.\nMessi back in the spotlight\nFormer Barcelona great Lionel Messi has spent the last two seasons at MLS side Inter Miami but the Club World Cup pits him against European opposition once again.\nThe 37-year-old superstar still possesses supreme quality but there are question marks over whether he and former top level stars Luis Suarez, Jordi Alba and Sergio Busquets can seriously compete against the cream of the crop.\nInter Miami face Porto in their second group match in Atlanta, a team Messi has faced once before, beating them with Barca in the UEFA Super Cup back in 2011.\nMessi also featured against Porto in a friendly with Barca back in 2003, which was his first ever appearance for the club at 16 years old.\nIf he nets at the tournament, Messi would become the oldest ever Club World Cup goalscorer, while both he and Suarez trail the competition’s all-time top scorer, Cristiano Ronaldo, by two goals.\nA new stage for Doue\nParis Saint-Germain’s Champions League final romp over Inter Milan was inspired by thrilling forward Desire Doue, who turned 20 earlier in June.\nHis spectacular burst into the limelight over the past few months means he is one of the players to watch this summer at the Club World Cup.\nHe struck twice in the final against Inter as well as setting up another goal and drew comparisons to Spanish starlet Lamine Yamal, who will not be playing this summer as Barcelona did not qualify.\nPSG’s opening clash against Atletico Madrid at the Rose Bowl in Los Angeles immediately gives Doue another stage to shine on as the world at large continues to discover his immense talent.\nRevamped City\nPep Guardiola’s Manchester City endured a poor season by their lofty standards and immediately took action in the special transfer window to bolster their squad for the Club World Cup.\nThe Abu Dhabi-owned club have already splashed more than £100 million ($136 million) on Tijjani Reijnders, Rayan Ait-Nouri and Rayan Cherki.\nWith holding midfielder Rodri also returning to fitness after injury, City are hoping they can step up their game significantly.\nFrench 21-year-old attacking midfielder Cherki is an exciting talent looking to show his quality at the top level.\n“I really believe he can become a world-class player with our support and direction,” said City’s director of football Hugo Viana.\nSouth American threat\nWhile Europe’s elite are at the end of a long, hard season, South American clubs are midway through their campaigns and will be energised.\nThey have long revered the competition to a far greater degree than European sides, as it represents the chance to face the very best teams in the world.\nFans who do not regularly follow South American football can look forward to discovering some of the most exciting emerging talents in the world.\nRiver Plate’s Argentine playmaker Franco Mastantuono will join Real Madrid after the tournament, while Chelsea-bound striker Estevao Willian is hoping to end his time at Brazilian side Palmeiras with a bang.\nAtletico hunger\nAtletico Madrid ended the season trophyless despite looking like potential contenders in Spain and Europe.\nDiego Simeone’s side are proud of having reached the tournament ahead of La Liga rivals Barcelona and the coach has not hidden his desire to succeed this summer.\n“I hope we can advance in the Club World Cup and lead Atletico Madrid to a privileged position,” said Simeone.\nALSO READ: Club World Cup a test of Chelsea’s elite credentials\nAtletico have not won a single trophy since lifting La Liga in 2021 and their last success outside of Spanish football came in 2018 with Europa League and UEFA Super Cup wins.\nTheir elimination by Real Madrid in the Champions League after Julian Alvarez’s controversial ‘double-touch’ penalty was disallowed sent them into a spiral, which they only managed to shake off in the final weeks of the season, after their chances of success had vanished.\nSupport Local Journalism\nAdd The Citizen as a Preferred Source on Google and follow us on Google News to see more of our trusted reporting in Google News and Top Stories.",
  "word_count": 761,
  "scraped_at": "2026-02-14T01:52:26.328474",
  "_text_extracted": true
}