{
  "article_id": "2dc7cf7132b6",
  "url": "https://metro.co.uk/2024/10/02/thierry-henry-says-arsenal-made-mistake-aston-villa-boss-unai-emery-21723930/",
  "title": "Thierry Henry says Arsenal made mistake with Aston Villa boss Unai Emery",
  "date": "20241003T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thierry Henry has hailed Unai Emery as a ‘tactical genius’ and is confident the Spaniard would have been a ‘success’ at Arsenal had the club given him more time.\nAfter steering Paris Saint-Germain to seven pieces of silverware including the 2017/18 Ligue 1 title, Emery took on the daunting task of replacing Arsene Wenger at Arsenal.\nThe 52-year-old had also guided Sevilla to three successive Europa League trophies, with the La Liga club completing a stunning comeback against Liverpool in 2016 to secure an unprecented hat-trick.\nBut Arsenal suffered a miserable run of results at the start of the 2019/20 campaign and Emery was relieved of his duties just 18 months into his tenure at the Emirates.\nEmery went on to win the Europa League for a fourth time with Villarreal and has since rebuilt his reputation in the Premier League with Aston Villa, who he has transformed from relegation candidates into a Champions League outfit.\nAsked whether Emery has his respect as a coach ahead of Villa’s group-stage clash with Bayern Munich, Arsenal legend Henry told CBS Sports: ‘Oh yeah, big time. He’s a tactical genius.\n‘He always goes out there and makes sure his team has an advantage tactically because that’s how he operates. We all know what he did in Spain.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘For me, obviously this is no disrespect to what Mikel Arteta is doing and is doing extremely well for Arsenal, I just thought that if we kept him [Emery] a bit longer he would have been a success at Arsenal.\n‘He did show it straight after when he left the club.\n‘I have massive respect for him.’\nEx-Liverpool defender Jamie Carragher, meanwhile, believes Emery is second only to Pep Guardiola when it comes to the finest coaches in the Premier League.\n‘I think he’s fantastic, I think he’s one of the best coaches in European football,’ Carragher, Henry’s CBS Sports colleague, chimed in.\nMore Trending\n‘He’s had great success in Europe, not in this particular competition [the Champions League], but in the Europa League specifically, with Sevilla and Villarreal.\n‘I would say in the Premier League we have Pep Guardiola above everybody else and he comes second and he’s not at one of the biggest clubs, let’s not forget.\n‘I always believe the manager is the most important person at a club and he is testament to that because that was a team who were flirting with relegation and within a couple of years they’re in the Champions League.\n‘It is phenomenal what he has done.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: John Obi Mikel fears one Chelsea star could prevent them winning the Premier League\nMORE: Kris Boyd blasts Manchester United for transfer mistake over ‘excellent’ player\nMORE: Diogo Dalot defends Manchester United captain Bruno Fernandes after Tottenham defeat",
  "word_count": 534,
  "scraped_at": "2026-02-14T02:11:06.637190",
  "_text_extracted": true
}