{
  "article_id": "2dd180bcb9bc",
  "url": "https://www.bbc.com/sport/football/articles/c4g9ge18931o",
  "title": "Manchester United sign Germany international Lea Schuller",
  "date": "20251229T184500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd sign Germany international Schuller\n- Published\nManchester United have signed Germany international Lea Schuller from Bayern Munich.\nThe 28-year-old, who is contracted until June 2029, becomes the club's second signing of the January transfer window after full-back Hanna Lundkvist's arrival.\nThe experienced forward spent five years at Bayern, making over 100 appearances and helping them win four league titles.\nShe has scored 54 goals in 82 appearances for Germany and was part of the squad who came runners-up to England at Euro 2022, as well as winning bronze at the 2024 Olympic Games.\n\"From the first conversations that I had with [manager] Marc [Skinner] and the club, the ambitions of everyone hear were very clear,\" said Schuller.\n\"I still have so much that I want to achieve in my career, and I know that Manchester United is the perfect club to join.\n\"I feel that the team's style of football will really suit my game. I hope my qualities and experience can help us to achieve our aims both in England and in the Champions League.\"\nMatt Johnson, Manchester United's director of women's football, said: \"Lea's goal-scoring record is phenomenal, her style of play will give our attack an exciting new dimension. We are delighted to add a player of her pedigree to the group.\n\"Lea's winning mentality and experience will really help our young and ambitious team as we continue to grow together and compete across domestic and European competitions.\"\nUnited hope to be busy in the transfer window as boss Skinner looks to bolster his squad for the knockout stages of the Women's Champions League.\nThey have already agreed a contract extension with key midfielder Hinata Miyazawa, who has agreed to stay until the summer of 2029.\nBen Haines, Ellen White and Jen Beattie are back for another season of the Women's Football Weekly podcast. New episodes drop every Tuesday on BBC Sounds, plus find interviews and extra content from the Women's Super League and beyond on the Women's Football Weekly feed",
  "word_count": 336,
  "scraped_at": "2026-02-14T01:52:59.281888",
  "_text_extracted": true
}