{
  "article_id": "2de23a373b55",
  "url": "https://www.football.london/arsenal-fc/transfer-news/arsenal-transfer-deadline-day-live-26113705",
  "title": "Arsenal transfer news LIVE : Jorginho medical , deal agreed , Caicedo bid , Rafael Leao contract hope",
  "date": "20230131T113000Z",
  "domain": "football.london",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Deadline day is upon us! And with that arrives crazy last-minute permanent departures and loan moves from all across the world of football and it looks as though Arsenal will be at the centre of one of those.\nBrighton star Moises Caicedo remains the number one target for the Gunners. However, Brighton's stance has not changed despite two bids arriving from north London. Edu and Mikel Arteta are expected to make a third improved offer for the 21-year-old.\nThe Seagulls' firm stance on not allowing a mid-season exit looks to remain and therefore alternatives are being looked at by Arsenal. Youri Tielemans and Amadou Onana have both been discussed and now a shock deadline day move for Chelsea star Jorginho appears in the works.\nWith that said it looks set to be a tense final day of the January trading period for Arsenal, so be sure to stick with our live blog with regular updates to come throughout the day until 11pm.\nGet your questions answered\nOur reporters are working tirelessly to bring you the latest goings on today, and they're here to answer your questions too.\nJust leave a comment on this post with what you want to know about today's goings on, and the answers will come in throughout the day!\nCedric joins Fulham on loan\nFulham have confirmed that Arsenal defender Cedric Soares has joined the club on loan until the end of the season. A statement on the Fulham wesbite read: \"The Club is delighted to announce the signing of Cédric Soares on loan from Arsenal.\n\"Right-back Soares, who worked with Marco Silva previously at Sporting Clube de Portugal, will remain at Craven Cottage for the remainder of the 2022/23 campaign.\n\"With only two domestic loans permitted per season, Shane Duffy’s deal has now been made permanent – with the assistance of Brighton & Hove Albion – to facilitate this transfer, with Duffy helpfully signing a short-term contract until the summer.\nSpeaking to FFCtv, Cédric said: “I feel great. I wanted this deal to happen, so we all pushed in the same direction, and I’m really happy and pleased to be here.\n“Me and my family are really, really happy for this move. It’s a great move and I can’t wait to start.”\nTony Khan added: “I'm excited to welcome Cédric Soares to Fulham on loan for the remainder of the season.\n“Cedric has great experience against top competition, in international matches and in the Premier League. I'm pleased that we were able to reach an agreement with Arsenal to bring him to Fulham, and I'm excited for Cédric to flourish under the great coaching of Marco Silva!\n“We're very happy with the work that we've done in this window, and look forward to the rest of the season ahead!\n“Come on Fulham!”\nIn the building. #AcédIt | #FFC pic.twitter.com/hwzCXeryhp\n— Fulham Football Club (@FulhamFC) February 1, 2023\nJorginho on playing for Arsenal\nJorginho has completed a £12million move to Arsenal from Chelsea. The Italian midfielder has spoken about how much it means to him that he will be able to wear the famous red and white jersey.\nJorginho on playing for Arsenal: “It’s an important shirt. It’s an amazing club, a big one & I’m really excited & happy to be here.” #afc pic.twitter.com/xaxtd2DVZT\n— afcstuff (@afcstuff) January 31, 2023\nTwo loan exits\nOfficial: Arsenal youngsters Kido Taylor-Hart & Billy Vigar have both joined League One side Derby County on loan for the remainder of the season.\n— afcstuff (@afcstuff) January 31, 2023\nBest of luck, lads! #afc https://t.co/9bUZhMby8i\nArsenal have already lined up two big-money summer signings after deadline day Jorginho transfer\nDespite signing Jorginho on transfer deadline day, Arsenal are still keen to bring in two big-money midfielders this summer if recent reports are to be believed.\nThe Italian international joined the Gunners for a deal worth £10million in guaranteed fees with a further £2million in add-ons, football.london understands. His contract will be until the summer of 2024, with the club holding the option of an extra year but according to Sky Sports transfer guru Dharmesh Sheth, Mikel Arteta's side still want to sign both West Ham United captain Declan Rice and Brighton star Moises Caicedo this summer.\nThe north Londoners saw bids of £60 million and £70 million for Caicedo rebuffed by the Seagulls during the January transfer window, with Roberto De Zerbi's side making it clear that they didn't want to sell the Ecuadorian at any cost. West Ham maestro Rice has also been heavily linked with a summer switch to the Emirates Stadium and football.london understands that the Gunners still hold a keen interest in bringing the England international to the club this summer.\nIt would certainly cost mega-money to sign both Caiceco and Rice, although both have made it clear that they are ready to play at the top-level sooner rather than later. The former released a statement on social media urging Brighton to let him leave this month following news of Arsenal's bid last week.\n\"I am grateful to Brighton for giving me the chance to come to the Premier League and I feel I have always done my best\", the 21-year-old's Instagram post read. \"I always play football with a smile and with heart.\nArsenal near second deadline day deal with defender undergoing medical ahead of loan exit\nCedric Soares is undergoing a medical with Fulham ahead of a potential loan move football.london understands. The Portuguese international is edging closer to a deal which will see him head to Craven Cottage for the remainder of the season.\nMarco Silva has been keen to add versatility and experience to his back line and is desperate to bring Cedric into his squad before the January transfer window slams shut at 11pm. However, in order to do that Fulham will need to free up one of the loan spaces in their squad and it is thought that they are working on a deal to make Shane Duffy's move from Brighton a permanent one.\nSambi Lokonga joins Crystal Palace on loan\nAlbert Sambi Lokonga has joined Crystal Palace on loan until the end of the season. The Belgian midfielder will hope to play regular first team football at Selhurst Park and return to the Gunners in the summer.\nAnother one joins #CPFC\n— Crystal Palace F.C. (@CPFC) January 31, 2023\nArsenal have completed 'perfect' Man United transfer with deadline day deal\nArsenal have announced the signing of former Chelsea midfielder Jorginho.\nThe former Napoli star has joined Mikel Arteta's side for a deal worth £10million in guaranteed fees with a further £2million in add-ons, football.london understands. His contract will be until the summer of 2024, with the club holding the option of an extra year - a deal that Manchester United should have pursued, according to former England international Lianne Sanderson.\n\"I think it’s a great signing. £12million? What a great signing that is,\" Lianne Sanderson told Sky Sports when asked about Jorginho 's imminent move to north London. \"I don’t want to bring it back to Manchester United, but you’d think Manchester United would have been knocking on the door given the injury to Christian Eriksen.\n\"He would have been the perfect signing. It’s a great signing for Arsenal, I like Jorginho.\"\nThe Italian will likely come in as cover for Arsenal's first-choice holding midfielder Thomas Partey, who has suffered from several different injuries since joining from Atletico Madrid back in October 2020. Egyptian international Mohamed Elneny has previously been Arteta's backup No.6, although the Gunners confirmed on Tuesday afternoon that he is facing an extended time on the treatment table following an injury to his knee.\nAlbert Sambi Lokonga transfer exit hint\nAlbert Sambi Lokonga is having dinner with his agent on deadline day with the Belgian midfielder thought to be close to securing a move to Crystal Palace on loan. Lokonga posted a picture on social media of him out with his agent earlier this evening.\nNBA star Josh Hart isn't happy with Jorginho joining Arsenal\nNBA player and Chelsea die-hard fan Josh Hart has shared his reaction to Jorginho's nearly-completed, shock move across London on social media, after a leaked picture of the Chelsea vice-captain in an Arsenal shirt emerged on Tuesday.\nThe Portland Trailblazers shooting guard showed his disgust at a tweet from transfer guru Fabrizio Romano revealing the 31-year-old's surprising switch by sharing a face vomiting emoji three times on Twitter.\n— Josh Hart (@joshhart) January 31, 2023\nJorginho sends message to Arsenal fans\nJorginho posted a picture of himself in his new colours with the caption: \"New chapter. New challenges.\"\nRio Ferdinand and Harry Redknapp disagree on Arsenal's decision to complete Jorginho transfer\nThe former Napoli man has signed a deal at the Emirates Stadium until the summer of 2024, with the club holding the option of an extra year - a deal that Ferdinand has claimed is a shrewd one.\nSpeaking on his YouTube channel, the ex-England international said: “I think it’s a good signing. It’s shrewd.\n\"I’ve been known to criticise Jorginho. And even just to clarify that, I was criticising him because the way Chelsea played at the beginning when he was there didn’t help him.\n“Whatever you think of him, on the ball, he’s a fine passer of the ball, especially cutting through the lines, he keeps it ticking. I don’t see him being a starter for Arsenal, I’ve got to be honest.\n“Everything I hear about him as a pro has been positive. Nothing but positive. In the changing room, he’s a leader.”\nHowever, former Tottenham Hotspur manager Harry Redknapp doesn't quite share Ferdinand's optimism on the Gunners' move for Jorginho. “No, I wouldn’t see where he would fit\", Redknapp told TalkSPORT when asked about the 31-year-old's proposed move to north London.\n\"I couldn’t see him getting in the team. He’s obviously a top player, I mean that Arsenal team at the moment, in that starting XI there’s not many places up for grabs in that team.\"\nArsenal receive transfer windfall as Barcelona make transfer decision\nHector Bellerin left Arsenal in the summer to join Barcelona but now looks set to join Sporting CP after just six months at the Camp Nou.\nArsenal have a 25% sell on. https://t.co/uhqTgyC3Zg\n— Tom Canton (@TomCantonMedia) January 31, 2023\nJorginho shirt number confirmed\nJorginho will wear the No.20 at Arsenal after completing a £12million transfer from Chelsea.\nEdu and Mikel Arteta explain Jorginho £12m transfer to Arsenal\nThe Arsenal sporting director said: “Jorginho is an established professional with a strong mentality who brings quality and experience into our squad.\n\"He is a player who fits our style of play, and he joins us at a very good moment where he can contribute in a key position to help maintain our momentum. We welcome Jorginho to Arsenal.”\nManager Mikel Arteta added: “Jorginho is a midfield player with intelligence, deep leadership skills and a huge amount of Premier League and international experience. Jorginho has won in his career, but he still has the hunger and huge willingness to contribute here.\n\"We are so pleased to sign Jorginho and welcome him and his family to the club.”\nJorginho in an Arsenal shirt and his first words\nArsenal's third January signing in a Gunners shirt for the first time! Jorginho has spoken to the club's media in an interview after completing a £12million transfer from London rivals Chelsea.\nSpeaking about his new boss, Jorginho said: “He was a big influence because I know that he tried a few times to get me before and it didn’t happen due to other reasons, not because of my wishes. So of course, he had a big influence.\n“I’m very excited for this new challenge, and I just can’t wait to be on the pitch to be honest! Everything has happened so fast. I was a bit surprised, but I took the opportunity of this amazing challenge.\n“It’s an important shirt. It’s an amazing club, a big one, and I’m really excited and happy to be here.”\nJorginho comes into our squad having played against us 10 times in his career, including in our last league encounter against the Blues in November.\nThat has given him a unique perspective on our strengths and weaknesses, and he has been impressed with what we’ve achieved already this term which he hopes to help build on as we reach the business end of the campaign.\nReflecting on November’s game, he admitted: “It was tough, it was a hard time! Even in pre-season we had a friendly match, and I could feel and see that Arsenal would do very well this season. So, when we faced each other again at Stamford Bridge, it wasn’t a surprise for me at all.\n“I’ll try to just bring positive energy, hard work and my experience to help the team. It’s what I always bring with me.\n“I try just to help with the experience I’ve had in my time with the other clubs and anything I can do just to help the team to achieve more and more, that’s my target. All I can promise is that I’m going to give my all to represent this club.”\nWelcome to The Arsenal, Jorginho pic.twitter.com/jHXqAUBKKQ\n— Arsenal (@Arsenal) January 31, 2023\nArsenal announce Jorginho transfer as midfielder makes £12m Chelsea deadline day switch\nArsenal have announced the signing of midfielder Jorginho from London rivals Chelsea on January transfer deadline day. The 31-year-old joins the Gunners for an overall £12million fee, with £10million paid in guaranteed payments while there are £2million in add-ons included.\nThe Italy international has joined on an 18-month deal with the club holding an option to extend that by a further year. It's a move that adds plenty of quality in depth for the side, who are lacking midfield numbers after Arsenal confirmed a huge knee injury sustained by Mohamed Elneny.\nThomas Partey was also handed an injury scare after being substituted against Manchester City in the FA Cup, further underlining how thin the deeper midfield lines are. Jorginho adds plenty of experience and quality to the side amid a push for the Premier League title, with the side sitting top and five points clear of City in second.\nThe Italian has won seven trophies in his playing career so far, including a Champions League, and was awarded for his fine performances in 2021 with a third-place Ballon d'Or finish. The end of his time at Chelsea came with a complete philosophy change at Stamford Bridge under new owners with his deal coming towards an expiry in the summer.\nManchester United make major Youri Tielemans transfer decision that impacts Arsenal move\nAny potential move from Arsenal for Youri Tielemans may depend upon the decisions of their rivals Manchester United in the final hours on the January transfer window. The Gunners have continued to be linked with a switch for the Belgian midfielder, who has just a few months remaining on his contract at Leicester City.\nWith only a few hours left in the January window, a move seems more than unlikely for the north London side, who are instead tying down a switch for Chelsea star Jorginho. At £12million, the move could be a snip of the price they would have to pay for Tielemans, who could be available for free in the summer.\nAt this stage, football.london understands interest in Tielemans has cooled, with Declan Rice and Moises Caicedo viewed as potential options for the midfield in the summer. It remains to be seen how things will change in the next few months though, given the groundwork put into the potential signing of the 25-year-old over the past year.\nHowever, that move in the summer could be dependent on clubs elsewhere not pursuing a switch for Tielemans too. One of the other sides that continues to be linked are rivals Manchester United, who are in need of a midfield option late in the January window following a lengthy injury to Christian Eriksen.\nLuckily for the Gunners, it appears as though the Red Devils have been put off a deal in the final hours as Sky Sports reports that a high fee set by Leicester has dissuaded an switch from happening. It means a free transfer in the summer is highly likely unless a new contract is signed.\nLeandro Trossard misses Arsenal training\nLeandro Trossard is thought to have missed Arsenal training due to his partner expecting to give birth. The Belgian forward completed a £27million switch from Brighton to the Emirates Stadium earlier this month.\n| Understand Leandro Trossard missed training today. No injury issues. His girlfriend is expecting a child anytime now. #EVEARS\n— Connor Humm (@TikiTakaConnor) January 31, 2023\nMarc Cucurella reaction to Jorginho leaving to join Arsenal\nMarc Cucurella found out about Jorginho's expected transfer to Arsenal in the most entertaining way possible. The Spaniard named the Italian as the most intelligent player in Graham Potter's squad before being told about his £12million move to the Emirates Stadium.\nMarc Cucurella's reaction when we told him Jorginho was joining Arsenal pic.twitter.com/9j4zIte2Wx\n— GOAL (@goal) January 31, 2023\nMoises Caicedo transfer latest\nArsenal and Chelsea have both been linked with a move for Brighton midfielder Moises Caicedo during the January transfer window.\nBoth the Gunners and the Blues have been keen to bolster their options in midfield during the winter window but they are running out of time to bring in fresh faces, with tonight's deadline fast approaching. Caicedo played under Graham Potter at the Amex Stadium before the coach arrived at Stamford Bridge as their new manager in September of last year.\nArsenal deal not happening\nArsenal's primary midfielder target had been Caicedo for whom but the Gunners eventually accepted that a deal would not be happening in January. The Gunners then pivoted towards other targets and have agreed a deal with Chelsea for Italian international Jorginho, football.london understands.\nDeadline day move\nOnce they have signed off on the formalities regarding Enzo Fernandez, Chelsea will then make one last approach to Brighton to test their resolve for Caicedo, with an offer in excess of £75m potentially on the table according to 90min.\nChelsea twist\nChelsea were unable to meet Benfica's demands earlier in the window for Argentine midfielder Enzo Fernandez, who has a release clause of £106million. Chatter regarding a move had quietened down in recent weeks but now Portuguese newspaper Record has claimed that Benfica are expecting the Blues to come back with another offer for Fernandez ahead of transfer deadline day on Tuesday.\nFulham set to finalise Cedric Soares loan move\nFulham are set to finalise a deal for Cedric Soares on loan from Arsenal until the end of the season, according to The Athletic.\nThe move for the 31-year-old right-back is contingent on the club first turning one of their existing loans into a permanent signing, however and that is likely to be Shane Duffy.\nMartin Odegaard sends message to Mohamed Elneny\nArsenal captain Martin Odegaard has sent a message of support to teammate Mohamed Elneny after the midfielder suffered a serious knee injury.\n| Ødegaard on IG: pic.twitter.com/dQNDNZ26mJ\n— Arsenal Buzz (@ArsenalBuzzCom) January 31, 2023\nArsenal deal praised\nDarren Bent has reacted fairly positively to speculation that Chelsea’s Jorginho will be joining Arsenal today on deadline day.\nThis transfer story has broken very suddenly in the last 24 hours, with Chelsea now set to lose one of their senior individuals to their London rivals.\nThe Athletic reports that Arsenal are set to pay £12million to sign Jorginho from Chelsea today.\nJournalist Charles Watts adds that the 31-year-old Blues midfielder has been given permission to travel the Emirates Stadium to complete the deal.\nRead the full story, here.\nJorginho set to allow Stan Kroenke to break Arsenal transfer record amid Moises Caicedo interest\nHis expected arrival has certainly divided opinion among Arsenal supporters, but the signing of Jorginho could well benefit the club's transfer business come the summer.\nThe 31-year-old is set to join the Gunners today after a £12million deal was agreed between Arsenal and Chelsea, which will see him put pen to paper on an 18-month contract with an option of a further year. It comes after the Premier League leaders had two bids turned down for Brighton's Moises Caicedo, the last one believed to be worth £70million.\nMikel Arteta was desperate to bolster options in midfield after Mohamed Elneny underwent successful surgery on a 'significant' knee injury, but the need for reinforcements was only emphasised following Sambi Lokonga's struggles against Manchester City last week. The addition of Jorginho has opened up the door for the Belgian to leave before tonight's 11pm deadline, with Arsenal and Crystal Palace in talks over a potential loan move, football.london understands.\nThat is not expected to be the only benefit of Jorginho's arrival, however, as his signing will allow Stan Kroenke to substantially back Arteta again in the summer. Prior to the £70million pursuit of Caicedo, the Gunners were in talks with Shakhtar Donetsk to sign Mykhailo Mudryk in a deal that eventually saw Chelsea splash £88million to win the race. Although it appears Arsenal will now miss out on both players, it shows KSE are willing to provide sufficient funds now and in the future.\nWith Jorginho only costing £12million and signing a short-term contract, it leaves plenty of money available for a big name signing in a few months time ahead of the 2023/24 season. In addition to Caicedo, Arsenal hold serious interest in West Ham's Declan Rice and football.london understands the business conducted this month will have no direct impact on plans to recruit another midfielder in the summer.\nHoussem Aouar inquiry\nAccording to Foot Mercato, Houssem Aouar has been offered to Manchester United with Erik ten Hag's side ready to take the midfielder on loan.\nAouar had previously been linked with a switch to Arsenal but now he could be on his way to the Gunners' Premier League rivals.\nMikel Arteta may have already hinted at another midfield signing amid Jorginho transfer\nArsenal have agreed a deal with London rivals Chelsea to sign central midfielder Jorginho, football.london understands.\nThe Italian will arrive at the Emirates Stadium for £10million in guaranteed fees with a further £2million in add-ons, signing a contract until summer 2024, with the club holding the option of an extra year. The Gunners are also in talks with Crystal Palace over a loan move for young midfielder Albert Sambi Lokonga, football.london understands whilst Mohamed Elneny is set for an extended spell on the sidelines as his knee injury has proven to be more serious than initially feared.\nMikel Arteta admitted that his side are short of options in the centre of the park earlier this month, telling football.london: \"We need some more cover in midfield ideally if we can. In this market, it’s pretty complicated to do that.\n\"The most important thing is that we get the performances and the time on the pitch that we need with the players we have available today that are already really good.\"\nConsidering Lokonga is set to leave and Elneny is not expected to be back anytime soon, the Spaniard's comments could suggest that the addition of Jorginho won't end Arsenal's pursuit of midfielders before this evening's deadline.\nAlbert Sambi Lokonga to join Crystal Palace\nAlbert Sambi Lokonga is set to join Crystal Palace on loan until the end of the season after completing medical tests this afternoon.\nJorginho's arrival at the Emirates Stadium would have seen the Belgian fall further down the pecking order and now he will have the chance to play regularly for Patrick Vieira's side.\nAlbert Sambi Lokonga to Crystal Palace is done and sealed after medical done in the afternoon as @GFFN reported Here we go. #CPFC\n— Fabrizio Romano (@FabrizioRomano) January 31, 2023\nArsenal have accepted loan deal for Lokonga until June. pic.twitter.com/Rqfsf8T2v0\nArsenal set to make Mohamed Elneny decision\nArsenal are set to extend Mohamed Elneny's contract despite the midfielder suffering a serious knee injury.\nExpecting Arsenal to trigger Mohamed Elneny's option to extend his contract by a further 12 months.\n— Mark Mann-Bryans (@MarkyMBryans) January 31, 2023\nConversations under way and injury has not had an impact on the decision, which could be announced in the next week or so.\nJorginho spotted in Arsenal kit with agent as shirt number revealed following Chelsea transfer\nArsenal have agreed a deal with Premier League rivals Chelsea to sign central midfielder Jorginho, football.london understands.\nThe Italian international will join Mikel Arteta's squad for a deal worth £10million in guaranteed fees with a further £2million in add-ons. He will sign a deal at the Emirates Stadium until the summer 2024, with the club holding the option of an extra year.\nNow, Jorginho's agent Joao Santos has posted a picture of the 31-year-old in an Arsenal shirt to his Instagram account. The former Napoli star is also wearing Gunners tracksuit bottoms with the number 20 on them, presumingly meaning that he will don that number on the back of his Arsenal shirt.\nArteta will hope that his new signing will add some much-needed quality to his midfield depth following Mohamed Elneny's long-term knee injury. During his four and a half years with Chelsea, Jorginho featured 219 times across all competitions, netting 29 goals and providing a further nine assists.",
  "word_count": 4223,
  "scraped_at": "2026-02-14T01:59:41.729282",
  "_text_extracted": true
}