{
  "article_id": "2ded6a9287a7",
  "url": "https://metro.co.uk/2025/04/24/gary-neville-reveals-wants-win-champions-league-ahead-arsenal-vs-psg-clash-22964808/",
  "title": "Gary Neville reveals who he wants to win the Champions League",
  "date": "20250424T120000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Neville has revealed who he wants to win the Champions League as Arsenal, PSG, Barcelona and Inter Milan prepare for the semi-finals.\nArsenal take on Paris Saint-Germain and Barcelona face Inter for a place in the 2025 Champions League final, to be held at the Allianz Arena on May 31.\nPremier League runners-up Arsenal eliminated defending European champions Real Madrid in the quarters, a stunning 5-1 aggregate victory making the Gunners favourites to lift the trophy in the eyes of many.\nFrench champions PSG were equally impressive over two legs against soon-to-be Premier League title winners Liverpool before they scraped past Aston Villa.\nOn the other side of the draw, Barcelona outclassed Borussia Dortmund to reach the semis, while Inter Milan knocked out German giants Bayern Munich.\nJamie Carragher ‘doesn’t like’ seeing English teams other than his beloved Liverpool win European trophies but Neville insists he ‘wants’ Arsenal to win this year’s Champions League.\nArsenal will have gone five straight seasons without silverware if they fall short in the Champions League and Neville says Mikel Arteta is in desperate need of a ‘big trophy’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I wouldn’t mind seeing Arsenal win it at all,’ Neville said on the Stick to Football podcast with Sky Bet.\n‘I’d want them to win it. I want Arsenal to win it for Arteta really. I think being there five years, he needs that big trophy. He needs a trophy.’\nCarragher, meanwhile, said: ‘I can’t say I’d like to see Arsenal win it because I’d just be lying. I don’t like to see other English teams winning big European competitions.\n‘If PSG won it, it’s almost good for the game in that they’ve had had the Messi, Neymar and Mbappe and almost come away from that.\n‘Not young kids, but young, energetic, top players. More of a team. If you’re Mbappe, you leave to go to Real Madrid and they’re all over the place.’\nTheo Walcott named his former club Arsenal as ‘favourites’ to win the Champions League after their stunning victory over Real Madrid.\nMore Trending\nBut football icon Luis Figo believes Arsenal will be coming up against the real Champions League ‘favourites’ in the semi-finals.\nPushed to name his favourites to win the Champions League, the 2000 Ballon d’Or winner replied: ‘In my view, PSG.\n‘They have a good consistency of results and excellent physical fitness at the moment.\n‘It’s difficult to say for certain, I don’t feel that I can make a really strong prediction on who will win the Champions League.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Liverpool boss Arne Slot reveals how he reacted to Arsenal’s draw with Crystal Palace\nMORE: Wojciech Szczesny fails ‘fight’ to quit smoking 10 years after Arsenal incident\nMORE: Arsenal fan group forced to refund supporters over tifo for Paris Saint-Germain game",
  "word_count": 537,
  "scraped_at": "2026-02-14T02:09:01.862152",
  "_text_extracted": true
}