{
  "article_id": "2df8f9c4df33",
  "url": "https://metro.co.uk/2025/02/25/jamie-carragher-names-liverpools-biggest-rival-premier-league-title-next-season-22620488/",
  "title": "Jamie Carragher names Liverpool biggest rival for the title next season",
  "date": "20250225T111500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher has named Liverpool’s biggest rival for the Premier League title next season.\nThe Premier League trophy is surely heading to Anfield after Arne Slot’s side opened up a healthy 11-point lead at the top of the Premier League.\nThe gap to second-placed Arsenal could have stood at just five points after the weekend’s fixtures but the Gunners suffered a damaging defeat at home to West Ham before Liverpool beat Manchester City.\nIt would be almost unprecedented if Liverpool did not lift the Premier League trophy at this stage, with Arsenal struggling to cope with their injury crisis and defending champions Man City slipping down the pack.\nMan City’s drop-off under Pep Guardiola has been staggering but Carragher still expects the Etihad club to be Liverpool’s biggest rivals for the title next season ahead of the likes of Arsenal and Chelsea.\nSpeaking on The Overlap with Sky Bet, Carragher said: ‘I was thinking about Arsenal and I actually think they’ve been a little bit unlucky.\n‘I think sometimes, it’s about timing and I think if the Arsenal of last season, if that is playing this season, this is a real sort of fight between Liverpool and Arsenal to the wire.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Last season, you were at your best but Man City are still City. City have had the drop-off this season and I think the worry for Arsenal is and I take it back to when I played for Liverpool in that under Mikel Arteta, I think he’s been here five years and every year you get better and you get to that point and we get there under [Gerard] Houllier, we got there under [Rafael] Benitez, where you just don’t make that final step, we dropped off massively.\n‘Now, when you say you aren’t the team of the last two years, are you a little bit worried that we’ve actually seen peak Arsenal and Arteta?\n‘I think we have actually, the second half of last season I think was the best, I thought Arsenal were brilliant, as good as anyone in Europe and I was watching them every week thinking this is a proper team.\n‘We were talking after the game yesterday that I still think, if Liverpool go on and win the league, you can always so, who’s going to challenge the champions next season?\n‘I think I would still back Manchester City more than Arsenal right now.’\nMan City are currently 20 points behind Premier Leaders Liverpool and were knocked out of the Champions League last week by Real Madrid.\nMore Trending\nSpeaking after Liverpool’s impressive win at the Etihad, Slot – who replaced Jurgen Klopp in the Anfield hot-seat – admitted he did not expect the Reds to be in such a dominant position when he took over.\n‘No, because you never think like that. If you start somewhere, you don’t think about where you are in terms of points at the end of the season,’ he said.\n‘What we do know is that no-one saw us as a title contender when we started at the beginning of the season – and I think no-one in the world of football would have expected City not to be so close to the one that leads the league, if they are not the one that leads the league.\n‘We all know why, they had many injuries, they had a difficult period, but again today you could see – although the result maybe doesn’t show you that – how good they are as a team and how difficult they are to play against.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd urged to sign free agent who’s ‘better than all their midfielders’\nMORE: Darren Bent slams Arsenal star who has ‘not been good enough all season’\nMORE: Former Arsenal star tips current Premier League boss to replace Mikel Arteta",
  "word_count": 710,
  "scraped_at": "2026-02-14T02:14:59.448080",
  "_text_extracted": true
}