{
  "article_id": "2e1bb50f540d",
  "url": "https://metro.co.uk/2023/12/13/psv-coach-peter-bosz-hails-nearly-perfect-arsenal-star-champions-league-draw-19966000/",
  "title": "PSV coach Peter Bosz hails  nearly perfect  Arsenal star after Champions League draw | Football",
  "date": "20231213T070000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSV head coach Peter Bosz believes Kai Havertz is ‘really intelligent’ and ‘technically almost perfect’ following Arsenal’s 1-1 draw in the Champions League on Tuesday evening.\nEddie Nketiah opened the scoring for Arsenal with a neat finish shortly before half time but PSV, who have finished second in Group B behind the Gunners, equalised through Yorbe Vertessen in the 50th minute.\nHavertz, meanwhile, was reunited with Bosz having played under the PSV coach for nearly two years at Bayer Leverkusen.\nThe Germany international left Leverkusen for Chelsea in a £71 million deal 2020 before Arsenal completed a surprise £65m move for the 24-year-old in the summer transfer window.\nWhen asked if he envisaged Havertz would command such a high transfer fee during their time together in the Bundesliga, Bosz said after PSV’s draw with Arsenal: ‘You don’t need to be a scientist in football [to see] that this was a big, big talent, absolutely.\n‘The only thing is he is really a modest guy, that can he succeed in a different country at a top club?\n‘But he did, at Chelsea he scored that really important goal in the Champions League final, now he’s a starting member at Arsenal.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He’s an outstanding, outstanding player.’\nBosz also believes an attacking midfield position is where Havertz will thrive the most at Arsenal.\n‘When I got to Leverkusen he played as a right winger but I saw him as an offensive midfield player,’ Bosz said.\n‘So I put him in a system, more or less, with one holding midfielder and two offensive midfield player, [Julian] Brandt was the other one. And he played outstanding there.\nMore Trending\n‘In the end I put him as a No.9. Rudi Voller didn’t agree with me but I think he can play there also, that’s what he did at Chelsea.\n‘Now he’s playing more again as an offensive midfield player. He can play in those positions but he can also play from the side.\n‘That means he’s a really intelligent player, technically he’s almost perfect for such a tall player, he can score goals, he is more than only for one position. But I believe where he is playing now is his best position.’\nMORE: Manchester United exit the Champions League with a whimper\nMORE: Peter Schmeichel says Manchester United midfielders are ‘confused’ after Champions League exit\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 465,
  "scraped_at": "2026-02-14T01:51:13.783200",
  "_text_extracted": true
}