{
  "article_id": "2e1f07b5deb0",
  "url": "https://punchng.com/kanu-backs-enyimba-to-bounce-back-after-caf-nightmare/",
  "title": "Kanu backs Enyimba to bounce back after CAF nightmare",
  "date": "20230829T043000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enyimba chairman, Nwankwo Kanu, has backed the People’s Elephant to bounce back from their CAF Champions League disappointment after they were knocked out by Al-Ahly Benghazi in the preliminary round of the competition last Sunday, The PUNCH reports.\nTwo-time winners Enyimba were held 0-0 in Aba by Libya’s Al Ahly Benghazi, who won the preliminary tie 4-3 on aggregate after snatching an added-time winner in the first leg.\nEnyimba, back-to-back African champions in 2003 and 2004, found it difficult to break down the resolute defence of their visitors, with the game ending in a goalless stalemate in Aba.\nKanu, who was appointed chairman of the club in May, stated that the Aba giants were unlucky against their North African foes.\n“It is very disappointing, but we have to go home with the positives,” Kanu said.\n“We did create chances, it’s not like they (Al-Ahly Benghazi) did better than us, they had only one shot at goal. When you lose a game, of course it is a bad one, but I wouldn’t say it’s a bad start, we want to be in the group stage of the CAF Champions League and do what we have to do.\n“If we didn’t play well and we lost, that’s another problem. That’s the point I’ll say that it’s a bad start.”\nHe also urged the players to put the defeat behind them and focus more on retaining their Nigeria Professional Football League title.\n“Sometimes these things happen to the best teams, the best players and that’s football,” he added.\n“We have to move on. The boys have to put their heads up and then know that sometimes in life you fall and you stand up. We need to support and encourage them to do better next time.\n“We are out of one competition, now we have the league (NPFL) and the Federation Cup, so, yes, we have to do more. We have to get more players to join the ones that we do have.”\nAlso, striker Anthony Okachi believes the Elephants were unlucky.\nOkachi, who replaced Chijioke Mbaoma in the 72nd minute, said, “I feel disappointed but then it’s football. We played well but the team (Al-Ahly Benghazi) kept all 11 men behind the ball, which was a bit difficult to break.\n“Football is a game of pressure, which we tried so well to handle and then the fans were amazing, kept supporting till the last minute\n“Yes, I think luck was not on our side. I believe that if luck was on our side, we could have won the game. But it wasn’t an easy game even though we were at home.”",
  "word_count": 439,
  "scraped_at": "2026-02-14T02:10:09.475143",
  "_text_extracted": true
}