{
  "article_id": "2e34751ed0d2",
  "url": "https://dailytrust.com/guardiola-winning-champions-league-is-a-relief-but-we-want-to-defend-the-treble/",
  "title": "Guardiola : Winning Champions League is a relief but we want to  defend  the treble",
  "date": "20230815T221500Z",
  "domain": "dailytrust.com",
  "source_country": "Niger",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City manager, Pep Guardiola, has sounded a note of warning to the rest of England and Europe to try and take the treble off the Etihad club s they plan to defend the historic feat.\nThe mercurial Spanish coach stated this and more when pressed at the pre-match press conference for the upcoming UEFA Super Cup final match.\nGuardiola and his Man City team claimed the EPL title, FA Cup trophy, and the UEFA Champions League, a major target since Abhu Dhabi’s Sheikh Mansour bought the club in 2008.\nBut when quizzed by Omar Akatugba, a Nigerian journalist at the press conference for the UEFA Super Cup, Guardiola stated that while they are relieved to have won the biggest, most difficult prize in club football, his team is ready to defend the treble.\n“I have to admit it was a relief for the club of course,” Guardiola started, adding that: “we have to tell you as well that you can be here seven years, a decade, twenty years, fifty years and you don’t win the Champions League, so it is difficult to win.\n“It is of course a big relief but that is not enough, otherwise everybody will be at home. And we are here, yet we’re just hungry enough to compete; especially to challenge ourselves. To prove to ourselves that if someone will take our three crowns, hopefully they can fight against us to take it.\n“So we still want to defend what we won last year.”\nThe 52-year-ols Catalan also disclosed that Kevin de Bruyne, the club’s key plamaker, will miss months of action due to recurrent hamstring injury.\n“It’s a serious injury, we have to decide on surgery but he will be a few months out. Surgery would be, I don’t know, three or four months out.”\nManchester City have the chance to win their fourth title of the year when they face Sevilla at the Georgios Karaiskakis Football Stadium in Greece on Wednesday.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 361,
  "scraped_at": "2026-02-14T02:24:50.277491",
  "_text_extracted": true
}