{
  "article_id": "2e6609069e6a",
  "url": "https://www.caughtoffside.com/2023/12/13/transfer-news-madueke-nusa-van-de-beek-gimenez-bakayoko/",
  "title": "Transfer news : Madueke Nusa Van de Beek Gimenez Bakayoko",
  "date": "20231213T204500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on Fabrizio Romano’s Daily Briefing, a subscription service. If you would like to receive Fabrizio Romano’s exclusive articles via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\nMan Utd out of Europe plus an update on Donny van de Beek\nWe start today’s column with Manchester United and their defeat last night to Bayern Munich, which puts them out of the Champions League and out of Europe altogether as they finished bottom of their group.\nOnce again, this is not good enough for a club of this size. The Man United standard has to be different, it’s not just a normal good club – it’s Manchester United. Something different is needed on the long-term. I think in particular their offensive numbers are too poor, they need to improve in that area as soon as possible and it’s also important to note that they simply have too many injuries, with Harry Maguire and Luke Shaw now too – it’s way too much.\nThere’s also some important news on Donny van de Beek. He’s going to leave United, as I told you a long time ago, and now things are at an advanced stage for him to move on loan to Eintracht Frankfurt.\nGirona are also interested in Van de Beek, but he’s aware of the Eintracht Frankfurt interest, and things are progressing on that front, so I think there’s a good chance for this deal to happen. With Girona, their conditions for the loan are not so good for Manchester United, and so that’s why there is no agreement there.\nBut with Eintracht Frankfurt, things are very advanced and the negotiation is going well, with the player super keen on the move. He believes this would be a good place for him to go back into the starting XI and to get back to his best level, so it’s a work in progress, and the feelings are really positive on this deal.\nIt’s also a priority for United to bring in new players, but the outgoings are important, and we can say that Van de Beek is leaving, with a move to Eintracht advancing very well.\nReece James injury and more Chelsea updates\nI want to send a message to Reece James that we wish him all the best after his latest injury setback – he’s a great player, a great leader in the Chelsea dressing room, and a great lad, and he’s been really unlucky again as he now looks to be out until February/March.\nChelsea will now discuss internally with specialists what is the best way to deal with this injury, perhaps with surgery, which might mean waiting a little longer but with the aim of finally getting James back at his best level and able to perform consistently. He can’t be always injured – Chelsea want to protect James and so they want to discuss the best solution to have him at the best conditions as soon as possible.\nLet’s see what Chelsea will decide, but again we really wish him all the best. We won’t see him on the pitch again in 2023, but hopefully it won’t be too long after that.\nTo once again answer questions on Mauricio Pochettino, my understanding remains the same – he is safe in his job for now. The situation is under control, even if the club clearly can’t be happy with how things are going on the pitch.\nStill, it takes time, Chelsea changed a lot of players. If you look at their team one year ago and their team now, it’s completely different.\nThere are many, many points and many factors making the difference at Chelsea in this moment, including the age of the players, including crucial players like Romeo Lavia, Christopher Nkunku – it’s €110million invested on these two players and they didn’t have the chance to play one single minute, while many other players are also injured.\nSo it’s been an unlucky beginning of the season, of course there are many problems, but they’re still backing Pochettino, they’re still trusting Pochettino, of course waiting for different results, but at the moment I have no message on any imminent change at Chelsea.\nNoni Madueke’s future has also still not been decided – a loan could be a smart solution, but we’ll see, it will be something they need to discuss internally soon. Obviously there would be a lot of interest in Madueke because he’s a talented young player, but Chelsea trust him, so let’s see what happens.\nThe latest on David de Gea, Newcastle, and Barcelona\nI’ve had many questions again on David de Gea – all I can say is my latest information is that he’s keen on the move to Newcastle and is just waiting. It depends on Newcastle, whether they go for a goalkeeper and what kind of goalkeeper they go for. They are still discussing it internally.\nRumours about De Gea and Barcelona are being played down by Barca sources – they are not going to sign a new goalkeeper as they are happy with Inaki Pena, and they believe that Marc-Andre ter Stegen will be back soon – not in 2023, but early 2024.\nSo there is nothing happening with De Gea and Barcelona, but he’s still waiting for a possible opportunity at Newcastle as they discuss it internally. No talks or negotiations yet for a concrete signing in that position, but let’s see how this will play out.\nPotential issue in Tottenham’s pursuit of Santi Gimenez\nSanti Gimenez continues to be linked with Tottenham and a number of other clubs after his superb form for Feyenoord – he recently broke Luis Suarez’s record for the most goals scored in a calendar year in the Netherlands, so it wouldn’t be surprising to see him secure a big move soon.\nIt’s still early stages, with nothing decided yet, but the player’s father is also an important figure as they will be the main two people in charge of his future. It’s also important to consider the relationship between Tottenham and Feyenoord after the interest from Spurs in Arne Slot in the summer – there were some small issues, of course nothing big, nothing too serious, but it’s another point to consider.\nIn other news…\nAntonio Nusa – this exciting young talent has been linked again with Chelsea, but there are something like ten top clubs following Nusa around Europe, not just Chelsea. He’s one of the most talented wingers around so it’s normal, but I’m told is not something imminent or for January, more likely to be in the next months or so.\nJohan Bakayoko – It was an impressive performance from Johan Bakayoko against Arsenal last night and I’m not surprised, honestly, because he’s an elite talent. Brentford were more than close to signing him before Bakayoko rejected them to play Champions League football at PSV. I’m told Premier League clubs – not specific ones yet – are still monitoring Bakayoko, so this looks open.\nEric Bailly – A strange situation for him at Besiktas. I asked earlier today and the answer is clear: Bailly’s camp will work to protect the player and answer to Besiktas formal position as they believe this is not fair to Eric. There is nothing else in terms of talks on transfers yet; it’s still too early, too fresh a story.",
  "word_count": 1233,
  "scraped_at": "2026-02-14T02:10:33.604412",
  "_text_extracted": true
}