{
  "article_id": "2e7d378d5383",
  "url": "https://www.geo.tv/latest/577964-real-madrid-coach-carlo-ancelotti-opens-up-about-kylian-mbappes-struggles",
  "title": "Real Madrid coach Carlo Ancelotti opens up about Kylian Mbappe struggles",
  "date": "20241205T104500Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "December 05, 2024\nFrench football star Kylian Mbappe has struggled to reach the performance levels that were expected when he signed for Real Madrid, but he has been working hard to return to his old-self, acknowledged coach Carlo Ancelotti on Wednesday.\nAfter missing a penalty in Real's Champions League loss at Liverpool last week, Mbappe failed to convert another spot-kick on Wednesday as the La Liga champions slumped to a 2-1 defeat at Athletic Bilbao.\nIt was another lacklustre performance by Mbappe, 25, and Real Madrid, which led to their fourth loss in the last seven games in all competitions, raising more questions about their form with the France captain firmly under the spotlight.\n\"He is at a lot more than just 1% (of his potential), but he's not at his best,\" Ancelotti told a press conference.\n\"However, we have to give him time to adapt (to Real Madrid). He has scored 10 goals and is working hard to improve and to do better.\n\"I haven't spoken to him yet. It was a complicated, even, hard-fought, competitive game. We missed a penalty... I don't evaluate a player's game because of a missed penalty... sometimes you score and sometimes you miss. Obviously he's sad, disappointed, but we have to keep going.\"\nReal missed the chance to close the gap on leaders Barcelona who top the standings on 37 points, four ahead of Ancelotti's side in second place and five above Atletico Madrid in third, with both the chasing clubs having a game in hand.\n\"The match was evenly matched. Athletic are a very dangerous team, we competed and fought. I think the match was worth a draw,\" said Ancelotti.\n\"But it is what it is... We're still in contention and have to keep fighting. We could have got a better result, but we're here and we have to think about Saturday's game at Girona.\"",
  "word_count": 313,
  "scraped_at": "2026-02-14T02:26:24.519200",
  "_text_extracted": true
}