{
  "article_id": "2e8f53d5a0e0",
  "url": "https://www.90min.com/alisson-slams-new-champions-league-format-ac-milan-clash",
  "title": "Alisson slams new Champions League format ahead of AC Milan clash",
  "date": "20240917T111500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alisson slams new Champions League format ahead of AC Milan clash\n- Alisson hits out at new Champions League format\n- Liverpool goalkeeper believes schedule could impact welfare of players\n- Reds set to face Milan in tournament opener on Tuesday\nLiverpool goalkeeper Alisson Becker has criticised UEFA's new Champions League format, claiming that players are \"tired\" of overpacked schedules.\nThe 2024/25 Champions League is set to play out differently to previous seasons, with a new league phase replacing the traditional group stage. All 36 clubs will be pitted against each other in the standings, with each drawn against eight opponents.\nThose who finish from ninth to 24th will compete in an additional knockout round playoff for a place in the last 16, whereas those who finish in the top eight will automatically qualify.\nThis format does, of course, bring about more regular fixtures, with the promise of showcasing exciting ties earlier in the tournament. However, failure to finish in the top eight of the league phase would mean playing ten games just to reach the last 16, which previously required only six matches.\nPlayers have been feeling the squeeze for years and Alisson did not shy away from sharing his thoughts on the changes, claiming that player welfare has not been taken into consideration.\n\"For the supporters, it is amazing,\" he told reporters ahead of the Reds' visit to Milan.\n\"More games, more bigger games, big teams against each other. For us players as well, it is good that you are going to play against the best in Europe - and it is always a good idea to add some games to the calendar that is not busy...I am being ironic a little bit.\n\"Sometimes nobody asks the players what they think about adding more games so maybe our opinion does not matter. But everybody knows what we think about having more games. Everybody is tired of that.\n\"But we have to bring those kind of things on side and stay focused on the big challenge we have here. Whether the number is 30 or 40 [games]. It is a matter to sit down all together and listen to all the parts because we understand we have the media and TV, the side of UEFA and FIFA, Premier League, domestic competitions.\n\"We are not stupid, we understand that people want more games, but the reasonable thing would be for all the people I mentioned - those who make the calendar - to sit together and listen to all the parts inclusive of the players.\n\"I want to give my best in all the games I play but we need a solution. It does not look like we are close to a good solution for football sake and players' sake.\"\nLiverpool will play their tournament opener against Milan in Italy on Tuesday evening, before hosting Bournemouth in the Premier League on Saturday.",
  "word_count": 482,
  "scraped_at": "2026-02-14T02:17:48.913223",
  "_text_extracted": true
}