{
  "article_id": "2eb7cea9cc56",
  "url": "https://thepeoplesperson.com/2025/02/06/amazon-look-to-land-wayne-rooney-as-marquee-pundit-report-290627/",
  "title": "Amazon look to land Wayne Rooney as marquee pundit - report - Man United News And Transfer News",
  "date": "20250206T224500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wayne Rooney is at the centre of a four-way tug-of-war for his first job since being sacked as Plymouth Argyle manager, with the giants of sports TV circling the Manchester United legend.\nRooney is set to feature as a pundit for Amazon’s coverage of the upcoming Champions League match between Manchester City and Real Madrid.\nAnd as per The Mirror, the broadcaster has held discussions about bringing him on board as a regular member of their team, which also features Daniel Sturridge and Alan Shearer, with Gabby Logan presenting.\nThe former United captain finds himself with time on his hands after parting ways with Plymouth on New Year’s Eve, and this has not gone unnoticed by rival broadcasters looking for big names.\nThe Mirror claim that “offers have been flooding in” for United’s record goalscorer, who has already featured on Sky, BBC and TNT Sports.\nIt is reported that BBC’s Match of the Day “would happily sign him up” as the show prepares for life beyond Gary Lineker, which is thought to include “a different and wider variety of guests.”\nThe report continues that Sky Sports “rate him highly” and note that he offered strong views on The Overlap last week.\nAnd completing the quartet vying for Rooney’s time, TNT have previously employed the 39-year-old, picking his brains for last season’s clash between Everton and United.\nThe implication is that they would like to call on him for more coverage in the future.\nBut while these three are well-established in the football broadcasting game, Amazon are still developing their offering and would doubtless love to lock Rooney down as a flagship acquisition.\nThe Mirror believe that securing him as a regular pundit “would be a big coup” for Amazon, who share Champions League rights with TNT this season.\nIf all goes to plan, Rooney will be pitchside at the Etihad for next week’s last-16 play-off.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 320,
  "scraped_at": "2026-02-14T01:49:18.061997",
  "_text_extracted": true
}