{
  "article_id": "2eb71407a295",
  "url": "https://www.managingmadrid.com/2023/10/23/23928981/kepa-press-conference-champions-league-braga-real-madrid",
  "title": "Kepa :  There havent been any negotiations over a permanent transfer yet , it only October  ",
  "date": "20231023T223000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ahead of Real Madrid’s Champions League game away at Sporting Braga, Kepa Arrizabalaga was the player chosen for the player press conference held on Monday evening. Previewing Tuesday’s game, he said: “We know we’ve taken good results in the first two games and now we have these two games against Braga, which will be tough, especially in their stadium. But, we feel confident and feel we can take the three points.”\nKepa: “There haven’t been any negotiations over a permanent transfer yet, it’s only October”\nThe goalkeeper was the player who spoke at the pre-Champions League press conference on Monday.\nKepa on the pressure of playing for Real Madrid\nDiscussing his first couple of months at the club, the goalkeeper said: “I’d say it has been a very positive two months. We’ve started the season well and it’s a long season, but we’re on the right path. So, I’d say it has been a positive start, but I know any grade for my performances this season will be given at the end of the campaign. I have a similar routine after most games, it’s the same whether we win or lose. I watch back all the main plays I’m involved in over the following days. I try not to get too down when things don’t go well and to not get too carried away when I perform well. It’s an exciting challenge to play for a club like Real Madrid, surrounded by the best players in the world.”\nKepa on whether he wants a permanent transfer\nAt his presentation, Kepa already stated that he hopes his loan can be made permanent. Asked if that is still his thinking, he replied: “I said it then and I still hope to stay. But, we haven’t spoken about that or negotiated anything yet. It’s only October and we’re focused on the busy schedule.”\nKepa on whether he thinks he should be starting for Spain\nAsked about the Spanish national team and if he thinks he should be playing ahead of Unai Simón, he replied: “I always want to play for my club and for the national team. That’s what I work for. This is a question for the national team coach. I’m prepared and ready and obviously I’d like to play.”\nKepa on the refereeing on Saturday\nDe Burgos Bengoetxea was brought up during the press conference, as well as the RMTV refereeing compilations, but the player didn’t want to speak much about the officiating. He said: “We’re focused on what we do and on the game, which is what we can control. We’re not going to speak about referees. The coach already said this the other day. It’s better to not speak about that. The RMTV videos are what they are. The refereeing performances are what they are. We just focus on what we can do. We are players and we focus on playing.”\nThere were further questions about the refereeing and Kepa then responded with a message for the journalists. He said: “We have an English referee tomorrow. What I can say is that in England they don’t speak so much about the refereeing during the week. I think it would be good if we could speak here about the football more than the refereeing.”",
  "word_count": 544,
  "scraped_at": "2026-02-14T01:56:32.771741",
  "_text_extracted": true
}