{
  "article_id": "2ec93ddadda7",
  "url": "https://metro.co.uk/2026/01/25/wayne-rooney-makes-premier-league-title-claim-manchester-united-stun-arsenal-26513351/",
  "title": "Wayne Rooney makes Premier League title claim after Man Utd stun Arsenal",
  "date": "20260125T201500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wayne Rooney says Mikel Arteta will be ‘concerned’ with Arsenal’s defeat to Manchester United but still rates the Gunners as ‘favourites’ to win the Premier League.\nArsenal’s lead at the top of the table has been cut to just four points after they lost at home to United and Manchester City won earlier in the weekend.\nMikel Arteta’s side took the lead at the Emirates Stadium through Lisandro Martinez’s own goal but United equalised before half-time through Bryan Mbeumo.\nPatrick Dorgu’s stunning strike put United ahead shortly after the break but Arsenal looked to have earned a point and set up a potentially tense finale when they levelled through Mikel Merino.\nThe momentum appeared to be with title-chasing Arsenal at that stage but Manchester United went up the other end and snatched the victory as Matheus Cunha bent a superb strike past David Raya.\nThe defeat leaves Arsenal just four points ahead of second-placed Man City, while United climb into the Champions League places above Liverpool.\nRooney was hugely impressed by United’s second successive win under caretaker manager Michael Carrick and said his former teammate ‘couldn’t have dreamt’ of this start to his tenure.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nArsenal, in contrast, looked ‘nervy’ as they slumped to their first home defeat of the season, according to Rooney, though he still views the Gunners as the ‘title favourites’.\n‘I thought second half Manchester United were excellent and deserved the win,’ Rooney told BBC Sport. ‘I thought Arsenal were a bit nervy and started the second half on the back foot really.\n‘I think United took advantage of that, looked dangerous, defended really well again and deserved to win in the end.\n‘It’s been great for Michael [Carrick], two wins out of two against Manchester City and Arsenal. I don’t think he would have dreamt of that start when he took over last week.\n‘I think you’ve seen a complete change in everything really since he’s been in. He will be delighted.\n‘I think Arsenal are still title favourites but it will be a concern for [Mikel] Arteta what’s happened in the last three games against Liverpool, [Nottingham] Forest and now Manchester United.\n‘But I still think they’re probably slight favourites.’\nManchester United defender Harry Maguire described his team’s performance in north London as ‘magnificent’.\n‘It was absolutely massive,’ the England defender told Sky Sports. ‘We know that the first game, the derby at Old Trafford, you’re always up for them and you know that one-off results can happen, so we had to back it up today.\nMore Trending\n‘We spoke about it before the game, coming to the league leaders, who have been excellent this year I must say, they ask a lot of questions of you, to come here and have the setback late on to get the winner, it was a magnificent performance.\n‘Michael’s [Carrick] come in, he’s been brilliant with us, he’s brought a fresh energy in, the group’s really galvanised.\n‘Two tough games, everybody’s probably thinks we come away from them with not many points but to win both is magnificent.’\nCarrick’s Manchester United face Fulham next weekend while Arsenal complete their Champions League group campaign against Kairat on Wednesday night.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Patrick Vieira names two Arsenal stars who ‘didn’t produce enough’ against Manchester United\nMORE: Arsene Wenger says two Arsenal players were ‘nervous’ in Manchester United defeat\nMORE: Liam Rosenior says £29m star has been ‘outstanding’ since he joined Chelsea",
  "word_count": 645,
  "scraped_at": "2026-02-14T02:12:22.655130",
  "_text_extracted": true
}