{
  "article_id": "2ed5b728744e",
  "url": "https://www.teamtalk.com/liverpool/desperate-klopp-ordered-avoid-making-silly-liverpool-decision-that-other-clubs-would-not-make",
  "title": "  Desperate  Klopp ordered to avoid making  silly  Liverpool decision that no big club would make",
  "date": "20230407T093000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\n‘Desperate’ Klopp ordered to avoid making ‘silly’ Liverpool decision that no other big club would make\nPundit Alan Hutton has urged Liverpool not to rush back Luis Diaz, no matter how desperate they are for his return.\nThe 26-year-old has been unavailable since picking up a knee injury in October, before suffering another major setback during the World Cup break.\nBut, Diaz has now returned to training and although he wasn’t in the squad for Liverpool’s 0-0 draw with Chelsea on Tuesday, could potentially be back on the pitch in the near future.\nJurgen Klopp’s side have been disappointing overall this season, currently sitting in eighth place in the Premier League table – 10 points adrift from the top four.\nAs a result, the German coach is looking to make several additions to his squad ahead of next term, with the latest name linked being Chelsea’s Mason Mount.\nIndeed, since Liverpool’s 7-0 thrashing of Manchester United last month, they have scored just one league goal, showing how desperate they are for more attacking creativity.\nDiaz certainly has that in abundance. Before his injury, the Colombian winger scored four goals and made three assists in 12 appearances across all competitions.\nREAD MORE: Klopp learns cost of risky Liverpool transfer that could backfire massively next season\nHutton: It would be ‘silly’ to rush Diaz back\nNevertheless, Hutton has urged Liverpool to ease Diaz back and allow him to get back to full fitness gradually.\nWhen asked if the Reds could afford to ‘manage’ his return, Hutton told Football Insider: “I think they will still have to ease him back in no matter how desperate they are to get him back in the starting lineup.\n“I think it would be silly. There is no team, especially at that level, that are going to take that risk with a player that means so much to them.\n“He has been a big plus point for them this season. [His injury] has been disappointing to lose him but to throw him back in would just be silly. They know that, Jurgen Klopp is not the type of guy to do that.\n“He has got other options as well so he will take his time, monitor his minutes and get him back in to full speed when he is ready.”\nLiverpool still have plenty to play for this season, despite it looking unlikely that they will be able to bridge the gap with the top four.\nWhile the Champions League may not be achievable, the Europa League and Europa Conference League are still in reach.\nWith that in mind, Klopp will need his best players fully fit as we head into a crucial stage of the season.\nLiverpool’s next two games come against league leaders Arsenal, before they face relegation candidates Leeds United at Elland Road.\nReports suggest that Diaz could be fit for the clash against the Yorkshire club, so it will be interesting to see if he makes Klopp’s starting XI.\nREAD MORE: Liverpool switch their attention to alternative Premier League targets as Wolves remove Nunes clause",
  "word_count": 517,
  "scraped_at": "2026-02-14T01:59:46.865874",
  "_text_extracted": true
}