{
  "article_id": "2eef1be19e13",
  "url": "https://www.caughtoffside.com/2025/08/15/eberechi-eze-tottenham-transfer-decision/",
  "title": "Eberechi Eze informs Crystal Palace he wants to join Tottenham",
  "date": "20250815T163000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are working to sign Crystal Palace’s Eberechi Eze in this summer’s transfer window, with the talented attacker expressing his willingness to join the north London club.\nAccording to journalist Fabrizio Romano, Eze has made his intentions clear to Crystal Palace, paving the way for Tottenham to submit a formal offer for the 27-year-old.\nEberechi Eze would improve Spurs\nEze would be a vital addition to Tottenham’s attack, especially following the recent departure of Son Heung-min. The England international registered 25 goal contributions last season and has proven to be one of the Premier League’s most reliable performers. Joining Tottenham offers Eze a chance to compete for trophies and continue his career peak at a club eager to challenge for silverware.\nEze has helped Crystal Palace achieve notable success, including FA Cup and Community Shield victories. With Tottenham prioritising his signing, negotiations with Crystal Palace are expected to accelerate, particularly given Eze’s preference for the move. Although Arsenal were previously reported to be interested, they have since withdrawn, making Tottenham the favourites.\nEze’s arrival would strengthen Tottenham’s quest for domestic and European glory in the upcoming campaign.\nEze needs a fresh challenge\nThe 27-year-old is at the peak of his career right now, and he needs to compete at the highest level. He will look to test himself in the UEFA Champions League with Tottenham and help them win trophies. It would be the ideal next step in his career, and the player will hope that the two clubs can negotiate an agreement quickly.\nHe will look to sort out his future and focus on his football once again. There is no doubt that he is a tremendous talent with the ability to transform Tottenham. He has clearly outgrown Crystal Palace now, and this is the right time for him to take on a bigger challenge.",
  "word_count": 307,
  "scraped_at": "2026-02-14T01:52:36.774746",
  "_text_extracted": true
}