{
  "article_id": "2ef85841fc78",
  "url": "https://www.teamtalk.com/news/gunners-told-incredible-january-strker-target-not-going-anywhere-for-less-than-75m-pounds",
  "title": "Arsenal transfers : Gunners told incredible January striker target not going anywhere for less than £75m",
  "date": "20241022T174500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal told incredible January striker target not going anywhere for less than £75m\nArsenal have reportedly approached Premier League rivals Aston Villa over a move for Jhon Duran ahead of the January transfer window, despite the striker only recently signing a new deal.\nThe Colombian forward had a stunning end to last season when he bagged a brace in Villa’s final home game of the campaign against Liverpool and has carried that form into this term, although most of his damage has come from the bench.\nThe 20-year-old has scored six goals in 11 appearances in all competitions so far, although his only start was against Wycombe in the Carabao Cup – a game in which he scored what turned out to be the winner.\nHe then hit a Goal of the Season contender in a famous Champions League win over Bayern Munich. But, despite his heroics, Duran continues to sit behind Ollie Watkins in the pecking order at Villa Park.\nEven though starts have been elusive, that did not stop Duran signing a new Villa contract until 2030 recently amid strong interest from the likes of Chelsea, West Ham and LaLiga giants Barcelona.\nBut now a fresh report from AS Colombia states that Arsenal and Barca have enquired about the possibility of signing the striker in the January transfer window.\nThe report adds, however, that interest from both clubs has been met with an unequivocal response from Villa, who insist Duran will not be leaving for anything less than €90million (£75m, $81m) – the sort of figure TEAMtalk previously told you about.\nREAD MORE ➡️ Premier League Signings of the Season Power Ranking: Arsenal star 6th, Tottenham striker 7th…\nMonchi reveals incredible Duran interest\nVilla sporting director Monchi recently suggested as many as 40 clubs wanted to sign Duran over the summer but that a suitable offer was never forthcoming.\n“We have two very strong strikers, him and Watkins,” Monchi told Sky Italia.\n“Duran wanted to play more minutes, and we needed to sell a player due to FFP, but without an important offer we were convinced he would stay here.\n“Emery has a lot of faith in him: some offers have arrived, there were meetings, but the amount we asked for did not arrive.”\nIn terms of Arsenal’s interest in the Colombia international, he joins a list that also includes Alexander Isak, Benjamin Sesko, Dusan Vlahovic, Victor Osimhen and Viktor Gyokeres as the Gunners look to sign a top quality No.9.\nAt this stage, Mikel Arteta continues to play Kai Havertz in the central striking role ahead of Gabriel Jesus, who has struggled to become the regular goalscorer Arsenal wanted him to be after his capture from Manchester City.\nIndeed, there is a feeling that if the Gunners can secure the addition of a lethal marksman in January then it could be the difference between winning the Premier League title or not.\nLatest Arsenal news: Gunners join Mbeumo chase / Sterling deal looking unlikely\nLiverpool could miss out on the signing of Brentford star Bryan Mbeumo as both Arsenal and Aston Villa have entered the frame for him, as per reports.\nAccording to Football Insider, Arsenal are ‘plotting a move’ for Mbeumo amid his incredible start to the campaign.\nArsenal are reportedly unlikely to sign Raheem Sterling permanently from Chelsea at the end of the season, with the Blues’ valuation of the winger now revealed.\nAccording to Football Transfers, Chelsea are willing to sell Sterling for £25m at the end of the season, significantly less than the £50m they paid to bring him in two years ago.\nIt’s claimed that Arsenal are ‘weighing up the possibility’ of signing Sterling permanently but value him at £15m, so that could make negotiations ‘tough.’",
  "word_count": 623,
  "scraped_at": "2026-02-14T01:51:57.641798",
  "_text_extracted": true
}