{
  "article_id": "2f0a94a8c4c2",
  "url": "https://metro.co.uk/2025/02/19/man-utd-cult-hero-names-toughest-premier-league-opponent-drove-insane-22585272/",
  "title": "Man Utd cult hero names toughest Premier League opponent who  drove him insane  ",
  "date": "20250219T101500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United defender Phil Jones remembers ex-Liverpool forward Luis Suarez driving him insane during their Premier League battles.\nJones was playing regularly for the Red Devils while the Uruguayan was at his devastating best for the Reds from 2011-14.\nSuarez scored 23 Premier League goals in the 2012-13 season and then 31 the following campaign before leaving Anfield for Barcelona.\nThe England international admits that the controversial forward was a nightmare to deal with in almost every way.\nRecalling his toughest opponent in the top flight, Jones told the No Tippy Tappy Football podcast: ‘In the Premier League I always found it really tough playing against Suarez,\n‘He had this knack of, and I’m probably doing him a disrespect, of like playing a one-two off your shins and somehow wriggling out with the ball. Oh, it would drive me insane!\n‘But he was clever with his movement, he wasn’t absolutely lightning-quick but the short, sharp burst he used to have was really good and it was a struggle playing against Suarez.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nJones would not escape Suarez even when he left the Premier League as Manchester United took on Barcelona in the quarter-finals of the Champions League in 2019.\nThe pair were in the opposing starting XIs at the Camp Nou as Barca strolled to a 3-0 win and into the semi-finals.\nWhile Suarez gets the nod from Jones in terms of his toughest Premier League foe, it is another Barcelona superstar who proved to be his most difficult opponent in any competition.\nJones is certainly not alone in remembering Lionel Messi as the best opponent he faced in his career, feeling bamboozled by the Argentine legend.\n‘Best player I’ve ever played against was Lionel Messi, he was an absolute joke in that game,’ said Jones of the 2019 3-0 loss in which Messi scored twice.\n‘I’ve gone to nail him in the middle of the pitch, he’s turned me stuck it through my legs I’ve turned around and stuck it back through my legs!’\nJones is still just 32 years old but retired from playing in August 2024 after a terrible time with injury in his latter seasons with Manchester United.\nMore Trending\nHe is still working with the club, coaching the age-range sides in the academy as his long connection with the Red Devils continues, having originally signed from Blackburn in 2011.\nSpeaking about the talent coming through the ranks at Manchester United, he said: ‘I think what I would say is working in and around the academy for the last two years, helping and watching those young players develop, United have some really good and talented young players coming through.\n‘The squad had a lot of injuries against Tottenham and the bench was full of kids, but there were some talented players on that bench. People might not know a lot about them now but they certainly will in the next few years.’\nMORE: Arsenal star Takehiro Tomiyasu breaks silence on his injury nightmare\nMORE: Newcastle set new price for Arsenal and Chelsea to sign Alexander Isak\nMORE: Real Madrid and Chelsea legend Thibaut Courtois reveals who blocked dream move to Manchester United",
  "word_count": 580,
  "scraped_at": "2026-02-14T02:02:19.832117",
  "_text_extracted": true
}