{
  "article_id": "2f1841daeacb",
  "url": "https://english.aawsat.com/sports/5016781-european-football-driving-force-newcastle-says-howe",
  "title": "European Football a  Driving Force  for Newcastle , says Howe",
  "date": "20240514T140000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Howe's men are sixth in the table, two places and three points better off than their hosts with two games to go for each team.\nChelsea are in seventh place on 57 points -- the same as Newcastle.\nAs it stands, the team in sixth place at the end of the season will earn a spot in the UEFA Conference League, the third-tier European competition.\nBut if Manchester City beat Manchester United in the FA Cup final, the sixth-placed team would qualify for the Europa League and the side in seventh would enter the Conference League.\n\"Massive fixture for both teams,\" Howe said at his pre-match press conference on Tuesday, AFP reported.\n\"It's coming to the end of a long season for both clubs. We're desperate to do well in the game, we're desperate to finish as high as we can.\n\"We know European competition is there but it can also be a long way away if we don't get the results we need.\"\nThe Newcastle boss said his team were embracing the pressure after recovering from a poor start to the season and a damaging run of losses in December and January.\nHowe, whose team flopped in this season's Champions League, said it was vital for Saudi-backed Newcastle to be in Europe.\n\"We need to be there as a football club,\" he said. \"That's a driving force for us. We'll embrace the extra games, the travel, the experience, everything about the competition. We feel we're in a position to do it.\"\nHowe said he was anxious not to underestimate misfiring United despite their poor form as Newcastle seek their first league double against the 20-time English champions since the 1930/31 season.\n\"We can't underestimate the challenge in front of us,\" he added. \"That would be foolish. That would counteract everything that we need to be in this game.\n\"I think we don't underestimate Manchester United's qualities, we don't underestimate the magnitude of the game.\n\"We are preparing for a really tough match. We know it will be and we expect a good atmosphere.\"\nForwards Alexander Isak and Callum Wilson are doubts for the match at Old Trafford after suffering from illness and neither trained on Monday.\nHowe said it was \"fingers crossed\" Isak would train on Tuesday.\nOn Wilson, he added: \"We'll see. We haven't seen Callum yet, so we'll see if he's available to train today. If not, then I'm sure he'll be fit for Brentford.\"\nNewcastle have confirmed they will travel to Japan for a pre-season tour to face Urawa Red Diamonds on July 31 and Yokohama F. Marinos at the Japan National Stadium three days later.",
  "word_count": 440,
  "scraped_at": "2026-02-14T02:25:33.992646",
  "_text_extracted": true
}