{
  "article_id": "2f37ade31bcd",
  "url": "https://www.qatar-tribune.com/article/160414/latest-news/qatar-airways-extends-partnership-with-paris-saint-germain-until-2028",
  "title": "Qatar Airways extends partnership with Paris Saint - Germain until 2028",
  "date": "20250127T180000Z",
  "domain": "qatar-tribune.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "DOHA: Qatar Airways, the world’s best airline as voted by Skytrax in 2024, announced the extension of its partnership with Paris Saint-Germain (PSG) until 2028, reaffirming its commitment to one of the most iconic football clubs in the world, ushering in a new era of collaboration. This renewal strengthens the long-standing relationship between Qatar Airways and PSG, built on shared values of excellence, ambition, and innovation.\nThe announcement was made a few days following the Parisian’s victory over Manchester City FC at the Parc des Princes Stadium in the UEFA Champions League – Europe’s premier football tournament where Qatar Airways also holds a strong presence as ‘Official Airline Partner’. Further cementing their alliance, the partnership will extend across the Qatar Airways Group, involving Qatar Duty Free and Hamad International Airport to create a comprehensive and engaging partnership ecosystem. The Qatar Airways logo will continue to feature on the “rouge & bleu” shirt, as well as all training apparel and warm-up jerseys at all domestic and international tournaments, including Ligue 1, and UEFA Competitions.\nQatar Airways Group Chief Executive Officer, Eng Badr Mohammed Al Meer said: “We are thrilled to extend our partnership with Paris Saint-Germain, a club that embodies the spirit of excellence and innovation. This collaboration is a testament to our shared vision of connecting and inspiring people around the world. Together, we will continue to redefine the boundaries of what is possible, both on the pitch and in the skies.”\nPresident of Paris Saint-Germain Nasser Al Khelaïfi said: “We are proud to extend our partnership with Qatar Airways, the world’s leading airline, through 2028. This collaboration, founded on excellence, creativity, and innovation, was exemplified by the groundbreaking in-flight press conference aboard a Qatar Airways flight to kick off 2025. Together, we will continue to set new benchmarks and create history in the years ahead.\"\nParis Saint-Germain is playing an important role in Qatar Airways’ extensive sponsorship portfolio and is connecting and engaging its brand with the club’s hundreds of millions of fans world-wide, whilst providing unique experiences to reward its Privilege Club members – which is the Official Frequent Flyer Programme of Paris Saint-Germain. Additionally, Qatar Airways Holidays will continue to offer official Paris Saint-Germain fan travel packages, bringing football enthusiasts from around the world to Paris, to enjoy the city and see some of the best players in football.\nAs an industry leader in advanced technology, Qatar Airways offers passengers complimentary gate-to-gate Wi-Fi, ensuring seamless connectivity throughout their journey. This unique partnership with Starlink also enables Paris Saint-Germain teams to stay connected throughout their travels with its global fanbase in real-time. This technology was in use on January 2 when the team hosted a first ever virtual press conference onboard their Qatar Airways flight 35,000 feet up in the skies, prior to securing the French Cup against Monaco – a special cup final that was staged in Doha.\nThe renewed partnership underscores a shared commitment to elevating fan engagement and delivering exceptional brand experiences. It introduces a range of exciting initiatives designed to bring fans and Privilege Club members closer to the action. These include innovative collaborations that seamlessly blend Paris Saint-Germain’s elegance with Qatar Airways’ world-class hospitality, exclusive offerings within the Club’s ecosystem, and unique lifestyle experiences that celebrate the synergy between the two iconic brands.\nThe extended partnership will continue to focus on creating global campaigns, and opportunities to engage with PSG supporters worldwide. With Qatar Airways’ award-winning service and PSG’s growing influence on the world stage, this collaboration will reach new heights in the coming years.\nThis partnership marks another milestone in Qatar Airways’ portfolio of high-profile global sports partnerships, including the likes of FIFA, Formula 1, UEFA, MotoGP, AFC, FC Internazionale Milano, Tennis Legend – Novak Djokovic, The Royal Challengers Bangalore (RCB), Qatar Airways Premier Padel Tour, the IRONMAN Triathlon Series, the United Rugby Championship (URC) and European Professional Club Rugby (EPCR), French Rugby Team – Section Paloise, The British and Irish Lions Tour of Australia 2025, The Brooklyn Nets NBA Team, and multiple other disciplines including Australian football, equestrian, kitesurfing, motor racing, squash, and tennis.",
  "word_count": 683,
  "scraped_at": "2026-02-14T02:11:27.599646",
  "_text_extracted": true
}