{
  "article_id": "2f5e4498e7b9",
  "url": "https://www.caughtoffside.com/2024/07/24/newcastle-ac-milan-malick-thiaw/",
  "title": "£25m bid being prepared by Newcastle for AC Milan talent Malick Thiaw",
  "date": "20240724T194500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle are ready to make a bid for AC Milan defender Malick Thiaw as the Magpies look to strengthen their defence further ahead of the 2024/25 campaign.\nThe Magpies have been heavily linked with a move for the German star throughout the current transfer window but will find it difficult to complete a deal as the 22-year-old is a player the Serie A giants will not want to give up easily.\nThiaw experienced an injury-hit campaign last time around but still managed to feature in 30 matches for the Italian club.\nThe centre-back has been with Milan since 2022 having joined from Schalke 04 and is contracted at the San Siro until 2027. Newcastle scouts have watched the player a lot in recent years and it is said that they have been impressed by Thiaw’s performances in the Champions League.\nAccording to Gazzetta dello Sport via TBR Football, the Magpies are believed to be weighing up whether to make a £25m bid for the German talent or not as Howe wants another centre-back at St James’ Park.\nThat offer is expected to be dismissed as AC Milan want around £33m to part ways with the defender.\nNewcastle ready to add more players to their squad\nSo far this summer, Eddie Howe has made three additions to his squad, having signed Lloyd Kelly, John Ruddy and Odysseas Vlachodimos.\nKelly is the only one out of the names that will play regularly and therefore, Newcastle need to start adding players to their squad. The Tyneside club could potentially have a great season as they don’t have European football to worry about and there are a lot of changes happening at England’s top clubs which they can capitalise on.\nThe Magpies require another defender, a midfielder and a top winger for the right-hand side. This would help Howe massively and it will then be up to the English coach to work his magic.",
  "word_count": 320,
  "scraped_at": "2026-02-14T02:01:23.789417",
  "_text_extracted": true
}