{
  "article_id": "2f87d0e0a7fb",
  "url": "https://metro.co.uk/2026/01/29/gary-neville-issues-eberechi-eze-warning-arsenal-fans-26593383/",
  "title": "Gary Neville issues Eberechi Eze warning to Arsenal fans",
  "date": "20260130T010000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Neville believes Eberechi Eze will not be allowed to be given a free role in Arsenal’s side under Mikel Arteta.\nEze joined the Gunners in a £67.5 million deal from Crystal Palace in the summer transfer window but the 27-year-old has been unable to secure a regular starting role in midfield.\nThe England international was handed a start in the final game of Arsenal’s Champions League league phase on Wednesday night as he delivered an impressive performance in the 3-2 win against Kairat Almaty.\nBut during the latest episode of Stick To Football, Neville and Ian Wright raised doubt over whether Eze can fit in Arteta’s system at Arsenal.\n‘We’re talking about someone like Eze, now Eze is coming in now and we’re saying, ‘Eze do your thing what you did at Palace’, Eze needs to be played and just free to play,’ Wright said.\nNeville replied: ‘I don’t think he’s going to get that.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWright then said: ‘Listening to what the management is saying about enjoyment and players expressing themselves.’\nNeville added: ‘He [Arteta] comes from that Pep [Guardiola] school of methodology over what would be being the maverick.\n‘When I look at Pep’s teams and what he did with [Jack] Grealish and when I see what Mikel does, you’ve got to admire how they put that system into the players, but they do want the methodology and the process of how you play to be followed over the individual.’\nWright said: ‘You say what’s got to change, to a certain extent.’\nMore Trending\nNeville then asked: ‘Can he change that?’\nWright replied: ‘Well at some stage… if you’ve got someone like Eze who plays with freedom. The goal that [Matheus] Cunha scored and even the goal from [Patrick] Dorgu, two great goals, they’re in positions where you’d like to see someone like Eze because he can do that.\n‘He’s got to have the freedom to play and wander into these areas. At the moment it does feel a bit rigid for him.\n‘If you’re going to leave [Martin] Odegaard out and bring this Eze in who is not free, doesn’t feel free… he’s [Arteta] said about enjoyment and letting them go.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Paul Scholes accuses Martin Odegaard of ‘killing’ Arsenal teammate\nMORE: David Beckham Premier League record under threat as manager urges new signing to break it\nMORE: Ian Wright names Arsenal’s best front four as he insists ‘something has to change’",
  "word_count": 480,
  "scraped_at": "2026-02-14T01:59:36.853330",
  "_text_extracted": true
}