{
  "article_id": "2fdb736728ed",
  "url": "https://www.geosuper.tv/latest/35000-arsenal-eye-unhappy-bayern-munich-star-as-top-summer-target",
  "title": "Arsenal eye  unhappy  Bayern Munich star as top summer target - Football Leagues",
  "date": "20240403T194500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nApril 03, 2024\nArsenal have set eyes on “unhappy” Bayern Munich star Joshua Kimmich as their top target for the summer transfer window as the Gunners are in dire need of finding a pivot partner for Declan Rice, reported Football Transfers on Wednesday.\nArsenal and Bayern will lock horns in the UEFA Champions League quarter-finals this month. While the Bavarians have a better record in head-to-head against the Gunners, the current form of both teams is completely opposite as Mikel Arteta’s men sit on top of the Premier League, Thomas Tuchel’s side is near to losing the Bundesliga for the first time since 2012.\nPlayers like Lukas Podolski, Serge Gnabry and others have played for both clubs in the past and the Gunners are determined to add Kimmich to the list.\nAs per the report, Arsenal contacted Bayern to ask about the signing of Kimmich but the Bavarians refused to have any talks about the German midfielder at least until the end of the season.\nKimmich is in relatively good form as the German has two assists in his last three matches. He also played a full 90 minutes in the recent encounter against Borussia Dortmund which Bayern lost 2-0.\nEarlier, multiple news outlets from Germany reported that Kimmich fell out of favour with head coach Thomas Tuchel due to undisclosed reasons.\nHowever, things didn’t escalate greatly as Tuchel will step down as the manager once the current season ends while Kimmich is expected to continue with the club as he is not just an important player for the team, he is also a versatile player who can play in multiple positions.\nRemember, The Gunners are aiming for their first league title since 2004 when they were crowned the champions without losing a single match all season under the guidance of Arsene Wenger.\nWhether or not Arsenal win the league or any title this season, their interest in Kimmich will remain as Arteta is determined to field the German next to Rice.",
  "word_count": 335,
  "scraped_at": "2026-02-14T01:48:46.202731",
  "_text_extracted": true
}