{
  "article_id": "305d51bc4252",
  "url": "https://theprideoflondon.com/2023/04/29/chelsea-malo-gusto-pochettino/",
  "title": "Chelsea : Malo Gusto is the perfect depth piece for Mauricio Pochettino",
  "date": "20230429T131500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As the deal between Chelsea and Mauricio Pochettino nears its completion, 19-year-old Malo Gusto is a player that could reap the benefits.\nAs the disappointing 2022/2023 campaign comes to a close, Chelsea Football Club have its eyes on rebuilding around potential new manager Mauricio Pochettino. Since his time at the Blues’ north London rivals, Pochettino has been well documented as someone who takes youth talent to the next level.\n19-year-old Dele Alli emerged as one of the standout midfielders in the Premier League after he was bought straight from League One outfit MK Dons while Harry Kane’s legend began in his first season under the Argentine manager. His track record of successfully evolving young players is arguably one of the key reasons the west Londoners were attracted to him in the first place. For the scholars a Cobham, and the abundance of youth on the senior team, this may be the exact manager they need to progress in professional football.\nJust like Alli, Chelsea will have another intriguing U21 player in the squad next season coming from another club. Malo Gusto, a U21 French international is exact young right back the Blues could use with Reece James being as susceptible to injuries as he is. It may not be next season, but Gusto is an enticing athletic right back that has the potential to grow into something special under Pochettino.\nThe former Paris-Saint Germain man is known for experimenting with wing backs, specifically at Tottenham Hotspur. Whether it is Kieran Trippier, Kyle Walker, or current Southampton winger Kyle Walker-Peters, the former Spurs manager knows what it is like to develop a young wide player.\nPochettino gets to work with Gusto from the ground up, unlike Trippier and Walker who worked under him past the age of 20. Based on this kind of history, Chelsea could have snatched the biggest steal of the January transfer window during several weeks when the attention was more on players like Enzo Fernandez, and Mykhailo Mudryk. It may have been seen as an extremely insignificant signing then, but a few years down the line, Gusto could be running down the flank in the Champions League semifinals.\nGusto’s attacking mindset, and natural athleticism at such a young age could make him the perfect candidate grow under Pochettino’s wing. For someone to be able to make their senior debut at the age of 17 tells a lot about the kind of talent that he is. He will be challenged each day by James during training which is only going to take is game to the next level even faster.\nSince coming onto the scene for the seven-time Ligue 1 winners, Gusto has played in 48 league matches, starting in 38 of them. Even at such a young age, Gusto is far from one-dimensional. There are few standout weaknesses to his game.\nHe is the exact player the West London outfit need as the game continues to evolve. His skillset allows him to adapt on the fly, and once he gets used to the senior game in England, the French senior national team will start knocking on the door. At just 18, Gusto was fourth on his club team in progressive carries and second in tackles plus interceptions during the 2021/22 campaign.\nThere is no telling what Pochettino could get out of a player like Gusto if he takes the helm as the manager of the future. Gusto will be with the Blues until 2027, providing him with the time to evolve into a special asset under an ownership group with large aspirations. Players like Noni Madueke, and Mudryk could also benefit from the introduction of Pochettino, but it is his history with young wing backs that makes Gusto’s arrival so tantalizing.\nWill Malo Gusto excel under Pochettino?",
  "word_count": 630,
  "scraped_at": "2026-02-14T01:55:54.924150",
  "_text_extracted": true
}