{
  "article_id": "305fbf1bf1ee",
  "url": "https://www.managingmadrid.com/2025/2/21/24369678/f-k-it-i-am-kylian-mbappe",
  "title": "  F ** k it , I am Kylian Mbappé  ",
  "date": "20250221T083000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A few months before he embarrassed Josko Gvardiol with a brilliant fake shot that essentially decided a huge Champions League tie against Manchester City, Kylian Mbappé had hit rock bottom. The world watched with shock and pain behind their outstretched eyes. Real Madrid’s Kylian Mbappé missed a crucial penalty against Athletic Club — right after the one he missed against Liverpool — and the player who Real Madrid fans thought of as the next superstar, as the answer, suddenly became a question mark.\n“F**k it, I am Kylian Mbappé”\nMbappé reminds the world what he’s about.\n“I took a lot of positives from the Bilbao game. I hit rock bottom,” Mbappe said in December. “I realised at that moment I have to give my all for this shirt and play with personality.”\nAnd that is exactly what he did.\nMbappé put a statement on his Instagram story after that match, taking full responsibility for the matter, but also suggesting it is time to step up. “It’s the best time to change this situation and show who I am,” said the deflated but seemingly positive Frenchman.\nEver since that story, he has scored 17 goals and has three assists in 18 games. But the match against Manchester City was the absolute pinnacle. It was what Real Madrid fans were waiting for, and it was what they thoroughly deserved.\nWhen Real Madrid fans watched Mbappé alight the Santiago Bernabeú on Wednesday night, there were no question marks, just mouths left open in awe. Fans have noted several moments over the season as the point when Mbappé truly ‘arrived’ at Real Madrid. All of that does not matter. This was it right here, It was the game where Mbappé realised just how good he is. This was his “you know what, I’m him” moment.\n“It is time I start deciding games,” he said after the hat-trick that sent Real Madrid to the round of 16, where they will face either Bayer Leverkusen or Atletico Madrid. He performed admirably. A brilliant hat-trick pieced together across 57 minutes of football was exactly what Real Madrid needed from him, and it was also what Mbappé needed from himself.\nHe looked like himself and was playing really well even before this game. The difference is, that was a version of Mbappé who just wanted to play football, have fun and score goals. This, right here, was a psychopath.\nThis Mbappé was the one Real Madrid got tired of playing against after just two games in 2022, when he ridiculed one of the most talented backlines in the world — a backline he would soon join forces with — while terrifying the biggest fanbase in world football. This was the Mbappé Real Madrid fans wanted after watching him close to a second consecutive World Cup winners medal, scoring a hat-trick to take the final to penalties. This was the Mbappé that reigned terror among the hearts of Real Madrid’s biggest rivals when he scored a hat-trick against them in Lionel Messi’s last Champions League tie for Barcelona.\nIt was what Real Madrid fans craved for, and what rival fans were petrified of. People are too quick to judge, especially given the stature of both the player and the club. A lot of people thought Mbappé was ‘washed’ or ‘not good enough for Real Madrid’ when those bad performances started piling up. Not to mention those who believed Vinicius Jr and Mbappé would not work together. At the end of the day, he is not a nobody.\nHe is someone who has shown throughout his storied career that he is not a timid player. He is not afraid of the occasion, and he oozes confidence. That is what he did on Wednesday night, and it rubbed off on his teammates.\nEvery single player had an exceptional game. I could go on about this match, and I’m sure others on the site already have, but this win would not be possible without heroics from Raul Asencio, Fede Valverde, Aurelien Tchouameni, Dani Ceballos, Rodrygo, all had exceptional games. Every single person on the team understood the assignment, and Carlo Ancelotti was able to outcoach his counterpart in a big game for the first time all season.\nPeople make the argument that it was against the worst Manchester City in a very long time. Real Madrid are also a wounded giant this season, and the season-defining occasion made this the most important match of the year for both teams, and that is exactly when Mbappé decided to put his foot down. It is tough to imagine many players better than him when he is in this flow state. When absolutely no one can stop what he wants to do. Mbappé played the game his way, and the whole world stood in awe, while Josko Gvardiol crumbled in split seconds, watching the psychopath look him dead in the eyes and showing the world exactly what he did to him.",
  "word_count": 826,
  "scraped_at": "2026-02-14T02:18:11.275275",
  "_text_extracted": true
}