{
  "article_id": "3098477a4cb7",
  "url": "https://www.fourfourtwo.com/features/the-best-premier-league-players-of-the-00s",
  "title": "The best Premier League players of the 00s",
  "date": "20240227T170000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best Premier League players of the 00s\nRanking the Prem's standout performers from the first decade of the 21st century\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nBorn in the 90s, the Premier League kept going from strength to strength at an increasingly rapid pace during the 00s, firmly establishing itself as the greatest league on the planet.\nAnd some of the game's finest individuals took to the pitch in the English top flight throughout the first decade of the new millennium.\nHere, FourFourTwo counts down the best Premier League players of the 00s!\n33. Kevin Phillips\nA Premier League rarity in that he won the Golden Boot with a club outside the division’s established big boys (he racked up 30 goals for Sunderland in 1999/2000), Kevin Phillips was playing the best football of his career around the turn of the century.\nThe striker’s clinical form earned him a handful of England caps – and a place in the Three Lions’ Euro 2000 squad.\n32. Ashley Young\nPromoted to the Premier League with boyhood club Watford in 2006, Ashley Young made an instant impression at the highest level and joined Aston Villa halfway through his first top-flight campaign.\nWith Villa, the versatile left-back went from strength to strength, making successive PFA Teams of the Year in 2007/08 and 2008/09 – and winning PFA Young Player of the Year in the latter season.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n31. Brad Friedel\nPerhaps the USA’s most successful footballing export, legendary goalkeeper Brad Friedel amassed more than 500 Premier League appearances, lining up between the sticks for Liverpool, Blackburn Rovers, Aston Villa and Tottenham.\nThe 2002/03 and 2003/04 seasons were particularly memorable for Friedel at Blackburn: in the former, he kept a league-high 15 clean sheets; then, in the latter, he scored against Charlton Athletic.\n30. Dimitar Berbatov\nAn instant hit at Tottenham after arriving from Bayer Leverkusen in the summer of 2006, Dimitar Berbatov bagged 27 Premier League goals in two seasons for Spurs.\nThat earned the laid-back Bulgarian – who made the 2006/07 PFA Team of the Year – a £30.75m move to Manchester United at the start of the 2008/09 season.\n29. William Gallas\nA back-to-back Premier League champion with Jose Mourinho’s Chelsea in 2004/05 and 2005/06, William Gallas was named in the 2002/03 and 2005/06 PFA Teams of the Year.\nThe adaptable French defender crossed London to join Arsenal in 2006, later captaining the Gunners (only to lose the armband after criticising his teammates in an interview – oops).\n28. Arjen Robben\nArjen Robben’s Premier League stay was short but pretty productive: three seasons with Chelsea; 67 appearances; 15 goals; 16 assists.\nOne of the world’s best wingers at the time, the devastating Dutchman terrorised many a left-back en route to helping the Blues to their first two Premier League titles – making the PFA Team of the Year in his first campaign.\n27. Gilberto Silva\nDescribed by Arsene Wenger as the most underrated player he ever coached, Gilberto Silva’s robust defensive midfield qualities were utterly instrumental to Arsenal’s 2003/04 ‘Invincibles’ Premier League title triumph – when they famously went the whole campaign unbeaten.\nSigned from Atletico Mineiro in 2002, the Brazilian – know as ‘the invisible wall’ back home – made 170 Premier League appearances during a six-year spell with the Gunners, scoring 17 goals.\n26. Shay Given\nAmong with the best goalkeepers ever to grace the Premier League, Republic of Ireland legend Shay Given chalked up over 450 appearances in the competition – the vast majority of them for Newcastle.\nNamed in the 2001/02 and 2005/06 PFA Teams of the Year, Given – who made his top-flight debut at Blackburn Rovers – later had stints with Manchester City, Aston Villa and Stoke City.\n25. Nicolas Anelka\nHaving arrived with a bang at Arsenal in the late 90s, Nicolas Anelka returned to England in 2001, joining Liverpool on loan – before squeezing in three more Premier League clubs during the 00s.\nAfter free-scoring spells with Manchester City and Bolton Wanderers, the clinical Frenchman joined Chelsea in January 2008 – and won the Golden Boot the following season.\n24. Patrice Evra\nUp there with the very best left-backs around during his prime, Patrice Evra won three straight Premier League titles with Manchester United between 2007 and 2009.\nIncluded in the 2006/07 and 2008/09 PFA Teams of the Year – despite making only 24 appearances in the former campaign – the France international occasionally served as skipper for the Red Devils.\n23. Cesc Fabregas\nSigned by Arsenal from Barcelona as a 16-year-old, Cesc Fabregas soon emerged as one of the most promising attacking midfielders in world football – and then established himself among the outright best.\nA remarkably gifted playmaker, the Euros and World Cup-winning Spaniard was voted 2007/08 PFA Young Player of the Year.\n22. Fernando Torres\nWhen Liverpool acquired Fernando Torres for a then club-record £20m in 2008, expectations were understandably high – and the extraordinarily gifted Spanish frontman duly delivered, banging in 24 Premier League goals in his first season with the Reds.\nDespite being hampered by injury, ‘El Nino’ – a two-time PFA Team of the Year inclusion – still registered 41 times in 69 outings over the next two-and-a-half campaigns, before departing for Chelsea.\n21. Claude Makelele\nYou have to be a pretty special player to have a role named after you – and Claude Makelele was just that, introducing English football to a new kind of defensive midfielder.\nSigned from Real Madrid in the summer of 2003, the indefatigable Frenchman was absolutely crucial to Chelsea’s 2004/05 and 2005/06 Premier League title triumphs under Jose Mourinho.\n20. Robert Pires\nAn all-time Arsenal great, two-time title winner Robert Pires lit up the Premier League with his supremely classy playmaking qualities, featuring 189 times for the Gunners from 2000 to 2006.\nDuring that period, the seriously suave Frenchman made 103 goal contributions (62 goals and 41 assists), scooping 2001/02 FWA (Football Writers’ Association) Footballer of the Year and making three successive PFA Teams of the Year.\n19. Roy Keane\n(In)famously one of the Premier League’s hardest ever players, Manchester United icon Roy Keane continued to boss the midfield during the first half of the 00s.\nIncluded in the 1999/2000, 2000/01 and 2001/02 PFA Teams of the Year – and voted 2000 PFA Players’ Player of the Year – the fearsome Irishman captained United to the 1999/2000, 2001/02 and 2002/03 Premier League titles.\n18. Alan Shearer\nThe ultimate Premier League goalscorer, Alan Shearer was still banging them in for Newcastle well into the 00s – and producing some moments of pure brilliance, such as his thumping volley against Everton in 2002.\nShearer enjoyed 20+ goal campaigns in 1999/2000, 2001/02 and 2003/04, retiring in 2006 having amassed a Prem-record 260 goals.\n17. Paul Scholes\nAnother Manchester United midfield great, Paul Scholes’ enduring class helped his only club to six Premier League crowns between 2000 and 2009.\nNamed in the 2002/03 and 2006/07 PFA Teams of the Year, Scholes enjoyed arguably the best campaign of his career in the former season – when he found the net 14 times in the league.\n16. Sol Campbell\nSol Campbell began the 21st century as a Tottenham player – a Tottenham, legend in fact; then, in 2001, he made one of the most controversial moves in Premier League history by crossing the North London divide to Arsenal.\nAmid the furore his transfer triggered, though, Campbell continued to assert himself as one of the league’s standout centre-backs, forming rock-solid partnerships with the likes of Tony Adams, Martin Keown and Kolo Toure – and winning two Premier League titles in the space of three years.\n15. Edwin van der Sar\nEdwin van der Sar spent the first 11 years of his career with Ajax – winning the 1994/95 Champions League – and Juventus, so it was quite a coup for Fulham to secure the gigantic Dutchman’s services in 2001.\nIn England, Van der Sar continued to assert himself as one of the world’s finest goalkeepers – and in 2005, he joined Manchester United, winning his first three of four Premier League titles between 2007 and 2009.\n14. Patrick Vieira\nAn absolutely formidable midfield presence – for his world-class abilities both on and off the ball – Patrick Vieira was at the heart of everything good Arsenal did in the early 00s.\nA Premier League champion for the second time in 2001/02, then captain of the Gunners’ 2003/04 ‘Invincibles’, the World Cup and Euros-winning Frenchman was voted 2000/01 Premier League Player of the Season.\n13. Ryan Giggs\nRyan Giggs’ haul of 13 Premier League winner’s medals is unlikely ever to be surpassed – and Manchester United’s legendary one-club man picked up six of them between 2000 and 2009.\nDuring the 00s, the Welsh wing wizard extended his record of scoring in every league campaign of his career to 19 seasons, making it into four PFA Teams of the Year and scooping 2008/09 PFA Players’ Player of the Year.\n12. Ashley Cole\nProbably England’s greatest full-back of all time, Ashley Cole enjoyed immense success with Arsenal and Chelsea, winning the 2001/02 and 2003/04 Premier League titles with the former.\nAn elite operator on the left, Cole was included in the 2002/03, 2003/04 and 2004/05 PFA Teams of the Year. He left the Gunners for the Blues in 2006.\n11. Didier Drogba\nThe first African player to score 100 Premier League goals, Didier Drogba joined Chelsea from Marseille for £24m in the summer of 2004 – and the iconic Ivorian frontman proved to be worth every penny.\nA proper defender’s nightmare, Drogba notched more than 60 league goals in his first five-and-a-half years at Stamford Bridge, winning two titles (in his first two seasons) and the 2006/07 Golden Boot.\n10. Ruud van Nistelrooy\nRuud van Nistelrooy smashed in 95 goals in 150 Premier League games for Manchester United – and only one of them was from outside the box. The Dutch striker was the definition of lethal inside the penalty area.\nPremier League Player of the Season and Golden Boot winner with 25 goals in 2002/03 – when he won his only title – Van Nistelrooy was also a great penalty taker, scoring 18 out of 22 in the Prem.\n9. Petr Cech\nArguably the greatest goalkeeper in Premier League history, Petr Cech wore the gloves as Chelsea conceded a miserly 15 goals all season en route to the title in 2004/05.\nVoted Best European Goalkeeper in 2005, 2007 and 2008, the towering Czech Republic international made 333 league appearances for the Blues in all, reaching 100 Prem clean sheets in just 180 outings.\n8. John Terry\nCaptain of Chelsea’s first two Premier League-winning sides, in 2004/05 and 2005/06, John Terry is regarded as one of the finest players in the Blues’ history – and one of the standout centre-backs of his generation.\nConsistently rock-like at the back, Terry – who, thanks to his huge set-piece threat, is the Premier League’s top-scoring defender – was voted 2004/05 PFA Players’ Player of the Year as Chelsea let in just 15 league goals all season.\n7. Rio Ferdinand\nEminently continental in his adeptness on the ball, Rio Ferdinand was not the typical English centre-half of his time – and that marked him out as one of the very best around.\nSigned by Manchester United from Leeds for a British-record fee of around £30m in 2002 (which also made him the world’s most expensive defender for a second time), Ferdinand’s defensive class underpinned four Premier League title victories over the next seven years.\n6. Nemanja Vidic\nKnown as one of the toughest defenders around during his prime, Nemanja Vidic marked himself out as an all-time centre-back great during a glittering spell with Man United.\nNamed 2008/09 Premier League Player of the Year – when he won his third of five titles – the no-nonsense Serbian superstar made it into three straight PFA Teams of the Year at the end of the 00s.\n5. Frank Lampard\nGenerally considered to be Chelsea’s best ever player, Frank Lampard is also just about the finest goalscoring midfielder the Premier League has ever seen.\nThe Blues’ record goalscorer, Lampard hit double figures in the last six league campaigns of the 00s, with his brace against Bolton Wanderers in April 2005 clinching Chelsea’s maiden Premier League title.\nHe did the PFA Players’ Player of the Year and FWA Footballer of the Year double that season.\n4. Steven Gerrard\nLiverpool’s greatest player of the modern era – and one of their greatest of all time – captain fantastic Steven Gerrard pulled his boyhood club out of the mire time and time again, producing inspired performance after inspired performance and popping up with more than a few crucial goals.\nA world-class box-to-box midfielder with a thunderous shot at his disposal, Gerrard – who won 2000/01 PFA Young Player of the Year and 2005/06 PFA Players’ Player of the Year – will go down as one of the best players never to win the Premier League.\n3. Wayne Rooney\nAs soon as Wayne Rooney burst onto the scene as a 16-year-old with this screamer for Everton against Arsenal in 2002, it was pretty obvious that he was going to be one hell of a player.\nBy the mid-00s, the future England captain was turning it on for Manchester United – where he won back-to-back PFA Young Player of the Year awards in 2004/05 and 2005/06, and three straight Premier League titles between 2006/07 and 2008/09.\n2. Cristiano Ronaldo\nRooney’s even more prodigious Man United teammate, Cristiano Ronaldo joined Manchester United in 2003 and was a Ballon d’Or winner five years later.\nSimply unstoppable for most of his first Premier League spell, the Portuguese megastar banged in 31 goals in 34 games to win the 2007/08 Golden Boot, firing United to their (and his) second of three straight titles.\n1. Thierry Henry\nThierry Henry never won the Ballon d’Or – he really should have done – but nothing can take away from his greatness, and his status as the greatest Premier League player of all time (in FourFourTwo’s humble opinion).\nUndoubtedly Arsenal’s best ever player, the beguilingly smooth Frenchman tore the English top flight a new one during the first half of the 00s, amassing 157 goals at an average of 0.7 per game from the 2000/01 to 2006/07 seasons – and winning an unprecedented four Golden Boots.\nVoted PFA Fans’ and Players’ Player of the Year in 2002/03 and 2003/04, Henry was the main man in the Gunners’ ‘Invincibles’ campaign – which brought him his second Premier League winner’s medal.\nTom Hancock started freelancing for FourFourTwo in April 2019 and has also written for the Premier League and Opta Analyst, among others. He supports Wycombe Wanderers and has a soft spot for Wealdstone. A self-confessed statto, he has been known to watch football with a spreadsheet (or several) open...",
  "word_count": 2602,
  "scraped_at": "2026-02-14T01:51:19.049593",
  "_text_extracted": true
}