{
  "article_id": "30a32c9cc0a3",
  "url": "https://www.gdnonline.com/Details/1243527/Milans-Ibrahimovic-hangs-up-his-boots-at-41",
  "title": "Football : Milan Ibrahimovic hangs up his boots at 41",
  "date": "20230605T101500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AC Milan's Sweden striker Zlatan Ibrahimovic said on Sunday he had decided to end his playing career at the age of 41 after a trophy-laden career at some of Europe's top clubs.\nThe extrovert Swede's Milan contract expires at the end of June and will not be renewed following a season plagued by injuries, prompting him to end a remarkable career.\nIbrahimovic arrived in Milan for his second spell with the club in early 2020, having won the Scudetto with them in 2011, and helped the club win the title again last season.\n\"I say goodbye to football but not to you.\" he said after being feted by the San Siro crowd after Milan's 3-1 win over Hellas Verona in their season finale.\n\"The first time I arrived you gave me happiness, the second time you gave me love. I want to thank my family and those close to me for their patience.\"\nThe larger-than-life striker started his career at Malmo FF in 1999 and left for Ajax Amsterdam in 2001 before embarking on a journey that has included spells at Juventus, Inter Milan, Barcelona, Paris St Germain, Manchester United and Milan.\nIbrahimovic has won countless domestic leagues and cups plus a long list of individual honours but never got his hands on Europe's elite club competition trophy the Champions League.\nSweden's all-time top scorer with 62 goals in 121 matches, he quit the national team after Euro 2016 but returned in 2021 for their unsuccessful World Cup qualifying campaign.\nFREE MAN\n\"I thank the journalists for your patience, now you’ll have less work to do without me ... From tomorrow, I am a free man from this world of football,\" Ibrahimovic told reporters in a press conference after the announcement he was retiring.\n\"It was a long career, really long, thank you to everyone who gave me the strength, the adrenaline and the emotion to continue.\"\nIbrahimovic deflected questions regarding his plans for retirement, opting not to divulge any details.\n\"For the moment, I just want to take some time and enjoy what I’ve done. It’s not right to make decisions in a hurry, there’s too much emotion right now. I want to take the summer off, reflect and then we’ll see.\"\nWhen asked about who could replace Ibrahimovic, his answer was clear.\n\"Impossible, there is only one Zlatan! As a child, they compared me to (former Netherlands striker) Marco van Basten, but he is who he is and I am who I am.\n\"There might be similarities, but I don’t think comparisons are right. I doubt we’d find another Zlatan with my ego...\"\nHe concluded the press conference by admitting that the evening had been an emotional experience.\n\"I could not have dreamed of a night like this. From the first day, I felt at home with Milan, the old and the new version. When I leave here, I will miss it a great deal. Today, they dragged the real Ibrahimovic out.”",
  "word_count": 494,
  "scraped_at": "2026-02-14T02:24:42.725229",
  "_text_extracted": true
}