{
  "article_id": "30ad9be0e08c",
  "url": "https://metro.co.uk/2025/07/03/a-shame-mary-earps-isnt-help-hannah-hampton-england-can-trust-sarina-wiegman-23563262/",
  "title": "It a shame Mary Earps isnt here to help Hannah Hampton but England can trust Sarina Wiegman | Football",
  "date": "20250703T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England’s European Championship defence gets under way against France in Zurich on Saturday and here are my thoughts on what should be a fantastic tournament in Switzerland.\nEngland go in as defending champions but Sarina Wiegman has been quick to distance herself from that label as she doesn’t want this team to be saddled with that pressure, simple as that.\nIt’s a few weeks since Millie Bright, Mary Earps and Fran Kirby chose not to play and we know just how good and what a loss those players are.\nBut Sarina will have been instilling confidence in the players she does have.\nYes, experience from those three is missing but all those in the squad have big games with their clubs, at youth level with England or both behind them.\nIn Earps’ absence, I did think the 7-0 friendly win over Jamaica was an opportunity to look at our back-up goalkeepers Anna Moorhouse and Khiara Keating, neither of whom have a senior cap.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut we trust in Sarina and I know the role of a No.2 or No.3 keeper at a tournament because I have been there myself: unless there is an absolute emergency, you are not going to play and you’re there to prepare the No.1, Hannah Hampton.\nI was honestly a bit disappointed in Mary’s decision. You can infer from the call from her that she felt her strengths were probably not going to be what was required at this Euros once it became clear she wasn’t going to be the No.1.\nI felt Mary had had enough experience that she would want to give back but then, I’m not Mary. It’s important to remember football never stands still and squads evolve.\nEngland’s title rivals\nHosts Switzerland lost their opening game but can still progress from their group and world champions Spain are an obvious threat to England’s European crown.\nThere is a rivalry there from the 2023 World Cup final as well as Arsenal’s victory over Barcelona to win the Champions League in May.\nMany of the starting XI for Spain at this tournament will be made up of Barcelona players, so that memory for them of losing to an English team just weeks ago will still be very raw, but you can’t say that Spain aren’t favourites to win this competition.\nIt is a tough Euros just in terms of group qualification. We finished third and went through in 2009 but this time just the top two from each group –and England have a tricky one – progress.\nThe Netherlands have great quality and France have been a little bit reinvented without Wendie Renard and Eugenie Le Sommer, who have been left out and are two big losses for them.\nManager Laurent Bonadei is clearly looking to youth and France, the biggest obstacle in Group D, are a big danger to us on Saturday night.\nThey will have watched England’s performance against Jamaica and will look to exploit any weaknesses at set-pieces. The Lionesses will have to be a lot more solid and compact this weekend.\nBut I do believe England can win Euro 2025 and shouldn’t fear anyone.\nLauren James is one to watch\nI have to pick out Spain forward Salma Paralluelo, who really made the world sit up and take notice of her at the World Cup.\nLauren James is our magic player, a generational talent. The only player I can compare her to is Kelly Smith – a footballer you can’t really define and who can change a game.\nChelsea star Lauren, back from injury, certainly did that when she came on against Jamaica on Sunday.\nMore Trending\nLauren Hemp has also been out injured but has got better and better. The experienced Alex Greenwood will get her chance at centre-back alongside Leah Williamson I imagine, with Bright out of the tournament.\nIt is in the forward line where England’s strengths lie. Aggie Beever-Jones is only 21 but was Chelsea’s top scorer last term and has major tournament experience at youth level.\nRachel Brown-Finnis will be working on the BBC’s coverage of Euro 2025\nMORE: I hate primary school – I can’t wait for my daughter’s last day\nMORE: BBC takes action after admitting Bob Vylan was deemed ‘high risk’ before Glastonbury\nMORE: Fears for survivors trapped on Bali ferry with 29 still missing",
  "word_count": 776,
  "scraped_at": "2026-02-14T02:02:47.529019",
  "_text_extracted": true
}