{
  "article_id": "30bf41344362",
  "url": "https://thepeoplesperson.com/2024/04/29/aston-villa-in-pole-position-to-sign-manchester-united-target-jonathan-david-from-lille-279558/",
  "title": "Aston Villa in pole position to sign Manchester United target Jonathan David from Lille - Man United News And Transfer News",
  "date": "20240429T211500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s issues with scoring goals have plagued Erik ten Hag’s second season at Old Trafford.\nTen Hag’s troops are comfortably the lowest scorers in the top six of the Premier League and the lack of firepower has been a major reason behind their wretched campaign.\nUnited are expected to go into the market in the summer and a raft of top players across Europe are being linked with bolstering the attacking options in Ten Hag’s first-team squad.\nLille striker Jonathan David is one of the names rumoured to be on the INEOS shortlist but it appears United will face stiff competition for his signature.\nAs reported by TuttoMercatoWeb, Premier League rivals Aston Villa are in pole position to sign the 24-year-old with Unai Emery keen on the player.\nThe outlet reports United have “made contact” in recent weeks but Villa have now emerged as favourites for the Canadian.\nThe midlands club currently occupy the coveted fourth spot in the Premier League and therefore could be able to offer Champions League football to the player – something United cannot.\nDavid is out of contract next summer and it’s believed Lille will settle for a deal at €35 million which represents good value for money in the current market.\nThe striker has 24 goals and eight assists from his 44 games this season and has no doubt caught the eye of major clubs across the continent.\nSerie A giants AC Milan and Napoli are also said to be monitoring David’s situation closely but stand little chance of tempting the player if the Premier League comes calling.\nNo official bid has come from Villa or United but expect the race to sign the striker to hot up in the coming weeks with the summer transfer window swinging open mid-June.\nIn the meantime, United will hope to salvage something from what has been a dreadful season, by winning the FA Cup against Manchester City next month.\nUnited travel to Wembley for a repeat of last year’s final on May 25 and will be desperate to avenge last season’s loss and win the trophy for a remarkable 13th time.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 376,
  "scraped_at": "2026-02-14T01:56:51.540286",
  "_text_extracted": true
}