{
  "article_id": "30d5ae8c26f3",
  "url": "http://www.china.org.cn/world/Off_the_Wire/2024-09/24/content_117445605.htm",
  "title": "Ter Stegen injury a shock , says Nagelsmann",
  "date": "20240924T061500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- 0 Comment(s)Print E-mail Xinhua, September 24, 2024\nBy Oliver Trust\nBERLIN, Sept. 23 (Xinhua) -- The sudden need to find a new number one goalkeeper has come as an unpleasant surprise for German national team coach Julian Nagelsmann.\nNagelsmann described the situation as a shock for German football following the confirmation of Marc-Andre ter Stegen's serious knee injury. Medical screening revealed a torn patellar tendon in Ter Stegen's right knee, raising major concerns.\nFC Barcelona confirmed on Monday evening that Ter Stegen had undergone a successful operation at a hospital in Barcelona. The injury comes just three weeks after Germany's long-time goalkeeper Manuel Neuer announced his retirement after 15 years, and Ter Stegen was promoted to the new number one spot. Now, things have changed dramatically.\nNagelsmann is now forced to find a replacement for Ter Stegen, who had been patiently waiting for his moment to shine for years. Reports suggest Ter Stegen will face an eight-month recovery period, keeping the 32-year-old sidelined until at least the end of the 2024/25 season.\n\"It's a shock for us. We will miss him on and off the pitch and will give him all the support we can,\" Nagelsmann said.\nMeanwhile, the German Football Association's sporting director, Rudi Voller, promised full support for Ter Stegen, and teammates and officials have sent their best wishes for his recovery. At the same time, speculation has begun regarding who will take over as the new number one for the UEFA Nations League matches against Bosnia-Herzegovina, the Netherlands, and Hungary in October and November.\nThe leading candidates include 27-year-old Alexander Nubel, who is on loan from Bayern Munich to Stuttgart until 2026, 32-year-old Oliver Baumann of Hoffenheim, 32-year-old Bernd Leno from Fulham, and 34-year-old Kevin Trapp of Frankfurt. Nubel is reportedly the frontrunner for the role.\nTrapp and Baumann have long been considered third and fourth choices behind Neuer and Ter Stegen. However, Nubel, who represents a younger option for the future, could step into the role as Ter Stegen's successor.\nTer Stegen has already undergone two previous knee operations in 2020 and 2021. \"I am sure he will return even stronger, as he has overcome several setbacks in his career,\" Voller said.\nNubel has been making waves in the Bundesliga during his loan spell at Stuttgart, being instrumental in Stuttgart's return to the UEFA Champions League after a 14-year absence.\nNubel had initially been left out of Germany's 2024 UEFA Euro squad, with Nagelsmann opting for just three goalkeepers (Neuer, Ter Stegen, and Baumann). However, with the injury to Ter Stegen, Nubel is now back in contention for the 2024/25 Nations League.\nNagelsmann has indicated that the race for the starting position will likely come down to two candidates: Nubel and Baumann. Enditem\nNo comments.",
  "word_count": 460,
  "scraped_at": "2026-02-14T02:01:51.729826",
  "_text_extracted": true
}