{
  "article_id": "30d776bd8f54",
  "url": "https://metro.co.uk/2025/10/23/thiago-silvas-son-defends-chelsea-star-mocked-social-media-24510837/",
  "title": "Thiago Silva son defends Chelsea star who was  mocked  on social media | Football",
  "date": "20251024T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thiago Silva’s son, Isago Silva, has defended Chelsea star Reggie Walsh after fans claimed he was ‘mocked’ on social media after the Ajax game.\nWalsh came on in the 66th minute against Ajax on Wednesday – becoming Chelsea’s youngest ever Champions League player – as the Blues won 5-1.\nThe teenager, who had his 17th birthday on Monday, is also now the second-youngest Englishman to ever play in the Champions League.\nFootage of Walsh playing against Ajax was posted on Instagram account @just_cfc after the match, with Chelsea fans heard chanting: ‘Reggie, give us a wave!’\nWalsh did not appear to wave to the supporters, though, as the fans started to sing his name instead.\nInstagram user @dehema___1code left a comment under the video with a laughing emoji and the words: ‘Bro is nervous.’\nSilva’s son appeared to take issue with that remark and replied: ’17-years-old playing his first game in the Champions League, [you] expect him not to be nervous?’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe interaction has gone viral on Reddit, with a number of Chelsea supporters giving their opinions.\n‘The statement itself is just a fact… But the laughing emoji makes it mockery,’ Reddit user @Academic-Cheesecake1 opined.\nBut a second Chelsea fan, @alesko444, disagreed and posted: ‘I don’t think the original comment was an attack or anything, love anyone and anything Thiago Silva related but it’s a bit of an overreaction.’\nChelsea head coach Enzo Maresca, speaking in September, explained why he is such a big fan of Walsh.\n‘I like all the academy guys but Reggie is the one I like more than the rest,’ he explained.\n‘I like Reggie because he is doing things that I’m demanding to the other players, but he is doing those things without me asking him to do that.\n‘I don’t need to ask him to do something. What he’s doing is already what I want from that player.’\nMore Trending\nMeanwhile, Chelsea fans tipped Silva’s son to become a ‘club legend’ when he was signed as a scholar ahead of the 2025-26 season.\nHis father played 155 games for Chelsea from 2020 to 2024, with the club winning the Champions League during his spell at Stamford Bridge.\nSilva’s son mainly features as a left-back but can also be deployed as a central defender.\nThe Brazilian teenager made his debut for Chelsea U18s earlier this year.\nMORE: David James claims £25m star can fire Chelsea to Premier League title\nMORE: Man Utd eye ‘ambitious’ move for Chelsea star valued over £60m in January window\nMORE: Enzo Maresca hails ‘special’ Chelsea talent who’s different from most young players",
  "word_count": 486,
  "scraped_at": "2026-02-14T01:52:49.017393",
  "_text_extracted": true
}