{
  "article_id": "30f1d3be1760",
  "url": "https://www.bbc.co.uk/sport/football/67735453",
  "title": "Luton Town 1 - 0 Newcastle United : Andros Townsend hits winner as Hatters honour Tom Lockyer",
  "date": "20231223T201500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luton Town 1-0 Newcastle United: Andros Townsend hits winner as Hatters honour Tom Lockyer\n- Published\n- comments\nLuton lived up to their pledge of making it \"a special day\" for convalescing captain Tom Lockyer by beating Newcastle United at an emotionally charged Kenilworth Road.\nAndros Townsend headed home the Hatters' winner against his former club in Luton's first Premier League game since Lockyer's collapse at Bournemouth seven days earlier.\nTownsend held up Lockyer's number four shirt in celebration after the goal - one of a number of tributes paid by Luton players and fans to their stricken skipper before, during and after the game.\n\"All the chat throughout the week was 'do it for our captain',\" former England winger Townsend, 32, told BBC Sport.\n\"He's an incredible person. He had the issue [an atrial fibrillation ] at Wembley [in the Championship play-off final] and put his body, his life on the line for the first 16 games.\n\"So we are doing it for him - and we are going to keep doing it for him until if and when he is fit to come back.\n\"It was an emotional rollercoaster [today] but thankfully we got the win at the end of it.\"\nOnly the woodwork denied Luton a more straightforward victory as the excellent Ross Barkley struck the bar with a 35-yard thunderbolt and Jacob Brown also hit the frame of the goal from closer in.\nNewcastle did mount increasing second-half pressure as Alexander Isak had an equaliser ruled out for a marginal offside while Bruno Guimaraes and Anthony Gordon also went close.\nHowever, they slipped to a fourth successive away league defeat to stay seventh while Luton remain 18th but move within two points of safety.\nThe Hatters also have a game in hand on Nottingham Forest, the side directly above them, but Townsend says such concerns pale in comparison with their captain's plight.\n\"In a way it was easy to not feel too much pressure, to not be anxious or worried about where we are in the table,\" he added.\n\"It puts things into perspective - we didn't do much tactical work in the week, it was all about making sure we were in the right frame of mind, knowing there are more important things than football.\"\nHatters hold out to cheer Luton 'legend' Lockyer\nPrior to the game, Luton boss Rob Edwards admitted he did not quite know how his players would react after the scare suffered by Lockyer, a player he described as \"a hugely influential and important figure for this club\".\nMuch of the matchday programme was devoted to Lockyer while both sets of fans unveiled banners with well wishes and there was a fourth-minute period of applause for both the 29-year-old and those who came to his aid.\nEdwards revealed the captain had messaged him prior to the match against Newcastle, telling him to \"get those three points\" which prompted the manager to say his side wanted to make the day special.\nThey did just that, adding to a growing collection of memorable top-flight displays already this season, producing a typically high-energy effort headlined by their two former England players, Townsend and Barkley.\nIt was Barkley who flicked on the corner to give an unmarked Townsend the simplest of headers for the decisive goal and the ex-Everton man was unlucky to see a 'Goal of the Season' contender denied by the crossbar.\nLuton's lead should have been greater as Elijah Adebayo - found by a lovely through ball from Barkley - was thwarted by Newcastle keeper Martin Dubravka, who also foiled Brown, Townsend and substitute Ryan Giles.\nThe Hatters have let leads slip on several occasions this season but, backed by a support who at times seemed to will the ball away from danger, they held out amid a barrage of attacks in the last half-hour.\nThe final whistle was greeted with a mixture of relief and delight - and the importance of both result and occasion was evidenced by the time Edwards and his team spent on the pitch afterwards applauding the fans, taking turns to carry Lockyer's shirt.\n\"It's been the greatest challenge of my football career - no coaching badges prepare you for something like this,\" Edwards told BBC Match of the Day.\n\"I've needed the support of everybody and the players have been incredible. To go and perform as they have after last week, words fail me.\n\"We wanted to do it for Tom. It wasn't extra motivation, we just wanted to embody what he's about. He's brave, determined, a fighter, and I thought we showed all of those attributes today.\"\nThe clean sheet - Luton's first since promotion - would have been another tonic for central defender Lockyer as he continues his recovery at home with his family.\nMagpies' rotten run on road goes on\nNewcastle boss Eddie Howe spoke before the game about the atmosphere his side were expecting but by the time they came to terms with it, it was too late.\nThey were ultimately undone by a muted first-half showing in which they suffered the latest in a series of seemingly never-ending injury blows as centre-back Jamaal Lascelles limped off.\nDespite their woes, the Magpies should really have taken the lead but Callum Wilson directed his close-range header from Anthony Gordon's cross too close to Thomas Kaminski, who made a smart reaction stop.\nGuimaraes and Gordon were off target with decent openings when the visitors finally kicked into gear, while Isak's cool and classy finish was ruled out by the referee's assistant, the decision confirmed by VAR.\nHowe's side are now seven points off the top four after a disappointing fortnight in which they also exited the Champions League and Carabao Cup - with a paltry away return of just five points from a possible 27 not aiding their domestic cause.",
  "word_count": 976,
  "scraped_at": "2026-02-14T01:51:13.767235",
  "_text_extracted": true
}