{
  "article_id": "30f48ec4e7df",
  "url": "https://www.caughtoffside.com/2024/04/14/newcastle-premier-league/",
  "title": "Newcastle transfer news : Morgan Gibbs - White identified as top target",
  "date": "20240414T143000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle have reportedly identified Nottingham Forest’s Morgan Gibbs White as the ideal replacement for Bruno Guimaraes should he leave in the summer transfer window.\nAfter an exceptional season last year, Eddie Howe’s side is currently 10 points off of fourth place Aston Villa in sixth place.\nThe Magpies were able to claw back ground on Tottenham Hotspur after demolishing them 4-0 early Saturday afternoon but are still all but out of the race for Champions League qualification.\nWith their hopes of back-to-back seasons of Champions League football now slipping away, the club are preparing for not just a hit to their finances but a potential migration of some of their most important players.\nAt the top of that list is Brazilian midfielder Guimaraes who has been targeted by several of Europe’s elite since making the move to England.\nWith the likes of Real Madrid and Manchester City sniffing around, Howe may have to resign himself to losing his key man in the middle of the park.\nAccording to reports from Football 365, the club have identified Nottingham Forest’s Gibbs-White as their ideal replacement with the English midfielder valued at £50 million.\nNewcastle will be hoping to garner £100 million for Guimaraes if he was to leave which could help them acquire several players to increase the overall quality of the squad.\nAlexander Isak has also been linked with a move away with rumours about a potential swoop from Arsenal gaining traction.\nHowe’s side face Crystal Palace at Selhurst Park on Wednesday before welcoming relegation-fighting Sheffield United to St. James’ Park at the weekend.",
  "word_count": 263,
  "scraped_at": "2026-02-14T01:56:51.554662",
  "_text_extracted": true
}