{
  "article_id": "313288b36b03",
  "url": "https://www.france24.com/en/live-news/20240226-man-city-s-norway-starlet-bobb-signs-new-contract",
  "title": "Man City Norway starlet Bobb signs new contract",
  "date": "20240226T204500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City's Norway starlet Bobb signs new contract\nLondon (AFP) – Manchester City's emerging young winger Oscar Bobb signed a new five-year contract with the Premier League champions on Monday.\nIssued on:\nNorway's Bobb has scored twice in 16 appearances this season, including a crucial last-minute winner at Newcastle in January.\nThe 20-year-old, who recently hailed the influence of City striker and compatriot Erling Haaland on his development, is regarded as one of the club's brightest talents after graduating from the youth academy.\nBobb's previous deal was set to expire in 2026, but he has been rewarded with the new contract after his breakthrough season.\n\"I am very proud and honoured to have signed my new contract with City. It is an incredible environment and the best possible place to be for a young player,\" Bobb said.\n\"It is an incredible environment and the best possible place to be for a young player.\n\"I have already learnt so much from Pep, his coaching staff and my team-mates. To know I am going to be here at the club until 2029 means everything to me.\n\"Now I just want to focus on continuing to further my development and to work as hard as I can every day to try and help the club achieve more success.\"\nCity's director of football Txiki Begiristain believes there is plenty more to come from Bobb, whose first senior goal came on his full Champions League debut against Red Star Belgrade in December.\n\"Oscar is blessed with superb natural talent and technique and has already established himself as a very important member of the squad,\" Begiristain said.\n\"He is an exciting young player who is always hungry to learn and who takes on board all the advice and guidance Pep and the coaching staff provide him with.\n\"Oscar is developing all the time, and we believe he can help to bring even more success to the club in the coming years.\"\n© 2024 AFP",
  "word_count": 328,
  "scraped_at": "2026-02-14T01:51:19.049850",
  "_text_extracted": true
}