{
  "article_id": "313cd1ad06b5",
  "url": "https://www.managingmadrid.com/2023/2/23/23612311/even-the-biggest-skeptics-cant-deny-real-madrids-mental-fortitude",
  "title": "Even the biggest skeptics cant deny Real Madrid mental fortitude",
  "date": "20230224T024500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "These observations — where I look at Real Madrid’s history, its players on loan, Castilla, tactical tidbits, and other relevant thoughts — are now a regular thing. All previous editions can be found here.\nEven the biggest skeptics can’t deny Real Madrid’s mental fortitude\nThe performance against Liverpool felt like an extension of last season. But then again, this is just Real Madrid, a team that looks meditative when everything is going wrong.\nIn an interview with ESPN that was released today, Real Madrid legend Marcelo spent a portion of the conversation talking about how Carlo Ancelotti has the ability to keep calm despite the result, and how that, in turn, gets passed on to the players.\n“Carlo kept his calm way of being,” Marcelo said. “We scored a goal and we were always calm. It was very good for me to have him as coach.”\nMarcelo, like many of these Real Madrid players, has seen it all. But even those who haven’t, have seen enough to have an accelerated learning curve.\n“My first year was that of comebacks in LaLiga (06-07) and there was no better school than that,” Marcelo explained. “Vini, Rodrygo and Fede knew about that and they asked me about those games, they already knew about it.”\nOthers have followed suit. Eduardo Camavinga saw it first hand in his first season too — comebacks, adversity and all. One day he will be able to give a similar response to Marcelo when he leaves the club or retires. It may seem silly to some — and it certainly won’t seem silly at all to Real Madrid fans — but this is how tradition, values, and learning gets passed on. Trace it back far enough, and it was passed on by Alfredo di Stefano himself in the 50s.\nThere is a trait that Real Madrid have that is underrated to much of the outside world but valued within the club and fan base adequately: That ability to not get too high after a goal, but not get discouraged after conceding one. Watching the comeback in person at Anfield was special for a variety reasons and many of them have little to do with football and more to do with an intangible energy.\nThe atmosphere at kick-off was special, and quite frankly, deafening. When Liverpool scored the first goal, the decibels went up, and by the time the second one went in after 14 minutes, it was raucous and incoherent.\nBut amid the chaos was a quartet of Real Madrid players at the center circle waiting for Liverpool to stop celebrating and to reset the play again. Karim Benzema and Vinicius Jr were talking to Luka Modric and Eduardo Camavinga, and the four came to a quick conclusion: Let’s relax.\nFootball analytics have come a long way, but I would love to see another evolution: Heart rate. I want to measure Benzema’s heart rate in that exact moment to see how much pressure he’s feeling — because he looked almost meditative. And if you don’t believe that he was meditating then, perhaps you could see it with how he put the game into slow motion on the goal he scored later to make it Real Madrid’s fifth.\n“When we were 2-0 down,” Carlo Ancelotti said after the game. “I thought back to the Manchester City semi-final. But, we did better this time because we pulled it back even quicker. As happens with this team, we kept a cool head and our quality allowed us to get back into the game. The veterans helped us a lot to stay cool.”\nLiverpool now are not as good as Manchester City were then, but emphasizing too much on Liverpool’s performance discredits Real Madrid. How many teams, down by two goals at Anfield, would overturn it and score five? We’ll never know, but my hunch tells me very few and probably none. Keep in mind that despite their struggles, in their four biggest games in the build-up to this one (Chelsea, Napoli, Tottenham, Manchester City) Liverpool conceded just one goal while scoring five and going undefeated. They, like Real Madrid, have some Champions League DNA and get results despite not being great.\nAnyone who doubted Real Madrid in the 15th minute of that game should be put on blast. It takes more than a loud arena and a couple goals to shake this team — and it will be that way until further notice.\n“Our forward line’s efficiency allowed us to get back in the game,” Ancelotti said. “Rodrygo, Vinícius and Benzema were very smart. When we got through Liverpool’s press, we caused them problems. Then, we also got better defensively. In the first half, they caused problems to us on our left, but we got better as the game progressed.”\nThe tactical explanation is just as important as the spiritual one. As Jurgen Klopp said to me after the game, Nacho’s entrance because of necessity changed the efficiency with which Liverpool attacked with on that flank. On top of that, Modric went into God-mode, Vinicius and Benzema transcended, Valverde covered every blade of grass, and Eduardo Camavinga was incredible as a defensive disrupter that snuffed out nearly ever Liverpool break while also being an important outlet in the build-up phase.\nLong way to go, still, but good on Real Madrid for sending a giant message to those who felt last season was some fluke.\n“The work of the whole team was spectacular,” Vinicius said after the game. “We did a great job defensively and also offensively. We’ve managed to make a lot of plays.\n“The tie is still open. Liverpool are a great adversary and in the Champions League it won’t end until the two games are played.”",
  "word_count": 956,
  "scraped_at": "2026-02-14T02:06:47.837880",
  "_text_extracted": true
}