{
  "article_id": "316e89862025",
  "url": "https://www.nytimes.com/athletic/6557326/2025/08/16/chelsea-maresca-centre-half-colwill/",
  "title": "Why Chelsea are not inclined to sign a new centre - back this summer",
  "date": "20250816T204500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca says he thinks Chelsea need a new centre-back to replace the injured Levi Colwill — but don’t expect them to sign one this summer.\n“You know how important Levi was last season, for the way we want to play,” Chelsea’s head coach said in a press conference at Cobham on Friday. “We said many times that we can create chances and to attack in the right way, if we can build in the right way. Levi was a huge part of our build-up and now he is out.\nAdvertisement\n“We are trying to find a solution internally, but the club knows exactly what I think and we will see what happens. I think we need a central defender.”\nMaresca’s comments jarred with last week’s Transfer DealSheet, which reported that Chelsea are not inclined to panic following the anterior cruciate ligament (ACL) tear Colwill sustained in training at Cobham that is expected to sideline him for most of this season. They feel no urgent need to go into the transfer market to find a replacement for the 22-year-old.\nSources at Chelsea, speaking anonymously to The Athletic, confirm their stance has not shifted. Three main factors inform the decision: confidence in the depth that has been amassed in this squad, a lack of suitable options available in this window, and full faith in Maresca and his coaching staff to work with and improve the talent at his disposal.\nLet’s look at each of the three in turn.\nThere is a strong belief within the Chelsea hierarchy that they have built the deepest squad in the Premier League, and centre-back might be its deepest position. Of the 10 senior defenders Maresca has competing for four starting spots, only Malo Gusto is not adapted to playing in a back three — which is what the defensive line becomes when the team is in possession.\nNot all of the other nine are suitable for the specific role Maresca is discussing: that of the central defender in the back three, who generally has more responsibility for progressing the ball in his system. Colwill is superb in that role, highly adept at punching low, pinpoint passes through the opposition lines into the feet of the Chelsea midfielders or attackers in front of him.\nTosin Adarabioyo is the other player Maresca leaned on heavily in this position last season, often playing in the middle of Chelsea’s back three in the Conference League as well as in specific Premier League games when Colwill was deployed further left and Marc Cucurella was pushed up.\n“We build with Levi in the middle,” Maresca added. “Last year, we played 64 games and we played 64 games with Levi and Tosin.\nAdvertisement\n“Now Levi is out, the only one who can do that job well is Tosin. Also, we have players who, unfortunately, like Wesley Fofana or Benoit Badiashile, have some problems and this is why I said that the club knows exactly what I think about central defenders.”\nBadiashile has demonstrated the ability to progress the ball from central defence at times in his rollercoaster Chelsea career. In many respects, the 24-year-old has a similar profile to Colwill. He may be the best like-for-like replacement in the squad when fit, but there are also people at the club who believe 19-year-old Josh Acheampong can do that job if given more opportunities and experience.\nAaron Anselmino also knows how to play in the middle of a back three from his time at Boca Juniors. At this early stage of his career, the 20-year-old is understandably at the bottom of Chelsea’s depth chart in defence, but he could still be used as a bench option at some point during a long season if he impresses Maresca in training.\nThe other senior defenders available to Maresca — Cucurella, Jorrel Hato, Trevoh Chalobah and club captain Reece James — are viewed as being better suited to defending the wide spaces on the left or the right of the back three. That leaves Tosin, Badiashile and Acheampong as realistic Colwill deputies.\nSecond, there is the market. Which centre-backs are actually available for Chelsea to sign this summer and good enough to be considered upgrades on their depth options?\nDean Huijsen was one, and Chelsea were prominent among the Spain international’s suitors in May until he made it clear he wanted to join Real Madrid.\nMarc Guehi’s situation at Crystal Palace remains unresolved, making him perhaps the most obvious name. He was monitored closely in January but that was with a view to deploying him on the left of the back three, where he has played at times for Palace and England. Ibrahima Konate, another defender set to be a free agent in 2026, has been linked with Chelsea in recent days, but he is more of a wide centre-back than a central ball progressor.\nDespite the reputation they have earned for recruiting aggressively and on a large scale, Chelsea are wary of panic buying. The almost total player overhaul that began in January 2023 has been done, the squad is regarded as being in a strong position and the bulk of the club’s recruitment now is either long-term investment in elite potential or targeted tweaks to the first-team squad, rather than major surgery.\nAdvertisement\nOne cautionary example from recent Chelsea history is Axel Disasi. Signed for around €45million (£38m; $49.2m) from Monaco in August 2023, shortly after Fofana tore his ACL, he was immediately deemed unsuitable for Maresca’s style of football on the Italian’s appointment the following summer and is now one of several players the club are looking to offload.\nThe risk of overreacting to Colwill’s injury and making a similar error in this summer’s market is considerable, particularly with no obvious target to pursue. In a scenario where a more obscure replacement could be found, even their success would create a problem once Colwill returns to fitness.\nColwill’s performance level and personality within the squad mean he should remain a key piece in their long-term planning, despite this setback.\nChelsea’s determination to hold to the long view also extends to Mamadou Sarr, who was loaned back to Strasbourg to continue his development following a €14m transfer in June from the other club under the BlueCo umbrella. There is huge excitement about the 19-year-old’s potential to play any of the roles in Maresca’s defensive line and he could be ready to do so as soon as next season.\nWhat happens when Colwill returns to fitness is probably not foremost in Maresca’s mind, and nor should it be. He is a head coach who is judged on his results, and everything he says and does should be viewed within that prism. He is also under no obligation to disclose the motives behind his words.\nCould he be trying to motivate the other defenders in his squad? Could he simply be trying to manage the expectations of fans dreaming of a Premier League title tilt?\nIn any case, Chelsea made a long-term commitment to Maresca and his style of football by handing him a five-year contract on his appointment last summer. The early returns on that decision — a top-four finish that secured Champions League qualification plus two trophies (the Conference League and the Club World Cup) — have been hugely encouraging.\nAdvertisement\nChelsea’s hierarchy regard Maresca as a talented coach capable of delivering results while also developing the talent in the Premier League’s youngest squad. In his comments on Friday, the Italian also mentioned that he and his staff are “trying to find a solution internally” to Colwill’s absence.\nAll signs point to that being the path in what remains of August and beyond.\n(Top photo: Peter Byrne/PA Images via Getty Images)",
  "word_count": 1287,
  "scraped_at": "2026-02-14T02:02:51.932213",
  "_text_extracted": true
}