{
  "article_id": "319e4e98deb0",
  "url": "https://theleader.info/2024/05/02/gateway-to-equality-at-zenia-boulevard/",
  "title": "  Gateway To Equality  at Zenia Boulevard - News , Sport , Information , Property , Business in Spain",
  "date": "20240502T181500Z",
  "domain": "theleader.info",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Zenia Boulevard Shopping Centre is organising a special event under the motto ” “Gateway to Equality”. The event will take place this Saturday, May 4, in collaboration with the Association of the Disabled of Vega Baja (ADIS).\nIt will be full of activities designed to highlight diversity and promote the inclusion of people with disabilities in society including: paper flower creation workshop, music therapy workshop, ADIS solidarity sale stand, parade 60s theme, dance, piano and clarinet performance by the association.\nCristina Ros, Director of Zenia Boulevard, said, “in a world where equal opportunities continue to be a challenge, events like this are essential to raise awareness in the community about the importance of inclusion and respect for diversity. At Zenia Boulevard we will continue to support actions that make visible and give voice to people with disabilities, demonstrating that we all have talents and abilities that deserve to be recognized and valued.”\nCasting: We are looking for models\nThe following Saturday, May 11, will see Zenia Boulevard will host the “Catwalk: Model Casting” event that aims to highlight diversity and promote the representation of people of all abilities in the fashion and entertainment industry.\n“We are looking for passionate, self-confident people willing to break barriers. No matter what the age, gender, size or abilities, everyone is welcome to tale part. We want to show the world that beauty goes beyond conventional standards and that true elegance lies in authenticity and diversity,” says Cristina Ros.\nOn Saturday, May 18, “Urban Street Art” will come to the Boulevard, an event that will showcase the world of urban art. Visitors will be able to enjoy speed painting shows and graffiti sessions for the children, with the Zenia Kids graffiti workshop, the perfect opportunity to explore their creativity in a fun and safe way.\nWith the guidance of several experts, they will learn the basic techniques of graffiti and will be able to let their imagination run wild in a creative and stimulating environment. The event also includes street dance performances by a local Dance School.\nZenia Boulevard’s programming for the month of May is completed with two promotions related to football and in which participants in both initiatives will be eligible to win a 200-euro Decathlon gift card. Those interested in both promotions will have to redeem a purchase ticket equal to or greater than 40 euros. To win they will only have to guess the final result of the Champions League or score a goal from a distance of 20 metres.",
  "word_count": 419,
  "scraped_at": "2026-02-14T02:13:49.306843",
  "_text_extracted": true
}