{
  "article_id": "31a4d1cc1311",
  "url": "https://www.espn.co.uk/espn/story/_/id/46134422/nigeria-star-asisat-oshoala-leave-nwsl-bay-fc-saudi-al-hilal-source",
  "title": "Nigeria star Asisat Oshoala has signed 2 - year deal with Saudi Al Hilal - Source",
  "date": "20250902T110000Z",
  "domain": "espn.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nigeria and Bay FC striker Asisat Oshoala has signed a two-year contract with Al Hilal in the Saudi Women's Premier League, a source close to the player told ESPN.\nThe deal was finalized on Monday following her medical in Riyadh.\n\"Asisat has signed a two-year contract after completing her medicals in Riyadh on Monday morning,\" the source told ESPN.\nThe 30-year-old was not included in the Bay FC squad for Monday's game against Angel City and was listed on the availability report as an excused absence.\nOshoala leaves Bay FC after joining the National Women's Soccer League (NWSL) expansion team last season, making 23 starts in 25 games. She tallied seven regular season goals and contributed one assist.\nThis season, the striker has seen her time on the pitch severely limited, coming in more often than not off the bench, making five starts over 12 matches with no goals or assists before her departure.\nIn April, Bay FC coach Albertin Montoya cited her adaptation to the NWSL's playing style and defensive expectations for her limited minutes this season: \"In this league you have to, and that's something that we're working with her.\n\"So when she gets that and has the confidence in front of the goal to score goals and helps us defensively, and that's why with Caroline (Conti), she gives us something else defensively.\"\nThe six-time Africa Woman Player of the Year also played a reduced role for Nigeria during this year's Women's Africa Cup of Nations, where the Super Falcons won a record 10th title.\nOshoala played four of Nigeria's six games but started only the opening two matches against Tunisia and Botswana. She was an unused sub versus Algeria and South Africa, and came on as a 73rd minute sub against Zambia and 78th minute sub in the final against Morocco.\nThe two-time Ballon d'Or nominee previously spent five seasons at Barcelona, where she scored 107 goals in 149 appearances, winning five Liga F titles and two Women's Champions League trophies. She also played for Arsenal, Liverpool and Chinese club Dalian Quanjian after beginning her career with Nigerian sides Robo and Rivers Angels.\nShe joins Super Falcons teammates Ashleigh Plumptre and Francisca Ordega in Saudi Arabia. Al Hilal finished sixth in the 2024-25 season with the competition expanded from eight to 10 teams.",
  "word_count": 386,
  "scraped_at": "2026-02-14T01:52:36.762875",
  "_text_extracted": true
}