{
  "article_id": "31b6251c1244",
  "url": "https://www.caughtoffside.com/2024/02/23/phil-foden-ballon-dor-elite-former-agent/",
  "title": "Man City news : Phil Foden is a great shout for Ballon dOr",
  "date": "20240223T094500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Jon Smith was in his pomp, he was working as an agent for the great and the good in the world of football, including Diego Maradona, and he evidently agrees with Brentford manager, Thomas Frank, regarding a Ballon d’Or candidacy for Man City ace, Phil Foden.\nFoden is one of those players that doesn’t necessarily hog the headlines every week, but you really know when he’s missing from the starting XI.\nBellingham enjoying breakout La Liga season\nThat’s despite the fact that Jude Bellingham is enjoying an incredible breakout season in La Liga with Real Madrid.\n“Thomas Frank made a lovely statement recently about Phil Foden being the closest English player to winning a Ballon d’Or and I hope it’s true because I love Phil Foden,” Smith said to CaughtOffside for his exclusive column.\n“I think he’s a great English footballer with a brain that’s a lot more ‘international.’\n“[…] Foden’s 24, he’s maturing, he’s high energy and with a lot of trickery – and he had a good World Cup.\n“I think you should ask me that in three years time, and I hope my answer is yes because he is the complete package.\n“He just needs to keep his head in the right place.”\nPhil Foden’s influence\nMuch is likely to depend on how influential Foden is in what’s a fantastic Man City side, and also how much Pep Guardiola’s squad go on to win over the next few seasons.\nIt’s worth pondering on the fact that a number of Ballon d’Or awards for both Lionel Messi and Cristiano Ronaldo were given as a result of how well both Real Madrid or Barcelona had done and their contributions within that.\nFoden has a long way to go at this point, but as Smith notes, there’s every reason to think he can get there.",
  "word_count": 306,
  "scraped_at": "2026-02-14T02:13:34.146964",
  "_text_extracted": true
}