{
  "article_id": "31ceb069f5df",
  "url": "https://www.gdnonline.com:443/Details/1367013/Juventus-sack-coach-Tudor-after-winless-run",
  "title": "Football : Juventus sack coach Tudor after winless run",
  "date": "20251028T013000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – JUVENTUS have sacked head coach Igor Tudor after failing to win their last eight matches in all competitions, the Serie A club said yesterday.\n“Juventus FC announces that it has today relieved Igor Tudor of his duties as head coach of the men’s first team, along with his staff,” the Italian club said in a statement.\nMassimo Brambilla, head coach of the reserve team, will temporarily take over as the first team manager, the club added.\nCroatian Tudor, who replaced Thiago Motta in March, was the first foreign manager appointed by Juventus since Didier Deschamps in 2006-07.\nFormer centre-back Tudor spent nearly a decade of his playing career at Juventus, during which they won Serie A twice and reached the final of the Champions League.\nTudor, 47, guided Juventus to a fourth-place finish in Serie A last season and secured qualification for the Champions League.\nBut the club’s form took a downturn last month after winning their first three league games, as they drew five successive matches in all competitions before slumping to three losses in a week to Como, Real Madrid and Lazio.\n“I think we prepared for the match in the right way, but we’re still missing something. There’s no need to dramatise the situation, we’re all responsible for this difficult period,” Tudor told reporters after Sunday’s loss at Lazio.\nJuventus, who host Udinese on Wednesday, have failed to score in their last four matches and sit eighth in the Serie A standings, six points behind leaders Napoli.",
  "word_count": 252,
  "scraped_at": "2026-02-14T02:15:53.536215",
  "_text_extracted": true
}