{
  "article_id": "31e14f128dbb",
  "url": "https://www.teamtalk.com/news/chelsea-reignite-blockbuster-move-flawless-liverpool-tottenham-target-before-staggering-clause-kicks-in",
  "title": "Chelsea reignite blockbuster move for flawless Liverpool and Tottenham target before staggering clause kicks in",
  "date": "20230302T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea reignite blockbuster move for flawless Liverpool and Tottenham target before staggering clause kicks in\nChelsea have renewed their interest in an imperious defender also wanted by Liverpool, Tottenham and Man City, and the race is on to complete the deal before a mammoth release clause brings the cost close to £100m.\nDespite splashing out over £130m on Kalidou Koulibaly, Wesley Fofana and Benoit Badiashile, Chelsea believe there’s still room for another, even higher calibre arrival at centre-half.\nThat’s according to the Times who report the Blues have renewed their interest in signing RB Leipzig and Croatia ace, Josko Gvardiol.\nThe 21-year-old is already widely acknowledged as one of world football’s premier centre-backs. Gvardiol was unflappable on the biggest stage with Croatia in Qatar and underlined his credentials when scoring an equaliser against Man City in the Champions League last week.\nMaking Gvardiol even more appealing is the fact he’s left-footed. As such, it comes as no surprise to see so many of England’s big-hitters chasing a deal.\nIndeed, the trusted Ben Jacobs recently confirmed Liverpool are “tracking” Gvardiol. The Reds do not boast a single left-footed centre-half in their first-team ranks.\nGoal and Football Insider previously reported Joel Matip could be axed at season’s end after enduring a torrid campaign. Matip’s deal also expires in 2024, meaning this upcoming summer is the ideal time to cash in while they still can.\nJacobs also noted Gvardiol is targeting a Premier League move when the time does come to leave Leipzig.\nElsewhere, the Times put Man City and Tottenham in the frame. Spurs’ only left-footed centre-back is Clement Lenglet whose loan spell from Barcelona will conclude in June. Ben Davies can play on the left in a three-man backline, though spent the vast majority of his career at full-back.\nHowever, it’s Chelsea who have seemingly taken the lead and they now face a race against time to complete a move before a staggering release clause kicks in.\nWho’ll sign Gvardiol before release clause activates?\nGvardiol was actually in advanced negotiations to join Chelsea last summer. The Guardian reported the Blues tabled a £77.4m bid, though a move obviously did not come to pass.\nGvardiol would ultimately remain in Leipzig and went on to pen a new deal on September 1 that runs until 2027. As part of the agreement, a release clause that’ll activate in 2024 was inserted to the tune of €110m (approx. £97.5m).\nAs such, Chelsea – along with Liverpool, Spurs and City – must all make their moves in the next two transfer windows or run the risk of having to pay almost £100m to sign the centre-half.\nOf course, Leipzig will do everything in their power to convince Gvardiol remaining in Germany is his best course of action. Doing so – at least until the time the £97.5m clause becomes active – would safeguard their position when the inevitable bids are lodged down the line.\nOne sure-fire way to aid their cause in that regard is through being in the Champions League. Leipzig currently reside in the top four in the Bundesliga, though are just a single point ahead of fifth-placed Freiburg.\nIf Leipzig manager Marco Rose has his way, Gvardiol won’t be going anywhere in the 2023-24 campaign.\nVia the Daily Mail, Rose recently said: “Josko Gvardiol will be an RB Leipzig player next season as well.\n“I am the coach and I am asking for that. He is happy here. He said he wants to play in the Premier League but he didn’t say when.”\nWhether Rose gets his wish will hinge on whether the English vultures test Leipzig’s resolve with sizeable bids this summer.",
  "word_count": 610,
  "scraped_at": "2026-02-14T01:46:30.512071",
  "_text_extracted": true
}