{
  "article_id": "32041b219453",
  "url": "https://metro.co.uk/2024/08/13/manchester-united-confirm-matthijs-de-ligt-signing-bayern-munich-21417059/",
  "title": "Manchester United confirm £60 , 000 , 000 double signing from Bayern Munich",
  "date": "20240813T214500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have confirmed the signings of Bayern Munich duo Matthijs de Ligt and Noussair Mazraoui.\nBoth defenders have made the move to Old Trafford in a deal worth up to £60million.\nBayern accepted an offer of £38.6m plus £4.3m in add-ons for De Ligt, who played under United manager Erik ten Hag at Ajax in their run to the Champions League semi-final in 2019.\nThe Bundesliga giants also agreed on a £17.1m fee for right-back Mazraoui who previously played for Ajax as well.\nDe Ligt said: ‘As soon as I heard that Manchester United wanted me, I felt an excitement about the opportunity for a new challenge at such an historic club.\n‘In the conversations that followed, I was impressed by the vision that the football leadership set out, and the role they saw for me in it.\n‘Erik ten Hag shaped the early stages of my career, so he knows how to get the best out of me and I cannot wait to work with him again. I know what it takes to succeed at the highest level, and I’m determined to continue that record at this special club.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nManchester United sporting director Dan Ashworth said of the Dutchman: ‘He has already enjoyed considerable success in his career, and we are convinced that his best years are still ahead; we want to help him achieve them at Manchester United.’\nMazraoui said: ‘It’s an incredible feeling to be a Manchester United player, and I cannot wait to walk out at Old Trafford wearing the red shirt. I know that I’m joining the club at an exciting time; everyone I’ve spoken to has the same ambition for us to win trophies together and I can feel the determination to achieve that.’\n‘Erik ten Hag played an important part in my development as a player, so it is exciting to be reuniting with him as I enter the prime years of my career. I know what he expects from his players, and I will give everything to help the group be successful.’\nAshworth added: ‘Noussair is a dynamic, attacking full-back who can play on both the right and left side of defence. His experience and versatility will make him an excellent addition to our squad.\n‘Having already won a number of trophies in his career, we know that Noussair’s winning mentality will be a real asset to the group as we work together to deliver the success required of Manchester United.’\nDutch defender De Ligt was filmed leaving Munich on Monday morning to fly to Manchester for his medical.\nTen Hag has prioritised strengthening his defence ahead of the upcoming campaign after Raphael Varane left the club and new £52m signing Leny Yoro was ruled out for three months with a broken foot.\nDe Ligt has won several titles during his career, including the Eredivisie with Ajax in 2019, Serie A with Juventus in 2020 and Bundesliga in 2023 with Bayern.\nIn an emotional message to Bayern fans, De Ligt posted on Instagram earlier on Tuesday: ‘I want to thank each and everyone of you for all your love and support. I have spent two amazing years playing for this beautiful club. It has been a true honour to have played for a club like Bayern Munich. We have achieved unforgettable moments together. Winning the title as well as several amazing CL-nights. These memories will stay with me forever.\n‘This is why leaving this club feels bittersweet. I will always remember the love and support I have received from the players, the staff members and from the fans. The recent petition signed by so many of you has touched me deeply.\nMore Trending\n‘Thank you all for the two amazing years. I wish FC Bayern good luck winning many more titles, like Bayern has always done. Mia San Mia.’\nManchester United get the new Premier League season underway on Friday night against Fulham at Old Trafford and both new signings could be involved.\nThe Red Devils are already struggling with injuries at the back before the season has even started, with Leny Yoro, Luke Shaw and Tyrell Malacia all sidelined.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Latest Luke Shaw injury rules him out of multiple Manchester United games\nMORE: Why Aaron Wan-Bissaka thinks swapping Man Utd for West Ham was ‘a no brainer’\nMORE: Luis Enrique sends message to Manuel Ugarte after Manchester United transfer talks",
  "word_count": 805,
  "scraped_at": "2026-02-14T02:08:01.869245",
  "_text_extracted": true
}