{
  "article_id": "320e73294b70",
  "url": "https://www.esquire.com/uk/style/a43493191/graham-potter-chelsea-style/",
  "title": "How Graham Potter Roll Neck Swallowed Him Whole",
  "date": "20230403T121500Z",
  "domain": "esquire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On Sunday, even the Chelsea owners had to call time on their own ill-judged experiment and put Graham Potter out of his misery. Some observers have called his sacking brutal but to Chelsea fans who had been watching the car crash in slow motion, it was overdue. Even Potter had stopped politely asking us to ‘trust the process’. No one in sight appeared to know what it was.\nA 2-0 home defeat to Aston Villa, characterised by yet more odd team selections, out-of-position players and questionable tactics confirmed a head coach incapable of making any discernible headway. Now the holder of Chelsea’s worst managerial record this century, Potter stood on the sidelines with his trademark look of calm confusion, like a dad who’d suffered a flat tyre on the way to swimming and hadn’t brought any snacks.\nFor Chelsea now sitting in 11th, with a negative goal difference, and a half billion pound transfer bill racked up with no discernible strategy, the obvious question is what the hell just happened?\nWhat to Read Next\nIn a quirk of scheduling, Thomas Tuchel was starting his Bayern reign in the same 5.30pm Saturday tea-time slot as Chelsea. As his new team went 3-0 up on rivals Dortmund inside 23 minutes, Chelsea were already a goal down and sinking. The timing only served to highlight what a bewildering decision it had been to sack Tuchel last September in a meeting that reportedly lasted less than five minutes. Now that was brutal.\nCo-owner Todd Boehly, a self-styled no-BS disruptor looking to show European football what it had been missing all these years had clearly fallen for the media portrayal of Potter as a quiet and noble man-manager who deserved a bigger stage.\nBoehly, who also has baseball team the LA Dodgers in his stable, went all-in with the football-meets-Moneyball narrative – he, as the visionary owner taking on the stuffy elite, and Potter as the youngish data-driven coach who would squirrel away on the training pitch. Unlike the strong-willed Tuchel, he was also more likely to toe the line.\nYou can’t blame Potter for accepting a £60m contract which also saw almost the entire staff of Brighton transplanted to West London. Within a week, Chelsea, the most successful English club of this century with a culture that had accrued 18 trophies in that time, had been taken over by a club who had only spent five full seasons in the Premier League.\nFrom his first press conference, Potter had looked ill-at-ease in his new surroundings. A cringey meet-the-team video on his first day at Cobham got alarm bells ringing.\nIt looked like a staff meeting at a secondary school, with Potter as a likeable head of department who also took year 9 PE.\nMuch had been made of Potter having an actual degree in emotional intelligence and yet he often spoke in bland management platitudes. Whereas Tuchel’s post-match interviews were always honest and insightful, Potter’s were dull and evasive.\nBizarrely, it wasn’t long before Potter began using malaprops made famous by his more illustrious predecessors as Chelsea coach. ‘We are not in a good moment’ was a recurring line that came straight out of the Ancelotti and Ranieri ‘lost in translation’ phrasebook. ‘We had to suffer’ was another Potter favourite, probably first introduced to the Premier League by Antonio Conte, again at Chelsea.\nHe appeared to be trying to assume the characteristics of top coaches in an effort to fit in and prove his worth. On the pitch however, Chelsea’s performances were mid-table at best. Did he ever truly believe he was good enough for this job?\nPerhaps in England we are just more comfortable when our top coaches are ruthlessly confident Europeans rather than nice blokes from Solihull. Or perhaps ruthless confidence is a requirement at this level.\nThe writing may have been on the wall as early as October, when Potter appeared on the sidelines with a new haircut, three-quarter length coat, skinny jeans, boots and roll neck. Yes, he had resorted to donning that go-to garment beloved by football managers and Silicon valley CEOs alike.\nHad he really just blown a grand at Reiss in order to prove he was born for this stage?\nSome said he looked good, but it felt contrived. No longer in his trusty Brighton tracksuit, forced to be someone he clearly wasn’t, he appeared more isolated and out of his depth than ever. It was starting to feel like a new series of that old Channel 4 show Faking It.\nAs more and more players arrived in January without Potter seemingly knowing, he seemed as bewildered as the rest of us. Who was choosing these players? Why had they embarked on a total rebuild when Chelsea had won the Champions League as recently as 2021? Was there any discernible strategy other than to sidestep some curious accounting loophole? And why had a coach known for glacially slow improvements at small clubs been hand-picked for the chaos theory that the new ownership seemed to be undertaking?\nAs performances continued to stagnate, the players too must have begun to wonder how long the charade would continue. Potter and Chelsea kept asking for time, but it sounded increasingly hollow.\nSomewhere in Potter’s wardrobe is a pile of Champions League outfits that may never be worn. A lottery win pay-off will surely ease that pain.\nIf the coaching staff appeared to be faking it, now the more pressing concern amongst Chelsea fans is whether the owners are faking it too.",
  "word_count": 920,
  "scraped_at": "2026-02-14T01:53:35.630423",
  "_text_extracted": true
}