{
  "article_id": "32114f5b7e96",
  "url": "https://www.getsurrey.co.uk/news/health/chelsea-thiago-silva-brazil-tuberculosis-31107987",
  "title": "Doctors told me I was weeks away from death at 21 - I ended up becoming football legend",
  "date": "20250301T093000Z",
  "domain": "getsurrey.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Doctors told me I was weeks away from death at 21 - I ended up becoming football legend'\nThiago Silva has enjoyed a glittering career that has seen him win major trophies in Brazil, Portugal, Italy, France and England, but it was almost over before it even began\nThiago Silva will be remembered as a defensive powerhouse and one of the greatest leaders in modern football when he decides to hang up his boots.\nThe 40-year-old has had an illustrious 23-year career that has seen him play for top-tier clubs in Brazil, Portugal, Italy, France, and England, winning trophies at every stop, including seven Ligue 1 titles with Paris Saint-Germain and the Champions League with Chelsea.\nAfter leaving Stamford Bridge as a free agent at the end of the 2023/24 season, Silva returned to his childhood club, Fluminense, last summer, marking a homecoming 15 years after his initial departure. However, many may not know that the legendary captain of the Brazil national team, who has earned 113 caps, almost saw his playing days cut short.\nSilva began his senior club career in 2002 as a defensive midfielder for RS Futebol in Brazil, transitioning to his now-famous centre-back position during a six-month stint at Juventude. His impressive performances led to a move to Porto in 2004, but he struggled to break into the first team, prompting a move to Dynamo Moscow a year later, aged 21.\nHowever, while in Russia, he was hospitalised with a life-threatening case of tuberculosis. Silva spent five months in hospital and was told he would have died if he had been admitted two weeks later. He was advised to have part of his lung removed - a procedure that would have undoubtedly ended his career - but his family objected to the surgery, reports the Mirror.\nThe football legend once shared: \"Every now and then a doctor would come in and give me an injection, three or four times a day, plus 10-15 pills.\" His life and career were dramatically changed thanks to his former Juventude coach, Ivo Wortmann, who located a specialist in Portugal.\nWortmann's decision proved pivotal, resulting in the treatment that ultimately healed the player. The athlete's mother played a crucial role in his return to football following his recovery. Speaking to ESPN Brasil last year while still with Chelsea, he reflected: \"Today, in Brazil, I am considered a crybaby.\n\"I don't think I am better known in Europe than in Brazil, but I believe I am a little more respected here than there. People don't see how strong I was. I fought tuberculosis and almost died. That made me very strong. Crying is not something that weak people do, it's something that brave people do, and I was very brave in my life.\"\nWortmann was again a saviour for him when he brought Silva back to Fluminense in 2006 after becoming coach. There, Silva's skills shone brightly; despite the team's difficulties, he was named one of the best players of the season.\nOver the next three seasons, Silva's recognition soared as Brazil's top defender, leading him to national team call-ups. His renewed success led him back to European football, joining AC Milan in 2009 where he celebrated winning the Italian league in the 2010/11 season.\nA record £38million transfer to PSG in 2012 saw him become the most expensive defender in history at that time, before he went on to serve as the club's longest-standing captain and secure an impressive 23 trophies. His final appearance for the Parisians was in the 2020 Champions League final, where they were defeated by Bayern Munich, a win which would have completed his trophy collection.\nHowever, Silva's career didn't end there. At the close of that season, he made one of the best decisions of his career and joined Chelsea on a free transfer as a 36-year-old veteran. Against all odds, he won the Champions League in his first campaign, featuring in eight European matches, including the 1-0 victory over Manchester City in the final.\nFurther success followed in his second season with the UEFA Super Cup and the FIFA Club World Cup. Despite Chelsea's struggles in subsequent seasons, Silva remained a consistent performer, earning the title of the team's player of the year for 2022/23 and becoming the club's oldest-ever goalscorer in November 2023.\nAfter returning to Brazil, Silva captained his club 15 times in the Brazilian Serie A and four times in the Copa Libertadores last season. He's made four appearances so far in the 2025 campaign.",
  "word_count": 753,
  "scraped_at": "2026-02-14T01:58:05.314651",
  "_text_extracted": true
}