{
  "article_id": "3223f25ee29b",
  "url": "https://arsenalnews.co.uk/2025/09/15/raya-insists-arsenal-are-ready-to-win-champions-league/",
  "title": "Raya insists Arsenal are ready to win Champions League",
  "date": "20250916T020000Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Raya believes Arsenal have the confidence and drive to fight for Champions League glory this season.\nThe Spanish goalkeeper spoke ahead of Arsenal’s opening match against Athletic Club on Tuesday night.\nRaya, who turned 30 on Monday, said the team wants to build on their last campaign. The Gunners reached the semi-finals last season before being knocked out by Paris Saint-Germain.\nSince arriving at Arsenal, Raya has played 100 matches and recorded 42 clean sheets. His consistency has made him a key figure, although he is still waiting to celebrate a major trophy with the club.\nSpeaking to the media, Raya made it clear that the side has one target this year. “We have belief, we want to win,” he said. “We are Arsenal and we play to win. It is not a doubt, that is what we play to do. That is what we play football for.”\nHe stressed that Arsenal are taking each step carefully. “It is a long journey, a long season, in the Premier League and Champions League so we are focused in the present. We want to go higher this season, that is what we want to do.”\nLearning from past setbacks\nWhen asked about the defeat to PSG, Raya explained how the loss had shaped the squad. “That it hurts a lot losing in the semi-final. You get more mature. It is incredible to be here.”\nThe goalkeeper remains positive about Arsenal’s chances this year. He believes the experience of reaching the last four has prepared the squad to go further.\nThis summer, Arsenal added Kepa Arrizabalaga, who joined from Chelsea, to strengthen the squad. His arrival means that for the first time in years, Arsenal have two senior Spanish keepers fighting for the number one spot.\nRaya sees the competition as healthy and necessary for the team’s growth. “Competition is all over the place, you need competition to get out the best [in yourself],” he explained. “Kepa and me, we have a good relationship. It is a pleasure to share dressing room with him.”\nArsenal now begin their European campaign determined to show progress. Raya’s words reflect a team eager to turn ambition into silverware.",
  "word_count": 363,
  "scraped_at": "2026-02-14T02:09:24.925045",
  "_text_extracted": true
}