{
  "article_id": "324be4161c9f",
  "url": "https://www.france24.com/en/live-news/20240430-terzic-repays-dortmund-faith-before-psg-semi-final-clash",
  "title": "Terzic repays Dortmund faith before PSG semi - final clash",
  "date": "20240430T030000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Terzic repays Dortmund faith before PSG semi-final clash\nBerlin (AFP) – Borussia Dortmund coach Edin Terzic faces Paris Saint-Germain in Wednesday's Champions League semi-final first leg enjoying a rare spell of certainty in the job.\nIssued on:\nDortmund's progression to the last four would have been scarcely believable to anyone watching the 2-0 loss at PSG which opened their Champions League campaign in September.\nA string of domestic setbacks including a German Cup exit in December had Terzic on the ropes.\nHe only survived a crisis meeting shortly before Christmas because of Dortmund's improved Champions League form.\nTerzic's side qualified first in a group including PSG, last year's semi-finalists AC Milan and Saudi-backed Newcastle United.\nReaching the semi-finals with wins over PSV Eindhoven and Atletico Madrid has all but guaranteed Terzic will be in the Dortmund dugout next season.\nWhile not all the doubters have been silenced, getting past PSG would make Terzic just the third Dortmund manager, after club legends Ottmar Hitzfeld and Jurgen Klopp, to take the club to the Champions League final.\n'Super impressive'\nTerzic's story is the kind the Dortmund hierarchy, not to mention the club's fans, find appealing.\nHe was born in Menden, near Dortmund, in 1982, just two years after his parents had moved to Germany from the former Yugoslavia.\nThe life-long Dortmund fan attended his first game in 1991 at the Westfalenstadion against Duisburg, aged just nine.\n\"I don't remember much from my childhood, but that was super impressive,\" Terzic told German football magazine 11Freunde in May 2021.\nPictures from the 2012 German Cup final show a boyish Terzic among tens of thousands of Dortmund fans in Berlin's Olympic Stadium.\nOn that day, Dortmund thumped rivals Bayern Munich 5-2 to seal a league and cup double in what was the pinnacle of Klopp's reign.\nAfter playing in the lower tiers of German football, he joined Dortmund as a scout in 2010. Apart from brief spells with Besiktas and West Ham, Terzic has been at Dortmund ever since.\nTaking over as interim head coach in December 2020 and led Dortmund to the German Cup the following May, by which time Marco Rose had been announced as his successor.\nTerzic stayed with the club as technical director and returned to the dugout ahead of the 2022-23 season, this time as head coach on a permanent basis.\nThat season ended with a final-round 2-2 draw to lowly Mainz which cost them the league title on goal difference.\nDespite the heartbreak, Dortmund felt they had their man -- a decision which has paid off, in Europe at least.\n- 'Stay humble' -\nEngland winger Jadon Sancho, who returned to Dortmund on loan in January after an unhappy spell at Manchester United, played some of his best football under Terzic.\nTerzic was central in bringing Sancho, who scored 50 goals and made 64 assists in 137 matches in his first spell at the club, back to Dortmund.\nSpeaking with the UEFA website on Monday, Sancho said \"it's a very nice feeling coming back here.\n\"I have belief in myself again. I heard the crowd screaming my name.\"\nJulian Brandt, another of Dortmund's creative forces, praised the Englishman's skills.\n\"Opposing players respect the name Sancho. What he can do with his feet is unbelievable.\n\"Jadon is skill personified.\"\nSancho, who lifted the German Cup under Terzic, Dortmund's last piece of major silverware, said his side could emulate Klopp's efforts in 2013 and return to Wembley for the Champions League final.\n\"Paris will be a tough test for us. We have to stay humble and give it our all to get to the final.\"\n© 2024 AFP",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:07:51.315631",
  "_text_extracted": true
}