{
  "article_id": "324ec644e6a5",
  "url": "https://www.fourfourtwo.com/quiz/pre-match-poser-no-13",
  "title": "Pre - Match Poser no . 13 : Can you answer this elite - level football quiz question ? ",
  "date": "20260208T101500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pre-Match Poser no.13: Can you answer this elite-level football quiz question?\nA question so difficult that only one per cent of football supporters can answer it correctly\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nTime for a Pre-Match Poser, we reckon.\nRonald Koeman did it as a player and a manager in his home country. Maniche did it as a player in his, too. No one’s ever done it as a player or a manager in England. Where did Edgar Davids do it?\nWe'll reveal the answer this time next week in the next edition of The Pre-Match Poser – stay tuned for that – but for now, here's the answer to last week's conundrum…\nQ. Atletico Madrid did it once and only once. Arsenal did it over two seasons, while Barcelona and Tottenham Hotspur did it for slightly longer. It’s also been a subject in Berlin, Bergamo and Brittany. What is it?\nA. Play home Champions League fixtures at a stadium other than their usual home ground. Atletico Madrid’s 2021 Round of 16 tie against Chelsea saw them host their fixture in Bucharest, while the Blues still got to host their tie at Stamford Bridge. Arsenal relocated to Wembley in 1999 for two campaigns, as Highbury was deemed two small; Tottenham also played at Wembley while their ground was being developed, while Barcelona played at Estadi Olimpic Lluis Companys while Camp Nou was being renovated. Union Berlin, Bergamo-based Atalanta and Brest of Brittany have all had alternative ‘home’ stadiums in Europe, too.\nMore football quizzes we know you'll love\nIf The Pre-Match Poser was too easy for you this week, we have lots more trivia, quizzes and puzzles for you to try, all thanks to Kwizly.\nWe begin with a test of global scale and sporting history. Can you name the 30 most populous countries in the world that have never played at the World Cup? It is a fascinating look at the giants of the map who have yet to conquer the pitch. Once you've navigated the globe, we return to the aesthetic of the game: try to guess the 20 sponsors missing from these shirts – a true test of your commercial memory and an eye for iconic kits.\nFrom there, we look at the men who made history on the grandest stage. Can you name the top 50 Champions League all-time scorers? This list is a definitive \"Who's Who\" of the modern era’s greatest predators. Then, for a test of pure character and biting honesty, we dive into the mind of a Manchester United legend: can you tell us who these iconic Roy Keane quotes were about? You’ll need a thick skin and a long memory for this one.\nTo wrap up your session with some lateral thinking, why not tackle FourFourTwo's Weekend Crossword 39, with clues this week on Panenkas, treble trebles and a very Scilly league? To ensure you stay top of the table, join our newsletter for your daily morning trivia fix, and sign up for free to The Club to earn prestigious badges, participate in exclusive Q&As, and battle it out for dominance on our global leaderboards.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 736,
  "scraped_at": "2026-02-14T01:59:36.840351",
  "_text_extracted": true
}