{
  "article_id": "326f88a91292",
  "url": "https://www.yahoo.com/entertainment/enzo-fernandez-interview-message-chelsea-210154728.html",
  "title": "Enzo Fernandez interview :  My message to the Chelsea fans ? Trust us  ",
  "date": "20230224T233000Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Fernandez interview: ‘My message to the Chelsea fans? Trust us’\nEnzo Fernandez still remembers the times. “Four hours difference in winter, three hours in summer - we knew exactly,” he says, going back to the Sunday mornings where he would get up early and crawl into bed with his dad to watch the Premier League. It was there, drinking Mate – a South American herbal drink –, where he would tune in to see his Argentinian heroes – “Kun Aguero, Carlos Tevez, Higuain…” – but in San Martin, Buenos Aires, those stadiums of Stamford Bridge and Old Trafford seemed a world away. Now, though, it is Enzo Fernandez, a World Cup winner at 22, who stands above them as the most expensive Premier League player of all time.\nAll journeys to the Premier League are remarkable – but Fernandez’s has been defined by an astonishing and dizzying assent. “It’s all gone very, very quickly,” he admits, speaking through a translator – although he has now started English lessons. He is happy to be here at Chelsea although the move to London – a “beautiful city,” he says – with his young family has not been easy. Fernandez is staying in a hotel as he has yet to find a house, but he is settling into his new surroundings following his third move in less than a year.\n“Really,” he begins, “a lot has happened in a very, very short time.” From Buenos Aires, to Lisbon, and now London, and that’s only half of it, too. After winning the World Cup with Argentina and being named the best young player of the tournament in Qatar, Chelsea met Benfica’s release clause of £106m on January’s deadline day to break the British transfer record. Overnight, he became the fifth most expensive player of all time, without even reaching 100 appearances at senior level.\n“It’s something that I take really naturally,” he replies, rolling his neck, unfazed by the question of his record fee and the pressure it could represent. “It’s part of football. The amount of money that is paid has nothing to do with me.” The blonde spikes from his early Chelsea appearances are gone and, dressed all in black, he looks relaxed but – carrying the unquantifiable presence of a World Cup winner. “To repay that, my job is to give my best at all times. I am conscious of the faith Chelsea have shown in me.”\nChelsea’s interest came before the World Cup. They approached Fernandez when he was already on his way to becoming one of football’s most-coveted young stars following his move from River Plate - his hometown club in Argentina – to Benfica last summer. As a £12.3m signing for the Portuguese club, he starred in the Champions League and alerted the attention of Europe’s biggest clubs.\nBut it was at the World Cup where Fernandez’s talent – and value – exploded. When he came off the bench against Mexico to seal a crucial group stage win – following Argentina’s opening defeat to Saudi Arabia – it was only his fifth appearance for his country; he only made his first start for La Albiceleste in the next game against Poland. The goal against Mexico changed everything, not just for Fernandez, but for Argentina too.\nAbove all, though, with Fernandez installed in midfield, Lionel Messi had the platform to win the World Cup for the first time – which for the younger members of the Argentina squad was their biggest source of inspiration in Qatar. “It was a dream, my biggest dream ever really, to play with Messi,” Fernandez says. “To then go on in that team to win the World Cup with Messi, it’s almost like God has given me a huge gift.” Who did Fernandez mean? God or Messi, is there a difference? “No”, he laughs, “maybe there isn’t.”\nIf Fernandez walked alongside God in Qatar, it is Messi’s example that points the way as the 22-year-old approaches this next stage of his career at Chelsea, where he emphasises the importance of self-development and humility despite what he has already achieved.\n“Messi is one of those leaders who are really positive all the time, both in the example he sets in his style of play, but also on a human level,” Fernandez says. “He’s down to earth, humble; he’s grateful and kind. He offers support to everyone within the squad, from the biggest stars through to the youngsters. I felt very conscious that he was with me all the way at the World Cup.”\n“That thing about Messi keeping humble, I know I’m still young and I need to keep learning,” he adds. “I still feel like I’m in a period of apprenticeship, a learning curve.” Winning the World Cup – and tasting the greatest victory there is in the sport at such a young age – has not changed his attitude or mindset: “I think it is just a case of changing the chip in your head,” he says on returning to club football after the World Cup, and the scenes of celebration in Buenos Aires, which resembled an ascension.\n“You never lose that professionalism, that desire, that strength to compete,” he insists. “That’s what’s always signified my style and my play, and my training – wanting to learn, wanting to improve and wanting to be better as a footballer and as a man.”\nChelsea were impressed and convinced by those qualities. In the final hours of the transfer window, Chelsea met Benfica’s release clause and committed to an eight-and-a-half-year contract. “Chelsea were the team that went all out to sign me,” Fernandez says.\nThe final hours of the window were “hectic” and “stressful” – Chelsea had been in for him all month but Benfica refused to sell below the release clause. It was falsely reported that Fernandez missed training in order to force the move through.\n“I just got on with it,” he shrugs, “I kept my head down. I was very happy to have the confidence of a club like Chelsea. When I was told about the project and the plans in place here that really excited me. Now it’s a case of being here, wanting to take Chelsea as far as they want to go.”\nChelsea were among the Premier League teams Fernandez watched in bed on those early Sunday mornings in San Martin, and the image he retained was a club that was “always fighting on all fronts, always involved in the final stages of the Champions League, a club with a winning mentality.”\nHe arrives in London at a strange time, then. His first four appearances for Chelsea have seen two defeats and two draws, not to mention boos and frustration from the stands. Go back further and Chelsea have just two wins in their last 14 Premier League games under Graham Potter. It’s relegation form and Potter is under mounting pressure and criticism, while Chelsea’s season teeters on overturning a 1-0 first-leg defeat against Borussia Dortmund in the Champions League.\nIt’s certainly not what you would expect after spending £600m on new players – of which Fernandez was the centrepiece – but is perhaps what may follow after such a significant number of new arrivals.\n“Football is football,” he suggests. “When you get that amount of young lads and we’ve all had 20 days to get to know each other on and off the field, it’s hard to gel as a team. It’s just a case of being patient and we will get to know each other. That’s football.”\nThat is football, after all, where you can go from lifting the World Cup in Qatar and returning to Buenos Aires a hero – celebrated by millions on the streets – to being booed off at Stamford Bridge following a defeat to Southampton.\nFernandez has – quite literally – signed up for the long-term project at Chelsea but there is pressure to produce results now. Fernandez in his early displays for Chelsea has looked to take responsibility in possession. He has arrived at a team that looks short of leaders, but Fernandez seems prepared to step up immediately.\nHe has struck up a connection with the on-loan Joao Felix – “let’s hope that Chelsea can do all they can to keep hold of him come June,” he says, “that would be great” – and it is in those flashes and messages that offer hope to Chelsea fans, despite the team’s form. Chelsea travel to Tottenham on Sunday, ahead of a home clash against Leeds and the return leg against Dortmund on 7 March. If results don’t pick up, the project Fernandez has committed to could be heading for a drastic early change.\n“My message to the fans would be to trust us,” Fernandez says. “Trust the players, trust the backroom staff, trust the manager. Because we are all moving in the same direction. We have got a lot of new faces here and it is a restructuring of the club really and the playing staff. I would encourage them to be patient. Don’t forget we know we are representing them and we are giving everything that we have for them. We are going to be trying to be winning games, starting on Sunday. Then, we can start to turn things around.”",
  "word_count": 1552,
  "scraped_at": "2026-02-14T01:55:49.888828",
  "_text_extracted": true
}