{
  "article_id": "32716ec83862",
  "url": "https://thenationonlineng.net/caf-award-will-lookman-win-or-face-injustice/",
  "title": "CAF Award : Will Lookman win or face injustice ? - The Nation Newspaper",
  "date": "20241216T214500Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nDecember 16, 2024 by David Bolarinwa\nCAF Award: Will Lookman win or face injustice?\nThe CAF Player of the Year award is the most prestigious individual honor in African football, celebrating the continent’s top talents.\nDespite its anticipation, the award ceremony has often faced controversy and assertions of favoritism, with some claiming it overlooks deserving talents.\nAdemola Lookman for Nigeria\nAdemola Lookman, Nigeria and Atalanta’s goal poacher hopes to hear his name announced as the winner tonight. Lookman has been outstanding and a player of grit.\nHis two goals secured Nigeria’s quarter-final spot during the 2023 AFCON, and his decisive goal against Angola in the quarterfinals propelled Nigeria to the semifinals.\nThis stellar performance made Lookman Nigeria’s top scorer in the tournament, earning him significant praise for his contributions in the knockout stages.\nAdemola Lookman for Atalanta\nLookman has been a key player for Atalanta in Serie A and European competitions. In the 2023/2024 season, he showcased his attacking brilliance, contributing significantly with goals and assists. His adaptability, work rate, and ability to produce game-changing moments have been crucial for Atalanta, particularly in high-stakes matches.\nLookman scored a remarkable hat-trick in the 2023-24 UEFA Europa League final, leading Atalanta to a 3-0 victory over Bayer Leverkusen and their first European title. This victory marked Atalanta’s first-ever major continental honor in their 117-year history.\nHe scored 17 goals and provided 10 assists across all competitions for Atalanta during the 2023/2024 season.\nAdemola Lookman’s consistency and versatility\nLookman’s ability to perform consistently at both club and international levels highlights his exceptional talent. Whether playing as a winger or forward, he excels in delivering goals, creating opportunities, and supporting defensive responsibilities when needed.\nThis versatility sets him apart from other contenders. As of December 10, 2024, Lookman has scored 13 goals and made 5 assists for both club and country.\nClub: 12 goals in the Champions League, UEFA Supercup, Serie A, and friendlies\nNational team: 1 goal in friendlies\nIf consistency, impact in major tournaments, and club achievements are key criteria for the award, Ademola Lookman’s performances place him among the top contenders for the African Player of the Year award.\nRumors of Achraf Hakimi To Be Named Winner\nRumors of Achraf Hakimi potentially being crowned the 2024 winner ahead of Ademola Lookman is currently circulating like fire in harmattan.\nHakimi’s excellent performance can only be attributed to Paris Saint-Germain (PSG) where he secured domestic titles such as Ligue 1 and the French Super Cup\nHowever, the early exit of Morocco in the 2023 AFCON places him at great disadvantage to winning the articulate award.\nArguably, Hakimi doesn’t seem to have to complete criteria to win the title.\nThe only way Hakimi’s name will be revealed as the winner depends on the weight given to tournament achievements versus consistent performances across the season.\nPlayers Who Arguably Have Been Robbed Of CAF POTY Award\nAustin Jay-Jay Okocha – 1998\nRead Also: All eyes on Lookman as 2024 CAF Awards hold in Marrakech\nSammy Kuffour – 1999\nMohamed Aboutrika – 2008\nThe CAF awarding committee, notably having blood on their hands and will be at the center of intense scrutiny, with all eyes on them for any errors or controversies that may arise.\nWill Ademola Lookman be crowned Africa Player of The Year?\nBe there!\n2024 CAF Awards\nDate: Monday, December 16, 2024\nVenue: Palais des Congres, Marrakech, Morocco\nTime: 7 PM local time (18:00 GMT / 19:00 WAT / 20:00 CAT / 21:00 EAT)\nHow to watch CAF Awards\nCAF’s YouTube channel: CAF TV\nSuperSports",
  "word_count": 592,
  "scraped_at": "2026-02-14T01:52:10.155700",
  "_text_extracted": true
}