{
  "article_id": "32846068c867",
  "url": "https://theathletic.com/4695993/2023/07/19/manchester-united-scandinavian-fanbase/",
  "title": "Inside Manchester United huge ( and growing ) Scandinavian fanbase",
  "date": "20230719T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are huge in Scandinavia. The official supporters’ club has 46,000 paid-up members, most of them in Norway — a country of only five million people.\nLast July, United made a summer trip to Oslo, the Norwegian capital, to play a pre-season friendly against Atletico Madrid, and they returned this month for another warm-up fixture against old foes Leeds United.\nAdvertisement\nThe Athletic was there too, and we spoke to Scandinavian fans to find out why they started supporting United, how following a club from afar works, and what they expect from them in the coming season.\nGO DEEPER\nWayne Rooney - The Ornstein interview: Glazers, Kane, Greenwood, Messi, MLS, Everton and more\nSo, why Manchester United?\nMadelene Stolpe: I grew up with a dad supporting United, so I have followed them since I was a toddler and never looked back. In Norway, the English (top division) has been shown on TV since 1969. We did not have access to Norwegian football, only English, and therefore the English teams have massive support in Norway.\nIvar Aune: I was seven when I fell in love with United. All our little teams were named after big international clubs and mine was Manchester United. I quit (playing) football because they kept sticking me in goal as I was tall, but, while my parents had no interest in football, I didn’t quit United. I saw a documentary about Munich (the 1958 air disaster that killed eight United players and three staff members) as a child too, which made an impact.\nGO DEEPER\nA tribute to Harry Gregg: ‘In the still hours before the world awakes, I often see their faces. They are all young men. We all are’\nMats Hornlund: I started seeing the youngsters coming through in 1992-93 — I was a teenager watching them on Swedish TV. Before that, I’d supported local Swedish teams. I met my wife in the mid-’90s and we had kids, so I didn’t go to Old Trafford until 2015. I’d watched friendly games, like United against Barcelona in Gothenburg in 2012.\nBjarte Valen: My dad was a United fan, going back to 1958. He was taken by the Munich air disaster. With me, I remember the games being on television at 4pm on a Saturday. Dad always said, ‘We support the team with the red shirts,’ and it went from there. If we were lucky, United was the chosen game. There was one game per week. My hero was Bryan Robson who carried United for years. I had a soft spot for the goalkeeper, Gary Bailey, too. My mum and dad came back from England one year and brought me the kit. I was nine, it was the 1985 kit and you didn’t see them in Norway. Radio started to be a popular way of getting games in the early ’90s, but the (advent of the) Premier League changed a lot. People managed to see games on TV far more.\nWhat have been your highs or lows?\nMadelene: The Treble season, with the late winner at Camp Nou, is hard to top. I think I cried for two hours after the game and wore United gear to school for the rest of the year. My first trip to Old Trafford, in 1997, when I was 14 years old and had saved all my pocket money for two years to be able to go, is also a definitive high. I was so emotional walking into the stadium, which I still am to this day. All the fantastic people I have met and friends I have made through my love for United is a third high. In terms of lows, the day Sir Alex (Ferguson, the club’s long-time, hugely successful manager) retired caused a lot of tears. Being at Old Trafford for the 0-5 defeat to Liverpool (in 2021) was my worst matchday experience and a huge low. And as with many other supporters, it pains me to see how the ownership affects the club.\nIvar: The Champions League (final) win in 2008. As for a single match, I was there for the 8-2 versus Arsenal and next to the travelling fans. I got a bus in Manchester after the game which was full of Arsenal fans. I kept quiet.\nGO DEEPER\n'Humiliation isn’t the word for it' - Manchester United 8-2 Arsenal, told by those involved a decade on\nBjarte: Camp Nou in 1999, but I wasn’t there. The 1983 FA Cup final replay. I wasn’t there either, as I was seven. My parents wouldn’t let me watch it (it was on a school night), and I still haven’t forgiven them. I told the story to a lot of the players who played in that side and they laugh. These were the people who turned me into a United fan. I watched United several times in Norway, first in 1992 in the pre-season before winning the league for the first time in 26 years. I first went to Old Trafford to see a game against Arsenal a couple of years after that – and I still remember that after seeing hundreds of games live.\nWhat do friends say about you supporting an English team?\nMadelene: Most Norwegians with an interest in football have an English team, so that is not looked badly upon at all. After decades of following United, I have got lots of friends supporting United, and for those who don’t there is a lot of more or less friendly banter and discussions. Those of my friends with no interest in football have a hard time understanding my priorities, though. When I turn down or arrive late to weddings, baptisms and birthdays because there is a game on, I have had a few friends shake their heads in disbelief.\nAdvertisement\nIvar: I live in Stavanger now (a seven-hour drive from Oslo) and went to see the local team, Viking, for a few seasons. I had a season ticket but didn’t fall in love with them at all and stopped going. English football is really popular in Norway because we’ve had live matches since we’ve had TV (here). There wasn’t much conflict with the Norwegian league because we play in the summer (due to the climate) and England plays through winter. Also, a lot of Norwegians have played in England. Players like Ole Gunnar Solskjaer, who I loved, not just because of him as a player but as a person too. He didn’t return to Norway and drive a Ferrari around while messaging the most famous Norwegian models, like some. It was sad to see him struggle as a manager but in the end I was surprised that they (United) kept him on. I couldn’t see a way out for him towards the end, the players looked like they didn’t give a shit.\nBjarte: A lot of English clubs are popular. The following for United is huge in Norway and has been since the mid-’70s. There’s still big support for teams like Leeds, who were big in the ’70s. Tottenham and Arsenal are popular too. Norwegian fans are passionate, honest and dedicated. A lot go to Old Trafford on a regular basis. It’s becoming trendy to support a Norwegian team now in Norway, with your English team coming second, but for me it has never been like that.\nHow do you watch United matches?\nMadelene: I try to get over to Old Trafford once a month, and have done so for a number of years. When I am not in Manchester, I usually meet up with fellow Reds in Oslo at our local pub, The Scotsman. We are a good crowd gathered there every game, doing build-up interviews, singing and occasionally having guests over to watch the game with us. On the rare occasions I can’t make it there, I will watch the game through the Norwegian broadcaster and follow the build-up on MUTV. I never miss a game.\nMats: I’ve had a season ticket for four seasons. It’s a bit crazy. I live in Sweden, and Covid meant I couldn’t leave Sweden. I can’t get to every game but I try and go when we have two home games in a few days. There’s a direct flight from Gothenburg once a week which can have really cheap tickets, but it’s out Sunday and back Wednesday. So I can spend £5 for a flight, or £350. United are not as popular in Sweden as in Norway, but the club are still big. We have an official supporters’ club in Gothenburg with over 150 paid-up members. We watch games at a pub when we’re not in Manchester. We put our flags in the window — it’s great. I don’t want to mention them, but Liverpool are more popular here, but we now have more in the pub for our games than they have. Interest increased a lot when we signed Zlatan (Ibrahimovic, Sweden’s greatest-ever player). And now we have (Swedish defender Victor) Lindelof, but we’ve never met him and I don’t know if he knows whether we exist.\nOslo, it was a pleasure once more! 🫶\n❤️ Until we meet again… #MUFC || #UnitedForTheFans pic.twitter.com/snK2qiXtKo\n— Manchester United (@ManUtd) July 12, 2023\nWhat do you think of Manchester as a city?\nMadelene: I am probably very biased, but I love Manchester. Over the 25 years I have been coming over, the city has evolved so much. In my opinion, Manchester has got it all: great restaurants, bars and pubs, friendly and outgoing people, nice and diverse neighbourhoods, great venues for music and theatre, and, obviously, the best football club in the world. What’s not to like?\nAdvertisement\nIvar: I first went in 2007 and went three times that season. A lot of matches were boring under Ferguson, United just controlled the game. I’ve been three to six times every season, except for the Covid years. We go for two or three nights and love the place. Somebody said Manchester is a city where they think tables are for dancing and I liked that. There’s something about the people and the atmosphere, a good nightlife and restaurants. It has changed a lot since I first visited, with a lot of gentrification in places like the Northern Quarter and Ancoats.\nMats: It’s great. It reminds me of Gothenburg in some ways: a working-class city, we both have the trams, both cities love football. People here remember IFK beating United in ’94, with Jesper Blomqvist (who would later play for United too). We have found some pubs in Manchester where we know people. What we do is a way of living. My wife has the same interests, she likes to travel too. We go for football, but we also go to visit the pub and see friends. We are not football tourists.\nHow are you feeling about the coming season?\nBjarte: You would anticipate Chelsea, Liverpool and Tottenham to bounce back this season, but I believe United will be better as well and get closer to (Manchester) City and Arsenal. Another trip to Wembley would be great, but consistency is the key. I am really looking forward to seeing what United can do in the Champions League and would not be surprised if (manager Erik) Ten Hag’s team will reach the last four.\nMadelene: It’s hard to tell while the squad is still being built but I think we’ll get second in the league, semi-finals in the Champions League and one domestic cup. I do like Ten Hag. He has impressed me in a sense that he seems to have a clear vision. He makes tough decisions and isn’t afraid to rule people out when that’s best for the team. If he gets the right backing, I think he can take us back to where we belong.\nGO DEEPER\nWatching Manchester United win a cup from Qatar, home of their would-be owners\nMats: I don’t think we’ll win the league, but give it a few years. At least I hope.\nIvar: I was very happy after last season. United looked like a team again under a manager that dared assume control where others before him perhaps bowed to the senior stars. United played highly exciting football at times. I’m sure the team will take new steps this season. I’m hoping for second (place in the Premier League) and a cup success. I don’t think United are at the level City are at. I’m also sad to see (long-serving goalkeeper David) de Gea leave. I understand the rationale, but it was poorly handled in so many ways, especially considering his status — a four-time player of the season and Golden Glove winner last season. I’m excited about (signing Chelsea and England midfielder) Mason Mount. Always liked him. He’ll nick the ball off anyone and be creative with it. A new striker in and some dead wood out and Manchester United will be competitive again.\n(Top photo: United fans at the Oslo friendly against Leeds; Ash Donelon/Manchester United via Getty Images)",
  "word_count": 2169,
  "scraped_at": "2026-02-14T02:07:08.864403",
  "_text_extracted": true
}