{
  "article_id": "32c157def37b",
  "url": "https://www.techradar.com/streaming/entertainment/how-to-watch-barcelona-vs-inter-for-free-on-tv-tonight",
  "title": "How to watch Barcelona vs Inter for free on TV tonight",
  "date": "20250430T173000Z",
  "domain": "techradar.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How to watch Barcelona vs Inter for free on TV tonight, team news\nBarcelona and Inter have the Champions League's top attack and top defence\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nHow to watch Barcelona vs Inter on TV tonight\nThe most prolific attack and the meanest defence in the UCL face off tonight, as Barcelona host Inter at Montjuïc in their Champions League semi-final first leg.\nThese teams are the polar opposites of each other, so we're expecting a fascinating clash of styles. Whereas Barcelona play an extremely high-risk brand of football, banking on scoring a goal more than they concede, with Inter it's safety first.\nWith Robert Lewandowski still injured, Ferran Torres spearheads a three-man attack, with Pedri and Dani Olmo sharing No.10 duties. Marcus Thuram is fit enough to start for Inter, but Benjamin Pavard is out of action.\nFans in Ireland are amongst the luckiest in the world, as they can watch Barcelona vs Inter for FREE on RTE2 and RTE Player. Live coverage starts at 8pm BST / 7.30pm IST.\nThe RTE stream is free in Ireland but blocked to those abroad. So, if you're away rom Ireland at the minute, you'll need to unblock RTE Player with with NordVPN. Scroll down for more details.\nIn the UK, Barcelona vs Inter is live on Discovery Plus Premium. A subscription costs £30.99, and includes everything on TNT Sports. You also have the option to add the sports package to your EE, BT or Sky broadband deal from £16 per month.\nSoccer fans in the US can catch Barcelona vs Inter on Paramount Plus (7-day free trial). The stream taps the CBS Golazo coverage, with punditry from the likes of Thierry Henry and Micah Richards. Plans cost from $7.99 a month (Essential package), or $12.99 (ad-free and bundled with Showtime). US fans can also watch Barcelona vs Inter live on Fubo with a 7-day free trial.\nIt would be fitting for an Italian team to pick the key to Hansi Flick's gameplan. Barca have conceded 17 goals in the Champions League this season – for context Inter have allowed just five – but they've lost just seven of 53 games across all competitions. Raphinha and Lamine Yamal have formed an almighty double-act, but Torres is no Lewandowski.\nLautaro Martinez doesn't get many chances, but he's been clinical in Europe, scoring in each of his past five Champions League appearances. Simone Inzaghi won't be taking any unnecessary risks.\nYou can watch Barcelona vs Inter for free here on RTE Player and Belgium's RTL.\nHow to watch Barcelona vs Inter with a VPN\nAlthough Barcelona vs Inter is free to watch on RTE Player, the service is only available in Ireland.\nFootball fans traveling or working outside Ireland will need to use a VPN to access the free Champions League first leg streams tonight.\nThere are lots of VPNs but NordVPN is one you can rely on to unblock and stream the soccer like a pro.... and you can save 72%.\nSAVE: 72% off our No.1 VPN for streaming\nTraveling abroad and locked out of your usual streaming service? Use NordVPN to watch your usual Barcelona vs Inter stream from anywhere, with plans starting from around $2 a month with this deal. We test all the providers and we rate NordVPN as one of the best VPNs for safer browsing and easy access to your favorite streams.\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nTom is a journalist, copywriter and content designer based in the UK. He has written articles for What Hi-Fi?, T3, ShortList, The Sun, The Mail on Sunday, The Daily Telegraph, Elle Deco, The Sunday Times, Men's Health and many more. His specialities include the streaming services, mobile technology and electric vehicles.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 742,
  "scraped_at": "2026-02-14T01:52:20.884081",
  "_text_extracted": true
}