{
  "article_id": "32c3bd0fea4e",
  "url": "https://www.theguardian.com/world/2023/may/18/first-edition-national-conservatism-conference",
  "title": "Thursday briefing : Three days that proved the radical right has a hold on the Tory party",
  "date": "20230518T063000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning from the heart of the tradition-wrecking, history-hating, white-marginalising, slavery-weaponising, penis-misattributing, anonymously tweeting, culturally Marxist, vandalistic, narcissistic, paganistic, children’s-soul-destroying, anti-marriage, overpopulated, under-reproductive, suicide-inducing, totally normal society of excess that is Britain.\nNot my views, to be clear, but those of the speakers at the National Conservatism conference in London that ended last night. A number of them are senior Tory MPs, and they seem to find very little to like about this country. They also say that you’re the one that hates it.\nNow our long National Conservatism conference nightmare is over. By and large, the response to the dizzying intensity of the views aired at the conference has been one of amazement – but in truth, nothing that has come out of the mouths of Conservative politicians and their outriders over the last few days is anything new.\nFor today’s newsletter, I spoke to Cas Mudde, a political scientist at the University of Georgia in the US and leading expert on populism and the radical right, about how this tendency took root in Britain’s governing party – and how it’s still thriving in a country it says has gone to the dogs. Here are the headlines.\nFive big stories\n-\nClimate crisis | Temperatures are almost certain to rise by more than 1.5C above pre-industrial levels by 2027, scientist have warned. While breaching the 1.5C threshold could have dire consequences, the change should be temporary. However, it would represent a marked acceleration of human impacts on the global climate system, the UN said.\n-\nPolitics | Rishi Sunak has been accused of being out of touch with ordinary families after claiming people’s household incomes were “hugely outperforming” expectations despite the cost of living crisis. On a flight to Japan for the G7, Sunak said there were “lots of signs that things are moving in the right direction” with the economy”.\n-\nSewage | UK water companies have apologised for repeated sewage spills and pledged to invest £10bn this decade in an attempt to quell public anger over pollution in seas and rivers. The companies will triple their existing investment plans to fund the biggest modernisation of sewers “since the Victorian era”.\n-\nBrexit | Three big global carmakers have called on the UK government to renegotiate the Brexit deal, saying rules on where parts are sourced from threaten the future of the British automotive industry. Ford and Jaguar Land Rover joined Stellantis, which owns Vauxhall, Peugeot and Citroën, to warn the electric car transition could be delayed without changes to tariff rules.\n-\nMonarchy | Prince Harry, Meghan and her mother, Doria Ragland, were involved in a “near catastrophic” car chase in New York after being followed by paparazzi, the duke’s spokesperson has said. There were no reported collisions, injuries or arrests, police said, while a taxi driver who drove the trio said they were followed but he would not describe it as a chase.\nIn depth: ‘The Conservative radical right were once at the margins – it looks different today’\nDespite its name, the National Conservatism Conference (NatCon) has nothing to do with the Conservative party – organisationally, anyhow. Instead, it’s the latest in a series of gatherings organised in the US and Europe by the Edmund Burke Foundation, with ties to a panoply of influential Trump-supporting groups in the US. Speakers at previous iterations have included far-right European leaders like Italy’s Giorgia Meloni and Hungary’s Viktor Orbán, and US rightwingers like Tucker Carlson, Ted Cruz, and Ron DeSantis.\nThe organisers have an avowedly nationalist agenda. Their view is that “the traditional beliefs, institutions, and liberties underpinning life in the countries we love have been progressively undermined and overthrown”. They describe themselves as opponents of “globalism” who view “the Bible [as] our surest guide, nourishing a fitting orientation toward God”, prize “the traditional family, built around a lifelong bond between a man and a woman”, reject “ever more radical forms of sexual licence”, and call for much more restrictive policies on immigration.\nEven a few years ago, the Conservative party’s leadership viewed this rhetoric as toxic: when backbencher Daniel Kawczynski attended a 2020 conference in Rome attended by Orbán and Meloni, he was ordered to apologise. This year, at least seven Tory politicians attended without rebuke, including the home secretary.\n“There is a very long tradition of the radical right within the Conservative party,” said Cas Mudde, whose book The Far Right Today is an essential guide to the mainstreaming of a previously marginalised tendency. “But they were always at the margins. And it was a bit of an old-fashioned far right, out of an elitist tradition. It looks very different today.”\nHere are some of the ways Mudde’s thinking helps make sense of the conference.\nTory MPs aren’t fascist – but some of them are on the radical right\nTerms like “populism”, “far right”, “radical right”, “extreme right”, and “fascism” get thrown around so much as to be useless at best, and actively confusing at worst. But they aren’t the same, and knowing how they differ is helpful to understanding what’s going on.\nMany people associate populism with the far right, but Mudde says while that can be true, it’s also too simple: he is renowned for his argument that populism is a “thin” ideology. (Here’s a great 2019 long read setting out the history of debate over the term.) “It has a narrow scope,” he said. “It sees society as divided between two antagonistic groups: the pure people and the corrupt elite. But that can be combined with socialism, as in Venezuela, or nativism, as it is on the right.”\nWhether it’s populist or not, there are some consistent features across the far right: it tends to oppose immigration, fear threats to security and national identity from – among others – migrants and the left, believe in a hidden corrupt establishment, and worry that transnational bodies threaten national sovereignty.\n“Within that, you have the extreme right – which is the opposite of populism, which believes in a small elite that is pure and is fundamentally opposed to democracy – and the radical right, which does believe people should elect their leaders, but has problems with aspects of liberal democracy and the rights of minorities.”\nWhen people call Tory MPs “fascists”, who would be categorised on the extreme right, that’s wrong: they do still believe in democracy. But there are many whose stated views place them firmly in the radical right category.\nThe radical right has been mainstreamed – and its proponents have a ‘reputational shield’\nRead extracts of speeches from NatCon and you will find a litany of views that are unmistakably radical – but also considered unexceptional enough to avoid criticism from Rishi Sunak.\nMiriam Cates MP said that “cultural Marxism is systematically destroying our children’s souls”, using a term with deep antisemitic roots that, as sociologist Huw Davies told Peter Walker, “implies that these institutions need to be restored to purity, need to be cleansed”. Danny Kruger MP warned of a “weird medley of transgressive ideas that is now threatening the basis of civilisation in the west” and said the “normative family” with a “mother and father” is the “only possible basis for a safe and successful society”. And Suella Braverman attacked “experts and elites” and suggested that immigration risked being a “recipe for communal disaster”.\nThat’s before you get on to the views espoused by others at the conference, like historian David Starkey’s suggestion that the left is seeking to “replace the Holocaust with slavery” as a subject of collective grief and warned of the “symbolic destruction of white culture”. Politicians of a different stripe might face intensive questioning over why they had shared a platform with such a speaker.\nThese MPs are protected by their party’s institutional heft and our expectations of who is on the radical right, Mudde suggests. “Someone like Marine Le Pen – she is treated as a fascist because she came out of the radical right from the beginning,” he said. That is part of why rhetoric that was once deemed shocking when it came from the BNP, say, can now emerge from a Conservative MP and barely make the news.\n“Here you have politicians with a ‘reputational shield’ from their party. They are established actors with personal connections who don’t look like the cliche, dated image that we have – I tell my students all the time that your average person on the radical right looks like the person sitting next to you. The current UK government is really a unique specimen in that it is one of the most nativist governments that we have – and it’s also, by far, the most ethnically diverse government that Europe has ever seen.”\nThis is a bubble – but a powerful one\nPoll after poll suggests that these politicians are not in tune with the British public, who are typically more sympathetic to immigration, less agitated about “wokery”, and utterly unconcerned about threats to the “normative family”. Ask the average person what they think of cultural Marxism and they’ll probably think you’re referring to an obscure punk band.\nSo why is this viewed as fruitful territory? In short, because the real audience is the rightwing media. “There are now politicians whose main base is not in the party or in its membership, it’s in the media. They are feeding this weird animal. Everybody speaks about a ‘liberal bubble’ – but this is a bubble too. It’s going to blow up, and the question is simply whether they can still profit from it, or are they too late.”\nThere may be some staying power in the fact that politicians like Braverman do not rely on “establishment” conservatives for their influence. In a prescient 2021 piece contrasting Boris Johnson with Donald Trump, Mudde wrote that Johnson was “the voice of both the establishment and the anti-establishment” and that his “rootedness in Britain’s elite culture and society … propelled him to power but will also lead to his downfall”.\nBraverman is more like Trump – which is to say, more authentically in conflict with the establishment – but that inspires a hardcore of dedicated supporters formed more in opposition to shared enemies than by a coherent, positive case.\n“When you listen to the NatCon speeches, there is something about what they stand for, but there is always more about who they are fighting. So long as there is a broader rightwing infrastructure that creates this warped stereotype of the ‘woke left’, you can get by.”\nThe radical right’s influence could paint the Conservatives into a corner\nThat may work for now; it may even propel someone like Braverman to the Conservative leadership. But it also stores up trouble.\n“You end up feeding an anti-democratic sentiment that distrusts every element that you need to run a liberal democracy, from state institutions to expertise to compromise,” Mudde said. “And you may create a base that is more radical than you are. Look at the US. In the Republican party, the old elite has just moved with the times. They see the practical problems of this uncompromising bent. But they know that if they break with it, they lose their power.”\nWhat else we’ve been reading\n-\nBritish eggs now cost almost a third more than they did a year ago. Sam Wollaston makes a very entertaining visit to a poultry farm (above) to find out why the supermarkets are to blame, as well as Vladimir Putin. Archie\n-\nArwa Mahdawi looks at why US rightwing pundits are melting down over beer and the great lengths they will go to attack the individuals who they believe are behind the “woke” ads. Nimo\n-\nIt’s easy to get wrapped up in the self-indulgent side of life, writes Elizabeth McCafferty. But in an attempt to realign her priorities, McCafferty spent a week in a nunnery to see if she could find alternative ways to become more fulfilled: “My stay at the abbey might just have been the path to contentment I didn’t realise I needed so much.” Nimo\n-\nWho knew that Wu-Tang Clan’s GZA was also a massive speed chess fan? Jo Khan’s report from a Melbourne tournament, and Christopher Hopkins’ great photos, are a revelation. Archie\n-\nStuart Heritage tested how good AI’s current writing talents are by asking ChatGPT to rewrite and mimic some of the biggest television moments. The results are not compelling to say the least. Nimo\nSport\nChampions League | Manchester City swept Real Madrid aside to secure a place in the Champions League final against Inter with a 4-0 win on the night – 5-1 on aggregate. Goals from Manuel Akanji, Julian Alvarez, and two from Bernardo Silva secure the victory. Jonathan Liew wrote: “It was probably City’s greatest performance under Pep Guardiola, a kind of footballing perfection.”\nFootball | Ivan Toney will not play again for Brentford or England this year after he was banned from football for eight months for 232 breaches of the FA’s rules on betting. Campaigners criticised the striker’s punishment given football’s sponsorship deals with gambling firms, with pressure group The Big Step saying: “If you force young people to endorse addictive products, don’t be surprised if they use them.”\nCricket | Jonny Bairstow feared he might not be able to walk again after his horrific leg break while playing golf, he has said in an interview. Asked if he now believed he could replicate his stunning form of last summer, he said: “Of course, because I have some very fond memories and some very real experiences.”\nThe front pages\nThe Guardian print edition today leads with “PM accused of being ‘out of touch’ over cost of living”. The Telegraph’s top story is “Massive cost of obesity to the NHS is revealed” – that’s also on the front of the Times, though the lead is “Water firms’ £10bn plan to prevent sewage spills”. Much is made of the Harry and Meghan “car chase”, with air quotes generally used around those words. It’s our picture lead, and it’s the splash in the i which says “New York ‘car chase’ sparks royal security row” as well as in the Metro which has “Harry and Meghan in paparazzi ‘car chase’”.\n“Rishi raises hope of tax cuts before election,” says the Daily Express, while the Daily Mail splashes with “Now the Starmer mask slips on Brexit” – it reports he wants to renegotiate the EU trade deal. Funny they should mention that: the Financial Times says “German carmakers press for delay in Brexit rules on tariff-free access to UK”. The Daily Mirror’s cover story is “Hospital horror: Police probe into 19 suspects over hundreds of drug deaths” – here is our version.\nToday in Focus\nCan Imran Khan really take on the Pakistani army and win?\nThe former prime minister has blamed the country’s powerful military for his arrest last week, and his supporters have attacked military buildings. With Khan’s home surrounded by police yesterday, has he picked a battle he’s destined to lose?\nCartoon of the day | Steve Bell\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nLuul Siciid Jaamac is the chairperson of a frankincense sorting collective called Beeyo Maal in Somaliland which empowers about 280 women to run their own business in the male-dominated frankincense industry. Women rarely own frankincense trees in Somaliland, meaning they rarely have agency over the labour and are relegated to sorting, which is one of the lowest-paid positions in the industry.\nTogether with the other women she works with, Jamaac hopes to sell their product more widely online – and even internationally. Being a part of this collective gives them the chance to take control. Things are not perfect, wages are still low and hours are long, but “at least this is ours”, Jaamac said.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day – with plenty more on the Guardian’s Puzzles app for iOS and Android. Until tomorrow.",
  "word_count": 2691,
  "scraped_at": "2026-02-14T02:24:42.735847",
  "_text_extracted": true
}