{
  "article_id": "32cebd4d6121",
  "url": "https://www.nytimes.com/athletic/6160973/2025/02/27/bayern-munich-125-anniversary-kane-muller-us/",
  "title": "Bayern Munich at 125 : The past , the present and the future of a German powerhouse",
  "date": "20250227T073000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A few streets from Munich’s Odeonsplatz, away from the marble lions guarding the steps of the Feldherrnhalle and under the shadow of the Theatinerkirche’s sunshine-yellow towers, there is a monument to a place that no longer exists.\nMuch of Munich was damaged during the Second World War. Many of the street names have changed and the buildings that could not be restored have been forgotten, along with whatever took place inside them.\nAdvertisement\nCafe Gisela is long gone. From the few drawings that exist, Gisela was grand, with white tablecloths and high, patterned ceilings. And on the place where it once stood, there is now a bronze plaque mounted on a marble obelisk. It bears the Bayern Munich crest and displays the club’s founding document, signed by the first 17 members on February 27, 1900.\nOn this day 125 years ago, 11 members of Manner-Turn-Verein 1878 (MTV) left a club meeting and headed out into the city night. They were from the football division of what was, as the name suggests, principally a gymnastics club.\nTurnen was not gymnastics as it is today, but more a group of physical activities aimed at promoting physical fitness, unity and nationalist spirit. But it was much more popular than football at a time when the game imported from England was looked down upon and treated with suspicion.\nThat explains why, when MTV’s football players wanted to stage competitive games instead of friendlies, the rest of the club were aghast at such competitive instincts.\nSo the 11 footballers left the meeting and convened at Gisela, forming what would become one of the biggest football clubs in the world.\nBayern have won 32 Bundesliga titles since the competition’s inception in 1963. They are a six-time European champion and their greatest players — Franz Beckenbauer, Gerd Muller, Sepp Maier — are annotations within the history of the sport itself.\nBut today, Thomas Muller is what the club sees when it looks in the mirror.\nMuller was born in Bavaria, grew up a fan and has been at Bayern since he was 10. In September 2024, in a game against Freiburg, he made his 710th appearance for the club, becoming their leading appearance maker of all time.\n“My childhood was red, right from the beginning,” he tells The Athletic at the club’s Sabener Strasse headquarters. “My grandfather was a big Bayern fan. I never met him because he died before I was born, but I think he was the founder of the fan community in my family. So, my cousins and also my mother, they were all red.”\nAdvertisement\nMuller is 35 and this might yet be his final season before retirement — a decision on that is imminent — but he has always been an old head; he’s comfortable talking about the past and present and there is no sense of any shutters going up with the media.\n“My first memories of football were in 1996, with the European Championship in England, but I was very young, maybe six years old. I also remember the UEFA Cup win (against Bordeaux) in 1996, but I didn’t get a sense of what the club was at that time. I was too small. I would see the games and be in the stadium with my cousins when they took me with them, but I didn’t have the bigger picture of the club.”\nThat bigger picture has changed, era by era.\nBayern won their first national title in 1932. The year before Adolf Hitler became chancellor, the club — with a Jewish president, Kurt Landauer, and Jewish coach, Richard Kohn — beat Eintracht Frankfurt 2-0 in Nuremberg to become German champions.\nKohn left for Switzerland after the Nazis seized power. Landauer, who had joined the club as a player in 1901, became the longest-serving president in the club’s history across three different spells, interrupted by national socialism.\nSix years after seeing Bayern lift the Viktoria Trophy in Nuremberg, Landauer was arrested and detained in Dachau concentration camp for a month. All of his relatives who remained in Germany were murdered in concentration camps.\nHe managed to flee the country, spending the war evading the secret police in Switzerland, and then returned to serve a final term between 1947 and 1951, helping his club back to its feet.\nLandauer is a principal character in the Bayern story. The period that helps to define the club in the modern sense — the path to their dominance of domestic football and success in Europe — would not really begin until the late 1960s.\nAdvertisement\nGerman football was late in adopting professionalism and the modern Bundesliga, which replaced the regional Oberliga system, did not come into being until 1963. When it began, Bayern were — controversially — not elected in for its inaugural year and would not win the competition for the first time until 1969.\nThe 1970s were a golden period led by Maier, Beckenbauer and Gerd Muller, the club’s immortals, who won three consecutive European Cups. The 1980s brought more domestic success, albeit in a national game that was waning in popularity. The 1990s saw Bayern as FC Hollywood, the tabloid monster, with players as celebrities, filling the front pages as well as the back.\nAnd then there is the modern era and the unprecedented success that began in 2012 and ended with 11 straight titles, finally interrupted by Bayer Leverkusen in 2024.\nDuring that period, Thomas Muller became entwined with the club, defining what it is to be a Bayern player. His longevity matters — he made his debut in 2008 — as does his background, but he represents a set of ideals, too.\nOn the pitch, Muller has extracted the absolute most from his ability, almost willing himself to stardom for the team he grew up supporting. Twelve Bundesliga titles, two Champions League wins, a World Cup and 134 caps for Germany later, his appetite for success and response to it have never changed.\nMuller is startlingly normal. He trains hard, he plays hard, he goes home — to his wife, to his horses, and to his life in the Bavarian countryside. There is no ego or any affectations and Muller is as far from the high-gloss footballing stereotype as it is possible to get.\nAs, in some ways, are Bayern. The club’s success is a natural selling point, but what they truly sell abroad is themselves — Bavaria.\nWhen Landauer was president, he saw the club as a way of promoting the region and, albeit more subtly, that remains true.\nGiven the idiosyncrasies of Bavaria — the history, its conservative and religious personality, the preservation of its traditional customs — does the club’s popularity surprise Muller?\nAdvertisement\n“Not really because we are a very big brand for Germany,” he says. “And when you look to Asia, I think, the Asian image of Germany is Bavaria. So, it’s Oktoberfest and the mountains. Maybe they admire Germany because of the development and maybe also of the economic side.\n“I think there are a lot of reasons you would want to follow Bayern Munich, not only because we have great players and have been very successful, but because we are a little bit of a special club, also very successful and very consistent, in the top 10 or top five in Europe.\n“Maybe we’re a little bit different?”\nDifferent how?\n“It’s difficult to describe. I grew up on the land, in the countryside of South Bavaria, south from Munich. In Munich, there is a strong economy, which means people are used to work and effort being a reason for success.\n“And I have the feeling that while Bavarians know how to have success, they know how to enjoy it, too.” He says that through a rascal smile.\nThis is Thomas Muller. Mischievous and quick to laugh. He has a serious side, too, though, and you can hear it when he talks of Bayern’s culture — of the internal, familial atmosphere that many clubs claim but which anyone associated with Bayern mentions.\n“I don’t know if we are more of a family than other clubs,” Muller says, “but we make a big effort to remain true to our roots, maybe a bit more than other big football clubs.\n“Bayern was founded in 1900 and its development has always been led by football people and maybe that gives it a stronger bond to the region of Munich and to the local fans. At the same time, we are a big football club and we love to share our club also to all fans in the world. So, we love being a global club, but we also take care of where we come from.”\nTraditionally, as Bayern’s founding members were in 1900, football teams in Germany belonged within multi-sport clubs that were run by amateurs, in a Corinthian spirit. In 1998, in concession to the growing commercialism within football across Europe, that changed.\nAdvertisement\nThe 50+1 rule, as it is commonly known, allowed football departments to separate and become public limited companies, generating the financial means to compete. But with a provision: 50 per cent of the controlling shares — plus one — had to remain in the hands of the original members.\nUnusually, given that European football has become a playground for investors and a tool for states armed with sovereign wealth funds and their own agendas, Bayern supporters retain agency over how their club is run.\nAnd Muller’s point is a good one: former players are responsible for what the club is today — it is a footballer’s football club.\nBeckenbauer, who died in 2024, is the most important German footballer of all time. He is also a former Bayern head coach and, between 1994 and 2009, served as the club’s president.\nKarl-Heinz Rummenigge was one of the great forwards of the 1970s and 1980s, but became a vice-president in 1991, before serving as a long-time CEO.\nUli Hoeness, who won three Bundesliga titles with Bayern in the 1970s, as well as the World Cup with West Germany in 1974, is a two-time former president and, following the end of his playing career, was the club’s most successful business manager. Hoeness was later president and retains the honorary role, but he was the original architect of a commercial strategy that, today, allows Bayern to remain a European powerhouse.\nOutside their own fanbase, that success does not make them popular in Germany.\nThe 10 highest-paid players in the league all play for Bayern. Their transfer record is €95million (£78.7m; $99.6m). The most any other club has ever paid for a single player is €43m. Resentment is natural, but Bayern have those advantages because of their success and how they have been run, not because they have been endowed with an oligarch’s wealth or a country’s resources.\nAdvertisement\nThat €95m transfer record was set in 2023 when England captain Harry Kane joined from Tottenham.\nBayern needed a goalscorer to replace Robert Lewandowski, who had left for Barcelona 12 months earlier, and Kane was searching for the major honours that had eluded him at Spurs. He was drawn to Bayern’s scale.\n“From the outside looking in,” he tells The Athletic, “I always had the impression that it was a big, big club.\n“They had won a lot and had a good winning culture year after year. You see the trophies, the consistent dominance in the Bundesliga, and the decent runs in the Champions League, and you know this is a club that demands success. I also saw a club with a rich history, a real sense of tradition, and a connection to its fans.”\nIt was still a moment nobody expected. Firstly because, while wealthy in relative terms, Bayern have rarely shopped from the highest shelf in the transfer market. Nine European clubs have signed players for more than €100m, several on more than one occasion, and Bayern are still not among them.\nIn fact, they have only bought six players for €50m in their history.\nIt by no means makes Bayern a pauper. Especially not given they are supported by muscular minority partners, with Adidas, Allianz, and Audi each holding an 8.33 per cent share in the club, but there is this sense of two battles being fought: one at home, for which they are equipped with great advantages, and another abroad, for which they are not as well-armed.\nWhen Kane was unveiled as a Bayern player, Jan-Christian Dreesen, the CEO since 2023, was sat next to him at the Allianz Arena. He characterises the balance that the club must find.\n“We have to stay true to our principles: financial sustainability and sporting excellence,” says Dreesen.\n“Competing with clubs backed by sovereign wealth funds is a challenge, but we focus on our own strength. And when players like Harry Kane, captain of the English national team, join FC Bayern Munich, it means that we have what it takes to attract superstars.”\nKane was a star of the game and a natural asset for the team, but he was also reassurance.\nGO DEEPER\nPremier League clubs would love to bring Harry Kane back to England. He'd be mad to indulge them\nGerman clubs are politically sensitive and being member-run creates accountability that stretches beyond wins and losses. In 2023, the club announced that a controversial commercial partnership with Qatar Airways would not be renewed, having provoked significant supporter protests on account of the country’s human rights record.\nAdvertisement\nThe weekend before the club’s anniversary, during a 4-0 win over Eintracht Frankfurt, the club’s ultras protested a sponsor agreement with Visit Rwanda. Indifference to that country’s human rights record would be tantamount to “giving away the club’s values” read the banners in the Sudkurve.\nDreesen’s task is to navigate the path. His job, he says, comes with “immense responsibility”.\n“The club is a global powerhouse and a national institution, which means every decision is scrutinised. Football as a sport is worth billions, but we must never forget our fans because they are the core of this club. My job as CEO is also to create a balance that ensures we remain one of the best clubs in the world, but also stay true to our great fan base and stick to our core values.\n“The family character of this club, the humanity, the togetherness as a team, must never be lost.”\nIn a way, Bayern being anchored in tradition made the Kane transfer more curious — at least in the cultural sense. He was born and raised in north London and is by no means an extrovert. It was difficult to imagine him in his new environment, yet his adaption has been a surprise.\n“The club made me feel at home from the very beginning,” he says. “From the moment I arrived with my family, they have gone above and beyond to make us feel welcome. This was my first professional move abroad and I hadn’t quite anticipated how much work is involved in moving to a different country. But the club has been very supportive and it’s been an incredible experience for my family and me.”\n“Of course, there have been some adjustments, such as learning a new language. I’m gradually picking it up and I have one lesson a week. The culture is a bit different, too, but it’s been interesting to learn about it and we’re embracing it as a family.”\nAdvertisement\nWithin his first few weeks, the club filmed a vignette in which Muller, very much the club elder, taught him how to eat Weisswurst (Bavarian white sausage) properly.\nIn an Audi advert on German television, Muller teases Kane for his lack of German and his misunderstanding of the Munich geography. And, as is traditional for all Bayern players, Kane and his wife, Kate, appeared at the annual Oktoberfest, dressed in Tracht and Dirndl, the traditional costume worn for the occasion.\nBayern is not a club for those who do not want to embrace local customs — the player must adapt to the club, not the other way around — but Kane’s assimilation has been easier than even he expected.\n“One of the biggest surprises was how quickly I settled in,” he adds. “Slowly but surely, though, it starts to feel like home.\n“People ask what the big differences are, but a lot of the routine is pretty much the same. You miss friends you have at home or the golf course back there, but you soon learn about those things here and it becomes part of your home. I’m really enjoying my time here.”\nDreesen has his eyes on the future and Bayern’s long-term place in the sport.\nThis summer, they will take part in the inaugural Club World Cup in the United States and, while the sporting merit of the tournament is questionable, it’s clear how much importance Bayern are attaching to the occasion.\n“Global competition is intensifying,” Dreesen says, “and the U.S. market is a key focus for us. Since opening our New York office in 2014, we’ve grown a strong fan base with nearly 100 fan clubs in North America — which is more than any other European team. So the FIFA Club World Cup 2025 and FIFA World Cup 2026 are historic opportunities because football has never had more momentum in the U.S..\n“This is an opportunity we must not miss.”\nAdvertisement\nAgain, that popularity in the U.S. is intriguing. How, given the advantages held by other super clubs competing for that attention — with brighter stars, cooler brands and, in some cases, the platform of the more popular Premier League — do Bayern stand out in that crowd?\n“Success is a major factor,” explains Dreesen. “After winning the European Cup (before its rebranding as the Champions League) three times in a row from 1970 onwards, FC Bayern was finally established as one of the world’s top clubs. We are a global brand yet deeply rooted in Bavaria — just like the Oktoberfest.\n“We also had some interesting players from the U.S. at our club, such as Julian Green, Chris Richards or U.S. record goalscorer Landon Donovan, even if he was only with us for a short time. We had players like Gina Lewandowski and Sarah Hagen from the USA in our women’s team, and we have just loaned Ana Guzman to Utah Royals in the USA.”\nWith his dark-rimmed glasses, his white shirt and his well-cut suit, Dreesen is a European football executive from central casting. But despite being born in northern Germany, he grew up a Bayern supporter and still indulges the mystique of the club, like any other fan.\n“FC Bayern is like home to me,” he says. “I’ve been at the club for over 12 years and couldn’t imagine a better place. There’s always something magical when passion, enthusiasm and professionalism come together. That’s how great things are created.”\n“We have a saying for it: Mia san Mia. It means we are who we are.”\nMia San Mia is an expression that was popularised in Bavarian politics in the 1960s. As Uli Hesse, the football historian, wrote in Bayern: Creating a Global Superclub, “The term stands for pride and self-assurance, for the conviction that you are first and foremost a Bavarian, a German second.”\nAdvertisement\nOver the past 40 years, Mia San Mia has grown into a club motto. It is stencilled onto the seats at Allianz Arena and on Bayern’s website there are 16 principles describing what it means — we are tradition, we are role models, we are history and so on.\nWhen Beckenbauer died a year ago, Hoeness memorialised his team-mate and friend, saying: “Franz was the first to embody ‘Mia San Mia’, and that is also the obligation of all Bayern generations that follow: to always believe in yourself, be strong and at the same time be down to earth and to always want to win — and to stay true to yourself.”\nAsk individual supporters to explain it and they will be similarly abstract and personal. Mia San Mia, to them, captures the sweet spot between confidence and arrogance, or humility and the need to win. Ask 100 different Bayern fans and you will get 100 different answers.\nAnd perhaps that’s the real success; the real triumph of what was started 125 years ago by the 11 footballers who struck out on their own.\nAfter the Bundesliga titles, the European Cups, the devastation of the war and the dynastic success the club rode into the stratosphere during the 1970s, it remains vast, dominant, and economically formidable — but still all different things to all different people.",
  "word_count": 3437,
  "scraped_at": "2026-02-14T01:58:05.332183",
  "_text_extracted": true
}