{
  "article_id": "32ed3dbcc86b",
  "url": "https://www.themag.co.uk/2025/09/the-vitality-stadium-now-awaits-bournemouth-v-newcastle-preview-newcastle-united/",
  "title": "The Vitality Stadium now awaits - Bournemouth v Newcastle preview",
  "date": "20250921T081500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Vitality Stadium now awaits – Bournemouth v Newcastle preview\nWelcome to the Bournemouth v Newcastle preview.\nSunday 21st September – A 2pm kick-off.\nAfter European exploits midweek, the Toon get back to League action this weekend when making the long trip down to Bournemouth.\nThe travelling Toon Army will be hoping their early start is rewarded with three points and a place in the upper echelons of the league table.\nBournemouth however will be desperate to continue their fine start to the season having had the luxury of a full week off.\nThis is yet another Toon match selected for live TV, unbelievably twelve of the next fourteen fixtures in all competitions will be available to watch legally in the UK.\nForm\nNewcastle have played five matches so far this season, four in the league and one in Europe. We’ve won one match, drawn two and lost two, scoring four goals in the process and conceding five. A huge win this weekend could see us in the top six depending on results elsewhere, as Eddie Howe once again looks to mastermind qualification for the Champions League.\nBournemouth have also played four league games as well as one in the League Cup. They’ve enjoyed a fine start to their season, winning three league games. They sit fifth in the league on nine points and a win over the Toon could see them second in the league depending on results elsewhere.\nLast time out\nNewcastle hosted Barcelona on Thursday night in an explosive atmosphere and really took the game to their illustrious opponents in a first half that saw good chances for both Gordon and Barnes that weren’t taken. Unfortunately, a Rashford brace at the start of the second half looked to have knocked the stuffing out of United who pushed for a toehold in the game without ever really looking like they believed it was possible. In the last minute of normal time, intricate passing amongst the midfield led to Jacob Murphy presenting Gordon with a chance to force home a consolation but seven minutes of injury time didn’t see a famous equaliser and the Toon lost the match 2-1.\nBournemouth hosted Brighton last weekend meaning they’ve enjoyed an extra four days rest going into this one. They took an early lead before being pegged back but showed good spirit to go on and win the match 2-1.\nStat attack!\nSeven Premier league trips to Bournemouth have seen two wins, four draws and just the one defeat for United\nThe Toon have only played ten competitive matches away at Bournemouth, scoring in eight of them.\nNewcastle have netted eleven Premier League goals away to Bournemouth.\nMemorable match\nNewcastle travelled to Bournemouth in 2015 and managed to come away with the win despite being completely outplayed for almost the entire match. The Toon managed only two efforts on goal compared to Bournemouth’s twenty but pinched the points when Perez scored from the only one that counted. His first-half effort, coupled with a number of world class saves by Toon stopper Rob Elliot, ensured a happy journey home for the travelling Toon Army who had set off at an ungodly hour for this early kick off. This was our first away victory under Steve McClaren but Eddie Howe’s cherries would get their revenge in the return match when a 3-1 defeat for the Magpies meant he was sacked soon after. Final Score – Bournemouth 0-1 Newcastle\nPlayed for both\nSylvain Distin had a very promising start to life at NUFC, having played twenty-eight matches during a loan spell in 01/02 when Sir Bobby’s attacking side swash buckled their way to Champions League qualification. After a number of outstanding performances, the scene was set for him to become a fixture in our first team for years to come.\nUnfortunately, at the conclusion of his loan deal he decided to sign for newly promoted Manchester City, claiming the move was nothing to do with inflated wages and was actually due to career development. He was subsequently mocked and ridiculed by Toon fans in every appearance against us. He moved on to Portsmouth and Everton before ending his career with twelve appearances for Bournemouth.\nMatt Richie played for Bournemouth between 2012 and 2016 and scored thirty-one goals for the cherries. In 14/15 he was voted the football league’s player of the season in a poll by ‘Four Four Two’ magazine. He signed for the Toon in 2016 and became an integral part of our midfield as we achieved promotion back to the Premier League under Rafa Benitez. He stayed for eight years and scored twenty-five goals. His last goal for the club came in injury time against Bournemouth when they visited St James’ Park in February 2004, as he rescued a 2-2 draw and celebrated in his usual style by booting the corner flag.\nCallum Wilson was a Bournemouth player for five years before signing for the Toon in 2020. He scored sixty-one league goals for the cherries and is fondly remembered for being the top scorer in their promotion campaign of 14/15.\nHe netted forty-seven league goals in a five-year period at NUFC that was often disrupted by injury. Having been named player of the year for 20/21, he was rewarded with the famous number nine that he wore with pride throughout the remainder of his time at United. Highlights include a memorable brace in a 4-1 win away at Everton and breaking Alan Shearer’s club record for goals in a single month, when scoring eight in April 2023 to push the Toon towards Champions League qualification.\nManagers\nEddie Howe after a 2-1 defeat at home to Barcelona:\n“The process is the same. I don’t think there are massive new learnings. The biggest issue is psychological rather than physical — the high of tonight, the emotion, and then having to go again in a tough away league game. That’s the challenge – every European team faces it, and that’s why these campaigns are harder than just Premier League football. This will be our first test of that this season, and hopefully we can rise to it.”\nAndoni Iraola Sagarna after a 2-1 victory over Brighton:\n“Very happy with the win because we value this win against a very good team. The game went some moments for us, for them. It was not clear what was going to happen at the end. It’s a good start, its a good amount of points but still we have our moments. We will make mistakes. We need to build still. Everyone is getting more minutes but every game is costing us a lot. We are managing well but if we don’t keep the focus these small details can go the other way. We have to stay humble”\nCharity\nAs it is an away match, Newcastle United fans will not be collecting opposite the Gallowgate end, for the food bank. However, you can still help out and all online cash donations are very much appreciated. For further info and/or to donate to the food bank online go HERE.\nPrediction\nThis is a tough one to call. Bournemouth have enjoyed a good start to the season and have had the luxury of a full week off. The Toon battled hard against Barcelona midweek and were unlucky not to open the scoring in a dominant first half. Woltemade started that one on the bench and I fancy him to not only be back in the starting line, up but also provide the key to the three points with two well-taken goals. Bournemouth 0-2 Newcastle.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1277,
  "scraped_at": "2026-02-14T02:21:48.752945",
  "_text_extracted": true
}