{
  "article_id": "32efcf6e64c9",
  "url": "https://www.jdsupra.com/legalnews/advertising-for-risky-investment-7084652/",
  "title": "Advertising for Risky Investment Services on the Sidelines | DLA Piper",
  "date": "20250304T000000Z",
  "domain": "jdsupra.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "[co-authors: Mathias Kuhn, Juliane Souweine]\nThe commitment of partners to the Paris 2024 Olympic and Paralympic Games of up to EUR1.2 billion1 shows the enthusiasm of brands for sports sponsorship.\nBesides the association of values, the involvement of employees or the funding of the organization of a sporting event, sponsorship attractiveness is justified by the offering of increased visibility and opportunities for brand activations. The TV audience for broadcasts of sporting competitions and the visibility generated by these events and their participants (particularly clubs and athletes) necessarily sponsorship a mode of communication that can be considered as advertising. Although advertising and sponsorship are distinct legal concepts, sponsorship contracts do not have their own legal regime, so it is necessary to refer to the legal regime applicable to advertising.\nThis is exactly what the French Competition and Consumer Protection Authority (DGCCRF) did in its decision of January 2nd, 2025 issuing an injunction to Canal+ Group to stop broadcasting images of the shirts worn by players of the Berner Sport Club Young Boys Swiss football team (Young Boys)2. The decision was prompted by the presence of the team's main shirt sponsor, the investment group Plus500 (Plus500 Ltd), whose business includes the marketing of risky financial products, even though advertising for such products is prohibited3.\nIn 2018, two other broadcasters were sanctioned for broadcasting the Europa League final between Olympique de Marseille and Atletico Madrid, which also featured Plus500 as a shirt sponsor. Following an identical injunction from the DGCCRF, the broadcaster stopped broadcasting matches where a team had such shirt sponsor4. This solution has also been adopted by Canal+ for the Swiss club's forthcoming matches.\nADVERTISING REGULATIONS\nAdvertising in France is regulated. Such regulation applies to the content of advertising messages, to their medium and purpose. This regulation is supplemented by professional ethical recommendations issued by the French Self-Regulatory Professional Advertising Authority (Autorité de Régulation Professionnelle de la Publicité – “ARPP”). These recommendations aim at self-regulation of the advertising sector and are mainly based on the International Chamber of Commerce's Advertising and Marketing Communications Code.\nFairness and intelligibility obligations\nAll advertising must comply with the principles of fairness and intelligibility, i.e. the advertising message must be clearly identifiable as such, legible, intelligible and in French.\nAbove all, the advertising message must be informative for the recipient and not misleading, otherwise it may be considered as misleading commercial practice5 punishable under French consumer law6.\nProhibition of advertising of risky financial products\nAdvertising is highly regulated in certain areas, including financial products. The French Monetary and Financial Code and the French Financial Markets Authority (Autorité des Marchés Financiers – AMF) set forth specific obligations for the advertising of financial products7: presentation of the risks associated with the contracts, presentation of rates, legibility, etc.\nHowever, advertising (and therefore sponsorship) related to financial products considered as highly speculative and risky for the public is prohibited8. The financial products covered by this prohibition are those referred to in article L. 533-12-7 of the French Monetary and Financial Code, i.e. “investment services relating to financial contracts that are not admitted to trading on a regulated market or a multilateral trading facility”. This includes contracts for which:\n- the maximum risk is not known at the time it is entered into;\n- the risk of loss is higher than the amount of the initial financial contribution;\n- the risk of loss in comparison with the corresponding potential benefits is not reasonably comprehensible in view of the specific nature of the financial contract9.\nThe products offered by Plus 500, shirt sponsor of the Young Boys which is the subject of the DGCCRF injunction, fall within the purview of this prohibition.\nThe prohibition applies not only to companies offering investment services, but also to all those involved with the display of this type of promotional content. With regards to specific sports regulations, the French Football League (Ligue de Football Professionel – LFP) also prohibits football clubs from marking sports equipment (e.g., players' shirts) with any illegal content10.\nAll players in the “advertising chain” may be sanctioned by an administrative fine of up to EUR100,000, regardless of the medium, when the public is affected11. Generally, the DGCCRF adopts a graduated approach, first requesting the offending company to comply with the law, if the company is in breach for the first time, and only considers imposing penalties if the company fails to comply to the order.\nOUTLOOK FOR DEVELOPMENT\nIncreased vigilance regarding the advertising of financial products\nAdvertising of alcohol brands is also strictly regulated under French law. However, with regards to advertising of alcoholic beverages, the French Regulatory Authority for Audiovisual and Digital Communication (Autorité de Régulation de la Communication Audiovisuelle et Numérique – ARCOM (formerly CSA)) adopts a softer approach in case of audiovisual broadcasts of foreign multinational sport events (i.e. matches whose images are intended to be broadcasted in many countries and which are therefore not primarily aimed at the French public). Thus, within this framework only and subject to certain strict conditions, broadcasters may not be sanctioned for broadcasting images containing advertisements for alcoholic beverages because they “do not control the shooting conditions [and therefore] cannot be suspected of leniency with regard to the litigious advertisements”12.\nIn the case of Canal+ and the broadcast of the Young Boys’ matches, the Champions League could be defined as a foreign multinational sport event within the meaning of the ARCOM. However, with regards to advertising of risky financial products, the trend does not seem to lean towards flexibility. On the contrary, the increasing cooperation between the AMF and the ARPP regarding financial product advertising suggests that the authorities are becoming more vigilant13.\nAI as a solution for broadcasters?\nIn its decision of July 13th, 2023, confirming the sanction taken by the DGCCRF in 2018 against one of the broadcasters of the Europa League final, during which a team with Plus500 as its shirt sponsor was playing, the Administrative Court of Cergy-Pontoise emphasized the absence of “alternative technical means enabling (...) the matches in question to be broadcast without the players' shirt sponsors appearing in the image”14.\nTherefore, in order to avoid the loss of revenue suffered by the broadcasters of sporting competitions while ensuring compliance with French advertising regulations, the development of artificial intelligence solutions enabling the live blurring of the logos of partners whose advertising is not authorised in France would be a solution for the future.\n1 For domestic partnerships only.\n2 i.e. broadcasting two matches live and posting highlights of these matches on the website.\n3 Also main partner of Polish football club Legia Warsaw and official worldwide partner of the Chicago Bulls NBA franchise.\n4 The Italian team Atalanta Bergamo's league matches for the 2022-23 season (from November 2022) and all their league and Europa League matches for the 2023-24 season were therefore not broadcasted. Similarly, the Champions League matches of the Young Boys for the 2023-24 season have not been broadcasted.\n5 Art. L. 121-1 et seq. of the French Consumer Code.\n6 Art. L. 132-1 et seq. of the French Consumer Code.\n7 Art. L. 533-11 to L. 533-22-4 of the French Monetary and Financial Code; AMF General Regulation in force at 06/12/2024.\n8 Law no. 2016-1691 of December 9th, 2016, on transparency, the fight against corruption and the modernisation of economic life; art. L. 222-16-1 and L. 222-16-2 of the French Consumer Code.\n9 The ban also applies to cryptoassets under certain conditions specified in Article L. 222-16-2 of the French Consumer Code following the transposition of European Regulation (EU) 2023/1114 of 31 May 2023 on cryptoasset markets.\n10 Art. 575, LFP Competition Regulations 2024/2025.\n11 Art. L. 222-16-1 of the French Consumer Code.\n12 ARCOM, Code of conduct for the retransmission of sports events with advertising panels for alcoholic beverages.\n13 AMF, L'AMF et l'ARPP renforcent leur collaboration en faveur d'une publicité claire et responsable dans le domaine des produits financiers, 21/07/2022.\n14 TA Cergy-Pontoise, Ch. 4, 13 July 2023, no. 2306997.\n[View source.]",
  "word_count": 1330,
  "scraped_at": "2026-02-14T02:14:59.441732",
  "_text_extracted": true
}