{
  "article_id": "32f9038f9185",
  "url": "https://www.caughtoffside.com/2025/05/24/man-united-consider-sale-bruno-fernandes/",
  "title": "Man United have a condition to sell Bruno Fernandes this summer",
  "date": "20250524T153000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following the defeat in the Europa League final, the future of Bruno Fernandes at Manchester United has become uncertain.\nThe Red Devils are facing issues on and off the pitch at the moment with their failure to qualify for Europe set to have serious financial consequences for the club.\nTheir form in the Premier League has been disastrous this season with United currently sitting in 16th position and set to finish in their worst ever position in the competition.\nBig change are needed at the club and summer transfer targets have already been identified.\nMan United are ready to make big changes\nRuben Amorim is set to reshuffle his attack with the Red Devils interested in a move for Wolves attacker Matheus Cunha as well as Ipswich Town striker Liam Delap.\nClub captain Fernandes has been linked with a move away from Old Trafford with Saudi side Al-Hilal ready to offer him a lucrative financial package.\nAlthough the Premier League giants would want to keen him at the club but according to GiveMeSport, they are ready to let the Portuguese midfielder leave the club this summer if Al-Hilal or any other club can match their asking price for the 30-year-old midfielder.\nMan United may be open to parting ways with Fernandes if an offer exceeding £100 million is tabled, as per the report.\nInternally, there’s growing recognition that the club’s failure to secure European football has made them more vulnerable to transfer interest from ambitious suitors eyeing a marquee signing.\nClubs across Europe have reportedly been alerted to United’s uncertain position, viewing the situation as a rare window of opportunity to test the club’s resolve with a significant bid.\nThe possibility of losing Fernandes is no longer off the table, especially if the offer is deemed sufficient to support a much-needed squad overhaul.\nBruno Fernandes faces an uncertain future\nTheir failure to qualify for the Champions League next season has hit them hard financially and that could result in the sales of some key players.\nFernandes himself fueled speculation about his future by refusing to commit to staying at Old Trafford next season.\nWhile he reiterated his love for the club, the Portuguese international stopped short of providing any firm assurances.\nThe midfielder remains under contract until 2027, with an option to extend by an additional year, giving United a strong negotiating position. However, should a club arrive with an attractive offer, Fernandes could be saying goodbye to United soon.\nMan United keen on signing 17-goal Premier League star following Europa defeat",
  "word_count": 422,
  "scraped_at": "2026-02-14T01:49:39.548224",
  "_text_extracted": true
}