{
  "article_id": "32fdb1a81717",
  "url": "https://www.aol.co.uk/eddie-howe-urges-newcastle-ruthless-101007492.html",
  "title": "Eddie Howe urges Newcastle to be ruthless this summer amid spending challenges",
  "date": "20250502T103000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe urges Newcastle to be ruthless this summer amid spending challenges\nEddie Howe has urged Newcastle to be ruthless this summer as their Premier League competitors attempt to comply with spending rules.\nTwelve months ago, the Magpies found themselves reluctantly having to sell Elliot Anderson to Nottingham Forest and Yankuba Minteh to Brighton in order to comply with profitability and sustainability restrictions (PSR), a process they achieved with literally minutes to spare to avoid a points deduction.\nThis time around, they are in a significantly-stronger position ahead of the June 30 deadline, having not made a major signing in three transfer windows and – amid suggestions that the likes of Aston Villa, Bournemouth and Forest may have to sell in order to comply – Howe wants the club to be ready to pounce.\nHe said: “The PSR deadline plays a huge role for clubs – both those clubs with PSR issues and those without – because those without may potentially look to try to sign players.\n“They will look to take advantage of other clubs, as clubs did to us last year, quite rightly.\n“It’s a really interesting dynamic and one that we’re really aware of and that we’ll try to use to our advantage if we can.\n“I can’t go into the details of that, but no doubt we’ve got people at the club who are working very hard behind the scenes on it.”\nEddie Howe on our remaining fixtures:\n\"You want to be in control of your destiny. I think with four games to go we are, but we're very aware it can change in one round of games. There's no let up for us. Our run of results has been impressive but what we don't want to do is tail… pic.twitter.com/uX3TqXW24n\n— Newcastle United (@NUFC) May 2, 2025\nThe Magpies head for Brighton on Sunday still sitting third in the table and knowing Champions League qualification remains in their hands, albeit with a difficult run of fixtures to come.\nThey will have European football next season regardless of what happens during the remainder of the campaign – their Carabao Cup final success came along with a Conference League place – while a place in Europe’s biggest club competition would not only help to attract summer targets, but might also persuade their biggest names to remain on Tyneside.\nHead coach Howe has spent much of the campaign seeing speculation that Alexander Isak, Bruno Guimaraes, Sandro Tonali and Anthony Gordon could be prised out of St James’ Park this summer, but while every player has his price, the 47-year-old remains committed to adding to, rather than depleting, his carefully-assembled squad.\nHe said: “We want to keep our best players, I think I’ve made that very clear. That’s not just the wish from me, that’s the wish from everyone at the club.\n“I don’t have a crystal ball, I can’t sit here and say what’s going to happen. I can only say what my determination is and it is to build a team, the best team possible and to do that, you can’t consistently lose your best players.”\nHowe’s recovery from pneumonia has continued this week – “I wouldn’t say at my 100 per cent fitness, so I probably won’t be starting myself on Saturday, but I’m getting there,” he said with a smile – but he confirmed midfielder Joelinton was unlikely to play again this season after visiting a knee specialist.",
  "word_count": 573,
  "scraped_at": "2026-02-14T02:15:07.785594",
  "_text_extracted": true
}