{
  "article_id": "332508270eaf",
  "url": "https://www.nytimes.com/athletic/6206804/2025/03/16/haji-wright-usmnt-pochettino/",
  "title": "Haji Wright hat - trick gives USMNT coach Mauricio Pochettino timely reminder of his talent",
  "date": "20250316T150000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino is dealing with a shortage of USMNT forwards due to injury, so Haji Wright picked a good time to remind the national team manager of his quality in front of goal with a hat-trick for Coventry City.\nWright, who has been working his way back to full fitness after an injury to ligaments in his right ankle kept him out for almost four months, scored all of Coventry’s goals in their impressive 3-0 victory over Championship promotion rivals Sunderland on Saturday.\nAdvertisement\nHis first hat-trick in English football grabbed the headlines and came just days before U.S. thoughts turn towards their Concacaf Nations League playoffs week in Los Angeles.\nThe 26-year-old, who was born in Los Angeles, did not make Pochettino’s squad for the four-team showdown involving Canada, Mexico and Panama, because of his recent injury. He was one of a number of strikers unavailable to Pochettino, who is without some key players at the top end of the pitch.\nRicardo Pepi is expected to miss the rest of the season after undergoing meniscus surgery following a knee injury he picked up while playing for PSV against Liverpool in the Champions League in January, while Monaco’s Folarin Balogun, who started for the U.S. at last summer’s Copa America, could return at the end of this month from a shoulder injury.\nWest Bromwich Albion’s Daryl Dike has gradually returned to the fold in the last month, making four brief cameos from the bench. Since joining the club in 2022, he has suffered a catalogue of injuries that have limited him to just 36 appearances.\nWith Pochettino dealing with a striker injury headache, Norwich City’s Josh Sargent seems set to lead the line in LA, where USMNT face Panama on Thursday.\nSargent has had injury problems of his own this season, as he was sidelined for almost two months with a groin problem, but has been in excellent form since his return, scoring eight goals in 12 matches.\nSargent is the joint-fourth highest goalscorer in the Championship this season with 12 goals, and was picked by Pochettino for his first two games in charge in October. The lack of forward depth has also afforded opportunities to the likes of Patrick Agyemang, who plays for Charlotte FC, and Vancouver Whitecaps’ Brian White.\nHowever, now back in the goals, Wright will be aware opportunities remain up for grabs in that position ahead of the World Cup next summer, which the U.S. is hosting, along with Canada and Mexico.\nAdvertisement\nWright went to the last World Cup in Qatar, where he scored against the Netherlands in the round of 16, but he was then omitted from the squad for more than a year. He returned in March last year as an injury replacement for Sargent, scoring twice in extra time against Jamaica in the Nations League semi final. He was included in Pochettino’s first U.S. squad, coming off the bench in the October friendlies against Panama and Mexico, before that ankle injury.\nWright’s hat-trick on Saturday at the Coventry Building Society Arena was his first since August 2021, when he was playing for Antalyaspor in Turkey, the club who Coventry signed him from for a record £7.7million ($9.96m) in the summer of 2023. His career has also taken him to clubs in Germany, Denmark and the Netherlands.\nHis first goal came after 21 minutes as he received a pass on to his right foot…\nFrom there, he took a touch to turn inside the defender to get the ball on to his left…\nBefore firing past Sunderland goalkeeper Anthony Patterson.\nHe then won himself a penalty after skipping past Sunderland defender Chris Mepham, which he coolly placed down the middle, his second goal in nine first-half minutes.\nHe completed his hat-trick in the 73rd minute with a lovely dinked finish with his left foot over the onrushing Patterson, following a clever through ball from Victor Torp.\nU.S. readers can see his first goal here and his third goal here. UK viewers can watch his hat-trick here.\nHe earned a standing ovation from the crowd when he was substituted late in the game by head coach Frank Lampard, who was full of praise for his striker after the game.\nIt was only his second start for Lampard, who was appointed Coventry head coach at the end of November. Since then, the former England midfielder has overseen a resurgent spell that has put Coventry in the playoff spots. They are currently fifth in the table, with eight matches left to play.\nAdvertisement\n“I was excited to get him back and to play him in this level of game today and show what he did was really impressive,” Lampard told club media after the match when asked about Wright. “Today was an outstanding individual performance. I know he is a big player for us, so to see it in the flesh and be that clinical at the top end of the pitch, to have success you want those players at the top end of the pitch, so to have that confidence and to be able to play the way he played was brilliant.”\nAlso speaking to the club’s media after his hat-trick, Wright said he was happy to be back playing again after his frustrating period out.\n“I felt great today. After being out for so long I felt quick, I felt fresh and light on my feet,” he said.\nIn spite of that ankle injury he sustained at the end of the Sunderland away match on November 9, Wright has still scored 10 goals in 19 Championship games this season.\nIf Wright can use this hat-trick as a springboard — and stay fit — it will put him firmly on Pochettino’s radar and boost his chances of appearing at a second successive World Cup.\n(Top photo: Mark Leech/Offside/Offside via Getty Images)",
  "word_count": 976,
  "scraped_at": "2026-02-14T02:02:35.602365",
  "_text_extracted": true
}