{
  "article_id": "33645f012d99",
  "url": "https://www.managingmadrid.com/2023/12/18/24006543/3-observations-real-madrid-4-1-win-villarreal-carlo-ancelotti-david-alaba-luka-modric",
  "title": "3 observations from Real Madrid 4 - 1 win over Villarreal",
  "date": "20231218T221500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid cruised to victory over Villarreal in one of their best performances of the season, as goals from Jude Bellingham, Rodrygo Goes, Luka Modric and Brahim Diaz helped seal the victory for Los Blancos. They temporarily moved back to the top of the table, with Girona playing their game in hand on Monday.\n3 observations from Real Madrid’s 4-1 win over Villarreal\nMy notes as Real Madrid cruise to yet another convincing victory\nIt was, frankly, an incredible performance. We saw some things from this team that we haven’t seen at such a high level in a very long time. The football was entertaining, it was fun, it was fluid. Almost everything about this game was perfect. Almost.\nUnfortunately, David Alaba suffered a terrible injury – another ACL tear – and now Real Madrid has two senior centre-backs to end the season with. Irksome, to say the least.\nAnyway, here are my three observations from the game. Let’s get into it.\nA centre-back needs to be signed permanently\nWell, this is the most obvious observation out of the three. But it’s also just as important if not more.\nReal Madrid have two centre-backs at the moment. They have two more sidelined for the rest of the season. One of them – David Alaba – was already showing signs of decline. We don’t know how he’d play after his recovery. One of the fit ones, Nacho Fernandez, only barely agreed upon a contract extension. He might not extend again, and even if he does, he isn’t getting any younger. In short, regardless of Alaba’s injury, Real’s priority should be to sign a good young centre-back. This is all just my opinion and speculation, and for all I know, Alaba might come back better than ever, but the chances of that happening are slim.\nThe priority has become increasingly imminent after the injury, but it’s always been there. Alaba and Nacho are both getting old. At the moment, Rudiger is in his prime, not exactly the youngest player. That leaves Militao as the only young centre-back in the entire senior squad. I don’t know who Real Madrid will sign, or if they’ll sign someone on loan or permanently, but there needs to be a discussion about a young centre-back, and the names that have been mentioned in reports have been a good sign.\nYou could go on another route and sign someone like Raphael Varane on loan, but you don’t really know when Alaba returns, and how Alaba plays when he returns. But then, you also need to consider if the centre-backs you are looking at are overqualified for the role now, and whether they would accept it. Tough situation to be in, but very important for Real Madrid to get it right.\nAlright, time for something pleasant.\nModric, somehow, has still got it at 38 years old\nIt may not be every game, it may not be against every single team, but Luka Modric, when he has enough rest and coverage around him, can still put in an incredible shift every now and again.\nModric was not a starter at the start of this season, and if everyone is fit, he probably still isn’t. But, in a season riddled with injuries, 38-year-old Luka Modric had an incredible performance for the best team in the world.. You have to be really, really good at football to still be kicking about at this level, at this age. The best part is, it seemed like he rolled back the years. Leading the high press, counter-pressing, quick with recoveries, defensive interventions, chance creation, Modric did everything from an advanced position.\nOn multiple occasions, the legendary midfielder led Real Madrid’s high press and counter press, resulting in many of Villarreal’s giveaways. He created a lot of danger with his passes – including a truly mesmorising assist to Bellingham for the first goal – and topped off an amazing performance with a goal off of yet another successful counter-press that he led.\nObviously, it is no indication that he must start every game or bench the young players that usually start when everyone is fit, but Modric is showing why he is one of the greatest midfielders of all time, and helping the team with his experience and leadership in a difficult moment. He may not be a starter, but the way he performs in some of these games, the chapter on the Croatian’s longevity needs another lengthy anecdote.\nReal Madrid are actually playing well, and we need to have a discussion about why\nSo, Real Madrid start off the season by unexpectedly losing Karim Benzema. They don’t sign a proper starting calibre striker to replace him. They change the entire system to make the most of their squad without having to sign a proper striker. Then, they are bombarded with an unprecedented amount of long-term injuries, including one in the most recent game. And, still, Real Madrid are top of the table, they topped their Champions League group, and are actually playing really good football. If you had given me a list of these problems before the season started, Real Madrid doing this well wouldn’t necessarily be the first expectation that would come to my mind.\nObviously, Jude Bellingham – the footballing enigma of 2023 – has a lot to do with that (and I mean a lot). But it’s not just him. The team, as a whole, is playing really good football, even with these injuries. The players look in sync with one another, and most of them are performing at a very high level. Surely, you give some credit to Carlo Ancelotti here, no?\nEveryone was talking about his seemingly eventual departure that would happen one way or another, but no one expected this. It almost seemed like before this season, Ancelotti was doing normal Ancelotti things – man-managing, making genuine human relationships with the players, but not doing too much tactically because he didn’t really have to. This season forced his hand. This season, he has objectively been a very impressive coach on all fronts. He rotates when he can. He is giving young players a lot of minutes, he is playing a few academy players, he’s built an attractive brand of football, and did I mention this is Real Madrid’s best defensive start to a league season in decades?\nAncelotti has not been perfect – no one is – but this season has forced him to dig deep, and much like Modric, his undoubted experience is paying off in the best way possible. The team looks so much more tactically advanced now that he has the proper tools to work with, and a large chunk of credit should deservedly go to Ancelotti, who, frankly, has done a lot of good this season. A season as bizarre as this and Real Madrid are STILL doing so well. A contract extension seems like a matter of time now – and rightfully so.\nI have been a big advocate of bringing Xabi Alonso to the Santiago Bernabeu next season, but if Carlo continues like this, Alonso might have to wait for one more season.",
  "word_count": 1190,
  "scraped_at": "2026-02-14T01:51:13.775451",
  "_text_extracted": true
}