{
  "article_id": "3377e15b9f5c",
  "url": "https://www.nj.com/giants/2024/11/uncommon-ground.html",
  "title": "Uncommon Ground - nj . com",
  "date": "20241111T143000Z",
  "domain": "nj.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MUNICH – Spent cigarettes dotted the concrete floor inside Allianz Arena’s lower stands around 2 p.m. on Friday. The ashes were left behind by Bayern Munich fans who had watched their team outlast SL Benfica, 1-0, in a Champions League match a day and a half earlier.\nLines started blurring quickly, though. Nine rows of neon pink LED grow lights warmed a 50-yard stretch of grass as workers turned wrenches and removed seats to make room for the NFL’s setup. Kickoff for the Giants and Panthers game was in 50 hours. On two videoboards, the Kiss Me Cam was trained on groundskeepers pushing wheelbarrows.\nUwe Stadler, the venue’s operations manager, took measure of the field, which had to be extended eight yards to meet NFL standards. Out wide, the corner kick semi-circle was still visible, and the 18-yard box had not yet been colored in as the end zone. Forklifts carrying rolls of turf motored by.\n“It is tight, really tight, but it fits,” Stadler said. “I think it is going to work.”\nReal estate comes at a premium as the NFL takes on the world. League officials negotiate foreign infrastructure and rigid turnarounds to grow their business abroad and accommodate capacity crowds in multi-use facilities. Munich hosted the fifth and final international game for the NFL this season, but feasibility studies and master plans go on as the league officials contemplate a challenging calculus of event calendars, broadcast platforms and security parameters for future sites.\nAfter the Giants fell to the Panthers in overtime, 20-17, Sunday evening before a sold-out crowd of 70,132 spectators, a traveling troupe of troubleshooters tended to issues on site as others mapped plans to play at Santiago Bernabeu Stadium, the home of Real Madrid, in Spain next year.\n“NFL all the time, man,” said Todd Barnes, an architect and senior principal at Populous, a firm that works with the NFL on overlay projects. “That’s what it sure feels like these days, the way that it is going. It doesn’t seem like there is anything that stagnates. They change, they get bigger, they operate things differently. You have to follow along with that, trend along with it and develop solutions with them to assure that everything can be executed properly.”\nBreaking concrete\nThe evolving landscape is a labyrinth of surfaces and sub-surfaces, synthetic fibers and sod farms as the NFL shoehorns its showcases into foreign venues. Only in London, at Tottenham Hotspur Stadium, is there a facility that fully incorporates the NFL’s interests with permanent locker rooms and a separate field. To protect its grass soccer pitch, Tottenham’s designers installed a system where they can move the natural grass soccer field out within 25 minutes and let the synthetic turf field be used for football.\nDuring NFL games, the soccer field is stored beneath the south stands, where it is maintained in darkness save for grow lights. Robots provide feedback; ventilation is monitored. Admission is strictly limited.\n“There is no more sacred place in our stadium than the grass turf,” said Maria Knutsson-Hall, a senior principal at Populous and the leader of Tottenham’s design team. “No one is allowed to walk on that grass turf apart from the players and the coaches. You never get access. Even during design, you never, ever walk on the turf. That is always taught. You can keep the turf intact, that is a game changer. We had to design something that could flip between the two modes very quickly and be able to deal with that timeline.”\nThe league squeezed three games onto Tottenham’s football turf in eight days last month. First, the Jets played the Vikings on a Sunday, then the NFL Academy, a school based in Loughborough, England, played De La Salle High from California the next day. Six days later, the Bears and Jaguars performed before the Hotspurs of the Premier League reclaimed the space.\n“These traveling events do adjust to come to certain venues and they shrink and expand the size because they hear the acoustics and atmosphere are amazing in that building,” Knutsson-Hall said. “It is a little bit of give and take on both sides. To design venues that can host many events even though they have a home team and a club is going to be very important to the future and certainly the trend we’re seeing.”\nNick Pappas, the NFL’s field director, and his team mind everything from the mowing heights to nutrient adjustments when they arrive on site. In addition to the games, the league has started to feature performers in mini-halftime shows that require staffers to roll out makeshift stages. All of the comings and goings take a toll on the grass for more than five hours. The process remains a work in progress.\n“We always find ourselves going into these stadiums and breaking concrete or breaking ground to try and extend the surface,” Pappas said, “install a suitable subsurface, whether it be a sand makeup or whatever that looks best suited for that facility, obviously understanding how we can install field goal posts.”\nThe NFL’s handymen first assembled and erected goalposts for a regular season game at Wembley Stadium in 2007 when the Giants played the Dolphins. Twickenham Stadium, also in London, started hosting in 2016, and Tottenham became the main draw in 2019. The NFL has also ventured to Estadio Azteca in Mexico City; Corinthians Arena in Sao Paulo, Brazil and Deutsche Bank Arena in Frankfurt with two games in 2023; Rodgers Centre in Toronto, Canada has had six games. Overall, 55 games have been contested abroad. Munich first hosted in 2022. Berlin and Dublin are penciled in, as well.\n“As we go further and further away from home, we’re seeing obviously nuanced challenges with each location,” Pappas said. “Not every location is going to have the same resources available to us so we are going to have to go into a market, evaluate it, make a determination on whether a playing surface at whatever stadium we may play at is suitable for our needs. It may meet the needs of that home soccer club or home rugby club, whatever it may be, but it doesn’t necessarily mean that it meets the needs for our NFL athletes.”\nBut players find common ground in complaints about turf and grass; their gripes echo from stadium to stadium, stateside and abroad. In Brazil, Eagles tailback Saquon Barkley slipped on the first play before switching out his cleats and recovering to score three touchdowns. After the game, teammates likened the surface to an ice rink, similar to their criticism of the Super Bowl LVII surface that they dismissed as shoddy.\n“One step too far, and you can slip, do the splits,” says Eagles left tackle Jordan Mailata, an Australian who stands 6-foot-8, 365 pounds.\nLast month, at Tottenham, after the Jets lost to the Vikings, Jets quarterback Aaron Rodgers noted that wideout Garrett Wilson slipped on a route and that the field condition was a conversation topic on the sideline.\n“But both teams are playing on it,” Rodgers said. “We’ve got to handle that.”\nHe allowed that he had no personal grievance.\n“I don’t run as fast as those guys,” he said, “so it wasn’t slippery for me.”\n‘Nobody thought about this’\nLast week, the NFL started its takeover of Allianz Arena subtly. LED scoreboards were affixed to the facing of the tier between the lower bowl and second level of the stands before the Bayern Munich game. A runout area from the tunnel required additional grass to be installed that extends to the Bayern field wall. Luxury suites for soccer games were converted to coaching booths, but the nerve center of the NFL’s technical operations – game presentation, statistics, instant replay – could not be constructed until after Bayern Munich’s game.\nStadler, who joined Allianz Arena in 2004, just after the construction phase, never imagined the need to find space among the soccer locker rooms that only need 22 stalls in order to host 53 active football players and traveling practice squad players plus their equipment. To build extra shower space, Allianz Arena refurbished a closet in 2022, when the NFL first came to town. When the NFL leaves, they remove the shower heads so that water does not stay in them too long. They then seal off the space.\n“In the beginning, we thought, ‘Hey, no problem, it is big enough,’” Stadler said. “We couldn’t have imagined. Nobody thought about this, of course.”\nThe grass was on the players’ minds as they took the field over two hours before kickoff on Sunday. Giants linebacker Matthew Adams carried five pairs of cleats for warmups, and the team, which sent over an early cargo ship with items in July, recommended players wear seven-stud cleats for the best traction. Even a security guard in a neon-yellow vest stood in black seven-stud cleats on the grass as he kept track of those coming and going from the field.\nStill, Panthers running back Chuba Hubbard tripped on an early run and quarterback Bryce Young slipped before throwing a touchdown. Was it the grass? Hubbard demurred afterward. In the Giants' locker room, which had a trail of turf chunks carried in by the players, Giants lamented the condition as “not ideal.” But Jermaine Eluemenor, a 6-foot-4, 338-pound offensive lineman who grew up an Arsenal fan in London, felt like he was able to glide.\n“Honestly, that is probably the best surface I‘ve played on all year,” he said. “I freaking love that surface. My body feels phenomenal. If more grass was like that in the U.S. instead of turf, I would be happy. It was dope. I‘m an Arsenal fan, but I loved playing on Bayern Munich’s grass.”\nOn the field, the south goal post was taken down in 20 minutes and left in a pile of six pieces by the tunnel closest to the exit. Then, came the north goal post, which was also easily lowered.\nAt the 28-yard-line, the bespectacled Stadler, who deemed the transformation “very smooth,” and Pappas, who took a photo of the field with the Bayern Munich logo in the stands, huddled.\nWhile the stadium would continue to host more events, the night‘s contest was the final game for the field, which had been installed in August 2023. The 600 rolls of turf would be removed from the stadium starting Monday. New turf would be coming within a week from a company in Milan, Italy and be installed before Bayern Munich’s next game on Nov. 22.\n“It’s coming from the other side of the Alps,” Stadler said. “Not too far away.”",
  "word_count": 1771,
  "scraped_at": "2026-02-14T02:08:26.321397",
  "_text_extracted": true
}