{
  "article_id": "337986b95fbf",
  "url": "https://www.newkerala.com/news/2023/65998.htm",
  "title": "Football : Midfielder Ahmed Jahouh to leave Mumbai City FC after three - year stint",
  "date": "20230601T100000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mumbai, May 30\nFormer Indian Super League (ISL) winner Mumbai City FC on Tuesday announced that they are set to bid farewell to Ahmed Jahouh after his contract expires on May 31 as the Moroccan midfielder's three-year journey with the Club comes to an end.\nOne of the most gifted to wear the Islanders' colours, Ahmed Jahouh leaves a legacy behind at Mumbai City FC as a master with the ball at his feet, a true warrior and a born winner.\nEven though he faced the ignominy of getting sent off on his Mumbai City debut, the Moroccan made up for that by becoming the engine room of a formidable Mumbai City side in ISL 2020-21 that created history by becoming the first team to win both, the ISL League Winners' Shield and the Trophy in the same season.\nExtremely proficient in set pieces and dead-ball situations, Jahouh took on a more advanced role in the 2021-22 campaign. The 34-year-old notched up seven assists, adding to his tally of five from the previous season and scored 3 times as well.\nThe most notable of his goal contributions came in Riyadh, delivering a pin-point corner for Rahul Bheke to score the winner against Iraq's Air Force Club at the 2022 AFC Champions League. The win was the first of two for Jahouh and the Islanders as Mumbai City FC finished an unprecedented second in Group B, Mumbai City FC informed in a release on Tuesday.\nKnown for his ability to control and dictate the game, Jahouh was a vital asset once again as Mumbai City FC went on to create further history, breaking 15 all-time league records, including an 18-match unbeaten run, leading to a second League Winners' Shield in three years.\nAs he so often did, Jahouh came clutch in his 70th and final appearance for the club, scoring from the penalty spot in a 3-1 win against Jamshedpur FC to secure a place in the Group Stage of the 2023-24 AFC Champions League, the release said.\n\"We would like to place on record our gratitude to Jahouh for his great contributions to Mumbai City FC and wish him nothing but the best for his future,\" Mumbai City FC informed in a release on Tuesday.\nDisclaimer: This story was supplied by an external content provider; we do not endorse or accept responsibility for its accuracy, completeness, or any outcomes from relying on it. It is for informational purposes only and does not constitute legal, financial, medical, or other professional advice. Laws and regulations vary and may change; readers should verify accuracy and compliance with local requirements and consult a qualified professional for tailored guidance.",
  "word_count": 444,
  "scraped_at": "2026-02-14T02:09:58.139717",
  "_text_extracted": true
}