{
  "article_id": "339f382e83c9",
  "url": "https://www.90min.com/arsenal-winger-assess-transfer-options",
  "title": "£20m - rated Arsenal winger  wants to asses transfer options",
  "date": "20240615T104500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "£20m-rated Arsenal winger 'wants to assess' transfer options\n- Reiss Nelson tells Arsenal that he wants to weigh up his options this summer\n- Winger has struggled to make regular appearances under Mikel Arteta\n- The Gunners expected to seek fee in region of £20m\nReiss Nelson has told Arsenal that he wants to consider his options this summer, according to reports.\nThe 24-year-old's played just 256 minutes of Premier League football last season, starting just once, and faces stiff competition for places in an Arsenal side that narrowly missed out on the title for the second season in a row.\nNelson signed a new three-year to remain with Arsenal last summer, with the option of a further 12 months, after impressing in cameo substitute appearances during the 2022/23 season.\nBut The Athletic report that the Hale End academy graduate is now willing to consider a transfer away from the Emirates Stadium, having been subject to offers in January.\nArsenal turned down those approaches down, owing to their Premier League and Champions League commitments, but it appears they will not stand in Nelson's way this summer if an interested party is to meet their £20m valuation.\nPremier League quartet Crystal Palace, Fulham, Nottingham Forest and West Ham United are named as potential suitors for Nelson, who has played 89 games for Arsenal in all competitions after making his first-team breakthrough during the 2017/18 season.\nNelson has previously spent two seasons out on loan, starring at Bundesliga outfit TSG Hoffenheim before a less successful with Dutch giants Feyenoord, who were managed by incoming Liverpool manager Arne Slot at the time.\nArsenal's other natural wide options include Bukayo Saka, Gabriel Martinelli and Leandro Trossard, while Gabriel Jesus has also been used as a winger thanks to the form of the rejuvenated Kai Havertz, who scored for Germany on Friday night in their 5-1 win over Scotland in the first game of Euro 2024.",
  "word_count": 321,
  "scraped_at": "2026-02-14T01:57:18.897879",
  "_text_extracted": true
}