{
  "article_id": "33bf6a7bf3c4",
  "url": "https://www.fourfourtwo.com/quiz/quickfire-quiz-52",
  "title": "Quickfire Quiz 52 : Can you answer 10 questions in 90 seconds ? ",
  "date": "20260210T101500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nYou have just 90 seconds to rattle your way through 10 football trivia questions. We've got a brand new FourFourTwo Quickfire Quiz for you to enjoy.\nHandpicked football quizzes we know you'll love\nQUICKFIRE QUIZ Play more Quickfire Quizzes\nFourFourTwo has lots more football quizzes for you to tackle, all courtesy of Kwizly. Let's start by asking you to name all 240 clubs to have played in the Europa League since the competition was rebranded in 2009 and every Champions League hat-trick scorer ever.\nWhile your brain's in Champions League mode, how about identifying the players with the most goals and assists in the history of the competition and every player with two or more Champions League titles since 1992?\nWe also want you to name every MLS team and the top 100 scorers in the history of the Premier League, as well as every Copa del Rey finalist since 2000.\nThere's a quiz that asks you to name every nation to reach the final of the Africa Cup of Nations and another that challenges you to identify every club to have won the English league title, the FA Cup or the League Cup.\nFinally, can you name every club to have reached the League Cup semi-finals and all 52 Golden Players from the UEFA Jubilee Awards? How about the Manchester United starting line-up from Michael Carrick's last game as a player?\nStill want more? Great! We have puzzles too. Our Weekend Crossword is a regular football teaser for any chilled Sunday morning, and remember to sign up to the newsletter for more quizzes in your inbox. Don't forget to join The Club for free additional membership benefits too!\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 462,
  "scraped_at": "2026-02-14T01:59:36.836020",
  "_text_extracted": true
}