{
  "article_id": "33de5007074c",
  "url": "https://menafn.com/1106362084/Manchester-City-How-Pep-Guardiolas-Leadership-Style-Formed-A-Squad-Of-Champions",
  "title": "Manchester City : How Pep Guardiola Leadership Style Formed A Squad Of Champions",
  "date": "20230531T090000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- The Conversation) As the final whistle blew in Nottingham Forest's 1-0 win over Arsenal on May 20, celebrations erupted approximately 85 miles away in the city of Manchester. Thanks to the points Arsenal lost in their defeat, Manchester City were crowned Premier League champions for the third consecutive year – and for the fifth time in the last six seasons.\nArsenal were leading the league at the halfway stage, but it's not unusual for Manchester City to turn the heat up in the second half of the season. They did so before in 2018/2019, beating liverpool to the title on the final day.\nTwo elements have been crucial to Manchester City's sustained success – the depth and ability of the squad and manager Pep Guardiola's leadership style.\nManchester City's squad depth (the quality of all their signed players, not just the starting 11) can be attributed to their transfer activity over the past three seasons. The club has one of the highest net spends in the division, but it was their strategic spending – acquiring players who would fit Guardiola's plans for the team – that enabled their success.\nWhile the squad already had long-serving, high-performing players such as midfielder kevin de bruyne (2015), after Guardiola's takeover in 2016, adequate cover for the first team was acquired in the form of kalvin phillips , sergio gomez and manuel akanji .\nThis means Guardiola has enough quality players to form almost two different starting 11s without sacrificing the calibre of players and playing style. This is something their rivals, Arsenal, did not possess.\nThere is fierce competition between clubs to access and develop global top talent. To keep up, many are looking for alternative solutions.\nA Pep Guardiola fan makes his support known. epa/peter powell One dominant approach is called vertical integration. This is where some club owners – such as City Football Group (CFG), which owns Man City, and Red Bull Sport – acquire satellite clubs in smaller leagues. These smaller or affiliated clubs are then owned or controlled by the main club or organisation. The aim is to secure playing time for young talents who would otherwise be blocked from getting first team opportunities.\nCFG owns satellite clubs in 10 countries, including the US, Japan, Australia and India. Manchester City uses the scouting network of these satellite clubs to learn of players that wouldn't otherwise be on their radar. They then bring them into the CFG family offering a possible future of playing in the Manchester City first team.\nThis gives City a competitive advantage over their rivals in england's“big six” clubs , as none of their competitors have this kind of multi-club ownership model.\nLeadership style\nGuardiola has created a powerful identity at Manchester City. His leadership at the club can be compared to the“no dickheads” philosophy of New Zealand's national rugby union team, the All Blacks. It is based on the belief that the collective culture of a team can be spoiled by one selfish mindset.\nThis was demonstrated recently in Guardiola's decision to loan full-back Joao Cancelo to Bayern Munich during the winter transfer window. In January and February, journalists were speculating about the body language and mood of the players in the City dressing room.\nPep Guardiola and Joao Cancelo in 2020. epa/andrew yates One of those players was Cancelo, who has admitted to feeling unhappy if he didn't start every game. When Cancelo requested to leave, Guardiola was quick to oblige because he put the team above its individual members. His staff believe this was a crucial decision in improving team harmony.\nresearch shows that measuring the effect of a leader on organisational performance is a challenging task. This is because there are multiple factors that can cause a positive or negative impact. But without doubt, while Manchester City had won Premier League titles before the arrival of Guardiola, his leadership has transformed the team.\nIt has helped them to become“hybrid monsters”, who can play with any formation and any player combination and still consistently challenge for European honours.\nManchester City are yet to play in the FA Cup and UEFA Champions League finals. While they are the favourites to win both trophies, football is a funny game and nothing is certain until the final whistle is blown.\nShould they emerge victorious, Manchester City will become the second English club to win the treble (League, Cup and Continental Championship) since their rivals, Manchester United, did it in 1999. They will also become the sixth English club to win the UEFA Champions League, cementing their place as one of the best football teams in history.",
  "word_count": 771,
  "scraped_at": "2026-02-14T02:09:58.142209",
  "_text_extracted": true
}