{
  "article_id": "33e264d980db",
  "url": "http://thepeninsulaqatar.com/article/20/06/2024/afc-champions-league-elite-unveils-top-class-lineup-for-inaugural-season",
  "title": "AFC Champions League Elite unveils top - class lineup for inaugural season",
  "date": "20240620T101500Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nKuala Lumpur: The cream of the crop in Asia will come together for the maiden campaign of the AFC Champions League Elite (ACL Elite) this July when the prestigious competition kicks off.\nThe initial cast for the debut 2024/25 season was confirmed by the Asian Football Confederation (AFC), in accordance with the finalised AFC Club Competitions 2024/25 slot allocations that features 27 teams from across 12 Member Associations (MAs) – six from each of the West and East regions.\nThis will see five clubs battling it out in the Preliminary Stage from August 6 to 13 for the remaining slots in the League Stage: in the West, Qatar’s Al Gharafa will play the winner of the tie between the representative club from the Islamic Republic of Iran and United Arab Emirates’ Shabab Al Ahli, while in the East, China’s Shandong Taishan FC will square off against Thailand’s Bangkok United. The losing teams from the Preliminary Stage will directly enter the AFC Champions League Two Group Stage. The winning teams will join the clubs that have qualified directly for the League Stage and continue their quest to reach the pinnacle of Asia between September 16, 2024 and February 19, 2025.\nThe official draw ceremony for the League Stage will be conducted on August 16, with further details on the Draw Mechanics to be announced in due course.\nThe top eight teams from each League will advance to the double-legged Round of 16, scheduled from March 3 to 12, 2025, which will be followed by a unique centralised Finals.\nThis will see all matches, from the quarter-finals onwards, being contested at a single host MA, with Saudi Arabia having been confirmed for the 2024/25 and 2025/26 seasons.\nNo regional division will apply during the finals, which will witness single-legged ties for each of the quarter-finals (for which a draw will be conducted to determine the pairings), semi-finals and final that will take place between April 25 and May 4, 2025.\nAll participating clubs will be supported by significant increases in financial distribution, as teams entering the League Stage are guaranteed a minimum of $800,000, with additional monies available based on their eventual placings, meaning that the champions will receive at least $12m.\nMeanwhile, the AFC also unveiled the pathway towards the inaugural AFC Champions League Two (ACL Two) season, with 32 teams competing for top honours in the brand-new second-tier men’s club competition.\nIn accordance with the finalised AFC Club Competitions 2024/25 slot allocations and club licensing requirements, 27 teams from across 21 Member Associations (MAs) – 12 from the West region and 15 from the East – qualify directly to the Group Stage, along with the three teams (two West, one East) that will be eliminated from the preliminary stage of the AFC Champions League Elite.\nThe two winners will complete the 32-strong cast for the 2024/25 campaign, where they are divided evenly into eight groups to contest a round-robin, home-and-away format from September 17 to December 5.\nAl Wakrah will represent Qatar at the inaugural edition of the League which offers at least $3.28m for the champions.\nClubs, their respective MA rankings and slot allocations\nWest Asia\n1 - Saudi Arabia: Al Hilal SFC, Al Nassr, Al Ahli Saudi FC\n2 - Qatar: Al Sadd, Al Rayyan, Al Gharafa (Indirect)\n3 - Iran: Persepolis FC, Esteghlal FC, TBC (Indirect)\n4 - UAE: Al Ain FC, Al Wasl FC, Shabab Al Ahli (Indirect)\n5 - Uzbekistan: FC Pakhtakor\n6 - Iraq: TBC\nEast Asia\n1 - Japan: Vissel Kobe, Kawasaki Frontale, Yokohama F. Marinos -\n2 - South Korea: Ulsan HD FC, FC Pohang Steelers, Gwangju FC (Indirect)\n3 - China: Shanghai Port FC, Shanghai Shenhua FC, Shandong Taishan FC (Indirect)\n4 - Thailand: Buriram United, Bangkok United (Indirect)\n5 - Australia: Central Coast Mariners\n6 - Malaysia: Johor Darul Ta’zim FC\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 709,
  "scraped_at": "2026-02-14T02:10:54.422282",
  "_text_extracted": true
}