{
  "article_id": "33ffe809412e",
  "url": "https://www.aol.co.uk/articles/thursday-briefing-euro-joy-arsenal-033021419.html",
  "title": "Thursday briefing : Euro joy for Arsenal and Newcastle but Man City drop points",
  "date": "20251002T040000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thursday’s briefing: Euro joy for Arsenal and Newcastle but Man City drop points\nArsenal and Newcastle recorded wins in Wednesday’s Champions League action that left both clubs’ managers valuing the playing options available to them.\nBut Manchester City were held to a contentious stalemate in Monaco despite Erling Haaland’s brace.\nManchester City frustrated in Monaco\nPep Guardiola refused to be drawn on Monaco’s controversial late penalty after seeing his Manchester City side pegged back in a 2-2 Champions League draw at Stade Louis-II.\nFormer Tottenham defender Eric Dier scored from the spot in the 90th minute after taking a boot in the face from Nico Gonzalez as the pair stretched to reach a free-kick.\nReplays showed Gonzalez got the ball first but, having also caught Dier, he and City were in trouble once VAR Cesar Soto Grado referee Jesus Gil Manzano to consult the pitchside monitor.\nAsked if he would give his opinion of the incident, Guardiola said: “No. I have nothing to say to the Spanish referees.”\nGuardiola’s bigger frustration will have been his side’s inability to kill off Monaco, having twice led through goals from Erling Haaland, who marked his 50th Champions League appearance with a brace that took his tally to 52 in the competition.\nGuardiola added: “If you analyse the game there were many things that were really good. Step by step we will be better but we had many chances.”\nArsenal depth pleases Arteta\nMikel Arteta believes Arsenal’s strength in depth makes them better equipped to go even further in this season’s Champions League.\nArteta was able to rotate his squad for Wednesday’s 2-0 league win over Olympiacos with a stacked bench including Declan Rice, Eberechi Eze and Bukayo Saka.\nAnd it was England winger Saka who settled some frayed nerves when he came on as a replacement to score their second goal.\n“With all respect, last season we were looking (at the bench) and we had five academy players there that probably never played professional football in the Champions League, so it makes a difference,” said Arteta.\n“Today we decided to change six players because I want everyone to really be involved and feel part of it, and it was great.”\nHowe predicts a high ceiling for Woltemade\nNewcastle boss Eddie Howe is confident there is more to come from record signing Nick Woltemade after the striker opened his Champions League account in Brussels.\nThe 23-year-old, a £69million summer acquisition from Stuttgart, scored for the third time in four starts in the Magpies’ 4-0 victory at Union St-Gilloise.\n“His potential is high. It’s an exciting start for him and he’s done really really well. More importantly he is willing, he wants to do the work and he wants to improve,” Howe said.\n“It is difficult to put a percentage on what he is right now, but there is more to come. There will be more to come physically and more to come tactically as we go through the journey together with him.”\nWhat’s on today\nAston Villa travel to Rotterdam, the scene of their 1982 European Cup final success over Bayern Munich, to take on Robin van Persie’s Feyenoord in the Europa League.\nNottingham Forest host Midtjylland in the same competition, while Celtic welcome Braga and Rangers head to Austria to take on Sturm Graz.\nCrystal Palace are in action in the first round of fixtures in the Conference League, alongside Aberdeen, Shelbourne and Shamrock Rovers.",
  "word_count": 572,
  "scraped_at": "2026-02-14T02:21:48.751720",
  "_text_extracted": true
}