{
  "article_id": "3403f158f1d3",
  "url": "http://www.haitisun.com/news/278547973/being-there-at-18-is-something-to-be-valued-yamal-aims-to-achieve-ballon-dor-dream",
  "title": "  Being there at 18 is something to be valued ...: Yamal aims to achieve Ballon dOr dream",
  "date": "20250902T184500Z",
  "domain": "haitisun.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ANI\n02 Sep 2025, 20:41 GMT+10\nBarcelona [Spain], September 2 (ANI): Following a memorable 2024-25 season with Barcelona, teenage football sensation Lamine Yamal opened up on his dream to win the Ballon d'Or award, the highest individual honour in the sport, saying that being there at the age of 18 is 'something to be valued' and he hopes of fulfilling his dream.\nYamal was sensational for Barca in the 2024-25 season, delivering 18 goals and 25 assists across 55 matches across all competitions, playing a massive role in their domestic treble of La Liga, Copa del Rey and Spanish Super Cup. He also took the Spain Euro Championship title last year.\nHe emerged as the 'Best Young Player' in the competition. The only setback was the club's UEFA Champions League dreams being crushed in the semifinal against Inter Milan.\nYamal joined stars like Ousmane Dembele, Jude Bellingham, Erling Haaland, Harry Kane and Kylian Mbappe, among others, as one of the nominees for the football's top individual prize, which is a Golden Ball.\nCurrently on international duty with Spain, Yamal admitted that he dreams of securing the coveted prize and expressed how delighted he was to be nominated for the award. The ceremony for the 2025 Ballon d'Or will take place on September 22 at the Theatre du Chatelet in Paris.\nSpeaking to RTVE, the teenage attacker said, as quoted by Goal.com: 'As a team, winning the Champions League with Barca would be incredible, and individually, every player wants to win the Ballon d'Or, and anyone who tells you otherwise is lying. Being there at 18 is something to be valued, and I hope it happens.'\nYamal will be in action next against Bulgaria for Spain in the World Cup Qualifiers. Their second qualifying game of the September international break is against Turkey on Sunday. Spain will be eyeing the prize, which they won once back in 2010, when it takes place in Canada, Mexico and the USA from June 11 next year. (ANI)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Haiti Sun news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Haiti Sun.\nMore Information\nnull in null\nSEOUL, South Korea: South Korea's former First Lady Kim Keon Hee and ex-Prime Minister Han Duck-soo were both indicted on August 29...\nHONG KONG: A Hong Kong court has said it will announce the verdict in media tycoon Jimmy Lai's national security trial at a later date,...\nNEW DELHI/ISLAMABAD: Torrential rains pounding parts of Pakistan and India have left a trail of destruction, killing at least 34 people...\nNEW YORK CITY, New York: The U.S. Transportation Department has announced plans to take back control of Washington's Union Station,...\nWASHINGTON, D.C.: Getting a COVID-19 shot this year may not be as straightforward as before. A mix of new federal guidance, insurance...\nVENICE, Italy: The Venice Film Festival opened on August 27 with its usual mix of glamour and Hollywood stars, but activists are trying...\nREDMOND, Washington: Microsoft has dismissed four employees after on-site protests against the company's ties to Israel, escalating...\nNEW YORK CITY, New York: U.S. shoppers who have grown used to ordering cheap goods from overseas will soon see higher prices at checkout....\nBEAVERTON, Oregon: Nike said it will trim fewer than one percent of its corporate workforce, a modest round of cuts that comes as the...\nEVENDALE, Ohio: A contract standoff has triggered a walkout at GE Aerospace, with more than 600 United Auto Workers union members striking...\nSeattle, Washington: Amazon is taking another step to fold Whole Foods more tightly into its broader operations, announcing that corporate...\nSEATTLE, Washington: Global airlines are pushing to keep pilots in cockpits longer, asking the United Nations' aviation body to raise...",
  "word_count": 655,
  "scraped_at": "2026-02-14T01:52:36.760272",
  "_text_extracted": true
}