{
  "article_id": "340359a77394",
  "url": "https://whdh.com/news/lionel-messi-says-hes-going-to-mls-club-inter-miami/",
  "title": "Lionel Messi says he going to MLS club Inter Miami - Boston News , Weather , Sports",
  "date": "20230607T233000Z",
  "domain": "whdh.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(CNN) — Argentine superstar Lionel Messi said Wednesday he’s going to join the Major League Soccer club Inter Miami.\n“I made the decision that I am going to Miami. I still haven’t closed it one hundred percent. I’m missing some things but we decided to continue my journey there,” the seven-time world player of the year said in an interview posted by Spanish outlets SPORT and Mundo Deportivo.\nThe blockbuster announcement comes months after Messi was awarded the Golden Ball at the World Cup – the prize given to the best player in the tournament – and catapulted his country to World Cup glory in December. It also followed rumors of a lucrative deal in the Middle East and reports of a move back to his beloved Barcelona.\nInstead, Messi has chosen the path of other superstar players who moved to the MLS.\nThe move to David Beckham’s Inter Miami isn’t entirely surprising. Beckham is a well-known fan of Messi and, in 2019, teased, “You never know what can happen in football,” when asked about signing the Argentine one day.\nEarlier Wednesday, the CEO and managing owner of Inter Miami tweeted a cryptic picture of a No. 10 shirt with a last name partially revealed – showing just the last two letters, “SI.”\nMLS said a deal with Messi has not been completed, but welcomed the prospect of Messi playing in the league.\n“We are pleased that Lionel Messi has stated that he intends to join Inter Miami and Major League Soccer this summer,” the league said in a Wednesday statement. “Although work remains to finalize a formal agreement, we look forward to welcoming one of the greatest soccer players of all time to our League.”\nCNN has reached out to Inter Miami, Messi’s representative and David Beckham – who is part of Inter Miami’s ownership team.\nThere had been speculation around Messi’s next move since he announced his departure from French side Paris Saint-Germain (PSG), playing his last game for the club on Saturday.\nAn earlier BBC report by football reporter Guillem Balague said Messi was set to turn down an offer from Saudi Arabian side Al-Hilal.\nMessi left Barcelona in tears in 2021 after financial mismanagement at the club, exacerbated by the Covid-19 pandemic, meant it was unable to offer its talisman a new contract.\nFC Barcelona, in a statement, said the player’s father and representative, Jorge Messi, informed club president Joan Laporta on Monday of his son’s decision to join Inter Miami despite an offer from the European team.\nLaporta “understood and respected Messi’s decision to want to compete in a league with fewer demands, further away from the spotlight and the pressure he has been subject to in recent years,” the statement said.\nLaporta and the eldest Messi also agreed to work together to promote a “tribute from Barça fans to honor a footballer who has been, is, and always will be beloved by Barça.”\nAt PSG, Messi went on to win two Ligue 1 titles in his two seasons, but was unable to help the club win the Champions League for the first time in its history.\nMessi’s time at the club ended acrimoniously after PSG suspended him for taking an unauthorized trip abroad to Saudi Arabia, for which he later apologized.\nHis final game for PSG ended in defeat as the Ligue 1 champion lost 3-2 at home to Clermont Foot on Saturday.\nMessi’s final season in Paris was tumultuous. Though he scored 21 goals and 20 assists in all competitions, helping the team to the Ligue 1 title, PSG again failed to progress beyond the last 16 of the Champions League, the trophy the club covets the most.\nAt Messi’s final match – as well as in a number of recent games – some PSG fans booed the superstar.\nBefore his two-season stint with PSG, Messi spent 17 trophy-laden years at Barcelona, where he turned from schoolboy to sporting legend.\nEarlier this week, his father had said Messi’s preferred move would be a return to Barcelona.\nIn a recent interview with CNN Sport, Messi said he would continue playing while he’s still enjoying it and, at 35, he has a few more years to give.\n“I’m just looking … to keep enjoying, to keep playing, which is what always made me happy,” he said.\n(Copyright (c) 2025 CNN. All Rights Reserved. This material may not be published, broadcast, rewritten, or redistributed.)",
  "word_count": 738,
  "scraped_at": "2026-02-14T01:48:17.236258",
  "_text_extracted": true
}