{
  "article_id": "340a50c96f2d",
  "url": "https://thepeoplesperson.com/2025/10/01/why-xavi-is-the-ideal-replacement-for-amorim-at-united-opinion-299549/",
  "title": "Why Xavi is the ideal replacement for Amorim at United - opinion - Man United News And Transfer News",
  "date": "20251001T010000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "More than a decade after Sir Alex Ferguson’s retirement, Manchester United’s search for his successor is yet to bear fruit. David Moyes, Louis van Gaal, Jose Mourinho, Ole Gunnar Solskjaer, and Erik ten Hag have all failed to take the club back to their glory days.\nRuben Amorim was selected for the job last November, but ten months later, he has yet to get going.\nThe Red Devils have endured a difficult time under the Portuguese so far. They finished 15th in the league last season and lost the Europa League final to Tottenham Hotspur.\nDespite significant investment in the squad over the summer, results have failed to improve. United are 14th in the Premier League table after six games, and have scored just seven goals in the league so far.\nAmorim feeling the heat at Old Trafford\nUnited started the season on the front foot, impressing against Arsenal on opening day despite losing 0-1. Since then, it has been a topsy-turvy ride, with fans’ emotions oscillating between agony and ecstasy.\nWhen the defeat against Grimsby Town in the EFL Cup appeared to shatter dreams, the hard-fought win over Burnley gave hope. A 0-3 loss to Manchester City toppled the sandcastles, yet it appeared that United had risen like a phoenix after the 2-1 win against Chelsea.\nHowever, last weekend’s 1-3 defeat to Brentford, who had just one win this season before that game, appears to be the final straw to break fans’ resolve. Amorim had divided opinion among supporters and critics for a while, and that loss only strengthened the voice of his doubters.\nThe Portuguese’s situation at Old Trafford, at the moment, remains fragile.\nThe contenders\nRecent reports have suggested that United have already shortlisted multiple candidates for the hot seat at Old Trafford. Crystal Palace boss Oliver Glasner, who has transformed the Eagles’ fortunes since taking charge at Selhurst Park, is among the names linked with the job.\nBournemouth manager Andoni Iraola has also been mentioned as an option, while Gareth Southgate is reportedly on INEOS’ radar as well.\nIt is now believed that former Barcelona manager Xavi is keen to take charge of the Red Devils. The Spaniard is not associated with any managerial position at the moment and is reportedly ready to join the club immediately.\nAnd he could be the right man for the job.\nBig club experience\nXavi enjoyed an impressive run with Barcelona during his two-and-a-half-season stay at Camp Nou. The Spaniard won the La Liga title and the Supercopa de Espana before he was abruptly removed from the position in May 2024.\nXavi finished his tenure with the Catalans with a 62.68% win ratio, registering 89 wins and 29 defeats from 142 games in all competitions.\nThe Spaniard is well aware of the rigours of managing a top club in Europe, which puts him ahead of the competition in the race for the hot seat at Old Trafford.\nUnlike Amorim, Xavi has overseen Barcelona’s run in the Champions League and knows all about fan expectations. United are fast becoming a pressure cooker for players and managers alike, but the Spaniard has the experience to deal with expectations at the Theatre of Dreams.\nAn emphasis on possession\nAmorim wants his team to play high-action attacking football, with emphasis on possession and structured buildup. Xavi, meanwhile, also prefers possession-based football, and his team have previously excelled in controlling the tempo of games.\nThe Spaniard’s arrival, as such, wouldn’t require a massive shift in tactics, as was the case when Amorim joined the Red Devils. Instead, the focus would be on improving the team’s gameplay in possession, which has been the club’s bane for ages.\nUnder Amorim, United have struggled to control games and have relied mostly on transitional play. This has hurt the team against opposition that deploys low blocks.\nXavi’s setup, meanwhile, would emphasise possession and ball retention. His philosophy is based on dictating the tempo of the game, which could be a refreshing departure from United’s current state.\nA shift in formation\nOne of Amorim’s biggest issues is his 3-4-3 system, with the team still struggling to cope with the demands of the formation. Xavi, meanwhile, uses the 4-3-3 system that the United squad is arguably better suited for.\nThe Red Devils have played in that formation under Solskjaer as well as Ten Hag, and have traditionally deployed a back-four.\nXavi, however, is tactically flexible and has previously altered his approach to suit the opposition, something Amorim has been reluctant to do so far.\nMeanwhile, Xavi’s arrival could solve one of United’s biggest paradoxes – the midfield. Amorim’s two-man midfield has been torn apart at times by the opposition, and supporters are crying out for a switch to a midfield three.\nXavi, meanwhile, deploys a three-man midfield, and a trio of Bruno Fernandes, Kobbie Mainoo, and Casemiro could instantly control the middle of the park. It would bring balance to the team, combining defensive solidity with attacking flair, while reducing the dependence on the full-backs.\nReplace Casemiro with Carlos Baleba in the winter, or next summer, and you potentially have one of the best midfields in the league.\nFocus on Youth\nUnited have a history of promoting youth. At Old Trafford, if you are good enough, you are old enough, which is why Amorim’s treatment of Mainoo this season has baffled fans and critics.\nThe Englishman has been competing with Bruno Fernandes for a place in the starting XI this season, and has yet to start a game in the league. Leny Yoro, meanwhile, has also lost his place to Harry Maguire in recent games.\nAt Barcelona, the likes of Gavi and Pedri flourished under Xavi, who also gave debuts to 15 players from La Masia during his short reign! Among them are Lamine Yamal, Pau Cubarsi, Fermin Lopez, and Marc Casado, who are now a key part of Hansi Flick’s set-up at Camp Nou.\nUnited also have a string of budding talents ready to break into the senior side, so Xavi’s experience while dealing with young players will be a bonus.\nA new identity\nWhat United need right now is more than just a new manager. The team needs an identity, something that has disappeared in recent seasons.\nXavi’s arrival could give the Premier League giants a new direction. It would signal INEOS’ commitment towards youth and ideals, alongside football.\nAnd just like he beat Real Madrid to the La Liga title, perhaps Xavi could end his former manager Pep Guardiola’s dominance in England and mark the start of a new era at the Theatre of Dreams.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1102,
  "scraped_at": "2026-02-14T01:55:21.385716",
  "_text_extracted": true
}