{
  "article_id": "34186f3e7355",
  "url": "https://www.con-telegraph.ie/2024/02/11/arsenal-building-momentum-in-premier-league-title-battle-mikel-arteta/",
  "title": "Arsenal building momentum in Premier League title battle – Mikel Arteta",
  "date": "20240211T204500Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal building momentum in Premier League title battle – Mikel Arteta\nBy Andy Sims, PA\nMikel Arteta believes Arsenal are gaining momentum in the title race after they roared to a 6-0 win at West Ham.\nThe Gunners backed up last week’s big triumph over Liverpool with another statement victory, their biggest away win in the Premier League.\nTheir title bid hit the buffers in this fixture last season when they blew a two-goal lead to draw 2-2 but there was no chance of a repeat after William Saliba headed them in front and West Ham promptly collapsed.\nDeclan Rice grabbed a pair of assists against his former club while Bukayo Saka, Gabriel Magalhaes and Leandro Trossard were also on target, all before half-time.\nSaka scored his second midway through the second half and Rice rubbed salt in the wounds with a long-range sixth.\n“We are maintaining and building some momentum now,” Gunners boss Arteta said.\n“After the Liverpool game we had to show that we had that capacity to repeat that level or be better.\n“Performances have been strong as well as results in recent weeks. We need to maintain that because other teams are doing that as well. We are not the only ones.”\nOn Rice’s impressive return to the London Stadium, setting up Saliba and Gabriel with set-piece deliveries before scoring from 25 yards, Arteta said: “I’m really happy with him.\n“I know that it was an emotional day for him because he loves West Ham so much. But he had to focus on the task and what he had to deliver – set-pieces were one of those.”\nIt was a chastening afternoon for West Ham and manager David Moyes pulled no punches after his heaviest defeat in charge.\n“It was a really poor day for us,” he said. “Arsenal played extremely well, give them credit, but it’s difficult to explain how we played so poorly.\n“We’re normally a lot stronger, we didn’t show that today. I’m disappointed with the way we fell apart when the game hadn’t looked as if it was going to be as big as that.\n“I don’t think since I’ve come back to the club my team’s defended that way, ever. We were weak today, we didn’t do our jobs well enough, we didn’t fight to contain it harder.\n“I’ve had teams here which maybe haven’t had the same quality that we have now but we would have made sure we didn’t put in a performance like that, that’s for sure.”\nWhen West Ham beat Arsenal and Manchester United in December, there was talk of a Champions League challenge.\nThey have lost to both in the past eight days, shipping nine goals in the process, and are still without a win in 2024.\nAlarm bells might not be ringing for Moyes just yet, but the sight of hundreds of West Ham fans leaving at half-time told a sorry tale and the Scot cannot keep dining out on last season’s Europa Conference League success forever.\n“To be a football supporter, and especially at this club – I came back twice to keep them out of relegation – there’s always going to be bad times,” he added.\n“It was only a few months ago we were having probably the best time West Ham have ever had.\n“Probably the last three years have been as good a time as West Ham have had. Sixth, seventh in the league, a semi-final in Europe, a final.\n“I still think this club has grown and undoubtedly we’ve had a terrible day today. I totally understand them leaving but at football clubs you’re going to have bad days. I certainly wouldn’t forget the good ones.”",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:07:39.553597",
  "_text_extracted": true
}