{
  "article_id": "3426f461b059",
  "url": "https://menafn.com/1107880421/Brera-Holdings-Strategic-Victory-A-Leap-Forward-For-Mozambique-Brera-Tchumene-FC-And-Global-ESG-Ambitions",
  "title": "Brera Holding Strategic Victory : A Leap Forward For Mozambique , Brera Tchumene FC And Global ESG Ambitions",
  "date": "20240221T161500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brera Holdings' Strategic Victory: A Leap Forward For Mozambique, Brera Tchumene FC And Global ESG Ambitions\nDUBLIN, Ireland and Milan, Italy, Feb. 21, 2024 (GLOBE NEWSWIRE) -- Brera Holdings PLC (“Brera Holdings”,“Brera” or the“Company”) (Nasdaq: BREA) is pleased to announce that the strategic acquisition of Manchester United PLC (NYSE: MANU) stock last year, which has seen a remarkable 70% increase in value, has accelerated its investment into one of the Company's professional football teams, Brera Tchumene FC, based in Mozambique. This move underscores Brera Holdings' commitment to its Environmental, Social, and Governance (ESG) strategy, focusing on social impact and inclusivity in the world of professional football.\nThe investment in Brera Tchumene FC is not merely a financial venture but a strategic move to foster economic growth and talent development in Mozambique. Recognizing the importance of social impact, especially with the 2026 FIFA World Cup on the horizon, Brera Holdings is dedicated to nurturing players from disadvantaged backgrounds. The Company's vision for football goes beyond the traditional transfer market, aiming to cultivate talent through bottom-up nurturing, offering opportunities to those who might otherwise be overlooked due to their socioeconomic status and other challenges.\nIn alignment with this vision, Brera Holdings is thrilled to announce the appointment of Mr. Vasco Imparato as the new CEO of Brera Tchumene FC. Mr. Imparato, with his extensive international experience and profound understanding of Mozambique, is uniquely positioned to lead the club in a manner that aligns with Brera Holdings' ESG goals. His appointment signifies a step forward in realizing a more inclusive and socially responsible approach to professional football, leveraging undiscovered markets and unconventional routes to unlock the full potential of local talent.\nReflecting on his appointment and the ESG strategy, Mr. Imparato shared, \"Leading Brera Tchumene FC in Mozambique is not just about football; it's about making a significant social impact. I am eager to drive our commitment to giving players from disadvantaged backgrounds a chance to shine, aligning with the vision for a more inclusive future in professional football.\"\nBrera Holdings' investment in Brera Tchumene FC, coupled with the strategic appointment of Mr. Imparato, reflects a deep commitment to creating sustainable growth opportunities. These efforts are not only for the club and its players but also for the broader Mozambican community, aligning with a global movement towards a more socially aware and inclusive professional football industry.\nABOUT BRERA HOLDINGS PLC\nBrera Holdings PLC (Nasdaq: BREA) is focused on expanding its social impact football (American soccer) business by developing a global portfolio of emerging football and other sports clubs with increased opportunities to earn tournament prizes, gain sponsorships, and provide other professional football- and sports-related consulting services.\nThe Company seeks to build on the legacy and brand of Brera FC, the first football club that was acquired by the Company in 2022. Brera FC, known as \"The Third Team of Milan,\" is an amateur football association which has been building an alternative football legacy since its founding in 2000. The Company owns the trademarked FENIX Trophy Tournament, a non-professional pan-European football competition recognized by UEFA, inaugurated in September 2021 and organized by Brera FC. \"FENIX\" is an acronym for \"Friendly European Non-professional Innovative Xenial.\" BBC Sport has called the FENIX Trophy \"the Champions League for amateurs,\" and Brera FC hosted the 2023 finals at Milan's legendary San Siro Stadium. In October 2022, the Internet Marketing Association at its IMPACT 22 Conference named Brera FC as its award recipient for \"Social Impact Through Soccer,\" recognizing the Company's focus at an international level with this distinction.\nIn March 2023, the Company expanded to Africa with the establishment of Brera Tchumene FC, a team then admitted to the Second Division League in Mozambique, a country of nearly 32 million people. Brera Tchumene FC won its post-season tournament and in November 2023 was promoted to Mocambola, the First Division in Mozambique. In April 2023, the Company acquired 90% of the European first division football team Fudbalski Klub Akademija Pandev in North Macedonia, a country with participation rights in two major Union of European Football Association (\"UEFA\") competitions.\nIn June 2023, Brera acquired a strategic stake in Manchester United PLC. In July 2023, the Company completed the acquisition of a majority ownership in the Italian Serie A1 women's professional volleyball team UYBA Volley S.s.d.a.r.l. In September 2023, the Company assumed control of Bayanzurkh Sporting Ilch FC, a team in the Mongolian National Premier League, which will become Brera Ilch FC when the football season resumes in March 2024. In January 2024, the Company announced the launch of a proactive search for an Italian Serie B football club target designed to bring multi-club ownership of the highest tiers of professional sports ownership to mass investors through the Company's Nasdaq-listed shares. The Company is focused on bottom-up value creation from undervalued sports clubs and talent, innovation-powered business growth, and socially-impactful outcomes. See\nCautionary Note Regarding Forward-Looking Statements\nThis press release contains forward-looking statements that are subject to various risks and uncertainties. Such statements include statements regarding the Company's ability to grow its business and other statements that are not historical facts, including statements which may be accompanied by the words \"intends,\" \"may,\" \"will,\" \"plans,\" \"expects,\" \"anticipates,\" \"projects,\" \"predicts,\" \"estimates,\" \"aims,\" \"believes,\" \"hopes,\" \"potential\" or similar words. Actual results could differ materially from those described in these forward-looking statements due to a number of factors, including without limitation, the Company's ability to continue as a going concern, the popularity and/or competitive success of the Company's acquired football and other sports teams, the Company's ability to attract players and staff for acquired clubs, unsuccessful acquisitions or other strategic transactions, the possibility of a decline in the popularity of football or other sports, the Company's ability to expand its fanbase, sponsors and commercial partners, general economic conditions, and other risk factors detailed in the Company's filings with the SEC. The forward-looking statements contained in this press release are made as of the date of this press release, and the Company does not undertake any responsibility to update such forward-looking statements except in accordance with applicable law.\nCONTACT INFORMATION:\nFOR MEDIA AND INVESTOR RELATIONS\nPierre Galoppi, Chief Executive Officer\nBrera Holdings PLC\n...\nA photo accompanying this announcement is available at\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 1092,
  "scraped_at": "2026-02-14T01:56:44.624166",
  "_text_extracted": true
}