{
  "article_id": "343c4f726ec5",
  "url": "https://www.middleeasteye.net/news/saudi-arabia-pro-league-players-joined",
  "title": "Saudi Pro League : Which players have joined so far ? ",
  "date": "20230728T181500Z",
  "domain": "middleeasteye.net",
  "source_country": "Israel",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saudi Pro League: Which players have joined so far?\nWhen football legend Cristiano Ronaldo joined Al-Nassr in January, it was inevitable that Saudi Arabian football would attract newfound global attention.\nAl-Nassr's Instagram following jumped from under one million followers to almost 15 million immediately, and broadcast rights to the Saudi Pro League were reportedly sold to 36 overseas territories.\nBut few could have predicted that so many more of football's most decorated stars would follow Ronaldo, who is being paid $200m per year, from Europe to Saudi shores in a matter of months.\nSaudi Arabia’s Public Investment Fund (PIF), which already owns English football team Newcastle United, recently acquired majority shares in the league’s top four clubs, Al-Nassr, Al-Hilal, Al-Ittihad and Al-Ahli.\nThose four clubs, along with Al-Ettifaq, have launched an expensive summer of transfer activity in a clear attempt to disrupt Europe's dominance in club football.\nNew MEE newsletter: Jerusalem Dispatch\nSign up to get the latest insights and analysis on Israel-Palestine, alongside Turkey Unpacked and other MEE newsletters\nThe financing of sports teams and events by its sovereign wealth fund forms part of Saudi Arabia’s Vision 2030 strategy to diversify the economy away from oil reliance and improve its international reputation.\nMiddle East Eye breaks down which high-profile international stars have signed for Saudi clubs so far:\nAl-Nassr\n-\nSadio Mane - Reported transfer fee: $40m\n-\nMarcelo Brozovic - Reported transfer fee: $20m\n-\nSeko Fofana - Reported transfer fee: $28m\n-\nAlex Telles - Reported transfer fee: $5m\nRonaldo wasn’t the only international player in the Al-Nassr squad when he joined at the beginning of this year.\nColombian former Arsenal goalkeeper David Ospina and Brazilian forward Talisca, formerly of Benfica, were already at the club.\nSeveral more foreign stars have joined the Riyadh-based team over the summer.\nCroatian midfielder Marcelo Brozovic signed from Inter Milan for $20m, in a deal which will keep him at Al-Nassr until 2026.\nBrozovic won two cups and a league title at Inter, and most recently captained the side in their narrow 1-0 defeat to Manchester City in the Champions League final.\nFor his national team, the 30-year-old was a World Cup runner-up in 2018.\nThe signing of Ivory Coast international Seko Fofana was also confirmed this month, joining from French club Lens in a three-year deal reportedly worth $28m.\nRonaldo will also be joined by his former Manchester United teammate Alex Telles.\nThe Brazil international won the Europa League last season with Spanish club Seville. He joins for $5m, and will be paid $9m per season, according to journalist Fabrizio Romano.\nOn Friday, Al-Nassr agreed a deal with Bayern Munich for the transfer of Senegalese star Sadio Mane, for a fee in the region of $40m.\nMane has won a host of trophies throughout his career, including the Premier League, German Bundesliga, Uefa Champions League and Africa Cup of Nations.\nAl-Ahli\n-\nEdouard Mendy - Reported transfer fee: $20m\n-\nRoberto Firmino - Free transfer\n-\nRiyad Mahrez - Reported transfer fee: $38.5m\n-\nAllan Saint-Maximin - Reported transfer fee: $33m\nJeddah-based club Al-Ahli kicked off their summer of spending with the signing of Senegalese goalkeeper Edouard Mendy for a reported $20m.\nAt his previous club, Chelsea, Mendy won the Uefa Champions League, Uefa Super Cup and Club World Cup.\nHe also starred with a crucial penalty shootout save as Senegal won its first Africa Cup of Nations title in 2021. That year, he was voted the best Fifa men’s goalkeeper.\nMendy’s signing was followed by Liverpool’s Roberto Firmino, another highly decorated former Premier League star.\nThe prolific Brazilian striker scored 111 goals in 362 appearances for Liverpool, where he won the Premier League, FA Cup, League Cup and Champions League.\nEarlier this month, Firmino was mobbed by eager young Al-Ahli fans days after his transfer was announced.\nOn Friday, Al-Ahli confirmed the signing of Riyad Mahrez - arguably one of the greatest African footballers of all time.\nThe Algerian winger, who played for Leicester City and Manchester City, won five Premier Leagues, two FA Cups, three League Cups, a Champions League title and the Africa Cup of Nations.\nNewcastle United winger Allan Saint-Maximin is set to complete an illustrious three-man attack with Mahrez and Firmino.\nNewcastle and Al-Ahli reached a verbal agreement worth around $33m for his transfer - which has raised eyebrows among critics due to both clubs being majority owned by the Public Investment Fund.\nOn Friday, it was reported that Al-Ahli were close to appointing RB Salzburg coach Matthias Jaissle as their new manager.\nThat came after Fulham coach Marco Silva reportedly rejected a whopping $44m over two years to take over the Saudi club.\nAl-Hilal\n-\nRuben Neves - Reported transfer fee: $60m\n-\nKalidou Koulibaly - Reported transfer fee: $25m\n-\nSergej Milinkovic-Savic - Reported transfer fee: $44m.\n-\nMalcom - Reported transfer fee: $66m\nAl-Hilal’s ambitious summer transfer activity has been defined both by players it has succeeded in signing and those it has failed to lure.\nIt kicked off with an audacious attempt to sign Lionel Messi in April, offering the Argentinian icon a salary worth more than $400m a year.\nMessi rejected the deal and eventually ended up at Major League Soccer outfit Inter Miami.\nRemarkably, that wasn’t the biggest Al-Hilal offer: the Riyadh-based club has also given French superstar Kylian Mbappe the chance to earn up to $770m in salary and image rights in just a one-year contract.\nThus far, the Paris Saint-Germain forward appears uninterested in the offer, and has not negotiated with the Saudi club.\nHilal have also attempted to lure top managers Max Allegri and Jose Mourinho from Juventus and Roma in Italy respectively, but were rejected by both.\nDespite the failures, it’s still been a busy summer for Al-Hilal.\nPortuguese midfielder Ruben Neves signed for a huge fee of $60m, a record sale for former club Wolverhampton Wanderers.\nThat was followed up with the signing of Senegalese centre-back Kalidou Koulibaly from Chelsea for $25m, a winner of the Africa Cup of Nations and Coppa Italia.\nNext to sign was Serbian midfielder Sergej Milinkovic-Savic, who signed on a three-year deal from Lazio for $44m.\nEarlier this week, Hilal also confirmed the transfer of Brazilian forward Malcom for $66m from Zenit Saint Petersburg, taking the Riyadh-based club’s summer transfer spending close to $200m.\nItalian midfielder Marco Verratti has also been strongly linked with Hilal, and may complete a star-studded midfield alongside Neves and Milinkovic-Savic.\nAl-Ittihad\n-\nKarim Benzema - Free transfer\n-\nN’Golo Kante - Free transfer\n-\nJota - Reported transfer fee: $32m\nAl-Ittihad were the Pro League club to kick off the Saudi summer of spending, with two of the highest-profile signings.\nKarim Benzema - the current holder of the Ballon d’Or, football’s highest individual prize - completed a free transfer from Real Madrid in June.\nBenzema left Madrid having won 24 trophies, including a joint-record five Champions League titles, as the second-highest scorer in the club's history (behind Cristiano Ronaldo).\nBenzema told reporters during his unveiling that his Muslim faith played a key role in his decision to move to Saudi Arabia.\nHe was later followed by his countryman N’Golo Kante, who joined on a free transfer from Chelsea.\nKante has won two Premier Leagues, a Champions League, and a World Cup, among several other honours.\nJeddah-based Ittihad - Hilal’s bitter rivals - won the Saudi Pro League last season, under the guidance of Portuguese coach Nuno Espirito Santo.\nThe club added Portuguese winger Jota from Celtic for $32m in a three-year deal earlier this month.\nIts latest target is Liverpool midfielder Fabinho - but the two clubs have yet to agree a fee.\nAl-Ettifaq\n-\nMoussa Dembele - Free transfer\n-\nJack Hendry - Reported transfer fee: $8m\n-\nJordan Henderson - Reported transfer fee: $15m\nAl-Ettifaq, based in Dammam on the country's eastern coast, kicked off its busy summer with the signing of a high-profile new manager.\nIt confirmed the appointment of Liverpool legend Steven Gerrard on 3 July.\nGerrard’s video to Ettifaq fans, in which he utters Arabic phrases in his strong Liverpudlian accent, was an instant viral hit on social media.\nThe club’s first major signing of the summer was French striker Moussa Dembele, who signed on a free transfer from Lyon.\nDembele scored 70 goals in 172 appearances for the French club, and was once highly sought after by European clubs.\nThat signing was followed up by Scottish international centre-back Jack Hendry, who joined from Belgian club Brugge for $8m.\nOn Thursday, Ettifaq confirmed the acquisition of England international Jordan Henderson.\nThe former Liverpool captain - who joined for $15m - has won the Premier League, Champions League, FA Cup and League Cup.\nHis transfer has caused controversy in England. Critics have accused Henderson - who has often spoken out about LGBT rights - of ignoring rights abuses against gay people in Saudi Arabia.\nMiddle East Eye delivers independent and unrivalled coverage and analysis of the Middle East, North Africa and beyond. To learn more about republishing this content and the associated fees, please fill out this form. More about MEE can be found here.",
  "word_count": 1525,
  "scraped_at": "2026-02-14T02:03:59.650046",
  "_text_extracted": true
}