{
  "article_id": "3440d9cc5744",
  "url": "https://www.uefa.com/uefachampionsleague/news/028b-1a650001f519-af3a3cf17e91-1000--highlights-report-barca-claim-last-eight-spot/",
  "title": "Barcelona 3 - 1 Napoli ( agg : 4 - 2 ): Blaugrana overcome brave Napoli display | UEFA Champions League",
  "date": "20240313T034500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona 3-1 Napoli (agg: 4-2): Blaugrana overcome brave Napoli display\nTuesday, March 12, 2024\nArticle summary\nGoals from Fermín López, João Cancelo and Robert Lewandowski secured victory in the UEFA Champions League round of 16 second leg against Napoli.\nArticle top media content\nArticle body\nBarcelona reached the last eight of the UEFA Champions League for the first time in four years thanks to an impressive victory against a spirited Napoli side.\nKey moments\n15': Fermín slots in after Raphinha cutback\n17': João Cancelo guides home low effort\n30': Rrahmani cuts deficit with crisp finish\n34': Ter Stegen tips over Di Lorenzo header\n83': Lewandowski taps in from close range\nMatch in brief: Barcelona boss opening stages\nBlaugrana boss Xavi Hernández, who had started with 16-year-old Lamine Yamal in the 1-1 draw in Naples – making him the youngest player to begin a knockout stage match in this competition – kept faith in youth by drafting in 17-year-old defender Pau Cubarsí for his Champions League debut.\nIt was a 20-year-old who broke the deadlock just 15 minutes in, with Fermín López calmly picking his spot after Raphinha's intelligent delivery.\nThe Brazilian international was instrumental in Barcelona doubling their lead just over two minutes later, collecting a pass following a storming run from deep by Yamal, before cutting inside and striking the post with a curling right-footed shot. João Cancelo was quickest to the rebound, sweeping his low effort into the net out of Alex Meret's reach.\nDespite that quickfire two-goal Barcelona blast, Napoli soon grew in confidence, enjoying more possession and profiting from an incisive passing move down the flank. Matteo Politano's darting run to the byline and precise centre allowed Amir Rrahmani to place a crisp finish into the far corner.\nPolitano almost pulled his side level soon after the half-hour mark, but his looping header from an inviting Mário Rui cross was acrobatically tipped over by the agile Marc-André ter Stegen.\nAfter a frantic first half, both teams kept up the pace after the restart as they went in search of the fourth goal of the game. Khvicha Kvaratskhelia and André-Frank Zambo Anguissa were unable to apply the finish in promising positions, while Meret twice denied the lively Raphinha.\nIt took a smart reaction stop from Meret to repel İlkay Gündoğan down at his near post after the latter's clever turn and strike.\nWith just under 15 minutes left, Gündoğan's unselfish lay-off afforded Yamal the opportunity to become the youngest scorer in UEFA Champions League history, but his curling effort flashed wide of the upright.\nNapoli substitutes Mathías Olivera and Jesper Lindstrøm almost restored parity, yet the Dane's glancing header flew the wrong side of the post for the Serie A outfit.\nMinutes later Barcelona restored their two-goal cushion. Gündoğan's through ball picked out the run of replacement Sergi Roberto, who teed up Robert Lewandowski for a simple finish.\nWith added time looming, there was still time for Olivera to strike the crossbar for the visitors, as Barcelona held firm.\nPlayStation® Player of the Match: Pau Cubarsí (Barcelona)\n\"An outstanding game for the youngster. Defensively strong, and very brave in the build-up – qualities that are not easy in such a big game.\"\nUEFA Technical Observer panel\nGraham Hunter, Barcelona reporter\nThere were moments here, there were flashes of what has made the Blaugrana legend well-regarded and fascinating around the world. Xavi brought thrills, confidence, chance creation from his young team – and made qualification look likely. The crowd loved it, they roared into the Catalan night sky. And then there was that ultra-tense finale. This was high-class Champions League entertainment.\nVieri Capretta, Napoli reporter\nNapoli's adventure in this season's Champions League comes to a close, but not without a brave showing until the end. The Partenopei had spells controlling possession and creating chances, but Barcelona were more clinical and showed their quality overall. The reigning Italian champions tried their best, with Lindstrøm close to equalising just before Barcelona's third. Football in a nutshell. Napoli are out, but can give themselves credit.\nReaction\nFermín López, Barcelona midfielder: \"That's four years this club has waited to qualify for the quarter-finals of the Champions League – this means real joy for the squad, the coach and the fans. It was important that we started this match really well. We had some chances and, after a few hits on goal, mine went in. I'm very happy with that.\"\nXavi Hernández, Barcelona coach: \"We played a great match. My team left everything out there. We dominated large parts of the game and I'm really proud of them for that. This is a moment for us to really enjoy.\"\nFrancesco Calzona, Napoli coach: \"We gave them too much space, we lost possession often. The game had different phases, we did well at times and almost equalised. Of course, if you lose, it means something didn't work. We were ready to face a strong opponent, but we made too many mistakes.\"\nAmir Rrahmani, Napoli goalscorer, speaking to SportMediaset: \"We can go out with our head held high. We took risks and played our football, but we didn't take our chances. We created a lot, but didn't score when we should have.\"\nGlenn Hoddle, TNT Sports\n\"Barcelona were too good for Napoli. They have got some talent in there. Napoli responded when they found themselves 2-0 down. They had a couple of really good chances. Had they put them away, it would have been a different story.\"\nKey stats\n- Cubarsí (17 years and 50 days) became the youngest player to make his debut as a starter in the UEFA Champions League knockout stage.\n- With Cubarsí and Yamal (16 years, 243 days) in the starting eleven, Barcelona became the first side to hand starts to two players aged 17 or under in a knockout match in this competition.\n- Barça's two-goal advantage after 17 minutes was their earliest lead by that margin in a Champions League fixture since April 2009, when they were 2-0 up after 12 minutes versus Bayern.\n- Lewandowski's strike took his goalscoring record at this stage of the tournament to 19 goals in 22 round of 16 outings.\n- The Blaugrana have not lost the second leg in any of their last 17 UEFA Champions League round of 16 ties.\nFantasy star performers\nAmir Rrahmani: 9 points\nRaphinha: 9 points\nJoão Cancelo: 8 points\nPau Cubarsí: 8 points\nLine-ups\nBarcelona: Ter Stegen; Koundé, Ronald Araújo, Cubarsí, João Cancelo; Fermín (Sergi Roberto 60), Christensen (Oriol Romeu 60), Gündoğan; Yamal, Lewandowski, Raphinha (João Félix 81)\nNapoli: Meret; Di Lorenzo, Rrahmani, Juan Jesus, Mário Rui (Mathías Olivera 64); Zambo Anguissa, Lobotka, Traoré (Raspadori 78); Politano (Lindstrøm 64), Osimhen, Kvaratskhelia (Ngonge 90)\nWhat's next?\nBarcelona enter the quarter-final and semi-final draws on 15 March. The quarter-final ties take place on 9/10 and 16/17 April.",
  "word_count": 1140,
  "scraped_at": "2026-02-14T02:17:27.958595",
  "_text_extracted": true
}