{
  "article_id": "344501179798",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=344819",
  "title": "Sjoeke Nusken extends contract with Chelsea",
  "date": "20251006T173000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sjoeke Nusken extends contract with Chelsea\nChelsea is delighted to announce Sjoeke Nusken has signed a contract extension at the club until the summer of 2027.\nThe 24-year-old joined the Blues from Eintracht Frankfurt in her native Germany ahead of the 2023/24 campaign, and made her debut in our opening day win against Tottenham that season.\nThe Germany international caught the eye early on after joining Chelsea, when she netted her first career hat-trick during a 4-2 league win over Brighton & Hove Albion in October 2023.\nNusken made 38 appearances and scored 12 goals in all competitions during her first season in blue, on the way to winning the Womens Super League title on the final day of the campaign.\nThe midfielder was also a vital part of the domestic Treble-winning campaign under Sonia Bompastor in 2024/25, making 36 total appearances and scoring five goals.\nUpon signing her new deal, Nusken said: Im very happy to have another year at Chelsea, to stay another year with my team. We have a big year coming up, and hopefully, we can achieve the Champions League title. We want to achieve a lot of things together.\nHead of womens football Paul Green added: Were really pleased that Sjoeke has renewed with Chelsea. She has been an important part of the success that weve had over the last couple of years, and were looking forward to seeing her contribute again in the current campaign.\nA combative, technical and athletic midfielder who can play in both a defensive and box-to-box role, Nusken was nominated for the Ballon dOr after her first season at Chelsea, finishing 25th in the list of the worlds best players.\nAt international level, Nusken rose through the ranks and represented Germany across their Under-17, Under-19 and Under-20 sides before earning the call-up to the senior team.\nShe represented Germany at the 2023 FIFA Womens World Cup and was a regular for her nation during her first Chelsea season. Ahead of her second campaign with the Blues, she travelled to her maiden Olympic Games, held in Paris.\nThere, Nusken won a bronze medal, playing the full game as Germany edged past Spain 1-0 in Lyon. In the semi-final, her side lost to Emma Hayes USA, the eventual gold medallists.\nThe midfielder was also integral to Germanys run to the Womens Euro 2025 semi-final, scoring twice in her four appearances at the summer tournament.\nEveryone at Chelsea is thrilled Sjoeke has extended her stay at the club, and we look forward to seeing her continue to thrive in blue!\n( Press Release Image: https://photos.webwire.com/prmedia/8/344819/344819-1.png )\nWebWireID344819\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 457,
  "scraped_at": "2026-02-14T02:09:24.912005",
  "_text_extracted": true
}