{
  "article_id": "346bb986cc25",
  "url": "https://www.caughtoffside.com/2024/07/04/transfer-news-ugarte-man-utd-xavi-simons-swap/",
  "title": "Transfer news : Ugarte Man United , Xavi Simons swap",
  "date": "20240704T200000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on the Daily Briefing, a subscription service. If you would like to receive Jonathan Johnson’s exclusive transfer articles via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\nGood time for PSG to sell Manuel Ugarte to Manchester United\nManuel Ugarte has been discussed as a transfer target for Manchester United and it’s an interesting story after he only arrived at PSG last summer to great fanfare. He joined from Sporting Lisbon for a big price tag and started well, though he then dropped off quite significantly, especially after PSG’s Champions League adventure started.\nI think the biggest issue for Ugarte at PSG was that he was signed before Luis Enrique’s arrival as manager was properly finalised. Enrique simply doesn’t play in a style that has space for someone of Ugarte’s profile. He was not signed off by Enrique, so when he inherited the squad, as much as others at PSG thought he would be a good signing, the Uruguayan has ended up being one of a number of signings from last summer to have not quite bedded in as well as many would have expected.\nSo, Ugarte to United seems to have gathered pace quite significantly and it’s not too surprising. I think Ugarte is tailor-made for the Premier League and I think the drop-off from Casemiro in the season just gone means it’s normal United would be looking for a profile like that to replace him.\nIt’s also a good time for PSG to sell Ugarte because he’s in good form for the Uruguay national team at Copa America, so the fact that he’s performing well at an international tournament means his value won’t drop as drastically as it may have done as he’s not been that important at club level in the second half of last season. So it makes sense for PSG, United, and for the player.\nA lot of the interest in Ugarte prior to his move to PSG was from clubs in Italy, and it would probably now be quite difficult to find as many Serie A teams who can pay the same sort of fee and wages that United can, so that would have been difficult for PSG in terms of extracting the best possible value from him this summer.\nIt’s a critical moment as well because if this drags on and Ugarte finds himself out of favour with Enrique at the start of the new season with PSG, it will become that much harder for them to command the kind of fee they’ll want, and perhaps even half what they paid for him 12 months ago. If he goes now, PSG won’t make as much of a loss.\nHard to see potential for PSG-United swap deals\nThere’s also been talk of PSG and United discussing a few other players as well as Ugarte, but it’s hard to see anyone in Erik ten Hag’s squad that would be what PSG are looking for right now.\nThere are of course a couple of United players that have been looked at by PSG in the last few years, for example Marcus Rashford, but it’s hard to see anyone that would make sense as being part of a deal for Ugarte. There are some potentially interesting profiles like Willy Kambwala, for instance, who could develop in the future and who could be useful cover for the injured Lucas Hernandez, who is likely to miss much of next season.\nOther than that, I think it’s very difficult to identify a top player outside of Rashford who PSG might have thought there’s something they can do with. The only others who’d interest PSG are surely players United wouldn’t be ready to let go. Ugarte is a good midfield destroyer, but he’s also not the most eye-catching of players, so there will probably be a temptation in the end to jus stick to a cut and dry transfer fee that suits both clubs best, rather than any star names getting involved in the other direction.\nJean Clair-Todibo may snub West Ham transfer to stay at Nice\nJean-Clair Todibo’s potential move to Manchester United now looks problematic due to both INEOS-owned Nice and Man United being in the same European competition next season, catching the attention of the footballing authorities.\nThe situation with Todibo remains open, with the main offer coming in so far this summer being from West Ham, I believe, and though a move to the Premier League would appeal to Todibo, it’s not, I’m told, the destination he had in mind, as it’s not the same calibre of other clubs who’ve been chasing his signature in the last few months.\nMy understanding is that there’s now more of a willingness from Todibo to see how things go at Nice this coming season. There is the feeling that there could be an interesting project worth staying on for at Nice, though there might also be a willingness to wait and see if the United and Nice links via INEOS are cleared up in the next 6-12 months.\nTodibo won’t miss out on European football if he stays this season at Nice, and he might look at the France squad at Euro 2024, and think that, although William Saliba has now made a starting place his own, there might be an opportunity to partner him in Didier Deschamps’ side at the expense of Dayot Upamecano.\nIt’s important for Todibo to consider the right move so he can be in the best position possible to put pressure on for that place with Les Bleus at the 2026 World Cup. These will all be considerations, so I think it’s safe to say West Ham don’t live up to Todibo’s expectations given the calibre of clubs to be linked with him in the last year or so.\nKingsley Coman to PSG is one to watch following Michael Olise to Bayern deal\nThe situation with Kingsley Coman looks pretty intriguing now that Michael Olise is close to joining Bayern Munich, who we also know are looking to move a few players on this summer. PSG are a club who could end up doing business with Bayern because of Xavi Simons – it’s difficult because PSG really don’t want to let him go, but it could be that Bayern will come to the table with players on offer.\nIf that happens, one name likely to be discussed could be Coman. He’s home-grown, which is important to PSG, so I think there’d be some consideration from them towards Coman, even if the downsides are that he’s quite injury prone and would be on a high salary.\nIt’s impossible to see Coman going anywhere else in France at the moment, given the concerning issue of there still being no TV deal in place – a major problem for French football as a whole. I do think Bayern’s purge won’t stop at Coman, there are a number of other players they’d like to move on and I think Joshua Kimmich is another PSG will be keeping an eye on, while there’s potentially also interest in Mathys Tel, who we know is not happy to be staying behind Harry Kane in the pecking order in Munich.\nIf PSG end up doing a deal for Xavi Simons in the end, it is likely to focus on one or maybe even two Bayern players moving in the other direction, so Coman could be one to be included in the deal, but there’s still a long way to go until. Simons’ Euros with the Netherlands is over. So there’s no movement on that front right now even if Bayern have very much positioned themselves to pick him up.\nIn terms of Olise going to Bayern, it’s an interesting move. It’s quite a big jump to go from Crystal Palace to a big club like Bayern, but I think he’ll get the developmental programme laid out in front of him that he probably needs to get up to speed. I do think Bayern are looking to go in a different direction now, so if Olise manages to get regular minutes that will put him on Deschamps’ radar, but I do think it’s going to be quite a challenge as well, so a lot will depend on how quickly he adapts and makes himself a contender for regular selection.\nI think it’s a good move for Bayern and for Olise, but there is substantial risk attached as well, as I thought when he was previously also linked with PSG and other big clubs.",
  "word_count": 1429,
  "scraped_at": "2026-02-14T02:01:23.797874",
  "_text_extracted": true
}