{
  "article_id": "346caf88f7f7",
  "url": "https://www.arsenal.com/news/everything-you-need-know-about-villarreal",
  "title": "Everything you need to know about Villarreal",
  "date": "20250804T121500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We’re back on home soil for the first time in 2025/26 when Villarreal arrive at Emirates Stadium for friendly action, and we’ve got plenty of history with the La Liga side.\nBoth sides will be gearing up for another campaign that could see us meet again in the Champions League, but how much do you know about the Yellow Submarine? Get acquainted with their background, manager and current stars:\nThe history\nThe club was founded in 1923 and would spend the next 40 years in Spain’s regional leagues before reaching the second division for the first time in 1970. After slipping back to the fourth tier, they worked their way back up and in 1998 they finally reached La Liga.\nNicknamed the Yellow Submarine because of their kit, they would enjoy plenty of European success by winning two Intertoto Cups, reaching the UEFA Cup semi-finals in 2003/04 and two years later they reached the same stage of the Champions League thanks to a third-place finish in La Liga.\nThey would better that by finishing runners-up in 2008 but four years later they suffered relegation. They bounced back straight away and in 2021 lifted their first major silverware when they won the Europa League final against Manchester United, earning them a spot in the Champions League the following season that saw them again reach the final four.\nThe stadium\nVillarreal have played their home games at the Estadio de la Ceramica, or more commonly known as El Madrigal, since 1923. Its capacity is 23,008, which means half the population of the city of Villarreal could fit inside it.\nIt underwent remodelling in the 1950s and again in 2005 to get it up to UEFA standards ahead of their first Champions League campaign. Further works have taken place in the last few years to modernise it ahead of its centenary.\nThe manager\nMarcelino has been in charge of Villarreal since November 2023. A former attacking midfielder, he represented Sporting Gijon in the top-flight but retired at 28. His first big break in coaching with the same team before switching to Recreativo de Huelva whom he guided into La Liga in 2006 and won Spain’s Manager of the Year the following campaign.\nSuccess at Santander and Real Zaragoza followed before he first arrival at Villarreal in January 2013 after a short stint at Sevilla. He returned them to the top-flight, achieved three top-six finishes and reached the Europa League semi-finals in 2015/16 before departing after three-and-a-half seasons.\nAnother Manager of the Year award and a Copa del Rey arrived managing Valencia, but he would lose the next two finals when in charge of Athletic Bilbao. A seven-game spell at Marseille was then followed by his return to Villarreal where he finished eighth at the end of the first campaign back.\nLast season\nMarcelino’s first full season at the helm following his return saw the Yellow Submarine improve to a fifth-place finish, qualifying them for the Champions League in 2025/26. They remained in the hunt right throughout the season, although there was a scare when they dropped to sixth in late April, but six straight wins to finish off the campaign saw them return to Europe’s premier club competition once again.\nWith European football now on their agenda for the first time in five years, they could focus solely on the La Liga campaign, especially as they exited the Copa del Rey in the second round to fourth-tier Pontevedra. The goals of former Newcastle United striker Ayoze Perez fired them to success, as he netted 19 in the league in his first campaign at the club.\nThe squad\nAs well as Perez, there are plenty of former Premier League players within Villarreal’s ranks, including a pair of ex-Gunners. Nicolas Pepe arrived from Trabzonspor 12 months ago and hit three goals in 28 appearances, while former loanee Denis Suarez is in his second season at El Madrigal.\nWorld Cup winner Juan Foyth represented Tottenham Hotspur, who plays in defence alongside Manchester United youngster Willy Kambwala, while former Bournemouth, Tottenham and Everton winger Arnaut Danjuma has returned from a loan at Girona.\nSpanish international striker Gerard Moreno is the club’s all-time record scorer with 101 to his name across two spells, while right-winger Yeremy Pino was a member of Spain’s Nations League-winning squad in 2023. Captain Dani Parejo had a spell at Queens Park Rangers back in 2008 before playing nearly 400 times for Valencia and has amassed 229 appearances for his current club.\nThe summer so far\nFollowing the departure of influential attacking midfielder Alex Baena to Atletico Madrid and striker Thierno Barry to Everton for a combined £62 million, Villarreal have spent £13 million of that windfall on winger Alberto Moleiro from Las Palmas, while his Spanish under-21 teammate Rafa Marin has joined on loan from Napoli.\nAnother £8.7 million has secured the signing of Uruguayan centre-back Santiago Mourino from Atletico Madrid while Canadian international winger Taion Buchanan has seen his loan from Inter Milan made permanent. Another ex-Red Devil in Eric Bailly was released at the end of his contract, while Spanish legend Raul Albiol also left on a free transfer aged 39.\nA packed pre-season has seen a pair of draws in Switzerland against Basel and St Gallen, before a 1-0 loss to Sporting Lisbon was followed by a 3-1 defeat to Genoa and a goalless draw with Real Oviedo. Saturday saw them visit Leeds United and earn a 1-1 draw.\nThe previous meetings\nWe have faced Villarreal six times in European competition, all across two-legged knockout ties. The first meeting between the teams came in the aforementioned 2005/06 Champions League semi-final, where a Kolo Toure goal secured a 1-0 win on Highbury’s final European night, while a Jens Lehmann penalty save from Juan Roman Riquelme sealed a 0-0 draw in Spain and our passage to the final.\nThree years later we met at the quarter-final stage, and after Emmanuel Adebayor cancelled out Marcos Senna’s opener at El Madrigal, we won 3-0 in north London when the Togolese netted as well as Theo Walcott and Robin van Persie. Our last encounters came in 2021 in the Europa League semi-final when a 2-1 defeat in Spain proved costly as we could only manage a goalless draw in the second leg at Emirates Stadium.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1077,
  "scraped_at": "2026-02-14T02:09:18.620209",
  "_text_extracted": true
}