{
  "article_id": "347768d3d490",
  "url": "https://www.themag.co.uk/2024/02/letters-to-the-mag-newcastle-united-fans-and-odd-manchester-united-fan-having-their-say/",
  "title": "Letters to The Mag - Newcastle United fans ( and odd Manchester United fan ...) having their say",
  "date": "20240224T184500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Letters to The Mag – Newcastle United fans (and odd Manchester United fan…) having their say\nThe opinions continue to flow into The Mag, as Newcastle United fans debate the various issues affecting our club.\nWhether it is events on or off the pitch, always plenty to talk about.\nNewcastle United fans with the latest collection of opinions below, plus the odd visitor from elsewhere…\nContributions are sometimes too brief to make up into a full article and so we have gathered up a number of recent comments sent in, relating to issues at Newcastle United (if you would like to send anything in, long or short, then contribute@themag.co.uk is the place):\nDear Mag,\nI have said for years that Ratcliffe is a wrong un, he was linked with buying both us and Chelsea.\nThat speculation went on for some time on both clubs and he was always keen to come out and speak publicly, very arrogant if you look back at how he went on.\nHe clearly loved having himself in the media and whilst I obviously hated Ashley and would have taken Ratcliffe as an owner instead, I thought he came over really badly. As you can see already with Man U, Sir Jim is already very very keen to be in the media.\nI think it is very Emperor’s New Clothes, he is telling Man U fans what they want to hear and they are lapping it up, especially because he isn’t the Glazers, yet he hasn’t bought the Glazers out, he has instead came in as a junior partner to get his snout in the trough as well, whilst at the same time propping up the Glazers and diverting criticism away from the majority owners.\nI reckon it will take maximum two years for Man U fans (like Mackems with Donald and Methven) to realise Sir Jim is no different to the Glazers.\nCheers\nTrev T\nDear Mag,\nUnited are back.\nNow we have Sir Jim leading us, showing we can do whatever we want.\nTake anybody from any other club.\nAshworth this time, in the summer we might decide to come and get Isak and your Bruno.\nBe afraid Geordies, be very afraid.\nFrank\nDear Mag,\nIts never easy to play without a real striker, that leads the lines and is the start of defence when not having the ball.\nAs I see it, only Wilson fits that bill in Newcastle, hassling opponents from the top, both with or without the ball.\nIsak is more of a striker that seems to drift in and out of a game. While he’s good when we have the ball, I’ve noticed that he doesn’t waste too much energy chasing defenders in the opponents build up play. In many cases you can say he’s more of a winger than a striker.\nWhile Gordon does have many of the qualities that define a striker, I feel it’s a bit too early for him to be played up there. Half a year as an understudy under Wilson to change his mindset would do him a world of good and might provide us with a future world class striker.\nAnd while Gordon still is on the learning curve, I would suggest that Howe could put Schar up front as our striker and a focal point.\nSchar has always liked to venture forward and shoot. He also knows the mechanics and importance of defending very well, and I’m sure that he has got the experience and qualities to fill a striker’s role quite well.\nI might sound like a couch-manager. Which I also am, sitting up here in Norway seeing it all (or miss it all) from a telly’s point of view.\nBut in the absence of fit, recognised strikers this is a thing I at least would have considered.\nAudun Steen\nDear Mag,\nAll you people jumping on the band wagon and a TT arting to shout for Eddie’s hide no concern about the injured players. Squeeling because he sticks w Dan Burn who by the way was not to blame for either goal (against Bournemouth). Be careful what you wish for. It hasn’t took long to for a few of you to start acting like the man U supporters who think they are god’s gift to football punditry\nWilliam\nDear Mag,\nWe are nufc fans and have been discussing the possibility of a new larger stadium.\nHaving had many discussions with the wife regarding NUFC stadium the time for a new larger stadium is upon us…\nWe have came up with an idea to keep the original NUFC stadium and turn it into a sort of museum for past and present players, also shops to sell merchandise and as for the pitch there could be large screens put up to allow any fans who cannot get to see the game live, they could sit in the old stadium and watch the game steeped in the history of St James’ Park, there could be food and drinks etc….\nObviously there is a lot more to it and many more ideas floating around in our heads but it’s food for thought…\nMany thanks\nCraig and Vicky\nDear Mag,\nI think everybody just needs to calm down.\nStay behind Eddie and the players and accept this season was never meant to be.\nI honestly reckon it could have been a great one and I have no doubt that even with just half the injury problems we have had, NUFC would now be in the Champions League knockout stages and currently top four in the league as a minimum.\nThis season COULD still be great, maybe not in the league although I think we can still make sure of top six or seven, but in the FA Cup we have great chance. Get past Blackburn and good home draw, we are then talking about semi-final and Wembley.\nThen keep things together and get everybody ready for a big go next season, with a few signings in the summer as well.\nWe all agreed it would take time to build a squad and that is what is happening at NUFC.\nAlan Davison\nDear Mag,\nHow funny is this, Newcastle giving it the big one.\nThinking can stand up to us when United come calling.\nReckoning you can stop Ashworth joining us, unless we pay ridiculus money.\nThat isn’t happening. You can’t stop him moving with this gardening leave carry on, as Sir Jim Ratcliffe says, not how law works here.\nWe’ll have him at Old Trafford in a few weeks time and he’ll have a shopping list of Newcastle players for us to take off yous as well at the end of the season.\nYours\nThe Stretford End\nDear Mag,\nI don’t know how everyone else feels about this but after considering the whole episode in some detail I’m angry (as I’m sure are Amanda Staveley and co.) about how pre-meditated this move looks.\nTo think that Ashworth invited his big pal Dave Brailsford (DR. No) to the training ground to oversee how the whole enterprise ran is a little disconcerting to me to say the least.\nI never forget my old Northern Irish Grandfather telling me about the time the powers that be invited a Chinese delegation into Harland and Wolf, the shipyard he worked in after the war, in they strode with their instamatics and took pictures of the ships being built and asked endless questions about the best way in which to achieve this. It all seemed innocent enough and in a time of peace it was seen as a way to improve international relations. Fast forward a few years and Shipbuilding in Britain was decimated largely due to international competitors building ships at a greater rate and a cheaper price but the galling thing was we’d shown them all how to do it!!\nI’m labouring the point I know but Im seeing similarities in what’s going on here with Dodgy Dave and his Pal who I’ll now refer to as Dodgy Dan.\nHow long has this move been in the offing and what secrets or little pearls of wisdom did he glean from this visit? How much we will never know, how long it had been mooted privately will also be a closely guarded secret, what we do know is that there’s a smell of Rat in the air – can anyone else smell it?\nI’m absolutely convinced that the streetwise Amanda Staveley and co. will be very suspicious hence one of the reasons they’ll be privately fuming about the whole debacle irrespective of what Darren Eales has said publicly.\nI think the most entitled football club in the country has inadvertently taken our owners for fools and they simply won’t accept that, as a consequence I expect Ashworth will be tending his garden for some time to come, one thing is for certain is, his particular ship has definitely sailed!!\nAlbert Stubbins\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1505,
  "scraped_at": "2026-02-14T02:07:39.548031",
  "_text_extracted": true
}