{
  "article_id": "3494a5253671",
  "url": "https://www.thisdaylive.com/index.php/2025/05/03/joe-aribo-lord-of-the-manor/",
  "title": "Joe Aribo Lord of the Manor ? – THISDAYLIVE",
  "date": "20250503T110000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nJoe Aribo Lord of the Manor?\nThough he started his English football career in the Championship and had once sank with Southampton to play in the English second tier, but what Nigeria international, Joe Aribo would not want again is another life in the EFL as Southampton was relegated after one season in the Premier League. However, the only club that has so far shown serious interest in the Nigerian is a small Turkish Super Lig side, Gostepe. The big question is if the Europa Cup silver medalist would want to be a big fish in a small pond?\nTurkish Super Lig club, Gostepe, are plotting a move for Super Eagles midfielder, Joe Aribo during the summer transfer window.\nAribo has established himself as an important player for Southampton over the past two seasons. He left Rangers for St. Mary’s three seasons ago, but he struggled to get minutes, as the club dropped down to the Championship.\nHowever, he grew into the team last season and became a starter. The Super Eagles star featured in 40 games for the Saints in all competitions. And this season, he has featured in 35 of Southampton’s games. Aribo has even had to play out of position at times.\nUnfortunately for him, his performances have not been enough for the Saints, as they are rooted to the bottom of the Premier League, condemned to Championship football next season.\nWith Southampton confirmed as a Championship side next season, some players are expected to leave the club in the summer, and Aribo could be one of them.\nAccording to Transfer feed, Turkish Super Lig club Goztepe are keeping tabs on Aribo ahead of a potential transfer in the summer. The Super Eagles star still has one year left on his contract, and he is valued at €6 million, which is a price that Goztepe should be able to afford.\nAlthough Göztepe might be able to afford Aribo’s price and his salary, the club might be a bit too small for him. The club currently sits eighth on the Super Lig table. In fact, this is their first season in the Turkish top-flight after two years in the second tier.\nSo, they are not stable enough and can even still drop to the second league next season. If Aribo moves to Turkey, he is expected to look at a club that is more settled or a mid-table club.\nNonetheless, in the coming weeks, Aribo should get more suitors. Then he will have to decide whether to help Southampton plot their return to the Premier League or to leave.\nBefore Southampton was finally relegated, Aribo had expressed his determination to solidify his place as a Premier League player.\nThe 27-year-old, who began his journey in English football in the Championship before a successful stint in Scotland with Glasgow Rangers, which ultimately led to his move to Southampton said: “I want to mark my stamp as a Premier League footballer—that’s a dream of mine. I just want to be acknowledged as a very good player, nothing too crazy, but I know what I am capable of.”\nThe Nigeria international added, “I know the abilities I have, and I believe my purpose is to showcase them for the world to see.”\nAribo was one player who risked becoming a villain with his comments before Southampton’s final blow. The Nigeria international said that he was personally embarrassed by Southampton’s situation. He also admitted that being compared to Derby County, the record holders of the worst Premier League season ever was something that he cannot stop thinking about.\nIn his own words, Aribo said: “I’m going to speak for myself personally, of course, it’s embarrassing. We play football to win. I’m a winner and it’s just a difficult time in my career for me, obviously, with what’s going on with results. I think the boys have to stick together.”\nThen, Aribo added: “Of course, you’re going to be thinking about that (matching Derby’s record). Like I said, for me, embarrassment creeps in and then the boys have to stand up, we have to be accounted for. We have to just work together and let that pride kick in for us and have some pride and dignity.”\nMeanwhile, Southampton are hoping to tempt Aribo to remain at the club with the potential arrival of former Rangers boss Steven Gerrard, as the Saints prepare for another season in the Championship.\nThe versatile Nigerian midfielder, who previously enjoyed a successful spell under Gerrard at Rangers where they famously won the Scottish Premiership together, has recently suffered his second relegation with Southampton since joining the club in 2022.\nThough Aribo stood out among his Southampton teammates for his competitive nature and willingness to challenge the poor work ethics displayed by some members of the squad during their disappointing Premier League campaign, but it was not enough to save the Saints.\nThe 28-year-old’s commitment to restoring Southampton’s dignity has been evident throughout his time at St. Mary’s, where he has made 102 appearances, scoring nine goals and providing one assist since his move from Rangers.\nWith Aribo’s contract running until the summer of 2026, Southampton face a challenge to keep hold of a player of his calibre in the second tier of English football, despite his previous experience of playing in the Championship.\nAccording to a report from EFL Analysis, Southampton are seriously considering appointing Gerrard as their new manager, which could prove decisive in convincing Aribo to stay put rather than seek a new challenge elsewhere.\nThe potential reunion between Aribo and Gerrard has sparked optimism among Southampton supporters, many of whom remember their productive relationship at Rangers, where Aribo played 149 times under the Liverpool legend’s management.\nOne of Aribo’s most memorable moments during his time in Scotland came in the 2022 Europa League final, when he put Rangers 1-0 up against Frankfurt before the Scottish side eventually lost on penalties.\nSouthampton’s fall from the Premier League has been painful for all associated with the club, and securing key players like Aribo will be essential as they aim to make another immediate return to the top flight with a statement campaign in the Championship.\nThe midfield stalwart’s decision may ultimately hinge on whether Southampton can finalise Gerrard’s appointment, with their shared history potentially providing the foundation for a successful partnership at St. Mary’s, even if only for a single season.\nIt, however, remains to be seen whether Aribo would want to sink for the second time with Southampton or join Gostep, where he would be a big fish in a small pond.\nMan City Go Third in Race for Europe\n“Kevin de Bruyne scored the only goal on his penultimate game at Etihad Stadium as Manchester City beat Wolves and moved up to third in the Premier League.\nPep Guardiola’s side extended their unbeaten run to nine games while moving four points clear of sixth-placed Nottingham Forest as the race to qualify for next season’s Champions League continues.\nManchester City have won four consecutive Premier League matches for the first time since their 13-match winning run between April and September 2024.\nThey travel to relegated Southampton next weekend before hosting Bournemouth, completing the campaign with a trip to Fulham.\nOn Thursday night, a 2-0 defeat at home against Brentford, who hold their own European ambitions, left Forest sitting sixth and up against it in their bid to secure a first appearance in Europe’s premier competition since 1980.\nIt is the first time Forest have lost successive home fixtures in the Premier League this season.\nThey must now rely on sides above them to drop points while also finding a way to address their own form, having lost three of their past four league outings.\nThere are still just five points separating Aston Villa in seventh with fourth-placed Newcastle.”\n“Pep Guardiola has said his side’s season has not been good enough, but they are hitting their stride at just the right time, reaching the FA Cup final last weekend and extending their unbeaten run to nine games on Friday.\nCity have slipped off the top and been knocked out of the Champions League early in their patchy campaign, and the result against Wolves was just the second time this season they had won five games in a row.\nThe hosts were given a stern test by an impressive Wolves outfit, but as good sides do they managed to hold firm before hitting their opponents with a goal against the run of play.\nSpeedy winger Doku proved to be a menace from the left throughout the game and it was his low cross on 35 minutes which was converted by De Bruyne.\nThe captain is approaching the end of his City career and Wolves will be more than happy to see the back of him, as De Bruyne has contributed six goals and five assists against them during his 11-year spell with the club.\nOmar Marmoush blazed over and Mateo Kovacic scuffed wide, but City held on for a significant victory after Forest were beaten at home by Brentford on Thursday.\nWith league games remaining against already-relegated Southampton, Bournemouth and Fulham, City know victories in those matches will assure them a place in Europe’s elite next term.”",
  "word_count": 1542,
  "scraped_at": "2026-02-14T01:49:31.502183",
  "_text_extracted": true
}