{
  "article_id": "34a9a850473c",
  "url": "https://www.90min.com/posts/michael-owen-key-signings-liverpool-2023-24-season",
  "title": "Michael Owen insists key signings will help  top clas Liverpool compete next season",
  "date": "20230308T141500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michael Owen insists key signings will help 'top class' Liverpool compete next season\nMichael Owen believes Liverpool do not need major surgery on their squad this summer and insists one or two additions in midfield will put them back in the mix for top honours next season.\nLiverpool recently beat fierce rivals Manchester United 7-0 at Anfield, though they have also suffered some heavy defeats and put in below par performances on occasion. Jurgen Klopp's side are competing for the top four but not matching pre-season expectations of a title challenge as it stands.\nSome have identified performances this season as the potential end of an era for Klopp's squad - who were close to completing an unprecedented quadruple last year - but Owen revealed exclusively to 90min that he believes Liverpool's \"top class squad\" will be back among Europe's strongest clubs next season with the right signings.\nThe former Reds striker was speaking exclusively to 90min as the ambassador of the UEFA Champions League at a recent pop-up event in west London organised by OPPO, the smartphone company who are the official global partner of the UEFA Champions League.\nOPPO looks to empower football fans’ experiences with its advanced imaging technology to witness, capture and share heart-stopping moments on the pitch, through the new OPPO Find N2 Flip smartphone.\nReflecting on what's gone wrong on the pitch this season for his old club, Owen hinted a few small issues may have contributed to a problem which isn't as large as some seem to believe.\n\"In football, it's never one thing - everybody always looks for that magical answer, that key to revival and past glories, but the reality is it's never just one thing that fixes everything,\" Owen said.\n\"Some people think it's injuries, some people think it's losing great players like Sadio Mane. Some people think it's an ageing team, some people think they've not got the energy, others think the ownership or the manager is not right, or the players are not right.\n\"The reality is that this team, only a few months ago, were two games off being the most decorated team of all time. Players do not go bad overnight.\n\"Jurgen Klopp, the ownership, these players - they've proven it at the absolute highest level. They've won the Champions League, they've won the league, they've done everything. So I'm not one for thinking 'everything's going wrong, let's rip everything up'.\n\"Liverpool had a really bad season a few years ago, during COVID, lost six consecutive games at Anfield and still bounced back to have the season they had last season. This happens in football and it's happened to Liverpool in the last few years.\n\"I don't think this squad is a bad squad at all - it's absolutely top class.\"\nREAD NEXT\nBorussia Dortmund's Jude Bellingham is among Liverpool's top summer targets and 90min understands the club are confident they will win the race to sign the England international ahead of Manchester City and Real Madrid. Owen believes Klopp knows the area he needs to fix and that he'll be able to put it right, especially once recently injured players also hit full form again.\n\"Inevitably they will buy players, and Jurgen Klopp is not stupid,\" Owen said. \"He'll be buying midfield players and it is an ageing midfield, and an area of the pitch they could probably improve. So that will happen, but it'll happen whether they play well or not for the rest of this season - that's just the evolution of football.\n\"Confidence will come back, players will come back from injury and they'll get one or two players in and things will roll again.\"\nOwen believes that despite underwhelming performances and results this campaign, that quality in depth still exists at Anfield in spades - with remarkable players still on the books.\n\"There's enough central defenders there at the moment, cover for right back may need to be addressed as James Milner won't be playing forever, and left back is sorted. The back four is pretty much as good as it's ever been, and as good as it was when they were winning all those trophies. They've also got arguably the best goalkeeper in the world.\n\"The front line is staggering - you could even argue they've got too many [forwards]. They certainly don't need any more and they've got some great players coming back to fitness.\n\"Midfield is obviously where all eyes have been, but that's been the case for the last five or six years anyway. There's some young lads coming through and the question is if they will step up, but Jurgen Klopp will buy and he's right to buy.\n\"The likes of Declan Rice and Jude Bellingham are always touted around, and if Liverpool could get hold of one of those two, it would be great business. Mason Mount is another player that has been mentioned, and there will definitely be one or two players coming in for the midfield.\n\"Jurgen Klopp knows and the fans are clamouring for it. I'm sure it will happen but I don't think there'll be massive surgery on the team.\"\nOPPO is the official global partner of the UEFA Champions League and a leading global smart device brand. The new OPPO Find N2 Flip puts an industry-leading cover screen into palms and pockets, challenging what we've come to expect from small form-factor foldables.\nDespite its lightweight and pocketable size, Find N2 Flip's vertical cover screen turns OPPO's debut flip phone into an incredible photography tool, so you can capture all the actions on the pitch.\nEquipped with the industry’s most advanced Flexion Hinge, OPPO Find N2 Flip supports multi-angle FlexForm mode, allowing the screen to be set at any angle between 45-110 degrees. This completely new form factor opens new creative possibilities when it comes to photography and video, as well as providing added convenience for viewing content.",
  "word_count": 987,
  "scraped_at": "2026-02-14T01:59:46.891384",
  "_text_extracted": true
}