{
  "article_id": "34e37e68da80",
  "url": "https://www.twtd.co.uk/ipswich-town-news/48287/cajuste-its-been-a-ride",
  "title": "Cajuste : It Been a Ride - Ipswich Town News",
  "date": "20241109T170000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 9th Nov 2024 14:31 by Kallum Brisset\nTown midfielder Jens Cajuste has reflected on his football journey to the Premier League having grown up in China and played in France and Italy before moving to the Blues in the summer.\nThe Blues’ number 12 is currently on loan from Napoli having previously played for Midtjylland and Reims ahead of his move to Suffolk in August.\nSweden international Cajuste left his home town of Gothenburg at the age of five due to his father’s work to live in China, where the midfielder began playing football at Chinese Sports Beijing.\n“It’s a bit of a mix,” he said on his background. “My father was born in Haiti and grew up in the States and my mother is Swedish, so I’m Swedish-American.\n“We lived in China for about four years growing up and I started playing football there, then been a little bit all over the place. Denmark, I played there, France, Italy and now I’m here in the UK. It’s been a ride.\n“It’s immense in terms of understanding different cultures and learning different languages. The Chinese is not really there, but a little bit of Italian and French. It’s helped me grow as a person quite a bit.\n“Definitely the intensity is something I was expecting to be higher [in the Premier League] and that’s what I’ve seen. Compared to maybe Italy where it was more tactical, more side-to-side movements.\n“France is a bit more similar to here with the duels, but still the intensity here is definitely a step above from what I’ve experienced.”\nThe biggest move of Cajuste’s career came in the summer of 2023 when he was bought by Napoli off the back of their first Serie A title win for more than 30 years.\nThe 25-year-old says playing for the Italian giants in the UEFA Champions League was one of the best experiences possible, highlighting the incredible support and passion the supporters in Naples have for the football club.\nHe said: “A lot of pressure but also a lot of passion, you definitely feel it from the moment you’re there. They really love football and you can really sense that and you get that feeling. It was definitely a special time being there.\n“I don’t really have any specific stories but I can definitely say it’s by far the most passionate fanbase I’ve seen in terms of results and games. At the end of the day it’s all love, it’s all for the team and in support of the team. It was good backing.\n“I started against Barcelona at home and that was a wow moment, it was massive. But at the end of the day it’s football and it’s all about playing in every game as if it’s a Champions League final.\n“Of course there are things I take with me, but overall to keep that focus play every game like a Champions League final.”\nCajuste was asked which midfielders have influenced him the most growing up, responding: “I watched a lot of [Andrea] Pirlo and [Sergio] Busquets. I really enjoyed watching those two players, a little bit of Paul Pogba as well. I’ve watched quite a few, Mousa Dembele at Tottenham, I really enjoyed him as well.\n“I’ve tried to model a little bit but also try to be my own player as well. But of course trying to pick some pieces here and there from each of the players.”\nHaving played in the top competition in European football, it would be easy to say that the dream is to get back to playing at the most elite level possible, however Cajuste is content with where he at and believes the Blues’ allowing him the opportunity to play Premier League football is not one he is taking for granted.\n“All football players, we strive to reach the highest level possible but that’s looking forward and right here right now I’m very happy with where I am,” he said.\n“The Premier League has fantastic teams and opponents, there will definitely be some great games including the game coming up on Sunday.”\nThe game in question is Town’s first-ever competitive trip to the Tottenham Hotspur Stadium, a clash Cajuste is looking forward to the experience of playing in.\nHe said: “These are the kind of games you want to play where you play some of the best teams and best players on the pitch as well. It’s the competitive side of football where you really want to match up against these kinds of oppositions.”\nAsked if he has spoken to his international teammate and likely midfield opponent in north London Dejan Kulusevski, Cajuste said: “Not about the upcoming game, but I’m sure we’ll have a talk once we see each other in the stadium. That will be fun.”\nFinally, Cajuste reflected on his last start against Brentford, a topsy-turvy encounter in which the Blues fell to defeat with a gut-wrenching stoppage time winner.\nHe said: “It was an exciting game, almost all of the games so far I’ve been a part of have been really high intensity and back and forth battles.\n“It was a rollercoaster of emotions with the lead then losing it, coming back with the draw and then of course the last minute was devastating for us, but sometimes this is football. In terms of being on the pitch it was a good experience and I enjoyed it.”\nTWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 936,
  "scraped_at": "2026-02-14T01:49:13.393838",
  "_text_extracted": true
}