{
  "article_id": "34ea15f5f4af",
  "url": "https://www.caughtoffside.com/2024/08/23/aston-villa-offered-raheem-sterling-chelsea/",
  "title": "Aston Villa offered the chance to sign four - time Premier League winner",
  "date": "20240823T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Unai Emery’s Aston Villa have been offered the chance to sign Chelsea winger Raheem Sterling.\nAston Villa managed to finish inside the top four last season and they are gearing up for Champions League football. They have already added a lot of quality to their ranks this summer and look all set for the 2024/25 season. But, with the window still open, another opportunity has come their way.\nAccording to a report from the Mirror, Unai Emery’s team have been offered the chance to sign Chelsea outcast Raheem Sterling. The English winger is looking for a new home after being informed by the new Chelsea manager Enzo Maresca that he is no longer a part of their plans moving ahead.\nSterling was their initial marquee signing under the new ownership. They forked out a significant fee to bring him to Stamford Bridge from Manchester City, where he won four league titles. While he has done a decent job in the final third of the pitch over the last two seasons, the Blues are not quite pleased with his performances.\nThey do not count on the English international moving forward and are pushing hard to get him off their books this summer. They have offered Villa the chance to sign the 29-year-old who still has a few years of top-level football left in him.\nAston Villa could use Raheem Sterling\nEmery’s team have already added two new left-wingers (Jaden Philogene and Samuel Iling-Junior) to their squad and it will be interesting to see if the Spanish manager can find a role for the former Liverpool academy star. They won’t be making a move for him unless he has a plan for him. Once Emery is aware of where the experienced winger could fit into their plans, he could ask the board to make a move for him.\nBut, his massive wages could prove to be a problem for the Blues as well as Villa. Chelsea want him off their books to make room on their wage bill. Even if Villa agree to sign him, it will be interesting to see how much of a financial loss the London club is willing to absorb on his £15 million salary.",
  "word_count": 367,
  "scraped_at": "2026-02-14T02:14:29.075180",
  "_text_extracted": true
}