{
  "article_id": "34edf6641df1",
  "url": "https://weaintgotnohistory.sbnation.com/2025/2/16/24366634/brighton-hove-albion-3-0-chelsea-player-ratings-lowest-lows",
  "title": "Brighton & Hove Albion 3 - 0 Chelsea , Player Ratings : Lowest lows",
  "date": "20250216T121500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The job that got started last week against Brighton in the FA Cup was completed in all its grotesque glory this weekend, as we returned to the scene of the crime and finished our masterpiece in the Premier League.\nBrighton & Hove Albion 3-0 Chelsea, Player Ratings: Lowest lows\nCommunity player ratings from Chelsea’s worst game of the season (so far)\nIn the grand scheme of things, losing a game by three goals is not unprecedented. It may be our biggest defeat of this season, but we’ve had bigger losses in recent seasons. Still, this one felt even worse than the scoreline, and the player ratings reflect that.\nIn fact, on average, this is the second worst game in our WAGNH Player Ratings’ history, only* bested by the infamous 6-0 massacre at Manchester City back in 2019 (not quite on St Valentine’s Day that year, but very close).\nThis is now the 11th game rated below 4.0 on average in nearly 13 years of WAGNH Player Ratings. Four of them have come in the last 24 months.\n(*usual caveat here about the one glaring omission from Player Ratings history, namely the 4-2 defeat against third division Bradford City — it’s got its own Wikipedia page! — which wasn’t televised and thus wasn’t up for rating.)\n3.02 — Manchester City 6-0 Chelsea (2019.II.10.)\nIn what still remains a true statement, it’s tough to see (a modern era) Chelsea ever “topping” this performance and result, which remains the team’s worst loss in three decades. We were down three inside of 20 minutes, down four by half, and gave up two more in the second half for good measure. The nadir of Sarri-ball, or any ball.\n3.36 — Brighton & Hove Albion 3-0 Chelsea (2025.II.14.)\nThe team showed no desire, said head coach Enzo Maresca, but our mentality was just one of the many aspects lacking in this one. In fact, we were found lacking in just about every aspect of the game, from attack to defense, from planning to focusing, from strategy to execution.\n3.42 — Arsenal 5-0 Chelsea (2024.IV.23.)\n“When we conceded the third goal the team gave up.”\n3.62 — AFC Bournemouth 4-0 Chelsea (2019.I.30.)\nThis was the away game before the (aforementioned) City away game, and with Chelsea giving up four goals in the second half of this one and four goals in the first half of that one, we managed to lose 90 minutes of (away) football by a combined 8-0 scoreline. Now that is truly impressive!\n3.69 — Newcastle United 3-0 Chelsea (2018.V.13.)\nAntonio Conte’s last Premier League game in charge, which began with Chelsea holding a slim chance of qualifying for the Champions League (Liverpool won so it didn’t matter in the end), but ended up with yet another hilarious collapse. A week later, Chelsea beat Manchester United in the FA Cup final so yeah, good luck figuring out football.\n3.83 — Steaua Bucharest 1-0 Chelsea (2013.III.13.)\nThere were many lows of the (We’re-Just-Not-That-)Interim Blues, and this was certainly one of them. Chelsea came back to smash Steaua 3-1 in the second leg of the Europa League Round of 16 and would eventually go on to win the competition. In retrospect, viewed through the lens of recent seasons, it must be acknowledged that this interim era looks pretty okay.\n3.95 — Chelsea 2-4 Wolverhampton Wanderers (2024.II.4.)\nThe lowest-rated game at Stamford Bridge in the history* of our WAGNH Community Player Ratings (*see caveat in intro). Combined with the Arsenal defeat, this makes the 2023-24 season the third double-entry in the Hall of Shame, after 2017-18 and 2018-19.\n3.95 — Sheffield United 3-0 Chelsea (2020.VII.11.)\nOutside of the first few minutes, Chelsea were never in this game, which was played in an empty stadium thanks to the COVID-19 pandemic. What made the result even more shocking was Chelsea’s generally very good play and form during “Project Restart”. Like the current edition, this was a fairly young and inexperienced team, but with Frankie’s Fledglings we at least seemed to be on the right path for (re-)building towards a more positive future.\n3.95 — Watford 4-1 Chelsea (2018.II.5.)\nConte lost 3-0 to Bournemouth in the game before this and asked the club for an official vote of confidence, which was then followed by an even worse performance as 10-man Chelsea were destroyed at Vicarage Road. In fairness, Chelsea, after falling behind, actually equalized in the final ten minutes despite playing a man down since the 30th (Tiémoué Bakayoko taking the ultimate prize with a 1.4 individual rating). But Watford took the lead again immediately after Hazard’s equalizer and the Blues folded from there.\n3.96 — Chelsea 1-3 Southampton (2015.X.3.)\nThe Mourinho Season was already in full swing by the time Sadio Mané inspired Saints to their first win at the Bridge in 13 years. Fun fact: this was Falcao’s one and only start in the Premier League (he would play just three more times for us that season for a grand total of 35 minutes, and we would lose all three games).\n3.99 — Chelsea 0-2 Brentford (2023.IV.26.)\nThe worst of a most terrible season, the first of the post-Abramovich era. This was the fifth in a run of six successive defeats in all competitions as we wanted nothing more than for the season to end. We set quite a few new marks for futility in this season, and unfortunately, improvement on that has been marginal at best...\nvs. BRIGHTON (PL, A, L 0-3)\nEXCEPTIONAL (9.0+): —\nEXCELLENT (8.0-8.9): —\nGOOD (7.0-7.9): —\nAVERAGE (6.0-6.9): —\nSUBPAR (5.0-5.9): —\nBAD (4.0-4.9): George (4.4, sub), Caicedo (4.2)\nTERRIBLE (3.0-3.9): Madueke (3.9), Palmer (3.7), Cucurella (3.7), James (3.7, sub), Gusto (3.6), Jörgensen (3.5), Enzo (3.3), Neto (3.1), Chalobah (3.0)\nNEW DEPTHS (1.0-2.9): Dewsbury-Hall (2.9), Colwill (2.6), Sancho (2.5, sub), Nkunku (2.2)",
  "word_count": 970,
  "scraped_at": "2026-02-14T01:52:15.337129",
  "_text_extracted": true
}