{
  "article_id": "350b07cf3bc6",
  "url": "http://www.greekherald.com/news/278475672/there-no-guarantees-mount-reveals-tuchel-message-on-potential-england-return",
  "title": "  There no guarantees : Mount reveals Tuchel message on potential England return",
  "date": "20250729T211500Z",
  "domain": "greekherald.com",
  "source_country": "Greece",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ANI\n29 Jul 2025, 23:39 GMT+10\nNew Delhi [India], July 29 (ANI): Manchester United midfielder Mason Mount revealed the conversation he had with England head coach Thomas Tuchel about his potential return to the national side and claimed that there are 'no guarantees' for his return.\nMount was a regular starter under Tuchel during their time together at Chelsea. In 2021, Mount and Tuchel shared a memorable moment after Chelsea outclassed Manchester City to lift the UEFA Champions League title. The 26-year-old opened up about meeting the German manager and the existing competition for a place on the English side.\n'He called me and he said that he's calling a lot of players and just wanted to catch up. I don't know how many players he probably called, 40 or 50 maybe. But it was good to see his face, good to catch up with him and good to speak to him. I played quite a bit under him. We won the Champions League, so that's a positive,' Mount said, as quoted from ESPN.\n'But I think with England it's totally different now; the competition for places, the amount of people he can pick, it's a bit different than club football. So I don't think it goes hand in hand,' he added.\nMount last donned the England jersey during the World Cup quarter-final loss to France in December 2022. In their heartbreaking loss, Mount earned a crucial penalty, which Harry Kane blazed over the bar. With more than two years of absence, Mount is still waiting for a call-up but doesn't expect it anytime soon, despite the past he shares with Tuchel.\n'He said to me, 'there's no guarantees, even though you played for me'. But it gives you more. You want to push even more to be able to be back in the squad. So it was really good to speak to him and see what he's preparing. He looked very excited and had loads of energy, like I remember, and was bang up for the new role,' he said.\nMount switched to Manchester United from Chelsea in 2023. Since his arrival at Old Trafford, his stint has been plagued by injury. With the 2026 World Cup slowly approaching, Mount is willing to throw his hat into the ring for the right to fight for a spot in the coveted tournament.\n'Of course, as a player, you always want to play for your country, and that's such a big honour. Any opportunity that you get to put that shirt on is amazing. I have 36 appearances for England, so I know what it means to be able to play for your country. I'd love to have that opportunity again, but I'm focusing on club football first. So I'm looking at that first for sure and see what happens at the end of the season,' he added. (ANI)\nShares\nShare\nTweet\nShare\nFlip\nEmail\nGet a daily dose of Greek Herald news through our daily email, its complimentary and keeps you fully up to date with world and business news as well.\nPublish news of your business, community or sports group, personnel appointments, major event and more by submitting a news release to Greek Herald.\nMore Information\nnull in null\nBRUSSELS, Belgium: Meta Platforms has announced it will stop running political, electoral, and social issue advertisements on its platforms...\nThe situation in Ukraine serves as a revealing case study for other countries observing how the West operates The Ukraine Recovery...\nNayara Energy has taken the US tech giant to court for restricting its access to data and proprietary tools ...\nNayara Energy has taken the US tech giant to court for restricting its access to data and proprietary tools India's second largest...\nNew Delhi [India], July 29 (ANI): Bharatiya Janata Party (BJP) MP Nishikant Dubey on Tuesday slammed the Congress for asking details...\nNew Delhi [India], July 29 (ANI): Reliance Jio on Tuesday unveiled JioPC, India's first AI-ready, cloud-based virtual desktop platform....\nBRUSSELS, Belgium: Meta Platforms has announced it will stop running political, electoral, and social issue advertisements on its platforms...\nU.S. President Donald Trump and EU chief Ursula von der Leyen Sunday announced they had reached a deal to end a transatlantic tariffs standoff...\nNew Delhi [India], July 29 (ANI): Manchester United midfielder Mason Mount revealed the conversation he had with England head coach...\nGaza [Palestine], July 29 (ANI): At least 60,034 Palestinians have been killed by Israeli forces since the war on Gaza began in October...\nGAZA, July 29 (Xinhua) -- The Palestinian death toll from ongoing Israeli attacks on the Gaza Strip has surpassed 60,000, Gaza's health...\nPretoria expected isolation from allies of the Israeli apartheid state over its genocide case against West Jerusalem, ANC official...",
  "word_count": 789,
  "scraped_at": "2026-02-14T02:02:51.943188",
  "_text_extracted": true
}