{
  "article_id": "3521696058f0",
  "url": "https://news.yahoo.com/thrashing-napoli-might-biggest-mistake-071429183.html",
  "title": "Thrashing Napoli might have been the biggest mistake AC Milan could make",
  "date": "20230412T081500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thrashing Napoli might have been the biggest mistake AC Milan could make\nThe scoreline wasn’t all that much of a surprise, as it turned out - but the side it favoured certainly was. The fact some incredible individual skill in attack led to goals wasn’t a shock - but the players involved were likewise the less-expected ones, given recent form.\nPrior to the start of April, Napoli sat top of Serie A with just one defeat and nine goals conceded on home soil all season, while AC Milan, the reigning champions but stumbling this term, had won just five of their 14 away games and had seen more scored past them on their travels than they had managed to net themselves. Sat in sixth, it made for a daunting start to the month as they travelled to the Stadio Diego Armando Maradona. But it was the visitors who won 4-0.\nThe league meeting between the sides on 2 April would be just the start of a quickfire trilogy; factoring in the two Champions League quarter-final legs, Napoli and Milan are facing off three times in just 16 days. Few might have predicted inconsistent Milan to take anything from any of the three fixtures, particularly after they lost the reverse league encounter 2-1 on home soil back in September. Then, most of Europe was only just starting to become aware of how exciting, how dangerous, how full of potential this Napoli side are. Now, it’s fair to say, the entirety of the continent is paying attention in full as a potential historic double looms.\nBut before thoughts of silverware in Istanbul can be dreamed about, a much more domestic challenge sits before Luciano Spalletti and his side, after AC Milan didn’t just turn up and beat Napoli at the start of the month, but absolutely blitzed them.\nAll season long, Napoli have shown exhilarating attacking football, with the forward duo of Khvicha Kvaratskhelia and Victor Osimhen scoring 39 goals between them and counting - but last weekend it was the Rossoneri’s Rafael Leao who stole the show, aided and abetted by second-half sub Alexis Saelemaekers. Spalletti and Napoli, given cause for concern ahead of the two-legged meeting in Europe...or perhaps a timely reminder.\nThere are two important factors at play when the double act of Osimhen and Kvaratskhelia are spoken about. First, is that they are actually two-thirds of a front line for Spalletti, though the third component has been rather more changeable. Hirving Lozano and Matteo Politano have mostly dovetailed in the role, with Giovanni Simeone or Giacomo Raspadori other options either centrally or from the flanks depending on in-game changes.\nBut even in a three-man attack, it’s hard to not identify this pair as...well, a pairing, so well do they link up and so much do they contribute.\nMilan have something of a reprieve in that the Nigerian striker missed the league match and is expected to be absent for the first leg in the Champions League too, but another of Napoli’s strengths this season has also been the impact of those filling in for regular starters. Spalletti has the squad on board and playing exceptionally fluid, fast-paced football and each of the cogs are able to keep those wheels turning smoothly.\nSecondly, there are those behind the forwards. Napoli’s revival this term is all the more remarkable given their enormous turnover of iconic players in the summer: Kalidou Koulibaly, Lorenzo Insigne, Dries Mertens and Fabian Ruiz have been huge pieces of the team for so long that ripping the entire spine away at once was perhaps the only way to rebuild a side; even so, the success stories of Kvaratskhelia and Kim Min-jae in particular are surely beyond all expectancy of those at the club.\nThe South Korean centre-back has been an absolute colossus, while the Georgian winger has proved largely unstoppable. Together they cost less than €30m, but they aren’t the only stand-out figures in the side. Holding midfielder Stanislav Lobotka has been an irrepressible menace. Amir Rrahmani has found consistency as Kim’s parter at the back. And players such as Andre Zambo Anguissa, who could barely get a look-in at Fulham at one stage, has been one of Spalletti’s central pillars of the team.\nThe rebuild has been swift and nearly perfect, giving Napoli a 16-point lead at the top of the table with nine matches to play. The title is almost theirs and, importantly, the normal order has been reestablished since that hefty battering by Milan. Ultimately, that game seems to have mattered little - nobody is catching Napoli and Milan have already stumbled in their top-four chase.\nLast time out, Napoli beat Lecce, while the side they will soon displace as title-holders only drew with Empoli. The 4-0 defeat was a painful one, their heaviest in over two decades, but if it brought with it a reminder of the need for absolute consistency, determination and a clinical edge, game after game against every single opponent, it may well have been worthwhile.\nThe route to the Champions League final has opened up in incredible fashion on this side of the draw, with three Italian sides - Inter Milan being the others - beating Benfica 2-0 in their own first leg. But Inter are a poorer side than either of these two, and in worse recent form too. Both will fancy their chances of reaching the Ataturk Stadium - if they can overcome the other.\nDespite the 4-0, or perhaps because of it, Napoli remain huge favourites. Across two matches the feeling is they’ll outscore their domestic rivals on the European stage, even deprived of Osimhen.\nSince 1990, and a Serie A title win inspired by Maradona himself, Napoli’s success has been limited to three triumphs in the Coppa Italiana.\nThis group of players and managers are already set to write their names into club and city history for ending over three decades of waiting; Milan themselves, though, might just have provided the motivation and the laser focus to go on and earn a shot at an even more - status of legendary proportions.",
  "word_count": 1018,
  "scraped_at": "2026-02-14T02:09:52.176479",
  "_text_extracted": true
}