{
  "article_id": "3522a418da46",
  "url": "https://tribune.com.pk/story/2521526/manchester-city-thrash-salford-8-0-liverpool-cruise-into-fa-cup-4th-round",
  "title": "Manchester City Thrash Salford 8 - 0 , Liverpool Cruise into FA Cup 4th Round",
  "date": "20250111T220000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City thrash Salford 8-0, Liverpool cruise into FA cup 4th round\nChelsea won comfortably, but Brentford became the only Premier League team to be defeated by lower-league opposition.\nManchester City obliterated Salford's former Manchester United star owners with an 8-0 FA Cup rout on Saturday, while Liverpool eased into the fourth round with a dominant 4-0 win over Accrington Stanley.\nChelsea were among the other major victors, thrashing Morecambe 5-0.\nBrentford, however, became the only Premier League side to fall to lower-league opposition, as Plymouth, who are at the bottom of the Championship, stunned the Bees 1-0 thanks to a late winner from Morgan Whittaker.\nLeague Two club Salford, who have risen through the non-league ranks since the investment of David Beckham, Gary and Phil Neville, Paul Scholes, Ryan Giggs, and Nicky Butt in 2014, were left disappointed.\nScholes, Butt, and director of football Giggs were at the Etihad but were denied a night to rival their best moments from their time at Old Trafford.\nPep Guardiola made significant changes to his squad, resting Erling Haaland for the game.\nJeremy Doku opened the scoring after just eight minutes, and youngsters Divin Mubama and Nico O'Reilly made it 3-0 before halftime. Jack Grealish scored his first City goal in over a year from the penalty spot, with Doku adding another from the spot.\nJames McAtee, who had previously only scored once for City, stole the show with a 20-minute second-half hat-trick, earning man-of-the-match honors. \"I've been here since I was 10, and it's a special moment for me. Something I'll remember forever,\" said McAtee.\nAt Anfield, there was never a hint of an upset despite Arne Slot making eight changes for Liverpool.\nTrent Alexander-Arnold was named captain in the absence of Virgil van Dijk and led by example after receiving criticism for his performance in the 2-2 draw against Manchester United last weekend.\nSlot had warned the Premier League leaders that a trip to Anfield would be Accrington's \"Champions League final.\" Accrington, 86 league positions behind Liverpool in the English league system, held out for nearly half an hour before Diogo Jota tapped in from Darwin Nunez's low cross.\nAlexander-Arnold then doubled the lead with a sublime strike into the top corner from outside the box. \"I could talk for hours about that (goal), unbelievable,\" said Slot.\n\"The biggest compliment Trent could get was the reaction of everyone after the Manchester United game. Every player around the world, maybe except for a few, has a bad game and that is completely normal, but the moment Trent has one, everyone has an opinion about it,\" he said.\nJayden Danns made it 3-0 before Federico Chiesa netted his first Liverpool goal after an injury-hit start to his time in England. Joao Felix was the star for Chelsea as he seized a rare opportunity to deputize for Cole Palmer.\nThe Portuguese international and Tosin Adarabioyo both scored twice, while Christopher Nkunku redeemed an earlier penalty miss by netting his 13th goal of the season.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:02:19.852166",
  "_text_extracted": true
}