{
  "article_id": "35410a48f17f",
  "url": "https://www.westmeathindependent.ie/2023/12/27/chris-wood-warns-nottingham-forest-must-build-on-win-at-newcastle/",
  "title": "Chris Wood warns Nottingham Forest must build on win at Newcastle",
  "date": "20231227T210000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chris Wood warns Nottingham Forest must build on win at Newcastle\nBy Damian Spellman, PA\nHat-trick hero Chris Wood has warned Nottingham Forest their St Stephen's Day triumph at Newcastle will count for nothing unless they build upon it.\nForest dragged themselves into 16th place in the Premier League table with a superb 3-1 victory at St James’ Park, but they remain only two points clear of the relegation zone heading into Saturday’s mouth-watering home clash with Manchester United.\nWood’s treble capped an impressive display and handed new boss Nuno Espirito Santo a first win in his second game at the helm, but the 32-year-old New Zealand international knows it can only be considered a start.\nA post shared by Nottingham Forest (@officialnffc)\nHe told Forest TV: “It’s most definitely a step in the right direction. I would never say ‘turned a corner’ because it is only one game and we need to remember than one game doesn’t make four or five.\n“We need to work ahead and it’s not going to guarantee that we’re going to play well in the next game. We have to make sure we play well in the next game. It’s only on us as players and staff – and the fans getting behind us, that really helps.\n“But I’m sure it will be bouncing, the City Ground, come the 30th.”\nForest showed real character as well as flair and deadly finishing on Tyneside as they fought back from Alexander Isak’s 23rd-minute penalty to level when Wood tapped home from the impressive Anthony Elanga’s pinpoint cross.\nThe frontman, who left Newcastle for the City Ground during the summer, then produced two deft finishes to make the most of defence-splitting passes from first Elanga and then defender Murillo and wrap up the win.\nHe said: “Look, we know Newcastle are a a top, top side – I know it first had – and we knew coming here was going to be very tough. They’re a good side, good players.\n“They weren’t in the Champions league for no reason and they’re not near the top of the league for no reason because they are a good side.\n“We just had to keep working on what we could do. We took risks, we took chances – sometimes they paid off, and sometimes they didn’t and we got caught. But that’s the type of football we wanted to play, that’s what we were given the license to try to do, and thankfully it worked.”\nWood admitted his second Premier League hat-trick – his first came for Burnley in a 4-0 win at Wolves in April 2021 – prompted some mixed feelings, but was no less welcome as a result.\nHe said: “It is bittersweet, but it’s fantastic. I’m obviously over the moon with the performance of the lads and the goals and the three points, most importantly.\n“It was an interesting place to come back to. I really enjoyed my time up here, I’ve got a lot of close friends up here and things like that. It’s bittersweet, but I’m definitely going to take it.”",
  "word_count": 516,
  "scraped_at": "2026-02-14T02:13:24.768808",
  "_text_extracted": true
}