{
  "article_id": "356431247af2",
  "url": "https://www.thenews.com.pk/print/1131229-southgate-not-perturbed-by-draw-with-north-macedonia",
  "title": "Southgate not perturbed by draw with North Macedonia",
  "date": "20231121T221500Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Southgate not perturbed by draw with North Macedonia\nSKOPJE: Gareth Southgate insists England´s lacklustre finish to the Euro 2024 qualifying campaign will mean nothing when they start their bid to win the tournament in Germany.\nSuch are the expectations that Southgate is working under these days that qualifying with an unbeaten record from a potentially tricky group including Italy and Ukraine earned him few plaudits.\nBeing held to a 1-1 draw by North Macedonia on Monday meant England failed to beat a side as low as 66th in the FIFA rankings for the first time since 2016, when they drew with Slovenia.\nBut with a runners-up finish at the last European Championship in 2021, as well as World Cup semi-final and quarter-final appearances in the Southgate era, England´s status as one of the Euro favourites is well earned after six victories from their eight qualifiers.\nAnd Southgate is confident England´s drab end to the qualifying campaign will prove nothing more than an irrelevant blip. “The really big results were in March against Italy and Ukraine. It meant coming here was a completely different test,” he said.\n“I thought that given we had already qualified and everything had been achieved the mentality of the players was excellent. “The quality on the ball was good on a difficult pitch. Just that final pass or finish was difficult to find. But I thought there were lots of positive performances.”\nOne area of concern for Southgate could be his team´s struggle to pierce the massed ranks of North Macedonia and Malta´s defences over the last four days. Southgate was without influential Real Madrid midfielder Jude Bellingham due to injury for both qualifiers, while England´s record scorer Harry Kane was left on the bench for the first 58 minutes against North Macedonia.\nOnly when Kane came on did England snatch their equaliser, an own goal from Jani Atanasov as he tried to stop the Bayern Munich striker turning in Phil Foden´s corner. Southgate will have noted his side took 65 minutes to manage their first shot in the 2-0 win against Malta at Wembley on Friday.\nAnd although England had 75 percent of the possession against North Macedonia, they mustered only two shots on target, making it just the third time in the last 26 Euro qualifiers that they failed to take maximum points.\nIn truth, England´s lethargic displays over the last two games owed much to the dead rubber status of the matches and their scheduling amid a hectic programme of Premier League and Champions League fixtures.\nBut Southgate will still want improved performances in the friendlies against Brazil and Belgium in March.\nBy then, he will know the teams England will face in the group stage, with the point in Skopje ensuring they will be in the pot containing the top seeds. “The next exciting bit is the draw at the beginning of December and we will see what the path looks like,” Southgate said.\nPlotting how many of England´s emerging young talents to take to Germany will keep Southgate busy over the winter. He was impressed with the way Manchester City´s teenage left-back Rico Lewis handled his debut.\nLewis´s composed display was all the more commendable after he was harshly adjudged to have fouled Bojan Miovski, conceding the penalty that brought North Macedonia´s goal when Enis Bardhi converted the rebound from his saved spot-kick.\n“Rico was excellent. His composure with the ball and the way he responded to that setback, he´s a super footballer,” he said. Crystal Palace centre-back Marc Guehi also caught Southgate´s eye.\n“He has been excellent in every game and showed great composure, taking what I´ve seen from him at his club to international football. That´s not straightforward,” he said. The jury remains out on Southgate´s experiment with playing Liverpool right-back Trent Alexander-Arnold in midfield.\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters\n-\n'A Very Special Visitor' Meets Queen Camilla At Clarence House\n-\nJodie Turner Smith Shares One Strict Rule She Follows As A Mom\n-\nHailey Bieber Reveals KEY To Balancing Motherhood With Career\n-\nPhoto Of Jay-Z, Other Prominent Figures With Jeffrey Epstein Proven To Be Fake\n-\nHillary Clinton's Munich Train Video Sparks Conspiracy Theories\n-\nFans Slam Talk Show Host For 'cringe' Behavior In Chris Hemsworth Interview\n-\nWoman Jailed Over False 'crime In Space' Claim Against NASA Astronaut\n-\nJames Van Der Beek’s Close Pal Reveals Family's Dire Need Of Donations\n-\nPrince William And Harry's Cousins Attend 'Wuthering Heights' Event\n-\nHailey Bieber Turns Heads Just Hours After Major Business Win\n-\nKing Charles' Andrew Decision Labelled 'long Overdue'\n-\nTimothee Chalamet 'forever Indebted' To Fan Over Kind Gesture\n-\nColumbia University Sacks Staff Over Epstein Partner's ‘backdoor’ Admission\n-\nOzzy Osbourne's Family Struggles Behind Closed Doors",
  "word_count": 812,
  "scraped_at": "2026-02-14T02:07:27.059611",
  "_text_extracted": true
}