{
  "article_id": "35a80e986687",
  "url": "https://www.themag.co.uk/2025/12/as-a-newcastle-united-fan-i-just-wanted-to-say-thank-you-alexander-isak-liverpool/",
  "title": "As a Newcastle United fan , I just wanted to say , thank you Alexander Isak",
  "date": "20251224T134500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As a Newcastle United fan, I just wanted to say, thank you Alexander Isak\nThank you Alexander Isak, from this Newcastle United fan.\nWhat a fabulous time for us all.\nThe Alexander Isak Newcastle United era started at Anfield with a goal, then ended almost exactly three years later.\nDespite only scoring six goals for Real Sociedad in 32 La Liga appearances in the 2021/22 season, Eddie Howe spotted something.\nThe brilliant Newcastle United boss believing he could turn an average to decent striker into one that could score a lot of goals for United, if given the perfect set-up to get the maximum return out of Alexander Isak.\nThe good/great times flowed and after three years at St James’ Park, Alexander Isak had helped Newcastle United to win their first trophy in 56 years and qualify for the Champions League for the first time in two decades, then do the same two years later.\nFor all of this I thank you Alexander Isak, you played a full part in helping Eddie Howe and Newcastle United to achieve that.\nIndeed, the positives keep flowing thanks to you.\nEddie Howe convinced Newcastle United to pay £59m (plus £4m in potential future add-ons) and then Howe’s brilliance set you up to score all of those goals that led Liverpool to pay £130m for you three years later.\nMore than doubling what Newcastle paid for you, that £130m worth far far more than just that basic cash value to NUFC, as in the FFP/PSR world, that record fee paid by a Premier League club, means so much more in terms of the flexibility to spend within the rules.\nThat basic cash value can be seen to have paid for Nick Woltemade AND Yoane Wissa, which was pretty handy when Newcastle United needed to bring in two first team squad strikers, with Callum Wilson also coming to the end of his days here.\nHowever, the FFP/PSR benefit of that huge £130m fee, means that Newcastle United can spend far more on top of that basic cash value, with the January 2026 transfer window hopefully seeing proof of that.\nSo many great goals and great memories in your time here, thanks again Alexander Isak.\nAll good things eventually…\nYes, all good things eventually come to an end.\nI want to also thank you Alexander Isak, for then showing your true character, what you are really all about as a person.\nIt means that whilst I will always love those three years and what happened on the pitch, I won’t be worshipping a false idol.\nAlexander Isak, you are truly a rat.\nThere were 101 ways you could have exited Newcastle United and you chose to do it that way.\nYou chose to do everything you could to sabotage the 2025/26 season for Newcastle United.\nYou stabbed Eddie Howe, the man who had made you, in the back.\nYou refused to even train, never mind play football, for Newcastle United. The entire summer and opening part of the season, your greed saw you still pocket a fortune in wages, money that the supporters pay into the club.\nYou were so desperate to get away from Newcastle United, yet at the same time, not desperate enough to put in an official transfer request, as it would have meant you losing out on ‘loyalty’ money that would otherwise be due from Newcastle United. This greed shining through despite the fact that you were heading to Liverpool for £10m a year wages, joining a club who had also shown their true colours throughout the summer, acting appallingly.\nKarma\nThe early stages of the summer saw you giving the pretence you were heading nowhere. Even happily starring in promotional videos and other pushes for the new 2025/26 Newcastle United kits.\nHow many kids got their parents to shell out fortunes for new NUFC shirts with your name on? Whilst at the same time you were secretly planning to desert those kids that worshipped you as a Toon idol.\nKarma (A belief that intentions and actions cause and determine future experiences) has now well and truly struck AND I am not just talking about the broken leg you are now stuck with.\nThe cloak of brilliance that you wore at Newcastle United, thanks to Eddie Howe, had already been well and truly whipped away. Arne Slot not having a clue what he wanted to do with you, apart from getting you away from Newcastle United, whilst at the same time you unwittingly were doing everything you could do as well to undermine your future career.\nYou had it all and now you have nothing, apart from the £10m a year wages anyway. Even the fickly Liverpool fans turned against you, seeing an often lazy striker looking very average and rarely a goal threat, was this really the same Alexander Isak that had turned it on so often within the comfort zone provided by Eddie Howe and your NUFC teammates?\nYes my (former) friend, Karma has bitten you on the backside and I believe will continue to do so.\nIn the future, I fully believe that history will judge you as somebody who experienced such success with Newcastle United, then became to biggest and most expensive flop in Premier League history when joining Liverpool.\nMy guesstimate is that after you recover from the leg break, Liverpool will persevere for one more season, or half season, before you end up on loan at a Serie A club or maybe back in La Liga. Nobody will be able to afford to buy you, especially when there’s no chance of you compromising on the six year £10m a season contract Liverpool agreed with you. Eventually leaving Liverpool on a free at the end of that six year contract, £60m the richer, but far poorer in terms of football achievements.\nHappy Christmas Alexander Isak.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 992,
  "scraped_at": "2026-02-14T01:59:31.516335",
  "_text_extracted": true
}