{
  "article_id": "35af9df03cd2",
  "url": "https://menafn.com/1105793907/Haaland-Has-All-The-Tools-To-Solve-Man-Citys-Champions-League-Puzzle",
  "title": "Haaland Has All The Tools To Solve Man City Champions Leag ... ",
  "date": "20230316T224500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- Khaleej Times) Published: Wed 15 Mar 2023, 7:19 PM Last updated: Wed 15 Mar 2023, 7:33 PM\nWhen Manchester City hired Pep Guardiola in 2016 with the sole aim of dominating English football and adding the elusive Champions League silverware to their trophy cabinet, a 16-year-old Erling Haaland was plying his trade in the Bryne Fotballklubb, a mid-table club in Norway.\nThe son of former Norway international Alfie Haaland who played in the 1994 World Cup as well as for Manchester City in the Premier League, Haaland was a precocious teenager when he was picked by Bryne to play for their first team.\nBut the youngster failed to find the back of the net for Bryne in any of his 16 matches during his first season at the highest level of Norwegian club football.\nRemarkably, seven years later, Haaland has become the deadliest striker in the world whose staggering goal-scoring form might just earn City their first piece of silverware in Europe.\nOn Wednesday night at the Etihad Arena, Haaland played like an unstoppable force of nature.\nWith his strength, pace and cold-blooded ruthlessness inside the box, Haaland put five past the hapless RB Leipzig in City's 7-0 romp in the Champions League round of 16 second leg clash.\nThe 22-year-old hotshot marksman celebrated each of his five goals with his trademark knee slide and salute in a night he became only the third player in history to score five goals in a Champions League knockout clash.\nHaaland's predatory instinct is the icing on the cake for a team that loves to dominate possession and produce a dizzying array of passing in the final third.\nA more formidable opponent with tough-tackling midfielders could pose a bigger challenge for City in the quarterfinals.\nBut Haaland can finish off an opponent in the blink of an eye if he gets one defence-splitting pass.\nThe Norwegian, a man of few words who finds his full expression inside the six-yards, seems to have all the tolls to end Manchester City's long wait for the Champions League glory.\nThe Citizens have won four Premier League titles in seven years since Guardiola left Bayern Munich for England.\nBut in his own words, Guardiola will be defined by his performance in the world's biggest club competition.\nCity's failure to finish off chances in the later stages of the Champions League has haunted them in recent seasons.\nBut now they have a striker who is threatening to rewrite all the record books, having scored 39 goals in just 36 matches since leaving Borussia Dortmund for City in May last year.\nTen of those 39 goals have come in just six matches in the Champions League.\nAnd if Guardiola had not taken him off in the 63rd minute of the lop-sided contest against RB Leipzig on Tuesday night, Haaland could have scored a double hat trick.\n'He was so hungry,' said Marco Rose, the RB Leipzig head coach who trained Haaland at Dortmund, after his side was mercilessly put to the sword by his former pupil.\n'He scored goals with the foot, with the head, he won second balls, he made deep runs. It all looked really simple tonight. It was a special night for him.'\nIt might turn out to be a special year for Manchester City in the Champions League.\nALSO READ:\npolice return african cup of nations medal stolen from salah's home in cairo\nuae: dubai to host fifa beach soccer world cup next year\nibrahimovic recalled to sweden squad aged 41",
  "word_count": 587,
  "scraped_at": "2026-02-14T02:16:40.065772",
  "_text_extracted": true
}