{
  "article_id": "35bb3050782c",
  "url": "https://www.justarsenal.com/despite-the-excitement-history-suggests-arteta-will-ease-star-men-back-into-the-fold/404051",
  "title": "Despite the excitement , history suggests Arteta will ease star men back into the fold",
  "date": "20251116T121500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The international fixtures are in full swing at the time of writing and a number of Arsenal players have starred for their country so far. Bukayo Saka, Eberechi Eze and Martin Zubimendi are some big names that have scored for their respective nations so far, while a few others have put in exemplary displays. With that said however, all the focus from an Arsenal perspective will be on the return of club football, particularly the North London derby next weekend. The Gunners host our bitter rivals in what promises to be a heated affair on Sunday and for Mikel Arteta, he will be hoping to welcome back a number of high profile players.\nThe Gunners are currently nursing what would have been considered a full blown injury crisis last term. The attacking area of the pitch has taken the biggest hit, with six players including Ødegaard currently nursing injuries. Despite the significant list, there is growing optimism that the club will welcome a few of those players back. In his press conferences before the break, Arteta was upbeat about that possibility while a number of credible news outlets echoed those sentiments.\nA cautious return is still the most likely scenario\nThough there is a strong chance a few players could make it in time for Tottenham, history suggests we should temper expectations. Mikel Arteta has been characterised by his measured approach to player development and fitness throughout his reign, therefore it is unlikely that he would rush anyone back into the fold quickly. Even if they were to be passed fit, history suggests that the player would be eased into action. This is especially true for those who are returning from long term injuries which does not necessarily bode well for the Gunners.\nFour of the aforementioned six players, Gabriel Jesus, Kai Havertz, Noni Madueke and Martin Ødegaard, would have been out for at least seven weeks by the time the Spurs match arrives. That is far from ideal and the physical nature of a derby will only complicate matters further. From that perspective it also points towards a higher probability that Viktor Gyökeres and Gabriel Martinelli could return for the game. Both players would have missed just under three weeks of football once the fixture comes around.\nThree huge games that demand careful management\nIt will be fascinating to see how Mikel Arteta navigates our next three fixtures. A North London derby, a Champions League meeting with Bayern Munich and a match against Chelsea will test both the depth and resilience of the squad.\nTell me gooners, how would you like Arteta to manage the squad against Spurs, Bayern and Chelsea?\nLet’s discuss in the comments.\nBenjamin Kenneth\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 524,
  "scraped_at": "2026-02-14T02:03:26.529863",
  "_text_extracted": true
}