{
  "article_id": "35bb97e16269",
  "url": "https://www.tvwise.co.uk/news/live-streams-manchester-united-v-lyon-from-old-trafford/",
  "title": "Live Streams : Manchester United v Lyon from Old Trafford",
  "date": "20250417T214500Z",
  "domain": "tvwise.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United face a defining night in their season on Thursday as they welcome Lyon to Old Trafford for the second leg of their Europa League quarter final, with the tie finely poised at 2-2 following last week’s first-leg draw in France.\nHow to watch Man Utd v Lyon live streaming\nThe Manchester Utd v Lyon game can be watched on Tnt Sports 1 and Tnt Ultimate in the UK. The kick off time is 8PM BST.\nAfter a campaign marred by inconsistency and disappointment, United’s hopes of salvaging European football for next season now rest entirely on success in this competition.\nA crushing 4-1 defeat to Newcastle on Sunday marked their 14th league loss of the season, leaving Erik ten Hag’s side languishing in 14th place in the Premier League and just three points clear of the relegation zone.\nWith domestic ambitions in tatters, progression in Europe is a must, failure to reach the semi-finals could effectively end United’s season.\nThe Red Devils may take some encouragement from their strong historical record against French opposition, having lost just four of their 31 meetings (W17, D10).\nUnited will also look to capitalise on Lyon’s vulnerability at the start of matches. Ruben Amorim’s side have conceded first in ten of their 16 Ligue 1 home fixtures this season, as well as in their last two Europa League ties, a pattern that could play into United’s hands if they make a fast start under the lights at Old Trafford.\nLyon are enjoying a strong run of form. Paulo Fonseca’s men claimed a 3-1 win away at Auxerre on Sunday to move up to fourth in Ligue 1, holding onto the final Champions League qualification spot with just five games to play.\nThe French side also boast an impressive away record in Europe, having lost just once in their last 15 Europa League games on the road. A win in Manchester would send them through to their first Europa League semi-final since 2017.\nWith both teams having shared goals freely throughout the competition with both sides have scored in seven of Lyon’s last eight and in nine of United’s last eleven UEL fixtures, Thursday’s clash promises to be another open and entertaining affair.\nKick-off at Old Trafford is set for 8:00pm (BST), with the pressure firmly on Manchester United to deliver.",
  "word_count": 388,
  "scraped_at": "2026-02-14T02:20:59.029279",
  "_text_extracted": true
}