{
  "article_id": "35da48d17caa",
  "url": "https://www.gdnonline.com:443/Details/1360703/Goa-hold-off-Al-Seeb-to-reach-group-stage",
  "title": "Football : Goa hold off Al Seeb to reach group stage",
  "date": "20250813T230000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – FC Goa sealed their spot in the AFC Champions League Two group stage after staving off a late fightback from Al Seeb Club of Oman to walk away with a 2-1 win in their Preliminary Stage tie yesterday.\nDejan Drazic and Javier Siverio scored for FC Goa and the Indian club will now wait to discover their Group Stage opponents tomorrow.\nAl Seeb started aggressively, testing FC Goa as early as the second minute with Nasser Al Rawahi forcing defender Pol Moreno into an acrobatic clearance, while Zahir Al Aghbari’s follow up from inside the box was blocked.\nThe home side took time to settle and could have broken the deadlock in the ninth minute when Drazic broke free on the left but with only the keeper to beat, the midfielder’s soft shot was easily collected by Ahmed Al Rawahi.\nAl Rawahi was in the thick of things again for Al Seeb in the 23rd minute when his timely tackle opened up space to set up Abdul Aziz Al Muqbali, whose curling effort was parried away by FC Goa keeper Hrithik Tiwari.\nHowever, FC Goa showed their quality a minute later when Borja Herrera’s instinctive long pass found Drazic on the left, with the midfielder evading Al Rawahi’s challenge before delicately chipping the ball over Ahmed Al Khamisi and into the back of the net.\nThe Indian Super League side stayed on top of things in the second half with Drazic outmuscling the Al Seeb defenders to surge into the box before forcing Al Rawahi to palm away his stinging shot in the 52nd minute.\nThe momentum saw FC Goa extend their lead moments later when Herrera’s cross off a corner floated into the box perfectly for Siverio to rise above Al Rawahi for a headed finish.\nAl Seeb, the 2022 AFC Cup winners, reduced the deficit at the hour mark through Nasser Al Rawahi’s strike from close range off Ali Al Busaidi’s cutback but that was to be it as FC Goa booked their spot in the group stage while the Omani side will continue their continental campaign in the AFC Challenge League 2025-26.\nMeanwhile, Turkmenistan’s Ahal FC emerged 2-1 victors against FC Regar-TadAZ of Tajikistan to book their berth in the group stage.\nThe 2024 Turkmenistan Higher League runners-up will now turn their attention towards tomorrow’s draw to find out their group stage opponents.\nPersib Bandung overcame a determined Manila Digger FC 2-1 at the Gelora Bandung Lautan Api Stadium.\nThe Indonesian side will now make their second consecutive appearance in the group stage while Manila will seek continental honours in the AFC Challenge League.",
  "word_count": 439,
  "scraped_at": "2026-02-14T02:11:49.088837",
  "_text_extracted": true
}