{
  "article_id": "35e043a58b11",
  "url": "https://thepeoplesperson.com/2025/05/03/aston-villa-unlikely-to-trigger-marcus-rashfords-buy-option-looking-at-portos-samu-aghehowa-instead-293588/",
  "title": "Aston Villa unlikely to trigger Marcus Rashford buy option , looking at Porto Samu Aghehowa instead - Man United News And Transfer News",
  "date": "20250503T230000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Breakdown in relations between Marcus Rashford and Manchester United led to the Mancunian departing on loan in January.\nThe Englishman’s poor form was a continuing theme under Erik ten Hag, and Ruben Amorim was not afraid to act on it, citing off-field issues behind his absence from the first team.\nThe Englishman decided to give out an explosive interview in which he openly revealed that he wanted to leave his boyhood club and after Barcelona dithered over his wage demands, Aston Villa pounced.\nThe Birmingham-based outfit have the option of making his loan move permanent for £40 million, and initially, it seemed like Unai Emery would love to keep the United star given his resurgence in form.\nRashford’s improved form\nThe 27-year-old netted four times while also registering six assists from 10 starts across all competitions, with his form also ensuring a recall to the Three Lions national team.\nRashford was also interested in staying but Villa’s exit from the Champions League at the hands of Paris Saint-Germain and the prospect of Villa missing out on Champions League football seems to have changed his mind.\nNow, the versatile forward is rethinking his position, with dream club Barcelona open to a summer approach while PSG also lie in wait.\nAs per The Sun, Villa, who are seventh and only a point behind the Champions League places, are also having second thoughts given the Carrington graduate’s humongous wage demands.\nWhich is why they are scouting Porto sensation Samu Aghehowa, who is incidentally a long-term target for the Red Devils, and are unlikely to trigger Rashford’s buy option.\n“ASTON VILLA are stepping up their hunt for Porto striker Samu Aghehowa – as they look unlikely to trigger Marcus Rashford’s £40 million buy-out option. Villa sent a scout to Portugal on Friday for another look at Aghehowa, who scored twice in a 3-1 win over Moreirense.\nVilla unlikely to buy him\n“Unlike Villa, Porto can no longer qualify for next season’s Champions League as the gap to the top two is too large and they may struggle to resist offers in excess of £50m for Aghehowa. Boss Unai Emery is keeping his options open over the number nine role at Villa Park for next season.\n“Ollie Watkins will turn 30 in December and the overall cost of making loan star Rashford’s transfer permanent appears a major obstacle. Villa currently pay a fraction of the Manchester United’s star’s wages and it would take an overall outlay of over £100m to afford the transfer fee and salary for a three-year deal.”\nThe Porto striker is only 20 and while his initial fee is likely to be more than that of Rashford, his resale value and comparatively lower wages means it is a much more easier deal to complete.\nRashford has not future at United and will be hoping that the Catalans or the Parisians actually come knocking given his improved form.\nFeature image Mike Hewitt via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 497,
  "scraped_at": "2026-02-14T01:58:31.678652",
  "_text_extracted": true
}