{
  "article_id": "36070276a6f4",
  "url": "https://www.prokerala.com/news/articles/a1585996.html",
  "title": "Real Madrid struggles cannot be attributed to Kylian Mbappe , says Ancelotti",
  "date": "20241130T140000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid, Nov 30 : Real Madrid's struggles continued with their 0-2 loss against Liverpool in the UEFA Champions League matchday 5. Despite Kylian Mbappe's crucial penalty miss during the game, head coach Carlo Ancelotti is adamant that their difficulties cannot be attributed to the Frenchman's rough patch.\nMadrid, Nov 30 (IANS) Real Madrid’s struggles continued with their 0-2 loss against Liverpool in the UEFA Champions League matchday 5. Despite Kylian Mbappe’s crucial penalty miss during the game, head coach Carlo Ancelotti is adamant that their difficulties cannot be attributed to the Frenchman’s rough patch.\n\"Mbappe's problem is the same as for all of us. The idea is to try to find the best version of ourselves: from him, from myself, from the other players. We don't consider it an individual problem for a player who, among other things, is new here, is adapting, has scored eight goals, and has participated in our attacking game with assists. We can all do better.\n[Mbappe] isn't depressed, he's aware that he has to do better.Many of my players have missed penalties. We have to continue to support and help. It's a collective problem and not an individual one,\" Ancelotti said in a press conference on Saturday ahead of Madrid's LaLiga game with Getafe.\nThe 25-year old has scored eight goals across all competitions this season and has not showcased his clinical self football fans had grown accustomed to.\nWith Mbappe being left out of the France squad in October and November, head coach Didier Deschamps revealed he believes ‘there is a physical and psychological element ' that has led to the striker’s rough patch.\nThe 25-year old had missed out on France’s previous international break through a knee injury and was not called up for the games against Israel and Italy and has not scored a goal for Les Bleus since June.\nReal Madrid, who are heavily depleted with injuries, are only four points behind league leaders FC Barcelona in the La Liga and that too with a game in hand. However the defending European champions will be worried about the side’s performance in the Champions League group stage as they sot in 24th place with just three games remaining.",
  "word_count": 367,
  "scraped_at": "2026-02-14T02:02:07.181724",
  "_text_extracted": true
}