{
  "article_id": "361d774386ef",
  "url": "https://www.uefa.com/uefachampionsleague/news/0286-19230f04ee79-7c84dc9f902c-1000--highlights-round-up-newcastle-city-shine/",
  "title": "Wednesday highlights and round - up : Newcastle and Manchester City shine | UEFA Champions League",
  "date": "20231004T233000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday highlights and round-up: Newcastle and Manchester City shine\nWednesday, October 4, 2023\nArticle summary\nNewcastle recorded a famous victory over Paris while Manchester City and Barcelona ground out wins.\nArticle top media content\nArticle body\nNewcastle blew Paris away as UEFA Champions League football returned to St James' Park while Manchester City and Barcelona had to dig deep for victories as the drama continued to the end of Matchday 2.\nUEFA.com rounds up all the action.\nGroup E\nAtlético de Madrid 3-2 Feyenoord\nÁlvaro Morata struck two as Diego Simeone's men twice came from behind to record their first win in seven Champions League outings. Atleti were made to work extremely hard by an enterprising Feyenoord outfit, but their star strikers and the excellence of Jan Oblak saw them through. Morata cancelled out Mario Hermoso's early own goal and, though Dávid Hancko restored the visitors' lead, Antoine Griezmann's acrobatic effort just before the break and Morata's tap-in soon after secured the points.\nKey stat: Morata is only the third Spanish player to reach 25 Champions League goals (group stage to final) after Raúl González (71) and Fernando Morientes (33).\n25/10: Feyenoord vs Lazio, Celtic vs Atlético de Madrid\nCeltic 1-2 Lazio\nPedro Rodríguez clinched a dramatic comeback victory for Lazio in Glasgow. The hosts went ahead through Kyogo Furuhashi but the Italian side fought back and equalised before the interval when Matías Vecino's header crept over the line. Celtic pushed for the game's winner in the second half with Reo Hatate's well-worked effort denied and Luis Palma's strike ruled out for offside, but it was Lazio veteran Pedro who sealed the victory with a last-gasp header.\nKey stat: Celtic have not won a Champions League group stage match at home since a 2-1 victory against Ajax in October 2013 (D2 L9 since then).\n25/10: Feyenoord vs Lazio, Celtic vs Atlético de Madrid\nGroup F\nDortmund 0-0 Milan\nMilan registered a second successive goalless draw after they and Dortmund cancelled each other out. Clear-cut chances were at a premium with Donyell Malen firing two wide before Mike Maignan thwarted Niclas Füllkrug and Ramy Bensebaini. After half-time, Christian Pulišić shot straight at Gregor Kobel and although Dortmund continued to push, it was Milan who almost nicked the win late on when Samuel Chukwueze was denied by Kobel and Tijjani Reijnders clipped the rebound wide.\nKey stat: Pulišić became the first man from the United States to play 50 Champions League games.\n25/10: Paris vs Milan, Newcastle vs Dortmund\nNewcastle 4-1 Paris\nNewcastle's first group stage home game in more than two decades was worth the wait as they won a fascinating encounter with Paris. Miguel Almirón's early opener, after Alexander Isak had been denied, was followed up when Dan Burn's fierce header crossed the line. Sean Longstaff made it three after the restart from a tight angle and, while Lucas Hernández pulled one back, Fabian Schär's screamer rounded off a fine victory.\nKey stat: Newcastle are unbeaten in eight UEFA group stage home matches (W6 D2) but Paris have won only three of 15 away games against English clubs.\n25/10: Paris vs Milan, Newcastle vs Dortmund\nGroup G\nCrvena zvezda 2-2 Young Boys\nOsman Bukari's late equaliser saved a point for the hosts. The Swiss side were a goal down at the interval after Cherif Ndiaye turned in Bukari's cross-shot, but Young Boys levelled three minutes after half-time when Joel Monteiro's through ball was finished off by Filip Ugrinic. Just after the hour Cédric Itten slotted home a penalty, but home pressure finally told as Bukari's strike from a narrow angle secured the draw for Crvena zvezda.\nKey stat: This is the third consecutive draw between the sides in the Champions League after the pair met in the 2019/20 play-offs.\n25/10: Leipzig vs Crvena zvezda, Young Boys vs Man City\nLeipzig 1-3 Man City\nLate goals by substitutes Julián Álvarez and Jérémy Doku separated two even sides. City's first-half dominance had earned only a one-goal lead, Phil Foden finishing first time from Rico Lewis's cut-back. Loïs Openda's composed finish on the break levelled the scores and Leipzig asserted themselves throughout the second half, only to face late heartbreak. Álvarez beat Janis Blaswich with six minutes left, then Doku finished off an added-time counterattack.\nKey stat: Eighteen-year-old Rico Lewis made one assist, had a 94% pass accuracy and won 100% of his duels in an impressive midfield display for City.\n25/10: Leipzig vs Crvena zvezda, Young Boys vs Man City\nGroup H\nAntwerp 2-3 Shakhtar Donetsk\nThe Ukrainian team staged a stunning recovery from 2-0 down at half-time to claim their first points in the group. Arbnor Muja and Michel-Ange Balikwisha had given the hosts a deserved advantage but two goals from Danylo Sikan, either side of a deflected Yaroslav Rakitskyy free-kick, turn the tide. Toby Alderweireld missed the chance to snatch a point for the Belgian champions when he dragged his last-gasp penalty wide.\nKey stat: Shakhtar are unbeaten in their last 14 UEFA club competition matches against Belgian teams (W9 D5) and have won each of the last seven.\n25/10: Barcelona vs Shakhtar Donetsk, Antwerp vs Porto\nPorto 0-1 Barcelona\nBarcelona secured the win and leadership of Group H. The hosts dominated for large periods but could not find a way past Marc-André ter Stegen while Jules Koundé and Ronald Araújo produced vital challenges. The only goal came on the break in first-half added time, Ilkay Gündoğan latching onto a loose pass before playing in substitute Ferran Torres to slot the only goal. Gavi was sent off in the dying seconds after collecting a second booking.\nKey stat: Barcelona's Lamine Yamal (16 years and 83 days) became the youngest player to start a Champions League match, beating the record of Celestine Babayaro (16 years and 86 days) for Anderlecht against Steaua in November 1994.\n25/10: Barcelona vs Shakhtar Donetsk, Antwerp vs Porto",
  "word_count": 982,
  "scraped_at": "2026-02-14T02:10:28.715010",
  "_text_extracted": true
}