{
  "article_id": "3658c68f9f7c",
  "url": "https://www.nigerianeye.com/2025/04/transfer-osimhen-reaches-agreement-with.html",
  "title": "Transfer : Osimhen reaches agreement with Man United - Nigerian News , Latest Nigeria In News . Nigeria News . Your online Nigerian Newspaper . ",
  "date": "20250420T130000Z",
  "domain": "nigerianeye.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Super Eagles striker Victor Osimhen has reached an agreement with Manchester United over personal terms ahead of a potential summer move, according to Turkish journalist Serdar Çelikler.\n“Victor Osimhen has reached an agreement with Manchester United. But there is also the club side of the matter,” Çelikler said on a podcast.\nThe Nigeria international, currently on loan at Turkish giants Galatasaray, has been in sensational form this season, netting 29 goals and providing six assists in 34 appearances across all competitions.\nUnited’s immediate focus in the transfer market is reportedly recruiting a top striker given Rasmus Hojlund’s dismal form this season, with the Dane managing a meagre three Premier League goals. New head coach Ruben Amorim is understood to want the struggling forward gone in the summer.\nWhile the personal terms have reportedly been agreed, negotiations between United and Napoli regarding the transfer fee are still ongoing. Osimhen has a release clause worth €75 million (£63m), but reports suggest the Serie A giants are prepared to offer the 20-time English league champions a discount.\nJuventus are also long-term admirers of the Nigerian hitman, but the Naples outfit have no intention to sell to a direct rival, which further strengthens United’s position in the race.\nUnited’s chances of landing the prolific striker may ultimately depend on their Europa League fate, as Osimhen reportedly wants to play Champions League football next season. The Red Devils have kept backup options like Liam Delap and Jean-Philippe Mateta ready in case the deal falls through.\nTurkish journalist Ali Naci Küçük had earlier revealed that the Premier League side has offered Osimhen a contract worth £ 660,000 a week before tax, which would make him the highest-paid player at Old Trafford.\n“There is a high possibility that Osimhen will say goodbye (to Galatasaray), but there is no decision made at the moment,” Küçük said. “Juventus and Manchester United clearly want Osimhen. Juventus and Manchester’s offer is a net €20m (£660,000-a-week).”\nGalatasaray, where Osimhen is currently enjoying his loan spell, remain eager to retain his services but are unlikely to meet his financial demands, with the striker reportedly asking for €15m from the Turkish club.\n“Osimhen’s words do not mean that he will leave,” Galatasaray’s vice-president Ibrahim Hatipoglu said recently. “He said that Galatasaray will always be in his heart even if he leaves in the worst-case scenario, but he did not say that he would leave. We want him to stay with us.”\nWhen questioned about his future last week, Osimhen remained coy, saying, “There are always rumours about me, of course. But I prefer to live in the moment. I am enjoying myself right now. I am enjoying both the club and my life here.”\nThe Nigerian striker joined Galatasaray on loan at the start of the season and has had a phenomenal campaign in Turkey, with the Istanbul club covering €6m of his €10-11m net annual salary, while Napoli pick up the remainder.\nClick to signup for FREE news updates, latest information and hottest gists everydayAdvertise on NigerianEye.com to reach thousands of our daily users",
  "word_count": 511,
  "scraped_at": "2026-02-14T01:58:31.715201",
  "_text_extracted": true
}