{
  "article_id": "3669685f559a",
  "url": "https://www.bicesteradvertiser.net/news/national/25239215.david-beckham-immensely-proud-knighthood-kings-birthday-honours/",
  "title": "David Beckham  immensely proud  of knighthood in King Birthday Honours",
  "date": "20250613T234500Z",
  "domain": "bicesteradvertiser.net",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former England captain David Beckham said he is “immensely proud” to have been given a knighthood in the King’s Birthday Honours.\nThe sports star, who celebrated his 50th birthday last month, is being honoured for services to sport and charity.\nSir David said in a statement to the PA news agency: “Growing up in East London with parents and grandparents who were so patriotic and proud to be British I never could have imagined I would receive such a truly humbling honour.\n“To have played for and captained my country was the greatest privilege of my career and literally a boyhood dream come true.\n“Off the pitch I have been fortunate to have the opportunity to represent Britain around the world and work with incredible organisations that are supporting communities in need and inspiring the next generation.\n“I’m so lucky to be able to do the work that I do and I’m grateful to be recognised for work that gives me so much fulfilment. It will take a little while for the news to sink in but I’m immensely proud and it’s such an emotional moment for me to share with my family.”\nSir David married his wife Victoria in 1999 and the couple share four children together – Brooklyn, Romeo, Cruz and Harper.\nHe had been set on becoming a professional footballer as a child and as a teenager he joined Manchester United as a trainee, forming part of the class of ‘92 that won the FA Youth Cup, along with Ryan Giggs and Gary Neville.\nThe sports star from north east London made his Premier League debut for United in 1995 and was part of the team that earned a dramatic Champions League final victory in 1999 when they beat Bayern Munich with two late goals.\nIn total he scored 85 goals and collected honours including six Premier League titles and two FA Cups as a footballer, before retiring from the sport in 2013.\nAlongside his football career Sir David has supported a number of charity causes and launched a fundraising appeal for Unicef in April ahead of his milestone 50th birthday.\nHe has served as a Goodwill Ambassador for humanitarian aid organisation Unicef since 2005 and is a founding member of the charity Malaria No More UK’s leadership council.\nPhilip Goodwin, Unicef UK chief executive said: “We’re so thrilled that our Unicef Goodwill Ambassador, David Beckham, has been awarded a knighthood in the King’s Birthday Honours.\n“David Beckham has done an incredible amount to advocate for children’s rights over the last 20 years.\n“He became a Goodwill Ambassador in 2005 and launched 7: The David Beckham Unicef Fund in 2015 – with the goal of helping children around the world, especially girls, break down barriers including bullying, violence, child marriage and missed education.\n“He’s travelled extensively to see Unicef’s work and used his profile to raise awareness, as well as support our flagship fundraising campaign Soccer Aid for Unicef and launch global fundraising appeals.”\nLast year the former sports star, who has described himself as a “huge Royalist”, was named an ambassador for the King’s Foundation, an educational charity established by the King in 1990.\nIn February Sir David appeared in a video helping to launch the hunt for “35 under 35”, a network of influencers who can fly the flag for the charity which reflects Charles’ vision.\nHe is also known for his stylish clothing choices, and in 1998 was named most stylish man of the year by GQ magazine and he has modelled for the likes of H&M, Armani and Boss.\nIn 2018 he was appointed Ambassadorial President of the British Fashion Council where he assisted the BFC in its search for young British talent from all backgrounds.\nHis wife, Victoria, turned her hand to fashion designing after her time in the Spice Girls and Sir David and their four children are often spotted at her shows.\nSir David is currently a part-owner of MLS side Inter Miami, and is also the co-founder of Studio 99, the production company behind the hit Netflix series Beckham.\nHe was formerly appointed an officer of the Order of the British Empire (OBE) in 2003.",
  "word_count": 696,
  "scraped_at": "2026-02-14T02:15:31.406193",
  "_text_extracted": true
}