{
  "article_id": "36aaf982d92e",
  "url": "https://www.uefa.com/uefachampionsleague/news/0285-19104b6473ec-280e45e90af2-1000--wednesday-game-by-game-preview/",
  "title": "Champions League Matchday 2 Wednesday : Game - by - game preview | UEFA Champions League",
  "date": "20231004T000000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League Matchday 2 Wednesday: Game-by-game preview\nWednesday, October 4, 2023\nArticle summary\nGet the lowdown on Wednesday's eight matches as the 2023/24 UEFA Champions League group stage continues.\nArticle top media content\nArticle body\nThe best of the best are competing on the ultimate stage in the 2023/24 UEFA Champions League group stage; get all the key information on the remaining eight fixtures coming up on Matchday 2.\nWednesday 4 October\nAtlético de Madrid vs Feyenoord (18:45)\nDiego Simeone has seen most things in football during more than three decades as a player and coach but goalkeeper Ivan Provedel's last-gasp equaliser on Matchday 1 might well have been a first. \"We had clear goalscoring chances, defended organised and with a lot of effort,\" he said. \"I am left with a good feeling despite the goal in the last minute.\" Five days later Atlético beat Real Madrid 3-1 in La Liga, giving Feyenoord a warning that Simeone's side usually react well to setbacks.\nDid you know?\nAtlético have won only two of their last 11 Champions League group stage matches (D3 L6).\nAntwerp vs Shakhtar Donetsk (18:45)\nToby Alderweireld offered Shakhtar a warning after Antwerp were beaten 5-0 by Barcelona on their group stage debut. \"Sometimes it's not bad to be beaten like this,\" he said. \"It makes you angry, you store that up and then you feel the heat and deploy it next time you play.\" The Ukrainian side will be equally determined to make amends for Matchday 1 when they shipped three goals inside half an hour as they succumbed to Porto.\nDid you know?\nShakhtar have won only one of their last 14 Champions League group stage matches (D6 L7).\nCeltic vs Lazio (21:00)\nBrendan Rodgers was in philosophical mood after his nine-man Celtic side were defeated 2-0 at Feyenoord, saying: \"If we can get to the last game when we play Feyenoord at home with everything to play for, then we will be in with a fantastic chance.\" Their form in Glasgow will be pivotal if they are remain in contention come Matchday 6, meaning they must end their ten-game winless home run in the group stage as soon as possible.\nDid you know?\nLazio are unbeaten in seven Champions League group stage matches (W2 D5).\nDortmund vs Milan (21:00)\nEdin Terzić was quick to point out areas of improvement for Dortmund after they suffered a disappointing 2-0 reverse at Paris. \"We wanted to be braver, attack more, leave our positions more,\" he said. \"We saw after the break what is possible if you are ready to move those three to five metres up and trust the player behind you.\" Milan did display the necessary courage against Newcastle on Matchday 1; now adding a clinical edge will be their goal after Stefano Pioli's men drew a blank in that game.\nDid you know?\nDortmund have only lost one of their last 15 home games in the Champions League group stage (W9 D5).\nNewcastle vs Paris (21:00)\nNewcastle followed up their encouraging goalless draw at Milan by winning 8-0 at Sheffield United in the Premier League, showing their ability to balance to domestic and European commitments. \"Three games, three clean sheets, really good week,\" summarised defender Dan Burn. \"We were built on being solid defensively last season so it's great to get back to that.\" Paris also followed up a good Champions League result – the 2-0 victory against Dortmund – with an excellent domestic showing as they beat Marseille 4-0, although Kylian Mbappé limped off injured.\nDid you know?\nNewcastle have lost only two of their last 19 UEFA club competition group stage matches (W10 D7).\nLeipzig vs Man City (21:00)\n\"The Saxons profited from an exciting start and a strong second half, which made up for a period of weakness in the first,\" was the summary of Leipziger Volkszeitung after Leipzig's 3-1 success at Young Boys on Matchday 1. Marco Rose's side will not be able to afford any first-half lapses against City and Erling Haaland, who scored three of his five goals against them in last season's round of 16 second leg before the break.\nDid you know?\nCity have lost only two of their last 30 Champions League group stage matches (W22 D6).\nCrvena zvezda vs Young Boys (21:00)\n\"We have to play with the same courage as we did today up against the top teams, but iron out those moments of poor concentration,\" was the verdict of YB coach Raphaël Wicky as they slipped to a 3-1 defeat by Leipzig. Their Serbian opponents showed the bravery that Wicky desires, taking the lead at holders Man City before eventually going down 3-1. Both will see this game as vital if they are to harbour hopes of making it out of this section.\nDid you know?\nCrvena zvezda have won one of their three home games in both of their previous Champions League group appearances.\nPorto vs Barcelona (21:00)\nXavi Hernández was purring after his side began their European campaign by cruising past Antwerp 5-0. \"All my players are enjoying themselves,\" he said. \"We are playing better football than before – probably the best football since I took over.\" A sizeable task facing Porto then, but Sérgio Conceição's men have shown they will not go away quietly having scored five times in the 90th minute or beyond in their opening six Portuguese Liga outings.\nDid you know?\nOn Matchday 1, Barcelona's Lamine Yamal (16 years 68 days) became the second youngest player to make an appearance in the Champions League after Youssoufa Moukoko (16 years 18 days).",
  "word_count": 933,
  "scraped_at": "2026-02-14T02:10:28.717605",
  "_text_extracted": true
}