{
  "article_id": "36c1dd8ad8fb",
  "url": "https://www.caughtoffside.com/2025/06/05/crystal-palace-sign-outstanding-england-star/",
  "title": "Crystal Palace are interested in a move for AC Milan Fikayo Tomori",
  "date": "20250605T140000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace are reportedly exploring the possibility of signing AC Milan’s Fikayo Tomori as a replacement for their captain, Marc Guehi, who is attracting significant interest from top European clubs, according to TBR Football.\nGuehi, with only a year left on his contract, has been linked to Premier League giants such as Chelsea, Liverpool, Tottenham, and Newcastle United.\nTomori, an England international, has established himself as a key figure in Milan’s defense since his move from Chelsea.\nFikayo Tomori has admirers in the Premier League\nHis performances in Serie A and the Champions League have not gone unnoticed, and a return to the Premier League could be on the horizon.\nPalace are looking to sign an assured centre-back to replace Guehi if the defender leaves the club this summer.\nThe potential signing of Tomori would not only fill the void left by Guehi but also bring leadership and European experience to the Eagles’ backline.\nManager Oliver Glasner, who led Palace to their first-ever FA Cup victory in 2025, is keen on building a squad capable of competing on multiple fronts, including their upcoming Europa League campaign.\nMarc Guehi faces an uncertain future at Crystal Palace\nThe developments surrounding Guehi’s potential departure and Tomori’s possible arrival will be closely monitored by fans and analysts alike, anticipating how these moves could shape Crystal Palace’s future plans.\nPalace want to make a decision on the future of Guehi this summer as they risk losing the defender for free next year when he becomes a free agent. Being one of their most valuable players, they want to get the maximum transfer fee for him this summer.\nFootball pundit Tony Cascarino highlighted Guehi’s talent by calling him ‘outstanding’.\nAlong with Guehi, Eberechi Eze could also be heading out of Selhurst Park this summer as Tottenham step up interest in signing the English midfielder.\nCrystal Palace eyeing move for 28-year-old Tottenham star who Postecoglou wants to sell",
  "word_count": 321,
  "scraped_at": "2026-02-14T01:58:41.961957",
  "_text_extracted": true
}