{
  "article_id": "36ccf5c5747b",
  "url": "https://www.fourfourtwo.com/features/players-known-by-their-first-name",
  "title": "Players known by their first name",
  "date": "20240425T084500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Players known by their first name\nA look at some famous footballers in the men's game known by just their first name...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nMost footballers are known by their last name, even if they are also identifiable by their first.\nEveryone can recognise Lionel as Messi and Cristiano as Ronaldo, for example, but the use of their last names remains more common.\nThere are some players, however, who are known exclusively or much more often by just their first name. Particularly in Brazil and quite often in Portugal and also Spain.\nHere, a look at some notable examples from the men's game...\n32. Malcom\nMalcom might seem an unlikely name for a footballer, but the former Barcelona player is a talented winger who has represented Brazil at international level.\nMalcom Filipe Silva de Oliveira played for Corinthians and Bordeaux before joining Barcelona in 2018, but moved to Zenit Saint Petersburg after just a season at Camp Nou. The winger then signed for Saudi Pro League side Al-Hilal in 2023.\n31. Fred\nFred spent five years at Manchester United before moving to Fenerbahce in the summer of 2023 and has been a Brazilian international since 2014.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe midfielder had spells at Internacional and Shakhtar Donetsk earlier in his career. His full name is Frederico Rodrigues de Paula Santos, but he goes by just Fred.\n30. Jesé\nJesé Rodríguez Ruiz was tipped for big things early in his Real Madrid career, with some even talking about the winger as a future Ballon d'Or winner.\nKnown simply as Jesé, the attacker's progress was interrupted by injuries. He went on to play for Paris Saint-Germain and had a series of spells out on loan, but was never able to recapture his early form.\n29. Emerson\nAfter a successful spell with Gremio at the beginning of his career, Emerson played for Bayer Leverkusen, Roma, Juventus, Real Madrid and AC Milan.\nCapped 73 times by Brazil, the defensive midfielder was born Emerson Ferreira da Rosa but was known throughout his career as just Emerson.\n28. Ricardo\nRicardo won 79 caps for Portugal and was the starter for his national team in three consecutive tournaments: Euro 2004, the 2006 World Cup and Euro 2008.\nThe former Boavista, Sporting CP and Real Betis goalkeeper, full name Ricardo Alexandre Martins Soares Pereira, also had a brief spell at Leicester City.\n27. Fran\nA left-sided midfielder who won 16 caps for Spain, Francisco Javier González Pérez was Deportivo La Coruña's captain and a key member of the side which claimed La Liga in 1999/2000.\nKnown throughout his career as Fran, the midfielder spent his entire career at Deportivo, retiring in 2005 after 17 seasons at Riazor.\n26. Gabriel\nWhen Arsenal signed Gabriel Jesus from Manchester City in the summer of 2022, it meant there were three Gabriels – all Brazilians – at the north London club.\nBut while Gabriel Jesus and fellow forward Gabriel Martinelli are known by their full names, defender Gabriel Magalhães is referred to simply as Gabriel.\n25. Willian\nWillian won 70 caps for Brazil between 2011 and 2019 and also had a long spell at Chelsea, where he was part of two Premier League title triumphs.\nThe attacking midfielder, full name Willian Borges da Silva, later had spells at Arsenal, first club Corinthians and Fulham. He also spent six years at Shakhtar Donetsk earlier in his career.\n24. Miguel\nBorn in Lisbon of Bissau-Guinean and Cape Verdean descent, Luís Miguel Brito Garcia Monteiro played as a right-back or a winger between 1999 and 2012.\nBest remembered for long spells at Benfica and Valencia and for his international career with Portugal, Miguel won 59 caps between 2003 and 2010.\n23. Juan\nA Brazilian footballer with a Spanish first name, Juan won 79 caps for the Seleção between 2001 and 2010.\nThe centre-back, full name Juan Silveira dos Santos, started and finished his career at Flamengo and also had spells at Bayer Leverkusen, Roma and Internacional. He won the Copa America with Brazil in 2004 and 2007.\n22. Marcos\nMarcos spent his entire career at Palmeiras and was in goal for Brazil as Luiz Felipe Scolari's side won the World Cup in 2002.\nBorn Marcos Roberto Silveira dos Reis, the goalkeeper won 29 caps for Brazil between 1996 and 2012. He almost joined Arsenal after Palmeiras were relegated in 2002, but had a change of heart and ended up staying at the Sao Paulo club.\n21. Maicon\nOne of Brazil's best-ever right-backs, Maicon earned 76 caps for his national team and was part of the Inter team which won the treble under Jose Mourinho in 2010.\nThe former Roma and Manchester City player's full name is Maicon Douglas Sisenando. His parents had wanted to name him after Michael Douglas, but the registrar made a mistake with the first name. His twin brother was to be called Marlon Brando, but the same employee registered his name as just Marlon.\n20. Adrián\nAdrián San Miguel del Castillo, known simply as Adrián, began his career at Real Betis before spending six years at West Ham between 2013 and 2019.\nThe Spanish goalkeeper moved to Liverpool in 2019 as back-up to Alisson Becker and saved a penalty as the Reds beat Chelsea in the UEFA Super Cup in August that year.\n19. Eduardo\nEduardo Alves da Silva was born in Brazil but played international football for Croatia and scored an impressive 29 goals in 64 appearances for the European nation.\nThe striker, known as Eduardo, took Croatian citizenship during a spell at Dinamo Zagreb early in his career. He also spent three years at Arsenal but missed one due to a serious injury sustained in a match against Birmingham City. Later, he played for Shakhtar Donetsk and Flamengo, among others.\n18. Raí\nRaí is the brother of Brazil legend Sócrates and the former Paris Saint-Germain attacker was a World Cup winner in 1994, albeit playing something a bit-part role.\nBorn Raí Souza Vieira de Oliveira, he is known simply as Raí. A legend at Sao Paulo, where he won a Copa Libertadores and an Intercontinental Cup, he became a social activist after his retirement from football.\n17. Ederson\nEderson moved to Manchester City from Benfica in the summer of 2017 and the Brazilian quickly became a key player for Pep Guardiola's side.\nThe goalkeeper, who was born Ederson Santana de Moraes and is known simply by his first name, has been back-up to Alisson Becker for much of his international career.\n16. Denílson\nDenílson became the world's most expensive player when he moved from Sao Paulo to Real Betis in 1998 for a fee of around £21.5 million.\nThe winger, full name Denílson de Oliveira Araújo, was also part of Brazil's World Cup-winning squad in 2002, but never lived up to his potential and that lofty fee. He won 60 caps overall and also had spells at Flamengo and Bordeaux.\n15. Diego\nThe name Diego will always be associated with one of the greatest players of all time: Argentina's 1986 World Cup-winning captain Diego Armando Maradona.\nAnd even though the former Napoli great was known as \"El Diego\" (\"the Diego\") in Argentina, the rest of the world knew him mostly as Maradona. Later, though, Brazil's Diego Ribas was referred to mainly by his first name in a career spent with Santos, Porto and Atletico Madrid, among others. He was a good player too, but no Maradona...\n14. Sócrates\nSócrates (full name Sócrates Brasileiro Sampaio de Souza Vieira e Oliveira) was something of a cult figure in the 1980s. His beard and headband made him unique, while his attitude towards training was lax.\nThe brilliant midfielder was also a qualified doctor, but liked to drink and smoke. And he had a philosopher's name. Definitely not your average footballer.\n13. Memphis\nMemphis Depay wears only his first name on the back of his shirt for club and country – and what a name it is, too.\nThe Dutch attacker's father walked out on the family when he was just four years old and he has revealed he does not want to be known by the Depay name. Memphis sounds better, anyway.\n12. Marcelo\nMarcelo Vieira da Silva Júnior won five Champions League crowns at Real Madrid and left Los Blancos as the club's most decorated player in 2022.\nThe left-back, known simply as Marcelo, went on to win the Copa Libertadores with Fluminense in his homeland and won 58 caps for Brazil between 2006 and 2018.\n11. Romario\nRomário de Souza Faria is one of Brazil's all-time greats and the former Flamengo, Vasco da Gama and Barcelona forward was instrumental in the nation's World Cup win in 1994.\nKnown simply as Romário, the striker scored over 1,000 goals in his career (according to his numbers, at least) and went into politics after hanging up his boots. And even as a senator in his homeland, he continued to be referred to largely by his first name.\n10. James\nJames Rodríguez has played for the likes of Real Madrid, Bayern Munich and Porto and is widely regarded as Colombia's greatest-ever footballer.\nThe player's father, Wilson Rodríguez, was also a footballer. But he was not around much in James' childhood, leaving the boy and his mother early on. That is why the number 10 prefers to go by his first name, with James on the back of his shirt for club and country.\n9. Adriano\nFor a short period in the mid-2000s, Adriano Leite Ribeiro (Adriano) might have been the best striker in the world. Unfortunately, his peak did not last too long.\nBlighted by personal problems and mental health issues, the former Brazil forward fell into depression and alcoholism following the death of his father. But at his best, he was virtually unstoppable, won trophies with both Flamengo and Inter – and scored 27 goals in 48 games for Brazil.\n8. Saúl\nOne of the best midfielders in LaLiga over the past decade, Saúl Ñíguez is a dependable performer who has also regularly filled in at the back for Atletico Madrid.\nWith Atletico, Spain and also during his brief spell at Chelsea, the midfielder has worn just his first name on the back of his shirt. Simply Saúl.\n7. Alisson\nEven though he has A. Becker on the back of his shirt for club and country, Brazil's goalkeeper is known pretty much by everyone as just Alisson.\nBefore joining Liverpool, the former Internacional goalkeeper played at Roma and in Italy, he had Alisson on the back of his jersey. Nobody refers to him as Becker. He's that tennis player...\n6. Dele\nKnown for years as Dele Alli, the former Tottenham and England attacker later asked to be referred to simply as \"Dele\".\nThe midfielder, whose full name is Bamidele Jermaine Alli, changed the name on his shirt from Alli to Dele, revealing he had \"no connection\" with his family name. Years later, he would go on to give a harrowing account of how he was abused as a child.\n5. Joaquín\nJoaquín Sánchez is a legend at Real Betis, where he played across two spells and retired at the age of almost 42, and also one of Spanish football's great characters.\nAlways telling jokes, the former Spain winger was famously photographed in the nude amid celebrations of a Copa del Rey win at Valencia and claimed in an interview that he was breast-fed until the age of six. After calling former Malaga team-mate Julio Baptista \"Hulio\" in a clip which went viral as he said his hobby was playing tennis before admitting he had \"never picked up a racquet\" in his life, he asked La Liga for permission to wear \"Hulio\" on his shirt. He didn't, but one name was enough: Joaquín.\n4. Neymar\nNeymar is one of Brazil's all-time great players and the former Barcelona and Paris Saint-Germain forward surpassed Pelé as the nation's top scorer in September 2023.\nNeymar da Silva Santos Júnior began his career at Santos, before playing for Barça and PSG and later moving to Saudi Arabian side Al-Hilal. And wherever he goes, he is known simply by his first name.\n3. Raúl\nWhile there are other footballers named Raúl, there really is only one Raúl. The former Real Madrid and Spain striker, of course.\nThe forward, full name Raúl González Blanco, came through the youth system at Atletico Madrid but became a legend at Real Madrid, where he won three Champions Leagues and was the club's all-time top scorer with 323 goals until he was overtaken by Cristiano Ronaldo. On the back of his shirt, the number 7 and simply Raúl.\n2. Xavi\nXavi almost left Barcelona in his younger years as he felt huge pressure to replace former team-mate Pep Guardiola. He went on to become the club's greatest-ever midfielder.\nHis full name is Xavier Hernandez Creus, but he's simply Xavi and that has always been the case since his debut for the Catalan club in 1998, through to his role in Spain's successes between 2008 and 2012 and later as Barça coach as well.\n1. Ronaldo\nEven in a career interrupted by injuries, Ronaldo is widely considered one of the finest footballers of all time.\nThe legendary Brazil forward won two World Cups, although he did not play in 1994, and featured for some of the world's biggest clubs – including Barcelona, Real Madrid, Inter and AC Milan. His full name is Ronaldo Luís Nazário de Lima. His Brazil team-mate Ronaldo de Assis Moreira became known as Ronaldinho – because Ronaldo was already taken.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 2462,
  "scraped_at": "2026-02-14T01:51:24.791764",
  "_text_extracted": true
}