{
  "article_id": "36ebf01a417d",
  "url": "https://www.dailybreeze.com/2024/09/25/lafc-works-overtime-to-secure-its-1st-u-s-open-cup-title/",
  "title": "LAFC works overtime to secure its 1st U . S . Open Cup title",
  "date": "20240926T103000Z",
  "domain": "dailybreeze.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LOS ANGELES — Once more, the Los Angeles Football Club needed extra time.\nAnother 30 minutes made all the difference.\nMuch like its last trophy-winning effort, the nail-biting 2022 MLS Cup title match, LAFC made the most of the moment on Wednesday night at BMO Stadium, scoring twice in extra time to beat Sporting Kansas City, 3-1, and claim the club’s first Lamar Hunt U.S. Open Cup.\nFollowing a scoreless opening 45 minutes in the 109th edition of America’s domestic cup competition – the oldest in U.S. soccer – the entertaining affair hung in the balance until LAFC grabbed the game by the neck thanks to goals from Olivier Giroud, Omar Campos and Kei Kamara, avoiding a penalty kick shootout and denying the visitors a record-tying fifth Open Cup victory.\nKansas City would have been the first club to achieve that feat since a semi-pro team from L.A., Maccabee AC, pulled it off in the 1970s and 1980s, placing their names alongside the legendary Bethlehem Steel and Fall River teams that each won a handful of Open Cups before World War II.\nEntering the match coming off four consecutive defeats in tournament finals, memories of last year’s disappointments in CONCACAF Champions League, the Campeones Cup and the MLS Cup, as well as the 2024 Leagues Cup, disappeared when referee Armando Villarreal blew the whistle and 22,214 spectators, sans a small contingent from Kansas City, celebrated in the stands.\n“I thought it would be more relief,” LAFC head coach Steve Cherundolo said. “It really is just joy.\n“I think we were due. The boys really wanted it.”\nLAFC became the first L.A. area team to win the title since the Galaxy in 2005, and is the 11th to do so beginning with the L.A. Kickers in 1958.\nThe result represents the fourth piece of hardware in LAFC’s trophy collection, joining the 2019 and 2022 MLS Supporters’ Shields and the 2022 MLS Cup, which hinged on the latest goal in that competition’s history: Gareth Bale’s game-tying goal came on the last play before penalties.\nFullback Diego Palacios famously set up Bale against the Philadelphia Union with a chipped cross that allowed the Welshman to rise above a defender and score. Working down the same flank where Palacios operated, Campos’ introduction in the 67th minute was a key factor for the last hour of the match, including the game-winner, a beautiful curler with his right foot inside the far post in the 102nd minute.\n“Today we saw what [Campos] was capable of doing, not only the goal but defending [Johnny] Russell, a very dangerous and tricky player,” fellow LAFC fullback Sergi Palencia said. “And going forward he gave us a lot with the ball, a lot of passing. A lot of energy.\n“It’s a matter of time that he will be one of the best left backs in the league, for sure. He has amazing potential.”\nCherundolo played the same position as Campos during his professional career for club and country, and noted that it was the first time he had seen the talented Mexican strike a ball with his right foot since signing with LAFC prior to the start of the season.\nThe 22-year-old fullback’s goal was followed by Kamara, whose insurance header seven minutes later off a cheeky chip by Bouanga delivered on a gravity-defying attempt.\nFor the 40-year-old striker, an Open Cup champion with Kansas City in 2012, the chance to do it again against the only team he had won a trophy with made him nervous. Those feelings were quelled with a contribution that put his name on the same scoresheet in a cup final as Giroud, the iconic French goal scorer who joined LAFC this summer.\n“It’s tough for strikers,” Kamara said. “Unselfishly, I was so wishing for him to get a goal because I know how tough it is. For him to get one tonight, I ran onto the field because I know what it means.”\nThe first hint that this could be LAFC’s night came when Giroud tapped in his first goal since losing the Leagues Cup in Columbus last month.\nGiroud’s goal in the 53rd minute came off a cross from Mateusz Bogusz, who received a terrific ball into space from Palencia that provided him the room he needed to deliver a quality cross.\nA four-time winner of England’s FA Cup, Giroud nearly put LAFC on the scoreboard prior to halftime when Denis Bouanga played the ball into a similar spot. Only a save from SKC goalkeeper Tim Melia denied him.\nWhile LAFC came out of the dressing room pressing the action to win the ball in Kansas City’s end of the field, the visitors handled the pressure well in the first half.\nDespite struggling throughout the MLS regular season and getting eliminated from postseason contention last weekend, SKC put up a fight before losing an Open Cup final for the first time in five finals appearances.\nLAFC appeared more lively than it had the past three winless weeks and engineered opportunities in the box that came straight from its chance-creating DNA.\nBouanga’s presence in that production was undeniable all match.\nThe French winger dribbled long distances and bodied opposing players off the ball. He also remained on the field for 120 minutes, joining Bogusz, Palencia, Maxime Chanot, Ryan Hollingshead and goalkeeper Hugo Lloris.\nShortly after Giroud put LAFC ahead for the first time, SKC attacker Erik Thommy leveled the score when Dániel Sallói cut back a pass in the box.\nCherundolo coached Tommy as an assistant in 2018 at SfB Stuttgart. Now in his third year as LAFC’s manager, Cherundolo chose to remove Giroud after an hour had passed, replacing him with Uruguayan winger Cristian Olivera, whose energy and pace allowed LAFC to play more like the domineering side that went on a club record 13-match unbeaten run earlier this year.\nLAFC’s 2024 Open Cup tournament coincided with that spell, beginning in early May in Las Vegas. Two decisive results at BMO Stadium over second-division USL Championship foes Loudoun United FC (of Virginia) and New Mexico United, put the team into a road semifinal against Seattle days after losing the Leagues Cup last month.\n“I’m ecstatic for the players,” Cherundolo said. “They put in the hard work. They have to listen to me, I wouldn’t say complain, but criticize a lot in a way that hopefully they learn. And they did. They are learning and this will only make us stronger down the stretch of the season, I’m convinced of that.”\nWHAT A FINISH BY OMAR CAMPOS 💥#LAFCvSKC 2-1 pic.twitter.com/ktUqvH1I4m\n— LAFC (@LAFC) September 26, 2024\nKEI KAMARA SEALS IT pic.twitter.com/A1j0RKjCFN\n— LAFC (@LAFC) September 26, 2024\nBig moment, big player 😤\nOlivier Giroud is there to give us the lead.#LAFCvSKC 1-0 pic.twitter.com/NgHaDgJKgl\n— LAFC (@LAFC) September 26, 2024",
  "word_count": 1135,
  "scraped_at": "2026-02-14T02:08:12.419986",
  "_text_extracted": true
}