{
  "article_id": "36f06fca8f7a",
  "url": "https://www.meathchronicle.ie/2024/09/29/erik-ten-hag-says-stuttering-manchester-united-must-respect-the-criticism/",
  "title": "Erik ten Hag says stuttering Manchester United must  respect the criticism  ",
  "date": "20240929T091500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag says stuttering Manchester United must ‘respect the criticism’\nBy Simon Peach, PA Chief Football Writer\nErik ten Hag says he respects the critics and even embraces some of their suggestions as Manchester United’s frequently under-fire manager prepares to take on Tottenham.\nSunday sees the stuttering Red Devils welcome Ange Postecoglou’s side four days after their deflating 1-1 draw with FC Twente at an expectant Old Trafford.\nTen Hag was annoyed by United’s mentality and toothlessness in a Europa League opener that followed a frustrating 0-0 stalemate at Crystal Palace.\nThose results, but particularly Wednesday’s performance, have increased the noise around United, but Ten Hag has long since learned how to deal with doubters.\n“First of all, respect the criticism,” the Dutchman said. “There are many. You can have an opinion about football.\n“When you are in the job, you have to deal with this, but I can’t take every criticism into account.\n“I don’t read, of course, all the criticism. It’s not even possible but I don’t want even to know. I need to know some, and some are very good advice.”\nAfter joking with a reporter at the press conference, Ten Hag continued: “But for me it’s stay clinical and see where the team is, which areas we have to improve.\n“Stay also methodical, that you guide the team in the right pathway and make sure you make the right steps to get the best out of the team.”\nLevel-headed Ten Hag repeatedly points to the fact that United are a team in transition as they seek to return to the top of the sport.\nWithout a Premier League crown since Sir Alex Ferguson bowed out as champion in 2013, chief executive Omar Berrada recently told staff about ‘Project 150’ – their plan to win the title by their 150th anniversary in 2028.\nAmbitious Ineos are striving for success and have doubled down on the focus of developing younger talents, with this summer’s acquisitions aged between 18 and 26.\n“That is the choices we have made the last two seasons,” Ten Hag said. “I understand the impression that many have for Manchester United because the history is so big.\n“But those are the choices we have made and it also has something to do with financials and with other restrictions we have to deal with.\n“We made the choice for young players and the young players are not in the level (immediately). You can’t expect them (to be).\n“We have to improve them, they have to improve themselves and we have to find a team that can be successful on a consistent basis.\n“This team in the last two years showed they can do it on occasions and on occasions we can win trophies, but now we have to get more consistent.”\nAsked when people will start to judge this United team, Ten Hag said: “I think we will be judged every game and that’s normal.\n“Everyone, for every game, is expecting United to be winning. We know that. That’s not a secret for anyone.\n“When you are in this club you have to deal with this factor – and we do. It doesn’t matter if you are young or old or whatever.\n“We have to cope with this and get the best out of it and match the expectations that everyone has.\n“But we know also, and it’s with all the respect, young players, a young squad, a new team takes some time.\n“We are going in a good direction, I think, in the last couple of weeks on many aspects of football.\n“Now it’s about being more efficient and scoring more goals because that will win you games.”\nPatience is required but Ten Hag will be aware that he cannot afford to miss out on Champions League qualification for a second straight season.\nAsked if that is the minimum expectation to prove to Ineos he can take the project forward, the United boss said: “It’s never spoken of how you ask me the question now.\n“But what I think is we have to succeed, and we have to win trophies. That’s what this club stands for.\n“This club has the ambition to play on the highest platform and we want to achieve the Champions League. That’s clear.\n“We have two routes – one is the Premier League and the other one is the Europa League.”",
  "word_count": 731,
  "scraped_at": "2026-02-14T02:25:58.979434",
  "_text_extracted": true
}