{
  "article_id": "37118d906fc4",
  "url": "https://www.empireofthekop.com/2024/06/11/oxlade-chamberlain-sheffield-united-transfer-news-liverpool/",
  "title": "Premier League winner with Liverpool could make surprise return to England",
  "date": "20240611T153000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One member of Liverpool’s Premier League-winning squad from 2019/20 could potentially return to English football over the summer – albeit at a surprise destination.\nAccording to Turkish outlet Sabah, Besiktas are open to selling Alex Oxlade-Chamberlain if an acceptable offer is received, as the Istanbul club ‘don’t intend to continue’ with the 30-year-old.\nThe midfielder is ‘positive’ about returning to his homeland just a year after leaving the Reds on a free transfer, and the report claims that Sheffield United are interested in snapping him up during the off-season.\nREAD MORE: Journalist ‘can confirm’ one thing about Liverpool’s pursuit of ‘exceptional’ £35m winger\nOxlade-Chamberlain had some standout moments in a Liverpool shirt – most notably in two Anfield wins over Manchester City in 2017/18 – but persistent injury problems unfortunately prevented him from consistently displaying the full range of his talents under Jurgen Klopp.\nHe netted four goals in our Premier League title triumph in 2019/20, a tally he matched with Besiktas in the 2023/24 campaign, but was again struck down by familiar woes as he missed four months due to a torn thigh muscle, and the powerbrokers at the Tupras Stadium are prepared to part with him after only one year.\nFollow Empire of the Kop on Instagram (@empireofthekop) HERE\nThe 30-year-old is on wages of £2.1m per year in Istanbul, which equates to just over £40,000 per week. Only one Sheffield United player earned more than that in 2023/24, and that was with the Blades playing in the Premier League – their meek relegation to the Championship will surely see the wage bill trimmed notably.\nIt’d therefore be something of a surprise if Chris Wilder were to land the Ox, although it’d be quite a coup for the Bramall Lane outfit – and the English second tier as a whole – to snap up a man who was playing in the Champions League knockout rounds just 15 months ago.\nWherever the ex-Liverpool midfielder is playing his football next season, we just hope that he can finally enjoy a full campaign without any of the injury problems which have stopped him from realising his full potential, having played so magnificently in his first year at Anfield before that fateful blow against Roma in 2018.\nREAD MORE: A history of Liverpool players at the European Championship",
  "word_count": 386,
  "scraped_at": "2026-02-14T01:57:18.902544",
  "_text_extracted": true
}