{
  "article_id": "372d6f5a145e",
  "url": "https://metro.co.uk/2026/01/15/chelsea-star-enzo-fernandez-unhappy-enzo-maresca-sacking-considering-psg-transfer-26302625/",
  "title": "Chelsea star unhappy with Enzo Maresca sacking and eyes PSG transfer | Football",
  "date": "20260115T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liam Rosenior is facing his first major test as Chelsea manager with club captain Enzo Fernandez weighing up his future.\nThe Argentina international joined the Blues three years ago in what was then a British record transfer fee of £107million.\nAfter a difficult start to his Stamford Bridge career, Fernandez assumed the captaincy following the appointment of Enzo Maresca and played a key role in leading the club to Conference League success and Champions League qualification last season.\nThe 24-year-old thrived under Maresca and was left disappointed by the club’s decision to part company with the Italian earlier this month following the breakdown in the relationship between the coach and board.\n‘Mister, thank you for everything shared and experienced during this stage, I learned a lot and I value every advice and experience,’ Fernandez shortly after Maresca’s departure..\n‘Wishing you and your coaching staff, Willy, Dani, Robi, Marcos and Mickey, all the best. We won two titles together that I will never forget.\n‘Much success to you and hopefully our paths will cross again in the future. A big hug.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAccording to L’Equipe, Ferandez, whose current deal runs until 2031, has been so unsettled by the latest managerial upheaval that he is weighing up leaving in the summer, amid interest from Paris Saint-Germain.\nThe reigning European champions built last season’s success around a midfield trio of Vitinha, Joao Neves and Fabian Ruiz, but Luis Enrique is keen to add more competition for places.\nPSG, by their recent standards, spent conservatively following their landmark Champions League triumph and are, partially, counting the cost of that this term having failed to hit the same heights, so far.\n‘Not bringing in more competition is a mistake,’ a source close to a PSG player toldL’Equipe.\nShould Chelsea sell Enzo Fernandez\n-\nYes - But only for a fee in the region of £100m\n-\nNo - He's too important\n‘They should have brought in guys who are eager to prove themselves. Right now, we’re seeing players who are playing more casually. The dip in form is in their desire.\n‘In the counter-pressing, you can tell it’s not quite the same team anymore. There’s a lack of ambition to earn their place, players who are too comfortable.’\nPrefer us to the others? Then tell Google!\nAs a loyal Metro reader, we want to make sure you never miss our stories when searching for your news. Whether it is the latest politics news explained, live football coverage or a showbiz scoop.\nClick here and tick Metro.co.uk to ensure you see stories from us first in Google Search.\nWhether or not Fernandez can be persuaded to commit the peak years of his career to Chelsea remains to be seen and Rosenior, among others, faces a difficult cast given the team’s current predicament.\nA 3-2 loss in the first leg of their Carabao Cup semi final against Arsenal represented an early setback for Maresca’s successor, but he remained upbeat after a late Alejandro Garnacho goal halved the deficit.\n‘I am never happy to lose a game of football but I saw an energy, a determination and an intensity,’ Rosenior said in his post match press conference.\n‘I want us to be known as a team that will never give up, that will run, that will fight and that will press. And I saw that today.\nMore Trending\n‘I am not asking for time because we are good enough to win now but I need to put my stamp on the team otherwise there is no point me being here. There is a fine balance, and hopefully the fans will see progression but we need to win at the same time, too.’\nRosenior said he expects Cole Palmer and Reece James, both absent on Wednesday, will be able to return from injury in Chelsea’s next match against Brentford on Saturday. He also revealed that Liam Delap and Jamie Gittens were forced to withdraw from the first leg with a virus.\nRosenior added: ‘Jamie Gittens was ill last night and Liam Delap was ill four hours before the game and could not play. We want to keep the ill players away from the group so it does not spread. Both of them had dangerously high temperatures. Hopefully they will be okay for Saturday.’\nMORE: Declan Rice responds to Chelsea fans’ abuse during Arsenal win\nMORE: Chelsea flop Facundo Buonanotte agrees move to Premier League club after just eight games\nMORE: Liam Rosenior told he may need to replace Chelsea star who ‘keeps letting you down’",
  "word_count": 809,
  "scraped_at": "2026-02-14T02:09:43.007636",
  "_text_extracted": true
}