{
  "article_id": "374137fe0f11",
  "url": "https://www.bbc.co.uk/sport/football/67088415",
  "title": "BBC Women Footballer of the Year 2023 : Will Alexandra Popp get your vote ? ",
  "date": "20231030T023000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Age: 32 Position: Forward Teams: Wolfsburg and Germany\nAlexandra Popp has long been one of the women's game's most clinical forwards but, surprisingly, the accolade of topping the scoring charts in Germany's top flight - the Frauen-Bundesliga - eluded her, until last season.\nPopp has had a career blighted by injury but bounced back in fine form after she was cruelly ruled out of the Euro 2022 final - and her performances as a striker at the Euros saw her retain that position at club level.\nHer 16 goals led Wolfsburg to finishing just two points behind Bayern Munich on the final day of the league season, while she lifted the German Cup for the 10th time with the She-Wolves. The Germany captain also scored in the Champions League final, although her side ended up losing 3-2 to Barcelona.\nThe vastly experienced Popp took part in her third World Cup in the summer and while Germany - one of the initial favourites - were knocked out in the group stages that didn't prevent her being able to display her trademark abilities in the box.\nHer four goals - just one fewer than Golden Boot winner Hinata Miyazawa - was a particularly impressive feat given she only played three matches.\nPopp in her own words\nHow does she feel about her goals for Wolfsburg last season?\n\"Goal records are not so important to me. I am more focused on the success of the team, but all in all it's nice that I could help the team to gain the success with my goals.\n\"Being runner-up in the league is success, too, so I was satisfied with last season.\"\nWhat was it like having to wait so long to become top scorer?\n\"I do not aim to be at the top or become top scorer but it was a great feeling for me to play as a striker quite often last season.\n\"The reason for that was simply the Euros. Out of the number 10 position, I could be dangerous in front of goal. I carried on [my form] from the Euros.\"\nWhat was her highlight last season?\n\"[Winning] the German cup final, to be holding my baby (the trophy) again in my arms.\"\nHow does she continue to perform so well?\n\"That's a difficult question.\n\"I became extremely mature in the last few years simply because of my role - not only being a leader or a leading player but the captain, too. That affects you, it makes you more mature and you progress.\n\"You become a personality who takes the lead. It helps you to handle certain situations and to be able to perform on the pitch.\"\nWhat are Popp's aims for this season?\n\"I want to win every competition I'm in. That means to be strong in all three competitions with my club, to get as far as possible. [I want] to win the league again, that's the most important.\n\"It's important [for Germany] to qualify for the Olympics and we will do everything for that.\"\nWhat did she make of Germany's early World Cup exit?\n\"It's team sports, we all have to perform. It was a huge disappointment and it doesn't matter if I scored goals or not because it didn't matter and we were eliminated.\n\"We imagined it [would go] differently but we want to keep on working to come back.\"\nHow does she feel about being a role model?\n\"It's a great feeling and I like it very much because it's so simple. Actually by simply playing football, which became my passion, I can give people a good feeling, they can look up to me. I can show young girls how it works.\"\n'One of the very best'\nGermany manager Martina Voss-Tecklenburg: \"That our goalscorer is also our captain is great.\n\"Wherever she plays, she is a great leader, a great captain and one of the very best. She is also a team player.\"\nGermany midfielder Sara Dabritz: \"Poppi is a leader, both on and off the pitch. Her mentality and the energy she gives off every day inspires and motivates us all.\"\nLast season's achievements\nWhat else should you know?\nPopp is a trained zookeeper and hopes to work with animals again in the future\nDespite playing for Wolfsburg and coming through Schalke's academy, she is a Borussia Dortmund fan\nNamed Germany's Women's footballer of the year for 2023, her third such honour but first since 2016\nPopp missed both the 2013 and 2017 European Championships with injury\nShe has won 12 German Cups in total\nIf you are viewing this page on the BBC News app please click here to vote, external.",
  "word_count": 778,
  "scraped_at": "2026-02-14T01:51:09.214683",
  "_text_extracted": true
}