{
  "article_id": "375eeaf974cf",
  "url": "https://www.chroniclelive.co.uk/news/history/newcastle-united-europe-quiz-25-32441821",
  "title": "The Newcastle United in Europe quiz : 25 questions on the Magpie continental exploits",
  "date": "20250914T190000Z",
  "domain": "chroniclelive.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Newcastle United in Europe quiz: 25 questions on the Magpies’ continental exploits\nWith Newcastle United set to host Barcelona in the Champions League, test your knowledge of the Toon in Europe\nAfter the most turbulent of summers for Newcastle United and with the new Premier League season already underway, the Magpies are now preparing for a well-earned return to European football’s elite club competition - the UEFA Champions League.\nEddie Howe’s team will initially face eight different teams in the league stage, beginning with a mouth-watering, high-profile clash against mighty Barcelona at St James’ Park on Thursday. It’s a tie, of course, which has quite a bit of history.\nUnited’s record in Europe is far from shabby. To date, they have played 140 games in all competitions. This will be their 18th continental campaign since 1968-69 - a season when, remarkably, they lifted the trophy, the Inter-Cities Fairs Cup, at the first time of asking.\nThe 2025-26 season will mark Newcastle’s fourth campaign in the Champions League. It’s been quite a story and there are hopefully many new exciting chapters to write.\nJust for fun, we’ve compiled 25 questions on Newcastle United’s eventful journey in competitive European football from 1968 to the present day. Some are relatively easy, while others aren’t. The questions run chronologically and you’ll find the answers at the end. Good luck.\n1. Newcastle United played their first ever competitive European game on September 11, 1968, at St James’ Park, winning 4-0. Who were their opponents?\n2. Young United winger Geoff Allen was the star of the show that night. His grandson would later make 55 appearances in midfield for the Magpies. Who is he?\n3. In June 1969, Newcastle lifted the Inter-Cities Fairs Cup in which European capital city, after beating Ujpest Doza 6-2 on aggregate over two legs?\n4. In their 1969-1970 Fairs Cup run, United came up against which two British teams?\n5. In September 1970, United beat which major Italian team 2-0 in front of 56,495 fans at St James’ Park in the first round, second leg of the Inter-Cities Fairs Cup?\n6. After an absence of seven years, Newcastle returned to European football in the UEFA Cup in 1977. Which French team would knock the Magpies out of the competition that year?\n7. And who was that team’s Dutch international star who scored a wonder goal at St James’ Park as United went out?\n8. It wasn’t until September 1994 that Newcastle returned to European action in the UEFA Cup, beating Royal Antwerp in Belgium 5-0. Who scored a hat-trick for United?\n9. In 1996-1997 Newcastle were knocked out of the UEFA Cup in the quarter-final by Monaco. Which defender in the French team would later make a handful of appearances for United?\n10. In 1997-98, United competed in the UEFA Champions League for the first time. Who were their very first opponents?\n11. When Newcastle United famously beat Barcelona 3-2 at St James’ Park in the Champions League in September 1997, which two players scored for the Spanish giants?\n12. In 1998-1999, Newcastle played their only ever tie in the UEFA Cup Winners Cup. Who were their opponents?\n13. When Newcastle beat Juventus 1-0 at St James’ Park in the Champions League in October 2002, who scored the only goal of the game?\n14. Barcelona returned to St James’ Park to face United in the Champions League in March 2003. Which striker in the Spanish side would join United the following year?\n15. United were denied entry to the 2003-2004 Champions League after going out on penalties to which club in the qualifying round?\n16. Instead, they competed in that season's UEFA Cup, reaching the semi-final where they were beaten by which club?\n17. Who was Newcastle’s manager when they progressed to the quarter-finals of the UEFA Cup in 2004-2005?\n18. In 2006-2007, United competed in their very last UEFA Cup before the competition was replaced by the Europa League. The Magpies played a rare match against Turkish opposition. Who was the team?\n19. Newcastle were back in continental action in 2012-2013, participating in the Europa League. Who was United’s manager at the time?\n20. The Magpies went out in the quarter-finals to Benfica - but which Newcastle player managed to score in the home and away legs of the tie?\n21. Newcastle United returned to Europe in 2023-24, with Eddie Howe’s team qualifying for the Champions League? Who were their first opponents in the tournament?\n22. Who scored United’s first goal in the 4-1 victory over Paris St Germain at St James’ Park in October 2023?\n23. PSG’s manager on the night had previously played against United at St James’ Park in which notable 1990s Champions League fixture?\n24. When Newcastle stepped out at Borussia Dortmund in November 2023, it was their first competitive match on German soil since they faced which team in November 2006?\n25. Newcastle will play eight teams in this season’s Champions League group stage. They have previously faced seven of those teams in competitive European fixtures. Which team will they meet for the first time?\nWe have a dedicated newsletter for ChronicleLive’s nostalgia stories and pictures. It’s free and you can sign up to receive it here. Don’t miss out on our popular nostalgia stories and historical archive photos from across the region.\nANSWERS: 1. Feyenoord; 2. Elliot Anderson; 3. Budapest, Hungary; 4. Dundee United and Southampton; 5. Inter Milan; 6. Bastia; 7. Johnny Rep; 8. Rob Lee; 9. Franck Dumas; 10. Croatia Zagreb; 11. Luis Enrique and Luis Figo; 12. Partizan Belgrade; 13. Andy Griffin; 14. Patrick Kluivert; 15. Partizan Belgrade; 16. Marseille; 17. Graeme Souness; 18. Fenerbahçe; 19. Alan Pardew; 20. Papiss Cisse; 21. AC Milan; 22. Miguel Almiron; 23. Luis Enrique played for Barcelona against Newcastle in 1997; 24. Eintracht Frankfurt; 25. Union Gilloise",
  "word_count": 973,
  "scraped_at": "2026-02-14T02:09:24.926215",
  "_text_extracted": true
}