{
  "article_id": "377059f9936f",
  "url": "https://www.themag.co.uk/2024/10/alexander-isak-contract-situation-takes-bizarre-turn-newcastle-united/",
  "title": "Alexander Isak contract situation takes bizarre turn",
  "date": "20241026T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alexander Isak contract situation takes bizarre turn\nThe Alexander Isak contract situation has made headlines.\nAll very bizarre.\nAt least in my opinion.\nAny negative spin on Newcastle United, the media coming up with some crazy stuff.\nWith Anthony Gordon having now signed a new enhanced and extended contract, Eddie Howe asked on Friday about the Alexander Isak contract situation:\n“Regarding the contracts, I’m not necessarily involved in those discussions day to day. I will hear bits and pieces.\n“With Alex, he’s got a long contract anyway and we have to be careful regarding our spending due to PSR.\n“We of course love him and are desperate from him to stay at Newcastle for many years and score loads of goals for us.\n“I don’t see a short-term issue with his contract.”\nBasically, Eddie Howe saying on Friday that Newcastle United aren’t seeing the Alexander Isak contract situation as anything to worry about. The NUFC boss indicating there are no big talks going on with the player and his representatives to try and get a longer deal in place, though obviously we can’t always take what Eddie Howe says at face value, as he regularly misleads the media for the very best of reasons. So if this weekend a new Alexander Isak contract was suddenly announced, it wouldn’t amaze me. Though on this occasion I don’t think that will be the case.\nWhat is bizarre for me though, in other words, ludicrous and laughable, is the way so much of the media has reacted to what Eddie Howe has said on the Alexander Isak contract situation.\nOther clubs, Arsenal, Barcelona, Chelsea and whoever else, all put on ‘red alert’ as Alexander Isak contract talks ‘stall’, or any other such nonsense.\nThe reality is that if a player wants to leave your club, then in most cases they will leave, no matter what the contract length remaining is. Keeping an unhappy player doesn’t usually make any sense.\nThe importance of the contract length on such a player, is how protected your club is, in terms of the transfer fee they can then hold out for.\nThe very worst extreme is of course if a club allows a player to run his contract all the way down to zero days, never mind years, remaining on it, meaning a club can ‘demand’ precisely nothing.\nAny of the sites who specialise in current values of players, contract length plays a massive part. Mbappe was/is widely regarded as the best player in the world and yet as his PSG contract went down and down, so did his then current valuation(s). Countless other players ended up ‘valued’ more than the Frenchman, as his contract situation became ever more precarious. All the way down to pretty much zero, when the January 2024 window closed and it became clear he was holding out until summer 2024 and moving to Real Madrid without PSG receiving a penny in terms of transfer fee.\nWhich brings me once again to Alexander Isak.\nThe striker signed a six year contract in summer 2022 and still has over 44 months of that contract remaining, as it runs up to 30 June 2028.\nNot a single one of these sites that specialise in current player valuations, is saying Alexander Isak now finds his current value lower, due to ‘only’ having 44+ months of his Newcastle United contract remaining.\nSo going hypothetically, if any club did come in for Alexander Isak AND he wanted to leave, then if Newcastle United did decide to sell, they would be able to insist that the buying club paid his full value, there would be no contract pressure bringing down the price.\nThis is what makes the media coverage so ludicrous and embarrassing, after what Eddie Howe said on Friday about Alexander Isak and his contract.\nIt is quite ridiculous to claim that Newcastle United are now in some kind of vulnerable position with Alexander Isak and other clubs could now ‘pounce’ and take advantage.\nAnthony Gordon was a very different situation, in that he signed a contract in January 2023 as someone with potential and no doubt a contract that reflected that. With Alexander Isak, he was already a star striker for his country and in La Liga, who had already played plenty European football, including Champions League and Europa League.\nIsak’s contract will have reflected that when he signed just over two years ago. Since joining Newcastle, with the help of Eddie Howe, Gordon has turned into a regular England player and one who managed double figures last season in the Premier League, in terms of both goals and assists.\nMy assumption is that the new Anthony Gordon contract has put him in the same ball park as what Alexander Isak is on. My guesstimate would be that this probably doubled Gordon’s wages and reflected how he had now proved himself to be one of Newcastle’s biggest assets, alongside the likes of Isak and Bruno.\nTo suggest Newcastle are vulnerable now with Isak is crazy.\nThis isn’t Liverpool, where arguably their three best players only have eight months each to go on their deals. The scousers could lose all of Salah, Van Dijk and Alexander-Arnold for nothing in June 2025, unless something changes.\nI also find it laughable that so much media negativity and spin is attached to the 44+months remaining on Alexander Isak’s contract, as compared to say Marc Guehi and his situation.\nThe media making out that it was somehow clever of Crystal Palace to not sell the defender in the summer to Newcastle United, even though he has all along refused to sign a new contract and Palace now face the prospect of him having only 18 months left on his contract, when we get to that next January window.\nGuehi’s contract position undoubtedly means his value will be lower in January than it was in the summer, no matter what nonsense the media come out with.\nIf Palace then let it drift to next summer and only a year left on the Marc Guehi contract, what is his value then???\nI am not claiming everything is great currently at Newcastle United but certainly when it comes to dealing with contract positions, I think the club have handled things pretty much perfectly.\nAll of the players seen as key to the future, having strong contract positions from a club perspective.\nHow the Newcastle United contracts situation currently looks (via official club releases and media reports), when current deals end :\nEnd of June 2025:\nDubravka, Schar, Wilson, Lascelles, Krafth, Gillespie, Ruddy, Lewis\nEnd of June 2026:\nBurn, Targett, Pope, Almiron, Longstaff, Ashby, Hayden, Trippier\nEnd of June 2027:\nBotman, Jacob Murphy, Willock\nEnd of June 2028:\nTonali, Isak, Barnes, Livramento, Bruno, Miley, Joelinton, Alex Murphy\nEnd of June 2029:\nKelly, Hall, Gordon\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1152,
  "scraped_at": "2026-02-14T01:57:46.240393",
  "_text_extracted": true
}