{
  "article_id": "378b53eddf29",
  "url": "https://www.themag.co.uk/2024/06/im-totally-relaxed-with-newcastle-united-summer-transfer-window/",
  "title": "Im totally relaxed with Newcastle United summer transfer window",
  "date": "20240625T150000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I’m totally relaxed with Newcastle United summer transfer window\nThis Newcastle United summer transfer window is pretty intense.\nI can’t believe there are more than nine weeks left to go.\nSuch has been the ferocity of the debate surrounding it.\nFor some people, it appears to be a belief that we are in a similar position to the very first Newcastle United transfer window, under the then new owners and recently appointed Eddie Howe.\nThat the situation is just as desperate, in terms of the incoming business that needs to be done.\nTo remind people, when we got to the January 2022 transfer window, Newcastle United only had 11 points from the opening 19 Premier League games, were second bottom of the table and looked very very likely to go down.\nIt was about as serious as it possibly could have been.\nMoving forward almost 30 months, things not quite so serious.\nYes, we all love it when a Newcastle United summer transfer window delivers big money exciting signings but you have to take everything into consideration.\nI think the most important thing to accept/recognise, is that this particular transfer window is very much about ensuring NUFC keep their best players.\nThe astonishing progress made these past two and a half years with a number of outrageously class signings, as well as Eddie Howe improving so many existing players beyond belief, means Newcastle United have a lot of very good players that other quality sides would like to take from us.\nThe fact is that players such as Gordon, Isak and Bruno, as well as a number of others, should all be playing Champions League football. However, that is not on offer for the coming season, so we all want Eddie Howe and the club to convince them that this shouldn’t lead them into desperation to leave.\nEddie Howe and the club appear to have successfully done so. All of the best quality players, including that elite trio, all act like and say that they are happy at St James’ Park and I think for sure, accept that this NUFC team/squad has so much potential to succeed next season and beyond, having been held back by Tonali’s suspension and the worst injury crisis in the club’s history.\nI think this is a pivotal time in this post-takeover journey, last season wasn’t a disaster when picking up 60 points, considering everything that went against us. Newcastle United finished only eight points off top four and Champions League football was extraordinary when missing all of those players for so long.\nA sizeable minority of Newcastle United fans appear to see getting 60 points in those challenging circumstances, as some kind of a serious worrying scenario, one that needs significant major surgery on the playing squad, or else it will invite disaster.\nFor me, it is a time to keep level heads and accept that last season became mission impossible, whilst the upcoming 2024/25 campaign could very well turn out to be a mission more than possible.\nKeep our best players, strengthen the squad, see where this Newcastle United squad can take us.\nThere was always going to be endless speculation about Newcastle United players this summer, that is what happens when you employ a quality manager who knows what they are doing. Both in identifying the right transfer targets and working with the existing players.\nHowever, when you scrape beneath the surface of the endless transfer claims this summer, there looks to be no serious substance to any Newcastle United first-choice player leaving, instead, it is about squad players who might leave, to make room for new signings, as well as help keep the finances/PSR on the right side of things.\nThe club has grown so fast since the takeover and so much done to start and put right all those years of zero ambition and no progressive investment, Newcastle United were never going to have a totally smooth path.\nI understand why many fans may be disappointed that it sounds like the long-term potential of Yankuba Minteh may be sacrificed to deal with an apparently short-term essential need to bring in a sum of money by the end of June 2024 to keep us right side of PSR. However, if that is what is needed, then it has to be done. We can’t go down the Everton, Forest, Leicester route of fighting it out with the Premier League over points penalties. That is exactly the kind of thing the usual suspects amongst the PL clubs and our other enemies, would love to see happen.\nNone of us have any idea whether Yankuba Minteh will ever be good enough to succeed in the Premier League BUT we know for sure that the likes of Bruno, Isak and Gordon have what it takes.\nSo if cash is urgently needed to satisfy a short-term issue, then you have to make tough decisions.\nI think the path that Newcastle United is now on, the massive priority is the players these next one, two, three years who can help us to break through that glass ceiling, and get established as a regular top four club and Champions League competitor.\nWith everybody fit, where would you find a place for new signings this summer costing £50m+ each? I think the only possible position for that scenario is wide right, with then the sales of probably Almiron and/or Murphy to help pay for it and assist massively in terms of PSR.\nOtherwise, we have two very exciting full-backs who could be first choice for years to come at NUFC (and with England?), whilst I don’t see any other first-team places available either when everybody is available.\nYes, I know Sven Botman will be missing for more months but the reality is that he will be back and hopefully 100 percent before too long, which makes him an automatic choice. So the likes of Dan Burn and very good free transfer signing Lloyd Kelly are more than capable of filling in, in the meantime. As well as giving general depth.\nLewis Hall will become a permanent £28m signing in July and I am sure other signings will be made as well. However, I see in the main this is the case of ensuring suitable backup for the quality Newcastle United players already at the club. A new second-choice keeper for sure and 21-year-old James Trafford looks to be the likely one to fill that role now, as well as giving great potential for the future.\nThe transfer windows since the takeover have brought massive progress in terms of the quality of the first team, as well as the squad. Now it is more a case of giving the squad a service, fine-tuning it, making sure it is in full working order for the season ahead. With spares available to be fitted if/when judged necessary. We do not need a new engine, never mind the team/squad a total write-off.\nNewcastle United are set to hit the ground running when the season kicks off and I think by the time this Newcastle United summer transfer window does end, we will all yet again be able to look at it and see an NUFC in a significantly better position than before the window opened.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1226,
  "scraped_at": "2026-02-14T01:57:18.884683",
  "_text_extracted": true
}