{
  "article_id": "378ce36ab133",
  "url": "https://www.chennaionline.com/news/champions-league-milan-and-barcelona-draw-3-3-in-semi-final-first-leg/",
  "title": "Champions League : Milan and Barcelona Draw 3 - 3 in Semi - Final First Leg – Chennaionline",
  "date": "20250501T103000Z",
  "domain": "chennaionline.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League: Milan and Barcelona Draw 3-3 in Semi-Final First Leg\nAC Milan and Barcelona played an exciting match in the first leg of the UEFA Champions League semi-final, ending in a thrilling 3-3 draw. Both teams attacked with full energy and scored impressive goals, keeping fans on the edge of their seats from start to finish.\nThe match took place at Milan’s home stadium, where the Italian team started strong. Milan opened the scoring early, using quick passes and sharp movements to break Barcelona’s defense. The home crowd cheered loudly as their team took the lead.\nBut Barcelona responded quickly. Their star players passed the ball smoothly and found space to equalize. Before halftime, both teams scored again, bringing the score to 2-2 at the break. The first half showed the strength and speed of both teams, with each side fighting hard for control.\nIn the second half, Milan scored again to take a 3-2 lead. Their midfielders worked hard to create chances, and the forwards finished well. However, Barcelona refused to give up. They pushed forward and finally scored their third goal late in the match, tying the game at 3-3.\nBoth coaches used their substitutions wisely and encouraged their teams to stay focused. The players gave everything on the field, defending tightly and attacking with purpose. Goalkeepers from both sides made key saves to keep their teams in the game.\nThe 3-3 result means the second leg in Barcelona will decide who reaches the Champions League final. With the tie still wide open, both teams will prepare carefully for the next match.\nFans around the world praised the game as one of the most exciting matches of the tournament. The high-quality football, fast pace, and strong teamwork made it a memorable night for supporters of both clubs.\nAs Milan and Barcelona head into the second leg, they will look to fix their mistakes and take their chances. Only one team can reach the final, and both sides will fight hard to earn that spot.",
  "word_count": 337,
  "scraped_at": "2026-02-14T02:09:01.844314",
  "_text_extracted": true
}