{
  "article_id": "378d19ef007c",
  "url": "https://www.caughtoffside.com/2024/06/12/transfer-news-gyokeres-arsenal-duran-chelsea/",
  "title": "Transfer news : Gyokeres Arsenal , Duran Chelsea and more",
  "date": "20240612T061500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on the Daily Briefing, a subscription service. If you would like to receive Ben Jacobs’ exclusive transfer columns via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io.\nArsenal eye three possible alternatives to Benjamin Sesko\nArsenal are searching for another striker after Benjamin Sesko decided to stay at Leipzig. A renewal, on new lucrative terms, was always a concrete possibility. Arsenal’s pitch was strong, but Sesko felt staying an extra was better for his development. There is a gentleman’s agreement he can still be sold in summer 2025.\nArsenal have plenty of other options on their list, including Evan Ferguson and Viktor Gyokeres. They are also keeping a very close eye on the Joshua Zirkzee situation. Milan are pushing to complete a deal, but if it falls through I expect Arsenal to be in the conversation for the Bologna striker.\nAlongside looking for a new striker, Arsenal still see midfield as a priority. The kind of midfielder they’re looking for will be defined by whether they see Declan Rice as a predominant no.6 or no.8 – though that’s not to say that Mikel Arteta will be so rigid as to force him to play in only one role, but the profile they’ll look for will have to complement Rice.\nMartin Zubimendi is still a realistic possibility, though the challenge there is persuading him to leave Real Sociedad. He’s very happy there and that’s why he stayed at the club in January, though that was also with Champions League football to look forward to in the second half of the season, and now it would be all about persuading the player to leave a club that he’s really settled at.\nWe also know that Arsenal have looked at Douglas Luiz before, but they’re not engaged in negotiations with him at the moment – it’s all about Aston Villa and Juventus. The feeling amongst most in the industry is that Villa need to sell before they can buy, while Juventus need to offer players as part of the deal, with Weston McKennie being one who might return to England. If anything falls through, Arsenal would maybe see a window of opportunity, knowing that Arsenal need to raise funds, but Zubimendi is a more likely target than Luiz.\nWe know that Arsenal appreciate Bruno Guimaraes too, but they haven’t made a concrete move and have no plans to trigger his release clause. If anyone moves there, it’s likely to be Manchester City, but with no one planning to trigger his clause, clubs may wait and see if they can engage with Newcastle at a lower level, perhaps also with Financial Fair Play in mind. It’s not an easy deal, but if Guimaraes were to leave that could be one way to get the deal done, if Newcastle feel obligated to sell due to their financial situation, but even then it’s more likely Man City than Arsenal.\nChelsea delighted as they beat rivals to smart free transfer\nChelsea are delighted with the signing of Tosin Adarabioyo, who joins on a free transfer when his Fulham contract expires. It was never a done deal with Newcastle, who wanted Tosin and Lloyd Kelly. Luckily for Eddie Howe, they have secured the latter subject to a medical and all the paperwork going through.\nChelsea view Tosin as valuable because of his height and ball-playing skills. The fact he’s a set-piece threat is also important.\nChelsea could still add another centre-back, although only if Trevoh Chalobah is sold. Chalobah is in no rush to leave and will only depart for a club with European football. It’s not a given he exits, even though Chelsea do want to sell.\nChelsea have a lot of centre-backs even with Thiago Silva’s departure, and Levi Colwill is expected to seek guarantees he is a starter when fit. Chelsea have no plans to sell Colwill despite links with Bayern, Liverpool and PSG. Suitors also know Chelsea’s position, and it’s an emphatic one.\nBut it is an important season ahead for Colwill, who is naturally disappointed to have missed out on England selection and wants to make sure by summer 2025, a year from the 2026 World Cup, he’s back in the picture.\nEngland snub won’t change Marcus Rashford situation\nMarcus Rashford is still not looking to leave Manchester United. The same commitment remains from when he signed a contract extension until summer 2028.\nRashford’s form compared to others in his position simply didn’t warrant England selection, but the extra pre-season time at Carrington could prove a blessing in disguise. He now has one focus: to rediscover his goalscoring touch having got 30 in all competitions in 2022/23.\nRashford is intent on using pre-season, away from the media flare, to come back hungrier and more consistent next season.\nPSG do still appreciate Rashford, but have not made any kind of meaningful move ahead of the summer. They have other priorities, and won’t even discuss Rashford unless they are told directly from the player side that he wants to leave Old Trafford. This is because prior to Rashford extending at Manchester United, PSG felt like they were being used to gain Rashford leverage as he negotiated his new United deal.\nJulian Alvarez or Jhon Duran to Chelsea?\nJulian Alvarez is not a player Manchester City want to lose, but it’s clear he wants some guarantees over playing time. That makes the situation open. When players like Raheem Sterling and Cole Palmer went to Pep Guardiola and explained they wanted a new challenge, the Manchester City boss was very understanding. He might not be as accommodating with Alvarez given his importance to the team.\nManchester City got £45m and £40m for Sterling and Palmer respectively, and Alvarez’s price tag would be significantly more. At the moment, there is no specific number, but £70m+ is understood to be the ballpark. There is concrete interest from Paris St-Germain, and they have budget following Kylian Mbappe’s departure.\nChelsea could be one to watch, but they haven’t yet made any kind of meaningful approach. I still sense Jhon Duran might be ahead of Alvarez given he’s cheaper and only 20. Chelsea have faith in Nicolas Jackson and Christopher Nkunku can be used as a false nine, so Chelsea’s recruitment team aren’t as worried as they perhaps were earlier in the year about adding someone already proven or Premier League-seasoned.\nAnd the key point with Alvarez is that Manchester City don’t want to sell. They will do all they can to persuade him of his importance to the team. He featured in 54 games last season and made 31 starts in the Premier League. Manchester City still view Alvarez as integral, so the Argentine would have to really push to get a move, and hope his high price tag is met. An exit can’t be ruled out, but Manchester City will be fighting to stop one.",
  "word_count": 1155,
  "scraped_at": "2026-02-14T01:57:18.901929",
  "_text_extracted": true
}