{
  "article_id": "37965ff15705",
  "url": "https://www.bbc.co.uk/sport/football/65013772",
  "title": "Premier League : Arsenal & Man City - who will win the title ? ",
  "date": "20230320T174500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League: Arsenal & Man City - who will win the title?\n- Published\n- comments\nThe Premier League title race is building up to a dramatic finale as we enter the final two months of the campaign.\nArsenal extended their lead at the top to eight points by thrashing Crystal Palace 4-1 on Sunday and have 10 games left as they look to end their 19-year wait for a title.\nManchester City have a game in hand but are also still in the FA Cup and Champions League, meaning they could potentially play seven more fixtures than Arsenal.\nThe two teams meet in what is likely to be a pivotal match at Etihad Stadium on 26 April.\nSo who are favourites for the title? And who has the more favourable run-in?\nBBC Sport has crunched the numbers and analysed the fixture list to try and find out...\nWho do Arsenal and City have left to play?\nLet's start with the fixtures.\nArsenal's outlook is simple: they need 26 points from those 10 games to take the title, assuming City win all their remaining matches. Arsenal's final match is at home to Wolves on 28 May.\nPep Guardiola's City have 11 games remaining but also face a two-legged Champions League quarter-final against Bayern Munich and an FA Cup semi-final against Sheffield United at Wembley.\nShould City win both, the FA Cup final takes place on 3 June and the Champions League semi-finals are scheduled for 9/10 and 16/17 May, before the final in Istanbul on 10 June.\nData company Nielsen's Gracenote has worked out the percentage chance each side have of winning their remaining Premier League matches, according to its Euro Club Index formula.\n'This is a genuine title race which is very difficult to call'\nAccording to Gracenote's simulations, Mikel Arteta's Arsenal have a 53% chance of lifting the Premier League trophy, while City's chance of retaining their title is 47%.\n\"Despite Arsenal's eight-point lead, it is still close to a 50/50 race because the Gunners have played a game more than Manchester City and still have to play away at three of the top six: City, Newcastle United and Liverpool,\" said Simon Gleave, head of sports analysis at Gracenote.\n\"City's toughest remaining trip in the Premier League is to Brighton next month.\n\"If we use probabilities from our Euro Club Index for each remaining match to calculate the expected points for Arsenal and Manchester City at the end of the season, Arsenal finish on 87 points and City on 86.\n\"If we partially subjectively allocate a win, draw or loss to each of the remaining fixtures led by the Euro Club Index probabilities, both teams end on 88 points. Either way, this is a genuine title race which is very difficult to call.\n\"The match between the two on April 26 will clearly be a key fixture in deciding the destination of the Premier League trophy.\n\"On the basis of an estimated 66% win chance for City according to the Euro Club Index, we have given City three points. If Arsenal avoid defeat, or even win, this will have a major impact on the title race.\"\nArsenal have history on their side\nNervy Arsenal fans dreaming of a first title since 2003-04 may take some comfort from the history books.\nAccording to Opta, only three teams in the Premier League have held an eight-point lead or more after 28 games and not won the title.\nIn 1997-98 Manchester United led Arsenal by nine points after 30 games but the Gunners, who had three games in hand, closed the gap to seal their first Premier League title. Five years later Manchester United gained revenge by chasing down Arsenal's eight-point lead after 29 games.\nBut United were on the receiving end again in 2011-12 when City wiped out their eight-point advantage before taking the trophy on the final day thanks to that goal from Sergio Aguero.\nLooking back further, of the 12 teams to have more than 69 points after 30 games in the First Division or Premier League (converting to three points for a win) only one team have failed to win the title - Liverpool in 2018-19.\n'This title race is going right to the wire'\nFormer Arsenal defender Martin Keown on MOTD 2: \"It is going to be fascinating to see how the title race unfolds from here, but I would say Arsenal have done all they can do until now.\n\"There is still so much work left, but they have got the points in bag to build up this lead and City will have to deal with some fixture congestion in order to catch them while they try to win the Champions League and FA Cup too.\"\nFormer Wales defender Danny Gabbidon on BBC Radio 5 Live: \"It's the balance that this Arsenal team now has. They are a very well-oiled machine. There are bigger games to come, but they are looking in fine form and I don't think they're going anywhere. This title race is going right to the wire.\"\nJournalist Luke Edwards on BBC Radio 5 Live's Football Daily podcast: \"Arsenal look like title winners and that would be a great result for the Premier League because they are one of those clubs who haven't won the league for a long period of time.\"\nFormer Premier League midfielder Nigel Reo-Coker on Football Daily: \"Watching Arsenal right now is like watching Pep's Man City a couple of years ago when it was just so entertaining, it was drawing you in to want to watch them because the football and the style from front to back was just sensational.\"\nOur coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment",
  "word_count": 979,
  "scraped_at": "2026-02-14T02:19:40.792496",
  "_text_extracted": true
}