{
  "article_id": "37a5cdc24ffa",
  "url": "https://www.90min.com/posts/eddie-howe-chances-permanent-lewis-hall-transfer-chelsea",
  "title": "Eddie Howe reveals chances of permanent Lewis Hall transfer from Chelsea",
  "date": "20231222T161500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe reveals chances of permanent Lewis Hall transfer from Chelsea\n- Hall joined Newcastle on loan from Chelsea with an obligation to buy\n- However, Howe reveals versatile defender is yet to hit requirements to trigger transfer\n- 19-year-old has made only one Premier League start this season despite Magpies' injury woes\nEddie Howe has insisted Lewis Hall remains part of Newcastle United's long-term future despite the teenager's lack of game time since his move from Chelsea in the summer.\nThe defender moved to St James' Park in August on loan with an obligation to buy should certain requirements be met.\nHowever, despite the Magpies' lengthy injury woes so far in 2023/24, Hall has played just 78 minutes of Premier League football and was left unused on the bench for Tuesday's Carabao Cup exit on penalties to parent club Chelsea.\nSpeaking on Friday ahead of his side's clash with Luton on Saturday, Howe revealed: \"He's settled in fine. He's working well, I think we need to develop certain areas of his game. We have no doubts of his qualities and what he can bring to the team.\n\"He is doing a lot of things behind the scenes, we work with him daily. He was brought in with a view for the here and now.\n\"My view would be a bit of patience with Lewis.\"\nOn the chances of Hall remaining at Newcastle beyond the end of the season, the former Bournemouth boss added: \"Absolutely. His transfer is complicated in terms of structure and he hasn't quite hit the requirements. But he's part of our long-term plans.\"\nHall made his senior debut for Chelsea in an FA Cup thrashing of Chesterfield in January 2022 and made nine Premier League appearances the following season as the Blues finished 12th.\nThe 19-year-old has made only one league start so far this season, coming in the 2-0 defeat at Bournemouth in November when he was hooked at half-time. He had previously scored his first goal for the club in the 3-0 Carabao Cup success at Manchester United before making his Champions League debut in defeat against Borussia Dortmund.",
  "word_count": 355,
  "scraped_at": "2026-02-14T01:56:38.143178",
  "_text_extracted": true
}