{
  "article_id": "37ab15afe39e",
  "url": "https://www.thenationalnews.com/business/energy/2025/09/26/oil-set-for-biggest-weekly-gain-in-three-months-as-trump-pressures-buyers-of-russian-energy/",
  "title": "Oil set for biggest weekly gain in three months as Trump pressures buyers of Russian energy",
  "date": "20250926T100000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Oil prices settled more than 1 per cent higher on Friday and posted their biggest weekly gains since June as US President Donald Trump increased pressure on buyers of Russian oil and Ukraine carried out new attacks on Moscow's energy infrastructure.\nBrent, the benchmark for two thirds of the world's oil, rose 1.02 per cent to $70.13 a barrel, the first time it finished above $70 since late July. West Texas Intermediate, the gauge that tracks US crude, jumped 1.14 per cent to $65.72 per barrel.\nFrom last week's close, Brent surged 6.19 per cent and WTI leapt 5.32 per cent. Year-to-date, the benchmarks are still down 6.04 per cent and 8.37 per cent, respectively.\nOil's \"strongest weekly advance since June [came] as President Trump stepped up pressure on countries still buying Russian crude,” Soojin Kim, research analyst at MUFG Bank, said on Friday.\n“Mr Trump urged Turkish President [Recep Tayyip] Erdogan to halt purchases and discussed energy security with Hungary and Slovakia, while reiterating calls for Nato members to cut ties with Russia’s fuel.”\nDuring a meeting with the Turkish President at the White House on Thursday, Mr Trump criticised Ankara for buying Russian oil while Moscow is waging war against Ukraine.\n“I'd like to have him stop buying any oil from Russia while Russia continues this rampage,” Mr Trump told reporters, alongside Mr Erdogan in the Oval Office.\nThe latest Ukrainian attacks on Russia's energy infrastructure, as well as Moscow's plans to restrict diesel exports are also supporting oil prices.\n“Moderate intraday declines on Thursday were reversed later in the session on news that Russia is restricting diesel exports owing to disruptions at several refineries caused by Ukrainian drone strikes and may have to curtail crude production,” Vandana Hari, chief executive of Singapore-based Vanda Insights, said.\nRussia is one of the top producers of oil and is part of the Opec+ group that has been adjusting production to stabilise energy markets.\nOil also posted gains last week after a Ukrainian drone attack on the Russian port of Primorsk disrupted crude operations.\nOil prices have been volatile this year due to continuing geopolitical tensions in the Middle East and the war between Russia and Ukraine. President Trump’s trade tariffs are also affecting oil prices.\nUS crude oil inventories have also reduced for the week ending September 19 to support prices.\nUS commercial crude oil inventories (excluding those in the Strategic Petroleum Reserve) decreased by 0.6 million barrels last week from the previous week, according to the latest data from the Energy Information Administration.\nAt 414.8 million barrels, US crude oil inventories are about 4 per cent below the five-year average for this time of year.\nTotal motor gasoline inventories also fell by 1.1 million barrels and are 2 per cent below the five-year average for this time of year.\n“Despite the weekly jump, crude remains stuck in its narrow trading range as markets balance rising geopolitical tension against expectations of a looming glut,” Ms Kim said.",
  "word_count": 497,
  "scraped_at": "2026-02-14T01:49:53.050768",
  "_text_extracted": true
}