{
  "article_id": "37bbdc4d9b7f",
  "url": "https://www.teamtalk.com/news/move-almost-certain-man-utd-overtake-liverpool-26m-defender-feels-klopp-cant-fulfil-main-wish",
  "title": "Move  almost certain  as Man Utd overtake Liverpool for £26m defender who feels Klopp cant fulfil main wish",
  "date": "20230627T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Move ‘almost certain’ as Man Utd overtake Liverpool for £26m defender who feels Klopp can’t fulfil main wish\nManchester United could move forward with interest in Bayern Munich defender Benjamin Pavard, a report has claimed.\nNapoli’s Kim Min-jae was Man Utd’s main target to strengthen at centre-back until recently. However, that interest has now been shelved, since Kim is set on signing for Bayern instead. But coincidentally, Man Utd’s alternative might come from the Bundesliga champions.\nPavard is about to enter the final year of his contract with Bayern, who could sell him for €30m (£26m), according to Football Transfers.\nThe report claims Man Utd have established themselves as suitors for Pavard after turning their attention away from Kim.\nThey believe he might be a good suit for the system Erik ten Hag is trying to refine at Old Trafford after guiding Man Utd to the Carabao Cup trophy and Champions League qualification for next season via a third-place finish in the Premier League.\nThere is other interest in Pavard, notably from Inter and Liverpool, per the report.\nInterestingly, though, it is claimed that Pavard has reservations about how much regular gametime he would be able to earn at Liverpool. That’s despite recent claims to the contrary that he would be willing to consider a move to Merseyside.\nJurgen Klopp already has Trent Alexander-Arnold as his main right-back, even if he has been transitioning into a hybrid midfield role recently. Centrally, Liverpool have Virgil van Dijk and Ibrahima Konate as their main options.\nThere have been talks between Pavard’s representatives and Liverpool, but Football Transfers concludes that the Frenchman is ‘unlikely’ to end up at that destination.\nLikewise, Inter would struggle to accommodate Pavard as well as Chelsea captain Cesar Azpilicueta, who is their priority target for the right-hand side of their back three.\nMan Utd ahead of Liverpool and Inter for Pavard\nThus, Man Utd – who, like Inter but unlike Liverpool, can offer Champions League involvement next season – might be in the lead for Pavard. All they will need to do is convince him he can get a significant portion of gametime for them.\nTen Hag has been relying on Raphael Varane and Lisandro Martinez as his main centre-back pairing so far. However, Varane is now 30 and has endured some injury issues, so might be phased out.\nIn theory, Varane could drop into a backup role, considering there are doubts about the future of Harry Maguire, with fellow Frenchman Pavard taking his more prominent place.\nMeanwhile, at right-back, another of the roles Pavard is accustomed to playing in – which allowed him to rise to attention with France at the 2018 World Cup – Man Utd have Diogo Dalot and Aaron Wan-Bissaka, though there has been speculation that the latter could leave.\nPavard might be eyeing either a central or wider defensive role that he could make himself useful in for Man Utd.\nIf the season just gone was his last at Bayern, he will have finished his spell there with 162 appearances, of which 43 came in 2022-23. The former Lille and Stuttgart stopper has won the Bundesliga title in each of his four seasons in Munich.\nREAD MORE: Man Utd ‘make contact’ with Bundesliga club after Ten Hag decides on £85m Kane alternative",
  "word_count": 549,
  "scraped_at": "2026-02-14T02:12:52.291760",
  "_text_extracted": true
}