{
  "article_id": "37e25295e09e",
  "url": "https://thepeoplesperson.com/2023/10/04/manchester-united-want-a-winger-and-midfielder-in-january-270373/",
  "title": "Manchester United want a winger and midfielder in January - Man United News And Transfer News",
  "date": "20231004T064500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have suffered their worst-ever start to a Premier League campaign and are in danger of failing to qualify from their Champions League group and the pressure is being ramped up on manager Erik ten Hag.\nThe Dutchman is having to deal with injuries to all his key defenders, poor form of the players who thrived under him in the previous season, and numerous off-field controversies.\nThe right-wing has been a major problem in the past month with both Antony and Jadon Sancho missing due to varying reasons.\nWhile the Brazilian is back training and could be in consideration for the Champions League home tie against Galatasaray, Sancho looks certain to leave.\nTen Hag needs help in January\nIf the links with Borussia Dortmund actually end up coming true during the winter transfer window, then the Red Devils will require an addition on the wings.\nAnother problem plaguing the manager has been selecting the best possible midfield combination. New signing Mason Mount struggled in the opening two games.\nChristian Eriksen fixed it to an extent but he struggles on the big occasions while Casemiro has been really poor so far, and looks like he cannot shield the defence on his own.\nSo the manager brought in Scott Mctominay to add more bite at the centre of the park, but despite his impeccable international form, he has struggled to impact games for the club.\nSofyan Amrabat was brought in on loan on deadline day to help with this mess but due to injuries at the back, he has been forced to play as an auxiliary left-back.\nThe lack of consistency with regards to selection of personnel in the middle of the park has made it difficult for the team to build a rhythm of playing together.\nFootball Insider has claimed that the 20-time English league champions are open to strengthening on the wings and in the middle of the park in January.\n“Man United are eyeing moves for a winger and central midfielder in the January window following a poor start to the new season, sources have told Football Insider.\nRecruitment on the wings and in midfield being planned\n“Club chiefs are drawing up a shortlist of potential winger targets in the event the England international is not reintegrated at Old Trafford.\n“Meanwhile, central midfield is also seen as key on the January agenda despite the summer signings of Sofyan Amrabat and Mason Mount.”\nPedro Neto is one name who has emerged as a target for the wings but it must be remembered that the Glazers are not in favour of huge investment in January.\nTen Hag had to make do with a couple of loan signings last winter and it is doubtful that the owners would sanction a major purchase.",
  "word_count": 461,
  "scraped_at": "2026-02-14T01:56:32.781830",
  "_text_extracted": true
}