{
  "article_id": "381342126d88",
  "url": "https://island.lk/harry-kane-has-englands-goal-scoring-record-but-he-really-needs-trophies/",
  "title": "Harry Kane has England goal - scoring record , but he really needs trophies – The Island",
  "date": "20230327T013000Z",
  "domain": "island.lk",
  "source_country": "Sri Lanka",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nHarry Kane has England’s goal-scoring record, but he really needs trophies\nHarry Kane has eclipsed Wayne Rooney to become England’s all-time top goal scorer, but he is still battling to avoid the same fate as his predecessor.Rooney was among the first to congratulate the 29-year-old striker after his record-breaking 54th goal in Thursday’s 2-1 win over Italy, a moment that has been inevitable for some time given Kane’s potency yet was no less historic when it finally arrived.\nThe chase further intertwined two players whose connection dates back to March 2015, when Kane replaced Rooney for his debut in a European Championship qualifier against Lithuania at Wembley. Rooney had already scored; Kane took 79 seconds to hit the net himself. Later that year, Rooney beat Sir Bobby Charlton’s 45-year record (49 goals) and was presented with a golden boot by Charlton. Afterwards, he gave a speech in the dressing room.\n“I said that I hoped the young players in the squad would come close to the record themselves and even be able to surpass me.” Rooney told The Times on Friday. “Harry had scored only three England goals at that point, but I said those words because I knew he could do it. Even then, with only four caps under his belt, I knew he could become England’s greatest scorer if he kept going the way he was and I wanted to give him encouragement.”\nRooney has been on hand ever since to offer Kane guidance and advice, but his England career also serves as a warning. He scored his record-setting 53rd and final international goal in England’s humiliating Euro 2016 defeat to Iceland — the chasm between individual and collective achievement never wider in the striker’s lifetime.\nRooney scored just once in three World Cups, never able to produce his devastating best on the biggest stage and forever living in the shadow of his teenage self who burst onto the scene at Euro 2004 with such force before his metatarsal injury and a penalty shootout ended England’s hopes in the quarterfinals against Portugal.\nHis regret over never winning anything with his country is replicated by many of the so-called “Golden Generation” of which he is a part. Kane will recognise that pain, too, especially having also been on the pitch when England lost to Iceland seven years ago. He already holds the record for most England goals at a tournament finals (12) but what drives him now is silverware.\nAt least Rooney had an illustrious club career at Manchester United to console him, ending his career with five Premier League titles, three League Cups, and one FA Cup, Champions League, Europa League and FIFA Club World Cup. As well as the all-time scoring record for United (253 goals in 559 games). Kane is now the all-time top goal scorer for Tottenham (recently surpassing Jimmy Greaves with 267 goals in 416 games) and England, but although he is a World Cup Golden Boot winner, he does not possess a solitary team trophy to show for it.\nEngland’s palpable progress under Gareth Southgate — reaching the 2018 World Cup semifinals and Euro 2020 final — has created a sense that they have never been closer to ending a 57-year wait for a major honour, even accounting for the fine margins of tournament football. But they have to take those last steps to realise that potential at Euro 2024.\nThat task is obviously not solely within Kane’s grasp, so, for now, all he can do is keep leading by example. He would, of course, have preferred to break Rooney’s record by converting that now-infamous second penalty in England’s 2022 World Cup quarterfinal defeat to France, but there was at least some poetic justice in achieving the milestone from another spot-kick in Naples on Thursday.\nNobody can seriously question his mentality these days, but Kane’s determination to set the tone at the start of Euro 2024 qualification led to a superb all-round display against Italy and a fillip for Southgate as he looks to rally the troops for his fourth tournament cycle. Beating their Euro 2020 conquerors Italy away from home for the first time since 1961 is another step towards England breaking down the long-standing inferiority complex that has inhibited them against top opposition. (ESPN)\nLatest News\nKolkata the stage as England, Scotland resume auld rivalry\nScotland vs England. The sense of occasion isn’t lost on Scotland captain Richie Berrington. Earlier this week, Berrington dared to dream of the headlines should his side beat England in Kolkata a matter of hours before the Scotland rugby team face England in the Six Nations with the Calcutta Cup on the line.\nBoth Scotland teams are underdogs but, unlike their rugby counterparts who are licking their wounds after a poor showing against Italy last weekend, Berrington’s men are coming off the back of a resounding 73 run win over an Italian team making their debut at this tournament and ruffling some feathers along the way.\n“That rivalry has always been there between Scotland and England, obviously a long history there between the two nations, it’s there in every sport,” Berrington said. “But yeah, next Saturday’s going to be exciting. We’ve also got the Scotland rugby team taking on England the same day, so it would make quite a nice headline if Scotland has two wins on the Saturday.”\nAs banana skins go, this should be one England back themselves to avoid. But it will be no easy stroll, especially with another unexpected obstacle down the road in Italy, surprise 10 wicket winners against Nepal, who had themselves pushed England to the max in their opening match of this T20 World Cup.\nBoth of England’s remaining group-stage opponents pose an element of the unknown, a point noted at the start of the tournament by Mark Watt, Scotland’s veteran left-arm spinner making his fifth World Cup appearance. “Quite funny thinking about the England analysis team trying to find club cricket games of some of our youngsters,” Watt said. “We’ve all had a laugh about that.” England have never played Italy and, in their only previous T20I meeting with Scotland – at the last World Cup in Barbados – George Munsey and Michael Jones staged an unbroken opening partnership worth 90 before the match was washed out.\nOnly Jofra Archer and Adil Rashid remain from the bowling line-up which took the field that day, the latter going at 13 runs an over from his two overs. And while those figures are reminiscent of Rashid’s three wicketless overs at 14.00 against Nepal, he turned that around against West Indies, where he was easily the pick of England’s bowlers in a losing cause on a turning Wankhede pitch.\nIf they trip up in their first outing in Kolkata, where Scotland have already played their first two matches of this World Cup, England’s last group encounter with Italy becomes crucial. So too does Scotland’s final clash with Nepal. On paper, England’s progression to the Super 8s should be assured, but they absolutely cannot take their Associate opponents lightly.\nSo far, this campaign has shown England need more consistency from their enviably deep batting line-up. Half-centuries to Jacob Bethell and Harry Brook still required the back-up of Will Jacks’ 18-ball 39 against Nepal and, even then, it took Sam Curran’s sublime death bowling to let them escape with victory. Against West Indies, it was Curran who ran out of partners and captain Brook believed his charges were too careful chasing. For Scotland, they need more than just the few plucky moments they produced in a 35-run loss to West Indies. They need everything to fire, as it did against Italy, and then some, to be in with a shot.\nThree consecutive single-figure scores across this tournament and the Sri Lanka series that preceded it leave Tom Banton searching for runs, particularly amid calls for Harry Brook to leapfrog him into the No. 4 spot. An unbeaten 54 in a Player-of-the-Match performance against Sri Lanka in the second of their three games in the lead-up suggests the touch is there. Now he must rediscover it at a time when his side needs it most.\nHaving managed just one run against West Indies as Munsey too departed cheaply after a promising start, Michael Jones further highlighted the importance of Scotland’s opening duo with a 30-ball 37 in a 126-run stand – Munsey struck 84 off 54 – that set up victory over Italy. With the quality of the opposition now magnified, it is imperative that he supports his partner with an even bigger contribution to a union that could prove critical in getting enough runs on the board against England.\nEngland confirmed an unchanged XI on the eve of the match, with Jamie Overton preferred to Luke Wood in the attack.\nEngland: Phil Salt, Jos Buttler (wk), Jacob Bethell, Tom Banton, Harry Brook (capt), Sam Curran, Will Jacks, Liam Dawson, Jamie Overton, Jofra Archer, Adil Rashid\nBrad Wheal, who replaced Safyaan Sharif for the win over Italy, said Scotland had not made any decisions on their side.\nScotland: (possible) George Munsey, Michael Jones, Brandon McMullen, Richie Berrington (capt), Tom Bruce, Michael Leask, Matthew Cross (wk), Mark Watt, Oliver Davidson, Brad Wheal, Brad Currie\n[Cricinfo]\nSports\nDinara set to meet Shiwali in final\nJ30 ITF Junior Week 3 Tennis\nDinara de Silva is set to meet Shiwali Gurung of Nepal in the girls’ singles final of the J30 ITF Junior Week 3 Tennis tournament after emerging victorious in the semi-finals in Colombo on Friday.\nDinara beat Haritha Venkatesh of India 6-2, 6-2 in her semi final\nNepal’s Shiwali Gurung beat Kirika Fuku of Japan 7-5, 4-6, 6-2.\nLatest News\nStirling-less Ireland hope the catches stick against fellow strugglers Oman\nTwo games, two defeats, virtually out of the tournament. A blanket sentence that covers both Ireland’s and Oman’s fortunes at this 2026 T20 World Cup, as their ambitions of Super Eight qualification give way to insistence that they have been better than their results.\n“We should have won at least one match, because as I said, we are not as bad a team as we played,” Mohammad Nadeem said after Oman’s 105-run loss to Sri Lanka.\n“The other day was so disappointing because actually for 65-70% of that game I thought we were the better side,” was Gary Wilson’s assessment of Ireland’s opening-game defeat to the same opponents.\nWhatever the reason, neither Oman nor Ireland have put their best foot forward so far in this tournament. Their net run rates (NRR) tell the tale, with Ireland’s at -2.175, and Oman’s even worse at -4.306.\nSo, as they say, it’s mainly pride at stake at the SSC on today [Saturday]. Recent form skews in favour of the Irish, who boast a 4-2 win – loss record over Oman in T20Is, and have won each of their last three encounters. But Oman won the last World Cup meeting between the two sides in 2016.\nBoth teams come with severe problems to address. Oman’s bowlers have been ragged, particularly against Sri Lanka who scored 225 against them, and their batters have managed totals of 103 all out and 120 for 9.\nIreland have shown more promise in both departments but have been badly let down in the field, dropping nine catches across their two games. They will also be without their captain Paul Stirling, who has been ruled out of the rest of the tournament with a knee injury.\nBut while problems abound, Saturday will give these sides the chance to chase a significant target: points on the board.\nHarry Tector is widely regarded as the cornerstone of Ireland’s middle order and a potential future captain. Against Oman, his importance will lie in his ability to navigate the conditions in Colombo – particularly against Oman’s spate of spin options. With Stirling out, even more will depend on Tector. He began the tournament promisingly with a 40 against Sri Lanka, and he will want to get back among the runs after falling for a duck against Australia.\nForty-three-year-old Mohammad Nadeem became the oldest half-centurion at a World Cup with his unbeaten 53 against Sri Lanka, which will no doubt have cemented his place in Oman’s middle order after missing out on their first game. With Oman’s top order showing fragility across their opening two games, his ability to anchor an innings could prove vital.\nSam Topping has been approved as Stirling’s replacement in Ireland’s squad, and could be in line for an international debut, though Tim Tector is also in consideration. Josh Little could potentially come back into the XI as well, in light of Oman’s struggles against pace.\nIreland (probable): Tim Tector, Ross Adair, Harry Tector, Lorcan Tucker (capt & wk), Curtis Campher, Ben Calitz, George Dockrell, Gareth Delany, Mark Adair, Barry McCarthy/Josh Little, Matthew Humphreys.\nOffspinner Jay Odedra didn’t bowl against Zimbabwe, then bowled the second over against Sri Lanka, went for 14, and didn’t bowl again. Oman, though, don’t have an in-form bowler to pick in his place: left-arm spinner Shakeel Ahmed, who was left out against Sri Lanka, went for 27 in his two overs against Zimbabwe.\nOman (probable): Jatinder Singh (capt), Aamir Kaleem, Hammad Mirza, Wasim Ali, Mohammad Nadeem, Jiten Ramanandi, Vinayak Shukla (wk), Sufyan Mehmood, Nadeem Khan, Shah Faisal, Jay Odedra/Shakeel Ahmed.\n[Cricinfo]\n-\nFeatures6 days ago\nMy experience in turning around the Merchant Bank of Sri Lanka (MBSL) – Episode 3\n-\nBusiness6 days ago\nRemotely conducted Business Forum in Paris attracts reputed French companies\n-\nBusiness6 days ago\nFour runs, a thousand dreams: How a small-town school bowled its way into the record books\n-\nBusiness6 days ago\nComBank and Hayleys Mobility redefine sustainable mobility with flexible leasing solutions\n-\nBusiness3 days ago\nAutodoc 360 relocates to reinforce commitment to premium auto care\n-\nMidweek Review3 days ago\nA question of national pride\n-\nOpinion2 days ago\nWill computers ever be intelligent?\n-\nMidweek Review3 days ago\nTheatre and Anthropocentrism in the age of Climate Emergency",
  "word_count": 2335,
  "scraped_at": "2026-02-14T01:59:46.871663",
  "_text_extracted": true
}