{
  "article_id": "381f36203592",
  "url": "https://www.dw.com/en/jerome-boateng-at-bayern-munich-an-act-of-desperation/a-66988152",
  "title": "Jerome Boateng at Bayern Munich : An act of desperation – DW – 10 / 03 / 2023",
  "date": "20231003T134500Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jerome Boateng at Bayern Munich: An act of desperation\nOctober 3, 2023A possible return of German World Cup winner Jerome Boateng to Bayern Munich has created plenty of headlines.\nJerome Boateng was in tears when he was brought off an hour in to Bayern's 5-2 win against Augsburg on the final day of the 2021 Bundesliga season. His then head coach Hansi Flick hugged him on the sidelines. After 10 years, 363 games, two Champions League titles, nine German championships, five German Cups and two Club World Cups, Boateng's career with Bayern Munich was over — or so it seemed.\nBut nearly two and a half years later, Boateng is back training with Bayern. What at first appears a romantic return turns out to be a panicked attempt by the defending Bundesliga champions to correct poor squad planning that sees them short of cover in central defense. That the 35-year-old is soon to be retried for assault increases the explosive nature of a possible return.\nSporting form a concern\nWith his precision passing and speed, Boatengwould have been the perfect type of player for Thomas Tuchel at his peak. Both skills have absent from the Bavarian's defense so far this season, but whoever believes Boateng alone is going to solve the defensive issues at Bayern is likely to be disappointed.\nEven in Boateng's final season for the club, Bayern conceded 44 goals — their worst record this century. And in the two years that followed, Boateng was far from convincing on the field.\nAfter his move to Lyon, he was at first a regular member of the starting eleven but in the second half of the year, his minutes were limited as Lyon's then coach Peter Bosz preferred other players. French sports magazine \"L'Equipe\" also reported several verbal and even physical altercations between Boateng and his teammates.\nEven after the departure of Bosz, Boateng'ssituation hardly changed. Under the new coach Laurent Blanc, he also struggled to play, which lead to his departure from the club in May 2023. He has been without a club ever since. Now he is being considered as an option to fill Bayern's defensive gaps that for a long time the bosses claimed never existed.\nTuchel at odds with bosses\nThe topic of too thin a squad is not a new one at Bayern. This summer, head coach Thomas Tuchel expressed great concerns around Bayern's squad size and whether it was big enough to challenge at the highest level. Time and time again Tuchel mentioned how there was no room for injuries and how \"difficult\" it would be with such a thin squad.\nAhead of the Bundesliga game against Gladbach in September, Tuchel doubled down on his criticism and in doing so positioned himself against Bayern CEO Jan-Christian Dreesen. The Bayern boss had told \"Sky\" just before that the squad was \"first class\" and Tuchel had to be a \"bit more creative. That is his job.\"\nBut even creativity has limits. For anyone watching Bayern's German Cup first round game in Münster it was clear that the defensive issues of the summer had not been handled.\nWith Matthijs de Ligt, Dayot Umapecano and new-signing Min-Jae Kim all out injured, defensive prospect Josip Stanisic surprisingly loaned to Leverkusen and Tarek Buchmann seemingly not yet up to the task of starting for Bayern, Tuchel was out of options. The coach turned to central midfielder Leon Goretzka and wingback Noussair Mazraoui as a makeshift pairing, and in doing so was liked proven right about his concerns around squad depth.\nCharge of assault and insult\nAnd so Jerome Boatenghas returned to Säbener Straße in an attempt to make up Bayern's biggest error of judgement in the transfer window.\n\"Bayern is admitting to a mistake: They didn't do their homework in defence as they should have, otherwise they would have had a fourth skilled centre back,\" Germany legend Lothar Matthäus told \"Sky.\"\nThe criticism of Boateng's potential signing extends well beyond his sporting qualities though, as his arrival would be about the person as much as the player.\nAnd in the case of the person, Jerome Boateng recently dealt with court proceedings after accusations of violent attacks on his former girlfriend.\nThe Bavarian Supreme Court just overturned Boateng's conviction in its entirety because of obvious legal errors. However, the trial will be reopened and then heard for the third time — overshadowing Boateng's potential second stint at Bayern.\nIn the first two proceedings, the courts considered it proven that Boateng had injured and insulted his then partner during a Caribbean holiday more than three years ago. Boateng was fined €1.8m for assault.\nThe retrial is due to start in spring 2024.\nTuchel: \"Doors are open\"\nFor Bayern's sporting director Christoph Freund that is not a reason to refrain from signing the 35-year-old.\n\"Everyone can have their opinion,\" Freund said in response to a critical question from a journalist. \"Our approach is what is best for Bayern in sporting terms.\" Boateng's court case was \"a private story\" and therefore \"not a big issue for us\". In addition, \"the presumption of innocence\" always applies.\nThomas Tuchel struck a similar note. \"The presumption of innocence applies when proceedings are suspended,\" he said in the press conference ahead of Bayern's Champions League game in Copenhagen.\n\"Because that is also the case, we as a football club have the right to make football decisions.\" It must be possible to allow \"a deserving player\" to train with us, he continued. \"The doors are always open.\"\nNot everyone sees it the same way. Bayern have been criticised for its line of justification.\nThe \"White Ring\", a non-profit organisation that supports crime victims and prevents crime, wrote on Instagram: \"No, dear FC Bayern, domestic violence is not a private story. Rather, it is a massive social problem.\"\nAgainst all odds, the 35-year-old is continuing his training at the club. A decision is to be made by the end of the first week of October on a possible return of the 2014 world champion. Either way, the next few weeks look turbulent for Bayern Munich.\nThis article was originally written in German.",
  "word_count": 1022,
  "scraped_at": "2026-02-14T01:56:32.782917",
  "_text_extracted": true
}