{
  "article_id": "383ad699d043",
  "url": "https://punchng.com/three-players-who-have-scored-five-goals-in-single-champions-league-match/",
  "title": "Three players who have scored five goals in single Champions League match",
  "date": "20230315T141500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UEFA Champions League, an annual club football competition organised by the Union of European Football Associations, was founded in 1955.\nThe competition is played by top-division European clubs and the winner of the competition is decided through a round robin group stage to qualify for a double-legged knockout format, and a single leg final.\nReal Madrid, the present title holder of the championship, have won it 14 times followed by AC Milan winning it seven times while Liverpool had only won it six times.\nBelow is a list of players who have scored five goals in single Champions League match\n1. Lionel Messi\nLionel Messi became the first player to score five goals in a UEFA Champions League match on March 8, 2012.\nThe Argentine player scored twice before the end of the first half and three times in the second half in the game against the German side, Bayer Leverkusen, at Camp Nou..\nThe Argentina international had earlier scored four goals against the English Premier League side, Arsenal, in 2009-10, equalling the record of the likes of Marco van Basten and Simone Inzaghi, both of whom netted four times in a Champions League match.\nBarcelona defeated Bayer Leverkusen 7-1 to advance to the quarter-finals with a 10-2 aggregate win.\n2. Luiz Adriano\nOn October 21, 2014, Brazilian football player Luiz Adriano became the second player in the history of football to score five goals in a UEFA Champions League match against BATE Borisov.\nAdriano, who presently plays for Brazil’s Sport Club Internacional had scored four first-half goals in the game while he was at Shakhtar Donetsk.\nHe added his fifth goal in the 82nd minute, his second penalty of the game.\n3. Erling Haaland\nErling Haaland became the third player in history – and the first for nine years – to score five goals in a single UEFA Champions League game on March 14, 2023.\nManchester City defeated RB Leipzig 7-0 in the round of 16 second leg of the competition.\nHaaland presently attains the current record of players who had scored five goals in a UEFA Champion League match.\nHe is also the youngest player to reach 30 goals in the history of the competition.\nErling Haaland completed his five-goal performance in 57 minutes while it took Lionel Messi 84 and Luiz Adriano 82.\n“Congratulations to Erling for reaching yet more memorable milestones,” Manchester City wrote on its website.",
  "word_count": 402,
  "scraped_at": "2026-02-14T02:16:40.075360",
  "_text_extracted": true
}