{
  "article_id": "384b1a6cb279",
  "url": "https://www.nytimes.com/athletic/5987484/2024/12/14/ruben-amorim-manchester-derby/",
  "title": "What Ruben Amorim can expect from his first Manchester derby : Vomit , hostility and a proper rivalry",
  "date": "20241214T100000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim has faced a range of clubs during his first six games as Manchester United head coach, from Arsenal in the Premier League to Bodo/Glimt in the Europa League.\nThose six matches have brought positives, negatives and mixed results, but his opponents on Sunday, Manchester City, will pose a different challenge.\nAdvertisement\nPep Guardiola’s side go into the game at the Etihad looking a shadow of their dominant selves, winners of the past four Premier League titles, but derby days are different, even if Amorim is playing down its significance.\n“I just want to improve the team so I cannot treat it like a normal derby,” he said on Thursday evening.\n“It should be like two great teams fighting for the title, and it is not that in this moment. So it is just one more game with a very good opponent. Both teams are struggling in the moment so I hope in future I can feel that real feeling of a derby (that has title implications).”\nWhile that is certainly true about the form and prospects of the two teams, it is still a game that means a little bit more.\nTo give United’s new head coach a taste of what to expect, The Athletic spoke to three United legends about what it’s like to play City away. From vomit to respect to moments they’ll treasure, this is what they had to say.\nOle Gunnar Solskjaer: ‘To beat Guardiola is a moment to cherish’\nSolskjaer played more than 350 matches for United between 1996 and 2007 before later becoming manager between 2018 and 2021.\nHere he speaks about losing at City’s former ground Maine Road, scoring against his former United team-mate Peter Schmeichel and then winning three away derbies in a row as United manager.\n“It’s not hostile at their place, not really. But it’s a proper rivalry. Sometimes it’s easier away from home against them. At Old Trafford, you have more of a responsibility to open up and try to dominate.\n“It’s unusual to be the underdog with United because it certainly wasn’t like that when I played… though we did lose 3-1 at (City’s previous ground) Maine Road. I scored against Peter Schmeichel that day (lead image above) but I did not enjoy that one and Gary Neville did not have his best of games. Sir Alex dished it out afterwards, he was furious.\nGO DEEPER\nPutting the ‘Manc’ back in the Manchester derby\n“But we were underdogs when I was manager. I’ve looked at our three consecutive wins there. We averaged 35 per cent possession but still beat them three times away. We did that with width and pace. Anto (Anthony Martial) was brilliant in those games. He had a lot of stick but in those matches, he dropped in to create spaces so it was harder for City to defend. He and Bruno Fernandes were very important in possession.\n“They batter you in the beginning. Good possession, width. You expect an onslaught but in the 2021 game, we started well, scored and surprised them. We set up a team to stop them.\nAdvertisement\n“City have dominated so many games against United so you are trying to do what you can so fans can hold their heads up high in work the next day. What I did — and what Erik ten Hag did in the 2024 FA Cup final — was set up a team to hurt them when they are out of balance.\n“Guardiola was always respectful and I have huge respect for him, he’s an incredible manager. But for any manager to beat him, that’s a moment to cherish. And we did it three times on the bounce. We should’ve played away at City every weekend!\n“I joke, but the wins felt good. City and Liverpool are the two games for United fans — and they’re the worst when you lose. So I told my players to go out afterwards and enjoy it. They weren’t the types to go out around Manchester, maybe they’d go out in quieter areas. I didn’t go out after the games to celebrate, I had work to do.\n“At the end of the game in 2019, I looked towards the away end. 3,000 hardcore fans. My kids were in there. They saw beer being thrown at the United section — at least it was the same colour as beer. The fans were singing, ‘Ole’s at the wheel’ at the end. ‘Tell me how good does it feel?’. I’ll tell you, it feels absolutely wonderful. It’s not a trophy, but it’s those days that you play and manage for.”\nAndy Cole: ‘We’re back to those old days’\nCole played nearly 300 matches for United between 1994 and 2002 before later joining City for the 2005-06 season.\nHere he discusses the importance of the derby to fans, how he was treated when he moved to City and why Amorim should just enjoy the day.\n“City away with United. Love it. Almost always enjoyable, as was the build-up. But I’m talking about when City were at Maine Road. Our team coach would pass by all those terraced houses in Moss Side, a setting that gets the juices flowing. Some of their fans would be flicking the Vs and you’re thinking, ‘This is what it’s about’. If you can’t get yourself up for these games then you’re going to struggle.\nAdvertisement\n“If you ask me what my highlights were, I’m going to give you a one-word answer: winning. I scored in one at Maine Road, but derbies are all about the result, regardless of the game. Win and all is good. Lose and it isn’t.\n“But I also played for City against United in a derby. And won. Maybe some City fans were a bit iffy when I joined them because I’d been at United and I’ve never hidden my loyalty to this day. But I gave 100 per cent in every single game I played for City. I was professional, I had bills to pay.\n“I played in a famous game in 2006 when we won 3-1. Didn’t score, did all right. Patrice Evra made his debut and Cristiano Ronaldo was sent off. I played with Darius Vassell, Stephen Ireland and Trevor Sinclair. Richard Dunne and Sylvain Distin were decent with Sun Jihai in defence. Top player technically, Sun. David James in net. You’re getting a decent ‘keeper with Jamo.\n“United fans were brilliant with me, even though I was with City. I’m just a lucky guy. I didn’t know what to expect and some of the other boys who played for both clubs got some stick, but it’s about how you conduct yourself. And I conducted myself well, with respect.\n“If I was speaking to Ruben Amorim before this game, I’d say, ‘Enjoy it, it’s a great occasion. And an even greater day if you win’. You’re involved in the Manchester derby, it’s a privilege. The sad thing this season is that you have two teams not in the best of form. So we’re back to those old days, where you have no idea what is going to happen. A proper derby.”\nPatrice Evra: ‘And then the vomiting started’\nEvra made nearly 400 appearances for United between 2005 and 2014.\nHere he speaks about his difficult debut in January 2006 and why it is important for Amorim’s players to show willing on Sunday.\n“The kick-off was at 12 for my first United game, which was against City away. The noisy neighbours. I’d not played a game that early since I was a child. I saw Mikael Silvestre eating pasta at nine in the morning, so I joined him. And then the vomiting started. I thought that was the end of the day for me but it stopped. Now I know it was an allergy, but at the time, was I going to miss a debut like that? I didn’t mention it to anyone.\nAdvertisement\n“It’s one of my clearest memories because it was a disaster and made me realise that I wasn’t ready for the Premier League. This wasn’t what we thought was going to happen. Even as a new player, I knew Sir Alex had a great record against City. But being at home made them confident,\n“From the start, Trevor Sinclair kept running past me and leaving me on my ass. I was in shock. I’d played in the Champions League final and for France and there I was on my backside.\n“City targeted me, the new boy, hitting long balls to Sinclair who ran straight at me. He scored and was involved in a second goal just before half-time.\n“I was taken off after Ferguson spent the break shouting at us and I couldn’t understand a word. He still got his message across. I have said before what he told me or how Carlos Queiroz translated it into French. ‘Evra! That’s enough! Now you can sit down, watch the game and start to learn to play English football in another game!’. When Queiroz told me I wasn’t going back on, I didn’t argue.\n“Nemanja Vidic played his first game too. He stayed on the pitch. We lost 3-1. My agent Luca was there with his wife. It got worse because this was supposed to be a great moment for him. He came to see me at the hotel. I opened the door and he nearly cried when he saw me. Even his wife looked sad for me. I didn’t feel sad, I felt s***, empty, especially after the way Ferguson had talked to me.\n“I hope Ruben Amorim has a better experience than I had. When I look at the game this weekend, I don’t know who will win, but I do know the fans will not forgive you if you don’t run, tackle or give your best. Even if you are losing, you have to never give up.\n“United have had a bad season, but that was the same last season and United beat City in the FA Cup final.\n“For Amorim, he beat City a few weeks ago (while in charge of Sporting CP in the Champions League) but now he’s at a different team. It will be tough, but I only want to see red shirts on the streets of Manchester on Monday.”\n(Top photo: Gary M. Prior/Getty Images)",
  "word_count": 1726,
  "scraped_at": "2026-02-14T01:52:10.156876",
  "_text_extracted": true
}