{
  "article_id": "386b4d5d8fca",
  "url": "https://allafrica.com/stories/202512150333.html",
  "title": "Nigeria : Afcon 2025 Countdown - Super Eagles Stars Hit Camp in Ruthless Form",
  "date": "20251215T154500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "From Istanbul to LaLiga, from Croatia to Belgium and Greece, Nigerian players delivered final reminders of their quality before boarding flights to the Super Eagles' AFCON camp in Egypt.\nNigeria's Super Eagles are heading into the 2025 Africa Cup of Nations with something far more dangerous than reputation, momentum.\nAcross Europe and beyond, Nigeria's core internationals and fresh call-ups signed off from club duty with goals, assists, strong performances and timely returns to form, reinforcing the sense that this squad is peaking at exactly the right moment.\nFrom Istanbul to LaLiga, from Croatia to Belgium and Greece, Nigerian players delivered final reminders of their quality before boarding flights to the Super Eagles' AFCON camp in Egypt. It was not coincidence. It was confirmation.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nSevilla spark, Nigerian firepower\nIn Spain, Super Eagles forwards Akor Adams and Chidera Ejuke were central figures as Sevilla halted a worrying run of three straight LaLiga defeats with a commanding 4-0 demolition of Real Oviedo at the Ramón Sánchez-Pizjuán Stadium.\nAdams wasted no time announcing himself, opening the scoring in the fourth minute with a calm finish past Aarón Escandell, his third league goal of the season. The former Montpellier striker then turned provider midway through the first half, slipping a neat assist to Djibril Sow as Sevilla doubled their lead.\nEjuke, introduced late in the contest, added gloss to the scoreline in stoppage time with a brilliant solo run and finish, marking his first goal of the season. For both players, it was the perfect send-off before reporting for international duty; sharp, decisive, and impactful.\nNew blood, instant returns\nFew players have embraced their Super Eagles invitation quite like Lawal Salim Fago. The 22-year-old forward continued to justify his inclusion in Eric Chelle's AFCON squad by scoring his fifth goal of the season for Istra 1961 in Croatia.\nFago struck five minutes into the contest, a match that was eventually abandoned at 1-1, but the goal carried weight. It was his second in as many games since being named in Nigeria's final AFCON list, underlining both confidence and form as he prepares for his first major senior international tournament.\nMidfield engines and defensive reinforcements\nIn England, Frank Onyeka was named on the bench as Brentford hosted Leeds United, with the combative midfielder now set to link up with the Super Eagles camp. While minutes were limited, Onyeka remains a trusted engine; valued for his energy, pressing and tactical discipline.\nIn Belgium, Raphael Onyedika continued his steady run of form, playing 79 minutes as Club Brugge thrashed Dender 5-1 away from home. The midfielder has been a regular this season, with 14 league appearances and a goal to his name, offering Chelle balance and composure in midfield.\nBruno Onyemaechi, meanwhile, marked a timely return in Greece. After missing Olympiacos' previous two league games and a Champions League fixture, the versatile defender returned to the starting line-up away to Aris. It was his sixth league appearance of the campaign, a reassuring sight for a squad seeking defensive depth.\nComebacks, minutes and leadership\nCyriel Dessers' name also returned to the starting XI, as the striker made his first start in 17 matches for Panathinaikos following a prolonged injury spell. Signed from Rangers in the summer, Dessers has now made four league appearances, scoring once, and his fitness boost comes at a crucial moment for Nigeria's attacking options.\nIn Turkey, Wilfred Ndidi captained Beşiktaş from midfield, playing the full 90 minutes in a dramatic 3-3 away draw against Trabzonspor. The vice-captain's presence, leadership and durability remain invaluable as he heads into another continental tournament with Nigeria.\nA squad arriving in sync\nBeyond individual moments, the broader picture is impossible to ignore. Established stars and new faces alike are arriving at the Super Eagles camp sharp, confident and battle-ready. Goals were scored, minutes were logged, injuries were shaken off, and roles were reaffirmed.\nAs Nigeria prepares to open their AFCON campaign in Morocco, the message from club football is clear: this is not a squad scrambling for form. It is one moving with purpose, unity and belief.\nNot just contenders in name, but a team arriving on time.",
  "word_count": 698,
  "scraped_at": "2026-02-14T02:03:26.511174",
  "_text_extracted": true
}