{
  "article_id": "38a2548fc19c",
  "url": "https://theathletic.com/5458437/2024/04/30/granovskaia-rubie-trial-court/",
  "title": "Marina Granovskaia , Saif Rubie and a trial revealing  the difficult and ugly side of football  ",
  "date": "20240430T101500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The confetti is falling as Marina Granovskaia walks onto the pitch after the Champions League final. It is May 29, 2021, and Chelsea’s director of football, rarely seen publicly, sits on the trophy rostrum, laughing with captain Cesar Azpilicueta.\nGranovskaia will be gone just over one year later, stepping down as part of the regime change at Chelsea after former owner Roman Abramovich was forced to sell the club due to sanctions levied by the UK government after Russia’s invasion of Ukraine in February 2022. She has never spoken publicly, neither during her nearly two decades at Chelsea nor since departing.\nAdvertisement\nFor Abramovich’s right-hand woman at the club, in charge of all footballing affairs, this night in Porto was one of her greatest triumphs. She had been involved in the signing of every player in Chelsea’s squad that night after officially becoming a director in 2012, having followed Abramovich to London in 2003. Her reputation in football is formidable — and while there are myriad factors at play, it is still inescapable that Chelsea’s most successful period mirrors her time at the club.\nBut after the high of Porto, the ensuing season would be tumultuous — and ultimately end in an email sent by a football agent which Granovskaia said left her feeling “nervous”, “worried”, and “threatened”.\nThe result was Granovskaia’s first public appearance in two years, taking place in a London courtroom — and a trial which laid bare some of football’s murky transfer dealings.\nOn September 19 2022, Saif Rubie’s day continued to get worse. The Dubai-based agent has been involved in dealmaking for 20 years, such as acting as an intermediary for the likes of former Premier League defenders Antonio Rudiger and Kolo Toure. He also, most notoriously, represented Liverpool prospect Bobby Duncan, a period which ended in the teenager’s acrimonious departure from his boyhood club and included Rubie being banned by the Football Association (FA) for five weeks over his social media conduct. Subsequently, Duncan publicly criticised Rubie’s advice.\nIt is a jetset lifestyle, but on this day, Rubie wanted to fly home to London to watch the Queen’s funeral with his parents. After his overnight flight was cancelled, he was forced to stay on the floor of Dubai Airport before taking two more delayed flights to arrive at Heathrow Airport via Brussels.\nHis journey was not yet over. Rubie disembarked the aircraft into the arms of the waiting Metropolitan Police, who arrested him. He was later charged with making “malicious communications” — an allegation, according to UK law, of “sending an electronic communication with intent to cause distress or anxiety”.\nAdvertisement\n“Coming off a plane to be arrested made me feel like I was a drug dealer,” said Rubie in his subsequent police interview, conducted at Heathrow the same day. “For me to get arrested off a plane like I’m Pablo Escobar, having had 24 hours of no sleep, to be slung in a jail cell for 24 hours — I’m not happy about it.”\nEverything pertains to an email he sent Granovskaia in May 2022 following the sale of France international Kurt Zouma from Chelsea to West Ham United in the summer of 2021.\nZouma, who is in no way implicated in this case, famously had his own legal issues after joining West Ham: he was found guilty in February 2022 of “causing unnecessary suffering to a protected animal” after being filmed kicking his pet cat.\nRubie believes he acted as an intermediary on Chelsea’s behalf during the deal — and as such was due a commission on any transfer fee received above €30million (£25.6m, $32.2m). Both parties dispute the exact sum — more on this later — while Granovskaia argues that Rubie never represented Chelsea, and instead sought to involve himself in the deal.\nAfter disagreeing in WhatsApp messages sent in late August 2021, Rubie did not pursue the matter for the majority of the ensuing season — his attention instead focused on securing a new contract for his client Rudiger, then still a Chelsea player. However, after it became clear that no deal would be reached, and the defender would join Real Madrid on a free transfer, Rubie was still incensed enough by the situation to revisit the dispute.\nCopying in fellow agents Barry Silkman, Sahr Senesie and Pini Zahavi, all of whom had been involved at some stage of the deal, Rubie sent an email which included the following key lines.\n“In summary, you owe me and my partners 300k which needs to get paid ASAP. If Chelsea don’t pay it then that debt will be on you to pay. I am done trying to be nice to you. And feel free to go to your boss (Abramovich) who’s had his recent problems and tell him that you have a big problem with me as long as you tell him the truth about your behaviour. Because in life you can’t be wrong and strong.\nAdvertisement\n“I look forward to hearing from you on the above matters and hopefully have a swift solution to them otherwise I guess I will see you when I see you.\n“I’m sure you’ve heard the story about your other friend Kia when he owed me money for a year and how he ended up paying it. Wouldn’t want you to be in the same situation just because you have a personal issue with me.”\nThe final paragraph — and the reference to an incident involving Iranian-British agent Kia Joorabchian — would be the crux of the trial. Did it cause Granovskaia anxiety or distress, does it amount to a threat and, if so, did Rubie have reasonable grounds to make one?\nSouthwark Crown Court lies right on the banks of the Thames in the shadow of Tower Bridge, with the river’s tide virtually lapping the dock. The Crown Prosecution Service (CPS) formally decided to charge Rubie with malicious communications last year — leading to a courtroom trial in which Granovskaia would be asked to provide evidence.\nWhen she arrived in court last Tuesday morning, April 23, dressed all in black with large gold hooped earrings, there was anticipation from the public gallery — the majority of courtrooms in the UK are open-access — not just over the result of the trial, but about what else might be revealed.\nThe previous week, Rubie’s defence had used a pre-trial hearing to petition the court for documentation of Chelsea’s transfer dealings, which they were unsuccessful in securing. During the course of the trial, both the judge, His Honour Judge Tomlinson, and defence barrister Matthew Radstone, revealed they were Tottenham Hotspur fans, while any individuals who were season-ticket holders of either Chelsea or West Ham were precluded from being on the jury.\nEven being a season-ticket holder at Stamford Bridge might not have helped their pre-existing knowledge of Granovskaia’s dealings — what is known about the Russian director would fit onto a flashcard.\nAdvertisement\nGranovskaia, 49, has Russian-Canadian citizenship, went to Moscow State University to study foreign languages, and subsequently joined Sibneft, one of Abramovich’s oil companies. There are reports of her being a classically trained dancer.\nOn one occasion during her time at Chelsea, David Redfearn, a magician who has performed his tricks in the executive suites of Stamford Bridge for more than 20 years, put a photograph on his Instagram account showing himself at a club celebration with Tuchel and Granovskaia. Chelsea got to hear about it — and the picture mysteriously vanished.\nSworn in to give evidence last Tuesday, the prosecution barrister only elicited a few more cursory details. Her voice, never heard publicly before, only has a faint trace of an Eastern European accent.\nHer first job at Chelsea? Office admin, arranging tickets for VIPs, looking after Abramovich’s private box. How did her role grow? Abramovich was increasingly away on business, so it made sense to find her an official position by 2012. What was that role? According to Granovskaia, it was “kind of taking over” the football side — “they all reported to me”. In her 10 years as a director, the club won every major trophy available to an English team.\nSince leaving Chelsea in August 2022, even colleagues who worked closely with her for over a decade have not been updated on what she has done next. In short, she not only vanished from the world of professional football — but apparently from the world itself. With facts so slim, and Granovskaia intent on keeping it that way, she even brought a strategic PR specialist with her to court.\nThe bulk of her time in the witness stand, which spanned an entire day, surrounded the details of Zouma’s transfer. According to Granovskaia, Chelsea were happy to sell the centre-back, then 26 years old, who was dissatisfied after falling out of favour following Tuchel’s appointment as head coach.\nAt the start of the transfer window, Chelsea already had two firm offers for him: one from Wolverhampton Wanderers, for €30m, and another from Spanish club Sevilla, with whom Chelsea were keen to work out a part-exchange deal for fellow defender Jules Kounde.\nAdvertisement\nRubie’s first relevant message to Granovskaia came on June 4, 2021 — the two were already known to each other in a relationship described as “professional” by the Chelsea director, having worked together on Rudiger’s initial signing. After that signing, Granovskaia drank a glass of Champagne with Rubie on the terrace of the Eden-Roc restaurant in the south of France’s Cote d’Azur.\nIn this text, he tells Granovskaia that Tammy Abraham was one of 15 strikers West Ham were looking at, and asked for the player’s salary so he could report back and gauge the east London club’s interest. Granovskaia replies by saying Chelsea are not interested in any deal.\nThis is the nuts and bolts of intermediary work: using existing relationships to help clubs network and inserting oneself into deals to earn a commission. Over one month after his initial message, on 28 July, Rubie messages again, asking for an update on Abraham, but also mentioning he might have a potential deal for Zouma. West Ham, he tells Granovskaia, asked him to enquire.\nGranovskaia answers that he may be available, but only for over €30m, and only to certain clubs; Zouma has flatly rejected the prospect of joining Wolves.\nOne day later, Rubie brings Granovskaia an official offer from West Ham — significantly below that number. She quickly rejects it, with her reply giving a window into the straight-talking approach which she became known and respected for.\n“You know what I’m like,” she texts back. “What I say is non-negotiable is actually non-negotiable… I don’t want to waste any more time.” She also tells Rubie that commission will only be considered if the deal is over €30m.\nOn July 31, Rubie tries to resurrect the deal, telling Granovskaia that West Ham have agreed a €15m deal for Fiorentina centre-back Nikola Milenkovic — but that Zouma is the preferred option because of his Premier League experience. Referring to Sevilla’s bid, he says he can push West Ham up towards the desired total, but mentions that West Ham cannot afford a large salary because Declan Rice’s father is proving a tough negotiator during his son’s contract talks.\nAgain, Granovskaia’s response is firm.\nAdvertisement\n“Hi Saif, thanks but our position is very clear and will not change,” she responds. “This is what it takes to get the deal done. If it can’t be done, it can’t be done. There is no comparison between the two… We have a deal with Seville, we wouldn’t drop the price any more.”\nShe also bats away further enquiries over commission — “I really don’t need anyone brokering a deal for me” — stressing that she could count the times she has used an intermediary as a selling club on one hand. This point was later disputed by Rubie’s lawyers, citing FA records.\nRubie responds with disappointment, asking if he has done something wrong — “I get upset with the way you’ve treated me” — but from this point forward is sidelined from any deal.\nOn August 28, Zouma joins West Ham. In court, Granovskaia testifies that the original fee agreed with West Ham was £25m — but Zouma’s inability to agree terms with West Ham, who were not willing to bend their wage structure, meant the buying club also paid Chelsea a £4.1m termination fee, which was to be paid automatically to Zouma. The total cost of the deal to West Ham, according to the exchange rates of the day, was €33.9m — over the threshold which Rubie believed qualified him for a commission.\nIn the days before the deal was struck, Rubie messages Granovskaia, emphasising why he merits a small commission for introductions, despite not working on the deal’s latter stages, or being listed on the FA’s official dealsheet. In court, he contends that his role in bringing Chelsea the first offer from West Ham makes him an intermediary on the former’s behalf.\n“We’re covering ground which has already been covered not once, not twice, not even three times,” says Granovskaia via WhatsApp, who believed that, in any case, Rubie would have been an intermediary on behalf of West Ham, meaning they would be liable for any fee. “I could not have been clearer with you. I would appreciate it if you couldn’t enquire about the availability of our players in future… seeing as this is what has happened. I hope this is the last time we have a conversation on this matter.”\nIt is the last conversation on the matter… for nine months.\nAdvertisement\nOn May 22, 2022, Rubie types out the email central to this case. It is clear he is angry — and negotiations in the interim have made matters worse. There are bitter ongoing negotiations over the future of Rudiger, with both sides a distance away from reaching an agreement.\n“I offered you a chance to extend the contract of Antonio by an extra year on the same salary and you refused and started playing games,” he writes, referencing an offer made near the beginning of the process, which Granovskaia says she did not accept because it included a proposed loan move. “You went to Sahr (Senesie, Rudiger’s brother) and started making up lies about me and HMRC regarding why you didn’t want to deal with me. That alone was defamatory and cost me a lot of business and trust due to your lies.\n“Then the way you have been with me was finally confirmed when I was in Abu Dhabi for the Club World Cup, when I went to visit Antonio and he told me that you had approached him questioning why he was friendly with me and was happy to deal with me. Who do you think you are going to players in this way and talking rubbish about me? What have I done to you to make you so bitter and terrible towards me?”\nTestifying under cross-examination from Rubie’s defence lawyer, who was attempting to demonstrate there were justifiable grounds behind the email, Granovskaia denied disparaging the intermediary, remembering only having had one direct conversation with Rudiger where she did not mention his agent.\nNevertheless, Rubie continues his email, insisting he is owed £300,000 — and reminding Granovskaia of “the story about your other friend Kia…”\nThe implication would lead to Rubie “fighting for his life” in a witness stand two years later.\nKia Joorabchian is now one of the best-known agents in the world, whose clients have included the likes of Carlos Tevez, Javier Mascherano and Philippe Coutinho. He is heavily influential at several Premier League clubs and, in court, Granovskaia named him as one of the four agents Chelsea did the most business with.\nBy 2009, he was already a powerful figure — but also appears to have made enemies.\nAdvertisement\nThe prosecution argued that Rubie was referring to an incident that Joorabchian claims to have endured at Novikov in Mayfair, one of London’s most exclusive restaurants, in front of the Brazilian football team.\nAccording to a police interview: “Mr Joorabchian provided evidence as to how he was confronted in a restaurant by persons acting for the suspect who took his watch and refused to return it until payment was made later — when approximately 12 men turned up at his office, started to intimidate him, and demand money from him saying that the defendant wanted his money.”\nRubie denies any wrongdoing in any incident involving Joorabchian. Later, while still distancing himself, he confirmed he received payment in the aftermath.\n“(The reference was) intended to cause Ms Granovskaia anxiety,” argued CPS barrister Arizuna Asante in his opening statement. “It was sent intending for it to be intimidating and to threaten her.”\nThe prosecution had one problem: Joorabchian was a no-show at court. Despite being ordered to give evidence, and telling a police officer he was available on the trial’s first day, he subsequently self-reported an illness, before flying to the United States before the trial started. Rubie’s legal team leapt on his absence.\n“It’s beyond belief,” said defence barrister Radstone in his closing argument to the jury. “Beyond belief that you have witnessed this at Southwark Crown Court, where someone central to a criminal case gets on a private jet to the USA the night before he is due to give evidence, preventing the defence from asking him a single solitary question.\n“Is that fair or appropriate or right when there’s a man in the dock with a life on hold?”\nRubie was a nervous but aggressive figure when he testified in his own defence last Thursday morning, wearing a blue jacket which he quickly took off as he began to sweat. Moments before he was sworn in, he winked at one of Granovskaia’s representatives in the public gallery.\nOver the course of two hours, Rubie was repeatedly warned by the judge about his aggressive conduct, including asking questions back at the prosecution lawyer, and once ordering the barrister to “keep it relevant”. At one point, the judge banged his fist three times on the table at Rubie’s interjections, shouting, “Stop, stop, stop!” It did not help the judge’s control of proceedings, however, that he kept mispronouncing Granovskaia as “Granovskovsky”.\nAdvertisement\n“This confrontation has to stop,” he told Rubie after one heated exchange. “If I don’t intervene, please listen to the question and do your best to answer.”\nIn an interview with police after his initial arrest, Rubie had told officers that Joorabchian had owed him £50,000 for around a year, with an old associate of his spotting Joorabchian in the restaurant and the Iranian-British agent handing over his watch as a form of deposit.\nThough he called Joorabchian a “degenerate gambler” who is “always late paying”, Rubie insisted that: “Nothing happened — nothing physical, nothing menacing, nothing.”\nIn front of the jury at trial, he subsequently told of not one, but two incidents including a watch being taken — which was called a “fabrication” by the prosecution in closing arguments, who accused him of inventing the second occasion as an innocent explanation for referencing Joorabchian in his email.\nHowever, the key legal point of this trial was not what happened in the restaurant — Rubie was not facing questions over that matter — but over what Rubie wanted to make Granovskaia believe might happen.\nRubie insisted he was referring to potential legal action, but on describing how she felt on receiving the email, Granovskaia said: “Very uncomfortable would be an understatement. I felt threatened, physically threatened because of the language being used, because it was being made personal, and because he referred to Kia’s incident.”\n“I remembered hearing something about it,” she added later under cross-examination. “I didn’t know of the details, but I’d been told by Kia in the past about people demanding money off Kia and I had vague recollections of that.”\nAfter receiving the email, she reported it to Team Fusion, the company that looked after her security. Though her usual protection amounted to a driver with some security training, the recommendation was that this was increased, and it was by reporting it to Team Fusion that the email found its way to the police.\nAdvertisement\nRubie went on to argue he would have never sent a threat to Granovskaia due to Abramovich’s reputation — “I wouldn’t be sending an email to someone who works for Roman Abramovich, one of the most powerful people in business” — later linking the Russian with Vladimir Putin in a statement the prosecution called a “cartoonish, silly thing to say”.\nHe cut a desperate figure on the stand — though the testimony of agent Silkman, a jovial associate of Rubie who bounced into court to say why, in his opinion, Rubie was owed commission from the deal, was more convincing.\nRadstone, in arguing that Rubie was justified in sending the email to ask for payment, said the absence at court of Joorabchian, as well as the lead investigating police officer, who missed the trial after being signed off work with an injury, had added to Rubie’s frustration.\n“His life is on the line. He’s fighting for his life,” he said. “It’s hard to have questions fired at you even when people haven’t bothered to turn up. Just imagine what it was like for him in the witness box, he’s fighting for his life. It’s inevitable he would become upset which you may not have found attractive, but it’s in that context of missing witnesses.”\nOn Monday morning, the jury arrived for the second day of deliberations. Earlier in the day, they asked the judge to clarify a point of law, surrounding whether a defendant could make a threat if there were reasonable grounds to make one — a clause which has since been rescinded, but which was applicable in law at the time of Rubie’s email.\nAt 12.49pm, a reedy voice came over the tannoys inviting all parties in the trial to the courtroom. Granovskaia was not present in court, as she had not been since giving evidence. There, the jury’s foreman was asked two simple questions by the court clerk.\n“Have you reached a verdict?”\n“Yes.”\n“And do you find the defendant guilty or not guilty on the charge of malicious communications?”\n“Not guilty.”\nAdvertisement\nBehind perspex glass at the back of the courtroom, Rubie covered his face with his hands. When his eyes emerged, they were red and weeping.\nIn the public gallery, his family burst into noisy tears. The potential punishment included up to two years imprisonment, an unlimited fine, and the possible loss of Rubie’s intermediaries licence.\n“I’m relieved, my life has been hell for the last two years so I’m glad this chapter is over,” he told Sky Sports News after the verdict. “It’s been horrible to have been accused of something you didn’t do and for it to have got this far. I thank my legal team, my barrister Matthew Radstone. I’m glad the jury saw this for what it is.”\nIt is understood Rubie is considering a civil court case against Granovskaia and Chelsea in an attempt to recoup the money he still believes he is owed. His plans, as an acquitted man, were to take his parents to dinner. The CPS does not have the power to appeal.\nGranovskaia released a statement five hours after the verdict.\n“Coming to court to give evidence in the Crown’s case against Mr Rubie was an extremely difficult decision. I am an intensely private person, but I was willing to do my part to ensure that no one else — particularly no woman — was ever made to feel as I did upon receiving his email, a feeling this trial has revived.\n“I was also minded to testify as I received messages of support from colleagues and associates in football following news of Mr Rubie’s arrest, including some who have had dealings with him over the years.\n“There are things I miss about football: my colleagues and counterparts, including some wonderful and decent agents; the players; the spirit of Chelsea; and, of course, winning trophies.\n“One thing I do not miss is the difficult and ugly side of football.\n“I will not be making any further comment.”\nAdditional reporting by Liam Twomey and Peter Rutzler\n(Top photos: Getty Images; design: Eamonn Dalton)",
  "word_count": 4059,
  "scraped_at": "2026-02-14T01:56:51.538874",
  "_text_extracted": true
}