{
  "article_id": "38ada8cbf252",
  "url": "https://www.liverpoolecho.co.uk/whats-on/whats-on-news/jamie-carragher-sings-oasis-songs-32206486",
  "title": "Jamie Carragher sings Oasis songs with fans on tube after Wembley concert",
  "date": "20250805T223000Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jamie Carragher sings Oasis songs with fans on tube after Wembley concert\nThe former Liverpool centre back attended the Oasis concert at Wembley Stadium\nJamie Carragher joined in an Oasis sing-a-long with fans on a tube after he attended the gig at Wembley Stadium over the weekend. The dad-of-two is a legendary figure for Liverpool FC, winning nine major trophies in 737 appearances for the club.\nOasis, led by brothers Liam and Noel Gallagher, announced that the band had reunited last year. They kickstarted their Live '25 tour in Cardiff last month before they took to the stage at Wembley over the weekend.\nJamie Carragher attended the iconic gig with his son James, who plays for Wigan Athletic. The dad and son shared a selection of snaps from their night at the concert with their group of friends. James commented to say: “Best concert I’ve ever been too. Fact.”\nHowever, soon after the concert ended, Jamie was spotted wearing a bucket hat and singing along with a sea of Oasis fans who were heading home on the tube, reports Manchester Evening News.\nCaptured on video belting out the words to Half the World Away, the 47-year-old was clearly soaking up the nostalgic atmosphere with fans on the tube ride. Oasis have just concluded five shows at Wembley Stadium, with the last show taking place in the capital on Sunday night.\nWatching the original video shared on TikTok, fans commented to share their surprise of Jamie's appearance but agreed it looked like he was having a good time. One person wrote: \"This is the best video I’ve ever seen on this app, love you Carra\". Another said: \"Carra on the underground!\"\nBut Jamie’s attendance comes a few years after he got caught up in a public feud with Liam Gallagher over football, with one fan commenting on the clip: \"Wasn't he slagging Oasis the other week?\"\nThree years ago, the two stars got caught up in the crossfires between the rivalry between Liam’s favourite Manchester City and Jamie’s Liverpool as they threw insults towards each other on social media.\nAfter Manchester City claimed the Premier League title, beating Liverpool in the process, back in May 2022, Liam took to X to take a dig at Jamie. He posted: “What you saying Carra you b***end?”\nJamie responded right away to say: “I'm saying you'll never win the Champions League and Oasis are s***e compared to the Beatles. That work?” Liam then ended the exchange by posting: “Carra you’ve got s*** banter for a Scouser. Oasis p*** all over The Beatles.”\nJamie was not the only famous person to attend Sunday night’s show, with American superstar Chappell Roan also seen in attendance with friends during the Wembley gig.\nOver the week, the likes of Dua Lipa, Tom Cruise and Romeo Beckham have all been seen enjoying the London shows. Liam's ex-wife and All Saints singer Nicole Appleton was also seen attending one of the Wembley gigs, as well as Geri Horner-Halliwell and players of the winning Lionesses team.\nThis Friday, Oasis will begin their three nights in Edinburgh before heading to Dublin. They will then mark their first international shows of the Live ‘25 tour, by taking on with two nights in Toronto, Canada on August 24 and 25.\nThe band will then head across the US and Mexico, before heading back for two more dates at Wembley on September 27 and 28. Oasis will then make their way across Asia, Australia, and South America.",
  "word_count": 582,
  "scraped_at": "2026-02-14T02:11:49.092045",
  "_text_extracted": true
}