{
  "article_id": "38b005c0e281",
  "url": "https://www.dailymail.co.uk/sport/football/article-11698065/Manchester-United-complete-loan-signing-Bayern-Munich-midfielder-Marcel-Sabitzer.html",
  "title": "Manchester United complete the loan signing of Bayern Munich midfielder Marcel Sabitzer",
  "date": "20230201T053000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United COMPLETE the loan signing of Bayern Munich midfielder Marcel Sabitzer on a deal until the end of the season... as the Red Devils act quickly after Christian Eriksen was ruled out for three months with an ankle injury\n- Man United have signed Bayern Munich midfielder Marcel Sabitzer on loan\n- United acted quickly after Christian Eriksen was ruled out for three months\n- Transfer News LIVE: Keep up-to-date with all the latest developments and deals\nManchester United have completed the signing of Marcel Sabitzer on loan from Bayern Munich until the end of the season.\nIt's understood that United moved quickly for the Austria midfielder over the last 24 hours after it became emerged that Christian Eriksen would be out until early May with an ankle injury.\nDonny van der Beek has already been ruled out for the rest of the season following knee surgery and Scott McTominay for two weeks with a muscle problem.\nBayern Munich midfielder Marcel Sabitzer has completed a loan move to Manchester United\nUnited acted quickly after Christian Eriksen was ruled out for three months with an ankle injury\nSabitzer was identified as the best available option, having made 443 career club appearances across Europe – including 54 since joining FC Bayern from RB Leipzig.\nThe 28-year-old was keen to make the move and flew to Manchester from Germany on Tuesday to undergo a medical. United filed the deal sheet by the 11pm deadline and completed his loan move by midnight. Overall, the whole process is said to have taken 12 hours.\n'Sometimes in life you have to make quick and important decisions,' said Sabitzer. 'From the moment I heard about this opportunity I knew it was right for me. I am a competitive player; I want to win and help the club achieve its aims this season.\n'I feel that I am at my peak as a player, and that I can contribute a lot of experience and energy to the squad. I'm excited to start with my new teammates and manager and to show my qualities to Manchester United fans.'\nSabitzer outlined his excitement after his move to Old Trafford was confirmed by United\nSabitzer (left) was pictured at Munich Airport earlier on Tuesday ahead of a potential move\nSabitzer has fallen out of favour at Bayern and has struggled for gametime so far this season\nUnited's main priority in this transfer window was to sign a replacement for Cristiano Ronaldo, and they achieved their aim by bringing in Wout Weghorst on loan from Burnley.\nHowever, two more deals were forced upon them. Goalkeeper Martin Dubravka's return to Newcastle meant Jack Butland was brought in from Crystal Palace, and then Eriksen's injury – sustained in Saturday's FA Cup win over Reading – prompted the club to look for a new midfielder and Sabitzer was well known to the scouting department.\nUnited's football director John Murtough said: 'Marcel is a player that we have watched for a long time. The opportunity arose quickly, and we knew that he was someone with the ability and character to make an impact.\n'He adds further quality to our squad and experience to the dressing room, and all of us are pleased to be welcoming him to Manchester United.'\nEriksen is set to miss the next three months and Austrian international Sabitzer emerged as a target as the 28-year-old searched for more game time.\nMarcel Sabitzer (back, centre) then landed in England ahead of joining Manchester United\nSabitzer has found himself frozen out at the Allianz Arena this season and has not started a game since before the World Cup in early November - during their 2-0 Champions League win against Inter Milan.\nSabitzer adds quality to Erik ten Hag's midfield alongside the likes of Casemiro, Scott McTominay, Fred and Bruno Fernandes.\nHe has played 54 times since arriving at Bayern in 2021, scoring twice, but has struggled to nail down regular first team football.\nSabitzer started just eight times in the Bundesliga last season, coming off the bench 17 times - scoring once and providing one assist.\nHe made a name for himself at RB Leipzig with some impressive displays between 2014 and 2021.\nThe 28-year-old appeared 229 times in total for Leipzig, netting 52 goals in the process before earning a £14m switch to Bayern.\nTen Hag was quizzed on bringing in a replacement for Eriksen during his press conference on Tuesday ahead of Wednesday's Carabao Cup semi-final second leg against Nottingham Forest, but admitted that it would be difficult to sign anyone before the transfer window closes.\n'On deadline day it's difficult. You can't make policy on such bad injuries, but we have players in the midfield department, good players. We have players who can fill the gap,' Ten Hag had said.\nThe 28-year-old will provide important midfield depth for Ten Hag over the next few months\n'I think you can never fill that (gap) because every player has his own characteristics and identity.\n'Another player will always fill in in a different way, but it doesn't mean you have to be less successful.'\nUnited are still keen on Barcelona midfielder Frenkie de Jong and knew a permanent signing for Sabitzer could impact their interest in the Holland international this summer.\nHowever, in the meantime, the 68-capped Austrian will also provide much-needed depth for United as they head in to a hectic period, with Ten Hag's side still competing in all four competitions and facing eight games in February alone.\nMost watched Sport videos\n- Disgusting drink act caught on camera at ICC T20 World Cup\n- Team GB Winter Olympics hero: Matt Weston wins skeleton gold\n- Tiffany Salmond dazzles in red bikini at Bondi Icebergs\n- IOC President in tears after Ukrainian athlete is kicked out\n- NBA player makes long-awaited debut after battle with cancer\n- Team USA skier Breezy Johnson gets engaged after crash\n- Aussie snowboarder Scotty James shows off his dance moves\n- Has VAR broken football? Arsenal fan grills Mark Clattenburg\n- Super Bowl Champ wears Sam Darnold t-shirt with middle finger up\n- Oscar Piastri promotes new Grill'd chicken burger launch\n- Seahawks celebrate with fans in Seattle at the Super Bowl parade\n- LA Dodgers star speaks out first time since loss of baby daughter",
  "word_count": 1052,
  "scraped_at": "2026-02-14T01:59:41.728249",
  "_text_extracted": true
}