{
  "article_id": "38cd623b4627",
  "url": "https://www.syracuse.com/tv/2024/09/real-madrid-vs-vfb-stuttgart-free-live-stream-91724-how-to-watch-uefa-champions-league-today.html",
  "title": "Real Madrid vs . VfB Stuttgart free live stream ( 9 / 17 / 24 ): How to watch UEFA Champions League today",
  "date": "20240917T141500Z",
  "domain": "syracuse.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2024-25 UEFA Champions League kicks off, with Kylian Mbappe and Real Madrid CF taking on VfB Stuttgart at Santiago Bernabéu Stadium on Tuesday, September 17, 2024 (9/17/2024) as a highlight of the action on the first matchday of the tournament.\nHow to watch: Stream the 2024-25 UEFA Champions League on Paramount+ (free trial).\nHere’s what you need to know:\nWhat: 2024-25 UEFA Champions League, group stage\nWho: Real Madrid vs. VfB Stuttgart\nWhen: Tuesday, Sep. 17, 2024\nTime: 3 p.m. EDT\nWhere: Santiago Bernabéu Stadium, Madrid, Spain\nTV: UniMas, TUDN\nChannel finder: DirecTV, Verizon Fios, Cox, Xfinity, Spectrum, Optimum\nLive stream: Paramount+ (free trial), fuboTV (free trial), DirecTV Stream (free trial)\nReal Madrid, perennial giants of European football, come into the game with a squad brimming with talent, including Vinícius Júnior and Jude Bellingham leading the charge. Bellingham is expected to be available, along with Aurélien Tchouaméni, neither of whom played over the weekend. But the biggest draw is newly signed French star Mbappe, who is also expected to start on Tuesday.\nVfB Stuttgart are the firm underdogs (+800) in the contest. But the Bundesliga side has had impressive form of late, with players like Serhou Guirassy and Chris Führich standing out under manager Sebastian Hoeneß. They will try to exploit gaps in Madrid’s defense in their attempt at an upset.\nReal Madrid begins this campaign trying to defend its 2023-24 Champions League title, which it took back from Manchester City, even defeating their English rivals along the way. Real Madrid has claimed the continental title no fewer than 15 times, more than double any other team, including five times in the last 10 years.\nHere’s the Champions League schedule for Tuesday, September 17:\n- Juventus vs. PSV, 12:45 p.m. on TUDN. (STREAM)\n- Young Boys vs. Aston Villa, 12:45 p.m. (STREAM)\n- Real Madrid vs. VfB Stuttgart, 3 p.m. on TUDN. (STREAM)\n- Bayern vs. Dinamo Zagreb, 3 p.m. (STREAM)\n- Sporting vs. LOSC, 3 p.m. on CBS Sports Network. (STREAM)\n- Milan vs. Liverpool, 3 p.m. (STREAM)\nCan I bet on the game?\nYes, you can bet on the game from your phone in New York State, and we’ve compiled some of the best introductory offers to help navigate your first bets from BetMGM, FanDuel, DraftKings, Bet365 and more.\nReal Madrid is -340 to win, according to DraftKings.\nHere’s a recent AP Champions League story:\nMADRID (AP) — Midfielders Jude Bellingham and Aurélien Tchouaméni will be available for Real Madrid’s Champions League opener after not playing in the Spanish league this weekend, coach Carlo Ancelotti said Monday.\nAncelotti said central defender Éder Militão, who missed practice on Monday, also will be fit to face Stuttgart on Tuesday at the Santiago Bernabeu Stadium.\n“Bellingham is fine, just like Tchouaméni and Militão, who didn’t train today,” Ancelotti said. “He needed an extra day to recover.”\nBellingham had been dealing with a foot injury and hasn’t played since Madrid’s Spanish league opener at Mallorca in August. His only other match this season was the UEFA Super Cup final against Atalanta, which kicked off Madrid’s season.\nTchouaméni also was nursing a foot injury and missed the team’s 2-0 win at Real Sociedad in the Spanish league on Saturday.\nMilitão played against Sociedad but didn’t practice with the rest of the squad on Monday because of a reported knee ailment.\n“He went through some individual work but he will be 100% for the game tomorrow,” Ancelotti said.\nNot available for Ancelotti is forward Brahim Díaz, who had to be replaced in the first half against Sociedad because of a right leg muscle injury.\nMadrid won a record-extending 15th European title last season.\nIt will be the team’s first Champions League match since signing France star Kylian Mbappé, who is expected to start on Tuesday.\nWatch your favorite teams\n- Where to watch MSG Network without cable in 2024\n- Best WNBA Finals streaming options: How to watch Liberty vs. Lynx, Sabrina Ionescu live for FREE\n- NFL Slimetime 2024 on Nickelodeon: How to watch season premiere with Nate Burleson for free\n- Buffalo Bills TV schedule 2026: How to watch free live streams today\n- NY Jets TV schedule 2025: How to watch free live streams today\nParamount Plus is an over-the-top streaming service from Paramount, which includes content from Paramount-owned brands like CBS, Comedy Central, Nickelodeon and more. Many Paramount-owned TV shows appear the day after broadcast on the service, and it is the exclusive home of Paramount Plus originals, like Yellowstone spinoff “1883.” It also airs live NFL games and UEFA Champions League matches, and starts at $7.99 per month after a 1-week free trial.",
  "word_count": 775,
  "scraped_at": "2026-02-14T02:01:51.734893",
  "_text_extracted": true
}