{
  "article_id": "38dc1e1760ad",
  "url": "https://www.marketscreener.com/quote/stock/MANCHESTER-UNITED-PLC-11217013/news/Man-United-signs-striker-Rasmus-Hojlund-from-Atalanta-for-82-million-44531502/",
  "title": "Man United signs striker Rasmus Højlund from Atalanta for $82 million",
  "date": "20230805T123000Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "SYDNEY (AP) — Manchester United signed Denmark striker Rasmus Højlund from Atalanta on Saturday in a move that ends the Premier League club's search for a replacement for Cristiano Ronaldo.\nHøjlund cost an initial 64 million pounds ($82 million) and that fee could go up by a further 8 million pounds ($10 million) dependent on his success. He has signed a five-year contract with an option to extend by 12 months.\n“It is no secret that I have been a fan of this great club since I was a small boy, and I dreamed of walking out at Old Trafford as a Manchester United player,\" Højlund said. “I am incredibly excited by this opportunity to turn that dream into a reality, and I am determined to repay the faith that the club has shown in me.”\nIn an offseason that has seen United repeatedly linked with a move for Harry Kane, the club has opted to go with an emerging talent in Europe, rather than one of the most prolific strikers of his generation.\nThe 20-year-old Højlund has impressed with his performances for Atalanta in the Italian league, but only scored 10 goals in all competitions in his one season with the club. He has played less than 100 senior games.\n\"It is still early in my career, but I know that I am ready to make this step up and play with this group of world-class players,” he said.\nHøjlund had previously been identified as a rising prospect with Copenhagen in his home country and then with Austrian team Sturm Graz.\n“Rasmus is a truly exceptional talent; he possesses technical and physical attributes which rank him amongst the best players in the world for his age group,\" United football director John Murtough said. “Working under Erik ten Hag and his coaches will provide Rasmus with the perfect development platform; everyone across the club will ensure that he is given the time and all the support required to reach his immense potential.”\nHøjlund is unlikely to be available at the start of the season after sustaining a tissue injury in training with Atalanta. He is recovering and has been able to train, but it is likely to take a few weeks before he can play. United opens its Premier League season on Aug. 14 against Wolverhampton.\nTen Hag has been looking for a center forward since Ronaldo's departure last November and, as well as Kane, had been linked with Napoli striker Victor Osimhen.\nKane's price tag had been seen as an obstacle to a move to United, while there were doubts Tottenham would be prepared to sell to a Premier League rival. Bayern Munich appears to be leading the race to sign the England captain, who will become a free agent at the end of the season.\nHøjlund has been handed one of the most prestigious jobs in soccer as United's striker.\nIt is also one of the most demanding, having been held by some of the sport's greats like Wayne Rooney, Robin van Persie and Ronaldo.\nA number of players have struggled to handle the role of leading United's attack with even high-profile forwards Romelu Lukaku and Edinson Cavani both failing to impress when signed in recent years.\nIn Højlund, United has opted against a readymade striker who has already established himself at the top of the sport.\n“Once I had spoken to the manager, I knew that this environment would be perfect for my development,\" Højlund said. \"I am relishing the opportunity to work with one of the best coaches in the world. Under his guidance and support I know that I am capable of achieving great things together with my new teammates at this special club.”\nHøjlund is United's third major signing of the offseason following deals for midfielder Mason Mount and goalkeeper Andre Onana.\nTen Hag led the club back into the Champions League in his first season in charge and also won the English League Cup.\nThere is an expectation to challenge for the Premier League title in his second year at the club.\nWhile United finished third last season, any hopes of a title challenge were undermined by the lack of a top quality center forward following Ronaldo's departure.\nMarcus Rashford scored a career-best 30 goals in all competitions, but Ten Hag spoke of the need for more goals throughout his team, rather than relying too heavily on the England striker.\n“Throughout the summer we have acted quickly and decisively to secure our primary targets early in the transfer window,\" Murtough said. \"This will ensure that Erik and his coaches have the best opportunity to prepare the squad to push for further success in the exciting campaign ahead.”\n___\nJames Robson is at https://twitter.com/jamesalanrobson\n___\nAP soccer: https://apnews.com/hub/soccer\n© 2023 The Canadian Press. All rights reserved., source Canadian Press DataFile",
  "word_count": 806,
  "scraped_at": "2026-02-14T02:00:36.686523",
  "_text_extracted": true
}