{
  "article_id": "38fb65ea5879",
  "url": "https://en.yna.co.kr/view/AEN20230426007700315",
  "title": "Natl football coach Klinsmann says key defender  all focused again  after tough stretch",
  "date": "20230426T063000Z",
  "domain": "en.yna.co.kr",
  "source_country": "South Korea",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nat'l football coach Klinsmann says key defender 'all focused again' after tough stretch\nBy Yoo Jee-ho\nSEOUL, April 26 (Yonhap) -- South Korea men's football head coach Jurgen Klinsmann said Wednesday that Napoli center back Kim Min-jae, the most important defender for the national team who'd recently gone through a rough patch, is back in a good place.\nKlinsmann returned to South Korea earlier in the day from a 10-day trip to Europe, where he met with key members of the national team based in the leagues across the continent.\nPerhaps no meeting was more important than the one Klinsmann had with Kim, after the 26-year-old defender found himself in some controversy after a friendly match last month.\nNapoli played in the UEFA Champions League quarterfinals against AC Milan during Klinsmann's visit, and that Kim was suspended for the second leg of the showdown after picking up his third yellow card of the tournament in the opening leg turned out to be a blessing in disguise for Klinsmann.\n\"He didn't play, so we could have lunch in a little restaurant,\" Klinsmann said with a smile. \"He explained his feelings and his emotions. Many thoughts in his mind, but it's all good. He's all focused again. He's looking forward to the next games with the national team. It's good that he knows we coaches are on his side.\"\nIn the aftermath of South Korea's 2-1 loss to Uruguay on March 28, Kim told reporters that he was \"mentally spent\" and he wanted to concentrate only on his club, rather than the national team.\nIt sparked speculation that Kim wanted to retire from international play, though he clarified later that it wasn't his intention at all and that he had a slip of the tongue while under stress.\nIn another bit of controversy after the Uruguay match, Kim unfollowed and blocked national team captain Son Heung-min on social media after Son posted a message on how honored and proud he was to represent the country. Kim later apologized for his action and said he had mistakenly thought Son's words were directed at him in light of Kim's comment on commitment to the national team, even though Son posts similar messages after every international appearance.\nWithout getting into specifics, Klinsmann said every meeting he had was \"nice, wonderful and positive.\"\n\"I think the players see that all we coaches want to be there and help them and want to talk to them,\" Klinsmann added.\nThe German legend also met with Son before a recent Tottenham Hotspur match. A former Tottenham star himself, Klinsmann said he was happy to see Son score in the game he attended, against AFC Bournemouth, but not so much when Tottenham lost that match 3-2.\nSpurs fired head coach Antonio Conte in late March and are now on to their second interim boss already.\n\"I know this club inside out and obviously, it's a very difficult situation for Tottenham,\" Klinsmann said. \"But Sonny is very focused. I just keep my fingers crossed that they turn it around, and they get results.\"\nKlinsmann also visited Scotland to see Celtic FC forward Oh Hyeon-gyu, and his native Germany for meetings with Lee Jae-sung of Mainz 05 and Jeong Woo-yeong of SC Freiburg.\n\"The only way for me, as a coach, to understand what they go through is to see them and to see their environment,\" Klinsmann said. \"I learned from the players what their issues are, where they live. To use Oh with Celtic as an example, it's very important for me to see him play in Scotland because I see his body language, I see his mental state.\n\"It's very difficult for him to get minutes because there are so many good players, but he's fighting, he's ready, he's hungry,\" Klinsmann continued. \"And it makes me happy when I see this, even if I see it just for one half.\"\nKlinsmann didn't travel to Spain to see the lone Korean in La Liga, Lee Kang-in of RCD Mallorca, who scored a brace in his latest match over the weekend. He's the first South Korean player to score more than once in a La Liga match.\nThe 22-year-old has been subject to constant transfer speculation, but Klinsmann said he's OK with where Lee is.\n\"Obviously, we are thrilled that he's doing so well and scoring goals. If he gets offers, it makes you always proud and happy,\" the coach said. \"But if he stays where he is, it's totally fine. I think he's in a good place right now.\"\nSouth Korea's next international friendlies will be against Peru on June 16 and El Salvador on June 20. With about two months to go, Klinsmann will keep an eye out for new candidates for national team consideration.\n\"There is time, before we have our games in June, for us to watch as many players as we can,\" he said, adding that his assistants watched K League action while he was gone and he will also follow the FIFA U-20 World Cup in Argentina next month.\n\"We have an eye on the young kids too but that might be too early for our June camp,\" Klinsmann said. \"If we see different players, and we want to see them in the two games in June, we will do that.\"\njeeho@yna.co.kr\n(END)\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\nG-Dragon confirms BIGBANG's official comeback this year\n-\n'Singles' Inferno' producer explains record-breaking Netflix renewal\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\n(Yonhap Interview) Auto 'good place to start' for submarine bid package: Canadian defense procurement chief\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\n(Movie Review) 'Humint': Ryoo Seung wan's romance wrapped in unflinching action\n-\n(Yonhap Interview) Moonassi brings stirrings of heart to paper\n-\n'Singles' Inferno' producer explains record-breaking Netflix renewal\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\n(2nd LD) N. Korea in process of designating leader's daughter Ju-ae as successor: NIS\n-\n(Olympics) Figure skater Cha Jun-hwan finishes 4th in men's singles\n-\nN.K. leader's daughter Ju-ae takes center stage with father in photos at Beijing embassy\n-\n(2nd LD) N.K. leader's sister calls Seoul's regret over drone incursion 'sensible'\n-\n(LEAD) (Olympics) Snowboarder Choi Gaon claims gold in women's halfpipe",
  "word_count": 1074,
  "scraped_at": "2026-02-14T01:55:54.934132",
  "_text_extracted": true
}