{
  "article_id": "38fb5d611d75",
  "url": "https://www.the42.ie/newcastles-eddie-howe-rules-himself-out-of-man-united-job-6919820-Jan2026/",
  "title": "Newcastle Eddie Howe rules himself out of Man United job",
  "date": "20260107T010000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EDDIE HOWE said on Tuesday that he is “100%” committed to Newcastle as he dismissed speculation linking him with the vacant Manchester United manager’s job.\nRuben Amorim was sacked on Monday after 14 months in charge at Old Trafford after an explosive post-match interview following his team’s 1-1 draw at Leeds.\nNewcastle boss Howe has been touted as a possible permanent replacement for the Portuguese boss.\nHe was also linked to the Chelsea job after the departure last week of Enzo Maresca, who has since been replaced by Strasbourg boss Liam Rosenior.\nThe 48-year-old Howe was asked by reporters on Tuesday whether anything could tempt him away from St James’ Park.\n“No, not at this current time,” he said on the eve of his team’s home match against Leeds.\n“The most important thing for me is happiness in the role, happiness in the job, the relationships I have with the people around me. Now, that’s not always been consistently good, and things can change at any football club.\n“But, at the moment, I am very happy.”\nHowe is in his fifth season at St James’ Park and last year led Newcastle to a first major trophy in 56 years.\nThey are currently ninth in the Premier League, just five points off a Champions League place.\n“I’m 100% here, working as hard as I can, head down, ignoring all the stuff that you guys (the press) write, good or bad, because it’s irrelevant,” said Howe.\n“It’s about today’s work and trying to prepare the team as well as we can for Leeds, so that will never change from my perspective, my commitment to my work and my job.”\nMeanwhile, Crystal Palace boss Oliver Glasner batted away questions over the managerial vacancy at Manchester United, saying cryptically he is “not allowed to bet”.\nThe Austrian is among the bookies’ favourites to replace Amorim.\nGlasner, 51, has impressed since arriving at Palace in 2024, leading them to their first major trophy by winning the FA Cup last season.\nThe Palace boss, who is out of contract at the end of the season, said last month that talks over a potential new deal at Selhurst Park were on hold.\nSpeaking on the eve of his side’s home game against high-flying Aston Villa, he was evasive when asked about the United job.\n“I’m not allowed to bet,” he said. “My contract has one paragraph (that says) I’m not allowed to bet. I don’t look at it.”\nGlasner was asked whether it would be wise to back him to be United’s next manager.\n“I also can’t give insider information because I would be breaking my contract,” he said with a smile.\n“I’m the Crystal Palace manager. It just makes no sense, and it’s wasted time for you to ask me any more questions, so I don’t talk about any other club.”\nGlasner said the length of managers’ contracts had limited meaning.\n“You can win trophies, and six months later you aren’t the manager there anymore, so I think if you see the length of a contract it doesn’t mean anything about the future,” he said.\n“Even if I sign a new contract, you could ask me every day, ‘What’s the future?’\n“Ruben Amorim said he had 18 months left in his press conference, and he’s not the manager anymore.\n“There’s one situation that keeps you in your job when you’re a manager — this is being successful.”\nIn addition, Manchester United interim boss Darren Fletcher said that leading the club was beyond his “wildest dreams” but insisted he has not considered replacing the sacked Ruben Amorim.\nThe Portuguese manager was axed on Monday, with former United midfielder Fletcher put in temporary charge.\nThe U18s coach faced the press for the first time on the eve of his team’s match at Burnley.\n“It’s surreal,” said Fletcher, who made 342 appearances for the Red Devils and has worked in a variety of different roles for them since 2020, including as technical director.\n“It’s an amazing honour to be able to lead a Manchester United team,” he said. “I don’t even think it was in my wildest dreams that that was something that could potentially happen, even thinking about playing for the club and stuff like that.\n“But to lead out the team is an amazing honour and something I am really proud to do.\n“It’s not (happened) in the circumstances that I expected it to happen, so that obviously is something that doesn’t sit quite easy with me, but I just have to think I’ve got a job to do and I’ve got to lead the team tomorrow and think of the great honour and pride in doing that.”\nThe former Scotland international is expected to remain in place until the club appoints a caretaker boss, with United planning to name Amorim’s permanent successor at the end of the season.\nThe BBC reported that the club had held preliminary talks with Fletcher, Michael Carrick and former boss Ole Gunnar Solskjaer, all ex-United players, about the position of caretaker.\nBut Fletcher, 41, said at his pre-match press conference that conversations with United’s hierarchy had focused on Wednesday’s game and they would talk again after the match.\n- Full-time job? -\nFletcher was asked whether he wanted to try to earn the manager’s job on a full-time basis.\n“Honestly, it’s not something I’ve thought about,” he said. “I’m focusing on Burnley. I think that discussion is for after the game.\n“There has been that much going on and it has all happened so quickly that all my concentration, efforts and thoughts have gone into Burnley.”\nFletcher won five Premier League titles under the management of Alex Ferguson, but the club have not been English champions since 2013.\n“Everyone expects Manchester United to be on the top and winning, that’s the standard, that’s what we all have to try and achieve,” said a bullish Fletcher.\nHe was asked what his United team would look like.\n“Hopefully it looks like a Manchester United team that represents a bit of me, I think in terms of what I know is Manchester United,” he said.\n“So I hope it resembles a Manchester United team that fans can be proud of, that I can be proud of, and I’m sure they will because I believe in the players.\n“I think we’ve got good players and I think we’ve got players who care and I think we’ve got a lot of quality in that team and I hope to give them a platform to go out there to express themselves.”\nFletcher said he hoped to welcome back captain Bruno Fernandes and Mason Mount into a squad badly depleted by injuries and international commitments.\nHe joked that he refused to disclose sensitive information when asked whether his twin sons, Jack and Tyler, would be given full debuts against Burnley.\nUnited are sixth in the Premier League table, three points behind fourth-placed Liverpool.",
  "word_count": 1155,
  "scraped_at": "2026-02-14T02:27:10.767084",
  "_text_extracted": true
}