{
  "article_id": "39225a1aeabd",
  "url": "https://www.irishnews.com/news/business/manchester-uniteds-financial-sums-under-scrutiny-as-new-summer-signings-loom-HSH3WIO3DBFM5GJAOQEZH364BA/",
  "title": "Manchester United financial sums under scrutiny as new summer signings loom – The Irish News",
  "date": "20250608T173000Z",
  "domain": "irishnews.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United released its latest quarterly report last week, with the full-year financial numbers in the coming months expected to further highlight the club’s challenges.\nBut the team’s struggles on the field have already led to a significant decline in the club’s share price.\nIn 2005, the United’s football drama skipped from the back pages to the business pages when the late Malcolm Glazer engineered a takeover financed by a leveraged buyout that involved the American owner heaping a large chunk of his own takeover costs on to the club itself.\nThe takeover also had a local flavour: Glazer swooped when Irish racing billionaires John Magnier and JP McManus decided to sell up their almost 29% stake in the club.\nBut even before the Glazers, United was no stranger to takeover intrigue. Media magnates Robert Maxwell and Rupert Murdoch in different decades had coveted the club. In late 1998, then Labour trade minister Peter Mandelson was forced to refer the Murdoch bid to the UK competition regulator. The thwarted bid reportedly valued United at £623 million at the time.\nTwenty years after the takeover, six descendants of the late Malcolm Glazer control the majority of the club by way of their near 70% voting stake. Since 2005, the once debt-free business has paid £1 billion in interest payments, according to a leading football finance expert, Liverpool University’s Kieran Maguire.\nAnd the legacy of the 2005 debt-fuelled takeover lives on. As of last summer, United carried over £344m in so-called senior secured notes which mature in June 2027, was paying interest on a further £176m in other secured debt, and from time to time is drawing down other loan facilities.\nThe indebtedness means “substantially all” of the club’s properties, including Old Trafford, have been pledged as security, the accounts show.\nIn a deal fully completed in February last year, the Glazers secured a significant pay day by selling a large minority shareholding to Jim Ratcliffe, the British owner of the Ineos oil refining giant.\nThe arrival at Old Trafford of another billionaire business boss has not worked out well so far. Ratcliffe paid $33 a share to acquire the best part of his 29% minority stake, securing nonetheless an outsized control over the ways things are run at Old Trafford.\nA quarterly report published in February, showed the sacking of manager Erik ten Hag “and various members of football staff” cost the club £14.5m.\nThe 15th place finish in the Premier League place and a redundancy programme for 250 relatively badly-paid staff hasn’t helped the image of Ratcliffe. With a £17bn fortune, the oil refinery man is the seventh wealthiest in Britain, according to the Sunday Times Rich List.\nHowever, the shares Ratcliffe bought for $33 each just 18 months ago are trading today at less than $14 a share. The market now values the soccer club at only $2.4bn (£1.8bn), not much higher than the implied valuation when the shares were first listed on the New York Stock Exchange (NYSE) in 2012.\nTwenty years on from the Glazers’ takeover, the control of Manchester United is a matter of some fascination. The business is still registered at Old Trafford but is now owned by off-shore companies incorporated in the Cayman Isles (for the Glazers) and from the Isle of Man (for Ratcliffe). The business is still registered to pay corporation taxes on any net profits, whenever that may occur, to the UK and US authorities, and has some of its shares listed in New York.\nThe United balance sheet is studied in management and accounting courses at English universities, while all things United provide content for speakers at sports and sponsorship conferences across Europe and beyond.\nBut the reason so much is known about the financial workings of the club is thanks to the stringent reporting conditions set by the Securities and Exchange Commission for publicly-listed companies in the US.\nThe ‘A’ shares trading on the NYSE under the ‘MANU’ ticker provide investors with only a fraction of the voting clout that the ‘B’ shares confer to the six Glazer family members and to Ratcliffe. But the listing nonetheless requires the club to publish a wealth of financial information.\nWant to know the rules of UEFA competitions and the broadcasting prize pots across the three European competitions or about the broadcasting payout shared between the 20 Premier League clubs? Consult the Form 20-F annual report filing.\nWant to know how much United will drop under its most lucrative commercial deal for failing to qualify for the Champions League next season? Scan the annual documents.\nAnd if you have ever wondered at the transfer trading losses notched by United over its signing and selling players then look up the annual report for player registrations under Jadon Sancho – who was back in the sports news in recent days.\nFriday’s quarterly report provided more financial information, and the full annual accounts for the 12 months to the end of June covering the 15th place finish in the Premier League will be released in the coming months.\nBut any set of financial results of United reveals that many elite soccer clubs look look a lot like advertising agencies selling ad space and striking sponsorship deals (commercial revenue), tapping television and streaming rights from domestic and European leagues (broadcasting revenue), and getting receipts from tickets and hospitality at their stadiums (matchday revenue).\n- Integration for the GAA, Camogie and Ladies Gaelic Football Associations: What does it mean?Opens in new window\n- The road to the Irish presidency is not an easy one for northernersOpens in new window\n- From Belfast to Cork, US-owned firms reel amid Trump’s market chaosOpens in new window\n- Mixing Irish sport with business to plan new careers at a young ageOpens in new window\n- Irish movie veterans hope Trump tariff threat will be a wake-up callOpens in new window\n- Irish regulators to play major role in reining in harm and hate content on social media sitesOpens in new window\nIn the case of United, total revenues of £662m posted for the 12 months to the end of June 2024 were only slightly higher than in 2023.\nExperts predict that revenues in the current financial year to the end of this June are likely to be slightly lower even as so-called Ebitda earnings – the profits line before United accounts for its hefty interest payments and other costs – could be higher than in 2024.\nIn a different sort of league, the Deloitte Football Money League which ranks European clubs in terms of their annual revenues, United finished fourth in the 2023/24 season, some distance behind Real Madrid which secured top billing with a record €1bn (£840m) in revenues.\nBack in 2005, on the eve of the Glazers’ takeover, United were the second largest European soccer club by revenue, suggesting United has suffered a slow relative decline down the years, benchmarked against its peers.\nBut the bigger picture is easily overlooked: the £662m revenue haul at United would place the business among the lesser valuable companies listed on the Irish Stock Exchange, where it would be dwarfed by some of Dublin’s biggest listed-companies, including Ryanair, which generates revenues measured in the many billions, not millions.\nMost of the elite clubs across Europe will unlikely face the threat of relegation from their respective top flight leagues and can depend on a stable source of revenues regardless of mediocre results on the pitch.\nBut the relatively low revenues and profits generated by most European soccer clubs also show that American, British, UAE, Qatari, and Saudi investors are for the most part injecting their billions into European clubs for other than good business reasons. And, unlike the Glazers, they are unlikely to get large returns for their money.\nLooking more closely at the breakdown, £303m of the £662m in United’s total revenues came from its commercial operations, exceeding the two other main revenue sources of broadcasting and matchday operations.\nSnapdragon-owner Qualcomm, Betfred, Malaysia Air, the Oreo and Cadbury-owner Mondelez, along with TeamViewer and crypto blockchain firm Tezos, were among the roster of “global” sponsors listed by United last summer. Estée Lauder and the Hong Kong Jockey Club were among the club’s “regional” sponsors.\nFor United, the long-running commercial contract with Adidas – the accounts mention the German sportswear firm no fewer than 29 times – is among its most lucrative clients.\nHowever, failure to qualify for the UEFA Champions League goes beyond the hit to United’s broadcasting and matchday revenues, with Adidas paying £10m less to United for a lucrative deal every year the club fails to play in the loftiest UEFA league. The “amended” commercial deal runs to 2035 and starts this coming season, the accounts show.\nAs part of its commercial operations, the club’s retail outlets, merchandise, and the licensing of products “from coffee mugs to bedpreads” helped generate £125m in revenues in the last financial year.\nMeanwhile, United generated £222m and £137m from broadcasting and matchday revenues, respectively.\nUnder broadcasting, the club generated almost £54m from European competitions, the annual accounts show, and £162m from domestic competitions.\nMissing out on all three European competitions next season likely means United loses more ground to its European peers.\nA deep-dive analysis published online last week by Kieron O’Connor at the Swiss Ramble football site suggests that last month’s winners Paris St Germain, along with many other participants, tapped record pay-outs in television broadcasting rights alone from the Champions League.\nSmaller clubs like Celtic and Dinamo Zagreb also had significant paydays from the competition, according to Swiss Ramble.\nSeparately, United’s accounts also put an unwelcome spotlight on another aspect of the club’s record, tracking the poor performance in trading in player transfers.\nHowever, despite the loss of European competition revenue and plans for early summer signings, Maguire at Liverpool University, who is also the co-host of ‘The Price of Football’ podcast, is sanguine about the prospects for United navigating the Premier League’s Profitability and Sustainability Rules.\n“The effect on the business in 2026 won’t be as severe as it may at first appear, and I would expect Manchester United’s cost base to decrease as well as the fact that the revenues are down,” Maguire tells the Irish News.\nUnited finishing 15th this season compared with eighth place the previous year will, however, cost the club around £25m, based on the way the Premier League allocates some of its broadcasting payments to clubs, worth about £3.5m per league position, Maguire says.\n“And not qualifying for the Champions League this season will have hit the club as well, so I expect there to be a downturn in terms of broadcast revenues and that will accelerate next year from not getting anything at all from UEFA,” he says.\nThere are also questions about how the owners plan to finance the £2bn rebuilding of Old Trafford, even as such projects are incentivised under the financial regulation rules for soccer clubs across Europe.\nAnd another question mark remains over whether Ratcliffe, the new minority owner, could in time be minded to support any revised form of a breakaway European Super League.\nThe Glazers were forced to apologise in 2021 after a revolt by fans scuppered initial plans to have United participate in the closed franchise.\nMaguire says the Glazers as majority owners “have done very well” financially from United down the years but remains unconvinced the management skills that minority owner Ratcliffe has borrowed from the petrochemicals industry will work for United. “It has not worked to date,” he tells the Irish News.\n- Eamon Quinn is at eamon.quinnbiz@gmail.com",
  "word_count": 1932,
  "scraped_at": "2026-02-14T01:58:41.951264",
  "_text_extracted": true
}