{
  "article_id": "394032d9022d",
  "url": "https://www.bbc.com/sport/football/articles/cy4pvwgv88qo",
  "title": "Andre Onana : Is Man Utd keeper part of problem or solution for Ruben Amorim ? ",
  "date": "20241213T024500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Is Man Utd keeper Onana part of problem or solution for Amorim?\n- Published\nManchester United have Rasmus Hojlund to thank for digging them out of trouble against Viktoria Plzen on Thursday night, but the spotlight was firmly on goalkeeper Andre Onana after another mistake.\nWith the game goalless, his attempt to pass out to Matthijs de Ligt was intercepted by Pavel Sulc, who swiftly teed up Matej Vydra to score.\nHojlund's double ensured it ultimately did not matter as United secured a vital Europa League victory - but the mistake by Onana was his second in as many games and is arguably a cause for some concern, particularly with rivals Manchester City up next on Sunday.\nHowever, Manchester United captain Bruno Fernandes came out in defence of his team-mate after the game.\n\"It is not about Andre making the mistake, we don't look at individuals here when something happens on the wrong side,\" Fernandes told TNT Sports.\n\"We have huge belief in him. He knows he made a mistake because he is a clever guy, he is going to help us many times and we trust his qualities on the ball.\n\"Mistakes are part of football. If they don't happen then goals don't happen. But we did well to show the resilience to come back and find the victory.\"\nWhat mistakes has Onana made?\nIn the Premier League this season Onana has arguably been one of the best goalkeepers, keeping more clean sheets than anyone else.\nBut his past form for mistakes means any error he does make now swiftly becomes a talking point.\nLast season, he notably made two costly errors as Manchester United drew 3-3 with Galatasaray, a result that ultimately proved too damaging to their hopes of progressing beyond the Champions League group stage.\nAnd, while generally solid so far this term, the error against Viktoria Plzen came just days after a poor display against Nottingham Forest.\nIn that game, he was deceived by a shot from Morgan Gibbs-White, moving to his right despite the effort being struck centrally and flashing past his hand.\nForest went on to win that game 3-2, with ex-Manchester United defender Phil Jones saying at the time Onana should have done better.\n\"He will be disappointed with that. It will be a tough watch,\" said Jones.\n\"It's one of the knuckleball ones, but he should be saving it. He's made a mistake, but he has been one of the better goalkeepers this season.\"\nMost clean sheets in Premier League\n2024-2025\nNot all Onana's fault? How Amorim's system could lead to risky moments\n\"We want to play from the back and everyone knows that then we have to make the right decision on the pitch,\" added Fernandes.\n\"Andre [Onana] thought that Matta [De Ligt] could get on the ball but he missed it and they scored a goal.\"\nUnited are not alone in looking to build their play from the back, with that style of play having been on the rise over the last few years.\nWhen it works, it is a strong way of playing through the press. When it fails, it often fails spectacularly.\nRuben Amorim, like many modern managers, likes possession-based football with the goalkeeper preferred to play short passes rather than hitting it long.\nDe Ligt was identified as a player who might struggle playing Amorim's way and some of the blame for Viktoria Plzen's goal was also directed at the defender.\n\"It's both of their fault,\" former Manchester United midfielder Owen Hargreaves said.\n\"De Ligt doesn't really want it, which is why he goes back, but he's got to go to the ball so they can get it out wide.\n\"Amorim wants his centre-backs to go in there to receive the ball. It's a difficult position to be in.\"\nEx-Arsenal midfielder Karen Carney added: \"For the Viktoria Plzen goal it is a slow ball into the feet of Andre Onana by Lisandro Martinez and what he is then saying to De Ligt is to come short. If they do that he can bounce it out the other side and avoid the high press.\n\"But De Ligt is on his back foot and he doesn't want the ball, he is too slow to react and then it is an error.\"\nHow is Onana comparing to De Gea?\nOnana was brought in by former manager Erik ten Hag in July last year, with the Dutchman replacing David de Gea with the aim of moving towards a possession-based style of play that started with the goalkeeper.\nDe Gea, who was at Old Trafford for 12 years, spent a while out of the game before joining Italian side Fiorentina in the summer.\nComparisons with Onana are to be expected, given the latter was brought in to replace De Gea - even more so with the former Spain goalkeeper, 34, having an excellent season so far, keeping seven clean sheets in 14 appearances.\nHow Onana and De Gea compare\nHe has a better shot save percentage than Onana (80 compared to 67.1) and has yet to make any big errors leading to goals, compared to two for Onana.\nBut De Gea has faced fewer shots (55 to 82), perhaps highlighting the strength of the defence in front of him as Fiorentina sit fourth in Serie A.\nMost crucially in Onana's favour, the United keeper has not only played considerably more passes than De Gea but he has done so at much better accuracy.\nOnana's pass completion stats this season also compare favourably to De Gea's final campaign at Old Trafford, when his accuracy rate was down at 72.6%.\nHis ability on the ball is a key reason why he was brought in 18 months ago - and a key reason why he could still be key for Amorim's style of play.\n\"Onana is one of the best ball-playing goalkeepers,\" added Carney. \"He's better with the ball at his feet than some of the centre-backs at Manchester United, being brutally honest.\"\nRelated topics\n- Published16 August 2025",
  "word_count": 1004,
  "scraped_at": "2026-02-14T01:52:10.157590",
  "_text_extracted": true
}