{
  "article_id": "3944417a939d",
  "url": "https://www.nytimes.com/athletic/6651339/2025/09/23/james-horncastles-serie-a-briefing-pulisic-milan-juventus-roma/",
  "title": "James Horncastle Serie A Briefing : Refreshed Pulisic stars ( again ), Juventus cry foul , divine intervention … of sorts",
  "date": "20250923T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was 0-0 at the Adriatico. An hour had gone by and the visiting coach, Guido Pagliuca, stuck his hand in his pocket. He didn’t pull out a pen with which to note down any tactical insights to pass on to his Empoli players. A piece of gum wasn’t unwrapped and slipped furtively into his mouth as refreshment from the stress of playing Pescara.\nAdvertisement\nPagliuca, instead, thumbed the beads of a rosary, praying for a better result than the 3-1 defeat to Reggiana and 1-1 draw with Spezia he had recently overseen. Within minutes of Pagliuca going to the Big Man, the heavens opened. A goal appeared. Then another and another and another. But Bohdan Popov, the revelation of this season in Serie B, did not run over to Pagliuca in celebration.\nPescara-Empoli.\nMinuto 63.\nIl mister dell’Empoli Pagliuca tira fuori il rosario per affidare la propria sorte all’Altissimo.\nIddio risponde così:68′ 1-0 Pescara;\n71′ 2-0 Pescara;\n80′ 3-0 Pescara;\n92′ 4-0 Pescara.Capolavoro italiano. pic.twitter.com/gZHq4Goy3V\n— La Ragione Di Stato (@ragionedistato) September 21, 2025\nThe four goals did not belong to Empoli’s teenage striker from Ukraine. They hadn’t been scored by any of his team-mates either. They were all for Pescara. The Lord works in mysterious ways and he had forsaken Pagliuca. In the end, his rosary proved about as useful as the holy water Giovanni Trapattoni brought with him to the World Cup in 2002 when Italy were eliminated by hosts South Korea in a game diabolically refereed by Byron Moreno.\nThe devilish Champions League\nIn an age of post-religion in parts of the West, faith remains tactilely and naturally strong in Italian football. “Il diavolo ci mette la coda,” Antonio Conte sighed in the bowels of the Etihad on Thursday night. His Napoli team had been tripped up by the tail of the devil away to Manchester City. In all of last season, a red card had not been flashed once at the Italian champions.\n“That’s how destiny works sometimes,” Conte said.\nHe didn’t dispute the millimetrical decision to send off Giovanni Di Lorenzo for his challenge on Erling Haaland. Conte was merely in a state of disbelief. He thought he had planned for every possible scenario in Manchester, and yet, he had not envisaged taking Kevin De Bruyne off 20 minutes into his homecoming. “I’d thought of everything but that,” Conte shrugged. The devil is in the detail.\nRather than look for sympathy or surrender to their fate, Napoli emerged, even in defeat, with credit. The team bent but didn’t break. It was 0-0 for over an hour. The winger, Matteo Politano, who skippered the team after Di Lorenzo’s expulsion, was emblematic of Napoli’s endeavour, punching the air as if he had scored when a block he made stopped City going in front.\nAdvertisement\nHaaland’s opener, a looping header from a ball Phil Foden chipped over the defence, needed perfect timing and execution. As such, Haaland was able to pass through the eye of a needle. The jinking Jeremy Doku doubled City’s lead but, as Conte said: “It’s one thing to go home with a 2-0 loss and another to concede five or six. The lads applied themselves a lot. We didn’t deserve a disgrace”. And Napoli did not lose face.\nOn the whole, it wasn’t a bad week for Serie A in Europe. Sure, Paris Saint-Germain almost did to Atalanta what they had done to Inter in the Champions League final and perhaps would have been 3-0 or 4-0 up in the first 10 minutes were it not for goalkeeper Marco Carnesecchi. The 25-year-old understudy to Donnarumma may not be the world’s best with his feet, like his national team team-mate, but doesn’t need to be when he’s so good with his hands.\nAs with Napoli, so it was with Atalanta. Defeats away to City and PSG, a couple of state-backed clubs against a pair of family businesses, should hardly be unexpected, and qualification will unlikely hinge on them. Inter’s win in Amsterdam was, by contrast, overlooked and, in many respects, that’s a compliment to a team that has reached two Champions League finals in three years. No one close to the club was taking it for granted, however, after back-to-back losses in the league.\nContrary to public votes of confidence, the bookmakers spent the eve of the game slashing odds on Raffaele Palladino as a prospective replacement for Cristian Chivu. There were doubts about Yann Sommer, arguably the best keeper in the Champions League last season alongside Donnarumma, and a Lautaro Martinez-sized hole in the team at Ajax. None of it mattered as Inter, maturely, silenced their critics.\nThuram headed in another couple of corners, Sommer put his Derby d’Italia fumbles behind him with an excellent one-v-one save, and Pio Esposito, the youngest Inter player to debut in the Champions League since Mario Balotelli, impressed in Lautaro’s place without scoring. In the end, Inter were the only Italian team to win in Europe although Juventus’ comeback against Borussia Dortmund, another high-scoring Serie A special for the Champions League’s entertainment, felt like one too.\nAdvertisement\nA tired Old Lady\nComing only a matter of days after they edged out Inter 4-3 in stoppage time, Juventus went from 4-2 down in the 93rd minute to 4-4 by the 96th at the Allianz. “Pazzesco! Pazzesco!” The co-commentator Giancarlo Marocchi cried on Sky Italia. Madness. Madness.\nLloyd Kelly had not scored for Juventus up until last weekend. This prompted his coach Igor Tudor to come out in support of a player maligned for not being Dean Huijsen, who was sold prematurely by former sporting director Cristiano Giuntoli. After a belatedly catching a break, the Englishman handled the ball against Dortmund and gave away what felt like a decisive penalty. The game seemed over at 4-2 in the 86th minute.\nAnd yet it was Kelly who, 10 minutes later, headed home the equaliser with a swift act of redemption. The improbable goal remarkably did not make him a hero. Once again, Kenan Yildiz stole the headlines for scoring a carbon copy of Alessandro Del Piero’s goal against the same opponent 30 years ago. The others went to Dusan Vlahovic who, as was the case against Parma and Genoa, made a devastating impact from the bench.\nWere the Gods smiling on Juventus or have they been dancing with the devil? Well, the music stopped in Verona on Saturday and maybe it shouldn’t have come as a surprise. The start of the season always hurls a trio of underestimated challenges for coaches. The first is playing games while the transfer window is open, a time when teams are incomplete, players distracted and coaches exasperated. The second is the first international break. The 10-day rhythm-breaker. The late-to-training South Americans. All the injuries.\nThe third is exclusive to the elite. It’s when European football starts up again. How will the team cope with three games a week? Juventus, in this regard, looked exhausted and understandably so after their involvement in back-to-back thrillers. The Bianconeri dropped points for the first time this season in a 1-1 draw, having got themselves in front thanks to another goal from outside of the box, this time from Francisco Conceicao.\nThe game was not without controversy, either. Verona’s equaliser came from the spot after a soft handball was awarded against Joao Mario. The scorer, Gift Orban, should arguably have been sent off too for a forearm on Federico Gatti. “They’re two incredibly bad decisions,” Tudor said. “Shameful stuff.” Italy’s equivalent of the PGMOL agreed with him and demoted the referee Antonio Capuano to the second division.\nAt San Siro, Chivu also needed to make the sign of the cross in the final 10 minutes. His team were 2-0 up although Sassuolo’s goalkeeper Arijanet Muric, formerly of Man City, and on loan from Ipswich Town, kept the visitors in the game long enough for Walid Cheddira to latch onto a sublime pass from Domenico Berardi and make things nervy. Still, a fatigued Inter just about held on.\nSaint Christian\nBy far the best performance of the weekend came from a team begrudgingly not in Europe. Since losing to promoted Cremonese on opening night, Milan haven’t stopped winning. Banned from the touchline following his ejection against Bologna, Max Allegri watched the game against Udinese from up in the gods at the Blue Energy stadium. The most successful coach active in Serie A appears omnipotent once again.\nAdvertisement\nStill,without Rafa Leao, the Portugal forward’s absence has gone unnoticed. Christian Pulisic’s summer off brought him a lot of heat back home in America, but it has clearly done him the world of good in a World Cup year. He received another man of the match award on Saturday and bashfully told DAZN “I don’t know, I’ve maybe got 10” of them at home now. His double in a 3-0 win made it four in five appearances, that’s a goal every 64 minutes, and they caused a psychedelic reaction from Milan’s in-house commentator Mauro Suma.\n⚽ 39′\n⚽ 53′ @pulisic was ruthless in #UdineseMilan 💥 pic.twitter.com/E0rlJ9ofMf— Lega Serie A (@SerieA_EN) September 21, 2025\nOnly Lautaro has combined for more goals and assists since Pulisic moved to Serie A and yet Leao, no doubt because of his role in Milan’s last title, the vastness of his potential and willingness to flash a smile every now and then, remains the bigger star in Italy. Greater tests await Milan, notably at home to Napoli and away to Juventus in the next fortnight, but their defensive numbers, in terms of xG (expected goals) against and shots allowed, are, for now, in this very small sample size, the very best in Europe.\nOften accused of being archaic and deploying tactics old enough to be from the old testament, the second coming of Allegri is upon us. That is, at least, according to Corriere dello Sport, whose editor, an Allegri acolyte, noted how Arsenal-Man City was a game in his image, with Pep Guardiola taking Foden off for a defender, then Haaland for a holding midfielder and playing 7-3-0. By the time the final whistle was blown, eight centre-backs were on the pitch. It was a catechism in catenaccio.\nRedemption in Rome\nBless me father, for I have sinned. I have neglected to mention the Rome derby. It was not as memorable as last week’s Derby d’Italia and rarely is for two reasons. With only five Scudetti between them, the success or failure of a season in the capital is often judged by the outcome of these games, and the continued presence of homegrown players heaps even more tension on top of it.\nArguably, no club in Europe outside of Bilbao and Barcelona prides itself on bringing through players and handing them the armband like Roma. There is an expectation of dedication like few places on the planet. Francesco Totti spent his entire career at the club, turning down Real Madrid. Agostino Di Bartolomei and Daniele De Rossi would have done the same had the owners not phased them out.\nMuch of the focus is on the adulation these players receive. Little is on the pressure or the way the crowd can turn on its own. Take, for instance, the time Totti threw his shirt into the Curva Sud after a win over Fiorentina in 2009 only for the ultras to throw it back. Skipper Lorenzo Pellegrini has found himself in the eye of a similar storm for the last 18 months.\nWhen Roma went through three coaches in 2024, some of the fans looked at the results and mused that the managers change but the disappointing scorelines remain the same. The one constant was the senior players, who, all of a sudden, faced the wrath of the supporters. As a local, Pellegrini felt it even more than outsiders like Bryan Cristante and Gianluca Mancini. Life had become particularly complicated when Il Messaggero, one of the Rome papers, claimed Jose Mourinho had felt so betrayed by his dressing room leaders in the hours following his dismissal that he had taken off the ring they had gifted him after the Conference League final in 2022 and left it, pointedly, in Pellegrini’s locker.\nAdvertisement\nSubsequent coaches, including fellow Romans like De Rossi and Claudio Ranieri, stood up to the fans and tried to make it clear that Pellegrini is and will always be one of them. He had betrayed nobody. And yet the biting criticism has only fleetingly relented. Injury-prone because of the kicking he gets between the lines, Pellegrini’s often sarcastically told to grit his teeth. Very well paid, his last contract was agreed after Mourinho, still an idol of Roma fans, said he’d love to coach a team of 11 Pellegrinis.\nWhen Ranieri pulled Roma out of crisis last winter, one of his first moves was to take him out of the firing line. The boos every time Pellegrini touched the ball contributed to an already toxic atmosphere. Out of nowhere, Ranieri then brought him back for the derby and was rewarded with the opening goal in a 2-0 win.\nHistory repeated itself at the weekend. Pellegrini had not played once under Ranieri’s hand-picked successor Gian Piero Gasperini. He had been left out in the cold. Right now, Roma do not seem prepared to extend the 29-year-old’s contract unless he takes a significant pay-cut. A move did not materialise in the summer. Therefore every press conference has, often to Gasperini’s exasperation, involved several questions about Pellegrini’s future. Is he in the squad? When will he play? It didn’t look like happening soon.\nThen, Stephen El Shaarawy turned his ankle and Paulo Dybala tore a muscle. Leon Bailey still isn’t fit and the failure to sign Tyrique George from Chelsea on deadline day hurt. Gasperini had little choice but to turn Pellegrini who ended up scoring the only goal of the game, his fourth in the derby. It should have been a moment of euphoria.\nBut a Roman scoring for Roma in the Rome derby could barely bring himself to celebrate. Pellegrini stood still, raised his hands to the sky and bowed his head. When full-time came, he blew a kiss to the Sud. “One thing remains constant,” Pellegrini said. “I love Roma.” Salvation for him, on the one hand. Damnation for transfer-embargoed Lazio on the other, who have now lost three in four, not to mention Fisayo Dele-Bisharu to injury, and Reda Belahyane and Manuel Guendouzi to suspension following their red cards.\nMaurizio Sarri is more in need of a rosary than even Pagliuca.\n(Top photo: Pulisic after scoring away to Udinese. Emmanuele Ciancaglini/Getty Images)",
  "word_count": 2436,
  "scraped_at": "2026-02-14T02:26:56.623532",
  "_text_extracted": true
}