{
  "article_id": "394c79883a67",
  "url": "https://gulfnews.com/business/analysis/manchester-citys-unparalleled-run-is-more-than-just-about-money-and-talent-1.96455370",
  "title": "Manchester City unparalleled run is more than just about money and talent",
  "date": "20230617T073000Z",
  "domain": "gulfnews.com",
  "source_country": "United Arab Emirates",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "COMMENT\nCombining funds with generational talent is what makes for football club’s golden run\nLast updated:\n6 MIN READ\nIn the interest of full disclosure, I must state that I am a Manchester United fan. Or at least I was.\nUp until the cultural shift in English football’s biggest club following Sir Alex Ferguson’s departure and the poor treatment of Cristiano Ronaldo after his return. Given that the northwest of England and city of Manchester specifically is commonly viewed as the heartland of English football, it surprises me today to note that I wasn’t even fully aware of Manchester City’s existence until relatively recently.\nThey are certainly harder to miss these days.\nYet, the Manchester City Football Club – or ‘Man City’ – is one of the UK’s oldest clubs. With a history dating back 143 years, the Sky Blues set a new standard in Istanbul this month by winning their first ‘treble’ of trophies, only the second English club ever to do so. And in the process secured their first seismic Champions League victory.\nIn pipping Arsenal and cross-city rivals Manchester United to win the Premier League and FA Cup earlier in the season, Rodri’s 68th-minute goal against Inter Milan elevated Man City into the elite ranks of just seven other clubs to achieve the accolade since Celtic’s pioneering treble in 1967.\nThis trophy has of course been a long time coming. Among the legions of football fans I’ve spoken to in person and online it seems everyone has a different opinion on how they did it.\nWithout a doubt the club today is arguably the most well run in the world. They have a world-class manager in Pep Guardiola, huge financial resources, squad depth, and a serious focus on youth development, infrastructure and tactical ability. The vast majority of clubs could be forgiven for looking upon Man City and feeling a touch of envy.\nWe should remember that very few of these factors were real until recently. And specifically 2008, when the club was purchased by Abu Dhabi United Group.\nA little bit of history. After a period of financial uncertainty under the previous administration, a series of high-profile signings followed, including a record-breaking 32.5 million pound transfer for Real Madrid’s Robinho, galvanising the club’s performance in the process and enabling them to reach the UEFA Cup semis the same season.\nThe signings of pedigree forwards Emmanuel Adebayor and Carlos Tevez quickly followed and the new owners also hired Inter Milan manager, Roberto Mancini, who pushed the club up to an unprecedented fifth in the Premier League while securing a place in the UEFA Europa League.\nBy 2011, Man City was comfortably recognised as a league contender, reaching its first FA Cup Final in thirty years before clinching the Premier League title in 2012, in what is widely recognised as one of the greatest final days in the league’s history. They firmly established themselves as league toppers in the following seasons, securing the League Cup and Premier League titles in the 2013–14 season, with a second League Cup in 2016.\nHowever, the next major shift in the club’s performance came in the same year with the arrival of Pep Guardiola.\nEquipped with an intimidating track-record including being the youngest manager to win the UEFA Champions League, and the most consecutive league games won in La Liga and the Bundesliga, Guardiola’s move to City was seen as inevitable by many. According to AFP Sports, before the official announcement, Sheikh Mansour bin Zayed Al Nahyan, Vice President, Deputy Prime Minister and Minister of the Presidential Court, and the owner of the City Football Group sees in Guardiola a coach capable of bringing dazzling football to the Etihad Stadium and, crucially, helping the club make a long-awaited breakthrough in the Champions League’.\nThey weren’t wrong.\nWith a reputation for detail as formidable and legendary as his silverware collection, Guardiola brought with him a razor-sharp focus on tactical innovation and player development. The stylish Catalan has crafted a persona as a maverick and somewhat of a ‘mad scientist’, always experimenting and improvising, while retaining his possession-based style of play centred on quick passes and positional interchanges. With the right players and unwavering support of the Club’s Chairman, Khaldoon Al Mubarak, he was now unstoppable.\nWith star quality like Sergio Agüero, İlkay Gündoğan, Vincent Kompany, Kevin De Bruyne, David Silva, and more recently Erling Haaland and Jack Grealish, Pep Guardiola’s Man City has unquestionably dominated English football. He has delivered five Premier League titles in six years, a domestic treble in 2019 and a record-breaking 100-point season in 2017–18, and his remains the only team to do so in the modern era. Man City’s quest for a Champion’s League title was finally fulfilled in 2023, however, it’s true victory goes deeper.\nIndisputably, the club’s ability to attract the right managers and players has taken Man City far, however, it is the club’s decision to cultivate talent which is now paying dividend.\nThis was a pledge made by Sheikh Mansour, who committed to nurturing talent by creating a sustainable youth development programme.\nHaving revamped the youth academy during the 2013-14 season, the club’s 160 million pound investment in the recently completed City Football Academy has provided both a central location to train the Man City stars of the future as well as a concentrated pool of local talent.\nA good example is Phil Foden, who rose through the City academy before going on to become a first-team regular and securing four Premier League titles – all before his 22nd birthday. The academy isn’t just feeding top talent towards Man City, but to other clubs, not only providing a massive opportunity for players, but helping to offset the club’s transfer fees while enhancing the wider standards of regional football.\nThe club has reportedly raised over 45 million pounds as of July 2022, while retaining buy-back clauses in the majority of sales thereby protecting its long-term investments as each player gains maturity and experience.\nThere are of course cynics who only credit Man City’s performance on ‘Arab Money’. This is short-sighted. When looking at recent data, Man City barely scraped the Top 10 in terms of its five-year net spend, ending the 2022-23 season in the black by 8.3 million pounds.\nPut in context, Man City’s total five-year spend is half that of Premier League runners-up, Arsenal, whose net-spend balance for the 2022–23 season put the club 148.94 million pounds in the red.\nIn a week which included another sporting triumph - with the Denver Nuggets securing its first NBA Championship in a convincing 4-1 series against the Miami Heat - there are obvious parallels. With both head coach Michael Malone and now MVP player, Nikola Jokić starting at roughly the same time, the club has since cultivated a seriously talented team who are at the beginning of their careers, with the outlook suggesting they could be the team to beat for some time to come.\nIn both cases, the doubters have been silenced and the permanency of victory endures.\nIt seems that Man City’s focus on playing the long game has paid off at almost every level. By harnessing the existing passion of a sport which echoes around the globe, the club has succeeded in finding the very best people from forwards to physios, while training and upskilling a new generation to learn and succeed in the future.\nIn so doing, the Manchester City brand has quadrupled its fanbase to 38 million since 2010 and in the 2016–17 season became the first premier league club to reach one million YouTube subscribers. Man City is ranked as fifth on Forbes World’s Most Valuable Soccer Teams, worth an estimated $4.99 billion.\nHaving bought the club for a relatively paltry 210 million pounds in 2008, Abu Dhabi United Group have every reason to celebrate.\nReplete with nine League titles, eight League Cups, seven FA Cups, six FA Community Shields, one European Cup Winners’ Cup and a Champions League title, there is no doubt Man City has earned its place amongst football’s elite.\nWinning is now no longer a surprise, but an expectation.\nUp Next",
  "word_count": 1356,
  "scraped_at": "2026-02-14T01:50:37.807412",
  "_text_extracted": true
}