{
  "article_id": "39d292bed028",
  "url": "https://www.kingfut.com/2025/01/05/salah-my-childhood-idol-is-ronaldo-el-fenomeno/",
  "title": "Salah : My Childhood Idol is Ronaldo El Fenomeno",
  "date": "20250104T234500Z",
  "domain": "kingfut.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In a recent interview, Mo Salah reflected on his childhood idols and discussed the balance between scoring and assisting among other topics.\nIn a recent interview with TNT Sports, Mohamed Salah was asked about about many topics regarding his career trajectory, his relationships on and off the pitch and his football idols growing up.\nWhen the Liverpool forward was asked who his favorite player was when he was growing up, his response came without hesitation, “Ronaldo [El Fenomeno], for sure. But also Zidane. But the first one that always comes to mind is Ronaldo.”\nSalah’s on-field numbers are of course exceptional, especially for a winger, he delivers the goal tally of a striker and contributes assists like a creative midfielder, which would explain how his game has been clearly influenced by his aforementioned idols.\n“He’s always trying to sort out any little mistakes. He doesn’t have an ego that’s harmful to the team. If things aren’t working well, he changes it.”\nDuring the interview, he was asked which brings him more joy in term of goal contributions, “What gives me more pleasure is a goal. But also, sometimes assists give me more joy, like against Man City when we beat them. The assist I gave against Fulham when we were one goal down, I was celebrating like crazy because it was very important. So, it depends on the moment. I will never always pick the goal more than the assist because it depends on the moment and what it meant for the team. Sometimes passing is more important than shooting.”\nSalah also discussed life under manager Arne Slot, admitting that while he was initially unsure of what to expect, “Am I surprised? Yes. Well, before I worked with him, I didn’t expect that. But once I started working with him, I’m not surprised anymore because I’ve seen how how he focuses on details. He’s always trying to sort out any little mistakes, sometimes during the game, sometimes at halftime, sometimes at the end of the game. He doesn’t have an ego that’s harmful to the team. If things aren’t working well, he changes it.”\n“I feel like I just want to win, especially the Premier League, more than the Champions League this year.”\nHe also praised the manager’s communication with the squad, “He likes confrontation, which is good. He’s very honest. He tells you things straight to your face. I think it’s very important for a player to know what the manager wants, and he really explains it very well.”\nMoreover, Salah hailed Slot’s tactical adaptability, “He’s very good tactically. He tries to adjust tactics according to what will work against each team we are facing. So hopefully, we carry on like this.”\nThe interviewer also made sure to ask Salah whether he considers himself as the world’s best player, a question most professional athletes tend to dodge. The Reds’ forward replied, “I always see myself as the best, and I’m trying to give my best for the team and for myself as well.”\nBut he also highlighted that collective achievements are more important to him than individual ones, “I used to go crazy for [individual awards]. Now, it doesn’t drive me anymore. I feel like I just want to win, especially the Premier League, more than the Champions League this year.”\nThe interview closed with a more personal question about who Salah considers his closest friend in the sport, to which he gave a reply that would surprise many, “One best friend in football; Eden Hazard. We’re very good friends. When we see each other, we have so much fun.”\nThe two have been more often than not, a hot topic of comparison among pundits and fans alike. Yet, despite previously competing at the highest level, the Belgian star and the Egyptian king shared a brief spell together at Chelsea, and their friendship seems to have endured beyond their club allegiances and constant comparisons.",
  "word_count": 655,
  "scraped_at": "2026-02-14T01:55:04.578564",
  "_text_extracted": true
}