{
  "article_id": "3a3245878547",
  "url": "https://www.masslive.com/tv/2025/04/where-to-watch-detroit-pistons-vs-oklahoma-city-thunder-free-nba-live-stream.html",
  "title": "Where to watch Detroit Pistons vs . Oklahoma City Thunder free NBA live stream",
  "date": "20250402T233000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The team with the best record in the NBA hosts the team with probably the most surprising rise up the standings on Wednesday, April 2 when the Oklahoma City Thunder welcome the Detroit Pistons to the Paycom Center in Oklahoma City.\nThe game is scheduled to start at 9:30 p.m. EDT and will be broadcast on ESPN and ESPN Deportes. Fans looking to watch this NBA game can do so for free by using DirecTV Stream, which offers a free trial, or FuboTV, which also offers a free trial and up to $25 off your first month. SlingTV doesn’t offer a free trial but has promotional offers available. ESPN+ plans are currently at $11.99 a month or $16.99 a month if you bundle with Hulu and Disney+.\nThe Thunder are 63-12 and have already clinched the top spot in the West. OKC is still looking to clinch the top spot for all the playoffs and with the Cleveland Cavaliers at 60-15 entering the day, it won’t take too much to secure home court through the NBA Finals, but it is not a guaranteed just yet. However, if they continue with this 10-game winning streak, the Thunder are sure to secure the league’s best record.\nThe Pistons are coming off a loss, but at 42-33 they are fifth in the East and are likely to be the next team in the conference to clinch a playoff spot. Detroit is two games back of the Indiana Pacers and home court in a first round matchup between the squads, but it is also only one game ahead of the Milwaukee Bucks in sixth and what will likely be a playoff matchup with the New York Knicks.\nWho: Detroit Pistons vs. Oklahoma City Thunder\nWhen: Wednesday, April 2 at 9:30 p.m. EDT\nWhere: Paycom Center in Oklahoma City\nStream: FuboTV (free trial); Sling; DirecTV Stream (free trial); ESPN+\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nMore College Football\n- 2026 CFP National Championship: Watch Miami vs. Indiana for free tonight\n- Where to watch Miami vs. Indiana National Championship free stream today\n- Ticket costs surge for Miami vs. Indiana college football championship game\n- Where to watch Oregon vs. Indiana Peach Bowl free stream today: College Football Playoff Semifinal\n- Where to watch Oregon vs. Indiana in Peach Bowl for free tonight\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programing like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nRELATED CONTENT:\nHardwood is basketball’s longtime foundation. A German company would love to change that to glass\nBy AARON BEARD AP Basketball Writer\nChris Thornton loves talking about playing basketball on the most fragile-sounding of surfaces: glass.\nThornton is managing director of the Americas division of ASB GlassFloor, a German company building floors made of fused-together layers of safety glass covering LED panels. The courts are a far more dynamic visual feast, with customized playing lines, logos, colors, animated graphics and advertisements for multiple sports.\nIn basketball, where wood is still king, Thornton sees growth potential for glass courts — already showing up in the NBA and internationally — as a tech-driven alternative to the sport’s long-running hardwood foundation.\n“I use this analogy a lot: We’re at the initial stages of the iPhone being launched,” Thornton said. “Way back when Apple did that, the design of the hardware has changed, but more importantly the original iPhone was just a phone, a text device and music player. Now you’re running your entire life and communicating to the world on it. I see this in the same regard.”\nBut it’s glass!\nIt seems strange at first blush — big, strong athletes jumping and running across a court of glass while “pounding the rock” and even diving on the floor. That is a future ASB GlassFloor company envisions, citing technology improvements allowing for a safe and viable surface featuring stunning visuals that can be changed with a few swipes and taps of a smartphone or tablet app.\nThornton said the glass surface has give and flexibility exceeding that of wood, aided by a spring-action design to the aluminum and steel framing beneath the LED paneling. There’s also a ceramic coating with dots etched into the glass, offering grip, and a consistent surface without “dead spots” or other quirks that can occur with wood courts.\nThat combination has the company touting enhanced safety potential for athletes, even in more easily spotting sweat to wipe up.\n“There’s a stigma about the glass: ‘Oh my gosh, it’s going to break, it’s harder, people are going to break the glass, they’re going to fall through it,‘” Thornton said. “It’s actually quite the opposite.”\nThe visuals are the bigger selling point. Arena managers could easily update a court’s look instead of using space storing hardwood stacks for multiple designs and paying for labor to install or update them. Or coaches could set up their own practice regimens with on-court visual cues.\nAnd yes, a team could even opt for a hardwood-panel look in a nod to tradition.\nThe trade-off? A bigger price tag than a wood counterpart. Thornton didn’t specify an amount but pointed to potentially selling leases to the courts, saying the company has had “advanced” talks with college teams and leagues.\nAt Connor Sports, a Michigan-based company that makes the hardwood courts for the men’s and women’s Final Four, technical director Jason Gasperich referenced that higher cost. He noted that roughly 750 of the 800 courts his company typically builds and sells per year might end up in elementary and high schools “where they just don’t have the budget for that.”\nStill, he also gave a tip of the cap to the technology.\n“Nonetheless, they’re still super interesting, unique,” Gasperich said. “And there’s things you can do with digital that you can’t do with a traditional wood floor.”\nGetting looks\nGlass LED courts are already in home arenas for Bayern Munich in Germany and Panathinaikos Athens in Greece. They’ve also been used in events by governing body FIBA.\nIn the U.S., Kentucky used one in October for its “Big Blue Madness” event marking the ceremonial season start for Wildcats basketball.\n“I love everything about the versatility of this floor,” men’s coach Mark Pope said in video posted by ASB GlassFloor capturing reactions as players tested it out in Rupp Arena.\n“I don’t know what I was expecting, but it squeaks like a real basketball court,” women’s player Cassidy Rowe said in the video. “It just functions like a normal basketball court, but it’s showing our picture, which is crazy.”\nThe NBA offered a showcase look during the 2024 NBA All-Star weekend, holding its skills competition, 3-point contest, dunk contest and shooting matchup between Stephen Curry and Sabrina Ionescu on one in Indianapolis.\nBy December, the company had set up a training facility in Orlando allowing NBA teams in town to play the Magic a chance to workout on the glass court and offer feedback. Thornton, who said the NBA has bought a minority stake into the company’s Americas division, estimated more than 100 players and coaches have tested it so far.\n“As we integrate with the other data providers in both the NCAA and NBA, we are only going to get better and better with what improving what you can do on an ASB GlassFloor,” he said. “The focus now up to today has been getting a surface that is comfortable for the athletes to play on, and we’ve done that.”\nThe Associated Press contributed to this article",
  "word_count": 1515,
  "scraped_at": "2026-02-14T02:26:33.624613",
  "_text_extracted": true
}