{
  "article_id": "3a40f46da74f",
  "url": "https://www.geosuper.tv/latest/28124-julian-nagelsmann-named-as-germanys-head-coach-ahead-of-euro-2024",
  "title": "Julian Nagelsmann named as Germany head coach ahead of Euro 2024 - Football Leagues",
  "date": "20230922T174500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nSeptember 22, 2023\nFormer Bayern Munich boss Julian Nagelsmann has been appointed as the head coach of Germany's football team ahead of Euro 2024, the German Football Association (DFB) announced on Friday.\nThe 36-year-old succeeds Hansi Flick, another former Bayern manager, who was sacked by DFB following the team's poor performances.\nGermany is the host of Euro 2024 which will be played from June 14 to July 14 during next year's summer.\nThe four-time World champions don't want to have a disappointing tournament in front of their home crowd which is why Nagelsmann has been given the responsibility of turning Die Nationalmannschaft's fortunes.\n\"We have a European Championship in our own country. That's something special - something that happens every few decades,\" said Nagelsmann.\n\"I have a great desire to take on this challenge. We will be a close-knit group next year.\"\nEver since recording their fourth World Cup win in 2014, Germany have been a disappointment in international competitions, although in Euro 2016, they reached the semi-final but were handed a 2-0 defeat by France in the semi-final of the tournament.\nSince then, they had back-to-back group stage exits in the World Cup 2018 and 2022. Meanwhile, in Euro 2020, which was played in 2021 due to COVID-19, Germany could only go as far as the round of 16 stage, where they lost to England.\nNagelsmann's first assignment with his new team will be a friendly against the United States on October 14, where he will look forward to getting off to a flying start.\nIt must be noted that Nagelsmann was sacked by Bayern in March 2023 which came as a surprise to everyone since his side was in excellent form and had not lost a single game in the UEFA Champions League (UCL).\nAfter being sacked, the 36-year-old did not take any other job and remained a free agent even though he was approached by top football clubs like Paris Saint-Germain, Chelsea and Tottenham.\nApart from the 36-year-old, Liverpool's Jurgen Klopp also emerged as a top contender for the German national team's job but he denied all the reports saying that he is contract with the English club.",
  "word_count": 364,
  "scraped_at": "2026-02-14T02:07:14.750059",
  "_text_extracted": true
}