{
  "article_id": "3a46d7b9ff12",
  "url": "https://english.aawsat.com/sports/5027060-new-champions-league-format-starts-next-season-how-will-it-work",
  "title": "New Champions League Format Starts Next Season . How Will it Work ? ",
  "date": "20240603T030000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What is the new format?\nThe group stage is no more. Instead of 32 teams being divided into eight groups, 36 clubs will form a single league. Each side will play eight matches – two more than under the previous concept – against eight different opponents, four at home and four away. The top eight after the first phase will automatically qualify for the last 16, those placed ninth to 24th will face a two-leg playoff to progress, and the bottom eight will be eliminated, sending them out of Europe because they will not drop into the Europa League.\nThe teams will initially be divided into four pots, based on Uefa seedings. Each participant will play two teams from each pot, one at home and one away. This, in theory, will offer greater possibility for the lowest-ranked teams to reach the knockout stages because they will face two sides of similar quality. Previously they were in a group with three teams from higher pots.\n-How will the playoffs and knockout phase work?\nThe teams finishing ninth to 16th will be seeded in the playoff draw, meaning they will face the teams placed 17th to 24th and will – in principle – get the second leg at home. In the last 16 the teams who automatically qualified will be seeded and will each face a playoff winner.\nKnockout games will continue to be played over two legs but for the first time clubs will be able to plot their route to the final once the last-16 draw has been made. The draw from that point would resemble that of a tennis Open with the top two sides from the league phase unable to face one another until the final, although the fine details of how this will be accomplished are still in development. The final will remain the only game not played in midweek.\nHow long will it take?\nMore games means the league phase will not be completed before Christmas, forcing each team to play twice in January. The timings of the knockout games remain similar but if a team goes through the playoffs to reach the final, they will end up playing 17 matches. This year’s finalists will have played 13 times each.\nWhere will Uefa find four more teams?\nThe two countries whose clubs produced the best collective performance in Uefa tournaments this season – Italy and Germany – will each receive an additional place, described by Uefa as European performance spots. Before this season it was decided that one league phase place would go to the club that finishes third in the country highest on the coefficient list that did not have four guaranteed entrants – the fifth-placed nation, France. The other spot will come via qualifying. Usually four clubs enter through the champions path but instead it will be five.\nWhat’s the knock-on effect in England?\nIn the Carabao Cup, the Champions League and Europa League clubs will be seeded for the first time to keep them apart to help with fixture congestion. These teams will enter in the third round, to be played over two weeks in September that coincide with designated weeks for European football. The Champions League plays in week one and Europa League in week two of the fortnight assigned for the Carabao Cup third round, meaning if, for example, Manchester City drew Manchester United, finding a date for the fixture would be impossible. Previously, European games were allotted six midweeks between September and December but this will be stretched to 10 midweeks up to January.\nThere is a potential issue when the Carabao Cup fifth round commences that Chelsea, if they reach that stage, would have a Conference League fixture in the same midweek. The FA Cup has no replays from the first round onwards to free up space in the calendar.\n- The Guardian Sport",
  "word_count": 645,
  "scraped_at": "2026-02-14T02:10:54.436701",
  "_text_extracted": true
}