{
  "article_id": "3a82acacf701",
  "url": "https://www.90min.com/features/florian-wirtz-potential-destinations",
  "title": "Florian Wirtz potential destinations",
  "date": "20240425T001500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Florian Wirtz potential destinations - ranked\n- Florian Wirtz has attracted transfer interest from Europe's elite\n- Wirtz inspired Bayer Leverkusen to their first ever Bundesliga title\n- Leverkusen have slapped a monster price tag on their creative talisman\nFlorian Wirtz's journey from precocious teenager to Bayer Leverkusen immortal has been far from plain-sailing.\nA devastating ACL tear suffered in March 2022 threw the concept of linear development out of the window. Having made such a promising start to his senior career, Wirtz would have to reset upon his return.\nThe German's comeback was complete less than a year later, and while there was no room for linear growth, Wirtz has since enjoyed an exponential boom. Little did everybody know that when they were tuning into some lockdown Bundesliga football in May 2020, the 17-year-old kid who wasn't Kai Havertz (the Arsenal star scored a brace on Wirtz's debut) would inspire Die Werkself to their maiden league title less than four years later.\nWirtz's remarkable resurgence in the wake of a potentially career-hindering injury was timed perfectly with the arrival of Xabi Alonso, and the Leverkusen duo will sit among the most in-demand player/coach prospects in the game while they remain at the BayArena.\nAlonso has committed his future to the German club for at least another year, and Leverkusen will hope their talismanic on-pitch genius remains, too. Europe's elite are circling, but only a monster offer will draw the club to the negotiating table.\nWhile a departure currently seems unlikely, here's how 90min ranks Wirtz's potential summer destinations.\n7. Barcelona\nBarcelona are said to be a part of the reported Wirtz sweepstake, but they're going to have to do a whole lot more than mere lever pulling to finance a move.\nA 2023/24 campaign of woe has thrust the club into a rethink, but Xavi may well end up remaining in charge despite announcing his decision to step down following the season's conclusion.\nBarca are reportedly trying to get players off their books, including Frenkie de Jong, but even if they're successful, a move for Wirtz is off the table given Leverkusen's demands.\nLikelihood rating: 1/10\n6. Manchester United\nManchester United are entering a new dawn with INEOS and Sir Jim Ratcliffe at the helm. A summer of change is expected at Old Trafford, with savvier recruitment at the forefront of Ratcliffe's revolution.\nSigning Wirtz would be a statement addition and a half for the new ownership group to make.\nAnd while United would likely be able to finance a move for the German sensation, Wirtz isn't going to switch Champions League-bound Leverkusen for a club that won't be competing in Europe's premier club competition next season.\nLikelihood rating: 3/10\n5. Real Madrid\nFlorentino Perez is entering his second Galactico era.\nWhile the first proved a commercial triumph, Real Madrid's outlandish playing talent failed to bring home consistent silverware.\nAfter signing Jude Bellingham last summer, Kylian Mbappe is set to join the club this summer and forge a destructive relationship with Vinicius Junior in Madrid's frontline.\nFinding room for Wirtz is hard given Bellingham's form, Federico Valverde's rise, and Toni Kroos' perpetual majesty, so it's hard to envisage Madrid moving for the German despite his talent.\nWhile Madrid are a financial behemoth and you can never write Perez off for making such a move, it wouldn't make much sense to bring in a player of Wirtz's profile this summer.\nLikelihood rating: 5/10\n4. Liverpool\nIs Arne Slot going to take on the impossible task of succeeding Jurgen Klopp at Liverpool? It sure looks that way.\nSlot is a 4-2-3-1 lover and Liverpool are currently without an out-and-out number ten. Dominik Szoboszlai is perhaps the most suited to the function, but Wirtz would bring craft and guile which the Hungarian lacks.\nThe Reds did a fine job of rebuilding their midfield last summer, with Klopp's new-look engine room playing a key role in their title charge. Would they go big in the middle of the park again this summer?\nWirtz is doubtlessly a profile Michael Edwards and co must appreciate, but this would've been much more likely had Xabi Alonso taken on the managerial role at Anfield.\nLikelihood rating: 6/10\n3. Arsenal\nMikel Arteta has hinted at a busy summer transfer window, with Arsenal boasting several disposable assets which could fetch them some cash.\nArteta harbours great ambition and the club are expected to make a couple of major moves ahead of the 2024/25 campaign. The addition of two forwards - a striker and a winger - seems to be their priority, but Arsenal will also rejuvenate their midfield depth chart.\nWirtz, a masterful between-the-lines playmaker with a penchant for goal, could perform a free-eight role in Arteta's system, marauding in tandem with Martin Odegaard either side of Arsenal's new number nine.\nPerhaps Kai Havertz could have a word?\nLikelihood rating: 7/10\n2. Bayern Munich\nUh oh.\nYou know what usually happens when Bayern Munich start sniffing around the Bundesliga's finest talent...\nBayern may have relinquished their crown for the first time in over a decade, but they remain Germany's top dog by a vast distance. Reports suggest that Wirtz's signing could be the club's priority this summer, with Bayern potentially overseeing a rather drastic reshuffling of their playmakers.\nSerge Gnabry and Kingsley Coman both face uncertain futures, while Thomas Muller doesn't plan on playing beyond 2025. Bayern already have one of the world's best in Jamal Musiala, and it'd be borderline unfair to have Wirtz working in tandem with the tight-spaces maestro.\nHow they'd operate as a pair would be up to the new manager to decide, but there's no doubt that Wirtz is on Bayern's radar. How could he not be?\nLikelihood rating: 8/10\n1. Manchester City\nWirtz is more than happy to remain at the Bay Arena this summer, and Leverkusen's hefty valuation renders it tough for any club, no matter how desperate, to strike a deal this summer.\nHowever, if there's one club capable of pulling this deal off, it's Manchester City.\nCity are in the market for a player of Wirtz's ilk, with West Ham's Lucas Paqueta also of interest. The Cityzens must plan for life without Bernardo Silva and Kevin De Bruyne, and Wirtz, together with Paqueta, would be tremendous succession planning.\nThe German is a half-space machine, typically operating from the left inside channel where his dribbling prowess and combination play come to the fore. He excels in the final third; boasting the requisite subtlety to unpick a deep-lying defence, as well as the athleticism to pose a threat in transition.\nSuccess under Xavi Alonso stands Wirtz in good stead for a potential collaboration with Pep Guardiola.\nLikelihood rating: 9/10",
  "word_count": 1117,
  "scraped_at": "2026-02-14T01:51:24.791956",
  "_text_extracted": true
}