{
  "article_id": "3a989404686f",
  "url": "https://metro.co.uk/2025/06/11/benjamin-seskos-manager-tells-reject-one-club-arsenal-man-utd-talks-23384665/",
  "title": "Benjamin Sesko manager tells him to reject one club after Arsenal and Man Utd",
  "date": "20250611T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Slovenia head coach Matjaz Kek has advised Benjamin Sesko to ignore interest from the Saudi Pro League and make a ‘smart’ decision over his future this summer.\nArsenal are on the hunt for a high-class centre-forward and have identified RB Leipzig attacker Sesko as a possible solution up front on the back of another trophyless season, along with Sporting’s Viktor Gyokeres.\nRB Leipzig are open to offers for their star striker as they look to make up for the financial loss of missing out on Champions League qualification and the Bundesliga club have been in talks with the Gunners since last month.\nIt’s understood Manchester United have also held discussions over a move for Sesko following a disappointing campaign for both Rasmus Hojlund and Joshua Zirkzee.\nReports on Monday claimed Arsenal and RB Leipzig had hit a roadblock in their transfer negotiations, with the north Londoners told to cough up £70million or walk away from a deal for the 22-year-old Slovenia international.\nThe news that Saudi outfit A-Hilal have joined the race for Sesko’s signature has only complicated matters for Arsenal, even though the player himself would ideally prefer to remain in European football.\nA-Hilal are intent on making a marquee signing having appointed Simone Inzaghi their new manager last week – and have also explored bids for Victor Osimhen and Manchester United captain Bruno Fernandes this summer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nFacing the media after Slovenia’s 2-1 defeat of Bosnia and Herzegovina, Kek did his best to warn Sesko over a proposed move to Saudi Arabia at this stage of his career.\n‘Benjamin Sesko and Saudi Arabia? I would advise him to never go there, at least not at his age,’ the Slovenia boss told reporters.\nWhile Kek enjoyed his brief spell managing Al-Ittihad, he is convinced Sesko should only have eyes for Europe’s top clubs.\nOn the interest Sesko has attracted from the likes of Arsenal, Manchester United, Chelsea, AC Milan and Juventus, Kek said: ‘This is a great recognition, these are clubs that mean a lot.\n‘It’s not that I underestimate the Saudi Pro League. On the contrary, I worked there at Al-Ittihad and the club is still a part of me.\n‘I also watch the league regularly… but the time will come for Benjamin Sesko for that.\n‘I am convinced that Benjamin himself and the people who care for him will be smart enough to make the right solution.\nMore Trending\n‘That means going somewhere where he can play football because that is the only way he can be happy.’\nSesko was named in Slovenia’s squad for the side’s friendly matches against Luxembourg and Bosnia and Herzegovina this month.\nHowever, the former Red Bull Salzburg man played no part in either clash to avoid the risk of injury, with transfer talks ongoing behind the scenes.\nSesko has scored 39 goals in 87 games for RB Leipzig and is tied into a contract at Red Bull Arena until June 2029.\nMORE: Inter Milan make new Rasmus Hojlund plan due to Manchester United’s asking price\nMORE: Rio Ferdinand says Man Utd and Arsenal target should be ‘causing a nightmare’ to force transfer\nMORE: Tottenham confirm first signing of Thomas Frank era on six-year contract",
  "word_count": 586,
  "scraped_at": "2026-02-14T01:58:41.945720",
  "_text_extracted": true
}