{
  "article_id": "3aa570b44b8c",
  "url": "https://fansided.com/premier-league-schedule-champions-league-europa-league-spots",
  "title": "Premier League schedule : Champions League and Europa League spots still up for grabs",
  "date": "20250501T204500Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Game of the weekend: Brighton vs. Newcastle (Sunday, 9 a.m. EST)\nGames with actual stakes are slim pickings now, with permits for relegation and the title officially filed and granted. All that's left is sorting out the European places, which are plentiful and also not entirely defined. Eighth place should do it, but might not. Brighton and Newcastle are two of the teams vying for those spots, with Newcastle chasing Champions League and Brighton after a Europa League spot.\nBrighton were able to arrest their slide with a late-winner over an insipid West Ham. One would be tempted to say it shouldn't require an injury-time winner to beat West Ham. But hey, the champions required one two weeks earlier, so it's a strange world. They still have a lot of issues, most of them defensive. Newcastle probably isn't the team they'd want to see, given the Magpies have poured in 18 goals in their last six league games. Newcastle are just about two wins away from clinching the top five.\nAnd the rest...\nManchester City vs. Wolves (Friday, 3 p.m. EST)\nThey've won four in a row, are into the FA Cup final, have their destiny for the top five in their own hands, and Erling Haaland and Rodri are back in training. Hopefully, we all enjoyed our Man City-in-crisis sabbatical, because it looks like the clouds over Eastlands are parting. Yes, Wolves have won six in a row, and six in a row is a football in the groin. But those six wins were over either basketcases or relegated teams, and City aren't that. At least not anymore. Let's say it's a step up for Wolves, though even a draw throws the top five race into turmoil again.\nAston Villa vs. Fulham (Saturday, 7:30 a.m. EST)\nThe only other game on the slate where both teams have something on it. Fulham could pull within a point of Villa with a win for 7th place, which will probably be a Europa League spot but certainly a Conference League spot. Either would be a boon for Fulham. Villa need to run the table to have any hope of getting into the top five, and have had a week to clean their wounds after getting paddled by Palace in the FA Cup semifinal last week.\nEverton vs. Ipswich (Saturday, 10 a.m. EST)\nThe second-to-last game at Goodison Park, which should be more than enough impetus for Everton to overcome an already-relegated opponent. Unless Ipswich are truly free now after having lost everything. Diehards only for this one.\nLeicester vs. Southampton (Saturday, 10 a.m. EST)\nSouthampton aren't going to get a better chance than this to gain the one point they need to avoid being level with the worst Premier League team of all-time. They finish with City, the last game at Goodison Park, and Arsenal. So yeah, it's here or infamy.\nArsenal vs. Bournemouth (Saturday, 12:30 p.m. EST)\nLike Villa, Bournemouth probably have to win out to get into any European place. They have a much harder schedule to do it, with this, City, and Villa left on the docket. They're also playing much worse, having won once in their last 11. They won't get a game with a more distracted opponent, as Arsenal will be all about keeping fresh for Wednesday's 2nd leg against PSG. Can the Cherries get it together against a second-string Arsenal? Raheem Sterling gives any opponent a chance.\nBrentford vs. Manchester United (Sunday, 9 a.m. EST)\nIf Brentford were to win the rest of their games, they could, maybe, sneak into a European spot. United will be more worried about their second leg against Athletic Bilbao than this, and will have traveled back from there just a couple days beforehand. This feels like another United performance we all laugh at before they score four goals in injury time against Bilbao to get to the Europa League final.\nWest Ham vs. Tottenham (Sunday, 9 a.m. EST)\nEverything just said about United can be said about Spurs, except West Ham are much worse than Brentford. This one has every chance of looking like your kid's first tee-ball game, a formless mishmash of players who aren't totally clear on the rules and are unconcerned about learning them.\nChelsea vs. Liverpool (Sunday, 11:30 a.m. EST)\nChelsea need this one, and Liverpool just might not care after clinching the Premier League title last week. Or they're so unburdened that they can play however they want. Chelsea have won their last two, but haven't really been better. They just got to be ok enough to let teams playing terribly lose the game to them. Liverpool fans will think they've won this simply when they see Chelsea giving Liverpool fans the Guard of Honor before kickoff. And they're right.\nCrystal Palace vs. Nottingham Forest (Monday, 3 p.m. EST)\nPalace are just waiting around for the FA Cup final now, what could be their biggest ever day as a club. Forest will need this desperately to stay in the top five. But in order to get the three points they'll have to figure out what to do with most of the ball, which has been their kryptonite.",
  "word_count": 862,
  "scraped_at": "2026-02-14T02:15:07.785772",
  "_text_extracted": true
}