{
  "article_id": "3b0f3b16dd3b",
  "url": "https://www.thenationalnews.com/news/uk/2025/07/06/uk-commemorates-20-years-since-77-attacks/",
  "title": "UK forced to rethink approach to terrorism 20 years after deadly 7 / 7 attacks",
  "date": "20250706T084500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 20th anniversary of the July 7, 2005, attacks in London, on Monday, throws a spotlight on how the UK's counter-terrorism approach changed, and how its focus on Islamist groups has deepened social divisions.\nThe bombings, also referred to as 7/7, were a series of four co-ordinated suicide attacks by British Islamists on commuters using London's public transport during the morning rush hour.\nTwo decades on, the 52 killed and hundreds wounded are being remembered.\nThousands are to gather at a dedicated memorial in Hyde Park on Monday and at St Paul's Cathedral to mark an attack that brought a new type of terror to the UK.\nThe attacks sent shockwaves across the country and changed the national security system for thwarting home-grown terrorism feeding off foreign conflicts. Two of the bombers, Mohammad Sidique Khan and Shehzad Tanweer, had travelled to Pakistan to train with Al Qaeda before their attack.\nThe pair travelled from Leeds with Hasib Hussain after assembling a bomb in a rented flat. On the way, they picked up the fourth bomber, Germaine Lindsay, in Luton and then boarded the transport network.\nYassin Oman, from another group whose bombs failed to detonate two weeks later, was found to have ties to the Finsbury Park Mosque, led by the radical preacher Abu Hamza.\nToday, the threats have evolved, with the UK police foiling Iran-backed terror plots this year, and a growth in far-right extremism.\n“Counter-terrorism – almost myopically focused on the threat of Islamist extremism – drove security priorities and decisions for almost 15 years,” said Dr Jessica White, a counter-terrorism expert at the Royal United Services Institute (Rusi), a UK think tank.\n“While this was not the first enduring threat of terrorism the UK has faced, there was collective acceptance of counter-terrorism measures becoming a constant daily presence,” she told The National.\nImpact on British Muslims\nThe attacks also had a profound and long-lasting impact on the British Muslim community, whose mosques and charities were closely scrutinised, and in many cases vilified.\nA new Netflix documentary about the bombings shows the moment when TV presenter Kate Garraway speaks to a Muslim victim of the attack and asks him to condemn it on behalf of all Muslims.\nThe prejudice persists to this day, with far-right riots singling out mosques as targets as recently as last year.\nThe 7/7 attacks accelerated the Prevent programme, a system under which teachers can flag pupils they consider at risk of radicalisation. Muslim pupils are said to be disproportionately affected by it.\nYet some say that the new national security attention on the UK’s Muslim communities also gave Islamists a path into government and public institutions, at the expense of mainstream Muslims.\nThis, in turn, fuels a right-wing backlash that further drives the ostracism of Muslims in the UK. “We’re not much further forward from 7/7,” said former Labour MP Khalid Mahmood.\n“We have allowed much greater Islamist growth in the UK,” he told The National. “We have allowed more people to entrap our young people, especially in the South Asian community, where Arabic is not the first language.”\nYoung South Asians were being told by Islamists that their traditions and customs had Hindu influences and were not true to Islam – causing them to isolate themselves from their communities.\nMr Mahmoud blamed the growing influence of the Muslim Council of Britain, an umbrella organisation, on government in the months following the attacks.\nThe MCB has links with more than 450 mosques and Muslim charities, but is accused by critics of promoting extremist forms of political Islam.\nThis grassroots growth was a factor in the emergence of The Muslim Vote, a campaign which sought to undermine Labour at the 2024 general election over its stance on Gaza, and which ultimately, Mr Mahmood believes, caused the loss of his seat.\n“The Muslim Council of Britain is a non-partisan, cross-sectarian and democratic, representative organisation rooted in the values of faith, justice and civic responsibility,\" the MCB told The National in a statement. \"We work for the common good of all in Britain while building bridges across communities and strengthening our shared commitment to a just and cohesive society.”\nThe UK government stopped engaging with the MCB in 2009 after its leader signed a letter that ministers said condoned attacks on British forces.\nBut in the aftermath of the 2005 attacks, at the invitation of the foreign secretary at the time, Jack Straw, they were “in and out of Downing Street like a postman”, Mr Mahmood said.\nHe said he had raised concerns about the MCB repeatedly at the time, but they were ignored. “People didn’t want to challenge this because it was too awkward to challenge,” he said.\nTerror redefined\nDebates about expanding terrorism definitions have also come to the fore. Prime Minister Keir Starmer said this year that “terrorism had changed” and the law needed to recognise new threats from “loners, misfits, young men in their bedroom”.\nHe was speaking about the Southport knife attacker Axel Rudakubana, aged 17 when he murdered three young girls in July 2024, who was said to have developed an obsession with killing after watching hours of violent content online.\nOver the past five years, counter-terrorism forces have begun focusing more on the threat of far-right violence, which is on “an ideological spectrum including white supremacy, xenophobia, misogyny and more”, said Dr White.\n“However, this threat presents some different challenges to grapple with, based on biases and inequalities that are foundational in UK society,” she said.\n“It is also empowered and amplified in a digital age that allows easy communication of extremist sentiment and transnational connection and combined influence of bad actors,” she added.\n“With this, counter-terrorism approaches are faced with an increasingly lower age of offenders and the democratic challenge of defining lines between what is freedom of expression and what may lead to terrorism,” she said.\nFar-right agitator Tommy Robinson was released from prison last month, causing concern for many in the Muslim community – his principal target.\nThere are fears that growing political polarisation could lead to more radicalisation and eventually, violence.\nThe growing popularity of right-wing populist party Reform, which helped halve Conservative votes in the last general election, is now being met with the formation of a new left-wing party, linked to former Labour leader Jeremy Corbyn and announced by independent MP Zarah Sultana.\n“The threat of social and political polarisation seems stronger than ever, which lowers societal resilience to extremism and can in turn lead to radicalisation to violence,” said Dr White.\n“This is a key moment to remember 7/7 and to not take our eye off the threat of terrorism,” she added.\nPolicing protests\nThere are also concerns that laws devised to protect the public from terror attacks are now being used elsewhere – in particular to police protests.\nThe UK government has banned the campaign group Palestine Action, which broke into a Royal Air Force base last month and caused millions of pounds worth of damage.\nTens of people have been arrested on terror charges in the past two years, since protests in solidarity for Palestine and seeking an end to the war in Gaza became a weekly occurrence.\nActivists known as the Filton 18, who are accused of occupying an Elbit Systems weapons factory, were denied bail after the Crown Prosecution Service found the action to have a terrorism connection.\n“We’ve seen terrorism legislation used in a much more wide-ranging way,” said criminal defence lawyer Raj Chada, of Hodge Jones and Allen.\n“Some of the legislation for encouraging or supporting terrorism was really devised for people like Abu Hamza. Now we're seeing it used for people who attend demonstrations using words that some people will find offensive,” Mr Chada said.\n“Twenty years ago that never would have been considered under terrorism laws,” he said.\nHe pointed to comments by Mr Straw, who was home secretary when the first terrorism bill was introduced in 2000, promising that the law would never be used to charge activists such as Greenpeace, who had spray-painted a nuclear warhead production plant at the Aldermaston Atomic Weapons Establishment.\n“Yet here we are, 20 years on,” Mr Chada said.\nThis article has been amended to reflect the MCB response to the comments of Mr Mahmood.",
  "word_count": 1378,
  "scraped_at": "2026-02-14T01:49:44.685044",
  "_text_extracted": true
}