{
  "article_id": "3b11eb0b101a",
  "url": "https://www.caughtoffside.com/2025/08/30/newcastle-eyeing-move-davide-frattesi/",
  "title": "Newcastle United keen on signing Inter Milan star Davide Frattesi",
  "date": "20250830T183000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United are interested in securing the signature of the Inter Milan midfielder Davide Frattesi this summer.\nThey need more quality and depth in the middle of the park, and they feel the 25-year-old Italian could be the ideal acquisition, as per TBR Football. He could complement the likes of Bruno Guimaraes and Sandro Tonali. He will add creativity and goals to the side.\nFrattesi has been linked with Manchester United as well.\nNewcastle eyeing Davide Frattesi\nNewcastle have a quality midfield, but they need more depth in the side. They will be competing in the UEFA Champions League, and they need more options at their disposal. The Italian could be the ideal fit for them, and it will be interesting to see if they can get the deal done.\nHe was an important player for Inter Milan last season, and he helped them reach the final of the UEFA Champions League. It remains to be seen whether the Italian outfit is prepared to sanction his departure. The player is still only 25, and he will improve with coaching and experience. He could develop into a key player for Newcastle with the right guidance.\nNewcastle need signings like Frattesi\nNewcastle have an ambitious project and a talented squad. They managed to win a trophy last season, and they will look to build on that. They will want to put together a team capable of fighting for titles. They need quality players for that to happen. The 25-year-old Italian is certainly capable of playing for top teams, and he would be an excellent addition.\nIt will be interesting to see if Newcastle can get the deal across the line before the window closes. They are looking to improve the attacking unit as well. They could lose Alexander Isak this summer, and they will need to replace the Swedish International.",
  "word_count": 308,
  "scraped_at": "2026-02-14T02:15:40.832033",
  "_text_extracted": true
}