{
  "article_id": "3b1857151a74",
  "url": "https://www.kingfut.com/2025/12/14/van-dijk-hopes-salah-stays-at-liverpool-amid-ongoing-uncertainty/",
  "title": "Van Dijk hopes Salah stays at Liverpool amid ongoing uncertainty",
  "date": "20251214T214500Z",
  "domain": "kingfut.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Virgil van Dijk says he wants Mohamed Salah to remain at the club, but acknowledged uncertainty still surrounds the forward’s future.\nSalah returned to action on Saturday in Liverpool’s Premier League win over Brighton. The forward had been left out of the squad for the Champions League trip to Inter Milan following his post-match comments after the draw with Leeds United. In that interview, he said he felt “thrown under the bus“ and claimed there was no relationship with head coach Arne Slot.\nHowever, he was recalled to the squad after having a one-on-one conversation with Slot. Salah came off the bench in the 26th minute to replace the injured Joe Gomez. The Egyptian provided Hugo Ekitiké with an assist for the second goal of the match.\nSalah is now set to join the Egypt national team for the Africa Cup of Nations, which could keep him out of club action for over a month.\nSpeaking after the win, Van Dijk made it clear that the Salah debacle hadn’t affected the squad’s unity. “It’s not about me, it’s about the rest of the team,” the defender said.\nI speak to Mo, I speak to almost all the players. If it affected performances, that would be a different story, but we showed this week that we are united.\nWith Salah now focused on international duty, his longer-term status at Liverpool remains up in the air. “We hope he will be successful at the Africa Cup of Nations and that he comes back. That is important for us,” Van Dijk added.\nBut we all know football and have no idea what will happen. I hope he stays. He is one of my leaders and a very important player for the club.\nSince Salah’s controversial comments, Liverpool have won back-to-back matches.\nFinally, Van Dijk said the team addressed the situation internally. “That is something behind the scenes that we deal with,” he said. “The performances speak for themselves. The mood in the dressing room has always been good. The season is very long, and we want to be consistent. We have to keep going and stay calm.”",
  "word_count": 354,
  "scraped_at": "2026-02-14T01:52:59.295260",
  "_text_extracted": true
}