{
  "article_id": "3b2fd02ab9ba",
  "url": "https://metro.co.uk/2024/12/23/they-get-him-chelsea-tipped-sign-player-arsenal-sold-17m-22237115/",
  "title": "  They could get him  – Chelsea tipped to sign player Arsenal sold for £17m | Football",
  "date": "20241223T060000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have been tipped to sign Premier League goalkeeper Emiliano Martinez if Aston Villa fail to qualify for the Champions League.\nUnai Emery’s side finished fourth in the Premier League last season to qualify for the Champions League for the first time.\nVilla enjoyed a dream start to their Champions League campaign, winning their opening three games and beating Bayern Munich at a raucous Villa Park.\nThe Midlands club also made a strong start to the Premier League season but results have started to fall away both domestically and in Europe.\nAston Villa are currently sixth in the Premier League, three points outside the top-four places, and sit fifth in the revamped Champions League ahead of their final two group games.\nEx-England striker Darren Bent believes star goalkeeper Martinez may consider leaving Villa if they do not secure a return to the Champions League next season and has named Chelsea as a potential landing spot for the Argentine World Cup winner.\nChelsea are playing in the Europa Conference League this year but look set for a return to Europe’s top table, currently second in the Premier League as they look to mount a surprising title challenge.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWhile the Blues are thriving under Enzo Maresca, it has been repeatedly suggested Chelsea need to upgrade current No. 1 Robert Sanchez to go to the next level.\n‘I wonder if Aston Villa don’t get back in the Champions League,’ former Premier League striker Bent told talkSPORT. ‘I know he signed a new contract, but could he go?\n‘The fact is he could play for almost any team he wanted to. Chelsea could get him.’\nAston Villa signed Martinez from Arsenal in 2020 and the 32-year-old has gone on to establish himself as one of the best goalkeepers in the world.\nAccording to Premier League icon Jussi Jaaskelainen, Mikel Arteta sold ‘one of the best players in the Premier League’ when he allowed Martinez to leave Arsenal.\n‘It’s hard for me to name the best goalkeeper in the Premier League so I’m going to have to put it down to two,’ the former Bolton, West Ham and Wigan shot-stopper told Ladbrokes.\n‘First of all, I have to go with Alisson. I’m a big fan of him; he just seems to be a monster in goal.\n‘It doesn’t look like he moves quickly, and he doesn’t really look special, to be honest. But the way that big boy moves is unbelievable, and the saves he makes are just as good.\n‘But the other one for me would have to be Emi Martinez, for Aston Villa. He’s right up there for me, and I can’t believe how good a move it’s been for him, to leave Arsenal and go to Villa.\n‘Since then, he’s won the World Cup, the Copa America, and he’s played a huge part in getting Villa back into Europe.\n‘I really do like him, he’s big, he’s strong, he’s fast, he’s great with the ball… he’s got everything, honestly. I love how commanding he is in his box – he’s aggressive when he needs to be aggressive.\nMore Trending\n‘He’s a great lesson to young footballers, as well. You know, before he signed for Aston Villa, he hadn’t played more than 20 games for a team, and he’d been on loan with six different clubs.\n‘Obviously, he got his break in 2020, when Bernd Leno got injured for Arsenal, and he came in and won the FA Cup with them.\n‘I think it was the best move for everybody, to be honest. If Arsenal didn’t fancy him as their number one, then the move was the best outcome, for sure.\n‘But to go on and do what he’s done… it’s just a great lesson. I think it’s important for goalkeepers, when they’re young, to go and play as much senior football as they can, and obviously that’s what Martinez went and did.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal’s £100m transfer target is ‘on another level’ to Gabriel Jesus\nMORE: Premier League star tipped to become ‘as good’ as Erling Haaland\nMORE: Gary Neville names Liverpool’s biggest rival for Premier League title",
  "word_count": 760,
  "scraped_at": "2026-02-14T02:14:55.043300",
  "_text_extracted": true
}