{
  "article_id": "3b49f7d277a3",
  "url": "https://metro.co.uk/2023/12/26/man-utd-target-38m-winger-potential-antony-replacement-20027515/",
  "title": "Man Utd target £38m winger as potential Antony replacement",
  "date": "20231226T213000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have put PSV winger Johan Bakayoko on their shortlist ahead of the January transfer window, according to reports in Germany.\nErik ten Hag is keen to improve his attacking options in the upcoming window and a new striker is understood to be one of United’s top targets.\nHowever, Sport1 reports that United are also looking to bolster Ten Hag’s options across all attacking areas and Bakayoko’s explosive performances for PSV are being closely monitored.\nThe 20-year-old has been one of PSV’s standout performers this season with four goals and 13 assists so far.\nBakayoko had attracted widespread interest last summer and Brentford came close to matching PSV’s £38.5 million asking price for the winger.\nHowever, the Belgium international turned down the chance to join Brentford as he wanted to play Champions League football.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBakayoko, who has also been linked with Liverpool, has impressed in the Champions League this term and delivered a fine performance in the 1-1 draw with Arsenal two weeks ago.\nMore Trending\nSpeaking earlier this month, PSV head coach Peter Bosz made it clear that he expects Bakayoko to eventually join a top club in Europe.\n‘I think so – and we have more. In the end, Johan said he wanted to stay and he was right,’ Bosz told The Athletic.\n‘This is his first year as a starting player, and the most difficult part is consistency. Johan was fantastic against Arsenal but I want him to be fantastic every weekend.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 321,
  "scraped_at": "2026-02-14T01:56:38.137592",
  "_text_extracted": true
}