{
  "article_id": "3b5b7144deb1",
  "url": "https://www.fourfourtwo.com/news/liverpool-transfer-news-to-close-deal-after-quick-negotiations-report-las-palmas-red-bull-salzburg-stefan-bajcetic-signings-rumours-gossip-paper-talk-lfc-ynwa",
  "title": "Liverpool to close deal after  quick negotiation : report",
  "date": "20250127T164500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool to close deal after 'quick negotiations': report\nLiverpool have been quiet in the transfer market under Arne Slot - but look set to sort a deal for a promising youngster\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nLiverpool are in the process of arranging a rare January transfer in what's been a very quiet window once more.\nThe Reds have been conspicuous in their absence of crazed market movement over the past two transfer windows. While rivals have undergone huge rebuilds, Liverpool have made just two signings under Arne Slot, in the form of Federico Chiesa and Giorgi Mamardashvili – with the latter still on loan at Valencia.\nNot that it's hampered the Merseysiders, who sit top of the Premier League and the league phase of the Champions League, with talismanic forward Mohamed Salah 3/1 favourite to win the 2025 Ballon d'Or.\nLiverpool sorting deal – to fix a disaster that unfurled earlier this season\nLiverpool are currently looking to tie down the likes of Salah, Trent Alexander-Arnold and Virgil van Dijk to new contracts, and according to transfer expert Ben Jacobs, secure long-term replacements for all three. But speaking to FourFourTwo, Jacobs said that a defensive midfielder is still on the radar for the Reds, with Martin Zubimendi having rejected a move over the summer.\n“You could make an argument that Liverpool could still do with another no.6,” Jacobs told FourFourTwo exclusively on January 13. “It's very telling that after not getting Zubimendi, they didn't sign another no.6, so on the list of priorities for 2025 in the next probably one to four windows, will be to bring in another no.6.”\nStefan Bajcetic is one highly-rated prospect, ranked at no.33 in FourFourTwo's list of most exciting teenagers to watch at the start of last season, who may yet suit that defensive midfield role. The Spaniard was immensely impressive when he first burst into the senior team but has been on loan at Red Bull Salzburg this season.\nSpanish outlet Atlantico Hoy via Sport Witness reports that La Liga outfit Las Palmas are close to bringing the star to the Canary Islands on loan, to follow in the footsteps of former star, Pedri.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nBajcetic has been a part of a wretched campaign in Salzburg, which has seen the Red Bull club embarrassed on the continental stage in the Champions League – where they sit 34th out of 36 in the league phase. Former Reds assistant Pep Lijnders left Anfield to step out of Jurgen Klopp's shadow and coach Die Roten Bullen, but has since been sacked himself, with on-loan Bajcetic's game-time limited in Austria.\nThe 20-year-old's development has been stunted by injury and a poor loan stint but this new move, said to be imminent after “quick negotiations” could position the youngster well for next season.\nIn FourFourTwo's view, Bajcetic could be perfect either as a no.6 or a no.8 and regular football in a technical league could set him nicely for a potential squad role next season.\nBajcetic is worth €8 million, according to Transfermarkt. The Reds travel to Slot's native Netherlands this week, as Champions League action resumes and the league phase draws to a close with a fixture against PSV.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 720,
  "scraped_at": "2026-02-14T02:02:19.844595",
  "_text_extracted": true
}