{
  "article_id": "3b7f0c6bef7f",
  "url": "https://theathletic.com/5137857/2023/12/14/europa-league-draw-when-playoff-teams-2/",
  "title": "When is the Europa League knockout round playoff draw and who has qualified ? ",
  "date": "20231214T223000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Europa League knockout round playoffs are set to be decided in Friday’s draw for the first round of the knockout stages — but Premier League sides Liverpool, Brighton and West Ham will not be involved at this stage.\nIt was another dramatic group stage with a number of big names impressing while others failed to do themselves justice in the first part of the competition.\nNow attention turns to the business end and the knockout phase.\nAdvertisement\nIn a continuation of last season’s format, instead of the previous Round of 32 knockout stage feeding into the last 16, the competition now features a playoff round — comprised of the runner-up from each Europa League group taking on Champions League third-placed group sides — with the victors advancing to the last 16 to join the Europa League group stage winners.\nThat means that English trio Liverpool, Brighton and West Ham, alongside Scottish side Rangers, have already progressed and will not be participating in the playoff round.\nHere are all the details.\nWhen is the Europa League knockout round playoff draw?\nThe draw for the knockout round playoff will take place on Monday, December 18 at 12pm GMT/7am ET/3am ET.\nIt will take place at the House of European Football in Nyon, Switzerland.\nWhat are the rules for the knockout round playoff draw?\nThe eight teams that progressed to the Europa League knockouts as group winners will not be involved in the draw and will advance automatically to the last 16.\nThe eight runners up from the group stages will be seeded for this draw, and the eight Champions League group third-placed teams are unseeded.\nEach tie will consist of one seeded team and one unseeded one, with the seeded team hosting the second leg.\nTeams from the same country cannot be drawn against each other.\nWhich teams have qualified?\n- Galatasaray (Champions League Group A third-placed side)\n- Lens (Champions League Group B third-placed side)\n- Braga (Champions League Group C third-placed side)\n- Benfica (Champions League Group D third-placed side)\n- Feyenoord (Champions League Group E third-placed side)\n- Milan (Champions League Group F third-placed side)\n- Young Boys (Champions League Group G third-placed side)\n- Shakhtar Donetsk (Champions League Group H third-placed side)\n- Freiburg (Europa League Group A runner-up)\n- Marseille (Europa League Group B runner-up)\n- Sparta Prague (Europa League Group C runner-up)\n- Sporting Lisbon (Europa League Group D runner-up)\n- Toulouse (Europa League Group E runner-up)\n- Rennes (Europa League Group F runner-up)\n- Roma (Europa League Group G runner-up)\n- Qarabag (Europa League Group H runner-up)\nWhich teams have already qualified for the last 16?\nEight teams have already booked their place in the last 16 courtesy of winning their Europa League group.\n- West Ham (Europa League Group A winner)\n- Brighton (Europa League Group B winner)\n- Rangers (Europa League Group C winner)\n- Atalanta (Europa League Group D winner)\n- Liverpool (Europa League Group E winner)\n- Villarreal (Europa League Group F winner)\n- Slavia Prague (Europa League Group G winner)\n- Bayer Leverkusen (Europa League Group H winner)\nCan I watch the draw?\nThose hoping to tune into the draw will be able to find it on UEFA.com.\nCertain broadcasters will be showing it. In the UK, you can watch it via TNT Sports.\nWhen will the knockout round playoff ties be played?\nThe first and second legs will be played one week apart in February.\n- First legs: February 15\n- Second legs: February 22\nAnd what about the other Europa League key dates?\nAfter the knockout round playoff is wrapped up, all roads lead to Dublin’s Aviva Stadium in late May.\n- Round of 16 draw: February 23, 2024\n- Round of 16: March 7 and 14, 2024\n- Quarter-finals: April 11 and 18, 2024\n- Semi-finals: May 2 and May 9, 2024\n- Final: May 22, 2024\nWhat about the Europa Conference League?\nAston Villa topped their Conference League group and so have advanced to the last 16, meaning they avoid the playoff round for the knockout stages.\nAdvertisement\nVilla join Lille, Maccabi Tel Aviv, Viktoria Plzen, Club Brugge, Fiorentina, PAOK and Fenerbahce in progressing through automatically as group winners.\nThe eight group runners-up of Slovan Bratislava, Gent, Dinamo Zagreb, Legia Warsaw, Bodo/Glimt, Ferencvaros, Eintracht Frankfurt and Ludogorets will all be seeded for the playoff round.\nOlympiacos, Ajax, Real Betis, Sturm Graz, Union Saint-Gilloise, Maccabi Haifa, Servette and Molde all drop into the knockout as unseeded teams having finished third in their respective Europa League groups.\n(Pierre Albouy – UEFA/UEFA via Getty Images)",
  "word_count": 767,
  "scraped_at": "2026-02-14T02:07:27.050173",
  "_text_extracted": true
}