{
  "article_id": "3be2d692f542",
  "url": "http://www.bignewsnetwork.com/news/278443354/cole-palmer-is-the-best-in-the-world-chelsea-goalie-hails-midfielder-after-fifa-club-world-cup-win",
  "title": "  Cole Palmer is the best in the world ...: Chelsea goalie hails midfielder after FIFA Club World Cup win",
  "date": "20250714T133000Z",
  "domain": "bignewsnetwork.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "\"Cole Palmer is the best in the world...\": Chelsea goalie hails midfielder after FIFA Club World Cup win\nNew York [US], July 14 (ANI): Following his side's FIFA Club World Cup win, Chelsea goalkeeper Robert Sanchez hailed the midfielder Cole Palmer, who scored a brace, saying that 'what he does is magic' and will be the world's best in 'two or three years'.\nChelsea captured their second FIFA Club World Cup title, courtesy of a Palmer brace, downing the UEFA Champions League champions Paris Saint-Germain (PSG) in the final by 3-0 on Sunday night.\nFollowing the win, Sanchez told FIFA about Palmer, 'Cole Palmer is the best in the world. If he is not the best now, he is going to be in the next two to three years. 'He is a top player. He shows it in all the matches. What he does is magic. When he gets chances, he takes them. Today he scored two goals, almost a hat-trick. Impressive.'\nMalo Gusto, another one of Palmer's teammates, said that the star player is a 'bit on his own and reserved'.\n'But he is a very good person. He knows when to speak up. He also knows how to be funny to help the team relax a bit. We all have a very good relationship. We are really happy to have this kind of player. Everyone knows Cole now. Everyone knew him before. He is a top player, like many others on this team. He did a lot for us tonight,' he added.\nSpeaking about the match, during which he captured the 'Player of the Match' and 'Player of the Tournament' awards, Palmer said, 'We did not mind, we just used that as extra motivation and we worked through the trouble out there. I thought we were spot on today, especially the gaffer. We had a good game plan, and we executed it.'\nSanchez said that PSG had written off Chelsea heading into the game.\n'It looked like it, no?' said the Spanish star.\n'From everything we read and saw in interviews, the truth is that they did. They have had a very good season, but they had not faced us. PSG have a lot of quality, they play with a lot of intensity and energy, but for me, we have much more quality. I told my teammates that we have more energy than them, more intensity than them, that we are going to win the game. And that is what they did. We got in their face from the first minute, and when we got chances, it was goal, goal. 'What a final. We put in a lot of effort in this tournament, so we deserved it. I am very happy, delighted that we played a great match, and were able to score goals. We could have scored more,' he added.\nFavourites PSG had not let up a goal in their previous four games heading into the final of the men's football tournament, but they found themselves behind in the 22nd minute, when Cole Palmer controlled a clever layoff from Malo Gusto before bending a sumptuous effort into the far corner, giving Chelsea the early breakthrough, according to Olymipcs.com.\nEight minutes later, the 23-year-old doubled Chelsea's lead; this time latching on to a ball from deep and, with the same ice-cool precision, bent it into the far corner once again. Copy, paste.\nAnd just when PSG thought they'd contained the threat, Palmer morphed into a creator. A slide-rule pass split the defence, freeing Joao Pedro, who applied a touch of Brazilian mischief to delicately lift the ball over a helpless Gianluigi Donnarumma.\nThe half-time break couldn't come fast enough for PSG, who had struggled to deal with Chelsea's intense press all evening.\nThe second half was less eventful than the first, which included the first-ever half-time show at a FIFA-organised event, with performances from Coldplay, Doja Cat, J Balvin, and Tems.\nBoth managers made adjustments, but PSG, the European champions, were especially desperate for a way out. However, Chelsea's Liam Delap, who came on for Pedro, twice made Donnarumma make amazing saves, which kept the scoreline respectable.\nPSG finished the game with 10 men after Joao Neves received a straight red card for pulling Marc Cucurella's hair five minutes from time.\nChelsea added the Club World Cup trophy to the UEFA Conference League trophy they won back in May, capping off an impressive debut season for Italian Maresca at Stamford Bridge. (ANI)",
  "word_count": 744,
  "scraped_at": "2026-02-14T02:26:46.359388",
  "_text_extracted": true
}