{
  "article_id": "3be4fd33478c",
  "url": "https://www.empireofthekop.com/2024/04/16/liverpool-ticket-price-increase-fan-anger/",
  "title": "Liverpool hierarchy fail to read the room with 2 % ticket price increase",
  "date": "20240416T153000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Last week, Liverpool FC announced that ticket prices for next season would be increased by 2%, news which led to outcry from numerous Reds supporters.\nDespite a subsequent meeting with the club’s Supporters Board, the decision was made not to reverse that planned price rise.\nAlthough the rate of increase is lesser than other Premier League clubs who’ve taken similar action – Tottenham announced a 6% raise to season ticket prices for the 2024/25 campaign – the move by LFC has nonetheless left a sour taste at a rather inopportune time.\nLiverpool fan group Spion Kop 1906 took a stand against the club’s plans to raise ticket prices by refusing to display flags on the Kop for last week’s Europa League quarter-final clash at home to Atalanta.\nFOLLOW Empire of the Kop on Instagram (@empireofthekop) HERE\nAlthough the atmosphere at Anfield was strangely subdued that night, the subsequent 0-3 defeat was still a shock to the system, and attempts by some social media users to pin that result on the supporters were frankly ridiculous.\nAs Gareth Roberts – who represents The Spirit of Shankly and the Supporters’ Board – explained to BBC Radio Merseyside, the ticket price decision is reflective of a ‘worrying direction of travel’ across English football where the considerations of match-going fans are being neglected.\nHe rightly pointed out that Liverpool will benefit from greater income next season due to Anfield’s expanded capacity and the near-certain return to the Champions League, so the 2% increase in ticket prices shouldn’t have been necessary.\nThe mood around the club was jovial as April began, with Jurgen Klopp’s side still in the hunt for two trophies to add to the Carabao Cup which was secured in February, but the Reds’ season has threatened to unravel over the past fortnight.\nWith the potential for something special to happen in the manager’s final few weeks on Merseyside, the board chose a terrible time to announce the ticket price increase, and the damage not just to the team’s fortunes but also the club’s reputation could be far more costly than any benefits from the 2% raise in matchday admission.\nAnfield has so often been bouncing at this stage of the season when Liverpool are in the hunt for major trophies, but the atmosphere has been one of anger during the defeats to Atalanta and Crystal Palace, with those two results obviously not helping matters either.\nFSG have had an unfortunate habit of taking decisions which badly misjudge the feeling among the majority of fans, and they’ve made a rod for their own backs once more with the announcement over ticket prices for 2024/25.",
  "word_count": 440,
  "scraped_at": "2026-02-14T02:10:47.905400",
  "_text_extracted": true
}