{
  "article_id": "3bef24638077",
  "url": "https://economictimes.indiatimes.com/articleshow/121659329.cms",
  "title": "Lamine Yamal and Ousmane Dembele face off in Nations League clash amid Ballon dOr race",
  "date": "20250606T010000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spain and France will face off in the UEFA Nations League semifinal in Stuttgart, with the match spotlighting Lamine Yamal and Ousmane Dembele, two leading contenders for the 2025 Ballon d’Or. Both players scored in their respective quarterfinals and now enter the semifinal following standout seasons at club and international level.\nYamal downplayed the significance of the match in the context of the Ballon d’Or race, stating his focus remains on performance over accolades. The Ballon d’Or winner will be announced on September 22 in Paris.\nAlso read: Spain vs France live streaming: Prediction, kick off time, how to watch UEFA Nations League semifinal free\nPerformance statistics highlight contrasting strengths\nDembele, who plays for Paris Saint-Germain, finished the 2024–25 season with 33 goals and 13 assists, including two assists in PSG’s Champions League final victory over Inter Milan. He was named the Champions League Player of the Season and won the Ligue 1 Golden Boot.\nYamal, the 17-year-old Barcelona winger, recorded 18 goals and 25 assists across all competitions, while playing over 4,500 minutes, significantly more than Dembele’s 3,286. Despite a lower goal tally, Yamal led in dribbles, duels won, and possession recovery.\nIn per-90 metrics, Dembele edged Yamal in shots (5.2 vs. 4.4), touches in the opposition box (9.2 vs. 7.5), and passing success (82.8 per cent vs. 78.9 per cent). Yamal, however, surpassed Dembele in dribble volume (9 vs. 4.6) and dribble success (53.5 per cent vs. 44.4 per cent).\nDembele's resurgence underlines Ballon d’Or credentials\nDembele’s 2024–25 campaign marked a major turning point in his career. After years of injuries and inconsistency, the French forward returned to form following a tactical shift in December, when PSG manager Luis Enrique moved him from right wing to center forward.\nAlso read: FIFA Club World Cup 2025: Full schedule, groups, and key fixtures unveiled for U.S. debut\nThe change triggered a run of 18 goals in 10 games, propelling Dembele to a 33-goal season total, including 21 in Ligue 1. He also added key contributions in the Nations League, scoring in wins over Belgium and Croatia.\nLuis Enrique endorsed Dembele’s Ballon d’Or candidacy, citing his defensive work and leadership in addition to his offensive production. Dembele’s summer will continue with Paris Saint-Germain in the FIFA Club World Cup, offering another platform to strengthen his case for the individual honor.\nYamal delivers breakthrough season with historic impact\nLamine Yamal’s 2024–25 campaign included a La Liga title, Copa del Rey, and Spanish Super Cup with Barcelona, as well as a European Championship with Spain. He was named to the Champions League team of the year after consistent performances, including three goals in four El Clasico matches and standout displays against Inter Milan.\nYamal, who debuted for Barcelona at age 15, has now surpassed 100 senior appearances. His Champions League and domestic form drew praise from high-profile opponents and coaches, including Simone Inzaghi.\nAlso read: What to know about crash into parade of Liverpool soccer fans\nHe recently signed a six-year contract extension with Barcelona, and the CIES Football Observatory valued him at €400 million. While still eligible for three more Ballon d'Or cycles before turning 21, Yamal remains focused on development over recognition.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 597,
  "scraped_at": "2026-02-14T01:52:26.344766",
  "_text_extracted": true
}