{
  "article_id": "3bf005c4950f",
  "url": "https://www.namibian.com.na/hakimi-osimhen-salah-shortlisted-for-top-african-award/",
  "title": "Hakimi , Osimhen , Salah shortlisted for top African award",
  "date": "20251116T213000Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Moroccan Achraf Hakimi, Nigerian Victor Osimhen and Egyptian Mohamed Salah were shortlisted on Sunday for the 2025 African men’s player of the year award, the Confederation of African Football (CAF) announced.\nMoroccans Ghizlane Chebbak and Sanaa Mssoudy and Nigerian Rasheedat Ajibade are the contenders for the African women’s player of the year title.\nCurrently injured, full-back Hakimi helped Paris Saint-Germain win the UEFA Champions League for the first time and finish runners-up to Chelsea in the final of the expanded Club World Cup.\nIf fit, the 27-year-old will lead hosts Morocco in the Africa Cup of Nations from December 21 as they seek to win the competition for the first time since 1976.\nTwice winner of the African award, Salah has been struggling lately after an outstanding contribution to Liverpool winning the Premier League a record-equalling 20th time last season.\nThe 33-year-old won the 2024-25 Premier League Golden Boot award with 29 goals, six more than Alexander Isak, who has since moved from Newcastle United to Liverpool.\nOsimhen, from top Turkish outfit Galatasaray, has been outstanding recently for club and country, but some of his achievements will not count as the deadline for the judges was October 15.\nThat rules out a Champions League hat-trick against Ajax in Amsterdam and two goals in a 2026 World Cup play-off victory over Gabon last Thursday.\nParis Saint-Germain star Ajibade was voted the best player at the Africa women’s Cup of Nations this year after Nigeria came from two goals behind to defeat hosts Morocco 3-2 in the final.\nSaudi Arabia-based Chebbak, the daughter of former Moroccan men’s star Larbi Chebbak, was the leading scorer in the competition with five goals.\nAnother Moroccan forward, Mssoudy has helped make Rabat club FAR one of the strongest in Africa. They won the CAF women’s Champion League three years ago and reached the 2025 semi-finals this weekend.\nThe annual African men’s and women’s awards ceremony will be staged in Moroccan capital Rabat on Wednesday.\nCAF technical and development committee members, coaches, former stars and selected media representatives selected the nominees.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 448,
  "scraped_at": "2026-02-14T02:09:38.463910",
  "_text_extracted": true
}