{
  "article_id": "3bf0e4dfc17a",
  "url": "https://www.caughtoffside.com/2026/01/01/man-united-evan-ndicka-talks/",
  "title": "Man United make enquiry for Evan Ndicka",
  "date": "20260101T223000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly keeping tabs on the Roma defender Evan Ndicka.\nThe Italian outfit are hoping to sign Joshua Zirkzee from the Premier League club, and Manchester United have taken an interest in the Ivorian defender.\nMan United keen on Evan Ndicka\nAccording to a report from AS Roma Live, Manchester United have asked about the defender during exploratory talks regarding Zirkzee.\nIt remains to be seen whether Roma are prepared to let Ndicka leave the club. He has a contract with the Italian club until 2028, and Manchester United might have to spend a reasonable amount of money to sign him.\nThe 26-year-old has established himself as a key player for the Italian club since joining them on a free transfer in 2023.\nMan United need Ndicka\nIt is no secret that Manchester United need more quality in the defensive unit. Signing the Ivorian defender would be ideal for them. He will help them tighten up at the back.\nHe has the physicality and technical attributes for English football, and he could make an immediate impact at Manchester United.\nThe Red Devils have looked quite vulnerable at the back this season. They will be hoping to compete in the UEFA Champions League, and the need for quality players is there. They need to plug the weaknesses on the side, and signing a reliable defender would be ideal.\nNdicka is at the peak of his career, and this could be the right time for him to take on a new challenge. The move to Old Trafford would be ideal for him.\nThe 26-year-old has the qualities to compete at the highest level, and he will look to establish himself as an important player for Manchester United.\nIf they can sign him for a reasonable amount of money, the deal could prove to be a masterstroke for Manchester United.\nMeanwhile, Zirkzee has no future at Manchester United, and joining Roma could be ideal for him. He played his best football with Bologna in Italy, and the return to his comfort zone could help bring out the best in the striker. It remains to be seen whether the two clubs can work out a deal that benefits them both.",
  "word_count": 368,
  "scraped_at": "2026-02-14T01:59:31.499645",
  "_text_extracted": true
}