{
  "article_id": "3c06ceb1c725",
  "url": "https://www.thereporterethiopia.com/38472/",
  "title": "Drama And Upsets Galore : AFCON Delivers Surprises | The Reporter | Latest Ethiopian News Today",
  "date": "20240203T071500Z",
  "domain": "thereporterethiopia.com",
  "source_country": "Ethiopia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Bamlak Tesema’s stellar officiating takes center stage, eyes finals\nThe Africa Cup of Nations (AFCON) is in full swing in Ivory Coast, and the quarterfinal matches have unleashed a whirlwind of unexpected outcomes. Highly rated national teams bid farewell in the early round of fixtures, leaving football fans in awe. Five of the top rated teams in the continent all were knocked out.\nGhana, Cameroon, Egypt, Morocco, and Senegal have all packed their bags and headed home, while the underdogs seized their chance and advanced to the quarterfinals.\nDemocratic Republic of Congo, Guinea, Cape Verde, Mali, South Africa, and Angola have all made it this far, defying all odds.\nThis year’s AFCON has been a captivating spectacle, brimming with drama and an air of unpredictability. Determining the eventual winner has become a near-impossible task as each match unfolds with intensity and surprises.\nAmidst all the action, one individual has shone brightly: Bamlak Tesema, an Ethiopian international referee selected among the elite group of 33 referees from various African countries officiating in this year’s AFCON tournament.\nBamlak has earned praise for his composed demeanor, impeccable decision-making, and effective management of the games.\nHis prowess as a referee was evident during the group stage, where he oversaw matches between the Democratic Republic of Congo and Zambia, as well as Cameroon and Zambia. He was also the fourth referee in the crucial playoff between Guinea and Equatorial Guinea.\nIn the ever-evolving world of football, refereeing has become an increasingly challenging task, with the introduction of video technology and the demand for accurate judgments. However, Bamlak’s exceptional performance has not only caught the attention of the Confederation of African Football (CAF) but also FIFA, leading to his repeated selection for important matches.\nBamlak’s journey as a referee began in 2003, and he achieved international referee status in 2009. Throughout the years, he has left an indelible mark on African football, officiating in various prestigious competitions, including the 2010 CECAFA Cup final.\nHis reputation as a top referee was further solidified during the 2014 FIFA qualifiers. But his involvement in the 2022 Cameroon AFCON semi-final between Senegal and Burkina Faso became a memorable moment. He used the Video Assistant Referee (VAR) technology to overturn two penalty decisions.\nNotably, Bamlak had the honor of officiating the 2023 African Champions League final at the iconic Mohammed V Stadium in Casablanca, Morocco. Despite facing criticism and complaints from Egyptian club Al Ahly, Bamlak displayed exceptional game management skills, proving his ability to thrive under pressure.\nFollowing his recent standout performance in the AFCON match between Cameroon and Gambia, Bamlak was the recipient of widespread acclaim on various social media platforms. His speed, strength, and ability to make accurate decisions in high-pressure situations were all highlighted.\nBamlak’s talents extend beyond the football field. He is also a medical researcher and a sociology graduate from Addis Ababa University.\nOne of the most anticipated moments of this year’s AFCON is the consideration given to Bamlak to officiate the final in Ivory Coast. While he has never led an AFCON final before, many voices suggest that he is more than capable of rising to the occasion.\nIf selected, Bamlak will follow in the footsteps of another Ethiopian referee, Tesfaye Ghebreyesus, who has previously officiated several AFCON final matches.",
  "word_count": 547,
  "scraped_at": "2026-02-14T02:07:39.557023",
  "_text_extracted": true
}