{
  "article_id": "3c1a8f91018a",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-transfer-rumours-news/2024/4/26/24126124/simone-inzaghi-arne-slot-sebastian-hoeness-roberto-de-zerbi-who-should-be-the-next-chelsea-manager",
  "title": "Inzaghi , Slot , Hoeneß , De Zerbi : Who should be the next Chelsea manager ? ",
  "date": "20240426T074500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea’s 2-2 draw against Sheffield United 5-0 loss against Arsenal was the latest in a long line of results that show that the Blues have not progressed under Mauricio Pochettino. While many call for his head, others ask for patience but we’re not here to figure out whether he should stay or go (emphasis on “go”).\nSimone Inzaghi, Arne Slot, Sebastian Hoeneß, Roberto De Zerbi: Who should be the next Chelsea manager?\nFront potential candidates to replace Mauricio Pochettino, with a focus on tactical ideas and fit\nWe are here to figure out if Pochettino were to go, what are (some of) the (better) options whom Boehly & Behdad could turn to. We did a similar breakdown last year (Pochettino was ranked the lowest) and if the B&B ownership duo had read that, maybe we wouldn’t be in this mess.\nManagerial Options\n- Simone Inzaghi (not to be confused with Filippo Inzaghi)\n- Arne Slot\n- Sebastian Hoeneß (not to be confused with Uli Hoeneß)\n- Roberto De Zerbi\nWe are not considering Rúben Amorim for this breakdown because according to multiple reports, he has a verbal agreement in place with Liverpool already. Beyond him, Julian Nagelsmann has already agreed an extension with the German National team, so it did not make much sense to include him. And just recently, Barcelona announced that Xavi will continue as their manager. Also, in the time it took to complete this article, Liverpool got linked with Arne Slot, such is life.\nOf course, there are also other options, like Thiago Motta, Michel, Hansi Flick etc.\nAlso, these stats are a week old — and Fellipe has plans for a more detailed data-driven breakdown of these targets as well.\nSimone Inzaghi (my preferred choice)\nFit: 9/10\nWhat do you get when you combine a traditionally rigid and boring formation (3-5-2) with an attacking mindset that is required in modern football? You get Inzaghi’s Inter (currently on top of Serie A) that have a goal difference of +60(!). For context, the next biggest goal difference in Serie A is a meagre +26 (AC Milan in 2nd, 14 points behind Inter).\nInzaghi’s Inter have scored 75 goals (joint highest out of any club in Europe’s top 5 leagues - only Arsenal match them), conceded 15 goals (lowest out of any club in Europe’s top 5 leagues) and have accumulated 82 points (highest out of... you get the point, they’re good, they’re extremely good!)\nTactics\nInzaghi’s Inter run with a 3-5-2 on its surface but in reality, it’s anything but that. A very simple photo can explain the previous statement.\nIn that screenshot from Inter’s first-leg 1-0 win over Atletico, we can see that all three of Inter’s CBs are actually ahead of their center-mids, who are now functioning as a makeshift CB-pairing. Result? That buildup led to the goal which won them the first leg. Unfortunately, over two legs, they lost to Atletico, but that’s not really an indictment considering the unpredictable nature of the Champions League. Besides, this is the same Inter that was in the Champions League final last season.\nIn buildup, Inter can build up with a back three or four depending on the level of pressing done by the opposition. When they do create a back four, it can be with one of the wingbacks dropping back while the other pushes forward. Or it can be with the WBs dropping back and one of the CBs pushing forward to join the midfield. Basically, the more time Inzaghi spends with the team, the more buildup variations get added.\nBy now, the idea must be clear: Inzaghi has coached Inter so well, and they have so many mix and variations to their play that it becomes very difficult to mark them out of the game. If the overlapping wingbacks don’t get you, their underlapping center-backs will. If they don’t get you, their CMs will drop deeper or push forward to create a numerical advantage in any part of the field they wish, and if that doesn’t get you, their constantly rotating striker duo will.\nThe basic idea is a balance between attack and defense but through quick buildup. However, sometimes Inter have shown a capability to build out slowly and hold possession.\nIn buildup, Inter, more often than not, like to push the ball high as quickly as possible. However, where they differ from most modern teams who do this (Pochettino does quick buildup at Chelsea as well) is that they don’t control the ball in your opposition half; instead, the majority of their buildup happens in their own half.\nOnce it’s gone out of defense, the ball is quickly played into the midfield for quick 1-2s, and before you know it, either a through ball or an early cross is played into the strikers who are running towards the opposition goal. This part sounds similar to Pochettino, right? It differs in one thing: where the buildup happens. Since a lot of Inter’s buildup is quite deep in their own half, they’re inviting you to press them which pushes the other team’s backline up, leaving a lot of space for their forwards and third CM to run into.\nOf course, no tactic is perfect and everything can be beaten. While this quick buildup is their biggest strength, it’s also the biggest weakness. If an opposition is just willing to sit back, park the bus, and try to hit you on the counter, fast buildup like Inzaghi’s leaves you open to counters because you’re trying to get up as quickly as possible.\nAnother issue that could potentially arise is that our players seem to lack concentration, and playing in any system that requires you to keep shifting between different shapes and formations requires you to have concentration.\nOf course, Inzaghi has coached his players extremely well, and his players’ concentration also has something to do with his coaching methods, but so far, this Chelsea squad has shown an innate ability to just lose concentration through various stretches of a game. Inzaghi might fix it or it could be an inherent trait in some of these players; only time will tell. It’s like watching a group of puppies trying to focus on a single toy—sometimes they’re all in, and other times they’re chasing butterflies.\nHow does it fit Chelsea?\nPerfectly. It fits Chelsea’s squad perfectly.\nWhat is our current biggest weakness? We have conceded 2 or more goals in many games in a row. Our defense is quite porous, and our center-backs are quite error-prone. The back three takes care of that, stopping our center-backs from being isolated. Another aspect is that we have players who can play the underlapping center-back role really well due to their technical, defensive, and physical skills: Levi Colwill (when fit), Wesley Fofana (when fit), and Reece James (when fit) can all play the wide underlapping center-back role to perfection.\nWhat is our biggest strength? Excluding Palmer, on paper, our biggest strength should be our midfield: Enzo, Caicedo, Gallagher, Lavia, Ugochukwu, Chukwuemeka, Casadei. The midfield 3 of Inzaghi’s formation requires CMs who are all-rounders. It requires players who are decent in multiple areas like passing, movement, defense, press resistance, etc. It requires jack-of-all-trades type midfielders, and we have them in abundance.\nOf course, we have great wingbacks as well in Reece James (when fit), Ben Chilwell (when fit), Malo Gusto, etc. In fact, I could also see some of our attacking players being converted into wingbacks, especially since one of the wingbacks in Inzaghi’s system is pushed quite high.\nThe only part where we might need to make certain changes is upfront, but not that much, if we look closely. Out of the 2 forwards upfront, one of them drops deeper while the other pins the opposition defense back through its runs. Both Nkunku and Palmer would be great in the deep striker role, while Nicolas Jackson does suit the “creating nuisance” forward role. However, it would be ideal if we got someone a little more clinical in the striker role to alleviate the pressure on Jackson’s shoulders.\nThis system also gets rid of our weakness: wingers. Palmer effectively just runs in a free role, but beyond him, our winger situation isn’t the best. Sterling has seen better days, Mudryk and Madueke, while they have shown glimpses, they’ve not set the world on fire. Besides, I’m certain Inzaghi will figure out a way to integrate these players in some way or another into his system.\nArne Slot\nFit: 7/10\nArne Slot is riding the Dutch coaching wave like a pro surfer, joining the ranks of Ten Hag (not exactly the best company, I know) and other rising stars. He steered Feyenoord to an Eredivisie title last season and even took them on a Europa League adventure that ended with a run-in with Mourinho’s Roma.\nCurrently, Slot’s Feyenoord are chilling in 2nd place with a cozy 69 points (at the time of writing this article), a solid 9 points ahead of 3rd-placed FC Twente at 60 points. However, overtaking first-placed PSV Eindhoven, who are sitting pretty with 78 points, seems about as likely as finding a unicorn in your backyard.\nTactics\nSlot’s philosophy aligns with many highly-rated new managers: attack. He frequently employs a 4-2-3-1 or a 4-3-3 formation, but the core principles remain constant. Slot opts for a back four, often complemented by a double pivot in midfield, with wingers positioned high and wide to exploit space during buildup.\nWhen executed effectively, this approach yields impressive results, as demonstrated in their recent 6-0 thrashing of Ajax. Feyenoord boasted an xG of 3.62 (compared to Ajax’s 0.11), unleashed 30 shots (while Ajax managed just 1), and created 10 big chances (with Ajax failing to produce any). Dominating a team in 6th place showcases Slot’s commitment to attacking football and his team’s ruthless efficiency.\nDefensively, Feyenoord can adopt a 4-4-2 block, with wingers providing support to the full-backs, while the attacking midfielder presses alongside the striker to apply pressure on the opposition’s center-backs when facing a 4-2-3-1 setup. However, this defensive structure adjusts when playing in a 4-3-3 formation, with wingers taking narrower positions and the pressing pattern shifting to involve the front three as the primary pressure points.\nNo discussion of Slot’s tactics would be complete without mentioning his fondness for cut-backs. The man loves them. In fact, low cut-backs, combined with high-intensity pressing, serve as one of Feyenoord’s primary methods for creating scoring opportunities.\nHow does it fit Chelsea?\nThe fit is good, but not great and that good fit is also provided that Slot is able to impart his philosophy onto the players really well.\nFirst of all, in Slot-ball (at least at Feyenoord), the main attacking threat comes from the quartet of wingers, strikers and CAM/CM depending on which formation they play. It is worth reminding that wingers are our weakest spot in the team.\nMudryk and Madueke have not exactly developed to the point where we can have them as focal point of our attack. Nicolas Jackson has been wasteful and low on confidence. Of course, Slot could develop them into world-beaters but the idea for this tactical breakdown to see where we currently stand and which coach can easily push us to the next level without an extreme amount of intervention required.\nHence, your typical 4-2-3-1 might not work that well, especially considering players like Nkunku and Palmer, who are neither wingers nor CAMs, they operate in half-spaces to have the most devastating impact. This leaves us with Slot’s 4-3-3 which could be a more viable solution. Slot could run with a front 3 of Nkunku-Jackson-Palmer, especially since all 3 are great at pressing and two of the three are very clinical.\nThis also suits our midfielders better because I don’t think Enzo can be trusted yet defensively to function in a pivot without it haunting us and he can’t play as a CAM, as Pochettino’s failed experiment has shown us.\nSebastian Hoeneß\nFit: 6/10\nWhile Bayer Leverkusen have grabbed all the plaudits, rightly so, for finally dethroning Bayern Munich and winning the Bundesliga, there is another German club that has been a surprise package this season: VfB Stuttgart.\nStuttgart currently lie 3rd in Bundesliga, a reality which is in stark difference to the one they were faced with last season. With relegation seeming certain, Stuttgart appointed Sebastian Hoeneß in April 2023. In the last 8 games he managed of the season, Hoeneß managed to lose only once, winning 3 and drawing 4. He then went on to win the relegation playoffs against Hamburger SV 6-1 on aggregate, quite comfortably.\nTactics\nHoeneß largely deployes a 4-2-3-1 or a 4-4-2 at Stuttgart, however, we did see him pull out a 3 at the back against Dortmund in their 1-0 win on 6th April. Basic idea from the young German manager is to be proactive, press, counter press and attack but still remain compact in defence.\nFocusing defence first, Stuttgart often set up in some variation of a 4-4-2 block. One crucial aspect of their defence is that they set up in quite a narrow block. Basically, they push the entire team to one side of the pitch (whichever side has the ball).\nAnother aspect is that they keep the central part of the pitch as congested as possible. Basically, the idea is to push everyone to one side and then block all the central players to stop the ball from going to the other side. They will push you to one side and box you in.\nOf course, like anyone can see, this leaves them very exposed to long balls, especially in wider areas but this is something they willingly sacrifice as they feel that the benefits outweigh the risks.\nIn terms of attack, Stuttgart rely on their extreme movement, dribbling and utilization of space. Even though they enjoy more possession of the ball, they try to progress and attack quickly through variety of methods.\nThey use through balls from central areas to utilize their movement and rotations but they’re also not shy of crossing. They don’t spam crosses but when they do, it is a dangerous one.\nHow does it fit Chelsea?\nWell, it is a good fit for the squad, might not be the best fit for the Premier League. In terms of the squad, a narrow back four might not be the best fit for our marauding wingbacks like Ben Chilwell.\nThe 2 up front can work with either Nkunku or Palmer as second striker and Jackson as the other one (although, it’s pretty expected that we sign another striker). The double pivot also fits us and we can play Caicedo-Enzo/Gallagher.\nNow coming to the league fit, the way Hoeneß likes to defend could be a major issue. He loves an extremely narrow defence and sacrificing the wider areas which opens his teams up to long balls and counters from low blocks, something that Premier League teams tend to specialize in.\nHis tendency to leave space out wide would be picked up by all the Premier League managers quite quickly and they would start spamming long balls to other side. This is the same league that targeted Trend Alexander-Arnold’s side incessantly once they figured out his defensive weaknesses, they would try to do the same to Hoeneß.\nOf course, German teams would know the same and would have tried to exploit it as well, yet Stuttgart are still in third. The only difference being, their team is experienced whereas our team’s mental frailties are quite known at this point. A bad run of results and everything could go down and this extreme-narrowness could provide the perfect springboard for that bad run of results.\nRoberto De Zerbi\nFit: 8/10\nPersonally, I don’t think Roberto De Zerbi will move to us but it’s the Brighton connection. Time and time again, our owners have shown that not only do they not know much about football but they also think Brighton and their “profit-driven” model is the the best in the world, according to them. After all, screw trophies, am I right? Profit FC is what matters.\nRoberto De Zerbi is another progressive manager. You know, usual stuff: possession-focus, high pressing, quick passing and movement. After all, Pep called him the “most influential manager in the last 20 years” but he also called us a good team, so you know, take what Pep says with a grain of salt. Let’s move on to his tactics in a little detail.\nTactics\nTo put it simply, there are 3 clear philosophies of any De Zerbi team: keep the ball, be proactive with the ball and work with passion.\nFirst of all, De Zerbi’s teams treat the ball like it’s their first-born — never letting it go without a fight. In fact, De Zerbi loves controlling the central areas of the pitch. The idea is to do the little things right, coach every thing in detail, do the little things to gain a numerical advantage over the opponent and then turn that advantage into opportunities.\nIt could be something as small as Levi Colwill putting his studs on the ball and standing idle during their buildup in order to trigger a press by the opposition: every little bit counts.\nOn paper, De Zerbi plays a 4-2-3-1 but it often changes in buildup, often resembling a 4-4-2 in buildup to take of advantage of the “third man” concept. De Zerbi teams utilize “third man passes” to build out and often utilize it as a way to break past the opposition press.\nWhat is the third man concept? Basically, you create triangles and you pass it from one player to another (first pass) and as that player is getting pressed, he passes it (second pass) to the third man who is nearby, thereby relieving pressure. Most teams use it, De Zerbi is obsessed with this, in fact, it often seems like his teams are more focused on the second pass to the third man than the initial pass.\nIn buildup, the idea is simple: build out from the back. Opposition is pressing you? Use the third man but build out from the back. Opposition is pressing you even more? Well, get another player to drop back and create more third man passes until you build out from the back. Opposition is pressing you even more? Well... you get the gist. Numerical superiority, third man passes, build out from the back.\nDe Zerbi teams will constantly pass the ball and even often, standing idle until they get you to press and the moment you press, there is space which was not there before and that’s what they were waiting for. Therein lies the issue.\nWhile De Zerbi tactics are extremely progressive, it does rely on you leaving behind space and if you’re stubborn and don’t leave space? Well, then it’s difficult for them to win and you get Roma 4 - 0 Brighton where Brighton had 60% possession or Fulham 3 - 0 Brighton, where Brighton enjoyed 70% possession.\nOff the ball, De Zerbi teams employ an aggressive man-to-man press. Idea? Again, control, control, control. You control the space, you let the other team have the ball in areas where you’re okay with them having the ball. Once you win the ball, you utilize your advanced third-man passes to create space based on opposition mistakes, the kind of space that only exists for counter attacking teams is now available to a possession based team.\nHow does it fit Chelsea?\nQuite well. We already have Colwill and Caicedo from Brighton, they know very well what it means to play in a De Zerbi system and they have done well. It’s also hard to imagine that players like Enzo, Nkunku, Palmer would struggle in his system, they would largely succeed and also appreciate the level of tactical focus that he brings to this young squad and his attention to detail.\nIn terms of a league fit, De Zerbi has already played in the Premier League, while it does seem like his team has been found out a little bit this season, I am sure if he had superior players like Palmer, Caicedo, Enzo etc. at his disposal, he would be doing a lot better.\nHowever, it is difficult to imagine he would want to shift to Chelsea. Time and time again, Chelsea have poached his players, his sporting directors, his scouts and he has seen his predecessor in Graham Potter do the mistake of jumping to Chelsea and then getting chewed out.\nWhile he is a good fit, it’s doubtful this happens.\nAnd there we have it. If you have made it so far, congratulations, you’ve officially put in more effort in tactics than Pochettino has all season. In conclusion, Inzaghi and De Zerbi are the best fits, followed by Slot and Hoeneß.",
  "word_count": 3476,
  "scraped_at": "2026-02-14T01:51:24.790381",
  "_text_extracted": true
}