{
  "article_id": "3c45060f0c5e",
  "url": "https://www.premierleague.com/news/3488764",
  "title": "Haaland stats are best yet , but can get better",
  "date": "20230527T130000Z",
  "domain": "premierleague.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Erling Haaland is named as the 2022/23 EA SPORTS Player of the Season and Hublot Young Player of the Season, Alex Keble looks at the Norwegian's feats this season and sees room for improvement.\nPlayer analysis - Erling Haaland\nIn the analysis that has followed Manchester City’s fifth Premier League title under Pep Guardiola and Haaland's record-breaking debut season in English football, the focus has been on how these two modern greats, stylistically opposed to one another, have adapted to make the relationship work.\nIt may be the predominant story of Man City’s 2022/23 season, but this angle probably doesn’t give enough credit to Haaland, to how this season fits in with the rest of his career so far and the rapid development that continues at pace in Manchester.\nWords used to define Haaland - robot, machine - although said tongue in cheek, tend to minimise his hard work and self-improvement. Of course, in reality, he is just like any other footballer: prone to ups and downs, and, as terrifying as this might sound, still learning.\nSee: Record-breaker Haaland: His amazing stats\nHere’s a look at the numbers behind his 2022/23 season in the context of his career so far.\nHaaland has already broken the Premier League record for goals in a single season, scoring 36, and smashed the record for goals in all competitions by a player at a Premier League club (52). The latter was jointly held by Mohamed Salah (44) in 2017/18 and Ruud van Nistelrooy (44) in 2002/02.\nThese numbers are particularly rare for a Guardiola side, who tend to spread goals around the team. Haaland is set to become the first City player to win the Premier League Golden Boot since Guardiola’s arrival, while the previous highest proportion of goals scored by a single player in one of Man City’s title-winning seasons was Sergio Aguero, who got 24.7 per cent in 2011/12. Haaland’s figure is an astonishing 38 per cent.\nAt one point it looked as though Dixie Dean’s all-time English football record of 63 goals in 1927/28 was under threat but, with three matches of Haaland’s season remaining, that no longer seems possible. Similarly, he is five short of Cristiano Ronaldo’s record tally of 17 in a single UEFA Champions League season.\nThere’s room for improvement, then. And the bad news for everyone else is that Haaland remains on an upward trajectory.\nBest season yet\nThe peak of Haaland’s goalscoring came during his final half-season at Red Bull Salzburg in 2019/20. But if we consider the standard of the Austrian Bundesliga perhaps a little too low to compare fairly to Germany or England (they rank 10th in UEFA’s coefficient, just below Scotland and just above Serbia), then we can look on Haaland’s 2022/23 as his best yet.\nHe is scoring 1.17 goals per 90 and has 45 Premier League goal involvements, on both counts Haaland’s best since joining Borussia Dortmund in 2020, while his shot and expected goals (xG) numbers reveal he is contributing more in the final third than ever before.\nHaaland goal stats last four seasons\nThe main reason for Haaland’s increased shot and goal record, could be that City’s possession and territorial dominance means he is simply higher up the pitch for longer periods.\nAt Dortmund, where faster transitional football is preferred to Guardiola’s patient possession, Haaland was actually more involved in open play: across three years in Germany Haaland averaged 13.9 passes per 90 and 29.5 touches per 90, more than his 2022/23 average of 11.7 passes and 24.8 touches.\nStill, he has hit a career-high eight assists, and there is reason to assume Haaland's number of passes and touches will go up once he is used to the Man City style – and once they are used to him.\nCan team-mates make him better?\nIt is notable that Haaland is fourth in the Premier League charts for total runs (990), despite his unusually low number of touches. Eventually the Man City players will spot his movement and seek him out.\nAnd eventually, he will move to another level. Haaland is still only 22 and, like Jack Grealish this season and countless other examples in the Guardiola era, Man City players tend to improve significantly in their second year.\nIf that wasn’t reason enough, then consider that Haaland has missed 28 ‘big chances’ this season - eight more than anyone else.\nHaaland has not yet peaked yet. More records will fall next year.",
  "word_count": 744,
  "scraped_at": "2026-02-14T02:03:44.218526",
  "_text_extracted": true
}