{
  "article_id": "3c55f0dd257d",
  "url": "https://www.firstpost.com/entertainment/david-beckham-reflects-on-highs-and-lows-in-beckham-doc-calls-it-an-emotional-rollercoasterdavid-beckham-delves-bac-13194362.html",
  "title": "David Beckham reflects on highs and lows in  Beckham  doc , calls it an  emotional rollercoasterDavid Beckham delves bac - Entertainment News , Firstpost",
  "date": "20231002T123000Z",
  "domain": "firstpost.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Beckham delves back into the hateful treatment he received following his infamous 1998 World Cup red card — and its impact on him — in a new Netflix documentary series pegged to the 10th anniversary of his retirement. “This whole process has been like an emotional rollercoaster,” Beckham said of the “Beckham” series in an exclusive video interview with The Associated Press. “I’ve never talked about these certain moments in my career and in my life.”\nThe intimate four-part series explores Beckham’s upbringing, his courtship with his wife and his triumphs on the field, but perhaps the most difficult part was revisiting his painful sending off during England’s World Cup match against Argentina. “I hadn’t actually watched it and I hadn’t actually watched the interviews and what people said about me after,” he said, adding that it left him “shocked and emotional.”\nBeckham was red-carded for deliberately kicking the back of Diego Simeone’s leg. He lashed out after the Argentina captain pushed him to the ground. England’s World Cup hopes were crushed, and Beckham instantly went from hero to villain. Beckham includes footage of the hatred the soccer star received — condemnation in British tabloids and constant fan abuse, including one who hung his effigy from a noose outside a London pub. “I knew it was bad at the time, but going over that whole that whole thing was quite a tough one,” he told the AP.\nThe backlash continued throughout the next season. “It wasn’t just stepping onto a football pitch, it was every time that I went out in my car and people stopped me and spat at my window and you know, all of those things, and then walking into a restaurant knowing that everybody in there hates you.” Best friend David Gardner recalls how Beckham even had to be accompanied by friends in the bathroom for his safety, yet never retaliated. Despite the full support of Manchester United fans and club manager Sir Alex Ferguson, Beckham said there wasn’t the same knowledge or concern about mental health that exists now.\n“Back then there wasn’t anyone turning round to me and saying, ‘Are you OK? Are you sure you’re OK? Let’s talk about it.’” Even his own family struggled to understand. “Twenty five years ago, if I’d have turned around to my dad and said that I don’t feel great, he would have said, ‘Boy, just get on with it’. So that’s how I grew up and that’s how I knew how to kind of handle a situation like that,” he said. “I became, I wouldn’t say a cold person, but I was able to block things out that were challenging and difficult for me at the time” he added, saying it helped him grow as a player and as a person. “I’m not a person that sits and reflects on past achievements and things like that” Beckham said, explaining that he learned from an early age that you can win a trophy and celebrate that evening, “but then the next day you’re on to the next season and you’re on to something else. “ The first episode, which debuts Oct. 4, explores young David’s upbringing in Chingford, Essex, and his relationship with his father.\n“He was a very disciplined dad from a very early age. And when I didn’t play well, he told me and when I did play well, he kind of told me that I did play well, but not too much,” Beckham said with a smile. It had always been his father’s dream that his son play in the premiership for Manchester United and it soon became their shared dream, turned reality. After being spotted by a scout playing on London’s Hackney Marshes, Beckham moved to Manchester at 15. The tough love continued under Ferguson. Their partnership helped Beckham win six Premier League titles, two FA Cups and one Champions League. “Without a doubt, me getting out of London at that time and becoming a Manchester United player, in the north, surrounded by unbelievable people – that for me without doubt helped me have the success and have the career that I had had and have,” he said. “Having the discipline of Sir Alex Ferguson possibly was one of the biggest reasons why I was able to succeed.” But the discipline didn’t rub off when it comes to his own four children Brooklyn, Romeo, Cruz and Harper Seven, who all appear in the documentary. Beckham admits his wife is “pretty strict” and he finds it hard to lay down the law. “I always thought growing up, if I was to become a young dad, I would be like my dad. I would support my kids with going into football and be hard with them. But I was nowhere near like my dad was. I’m a bit of a softie.”\nMeeting Spice Girl Victoria Adams was a pivotal moment in Beckham’s life. She was already a global superstar as “Posh Spice” and he was a rising talent with Manchester United. “It wasn’t something that normally happens, you know, a footballer and a pop star coming together and the pressures of that but also her being on the world tour, me really wanting to see her. But obviously I couldn’t travel. So, we used to sneak around.” He said they managed to keep their relationship secret for the first few months and then “the explosion happened.” Beckham’s teammate and close friend Gary Neville jokes on “Beckham” about the pair’s long phone calls into the early hours before a game and says Beckham would drive for four hours just to spend 20 minutes with her. Part three and four of the series were not available for review prior to Beckham’s interview, but those episodes explore his explosive fallout with Ferguson, his sale to Real Madrid and tabloid allegations of Beckham’s extra-marital affairs. “There are pressures, but you work hard,” Beckham said of his marriage. And despite press speculation, the couple recently celebrated their 24th wedding anniversary and remain a united force. “I suppose that’s one of the reasons why we’re so, so strong as a couple, because, yes, we have amazing kids, we have amazing careers, but we … make time for each other as well.“ Beckham’s career spread far beyond his success as a player to cultural icon and entrepreneur. He was a trailblazer for collaborations with brands like Adidas, Armani, Breitling and more. While players weren’t really doing similar deals at the time, he said it felt like a natural progression enabled by his success on the football pitch.\nHe knew early on that “Brand Beckham” would broaden and lengthen his career if he could achieve a good balance. “I always made sure that whatever I was doing off the field never affected what I was doing on the field because that was what I loved and what was important to me.” His business savvy culminated in ownership of his own soccer team, Inter Miami. “I had the opportunity to play in different countries, move to America, obviously have my own franchise and my own team, become an owner,” he said. “So then once I finished playing, I knew that the moment I finished playing, I could then jump into the business. But, we were working on that a long time before that.” Looking back on his career’s highs and lows, it’s natural to wonder: Does Beckham have regrets? “Do I wish things hadn’t happened? Absolutely. Do I wish ’98 hadn’t happened? Absolutely.” But he said he realized it all happened for a reason. “It made me stronger as a person, as a player, as a human being, and as a father, as a husband,” he said. “And if that hadn’t have happened, I maybe I wouldn’t have had the career that I had.”",
  "word_count": 1301,
  "scraped_at": "2026-02-14T01:48:28.231414",
  "_text_extracted": true
}