{
  "article_id": "3cc8d4487044",
  "url": "https://cartilagefreecaptain.sbnation.com/2025/6/7/24444949/tottenham-hotspur-transfer-news-rumors-yves-bissouma-fenerbahce-jose-mourinho",
  "title": "REPORT : Fenerbahce  closing in  on loan - to - buy for Yves Bissouma",
  "date": "20250607T171500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "So what if Tottenham Hotspur don’t have a head coach right now. Do you think that’s going to stop the summer transfer rumors? I don’t think so. The latest report from the wilds of Bat Country (actually Turkish newspaper Fanatik) suggests that Fenerbahçe are in “advance negotiations” with Spurs to sign Yves Bissouma on loan, with a purchase obligation at the end of next season.\nREPORT: Fenerbahce “closing in” on loan-to-buy for Yves Bissouma\nThis should probably happen! But it’s the Turkish media...\nAnd do you know who is currently the head coach at Fener? That’s right — this guy.\nOK, y’all KNOW what I think of the Turkish football media. In short — it’s probably one of the least reliable sources of transfer information out there. While there is some reliable news to be found, a good deal of Turkish media sources just literally make shit up. So am I sold on this rumor? No, not in the slightest. Do I think it’s plausible? ...Yeah!\nThe report, which is brief, says that Spurs value Bissouma at €25m (£21m) but this particular deal would be basically a cheap loan fee and with an obligation. It notably doesn’t say what that obligation would be, but with Yves in the last year of his contract it’s likely going to be less than his stated value. This is the first interest I’ve seen from other clubs for Bissouma, though I’d be surprised if it’s the only destination he has.\nTottenham need an upgrade on their midfield no matter who the coach is, and with both Bissouma and Rodrigo Bentancur both entering into the final year of their contracts one of them is likely to go. Bissouma seems like the most likely, though somehow I feel like he’s more likely to head to France than to Turkey. But I guess maybe not!\nBissouma’s been a good player for us but his skill set can be replicated with a younger midfielder and that’s what I expect Spurs to do. We’ll see if this report gets picked up somewhere more reliable.",
  "word_count": 345,
  "scraped_at": "2026-02-14T01:58:41.952911",
  "_text_extracted": true
}