{
  "article_id": "3cd0130b8670",
  "url": "https://www.masslive.com/tv/2025/01/watch-minnesota-timberwolves-vs-dallas-mavericks-free-live-stream.html",
  "title": "Watch Minnesota Timberwolves vs . Dallas Mavericks free live stream",
  "date": "20250123T011500Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There is NBA action on Wednesday, Jan. 22 with a rematch of last season’s Western Conference Finals with the Dallas Mavericks hosting the Minnesota Timberwolves at American Airlines Center in Dallas.\nThe game is scheduled to start at 7:30 p.m. EST and will be broadcast on ESPN. Fans looking to watch this NBA game can do so for free by using DirecTV Stream, which offers a free trial. They can also watch with FuboTV, which also offers a free trial and $30 off your first month, or SlingTV, which doesn’t offer a free trial but has promotional offers available.\nThe Timberwolves are coming into this matchup at 22-21 while the Mavericks come in at 23-20.\nWho: Minnesota Timberwolves vs. Dallas Mavericks\nWhen: Wednesday, Jan. 22 at 7:30 p.m. EST\nWhere: American Airlines Center in Dallas\nStream: FuboTV; Sling; DirecTV Stream (free trial)\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nMore College Football\n- 2026 CFP National Championship: Watch Miami vs. Indiana for free tonight\n- Where to watch Miami vs. Indiana National Championship free stream today\n- Ticket costs surge for Miami vs. Indiana college football championship game\n- Where to watch Oregon vs. Indiana Peach Bowl free stream today: College Football Playoff Semifinal\n- Where to watch Oregon vs. Indiana in Peach Bowl for free tonight\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and $30 off the first month for new customers.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is SlingTV?\nSlingTV offers a variety of live programing ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancelation.\nRELATED CONTENT:\nMike Tirico will be lead play-by-play announcer when NBC begins its NBA coverage next season\nBy JOE REEDY AP Sports Writer\nMike Tirico has been officially named as NBC’s lead play-by-play announcer when it begins its coverage of the NBA next season.\nThe move is not a surprise, since many expected that to happen when NBC agreed to an 11-year contract with the NBA last summer. Tirico was part of ESPN and ABC’s coverage of the league until moving to NBC in July 2016. He also called six NBA Finals on ESPN Radio.\nAccording to research from the 506 Sports Archive, Tirico called 313 NBA regular-season and playoff games on ESPN and ABC.\nTirico will have another busy 10-month stretch from September through May 2026. He calls the “Sunday Night Football” package, which will include Super Bowl 60, and will lead NBC’s Olympics coverage as the prime time host of the Milan-Cortina Winter Games.\nTirico will call select games on NBC and Peacock the first half of the season, including the season opener in October.\n“My 15 years of chronicling the best basketball players in the world still stands as one of the highlights of my career,” Tirico said in a statement. “Like so many others, my love of the league took hold during the unforgettable days of the NBA on NBC back in the ’90s. The chance to be a part of the team bringing that iconic partnership back to life has us incredibly excited.”\nNBC, which carried NBA games from 1990 through 2002, will have up to 100 regular-season games, including on Sunday night once the NFL season has ended. It will also have games on Tuesday throughout the regular season, while a Monday night doubleheader would be exclusively streamed on Peacock. NBC will also have the All-Star Game and All-Star Saturday Night.\nDuring the playoffs, NBC and/or Peacock will have up to 28 games the first two rounds, with at least half on NBC. It also will carry one of the two conference finals in six of the 11 years of the deal.\nWith the All-Star Game less than a month away, the hiring cycle for NBC, ESPN/ABC and Prime Video for next season is expected to ramp up.\nNBC previously announced that Jamal Crawford will be a game analyst and Frank DiGraci will serve as coordinating producer while Prime Video named Taylor Rooks, Blake Griffin and Dirk Nowitzki to its studio show.\n“Inside the NBA” will appear on ESPN and ABC beginning next season as part of a settlement between Warner Bros. Discovery and the NBA. This is the final season of NBA coverage on TNT.\nNoah Eagle, who does college football, college basketball and some NFL games, is also expected to be a part of NBC’s coverage even though an announcement has not been made. Jalen Rose is a game analyst for college basketball on NBC/Peacock, but does have NBA studio and analyst experience from his time with ESPN/ABC.\n“It’s been a fun challenge putting the puzzle pieces together to create a new team for one of the most exciting launches in our company’s history,” said NBC Sports executive producer Sam Flood, who is overseeing the process. “It’s still very early in the process, but Mike, Jamal, and Frank provide a great foundation that we’ll build upon.”\nThe Associated Press contributed to this article",
  "word_count": 956,
  "scraped_at": "2026-02-14T02:26:28.928232",
  "_text_extracted": true
}