{
  "article_id": "3d16b590c634",
  "url": "https://menafn.com/1107960038/Premier-League-Talking-Points-Arsenal-Take-Advantage-Of-City-Liverpool-Draw-To-Seize-Pole-Position",
  "title": "Premier League Talking Points : Arsenal Take Advantage Of City - Liverpool Draw To Seize Pole Position",
  "date": "20240311T090000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League Talking Points: Arsenal Take Advantage Of City-Liverpool Draw To Seize Pole Position\nHere are the talking points from weekend's Premier League games:\nGuardiola's ruthless touch\nWhen Manchester City's Kevin De Bruyne was substituted after 69 minutes of a rip-roaring contest at Anfield with the game locked at 1-1 and top spot up for grabs there was widespread surprise, not least from the Belgian playmaker.\nDe Bruyne, a key component of five Premier League title triumphs, was not impressed and made his feelings known to manager Pep Guardiola who sent on the more defensively-minded Mateo Kovacic.\nCity hung on for the draw in the face of a Liverpool onslaught, vindicating Guardiola's decision -- as if anyone would ever doubt the wisdom of the Spanish serial winner.\nIt showed the high standards Guardiola sets and that no player, not even De Bruyne, is bigger than the collective.\n\"He will have a chance in the next game to prove how wrong I was, so next time he'll have it. It's fine,\" Guardiola said.\nFuture bright at Liverpool\nJuergen Klopp may be entering the final months of his Liverpool reign but the German will leave behind a squad equipped to battle for silverware for many years.\nA lengthy injury might have derailed Liverpool but Klopp's faith in youth has been richly rewarded and Jarell Quansah typified that on Sunday during the 1-1 draw with Man City.\nThe 21-year-old centre back, making his sixth league start of the season after injury ruled out Ibrahima Konate, was superb alongside Virgil van Dijk in nullifying the threat of City's goal-machine Erling Haaland.\nWith Conor Bradley (20) and Harvey Elliott (20) also starting, it was the first time Liverpool had named three players aged 21 or under in a league clash against City since 2015. All three proved up to the biggest test in English football and could have huge roles to play in the weeks ahead.\nVilla's tactics\nFive points ahead of Tottenham Hotspur ahead of Sunday's clash, Aston Villa's pursuit of Champions League football for the first time suffered a serious blow as their defensive tactics back-fired, resulting in a 4-0 drubbing for Unai Emery's side.\nThe 1982 European Cup winners have never played in Europe's premier club competition in its modern form, and Sunday's comprehensive defeat at the hands of Spurs means they might have to wait another year for the chance to do so.\nFrom the off, Villa struggled to play out from the back but for some reason they persisted, ultimately coughing up possession that led directly to goals and an overall defensive collapse in the second half.\nConceding four times handed the goal difference advantage back to Spurs, and a red card for John McGinn for a violent tackle and a likely three-match ban to follow will make their task all the harder as the season reaches its climax.\nArsenal in title race\nIt was about this time last year that Arsenal began to wilt in a two-horse title race with Manchester City.\nTwelve months on, however, they look far more durable and one of the main reasons for that is Declan Rice.\nThere were some raised eyebrows when Arsenal forked out around 100 million pounds ($128.58 million) to sign Rice from West Ham United, but there is no price on what he brought to the team.\nThe midfielder's calm authority was evident again on Saturday as he scored Arsenal's opener against Brentford and then cajoled his team mates after a mistake by goalkeeper Aaron Ramsdale had allowed the visitors to level.\nEverton pay the penalty\nOn the face of it, Saturday's 2-0 win over struggling Everton is a run-of-the-mill Premier League victory for Erik ten Hag's Manchester United, but winning thanks to two penalties suggests that all is not yet right at Old Trafford.\nLanguishing in 16th spot, 10 places and 22 points behind United after Saturday's clash, Everton's statistics told a different story to the scoreboard, suggesting United were lucky to get away with all three points.\nThe Toffees registered 23 efforts on goal, splitting possession almost evenly with their illustrious opponents and winning the corner count by a margin of eight to five.\nWhere they fell down was spot kicks conceded, with two rash tackles resulting in penalty goals for Bruno Fernandes and Marcus Rashford, both coming in the first half.\nThough Ten Hag will likely chalk it down as one league game of 38, his data analysts may have some strong feedback for him on Monday morning after another underwhelming display.\nALSO READ\n- Liverpool manager Klopp extends contract to 2024\n- Emirates, Arsenal renew sponsorship deal\n- Champions League final: Moments of ecstasy, triumph and tears as Manchester City completes historic treble win\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 844,
  "scraped_at": "2026-02-14T01:54:34.175287",
  "_text_extracted": true
}