{
  "article_id": "3d3436c59a51",
  "url": "https://www.teamtalk.com/news/cristiano-ronaldo-talks-huge-decision-club-future-2026-world-cup-dream",
  "title": "Cristiano Ronaldo in talks over huge decision for club future while keeping 2026 World Cup dream alive",
  "date": "20240929T121500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo in talks over huge decision for club future while keeping 2026 World Cup dream alive\nCristiano Ronaldo is working towards a dream relating to the 2026 World Cup in the United States, Canada and Mexico – and now conversations are underway to make sure his club future is resolved before then.\nRonaldo will be 41 years old by the time the next World Cup comes around, but since it presents him with the opportunity to set a new record of playing in six editions of the tournament, the Portugal forward is insistent upon being part of it.\nBefore then, though, he needs to firm up which club he will be playing for. As things stand, Ronaldo is due to reach the end of his contract with Al-Nassr at the end of the 2024-25 season.\nRonaldo’s move to Al-Nassr in January 2023 was the catalyst for an abundance of high profile moves to the Saudi Pro League since, and he has retained his role in the Portugal national team during his time there.\nNow, according to Italian journalist Nicolo Schira, Al-Nassr have opened talks with Ronaldo about extending his contract.\nAs a side note, Schira’s update emphasises that Ronaldo wants to play at the 2026 World Cup. Should Al-Nassr succeed in renewing his terms, they would be the club he would be playing for in the build up to it.\nThere are no details yet of how Ronaldo’s salary might change with a new deal in Saudi Arabia. He is already the highest-paid footballer in the world, taking home €200m per year (£167m/$223m).\nFurthermore, Schira has not shared Ronaldo’s stance on continuing his career with Al-Nassr, for whom he has scored 64 goals from 71 appearances.\nREAD MORE: Erling Haaland tipped to seal Saudi Arabia switch as pundit makes £200m transfer claim\nOptions limited for Ronaldo\nDespite his pedigree as a five-time Ballon d’Or winner, there have been very few reports about other clubs interested in Ronaldo, so it is not too surprising to see him in talks to extend his lucrative Saudi spell.\nHe admitted back in August that, despite some believing he could finish his career back at Sporting, he was envisaging eventually retiring at Al-Nassr.\n“I don’t know if I will retire soon, in two or three years… but probably I will retire here at Al-Nassr,” he told NOW.\n“I’m very happy at this club, I feel good in this country too. I’m happy to play in Saudi Arabia and I want to continue.”\nNow, formal steps seem to be being made towards granting Ronaldo his wish of continuing his Al-Nassr adventure.\nAl-Nassr missed out on Barcelona attacker\nSince signing Ronaldo in 2023, Al-Nassr have added further stars of international quality to their squad, such as Sadio Mane, Aymeric Laporte, Marcelo Brozovic and Mohamed Simakan.\nHowever, it has been confirmed this week that one target they missed out on this summer was Raphinha.\nLike Ronaldo, Raphinha enjoyed a spell with Sporting CP earlier in his career. Currently at Barcelona, reports have claimed he was the subject of an €80m (£67m/$89m) offer by Al-Nassr in the summer.\nRaphinha rejected a move to Saudi Arabia, though, so it will be interesting to see which other stars link up with Ronaldo in the future.\nSome reports have suggested that Al-Nassr could become a destination for Liverpool forward Mohamed Salah, a long-time target for the Saudi Pro League and previously the subject of a humongous offer by Al-Ittihad in 2023.\nHow have Al-Nassr done during Ronaldo era?\nOne of the most instantly recognisable players in football, Ronaldo was a signing of audacious magnitude by Al-Nassr over 18 months ago. However, he is still likely hungry to achieve more with them.\nAl-Nassr were top of the Saudi Pro League at the time they signed Ronaldo, but they ultimately finished as runners-up to Al-Ittihad by the end of the season, and they were also knocked out in the semi-finals of the King Cup and Super Cup.\nLast season, they finished second in the Saudi Pro League again, this time to Al Hilal, but Ronaldo was the top scorer in the division with 35 goals.\nThey were eliminated in the Super Cup semi-final again and came as runners-up in the King Cup.\nIn addition, they reached the quarter-finals of the AFC Champions League, but won the Arab Club Champions Cup to give Ronaldo his first honour in Asian football.\nThis time around, Al-Nassr have undergone a five-game unbeaten start to the Saudi Pro League campaign as Ronaldo aims to become a league titlist in a fourth different country.",
  "word_count": 765,
  "scraped_at": "2026-02-14T02:08:12.419154",
  "_text_extracted": true
}