{
  "article_id": "3d80dcf91656",
  "url": "https://www.justarsenal.com/if-arteta-really-believes-were-the-best-in-europe-we-have-a-problem/392136",
  "title": "If Arteta really believes were the best in Europe , we have a problem",
  "date": "20250511T161500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I knew he would be too proud to take back what he said on Wednesday night but I wanted to wait till after Mikel Arteta’s Friday Press Conference, to see if he could clarify further on how you can lose two games in a week, to the same opposition, yet be the ‘best team in Europe’?\nAs a former player himself Arteta surely knows that scoring goals is a huge part of the sport, you can’t win without doing that. Having captained the club in the Champions League he is qualified to know at this level that success and failure is decided by the smallest details, individual moments.\nIn North London, PSG scored after their quick start. In the Capital of France, Arsenal equally flew out of the traps but couldn’t break the deadlock. That’s the difference.\nYet you can’t pick and choose which aspect of football you care about. After over 170 minutes of action we hadn’t scored. Being kind you could say our opponents were more clinical. Being harsh you could say the Gunners have had issues in the final third for a while now. Either way you can’t be 3-0 down having played that long and suggest ‘you have been the best in the competition’.\nInvolved in the industry for decades, Arteta must be well aware you can’t make such a claim while ignoring the most important part of the game – putting the ball in the back of the net.\nWhatever your opinions of our manager he deserves respect. He took the title race to the final day last season. This campaign saw us in only our third ever CL Semi Final. His body of work shouldn’t be mocked or laughed at. Unless, of course, you are giving reason for others to laugh?\nThe 43 year old might not care what those outside of his bubble think. His comments may have been designed to convince his squad to believe that’s how good they could be and maybe to avoid a hangover for this weekend? It simply could also be a man hurt and speaking with emotion so soon after disappointment? Any of those are fine. In truth Gooners will be relieved if any scenario (or both ) are the reality. The fear is, what if he believes what he’s saying? Because if he truly thinks he’s managing the best team in Europe then long term we have issues. If he thinks that, then he is not good enough to be coaching at this level.\nUnfortunately this is not the first time the Spaniard’s assessment of a match has contradicted my eyes. Is it a self protective measure? Brilliant. Yet the third highest paid manager in the world needs to have the ability to self evaluate.\nEvery Summer Arsene Wenger would take his staff to either Switzerland or France and they would review the whole year, making an action plan for every department of the club.\nWhat did they do well?\nWhat could they have done better?\nWhat could be changed?\nIt’s counter productive if the current regime have the same meeting and conclude everything is rainbow and unicorns. That’s how you stand still. It would highlight those at that meeting don’t have the character for such a position.\nBecause we are all the narrators of our own story. We tell the narrative from our perspective.\nThe easiest thing in the world is to tell the tale with you in the role of the victim or even the hero of the hour.\nThe hardest thing to do?\nTo admit you were not perfect.\nTo acknowledge your flaws.\nTo be self critical of your own performance?\nShould I have sold Smith Rowe or would he have been a decent squad player?\nWas there a reason Chelsea were not going to register Sterling?\nHas the quality of the football regressed?\nAm I too defensive?\nIs that that why the Emirates is quiet yet again?\nHave I micro managed Martinelli too much?\nWhat is Rice’s best position?\nIs Skelly better off in midfield?\nDoes Partey need to be playing RB ever again?\nWere my subs against PSG brave enough?\nDo I trust Nwaneri or not?\nDid the Koronke Family help me in January?\nDo I need to explain how damaging that was and that can never happen again?\nThat takes class and honour.\nSome of the most successful people in the universe, millionaires, owners of billionaire corporations have that ability to recognize what’s not working.\nTo succeed, many had to fail because they couldn’t learn. To learn though you have to be open to failure as a possiblity and open your eyes and ears.\nThere’re a lot of positives from the experience of getting to the last 4 of UEFA’S premiere competition. Don’t waste it by being stubborn.\nFirst of all you’re a representative of an institution who prides itself on class and doing things the right way. Shake Enrique’s hand, admit he was the better man, stress how proud you are of your players and tell the fans let’s stick together to return to this stage again.\nThe irony being Arteta is the apprentice of Pep Guardiola. His mentor could still end up with a trophy yet when talking to the media he is direct and to the point, these are the standards we set at Man City and we have failed this time to match those…. end of discussion.\nTo find a solution you have to admit there is a problem.\nThat’s what the best in Europe would do.\nPlease let me know your thoughts in the comments.\nDan Smith\n_________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us here…",
  "word_count": 1005,
  "scraped_at": "2026-02-14T02:26:38.641130",
  "_text_extracted": true
}