{
  "article_id": "3d952e8ad30a",
  "url": "https://www.caughtoffside.com/2024/02/26/newcastle-lining-up-eddie-howes-replacement-ruben-amorim/",
  "title": "Newcastle lining up Eddie Howe replacement : Ruben Amorim",
  "date": "20240226T230000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United executives are reportedly considering recruiting an “incredible” manager renowned for his attacking style of football, as Eddie Howe faces mounting pressure to retain his position.\nThe Englishman has had a commendable spell at St James’ Park, guiding the Magpies clear of the Premier League relegation zone upon his arrival in 2021 and subsequently revitalising them into a formidable team last season.\nSecuring a Champions League berth in the 2022/23 season was a remarkable accomplishment by Howe and his players, raising hopes for further progress in the current campaign.\nRegrettably, events have not unfolded as anticipated, with injuries undoubtedly contributing significantly to Newcastle’s challenges. However, a combination of subpar performances and questionable decisions has compounded their struggles, resulting in their current ninth-place position in the table.\nSaturday’s 4-1 loss to Arsenal was a sobering ordeal for the Magpies, particularly as they were overwhelmed in the first half. This defeat has undoubtedly intensified the pressure on Howe to retain his position. While the extent of his vulnerability to dismissal remains uncertain, recent reports indicate that potential successors are already being considered.\nAs per a recent report from TEAMtalk, Newcastle are considering Sporting CP manager Ruben Amorim as a potential successor to Howe if they decide to part ways with the current Magpies boss.\nRuben Amorim: A good fit for Newcastle?\nThe report also highlights that Amorim favors an “attractive style of play,” which could resonate with Newcastle fans. The Portuguese manager is recognised for employing a forward-thinking 3-4-3 formation as his preferred system.\nGiven some of the performances and results this season, it’s understandable for Magpies supporters to start contemplating life after Howe. Amorim arguably emerges as one of Europe’s most promising young managers at the moment and it would be interesting to see what he could do at a wealthy club such as the North East outfit.",
  "word_count": 308,
  "scraped_at": "2026-02-14T01:48:39.896498",
  "_text_extracted": true
}