{
  "article_id": "3d9c3825a2e4",
  "url": "https://thepeoplesperson.com/2025/12/26/match-report-manchester-united-1-0-newcastle-united-302792/",
  "title": "Match Report : Manchester United 1 - 0 Newcastle United - Man United News And Transfer News",
  "date": "20251227T024500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United battled to a hard-fought 1-0 win over Newcastle United in a pulsating Boxing Day clash at Old Trafford.\nRuben Amorim took everyone, including his opposite number Eddie Howe, by lining United up with a back four in defence and Patrick Dorgu at right wing in a 4-2-3-1 system.\nBut the Portuguese coach was justified in his change in approach, as well as a number of in-game decisions, with United emerging with a crucial victory in their hunt for Champions League football next season.\nFirst Half\nThe Red Devils began the match brightly with Newcastle appearing flummoxed with the unexpected change in system they were confronted with.\nCasemiro should have scored from a great corner whipped in with venom by Mason Mount after just two minutes, but the Brazilian squandered the chance.\nNewcastle’s surprise at United’s set up was confirmed after Aaron Ramsdale then went down holding his hamstring, forcing a pause in the game. During this break, Howe and his coaching staff sent out a series of tactical instructions to adapt to Amorim’s change in system. Ramsdale then sprung back up after Lewis Hall had relayed his manager’s words to his teammates.\nIt was a cynical moment which takes advantage of the special treatment referees are forced to extend to goalkeepers. The Premier League must recognise this and introduce measures to stop it.\nBenjamin Sesko received a good cross from Dorgu in the box in the 10th minute. But the Slovenian striker chose not to hit it first time, instead spinning on the spot and shanking the ball wide with his weaker foot.\nThe match then settled down after this confused start and Newcastle began to enjoy more possession, having switched to a man-to-man approach out of possession at Howe’s request.\nBut Matheus Cunha, United’s main attacking threat in the first half, forced a good save from Ramsdale after superb link up play from Sesko, with the ball cleared for a throw-on in the 24th minute.\nDiogo Dalot duly delivered it into the Newcastle box, forcing a poor clearance from Nick Woltemade, which Dorgu then met with a superbly struck volley on his left foot moving in from the right wing.\nIt was an outstanding goal, one which validated the much-maligned Dane as an attacker as much as his coach’s decision to start him in the more advanced role. The 21-year-old then attempted a cheeky lob from the edge of the box a few minutes later to further demonstrate his newfound confidence higher up the pitch.\nUnited were excellent for the remainder of the half, linking the ball well and creating a number of chances which required the intervention of Ramsdale to keep the score line at 1-0. Cunha and Dorgu were at the heart of every attack, with Mount also helping to knit play in the No 10 position.\nSecond Half\nUnited were forced into a half-time change with Mount withdrawn and Jack Fletcher — named on the bench alongside his twin, Tyler — replacing him.\nNewcastle appeared to have got to grips with United’s system change after the interval, beginning the second half much improved from the first.\nFabian Schar had a great chance from a corner blocked by Dorgu in the 50th minute, with the Dane then bravely clearing the resulting corner as the Magpies ramped up the pressure on Senne Lammens’ goal.\nUnited were sorely missing Mount, who offers intelligent use of the ball and outstanding pressing without it. The occasion has come too early in Fletcher’s fledging career, but Amorim had little other choice with his depleted squad.\nSesko was replaced by Joshua Zirkzee at the hour mark, despite the Slovenian having hit the bar with a thunderous effort against the run of play moments before.\nLeny Yoro was also introduced in place of Casemiro as Amorim changed the system once again, converting to a back three with Dorgu switching over to left wing-back.\nThe immediate effect was not positive, however.\nHall struck the woodwork with a long-range effort followed by a VAR check for a handball by Martinez shortly after — which was cleared, but the momentum was all with the Magpies. Anthony Gordon then had a great chance after being played in down United’s left, but the English winger dragged his effort wide of Lammens’ post.\nUnited composed themselves with Amorim’s changes steadying the defence and bolstering the midfield. Cunha and Dorgu, despite his redeployment, continued to offer the best attacking threat for the Red Devils.\nBut it was the player on the opposite side at Amorim’s request, Diogo Dalot, who had a great chance to put his side 2-0 up in the 72nd minute. The Portugal international blazed the ball over the bar after a terrible mistake by Schar, however, and the opportunity went begging.\nNewcastle were on top for the final period of an intense match at Old Trafford, with the stadium sent into a state of bemusement as Amorim took off Martinez and Shaw in the 87th minute for Tyrell Malacia and Tyler Fredricson.\nWhether it was injury or invention which drove these changes was unclear, but it left a barely recognisable United side for the seven minutes of added time.\nAmorim’s rag tag group held on to secure a much-needed three points over a direct rival for European qualification, however. Lammens, in particular, made one outstanding claim from a cross to ease the pressure on his side while Ayden Heaven was a rock at the back.\nMatch Stats - Man United vs Newcastle\nAll statistics provided by BBC\nIt was a brilliant result after a brilliant performance, one which few would have predicted as the starting line ups were announced — but Amorim was fully justified with each choice he made, on and off the pitch.\nUnited return to the Theatre of Dreams to face Wolverhampton Wanderers on December 30 with a real chance to stake a claim for the top four come the end of the season.\nFeatured image Carl Recine via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1021,
  "scraped_at": "2026-02-14T01:52:59.282920",
  "_text_extracted": true
}