{
  "article_id": "3dd2ea236695",
  "url": "https://metro.co.uk/2025/05/21/tottenham-vs-man-utd-europa-league-final-predicted-lineups-team-news-injuries-23139411/",
  "title": "Tottenham vs Man Utd : Europa League final predicted lineups , team news and injuries | Football",
  "date": "20250521T063000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham have ended their long-wait for a trophy after beating Manchester United in an all-English Europa League final.\nBrennan Johnson’s first-half goal was enough to seal a historic win for Ange Postecoglou’s side in Bilbao.\nIt is Tottenham’s first silverware since lifting the League Cup back in 2009 and their first in Europe since 1984.\nVictory also secures qualification for next season’s Champions League with United now set for a season with no European football.\nAfter wretched Premier League campaigns with both sides marooned just above the relegation zone, the Europa League was their last shot at salvation.\nIn a game of few clear-cut chances, Johnson’s presence caused havoc in the United box three minutes before half-time. With Harry Maguire, Luke Shaw and Patrick Dorgu for company, the Spurs winger still found space to prod home at the near post past Andre Onana to send Spurs fans into delirium.\nUnited had their chances in the second-half with Micky van de Ven producing a marvellous goal-line clearance to deny Rasmus Hojlund.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAlejandro Garnacho, left among the subs at the start, emerged from the bench to test Guglielmo Vicario but United’s lack of a cutting edge was again their undoing.\nPostecoglou eager to stay on as Spurs boss\nAnge Postecoglou has found himself under incredible pressure in what has been a disastrous domestic campaign for Spurs. But the Australian has now delivered on his promise to deliver silverware in his second season in charge.\nWinning the Europa League may not be enough to keep him in the job. But having broken a cycle of disappointment, Postecoglou is hopeful he will remain in place to continue building on tonight’s success.\n‘I don’t feel like I’ve completed the job yet, we’re still building,’ Postecoglou said. The moment I took the job, I wanted to win something. We’ve done that. It’s the toughest thing I’ve ever done.\n‘The moment I accepted the role [as manager] I had one thing in my head, and that was to win something. More than anything else I had that in my head, and we’ve done that now so I want to build on it. I am super proud – this is one for the true believers. I’m still taking it all in. I know what it means for this football club. The longer it goes, the harder it is to break that cycle.\n‘I could sense the nerves in everyone at the club and until you take that monkey off your back, you never understand what it feels like.\n‘We have a young group and I hope by tasting this, the players feel different about themselves and what it means to them is unbelievable. I’ve always felt knockout football is different to league football and when you’re in that situation it comes down to good organisation, having a real gameplan and moments and you can minimise moments by having a strong foundation.’\nAmorim offers to leave Man Utd\nAmorim’s first season in charge will not have a fairy-tale ending. Instead, it will conclude in mediocrity with United at the end of their worst league campaign since the 1973-1974 campaign – a season that ended in relegation from the top flight.\nSorry, the video was not found\nSpeaking after the game, the former Sporting Lisbon boss vowed to step down as manager if the board feel he is no longer than man to lead them forward.\nMore Trending\n‘In this moment, I am not going to be here defending myself. I cannot do it, it is really hard for me,’ Amorim said in his post-match press conference.\n‘I have nothing to show to the fans to say I am going to improve.\n‘So in this moment it is a little bit of faith. Let’s see. I am always open, if the board and the fans feel I am not the right guy, I will go in the next day without any conversation about compensation.\n‘But I will not quit. I am really confident on my job. As you can see I will not change nothing in the way I do things.’\nMORE: Mikel Arteta responds to Tottenham Europa League win and if they had better season than Arsenal\nMORE: Chelsea legend John Terry mocks James Maddison and Spurs after Europa League final win",
  "word_count": 767,
  "scraped_at": "2026-02-14T02:02:47.545992",
  "_text_extracted": true
}