{
  "article_id": "3df88a5a7750",
  "url": "https://www.teamtalk.com/manchester-city/bombshell-real-madrid-offered-118-million-duo-exchange-elite-attacker",
  "title": "Man City transfers :  Bombshell  as Real Madrid offered £118m duo in exchange for elite attacker",
  "date": "20240624T233000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City ‘bombshell’ as Real Madrid offered £118m duo in exchange for elite attacker\nManchester City are willing to strike a sensational swap deal that will see Kevin de Bruyne and one of his team-mates move to Real Madrid and a top-class forward arrive at the Etihad in exchange, according to reports.\nMan City have yet to sign any new players so far this summer, though their transfer kitty has been bolstered by the permanent departures of Taylor Harwood-Bellis and Tommy Doyle. Pep Guardiola’s side are known to be in the market for a new defensive midfielder who can replace flop Kalvin Phillips and help provide cover for Rodri.\nCity have also been tipped to improve their winger ranks amid claims that Jack Grealish and Bernardo Silva could both leave.\nThe reigning Premier League champions will be towards the front of the queue to sign Real Madrid forward Rodrygo, should he be made available for transfer in the aftermath of Kylian Mbappe’s arrival.\nDON’T MISS: The six Man City stars who could quit alongside Guardiola in 2025 as ‘exit’ rumours gather pace\nRodrygo has insisted that he wants to continue at the Bernabeu. But the fact he has labelled City as ‘the best team in the world’ has kickstarted speculation about a huge potential move to the Etihad.\nAccording to the latest reports in Spain, City have drawn up a ‘bombshell’ swap offer that might tempt Madrid into letting Rodrygo go.\nIncredibly, it is claimed that De Bruyne is among the players whom Madrid will be given the opportunity to sign. Centre-forward Julian Alvarez is the second City star who might be sent to the Spanish capital to make way for Rodrygo.\nDe Bruyne and Alvarez are valued at a combined £118million, but City are supposedly willing to let them depart in order to bolster their wide options with Rodrygo’s arrival.\nMan City transfers: Massive Real Madrid swap claims\nWhile Rodrygo is one of the best forwards in the world, having registered 54 goals and 41 assists to help Madrid win trophies such as the Champions League and La Liga, it would be a surprise if this particular swap transfer reached completion.\nAfter all, City view Alvarez as being one of the best young strikers on the planet and are unlikely to allow the Argentine to leave, unless he hands in a formal transfer request.\nDe Bruyne, meanwhile, is a City icon, having established himself as one of the best – if not the best – Premier League midfielders of all time and won a host of trophies while in England.\nAlthough, it is not guaranteed that the Belgian playmaker will be playing in a City shirt next term. De Bruyne’s City contract expires in June 2025, and if the two parties fail to finalise an extension then he might be sold.\nDe Bruyne is open to the prospect of leaving Europe altogether, despite his unbelievable ability to influence matches on the biggest stage.\nEarlier this month, he was asked about a possible switch to Saudi Arabia and replied: “For Michele [his wife], an exotic adventure is okay. These are also conversations that we are increasingly having as a family.\n“I still have one year left on my contract, so I have to think about what could happen. My eldest son is now eight years old and knows nothing but England.\n“He also asks how long I will play for City. Once the moment comes, we will have to deal with it in a certain way.\n“At my age you have to be open to everything. You’re talking about incredible amounts of money in what may be the end of my career. Sometimes you have to think about that.\n“If I play there for two years, I will be able to earn an incredible amount of money. Before that I had to play football for 15 years. I may not even reach that amount yet.\n“Then you have to think about what that could mean next. But at the moment I haven’t had to think about that yet.”\nREAD MORE: Eight Man City transfer targets at Euro 2024, including supreme talent Guardiola loves",
  "word_count": 699,
  "scraped_at": "2026-02-14T01:57:18.884911",
  "_text_extracted": true
}