{
  "article_id": "3e2542c67911",
  "url": "https://www.justarsenal.com/analysis-of-all-of-arsenals-london-derbies-this-season-not-one-defeat/338857",
  "title": "Analysis of every single one of Arsenal London derbies this season - Not one defeat",
  "date": "20230504T191500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Whatever happens in this title race, there’s a lot of stats which showcase the progress Arsenal have made this season.\nYou wonder why Mikel Arteta keeps mentioning that, not just have we qualified for the Champions League, it’s the earliest the Gunners mathematically secured top 4 in decades?\nYou notice our manager only started to highlight this the moment the championship was no longer in our own hands?\nOur 3-1 over Chelsea means we haven’t lost a London Derby this campaign.\nTo give you an idea how hard that is to do, we last managed that in the 2004-2005 season.\nThere’s also been quite a few victories this time around, us winning 10 out of 12 fixtures against our rivals in the Capital. That’s right we only dropped points in 2 out of a possible 12 Derbies.\nPalace 0- 2 Arsenal\nGooners were paranoid that for the second year running Sky had chosen us to kick off the Prem season on a Friday night with a tricky away trip, hoping us slipping up would make good TV.\nLittle did we know that the manner of our victory was a sign of things to come.\nYes, at times our football was lovely but when we needed to, we were prepared to fight and dig in. Previous versions of Arsenal over the years would have wilted.\nSaliba impressed on his long-awaited debut, immediately adapting to the physical nature of English Football.\nArsenal 2-1 Fulham\nAt the time Arsenal were accused of over celebrating a narrow win over a newly promoted side. Yet it summed up the spirit of our young dressing room and how the Emirates mood was changing.\nIn previous years anxiety would have crept round the stadium the moment Gabriel lost the ball to Mitrovic, gifting him a goal. Yet the fans stuck with the team, sucking the ball into the net in stoppage time.\nNot playing that day, this was the first time Zinchenko’s passion was really apparent.\nIt was obvious he hadn’t joined us just for a top 4 race, he had his sights on a bigger prize.\nBrentford 0-3 Arsenal\nHaving lost at Old Trafford a week before this was seen as a test of our mental resolve, returning to the ground we were embarrassed at a year previously.\nA repeat was never on the cards with us 2-0 up inside half an hour.\nPerhaps the sole highlight of Fabio Vieira’s Arsenal career came with his long-range strike.\nTo put this result in perspective, Newcastle is the only other side to win here this season in the league.\nArteta even had time to break a record by bringing on 15-year-old Ethan Nwaneri to become the youngest person to play in the history of the competition. I was called cynical for saying the sub wouldn’t have happened if our manager wasn’t aware of that stat. Haven’t seen the kid since!!\nArsenal 3-1 Spurs\nGiven what’s happened since, this feels a long time ago now.\nSpurs would have gone top of the table with a win here and were seen by some as dark horses for the title, given they were managed by Conte.\nGiven this was meant to be their golden period it is crazy how often Spurs simply don’t show up at the Emirates.\n3-1 down and down to 10 men Spurs took off Son, Richarlison and Perisic to go defensive and stop the scoreline from getting embarrassing.\nEssentially waving the white flag in the NLD.\nChelsea 0-1 Arsenal\nBy the time Gabriel bundled a corner over the line it was well deserved.\nBT had convinced Aubameyang in the build up to cut a promo telling his ex-employers it was nothing personal.\nThe broadcaster didn’t get the memo with this not being the Chelsea of years gone by.\nThey were quite toothless on this occasion; our ex-captain was taken off after just over an hour, and Chelsea have only managed 18 more points since this fixture which was in November!\nArsenal 3-1 West Ham\nOur first game after the World Cup which was predicted as the moment everything caught up with us, especially with a long-term injury to Jesus.\nThat seemed the case with the Hammers leading 1-0 at half time, but the Gunners turned it around to go 8 points clear of Man City.\nBest remembered for Mr Wenger visiting the Emirates for the first time since he left as manager.He got the reception he deserved.\nSpurs 0-2 Arsenal\nArsenal showed their increasing maturity. Once registering a 2-0 lead at half time they decided to protect what they had. Wouldn’t have been able to do this in previous years.\nOur first win at the Lane in the League since 2014\nArsenal 1-1 Brentford\nIf we lose out on the title by a couple of points, we might not have heard the end of this. The Gunner received an apology days later for Toney’s equaliser being allowed to count. It’s not that VAR interpreted Brentford’s set piece a certain way, they simply forgot to draw the lines. In other words, they forget to do their job. Zero explanation why.\nWe got our sorry, but as Arteta pointed out that doesn’t give us the points back.\nFulham 0-3 Arsenal\nHaving watched Man City the day before cutting our gap down to two points, if the Gunners were feeling the pressure, it wasn’t apparent on the River Thames as we made it game over by half time.\nTrossard got a hat trick of assists.\nArsenal 4-1 Palace\nSome Gooners were worried there may have been a hangover from our Europa League exit, but the fixture was timely, with our opponents sacking Viera 48 hours before.\nWith City playing in the FA Cup this allowed us to extend our lead at the top to 8 points\nWest Ham 2-2 Arsenal\nFor the second weekend running we threw away a 2-goal lead, left to settle for a point. This time though we were a victim of our own success, almost funding the game too easy after 2 goals in the first 10 mins.\nWhen a Partey mistake gifted the Hammers a penalty we didn’t seem to be able to get back our momentum.\nArsenal 3-1 Chelsea\nWith our destiny no longer in our own hands, would we feel sorry for ourselves and let the season drift or give a response?\nLuckily, we faced one of the most unmotivated Chelsea teams in years. 3-0 up after 34 mins you could tell Gunners and Gooners were haunted by previous leads thrown away when Chelsea got one back.\nWe smartly decided to close out the match.\nDan Smith\nA happy Arteta enjoys great win over Chelsea – “We are still top with four games to go!”\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 1146,
  "scraped_at": "2026-02-14T02:19:46.305165",
  "_text_extracted": true
}