{
  "article_id": "3e5a1107e59d",
  "url": "https://metro.co.uk/2025/05/23/alexander-isak-injury-update-ahead-newcastle-united-vs-everton-23228607/",
  "title": "Alexander Isak injury update ahead of Newcastle United vs Everton",
  "date": "20250523T093000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe has confirmed Alexander Isak ‘has a chance’ of returning from injury for Newcastle United on the final day of the Premier League season against Everton.\nNewcastle head into the final weekend of season still fighting for Champions League qualification.\nThey start the weekend in fourth place with the top five securing a place at Europe’s top table next season.\nA win against the Toffees will be enough to secure their place.\nIsak was forced to miss last Saturday’s clash with Arsenal with a groin injury, with his side going onto lose 1-0 at the Emirates.\nThe striker was not pictured in training images released by the club on Thursday.\nIsak has been doing individual work at the training ground this week with the plan for him to join the group on Saturday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpeaking at his pre-match press conference on Friday, Howe said: he’s doing ok. he hasn’t trained with us yet but he has made good progress through the week. The next couple of days will be absolutely crucial to his availability on Sunday.\nHowe added: ‘Yes, there’s a chance.\n‘It’s difficult to give any more than that really. Until he has trained with us, we won’t know fully how he is going to respond to respond to the training and the demands the game will place upon him.\n‘We will only play him if he’s fit to contribute but at the moment he has an opportunity, potentially.’\nKieran Trippier, who has missed his side’s last two games, is another being assessed with hope he can play some part at St James’ Park on Sunday.\n‘He is a player in a similar situation to Alex, he hasn’t trained with us yet,’ Howe said.\n‘He’s had an absence of two, two and a half weeks but he has a chance in the next couple of days to build up his load and maybe we will see him train tomorrow but let’s wait and see.’\nMore Trending\nJoelinton however has been ruled out as he continues his recovery from a knee problem.\n‘No, Joelinton wont be back. He’s had another injection in his knee which was always on the cards potentially for him so he is in a knee brace only for protection for that injection.\n‘He’s making good progress so we envisage he will be back for pre-season with no problems.’\nMORE: Tottenham star tells Daniel Levy he wants to leave just days after Europa League win\nMORE: Manchester United set asking price for Chelsea to sign Alejandro Garnacho\nMORE: Manchester United respond to Ruben Amorim offer to leave without compensation",
  "word_count": 486,
  "scraped_at": "2026-02-14T02:26:38.632064",
  "_text_extracted": true
}