{
  "article_id": "3e7fa95e64f2",
  "url": "https://www.fourfourtwo.com/features/watch-manchester-united-tottenham-hotspur-europa-league-final-2025",
  "title": "Watch Man United vs Spurs : Live streams for Europa League final",
  "date": "20250521T201500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Watch Manchester United vs Tottenham Hotspur: Live streams, TV details, Preview, Kick-off time for Europa League final\nIt's an all-English affair between two Premier League strugglers, with Champions League qualification up for grabs\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWatch Manchester United vs Tottenham Hotspur for a dramatic showdown in the final of the Europa League on Wednesday, May 21, with all the details here on broadcasters, live streams, and how to watch online or on TV from anywhere.\nKey information\n• Manchester United vs Spurs Date: Wednesday, May 21\n• Manchester United vs Spurs Kick-off time: 8pm BST / 3pm ET\n• Manchester United vs Spurs Venue: Estadio de San Mamés, Bilbao, Spain\n• Manchester United vs Athletic Bilbao Free stream: Discovery+ (UK), Auvio (Belgium)\n• Manchester United vs Athletic Bilbao TV & streaming: TNT Sports, Discovery+ (UK) | Paramount+ (US)\n• Watch from anywhere: Try NordVPN risk-free\nCan I watch Manchester United vs Tottenham Hotspur for free?\nYes! You can watch Manchester United vs Tottenham Hotspur in the Europa League final for free, if you're in the UK, thanks to Discovery+.\nDiscovery+ is the streaming platform for TNT Sports, which usually puts its European football behind a subscription paywall, but is swinging the doors open not just for the Europa League final but also the Champions League final and Conference League final.\nTo access the Europa League final free live stream, you have to register an account but you'll be able to watch United vs Spurs without having to take out a subscription (usually £30.99 a month).\nCoverage is geo-restricted, so if you're away from the UK, you'll have to use a VPN to get your usual coverage – more on that below.\nHow to watch the Europa League final from anywhere\nWhat if you're away from home for Manchester United vs Spurs in the Europa League final, and your usual streaming service is geo-restricted? Well, there is a neat solution. A VPN - or Virtual Private Network - is a piece of software that sets your IP address to make your device appear to be in any country in the world.\nProvided it complies with your broadcaster’s T&Cs, you can use a VPN to unblock the streaming services you subscribe to, and it also comes with added internet security benefits.\nFourFourTwo’s colleagues TechRadar are experts in this field, and they reckon NordVPN is the best VPN provider on the market.\nGet over 70% off NordVPN with this deal\nTechRadar love NordVPN’s super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS4 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Back of the net!\nWatch Manchester United vs Spurs in the UK\nIn the UK, you can watch Manchester United vs Spurs in the Europa League final on TNT Sports and Discovery+.\nOn TV, the game will air on TNT Sports 1 and TNT Sports Ultimate, with coverage starting at 6pm BST ahead of the 8pm kick-off. For those streaming online, coverage on Discovery+ starts at the same time.\nTo get TNT Sports you'll need to adjust your pay-TV package. If you want to watch the Europa League final online, Discovery+ is offering free access – simply register without purchasing a subscription.\nRead more: UEFA Champions League, Europa League and Conference League finals all to be shown FOR FREE\nWho are the commentators and pundits for the Europa League final?\n- Presenters: Jules Breach & Lynsey Hipgrave\n- Experts: Gareth Bale, Rio Ferdinand, Glenn Hoddle, Robbie Savage, Paul Scholes\n- Commentary: Darren Fletcher & Ally McCoist\n- Reporter: Danny Jamieson\nWatch Manchester United vs Tottenham Hotspur in the US\nFans in the US can watch the Europa League final between Manchester United and Tottenham Hotspur on Paramount+ on Wednesday.\n► Manchester United report: Sporting director confirms 'constant' talks to sign flop\nWhere else can I watch Manchester United vs Tottenham Hotspur?\nCanada: DAZN\nAustralia: Stan Sport\nNew Zealand: DAZN\nEuropa League final kick-off time\nManchester United vs Tottenham Hotspur in the final of the Europa League kicks off at 21:00 local time (CET), which is 20:00 BST for those in the UK, and 15:00 ET for those in the US.\nManchester United vs Tottenham Hotspur: Match Preview\nIt's an all-English match-up in the final of the Europa League, and the irony is that one of the biggest prizes in European club football – plus Champions League qualification – will go to a team that has struggled desperately domestically.\nBoth Manchester United and Tottenham Hotspur have endured dreadful seasons on home soil, occupying the two spots directly above the Premier League relegation zone – Spurs in 17th and United in 16th. More competition from those in the drop zone, and relegation might have been a genuine threat, which is unthinkable for clubs of that stature, and unthinkable that a team playing in the Championship in England might be competing with Europe's elite in the Champions League next term.\nChampions League qualification, automatically bestowed upon the winner of the Europa League, is one of the big talking points ahead of this final. It could mean a cash injection of more than £100 million. Does that prize add to the magnitude of the occasion? Or does it in fact devalue the trophy in itself?\nThat will depend on your point of view, but neither side would turn their nose up at this piece of silverware, not least their managers. United's Ruben Amorim was brought in mid-season to replace Erik ten Hag but has only overseen a further slide into the doldrums. A trophy would ease any growing pressure on his shoulders, in the same way that Ten Hag's FA Cup win last season arguably suckered the owner Jim Ratcliffe into keeping him on.\nThere is even greater pressure on Spurs' Ange Postecoglou, some of which has been brought on my the man himself and his assertions that he 'always' wins a trophy in his second season in charge of a club. Come good on that promise, and he might just be able to stick around for next season, but if not, you sense his head will be the latest on Daniel Levy's chopping block.\nSpurs' last trophy came in 2008 in the EFL Cup, and their fans are keen for more after several near misses and some of their best ever squads in the intervening period. United have far more trophies in their cabinet but for a side that has won the Champions League three times and England's top division 20 times, their overall expectations are greater.\nUnited won this competition in 2017 under Jose Mourinho and lost in the final in 2021. Spurs have twice won this title under its former guise, the UEFA Cup, in 1972 and 1984.\nAs for the match itself, it's hard to predict, given the inconsistent nature of these two sides. United can look full of vim and vigour on occasion, but too often they have looked lifeless and flat. Likewise, Spurs can be a bundle of creative energy and threat, but they can also appear comically inept in defensive shape.\nWhatever happens, you don't get the sense it'll be dull.\nEuropa League: Routes to the final\nManchester United\nLeague phase: 3rd (W5, D3, L0)\nRound of 16: Man United 5-2 Real Sociedad (two-leg aggregate)\nQuarter-final: Man United 7-6 Lyon (two-leg aggregate after extra time)\nSemi-final: Man United 7-1 Lyon (two-leg aggregate)\nTottenham Hotspur\nLeague phase: 4th (W5, D2, L1)\nRound of 16: Spurs 3-2 AZ Alkmaar (two-leg aggregate)\nQuarter-final: Spurs 2-1 Eintracth Frankfurt (two-leg aggregate)\nSemi-final: Spurs 5-1 Bodo Glimt (two-leg aggregate)\nManchester United vs Tottenham Hotspur Team News: Confirmed line-ups\nThe big news is that Son Heung Min has been dropped to the bench for Spurs in a big call from Ange Postecoglou, who starts Richarlison in attack with Dominic Solanke and Brennan Johnson. Mason Mount starts for Manchester United, who can also count on Amad Diallo.\nManchester United\nStarting XI: Onana; Yoro, Maguire, Shaw; Mazraoui, Casemiro, Fernandes, Dorgu; Diallo, Mount, Hojlund\nSubstitutes: Bayindir, Amass, Dalot, Evans, Heaven, Lindelof, Collyer, Eriksen, Mainoo, Ugarte, Garnacho, Zirkzee.\nTottenham Hotspur\nStarting XI: Vicario; Porro, Romero, van de Ven, Udogie; Bentancur, Bissouma, Sarr; Johnson, Solanke, Richarlison\nSubstitues: Austin, Whiteman, Spence, Davies, Danso, Gray, Ajayi, Moore, Odobert, Tel, Son, Scarlett\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nPatrick manages the How To Watch content across FourFourTwo and the other sports publications at Future. He's an NCTJ qualified journalist with a decade of experience in digital sports media. A lifelong Evertonian, he now plies his own footballing trade on the bobbly pitches of the famous Bristol Downs League.",
  "word_count": 1630,
  "scraped_at": "2026-02-14T02:09:11.451868",
  "_text_extracted": true
}