{
  "article_id": "3e9c78ae7cf8",
  "url": "https://www.the42.ie/man-city-champions-league-talking-point-6554229-Nov2024/",
  "title": "Man City have been here before . But this time , it feels different",
  "date": "20241127T003000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AFTER RODRI won the Ballon d’Or recently, not everyone was happy.\nThere was some controversy, largely generated by Vinicius Jr’s camp and Real Madrid, as the Spaniard pipped the Brazilian to the prize.\nYet on the evidence of the last few weeks, the only player in this scenario who can feel justifiably aggrieved is Rodri himself — at having not won the prestigious accolade on a few more occasions.\nBetween February 2023 and May 2024, the midfield star enjoyed a remarkable 74-match winning streak — and that’s before triumphing at the Euros with Spain in the summer.\nSince 2022-23, with Rodri starting, City have won 75 out of 103 games (73% win ratio). Without him in the first XI, they have won 22 out of 36 matches (61% win ratio). And in that same period, they have lost 37% of Premier League games without him versus 6% with him.\nThis season alone, in 17 games without Rodri, City have won nine, drawn three and lost five.\nTuesday’s remarkable 3-3 draw at home to Feyenoord feels like a classic example of a clash City would have won with Rodri in the team.\nYes, poor individual errors at the back undermined the hosts. But when a team is under the cosh, an experienced central midfielder tends to be pivotal.\nLike all the best footballers in this role, he would have grabbed hold of the game, dictated the tempo, restored some control to City’s play and not allowed standards to slip.\nThere are more talented footballers in the squad, but the 28-year-old’s reassuring influence is vital to making City tick.\nTo some extent, the Etihad outfit have been here before, however.\nLast year, for example, they had a dreadful run in November-December, where they won just one out of six Premier League games.\nIn the 2022-23 campaign, they won just 16 of their first 24 games and lost both matches to Brentford that season.\nIn 2021-22, they had an underwhelming start, failing to win four of their opening 10 games.\nThey had a similarly slow start in 2020-21, winning only five of their first 12 matches.\nYet on each of those occasions, City emerged as champions.\nWill the 2024-25 campaign be any different? Given the obstacles they now face, clinching a fifth successive Premier League crown would be their greatest achievement.\nThere were warning signs from the outset against Feyenoord tonight.\nIt was far from a classic performance. They looked sluggish and on autopilot in the first half, and some sloppy defending that has characterised their recent struggles recurred as the visitors mounted an unlikely comeback with three late goals to earn a point.\nEven a below-par City team should have been too good at home against a side whose league’s resources are minimal compared to England’s top flight and who are having a less-than-vintage season themselves — they are fourth in the Eredivisie.\nSuddenly, Guardiola’s side need a victory at Anfield on Sunday to rescue their stuttering campaign.\nThe six-game winless run is unprecedented — the Catalan coach has never experienced it as a manager.\nBefore this season, he had never lost three consecutive Premier League games. Defeat against Liverpool would make it four.\n75 - Manchester City are the first team in UEFA Champions League history to be leading a match by three goals as late as the 75th minute and fail to go on to win. Unbelievable. pic.twitter.com/QFkxrMUEbN\n— OptaJoe (@OptaJoe) November 26, 2024\nYou could argue there are significant caveats.\nIt is possible to play down the significance of three games in that run.\nIn the first loss, a League Cup defeat to Tottenham, members of the City bench were laughing as the game ended, which indicated that they were not too distraught at exiting that competition.\nThere is a similar temptation to dismiss the importance of their Champions League setbacks — they have won only two out of five matches.\nTonight’s disappointment has left them 15th in the table on nine points, and they will slide further down once this week’s remaining games are played.\nBut consider their three remaining fixtures: Juventus (away), PSG (away) and Club Brugge (home). On current form, none of those look like a guaranteed three points.\nWhile they need to finish in the top 24 only (out of 36 teams) to advance, a top-eight spot is required to avoid the play-off round, which now looks far from a foregone conclusion.\nA business-as-usual Guardiola City side might have won their opening four or five group-stage matches, meaning they could afford to rest first-teamers in the last few fixtures but that won’t be possible on this occasion.\nStill, a full recovery is not inconceivable.\nWhile there have been some premature obituaries, a win over Liverpool could be the transformative moment their season requires.\nAnd it is possible to make excuses for their previous losses.\nAll of the three Premier League defeats they could easily have won. Even in the 4-0 loss to Tottenham, they were guilty of wasting several great chances when the contest was still in the balance. The xG (2.51 to 2.15 in Spurs’ favour) supports the notion that the game was closer than the scoreline suggests.\nBut it is starting to feel like it could be end-of-an-era territory for City and that the problems go far beyond Rodri’s absence.\nKevin De Bruyne (33), Kyle Walker (34) and Ilkay Gundogan (34) are beginning to look their age.\nPhil Foden has seemed a shadow of the individual who won Player of the Year last season and has looked off since a disappointing showing with England at the Euros last summer.\nOthers in the squad including Bernardo Silva, Joško Gvardiol and Jack Grealish have been well below their best.\nIt was also perhaps not a coincidence that City’s collapse occurred following the introduction from the bench of two inexperienced youngsters — Jahmai Simpson-Pusey and James McAtee, along with De Bruyne.\nWalker was dropped following his poor display against Spurs and a similar fate may await Gvardiol after his horror show on Tuesday.\nBut what’s also noticeable is how light City’s options in reserve have looked of late.\nWhen you consider the players Guardiola has deemed dispensable in recent seasons: Cole Palmer, Julián Alvarez, Aymeric Laporte and João Cancelo among others, it is even tempting to question whether the iconic manager is beginning to lose his edge.\nAll such pronouncements could well look silly in six months, of course.\nYet everything in football is cyclical, and the long-anticipated outcome of the 115 Premier League charges case may precipitate their downfall.\nSo how have this all-conquering four-in-a-row-winning City squad found themselves on the brink of a full-blown crisis?\nTo paraphrase Ernest Hemingway — two ways. Gradually, then suddenly.",
  "word_count": 1121,
  "scraped_at": "2026-02-14T02:11:20.848102",
  "_text_extracted": true
}