{
  "article_id": "3ea88848fb0b",
  "url": "https://www.nytimes.com/athletic/6764917/2025/11/13/world-cup-minnows-first-timers/",
  "title": "Cape Verde , Uzbekistan , Jordan … What can we expect from a World Cup with more footballing minnows ? ",
  "date": "20251113T063000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jordan, Uzbekistan and Cape Verde will all be there. Qatar have featured before as hosts but now they’ve qualified on footballing merit for the first time. Joining them at some point over the coming months could be Kosovo, New Caledonia, Curacao, Suriname, Gabon and a few other potential debutants.\nYes, the 2026 World Cup is going to look pretty different to all of its 22 predecessors.\nAnd that will take good forms and bad.\nThe structure is the first thing.\nFrom 1998 to 2022, every World Cup had 32 teams: that was neat, straightforward and logical.\nThis time, there will be 48 competing nations, which will be none of those things.\nAdvertisement\nNext June’s first round will feature 72 games played across 12 groups in 16 days that will lead to the elimination of… only 16 teams. In addition to the top two in each group, the eight best third-place teams will also go through to the knockout phase: in past editions, just three points has frequently been enough to finish third in a four-team group, so we could be presented with the slightly farcical situation of a side not winning any of their three games but still making it through to the knockouts.\nIt is an unsatisfactory and unwieldy format: 32 was just right from a meritocratic and neatness perspective, but this could look like such a mess that FIFA president Gianni Infantino’s next big wheeze, to have an absurd 64 teams at the 2030 World Cup, will be preferable to 48.\nBut the advantage 48 gives is a widening of the qualification pool, which has given greater opportunities to some of world football’s less-historically-successful countries.\nThis is supposed to be a global tournament, so the more of the globe that is represented, the better, right? It’s surely more interesting to have new teams involved, with new stories, their presence meaning new things to their people rather than the same nations with the same narratives around them.\nThat’s the glass-half-full view.\nThe half-empty perspective is that this will merely let in poorer-quality teams, and poorer-quality teams will mean more mismatches, more one-sided and tedious games, less competition.\nIt is not an entirely unfair argument, because the newbies do not have much by way of football pedigree.\nCape Verde is a nation of just over 500,000 people, currently the second-smallest side ever to qualify for a World Cup (after Iceland), though they will be bumped down a place if Curacao make it. They’ve only started qualifying for the Africa Cup of Nations in the past decade or so and did not even take part in World Cup qualifying for the first time until 2002. Jordan only made their first appearance at the Asian Cup in 2004.\nAdvertisement\nOf next year’s confirmed first-time qualifiers, Jordan are 66th in the current FIFA rankings, Uzbekistan are 55th, Qatar 52nd and Cape Verde 71st. Of the potential qualifiers, Suriname are 126th and New Caledonia are way down in 150th.\nThe current record for the lowest-ranked team to make a World Cup is held by North Korea, who were 105th when they earned a place in 2010. They lost all three group games by an aggregate score of 12-1, including being defeated 7-0 by Portugal, and the most notable aspect of their participation was them trying to register an outfield player as a goalkeeper to get around the squad composition rules.\nNone of that exactly screams optimism for 2026.\nBut just because these teams are ranked way down the list, it does not necessarily mean we are in for a series of cakewalks.\nConsider the 2023 Women’s World Cup.\nThat also expanded from the previous edition, going up from 24 teams to 32, which meant there were eight debutants. There were some mismatches (Vietnam lost all three games without scoring a goal), but Portugal came close to knocking out defending champions the United States in the group stage, and Morocco actually did qualify for the second phase ahead of the mighty Germany, who across the eight previous World Cups had won it twice and been in a third final and two other semis.\nAnother competition that has expanded in recent years is the UEFA Champions League. Last season, first-timers (in the Champions League era anyway) Aston Villa finished in the top eight of the initial league stage, where Brest also did better than Juventus and Manchester City: perhaps not minnows of the scale we’re talking about at the World Cup, but unexpected outcomes nonetheless.\nWhat about the European Championship, which went from 16 to 24 teams in 2016? Four teams were at that tournament for the first time: Albania went out after the group stage but beat Romania and were 0-0 with mighty France with 89 minutes gone before conceding two late goals; Northern Ireland qualified for the knockout phase having pushed Germany all the way in a 1-0 group-finale defeat; Iceland came within a whisker of eliminating eventual winners Portugal in the groups, then memorably beat England in the round of 16; and most gloriously of all, Wales got to the semi-finals.\nAdvertisement\nThink of the impact that first-timers have made at other past tournaments, too. In Senegal’s first-ever World Cup finals game, they beat defending champions France in 2002. In 1994, Nigeria won a group containing 1990 runners-up Argentina and took eventual finalists Italy to extra time in the last 16. The Republic of Ireland’s performances in 1990, when they reached the quarter-finals, are remembered fondly to this day.\nThere will always be whipping boys at the World Cup, a team who arrive underprepared or in chaos of some description. But it is often an established power: take Egypt, who are seven-time African champions but have a miserable World Cup record, including losing all three games at their most recent one, in 2018.\nAnd it is not like the traditional giants are always the ones who step up.\nIn 2022, Mexico, Germany, Belgium and Uruguay, six World Cup wins between them and nations who can usually be relied upon for a quarter-final spot at least, all slumped out after the group stage.\nIt is also important to think of the teams that have qualified as just that: teams who are currently really good, not a collection of pre-conceived ideas about where those countries fit in the sport’s traditional hierarchy. Two years ago, Jordan reached the final of the most recent Asian Cup, that confederation’s four-yearly championship akin to the Euros, Copa America or AFCON, where they were beaten by Qatar. Uzbekistan have a clutch of exciting young players. Cape Verde have a team spirit and a growing talent pool that has taken them past much bigger opponents in the past few years.\nInternational football used to be the pinnacle of the game, but that has not been the case for a while, so strong is the club game, in particular the Champions League and the top sides of Europe. That might be a source of sadness, but equally you could look at it as freeing, as a source of great stories rather than purely a competition to find the best team in the world. Also, the latter stages of World Cups do not often produce good games or excitement: so with some smaller nations thrown into the early stages, there is more opportunity for upsets.\nSome of the newcomers may well turn out to be overmatched, and it is likely there will be the odd thrashing. But if the addition of a few minnows does result in a slight dilution in overall quality, it is just as likely there will be a few glorious stories to balance it out.\nAdvertisement\nImagine if Cape Verde face their old colonial masters Portugal, from whom they gained independence in 1975, and beat them. What if Jordan bring a population that has gone through a tough time in the past couple of years some genuine joy? The very presence of Kosovo, who only played their first competitive international in 2016 and are ranked 84th by FIFA, would be phenomenal in itself.\nThe World Cup should be about great stories, which is what these new teams could give us. So if anyone thinks they will all be pushovers, try to view it in a different way, and consider what these sides could add to the tournament, not what they might take from it.",
  "word_count": 1395,
  "scraped_at": "2026-02-14T02:09:38.465456",
  "_text_extracted": true
}