{
  "article_id": "3ec4ac36df11",
  "url": "https://theathletic.com/5260785/2024/02/09/liverpool-riedle-alonso-klopp/",
  "title": "Karl - Heinz Riedle :  Liverpool wont find a double of Jurgen Klopp – but Xabi Alonso would be fantastic  ",
  "date": "20240209T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Few visitors to Liverpool’s training complex receive a personal tour from Jurgen Klopp. But, then again, it’s not every day a World Cup winner walks through the doors.\nKarl-Heinz Riedle relished his first trip to the club’s base in Kirkby during a short stay on Merseyside to visit old friends, following fellow German Klopp’s surprise announcement that he will stand down as manager at the end of the season.\nAdvertisement\n“Jurgen was in very good spirits, and seemed quite relaxed,” Riedle says. “I think it helped him a lot to make the decision public.”\nRiedle, like Klopp, has a strong bond with both Liverpool and Borussia Dortmund. The former Germany striker fired the Bundesliga side to Champions League final glory in 1997 before spending the twilight of his playing career in England, with two years at Anfield, then two more with Fulham.\nNow aged 58, Riedle is a long-serving global ambassador for Dortmund and has seen first-hand just how challenging it is to replace someone of Klopp’s stature.\n“We’re on our sixth coach since Jurgen left,” he explains. “Dortmund fans still love him. He’s the best ever in the club’s history. Watch the videos when he said his goodbyes, in 2015. It was maybe one of the most emotional exits from a coach ever. There were a lot of tears – 80,000 people crying. I’m sure it will be the same here. He has a secret when it comes to connecting with people. He knows how to get people together.\n“He’s won nearly all the titles there are to win and it’s also the fact that his team play spectacular football. You’re not going to find a double of Jurgen. It’s not easy, but Liverpool have time and I pray that they find the right decision.”\nThe clear frontrunner for the job currently is Xabi Alonso.\nThe Spaniard is adored by Liverpool supporters following a five-year spell as a midfielder for the club, which included their iconic 2005 Champions League final triumph.\nRiedle has been watching 42-year-old Alonso’s blossoming managerial career with interest.\nBayer Leverkusen were one place off the bottom of the Bundesliga table when he took over in October 2022, in what was his first job in senior football. They are now two points clear at the top and go into their home match tomorrow (Saturday) against title rivals and serial champions Bayern Munich unbeaten in 30 games in all competitions.\n“Xabi is doing an incredible job,” Riedle adds. “I’ve never seen Leverkusen play like they are doing at the moment. He deserves a lot of credit. He’s changed the whole team around and made some very good signings.”\nWould his style of football be a good fit for Liverpool?\nAdvertisement\n“It fits completely,” Riedle says. “I’d say Jurgen’s football is slightly different, but Xabi likes to attack, too. If you see them pressing in the opposition half, it’s really impressive.\n“He has the eye, he has the desire, he knows Liverpool as a club and as a city. He’s a legend here — everyone knows and respects him. I don’t know what his plan is or what Liverpool will decide to do, but I think he would be a fantastic choice.”\nWith Liverpool resurgent this season and Klopp under contract until summer 2026, Riedle did not expect his old club to be searching for a successor so soon. However, the demands of the job over the past eight and a half years have taken their toll, with the former Dortmund head coach informing the club’s owners he could not continue doing it on “three wheels”.\n“Everyone in Germany was as shocked as everyone here,” Riedle adds. “It’s sad, but you have to respect his decision. If you coach like Jurgen coaches, it’s very intense. He did seven years at Mainz and seven years at Dortmund before joining Liverpool. It’s bound to take a lot of energy out of you.\n“Coaching a club like Liverpool, there’s always so much pressure. I think he was thinking about his family. Last season wasn’t the best season. But he brought in new talents, young players have come through, and he feels like he’s leaving a very good team for the future. He deserves a break.\n“I think it was the right decision to get it out there now, rather than wait. The players will want to win even more for him. They could still win another four trophies together. Everyone will put everything in to give him the best ‘adios’.”\nKlopp has vowed to have a year off before considering whether to return to management. The perceived wisdom is that it’s a matter of when, not if, he gets the Germany national team job.\nGO DEEPER\nA Liverpool quadruple: It couldn't really happen... could it?\n“Jurgen is such a big star in Germany and everyone hopes that one day he will take over,” Riedle explains. “It just depends on when he feels recharged, and also on the performances of the German national team at the Euros (on home soil) this summer. If that goes well, then I can’t see there being a change with (current manager) Julian Nagelsmann. If things don’t go well, then Jurgen would be first in the list.”\nAdvertisement\nManagement never appealed to Riedle. He had a short stint as player-caretaker boss at Fulham, when they were in England’s second tier, following the sacking of Paul Bracewell in March 2000 after answering an SOS call from then chairman Mohamed Al-Fayed.\n“Those three months were more than enough! It wasn’t for me,” he laughs. “I got Roy Evans, who I knew well from my time at Liverpool, to come in and do the coaching sessions for me.”\nAs a player, Riedle scaled heights beyond his wildest dreams. His father had wanted him to take over the family business, but he did not fancy life as a butcher after impressing on trial at Augsburg.\nNicknamed ‘Air’ as a result of his remarkable collection of headed goals, the 5ft 10in (178cm) frontman won the Bundesliga with Werder Bremen in 1988 under Otto Rehhagel, whom he regards as having the biggest influence on his career.\nIn 1990, he was part of West Germany’s World Cup-winning squad — coming off the bench to score in their penalty shootout against England in the semi-finals.\n“It’s a funny story because I had never hit a penalty before in my whole professional career,” he says.\n“Franz (Beckenbauer, the manager) was asking for volunteers after extra time but everyone was saying, ‘Oh, I can’t. I’m not feeling too good.’ I told him I’d never taken one before, so he walked away. Then I saw him asking (centre-back) Jurgen Kohler and I thought, ‘You can’t let a defender shoot one of these’, so I said I’d do it. Luckily, I scored. (England’s goalkeeper) Peter Shilton was good, but not on penalties.\n“Franz was an incredible person. A bit like Kloppo in that, whenever he said something to you, you just accepted it was right, even if it was completely wrong. You really believed in what he said.”\nGO DEEPER\nFranz Beckenbauer was Germany's most beautiful and important footballer - no one will get close\nThat World Cup in Italy led to a move to Serie A later the same summer with Lazio, where team-mates included Paul Gascoigne, before Dortmund brought Riedle back to Germany in 1993. Two more Bundesliga titles followed before the greatest game of his playing career — scoring twice in a 3-1 win over cup holders Juventus in the 1997 Champions League final, a game played in Germany at Munich’s Olympic Stadium.\nAdvertisement\n“Nobody expected us to win, which made it even better,” Riedle says. “Winning the World Cup wasn’t so bad, but I didn’t get to play in the final against Argentina. You see it differently watching from the outside. In that Champions League final, I was able to really contribute on the field, so that means a lot.”\nWith Dortmund coach Ottmar Hitzfeld being replaced by Nevio Scala, Riedle decided to pursue a new challenge and joined Liverpool that summer. He scored 15 goals in 76 appearances across two and a bit seasons, as his experience complemented Robbie Fowler and a teenage Michael Owen.\n“I was nearly 32 by then, so I knew what my role would be and I really enjoyed it,” he says. “I had a great relationship with Roy Evans. He wanted me to be like a father figure for Robbie and Michael. There was also a young boy called Steven Gerrard coming through. I remember a tackle he put in on Paul Ince in training. Steven was fearless.\n“After playing in Italy and Germany, the culture in England was a bit of a shock. I asked if I could have a massage and was told there was a bath if I wanted to jump in. There was sausage and bacon for breakfast. There wasn’t a proper gym at (training ground) Melwood.\n“We briefly had joint managers (after Gerard Houllier was brought in alongside Evans in the summer of 1998 before being put in sole charge that November) but it was clear that wouldn’t last long. Gerard was the right person at the right time in terms of modernising the club.”\nRiedle, whose 32-year-old son Alessandro is now coach of Borussia Monchengladbach Under-19s, has hotel and property businesses in Italy and Germany. His work with Dortmund takes him to Asia and the United States as the club seek to expand their global fanbase. He appears to have barely aged since he retired in 2001.\n“I’m 58 now, so I take things a bit easier,” he smiles. “The secret is a lot of skiing, a lot of padel tennis and a bit of golf.”\n(Top photo: Boris Streubel – UEFA/UEFA via Getty Images)",
  "word_count": 1632,
  "scraped_at": "2026-02-14T02:07:39.554696",
  "_text_extracted": true
}