{
  "article_id": "3eddfffdc94c",
  "url": "https://www.nytimes.com/athletic/7023655/2026/02/06/casemiro-manchester-united-leaving/",
  "title": "Why Casemiro will be missed greatly at Manchester United – and why his farewell tour will be fun",
  "date": "20260206T144500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello! Welcome to the weekly column from me, Ian Irving, host of the Talk of the Devils podcast.\nEvery Friday during the season, I will bring you my reflections, along with the best of our Manchester United content from across our channels, just in case you missed it.\nThere will also be some big talking points and debates as we head into the weekend action. So let’s get to it…\nIf last Sunday was the first Old Trafford leg of the Casemiro Farewell Tour, we are in for a very fun final few months.\nAdvertisement\nThe Brazilian veteran put on quite the show when he opened the scoring, pulling out a 6-7 dance celebration and then a no-look assist for Matheus Cunha, all while his wife, Anna, bounced up and down in the Stretford End singing her husband’s name with thousands of supporters.\nI’m told by people close to Casemiro, who remain anonymous to protect relationships, that he absolutely loves his terrace chant and massively appreciates the support he’s been given by United fans throughout the ups — and especially the downs — of his rollercoaster three and a half years.\nHis recent form feels almost as good as he’s produced at the club, with strong showings against City and Arsenal followed by a player-of-the-match performance against Fulham. Undoubtedly, he has been given a better platform to play in terms of the shape of the side under Michael Carrick, as well as in the final matches of Ruben Amorim’s tenure, reducing the impact of the physical limitations for the midfielder, who turns 34 in just over a fortnight.\nThe true high of his time at United came with his goal in the Carabao Cup final of 2023 and his influence on the team’s brilliant spring that year. But he’s perhaps been more characterised by his low moments in Manchester.\nJamie Carragher’s line “leave the football, before the football leaves you,” has entered common football parlance after criticising Casemiro’s performance in a 4-0 defeat at Crystal Palace the following year. His struggles during that period ultimately led to him being left out of the starting line-up to face City in the FA Cup final and omitted from the Brazil squad for the Copa America. His United career looked over.\nEven under Amorim, he found himself well down the pecking order, at one stage behind academy player Toby Collyer. But instead of becoming a problem for the squad, he responded by sitting with the youngster before games and giving him advice.\nAdvertisement\nCasemiro has since rebuilt his reputation and reclaimed his status in the team. Replacing him will not be easy. As Andy outlined on Talk of the Devils at the start of the week, there’s an idealised view that United will invest £100million on a new star in the summer that brings more dynamism to the midfield.\nBut you’re losing an incredible amount of know-how from nearly 750 career appearances, from winning 18 major trophies, including five Champions League titles at Real Madrid. There are the obvious strengths of his game as a ball-winning holding midfielder, but also the more hidden, cynical elements to his game that help to disrupt opponents and manage matches.\nTo demonstrate his influence in a stat this season, the two goals United conceded after he’d been substituted against Fulham mean they have now conceded once every 86 minutes while he is on the field, compared to once every 34 minutes when he isn’t playing.\nHis ability in the air will also be a huge miss. He’s a major weapon from set pieces at both ends of the pitch for United, enabling him to score more league goals this campaign than Bukayo Saka, Mohamed Salah and Rayan Cherki.\nOff the pitch, despite not being officially named in the leadership team at the start of the season, he helps head up the group with calm authority. Subtly guiding team-mates with a quiet conversation if he sees something that falls below his standards.\nThe Old Trafford departure video was his idea. Out of respect to supporters, he wanted them to hear the announcement from him. He’d earlier told the players of his decision in their WhatsApp group.\nThey have just 14 matches left to play with the legendary midfielder now, and already it’s said to have been noticeable how much his team-mates are trying to maximise their time learning from him before the Casemiro farewell tour leaves town.\nAdvertisement\nDevil in detail: Bruno Fernandes\nIs there a plaudit that Bruno Fernandes hasn’t been given in his six years at the club? The captain marked the anniversary of his arrival this week in the only way a modern player can: with a carousel of pictures on his Instagram page from throughout his “J6urney”.\nCaptions aside, Fernandes’ fantastic feats only continue at Old Trafford, and he stands just one assist away from becoming the third player in United’s history to record 100 goals and 100 assists after Ryan Giggs and Wayne Rooney. Fitting company.\nCarrick has restored the skipper to his natural No 10 position, and his energy and invention have once again been a key reason in the recent run of wins for the new head coach. By almost every metric, he is the Premier League’s most creative player this term, despite playing much of the season deeper in midfield, recording 12 league assists already — equalling his best-ever United tally.\nBruno Fernandes, midfield maestro 💫\nLeading the way in the Premier League for supplying his team-mates this campaign 🤝 pic.twitter.com/jaC0b2r8eO\n— Premier League (@premierleague) February 1, 2026\nFernandes is just eight short of the record of 20 assists in a single Premier League season set by Thierry Henry in 2002-03 and Kevin de Bruyne six seasons ago. Nick Miller has been pondering in the Briefing if he could be on the brink of another piece of history.\nRed all over\n- Critch writes in his article that January was a “non-starter” in the transfer market for Manchester United. The fact that he argued on Talk of the Devils: Extra this week that his opinion of the month hinged on whether the club was right to loan out a 22-year-old midfielder with just six substitute appearances in the Premier League probably sums it up. We wish Toby Collyer well in his spell with Hull City, of course. Casemiro’s departure announcement was probably the biggest development — aside from having three head coaches across January — but it could’ve been different if Antoine Semenyo could’ve been encouraged to stick a different Manchester post code in his sat nav on the journey north. The summer promises to hold more intrigue for the transfer obsessives.\n- May I have your attention, please? May I have your attention, please? Will the real Benjamin Sesko please stand up. The Slovenian striker certainly got fans off their seats with his last-gasp winner against Fulham, but it was his new trim that caught the eye on Monday’s Talk of the Devils…\n- Last Sunday saw fans group the 1958 lead supporters on a march from each side of Sir Matt Busby Way to protest against the Glazer ownership of the club, as well as voicing their displeasure at the INEOS hierarchy and the way they believe United treat their most loyal supporters. Demonstrating is nothing new; protests have formed a backdrop to United’s seasons across the 21st century, and Chris McKenna has been profiling the fans’ history of voicing their concerns.\n- If graphs and financial numbers are your thing, you’d get on well with Mark Critchley. His latest crunch of MUFC numbers has focused on the issues United have had progressing and improving their commercial revenue in recent years. This graph illustrates the stagnation and Critch’s article assesses a crucial part of the club’s income. The latest episode of the podcast also looks at the impact it could have on United’s summer plans.\n- There will tributes paid before the match on Saturday to the victims of the Munich Air Disaster. This week marks 68 years since the team’s plane crashed on the way back from a European Cup tie in Belgrade. Twenty-three were killed, including eight members of the Busby Babes, Sir Matt’s acclaimed young side. Services will take place at Old Trafford and in Germany on Friday on the day of the anniversary. The club is also inviting ticket holders to pay their respects at a memorial service at 10:30am on the morning of the Spurs game at the Munich Clock.",
  "word_count": 1417,
  "scraped_at": "2026-02-14T01:53:15.567798",
  "_text_extracted": true
}