{
  "article_id": "3f033ae92528",
  "url": "https://www.espn.com/soccer/english-premier-league/story/4877547/liverpools-bright-future-keeps-everton-in-relegation-zone",
  "title": "Liverpool bright future keeps Everton in relegation zone",
  "date": "20230214T081500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LIVERPOOL, England -- Cody Gakpo scored his first goal for Liverpool as Jurgen Klopp's team secured their first Premier League win this year with a 2-0 victory against Everton at Anfield on Monday.\nMohamed Salah's first-half opener set Liverpool on their way to the win in a bad-tempered game that ended with the players confronting each other on the pitch following a foul by Everton goalkeeper Jordan Pickford on Liverpool's Andy Robertson. While the win boosted Liverpool's faint hopes of finishing in the top four, the defeat left Everton in the relegation zone ahead of their crucial clash against Leeds United on Saturday.\nRapid reaction\n1. Liverpool end winless run to keep Everton in drop zone\nLiverpool finally registered their first Premier League win of 2023 -- and welcomed back fit-again Diogo Jota for his first appearance since October -- as Klopp's team deepened the relegation fears for neighbours Everton.\nIn what has been a woeful start to the year for both clubs, the key objective now for managers Klopp and Sean Dyche is to find a way to save their respective team's season. For Liverpool, that is all about finding the form to make a late charge up the table to seal a top-four finish and Champions League qualification. For Everton and recently appointed boss Dyche, however, the only priority is to escape the bottom three and avoid relegation.\nBoth teams still have it all to do to achieve their goals, however.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nDespite this win, Liverpool are still nine points behind fourth-place Newcastle United, whom they play next at St. James' Park on Saturday. Having played one game fewer than Eddie Howe's team, a win would give Liverpool real hope of making the top four, but anything other than three points will leave Klopp's team as outsiders to claim a Champions League spot.\nThe picture is even bleaker for Everton, who remain in the bottom three after this defeat. Dyche's team, who beat leaders Arsenal in his first game in charge earlier this month, play Leeds at Goodison Park on Saturday, with the managerless Elland Road side one place and one point above them in the table.\nWhile this defeat will be a blow to Everton's local pride, the reality is that Saturday's game is so much bigger. If Liverpool and Everton are to save their seasons, though, both need to be better than they were at Anfield in this game.\n2. Nunez and Gakpo show promise for the future\nGakpo and Darwin Nunez have both struggled for goals since completing big-money moves to Liverpool this season, but the two strikers were a big part of this win against Everton.\nNunez, who went into this game with five goals in 16 league games since his club-record £75 million transfer from Benfica, registered an assist for Salah's opening goal while Gakpo finally scored his first Liverpool goal since arriving in a £37 million switch from PSV Eindhoven last month. The two players are both just 23 years old, so their career lies ahead of them and Liverpool signed them to eventually replace Salah, Roberto Firmino and Sadio Mane, the latter leaving for Bayern Munich last summer.\nIt is no secret that Nunez and Gakpo are both still raw and inexperienced at the top level, and that has been evident in their performances for Liverpool, but they are also both hugely talented and the Liverpool fans are displaying patience with the pair of them as they make faltering steps at Anfield.\nNunez never lacks for effort and he can create havoc in opposition penalty areas, even if he misses too many chances, and Gakpo is still adjusting to the demands of English football and Klopp's requirements of him within the team system. With Nunez making one goal and Gakpo scoring another, though, this was a good night for two of Liverpool's big hopes for the future.\n3. Everton need a fit Calvert-Lewin -- and fast\nEverton went into this game with worst goal-scoring record in the Premier League this season, and they never looked like adding to their paltry total of 16 goals all campaign. The absence of centre-forward Dominic Calvert-Lewin for much of the season with injury problems has been a central factor in their lack of goals, but the England striker has still only managed one in 11 appearances.\nIt says everything about Everton's situation that Demarai Gray and Anthony Gordon, now a Newcastle player, are their joint leading scorers in the league with just three goals each. At Anfield, Dyche handed 22-year-old Ellis Simms his first start of the season in place of the injured Calvert-Lewin, and he was completely out of his depth against Liverpool defenders Joel Matip and Joe Gomez.\nSummer signing Neal Maupay (one league goal all season) and Gray started this game on the substitutes' bench, but there is such an absence of firepower in this Everton squad that Dyche desperately needs Calvert-Lewin to find fitness and form. If he continues to be in and out of the team, as he has been all season, Everton will find it tough to score the goals they need to stay up.\nHaving failed to replace Gordon following January move to Newcastle, Calvert-Lewin is now Everton's only option as a reliable goal scorer.\nBest and worst performers\nBEST: Darwin Nunez, Liverpool. The Uruguay forward was Liverpool's best attacking player. All pace and purpose, and his breakaway led to Salah's 36th-minute opener.\nBEST: Andy Robertson, Liverpool. The Liverpool full-back looked back to his best, and it was his burst forward that started the move for the goal that made it 2-0 early in the second half.\nBEST: Joel Matip, Liverpool. He rarely gets the acclaim his performances deserve, but with Virgil van Dijk still not fit to start after injury, Matip once again controlled the Liverpool defence in front of goalkeeper Alisson.\nWORST: Ellis Simms, Everton. A tough task for the 22-year-old Everton forward on only his second Premier League start, but loan spells at Sunderland and Blackpool were a world away from the challenge of playing against Liverpool.\nWORST: Vitalii Mykolenko, Everton. The Everton left-back was tormented all night long by Salah and Trent Alexander-Arnold, and lost the ball too often.\nWORST: Jordan Pickford, Everton. One of the Everton goalkeeper's more erratic performances. Only Pickford knows what he was doing for Liverpool's first goal, when he left a gaping hole for Salah to score.\nHighlights and notable moments\nEverton hit the post at one end, and 45 seconds later, Salah had it in the back of the net at the other end. Devastating quick-strike capability.\nWHAT A COUNTER ATTACK BY LIVERPOOL!\n— NBC Sports Soccer (@NBCSportsSoccer) February 13, 2023\nEverton hit the post then 15 seconds later Mo Salah puts it in the back of Everton's net!\n📺: @USANetwork #MyPLMorning | #LICEVE pic.twitter.com/NEAXCxfdUp\nAfter the match: What the players/managers said\nSalah: \"It's a huge win for us. We had a perfect week to train and the players were so excited and we couldn't wait for the game to turn everything around. Hopefully it was a start.\"\nDyche: \"We have given a lot of information to the players and it is a lot for them to take in. There is work to be done. Last week we beat Arsenal and I wasn't jumping for joy. No lack of effort or work ethic, it's still tough coming here, but [Liverpool] are a great side.\"\nKey stats (provided by ESPN Stats & Information research)\n- Salah's goal was his 100th goal involvement (71 goals and 29 assists) in 104 Premier League appearances at Anfield.\n- Gakpo's goal was his first in any competition since netting in the Netherlands' World Cup group-stage finale against Qatar on Nov. 29.\nUp next\nLiverpool: Klopp & Co. travel to Tyneside on Saturday for a Premier League showdown with Newcastle.\nEverton: The Toffees are also in action on Saturday, when they welcome Leeds to Goodison Park for a clash of 17th vs. 18th in the table, with enormous implications for the relegation fight.",
  "word_count": 1346,
  "scraped_at": "2026-02-14T01:59:41.712794",
  "_text_extracted": true
}