{
  "article_id": "3f040828492d",
  "url": "https://www.nytimes.com/athletic/6340092/2025/05/29/matheus-cunha-manchester-united-transfer/",
  "title": "Matheus Cunha by those who knew him growing up :  He turned from water into wine  ",
  "date": "20250529T064500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Perhaps Matheus Cunha and Manchester United were always meant to be.\nThe Brazilian forward, who has been given permission to undergo a medical at Old Trafford before a proposed £62.5million ($83.7m) summer transfer from Wolverhampton Wanderers, was born just hours after one of United’s most famous nights and 18 years later cemented his reputation as a prodigious talent by starring against them.\nAdvertisement\nWhile Sir Alex Ferguson and his players were still nursing hangovers from their epic Champions League final victory over Bayern Munich in May 1999, Cunha came into the world in the Brazilian state of Paraiba.\nBy the time he starred for Coritiba against United in the under-19s Dallas Cup in April 2017, football had already taken him thousands of miles from home, and his journey was just beginning.\nBy the age of 14, Cunha had moved almost 2,000 miles to sign for Coritiba. By 18, he had swapped South America for Europe to join Swiss club Sion.\nHis life in football has rarely stood still, from the Torre neighbourhood of Joao Pessoa, a medium-sized city in the Brazilian state of Paraiba, to the relative glamour of European football.\n“He was a very talented kid,” Barao Xavier, futsal coach at CT Barao in Recife, told The Athletic. “Cognitively, he was so far ahead of the others. He was the guy who moved the team from defence to attack.\n“He scored goals. He was two-footed. He was the leader. When we played against his Cabo Branco team, I had to come up with a strategy to stop him. We’d leave another player free so we could double up on him.”\nBy the time Xavier first saw Cunha, he had already begun to make a name for himself locally, playing football with his father Carmelo in Praca Sao Goncalo as well as futsal with Cabo Branco.\nXavier’s next plan to neutralise Cunha’s threat was more ambitious — he decided to sign him.\n“I spoke to his dad first,” Xavier said. “I told him I saw a lot of quality in Matheus and asked whether he would be interested in coming to work with me. His dad agreed but I had to run it past his mum, too.\n“I told them both that he would start off playing futsal but that I would oversee his transition to 11-a-side football later on. There wasn’t an 11-a-side league in the town where he lived.\nAdvertisement\n“I was at Santa Cruz at the time, but I left not long after that and ended up bringing him to my project.\n“He arrived in January, aged nine. A month later, he came with us to a tournament in Switzerland.\n“It was a coincidence that he later moved to a Swiss club. We won the tournament and then went back the next year, coming second. In the second year, he was voted best player in the competition.\n“This was a tournament with Bayern Munich, Bayer Leverkusen, Bordeaux and other European sides. It was an under-11 competition. He was 10.”\nAccording to an interview during his futsal days, the young Cunha went by the nickname ‘Neymar’ because “My game is similar to his. I like to dribble, I can shoot with both feet. I play in attack.”\nIt was becoming increasingly clear Cunha had a chance of making football his life, but his father, a teacher of maths and science, and his mother, who worked in a local hotel, refused to let the game interfere with his school work.\n“I remember once we had an important game against Sport in Recife,” Xavier recalls. “It was an evening kick-off and Matheus had a maths exam the following morning. His dad brought him from Joao Pessoa but couldn’t hang around.\n“He told me that Matheus could only play if I promised to take him home after the game. It was a 120km trip! We played the game, won, and I drove Matheus home. We got there at 2am and he was up at 7am for his exam. He was a model student.”\nBy the age of 11, Cunha was attracting the attention of Brazil’s biggest clubs, but a two-week trial at Santos — the club where the legendary Pele and later Neymar started their careers — did not prove successful.\nIt was three years later when the same agent who had arranged that trial asked Xavier for his best players to try out at Coritiba. This time, he did enough to earn a place at the club.\nAdvertisement\n“This guy came from another state to watch first-team games at Nautico and Santa Cruz,” Cunha told GloboEsporte in 2017. “But he ended up being invited by one of my team-mates’ parents to watch a CT Barao game, too. He really liked me. He told me right then that he wanted to take me to Coritiba. I was a kid and I didn’t really believe it. Nearly a year later, he did take me and that’s where my career began.”\nThe move was a big one for a 14-year-old, taking him almost 2,000 miles from his family for a life that revolved around his new club. He moved into accommodation within the Coritiba training complex and was forced to become independent.\n“These things happen with a lot of younger players in Brazil,” Sando Forner, who coached a young Cunha at Coritiba, told The Athletic earlier this year.\n“I think it makes people stronger because it’s not easy to live alone at that age, to solve a lot of problems and deal with difficult situations.”\nAs a player, Cunha’s talent was never in doubt, and his personality made an impression at Coritiba, too.\n“He was always one of the best players in our age group,” said Pablo Thomaz, Cunha’s strike partner in Coritiba’s youth teams.\n“He was the No 10 and I was the No 9. I was the top scorer every year and Matheus was the guy setting up most of my goals. We had a really great partnership. He was so easy to play with. I never had to tell him where to play the pass; he would just read my run and put me through on goal.\n“We were great friends off the pitch and we still speak today. He was a big joker. We were room-mates in the club accommodation.\n“Even as kids, we both had strong personalities. We used to argue a lot. Sometimes we’d fall out in training the day before a match and not speak to each other until kick-off.\n“But he’d see one of my runs and set me up for a goal, and we’d hug and make up. He’d say, ‘You’re a pain, but I love you.’”\nAdvertisement\n“He arrived to play for the under-15 side,” said Thalisson, another team-mate in the youth team. “He was the standout player in his age group. He was more of a midfielder back then. When I saw him later, playing in Switzerland and Germany, or for Atletico Madrid or Brazil, he played as a striker. But at Coritiba, he was a No 10. Everyone could see the technical quality he had, but he wasn’t as physically impressive as he is today. He was a really, really skinny kid. It was his technique that made him stand out.\n“He had a very strong personality and was extremely competitive. Even away from football, playing any kind of game, he always wanted to win and would get into arguments.\n“He was the joker of the group, the guy making everyone laugh. He made fun of everyone and he could take it when we made fun of him in return. He was great fun to be around.”\nLuiz Henrique, another Coritiba team-mate, recalled how Cunha was “a leader, someone who always demanded the best — from himself and from the team.\n“Off the pitch, he was a joker. Sometimes it was a bit much and we would have to tell him to knock it off.\n“He always liked to get advice from those with more experience. In terms of intelligence, he was very advanced for his age.”\nAnother colleague from those days, Diego Monteiro, agreed: “He was strong and quick, but it was his intelligence that stood out,” Monteiro said. “I always thought he was a really promising player.\n“I spent a lot of time with him off the pitch because we used to study together. He was a chatty kid, always laughing, always playing tricks. But on the pitch, he was serious and courageous. He wanted responsibility.”\nThe experience was not plain sailing, however. There was a moment when Cunha’s success might have been halted in its tracks, but instead was propelled to a different level.\nAdvertisement\n“At one point, he was supposed to go to a tournament in Italy with Coritiba,” Xavier recalled. “The day before the trip, he was told he didn’t make the squad. His dad called me. He wanted to bring him home, back to Joao Pessoa.\n“I told him that Matheus should stay put — that he should hang around the training ground, get to know the chef, the kit man, the guy who cuts the grass. Matheus was 16 at the time.\n“He stayed and ended up being asked to train with the older boys — under-19s, I think — while his age group was away. There was a shooting session and he did well; he ended up changing position, becoming a striker, and moving up an age category.”\nIf Cunha’s ability was always clear, it was in those older age groups at Coritiba, based in the city of Curitiba in the southern state of Parana, that he really flourished.\nHenrique Vermudt, another Coritiba team-mate, said: “When he arrived — in the under-15s, I think — we could all see he was talented, but nothing out of this world. He was just a good, solid player.\n“But when he started playing for the under-20s, he changed. He turned from water into wine. He came back from his holidays in Paraiba and he was just… different. We all joked with him, ‘Man, what did you do to get so good all of a sudden?’\n“He had a great personality. We’d arrive for training at 7.30am, everyone shivering in the cold, and he’d be this ball of energy, doing pranks, winding people up. It could actually be a bit annoying sometimes, but he was just so full of life, so happy.”\nAnd then came Dallas, and that first meeting with Manchester United. Cunha and co travelled to Texas for a tournament that featured clubs from around the world, with Everton joining United in representing the Premier League.\nCoritiba reached the semi-finals before losing 2-1 to the hosts, FC Dallas. Cunha was suspended, having collected two yellow cards in previous games, but had already done enough to take the tournament by storm, including in a 1-1 draw against United.\nAdvertisement\n“I was captain of that age group,” said Thalisson. “Matheus was a year younger but he caught everyone’s attention. He did some absurd things with the ball. He was spectacular, our best player.\n“We had a great run to the semi-finals and he played well in every match. Playing against a team like that (United) was unforgettable. It was a really even match, too. Matheus took responsibility, like he always did. He wanted the ball all the time, wanted to be at the centre of everything. Some young players might feel nervous playing against a big-name team, but he wasn’t scared. He really stood out in that match.”\n“We would wind him up, telling him he was the best player in the world born in 1999,” added Vermudt. “He didn’t like the joke, but he absolutely destroyed that tournament.\n“Against Chivas — we won 4-3 — he set up three goals and then scored an amazing solo goal. He did everything himself, dribbling from halfway and going past most of their team before scoring.\n“He was brilliant against Manchester. It was a close game and there was even a bit of a scuffle between the sides. We had a very defensive setup; he had to do pretty much everything on his own in the final third.\n“He had a great tournament. We joked with him that it was like he had edited his game down to a highlights reel.”\nYet when Cunha made his surprise move to Switzerland shortly after his return from the United States, it was his personality and not his performance that sealed the deal, according to one of the men closely involved.\n“When I was in Curitiba and he was 17, I went to watch a game, said the former agent Eric Lovey, speaking to The Athletic earlier this season.\n“An agent had said, ‘Come and see my players’. I had been shopping and had been to see my friends and I had nothing to do, so I decided to go and watch the game. Matheus didn’t play a very good game, but afterwards I went for a coffee with him. After 15 minutes, I saw such maturity in him that he could be a big player.\nAdvertisement\n“I said to my friend, the president of Sion, ‘I don’t have a video or a DVD, he’s not on Transfermarkt, he is nothing’.\n“I told him he had the possibility to believe in me, and he paid $200,000 (£150,000) to sign him, but when he signed him, he didn’t know anything about him.\n“He had never played as a professional, but after the coffee with him, I was so impressed with his personality. I spoke with a man. He was not like an under-18. He was focused. His home is a three-hour flight from Coritiba, so he went home one time every year.\n“When he was at Coritiba, he earned $200 per week, so he did not have the money for flights to see his family. Coritiba is one of the coldest cities in Brazil, and when someone says to you at 13 that you have to go over 2,000km from your house, it takes character.”\nLovey, the former agent of Brazilian superstar Ronaldinho, set the wheels in motion for the move, but Cunha still had to decide whether to travel even further from his family, to a different continent, while still in his teens.\nThalisson said: “I remember sitting in the stands at the Couto Pereira (Coritiba’s stadium) having a chat. He asked me whether I thought he should go.\n“He was a bit scared. He wanted to turn professional at Coritiba, but he saw Sion as a huge opportunity.\n“We talked about it a lot. It was a decision that could change his life completely, but he also had reservations. We all supported him. Thankfully, everything worked out well.”\nThomaz added: “I remember we were both called into a meeting to renew our contracts and talk about moving up to the senior side. But he didn’t sign. It took me by surprise.\nWhen I moved up to the first team at Coritiba, I found out he was moving to Switzerland. I think he understood that it was the best option for him and his family.”\nAdvertisement\nCunha’s impact at Sion was not instant. But it did not take long. The club flew his mother from Brazil for two months to help him settle, taught him French — the local language — and focused intensively on his fitness and defensive understanding.\n“Players like Matheus need time to adapt when they arrive in Europe,” said Christian Zermatten, a Sion coach, speaking to Nouvelliste, in 2018.\n“He made the effort to learn French quickly. Everything became easier when we were able to speak to him directly.”\nTypically, Cunha did not stand still. Within a year, he moved on to RB Leipzig, two years later to Hertha Berlin and, after a year in Germany, he was off to Atletico Madrid.\nWolves came calling two-and-a-half years ago, and now the biggest challenge of Cunha’s career awaits. He can count on support from those who were there at the start.\n“Now when I see him play, he maintains some of the characteristics he had here,” said Forner, who was on the Coritiba bench for that Dallas Cup game against United.\n“There are things he hasn’t lost: he still finishes very well, he still has very good skills in one against ones. But now he understands the game and his positioning is very good.”\n“I was at his wedding last year, in Natal,” said Xavier. “There is a photo of him sitting on my lap. I’m not one of those people who are always pestering; I like to leave him be, because he has a busy life. But we still talk sometimes and I wish him luck before games.\n“Last summer, he came back to visit the project. He saw the pitch he used to train on.\n“I remember speaking to his mum during a game against Santa Cruz. He must have been 13. I said, ‘Lu,’ — her name is Luziana — ‘Matheus plays like they do in Europe.’ She told me she hoped that was a sign.\n“When I see him play today, I feel like my work paid off, that it was worth it. I travelled 120km just to watch him play, then had the pleasure of working with him. He makes me so proud.\n“He’s an example to all of the other kids here — an example of grit, determination and the value of hanging in there. I’m so happy for him.”\n(Top photos: Barao Xavier and Getty Images)",
  "word_count": 2924,
  "scraped_at": "2026-02-14T02:09:11.443121",
  "_text_extracted": true
}