{
  "article_id": "3f074346b79a",
  "url": "https://www.fourfourtwo.com/news/who-has-the-tv-rights-for-each-competition-this-season",
  "title": "Who has the TV rights for each competition this season ? ",
  "date": "20240722T113000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWith Euro 2024 firmly in the rearview mirror and teams now jetting out on moneyspinning pre-season tours, it's really not long until it all gets going again.\nSo while you're busy buying your new replica kit and drafting up your 2024/25 fantasy team, you may also want to check where you can watch your team's action this season to make sure you have the correct subscriptions for the year ahead.\nThe ever-changing world of broadcasting contracts means there are some significant changes for UK viewers this season, not least a huge bump in live EFL coverage and the BBC getting their hands on some new rights. FourFourTwo takes a look at where you can watch each of the major competitions this season.\nVIDEO Ranking Every England Player At Euro 2024\nPremier League\nThis is the final year of Sky Sports’ current package, which sees them broadcasting 128 live matches this season. This will include the Saturday 5.30pm and 7.45pm slots, Sunday at 2pm and 4.30pm, plus Monday and Friday nights.\nTNT will show 52 games this season, as they have rights to the Saturday 12.30pm slot, plus further midweek and weekend matches, while Prime Video have the final live package and will show all 10 matches from one midweek fixture programme and all 10 from the Boxing Day round of fixtures.\nThe BBC will continue to have the highlights until 2029, so Match of the Day will be on our screens as usual.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWomen’s Super League and FA Women’s Cup\nSky Sports will show 44 live matches from the Women’s Super League, with the BBC adding another 22 live games. The BBC will also show seven live games from the FA Women’s Cup, including both of the semi-finals and the final.\nEFL Championship, League One, League Two\nIt’s the first year of a huge new Sky Sports deal for the EFL, which will see a significant increase in live matches. The broadcaster will show 328 Championship games, 248 from League One, 248 from League Two, plus all play-off matches via their TV and streaming services.\nITV has highlights rights and they will also be broadcasting five live matches this season.\nFA Cup\nFA Cup action in 2024/25 will again be split between the BBC and ITV, with the former showing 18 matches and the latter 20. Both companies will show the final, while S4C will also have selected matches involving Welsh sides.\nEFL Cup and EFL Trophy\nSky Sports will be showing every match in both competitions live this season. ITV will broadcast highlights, plus live coverage of one EFL Cup semi-final and the both finals.\nNational League\nTNT Sports will again broadcast live coverage from the National League, including the play-offs and a weekly highlights package.\nChampions League, Europa League, Europa Conference\nTNT Sports will again have the bulk of the action from the big European competitions, but there are some changes this season.\nA total of 533 matches across the three major European tournaments will be shown live on TNT Sports, but we will also have 17 Champions League games live on Prime Video on a Tuesday night.\nThe BBC will show Champions League highlights for the first time this season, with a Wednesday night programme.\nAll of the finals will be available free to air on the Discovery+ app.\nLa Liga\nIf you’re wanting to keep an eye on the likes of Jude Bellingham, Kylian Mbappe and Lamine Yamal this season, La Liga will be live on Premier Sports, with ITV also having ten live matches.\nBundesliga\nHarry Kane will go again in his quest for a major trophy under Vincent Kompany this season, as they look to derail a Bayer Leverkusen side that enjoyed an undefeated season under Xabi Alonso ast year. Sky Sports has the rights for live Bundlesiga coverage.\nSerie A\nIf Italian football is your thing, then TNT Sports have live Serie A right for the upcoming 2024/25 season.\nLigue 1\nTNT Sports also have the rights to France’s Ligue 1 as Paris Saint-Germain begin life after Mbappe by aiming to win a fourth straight title and 11th in 13 seasons.\nMajor League Soccer\nThe MLS enjoys a different calendar to European football, so you can catch the end of the current campaign, plus next season's action on Apple TV.\nEngland matches\nITV will be broadcasting live coverage of all of the England men’s national team’s World Cup qualifiers, Nations League clashes and friendlies this season as the post-Gareth Southgate era begins.\nMore stories\nEuro 2024 & Copa America combined XI: Which players make it in?\nManchester United star Jadon Sancho on verge of spectacular move to European giants: report\n‘I left Chelsea for Liverpool after having my mind blown by Moneyball strategy’: Ex-England star opens up on decision to swap London for Merseyside\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.",
  "word_count": 1032,
  "scraped_at": "2026-02-14T02:08:01.872928",
  "_text_extracted": true
}