{
  "article_id": "3f0d96747792",
  "url": "https://www.meathchronicle.ie/2023/04/30/bruno-fernandes-strike-boosts-man-utds-top-four-hopes-and-ends-aston-villa-run/",
  "title": "Bruno Fernandes strike boosts Man Utd top - four hopes and ends Aston Villa run",
  "date": "20230430T181500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bruno Fernandes strike boosts Man Utd’s top-four hopes and ends Aston Villa run\nBy Simon Peach, PA Chief Football Writer\nBruno Fernandes’ strike strengthened Manchester United’s grip on Champions League qualification and ended Aston Villa’s 10-match unbeaten run.\nUnai Emery has overseen an incredible turnaround since replacing Steven Gerrard and kicking off his Villa reign with an impressive win against the Red Devils in November.\nBut Fernandes’ first-half goal sealed United a 1-0 victory amid a backdrop of anti-Glazer protests on Sunday.\nUnited had failed to win their last three Premier League matches against the Birmingham outfit and looked determined to halt that run as they flew out of the blocks at Old Trafford.\nCasemiro struck the crossbar before Erik ten Hag’s men deservedly went ahead when Fernandes fought to turn home after Emiliano Martinez pushed away a Marcus Rashford shot.\nVilla could not respond as they failed to score in a Premier League match for the first time under Emery, with the impressive Victor Lindelof clearing a late Douglas Luiz attempt off the line.\nThe match came just two days after Sheikh Jassim and Sir Jim Ratcliffe submitted their third, and what is expected to be final, offers to buy United.\nOther parties are interested in minority investment, and it was reported that Joel and Avram Glazer could remain stakeholders under one deal being proposed by Ratcliffe.\nA group of United fans marched to Old Trafford in protest against the Glazers, with a giant banner reading ‘Full $ale Only’.\nProtestors’ flares outside the ground also filled the air inside Old Trafford but many did not heed the call for an 18-minute boycott – a minute for each year of the Glazers’ ownership.\nThose that stayed outside did not miss any goals despite an impressive United start.\nRashford struck narrowly wide having been slipped through by Marcel Sabitzer, unaware he would be flagged for offside in the build-up.\nThe 25-year-old soon had another chance as Fernandes smartly played him in to get away a shot that Martinez spread himself well to stop.\nThe Villa goalkeeper did well there but was twice breathing a sigh of relief soon after.\nUnited failed to punish him after he raced off his line to cut out a ball, then the World Cup winner slipped only for a Fernandes cross to just evade team-mates.\nEmery’s side had offered precious little in response but had a superb opportunity around the 20-minute mark.\nOllie Watkins slipped at the far post as Emiliano Buendia set over a tantalising low ball, with Alex Moreno’s fierce follow-up denied by David De Gea.\nWatkins’ penalty appeals fell on deaf ears, as did the United spot-kick calls that followed in a spell that saw Casemiro avoid a booking for a challenge on Ramsey.\nThe midfielder has been below par in recent matches but was superb on Sunday and went agonisingly close to a 28th-minute opener.\nJadon Sancho met a diagonal ball with some fine work on the left, before cutting back for Casemiro to eventually hit a strike that rattled the crossbar.\nAn entertaining half looked to set to end scoreless, only for Fernandes to make the breakthrough in the 39th minute.\nMartinez’s goal-kick was headed away powerfully, putting Rashford through on goal.\nThe goalkeeper could only push away the forward’s low strike and Fernandes beat Moreno to turn home the loose ball. The skipper celebrated by staring at the away fans that had been goading him.\nFernandes’ strike was given the green light after a VAR check and he saw a stoppage-time attempt at a second comfortably held by Martinez.\nVilla showed signs of life in the second half, but Lindelof frustrated Watkins and Ramsey.\nMartinez stopped Rashford at the other end and Christian Eriksen dragged wide shortly after seeing a cross coolly cut out by Tyrone Mings.\nRashford went down claiming a penalty against Calum Chambers, while Casemiro went close as play continued without intervention.\nVilla nearly capitalised in the 81st minute. Some penalty area pinball ended with Luiz seeing a shot blocked by Sabitzer, before Lindelof rose to head his goalbound follow-up off the line.\nThere were Villa cheers when United brought on Harry Maguire, but the away side could not find a leveller.",
  "word_count": 705,
  "scraped_at": "2026-02-14T02:12:37.698769",
  "_text_extracted": true
}