{
  "article_id": "3f1d927cb661",
  "url": "https://www.ariananews.af/stars-react-to-fifa-club-world-cup-match-ups/",
  "title": "Stars react to FIFA Club World Cup match - ups",
  "date": "20241208T210000Z",
  "domain": "ariananews.af",
  "source_country": "Afghanistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "International Sports\nStars react to FIFA Club World Cup match-ups\nThe draw produced a string of heavyweight match-ups, fascinating sub-plots and regional rivalries.\nPlayers, coaches and officials have reacted to the Club World Cup draw that will be played in the United States from June 16 next year, and despite being six months away, they are all already hard at work plotting their path to the final.\nThe draw produced a string of heavyweight match-ups, fascinating sub-plots and regional rivalries. Here is some of the best reactions from across the planet to how the eight groups are shaping up.\nGroup A: SE Palmeiras, FC Porto, Al Ahly FC, Inter Miami CF\n“We will have three extremely difficult games in the group stage, but we will prepare ourselves in the best way possible to seek qualification. It is an honour and a joy to compete in the most important club competition in the history of world football.”\nLeila Pereira, Palmeiras president\n“As players, we gathered to watch the draw together and I think it’s a balanced and good group that includes strong teams such as Inter Miami, Porto, and Palmeiras. I believe we have the ability to reach the knockout stage of the tournament.”\nMohamed El-Shenawy, Al Ahly captain\nGroup B: Paris Saint-Germain, Atlético de Madrid, Botafogo, Seattle Sounders FC\n“It’s an honour for all Atlético fans to participate in the first edition of the FIFA Club World Cup. We have a very difficult group, with three high-level opponents. PSG are a great side, with a brilliant manager and really high-level players. We faced them a few weeks ago [in the UEFA Champions League] and it was a tough battle. It’ll be a difficult debut in the competition. Botafogo just won the Copa Libertadores, showing their enormous potential. The Brazilian sides are brilliant and will make like very difficult for us. Seattle Sounders are one of the best sides in the United States, who keep raising their level every season, and they will be very dangerous and competitive given that they are playing at home. I think it is the most difficult group in this first phase and there will be some great games for the fans”.\nEnrique Cerezo, Atlético de Madrid president\n“I saw this [Luis Enrique saying that Botafogo would fall into the PSG group]. I want to say that I trust and love anyone with the name Luis Enrique. I saw it, I thought it was super funny and how prophetic, right? He’s a great guy, a great coach. I think Botafogo will shock some people. I believe we are the best team in South America. They play good football in Europe, and so do we.”\nJohn Textor, Botafogo’s owner\n“If I look at it from my lens as a soccer fan, a guy who grew up in Seattle, I think it’s unbelievable. You’ve got the biggest club in France. You’ve got a Spanish team that is unbelievably talented, a legendary coach, and then the Copa Libertadores champion. And Joao Paulo, one of our players, actually played for Botafogo. So I mean, just three really fantastic clubs from a fan perspective.”\nBrian Schmetzer, Seattle Sounders head coach\nGroup C: FC Bayern München, Auckland City FC, CA Boca Juniors, SL Benfica\n“It’s a great honour to be able to play the Club World Cup with Bayern Munich. I’m really looking forward to this new tournament, where we players can compete against the best in the world at club level. As a player, you always want to play at the highest level. I’m very excited about the matches and who will be the first winners of this new format.”\nHarry Kane, Bayern Munich striker\n“I’ve never played professionally in my life and never did I think I’d be playing against someone like Harry Kane. I never even thought I could watch someone like that in a stadium let alone go toe-to-toe with them.”\nMario Ilich, Auckland City midfielder\n“It’s a difficult group. Bayern Munich, at European level, we’ve never managed to beat. And also Boca Juniors, which is one of the most historic teams in South America. Then Auckland, who we know less about, but who I believe come with the same ambitions as the others. We will do everything we can to get through the group stage, which is our objective. It is a very important competition, a historic moment. We don’t come here to see the party. We want to get as far as possible.”\nRui Costa, Benfica president\nGroup D: CR Flamengo, Espérance Sportive de Tunis, Chelsea FC, Club León\n“Our bracket is difficult, but I’m very confident. We’ll reach the tournament a good moment, still in the middle of the year, when the team won’t be as tired as it usually is at the end of the year.”\nRodolfo Landim, Flamengo president\n“We’ve been placed in a tough group, which is a motivating challenge and, in itself, a good thing. This competition also gives us a unique opportunity to experience a wide variety of playing styles from all over the world. We will do everything we can to progress through this group stage and proudly represent our colours.”\nLaurentiu Reghecampf, Espérance Sportive de Tunis coach\nGroup E: CA River Plate, Urawa Red Diamonds, CF Monterrey, FC Internazionale Milano\n“We look at rivals objectively and not as something personal. You have to analyse the parties individually. The story of [Martin] Demichelis [Monterrey coach and former River Plate coach and player] has a lot to do with River, we know. We also knew before that we could face each other [Javier Zanettii] in the final. Inter is an opponent with great history. But they are all tough to play against.”\nJorge Brito, River Plate president\n“It’s an interesting draw for us. I thought maybe two Europeans would get in, but we got one team from Europe, the others from Mexico and Argentina, so we are playing against three different football cultures. It will be a big challenge for Urawa. It is no secret that the team needs new blood and new players. We need strong characters to achieve our goals.”\nMaciej Skorza, Urawa Reds coach\n“River Plate are a big club, a great institution and they have a great manager. We’ll have to prepare in the best way. To face a team like River is very difficult, they have great players. It will be a wonderful match.”\nJavier Zanetti, Inter Milan vice-president\n“Yesterday I told my brother that I wanted to play against Inter and River Plate. I wanted to play against teams I had never played before. The Mexican teams and the South American teams maybe don’t have so many references in Europe, but I think they are going to surprise at the World Cup. There is a lot of talent and a lot of desire to do well.”\nOliver Torres, Monterrey midfielder\nGroup F: Fluminense FC, Borussia Dortmund, Ulsan HD, Mamelodi Sundowns FC\n“The fact that the best teams from all continents and confederations of recent years come together at the FIFA Club World Cup is perhaps best demonstrated by our group: we have four teams and four continents. Personally, I think it’s great that we’re facing a Brazilian team because of our long tradition of BVB players coming from Brazil. We’ve earned the right to be here over the years through our performance. And we’ll take this competition very seriously.”\nLars Ricken, Borussia Dortmund managing director\n“It’s a question of mindset and confidence. Football must be played and then it will be 11 against 11. You have to go out on the field and perform as well as possible. Borussia Dortmund is a traditional club, and the same goes for the other two clubs in their countries.”\nBranco, Fluminense legend\n“After seeing the interest and effort from FIFA to create this tournament, I can feel that the Club World Cup is just around the corner. This is a hard earned opportunity for us. We will be going to the Club World Cup in our strongest form and try to make it a successful tournament for us.”\nKim Kwang-guk, Ulsan HD general manager\n“I am so happy to see the name Mamelodi Sundowns listed among the best clubs. I got goosebumps just seeing our name on the screen. It’s such an emotional moment and an incredible achievement for the club.”\nRonwen Williams, Mamelodi Sundowns captain\nGroup G: Manchester City, Wydad AC, Al Ain FC, Juventus FC\n“It’s quite an exciting draw. [We’ve drawn] one team we’ve played a lot and actually play them next week [in the UEFA Champions League], Juventus. It’s a big game, we’ve always had big games against them. Then there’s two teams we’ve never played so it’s going to be an interesting group. They’re tough opposition, so there are going to be good games.”\nRoel de Vries, Manchester City Chief Operating Officer\n“We will meet one of the favourites for the trophy, Manchester City; in general it will be a tough group, and the opponents are excellent teams. The tournament seems wonderful to me, it is new and there is much to discover”\nStephan Lichtsteiner, Juventus legend\n“I am satisfied with this draw. I wanted us to be in the same group as Manchester City, and that wish has been granted. Facing a coach I admire greatly, like Pep Guardiola, motivates me. We now have six months to be at our best and show the world what we, Wydad Athletic, are capable of achieving.”\nRulani Mokwena, Wydad AC coach\nGroup H: Real Madrid C. F., Al Hilal, CF Pachuca, FC Salzburg\n“We’re hugely excited by the start of this competition and we want to try and win it. Pachuca is a Mexican club with great tradition and it won’t be an easy game. We faced Al Hilal in the Club World Cup final and they’re a club that has really grown and boast top quality players. They’re bound to be dangerous. And we’re set to play Salzburg in the Champions League in January as well”.\nEmilio Butragueno, Real Madrid Institutional Relations Director\n“It is a great pleasure for us that our Salzburg way has now led us to the FIFA Club World Cup, where we will be competing against the world’s best club teams of recent years. I think that this participation is not only a great honour for FC Salzburg, but also a recognition of the entire Austrian club football system, which has steadily developed in recent years.”\nStephan Reiter, Managing Director of FC Salzburg\nInternational Sports\nAFC Champions League Elite delivers key results as race for knockout stage intensifies\nIn Tuesday’s action, Sanfrecce Hiroshima claimed a hard-fought 2–1 victory over Johor Darul Ta’zim, strengthening their position as the race for qualification tightens.\nThe AFC Champions League Elite continued on Tuesday, February 10, with four crucial matches that further shaped the standings in Asia’s premier club competition, as teams battle for places in the knockout rounds.\nThe AFC Champions League Elite is the top tier of Asian club football, bringing together the continent’s strongest teams in a league-phase format before progressing to the Round of 16 and the knockout stages later in the season.\nIn Tuesday’s action, Sanfrecce Hiroshima claimed a hard-fought 2–1 victory over Johor Darul Ta’zim, strengthening their position as the race for qualification tightens.\nVissel Kobe continued their impressive campaign with a composed 2–0 win against FC Seoul, reinforcing their push near the top of the standings.\nElsewhere, Buriram United picked up a vital 1–0 away victory over Chengdu Rongcheng, a result that keeps the Thai side firmly in contention for a place in the Round of 16.\nMachida Zelvia also enjoyed a successful night on the road, defeating Shanghai Shenhua 2–0 to boost their hopes of progressing from the league phase.\nThe competition continues on Wednesday with more decisive fixtures on the schedule. Gangwon FC face Shanghai Port in a clash where both sides will be looking to secure valuable points, while Ulsan HD FC host Melbourne City FC in a high-profile encounter with major implications for the standings.\nAll AFC Champions League Elite matches are being broadcast exclusively in Afghanistan on Ariana Television. Fans are encouraged to follow official social media pages for the latest match schedules, updates, and highlights as the tournament moves closer to the knockout stages.\nInternational Sports\nWinter Olympics: Milan action continues with packed schedule on Tuesday\nTuesday’s schedule meanwhile also features a full slate of events, including short-track speed skating finals, cross-country skiing sprints, figure skating competitions and additional freestyle and alpine skiing action.\nCompetition continued across multiple venues at the Milan-Cortina Winter Olympics on Monday, with medals decided in speed skating, snowboarding and curling as the Games gathered momentum.\nMonday’s highlights included high-stakes finals on the ice and snow, as athletes from Europe and Asia featured prominently in speed skating and snowboard events, while curling teams completed round-robin play to determine semifinal match-ups. Several nations strengthened their early medal positions as crowds filled venues in Milan and the surrounding alpine regions.\nTuesday’s schedule meanwhile also features a full slate of events, including short-track speed skating finals, cross-country skiing sprints, figure skating competitions and additional freestyle and alpine skiing action.\nCurling medal matches and women’s ice hockey games are also set to take place as the Olympic programme intensifies.\nOrganisers said competition would continue throughout the day across multiple sites, with several medal events expected to draw strong international interest.\nIn Afghanistan, Ariana Radio and Television Network (ATN) holds exclusive broadcast rights to the Milan-Cortina Winter Olympics.\nFans are also encouraged to follow Ariana News and Ariana Television’s official social media platforms for updated daily schedules, results and coverage from the Games.\nInternational Sports\nIPL 2026: Franchise sales gather pace as global investors circle teams\nRoyal Challengers Bengaluru (RCB) has been put on the market by its current owner and is estimated to be worth up to $2 billion.\nDevelopments off the field are drawing growing attention ahead of the 2026 Indian Premier League season, with two franchises — Royal Challengers Bengaluru and Rajasthan Royals — formally up for sale and attracting interest from high-profile domestic and international investors.\nRoyal Challengers Bengaluru (RCB), one of the league’s most recognisable teams, has been put on the market by its current owner, Diageo’s United Spirits Ltd, following a strategic review. The sale process is expected to be completed by the end of March 2026. Market estimates suggest the franchise could be valued at around $2 billion, reflecting the soaring commercial value of the IPL.\nSeveral bidders have been shortlisted for RCB, including investment groups led by Indian industrialists, private equity firms and overseas sports owners. Among those reported to have shown interest is a consortium linked to the Glazer family, co-owners of English Premier League club Manchester United. Non-binding bids have already been submitted, with binding offers expected in the coming weeks.\nRajasthan Royals (RR), winners of the inaugural IPL title in 2008, are also in the process of being sold. A shortlist of potential buyers has been finalised, featuring a mix of Indian and international investors, including private equity firms, entrepreneurs and media-linked groups. The franchise is expected to attract a valuation of more than $1 billion, according to market estimates.\nFinal bids for Rajasthan Royals are anticipated in early March, while the RCB transaction is expected to move into its final phase later this month. Any change in ownership will require approval from the Board of Control for Cricket in India (BCCI).\nThe potential sales mark one of the most significant ownership shake-ups in IPL history and underline the league’s growing appeal as a global sports investment as preparations continue for the 2026 season.\n-\nSport5 days ago\nChampions League Elite action continues as qualification race tightens\n-\nInternational Sports4 days ago\nIPL 2026: Franchise sales gather pace as global investors circle teams\n-\nSport5 days ago\nEarly medal leaders emerge as Winter Olympics continue in Italy\n-\nLatest News5 days ago\nTerrorist activities observed along Afghanistan borders, says Lavrov\n-\nWorld5 days ago\nHong Kong tycoon Jimmy Lai sentenced to 20 years in jail in national security trial\n-\nLatest News5 days ago\nPakistan president claims situation in Afghanistan is ‘similar to or worse than pre-9/11’’\n-\nSport2 days ago\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\n-\nBusiness4 days ago\nUzbekistan approves feasibility study agreement for Trans-Afghan Railway",
  "word_count": 2735,
  "scraped_at": "2026-02-14T02:11:20.841421",
  "_text_extracted": true
}