{
  "article_id": "3f5b82e6f80a",
  "url": "https://theathletic.com/4734597/2023/07/31/vivianne-miedema-world-cup-injuries/",
  "title": "Vivianne Miedema on World Cup injuries :  Ive had to turn off the TV . It too painful  ",
  "date": "20230731T101500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vivianne Miedema is the all-time leading goalscorer in the Women’s Super League and the record scorer for the Netherlands, too. She should have been appearing at this Women’s World Cup, attempting to go one better after reaching the final in 2019, but she tore her anterior cruciate ligament in December 2022, ruling her out of the tournament. She is watching from afar, along with partner and fellow Arsenal forward Beth Mead, who suffered the same injury four weeks earlier, in November 2022. Vivianne is a guest writer for The Athletic during this Women’s World Cup.\nAdvertisement\nI’ve had to turn away from the TV during some of these World Cup games. I’ve had to walk out of the room. It’s been too painful to watch players go down, knowing they might have the same injury I have.\nI stopped watching England’s opener against Haiti when Jennyfer Limage went down with what turned out to be an anterior cruciate ligament (ACL) rupture. I couldn’t keep looking. I needed a break. I felt the same when Keira Walsh went off injured for England, even though she avoided the same fate. I’ve found that — watching this happen to so many other players — to be the hardest part of being injured.\nEvery time I watch women’s football at the moment, I’m waiting for the next big injury to happen. No one should have that in the back of their mind when they’re watching a game, let alone playing. Walsh had even said to the media that each time she goes on the pitch, she’s scared something will happen to her. Consciously or unconsciously, players are thinking about it. We’ve all seen ACL injuries happen to team-mates but never as many as we’re seeing right now. Speaking to some of my friends in the game, they’re quite relieved when they don’t have games — then they go away with the national team in the hope it doesn’t happen there because it’s happening everywhere.\nThe U.S. are a prime example. How many players are they missing through injury for this tournament? There is their captain, Becky Sauerbrunn, then Mallory Swanson, Catarina Macario, Christen Press, Abby Dahlkemper… How long have you got?\nI’ve been a professional footballer since I was 15. For years, I’ve heard players around me talk about what an ACL injury feels like. They all say that when it happens, you know instantly.\nI did.\nIn our 1-0 Champions League defeat by Lyon, I chased down the ball and planted my left leg. I heard and felt it pop. My team-mates have said to me since: “We’ve never heard you shout out, but we heard you then.”\nAdvertisement\nI turned to the physio. “Just get me off the pitch,” I said. “Right now. Because I know I’ve done my ACL.”\n“No, no,” he said. “You don’t know that.”\n“Yes, I do. I’m 100 per cent sure.”\nI was strangely calm. I vividly remember lying on the Emirates pitch thinking, “That’s the end of my season”. I’m not going to play at the World Cup. All of those thoughts rolled over me. My mind yanked itself into the future, thinking about all of the games I was going to miss. Maybe it’s different for the girls who have hope. With any injury, you always hope it’s not as serious as it felt in the moment — that you didn’t really feel what you thought you did. But I knew. There was no point in hoping.\nThe players came into the dressing room at full-time and said: “The game was dead after you went down injured.” It wasn’t about the football, but about just getting through. It was Arsenal’s second ACL injury in just a few weeks — the girls could have been scared that they might be next. They played the rest of that game feeling all those emotions, as England had to once Walsh went off on a stretcher. And I knew how they felt. As soon as the whistle blew on our 3-2 defeat by Manchester United in November — when Beth suffered her ACL injury — I didn’t go to our dressing room with the rest of the girls but tracked down Beth to make sure she was OK. She tried to be optimistic, but, deep down, I think she feared the worst.\nI went for a scan the following day. Then the physio texted me at noon: “We’ve got your results. We’ll come over once the girls finish training.”\nMany of the other girls were at our house that day. The physio took me into the bedroom because he wanted to tell me privately. When the news came, I didn’t really react. I didn’t even flinch. “I told you so,” I think I said. I knew all along.\nAdvertisement\nIn the end, the emotions came in waves. They came from knowing I was going to be out for so long. They came from thinking I wouldn’t be able to drive Beth home for Christmas — that was one of the first things I worried about. My brother and his girlfriend were meant to come to London that weekend. I felt like I’d ruined everything. This would have been my third World Cup. I probably would have scored my 100th national team goal there. They’re special things that you now miss out on.\nI joke that it’s a miracle Beth and I are still together. Beth’s rehabilitation has been smooth and we hope it’s going to stay like that. I’m a month behind and have had a bigger surgery. I’ve compared our recovery times when that was the last thing I should have been doing. Beth was walking after two weeks. She was on the pitch after four months. There are days when my knee is just not doing what it’s supposed to and it feels as though every step forward is followed by a step back. You start thinking, I do miss the World Cup. You’re angry and upset. Then you feel better because you’ve got those feelings out of your system. Then you watch another Arsenal team-mate go down — Leah Williamson, then Laura Wienroither — and you feel the exact same way again. When Leah went down, I ended up walking to the bedroom again and taking some time for myself. It was so upsetting to see someone else go through that.\nYou’re all over the place and I think I still am now that the tournament is underway. We watched Australia’s opening game against the Republic of Ireland from the gym at Arsenal’s training ground. Girls were lying on the floor with foam rollers, gazing up at the TV. When my team-mate Steph Catley scored the penalty, we were buzzing for her. But then it hit us: we’re not there. You feel so proud — but so sad.\nWhat needs to change? Firstly, FIFA and UEFA need to take responsibility for the playing calendar. If they don’t want to lower the number of games we play, they need to at least plan them better. The World Cup began on July 20 and the final takes place on August 20. Those players who go to the final could have Champions League matches in early September. When are they supposed to switch off and rest? The games themselves are also becoming more demanding because the standard is so much higher. Matches are more physical and intense, played at a quicker pace — hence the scorelines at the World Cup have been closer than in previous tournaments. If we want to keep adding games to the calendar, we need to look at how we’re doing that.\nI feel strongly that FIFA should have allowed 26-player squads for the World Cup, as they did at the men’s tournament last year. Covid might not be as big an influence as it was then, but injuries, schedules and travel distances mean we must protect players.\nBut there’s no point in having bigger squads if managers don’t use them. That’s where coaches need to step up. National teams and clubs need to come together and work out what’s best for the player. Clubs need to hire more medical staff. I’d say most teams in the WSL have one full-time physio. That’s one person trying to keep a squad of around 24 players fit. That is a big ask and you wouldn’t see that happening at elite men’s clubs.\nGO DEEPER\nACL injuries in women's football: Why the high risk and can they be prevented?\nBefore I got injured, I’d been playing every single game for my club or the national team for eight or nine years. It’s just too much. One positive to being injured is that this is the first time in my adult life that I haven’t had the pressure of having to perform or be a leader.\nAdvertisement\nI hope that, in the next few years, we’ll have some research that will tell us the reasons behind all these ACL injuries. Funding is needed for that, but what are we doing to protect the current generation of players in the meantime? The best thing to do is for clubs to invest in a bigger medical team and squads to make sure that players are getting rested when they need to be rested. That is the change that you can make right now. Instead of all the clubs trying to be competitive — “you’ve got four players out with ACL injuries, but they’ve got two out and they’re missing no players” — we should all work together and share information.\nIt’s worrying that we live in a world where there’s a need to announce it’s not an ACL injury. That’s what England did with Walsh and Germany head coach Martina Voss-Tecklenburg said Felicitas Rauch’s training-ground knee injury “isn’t worse than what she has”. Because so many players are out with ACL injuries, we think every player who goes down with a knee injury has one, too. That isn’t always the case. Not knowing the outcome keeps us all scared.\nThis World Cup might become the deciding factor that makes stakeholders realise something needs to change. To watch a World Cup with 10 of the best players out injured — either at the tournament or recuperating at home — is not a good advertisement for women’s football. From bitter experience, I know it’s even worse for the players themselves.\n(Top photo: Getty Images; design: Eamonn Dalton)",
  "word_count": 1744,
  "scraped_at": "2026-02-14T02:00:36.688354",
  "_text_extracted": true
}