{
  "article_id": "3f5c3d3b6df8",
  "url": "https://weaintgotnohistory.sbnation.com/2024/12/18/24324043/the-european-super-league-tries-again-with-an-even-bigger-proposal",
  "title": "The European Super League tries again with an even bigger proposal",
  "date": "20241218T104500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Almost exactly a year after the European Court of Justice (ECJ) delivered its verdict that UEFA (and FIFA) had acted unlawfully by threatening to impose sanctions on clubs and players who might sign up for this upstart new thing called the (European) Super League, the well-dead concept is trying to rise from the ashes once again.\nThe European Super League tries again with an even bigger proposal\nTrying to replacing UEFA’s leagues, with UEFA’s permission\nAnd this time, they’re even asking UEFA for permission, “for authorisation”, to do so! You know, to replace all of UEFA’s competitions.\nThey’re calling it the “Unify League”, which may or may not be a parody of a Dave Chappelle skit. Unifyyy!\nThe latest variation from A22, who took over running the vestiges of what was left after those madcap 72-hours back in 2021, now includes an even more watered-down structure than what’s become of UEFA’s three-tiered continental cash grab. What had started as a breakaway group of 12 teams, “the dirty dozen”, looking to up-stage the Champions League with a closed super league, has been bloated into a 96-team, four-tier mess.\nHere’s a video with a bit of detail if you’re curious. As with their 64-team proposal last year, those details won’t matter because this isn’t going to become a reality — especially as at this point, they’re effectively proposing the same thing we already have with the Champions League, the Europa League, the Conference League ... and then a fourth competition, too, so that just about every team in every top league could play “European football”, too.\nUnlike last year, most teams and leagues haven’t even bothered to issue any responses to this latest fart in the wind proposal.\nUEFA (and FIFA) may not be able to strongarm their member constituents anymore to prevent them leaving for a new midweek competition, but they no longer have to. The ESL’s chance was that one time in 2021. Now that UEFA’s already existing and entrenched competitions are essentially the same thing as what they’re proposing, it’s hard to see how they could gather any significant support. You mean it’s the same thing we already have without the cachet of the name and the history of the trophy? Pass.\n(The closed league was appealing to clubs because it guaranteed a lot of money every year. The new format is only as financially promising as what we already have, perhaps with the organizers skimming less off the top than UEFA but that’s hardly worthy of all this potential complication. Also, the new proposal wants a minimum of 14 games from every participant, which is way too much.)",
  "word_count": 440,
  "scraped_at": "2026-02-14T02:11:20.839026",
  "_text_extracted": true
}