{
  "article_id": "3f7a6f5654f2",
  "url": "https://www.the42.ie/liverpool-luton-premier-league-6306086-Feb2024/",
  "title": "  This is their Barcelona  - Klopp compares Luton comeback to famous Champions League semi - final",
  "date": "20240222T131500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LIVERPOOL MANAGER JURGEN Klopp evoked memories of their famous win over Barcelona in 2019 during their “thunderstorm” second-half comeback to beat Luton 4-1.\nTrailing to Chiedozie Ogbene’s 12th-minute header, Klopp’s side were a different prospect after the break with Virgil van Dijk, Cody Gakpo, Luis Diaz and Harvey Elliott bringing up 100 goals for the season.\nWhile it by no means matched the magnitude of their Champions League semi-final comeback after losing the first leg 3-0 to the Catalan giants, it was significant in terms of the title race – re-establishing a four-point lead over Manchester City – and the invigorating atmosphere which the team will undoubtedly have to lean on during the run-in.\n“Tonight is one of those nights where it is difficult to stop talking. I am so happy,” said Klopp, who was without 11 first-team players including forwards Mohamed Salah and Darwin Nunez who remain doubtful for Sunday’s Carabao Cup final against Chelsea.\n“We had to ignore the fact we were 1-0 down and use the things that are good and improve the counter-press. The second half was a thunderstorm. Wow.\n“I will mention this game from now quite a few times. I promised my team a few months ago that I would never mention or use the Barcelona game as an example and I used it again today so I broke my promise.\n“Just because before the game, it was kind of similar. Many players missing, stuff like this. The team that time ignored the fact who is missing and I want us to ignore the fact who is missing.\n“That is difficult because the public got the whole knowledge of who is missing only tonight. It’s like… I needed a few minutes to process it when I got all the news.\n“But from that moment on, when you know how you can deal with it and sort it for this game, it feels really good. That is what I wanted the boys to show.\n“This is an example tonight. This is their Barcelona, now against Luton. A difficult situation, plenty of reasons to give up in moments: not tonight and I saw only a super group fighting.\n“If you don’t limit yourself with bad thoughts, you can fly. And that’s what the boys did.”\nLuton head coach Rob Edwards, whose side were impressive in the first half, admitted scoring so early just made their task harder.\n“We just made them angry,” he said. “Overall it was a really good first half. Second half I thought we saw Anfield, saw Liverpool, saw their full-throttle football. Their counter-pressing football was amazing.\n“In the end, it was a great learning curve for us to see what the best looks like. I know they had some players missing, but their second-half performance was like the best out there.\n“I thought we were very, very good. They were better.”\nThe42 is on Instagram! Tap the button below on your phone to follow us!",
  "word_count": 493,
  "scraped_at": "2026-02-14T02:07:39.549918",
  "_text_extracted": true
}