{
  "article_id": "3f92b52deaa4",
  "url": "https://punchng.com/uefa-europa-conference-league-quarter-finalists-draw-time/",
  "title": "UEFA Europa Conference League quarter - finalists , draw , time",
  "date": "20240315T094500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Europa Conference League quarterfinals will feature two teams from Greece and one from England, Belgium, Turkey, Italy, and France.\nSecond-leg matches of the Round of 16 concluded on Thursday night, revealing the final eight teams advancing in the competition.\nToday, the draws for the Europa Conference League quarter-finals, semi-finals, and final will be decided at UEFA headquarters in Nyon, Switzerland.\nThe ceremony kicks off at 14:00 CET, which is also equivalent to 14:00 WAT (Nigerian time).\nIt was a thrilling night of UEFA Europa Conference League football as the eight quarter-finalists were confirmed.\nHere are the teams in the UECL quarter-final line-up:\nAston Villa (ENGLAND)\nClub Brugge (BELGIUM)\nFenerbahce (TURKEY)\nFiorentina (ITALY)\nLOSC Lille (FRANCE)\nOlympiacos (GREECE)\nPAOK (GREECE)\nViktoria Plzen (CZECH)\nPUNCH Online reports that the draws for the UEFA Champions League and UEFA Europa League will also take place today at the same venue, one after the other, with the Europa Conference League coming last.\nHow do the draws work?\nAccording to the explanation on the UEFA website, in the Europa Conference League, teams from the same country can indeed face off in the quarter-finals, semi-finals, and even the final, as there are no seedings or country protections in place.\nThis open-draw system allows for potential clashes between clubs from the same national association, including those who have previously met in the group stage.\nDuring the quarter-final draw, the names of the eight quarter-finalists are placed in a central bowl and randomly drawn.\nThe first team selected hosts their first leg match against the second team drawn, with the process repeated until all pairings are determined.\nUECL semi-finals?\nMoving into the semi-finals, four balls marked with the titles ‘Winners of Quarterfinal 1’ through ‘Winners of Quarterfinal 4’ are shuffled, with the first and second balls drawn deciding the first semi-final pairing.\nMeanwhile, this implies that winners who progress in each quarter-final game will automatically know who they face in the semi-finals.\nThe team drawn first in this phase is designated as the home team for the initial leg, with the draw process continuing until all semi-final matchups are established.\nInterestingly, there’s even a draw to determine the ‘home’ side for the final, done for administrative purposes.\nThis ensures fairness and transparency in the tournament’s organisation from start to finish.",
  "word_count": 382,
  "scraped_at": "2026-02-14T02:10:47.914038",
  "_text_extracted": true
}