{
  "article_id": "3f96740352a2",
  "url": "https://theathletic.com/5179403/2024/01/06/interview-roma-tiago-pinto-mourinho/",
  "title": "Roma Tiago Pinto : The jokes that helped land Mourinho and Lukaku – and why he leaving",
  "date": "20240106T211500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Time to say goodbye. Only as Roma’s outgoing general manager, Tiago Pinto, puts it: “There’s no time for saluti.” The speeches will come later. Before he leaves on February 3, there’s the small matter of a winter transfer window to oversee and his compatriot, Jose Mourinho, wants a centre-back. “I need to find one very cheap,” the amiable Pinto laughs. Dean Huijsen arrives soon after on loan from Juventus.\nOnly at the end of the window can he pause and reflect on everything he has achieved.\nAdvertisement\nPinto is still in his 30s. A Benfica fan, he was hired by the club he supported as a boy straight out of university to let him run their multi-sport operation. Benfica, to the uninitiated, are more than a football club. They are a handball, volleyball and rugby club, too, with swimming and athletics teams. “In one season with five different sports, we won four national championships and four national cups,” Pinto recalls. It’s fresh in the memory. He was in his 20s at the time. “All the country was red.”\nBenfica’s president, Luis Filipe Vieira, then promoted him to look after the football business with a bona fide legend of the game in Portugal (and Italy), Manuel Rui Costa. Leaning on the world-renowned Seixal academy, Pinto caught the eye of Roma’s incoming owners, the Friedkins, with the way he discreetly helped transition Benfica’s team from one success to another. From the outside, taking over a champion does not look hard, but in Pinto’s opinion “it was a very critical moment” in Benfica’s history. While it was true the team had won the league four years in a row, it was also old. “There were a lot of players over 30. I came to refresh the structure a bit.”\nRather humbly, Pinto concedes he got “very lucky”. The players coming through Seixal at the time are now household names. One won the treble with Man City last season. The other was sold for a club record €127.5m (£110m; $134m). “I came through with Ruben Dias and Joao Felix. We started the same year. Me as the sporting director, them guys as first-team players. We won the title with nine academy players and Bruno Lage, a coach from the academy.”\nHis appeal to the Friedkins was self-evident. For Pinto, leaving Benfica, whose coral red shirt is like a “second skin”, might have been a wrench. But he’s Portuguese, the nation of explorers like Vasco da Gama and Ferdinand Magellan. “I’m not the kind of guy looking to work 15 years in the same place and to be comfortable,” Pinto smiles. “I like risks. I like challenges.”\nAdvertisement\nRoma was all of that when he joined in the winter of 2020. Now, a little over three years since his mandate began as general manager, the Benfiquista turned Romanista believes it’s time to move on after back-to-back European finals and a first trophy in 14 years. “I think the cycle is close to the end,” Pinto explains in his first interview since the news of his departure broke. “I’m not speaking about the Roma cycle or the Friedkin cycle, but the mission I had is almost done.” Still shy of his 40th birthday, Pinto has packed a lot into a short career. “Personally, I feel tired,” he says, running his hands through his hair.\nRather than go on holiday once this window is over, Pinto hopes to take a breath. He hasn’t stopped since his degrees in pedagogy, economics and human resources. As a sporting director, they have come in handy. “If you know only football, you know nothing about football,” he says, citing an old Mourinho line. “Twenty years ago a sporting director watched games and signed players. It’s not possible anymore.” The role is more wide-ranging. You need to be a lawyer, an accountant, and a PR specialist at the same time.\nWhen Pinto arrived in Rome, football was still in Covid. Stadiums were closed. The new one the old owners tried so hard to build was mothballed. The sporting director role had been left vacant for six months while the Friedkins carried out the executive search that led to Pinto. They wanted him to build out their own scouting and data analysis departments, upgrade the training ground and implement a youth development plan borrowing from his experience at Benfica.\nRoma have always had a strong youth sector. Trigoria isn’t Seixal, but anyone who has seen the choreography in the Curva Sud of all the famous Romans to captain Roma — from Agostino Di Bartolomei and Francesco Totti to Daniele De Rossi — knows it is a major part of the club’s identity. Thirteen academy graduates have come through in Pinto’s time as general manager and while some of them were already in the system at Trigoria before the ownership change, the fast-track programme he implemented has made an impact.\n“We would select the best players from the academy and work on them as if they were first-team players,” Pinto explains. “They’d get a psychologist, a nutritionist, special coaching. Guys from the communications department provided them with media training. All to reduce the gap from youth team to first team. Nicola Zalewski and Edoardo Bove were part of that group.”\nZalewski provided an in-house solution to Leonardo Spinazzola’s injury-enforced absence in Roma’s Conference League triumph, while Bove scored a memorable goal in last season’s Europa League semi-final against Xabi Alonso’s Bayer Leverkusen. “When I saw that goal,” Pinto says, “to me it’s more or less the same thing as signing (Paulo) Dybala.” Other graduates like Cristian Volpato, Filippo Missori (both Sassuolo) and Benjamin Tahirovic (Ajax) have been sold to help Roma make sure they’re compliant with Financial Fair Play.\nAdvertisement\nMeeting the parameters of their strict settlement agreement with UEFA has been no easy feat. Roma found themselves in the grips of a perfect storm when Pinto arrived. Aside from the ravages of Covid, the club had started missing out on the Champions League after qualifying for five straight years, even reaching a semi-final with the famous Romantada against Barcelona. The squad Pinto inherited was a mess left by one of the most famous sporting directors in the world, Monchi. “We had more than 70 players under contract,” Pinto recalls. “Most of them were non-key players. I don’t want to mention all of them, but everyone remembers (Javier) Pastore, (Steven) N’Zonzi, (Davide) Santon. Even other players like (William) Bianda, (Ante) Coric and Alessio (Riccardi).”\nFor context, Monchi handed a nearly 30-year-old Pastore a five-year deal. He signed N’Zonzi from his old club, Sevilla. Bianda for what it’s worth cost €11m from Lens and, at 23, is currently without a club. These are the guys on whom Monchi blew the money from Alisson’s sale to Liverpool and Roma’s run to the 2018 Champions League semi-finals. “A lot of players Roma had under contract were heavy on the wage bill and didn’t perform on the pitch,” Pinto says.\nTo get them off it, Roma might have been advised to seek an audience with the Pope at the Vatican and plead for divine intervention. Instead, Pinto got to work. “I think for me as a sporting director, I cannot just blame the past and say: ‘All these players, they don’t have value. Let’s get rid of them’. No, I need to protect the assets of the club. What we were trying to do in our squad, with loans and partnerships with other clubs, was trying to find the best solutions for everybody.”\nThis is an underrated and unglamorous part of a sporting director’s job. When a player’s value has tanked and he is of no use to the coach, how do you restore it? Justin Kluivert, for instance, was loaned to RB Leipzig, a club with a reputation for developing talent. He then went to Nice and Valencia, prestigious teams in top-five leagues. In the end, the winger’s performances persuaded a Premier League side, Bournemouth, to pay €10.8m for a player many considered a lost cause. Cengiz Under went to Leicester and then Marseille, where he was joined in a try-before-you-buy move by out-of-favour goalkeeper Pau Lopez. Marseille coughed up a combined €25m for the pair of fringe players. “Most of the time we did it,” Pinto says.\nIf flecks of grey have begun to appear in Pinto’s stubble, part of the reason is having a “very demanding” coach like Mourinho. The other is the June 30 deadline, the end of football’s accounting year when sales need to be made to be FFP compliant. A high net spend in Mourinho’s first summer combined with the problems Pinto inherited have made meeting UEFA’s requirements the toughest of juggling acts. Rather than sacrifice fan favourites, Pinto adeptly and incrementally made the €30m or €35m needed in the first month of the summer window by selling six or seven players who supporters had either forgotten about, no longer cared for, or weren’t in the first team long enough to form a meaningful attachment.\nWhile Mourinho complained about a lack of spending in 2022 and 2023, Pinto was able to keep him on side by not letting stars go. The Tahirovics left rather than the Tammy Abrahams. “We sold more than €160m in players and if you look at the players we sold, maybe just (Roger) Ibanez (now at Al Ahli) and (Nicolo) Zaniolo were players that really played in our (first) team because all the other players weren’t key pieces. They were on loan or out of the squad.”\nMore attention has understandably fallen on the box office names Roma have been able to attract in Pinto’s time at the club. When Tottenham fired Mourinho the week before the Carabao Cup final, something for which he has never forgiven Daniel Levy, Pinto immediately sent his agent a message. It was a joke about coming to Roma. Mourinho’s agent forwarded it to his client. Mourinho appreciated it and everything all of a sudden happened very fast. “I think between the text and the announcement there were 14 days.” The news even caught out Italy’s most connected transfer insiders. “If I think about the ownership and the way we signed Mourinho, it represents them very well,” Pinto says. “You do it quickly without buzz and surprise everyone.”\nAdvertisement\nIt was the first appointment made by Pinto and the Friedkins and set the tone for this cycle at Roma. Dan Friedkin personally piloted a private jet to fly Mourinho to Rome as he would Romelu Lukaku last summer. Since then, a star has arrived every summer. Having Mourinho has made the job easier because players want to come. It has made the job harder because it piles “positive pressure” on Pinto and the Friedkins to get the deals done. For Pinto, this has meant spending a lot of time in London. First to hire Mourinho, then to sign Tammy Abraham for a near club record-equalling fee, and more recently Lukaku on loan.\nOn each occasion, returning to Rome without the player wasn’t an option. The alternative, Pinto laughs, was to “go back to Portugal” and never set foot in Rome again. Abraham’s debut season at Roma was the most prolific in the club’s history. He scored 28 goals and seemed to be a statement of the direction the new owners wanted to go in. “We had (Edin) Dzeko,” Pinto recalls, “a very very important player in Roma’s history. At the time, we were in negotiations for him to leave. We wanted to show again that our project would maybe be with young players but keeping the same ambition. The first season was amazing. He scored almost 30 goals, but Tammy is more than a goalscorer. If you look at the numbers, he’s always been a guy who gets 10 assists a season, too.”\nAbraham found the net nine times in Roma’s run to their first European final since 1991. Zaniolo grabbed the only goal of the game against Feyenoord in Tirana and Mourinho memorably then got the Conference League trophy tattooed on his arm. More than 100,000 Romanisti lined the streets as an open-top bus bent its way around the Colosseum.\nLater that summer, another 10,000 would congregate outside the Palazzo Civilta Italiana to welcome Paulo Dybala, a signing every bit as unlikely as Mourinho’s appointment. The free transfer showcased another theme of Pinto’s dealings; patience and a knack for seizing the moment.\n“I think we were very clever to manage the timings because at the end of the season or the beginning of the (transfer) market, if we were to go fight with the interested clubs, we didn’t have the capacity, so for some reasons, and I don’t want to mention the clubs, but for some reasons, Club A wasn’t able to do the deal at that moment, Club B was changing coaches. So we understood the moment, that it’s now or never. So you have a week to do this thing and during that week in Turin, I think we worked very well as a team again; ownership and coach, fully involved.”\nIt was the same story with Lukaku last summer. Roma could not afford to buy the player. It looked like one of Inter, Juventus and Al Ahli would do just that at the start of the window. But one thing led to another. Lukaku went cold on Inter who, in turn, withdrew when they learned his representatives had held talks with Juventus. Lukaku didn’t want to go to Saudi Arabia. In the end, Juventus decided to stick with Dusan Vlahovic.\nThroughout it all, Pinto stayed in contact with Lukaku’s agent. “I knew him very well because we were talking about another player of his,” he reveals. “And of course every time we talked about the other player, I’d always make jokes. ‘What’s going to happen with Lukaku?’. I never said I wanted Lukaku, but I always knew what was going on and one day — this is a funny story — I was with Ryan Friedkin (Roma’s vice-president). We were watching training and this agent called me and I didn’t even say ‘good morning’ to him. I said something like: ‘No, I don’t want Lukaku, man! I don’t have the money for Lukaku and the guy was laughing and laughing and laughing. He said: ‘No, I’m not calling about Lukaku’.”\nAdvertisement\nIt was still too early in the summer and Chelsea weren’t considering sending him out on loan again. But come the end of August, Chelsea opened to the idea. The personal touch Pinto showed with his agent went a long way. All of a sudden, he was back on a plane to London with Ryan and five days later, Dan was flying Lukaku to Rome. “I think three years ago if you were to ask a Roma supporter if it were possible to have in the same team Dybala, Tammy (Abraham), Lukaku and Mourinho, maybe they would say: ‘You are crazy’. And now they have them,” Pinto smiles.\nThe fanbase have learned to see impossible as nothing. In the summer of 2022, a series of voice memos began circulating among Roma fans. They were purportedly from insiders claiming Cristiano Ronaldo had signed in secret in Mallorca and the reason the Olimpico was closed was to prepare for his unveiling. The messages were fake but supporters believed them because they had seen Pinto and the Friedkins somehow pull off the Mourinho appointment. The city has seldom been this enthusiastic. The 1983 and 2001 Scudetti come to mind, as does the Romantada in 2018. The Olimpico was a sell-out for 44 games.\n“I think it’s fair to say you don’t have too many atmospheres like you have here in Roma,” Pinto says. He credits the Friedkins with “bringing back this unity between the city and the team”. After failing to reach a European final in more than 30 years, Roma went back-to-back. Last season, the Conference League holders made it to the Europa League final in Budapest, only to lose on penalties to Monchi’s Sevilla. That night, Roma lost more than a game. “We lost Champions League qualification, too,” Pinto says ruefully. “Then three or four days later, we had Tammy’s big injury.”\nMissing out on the Champions League and its transformational revenue for a fifth season hurts Roma. The team’s overachievements in Europe have often eclipsed disappointing league form. Roma currently lie seventh. In an era when there have been four different champions in four years, some of whom have won the Scudetto with smaller wage bills than Roma’s, it is confounding that sixth or seventh is this side’s ceiling. Pinto counters with a trend. “The last three teams to win the league in Italy were eliminated very soon from Europe. When Inter won the Scudetto with (Antonio) Conte, they went out in the Champions League group stages in December. When Milan won the league, they went out in the group stages. When Napoli won, they were out in April.”\nFive points adrift of the top four, a fifth-place finish might be enough if Serie A continues to top the UEFA co-efficient table ahead of next season’s expanded Champions League. Redemption in the Europa League is another route, too. Pinto believes this team can bounce back and reach the final again in Dublin. “You can see even in Champions League history that sometimes Liverpool lost a final and then won, Milan lost and then won, Man City lost and then won.”\nFor now, Pinto’s focus is exclusively trained on seeing out this transfer window. It has been a rewarding but exhausting experience in one of the most intense football cities on the planet. He is tired but proud. Pinto cherishes the picture of him waving a Roma flag on the open-top bus parade after the Conference League victory. “Three years at Roma! There aren’t many sporting directors who have the opportunity to be three years at Roma.”\nThe club has had three chief executives in his time and the decision to extend Mourinho’s contract, due to expire in the summer, will pass to the Friedkins. As for the future, there’ll be time for that once the window closes, but Pinto sees himself in the Premier League one day. “It’s the league where everyone wants to be; the players, coaches and executives. It’s the best in the world. I’d like to have that experience. Now or later. Now the most important thing is to feel again what I felt at Benfica and when I came to Roma. The alignment and commitment with the people of the club. After Roma, I am ready for everything.”\n(Top photo: Emmanuele Ciancaglini/Ciancaphoto Studio/Getty Images)",
  "word_count": 3110,
  "scraped_at": "2026-02-14T02:07:39.577046",
  "_text_extracted": true
}