{
  "article_id": "3fafb7ce8d48",
  "url": "https://www.ok.co.uk/celebrity-news/alex-oxlade-chamberlain-perrie-edwards-33841788",
  "title": "Alex Oxlade - Chamberlain lavish house with Perrie Edwards , huge salary , career plight",
  "date": "20241008T103000Z",
  "domain": "ok.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alex Oxlade-Chamberlain's lavish house with Perrie Edwards, huge salary, career plight\nAlex Oxlade-Chamberlain has endured a frustrating couple of years on the pitch and is currently away from his partner Perrie Edwards and their son, Axel, playing in Turkey\nPerrie Edwards' fiancee Alex Oxlade-Chamberlain was once playing at the glitzy heights of football but he has seen his career trajectory dip in recent years.\nThe 31-year-old climbed the ranks from Southampton's youth academy and inked a contract with Arsenal in 2011. He had a successful six-year run with the Gunners, bagging three FA Cups and three Community Shields.\nOxlade-Chamberlain's journey continued with Liverpool under Jurgen Klopp's guidance, where he hoisted a Premier League trophy and a Champions League during his six-year tenure at Anfield. He also donned the England jersey on the global stage 35 times between 2012 and 2019.\nREAD MORE: Jack Grealish and Sasha Attwood's baby name meaning explained as pair welcome first child\nREAD MORE: Leigh-Anne Pinnock's relationship 'hell' after Little Mix star snubbed Saudi Arabia with Andre Gray\nWhile his on-pitch career has faded recently, culminating in a move to Turkish Super Lig team Besiktas last year - where he has clocked up a total of 30 appearances - his life outside football has been peppered with its own thrilling episodes including a romance with former Little Mix star Perrie Edwards. But what does Oxlade-Chamberlain's life look like behind the Premier League glory, trophies and accolades? Here, we give you the lowdown.\nA relationship with Perrie Edwards\nThe footballer has been all loved-up with the 'Shout Out to My Ex' hit-singer Perrie Edwards since 2016 after they matched on the celeb dating app Raya. They went Insta official in February 2017 with a romantic snap near the Eiffel Tower as Perrie gushed: \"Him.\"\nFast forward to May 2021, and the pop star announced their baby news. She posted an artsy black-and-white pic showing off her bump, adoringly writing: \"So happy to be on this wild journey with my soulmate. Me + Him = You. We can't wait to meet you baby Ox!\"\nThe couple welcomed their first child, a son named Axel Oxlade-Chamberlain, in August 2021. They got engaged in June 2022, with Oxlade-Chamberlain proposing on a beach during a stunning sunset.\nEdwards shared the happy news on social media, posting: \"Last night the love of my life got down on one knee and I said... YES! \" She also shared a series of photos from the proposal, including a close-up of her impressive diamond ring. The pair have yet to announce a wedding date.\nA family home in Cheshire where Alex doesn't live\nDespite being together for nearly eight years, Edwards revealed this year that she has never lived with her fiancee. During an appearance on the Jonathan Ross Show in April, the 31-year-old popstar admitted: \"I can't lie, it is hard. When he was playing for Liverpool and based in Manchester, it was so easy to do the back and forth but Turkey is a little bit further and he doesn't get a lot of time off.\"\nShe continued: \"I'm trying to launch a solo career whilst having a two-year-old so it is a lot to juggle but we make it work for the ones we love don't we? We've never lived together anyway - the whole eight years we've been in a relationship, we've never actually lived together.\"\nReports suggest that Edwards and her little one, Axel, reside in a lavish £3.5million mansion in Cheshire, boasting a grand staircase, plush velvet curtains and beautiful neutral decor. Earlier this month, Edwards opened up about the impact of her long-distance relationship with Oxlade-Chamberlain on their family life, revealing that his training commitments even extend to Christmas day, leaving him unable to spend it with his fiancee and child.\nShe said: \"And they train on Christmas day!,\" with Jason King humorously retorting: \"They get paid enough for it! Shut up! \" Edwards then elaborated: \"That's what everyone says and I'm like 'you tell that to my two-year-old who doesn't know what's going on! Where's Daddy?\".\nEdwards went on: \"So, he's three now and he knows, so now he's like 'I miss Dada'. The second he wakes up he's like 'I miss my Dada' and I'm like 'Me too, we'll go to Turkey soon'. He's goes 'Yeah lets go on the aeroplane and see Dada'. And every aeroplane in the sky he's like 'Dada! Dada's on there!' It's so cute and it just melts my heart.\"\nOxlade-Chamberlain's salary and net worth\nLast August, it emerged that Oxlade-Chamberlain would be pocketing 2.5million euros (£2m) per season, with the potential to earn up to 10,000 euros (£8,300) per match depending on playing time - although the bonus system is likely to significantly influence his earnings given he's been frozen out of the team at the minute.\nEarlier this year, insiders revealed that Oxlade-Chamberlain has amassed a net worth of approximately £13.1million from his football career and past endorsements with big names like BT Sports, Nike and Nivea, to name a few. On the flip side, Edwards is said to have a net worth of around £15million, thanks to her time with Little Mix, her solo music career, and her brand, Disora.\nA footballing plight\nOxlade-Chamberlain was a real thorn in the side for footballing opponents on his day. The central midfielder netted 10 goals and provided nine assists in his debut season as a professional with Southampton before Arsene Wenger's Arsenal came calling in 2011, reports the Mirror.\nAt the Emirates, the English star had a successful six-year run, scoring 20 goals and providing 28 assists for the Gunners in 198 appearances, quickly becoming one of Wenger's go-to players. However, in 2017, Oxlade-Chamberlain shocked football fans globally by transferring to Liverpool for a reported £35million.\nThe midfield ace scored 18 goals and made 15 assists over the next six years, aiding Jurgen Klopp in securing the Premier League for the Reds for the first time in 30 years, alongside big names like Jordan Henderson, Virgil Van Dijk and Mohamed Salah. However, Oxlade-Chamberlain found himself falling down the selection list towards the end of his Anfield career, partly due to an ACL injury which kept him out of action for 316 days - missing 58 matches in total for his team.\nAfter only making nine Premier League appearances in the 2022/23 season, and with his future at Liverpool uncertain, Oxlade-Chamberlain transferred to Besiktas on a free transfer last year. However, he once again faced injury troubles in the Super Lig, tearing his thigh muscle last December and missing 18 matches for his new side.\nAfter eight games into the 2024/25 season, Oxlade-Chamberlain hasn't played for Besiktas yet, only warming the bench during a match against Kayserispor. With two more years on his contract, but no sign of getting game time, there is talk he might come back to England and while a summer move looked possible with Premier League clubs keen, no deal materialised. With Edwards seemingly keen for Oxlade-Chamberlain to move closer to home after his stint in Turkey, talks with English clubs could resume again in January.",
  "word_count": 1189,
  "scraped_at": "2026-02-14T01:57:46.252469",
  "_text_extracted": true
}