{
  "article_id": "3fc42c0234a7",
  "url": "https://www.espn.com/espn/story?id=47312952",
  "title": "AFCON Absentee XI - Anguissa , Semenyo , Onana the best players missing in Morocco",
  "date": "20251215T201500Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Africa Cup of Nations brings together the continent's top players to battle for CAF's grandest prize, but whether it's through injury, fallouts, failure to qualify, or a myriad of other reasons, not all of Africa's biggest names will be present in Morocco for this month's tournament.\nAhead of the competition's kickoff on Sunday, here's ESPN's African XI of players who WON'T be attending AFCON 2025.\nGoalkeeper: André Onana\nDespite being named in the tournament squad by outgoing head coach Marc Brys, the official list of players set to travel to Morocco with Cameroon does not include Trabzonspor stopper Onana.\nIt represents a remarkable fall from grace for the Manchester United loanee, who should be in his prime at 29, and once appeared destined to establish himself as the continent's pre-eminent stopper.\nHowever, a combination of a dramatic loss of form since moving to Old Trafford, as well as the machinations in the country's domestic football politics -- particularly, the 'civil war' between FECAFOOT and the Sports Ministry -- has put paid to a Nations Cup appearance.\nInstead, it will be his cousin -- Fabrice Ondoa -- who will join the Indomitable Lions.\nDefender: Wilfried Singo\nAn AFCON winner last year with Ivory Coast, Singo has only grown in stature during the intervening period, to the point where reports in France even suggest that Liverpool are keeping tabs on the versatile Galatasaray defender.\nHaving only arrived in Turkiye this offseson, and with a contract until 2030, an imminent exit appears unlikely, and the towering defender won't be departing for the Nations Cup either after sustaining an injury ahead of the tournament.\nA muscle tear has sidelined the 24-year-old since late November, and he wasn't named in Emerse Fae's squad for the champions' title defence.\nDefender: William Troost-Ekong\nThe former Nigeria captain should have been participating as part of the Super Eagles, but surprisingly opted to announce his international retirement ahead of the tournament.\nApart from saying that it \"just felt like time\" the Nigeria stalwart hasn't truly given a clear reason as to why he chose this moment to depart, denying himself the opportunity of making up for that near miss in 2024.\nWhile the 32-year-old hasn't enjoyed the most glittering club career, he's been a stalwart for the West Africans for a decade, and was the Player of the Tournament at the last AFCON. He'll be a big miss for the Super Eagles, and for African football.\nDefender: Mohammed Salisu\nThe first of several Ghana players in contention, Salisu misses out as a consequence of the Black Stars' failure to reach the Nations Cup for the first time since 2004.\nWorld Cup qualification offers some consolation for the 26-year-old and his teammates, but Salisu will surely rue missing out here, particularly considering his fine recent form at AS Monaco.\nMidfielder: André-Frank Zambo Anguissa\nAnother big miss for Cameroon is Zambia Anguissa, who has taken his game -- and his reputation -- to new heights across his successful stay at Napoli, where he's twice been an Italian champion.\nUnlike Onana, he's not a victim of the political wrangling in Cameroonian football, but misses out through injury after sustaining a muscular injury to his left thigh while on international duty last month.\nWith Anguissa, Cameroon could have held their own against any other midfield on the continent, without him, they look vulnerable.\nMidfielder: Cheick Doucoure\nMali aren't short of strong central midfielders, but it's a shame that Doucoure won't be able to join the Eagles in Morocco.\nThe 25-year-old hasn't featured since January after sustaining a severe knee injury, with Crystal Palace not expecting him back until after the AFCON has finished, where they'll harbour hopes of him returning to the form and fitness he enjoyed in 2022-23.\nMidfielder: Hakim Ziyech\nThere were hopes of a fairytale return to action for Ziyech who, at 32, should still have much to offer international football, with a tournament on home soil providing a golden opportunity for the mercurial talent to write another memorable chapter in his fascinating career.\nHowever, the ex-Chelsea man hasn't played since May, and while head coach Walid Regragui celebrated his return to Morocco when he signed for Wydad Casablanca, he was realistic that the playmaker faced an uphill struggle to force his way back into contention.\nAttacking mid: Antoine Semenyo\nOne of the most watchable players in the Premier League, Semenyo is another victim of Ghana's failure to qualify for the first time in over 20 years.\nRemaining with Bournemouth should give the 25-year-old the opportunity to play his way back into form during the busy festive period -- he hasn't found the net since early October -- although it remains to be seen whether rumours of a move to the likes of Liverpool and Tottenham Hotspur may prove unsettling.\nRegardless of where he ends up at club level, Semenyo will surely be the key building block in this new-look Ghana side as they attempt to move on from their ignominious failure to reach the AFCON.\nStriker: Mohammed Kudus\nThat last phrase should almost equally apply to Kudus who, alongside Semenyo, gives Ghana the kind of firepower and invention that few sides in the continent can truly match.\nLike his compatriot, the Spurs new boy started the season strongly but, amidst some injury concerns, his form has tailed off in recent weeks amidst the Lilywhites' struggles under Thomas Frank.\nThe 25-year-old has nonetheless had a hand in seven goals in 15 league outings so far this term, while it's surely only a matter of time before the explosiveness and innovation with the ball at his feed - hallmarks of his time at West Ham United - are witnessed once again for club and country.\nStriker: Serhou Guirassy\nGuirassy, in his prime at 29, has established himself as one of the Bundesliga's finest goal-getters of recent seasons, having scored 65 in the league across the last three years, as well as 13 in 14 UEFA Champions League outings last term.\nDespite encountering some injury problems, he's lived up to expectations at a European giant like Borussia Dortmund, while also twice making the Bundesliga Team of the Season.\nAt international level, since opting to represent Guinea rather than France, he's found the going tough; while he's registered an admirable goal return, fitness problems prevented him from truly making an impact at the last Nations Cup, while injury issues during qualification meant he was unable to prevent the Syli National from missing out at the hands of the Democratic Republic of Congo and Tanzania.\nStriker: Yoane Wissa\nWhile some nations like Mali (Yves Bissouma) and Senegal (Habib Diarra) have opted to take a risk and include a player returning from an extended injury absence to their squad, the DRC decided not to take the same risk with Newcastle United's Wissa.\nThe striker has endured a miserable season so far, alienating himself from Brentford fans early doors as he forced through a move to Newcastle, before being prevented from making his mark at his new club due to posterior cruciate ligament damage, and then illness.\nSo far, he's played 33 minutes across three fixtures in the Champions League and Premier League, but has been forced to watch on as another new striker -- Nick Woltemade -- has endeared himself to Magpies fans as an Alexander Isak replacement.\nPerhaps with one eye on next year's World Cup playoffs, and hopefully the tournament itself, Sebastien Desabre opted not to risk Wissa.\nHonourable mentions\nOla Aina (Nigeria/Fulham), Logan Costa (Cape Verde/Villarreal), Marshall Munetsi (Zimbabwe/Wolves), Amine Gouiri (Algeria/Marseille), Yankuba Minteh (Gambia/Brighton), Nicolas Pépé (Cote d'Ivoire/Villarreal), Amine Adli (Morocco/Bournemouth), Simon Adingra (Cote d'Ivoire/Nottingham Forest), Kamaldeen Sulemana (Ghana/Atalanta), Evan Guessand (Cote d'Ivoire/Aston Villa), Eric Maxim Choupo-Moting (Cameroon/New York Red Bulls), Vincent Aboubakar (Cameroon/Neftci), Victor Boniface (Nigeria/Werder Bremen), Tolu Arokodare (Nigeria/Wolves)",
  "word_count": 1301,
  "scraped_at": "2026-02-14T01:52:59.294842",
  "_text_extracted": true
}