{
  "article_id": "3fcb41f2922a",
  "url": "https://metro.co.uk/2025/10/18/chelsea-star-slammed-stupidest-tackle-world-nottingham-forest-24462601/",
  "title": "Chelsea star slammed for  stupidest tackle in the world  against Nottingham Forest | Football",
  "date": "20251018T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leon Osman has slammed Chelsea star Malo Gusto for ‘the stupidest tackle in the world’ in the 3-0 win over Nottingham Forest on Saturday.\nGusto was on a yellow when he chopped down Neco Williams in the 87th minute, which saw the 22-year-old defender sent off at the City Ground.\nChelsea have now been reduced to 10 men in four of their last six games across all competitions, with red cards becoming a serious problem.\nReacting to Gusto’s dismissal on BBC Radio 5 Live, former Everton and England midfielder Osman, who works as a football pundit, said: ‘The manager will be incensed by that red card.\n‘It’s one of those moments where you are on top in the game, things are going well, you are feeling great, all the chances and tackles are going your way.\n‘In hindsight it is the stupidest tackle in the world to make.’\nMaresca ‘not concerned’ over Gusto red card\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nChelsea head coach Enzo Maresca has insisted he is ‘not concerned’ over Gusto’s red card against Forest.\n‘It’s something we can do better,’ the Italian said in his post-match press conference.\n‘But I am not concerned. There are some of you who ask why I am not concerned.\n‘We can avoid it, for sure, but for me, the desire of the players is important.\n‘It’s useless to make a second yellow card with a foul but Malo showed his desire. It’s the balance but we can avoid that, for sure.’\nMaresca was forced to watch the victory over Forest from the stands after being handed a one-game ban for his jubilant celebrations against Liverpool.\n‘Very bad feeling to be there, I prefer to be in the dugout,’ the Chelsea head coach added.\nMore Trending\n‘We struggled in the first-half. Second-half we were better. We could do better in terms of the red card, we can avoid that.\n‘The desire of the players not to concede a goal was important. They were shouting at each other not to concede in the final few minutes. It’s important.’\nChelsea’s victory over Forest means they are now sixth in the Premier League table following Saturday’s 3pm kick-offs.\nThe Blues are back in action on Wednesday when they host Ajax in the Champions League.\nMORE: Fulham 0-1 Arsenal: Gunners top again after Leandro Trossard winner\nMORE: ‘A massive problem’ – Glenn Hoddle fires ominous warning to Chelsea over Cole Palmer injury\nMORE: Why Moises Caicedo and Esetvao are on the bench for Chelsea against Nottingham Forest",
  "word_count": 470,
  "scraped_at": "2026-02-14T02:26:56.610698",
  "_text_extracted": true
}