{
  "article_id": "3fd30e27dc04",
  "url": "https://www.twtd.co.uk/ipswich-town-news/27596/maitland-niles-to-complete-move-on-thursday/onthisday",
  "title": "Maitland - Niles to Complete Move on Thursday - Ipswich Town News",
  "date": "20230630T201500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tuesday, 30th Jun 2015 17:49\nArsenal youngster Ainsley Maitland-Niles will now complete his season-long loan move to the Blues on Thursday, TWTD understands.\nThe 17-year-old has been at the club today for a medical and the paperwork relating to the switch will be completed on Thursday when he will train with his new team-mates for the first time.\nSpeaking at this morning's press conference, manager Mick McCarthy said he sees Maitland-Niles as a versatile midfielder, who \"can play anywhere along the midfield\".\nGoodmayes-born Maitland-Niles joined Arsenal’s academy aged nine and broke into their U21 side during 2013/14, signing a pro deal in October 2014.\nThe England U17 and U18 international made his senior debut as a sub last season in a Champions League game with Galatasaray and also made first team appearances from the bench against Newcastle in the Premier League and Hull City in the FA Cup.\nMaitland-Niles hit the headlines earlier in the year when his mother, Jule Niles, was arrested on suspicion of assaulting two people at Arsenal’s training ground, amongst them Arsene Wenger's negotiator Dick Law. She was later released without charge.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nLooking forward to seeing him in a town shirt!\nreally am looking forward to this season, with the money recieved for mings, and our position last year, keeping most if our players, i believe players would want to join us now. get in some good squad depth, and lets push on! COYB!\nQuote:\nblue_movies: t isn't going to happen, Mick. if it was he would be here already.\n&\nBluefest:\nDon't think that Arsenal lad is going to sign ,deal not done MM needs to speak to him to see if all is fine. The lad should of been there today , has he got an attitude >?????????\nGents: Perhaps best to keep quiet sometimes and wait and see.\nWill be a welcome when(if) he signs\nWere just a stepping stone for him and arsenal.\nWhy are you against promoting our own youngsters?\nIf people think just because we finished 6th last season we played good football, they are fooling themselves.\nThe long ball hoof game isn't good football.\nWhy would you be positive about a young loanee from Arsenal coming in and possibly holding back one of our own home grown youngsters. Unless, we have had an offer for Kundai that is.\nAlthough a supporter of the club, I wouldn't spend money to watch that style of play.\nMaybe our own need to be loaned out to L1 clubs to gain experience. We are getting a lad who has been exposed to the first team squad at Arsenal which, I believe, puts him ahead of our own youngsters at the moment. Arsenal play outstanding football which is a million miles from hoofball. Maybe his addition, together with an out and out winger (plus of course Connolly) suggests we are going to be closer to the style we would all like to see. If this lad helps us up will you still moan about him not being \"one of our own?\"\nI'd much rather we take on young players from top 4 clubs on season loan than do what we did with JET, Lee Martin, and end up with expensive flops on multi year deals. And to a lesser extent Freddie Veseli.\nThere were a lot of negative responses from the myopic and the usual suspects, but nothing of a negative nature from me.\nBeing exposed to the first team squad is good and if he does bring about a change in style, then I will be pleased and may even go and see the odd game live although I have a very comfortable seat in front of the NOW TV box. I agree about Arsenal's outstanding style but I have been a supporter of Wenger for many years and have often thought we should become a feeder club for them if we cannot produce our own players. But, his style and Mick's style are poles apart.\nPlease.\nI don't have to watch a game live to form an opinion the same as people on here form opinions about how England perform without having been to Wembley to see the game. The coverage on TV is excellent. I'm sure that you post opinions about England's performance having watched it on the telebox.\nI have said from the start that Mick is an average manager with a style that is not my cup of tea. I haven't changed my opinion or seen anything yet that indicates he will change his style of play. If he does, then all credit to him and I will post in support.\nFootball supporting is all about opinions. If we all thought the same what a dull place this would be.\nI read what you have to say and if you are polite, then I will express an opinion on your views. I don't say that you are tedious because I don't agree with you, I simply will offer an alternative view, There are many, who are not polite and some who just post hoping to get a reaction and cause trouble. They fall into the tedious category as well and we all know who they are.\nYou have enjoyed yourself because we finished 6th, not because the football was excellent to watch.\nA bit like a golfer who hits a few shanks but holes a lot of long putts and has two holes in one and wins a competition. He may have won, but he knows he has played poorly.\nI saw all but one of our televised games and didn't see us play well. I can only comment on what I see. Bournemouth, now they can play football. It was a joy to see.\nWhat it tedious, is the narrow mindedness of people on here who feel the constant need to be rude and abusive towards posters who express opinions that the herd don't agree with. The same people, all of the time being negative towards the same posters\nAs for holding back our own youngsters from getting in the first team - perhaps, quite simply, they aren't ready for first team football yet and maybe he is? I'd rather us play a quality loanee in the side than a youngster who's not ready for first team football, purely because he's 'one of our own'.\nJust a quick comment on MrBloo. I'm guessing that the reason that people are rude and abusive towards you is because those people have watched Mick McCarthy take over as manager of Ipswich when we were bottom of the table and heading for league one - in two seasons they've watched him completely transformed the fortunes of the team, despite financial constraints which restricted him to only spending £10,000 on transfer fees. I guess they maybe find it frustrating when people not only fail to recognise what Mick has achieved but actually slate him on here and that frustration manifests itself in abuse. I can understand that personally. The style of football has not always been as attractive as other teams (who've invariably had the benefit of a substantially greater budget than us) but I'm afraid Ipswich put in many cracking performances irrespective of your view.\nYou need to login in order to post your comments",
  "word_count": 1230,
  "scraped_at": "2026-02-14T01:56:02.397790",
  "_text_extracted": true
}