{
  "article_id": "3fe19a070dc8",
  "url": "https://www.prokerala.com/news/articles/a1410399.html",
  "title": "Aston Villa , Newcastle United to battle for Europe in Premier League ( preview ) ",
  "date": "20230414T190000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "London, April 14 : Something has to give in the Premier League on Saturday lunchtime when Aston Villa entertain Newcastle United in what promises to be a vital game in the battle for Europe.\nNewcastle travel to Villa Park with five wins in their last five matches, while Aston Villa climbed up to sixth last weekend after their fourth consecutive win, as they continue to improve under the guidance of Unai Emery. Aston Villa will be without influential forward Leon Bailey with a thigh injury but have Ollie Watkins in form with nine goals in 11 games.\nTottenham will be watching that result closely ahead of their home game against Bournemouth, who have shown their battling qualities in recent weeks.\nHarry Kane and Son Heung-min will again be Tottenham's main threat as they continue their efforts for a top-four finish, a Xinhua report said.\nNew Leicester City coach Dean Smith has a tough debut as the replacement for Brendan Rodgers as he takes the team that is second from bottom to play Manchester City at the Etihad Stadium.\nPep Guardiola's side were outstanding in their 3-0 win at home to Bayern Munich on Tuesday night, but with the return leg next Wednesday, Guardiola can be expected to make some changes to his starting 11.\nRelegation comes swiftly into focus when bottom-of-the-table Southampton entertain a rejuvenated Crystal Palace side that has won twice and netted seven goals since Roy Hodgson's return to the dugout.\nEverton also have a vital home match against Fulham and Sean Dyche's side need to take advantage of the absence of the suspended Aleksandar Mitrovic in a Fulham side that looks to be running out of steam at the end of a creditable return to the top-flight.\nFrank Lampard's return to Chelsea has so far seen a 1-0 defeat away to Wolves and a 2-0 loss to Real Madrid in the Champions League, which saw defender Kalidou Koulibali pick up a muscle injury.\nLampard has to use Saturday's game at home to Brighton to make experiments ahead of Tuesday's return leg against Madrid and could put Mason Mount back into his side to give more spark in the final third.\nWolverhampton aim to build on their win at home to Chelsea but will have a tough game at home to a Brentford side that still has a chance of playing in Europe next season, despite a relatively poor record of just three away wins.\nThere are two big games on Sunday as Arsenal make the trip to east London to face West Ham.\nIt's still open to debate whether Arsenal's 2-2 draw against Liverpool last weekend is a point gained or two points lost, but with Gabriel Jesus showing he is back in form, dropping points away to struggling West Ham would be problematic, especially if Manchester City beat Leicester.\nWest Ham also need points and could look to target Arsenal left-back Oleksandr Zinchenko, who was exposed at times against Liverpool.\nNottingham Forest coach Steve Cooper is under more pressure than ever after the club sacked their Director of Football during the week and defeat at home to Manchester United could see Cooper out of the door as well.\nThere is no Marcus Rashford, but Casemiro returns in midfield after his suspension and that will complicate matters for a Forest side that has gone nice games without a win.\nLeeds United and Liverpool play on Monday night in a game that is very hard to predict.",
  "word_count": 579,
  "scraped_at": "2026-02-14T01:48:06.465736",
  "_text_extracted": true
}