{
  "article_id": "3feb1755d348",
  "url": "https://www.meathchronicle.ie/2023/05/24/julio-enciso-stunner-earns-brighton-thrilling-draw-with-champions-man-city/",
  "title": "Julio Enciso stunner earns Brighton thrilling draw with champions Man City",
  "date": "20230525T003000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Julio Enciso stunner earns Brighton thrilling draw with champions Man City\nBy Ed Elliot, PA\nJulio Enciso’s stunning leveller cemented Brighton’s place in next season’s Europa League as Manchester City’s Premier League winning run was halted at 12 games by a thrilling 1-1 draw.\nThe 19-year-old Paraguay forward unleashed a thunderous, swerving effort into the top right corner from 25 yards seven minutes before the break to mathematically guarantee Albion a sixth-placed finish.\nPhil Foden put the newly-crowned champions ahead at the Amex Stadium with his fifth goal in as many starts against the Seagulls.\nBut, despite bringing back a host of big names, Pep Guardiola saw his formidable side drop points for the first time since February 18 after Erling Haaland’s 79th-minute header was disallowed due to VAR spotting a shirt pull on Levi Colwill.\nCity boss Guardiola was angered by that decision and later shown a yellow card by referee Simon Hooper for his ongoing protestations.\nHaaland had wasted two fine first-half chances, while Brighton’s Danny Welbeck rattled the crossbar from a free-kick and had a goal disallowed for offside, in addition to a Kaoru Mitoma effort being chalked off for handball.\nThe pulsating encounter was a fitting final home game of an unforgettable campaign for the record-breaking Seagulls and banished the remote chance of them slipping into the Europa Conference League on the final day at seventh-placed Aston Villa.\nCity were given a guard of honour by their hosts, four days on from securing their fifth title success in six seasons thanks to second-placed Arsenal’s defeat at Nottingham Forest.\nGuardiola brought back Haaland and Kevin De Bruyne as part of six changes from Sunday’s celebratory 1-0 win over Chelsea, while Brighton captain Lewis Dunk began on bench just hours after his England recall due to ongoing calf and back issues.\nHaaland – seeking to add to his 36 top-flight goals – should have put City ahead inside six minutes but wastefully headed over unmarked following Foden’s inviting delivery from the left.\nGuardiola hailed rival manager Roberto De Zerbi as one of the most influential managers of the last 20 years in the build-up to the clash.\nYet City were guilty of causing their own problems in the opening exchanges with some risky passes out from the back.\nThe visitors were fortunate to escape Brighton’s high press on a handful of occasions before surviving in the 20th minute when Welbeck’s thumping free-kick cannoned back off the bar.\nHaaland then overran the ball and saw it smothered by Seagulls goalkeeper Jason Steele after being slipped in by Foden before making amends by assisting the 25th-minute opener.\nRiyad Mahrez’s superb through ball split Albion’s defence and Haaland raced clear to draw Steele and square for Foden, who slotted home to continue his fine scoring record against the Seagulls despite the best efforts of Jan Paul van Hecke on the line.\nWhile City lifted the Premier League trophy at the weekend, Brighton jubilantly celebrated securing continental football for the first time by beating relegated Southampton 3-1.\nAnd the Seagulls were determined to prolong the euphoria.\nMitoma saw his bundled finish ruled out and Facundo Buonanotte stung the palms of Stefan Ortega before the eye-catching equaliser arrived.\nEnciso collected the ball from Colwill midway inside opposition territory and advanced to spectacularly lash high into the net from distance, prompting applause from City fans behind the goal.\nFormer Manchester United forward Welbeck then had a neat finish disallowed for an offside before Foden headed De Bruyne’s cross narrowly over at the end of a breathless first half.\nThe frantic, end-to-end action extended into the second period, albeit chances were largely at a premium.\nIlkay Gundogan flashed wide and Cole Palmer tested Steele, while Pervis Estupinan’s powerful drive flew marginally wide of the left post at the other end.\nTreble-chasing City thought they had won it 11 minutes from time when Haaland found space to nod in a cross from substitute Palmer.\nBut, to the visible frustration of Guardiola, the close-range finish was overturned on advice from Stockley Park.\nCity complete their top-flight climax at Brentford before moving on to an FA Cup final against rivals Manchester United and a Champions League showdown with Inter Milan in Istanbul.",
  "word_count": 704,
  "scraped_at": "2026-02-14T02:24:42.733656",
  "_text_extracted": true
}