{
  "article_id": "3ff2ac7cb00e",
  "url": "https://www.fourfourtwo.com/features/leah-williamson-everything-you-need-to-know-arsenal",
  "title": "Leah Williamson : Everything you need to know",
  "date": "20241018T053000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Who is Leah Williamson? Everything you need to know about the England captain\nLeah Williamson is a football icon after captaining the Lionesses to the Euros title, learn more about the defender here\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nLeah Williamson is cemented into football history after captaining the Lionesses to their European Championship win in 2022.\nThe Arsenal defender is becoming an icon of the women's game and is garnering interest outside of football as a result. She has worked with companies like Nike and featured in GQ.\nBut who has she played for and when did she start competing for England? Here is all you need to know.\nLeah Williamson: Which clubs has she played for?\nAs a child she started her youth career at Rushden and Diamonds. At the age of just nine she moved to Arsenal and has competed for the Gunners ever since.\nShe made her first senior debut in 2014, the day after she turned 17. She was a substitute for Rachel Yankey in a Women's Champions League match against Birmingham City.\nAt Arsenal she has won the Women's Super League, two FA Cups and four League Cups.\nWilliamson has not just had high points at Arsenal with the defender sustaining an ACL injury in 2023 which ruled her out for several months. It meant she could not compete in the World Cup.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nVIDEO Why Lauren James Will Change Women's Football Forever\nWilliamson, who in FourFourTwo's view is one of the best players in England, said via the BBC about the injury at the time: \"My life has turned from having the best job in the world to having to go and do something every single day that I don't want to do. Everyone thinks about injury as a thing that takes away your physical ability. Everyone will talk about the fact that I missed the World Cup or these real tangible things that come along with it.\n\"But it's not even like I'm impartial. I actively don't want to be in this situation. It's not the easiest journey.\"\nShe returned to the pitch in January 2024.\nWilliamson's England career\nWilliamson won her first England cap in 2018 against Russia and her first start later the same year against Kazakhstan.\nShe won the SheBelieves Cup with the team in 2019 and was part of the World Cup squad that year who reached the semi-finals.\nWilliamson was first named captain by Sarina Wiegman in 2021 as then-skipper Steph Houghton was injured. The Arsenal player was officially given the captaincy in 2022 and went on to lead the team to the Euros trophy. She famously said after winning the title: \"The kids are alright\".\nShe also captained England for their Finalissima win over Brazil in 2023 but was injured for the 2023 World Cup. She was awarded with an OBE for services to football in 2023.\nWilliamson has also represented Great Britain and was named as part of the 2020 Olympics squad. Team GB were knocked out of the Games in the quarter-finals but Australia.\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 670,
  "scraped_at": "2026-02-14T02:01:51.715584",
  "_text_extracted": true
}