{
  "article_id": "4011d8eaa779",
  "url": "https://punchng.com/messi-takes-decision-on-future-to-join-bottom-placed-us-club/",
  "title": "Messi takes decision on future , to join bottom - placed US club",
  "date": "20230608T083000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionel Messi said on Wednesday he will sign for Major League Soccer side Inter Miami, choosing the United States as his next destination over a Barcelona reunion or blockbuster deal to play in Saudi Arabia.\nInter Miami, co-owned by former England international David Beckham and founded in 2018, sacked coach Phil Neville last week with the team bottom of the Eastern Conference.\nThe Argentine forward, 35, has spent the last two seasons at Paris Saint-Germain, playing his final game for the club on Saturday, after moving from Barcelona in 2021, where he spent the majority of his career.\nMLS and Inter Miami confirmed the news on social media, although the American league noted that “work remains to finalise a formal agreement”.\n“I’ve taken the decision that I am going to Miami; I don’t have the deal 100 per cent sealed, or maybe there’s something left to do, but we decided to continue our path there,” Messi told Spanish newspapers Diario Sport and Mundo Deportivo.\n“After winning the World Cup and not being able to go to Barca, it’s time to go to MLS to live football in a different way and enjoy my day-to-day life more.”\nMessi is a seven-time Ballon d’Or winner and is expected to earn the individual accolade once more after leading Argentina to World Cup glory in Qatar in December.\nThe football world was eagerly awaiting Messi’s decision after PSG confirmed this week the playmaker, widely considered the best player in the history of football, was departing.\nThe romance of a Barcelona return and prospect of eye-watering riches in Saudi Arabia fell by the wayside as Messi opted to join MLS, with Miami a city he has holidayed in on previous occasions.\n“If it had been a question of money, I would have gone to Saudi Arabia or elsewhere,” said Messi.\n“It seemed a lot of money and the truth is that my decision went another way and not for money.”\nSome reports say key MLS sponsors including Adidas and Apple TV, who own the league’s domestic broadcasting rights, may be contributing to his deal.\nMessi, who turns 36 later this month, is now set to finish his club career outside the spotlight of top-level European football.\n‘WANTED TO COME BACK’\nMessi said he would have loved to return to Barcelona but was afraid that the financial complications which stopped the Catalan club extending his deal in 2021 would interfere again.\n“I really wanted to come back, I was really looking forward to it,” continued Messi.\n“But, on the other hand, after having lived through what I lived through, after the exit I had… I didn’t want to go through the same situation again and have to wait to see what was going to happen.\n“I didn’t want to leave my future in the hands of others. Somehow, I wanted to make my own decision for myself, for my family.”\nMessi said he plans to live in Barcelona again in the future and be involved with his former side in some way.\n“I don’t know at what moment and when, but hopefully I can return one day to contribute something to the club,” he said.\nBefore that, though, Messi will give the growth of football in the United States another jolt of momentum with his arrival, which comes just three years ahead of the 2026 World Cup being co-hosted in the United States, Canada and Mexico.\nHaving spent the past two seasons of his career at a lavishly funded PSG side, Messi will be going to a more modest set-up in Miami.\nIn their first game since Messi’s announcement on Wednesday, Miami defeated Alabama non-league side Birmingham Legion 1-0 in the US Open Cup to reach the semi-finals.\nGLITTERING HISTORY\nMessi joined Barcelona’s academy at 13 years old after leaving his homeland.\nHe became the Catalan club’s greatest icon, scoring a record 672 goals in 778 games, winning 35 trophies, including four Champions League triumphs and 10 La Liga titles.\nAfter his unexpected Barcelona departure, Messi linked up in Paris with his former team-mate Neymar and Kylian Mbappe in a star-studded attacking trident, but PSG flattered to deceive during his time at the club.\nWhile they won Ligue 1 twice, they suffered two devastating Champions League last-16 exits, with Messi a target for supporters’ anger.\nAlready being booed by fans, he took an unauthorised trip to Saudi Arabia, where he is a tourism ambassador, and was fined and suspended by PSG.\nMessi returned from suspension to play his 75th and final match for PSG last weekend in a defeat by Clermont, during which he was jeered once more and could not add to his tally of 32 goals for the club.\n“They were two years which were, in general, difficult for me, but they are behind me now,” said Messi.",
  "word_count": 804,
  "scraped_at": "2026-02-14T02:07:02.902084",
  "_text_extracted": true
}