{
  "article_id": "403a35d2bf41",
  "url": "https://www.themag.co.uk/2023/04/everton-1-newcastle-4-the-instant-nufc-fan-writer-reaction-newcastle-united/",
  "title": "Everton 1 Newcastle 4 - The instant NUFC fan / writer reaction",
  "date": "20230427T231500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Everton 1 Newcastle 4 – The instant NUFC fan / writer reaction\nEverton 1 Newcastle 4 – Thursday 27 April 2pm\nWhat an excellent professional performance.\nNewcastle United weathering the early predictable up and under onslaught where in reality Everton never really seriously threatened, then NUFC’s class showing through as they could have actually scored six or seven in the end.\nNat Seaton:\n“What a result!\n“A scrappy first half, we were’t great but we still went in 1-0 against a poor team who may well be going down.\n“Second half a different story, a commanding performance which had all that we have been witnessing in recent weeks.\n“The players are full of confidence and we looked like we would score every time we went forward.\n“I’m so glad to have been there to witness that run by Isak for the Murphy goal!!!\n“Can’t wait for Sunday…”\nDavid Punton:\n“A ruthless and professional demolition of Everton football club as we march on towards Europe.\n“The struggling Toffees had no answer to Eddie Howe and his absolutely class set of players.\n“We have torn them to bits and it’s now ten goals in the last two games.\n“The first half wasn’t amazing but Wilson sniffed out the opener. We were clinical from them on in.\n“After the break – just wow. I mean really, wow.\n“What a display and what a run from Isak, shades of Messi there.\n“Everton tried to make it a big night with fans swarming the team bus with smoke canisters.\n“They can’t mask the fact we have caught them and left them trailing in our wake.\n“Absolute cloud nine tonight.”\nSimon Ritter:\n“Absolutely brilliant.\n“Everton tried to kick us off the pitch from start to finish and were aided by a ridiculously lenient ref.\n“We stood up to their bully-boy tactics and gave them a football lesson.\n“To think the Toffees were once a synonym for skilful, cultured play. Kendall, Ball and Harvey would be appalled by this lot’s totally predictable tactics.\n“They deserve to sink without trace and they can take their old school manager with them.\n“Anyone who says footballers are overpaid should be made to watch this match.\n“Our heroes risked their limbs and careers to play the beautiful game.\n“Ice-cool Alex turned back the years to recreate a memorable Mark McGhee goal with his mesmerising dribble for the fourth goal.\n“Where would we be if Wilson and Isak had stayed fit all season?”\nJamie Smith:\n“Oh that was mint.\n“Actually a patchy start but a poachers goal from Wilson and a bit of luck with the offside against Calvert Lewin.\n“Second half was different gravy as we replayed the free scoring fun of the Tottenham game.\n“Some wonderful moments – Isak’s assist for Murphy’s goal the pick but the way we zip forward cutting teams apart is Keeganesque.\n“Destroying an opponent that has brought plenty needle over the years and leaving them staring into the relegation abyss is very satisfying and they can enjoy being great mates with the mackems in the Championship while we are busy in the Champions League.”\nBrian Standen:\n“Ah man. A different level\n“Ride the storm win the game\n“Where do you start, where do you finish!\n“Too many superlatives across the team but Isak…. Wow.\n“As deft as Peter Beardsley in his prime!\n“Nice touch from Eddie to bring Gordon on!”\nTony Mallabar:\n“Sitting on the bus waiting to leave luckypool.\n“It’s absolutely buzzing.\n“We ended up in the Park Bar outside the kop.\n“Anticipated the blue onslaught. No show.\n“By the way.\n“Look, Everton fans are equally as passionate as us.\n“But our two clubs are headed in opposite directions.\n“And well played to the young lass in her 20s standing next to me, who had done something I hadn’t encountered all season. She actually smelt nicer than my constant away match companion Phil T.\nNUWNBD\nGToon:\n“What a team, what a manager and what a set of fans.\n“That was a huge win from the kind of game where we would have folded in the past.\n“I wish I could hear what Eddie says to his players.\n“He is one amazing manager.\n“I’m not too bothered about who we beat as my dislike of the Liverpool teams is reserved for the red side.”\nMatt Busby Said To Joe Harvey:\n“How I wanted to see Goodison turn toxic with ten minutes to go.\n“I’m glad to say it happened earlier than that.\n“After riding our luck on the stroke of half time, we ground our horrible opponent down and thoroughly deserved the three points.\n“For those who have been making the case for Targett to replace big Dan Burn, I’ll leave them to reflect on what we saw this evening\n“On Sunday, I challenged anyone to show me a better assist than Joe Willock’s for Isak’s first against Spurs.\n“Well, we saw it just there from the striker from Sweden. That run to set up Murphy was insane\n“Big, big match on Sunday.\n“I more than fancy us to take another three points but let’s not get complacent. HTL.”\nPaul Patterson:\n“Play the Champions League music…”\nBazoox:\n“We look like we are unstoppable.\n“Callum Wilson comes up with the goodies yet again and Big Joe justs gets even more awesome.\n“The ‘Rolls Royce’ then comes off the bench, to show the whole country once again why Eddie paid over £60M for him.\n“We are going into the Champions League next season in style.\n“It’s bye bye though to the sticky Toffees.\n“They have stank the EPL out for many years.”\nBilly Miller:\n“Imagine being an Everton player and seeing an in form Wilson starting against you with Isak on the bench. Especially when your team can’t buy a goal.\n“First half was pretty even and the Toffees looked well up for it.\n“The class shone through in the second half.\n“I think Isak has shown from his cameo he could operate on the wing. Could we see him and Wilson start together at some point this season?\n“So many players are doing brilliantly. This team doesn’t pick itself anymore.\n“I reckon we’re 3 wins away from Champions League football!”\nGreg McPeake:\n“First 10 minutes I was anxious but after the first goal confident.\n“The Everton offside goal I knew was offside but expected VAR to give it\n“Second half we weathered their initial attempt to disrupt and we bossed it.\n“JoeLinton what a player and how about that Isak skill. Brilliant.”\nChuks McPeake:\n“I can’t wait for us to batter Chelsea.\n“Anthony Gordon should have been on earlier to score the goal to put them down on goal difference.”\nStats from BBC Sport:\nEverton 1 Newcastle 4 – Thursday 27 April 2pm\nGoals:\nNewcastle United:\nWilson 28, 75 Joelinton 72, Murphy 81\nEverton:\nMcNeil 80\n(In brackets the half-time stats)\nPossession was Everton 40% Newcastle 60%\nTotal shots were Everton 13 Newcastle 15\nShots on target were Everton 5 Newcastle 9\nCorners were Everton 3 Newcastle 14\nReferee: Andre Marriner\nNewcastle United:\nPope, Trippier, Schar, Botman, Targett (Burn 68), Bruno, Joelinton, Almiron (Murphy 68), Willock (Anderson 87), Longstaff (Isak 74), Wilson (Gordon 87)\nUnused Subs:\nDubravka, Ritchie, Lascelles, Manquillo\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1218,
  "scraped_at": "2026-02-14T01:50:29.465217",
  "_text_extracted": true
}