{
  "article_id": "404fd8ea49a0",
  "url": "https://allafrica.com/stories/202511130455.html",
  "title": "Africa : 2026 World Cup - Africa Also - Rans Clash in Play - Offs for Last Chance Gala",
  "date": "20251113T164500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Four African teams will battle in the Moroccan capital Rabat on Thursday for the chance to feature in an inter-continental play-off for a spot at next year's World Cup in the United States, Canada and Mexico.\nNigeria will face Gabon at the Moulay Hassan Stadium and Cameroon will take on Democratic Republic of Congo at the Al-Barid Stadium for a place in Sunday's African play-off final.\nThe winner of that showdown at the Moulay Hassan Stadium will advance to a tournament where they will be among the sides from four of the five other confederations that make up world football's governing body Fifa.\nFor that six-team competition, expected to be held in Mexico, the two highest ranked nations will be placed directly in the final. The other four will play in a one-off semi-final.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nThe winners of the two finals will progress to the World Cup where 48 teams will feature for the first time since the inception of the competition in 1930.\nSalah delays rehab to support Egypt during Cape Verde crunch at Cup of Nations\nOf the four African teams in Morocco, only Gabon has failed to feature at the World Cup.\nCoach Thierry Mouyama is expected to place Pierre-Emerick Aubameyang at the spearhead of the attack.\nThe 36-year-old emerged unscathed after scoring the final goal in Marseille's 3-0 victory over Brest on Saturday night in Ligue 1 at the Vélodrome.\nAubameyang hit all four goals in the 4-3 victory over Gambia in Gabon's penultimate World Cup qualifier. His dismissal in the closing stages meant he was suspended for the final Group F game against Burundi.\nHis return for an 84th international appearance will furnish a sub-plot which involves his Nigeria counterpart Victor Osimhen.\nThe 26-year-old rampaged to a hat trick in the 4-0 annihilation of Benin in the final Group C qualifier to take his side into second place behind South Africa.\nAnd he notched up another in Galatasaray's 3-0 win at Ajax in the Champions League on 5 November.\n\"He's unpredictable,\" said Mouyama of Osimhen. \"But he's also a player who loves running into space.\nGhana self-destruct at Cup of Nations as Cape Verde and Egypt advance\n\"Our main question lies in our ability to reduce the distances, especially in depth, behind our defence. That's part of the challenge: our ability to close down the spaces in behind.\n\"But even if you fix that problem, he has another side to his game,\" Mouyama added. \"He's very good at corners and free kicks. That's the complexity of it all and that's where the coach's work, the technical staff's work, becomes interesting. We will debate and agree on a common defensive strategy.\"\nNigeria, who debuted at the World Cup in 1994, will be fighting to reach the tournament for the seventh time.\nCameroon, runners-up in Group D to Cape Verde, will be seeking a ninth appearance.\nThey face a DRC team only six places beneath them in the Fifa world rankings.\nSébastien Desabre's charges finished behind Senegal in Group B and as his players went through their paces in Morocco, the 49-year-old Frenchman was at pains to calm expectations more than 50 years after the country - then known as Zaire - made its only visit to the World Cup.\n\"People go on sometimes as if the DRC has played in 18 World Cups and won the Africa Cup of Nations 10 times,\" Desabre said.\n\"It's not by magic that we'll go from 75th place in the world rankings to surpassing Senegal or Morocco. It has to be built.\n\"It's true that we are making progress and we all know that Congo has very good football players.\"\n\"Now, everyone wants us to beat Argentina or Brazil when we play them. Of course, that day will come, I am convinced of it.\"",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:09:38.465032",
  "_text_extracted": true
}