{
  "article_id": "4062627415a0",
  "url": "https://www.brightonandhovenews.org/2025/02/14/brighton-and-hove-albion-beat-chelsea-again/",
  "title": "Brighton and Hove Albion beat Chelsea again",
  "date": "20250215T010000Z",
  "domain": "brightonandhovenews.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A stunning opener from Kaoru Mitoma and two goals from Yankuba Minteh left Chelsea suffering a crippling sense of déjà vu.\nBrighton and Hove Albion’s 3-0 victory at the Amex lifted the club to eighth place in the Premier League to chants of: “Can we play you every week?”\nSix days on from slipping to defeat in the fourth round of the FA Cup at Falmer, Enzo Maresca’s Blues were muted as their pursuit of a Champions League place faltered.\nMitoma, who scored the winner in Saturday’s 2-1 triumph, produced a sensational first touch in the 27th minute, firing the Seagulls in front, before fellow winger Minteh struck each side of the break.\nTo make matters worse for fourth-placed Chelsea, Noni Madueke suffered an early injury and the Blues, failing to register a shot on target, have now taken just nine points from their last nine fixtures.\nRampant Brighton, who were hammered 7-0 at Nottingham Forest just under a fortnight ago, climb to eighth in the table after their first league success at home since early November.\nChelsea head coach Maresca claimed that the chance to concentrate on top-flight commitments – and the Conference League – was a positive consequence of his side’s premature cup exit.\nAs the Blues chase a return to European football’s top club competition, the Italian made four changes to the team he selected six days earlier, while Adam Webster replaced Albion’s injured captain Lewis Dunk.\nWinger Madueke was among the players recalled by Maresca but, with England boss Thomas Tuchel watching from the stands, he limped off inside 21 minutes to be replaced by Jadon Sancho having set up a good chance for Cole Palmer.\nPalmer’s poor slice wide was the best opportunity of a cagey opening before Mitoma lit up a bitterly cold Valentine’s Day encounter with a moment of magic.\nFollowing a searching pass from goalkeeper Bart Verbruggen, the Japan winger sublimely plucked the ball out of the air before beating Trevoh Chalobah and firing into the bottom right corner from inside the D.\nChelsea briefly thought they had levelled 10 minutes short of half-time when captain Enzo Fernandez headed home Malo Gusto’s cross, only to be penalised for a push on Joel Veltman.\nThe visitors’ frustration was heightened three minutes later following some more questionable defending.\nIt started as Chalobah lost possession deep inside his own half and ended as Danny Welbeck worked a loose ball to Minteh, who took a touch past Marc Cucurella before burying a low finish.\nBrighton boss Fabian Hurzeler had urged the home fans to recreate the raucous atmosphere of last weekend when there were recurrent jeers for former Seagulls players Robert Sanchez, Cucurella and Moises Caicedo.\nChants of “can we play you every week?” followed the second goal while left-back Cucurella bore the brunt of the hostility after Sanchez was dropped in favour of first-choice keeper Jorgensen.\nCaicedo provoked anger from the terraces and was booked for a scything challenge on Mitoma in the closing stages of a first half in which Chelsea dominated possession but failed to trouble Verbruggen.\nAmid the ongoing injury absence of first-choice striker Nicolas Jackson and after the early loss of Madueke, Maresca initially opted against changes as he sent out his players early for the second period.\nChelsea continued to spend plenty of time in Brighton’s half but their lack of threat persisted and Albion killed off the contest in the 63rd minute.\nWith the visitors appealing in vain for a foul on Colwill in the build-up, Minteh exchanged passes with Welbeck before cutting in from the right and finishing via a slight deflection off Chalobah.\nMaresca responded with a triple substitution but it was too late. The damage had already been done.\nJorgensen prevented a worse scoreline, pushing a Veltman effort on to the right post as Brighton, who did require Verbruggen to prevent Adam Webster scoring a late own goal, cruised to a resounding victory.\nNext up, on Saturday 22 February, Albion travel to bottom side Southampton. The Saints have just nine points from 24 matches, one of which was taken at the Amex in a 1-1 draw at the end of November shortly before Brighton-born manager Russell Martin lost his job.",
  "word_count": 704,
  "scraped_at": "2026-02-14T02:20:55.374543",
  "_text_extracted": true
}