{
  "article_id": "406f956781ea",
  "url": "https://www.nytimes.com/athletic/6324133/2025/04/30/carlo-ancelotti-real-madrid-brazil-interest/",
  "title": "Explaining why Carlo Ancelotti Brazil move has stalled and what next for Real Madrid coach",
  "date": "20250430T224500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It has been far from a dull week at Real Madrid.\nCarlo Ancelotti’s team lost a bad-tempered Copa del Rey final 3-2 after extra time to Barcelona on Saturday. A day later, The Athletic reported the Italian was set to leave Madrid to take on the role of Brazil head coach.\nThe 65-year-old has been in talks with the Brazilian football federation (CBF) since March. Ancelotti, described by voices at the CBF as “the dream of the president” Ednaldo Rodrigues, has been the main candidate to replace the sacked Dorival Junior in a list on which Al Hilal’s Jorge Jesus has always featured highly.\nAdvertisement\nIn recent weeks, the CBF has sent two emissaries to hold talks with Ancelotti. Those progressed to the point where Ancelotti agreed to lead Brazil in their matches in June and initially until after the 2026 World Cup, according to multiple sources with knowledge of the situation — who, like all those mentioned in this article, asked to remain anonymous to protect relationships. Ancelotti even shared news of the move with different people at Madrid’s Valdebebas training ground.\nAll that was missing was his signature… but it now appears the move to the record five-time world champions has stalled. It is a fast-moving situation, but here, we explain why.\nWhat has changed and why?\nEarlier this month, at a meeting in Madrid the day after Real’s Champions League quarter-final exit against Arsenal, the CBF and Ancelotti agreed the Italian would sign his deal after the Copa del Rey final. The Spanish club and the coach were also scheduled to meet that week to finalise the details of his departure.\nThe condition the CBF has always underlined with its coaching candidates is that they should be available for their next two World Cup qualifiers, with the Selecao visiting Ecuador and hosting Paraguay on June 4 and 9, respectively.\nAl Hilal’s Jesus was happy with this timeframe and there was an agreement with him in place, but it was all dependent on what happened with Ancelotti. Ancelotti gave positive indications to the CBF, which even started planning how it would announce his appointment and how it would release his first squad.\nNames for Ancelotti’s staff have also been discussed. Davide Ancelotti, his son and assistant at Real Madrid, wants to start his career as a head coach from this summer, but was set to join his father in Brazil if he did not have a job to move into by June.\nAdvertisement\nAncelotti met with CBF representatives in London on Monday. But to their surprise, he did not sign and said he would do so on his return to Spain. But after a few hours, Ancelotti suddenly expressed doubts to the CBF, putting the final agreement in serious jeopardy.\nTalks and meetings to redirect the situation took place on Tuesday, with some sources optimistic and others advising caution. In Brazil, some voices fear the image of federation president Rodrigues could be tarnished by failing to secure Ancelotti’s signature, as previously happened in 2023.\nWill the deal still happen?\nIt depends on who you ask. Sources within the CBF and close to it advise caution, as no one on the Brazilian side wants to go through another failure to land their top target.\nSources in Madrid say work is being done to ensure everything goes ahead. This is largely dependent on an agreement between Real Madrid and Ancelotti over the salary for the remaining year of his contract at the Bernabeu.\nHis last Madrid contract renewal came in December 2023 and his existing deal expires in the summer of 2026. If Madrid terminate this a year earlier than planned, they would be expected to pay him a compensation fee, which was agreed in advance.\nThat happened in the Italian’s first spell at the club from 2013-2015, when Ancelotti received compensation when he was sacked as his deal ended in 2016.\nAncelotti has previously said he would “never decide” his own departure date and has made it known he does not intend to leave the club of his own accord. But the situation is different to 2015, given Brazil’s interest and it is unclear whether Madrid would pay him compensation for the final year of his contract.\nIf Ancelotti reaches an agreement with the club, a solution could be Madrid not paying him compensation for the whole of his remaining year or paying him a lower amount. But the Italian previously expressed his anger at coaches not being paid properly at a meeting of Spanish first and second-division managers in 2023.\nAdvertisement\nThe hope will be that a compromise can be struck that allows Ancelotti to both take an exciting opportunity to coach Brazil at the World Cup and ensure he is not significantly out of pocket.\nWhile Brazil believe they could match Ancelotti’s wages, the salary for national team coaches — even at the highest level — tends to be significantly lower than the biggest club teams. As such, Ancelotti, if he remained at Madrid, or if he was fired and paid up the final year of his contract, might receive more than if he joined Brazil immediately without any settlement for his final year.\nA similar situation played out when Mauricio Pochettino joined the USMNT last summer while he still had a year left on his deal at Chelsea, with all parties eventually working together to find a way to minimise the shortfall inflicted on the coach, which may be the solution too in Ancelotti’s case.\nWhat are Ancelotti’s options if he doesn’t join Brazil?\nAncelotti has other options apart from the Brazilian national team. He has received interest from clubs in Saudi Arabia, with Al Hilal among those interested in appointing him.\nIn 2023, Ancelotti was asked in a press conference whether he would move to Saudi Arabia if he received a lucrative offer and jokingly answered: “I would go on foot, without reservations. I don’t need to book a flight, I would walk.”\nBut if neither of those destinations appeals, he could still stay at Madrid in a non-coaching role — an option which was included in his previous contract, as reported by The Athletic.\nWhat does this mean for Real Madrid?\nBarring a big surprise, not much.\nThe Athletic has reported that Xabi Alonso, the club’s former midfielder who is coaching Bayer Leverkusen, is the club’s preferred choice to replace Ancelotti. Earlier this month, Leverkusen CEO Fernando Carro said the German club had a “gentlemen’s agreement” with Alonso “if a team he has played for” came in for him and said the club expected a decision “in the next three or four weeks”.\nAdvertisement\nShould Alonso not join before the new FIFA Club World Cup begins in June, the club would opt for an interim option. Santiago Solari, their former caretaker coach and now-director of football, and Raul, their legendary ex-striker and coach of their ‘B’ team, are two names that have been mentioned.\nWhile Solari is a trusted figure by those at board level, Raul already has a staff working under him and has been present at some first-team training sessions. Despite the recent drama, all sources consulted have said they do not expect Ancelotti to be coaching the team for the Club World Cup in the United States.\nAdditional reporting: Guillermo Rai\n(Top photo by Guillermo Martinez)",
  "word_count": 1225,
  "scraped_at": "2026-02-14T02:15:07.787792",
  "_text_extracted": true
}