{
  "article_id": "4094d860de4b",
  "url": "https://www.muswellbrookchronicle.com.au/story/9140965/jets-prepare-for-boxing-day-showdown-with-macarthur/",
  "title": "Jets prepare for Boxing Day showdown with Macarthur | Muswellbrook Chronicle",
  "date": "20251225T233000Z",
  "domain": "muswellbrookchronicle.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JETS coach Mark Milligan doesn't enjoy being the Grinch.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut the player-turned-coach is accustomed to spending time away from family on Christmas Day.\nIt's part of being a professional footballer.\nThe Jets take on Macarthur in a Boxing Day blockbuster at McDonald Jones Stadium.\nThat meant, while families were preparing for Christmas lunch, the Jets were finalising preparations with a training session at Turton Road.\n\"I was a player too,\" Milligan said. \"My wife said to me the other day: 'I don't remember you ever having a day off'.\nIt will be the Jets' third Boxing Day game at home.\nA crowd of 11,413 was on hand for a 2-1 derby defeat to the Mariners in 2008.\nThat was followed by a 2-all draw with Wellington in front of 8.451 fans in 2016.\nThey were to play Western Sydney Wanderers behind closed doors at home in 2021, but the match was postponed due to one of the opposition players contracting COVID-19.\nOnce, they have been on the road at Christmas, going down 4-0 to Perth in 2009.\nKeeper James Delianov, whose parents are visiting from Melbourne, said training on Christmas Day was \"part of the job\".\n\"I think I have played on Christmas Day as well,\" he said. \"It's part of the job. There are no worries for us. We're focused on Macarthur and getting three points.\"\nThe Jets are chasing a hat-trick of wins for just the second time in six years.\nGiven that Australia has already wrapped up the cricket Ashes, Milligan is hoping sports fans turn their attention to football.\n\"They should come to the football,\" he said. \"The tests are done. We have won.\"\nMacarthur played out a 1-all draw with Melbourne City at AAMI Park on Tuesday night.\nKorean striker Ji Dong-won limped off with a foot injury in the 26th minute.\n\"We are going through a rough patch with sickness and injury,\" Macarthur coach Mile Sterjoski said. \"To get a result against City away from home is a positive.\n\"We will try to get a short training session in on Christmas Day, which is unfortunate for the boys and staff. But it has to be done to assess where we are at.\"\nMax Burgess has recovered from a groin injury and Milligan will make a call on the midfielder after training on Christmas Day.\nThe Jets are coming off a statement 2-0 win over Sydney FC, arguably the best performance since Milligan took the reins.\n\"We need to keep improving,\" Milligan said. \"We have spoken a lot about accountability and decision making. That was the most impressive thing about the Sydney game.\n\"We have a different sort of challenge to what we face against Sydney.\"\nThe clean sheet against Sydney FC was the Jets' first in eight games this season.\n\"It was about time we got a clean sheet. I was really proud of the boys,\" Delianov said.\n\"If you look at our results, we've been really close [to a clean sheet. It has been maybe an individual error, or maybe a wrong decision which has cost us.\n\"We are tidying that up, and looking to build from this performance.\n\"I hope the boys, you know, get addicted to that feeling and strive for that more in the future.\"\nMacarthur sit in seventh spot on 12 points, behind the Jets on goal difference. As well as the A-League, they have been competing in the group stage of the Asian Champions League 2 - a competition the Jets will feature in next season courtesy of their Australia Cup triumph.\n\"They haven't been so consistent in the league, but they have been very good in the Asian Champions League 2,\" Milligan said.\n\"They pose a different threat to what Sydney do. We know they are going to be organised and compact when they need to be.\n\"It will be how we go about our business.\"",
  "word_count": 659,
  "scraped_at": "2026-02-14T01:52:59.283409",
  "_text_extracted": true
}