{
  "article_id": "4094f6c73258",
  "url": "https://dailypost.ng/2024/08/22/ballon-dor-2024-fresh-ranking-reveals-top-five-contenders-see-list/",
  "title": "Ballon dOr 2024 : Fresh ranking reveals top five contenders [ See list ] ",
  "date": "20240822T064500Z",
  "domain": "dailypost.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nBallon d’Or 2024: Fresh ranking reveals top five contenders [See list]\nA fresh ranking has revealed the possible winner of this year’s Ballon d’Or.\nThe ranking, according to sportskeeda.com, features Euro and Copa America stars.\nDAILY POST reported how Spain stormed their way to the Euro 2024 title this year.\nAnd now some of their representatives are in the race for the most prestigious individual award in football.\nOn the other hand, Argentina defended their Copa America title this year and this has put their captain, Lionel Messi among top five contenders for the award.\nHere are the current favourites to win the 2024 Ballon d’Or.\n5 Lionel Messi (Inter Miami/Argentina)\nMessi has emerged as the first Major League Soccer MLS star to remain strongly in contention for the Ballon d’Or.\nHe has scored 12 goals and provided nine assists in only 12 appearances for MLS this season and contributed to Argentina’s Copa America triumph this year with one goal and one assist in five appearances.\n4 Lautaro Martinez (Inter Milan/Argentina)\nThe Inter Milan frontman, Lautaro Martinez scored 24 goals for the club in Serie A last season and propelled them to a league title.\nHe also scored five goals in Argentina’s Copa America campaign and won his third trophy with his country.\n3 Jude Bellingham (Real Madrid/England)\nHe scored seven late goals for both club and country last season. The England international singlehandedly won as many as 10 points for Real Madrid with his late goals last season.\nBellingham has emerged as one of the best players in world football at the moment and could potentially win the Ballon d’Or\n2 Rodri (Manchester City/Spain)\nThe Manchester City star has been imperious on the ball over the past year and was the proverbial puppet-master behind Spain’s Euro 2024 triumph.\nHe won the ‘Player of the Tournament’ award for his performances at Euro 2024.\nThe Spaniard also won the Premier League title last season and is currently one of the favourites to win the Ballon d’Or this year.\n1 Vinicius Junior (Real Madrid/Brazil)\nThe Brazilian attacker Has been impressive for his club Real Madrid, helping them to win the UEFA Champions League yet again last season.\nHe scored six goals and provided four assists to help Carlo Ancelotti’s Los Blancos win the competition.\nHe also scored a crucial goal in the final and is currently the frontrunner in the award.",
  "word_count": 400,
  "scraped_at": "2026-02-14T01:51:48.872702",
  "_text_extracted": true
}