{
  "article_id": "4097cf690039",
  "url": "https://www.justarsenal.com/surely-ramsdale-must-make-his-champions-league-debut-tonight-against-psv/355490",
  "title": "Surely Ramsdale must make his Champions League debut tonight against PSV ? ",
  "date": "20231212T183000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal attempted but failed to qualify for Champions League football over the past 7 years, but they did so last season. That being said, they would not be in the 2023–24 Champions League if it weren’t for some of Aaron Ramsdale’s exploits last season. Nobody can deny that the Englishman was fantastic for us as we challenged for the title.\nIt is sad that the Englishman has yet to taste Champions League action after five games into the competition. Mikel Arteta signed David Raya on loan in the summer and appears to regard the Spaniard as his number one. Raya has been the goalkeeper he has relied on in key games (he hasn’t rotated much) and Ramsdale has been relegated to the bench, and since the September international break, the ex-Sheffield man has only played one league game, Arsenal versus Brentford, which he played because Raya couldn’t face his parent club.\nWith that out of the way, Arsenal has already qualified for the Champions League knockout stages, thanks to their 6-0 win against Lens on Match Day 5, which ensured that they would finish top in Group B.\nWith Arsenal already in the round of 16 regardless of how their clash with PSV ends, don’t you think that’s a game Arteta should give Ramsdale his Champions League debut? I believe he should, since there is no reason he shouldn’t. Even veteran Arsenal goalie David Seaman believes Ramsdale should play against PSV.\nSeaman said on talkSPORT, “The Champions League is a free hit, so you never know; we might even see Aaron Ramsdale playing for his Champions League debut; that would be very nice.”\nI would be unhappy if Ramsdale did not start against PSV, wouldn’t you?\nDaniel O\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 312,
  "scraped_at": "2026-02-14T02:17:09.410963",
  "_text_extracted": true
}