{
  "article_id": "409baf8d3e7d",
  "url": "https://theathletic.com/4146141/2023/02/02/keylor-navas-nottingham-forest-transfer/",
  "title": "Keylor Navas still has point to prove at Nottingham Forest",
  "date": "20230202T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A three-time Champions League-winning goalkeeper joining a two-time European Cup-winning club should not be that surprising.\nBut Keylor Navas’ deadline day move to Nottingham Forest would have been unthinkable a few years ago, when Navas was winning his third consecutive Champions League trophy with Real Madrid while Forest were completing a 10th successive season in the Championship.\nAdvertisement\nSince then, Forest have been on the up. With the backing of owner Evangelos Marinakis, they were promoted to the Premier League for the first time this century and have shown the sort of transfer market audacity that has resulted in 28 incoming transfers this season.\nNumber 28 is the most amazing capture of all. Plenty has happened to Navas at Paris Saint-Germain over the last 18 months but he has now accepted the chance to play regular football in the Premier League and prove that, at 36, he can still compete at the highest level.\nNavas moved to PSG in 2019 for €15million (£13m; $16.4m). He and his family settled quickly in the French capital and he was an automatic first choice for coach Thomas Tuchel.\nIn his first season, PSG won the Ligue 1 and Coupe de France double, and also reached the club’s first Champions League final. The following season, Navas was No 1 for Mauricio Pochettino too as PSG retained the Ligue 1 title and reached the Champions League semi-finals, where they were beaten by Manchester City.\nThe settled situation changed radically in the summer of 2021. PSG signed Italy international Gianluigi Donnarumma, who was a decade younger, available on a free transfer and had just saved the decisive penalty in the final shootout as Italy won the European Championship.\nIt was also important that PSG’s goalkeeping coach was Gianluca Spinelli, who had worked with Donnarumma for the Italian national team. None of this was ideal for Navas, but this was not a completely new circumstance for him. After arriving in Madrid for €10m off the back of his heroics for Costa Rica at the 2014 World Cup, Navas had to compete for a starting place with club legend Iker Casillas. Twelve months later, only a malfunctioning fax machine prevented Real Madrid president Florentino Perez from replacing him with David de Gea. Then, in his final season at Madrid, Navas had to battle Thibaut Courtois for a starting spot.\nAdvertisement\nSo, as before, Navas knuckled down and trained well, in the hope of impressing his coaches and earning a starting spot. Pochettino dealt with the matter by rotating his keepers — both Navas and Donnarumma played three Champions League group games each that autumn — while also splitting their duties in Ligue 1.\nHowever, for the crucial Champions League last-16 tie against Real Madrid in early 2022, Donnarumma got Pochettino’s backing. Navas watched from the bench as former team-mate Courtois saved Lionel Messi’s penalty in the first leg before Donnarruma was then dispossessed by Karim Benzema during a dramatic second leg at the Santiago Bernabeu. Neither the Costa Rican nor the Italian was content — something had to change.\nPochettino was replaced in July 2022 and even before Christophe Galtier, the new head coach, had seen him train, Navas was aware that Donnarumma was going to be PSG’s first choice from now on. He accepted quickly that a move away would be best, and was fully confident that he could continue to play at the top level. There was no contemplation of a move to MLS, even though the United States would be closer to his home in Costa Rica.\nBut PSG did not want to give a top goalkeeper away free of charge, especially to a direct rival. Not many clubs around Europe could afford to match Navas’ terms at PSG (about €12m a year) and those who could were either well covered or unlikely to pick a veteran goalkeeper as their long-term No 1.\nNavas’ camp looked closely at the Premier League — he speaks English and was interested in the challenge of English football — although, at that point, he was not attracted by the idea of swapping the Champions League for a relegation battle. The one bright spot on Navas’ horizon was the 2022 World Cup, a competition in which the Costa Rican has created great memories.\nAdvertisement\n“Being with the national team always helps me,” Navas told The Athletic in November. “When you are in a work atmosphere where things are not so good, where things are happening that you do not like, where really you are no longer someone important, then you can move to something completely different. Going with the national team always renews your energy, and makes me happy again. Then you have a different mentality afterwards.”\nIt was not ideal that Costa Rica’s warm-up friendly in Iraq the week before the tournament was cancelled at short notice. It meant that before their Group E opener against Spain, Navas’ last competitive game of any kind had been his clean sheet in the play-off against New Zealand the previous June.\nThe 7-0 defeat to Spain was not a good look for either the team or their keeper. There were no clangers but he did not look sharp, especially when part of a collective defensive muddle that allowed Ferran Torres to score Spain’s fourth goal shortly after half-time.\nBut Navas made two important late saves as Costa Rica bounced back with a 1-0 win over Japan in their second game. They also battled well in a helter-skelter 4-2 defeat to Germany in their final group game.\nCountry and keeper had regained some pride despite the early tournament exit, but the general impression did not really help Navas’ case in promoting himself to other potentially interested clubs during the January market.\nThere were press reports that Bayern Munich considered him as a short-term option to cover Manuel Neuer’s injury. More serious interest came from Fenerbahce, and Navas was willing to consider a move to Turkey, as his main priority now was to play regularly.\nBut the finances remained a sticking point. A stubborn character who is well aware of his own worth, and stung by how he had been treated over the last 18 months by PSG’s hierarchy, Navas was not about to back down. PSG were also reluctant to let him leave for nothing.\nAdvertisement\nForest entered the frame when their goalkeeper Dean Henderson injured his thigh against Leicester City on January 14. An agreement over personal terms was reached with the Navas camp, but there still remained the impasse with the PSG hierarchy.\nNavas did play two games in January as Galtier rotated his squad for early-round Coupe de France games. But it was in nobody’s benefit for him to spend the rest of the season on the bench in Ligue 1 and the Champions League.\nForest’s belief that a deal could be done began to diminish, and those close to Navas were not very optimistic on the penultimate day of the transfer window. However, as deadline day progressed, confidence grew. Navas completed a medical under Forest’s supervision in Paris on Tuesday afternoon.\nA loan move had been raised but that idea ran into problems as PSG already had eight players out on loan, the maximum number permitted under FIFA regulations.\nThe key became Ander Herrera, who had been loaned to Athletic Bilbao last summer as part of last summer’s PSG squad clear-out. That arrangement included a clause to turn the loan into a permanent move, which was always going to happen eventually.\nHerrera becoming a permanent Athletic player meant that Navas was free to join Forest on loan. In theory, Navas will be back for pre-season with the Ligue 1 club next summer, but neither side really wants that to happen. Yet, at least talks over paying off the last 12 months of his contract can be postponed until then. Navas also knows that if Forest are relegated, he will not go down to the Championship with them.\n“We would like to wish Keylor the best of luck for the rest of his season with Nottingham Forest,” said PSG’s press release, which confirmed their relationship was not over but made no comment on how it might continue.\nAs a result, Forest have signed an experienced international goalkeeper to assist in their battle to stay in the Premier League. He has a chance to impress in the next few weeks, and will be confident he can do enough to keep his starting place even when Dean Henderson regains fitness. Having spent much of the last 18 months on the bench at club level, he is eager to show he can still make his mark at the very top level.\nAdvertisement\nNavas also knows that things do not always work out exactly as planned. From Casillas to Courtois to Donnarruma, he has plenty of previous in holding his own while battling for a starting position. He will take it on as he always has, with full commitment and complete determination.\n(Top photo: Xavier Laine/Getty Images)",
  "word_count": 1503,
  "scraped_at": "2026-02-14T01:59:41.725677",
  "_text_extracted": true
}