{
  "article_id": "40a39a7975cf",
  "url": "https://www.anglocelt.ie/2023/03/01/newcastle-chairman-a-sitting-minister-of-saudi-government-us-court-document/",
  "title": "Newcastle chairman  a sitting minister of Saudi government  – US court document",
  "date": "20230302T023000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle chairman 'a sitting minister of Saudi government' – US court document\nBy Jamie Gardner, PA Chief Sports Reporter\nNewcastle chairman Yasir Al Rumayyan is described as “a sitting minister of the Saudi government” in a document submitted to a court in the United States, raising fresh questions over the level of separation between the club’s ownership and the Saudi state.\nSaudi Arabia’s Public Investment Fund (PIF) bought a controlling stake in Newcastle in October 2021, but the deal was only given the green light after the Premier League received “legally-binding assurances” that the Kingdom of Saudi Arabia would not have any control over the club.\nHowever, the PIF is challenging an order to produce documents in a US lawsuit involving the PGA Tour and LIV Golf, arguing the fund itself and its governor Al Rumayyan “are not ordinary third parties”.\nA document filed on Tuesday states: “The order is an extraordinary infringement on the sovereignty of a foreign state that is far from justified here. The PIF and His Excellency Yasir Othman Al Rumayyan are not ordinary third parties subject to basic discovery relevance standards.\n“They are a sovereign instrumentality of the Kingdom of Saudi Arabia and a sitting minister of the Saudi government, and they cannot be compelled to provide testimony and documents in a US proceeding unless their conduct – not LIV’s or anyone else’s – is truly the ‘gravamen’ of the case.”\nThe PIF is chaired by Saudi Crown Prince Mohammed Bin Salman.\nNewcastle have been contacted for comment while the Premier League has declined to comment.\nThe PIF has also declined to comment. It is understood to have given legal undertakings to the Premier League that the fund, and not the Saudi state, has control over Newcastle.\nThe PIF initially withdrew from its takeover bid for the club in July 2020 as a result of an “unforeseeably prolonged process”.\nBut the deal was resurrected, with the Premier League confirming it had approved the takeover on October 7, 2021 and adding: “The Premier League has now received legally binding assurances that the Kingdom of Saudi Arabia will not control Newcastle United Football Club.”\nThe dispute had centred over who would have controlling influence of the club, and should therefore be subject to the league’s owners’ and directors’ test.\nPremier League chief executive Richard Masters told the BBC in November 2021 that if his organisation found evidence there was state involvement in the running of the club “we can remove the consortium as owners of the club”.\nNewcastle have enjoyed a positive campaign under their new owners, with the team in contention for Champions League qualification and having reached their first Wembley final since 1999 in the Carabao Cup.",
  "word_count": 452,
  "scraped_at": "2026-02-14T02:12:28.621389",
  "_text_extracted": true
}