{
  "article_id": "40b5bb753ef8",
  "url": "https://www.nytimes.com/athletic/6732935/2025/10/20/live-coverage-weekly-schedule/",
  "title": "The Athletic weekly live coverage : 2025 World Series , return of the NBA , El Clasico and more",
  "date": "20251020T161500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Whether your passion lies on the gridiron or the pitch, the diamond, hardwood or circuit, The Athletic has the perfect live coverage for you during another action-packed week.\nThe live coverage schedule this week includes a “Monday Night Football” doubleheader, exhilarating UEFA Champions League fixtures, NBA Opening Night, Games 1 and 2 of the 2025 World Series, El Clásico, the Mexico Formula 1 Grand Prix and more.\nAdvertisement\nWith each blog featuring the latest news, play-by-play, reactions, analysis and more, you won’t want to miss a moment of our extensive coverage.\nFeel free to share your views, predictions and more in the comments below. Your responses could be featured in blogs throughout the week, so stay tuned and get involved. You can also get in contact with the team by emailing live@theathletic.com.\nWithout further ado, here is the full live schedule for the week of Oct. 20-26.\nMonday\n“Monday Night Football” – Tampa Bay Buccaneers vs. Detroit Lions and Houston Texans vs. Seattle Seahawks\nThe Buccaneers enter play with the best record in the NFC, traveling to Detroit to face the Lions, who are looking to respond after a tough loss at Kansas City. The Texans are coming off their bye, facing Sam Darnold and a Seahawks team that beat Jacksonville in Week 6.\nOur live coverage begins at 3 p.m. ET, 12 p.m. PT. Check out last week’s “Monday Night Football” blog here.\nALCS Game 7 – Seattle Mariners vs. Toronto Blue Jays\nIt does not get much better than this – one game for all the marbles as the opportunity to represent the AL in the 2025 World Series hangs in the balance as Toronto hosts Seattle.\nCoverage begins at 3 p.m. ET, 12 p.m. PT.\nTuesday\nUEFA Champions League – Arsenal vs. Atletico Madrid\nArsenal, the Premier League leaders, travel to Metropolitano to face Atletico Madrid on Matchday 3 of the league phase. The Gunners are undefeated in the Champions League this season with victories over Athletic Club and Olympiacos, while Atleti lost to Liverpool but bounced back with a win against Frankfurt.\nCoverage begins at 10 a.m. ET, 3 p.m. BST.\nNBA Opening Night – Houston Rockets vs. Oklahoma City Thunder\nThe defending NBA champion Thunder take on one of their biggest adversaries in the Western Conference, as OKC will raise a banner before facing Kevin Durant and the Rockets.\nCoverage begins at 3 p.m. ET, 12 p.m. PT.\nAdvertisement\nNBA Opening Night – Golden State Warriors vs. Los Angeles Lakers\nEven without LeBron James suiting up, the stars will be out in Hollywood with Stephen Curry, Jimmy Butler, Draymond Green and Luka Dončić all in action as the Lakers host the Warriors.\nCoverage begins at 5 p.m. ET, 2 p.m. PT.\nWednesday\nUEFA Champions League – Real Madrid vs. Juventus\nAfter being bounced by Arsenal in last year’s Champions League campaign, Real Madrid is off to a strong start in the league phase with wins over Marseille and Kairat Almaty. Juventus are in need of a win, having drawn against both Dortmund and Villarreal.\nCoverage begins at 10 a.m. ET, 3 p.m. BST.\nThursday\n“Thursday Night Football” – Minnesota Vikings vs. Los Angeles Chargers\nBoth squads are coming off frustrating losses in Week 7 and are looking to get back in the win column. Minnesota was unable to knock off Philadelphia, while Los Angeles was blown out by Indianapolis. Now, the Vikings travel to Los Angeles to challenge the Chargers as the Week 8 slate begins.\nCoverage begins at 3 p.m. ET, 12 p.m. PT.\nFriday\n2025 World Series Game 1 – Los Angeles Dodgers vs. Seattle Mariners/Toronto Blue Jays\nAnother grueling MLB season is winding to a close, but first, the 2025 World Series champ must be named with the Dodgers looking to run it back. The Mariners have not won a title in franchise history while the Blue Jays last championship came in 1993.\nCoverage begins at 3 p.m. ET, 12 p.m. PT. Check out last year’s World Series coverage here.\nSaturday\nFormula 1 – Mexico F1, FP3 & Qualifying\nGet the latest updates from qualifying and final practice ahead of Sunday’s Mexico F1 Grand Prix from Autódromo Hermanos Rodríguez.\nCoverage begins at 9 a.m. ET.\n2025 World Series Game 2 – Los Angeles Dodgers vs. Seattle Mariners/Toronto Blue Jays\nCoverage begins at 3 p.m. ET, 12 p.m. PT.\nSunday\nNFL news and scores\nWant to stay updated with all the latest news around the NFL in real time from our team of reporters across the league? This catch-all blog will be live from before kickoff of the 1 p.m. ET slate through “Sunday Night Football.”\nCoverage begins at 10 a.m. ET, 7 a.m. PT.\nAdvertisement\nReal Madrid vs. Barcelona\nA matchup so epic it has earned the moniker “El Clásico.” Real Madrid vs. Barcelona features the game’s biggest stars, Kylian Mbappé, Lamine Yamal, Vinícius Júnior and more, on the historic pitch at Camp Nou.\nCoverage begins at 5 a.m. ET, 10 a.m. BST.\nMexico F1 Grand Prix\nSitting more than a mile above sea level, the Autódromo Hermanos Rodríguez in Mexico City is one of the most unique venues in Formula 1, featuring the vaunted Peraltada corner, which now includes a trip through a former baseball stadium. Oscar Piastri maintains a 40-point world championship lead as Max Verstappen and the field look to gain ground.\nCoverage begins at 10 a.m. ET, 3 p.m. BST.\n“Sunday Night Football” – Green Bay Packers vs. Pittsburgh Steelers\nBack-to-back prime-time games for the Steelers, hosting the Packers at Acrisure Stadium as Aaron Rodgers faces his former team for the first time since being traded in April of 2023.\nCoverage begins at 3 p.m. ET, 12 p.m. PT.",
  "word_count": 951,
  "scraped_at": "2026-02-14T02:26:56.609716",
  "_text_extracted": true
}