{
  "article_id": "40c864e8dffa",
  "url": "https://www.thecable.ng/shut-your-mouth-nicholas-jackson-hits-critic-mikel-obi-after-chelsea-big-win/",
  "title": "  Shut your mouth  -- Nicholas Jackson hits critic Mikel Obi after Chelsea big EPL win",
  "date": "20240825T221500Z",
  "domain": "thecable.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nicholas Jackson, the Chelsea striker, delivered a brutal response to the criticism from Mikel Obi, former Super Eagles player, following his brilliant display in his club 6-2 win over Wolverhampton Wanderers in their English Premier League (EPL) clash on Sunday.\nJackson, former Villarreal striker, was responding to Obi’s verbal attack in the aftermath of Chelsea’s opening weekend 2-0 loss to Manchester City.\nMikel, the EPL and UEFA Champions League winner with Chelsea, had tackled Jackson for failing to convert gilt-edged chances during their last game against City.\nThe Nigerian also advised the club to ditch the striker for a top-class goalscorer.\nAdvertisement\n“You need a striker who knows how to hit a ball in the back of the net and that’s what we don’t have in Jackson,” Mikel said.\n“I know I talk so much about him and sometimes I sound like I disrespect him. I don’t disrespect him. I think at Chelsea Football Club we need a top striker who can get us a goal.”\nJackson responded to the criticism by netting Chelsea’s fastest EPL goal since 1997 in the second minute. He also provided an assist for Cole Palmer as the Blues claimed their first win of the season.\nAdvertisement\nThe 23-year-old further took a swipe at the former Super Eagles captain after the match on Instagram.\n“@mikel_john_obi shut your mouth don’t talk shit. We are killing ourself for Africa,” he wrote.\nJackson has been inconsistent in his performances since joining Chelsea for £32 million last summer.\nHe has played 45 matches and contributed 17 goals and six assists before today’s game.\nAdvertisement",
  "word_count": 265,
  "scraped_at": "2026-02-14T01:51:48.870328",
  "_text_extracted": true
}