{
  "article_id": "40cb845ad279",
  "url": "https://www.90min.com/posts/exclusive-al-ittihad-al-nassr-working-sign-raphael-varane-man-utd",
  "title": "Exclusive : Al Ittihad and Al Nassr working to sign Raphael Varane from Man Utd",
  "date": "20240223T174500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Exclusive: Al Ittihad and Al Nassr working to sign Raphael Varane from Man Utd\n- Raphael Varane's Man Utd contract expires at end of season\n- Defender could stay at Old Trafford on reduced terms but no agreement on new deal\n- Al Ittihad and Al Nassr among Saudi Pro League sides interested in Varane\nBy Ben Jacobs\nManchester United defender Raphael Varane is a top Saudi transfer target this summer with both Al Ittihad and Al Nassr currently working on offers, 90min understands.\nVarane's contract at United expires at the end of the 2023/24 season, though the club have not ruled out an extension on reduced terms, similar to last summer's ultimately unsuccessful attempts to keep David de Gea. The defender is hoping to avoid a situation like this one, where it was unclear whether the Spanish goalkeeper would receive a new contract offer after his initial deal expired.\nInterest in Varane is building from the Saudi Pro League. Al Ittihad's interest is the most advanced and they are preparing a package worth close to €30m-per-season, with other earning opportunities on top. They have already made verbal contact with Varane's camp to outline the terms.\nAl Shabab have also discussed Varane internally, but it will be difficult for a non-PIF controlled club to enter the race. PIF have controlling stakes in Al Ittihad, Al Nassr, Al Ahli and Al Hilal.\nBoth Al Ittihad and Al Nassr are hoping to secure Varane on a three-year contract should they proceed with attempts to sign him. As with N'Golo Kante's move to Al Ittihad, centralised dealmakers will likely determine the final club rather than allowing too much of a head-to-head.\nAl Nassr thought they had secured Kante last summer, only to be told to back off since Ministry officials wanted Kante to play at the FIFA Club World Cup and the ex-Chelsea midfielder had no firm preference.\nVarane is yet to give Saudi dealmakers any response or green light, but United football director John Murtough already informed Al Ittihad during the Club World Cup that the defender was not close to agreeing new terms at Old Trafford.\n90min Man Utd WhatsApp channel\nLooking to keep up to date with everything happening at Old Trafford? Click this link or scan the QR code below to follow 90min's Man Utd WhatsApp channel and turn on notifications to receive all the latest news!\n30-year-old Varane has had inconsistent game time this season, but has started six of the last seven Premier League games and appears to have put a difficult end to 2023 behind him.\nSir Jim Ratcliffe wants to reduce United's wage bill, while Dan Ashworth said at his interview for United's sporting director vacancy that the average squad age needs to come down by around one-and-a-half years over the next three summer windows. INEOS have an initial five-window (three summer, two January) plan to transform United.\n\"It's not a ten-year plan,\" Ratcliffe said recently. \"The fans would run out of patience if it was a ten-year plan. But it's certainly a three-year plan to get there.\n\"To think that we're going to be playing football as good as Manchester City played against Real Madrid last season [in the Champions League semi-finals] by next year is not sensible. And if we give people false expectations, then they will get disappointed.\"\nVarane has said in the past he wants to end his career at United, Real Madrid or his first senior club Lens. But a return to Madrid is out of the question, and while Lens sources indicate they are open to bringing Varane back, it may be contingent, financially-speaking, on qualifying for Europe. The French side are currently sixth in Ligue 1 and only three points adrift of an automatic Champions League qualification spot.\nVarane is willing to reduce his wage for the right suitor, and thus has not yet ruled out staying at United. Prior to making any final decision, he is hopeful of having a direct conversation with Ratcliffe and Sir Dave Brailsford.\nSources close to the player also indicate the future of Erik ten Hag won't necessarily influence his decision despite reports of a rift, which was denied by the United boss in November.\n\"It's rumours,\" said Ten Hag at the time. \"[Varane is a] very important player, but there's internal competition and there should be at a top club, as we are.\"\nSaudi dealmakers have had Varane on their list of top targets since summer 2023, and there has been optimism for the past six months - long before it was clear Ratcliffe was incoming - that the former France international might be the latest player to join the Saudi Pro League revolution.\nAs it stands, Varane is free to agree a pre-contract with a Saudi club, much the same with Liverpool's Thiago Alcantara, who is being tracked by several Saudi sides, including Steven Gerrard's Al Ettifaq.\nVarane does have a one-year extension in his current deal, but this has not been triggered by United to date. This is also the case with Anthony Martial.\nFrom a purely financial perspective, United would welcome clearing £13m-per-season off the books as opposed to extending his existing deal with a view to then keeping him or getting a fee in addition to getting off that wage.\nIt's a fluid situation because Ratcliffe and his team haven't yet had a chance to assess Varane's future, and that's partly why Saudi dealmakers are moving now in order to offer stability. United, on the other hand, may need a little more time before they can offer Varane clarity.",
  "word_count": 932,
  "scraped_at": "2026-02-14T01:56:44.620697",
  "_text_extracted": true
}