{
  "article_id": "40d5a1973e3b",
  "url": "https://theathletic.com/4593912/2023/06/15/premier-league-attendances-compared/",
  "title": "Revealed : How every Premier League club attendances compare historically",
  "date": "20230615T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Footballers called Ian. All-English line ups. Shirts sponsored by tool companies. A lot of things that were common in the Premier League’s early years are now extinct.\n(For the record, there were 16 Ians and 2 Iains in 1992-93 but none in 2022-23. Aston Villa fielded the league’s last all-English line-up in February 1999. Southampton’s deal with Draper Tools ended in 1993.)\nAdvertisement\nThere’s something else that was once very widespread if you watch footage from 25-30 years ago that has almost vanished: empty seats.\nChelsea once attracted only 8,923 for a game against Coventry City in May 1994 but Stamford Bridge is now bursting at the seams. It is now extremely hard to get tickets for any Premier League game at Anfield but as late as Gerard Houllier’s final season — 2003-04 — you could still buy a general ticket on the day of the game. Manchester United have gone a decade without a league title, and Old Trafford is in urgent need of refurbishment, but it still sells out every week.\nCompare all 50 clubs to have played in the Premier League (and soon-to-be-members Luton Town) here:\nFootball in England has rarely been so popular. At their Annual General Meeting on Wednesday, the Premier League confirmed that the average attendance for the 2022-23 season was a record 40,267, the first time it had passed the 40,000 mark, despite the division having a handful of stadiums far smaller than that.\nThere was a fear that the increased availability of football on TV, combined with high ticket prices and a bleak economic decade for the UK, would encourage people to stay at home. But the opposite seems to be true and Premier League stadiums are now almost always full or very close to it.\nFootball has become more inclusive since the troubled days of hooliganism in the 1980s — a decade when many clubs slipped to their lowest ebb in terms of spectators — and the sport is now more popular than in living memory, perhaps since the boom that followed the Second World War.\nThere is a clear turning point in the attendance figures around 1996 when an England replete with refurbished all-seater stadiums hosted the European Championship and subsequently reached the semi-finals, fully reconnecting football with mainstream culture — a process that had begun during the 1990 World Cup.\nAdvertisement\nThat wave of new stadia construction and/or renovation, initiated by the recommendations of the Taylor Report in 1990 but which, by the 21st century, was more about maximising matchday revenue, has also helped. As the chart at the bottom of this article shows, clubs such as Arsenal, Brighton, Leicester, Liverpool, Manchester City, Manchester United, Tottenham and West Ham are all playing in front of more people than ever before.\nPrecisely quantifying the Premier League boom is surprisingly hard. This article discounts the effects of the COVID-19 pandemic which resulted in empty or significantly empty stadiums from June 2020 until August 2021, while COVID-19-related disruption in the winter of 2021-2022 meant some stadiums were unusually empty despite tickets being sold as usual.\nWe do have the raw attendance number for every Premier League match, though these are contestable — clubs generally count tickets sold rather than the people who have actually passed through the turnstiles.\nA useful metric is the percentage of a stadium filled, but this is also tricky to pin down historically.\nAway allocations in the Premier League, generally around 3,000, are not always filled — though there are far more travelling fans than any other league in the world bar Germany (helped by England’s relatively navigable geography).\nIn every ground, most seats are reserved for season ticket holders and a minority are sold game by game. For bigger clubs, fans wanting these seats must buy a membership to be in with even a chance of attending — “general sale” rarely exists these days.\nThe figures we do have suggest that empty seats are a rare thing. The percentage of Premier League seats occupied in each game is almost always north of 95 per cent, a figure which passes the eyeball test (though you may well still see lots of empty seats just before half-time as fans disappear to refuel, or when the home side goes 5-0 down). The Premier League revealed that stadiums were at 98.7 per cent of capacity in 2022-23, up from 97.7 per cent in the previous season.\nAdvertisement\nWe will tell the all-time attendance story of the 10 clubs who have spent the longest time in the Premier League. That’s ever-presents Manchester United, Liverpool, Arsenal, Tottenham, Chelsea and Everton as well as four others — Manchester City, West Ham, Newcastle and Aston Villa.\nWe’ll also pick out a few others that are interesting, and we’ve included Luton Town in the charts. They were a club that voted for the Premier League in 1992 but never got to play in it. Until next season, that is.\nManchester United\nLet’s start with the Premier League’s most successful club (for now) which has comfortably the biggest stadium in English club football — there are 76,000 seats in Old Trafford which are invariably occupied.\nIt’s fair to say that United are the most consistently supported club in English football, recording their first five-figure average attendance in 1902-03 and then hitting impressive peaks in the late 1940s, 1950s and 1960s. They were also one of the few clubs not to see a significant decline in support during the 1980s. Between 1979-80 and 1989-90, United’s average attendance was higher than 40,000 in eight of 11 seasons, a trend no other club could match.\nThe Premier League’s first season in 1992-93 ended with Manchester United’s first title in 26 years. Even so, they had some surprisingly low attendances that year but this was not due to lack of demand.\nThe Taylor Report which followed the Hillsborough disaster in 1989 compelled clubs to have all-seater stadiums rather than the standing terraces which had characterised so many English grounds.\nIn the subsequent rebuild, Old Trafford’s capacity fell from 56,000 to 44,000 and large parts of the stadium were a building site for the first half of the Premier League’s inaugural season — just 29,736 watched a 1-0 win over Crystal Palace on September 2.\nBy the following season, the ground could fit 44,000 and was always full, remaining so through multiple expansions, which did again mean some spells of reduced capacity — just 31,966 saw a 2-1 win over West Ham in August 1995.\nAdvertisement\nThe capacity settled at 56,000 in 1996 and then increased to 76,000 in 2007. Throughout all that time the stadium has been full — you would will be hard-pressed to spot a single empty seat at Old Trafford in the background of a grainy YouTube video for a Premier League game.\nThough this does include a period of sustained dominance, United have continued their excellent attendance record over the rather less glorious last decade.\nEmpty seats at Old Trafford certainly exist — just 50,000 watched a 1-0 win over Astana in the 2019-20 Europa League campaign in which none of the group games were sold out amid a dreadful start to the league campaign under Ole Gunnar Solskjaer — though were always sold out in the league.\nThis season though, United managed full houses in cup competitions including against unglamorous opponents like Charlton Athletic and Omonia Nicosia. Fair play.\nLiverpool\nLiverpool owe their very existence to the ground they play in. Everton were Anfield’s original tenants but left for Goodison Park in 1892 because of a rent dispute.\nAfter recording two four-figure average attendance figures in their first three seasons in the Football League, Liverpool’s steady progress towards becoming one of the country’s most successful clubs is reflected in their support, which expanded with their trophy cabinet. In their 1970s heyday, Liverpool were getting almost 50,000 fans through the turnstiles, though this fell away in the 1980s, with only around 32,000 attending games on average in 1983-84.\nLike their great rivals Manchester United, Liverpool also had some low attendance numbers in the early 1990s.\nGetting the stadium ready for the all-seater world cannot explain all this — while 44,000 watched a 1-0 win against rivals Everton in March 1992, just 30,000 saw the visit of Queens Park Rangers a few weeks earlier.\nAdvertisement\nQPR were clearly not a big draw in the early 1990s — just 24,561 watched a thrilling 3-2 Liverpool win on a Wednesday night in December 1993.\nWhen Jan Molby converts a late penalty, banks of empty seats are visible in the home end behind the goal to the right. Even in that era of far lower attendances, though, Anfield was full most weeks.\nWhile getting a ticket at Anfield is a nightmare these days, you don’t have to go back three decades to see a time when it was far easier.\nThe attendance was barely 35,000 for two clashes against Portsmouth in 2004 while just 35,400 saw a 2-1 win over Bolton on New Year’s Day 2011.\nProud Liverpool fans can point to some mitigating circumstances for that game in the early days of the Fenway Sports Group ownership — fans were voting with their feet after a disastrous start to the season saw Roy Hodgson’s side hovering above the relegation zone.\nIt’s important to point out that individual match quirks from years ago are exceptions to the rule. Anfield tickets are now like gold dust and even a League Cup game against third-tier Derby County sold out last season despite Liverpool being a bad run of league form.\nThe 1990s and 2000s were a relatively poor era for the six-time European champions, but with the club’s recent resurgence under Jurgen Klopp demand for Liverpool tickets is off the charts at a club with a huge global fanbase.\nA new Anfield Road stand will be ready for the 2023-24 season, raising the capacity from 54,000 to 61,000. Anfield keeps expanding but still cannot keep up with demand. More people will see Liverpool play next season than ever before.\nArsenal\n“What impressed me most was just how much most of the men around me hated, really hated, being there,” says Nick Hornby in his football memoir Fever Pitch, published in 1992, the year the Premier League was born.\nAdvertisement\n“As far as I could tell, nobody seemed to enjoy, in the way that I understood the word, anything that happened during the entire afternoon.”\nHornby was describing an Arsenal side mired in a long slump, ended by George Graham in the late 1980s. Arsenal stuttered when the Premier League era began but they soon became a thrilling side, winning three titles either side of the new millennium under Arsene Wenger, who was appointed in October 1996.\nHistorically Arsenal played in three different grounds in south London before moving across the river to Highbury in 1913. One of the best-supported clubs in the country, Arsenal saw their average attendance dip below 30,000 only once between 1930 and 1979, before succumbing to the national downward trend in support during the 1980s.\nLike so many other clubs in the early 1990s, Arsenal had to adapt to the all-seater rules by rebuilding Highbury, which meant some unusually low attendances in the league’s first season.\nHighbury’s all-seater capacity was nudged up from 29,000 to 38,000 through the early 1990s and was usually sold out, though there were often several thousand empty seats for some less glamorous fixtures, particularly on weekday evenings. For example, just 27,213 watched a 1-1 draw with Southampton in January 1995.\nBut the average attendance graph from 1996 when Wenger arrived until 2006 when Arsenal moved to the Emirates is a horizontal line — there was never a spare seat in the house.\nThe 60,000-seat Emirates Stadium, a short walk from Highbury, has virtually always been completely full.\nThere are some exceptions when the team’s on-field fortunes declined towards the end of the Wenger era (he left in 2018).\nAn April 2016 win over West Brom during a relatively poor run of form coincided with a late change to a Thursday-night scheduling, leading to many season ticket holders staying home.\nAdvertisement\nDespite an official attendance of 59,568, there were visibly thousands of empty seats, demonstrating how official numbers are not always accurate.\nThe same thing happened in a 3-0 win over Stoke two years later.\nBut, like Liverpool, these unusual examples should not detract from the big picture — an empty seat in the league at Arsenal’s huge stadium is a rare thing.\nChelsea\nFans of rival clubs sometimes sing that Chelsea have “no history” but they had the best attendances in the country either side of the First World War (though it’s worth taking figures from then with a pinch of salt). According to some estimates, 100,000 people filled Stamford Bridge for a friendly against Dynamo Moscow in 1945.\nAlthough a younger club (founded in 1905) than most of their rivals, Chelsea have historically had consistent support, both in west London and in towns on the edge of the capital. They have also never recorded a four-figure average attendance for league games in their existence.\nThe start of the Premier League era was a patchy one, though. Cars parked around the edge of the pitch could be spotted deep into the Premier League era alongside an awful lot of empty seats.\nIndeed, Chelsea have the dubious honour of being the only one of the ‘Big Six’ clubs to have a Premier League attendance in four figures: just 8,923 saw Chelsea lose 2-1 at home to Coventry in May 1994.\nThough Chelsea are ever-present in the Premier League, they spent much of the 1970s and 1980s in the second division, an era marred by a reputation for hooliganism and one when owner Ken Bates suggested installing an electric fence to deter pitch invaders — a far cry from the club’s glitzy modern status in one of the wealthiest districts of a global city.\nThe club did not hit an average Premier League attendance of 20,000 until the mid-1990s, which was an inflection point for so many teams. This uptick coincided with Chelsea improving on the pitch, finishing in the top four three times before Roman Abramovich’s arrival helped them win their second league title ever and the first of five Premier League trophies.\nAdvertisement\nThe average attendances flatlined at full capacity every week. Stamford Bridge is far smaller than the homes of Chelsea’s ‘Big Six’ rivals, but expanding or relocating is tricky as land in west London is very expensive and in short supply.\nEmpty seats at Stamford Bridge have long been non-existent, although there is a curious dip during the 2021-22 season.\n“Just like the old days, there’s no one in here,” Arsenal fans sang, as they won 4-2 in a Stamford Bridge amid swathes of blue.\nThis was not because of apathy — Chelsea were briefly restricted from selling tickets to non-season ticket holders because of the sanctions placed on Abramovich by the British government because of his links to Russia’s invasion of Ukraine.\nOne recent game — a 2-0 home defeat against Brentford — saw a dip below the 40,000 mark. That was because of a vicious cocktail of dreadful form, a weeknight kick-off and the title decider between Liverpool and Man City being played at the same time.\nThis was a very rare exception though — Stamford Bridge is one of the hardest places to get tickets in world football and a new stadium can’t come soon enough.\nTottenham Hotspur\nWhite Hart Lane was much loved by Spurs fans but, by the time supporters said goodbye in 2017, the club had long outgrown the 36,000-seater stadium, which had been packed every week for years.\nSpurs’ attendance history is testament to the fact that football fans of all generations enjoy a successful team. Before the current era, Tottenham’s highest average attendances were 55,509 in 1950-51 and 53,124 in 1960-61. What links those two campaigns? They are the only occasions Spurs have been crowned league champions.\nLike many clubs, the adjustment to all-seater regulations in the early 1990s was disruptive for Tottenham and White Hart Lane was a building site in the Premier League’s first couple of years, when empty seats were fairly common.\nAdvertisement\nJust 20,098 saw a 4-2 win over Southampton in February 1993 despite attendances as high as 33,000 that season. The following season the club clocked sub-18,000 attendances in games against Wimbledon and Aston Villa.\nAfter England’s summer of football in 1996, crowds barely dipped below 25,000. Then, after the millennium, White Hart Lane was invariably full for every single league game, something that coincided with the start of the club’s gradual and sustained rise up the table.\nBefore moving to the Tottenham Hotspur Stadium in 2019, Spurs had a brief stint at the national stadium 12 miles away in Wembley.\nUnderstandably, given its vast capacity, there were often empty seats, but Spurs did set a Premier League record attendance of 83,222 for a 1-0 win over Arsenal in February 2018. Attendances at Wembley did not dip below 52,000 that season, demonstrating the need to leave White Hart Lane.\nEnthusiasm waned the following year when the new stadium was delayed and fans tired of the journey to Wembley, which was further away for most. Just 29,164 saw a 2-1 win over Watford on a freezing night in January 2019.\nIts replacement, the Tottenham Hotspur Stadium, has a capacity 62,850 and is widely regarded as one of the best venues in the world. It hosts NFL games and concerts as well as Spurs matches.\nThe ground has been full virtually every week in the league since its creation, although it did have a few thousand empty seats a few times in 2021-22, the club’s first full season in the new stadium without COVID-19 restrictions.\nIn 2022-23 though, the huge stadium was sold out every week in the league despite Spurs’ worst season in 15 years. Impressive stuff.\nManchester City\nManchester City have been England’s most successful club over the past decade but it wasn’t always this way. City played in the third tier in 1998-99 and were in the second tier for four seasons between 1996 and 2002.\nAdvertisement\nCity may not have the global support of clubs like Manchester United, Liverpool and Arsenal but they have always had a very committed local fanbase which, in attendance terms, compares very well to most football clubs in England.\nThe capacity of Maine Road fluctuated in the first half of the 1990s as the stadium was repeatedly renovated to meet the league’s all-seater requirements, making it hard to determine the ground’s exact capacity on various dates, but it was generally full at around 30,000 — a sub-20,000 gate against Wimbledon (who else) in April 1993 was a rare aberration.\nLike at other clubs, attendances grew steadily through the 1990s and — as City fans like to point out — filled Maine Road every week in that one season in the third division. City averaged more than 28,000 fans that season, a higher figure than many top-flight teams have ever recorded.\nIn 2003 City moved from Maine Road to the City of Manchester Stadium with a capacity of 48,000. The club’s fans did typically well at filling out the new stadium in the years after this, despite rarely troubling the upper reaches of the Premier League.\nBut in 2008 everything changed when City were taken over by Sheikh Mansour of Abu Dhabi, winning their first Premier League title four years later. The new regime added 7,000 seats to the stadium in 2015 and a similar number will be added by 2025, taking the capacity of what is now called the Etihad Stadium above 60,000.\nDespite recent successes, the club undoubtedly has a smaller fanbase than the likes of Manchester United and Liverpool and the cruel ‘Emptihad’ tag has often been accurate in cup games, where banks of empty seats are a common sight.\nA point of mitigation for City fans is that their team routinely goes deep into four competitions meaning far more games in a season than most clubs — an FA Cup semi-final against Sheffield United at Wembley in April saw tens of thousands of seats go unsold in both ends of the ground.\nAdvertisement\nBut in the Premier League, the Emptihad tag is not fair — the stadium is generally completely full or extremely close to it.\nAston Villa\nAston Villa are unusual in that the capacity of the ground has remained virtually constant despite lots of renovation work — capacity was 40,000 in 1994 and rose to 42,000 six years later. This makes it relatively easy to compare attendances over time.\nOne of the best Villa teams in recent memory coincided with the birth of the Premier League — in the competition’s first half-decade, Villa came second, fourth and fifth and won the League Cup twice. However, attendances averaged below 30,000 for the first four seasons before climbing higher in the late 1990s like they did for many clubs — that broader trend overriding Villa’s declining fortunes.\nVilla Park was packed every week during an excellent run under Martin O’Neill between 2007-08 and 2009-10 when the club finished sixth in three successive seasons, but either side of this purple patch league performances were less good — and so were the crowds.\nWhile you generally couldn’t get a ticket for the visits of the biggest clubs or for Midlands derbies, for games against less storied opposition empty seats were a common sight.\nAttendances fell again during the club’s slow decline, leading up to 2015-16 when Villa came bottom and were relegated. Attendances in the low-to-mid 30,000s became common, occasionally dropping even lower — like the 25,311 who saw a 1-1 draw with Southampton on a Monday night in November 2014.\nBut like so many aspects of the Premier League attendance story, things at Villa Park have got much better.\nThe famous old stadium has seen a full house at every single fixture in the league since the team was promoted back to the Premier League in 2019.\nThe club is now looking to expand the stadium from 42,000 to 50,000 by demolishing and rebuilding the North Stand in time to be a host venue for Euro 2028, and there is a long waiting list for season tickets.\nAdvertisement\nWith the club in a better place on and off the pitch than for many years, getting a ticket to watch Aston Villa is now harder than it has been in living memory.\nNewcastle United\n“Where were you when you were shit?” is commonly sung — often unfairly — at fans of teams like Chelsea and Manchester City who have got much better since big-money takeovers.\nFor Newcastle though, bought by Saudi Arabia’s Public Investment Fund in 2021, the chant has no relevance at all.\nNewcastle is a rare one-team city and the club has had remarkably strong attendances in the Premier League era despite often not being particularly good.\nEven in 1993-94, a low point for many clubs attendance-wise, newly promoted Newcastle generally reached their stadium’s 36,000 capacity after it was renovated for the all-seater age. Any margin under St James’ Park’s capacity in that season was accounted for by an absence of away fans.\nFrom the mid-1990s, Newcastle sold out every week, which was unusual in the Premier League at that time. This was no doubt helped by a thrilling side under Kevin Keegan which came second in the league twice.\nSt James’ Park’s capacity grew to 52,305 in 2001 and has been virtually full ever since, the only major dip coming in 2009-10 when the club dropped into the second tier for one season but still averaged a hugely impressive average attendance of 43,388.\nRemarkably, Newcastle were relegated again five years later but this is almost imperceptible on the chart — Newcastle packed out St James’ Park every week as the team won the second division under manager Rafael Benitez in 2017.\nAfter that promotion Newcastle were often uninspiring under the hated ownership of Mike Ashley, hovering above the relegation zone and playing unexciting football, yet still packed out St James’ Park. There is an interesting caveat in the 2019-20 season, though, not included in our charts because the last third of the season was played behind closed doors due to the COVID-19 pandemic.\nAdvertisement\nAfter Rafa Benitez departed that summer, replaced by the unpopular Steve Bruce, fans began to boycott St James’ Park in protest against Ashley. For once there were empty seats at St James’ Park with attendances regularly in the low 40,000s, the nadir being 42,303 who saw a win over Southampton in December 2019 — albeit still far higher than most clubs’ average.\nUnder the current regime, Newcastle are flying, finishing fourth last season and achieving Champions League football for the first time in two decades.\nGetting a ticket is harder than it has ever been — but let’s be fair here, most fans genuinely were there when they were shit.\nWest Ham United\nWhich team had the second-highest attendance in English club football during 2022-23?\nThe answer might surprise you — it’s the Europa Conference League champions West Ham United, narrowly ahead of London rivals Arsenal and Tottenham.\nThe London Stadium has been the subject of a lot of criticism since it was converted from an athletics stadium built for the 2012 Olympics.\nWest Ham moved in in 2016 after saying goodbye to the shabby but much-loved Upton Park.\nThe figures suggest the move was necessary as — despite a brief dip when West Ham were relegated for the 2011-12 season — Upton Park, also known as the Boleyn Ground, was completely full every week.\nHowever, in the 1990s this was not the case. In fact, West Ham averaged below 30,000 in every league campaign between 1973-74 and 2001-02. But equally, you can make the case that West Ham have been the most steadily supported club of all historically, usually averaging somewhere between 19,000 and 30,000 from their arrival in the Football League in 1920-21 through to the 2000s.\nBut West Ham’s average attendance increased by 22,000 instantly for the 2016-17 season when they moved to their new home, though empty seats have often been visible at supposedly full-capacity games. This suggests a disparity between tickets sold and seats filled.\nAdvertisement\nThe London Stadium has also been criticised as a venue for its supposed lack of atmosphere and distance from the pitch, a common complaint about converted athletics stadia.\nMany West Ham fans have joined in with this criticism but this has not translated to an issue with ticket sales, which have been very good in the league.\nLast year the stadium was expanded further. During 2022-23, despite a poor league season in which West Ham narrowly avoided relegation, the club averaged an attendance of 62,462 which puts West Ham in Europe’s top 10. Quite the rise.\nEverton\nEverton neatly demonstrate how the steady rise in football attendances in the last decade or two is a phenomenon that goes beyond the booms and busts of individual club fortunes.\nThe club’s best period of recent times was the mid-1980s when they won the league, FA Cup and Cup Winners’ Cup, though they were denied an attempt at further European glory by the ban on English clubs following the Heysel Stadium disaster in 1985.\nWhen Everton won the league in 1986-87 — a real low point for English football attendances — there were regularly thousands of empty seats despite higher attendances than the less successful years immediately before and after.\nCrowds then were far lower than they have been at Goodison Park over the last few years when the team has been seriously struggling.\nEmpty seats were fairly common in the 1990s and 2000s when Everton generally floated around the mid-to-lower reaches of a league they have never been relegated from in its current guise.\nThe Everton attendance story in that era is similar to Aston Villa’s in a similar-sized stadium — always full for the biggest games but often with a few thousand empty seats when less glamorous opponents come to visit.\nBetween 2005 and 2019, coinciding with English football’s broader boom, Everton finished no lower than 11th and Goodison Park was generally full every week, though often with a couple of thousand left empty for lesser games.\nAdvertisement\nNevertheless, attendances have been very strong and, despite the recent decline during which the club has twice come perilously close to experiencing a first top-flight relegation since 1954, the ground has been completely packed.\nEverton plan to relocate to a new site at Bramley-Moore Dock in time for 2024-25, to a ground that will have a capacity of 52,000 and be a host venue if the UK and Ireland win the bid for the 2028 European Championship. Having become league champions as residents of both Anfield and Goodison Park, Everton fans will hope similar success comes at their third home.\nNot even The Athletic has space to analyse all 51 of these teams, but we should mention the club with the lowest attendance for a single Premier League game.\nWhile many clubs faced major disruption because of the Taylor Report, none were hit harder than Wimbledon. The owners concluded that the dilapidated Plough Lane was beyond converting to all-seater so reached an agreement to ground share with Crystal Palace at Selhurst Park six miles (10km) away. Wimbledon were a club with strong local support but limited appeal beyond that, so struggled badly with attendances when they moved from Merton to Croydon.\nThe club hold the dubious honour of recording all of the Premier League’s 10 worst attendances, the nadir being when 3,039 saw a 3-1 loss to Everton in January 1993.\n“I remember looking at the opposite side of the pitch to the dugouts, it was literally one man and his dog,” Wimbledon midfielder Neal Ardley told the Guardian in 2017. “We used to laugh because the only times we sold out Selhurst Park was when we played the big clubs. There would be 8,000 Wimbledon fans and 18,000 supporting Man United.”\nWith the EFL this week reporting their best attendance numbers for 70 years, and Premier League tickets almost impossible to come by for many clubs, it’s clear we are in the midst of the third great boom in football fandom in England. History shows us that it is extremely unlikely to be a permanent shift; a decline is in the post at some point, so we should enjoy the good times while they are here.\nIf you can get into the ground, that is.\n(Top image design: Sam Richardson, photos: Warren Little/Getty Images, Justin Tallis/AFP via Getty Images)",
  "word_count": 5124,
  "scraped_at": "2026-02-14T01:48:17.233049",
  "_text_extracted": true
}