{
  "article_id": "40f5445d2b59",
  "url": "https://www.myjoyonline.com/big-result-for-slot-and-liverpool-with-no-salah-in-milan/",
  "title": "Big result for Slot and Liverpool with no Salah in Milan",
  "date": "20251210T033000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nWho knows what the narrative would have been had Dominik Szoboszlai not converted from the penalty spot?\nThe noise surrounding Mohamed Salah would only have gotten louder. More dropped points for Liverpool without their star man.\nYet it was Liverpool's player of the season so far who took the responsibility from 12 yards out while the man who would have usually taken the penalty sat at home, almost 1000 miles away.\nThe sight of the players walking over to the away end and the travelling fans singing Arne Slot's name at the full-time whistle told you all you needed to know.\nAfter a horrid few days, Slot and Liverpool finally had something to smile about.\nThis was their fourth win at the San Siro in as many years, but crucially their first away win in the Champions League without Salah since 2009.\nWhether or not it is a turning point for Slot and co remains to be seen but it certainly felt massive. Not least with Michael Edwards, the chief executive, in attendance in Milan.\nOn Monday, goalkeeper Alisson Becker insisted that the players were behind the manager after arguably the toughest spell of his career.\nOn the pitch, they delivered with an assured display after Slot's tactical tweaks and crucially kept a clean sheet following the capitulation at Leeds on Saturday.\nAbove all, the spirit and togetherness after a tumultuous 72 hours was notable. Liverpool travelled to Italy with a depleted 19-man squad and got the job done.\n\"It doesn't change anything. There's obviously so much noise from the outside world, which is normal when you don't perform,\" Virgil van Dijk told Amazon Prime Sport.\n\"It's deserved as well. We want to improve, we want to be consistent and win games. We're not doing it as much as we like. We have to stick together and be a unit as we have been. That's what Liverpool stands for.\nLeft-back Andy Robertson added, \"We all needed it. We know the results and performances aren't good enough. It's important that this club is in the Champions League. It was a huge result for all of us.\"\n'All about the players that are here'\nThe key now is for Liverpool to push on. After a disastrous run of nine defeats in 12, they are unbeaten in their last four and seemingly out of the toughest phase.\nInevitably, Slot was asked about Salah afterwards, with former Dutch international midfielder Clarence Seedorf suggesting to him that players can \"make mistakes\".\n\"Everyone makes mistakes in life, but does the player know he's made a mistake? Should the initiative come from him or me? That's another question,\" said Slot.\nVan Dijk, meanwhile, would not be drawn on whether his team-mate had let the side down.\n\"There is no point in my saying if someone has let someone down,\" he said. \"He didn't travel based on the consequences of what he said. That's it.\n\"He trained yesterday, perfectly normal. Let's see when we come back on Friday and see what the situation will be like. My focus is on the team, and at this point, Mo is still part of the team. We will see what happens.\"\nBut this was a night to praise those who played, particularly Szoboszlai, who has been directly involved in more goals than any other Liverpool player this season (10 – five goals, five assists).\n\"I have asked a lot of him,\" Slot added. \"I think what is also special is how much he runs - he is one of the few who played all four games in 10 days.\n\"It's special what he is doing physically, and also football-wise, he stood up in a difficult moment.\n\"That was his first penalty for Liverpool during a game, but he has a great shot, and he delivered.\"\nWinning in Milan is no easy feat, considering Inter had been unbeaten in their last 18 Champions League ties at home\n\"It should be about what we've done over here,\" added Slot. \"I fully understand that on Friday, in the press conference, all the questions will be about Mo.\n\"Tonight it should be all about a team, against a team like this, who are winning at a stadium like this. The focus should be on that.\n\"Tonight, it should be all about the players that are here. In the rich history Liverpool has had, they have had many of these evenings.\"\nProof, if it was ever needed, that with or without Salah, Liverpool will move on.\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n37 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n55 minutes -\nNLC secures court injunction against striking tertiary unions\n2 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n2 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n3 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n3 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n4 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n5 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n5 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n7 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n7 hours",
  "word_count": 964,
  "scraped_at": "2026-02-14T02:27:05.514272",
  "_text_extracted": true
}