{
  "article_id": "410237c1aba5",
  "url": "https://www.teamtalk.com/news/ruben-amorim-latest-pep-guardiola-reacts-man-utd-pursuit-sends-classy-man-city-message-ten-hag",
  "title": "Ruben Amorim latest : Guardiola reacts to Man Utd pursuit and sends classy Man City message to fired Ten Hag",
  "date": "20241030T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Guardiola reacts to Man Utd pursuit of Amorim and sends classy Man City message to fired Ten Hag\nManchester City boss Pep Guardiola has provided his verdict on Manchester United managerial target Ruben Amorim and sent an open invitation to Erik ten Hag following his departure from Old Trafford.\nMan Utd sacked Ten Hag on Monday, a day after the 2-1 defeat to West Ham United which left them 14th in the Premier League. United have been heavily linked with a number of managers including Thomas Frank, Graham Potter and Eddie Howe, but Sporting CP’s Amorim is the coach they have chosen to guide them back to their former glory.\nUnited have agreed terms with Amorim and are prepared to activate the €10million (£8.3m / $10.8m) release clause in his Sporting contract.\nHowever, the exact date of Amorim’s arrival in England is unclear. United are locked in talks with Sporting as they try to sign his coaching staff, too.\nPlus, United are in negotiations over paying extra cash to waive Amorim’s weeks-long notice period.\nAhead of Man City’s trip to Tottenham Hotspur in the League Cup tonight (Wednesday), Guardiola was quizzed on United’s prospective new manager.\nDON’T MISS: Six Man Utd players who could benefit from Ruben Amorim being appointed as next manager\nRuben Amorim’s Sporting ‘really good’ – Guardiola\nHe said (via the Manchester Evening News): “All I can talk about is the experience of playing twice against Ruben’s Sporting Lisbon team, one or two seasons ago, and the pressure was really, really good.\n“I spoke with Matheus Nunes, and he was his player, and he speaks highly about him. And look this season, he is unbeaten and winning all the games in the Portuguese league, and the Champions League, the same points as us.\n“So a high manager. I hear that Man Utd are thinking about him, it’s because he’s a good manager. Man Utd don’t appoint managers who aren’t that level so the last five, six, seven years, we cannot say they are not able to lead Man Utd.”\nAlthough, Guardiola did warn United that it is not guaranteed Amorim will guide them back to the top of English and world football.\n“What’s going to happen I don’t know, because what happened here in my experience here, doesn’t mean it works for the other ones,” he added. “Everyone is everyone, the manager is the team, the club, the structures, the physios, the doctors, the players, it’s many things.\n“What happened here doesn’t mean it’s going to happen in another place.”\nAfter saying he feels ‘so sorry’ for Ten Hag and backing his former Bayern Munich deputy to ‘come back stronger’, Guardiola offered to spend some time with the Dutchman.\n“We are open to Erik ten Hag visiting us,” he said. “Any time! Seriously! Always we are open, but I think it’s not going to happen.\n“But I know his agent a little bit, so the relation is there, no problem for me, for us.”\nREAD MORE – Erik ten Hag sack: The five lowest points of Dutchman’s troubled tenure at Man Utd\nMan Utd latest: Casualty of Amorim appointment, failed Ten Hag signings\nMeanwhile, Amorim joining United could see another key figure leave Old Trafford after Ten Hag.\nIt has been claimed that interim manager Ruud van Nistelrooy will depart United too, despite only returning to the club over the summer.\nVan Nistelrooy has been touted as a future United manager, though there will be no room for him if Amorim brings all his own staff to the club.\nA separate report from The Athletic has provided insight on which players Ten Hag tried – and failed – to snare for United.\nHe was keen on landing former Ajax stars Ryan Gravenberch and Jurrien Timber.\nHowever, United could not strike deals for the pair, allowing them to head to Liverpool and Arsenal respectively.\nAs a result of these transfer misses, Ten Hag was forced to settle for Mason Mount and Lisandro Martinez.",
  "word_count": 665,
  "scraped_at": "2026-02-14T01:57:46.236521",
  "_text_extracted": true
}