{
  "article_id": "410f6c86de9d",
  "url": "https://allafrica.com/stories/202510210012.html",
  "title": "Kenya Football Community Continue to Mourn Raila Odinga in Solemn Weekend",
  "date": "20251021T081500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NAIROBI, Kenya, October 20, 2025 - The Kenyan football community continued to pay tribute to former Prime Minister Raila Odinga who passed away in India, on Wednesday last week.\nDespite Football Kenya Federation (FKF) postponing league action over the weekend in honour of Odinga, various footballers and other stakeholders continued to pay tribute.\nNairobi United's Ovella Ochieng', who scored in Sunday's 2-0 win over Etoile du Sahel in a Confederations Cup tie on Sunday, dedicated his goal to Odinga, showcasing a jersey number 80 -- the age at which the opposition chief died.\nElsewhere, former Kakamega Homeboyz striker Moses Shummah paid homage to the former Orange Democratic Movement (ODM) leader after scoring for Zambia's Power Dynamos against Uganda's Viper SC in a Caf Champions League tie on Sunday.\nFollow us on WhatsApp | LinkedIn for the latest headlines\nThe Zambian giants won 2-1 to take a huge step towards the group stage of the prestigious competition.\nMeanwhile, in the Romanian women's premier league, players observed a minute of silence in honour of the former PM before the start of the match between Farul Constanta and Gloria Bistrita.\nConstanta is home to Harambee Starlets duo Lilian Awuor and Enez Mango.\nOdinga was renowned for his love for sports, especially football.\nHe was the patron of 21-time Kenya Premier League champions Gor Mahia in addition to having played for Bunge FC -- the National Assembly's football team -- in the past.\nThe former PM was laid to rest in Bondo on Sunday afternoon in a solemn ceremony.",
  "word_count": 255,
  "scraped_at": "2026-02-14T02:12:04.349792",
  "_text_extracted": true
}