{
  "article_id": "413d121b5582",
  "url": "https://www.cityam.com/manchester-united-sign-joshua-zirkzee-from-bologna/",
  "title": "Manchester United sign Joshua Zirkzee from Bologna",
  "date": "20240714T191500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United sign Joshua Zirkzee from Bologna\nManchester United have signed Netherlands international Joshua Zirkzee in what is the first major signing since Ineos owner Sir Jim Ratcliffe purchased a quarter of the club.\nThe Dutch forward has signed with the Manchester club until 2029 from Italian Serie A club Bologna, where he helped them achieve Champions League football.\nHe formerly played for Bayern Munich and had loan spells at Parma and Anderlecht.\nThe 23-year-old was substituted on for Denzel Dumfries in the 93rd minute of England’s semi-final victory over the Netherlands in Euro 2024 last week.\nZirkzee incoming\nZirkzee said: “Having had discussions with the manager and the leaders of the club I know how exciting the future is going to be here and I cannot wait to play my part in achieving success for Manchester United.\n“I am a player who has always dedicated everything to winning; I’m ready for this next challenge, to go to another level in my career and win more trophies.\n“It is a privilege to join such an iconic club. I have to take a short break now after being with the national team, but I’ll be coming back ready to make an impact straight away.”\nOutstanding talent\nNew sporting director of Manchester United, Dan Ashworth, said: “Securing a forward to enhance our already strong group of attacking players was a key aim for this summer. We are delighted that we’ve managed to sign a player of Joshua’s calibre this early in the transfer window.\n“Joshua is an outstanding talent who is ready to make an impact for Manchester United. His ability and desire to grow into a world-class player means that he will be a great addition to the squad that we are building for the exciting season ahead and beyond.\n“Having already achieved a significant amount in his career, we will provide Joshua with the perfect platform to reach the next level under the guidance and support of Erik ten Hag and the coaching staff. We look forward to seeing Joshua thrive at Old Trafford over the coming years.”",
  "word_count": 348,
  "scraped_at": "2026-02-14T02:08:01.877778",
  "_text_extracted": true
}