{
  "article_id": "415380c56a01",
  "url": "https://www.caughtoffside.com/2025/03/05/arsenal-charles-watts-alexander-isak-benjamin-sesko/",
  "title": "Revealed : Arsenal expert names the striker Mikel Arteta  would love to sign  ",
  "date": "20250305T223000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Arsenal navigate the final stretch of the season, aiming for Champions League glory while not giving up their title chase in the Premier League, they will have one eye on the summer transfer window.\nIt has been suggested that the upcoming summer is going to be an important one for the club as they hope to reshape their squad for the future.\nReports have suggested that Arsenal are likely to make a big sale in the summer to boost their transfer budget, with both Leandro Trossard and Gabriel Martinelli named as potential departures. Trossard appears to be the more likely candidate to be cashed in on.\nA new attacker remains high on the club’s priority list after failing to sign one in the January transfer window despite the need amid the injury crisis.\nSeveral strikers have been linked with a move, including Newcastle’s Alexander Isak, Lille’s Jonathan David, and RB Leipzig’s Benjamin Sesko.\nIsak is a player wanted by a number of clubs, including Arsenal, but the Newcastle man will not come cheap. This is why Arsenal expert Charles Watts believes he is not a realistic target for the club despite Arteta’s wish to sign him.\nCharles Watts: Benjamin Sesko more realistic option than Isak\nSpeaking exclusively to CaughtOffside in his Daily Briefing column, Watts named Benjamin Sesko as the more likely option for the club to sign.\nThe club had made a move to sign him last summer, but the player decided to stay with Leipzig for another season.\nWatts said:\n“We know Mikel Arteta would love to sign Alexander Isak, but I just struggle to see how that is realistic this summer.”\n“I don’t see a way that Newcastle let him go for a price that Arsenal could realistically hit. Benjamin Sesko still feels like the most likely option to me when it comes to Arsenal signing an out and out No.9.”\n“The interest they had in Sesko last summer still remains. His decision to stay with Leipzig for another season did not burn any bridges with Arsenal and the money it would take to get him out of Germany means he is a far more realistic option than Isak.”\n“Don’t get me wrong. If it was a straight choice between the two and money wasn’t a factor, then of course it would be Isak all day long. But unfortunately football doesn’t work like that.”\n“Newcastle are in an incredibly strong position with Isak. They don’t need to sell for financial reasons and he still has a long-term contract.”\nSesko’s goalscoring record at RB Leipzig\nSesko has been labeled as the ‘next Erling Haaland’ due to his goal-scoring prowess, as well as his physical attributes, including his strength and speed. He possesses excellent finishing ability and is comfortable with both feet.\nIn 23 games this season, he has scored 10 goals and assisted 4, taking his tally for the club to 35 goals and 7 assists in 76 games.\nWhile Isak would no doubt be the obvious choice between the two given his outstanding form in the Premier League, Sesko would prove to be a great addition given his incredible goal-scoring ability at such a young age.",
  "word_count": 530,
  "scraped_at": "2026-02-14T02:02:35.611553",
  "_text_extracted": true
}