{
  "article_id": "41687a3a480c",
  "url": "https://www.themag.co.uk/2025/11/alexander-isak-is-right-up-there-with-michael-owen-for-me-newcastle-united-fans/",
  "title": "Alexander Isak is right up there with Michael Owen for me … ",
  "date": "20251115T110000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alexander Isak is right up there with Michael Owen for me…\nWe wanted to get a snapshot of how Newcastle United fans are thinking.\nThree months into the season and 17 matches played so far across three competitions.\nNow in the November international break and Newcastle United fans seeing their team win eight games, draw three, lose six.\nThose results summing up a start to the season with plenty of ups and downs.\nPlenty to talk about as we ask a number of Newcastle United fans, who are regular/irregular contributors to The Mag, to give us their views on the season so far, plus what will happen as we move forward.\nFirst up is Davey Hat-Trick answering the questions.\nThree words to describe how you currently feel as a Newcastle fan?\nSomewhat slightly concerned\nThree words to describe Newcastle United now?\nNot quite right\nAlexander Isak – Time to forgive and forget…?\nGiven Woltemade’s start to life in Newcastle – and the fact he’s the coolest of dudes – coupled with Isak’s travails at Liverpool, I’m feeling better about the latter’s exit.\nI am sure he will live to regret his behaviour, not least because going on strike destroyed his fitness.\nI will never forgive him – his actions were reprehensible. All he’d ever received from the fans and his teammates was love, and he spat it back in their faces.\nAlexander Isak is right up there with Michael Owen for me, albeit for different reasons. He’s a rat and I despise him.\nIf you had to choose. A win against Sunderland but lose to Fulham in Carabao Cup quarter-final, or lose to Sunderland and go through to Carabao Cup semi-finals?\nBeat the mackems. Just to keep the idiots down the road quiet.\nWould winning the Carabao Cup again this season BUT finishing outside the Premier League top six, be success or failure?\nBoth. I’d always vote for the highest league placing possible, but a trophy in the cabinet always spells success.\nHand on heart, what is your best estimate (not hope!) of where Newcastle United will end up this season in the Premier League, the Champions League, FA Cup and League Cup, how well they will realistically do in each of them?\nPremier League – 7th\nChampions League – quarter finals\nFA Cup – quarter finals\nLeague Cup – semi finals\nIn order, which six NUFC players have been the most impressive so far this 2025/26 season?\nTonali\nThiaw\nWoltemade\nTrippier\nBotman\nBruno\nIn order, by the end of the 2025/26 season, which six NUFC players do you think will have proved the top performers?\nTonali\nWoltemade\nThiaw\nHall\nLivramento\nBruno\nEight months ago, Eddie Howe banked the first trophy for Newcastle in 56 years, then two months later secured a second Champions League qualification in three years. Some Newcastle fans appear to be questioning his position now. What are your thoughts on Eddie Howe and how much more time has he earned to get the league position sorted and beyond that, or not?\nEddie Howe has plenty of credit in the bank for me.\nThe lads I go to the match with have all been regular Toon attendees for 40 years plus. I first went 60 years ago. None of us have any desire to see Eddie and his team go.\nI suspect a lot of the ‘fans’ wanting him out are recent converts to the cause.\nI’d say he’s got 90% of the job right and that is an elite ratio. If there was someone out there that everyone agreed would be guaranteed to outperform Eddie, then sure, fire him. But that person doesn’t exist.\nAnd it’s not as if we are in dire straits. Three points worse off than at this point last season, and going well in Europe and the League Cup. Get a grip.\nWhat do you think about how the summer transfer window was conducted by Newcastle United?\nI think it went well, especially given the Swedish spanner that was thrown into the works. Thiaw and Woltemade are the obvious hits and Ramsdale has been excellent when he’s played. Wissa is a frustration – he’ll make a difference when he’s fit. I’ve yet to see evidence that Ramsey is an upgrade on Longstaff, Ditto Elanga and Murphy, but I’ll give them more time.\nHow much do you think Newcastle United having no CEO or Sporting Director contributed to the fact NUFC signed only one player (Elanga) who had a proper pre-season?\nWe spent too long chasing strikers that wanted to go elsewhere, then had to find two when Isak had his prolonged tantrum. Whether a CEO or Sporting Director would have done better I cannot say. To be honest, the last Sporting Director was a complete idiot, so probably not.\nIn the future after they have all finished their Newcastle United careers, what is your guesstimate on how the six summer signings will each be assessed. In each case – Thiaw, Ramsdale, Ramsey, Woltemade, Elanga and Wissa to be seen as one of these three choices – A success, Done OK, Failure.\nThey’re all good players. They’ll all be a success in their own ways, if not this season, then next.\nWhat do you see as three positive things for Newcastle United so far this season?\nThiaw, Woltemade, Champions League form.\nWhat do you see as three negative things for Newcastle United so far this season?\nDomestic away form, the Isak saga, still no news on the stadium.\nSunderland are now back in the same division and at this moment ahead of NUFC, your thoughts?\nI have to say they have confounded my expectations. Given that they qualified via the play-offs, I figured they’d be propping up the league by now. But they are doing very very well.\nThey must have a great scouting network – I’d never heard of Mayenda, but he’s doing better than some of our pricier players, Xhaka has been a revelation, and Ballard – who was an absolute liability when we played them in the cup – looks top drawer now. I’d still back us to finish above them in the league but credit where it’s due. The match at the SoS will be TOUGH.\nWhat would represent success in the 2025/26 season for Newcastle United?\nTop six, last eight of the CL. Fifth round of the FA Cup, semi-finals of the Carabao.\nWhat do you see as the minimum to achieve this coming season?\nTop six, qualify for CL play-offs\nPredict the top six in the Premier League (in order) and which three clubs will be relegated.\nArsenal\nMan City\nLiverpool\nChelsea\nSpurs\nmanure\nToon\nWolves\nBurnley\nLeeds\nWith NUFC now having won a trophy…has that changed your priorities at all with the club now balancing getting Champions League football on a regular basis, compared to try and win cups?\nI’d always prioritise Champions League. There’ll always be clubs sniffing round our best players and the best players want to play on the best competitions.\nNext three seasons, would you rather finish top four all three seasons BUT win nothing, or finish mid-table all three seasons AND win the FA Cup in one of the three?\nTop four every time.\nWhat are your thoughts on the fact that we are now more than four years after the takeover and still no plans announced on a new training ground, nor a far bigger capacity stadium (either brand new one, or an increased capacity St James’ Park)?\nEveryone in Newcastle has a mate who has a mate who knows the architect. My mate says that they came up with a plan costing £1.3 billion and were told to upgrade to a £2 billion stadium. I’m not sure I believe anyone who claims inside knowledge but a new or upgraded stadium is a once-in-a-century project, and everything has to be right. It’s frustrating that it’s taking so long, but I get it.\nIf Newcastle United were to look to the transfer market to strengthen the team/squad in January, what do you see as the priority (or priorities…)?\nA proper defensive midfielder to screen the back four.\nWould you say winning the Carabao Cup last season has made you more content, or now more desperate to get the next one?\nContent. Obviously, it’s always nice to win silverware, but I was at Wembley to see history made, and that’ll keep me going for a while.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1418,
  "scraped_at": "2026-02-14T02:09:38.464177",
  "_text_extracted": true
}