{
  "article_id": "4177134e02ae",
  "url": "http://africa.chinadaily.com.cn/a/202403/14/WS65f25392a31082fc043bc960.html",
  "title": "Raya of light to the rescue for Arsenal",
  "date": "20240314T034500Z",
  "domain": "africa.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Raya of light to the rescue for Arsenal\nGoalkeeper's shootout heroics end Gunners' quarterfinal wait\nArsenal's 14-year wait for a spot in the Champions League quarterfinals is over, thanks largely to David Raya's penalty saves.\nRaya tipped one spot-kick by Porto's Wendell against the post and then palmed away another from Galeno to secure a 4-2 win in a penalty shootout on Tuesday at the Emirates Stadium.\nThe result ended a long streak of round-of-16 losses for the Gunners, who had been eliminated at this stage in their last seven appearances in the competition but won 1-0 to level the aggregate score at 1-1.\nAnd it was a massive moment for Raya, who was brought in last summer to replace Aaron Ramsdale as Arsenal's No 1 — a decision that has been frequently questioned by the club's supporters this season.\n\"Obviously it's a great feeling for me personally, first time in the Champions League and for the club to get into the quarterfinals for the first time in so many years,\" Raya said.\n\"We've worked a lot on penalties this year and all the hard work with the goalie coach and the team has paid off. This means everything. You play football for these kinds of things and I'm lucky to be playing for Arsenal.\"\nIt was the first penalty shootout in the Champions League since the 2016 final won by Real Madrid against Atletico Madrid.\n\"You are very nervous, you are hoping for the best but you know that it (the shootout) is a bit of a lottery,\" Arsenal manager Mikel Arteta told TNT Sports.\n\"We've been patient, worked so hard and a lot of people have made good decisions and showed courage in difficult moments and this is where you want to be,\" he added.\nBarcelona also reached the quarterfinals with a 3-1 win over Napoli in Tuesday's other game to advance 4-2 on aggregate.\nArsenal trailed 1-0 from the first leg in Portugal — when Galeno scored the winner deep into stoppage time — but equalized through Leandro Trossard's 41st-minute goal. Neither side could find another goal despite extra time as Porto's disciplined defensive tactics largely held Arsenal at bay.\nArsenal endured seven straight round-of-16 losses under Arsene Wenger from 2011-17, the last time the London club played in the competition. Porto last reached the quarterfinals in 2021 but hasn't been past that stage since winning the title in 2004 under Jose Mourinho.\nArteta now has a chance to do what Wenger never could — win Europe's biggest trophy.\n\"So happy. It has been 14 years, which is a long time for a club like Arsenal and it shows how difficult it was,\" said Arteta, whose team is also top of the Premier League. \"We really had to dig in to find the magic moment at the end. We're starting to create an unbelievable energy in the stadium, we were all pushing to get it done and together we have done it.\"\nPorto had snatched the win with a last-minute strike in the home leg and did its best to protect that advantage with a combination of stout defending and a variety of time-wasting techniques.\nBut the host did have a couple of chances in the first half, with striker Evanilson shooting narrowly wide from outside the area in the 16th after Arsenal gave the ball away and then drawing a good save from Raya in the 22nd.\nArsenal's sustained pressure finally paid off when Trossard scored with a low shot inside the far post after being teed up in the area by Martin Odegaard. The shot went through the legs of veteran defender Pepe, who at 41 is the oldest outfield player to play in a Champions League match and the same age as Arteta.\nArsenal had a second goal ruled out in the second half when Odegaard put the ball into an empty net but Kai Havertz was adjudged to have fouled goalkeeper Diogo Costa moments before.\nGabriel Jesus nearly scored straight after coming on in the 83rd minute with a shot that nearly snuck between Costa's legs but deflected out for a corner.\nOdegaard had a great chance moments later after Bukayo Saka burst forward and drew a save from Costa, with the rebound landing at the Norway midfielder's feet, but he fired wide with the net gaping.\nPorto substitute Mehdi Taremi had the first chance in extra time when he broke into the area in the 101st but curled his shot wide of the far post. Saka then had a shot blocked at the last moment in the 110th after being teed up by substitute Eddie Nketiah in the box.\nOdegaard, Havertz, Saka and Declan Rice all scored for Arsenal in the penalty shootout, setting up Raya's decisive save when he dove to his left to deny Galeno.\nAgencies\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 875,
  "scraped_at": "2026-02-14T01:54:34.174342",
  "_text_extracted": true
}