{
  "article_id": "41aa3e4a2ddb",
  "url": "https://theathletic.com/4288370/2023/03/13/champions-league-europe-america-asia/",
  "title": "Will the Champions League stay in Europe ? ",
  "date": "20230313T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In April last year, the Paris Saint-Germain chairman Nasser Al-Khelaifi provided a window into the backroom discussions of European football.\nAl-Khelaifi is best known as the Qatari face of PSG but his footprint is all over the sport. He is on the executive committee of UEFA (the European football governing body and organiser of the Champions League) and he is the chair of the European Club Association (which represents the interests of clubs who compete in European club competitions). Not only that, but he is also running the Qatari broadcaster beIN Sports (which holds the largest portfolio of broadcast rights in the sporting world, screening major sporting events across the Middle East, France, New Zealand, Turkey and the United States).\nAdvertisement\nHis power at the ECA is all the more significant due to the organisation now having a joint venture to market European club competitions because, to be blunt, too many club executives reckoned they could do a better job of it than UEFA had managed when working alone.\nAs such, when Al-Khelaifi speaks about what he would like to happen in European football, it is worth listening — even if you may disagree with what he has to say. In an interview with The Athletic last spring, Al-Khelaifi spoke about the need for the Champions League to make “each match an event and entertainment”. He attracted the most headlines for saying the Super Bowl feels bigger than the Champions League final, which he attributed to Americans having “this mindset, for creativity and entertainment”.\nHe added: “My suggestion is to have a creative and entertainment department as part of the new joint venture between UEFA and ECA. How do we make the group stages compelling? The time difference (for Champions League games) is a problem for the US and Asia. So how can we work on this for international rights, which have huge potential? We are thinking about all kinds of things — new venues, new markets, new formats.”\nNew venues, new markets, new formats — six words that may, in time, come to reshape the Champions League. In September, The Athletic revealed that Al-Khelaifi is among several prominent club executives eager to explore taking matches beyond European borders. The argument is simple: European clubs want to drive fresh revenue streams, grow their audiences in major markets in the States, the Middle East and Asia, and there is a view that exposure to meaningful matches would be an effective way of doing so.\nIt is not the only idea that has been discussed and, at this stage, it remains only an idea. UEFA likes other options, such as experimentation with the Super Cup — the meeting between the previous season’s Champions League and Europa League winners. UEFA is already considering the introduction of a four-team mini-tournament at the start of each season, which would include the previous season’s Champions League winners and three other leading teams in what would be referred to as the “Opening Tournament”.\nAdvertisement\nThere were also plenty within the top echelons of European football who enjoyed the Champions League’s latter stages being hosted in one city — Lisbon — during the COVID-19-affected 2019-20 season. On that occasion, logistics and medical advice saw Lisbon become the sole host but some feel that replicating the experience with football supporters, who were unable to attend in 2020 due to pandemic restrictions, could provide fresh impetus for the tournament.\nFor some readers, much of what is mentioned above may trigger a roll of the eyes and a shake of the head. After all, conversations around changes in football are almost always highly conservative and no doubt plenty will instinctively conclude that the Champions League is a European competition, so logic says it ought to be played on European soil.\nWe should not presume, either, that confederations across the world would gladly open their doors to the Champions League. The US, in particular, would have its share of opposition if the Champions League started hosting games in New York and Miami, because some within the sporting world would argue that European soccer may bleed the sporting market dry if capital flows out of the ecosystem in the spheres of broadcast, sponsorship and ticket revenue, particularly if that cash may ordinarily be spent on the US pro leagues. Plenty would counter, however, that this would simply be market economics at work and the most popular products would continue to thrive. A workaround could emerge if, for example, UEFA agreed to return a material percentage of the income of any games on US soil back into American grassroots soccer to enhance player development and facilities.\nYet there is a tension within the modern game and it is only becoming more acute. Increasingly, the international broadcast market is a key driver of growth and prosperity within European football and, as such, more scrutiny is applied when considering what content, of real meaning, a supporter outside of Europe should be entitled to experience. And when the drivers of growth are so global, is it really still fair and accurate to say that the Champions League belongs to supporters based in Europe?\nAs such, a debate emerges as to whether it is really so blasphemous to suggest the global fanbase ought to have their own share of the fun. It is, fundamentally, a debate about the hierarchy of the fan and whether a Manchester United supporter in Trafford, for example, ought to have greater access to completionism (ie, the potential to attend every match) than a supporter elsewhere in the world.\nAdvertisement\nAt this stage, it should be noted that the views and experiences of any given domestic or global fan are not homogenous. There may, for example, be plenty of Arsenal fans globally who mirror the opinions of a supporter based in Islington in London because that is how they have come to consume their fandom. It should not be presumed, therefore, that all fans outside Europe would automatically consider it right or fair to take the product on tour, while there may be plenty of fans in Europe who take the view that, actually, those supporters around the world who stay up until silly o’clock to watch their team deserve something of substance in return that goes beyond a pre-season friendly.\nIn September, the ECA released a 39-page report on ‘The Future of Fandom’ and it threw up some intriguing conclusions and data points.\nLasse Wolter, the ECA’s director for commercial and business development, wrote: “We found that young people in the US and China, where fandom itself is a younger phenomenon than in Europe, have different motivations and needs compared to those in Europe. These are potentially huge markets and it will be important to be proactive about what new fans want if clubs are to maximise their opportunities to develop football as a sport for these growing audiences.”\nOf course, any discussion about China is complicated by the country’s slower approach to opening up following the pandemic, as well as political concerns in light of inflamed global tensions.\nThe report included surveys and research conducted by the strategic consultancy MTM Sport, and included 906 respondents from the US and China. The report said 48 per cent of Chinese fans said the Champions League acted as a “catalyst to their fandom”, adding: “Events are of greater importance in China and the US than in most other markets, and European events carry significantly more influence. There are opportunities for European clubs and competitions to build on this interest; to increase the availability of European club football to these audiences, and allow exposure to these events to continue building deeper interest and engagement.”\nSome of this is written in corporate management speak but read between the lines and we can find some straightforward advice. The money is coming in from all over the world and a little more may be required to protect and grow these investments. There are other ways football clubs can build “deeper engagement”, whether it be through esports, fashion brand collaborations, investments in women’s teams or fly-on-the-wall television documentaries, which have proved particularly effective tools for National League side Wrexham and Formula One.\nOther innovative solutions are in the works, such as digital twinning and virtual reality or augmented reality experiences. One route tech companies are exploring would be partnerships with stadium developers to eventually create a world where a football supporter in the Middle East, for example, could buy a virtual seat within a stadium in Europe and share a sensory experience that is akin to attending a football match, supported by interactive data and social media experiences.\nAdvertisement\nA more analogue approach by plenty of major clubs has been viewing parties for supporters in different parts of the world. Manchester United, for example, held their event #ILOVEUNITED in Los Angeles for the first time during the 7-0 defeat by Liverpool earlier in March, with appearances from former United strikers Diego Forlan and Andrew Cole, as well as live music offerings.\nA senior executive at one leading Champions League club, who spoke on the condition of anonymity because he was speaking without permission, makes the following case for taking some matches beyond the continent.\nHe says: “It’s arrogant just to say the people of Arsenal, for example, who live in the UK should be the only ones who can see their team live. It’s basically globalisation. And if you ignore growth markets, competitors won’t and you’ll fall behind. Look at clubs’ social media followings — they have nothing at all to do with their local community. Every club’s community is global and should be — but absolutely buttressed by local projects and initiatives and priorities. Look at the NBA, the NFL and the Davis Cup in tennis and basically every other sport taking events and games internationally — which isn’t a slight on the local fanbase, they still have 95 per cent of the access.”\nThis view draws upon the perspective that elite football, however popular it may appear to be, is competing for the attention of individuals in an era of unprecedented choice, across leisure, social media and streaming platforms. The golfer Rory Mcllroy recently spoke of his own sport’s challenges, saying the battle for prominence between the PGA Tour and LIV Golf should be a broader discussion.\nHe said: “The PGA Tour isn’t just competing with LIV Golf or other sports. It’s competing with Instagram and TikTok and everything else that’s trying to take eyeballs away from the PGA Tour as a product.”\nOther sports are disrupting more aggressively. The NBA played a regular season game between Chicago Bulls and Detroit Pistons in Paris in February, which included enhanced media availability and open practice sessions. The NBA went all-out to woo the locals and the interest was so high that supporters were outside the venue trying to buy tickets on the day of the game from attending spectators.\nThere may be an argument that sports such as basketball and American football have a greater need to grow their brands internationally than the Champions League or Premier League. There is also less of a culture of large contingents of travelling away fans in US sport.\nAdvertisement\nAdditionally, Paramount Global, the owner of the CBS network, recently agreed a new six-year deal worth a total of $1.5billion (£1.25m) to retain the rights to show the Champions League in the US from the 2024-25 season. The international broadcast rights for the Premier League now outsell the domestic rights. Yet clubs across Europe are desperate to find fresh sources of revenue, partially to recover from the impact of COVID-19 but also to keep up with spiralling wages and transfer fees. It is why many clubs plunged headfirst into doomed deals for NFTs or crypto companies.\nWithin European football, there have already been ventures outside the continent. Italian and Spanish football have both played significant cup competitions in Saudi Arabia, and the Spanish La Liga still wishes to host a match in Miami but has so far been obstructed by legal challenges.\nEnglish football has resisted the lure. Some may consider that to be a reflection of the Premier League’s strength — it does not need to take its product abroad to command interest and revenue — while others may say they are allowing rivals to gather greater traction. The Premier League is still scarred, too, by a doomed plan in 2008 to introduce a 39th round of fixtures into the top flight of the competition, which proposed five host cities across the world hosting 10 games across a weekend. The former Premier League chief executive Richard Scudamore initially convinced clubs to support the plan. Indeed, 19 clubs voted in favour, with only Liverpool voting against, before they fell in line to make it unanimous.\nYet a huge backlash from media, supporters and stakeholders such as FIFA caused the plan to unravel. The Premier League has knocked about all kinds of different ideas since, whether it be buying the Football Association out of the FA Cup or Community Shield, or buying the Football League out of the Carabao Cup to afford greater experimentation on formats and venues. One idea touted, which never went very far, was to buy the Community Shield and instead have a pre-season tournament played abroad in which Premier League teams would be seeded and play a knockout competition.\nRest assured, similar ideas will be concocted in the future, most notably for the Champions League. And change may happen quicker than we all expect.\n(Top photo: Getty Images; design: Sam Richardson)",
  "word_count": 2261,
  "scraped_at": "2026-02-14T02:16:40.082961",
  "_text_extracted": true
}