{
  "article_id": "41ac7309d11e",
  "url": "https://metro.co.uk/2025/09/19/bukayo-saka-viktor-gyokeres-latest-mikel-arteta-gives-update-man-city-clash-24209154/",
  "title": "Viktor Gyokeres and Bukayo Saka injury update for Arsenal vs Man City | Football",
  "date": "20250919T151500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal will make a late decision on the fitness of Martin Odegaard, Bukayo Saka and Ben White ahead of the Premier League clash with Manchester City.\nOdegaard was forced off in the second-half of last Saturday’s 3-0 win over Nottingham Forest, landing heavily on his shoulder following a collision involving Jurrien Timber and Morgan Gibbs-White.\nThe Gunners captain looked in real discomfort as he left the pitch with Arteta confirming it was the same shoulder Odegaard had injured earlier in the season.\nThe Norway international was also forced off in the first-half against Leeds United in Arsenal’s second game of the new campaign, starting the following game against Liverpool on the bench as a result.\nOdegaard did not train earlier this week and missed the Champions League opener against Athletic Bilbao.\nSaka meanwhile has been ruled out since the Leeds game with a hamstring problem which appeared set to rule him out for four weeks.\nSpeaking ahead of the visit of City on Sunday, Arteta told a press conference the duo, along with Ben White, are still to train this week but could still join their teammates in final training sessions on Saturday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘If there is a chance, it will be after tomorrow’s session as they haven’t done anything yet,’ Arteta said.\nWilliam Saliba suffered a sprained ankle in the warm-up ahead of the Liverpool match and was replaced by Cristhian Mosquera.\nMore Trending\nThe Spain international did a fine job deputising that day and again against Forest and Athletic but Saliba could be in contention to come back into the team to reclaim his place.\n‘Let’s see, he has been carrying an injury,’ Arteta said. ‘He’s really pushing it so we will decide tomorrow.’\nViktor Gyokeres meanwhile suffered a nasty cut on the back of his head against Athletic Bilbao midweek with Mikel Merino also suffering a head injury.\nArteta eased any fears over the pair, however, telling reporters: ‘Yeah they are fine, they will be available.’\nMORE: Ruben Amorim reveals the truth behind crunch talks with Sir Jim Ratcliffe\nMORE: Matheus Cunha update as Ruben Amorim reveals double injury boost for Man Utd vs Chelsea\nMORE: Pep Guardiola gives Rodri injury update ahead of Arsenal vs Man City",
  "word_count": 424,
  "scraped_at": "2026-02-14T02:26:56.624943",
  "_text_extracted": true
}