{
  "article_id": "41b4be904289",
  "url": "https://www.caughtoffside.com/2025/01/08/tottenham-liverpool-carabao-cup/",
  "title": "Sky Sports pundit fears for Tottenham after what he saw pre - match",
  "date": "20250108T233000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham host Liverpool in the first leg of their Carabao Cup semi-final on Wednesday night with the competition providing Ange Postecoglou with a great chance to win a trophy this season.\nThe 2024/25 campaign has been very underwhelming for Spurs as the North London club currently sit 12th in the Premier League with just seven wins from 20 matches. Expectations would have been a lot higher than this but the cup competitions have been a different story.\nTottenham are in a great position to qualify for the next round of the UEFA Europa League, have an easy draw in the FA Cup and have reached the semi-finals of the EFL Cup.\nExclusive: Spurs weighing up a move to rival Aston Villa for forward transfer\nPremier League leaders Liverpool stand in the way of Postecoglou’s team and a trip to Wembley. Arne Slot has opted to play a strong team for the first leg, which is something former Spurs defender Michael Dawson hoped the Dutch coach would not do.\nThe Sky Sports pundit has admitted that he fears for the London club after seeing the Reds’ starting 11 before kick-off, having witnessed Liverpool hammer his former club just before Christmas.\n“The form Tottenham have been on has not been good enough. Ange Postecoglou will know that,” Dawson said on Sky Sports. “There are a lot of reasons behind that, you’ve got to look at the injuries they’ve got, the way they play. I was here for the 6-3 game before Christmas and if it goes that way, I fear for Tottenham.\n“Liverpool, when you look at the team and how strong they have gone, I was hoping that they might have gone a little bit weaker like they did in the last round against Southampton.”\n\"I fear for Tottenham!\"\nMichael Dawson on Spurs' hopes against Liverpool in the Carabao Cup tonight ? pic.twitter.com/bBWYiDEeLr\n— Sky Sports Football (@SkyFootball) January 8, 2025\nCarabao Cup key to Ange Postecoglou’s future at Tottenham\nGiven Tottenham’s league form, the cup competitions could determine whether Postecoglou will remain as the Spurs boss next season. Champions League qualification looks very unlikely for the London club at present, however, fans would deem the campaign a success if a trophy arrives.\nThe Carabao Cup provides the Australian coach with a great opportunity to achieve this and a win against Liverpool on Wednesday night would ease the questions being asked about the former Celtic boss during recent weeks.",
  "word_count": 408,
  "scraped_at": "2026-02-14T02:08:52.969056",
  "_text_extracted": true
}