{
  "article_id": "41d719a4882e",
  "url": "https://www.gdnonline.com:443/Details/1342749/PSG%E2%80%99s-brilliant-comeback-stuns-City",
  "title": "Football : PSG brilliant comeback stuns City",
  "date": "20250123T003000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris St Germain clawed back from two goals down to stun Manchester City 4-2 in the Champions League last night and leave the English club outside the playoff places and in danger of elimination.\nGoals from PSG’s Ousmane Dembele, Bradley Barcola, Joao Neves and Goncalo Ramos turned the match on its head after City had taken the game by the scruff of the neck.\nSubstitute Jack Grealish and Erling Haaland struck in the 50th and 53rd minutes to give City a 2-0 lead, but fans who braved the torrential rain at Parc de Princes were treated to a brilliant comeback.\nDembele latched onto a cross from Barcola to sweep home a goal in the 56th minute. Barcola levelled for the home side four minutes later when he tucked in the rebound after Desire Doue’s blistering shot came back off the crossbar.\nPSG parked themselves in City’s half and took the lead in the 78th minute when the visitors’ back line struggled to clear Vitinha’s free kick, leaving Neves to head in at the back post. Ramos added their fourth with a goal in stoppage time.\nMeanwhile, Arsenal all but secured a spot in the knockout phase as they outclassed visitors Dinamo Zagreb 3-0 thanks to with goals from Declan Rice, Kai Havertz and Martin Odegaard.\nRice struck inside the opening two minutes after a clever lay-off by Havertz and the German put Arsenal in full control with a 66th-minute header. Captain Odegaard put the icing on the cake with a third in stoppage time.\nVictory lifted Arsenal to third in the standings with 16 points and with the top eight qualifying automatically for the last 16 only an extraordinary sequence of results in next week’s final round of group matches could deny Mikel Arteta’s side.\nFeyenoord striker Santiago Gimenez scored twice in the first half to steer the hosts to a 3-0 victory over Bayern Munich and boost their chances of a top-eight finish on the last matchday next week.\nTop stories for today:\nShaping future of local workforce\nAiling expat returns home for treatment\nHope Ventures to open HQ branch in Janabiyah",
  "word_count": 353,
  "scraped_at": "2026-02-14T02:18:11.287712",
  "_text_extracted": true
}