{
  "article_id": "41f1aff4a9c6",
  "url": "https://www.france24.com/en/live-news/20240219-inzaghi-pushing-red-hot-inter-to-new-heights-as-atletico-come-to-town",
  "title": "Inzaghi pushing red - hot Inter to new heights as Atletico come to town",
  "date": "20240219T040000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inzaghi pushing red-hot Inter to new heights as Atletico come to town\nMilan (AFP) – Simone Inzaghi is on the verge of a major breakthrough at Inter Milan as the Serie A leaders push towards the first Serie A title of his coaching career and eye another deep run in the Champions League.\nIssued on:\nInter are in red-hot form as they await the visit of Atletico Madrid on Tuesday, eight wins from eight in 2024 giving them the Italian Super Cup and a nine-point lead over Juventus in Italy's top flight -- with a game in hand.\nInzaghi has long been viewed as a cup coach, one who can win the domestic knockout baubles but isn't capable of challenging for football's biggest prizes.\nBut last year's run to the Champions League final and their imperious current campaign in Serie A suggests that Inzaghi belongs at the top table.\nInter have two points fewer than reigning champions Napoli -- who charged to the Scudetto with five matches to spare -- did at the same point last season.\nHowever Inter have scored a goal more and have a better goal difference than Napoli did after 24 games, on their way to finishing a triumphant season 16 points clear.\n\"We're now in that period where the matches are all close together so we're going to have to good enough to react to problems,\" said Inzaghi after Friday's 4-0 thrashing of Salernitana.\nInter destroyed Serie A's bottom team to win their eighth straight match after statement victories over Juve and Roma, leaving fans wondering just how far their team can go in Europe's top club competition.\n\"We're playing really well,\" Inzaghi added.\n\"It's difficult, you have to wait until the end of the season to make any conclusions.\"\nNew heights\nWhat makes Inter's season even more remarkable is that it comes after yet another pre-season in which big players left and serious financial problems hampered their summer transfer activity.\nInter weren't even sure who their first-choice goalkeeper was going to be until a fortnight before the start of the season after Andre Onana was sold to Manchester United in a 57 million-euro deal.\nYann Sommer, Bayern Munich's reserve 'keeper, was brought in for a relative pittance, while Benjamin Pavard didn't arrive until transfer deadline day but has since slotted perfectly into Inter's three-man defence.\nMeanwhile free transfer Marcus Thuram immediately struck up a devastating partnership with Lautaro Martinez, making the loss of Edin Dzeko and Romelu Lukaku almost entirely pain free.\nInzaghi's ability to adapt to and get the best out of a changing cast of players has been a hallmark of his reign in Milan and it has created a special looking team.\nJust how good Inzaghi's latest Inter team are compared to previous years will be revealed over two clashes with Atletico, a tough team with an even tougher manager in Diego Simeone.\n\"They're physical, they know what they're doing, they have lots of great players coached by a really good manager who was also a great teammate,\" said Inzaghi of Atletico.\nTuesday will be the second straight match Inzaghi faces a former Lazio teammate in the opposing dugout after swatting aside Fabio Liverani's Salernitana.\nA similar performance on Tuesday would give Inter and Inzaghi a great chance of continuing their push for European glory.\n© 2024 AFP",
  "word_count": 557,
  "scraped_at": "2026-02-14T01:56:44.627327",
  "_text_extracted": true
}