{
  "article_id": "4216b8a887c6",
  "url": "https://www.managingmadrid.com/2024/5/7/24147022/scouting-report-jeremy-de-leon",
  "title": "Scouting Report : Jeremy de León",
  "date": "20240508T014500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The football scene in Puerto Rico is often overlooked, with their most prominent player being one of Real Madrid’s own in Eduardo Ordóñez, a midfielder who played for both Los Blancos and Atlético in the 1920/30s. The rest, past and present tend to ply their trade in the lower leagues around Europe or in the United States of America. Fitting, as the Caribbean island is incorporated into the States as a commonwealth. Despite this, they have their own national team and are considered by many to be very much a separate entity. Having personally visited some years ago, it is a stunning place - but not the typical breeding ground for a future Real Madrid player. The opportunity is there for a new player to announce themselves and take Puerto Rican football to new heights. Step forward, Jeremy de León. The 20 year-old winger recently acquired by Real Madrid to play with Castilla in the Spanish third division. The move was announced by prominent journalist Fabrizio Romano, and hailed back in Puerto Rico by figures such as Bad Bunny. Carlo Ancelotti has taken a real shining to him recently, inviting him to not only standard senior training sessions - but also first team trips in the Champions League even though he has not been registered to play in that competition. His presence against both Manchester City and Bayern Munich, seemingly appearing out of thin air to those unaware of his signing, and the fact that he was selected over registered young players like Nico Paz who could contribute, and had even scored earlier in the competition, caused him to go viral all over social media. But who exactly is this unknown talent? This scouting report takes a very comprehensive look, with some valuable insights added in along the way.\nScouting Report: Jeremy de León\nWho is this mysterious first team hopeful?\nPlayer Profile\nPosition: Right winger (has also played left winger, and second striker)\nHeight: 1.73 metres (5ft 8)\nWeight: 70kg\nFoot: Left\nTeams: Castellón (third division), Castilla (third division), Puerto Rico under-20s (national team)\nJeremy is left footed, but predominantly operates on the right hand side. Born in Puerto Rico, he is currently a youth international who is projected to make his senior debut at some point this year. For the under-20’s, he has scored five goals in five appearances with multiple assists on top, showing the most clinical version of himself yet. After being scouted by clubs such as Sevilla, Málaga and Valencia - he was finally brought to Spain by scout Jordi Gómez after impressing at a tournament in Sheffield, England. At the time of writing this report, Jeremy has made 51 senior appearances since turning professional, the majority coming with first club Castellón. Castellón currently sit at the top of their third division group (the same as Castilla’s), and all of de León’s senior goal contributions have come for them. Two goals and three assists do not make for good reading, but they did come at vital times in his career. Castellón finished third last year, and Jeremy de León would shine in the promotion play-offs to LaLiga2. He scored a vital goal against historic club Deportivo La Coruña to help his side gain a place in the final. They would ultimately fall at the final hurdle, but Jeremy would register an assist against Alcorcón after starting in both legs. Next season, his assist, and ultimately performance during a short cameo against Real Madrid Castilla may have been the sole reason the Los Blancos decided to sign him in January. Jeremy has made five appearances for Castilla so far, impressing during his debut against Linares, but not getting much of a look-in since.\nStrengths\nWhat is it about his game that Real Madrid seem to like so much? Well, his standout attributes lie away from his statistical output. They are mostly physical, with his unique body movement characterised by a combination of athleticism, surprisingly explosive agility and strong levels of balance. Despite only being slightly below the average height in Spain for a winger, he has a relatively low centre of gravity. Coupled with his lean physique, this allows him to turn on the spot with ease, and make sharp cuts and body shifts effortlessly. His balance is strong, but not at the level of his agility - meaning that his turns are often executed in the form of swivels over the ball. This over the ball stance has developed some strong protective attributes despite a lack of traditional physicality, with defenders often unable to recover the ball from Jeremy even whilst getting a strong foot on it. His excellent ball control combined with a healthy amount of pace means that he is considered an explosive forward who can really drive at defenders with speed. When travelling at such speeds though, his very light weight, meaning that he can be pushed off of the ball relatively easily. He still isn’t afraid to be positive and take players on, and his quick, nimble movements help him to change direction to deceive opponents. I wouldn’t necessarily brand him a flair player as much as he is a direct dribbler, but he does display flashes of creativity on the ball. For the Puerto Rican youth team however, he has shown that he can be the creative spark, as well as the goal scorer, albeit at an inferior standard. This is a good indicator that he is capable of adding that killer instinct to his game, though.\nI found comparing him with other players a difficult task. However, the very player he came in to replace did come to mind. Peter Federico González, now of Valencia in La Liga, was an important figure for Castilla for over three years, making 115 appearances for the youth outfit. The bad news here is, that whilst Peter developed upon those raw skills and traits that Jeremy currently possesses, he was only seen as a potential first team player for a very short period of time. After an impressive start with Castilla, even resulting in him playing three first team games, his consistency dropped and it became apparent that he wasn’t going to progress with the club. Still, he was always going to make his way to La Liga, and a €3 million deal to Valencia in January was considered good business. Jeremy seems to be at a similar level to Peter when he was first promoted to Castilla, so whilst he may find first team openings hard to come by, and it is unlikely that he will ever secure full time promotion at Real Madrid, he should be expecting to join a La Liga club if he performs well in the future. If I had to compare him to an established senior player, at times he reminds me of a slower Kingsley Coman.\nJordi Gómez, the scout who brought Jeremy de León to Spain, agreed to write a segment exclusively for ManagingMadrid in this report. Below are his thoughts:\n- Where did you find him originally? What team was he playing for during the tournament in England?\nJeremy was playing the Sheffield trophy, in Sheffield. He played for the GPS National team, which was a selected team of players from all the GPS franchises from north America. GPS was one of the largest clubs in north America prior to covid.\nOur head coach Antony Blackburn went to the tournament with some players from our academy and he watched Jeremy play there. He was the one telling us to go after him to bring him to Spain.\n- What is your sports programme called? Have you had many success stories?\nOur academy is called International Development Academy (IDA) Valencia. We have almost 100 players in Valencia from different parts of the world, who study here and also are immersed in an intensive football program with daily double sessions and two games per week. We prepare the boys for signing for different clubs at different levels in Spain and Europe.\nOur biggest success has been Jeremy, of course, but we do have players at Villarreal CF academy, players at CD Castellon, players playing at different teams in Tercera RFEF, Segunda RFEF and also in different parts of the world such as Sweden, Cyprus or Norway.\n- How long was Jeremy there for? Who signed him? Did he go pro directly from your programme?\nJeremy came to our program in August 2020 and stayed with us for 18 months, to develop him both as a player and as an adult, since he came at the age of 16. In January 2022, he went on trials to CD Castellon U19’s playing at Liga Nacional. He signed there and, after scoring 16 goals in just 15 games, he was offered a professional contract for CD Castellon first team even being still U19’ in May 2022, at the age of 18. He played one and a half years at CD Castellon first team in Primera RFEF and they signed at Real Madrid Castilla from there.\n- What were the most impressive characteristics he possessed in the scouting report that convinced you to pursue him?\nJeremy had a fantastic ability with the ball. He played every practice, every game, as if he was playing in his backyard. It was impossible to take the ball from him. He was skinny, and small, but we saw that he had the ability to grow him as a player in Europe, and that’s why we brought him to IDA Valencia.\n- Is there any established player that you would / could compare him to?\nI would not compare him to any professional player, since every player is different. But Jeremy is a winger that can play either on the right or the left which has a burst of speed that can be similar to the one Vini Jr. has, although he is not in the same league with him yet.\n- What did you think he needed to work on? What were his weakest points as a player?\nJeremy’s weakest point has always been his physicality. He has been working a lot in the gym and with personal trainers during his time at CD Castellon and now, but it is still what he needs to improve to be able to play at the highest level. Once he is able to do that, I think we would be able to see him in the next level.\n- What are the best stories or memories you have of him?\nThere’s been a lot of memories, but, the best one we have from him it was his goal at the playoffs with CD Castellon vs Deportivo de la Coruña, which helped the team to get into the playoff finals.\nAlso - From previous years, his 4 goals at Villarreal CF U19’ field in the league with CD Castellon U19’. This was his third game in Spain and this was his introduction to everyone in Spain.\n- Are you surprised to see him training with the Real Madrid first team or do you feel that he always had it in him?\nJeremy, when he is at training or game, always tries to be the best one on the field, since he knows this is the only way to keep improving to the level he needs to. This is why I am not surprised to see him with the Real Madrid first team. With his ability and the attitude he puts in every practice, it was something expected at some point by everyone who knows him well. Which we did not know it was that was going to be that early!\nWeaknesses\nJeremy is not without his shortcomings. In fact, some could even be considered alarming. Listed below are some of the key areas of focus to scrutinise and ultimately improve upon:\nConsistency: As previously eluded to, five goal involvements in 51 games is not exactly stellar. In fact, Jeremy has never been a consistent starter at any point as a professional. He has only started ten matches in his entire career so far, and completed just two full 90 minute games, all whilst with Castellón. Since signing for Real Madrid in January, he has not started a single game, playing a combined 79 minutes over the course of five appearances. He has been unable to make it off of the bench a further ten times. For a 20 year-old, that is abysmal. He supposedly ignited his love affair with the first team in a friendly match for Castilla against the senior side during the international break, in which he was apparently the star man out of everyone on the day. This, and other small snippets of quality (mostly captured in the video above), show that he is at a good enough level to at least start for Castilla going into next season. However, he clearly isn’t showing that enough behind the scenes and desperately needs to find some consistency in order to claw back some success with Castilla, let alone the first team.\nDecision making: Part of the reason why Jeremy lacks that clinical edge, is his decision making in the all important final third. Whilst he possesses strong dribbling skills and a unique physical profile, he has thus far been unable to fully utilise this to his advantage. His crossing game is not strong enough for such a direct winger who can carry the ball into dangerous areas. This forces him to opt for the low driven cross, which can be affective during appropriate instances, but makes him appear one dimensional when it isn’t the optimal option. This would all of course naturally develop if he was granted enough game time, and I suspect that he is more than good enough to start regularly for Castilla right now, but manager Raúl appears hesitant to give him the opportunity.\nTactical Discipline: This is another factor that isn’t necessarily his fault as he hasn’t played enough games to evolve, but he doesn’t appear adaptable to a number of systems and formations, which has affected his playing time. To avoid a relegation battle, Raúl has recently deployed a back five equipped with offensive wing-backs to snuff out the physical threat of rival teams and allow Castilla to attack in numbers going the other way. Whilst wingers such as Marvin Park and Peter Federico were tried out in such positions in the past, Jeremy de León clearly hasn’t shown enough defensive prowess or tactical awareness, or that he currently has the necessary physicality to be trusted in that role. Why he feels more comfortable on the right-hand side is actually unclear, as Jeremy rarely opts for the cut-in to create shooting space or an aerial cross. Instead, the Puerto Rican goes for a more direct approach, making his way towards the by-line or into the box to pick out accurate passes. Perhaps his biggest area for improvement lies in diversifying his versatility, as games on the left-hand side might well suit his direct style more appropriately - and he certainly has shown the engine and dedication to give the wing-back position a go. As Castilla continue to pick up points and reach safety, hopefully the time comes for Jeremy to take an opportunity under little pressure to perform, and Raúl feels satisfied enough to try him out in any of his ranging formations experimented with recently.\nJeremy de León possesses all of the raw talent and skillset required to succeed at professional level, and as of next season he should be a starter with Castilla. Refining his decision making and consistency will be key areas for improvement. His body movement profile showcases a blend of agility, balance and explosiveness that aligns well with the demands of his position. With the right guidance and dedication, hopefully under a new manager in Álvaro Arbeloa, he has the potential to become a valuable asset to Castilla, and maybe even become just the second Puerto Rican to represent the Real Madrid first team. However, the decision to take Jeremy on all of these first team expeditions despite not being able to contribute at all remains as strange as it seems. Perhaps Carlo Ancelotti needed someone to play Kingsley Coman during training scenarios and felt no one else could do it. Maybe Jeremy has become a lucky charm for the superstitious at the club. It could be a possibility that it was one of the terms of his contract when he signed for the club (irregular for a player of this calibre). Or maybe communication between the first team and Castilla is at an all time low, and Ancelotti and his staff believe that de León is flourishing with the reserves without realising. That certainly wouldn’t surprise me at this point. Whatever the reason, it seems harsh on both the players he is leapfrogging to the opportunities (especially Nico Paz), and Jeremy himself who is being thrust into a spotlight that he may not be ready for. Did Real Madrid really sign a player to do nothing but act as a mere supporter, and gain social media followers, all whilst playing no minutes elsewhere? Or do Real Madrid, and perhaps more importantly Puerto Rico, have a future start on their hands, and it is only a matter of time before he shines? One thing is for sure, he certainly has gained a healthy amount of trust and attention from Carlo Ancelotti and the higher ups at the club, so it is worth keeping tabs on his journey to find out...",
  "word_count": 2924,
  "scraped_at": "2026-02-14T01:48:52.527053",
  "_text_extracted": true
}