{
  "article_id": "42389349d694",
  "url": "https://www.barcablaugranes.com/2024/6/14/24178045/where-does-real-madrids-signing-of-kylian-mbappe-leave-barcelona",
  "title": "Where does Real Madrid signing of Kylian Mbappe leave Barcelona ? ",
  "date": "20240614T113000Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s fair to say, at least objectively, it isn’t exactly the best time to be a Barcelona fan.\nWhere does Real Madrid’s signing of Kylian Mbappe leave Barcelona?\nThings may not look as bleak as they seem..\nTwo weeks ago, Real Madrid won the Champions League with the whole world watching, lifting an unprecedented 15th title at Wembley and further cementing their ridiculous pedigree on the continental stage.\nIf that widening gap between the Clasico rivals wasn’t enough for Culers to deal with, Los Blancos officially announced football’s worst kept transfer secret - the arrival of Kylian Mbappe - while still hungover from their latest European triumph.\nA true statement of intent if ever there was one.\nSo, where does that leave Barcelona?\nAfter all, there is little confidence the club can make a statement signing of their own this summer given their tricky financial situation.\nHowever, if you look closely enough, it may not actually be the end of the world for Barcelona.\nWhile some pessimsim is understandable, it may actually be a golden time for the club to work in the background and emerge powerfully from the shadows.\nWhile Mbappe’s signing for Real Madrid may spell doom for their opponents, there is no denying the spotlight will be on the club’s brand new signing to impress from the get-go at Santiago Bernabeu.\nThese moments of peace, which don’t happen often, may actually prove to be a blessing for Barcelona.\nWith the former PSG man dominating the talk in the football world, the noise surrounding Barcelona has died down in recent weeks.\nIt means Barcelona can use this breather from the external pressures of the game to prepare a team primed to win big in the coming season.\nIf there is one problem that Barca has suffered from time and again in recent years, it’s the unwanted, crazy media spotlight that never seems to stop. The infamous ‘entorno’ that seems to grow bigger with every passing year.\nManagers, players and even the men higher up calling the shots at the club have regularly succumbed to the intense speculation and toxicity that runs wild in the press.\nFormer coach Xavi Hernandez was the latest in a long line of notable figures to exhaust himself mentally whilst working for the club of his dreams.\nNo matter whether Barca have enjoyed a title-winning season or a trophyless campaign, the club is seemingly never at peace.\nIt’s a job that is cruelly unforgiving and not for the faintest of hearts.\nI am sure Hansi Flick, who has arguably had the most inconspicuous start a manager of this club has ever had (he’s not even been unveiled yet) will be welcoming this change in scenery with open arms.\nAs was pointed out in a documentary series about Flick’s Bayern Munich, ‘FC Bayern: Behind the Legend’ on Amazon Prime Video, the German thrives in a stable environment and this is as stable as it gets at Barcelona.\nThe coach has been untypically left alone so far by the media as he starts to figure out how to get the best out of a talented but unbalanced squad.\nEven president Joan Laporta has been tempering expectations with respect to Barcelona’s forays into the transfer market this season, paying homage to and suggesting reliance on their home-grown players coming through La Masia.\nAnd for once, he’s right.\nBarcelona do not have the finances to go on the lookout for their Kylian Mbappe. Instead, a few smart moves in the transfer market coupled with faith in the academy’s burgeoning squad will be the basis of next season’s squad.\nWhisper it quietly, but Barcelona may already have an answer to Real Madrid’s latest blockbuster signing in 16-year-old Lamine Yamal who is already taking the world by storm.\nWhile the world gazes at Madrid’s next ‘Galactico’, with all the talk of Barcelona’s problems, there’s just a feeling that the expectations may actually weigh heavier for Los Blancos to deliver next season.\nAll in all, it’s a golden chance for Barcelona, devoid of pressure for a change, to spring a surprise and ensure it’s not another trophyless season.\nI just hope I haven’t jinxed it.\nAs at Barcelona, things can only seem normal for so long...",
  "word_count": 705,
  "scraped_at": "2026-02-14T01:57:18.899047",
  "_text_extracted": true
}