{
  "article_id": "4256fa170ae8",
  "url": "https://en.yna.co.kr/view/AEN20230921009000315",
  "title": " ( Asiad ) PSG midfielder Lee Kang - in lands in Hangzhou , could play final group match",
  "date": "20230921T081500Z",
  "domain": "en.yna.co.kr",
  "source_country": "South Korea",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(Asiad) PSG midfielder Lee Kang-in lands in Hangzhou, could play final group match\nBy Yoo Jee-ho\nHANGZHOU, China, Sept. 21 (Yonhap) -- Paris Saint-Germain (PSG) midfielder Lee Kang-in arrived in Hangzhou on Thursday, prepared to join the South Korean men's football team at the Asian Games with the group stage already underway.\nLee, 22, is one of the most popular South Korean athletes competing at the 19th Asian Games here in China, and is also expected to be the creative engine for the men's under-24 football squad. The official Asian Games News Service recently highlighted Lee as one of about 20 athletes to watch at the Hangzhou event.\nThe most valuable player of the 2019 FIFA U-20 World Cup, Lee will be tasked with leading South Korea to an unprecedented third straight gold medal in men's football.\n\"I am going to do the best with my teammates to post good results,\" Lee said while surrounded by a throng of reporters at Hangzhou Xiaoshan International Airport. Lee walked through the terminal as he spoke, and didn't stop for a media scrum as he headed straight to Jinhua, southwest of Hangzhou, where South Korea were to play Thailand in their second Group E match later Thursday.\nThe Asian Games aren't part of the FIFA international match calendar, and thus clubs aren't required to release their players for this competition. Lee apparently inserted a clause in his contract with PSG that required his French club to send him to China.\nPSG agreed to release Lee only after he played in a UEFA Champions League group stage match against Borussia Dortmund in Paris on Tuesday. Lee came off the bench in that contest to mark his return from a left quadriceps injury, which had put him on the shelf in late August.\nAsked about his leg Thursday, Lee smiled and quipped, \"It's a secret.\"\nWithout Lee, South Korea destroyed Kuwait 9-0 in their first Group E match Tuesday in Jinhua.\nSouth Korea will close out the group stage Sunday against Bahrain, also in Jinhua. It is not clear whether head coach Hwang Sun-hong will deploy Lee in that match or save him for the knockout stage that South Korea are expected to reach with ease.\nLee was named to the Asiad squad in July but has yet to train or play a match with the team, due to his club commitments.\nThere are six groups in action, and the top two teams from each group, plus four third-place teams, will advance to the knockout phase.\njeeho@yna.co.kr\n(END)\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\nG-Dragon confirms BIGBANG's official comeback this year\n-\n'Singles' Inferno' producer explains record-breaking Netflix renewal\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\n(Yonhap Interview) Auto 'good place to start' for submarine bid package: Canadian defense procurement chief\n-\nPark Jeong-min explores new territory as romantic lead in action-thriller 'Humint'\n-\n(Movie Review) 'Humint': Ryoo Seung wan's romance wrapped in unflinching action\n-\n(Yonhap Interview) Moonassi brings stirrings of heart to paper\n-\n'Singles' Inferno' producer explains record-breaking Netflix renewal\n-\nCheong Wa Dae hopes for N. Korea's response after U.N. decides to exempt sanctions on humanitarian aid\n-\n(2nd LD) N. Korea in process of designating leader's daughter Ju-ae as successor: NIS\n-\n(Olympics) Figure skater Cha Jun-hwan finishes 4th in men's singles\n-\nN.K. leader's daughter Ju-ae takes center stage with father in photos at Beijing embassy\n-\n(2nd LD) N.K. leader's sister calls Seoul's regret over drone incursion 'sensible'\n-\n(LEAD) (Olympics) Snowboarder Choi Gaon claims gold in women's halfpipe",
  "word_count": 610,
  "scraped_at": "2026-02-14T02:00:57.126432",
  "_text_extracted": true
}