{
  "article_id": "426b6ae815d9",
  "url": "https://www.caughtoffside.com/2025/05/31/manchester-united-arsenal-premier-league-benjamin-sesko/",
  "title": "Man Utd have secret weapon in bid to steal Benjamin Sesko from Arsenal",
  "date": "20250531T140000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are not prepared to sit on their laurels and watch Liverpool get one hand on the Premier League title ahead of the 2025/26 season.\nThe Merseysiders have already brought in Jeremie Frimpong, with Bayer Leverkusen teammate Florian Wirtz destined to follow ahead of the summer window.\nMikel Arteta’s men look set to respond with a move for one of Benjamin Sesko or Sporting Lisbon’s Viktor Gyokeres.\nIt just now remains to be seen who sporting director Andrea Berta will prioritise.\nArsenal need a top striker like Benjamin Sesko\nIn terms of translatability, you’d have to argue that Sesko would be the more ideal opportunity. The Bundesliga is much closer in quality and style, with the greatest of respect, than the Portuguese top-flight.\nThat said, you could forgive Arsenal’s decision-makers for drooling a little at the sight of Gyokeres’ 54 goals and 13 assists in 52 games (across all competitions) this term.\nChristian Falk now reports that the Gunners won’t be alone in their pursuit of Benjamin Sesko. More to the point, Manchester United could rely on the expertise and connections of Christopher Vivell to beat Arsenal to the punch.\n“Arsenal have ceased their recruitment drive and have declared Benjamin Sesko or Viktor Gyökeres (Sporting Lisbon) as their favourite targets. RB Leipzig are willing to talk for upwards of €70m, and ideally Sesko should fetch up to €100m,” the head of football at the BILD Group exclusively informed CaughtOffside.\n“Despite his young age, the Slovenian is almost complete, has a clear head and is a real team player. He would be an asset to any club. There are already talks with Arsenal.\n“From the Premier League, beside Arsenal also Manchester United are particularly interested. Christopher Vivell (United’s director of recruitment) was there to watch Sesko at the game in Wolfsburg in mid-April. He once helped discover him and brought the footballer to Salzburg as a 16-year-old in 2019.”\nIt seems a rather slim advantage for United to exploit. Still, at a fee potentially rising to £84.3m [€100m], Arsenal could opt for the comparatively cheaper option in Viktor Gyokeres at £60m if needs must.\n?? 39 goals in 34 games in Portuguese league this season for Viktor Gyökeres, winning the title once again with Sporting.\n…and now preparing his exit with £60m move expected to happen this summer. pic.twitter.com/5X802QyKq2\n— Fabrizio Romano (@FabrizioRomano) May 17, 2025\nOur in-house Arsenal expert (and CaughtOffside editor) Mark Brus had this to say about the North London-based outfit’s striker pursuit:\n“With no one in Arsenal’s current squad reaching double figures for league goals in 2024/25, the need for a new striker is obvious, and has long been understood to be a priority for this summer.\n“There was genuine interest in Ollie Watkins in January, but Arsenal ultimately preferred to wait until the summer to get their man, with Mikel Arteta being a big fan of Benjamin Sesko for some time.\n“It’s not the easiest market for strikers right now, and it also seems likely that Arsenal will seek to improve their attacking output with the signing of a top class winger later in the window.”\nIs Viktor Gyokeres worth the gamble?\nChances are, Arsenal can afford some time to consider the options on the table. Unlike the Red Devils, Mikel Arteta’s men can offer both strikers Champions League football and a genuine crack at the Premier League title race next term.\nOne might reasonably suspect United will struggle to surmount either hurdle in the near future – especially if their post-season campaign is anything to go by!\n* Stats in the 2024/25 season courtesy of Sofascore & FBref\nGyokeres’ numbers are, of course, absolutely obscene. But it’s worth pointing out that the Swede would appear to enjoy considerably greater freedom in the opposing penalty box, judging by the 2024/25 season heatmaps.\nThis may indicate the Sporting star’s superior ability to find space inside the 18-yard box, his teammates’ ability to find him, or even hint at the comparative quality between both leagues.\nOne might reasonably assume that Viktor Gyokeres is a serious beneficiary of that latter point, with Bundesliga defences being far superior on average.\nEither way, Arsenal can argue for Benjamin Sesko’s potential (being 22) and the reasonable possibility of scaling up his numbers via development and placement in a stronger team.\nGyokeres’ numbers, even should they scale down as expected in line with the quality shift to the Premier League, of course, could still be more than satisfactory.",
  "word_count": 745,
  "scraped_at": "2026-02-14T01:52:26.357482",
  "_text_extracted": true
}