{
  "article_id": "426f2a5b087e",
  "url": "https://www.the42.ie/republic-of-ireland-jason-knight-6722510-Jun2025/",
  "title": "  There is a line ... you know what you can play through and what you cant  ",
  "date": "20250604T093000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EARLY JUNE AND credit to the League of Ireland for being prepared to pause for breath and allow its players a chance to recharge.\nThe final stages of the Nations League take place in Germany over the next week, before FIFA’s expanded Club World Cup kicks off on 15 June in the United States.\nSo, no time for beaten Champions League finalists Inter Milan to dwell on that sobering 5-0 defeat to PSG as they will be back in action. An Irishman will also feature on that opening weekend when Kildare native Dylan Connolly turns out for New Zealand’s fully amateur outfit Auckland City against European royalty Bayern Munich.\nThis month will be filled with games before the final in New Jersey on 13 July; a date sandwiched between both legs of Shelbourne’s Champions League first-round qualifying tie.\nBy that point, Premier League clubs will also be back in pre-season action ahead of the 2025/26 campaign and, just six days after the Club World Cup final, Manchester United will play Leeds United in a friendly in Stockholm.\nOn and on it goes, as seasons blend into one.\nThe Republic of Ireland, of course, have two friendlies of their own over the next week as preparations continue for a condensed World Cup qualifying campaign that means September through to November is make or break for manager Heimir Hallgrímsson.\nHe opted to leave out the majority of his Championship players from this squad so they could have the benefit of longer holidays this summer before – as the Ireland boss put it – they spent next year on duty at the World Cup.\nSomeone who has been able to take time to relax on a couch is John Egan, who was a guest on a special live show for the Second Captains podcast in Cork last week. The 32-year-old still harbours ambition to play a role in those qualifiers in the autumn after rebuilding fitness and form over the last nine months with Burnley and Hull City.\nAn achilles injury in September 2023 brought a premature end to Egan’s Premier League career as well as his time at Sheffield United, a club he helped earn promotion to England’s top flight on two occasions.\nHe explained on Second Captains how he went into a match with West Ham with injuries to his ankle and knee but didn’t want to pull out of the starting XI as it had been a tough start to the season.\n“When you’re carrying an injury, it affects the rest of your body if you keep playing. That’s advice I’ll give to any young fellas or any people with young kids, going forward mind your body because you know you get an injury somewhere, it could be affecting you somewhere else,” he said.\n“It cost me the rest of the season, probably cost me the rest of my Sheffield United career, which was sad. Yeah, I think it’s (playing while injured) definitely an Irish thing. You kind of feel embarrassed if you don’t train or you don’t play, you know? That’s how I felt anyway, and then you get the Europeans coming in and they’ve a little knock, they don’t play and you think ‘come on, man, just play’, [but] they’re going to be still playing when they’re 40, if they want.\n“I’ve learned the hard way. If I could go back I wouldn’t play that game. I’d wait until I was right or until I had a two or three-year contract behind me. That’s the be all and end all.”\nThose words, combined with a further elongation of the club and country calendar, seemed all the more prescient when Jason Knight was put up as the Ireland player on media duty yesterday.\nNow captain at Bristol City and still only 24-years-old, he played every minute of his side’s 46-game regular campaign as well as the defeat over two legs to Sheffield United in the play-offs. That’s even more impressive when you consider he was coming off the back of the 2023/24 season when he also played 3,848 minutes of 4,140 available.\nKnight did manage a two-week break before joining the squad – Preston’s Robbie Brady the other Championship player required for duty – and accepts it’s hard to argue with Egan’s regrets.\n“John is probably right. There is a line and as you get older you get more experienced and you know what you can play through and what you can’t,” he said.\n“There’s always knocks and niggles you can get through but I have been fortunate to get through the season without hurting myself too badly so a bit of luck as well. You can always get through a certain pain barrier and get on to the pitch.”\nThat posed an obvious question: what is the line for you?\n“If the leg isn’t off, I suppose,” Knight said.\nJohn O’Shea, Ireland’s assistant head coach, was sitting alongside the midfielder at the press conference and expanded on the kind of attitude and application that makes Knight so important.\n“He is naturally leading now, vocally but also performance and intensity-wise. If we are doing a drill in training, you know if Knighty is involved in it that it is going to take care of itself and that is brilliant for a coaching staff, to have that and to see that reliability.\n“It’s also a trust to know what he is going to produce for the team as well. He has grown into the role for club and country. I’m sure there’s lots of people looking at him and I’m sure Bristol City are very happy with him too.\n“There’s always that element of him being new school and old school, but it is a good school that he is from. Hopefully it continues.”\nInterest from other clubs for Knight is not at a stage where any transfer could be imminent. “It’s been a bit quiet for the last couple of weeks,” he said.\nThings move quickly in football and Knight knows that. “I want to be ambitious. I want to play in the top division. But I’m relaxed, if it’s now or in the future, that will be. I’ve just got to keep performing well to get to that point.”\nAnd if that means another summer still on the clock at the biggest show of all next summer then so be it.",
  "word_count": 1063,
  "scraped_at": "2026-02-14T02:02:47.533569",
  "_text_extracted": true
}