{
  "article_id": "428ed4c5270f",
  "url": "https://www.managingmadrid.com/2023/12/11/23996511/carlo-ancelotti-press-conference-champions-league-union-berlin-girona-laliga-202324",
  "title": "Ancelotti :  It surprising to see Girona capacity to be at that level  ",
  "date": "20231211T233000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid will wrap up the UEFA Champions League group stages in Berlin on Tuesday night, but before that, coach Carlo Ancelotti spoke to the press ahead of Monday evening’s training session. One of the questions, before moving onto Tuesday’s game, was about another LALIGA fixture on Sunday night as Ancelotti was asked about Girona’s win over Barcelona. Ancelotti said: “I can talk as a football fan. It was a very entertaining game, with two teams up against each other. Both tried to win. Girona were better, because they were more clinical. I have to stop there, I can’t criticise or not criticise anyone or give a technical or tactical speech. I liked the game, it was entertaining. It was surprising to see Girona’s capacity to be at that level with so much personality and character.”\nAncelotti: “It’s surprising to see Girona’s capacity to be at that level”\nThe Real Madrid coach spoke before the game against Union Berlin\nAncelotti on being favourites to win the Champions League\n“I think Real Madrid’s history makes it one of the favourites to win the Champions League always. Whatever happens in the group stage. It’s always complicated to win this competition, but I think we have the quality to fight until the end.”\nAncelotti on the game against Union Berlin\n“The objective is achieved. To finish top in the group. We want to end the group stage well and show a good image of ourselves. This is a special competition and we have to play a good game and show our seriousness and professionalism. Our image is at stake and we need to play a good game and try to win.”\nAncelotti on rotations\n“The idea I have is to evaluate the players who played at the weekend and, from there, choose the best 11. The players who played and aren’t tired can play, obviously, but if they are tired and haven’t recovered from the Betis game, they will rest. The idea isn’t to rotate just for the sake of it. It will be if a player is at risk and could have problems.”\nAncelotti on whether Nico Paz could start\n“It could be. It will depend on how training goes. That’s important for me. The medical part is too, to see who is in good form and those who need to rest won’t play and others will have opportunities.”\nAncelotti on being favourites to win the Champions League\n“I think Real Madrid’s history makes it one of the favourites to win the Champions League always. Whatever happens in the group stage. It’s always complicated to win this competition, but I think we have the quality to fight until the end.”\nAncelotti on who will play in goal\n“I’ll tell you: Kepa will play tomorrow. Fair or unfair, I don’t think it’s unfair to leave anyone on the bench. Otherwise I’d be unfair every game for leaving someone on the bench. The good thing is that Lunin has had the opportunity to show, with continuity, his characteristics. Firstly for him, but also for us, we are happy to see that. Kepa doesn’t need that confidence, he’s had a career showing it, but Lunin has done a very good job in the games he has played.”\nAncelotti on what Nenad Bjelica has changed at Union Berlin\n“I think the system has changed, the strategy. This is a team that will play more offensively than in the first game. Every coach has their own ideas and everything has changed with this. In football, there are no secrets, and we have to respect them because they want to win their first game in the competition. I think it will be an interesting game and an entertaining one.”\nAncelotti on Nenad Bjelica watching Real Madrid train\n“Yes, he came to watch our training. He stayed for a week, he enjoyed it, and we spent time talking about football. I’m happy to meet him and see him back in work.”\nAncelotti on whether he’ll retire at Real Madrid\n“I’m not a legend, I’m just a coach. The legends are the players who have had fantastic careers here. For me, they have to or will have to retire here.”\nAncelotti on Toni Kroos’ future\n“I think he’s good. What he’ll do next year will be respected by everyone. There are players who choose what they want to do. They are the legends. Players like Kroos, Modrić and Nacho. The club respects them because they’ve earned the chance to make their own choice.”\nAncelotti on Brahim Díaz\n“I think his time in Milan has been very good for him. On a defensive level, he’s worked a lot. He’s returned in an optimal tactical condition. He positions very well off the ball. It’s quite unusual to see that in a forward who has his quality. A forward with his quality usually finds it hard to find the position without the ball, but he does it without any problem.”\nAncelotti on Bellingham and Kaká comparisons\n“I think Kaká got forward with the ball, he doesn’t have the quality that Bellingham has to get into the box without the ball. Also, we don’t always play without a centre forward, which opens opportunities to play in the middle of the box with more space. Kaká played in a different system and it was harder for him. Kaká was very good on the ball, Bellingham’s off the ball movement is very effective.”",
  "word_count": 907,
  "scraped_at": "2026-02-14T01:51:13.786727",
  "_text_extracted": true
}