{
  "article_id": "428ffdefc6c2",
  "url": "https://metro.co.uk/2024/04/29/expect-champions-league-fireworks-bayern-munich-face-real-madrid-20737483/",
  "title": "Expect Champions League fireworks when Bayern Munich face Real Madrid | Football",
  "date": "20240429T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There may be no English clubs involved in the Champions League semi-finals but the first leg between Bayern Munich and Real Madrid is as compelling as it gets.\nAny true football fan should be salivating at the prospect of two European powerhouses locking horns in a conflict which would be worthy of the final at Wembley on the first day of June.\nBut anyone still suffering from the exits of Arsenal and Manchester City and missing some type of affiliation to either side in this exciting tie can always tune in to watch England sensations Harry Kane and Jude Bellingham facing off in the type of spine-tingling duel which would grace the gripping climax of a Sergio Leone spaghetti western.\nThe atmosphere will be electric with both sets of supporters loyal to the soil and making noise any time there is a decent pass, strong tackle or unfortunate mistake, let alone a shot on target. The intensity levels at the Allianz Arena will go through the roof.\nIt hasn’t been an easy ride for Bayern fans this season, losing the Bundesliga title which seemed theirs by divine right until Bayer Leverkusen ripped their crown away and they also crashed out of the German Cup when they were humiliated by the minnows from Saarbrucken.\nBut when it has mattered most, the stars from FC Hollywood turned up to stroll past Arsenal on the Champions League red carpet, drawing 2-2 at the Emirates Stadium and then winning 1-0 in the return leg.\nReal, a country mile ahead of Girona and Barcelona at the top of La Liga, beat defending champions Manchester City on penalties at the Etihad Stadium as they continue to hunt down a 15th trophy in European football’s ultimate competition.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSo, who will emerge on top after the first 90 minutes of this fascinating affair? Kane scored the 400th goal of his career with a double in the 2-1 win against Frankfurt at the weekend, taking his league tally for the season to 35 and a career-best 42 goals in all competitions.\nWith Bayern enjoying home advantage it’s the obvious play to back Kane at 4/1 with bet365 to open the scoring and at 13/10 with the same firm to get on the scoreboard.\nMore Trending\nBellingham is 49/20 with Unibet and BetUK to find the net at any time and a 2-1 Bayern victory to set up a pulsating second leg at the Bernabeu is 17/2 with the same two firms, SpreadEx, bet365 and William Hill.\n• Ipswich’s promotion charge has faltered with three draws and a defeat since their last victory and they will share the spoils at Coventry at 3/1 with Betway, bet365 and many others.\n• It’s a busy week so here’s the early bet for Thursday’s Premier League Darts. Luke Littler deserves credit for the way he handled the flak directed at him during last week’s victory in Liverpool. He faces Nathan Aspinall in the quarter-finals in Aberdeen and has only lost one of their five meetings in the tournament this year. Two of his wins have been by less than 2.5 legs so go safe and back Littler to win 6-4 at 5-1 with Paddy Power and Betfair and 6-5 at 6-1 with the same firms and enjoy a nice return.\nMORE: Arsenal star David Raya says he will ‘learn’ from mistake against Tottenham\nMORE: Thiago Silva issues promise to Chelsea fans after announcing he is leaving",
  "word_count": 627,
  "scraped_at": "2026-02-14T02:07:51.316269",
  "_text_extracted": true
}