{
  "article_id": "4295213ee57b",
  "url": "https://www.lbc.co.uk/article/sheffield-wednesday-file-administration-5HjdFqd_2/",
  "title": "English Championship side Sheffield Wednesday file for administration",
  "date": "20251024T121500Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sheffield Wednesday file for administration and deducted 12 points\nCourt filings show the papers were filed on Friday, with the club sitting bottom of the Championship.\nEnglish Championship side Sheffield Wednesday have filed for administration and been handed a 12-point ban, court papers show.\nListen to this article\nThe Second-tier Championship side officially filed for administration on Friday according to documents.\nThe filing comes amid mounting financial issues for the club.\nThe English Football League (EFL) had previously charged the club after it breached multiple regulations - namely failing to pay players' wages on time.\nThe club's owner, Dejphon Chansiri, was charged with breaching EFL regulations regarding payment obligations as a result.\nThe EFL followed with a statement which confirmed a 12-point deduction for entering administration but pointed out the process “presents Sheffield Wednesday with the opportunity to move matters towards a successful sale and secure future under new ownership”.\nRead more: Liverpool end four-match losing streak with stunning 5-1 Champions League victory\nRead more: 'Sometimes you need a change:' Marcus Rashford makes it clear he wants permanent Barcelona move\nAfter news emerged of the initial regulation breach earlier in the year, Dejphon Chansiri posted a statement to the side's website, outlining his willingness to sell the club.\nIt tops off a less-than-perfect season, the club, widely known as The Owls, currently sit bottom of the Championship with just six points and one win in 11 games.\nIt comes after the club finished 12th last season.\nThe Thai businessman took over the club in 2015, acknowledging the charges after they were handed down by the EFL.\nPushback over the handling of the club's finances by its owner saw supporters gather outside the Thai embassy in protest, as well as protests at Hillsborough - the side's home ground.\nJames Silverwood, Vice Chair of the Sheffield Wednesday Supporters’ Trust, told LBC: \"Well, nobody wants to see their football club go into administration, of course, but I think the overriding emotion for most Sheffield Wednesday fans is one of elation. Surprisingly, administration for us is having a future again, in my view at least, and I think this is shared by, by many Sheffield Wednesday fans.\n\"The club had no future under the previous ownership. And this is an opportunity for us to start again, start afresh and take all of the incredible qualities, values and tenacity that Sheffield Wednesday fans showed in the protest campaigns that we've been launching over the last few months. So we can turn that energy now into, into rebuilding the club from the bottom up.\n\"I think I speak for most of the fans when I say they are willing to trade the 12 point deduction for administration that is coming in our direction for, for it to mean Sheffield Wednesday having a fresh start from, from the previous owner. Because the football club had no future under the previous owner and not only did it have no future, but it also possibly couldn’t have survived. So when you, when you up the cost benefit analysis of survival and a 12 point deduction, it's an easy one to choose.\n\"Well, the players have been in many respects completely heroic over the start of this season. During the summer, they saw many of their colleagues leave on free transfers because their wages are not being paid appropriately and on time. So, a depleted squad without a proper preseason has done incredible just to get six points and to actually play almost each and every game with an incredible fighting spirit and a lot of tenacity and bravery. So, the message to them is the message we've given them throughout the protest movement, that we salute what they've done on the pitch so far.\n\"It's been nothing short of a minor miracle. And so that would be the message to them. Keep fighting. We'll be back in the stadium with you to support you all along the way. And we've got nothing but incredible words to say to them and the manager, actually Henrik Pedersen, who's done an equally incredible job under incredibly difficult circumstances.\n\"The message from the supporters trust is that everybody who engaged in our campaign in activities, who made incredible sacrifices, whether it was from not buying shirts when they were released in the summer, to not having a well earned pie and pint at half time at the end of a busy working week, to those who miss games so as not to provide Dave on chance with money, all of you can look yourselves in the mirror with a deep sense of pride and achievement.\n\"And all of us can return to the stadium on Saturday with that pride and togetherness, knowing that we came together to battle and fight for a better future for Sheffield Wednesday. And we can turn all that energy now into positivity in. In the ground. You know, go and buy that shirt for your children that you didn't in the summer. Go and have that pint at halftime. Go and renew that season ticket that you didn't during the summer. All of those things that you've sacrificed, the sacrifice is now over. And we can work together and take that togetherness into building a better future for Sheffield Wednesday.\"\nThe club is yet to comment on the filing, with its social media remaining silent on the matter.\nDerby County were the last EFL club to enter administration, with the side submitting court filings in 2021 - as a result, the side were deducted 12 points.",
  "word_count": 928,
  "scraped_at": "2026-02-14T02:15:53.538115",
  "_text_extracted": true
}