{
  "article_id": "42987e0c85b9",
  "url": "https://news.yahoo.com/barcelona-midfielder-pedri-miss-europa-132819465.html",
  "title": "Barcelona midfielder Pedri to miss Europa League second leg against Manchester United",
  "date": "20230217T140000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona midfielder Pedri to miss Europa League second leg against Manchester United\nFC Barcelona and Manchester United fought out an engrossing draw in the first leg of their Europa League play-off on Thursday night, the Catalan outfit both taking the lead and hitting back late on to secure a 2-2 draw.\nIt leaves the tie finely poised ahead of the return fixture at Old Trafford, but Barcelona have discovered the extent of an injury to key midfielder Pedri and the Spanish international will be missing for that second leg.\nOne of head coach Xavi’s go-to starters, Pedri has been a fixture in both the Barcelona and Spain football lineup since his breakthrough in 2020/21. However, he went off injured shortly before half time against the Red Devils and tests have revealed a muscle issue which will sideline him for up to five weeks, report Sport.\nA hamstring strain will see him miss up to seven matches, with the Copa del Rey semi-final against Real Madrid and a LaLiga fixture against Valencia also on Barca’s upcoming run. With the second leg against Man United only a week away, Xavi will need to plan a midfield without him - with Gavi the most likely candidate to move from the attacking line back into midfield.\nSeparately, Real Madrid boss Carlo Ancelotti has confirmed two of his key players will miss the weekend fixture in LaLiga against Osasuna, just days before they play Liverpool in the Champions League.\nHowever, he insisted it was mainly precautionary, with Toni Kroos suffering from flu and Karim Benzema tired after his recent return from injury.\nBoth are expected to return in time for the trip to Anfield, with the last-16 first-leg tie taking place on Tuesday night.\nIn Spain’s top flight, Real Madrid trail Barcelona by eight points after 21 matches.",
  "word_count": 303,
  "scraped_at": "2026-02-14T02:06:47.848313",
  "_text_extracted": true
}