{
  "article_id": "42be3c94049f",
  "url": "https://www.cityam.com/ukraines-shakhtar-hope-to-overcome-hardship-in-decider-against-porto/",
  "title": "Shakhtar eye Champions League knockout place against all odds",
  "date": "20231213T084500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ukraine’s Shakhtar hope to overcome hardship in decider against Porto\nAgainst the backdrop of Ukraine’s invasion by Russia, Shakhtar Donetsk have reached the brink of the Champions League knockout stage and some much-needed financial relief.\nAs difficult situations for football clubs go, things could not be worse for Ukraine’s Shakhtar Donetsk.\nA war at home in Ukraine, damaged club finances and a new manager who has only been at the club for a month and a half leaves the club in a state of uncertainty. If any Champions League club has become familiar with the feeling that everything could fall apart in an instant, it’s Shakhtar.\nBut a Champions League decider tonight offers hope. Should they beat FC Porto in their last group stage tie tonight, they will follow Group H leaders Barcelona into the knockout stages.\nTeams who have previously qualified for the Champions League’s Round of 16 have received a cash injection of at least £30m. It could be critical to Shakhtar’s fortunes.\nIn a complaint against Fifa before the European Commission earlier this year, they said they lost €40m after the international football governing body amended rules to allow foreign players affected by the war to suspend their contracts. This followed a defeat at the Court of Arbitration for Sport, who dismissed their appeal against Fifa’s emergency rules.\nBloomberg reported at the weekend that Shakhtar have approached an advisory firm to discuss deals with Saudi Pro League football clubs. The turn for help to Saudi Arabia – a country which set up a majestic parade for Russian president Vladimir Putin last week – is a sign of Shakhtar’s complex circumstances, as much as it is a sign of Ukraine’s own struggles.\nThough a far cry from the days Shakhtar fielded a team of Brazilian starlets including Willian and Fernandinho, the squad today is not exclusively Ukrainian. Burkinabè striker Lassina Traore has stuck by the club, whereas new signings such as Brazilian winger Newerton and Venezuelan striker Kevin Kelsy have added dynamism to the side.\nIn last year’s Champions League, Mykhailo Mudryk starred in a Shakhtar side who were one game away from reaching the Round of 16. They lost 4-0 to RB Leipzig at home, having beaten them 4-1 in Germany on the first matchday. Mudryk eventually moved to Chelsea in January for a mega £88.7m, boosting the club’s cash flow in the short term.\nThe club played their home games in Poland then. This season, they have been playing their Champions League games in Hamburg, while their league matches have taken place in Lviv.\nThey have effectively been playing away from home for nearly 10 years, moving away from the Donbas Arena in their home city after Russia’s illegal annexation of Crimea in 2014.\nNow, as a result of Russia’s invasion ok Ukraine, they have had to move between places by ground – mostly by bus. Some trips have stretched to 10 hours, while military checks and air raid sirens have disrupted day-to-day activities including training and team meals.\nWith new manager Marino Pusic, who joined from Feyenoord’s coaching team under Arne Slot in late October, Shakhtar have lost three games and won six. The previous manager Patrick van Leeuwen was sacked after three months of poor results.\nTheir hard-fought 1-0 win against Barcelona in early November gave Shakhtar some belief that they could proceed to the next phase of the Champions League. It would be their first continental knockout fixture in six years.\nBut to get the chance to eliminate one of Europe’s behemoths, Shakhtar must first defeat Porto, a club who have themselves been crowned kings of Europe twice, most recently in 2004.\nFootball’s most prestigious club competition has favoured underdog stories in the past. Shakhtar will be hoping for some befitting fortune of their own tonight.",
  "word_count": 633,
  "scraped_at": "2026-02-14T02:10:33.606893",
  "_text_extracted": true
}