{
  "article_id": "42c5d88beed3",
  "url": "https://www.uefa.com/uefasupercup/news/0282-1859396a03e2-47cf41aaa617-1000--super-cup-preview-man-city-vs-sevilla/",
  "title": "Man City vs Sevilla Super Cup preview : Where to watch , kick - off time , line - ups | UEFA Super Cup",
  "date": "20230814T111500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City vs Sevilla Super Cup preview: Where to watch, kick-off time, line-ups\nWednesday, August 16, 2023\nArticle summary\nWhen is it? How can you watch it? What are the line-ups? All you need to know about the 2023 UEFA Super Cup between Man City and Sevilla.\nArticle top media content\nArticle body\nMan City and Sevilla meet in the 2023 UEFA Super Cup at the Georgios Karaiskakis Stadium, Piraeus, on Wednesday 16 August.\nMan City vs Sevilla at a glance\nWhen: Wednesday 16 August (21:00 CET kick-off)\nWhere: Georgios Karaiskakis Stadium, Piraeus\nWhat: UEFA Champions League holders vs UEFA Europa League winners\nHow to follow: Build-up and live coverage will appear here\nWhere to watch Man City vs Sevilla on TV\nFans can find their local UEFA Super Cup broadcast partner(s) here\nWhat do you need to know?\nEuropean champions Man City are taking on UEFA Europa League winners Sevilla in the traditional opener to the new UEFA club competition season.\nThe sides have met four times in UEFA club competition, with City winning all four games (including two in the 2022/23 Champions League group stage). However, Sevilla have been much improved since the arrival of José Luis Mendilibar as coach in March 2023, notably eliminating City's neighbours Man United en route to winning the Europa League for the seventh time.\nThis is first-time European Cup-winners City's maiden Super Cup, while Sevilla have already been here six times before (all as UEFA Cup or Europa League winners). However, they are on a five-game Super Cup losing streak after beating Barcelona 3-0 on their debut in 2006.\nPredicted line-ups\nMan City: Ederson; Walker, Akanji, Gvardiol, Aké; Rodri, Kovačić; Foden, Palmer, Grealish; Haaland\nSevilla: Bounou; Jesús Navas, Badé, Gudelj, Acuña; Jordán, Rakitić; Ocampos, Óliver Torres, Lamela; En-Nesyri\nDo the European champions usually win?\nUEFA Champions League winners Real Madrid lifted the trophy in 2022, but this pattern does not always apply. The European Cup/UEFA Champions League holders have won 27 of the 47 editions. Find a full rundown of UEFA Super Cup records and statistics here.\nExpert predictions\nMatthew Howarth, Man City reporter\nCity’s penalty shoot-out defeat to Arsenal in the FA Community Shield will only have increased their determination to claim their first silverware of what many expect to be another hugely successful campaign. In İlkay Gündoğan, Pep Guardiola may have lost one of the key protagonists of last season’s treble win, but Croatian duo Mateo Kovačić and Joško Gvardiol are exciting acquisitions. The City boss may experiment in Piraeus, but he will be confident his team is too strong for Sevilla.\nGraham Hunter, Sevilla reporter\nDespite Sevilla’s positive and productive pre-season, including defeating the team which beat Man City in a recently friendly [Atlético Madrid], this paints as a slightly uphill battle for the Europa League winners. But this is not a problem which has much daunted Los Rojiblancos since Mendilibar took over. They’ve absolutely thrived on an underdog status. One or two minor injuries and one or two players still to be properly registered with La Liga means this won’t be Sevilla at 100% yet. But they will be smart, competitive and full of ambition as per usual.\nView from the camps\nPep Guardiola, Man City manager: \"You cannot imagine how happy we are to play this game, because we have won the Champions League. We have to take this opportunity; who knows when we will be back? Sevilla will not be easy. When they play well, they win. They have great character and resilience, and I have the feeling that it will make them dangerous against us.\"\nRodri, Man City midfielder: \"Sevilla have shown that they are always competitive. They've been sensational in Europe the last few years. We have to show our best level to beat them. Finals are always complicated. It will be even, and Sevilla have their weapons. We must focus on our own game and how to cause trouble to them.\"\nJosé Luis Mendilibar, Sevilla coach: \"We have to maintain our ideas and try to impose our own football even if we are against the best team in Europe. The side I choose won’t be too different from the last few matches we played in the Europa League last season even if City are a very different, much quicker rival than Roma were.\"\nNemanja Gudelj, Sevilla midfielder: \"We are very excited about the game. We are confident and looking forward to this beautiful match starting. The results against City in the Champions League group stage [last season] aren’t much of a guide. This is a new season and both teams have new players.\"\nWhat is the Georgios Karaiskakis Stadium like?\nNamed in honour of a military commander who died during Greece's struggle for independence in the 1820s, the current home of Piraeus side Olympiacos was initially known as the Neo Phaliron Velodrome, and staged cycling events at the 1896 Olympics.\nUpgraded in the 1960s, it staged the 1970/71 European Cup Winners' Cup final (where Chelsea beat Real Madrid 2-1 after a replay), and was then completely rebuilt to stage the football tournament at the 2004 Olympics. With a capacity of just over 30,000, it is the largest football-only venue in Greece.",
  "word_count": 868,
  "scraped_at": "2026-02-14T02:10:09.489399",
  "_text_extracted": true
}