{
  "article_id": "42d9ee1b0834",
  "url": "https://www.empireofthekop.com/2026/02/03/how-liverpool-chiefs-feel-about-squad-depth-after-january-transfer-window/",
  "title": "Liverpool  confident  in defensive squad depth for rest of the season",
  "date": "20260203T103000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool chiefs are understood to be satisfied with the defensive squad depth that’s available to Arne Slot for the remainder of this season.\nIn the final hours of transfer deadline day, the Reds confirmed the signing of Jeremy Jacquet from Rennes, although he won’t arrive at Anfield until the summer and will continue with the Ligue 1 club for the rest of the current campaign.\nThere were no immediate first-team additions to the squad during January, even with the Premier League champions being beset by numerous injuries at the back, including the season-ending body blows to Conor Bradley and Giovanni Leoni.\nJeremie Frimpong is also currently sidelined, although Joe Gomez’s return is understood to be imminent, and Ibrahima Konate made an emotional comeback against Newcastle last weekend after the recent death of his father.\nLiverpool confident in defensive squad depth\nIn an article for The Athletic exploring the Jacquet transfer in further detail, Andy Jones outlines that the Liverpool hierarchy believe there’s sufficient squad depth in place for the rest of this season, and that the French youngster will be worth the wait once he arrives in the summer.\nHe wrote: ‘With Konate back from compassionate leave, Gomez set to be available for Sunday’s visit of Manchester City following a recent hip injury, and Frimpong’s groin problem not serious, Liverpool are confident they can cope between now and May.\n‘Trying to get Jacquet on board immediately was never a goer, given Rennes’ own push for European qualification. Liverpool believe he will prove to be worth the wait.’\nLiverpool are skating on thin ice when it comes to defensive depth\nWhile the returns of Gomez and Frimpong would leave our defensive options looking rosier – the Dutchman is projected to return towards the end of this month (Premier Injuries) – the worrying reality is that Liverpool will continue to be one absence away from panic setting in among the fan base.\nFor all but the first five minutes of last week’s win over Qarabag, 50% of the Reds’ defence comprised players who are midfielders by trade, with Ryan Gravenberch partnering Virgil van Dijk centrally and Wataru Endo deployed as an emergency right-back.\nIt was Dominik Szoboszlai’s turn to take up the latter role against Newcastle on Saturday, and he may well be asked to do so again in our next three games before Frimpong is due to return (and that’s if all goes to plan with his recovery).\nJacquet’s arrival in the summer is most welcome and comes as a tremendous coup, but the worry is that by the time he rocks up at Liverpool, we mightn’t have Champions League football to offer him in his first season on Merseyside.\nFor the rest of this campaign, the Reds will be skating on thin ice when it comes to defensive depth, even if club chiefs are seemingly satisfied with the quantity of options available to Slot between now and the next transfer window.",
  "word_count": 491,
  "scraped_at": "2026-02-14T01:59:36.848812",
  "_text_extracted": true
}