{
  "article_id": "42f5b8591a1c",
  "url": "https://www.arsenal.com/news/raya-100-apps-zubimendi-and-ucl-targets",
  "title": "Raya on 100 apps , Zubimendi and UCL targets",
  "date": "20250916T123000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Raya marked his 100th Arsenal appearance with a 42nd clean sheet on Saturday, and has reflected on his first two seasons with us.\n“I came here to go a step further in my career,” he said in his pre-Athletic Club press conference on Monday. “I think it was the right decision.”\n“When I came here, Aaron [Ramsdale] was the goalkeeper and was playing. I just try to do my best on the pitch and off the pitch and give a reason to the boss to pick me.\n“I think it was, maybe two years ago that I made my debut, and from there it's been incredible. And having that record, with 42 clean sheets, that credit goes to the team and to the staff.\n“Obviously, when I came to Arsenal, there was a lot of noise, a lot of talk outside. Having Aaron, he's an incredible keeper, and out of nowhere, he gets changed.\n“There was a few games I could have done better, everyone has bad games, the noise was getting louder. I have to focus on the things under my control, I have to be deaf, basically. Just believe in myself.”\nThat belief will be hugely important for all of our players as we look to go all the way in the UEFA Champions League this season.\n“We have belief, we want to win, we are Arsenal and we play to win, that's not a doubt,” Raya said. “That's what we play football for. It's a long journey in the Champions League and the Premier League.\n\"We have a hell of a group, we have a hell of a team and for this year, we are one more year mature and that is going to make a big difference as well.”\nOur goalkeeper was also asked about fellow Spaniard Martin Zubimendi, who was one of Saturday’s stars with a sumptuous volley as well as a header in our 3-0 win over Nottingham Forest.\n“He’s incredible,” Raya said. “I’ve shared the dressing room with him with the national team and now he’s here he’s even surprised me even more.\n“He’s a player that’s so intelligent. He knows how to play for the team, he doesn’t play for himself. His positioning in defence and attack is incredible. It’s a credit to have him.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 411,
  "scraped_at": "2026-02-14T02:26:56.626435",
  "_text_extracted": true
}