{
  "article_id": "43109fd3693f",
  "url": "https://www.caughtoffside.com/2025/12/30/positive-talks-man-city-close-january-signing/",
  "title": "Man City involved in positive talks to sign Antoine Semenyo",
  "date": "20251230T130000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bournemouth are increasingly confident that Antoine Semenyo’s move to Manchester City will be formally completed within the next 48 hours, following a breakthrough in talks over the structure of the deal.\nAccording to journalist Ben Jacobs, discussions held on Monday were positive, particularly around how payments related to the forward’s release clause will be scheduled.\nSemenyo’s contract at AFC Bournemouth includes a £65 million release clause, and while Man City could technically activate it in full, both clubs have been working to agree a payment structure that suits all parties.\nThis would allow City to spread the cost across instalments while still meeting the conditions required for the player’s exit.\nSuch an approach is consistent with City’s recent transfer dealings, where financial flexibility and long-term planning have been prioritised.\nSemenyo has agreed verbal terms with Man City\nOn the player’s side, there are no remaining obstacles. Semenyo has already verbally agreed personal terms with the Premier League giants, signalling his clear preference to join Pep Guardiola’s project.\nThe 25-year-old is understood to be excited by the prospect of working under Guardiola and competing at the highest level domestically and in Europe, with Champions League football a major factor in his decision.\n(Source: FotMob)\nFrom Bournemouth’s perspective, there is a sense of inevitability surrounding the transfer, but also a desire to manage the timing carefully.\nThe Cherries are still hopeful that Semenyo can make a farewell appearance in their upcoming fixture against Chelsea on Tuesday night.\nAllowing him to feature one last time would provide supporters with the chance to say goodbye to one of their standout performers, while also giving the club valuable continuity before his departure is officially confirmed.\nGuardiola wants more attacking depth in his squad\nCity see Semenyo as a player who can add depth and unpredictability to their attacking options, capable of operating both wide and centrally.\nWith a busy second half of the season ahead, Guardiola is keen to have another forward who can rotate seamlessly without a drop in intensity.\nAll indications now point towards the deal being wrapped up swiftly. Once the final paperwork is completed and formal announcements are made, Semenyo’s transfer will mark another significant step in his career.\nTo sign a player who was being chased by Liverpool, Tottenham and Manchester United shows that City are ready to make a statement by convincing one of the best players in the league this season to join them ahead of their rivals.\nMan City star to consider January exit if Pep Guardiola signs Antoine Semenyo",
  "word_count": 423,
  "scraped_at": "2026-02-14T01:59:31.507343",
  "_text_extracted": true
}