{
  "article_id": "433bac892242",
  "url": "https://africa.espn.com/espn/story/_/id/46013967/who-had-better-premier-league-debut-mohammed-kudus-bryan-mbeumo",
  "title": "Who had a better Premier League debut , Mohammed Kudus or Bryan Mbeumo ? ",
  "date": "20250819T103000Z",
  "domain": "africa.espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The opening weekend of the Premier League season saw debuts aplenty up and down the division, with many fans getting the chance to get a first glimpse of their shiny new offseason arrivals.\nDespite diverse fortunes, Tottenham Hotspur (beat Burnley) and Manchester United (lost to Arsenal) fans have plenty of reasons for optimism after the debut performances of Mohammed Kudus and Bryan Mbeumo respectively.\nAnd these two fanbases certainly need some cheer following testing campaigns that left supporters of both clubs peering nervously forward towards the transfer window for a saviour or two, or at least reasons to believe in good times ahead.\nBoth stepped boldly into the market, with United spending the best part of €229 million on four new arrivals, despite their supposed well-documented financial concerns, and Spurs' head honcho Daniel Levy parting with €145 million to bolster the Londoners' ranks with six fresh faces.\nIn Kudus and Mbeumo, who was also linked with a move to Tottenham earlier in the window, Thomas Frank and Ruben Amorim opted for players who already had a track record of impact-making in the Premier League.\nAnd, at 24 and 25, they have room to take their game to the next level in their new surroundings... the perfect recipe for a new terrace favourite.\nSpurs' victory in the Europa League final -- against United -- couldn't distract from a 17th-placed finish in which they lost 22 matches, costing Ange Postecoglou his job. United were little better, with the mid-season replacement of Erik ten Hag with Amorim resulting in a 15th-place finish, but still their worst campaign during the Premier League era.\nKudos to Kudus\nFollowing a bright showing in the UEFA Super Cup final defeat by Paris Saint-Germain in Udine in midweek, Kudus was scintillating as Tottenham dispatched Burnley 3-0 on Saturday, demonstrating exactly why the club opted to sign him from rivals West Ham United for €63.80 million.\nTwo-goal Richarlison dominated the headlines, but Kudus was the architect, sending in a fine cross for the Brazilian to finish in the tenth minute after forging space for himself beyond Josh Cullen.\nOn the hour mark, Kudus flexed his flair, pulling away from Quilindschy Hartman with a turn of pace and a drop of the shoulder before sending in an inviting cross which, while not perfectly positioned for Richarlison, still ended up in the back of the net after the Brazil No. 9's inspired scissor kick.\nThe outrageous strike may or may not win Goal of the Season when all is said and done, although there won't be too many goals this term that eclipse his pirouetting finish.\nThe Premier League's all-time top scorer Alan Shearer lauded Kudus's assist on Match of the Day, describing it as \"great wing play, just as it was for the first goal,\" while the Ghana international's understanding with Richarlison and Spurs' other (fit) forward options already appears to be a key strength for the Lilywhites in this post-Son Heung-min era.\n\"I really get the boost and the encouragement [from fans], even though it's part of my DNA, my game, to get in [attacking] positions like this,\" Kudus told Spurs' media team after the game.\n\"Also [I have] the help of the team, because they need to get the ball in, with me higher up in those positions, but definitely the energy from the fans brought a boost even though that's what I love to do, take players on, try to create, and help the team to win.\"\nRicharlison, who has already scored half of the entirety of his league goal tally from last season, was positively purring about Kudus's debut.\n\"Thank you for the assist,\" Richarlison said in his post-match interview. \"I'm so happy with this guy, I think next week he needs to score, because he's working too hard for the team.\n\"I think this guy is a Brazilian!\"\nShaka Hislop and Mark Donaldson discuss Mohammed Kudus' performance in Tottenhams 3-0 win over Burnley, in which he contributed with 2 assists.\nAgainst Burnley, Spurs fans saw the various elements of Kudus's game that make him such a watch-able, complete, and - potentially - lethal attacking talent, offering Spurs a versatile threat across the forward line.\nDespite some questions about his attitude and consistency, Kudus is one of the finest dribblers in world football, with no one completing more successful dribbles than the Ghana international in the Prem over the last two campaigns.\nHe's a worker with and without the ball as well, and while he's coming off the back of a testing campaign with West Ham, has demonstrated previously -- both at Ajax and in England -- that all of his eye-catching football is underpinned by a killer instinct.\nOperating largely as a false nine, he had a hand in six goals in six Champions League group stage games during the 22-23 season, before contributing 20 goals and assists combined in his first season with the Irons, including a Goal of the Season contender against SC Freiburg.\nWest Ham's vice-chair Karren Brady explained that the Hammers sought to cash in on the attacker because they hadn't been overly impressed with his performances last term, but they may now be worried about yet another talented prospect thriving in North London after moving from the capital's east.\nHowever, it's a decision that looks to have upset Hammers fans -- witness the 'Judas' banner that accompanied the supporters for their opener against Sunderland -- and West Ham's loss now has the potential to invigorate this Tottenham team this term.\nMbeumo impresses despite defeat\nMbeumo, like Kudus, made his PL debut this weekend on the right side of a front three, even if Amorim's attacking configuration at United pulls the Cameroon international into a more central role than the Ghanaian was operating in against Burnley.\nThe Red Devils weren't able to turn over a new leaf with a victory, Riccardo Calafiori's first-half header proving the different between the hosts and title-hopefuls Arsenal, but at least Mbeumo can hold his head up high after a promising maiden showing with his new club.\nIt was a bit chaotic at times, but the forward did have United's best chance with a goal-bound header towards David Raya, forcing the Arsenal stopper into a decent save, having earlier troubled the Spaniard with a low effort.\nMbeumo brought the intelligent movement, intensity and aggression that highlighted his rise to prominence at Brentford, and while this United-work-in-progress lacked refinement -- and ultimately a goal -- there was evidence of a burgeoning connection between the attacker and fellow new boy Matheus Cunha.\nThere were ripples of electricity when the duo, offering a greater ferocity and composure than United grew used to last season, began to assert themselves, and the pair's combined nine shots during the match was as many as all of Arsenal's players combined.\nIt's tantalising to imagine what a Frank-Mbeumo link-up could have looked like at Tottenham, with the two renewing the partnership that led to 27 Prem goals (scored and assists) last season.\nHowever, all parties can at least look optimistically forward to the coming campaign following this weekend's debuts, with Frank unlikely to be thinking of 'what ifs' after Kudus's two-assist showing, and Amorim seeing, in Mbeumo, an essential addition to realise his vision of what football at Old Trafford needs to look like during his tenure.",
  "word_count": 1223,
  "scraped_at": "2026-02-14T02:11:49.086760",
  "_text_extracted": true
}