{
  "article_id": "435a2a912ec5",
  "url": "https://punchng.com/from-enyeama-to-trubin-five-keepers-with-champions-league-goals/",
  "title": "From Enyeama to Trubin : Keepers with Champions League goals",
  "date": "20260130T003000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Benfica goalkeeper Anatoliy Trubin, on Wednesday, reminded football fans that goalkeepers, too, can score goals. More specifically, in the UEFA Champions League. ABIODUN ADEWALE revisits the moments goalkeepers turned scorers in Europe’s elite competition\nVincent Enyeama\nAs they say, charity begins at home.\nNigerian players are no strangers to UEFA Champions League history, and former Super Eagles goalkeeper Vincent Enyeama has his name on a special page among goalkeepers to have scored in the competition.\nEnyeama achieved the feat in 2010 while playing for Israeli side Hapoel Tel Aviv. On September 29, 2010, the Nigerian stepped up confidently to convert a 79th-minute penalty during a 3–1 defeat to Lyon in the group stage.\nEarlier that year, he had also scored in a 3–2 win away to Red Bull Salzburg during the qualifying rounds, although only goals scored in the group stage and beyond count as official Champions League goals.\nAcross his career, which sparked into prominence at former Nigerian champions Enyimba, Enyeama scored 15 penalties in competitive matches, excluding shootouts.\nHans-Jörg Butt\nGerman goalkeeper Hans-Jörg Butt remains the most prolific goalscoring goalkeeper in Champions League history, with three goals to his name — remarkably, all scored against Juventus.\nHis first came for Hamburg in a thrilling 4–4 draw in 2000. He struck again two years later for Bayer Leverkusen in a 3–1 win over the Italian giants, before completing the set in 2009 with Bayern Munich, calmly converting a penalty in a 4–1 victory.\nSinan Bolat\nDuring the 2009/10 season, then-Standard Liège goalkeeper Sinan Bolat scored the first non-penalty goal by a goalkeeper in Champions League history.\nWith qualification on the line against AZ Alkmaar, Bolat surged forward in stoppage time and powered home a towering header from a corner to secure a dramatic 1–1 draw. The goal sent Standard into the Europa League and remains one of the competition’s most iconic late moments.\nNow 37, the Turkish goalkeeper is currently plying his trade in his home country with second-division side Iğdır FK.\nIvan Provedel\nTwo seasons ago, Lazio’s Italian goalkeeper Ivan Provedel produced one of the Champions League’s most viral moments.\nOn matchday one of the 2023/24 season, Lazio were seconds away from defeat against Atlético Madrid when Provedel surged into the penalty area and rose highest to head home a dramatic equaliser, sealing a 1–1 draw and sending the Stadio Olimpico into raptures.\nAnatoliy Trubin\nBenfica goalkeeper Anatoliy Trubin is the newest member of this exclusive club.\nWith Benfica’s Champions League fate hanging by a thread, the 24-year-old was sent forward in stoppage time and found space in the box to head home a dramatic late goal, sealing a 4–2 win and confirming the Portuguese side’s progression to the knockout play-offs.",
  "word_count": 453,
  "scraped_at": "2026-02-14T02:12:22.652297",
  "_text_extracted": true
}