{
  "article_id": "43669f01a98f",
  "url": "https://www.teamtalk.com/news/exclusive-aston-villa-target-65m-chelsea-flop-with-arsenal-forgotten-star-also-on-emerys-radar",
  "title": "Exclusive : Aston Villa target £65m Chelsea flop with Arsenal forgotten star also on Emery radar",
  "date": "20240419T150000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Exclusive: Aston Villa target £65m Chelsea flop with Arsenal forgotten star also on Emery’s radar\nAston Villa are in the market for a new left-back and TEAMtalk understands that Chelsea’s Marc Cucurella is among the players that have been looked at.\nWith a return to the Champions League potentially on the cards for Unai Emery’s side next season, the club will be keen to bolster their squad in a number of positions.\nAs things stand, Aston Villa sit fourth in the Premier League with five games to go. They also made it to the UEFA Europa Conference League semi-final, following a thrilling tie with Lille.\nWith Emery at the helm, the club have shown some serious ambition in recent transfer windows and by all accounts, the upcoming window could be just as exciting.\nTEAMtalk understands that Aston Villa are after a new left-back in the summer and according to sources, they have looked at Cucurella from Chelsea.\nIt’s fair to say that since making the £65m switch from Brighton in 2022, the Spanish full-back hasn’t had the best of times in London.\nHe struggled to adapt during his debut season at the club and despite showcasing more of his talent this year, he has missed a large portion of the campaign through injury.\nIn February, TEAMtalk revealed that Chelsea are ready to offload the 25-year-old in the summer which could pave the way for Aston Villa to swoop in.\nIf Aston Villa can secure his signature for a reasonable price, this would be a deal worth considering. During his Brighton days, he was one of the most sought-after full-backs in the Premier League and what’s to say he couldn’t rediscover that sort of form under Emery?\nDON’T MISS: Aston Villa plan to act fast in transfer for rapidly rising Man Utd target as Emery makes plans clear\nAston Villa have alternative targets in mind\nWhile Aston Villa have looked at Cucurella, the club also have some alternative targets in mind as they look to sign a new left-back in the upcoming window.\nTEAMtalk understands that Arsenal’s Kieran Tierney is also a target for Aston Villa. Of course, Emery has signed the Scottish full-back previously when he was at the Emirates and a reunion could yet be on the cards.\nThe 26-year-old has spent the season out on loan with Real Sociedad and his long-term future is likely to be away from the Emirates.\nThere’s no denying that Tierney has had a frustrating time over the last few years with injuries, although he is still a very capable player when fully fit.\nEarlier this month, TEAMtalk sources confirmed that Arsenal are planning to sell the Scotsman in the summer and they will consider bids in the region of £25m.\nDuring a recent interview with talkSPORT, Tierney opened up on his current situation and detailed how much he has been enjoying life in Spain.\n“Honestly, this is an incredible experience, I enjoy it,” Tierney said. “It’s a shame that there is so little time left, there are a good six or seven weeks left of the season.”\nWhen asked about returning to Arsenal, he added: “In football you never know. It’s a bit strange that you can come back the way (William) Saliba did. It is strange to be on loan for four years and then return to play.\n“Football is crazy, so we’ll see. I’m not talking to Arteta, he’s busy there.”\nREAD MORE: Aston Villa preparing ‘considerable’ bid for transformative Napoli star who’ll push Villans men out",
  "word_count": 587,
  "scraped_at": "2026-02-14T01:56:51.550697",
  "_text_extracted": true
}