{
  "article_id": "437725fe12a5",
  "url": "https://thepeoplesperson.com/2025/05/01/match-report-man-united-women-0-1-chelsea-women-293493/",
  "title": "Match Report : Man United Women 0 - 1 Chelsea Women - Man United News And Transfer News",
  "date": "20250501T093000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United Women came up short 0-1 despite a valiant effort against a Chelsea side who clinched their sixth consecutive league title.\nUnited manager Marc Skinner promised that the Red Devils would attack the contest and that is exactly what they did at the Leigh Sports Village, with 16 shots to the champions’ 11.\nNonetheless, it was Chelsea who first drew a stop from Phallon Tullis-Joyce in the United goal. The Blues’ Mayra Ramírez fired across goal but it was well stopped by the Red Devils’ goalkeeper at the near post.\nUnited almost got their noses in front shortly after, when Hinata Miyazawa won the ball back in midfield and released Melvine Malard, who ran at the defence and unleashed a powerful shot that was parried to Grace Clinton. Unfortunately, the England international’s close-range effort was blocked by the visitors’ committed defence.\nMoments later, a loose back pass by the champions’ defender was jumped on by Malard but she could not round the keeper, Hannah Hampton, and had to turn back for assistance. She eventually laid the ball off to the waiting Clinton but her effort was well parried over the bar.\nUnited entered the half-time break on top and dreaming of making Chelsea wait just a little longer to celebrate their title win.\nThe home side continued the second half in similar fashion when Jayde Riviere won the ball high up the pitch and Clinton quickly played in Malard, but her effort was straight at the Chelsea shot stopper.\nSkinner’s side continued to press the Chelsea defence and midfield effectively and once again won the back early, which allowed Dominique Janssen to release a long distance effort that was easily stopped by Hampton.\nNonetheless, Chelsea are champions for a reason and they fought their way back into the game. Tullis-Joyce was called into action to make an outstanding triple save to keep the scores level. First she stopped a long range effort from Aggie Beever-Jones and then was alert to stop Johanna Rytting Kaneryd’s rebound.\nThe best save came last as she spread herself wonderfully to deny Erin Cuthbert from close range. Sadly, United could not capitalise on this and on 74 minutes, Lucy Bronze headed in what would be Chelsea’s winner.\nSandy Baltimore’s teasing corner was met by Bronze with Tullis-Joyce lost at sea, as she came off her line to claim the ball. The American keeper made amends shortly after however, when she denied Catarina Macario from just outside the penalty box.\nUnited finally ran out of juice and struggled to mount any serious attacks on the Chelsea box in the final 15 minutes of action.\nNonetheless, Skinner’s side have certainly closed the gap on Chelsea this year and will be hopeful of securing Champions League football next season with a win or draw against Manchester City on Sunday.\nUnited fans will also have seen enough encouragement that they can match Chelsea over 90 minutes, so will hope they can get the last laugh in the FA Cup final later this month.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 510,
  "scraped_at": "2026-02-14T02:15:07.786377",
  "_text_extracted": true
}