{
  "article_id": "4384e16838d1",
  "url": "http://thepeninsulaqatar.com/article/15/02/2023/acl-qatar-set-to-host-west-zone-matches",
  "title": "ACL : Qatar set to host West Zone matches",
  "date": "20230215T093000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nDoha: Qatar is set to host the Round of 16 matches of the West Zone in the AFC Champions League (ACL) from February 19 to 26.\nJapan’s Urawa Red Diamonds, having booked their spot from the East Zone last August, await their final opponents with a quality cast set to battle in the West Zone Round of 16 on February 19 and 20.\nOn February 23, quarter-finalists will compete for a spot in the semi-finals, which will take place the following week on February 26.\nThere will be one Qatar team in the quarter-finals after Al Duhail and Al Rayyan found themselves pitted against one another in the match slotted for February 19. which will be followed by another game in which Saudi Arabia’s Al Shabab will take on Nasaf of Uzbekistan at Al-Janoub Stadium.\nAl Duhail were the runaway winners in Group D, registering five victories to finish eight points ahead of Saudi Arabia’s Al Taawoun.\nThey will be on a mission to progress, having been eliminated in the group stage of the 2020 and 2021 seasons and will head into the Round of 16 in good form, having taken firm control of the 2022-23 Qatar Stars League season.\nHowever, Al Rayyan’s domestic form pales compared to Al Duhail’s, but that shouldn’t stop them from challenging Al Duhail, especially after booking an inaugural appearance in the AFC Champions League Round of 16 following a runners-up finish in Group A.\nQualifying to the Round of 16 meant doing so at the eleventh time of asking, as Al Rayyan had never reached the knockout rounds in 10 previous attempts.\nHaving now done so, they will be aiming for the quarter-finals at Al Duhail’s expense.\nThe next day, Saudi side Al Faisaly will play Iran’s Foolad at Al Thumama Stadium. On the same day, Saudi Arabian giants Al Hilal – the defending champions – will lock horns with UAE’s Shabab Al Ahli Dubai on the same day at Al Janoub Stadium.\nIt is noteworthy that the first leg of the final will be held on April 29, 2023, at the home of the West zone winners, while the return match will be held on May 6, in Saitama, Japan ( home of Japanese outfit Urawa Red Diamonds, who qualified for the final from the East Zone).\nDuring the height of COVID-19, Qatar hosted the 2020 AFC Champions League matches for clubs in the East and West regions, as the Qatar Football Association created bubble environments as 10,000 fans watched the matches, and nearly 900 players and technical staff from 30 teams participated in the AFC Champions League competitions.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 504,
  "scraped_at": "2026-02-14T02:06:47.852045",
  "_text_extracted": true
}