{
  "article_id": "438dffcec275",
  "url": "https://www.aol.co.uk/articles/enzo-maresca-leaves-chelsea-crisis-122904880.html",
  "title": "Enzo Maresca leaves Chelsea after crisis talks with new manager search underway",
  "date": "20260101T144500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca leaves Chelsea after crisis talks with new manager search underway\nChelsea have parted company with Enzo Maresca and are now searching for a new head coach.\nThe relationship between Maresca and Chelsea had frayed in recent weeks and crisis talks on Thursday saw them agree that a change was needed.\nThe club are expected to move swiftly to appoint a new head coach. One candidate in the frame is Liam Rosenior, who has impressed in charge of Chelsea’s sister club Strasbourg, currently seventh in Ligue 1 in France.\nMaresca leaves Chelsea after 18 months in charge, during which time he won both the Conference League and Club World Cup, which marked the club’s first two pieces of silverware since Roman Abramovich sold the club to Todd Boehly and Clearlake Capital in May 2022.\nBut Chelsea have won just one of their last seven Premier League matches and were booed off after a 2-2 home draw with Bournemouth on Tuesday night.\nAfter that game, Maresca chose not to conduct his usual post-match media duties, which it was claimed was down to him feeling unwell. The club’s hierarchy did not look favourably upon that, but their relationship had already soured by that point.\nMaresca said in a previous press conference that the period after the 2-1 defeat to Atalanta in the Champions League on December 9 had been the “worst 48 hours” of his tenure, because he felt he and his players had not been “supported”.\nClub statement: Enzo Maresca.\n— Chelsea FC (@ChelseaFC) January 1, 2026\nThose were quotes which confused Chelsea staff but were generally accepted to have been directed at the club’s hierarchy and signified a worsening of the relationship between Maresca and his bosses.\nStandard Sport understands that Maresca was uneasy with some of the ways the club is run, while his bosses were concerned by their dip in form and put out by a few of his comments in media interviews.\nWhen he was hired in July 2024, it was originally planned that Maresca would be safe in his job until a two-year review in the summer of 2026, barring a run of disastrous results.\nA statement on Thursday lunchtime confirmed Maresca’s departure, and read: “Chelsea Football Club and Head Coach Enzo Maresca have parted company.\n“During his time at the club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup. Those achievements will remain an important part of the club’s recent history, and we thank him for his contributions to the club.\n“With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the club believe a change gives the team the best chance of getting the season back on track. We wish Enzo well for the future.”",
  "word_count": 469,
  "scraped_at": "2026-02-14T02:27:05.504553",
  "_text_extracted": true
}