{
  "article_id": "43a8ab7ae2c9",
  "url": "https://www.caughtoffside.com/2024/06/15/copa-america-brazil/",
  "title": "Copa América team preview : Dorival Júnior Brazil a team of unknowns",
  "date": "20240615T181500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brazil is one of the greatest football nations on planet Earth and have a rich history of success in international tournaments. With five World Cups and nine Copa Americas to their name, Brazilian national teams of the past have entertained the masses, both collectively and with their individuals.\nExpectations in the country are always high when it comes to football, with the final being the very minimum a Brazil team should achieve.\nThis Seleção is a lot different; it is a team in transition under their new coach Dorival Júnior, who only took charge of the squad in January. The 62-year-old has overseen only four friendlies with the South American country, winning two and drawing the others.\nThe former Sau Paulo boss is well-known in Brazil and he will take his team to the United States with the intent of returning with the Copa America trophy.\nHowever, Dorival would prefer to be returning from America in two years with the World Cup, with this summer’s tournament being preparation for the biggest competition of them all.\nBrazil are a team in transition and if they are to win the Copa America over the coming month, it may come down to their individuals, who are also not as talented as the many that came before them.\nPrevious Copa America finish\nBrazil hosted the 2021 version of the Copa America after the tournament was moved from 2020 due to the COVID-19 pandemic.\nThis change provided the Seleção with a dream opportunity to win a major competition on home soil, but things did not work out that way. Tite’s side were the favourites heading into the tournament but ended the competition as runners-up, losing 1-0 to archrivals Argentina in the final.\nThe Brazilians topped their group with three wins and a draw against Ecuador in the final game of this stage.\nTite’s men would overcome Chile in the quarter-finals and Peru in the semis with 1-0 wins, which guided them to the final at the famous Maracanã Stadium. An Angel Di Maria would help Argentina bring the trophy home, leaving Brazil heartbroken over the opportunity that slipped away.\nSquad\nBrazil finalised their squad for the 2024 Copa America this week with Dorival having to cut it down to a group of 26 players.\nSome big names are absent from the final panel, who are now in the midst of their preparations for their opening game of the tournament which takes place on June 24 against Costa Rica at the SoFi Stadium in Los Angeles.\nGoalkeepers\nAlisson (Liverpool), Bento (Athletico Paranaense), Rafael (Sao Paulo).\nDefenders\nMarquinhos (PSG), Danilo (Juventus), Eder Militao (Real Madrid), Gabriel Magalhaes (Arsenal), Guilherme Arana (Athletico Mineiro), Bremer (Juventus), Yan Couto (Girona), Lucas Beraldo (PSG), Wendell (Porto).\nMidfielders\nLucas Paqueta (West Ham United), Bruno Guimaraes (Newcastle United), Douglas Luiz (Aston Villa), Andreas Pereira (Fulham), Joao Gomes (Wolverhampton Wanderers), Ederson (Atalanta).\nForwards\nVinicius Junior (Real Madrid), Raphinha (Barcelona), Rodrygo (Real Madrid), Gabriel Martinelli (Arsenal), Endrick (Palmeiras), Pepe (Porto), Savio (Girona), Evanilson (Porto).\nNotable absences: Manchester City’s Ederson was removed from the camp due to the eye injury he sustained against Tottenham last month with the goalkeeper joining fellow Premier League duo Richarlison and Casemiro, who were not even included in the original squad.\nThe biggest name in Brazilian football will also miss the 2024 Copa America with Neymar continuing to recover from the knee injury that kept him out for the entire season.\nExpected Brazil starting 11\nBrazil’s starting 11 for Copa America will likely change throughout the tournament as Dorival Junior will be trying to find his best 11 over the course of the month. The Brazilian coach likes to set up in a 4-3-3 or 4-2-3-1 formation, with the latter being used in their most recent match against the USA.\nThe South American nation have options in every area of the pitch but their team will look something like the following 11.\nKey player\nVinicius Junior\nShould Brazil win Copa America this summer in the United States, there is no doubt the fingerprints of Real Madrid’s Vinicius Junior will be all over it.\nThe winger is regarded by many as the best player in the world alongside Kylian Mbappe and should he win and perform in America this summer, a first Ballon d’Or may be waiting for him at the end of the year.\nVinicius produced 24 goals and 11 assists across 39 games for Real Madrid this season as Los Blancos secured La Liga and Champions League crowns once again.\nThe Brazilian was instrumental in the Spanish giants winning their 15th European Cup in 2024, scoring in every stage of the competition apart from the quarter-finals. The 23-year-old will need to be this influential for Brazil as there are not a lot of superstars in Dorival’s current group.\nPredicted finish\nThere are a lot of issues with the current Brazil squad but Dorival Junior’s team should do ok and finish the tournament in third place.\nThe Brazilians should top their group which contains Colombia, Paraguay and Costa Rica.\nThat could earn them a quarter-final clash with the USA and victory over the hosts should see them face Uruguay in the semi-finals. That may be a step too far for Brazil as Marcelo Bielsa’s side are very strong.\nThe Seleção may meet Ecuador in the third-place play-off, which they would be expected to win and finish a respectable third.",
  "word_count": 898,
  "scraped_at": "2026-02-14T02:01:16.437832",
  "_text_extracted": true
}