{
  "article_id": "43bd7fe5f272",
  "url": "https://www.finanznachrichten.de/nachrichten-2025-08/66272187-sofascore-player-of-the-season-award-show-premieres-on-cbs-399.htm",
  "title": "Sofascore Player of the Season Award Show Premieres on CBS",
  "date": "20250826T121500Z",
  "domain": "finanznachrichten.de",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ZAGREB, Croatia, Aug. 26, 2025 (GLOBE NEWSWIRE) -- This summer in Zadar, sporting legends and top broadcasters came together for the first-ever Sofascore Player of the Season Award Show, filmed during the Sunset Sports Festival. Now, the show has reached millions as it premiered on CBS, bringing together football stories and data-supported awards.\nThe show celebrated Europe's top performers from the Premier League, LaLiga, Serie A, Bundesliga, Ligue 1, and many more leagues across the world, all chosen just through Sofascore's objective performance ratings. No votes, no popularity contests. Mohamed Salah topped the Premier League with a 7.78 rating, Raphinha led LaLiga with 7.80, Mattia Zaccagni claimed Serie A's best with 7.34, Joshua Kimmich was Bundesliga's highest rated player with 7.91, and Achraf Hakimi shined in Ligue 1 with 7.76. Beyond this, the awards also celebrated the highest-rated player in the UEFA Champions League, the top leagues in women's football, and many more standout performers from around the globe.\nYou can watch the full show on THIS LINK\nHosted by Kate Scott and Peter Schmeichel, and directed by Emmy Award-winner Pete Radovich, the event featured exclusive insights from football greats and top analysts including Jamie Carragher, Micah Richards, and Alessandro Del Piero. Raphinha shared his pride as both LaLiga and Champions League's top-rated player, while Luka Modric made history by receiving Sofascore's first-ever Founders' Legend Award. In the audience, big names like Dimitar Berbatov, Stipe Miocic, and Šime Vrsaljko added extra prestige to the celebration.\nThe Player of the Season celebration extended beyond the TV broadcast, with massive billboards in London, Liverpool, Barcelona, Munich, Rome, Frankfurt, Lyon, Metz, and other European cities, showcasing Sofascore's award winners. From Raphinha and Alexia Putellas in Barcelona to Mohamed Salah in Liverpool and Joshua Kimmich in Munich, fans across Europe could see the season's best right in their own cities.\nThe Sofascore Player of the Season Award is built on objective data, not public votes. Every goal, pass, tackle or miss contributes to a rating that reflects what truly happened on the pitch. That's why, for players and all football fans around the globe, Sofascore's Player of the Season trophy is the only award that counts.\nA photo accompanying this announcement is available at https://www.globenewswire.com/NewsRoom/AttachmentNg/9c592e82-c25d-4c58-9d59-c71e41aa115e/en\nFor more information, please contact: Anja Gadža PR Team Lead anja.gadza@sofascore.com\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 475,
  "scraped_at": "2026-02-14T01:52:36.767284",
  "_text_extracted": true
}