{
  "article_id": "43eec7399c42",
  "url": "https://www.teamtalk.com/arsenal/personal-terms-agreed-stunning-75m-brighton-transfer-arteta-brilliance-see-off-liverpool-chelsea",
  "title": "Arsenal transfers : Personal terms agreed on stunning £75m signing , with Arteta brilliance to see off Liverpool , Chelsea threats",
  "date": "20230601T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal transfers: Personal terms agreed on stunning £75m signing, with Arteta brilliance to see off Liverpool, Chelsea threats\nArsenal have an agreement over personal terms in place with Brighton’s Moises Caicedo, and a report has explained why he’s tracking to join the Gunners rather than Chelsea or Liverpool.\nThe Times recently reported Arsenal have given the greenlight to a £170m double swoop for Declan Rice and Moises Caicedo.\nThe Gunners are determined to double down on the progress they’ve made this season. A first return to the Champions League since 2017 means Mikel Arteta needs greater depth and quality than he currently has.\nGranit Xhaka looks certain to make way ahead of the midfield arrivals. The Swiss veteran is on course to join Bayer Leverkusen in a £13m deal, while the surprise name of Thomas Partey too could depart.\nThe first to arrive to take Xhaka and potentially Partey’s place, according to Football Transfers, will be Moises Caicedo.\nIndeed, the outlet note the agreement on personal terms Arsenal struck with the Ecuador international in January remains in tact.\nGunners chiefs have held multiple conversations with Caicedo’s camp since the winter window and the pre-agreed terms are still acceptable to the player.\nAs such, a medical and an agreement over the transfer fee with Brighton are all that remain.\nBelief Arsenal will match £75m asking price\nRegarding the latter, Football Transfers state Brighton are ‘confident’ Arsenal will stump up the full £75m asking price to make a deal straightforward for all involved.\nArsenal have a recent history of bidding below market value and subsequently seeing the player move elsewhere. Raphinha and Mykhailo Mudryk are two examples.\nCaicedo has courted interest from Chelsea and Liverpool too. The Blues joined Arsenal in unsuccessfully bidding for the 21-year-old back in January.\nHowever, in a huge boost for Arsenal, it’s noted Caicedo’s preference is to join a team who have Champions League football on offer. Of the three, only Arsenal can satisfy that demand next season.\nArsenal fans may be wondering what moving for Caicedo could mean for their pursuit of Declan Rice.\nHowever, the report notes a Rice deal will be unaffected. That tallies with the Times’ claim Arsenal were gunning for both players – not just one.\nREAD MORE: Chelsea star tipped for shock Arsenal move with Arteta approach to send three Gunners aces packing",
  "word_count": 397,
  "scraped_at": "2026-02-14T01:48:17.242547",
  "_text_extracted": true
}