{
  "article_id": "43f2b88f71de",
  "url": "https://metro.co.uk/2023/07/01/nicolas-jackson-reveals-advice-from-sadio-mane-over-chelsea-transfer-19048281/",
  "title": "Nicolas Jackson reveals advice from Sadio Mane over Chelsea transfer | Football",
  "date": "20230701T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nicolas Jackson has revealed he sought the advice of Sadio Mane before moving to Chelsea and got a glowing appraisal of new boss Mauricio Pochettino from his compatriot.\nThe 22-year-old completed a £30million move from Villarreal on Friday off the back of a breakout campaign in La Liga which saw him end the season with nine goals in his last eight games.\nJackson had already been the subject of interest from Bournemouth and Southampton in the January window prior to his hot streak – though failed a medical with the former – and there were a host of clubs queuing up to sign him this summer.\nBut it was Chelsea who won the race, with Jackson now revealing that he consulted Senegal team-mate Mane before making the decision.\nAlthough the Bayern Munich forward has never played under Pochettino, they have a shared history with Southampton and Mane was full of praise for the Argentine coach, believing he can have a big impact on Jackson’s development.\n‘I spoke to Sadio Mane about him and he spoke very highly of him, he said amazing things about him,’ Jackson told Chelsea’s official website after his transfer was confirmed.\n‘Sadio told me the manager is going to help me a lot to improve and do well if I listen to what he has to tell me, so that is exactly what I’m going to do.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nJackson also revealed that Chelsea’s history with African legends such as Didier Drogba and Demba Ba played a role in his decision to move to west London.\nHe continued: ‘I watched English football when I was in Africa and now I am here, so it’s a good feeling for me. I grew up watching the Premier League because for me it is the best league in the world, so I love the Premier League and I know a lot about it and Chelsea.\n‘I met Demba when I went to Senegal with the national team and wanted to ask him about Chelsea when I saw him during the last international break, but I couldn’t because there were too many people around. So I decided to wait and text him about it once I have signed for Chelsea and send him the shirt I wore for my signing too.\nMore Trending\n‘I spoke to my agent Diomansy Kamara about the Premier League as well, because he played in England for a few teams, including Fulham, so he knows the league and this area. He told me everything about playing here so I know a lot about it.\n‘I wanted to join a big team and Chelsea is one of the best teams in the world, plus I’ve watched them since I was young. I watched Demba Ba, Didier Drogba, Nicolas Anelka was good too, big players. So I always dreamed of playing for a team like this.\n‘When Chelsea came there was no question in my mind. I always had this kind of team in my mind. I talked to my family and my agent and I have icons who played here – Drogba and Ba, big strikers. So when Chelsea came my heart said the answer should be yes and I decided to follow it and come here.\n‘I remember the Champions League final in 2012 and especially when Drogba scored that header right at the end. I watched those players for Chelsea when I was growing up so I decided to follow in their footsteps. Hopefully that’s what continues to happen now I’m here.’\nMORE: Chelsea confirm £30million signing of Nicolas Jackson from Villarreal\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 671,
  "scraped_at": "2026-02-14T01:56:02.396945",
  "_text_extracted": true
}