{
  "article_id": "43f7d4d0273e",
  "url": "https://www.myjoyonline.com/ucl-bellingham-strikes-injury-time-real-madrid-winner-against-union-berlin/",
  "title": "UCL : Bellingham strikes injury - time Real Madrid winner against Union Berlin",
  "date": "20230921T100000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nJude Bellingham scored an injury-time tap-in as Real Madrid left it late to beat Champions League debutants Union Berlin at the Santiago Bernabeu.\nBellingham's strike was his sixth goal in six matches for Madrid since joining Los Blancos this summer.\nFederico Valverde's 94th-minute shot deflected into the path of the England midfield who tapped into an empty net.\nUnion, in their first Champions League match, were unable to respond with just one minute remaining.\nBellingham once again Real's star\nCarlo Ancelotti chose to play Jude Bellingham in a more advanced number 10 role, and the former Borussia Dortmund and Birmingham City star once again excelled.\nHe was integral to the Spanish La Liga side's creativity in attack as they racked up 22 shots to their opponent's three.\nAnd, for the third time already in his Real career, the 20-year-old netted a winner for Los Blancos inside the final 10 minutes.\nIndeed, without Bellingham's goals Real Madrid would be nine points worse off just six matches into the season.\nUnion Berlin a minute away from famous draw\nReal Madrid were deserved winners, having twice hit the post in the second half, although Union looked set for a fairytale draw at the home of the record 14-time winners.\nThe hosts, semi-finalists in last season's competition, started brightly as Joselu headed Bellingham's teasing cross over the bar.\nBut Ancelotti's side failed to kick on in the first period, although they themselves were rarely threatened by the visitors.\nIn the second half, Real were a team transformed as Lucas Vazquez crossed for Rodrygo who struck the outside of the post in the 51st minute with an acrobatic effort.\nNine minutes later, Union keeper Frederik Ronnow tipped Joselu's header on to the woodwork.\nRonnow also made a series of fine saves to keep out Rodrygo and Luka Modric, while Joselu poked a late volley narrowly wide.\nBut, in the final minute of injury time, Union Berlin failed to deal with a short corner and Valverde's hopeful shot ricocheted into the path of Bellingham, who rolled the ball in from two yards out.\nUnion, who five years ago were playing in the second tier of German football, will hope to bounce back when they host Sporting Braga in their next Champions League Group C match in 13 days' time.\nReal Madrid travel to face Napoli on the same day.\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n44 seconds -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n29 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n55 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n57 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 617,
  "scraped_at": "2026-02-14T02:07:14.750627",
  "_text_extracted": true
}