{
  "article_id": "4418bb64f6ce",
  "url": "https://www.twtd.co.uk/blogs/22022/premier-league-preview-fulham",
  "title": "Premier League Preview : Fulham by ad _ wilkin - Ipswich Town Blog",
  "date": "20240830T114500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Written by ad_wilkin on Friday, 30th Aug 2024 10:49\nTwo games to start the season against Champions League sides and Premier League champions was always going to be a tricky task. This match against Fulham is a much better yardstick as to how Town’s Premier League survival task will fare.\nThe two sides, albeit much changed, faced each other in the Carabao Cup last season with Fulham coming out on top with a 3-1 victory.\nMarco Silva’s side finished 13th in the Premier League last season whilst dealing with the loss of talisman Alexander Mitrovic in January and will be hoping to achieve something similar this year.\nTactically last season Fulham implemented a mid-block and looked to break quickly. They ranked third in the league for long passes and fourth for crosses, making them one of the more direct teams in the league.\nThat trend has continued at the start of this season. They rank fifth in the league for long balls, something Town struggled to deal with on Wednesday evening at Wimbledon.\nThey’ve started this season well and were unlucky to lose their opening game to Manchester United before bouncing back with a 2-1 victory over Leicester and a 2-0 win against Birmingham in the Carabao Cup.\nGoalkeepers\nNumber one keeper Bernd Leno made the fifth-most saves in the league last season. Where Fulham’s defence sometimes looked shaky, Leno was there to provide an experienced presence as he faced 55.7 post-shot expected goals.\nOnly Thomas Kaminski, Wes Foderingham, Jose Sa and, interestingly, Gugliemo Vicario and Andre Onana faced a higher volume of dangerous shots.\nThe experienced keeper looks set to be Fulham’s number one once again this season with the German playing every minute of every Premier League game last season. With Marek Rodak released, fellow German Steven Benda will be the man on the bench aiming to compete with his countryman.\nDefenders\nFulham lost Tosin Adarabayio to London neighbours Chelsea but still have a strong defensive unit. The outstanding member of that unit last season was Antonee Robinson.\nThe 26-year-old American left-back played 37 out of 38 Premier League games and made the most interceptions out of all defenders with a massive 80, which was well clear of Luton’s Teden Mengi in second with 57.\nAs well as his defensive play that ability to win the ball back high up the pitch, he also helped contribute to an impressive six assists.\nOn the other side, Timothy Castagne claimed the right-back spot following his move from Leicester, only missing two games all season.\nHis form saw him start all of Belgium’s games at the Euros and he is a consistent Premier League performer, who also has the versatility to cover left-back if needed.\nConsistency was definitely the name of the game across the Fulham squad and that was even more notable at centre-back, where it was a case of three into two with Calvin Bassey, Tim Ream and Issa Diop sharing the minutes. With Ream heading back to America, Bassey and Diop are likely to be the main defensive pairing this coming season.\nTwenty-four-year-old Nigerian Bassey was signed from Ajax last season and took a bit of time to settle into the Premier League with a few high-profile mistakes, having been sent off against Arsenal and making an error that led to a goal against Tottenham.\nAt the time he was playing on his unfavoured right side of the central defensive pairing. He seized his opportunity when injury hit Ream and he was moved over to the left-hand side and his performances improved markedly. He’s started this season alongside Diop in the heart of defence.\nDiop is another in the Fulham squad with bags of Premier League experience with 139 Premier League games under his belt. He’s tall, he’s strong and he’s great at winning headers making 80 clearances last season and winning 75% of his tackles.\nReam’s replacement in the backline looks to be new signing Jorge Cuenca. Signed for £6.7 million from Villareal, the 24-year-old Spaniard is a tall left-footed defender who’s played 71 games in La Liga and was schooled in the Barcelona academy.\nHe had solid defensive numbers last season, making 114 clearances, 26 blocks and winning 29 tackles. For such a low fee it’s a low-risk, high-reward signing and represents good business for Fulham.\nAnother player who will be looking to split that partnership up is new signing Joachim Andersen. The 28-year-old Dane joins the Cottagers following a three-year spell at fellow London club Crystal Palace where he became a first-choice defender making 113 appearances for the club.\nKenny Tete was a name that was regularly listed as his contract expiring as it came towards the end of the season but Fulham have taken up an option and he’s now set to stay until the end of 2025.\nWith the form of Castagne he only made 14 league appearances last season, ten of which were starts. My first impressions were that he was being kept around as a squad player but so far he has started ahead of Castagne for the first two games of the season.\nRyan Sessegnon has returned home this summer. I was surprised to find that he was still just 24 years old, so he still has a long career ahead of him. Part of that is probably because he broke through at Fulham so early, playing his first games when he was just 16.\nHis move to Tottenham didn't quite work out due to injuries and managers preferring other options, as well as a switch to a more regular left-back role and more defensive duties. During his peak form at Fulham he was playing in a much more attacking left-sided position.\nUnderstandably, he chose to return to the club where he feels at home, but in terms of profile, a Marco Silva left-back will be far more defensive than a Kieran McKenna left-back and I'd have loved to have seen him provide back-up to Davis\nMidfield\nThe biggest news in midfield is the sale of Joao Palhinha to Bayern Munich. He was very much the core of Fulham’s engine room, making the highest number of tackles of any midfielder in the Premier League last season with 152.\nThe in-house option to fill that more defensive role is Sasa Lukic. Like Bassey, the Serbian struggled for game time at the start of the season, but a good run of form, including an impressive performance against Town in the Carabao Cup, saw him slowly displace Harrison Reed in a midfield pairing alongside Palhinha.\nTo compete with Lukic, Fulham have turned to Norwegian Sander Berge, who will be hoping to avoid a third relegation having gone down with both Sheffield United and Burnley.\nDespite those demotions, he is still a highly-rated player with good all-round attributes making more tackles and more progressive passes than any of his Burnley team mates last season.\nHaving Palhinha alongside him really brought the best out of Reed, who flourished in the 2022/23 season in a more advanced role. However, he struggled to continue that form into last season with only 15 starts playing as more of a bit part player as he had to compete with Lukic, Tom Cairney and Alex Iwobi. He provides a solid option in midfield but isn’t the most attacking of players.\nCairney on the other hand provides a bit more forward thrust whilst not losing too much of the bite. His biggest attribute is his ability to keep the ball. He was tackled when taking on an opponent the least in the league, losing the ball only 15% of the time.\nAt 33 he may now not be able to play every game but is another experienced head in Fulham’s midfield.\nAlex Iwobi failed to make the break through at Arsenal but is a very, very good player and has found a home at Fulham as he’s very well suited to their style of play.\nHe’s athletic and his running ability in the central areas help Fulham stay on the front foot with their pressing. His versatility is also a big reason managers like him, having played on the wing, at wing-back, in a central midfield three or as a 10.\nHe’s made over 250 Premier League appearances and has 80 caps for Nigeria and is now one of the leaders in the Fulham dressing room.\nIn the more advance midfield positions, Fulham’s main man is Andreas Pereira. The 28-year-old joined the Cottagers in 2022 having failed to make the grade at Manchester United, despite some promising loan spells.\nHe was a crucial cog in Fulham’s team last season starting 34 games in behind the striker using all of his creative attributes to contribute seven assists and three goals.\nHe’s one of the few skilful luxury players that Fulham have in their side and he’s hitting the peak of his career currently with his form last season seeing him secure a place in Brazil’s Copa America squad.\nForwards\nFulham usually operate in a 4-2-3-1 formation with a central striker and two inverted wingers. We’ve covered Iwobi in the central midfielders so that leaves Harry Wilson, Adama Traore and new singing Emile Smith-Rowe in the wing positions as 34-year-old Willian left the club at the end of the season.\nSmith-Rowe has joined this summer from Arsenal for a fee of £27 million. The 24-year-old broke into the Arsenal side back in 2020 and had an excellent 2021/22 season, scoring 10 goals in 33 appearances.\nAt the end of that campaign he underwent groin surgery which kept him out for the bulk of 2022/23 and he’s found his game time limited since and will be looking to get over that and become an important part of this Fulham side.\nHe got off to a flyer in his pre-season debut against Sevilla actually playing in the attacking midfield role, finding good pockets of space and heading in his first goal for the club following an excellent lay-off and run into the box within seven minutes of coming on. He subsequently scored his first Premier League goal for the club against Leicester a week ago.\nLast season was a mixed one for Harry Wilson, he managed four goals and six assists but probably didn’t start as many games as he would have liked, only 16.\nThe Wales international is still an important squad player for the Cottagers and has already proved what he can do against Town with a goal in the Carabao Cup last season. He’s a key player for Wales with 55 appearances but will have two Town players, Wes Burns and Nathan Broadhead, breathing ever more heavily down his neck in that regard this season.\nAdama Traore, one of the quickest dribblers in world football ,has had quite a career so far. At the height of his powers he was oiling himself up so defenders couldn’t foul him but for some reason it’s still never quite clicked for him with just 12 goals and 19 assists in 211 Premier League appearances.\nMarco Silva used him as a finisher last season with 17 appearances but just one start. That start was the last game of the season against Luton where he tore them apart and finished with a goal and an assist. He’s featured heavily in pre-season and those performances seem to have gained him a starting spot on the right wing.\nStrikers\nFulham will go into this season with the main striking position being a two-way battle between Raul Jiminez and Rodrigo Muniz.\nJimenez is a man who knows where the back of the net is, having scored 47 goals in 159 Premier League appearances. His form understandably dropped a bit after the horrific skull fracture he suffered against Arsenal back in 2020 which led to Wolves cashing in on him but he’s regained that form at Fulham and netted seven times, outperforming his xG by close to two goals.\nAt 33 he won’t play as many as he used to but having someone who is so clinical in front of goal in the squad is no bad thing.\nMuniz struggled for game time at the start of last season and it’s his performance leading the line against Ipswich in the Carabao Cup which will have been the start of him staking his case for more regular football.\nHe was a constant nuisance and managed to get himself on the scoresheet at Portman Road. That earned him a start against Manchester United the week after but a little niggle saw him then miss a bit more game time.\nIt wasn’t until the end of January that he really caught fire with a purple patch of eight goals in eight games. That drifted off again towards the end of the season but the 23-year-old Brazilian has definitely proved that he can cut it at Premier League level.\nAlso in the squad currently are Carlos Vinicius, who spent the second half of last season on loan at Galatasary, and Jay Stansfield, who Town will know about from his loan spell at Birmingham last season.\nThe Teams\nBoth sides rotated heavily in midweek for the Carabao Cup but I think they’ll return to close to the same side as the last league game.\nConsistency was the name of the game for Fulham in their first two league games. Marco Silva made a full 11 changes for their trip to Birmingham on Tuesday night, so I think they’ll revert back to the side that beat Leicester 2-1.\nFor Ipswich a raft of new signings made their debuts against Wimbledon in midweek, leading to a performance that showcased a lot of individual talent but looked rather disjointed as a team.\nBecause of that, I can’t see there being too many changes from the Man City game. I really liked the look of Jens Cajuste and I think he could start in midfield, whilst I can also see Conor Chaplin replacing Ben Johnson in a more attacking line-up.\nPrediction\nIf Town are to have any chance of surviving this season, these are the games they need to be competitive in.\nThis is Fulham’s third successive season in the Premier League and they haven’t flirted with relegation in either of the last two. They’re not a team I'm expecting to be right down the bottom but with a home Portman Road crowd I do think this is a winnable game. I’m going for a tight 1-0 win for Ipswich.\nPlease report offensive, libellous or inappropriate posts by using the links provided.",
  "word_count": 2422,
  "scraped_at": "2026-02-14T01:48:56.585843",
  "_text_extracted": true
}