{
  "article_id": "447cc2c7f41f",
  "url": "https://dailynews.co.tz/why-is-afcon-taking-place-in-december/",
  "title": "Why is Afcon taking place in December ? ",
  "date": "20251226T094500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why is Afcon taking place in December?\nMOROCCO: THE Africa Cup of Nations (Afcon) will take place between 21 December 2025 and 18 January 2026 in Morocco.\nThe 2025 edition was originally due to be a mid-year tournament, to reduce scheduling conflicts with European clubs and competitions.\nThe summer event was supposed to boost tourism and highlight what Morocco has to offer, before the country co-hosts the 2030 World Cup with Spain and Portugal.\nBut it was shifted to December to make way for FIFA’S expanded Club World Cup, held in the summer.\nThe move to a start in December rather than January will avoid conflicts with the Champions League and Europa League, which restart on 20 and 22 January respectively.\nIt will be the first time Afcon has been held at this time of year, with matches played in Rabat, Casablanca, Marrakech, Agadir, Tangier and Fez.\nThere will not be matches on 25 December. Players participating in Afcon were released from clubs on 15 December.\nThis means teams have only had a week to prepare before the tournament begins, sparking anger from coaches who have been left with a short window in which to prepare their teams.\nAngola’s coach Patrice Beaumelle said the situation was “nonsense” and that “you can’t prepare a serious team in just two or three sessions”.\nThe last time Afcon was held in summer was the 2019 edition, hosted by Egypt. In recent years, the tournament has been played between January and February.\nWhy is Afcon traditionally held in the winter?\nAFCON is traditionally held in the winter months, primarily in January and February, because of the variable African climate.\nSummer in some nations can include rainy seasons and extreme heat conditions, which can affect football pitches and playing conditions.\nThe winter period instead provides drier conditions and stable temperatures, making for ideal playing conditions.\nThe 2023 edition held in the Ivory Coast was due to be held in the summer of 2022, but it was moved to early in the following year because of the weather conditions.\nBeing held in winter also means Afcon can avoid clashes with other international football tournaments that traditionally take place in the summer.\nBut this has caused conflict with European clubs who now have to release players mid-season.\nWhy has Afcon been staged every two years?\nThe Africa Cup of Nations has traditionally been held biennially. When it first began in 1957, a place at the World Cup was not guaranteed for African teams.\nOver the years, more African nations have participated in the World Cup.\nBut the regularity of Afcon ensures there has been a consistency in revenue from tournaments and tourism.\nIt also provides regular opportunities for teams and players to compete.\nHowever, in future Afcon will take place once every four years instead of every two years, to fit in with other international football tournaments.\nIn 2020, FIFA president Gianni Infantino proposed this idea to the Confederation of African Football (CAF).\nHe also suggested streamlining Afcon to be held between September and November.\nOn Saturday, 20 December, the eve of this year’s Afcon, Confederation of African Football president Patrice Motsepe announced the tournament will be held every four years from 2028.\nALSO READ: Taifa Stars upbeat for bright start in AFCON opener against Nigeria\nAFCON to be held every four years from 2028\nThe Africa Cup of Nations (Afcon) will be held every four years from 2028, Confederation of African Football president Patrice Motsepe has announced.\nThe tournament has taken place every two years since 1968, with a one-year gap between the 2012 and 2013 editions.\nBut it will switch to a fouryear cycle after the 2027 Afcon in East Africa and a 2028 edition.\nMotsepe has instead announced the creation of an African Nations League which will take place annually from 2029.\n“We have the most exciting new structure for African football,” Motsepe said.\n“I do what is in the interests of Africa. The global calendar has to be significantly more synchronised and harmonised.”\nMeanwhile, CAF has increased the prize money for the winners of Afcon from $7m (£5.2m) to $10m (£7.5m).\nThe surprise announcement about the future of Afcon was made by Motsepe after a meeting of CAF’S executive committee in Morocco before the start of the 2025 finals in Rabat on Sunday.\nThe biennial hosting of Afcon has long caused issues with the football calendar, with the vast majority of recent tournaments held midway through the European club season.\nHowever, CAF remained committed to scheduling the tournament every two years – not least as it needs the revenue raised from the finals to reinvest in the game on the continent.\nCAF had made a resolution for Afcon to be held in a June-July slot from 2019 onwards and began its new plan in Egypt that year.\nBut the Covid-19 pandemic and weather conditions in host nations in Central and West Africa meant the 2021 and 2023 editions in Cameroon and Ivory Coast respectively were staged in January and February instead.\nFIFA’S expanded 32- team Club World Cup was held in June and July this year, forcing CAF to opt for midseason dates once again.\nAs a result this year’s Afcon in Morocco will take place over Christmas and the New Year for the first time, with the final on 18 January.\nThe dates for the finals in Kenya, Tanzania and Uganda in 2027 are yet to be announced, and that will be swiftly followed by another Afcon in 2028 – with the hosts of that edition yet to be decided.\nAfter that, the continent’s biggest tournament will become a quadrennial tournament taking place in the same year as the European Championships.\nMotsepe said the decision had been made in conjunction with FIFA president Gianni Infantino and the world governing body’s general secretary Mattias Grafstrom – and that CAF “have to compromise”\nAfrican Nations League set for 2029\nMeanwhile, CAF has increased the prize money for the winners of Afcon from $7m (£5.2m) to $10m (£7.5m).\nThe surprise announcement about the future of Afcon was made by Motsepe after a meeting of CAF’S executive committee in Morocco before the start of the 2025 finals in Rabat on Sunday.\nThe biennial hosting of Afcon has long caused issues with the football calendar, with the vast majority of recent tournaments held midway through the European club season.\nHowever, CAF remained committed to scheduling the tournament every two years – not least as it needs the revenue raised from the finals to reinvest in the game on the continent.\nCAF had made a resolution for Afcon to be held in a June-July slot from 2019 onwards and began its new plan in Egypt that year.\nBut the Covid-19 pandemic and weather conditions in host nations in Central and West Africa meant the 2021 and 2023 editions in Cameroon and Ivory Coast respectively were staged in January and February instead. Cafonline",
  "word_count": 1154,
  "scraped_at": "2026-02-14T02:15:58.645660",
  "_text_extracted": true
}