{
  "article_id": "448d1e4c69f0",
  "url": "https://www.dailystar.co.uk/life-style/premier-league-transfer-deadline-day-33569375",
  "title": "Fans vote Mohamed Salah Liverpool £37m switch as top Premier League transfer of all time",
  "date": "20240830T143000Z",
  "domain": "dailystar.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fans vote Mohamed Salah's Liverpool £37m switch as top Premier League transfer of all time\nA poll of 2,000 football fans has named Mohamed Salah's transfer from Roma to Liverpool the best value Premier League transfer of all time, with two Man Utd moves also in the top 10\nMohamed Salah's 2017 transfer from Roma to Liverpool has been crowned the best value Premier League transfer of all time, according to a poll of 2,000 football fans\nDespite costing the club £37m, the Egyptian ace's move was deemed top value as he's netted over 200 goals for the club, helping them secure both the Premier League and UEFA Champions League titles.\nSalah's transfer beat out Cristiano Ronaldo's move from Lisbon to Manchester United and Eric Cantona's switch from Leeds to the Red Devils.\nThe survey was conducted by iD Mobile in the run-up to Transfer Deadline Day, celebrating its customers who've switched to their network.\nNew customers sharing surnames with famous footballers like Kane, Grealish, Watkins and Kelly had their faces displayed on giant screens outside Tottenham Court Road station.\nLewis Henry from iD Mobile commented: \"Getting the best value is important for all of us. Whether it be a player looking for a bumper new contract with a new club, or someone looking for a new phone contract.\"\nHe added: \"These findings show that an unexpected option can be worth it if you get good value for money, and they can be outstanding in the long run.\"\nHe concluded: \"Value in a crowded market can be tricky - just ask any Premier League club - but we know a good value deal is not just about the best or lowest price and it's more about what you get back for your money instead.\"\nPaul Pogba's £89m move from Juventus to Manchester United in 2016 has been dubbed the worst transfer ever, especially considering the club initially let him go for almost nothing.\nAndy Carroll's £35m switch to Liverpool on the last day of the 2011 transfer window was voted the second-worst value for money, followed by Romelu Lukaku's move from United to Chelsea.\nManchester City, Liverpool and Arsenal were singled out as the best clubs for identifying good value transfers, according to figures from OnePoll.com.\nDespite this, a whopping 87% believe Premier League clubs overpay for players, with 56% arguing there's no such thing as good value in modern football transfers.\nREAD MORE: Man Utd set for Jose Mourinho reunion and Battle of Britain after Europa League drawA staggering 95% think top-flight clubs should focus more on nurturing talent rather than simply buying it.\nThe study also shed light on the habits of avid football fans, with over a third using their mobiles to watch highlights and 23% scrolling social media for opinions on recent matches.\nOver half (55%) confessed they're using their mobile phone 'more than ever' to stay updated with all things football. However, 35% would prefer their team's fiercest rivals to win the league than lose their phone.\nLewis Henry, of iD Mobile, which claims its customers can save an average of £230-a-year, stated: \"Keeping up with football isn't just about waiting for the TV highlights on Saturday nights anymore.\"\n\"It's possible to stream live games via your phone anywhere in the world and fans in the pre-2000's era couldn't have dreamed of this kind of access to the game.\"\nTHE 10 BEST-VALUE TRANSFERS EVER:\n- Mohamed Salah (AS Roma to Liverpool) £36.5million 2017\n- Cristiano Ronaldo (Sporting Lisbon to Manchester United) £12.2million 2003\n- Eric Cantona (Leeds United to Manchester United) £1million 1992\n- Kevin De Bruyne (Wolfsburg to Manchester City) £55million 2015\n- Jamie Vardy (Fleetwood Town to Leicester City) £1million 2012\n- Wayne Rooney (Everton to Manchester United) £25.6million 2004\n- Didier Drogba (Marseille to Chelsea) £24million 2004\n- Gareth Bale (Southampton to Tottenham Hotspur) £13.23million 2007\n- Frank Lampard (West Ham to Chelsea) £11million 2001\n- Virgil van Dijk (Southampton to Liverpool) £75million 2018\nTHE 10 WORST VALUE DEALS:\n- Paul Pogba (Juventus to Manchester United) £89.3million 2016\n- Andy Carroll (Newcastle United to Liverpool) £35million 2011\n- Romelu Lukaku (Manchester United to Chelsea) £97.5million 2021\n- Fernando Torres (Liverpool to Chelsea) £50million 2011\n- Danny Drinkwater (Leicester City to Chelsea) £35million 2017\n- Alexis Sánchez (Arsenal to Manchester United) £35million 2018\n- Mario Balotelli (AC Milan to Liverpool) £16million 2014\n- Philippe Coutinho (Liverpool to Barcelona) £140million 2018\n- Angel Di María (Real Madrid to Manchester United) £59.7million 2014\n- Christian Benteke (Aston Villa to Liverpool) £32.5million 2015",
  "word_count": 757,
  "scraped_at": "2026-02-14T01:57:35.655163",
  "_text_extracted": true
}