{
  "article_id": "449b10337488",
  "url": "https://theathletic.com/4833823/2023/09/07/everton-squad-audit-dyche/",
  "title": "Everton squad audit : Beto boosts options but midfield and defence still light",
  "date": "20230907T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was the day after the closure of the summer transfer window and Sean Dyche was giving his verdict on the business Everton had done.\nSpeaking after his side’s 2-2 draw at Sheffield United, a game in which he had only been able to name seven substitutes instead of the usual full complement of nine, the Everton manager called the late £22million ($27.6m) departure of Alex Iwobi “a shame”.\nHe also suggested they had fallen short of ticking off every box on their list.\nAdvertisement\n“We were hoping to do more in the market but, obviously, we all know about the situation in the market, how we are trying to construct deals,” Dyche said. “We didn’t get what we want. Alex Iwobi left us, which is a shame because he is a top player.”\nDyche has experience of this kind of situation. After working on a shoestring budget for much of his time at Burnley, he joined Everton late in the January window when no new additions were forthcoming. For much of the final part of last season, he was forced to make do without a genuine No 9.\nAs is his way, he also reiterated his confidence in the players at his disposal. “When everyone is back fit, we will see a group that is competitive again,” he said.\nBut after a window in which they made five new signings and saw many more depart, just how are Everton fixed for the new season?\nAnd is Dyche right to be confident in the options at his disposal?\nGoalkeeper\nJordan Pickford remains, unquestionably, first choice at Goodison Park, with the England international ending speculation over his future by signing a long-term deal in February.\nSecuring Pickford was an important step — his form over the past two seasons has gone a long way to preserving Everton’s Premier League status. Without a goalkeeper of his quality, they would almost certainly be playing Championship football now.\nMore on Everton’s undisputed No 1…\n- Meet the real Jordan Pickford, by those who have played with him\n- Why he was the club’s player of the season\nThe biggest changes have come below him. Everton could not reach an agreement on terms with Asmir Begovic, who chose instead to move to Queens Park Rangers and become their new first-choice goalkeeper. Begovic’s experience feels like a loss, with his place as Pickford’s understudy taken by the inexperienced Joao Virginia. Everton looked at backup options during the summer but, with money tight, funds were allocated elsewhere.\nAdvertisement\nThey will hope Pickford remains free from injury and that long-term prospect Harry Tyrer, 21, continues his impressive development on loan at National League side Chesterfield.\nVerdict: With Virginia still to prove himself and Andy Lonergan’s deal set to expire at the end of the season, Everton will likely need to bring in fresh competition for Pickford next summer.\nFull-back\nThis area of the team has been a long-term consideration for Everton given Seamus Coleman’s advancing years. The club spent several windows sourcing his eventual replacement before settling on youngster Nathan Patterson from Rangers.\nPatterson has shown some promise but remains a work in progress, which meant Coleman was still a regular pick over the second half of last season.\nWith the Irishman’s deal set to expire at the end of the season, Everton will almost certainly need to dip back into the market for a new right-back to provide competition for Patterson.\nSimilar issues have surfaced on the other side of defence, where 38-year-old veteran Ashley Young is keeping out the much younger Vitalii Mykolenko. Young is another out of contract at the end of the season, while promising youngster Ishe Samuels-Smith was also sold to Chelsea earlier this summer.\nVerdict: Two new full-backs could be needed at the end of the season — one for each side.\nCentre-back\nEverton lost the experience of Yerry Mina and Conor Coady over the summer, with the club deciding against renewing the former’s contract or activating the latter’s purchase clause. Had their financial situation been different, they may well have retained Coady given his experience and the positive role he played within the dressing room.\nMason Holgate also joined Southampton on loan and is not likely to be part of Dyche’s long-term plans.\nJarrad Branthwaite, 21, has returned from a productive loan at PSV Eindhoven and slotted in seamlessly.\nAdvertisement\nBut this is a defence that has conceded eight goals in their first four matches and Dyche will need Branthwaite and his central defensive partner, James Tarkowski, to maintain form and fitness given the paucity of options elsewhere.\nReece Welch, on loan at League Two Forest Green Rovers, has many of the attributes needed to play higher up the pyramid one day, but the 19-year-old is still learning his trade.\nWith four senior options available and others out on loan, Everton were not looking for permanent deals for centre-backs over the summer. They were attentive to what was happening in the loan market but, realistically, could do with further departures before strengthening.\nVerdict: Centre-back will almost certainly be back on the agenda next summer. Everton need Tarkowski and Branthwaite to stay fit for the majority of the campaign, or for Ben Godfrey to return to the levels he showed when he first arrived at Goodison. Branthwaite, who is already being tracked by Champions League sides, has two years left on his deal, but Everton have the option of extending that by a further season.\nDecisions will need to be made over Keane and Godfrey, with the pair heading into the final year of their deals next summer.\nCentral midfield\nOn the face of it, Everton appear relatively well-stocked here — but delve a little deeper and issues emerge.\nFour of their six senior central midfielders are out of contract next summer, albeit there is an option to extend Idrissa Gueye’s deal by a further year.\nDyche is also likely to lose Gueye and Abdoulaye Doucoure for large chunks of January and February while the Africa Cup of Nations is taking place. Without those two, Everton look threadbare in a crucial part of the pitch.\nWhile Iwobi predominantly played wide under Dyche, he was often the side’s best source of creativity and ball progression. Without him, Everton may lack inspiration in possession and resort to more direct wing play and crosses into the box.\nAdvertisement\nAmadou Onana, meanwhile, could also attract further interest should he continue to fulfil his obvious potential.\nLewis Warrington, on loan at Plymouth Argyle in the Championship, is also into the final 12 months of his deal, but Everton have the option of a one-year extension.\nVerdict: Central midfield is likely to be a priority in January and over the summer.\nWide midfield\nEverton were keen to recruit another wide player for Dyche this summer but fell short in their attempts to sign top target Wilfried Gnonto. Losing Iwobi is a blow, but Jack Harrison and Arnaut Danjuma look to be astute additions on loan.\nMost of their options appear better suited to coming inside off the left, but Harrison and Dwight McNeil can play on the right. It will also be interesting to see where Danjuma fits in when everyone is fit and whether he might take up a more central role at times.\nDue to other late departures, Everton initially blocked a move for Demarai Gray, who was entering the final 12 months of his deal. Ultimately, however, the club has agreed to sanction his move to Al Ettifaq in Saudi Arabia.\nTwenty-year-old Lewis Dobbin has caught Dyche’s eye and the club have an option to extend his deal, which runs out in 2025, by a further year.\nVerdict: Everton are short of natural options on the right wing but have strengthened their cohort of wide players thanks to the loan additions of Harrison and Danjuma. With neither loan containing a purchase option or obligation and Gray having now departed, the club will need to find ways of strengthening next season.\nStriker\nThis is the one key area of the squad that looks stronger after the window.\nIn Beto, Everton now appear to have someone capable of replicating Calvert-Lewin’s influence in attack. Meanwhile, Chermiti, the 19-year-old signed from Sporting Lisbon, will be third choice and is seen as a promising talent for the future.\nAdvertisement\nWith Calvert-Lewin’s deal set to expire in 2025, we are approaching decision time over his long-term future.\nVerdict: This appears to be an improvement on last season, particularly if Beto can build on his promising early form. Calvert-Lewin’s fitness and the subsequent decision over whether he is awarded a new contract will go a long way to deciding whether Everton need another new striker next summer.\nGO DEEPER\nInside Everton’s transfer window: Loans, frees and 'clever' deals to bolster the ranks\n(Top photos: Getty Images)",
  "word_count": 1474,
  "scraped_at": "2026-02-14T02:00:57.138859",
  "_text_extracted": true
}