{
  "article_id": "44bea62775c4",
  "url": "https://thepeoplesperson.com/2025/04/07/man-united-identify-liam-delap-as-first-choice-striker-target-this-summer-292660/",
  "title": "Man United identify Liam Delap as first - choice striker target this summer - Man United News And Transfer News",
  "date": "20250407T160000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have identified Ipswich Town striker Liam Delap as the club’s “favoured target” for the summer with a new centre-forward “pinpointed as the priority” for Ruben Amorim, according to ESPN.\nMark Ogden (ESPN) contends the Red Devils are set to “rival Chelsea in the race” to sign Delap with the 22-year-old Englishman moving “ahead of Viktor Gyökeres, Benjamin Sesko and Victor Osimhen as the solution to their goalscoring problems”, source close to Old Trafford reveal.\nStriker’s Struggles\nUnited have been strongly linked with a new striker this summer after the acute struggles of the club’s senior forwards – Rasmus Hojlund and Joshua Zirkzee – this season.\nThe ineffectual pair, whose combined transfer fees surpass the £100 million mark, have scored just three times each in the league with United almost certain to set a new club record for the least number of goals in the Premier League era with 37.\nThe current record stands at 54 goals in the 2016-17 season meaning Amorim’s side would need to score 17 times in the remaining seven fixtures to match it. And based on Sunday’s 0-0 draw in the Manchester Derby, this will prove impossible.\nThe Reds produced a reasonable performance against their local rivals with the a strong defensive performance supplemented by some nice passages of play, largely directed by captain Bruno Fernandes. However, once the ball reached the front line, as has been a theme throughout the campaign, the attack faltered and were unable to capitalise upon the good build-up before.\nA More Realistic Target\nUnited have been most strongly linked with moves for Osimhen or Gyokeres – the two standout options in the number nine position who will be available this summer, from Napoli and Sporting CP respectively.\nHowever, both strikers will prove difficult acquisitions due to a combination of the club’s limited finances and the prospect of no European football next year. RB Leipzig’s Sesko is also likely to prioritise a Champions League side should the Slovenian international leave Germany this summer.\nBy contrast, Delap will be relegated to the Championship next year with Ipswich a certainty to join fellow promoted sides Southampton and Leicester City in the bottom three at the end of the season.\nThe 22-year-old striker has produced an impressive campaign for the Tractor Boys, despite his side’s struggles, scoring 12 times and assisting twice in 30 league appearances – double the number of goals of Hojlund and Zirkzee combined.\nDelap is something of a throwback in the mould of old-school Premier League strikers, drawing comparisons to the division’s record goal scorer, Alan Shearer.\nThe 22-year-old is a physical monster, standing 6’1 with a powerful frame, who is able to impose himself on opposition defences while retaining underrated link-up ability and good mobility. He relishes the physical battle with centre-backs but possesses a versatile range of finishing, demonstrating a quietly complete skillset as a centre-forward.\nDelap’s contract at Portman Road contains a £40 million release clause should, as expected, Ipswich be relegated. This places him in a much more favourable price bracket compared to Gyokeres or Osimhen, for example, who are expected to cost potential suitors in excess of £60 million.\nAnd with United’s budget set to be constrained by the pressures of PSR, with a number of positions in Amorim’s team needing upgrades, this is likely a key factor in Delap emerging as the club’s “preferred target” this summer.\nHowever, Chelsea’s interest in the 22-year-old will prove a difficult proposition to overcome, with the London side still holding strong hopes of Champions League qualification next season (currently 4th in the table). Manager Enzo Maresca has also previously worked with Delap during their time together in the Manchester City academy.\nINEOS will need to act quickly and decisively to beat out their domestic rival to capture Delap and arm Amorim with a centre-forward capable of leading the line in a way neither Hojlund nor Zirkzee appear capable of doing.\nFeatured image Stephen Pond via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 666,
  "scraped_at": "2026-02-14T02:20:59.032078",
  "_text_extracted": true
}