{
  "article_id": "44dd6735ae00",
  "url": "https://www.90min.com/posts/takeaways-bayern-defeat-to-bochum-thomas-tuchel-on-the-brink-harry-kane-frustrations",
  "title": "4 takeaways from Bayern defeat to Bochum : Thomas Tuchel on the brink , Harry Kane frustrations & more",
  "date": "20240219T010000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "4 takeaways from Bayern's defeat to Bochum: Thomas Tuchel on the brink, Harry Kane's frustrations & more\n- Bayern suffered their third defeat in a week on Sunday\n- The Bundesliga giants lost to Bochum\n- Tuchel is on the brink of being sacked by the club\nBayern Munich suffered their third defeat in the space of eight days on Sunday, losing 3-2 to Bochum in the Bundesliga.\nThe defeat to a team that Bayern have beaten 7-0 on three occasions since 2021 followed up a disastrous 1-0 loss to Lazio in the UEFA Champions League and a potentially title-deciding 3-0 thumping at the hands of Bayer Leverkusen last Saturday.\nHere's all our takeaways from FC Hollywood's defeat to Bochum.\nThomas Tuchel is on the brink of being sacked\nLet's call a spade a spade: Thomas Tuchel's Bayern Munich have been utterly shambolic this season.\nDevoid of a tactical identity, devoid of unity, devoid of anything that makes a football team 'good'.\nTuchel has relied on the individual quality of Harry Kane, Leroy Sane and co. to pull him out of a fair few holes over the course of the 2023/24 campaign, but the egregious deficiencies that he's caused his team to have finally reared their ugly head over the last week.\nIn a week in which he dropped Matthijs de Ligt for Eric Dier, dropped Leroy Sane for Eric Maxim Choupo-Moting, played an unfamiliar three-at-the-back formation to unsuccessfully match up with Bayer Leverkusen, Tuchel led Bayern to three consecutive defeats which have put them on the brink of UEFA Champions League elimination at the hands of Lazio and eight points adrift of Leverkusen in the title race.\nFor a team like Bayern, who spent £150m on Harry Kane and Kim Min-jae in order to strengthen in the summer, that simply isn't acceptable.\nHarry Kane misfires\nPrior to the game on Sunday, Tuchel insisted that Kane was \"unhappy\" with the service being provided to him. And considering Kane mustered just one shot on goal against Bayer Leverkusen, his feelings were probably justified heading into the game against Bochum.\nAfter the game against Bochum though Kane can't really have any complaints. The ex-Tottenham man scored one goal in the game, but also fluffed a number of guilt-edge chances.\nThe most shocking of said misses came early in the first half and late in the second.\nKane was gifted a wonderful chance to make it 2-0 in the 18th minute when Jamal Musiala played a stunning outside-of-the-foot pass through the heart of the Bochum defence and into his path. With just the goalkeeper to beat however, he ballooned embarrassingly over the crossbar.\nIn the 92nd minute the striker spurned an even better chance. Kane was found completely unmarked by Mathys Tel at the back post with a whipped cross, but could only find the goalkeeper's midriff with his subsequent, painfully tame, headed effort on goal.\nDayot Upamecano receives another red card\nPlenty of players have struggled in a Bayern shirt over the last week, but none have struggled quite as badly as Dayot Upamecano.\nJust four days after being sent off in the Champions League defeat to Lazio, Upamecano's errant elbow in the penalty box earned him another red card and gifted Bochum their third - game-winning - goal of the game on Sunday.\nAlong with the sending off and giving away a penalty the defender also managed to lose all five of his defensive duals during the game.\nA bad day at the office all round.\nFan protests\nYou probably read 'Bayern game halted due to fan protest' and thought: \"ah, Bayern fans must be protesting how bloody awful their team are right now\". But you'd be wrong.\nThe protest which stopped play on two separate occasions at the Vonovia Ruhrstadion was part of a large-scale fan displeasure at the plan to sell a stake of the Bundesliga's future revenue to private equity investors.\nSo far the fan-led protests - that have involved throwing tennis balls onto the pitch during games - have led to potential buyer Blackstone dropping out of talks, but expect the dissension to continue while CVC Capital Partners remain interested in the acquisition.",
  "word_count": 696,
  "scraped_at": "2026-02-14T01:56:44.627465",
  "_text_extracted": true
}