{
  "article_id": "44f388529ee8",
  "url": "https://www.westmeathindependent.ie/2026/01/21/mikel-arteta-proud-of-arsenals-hunger-after-win-over-inter-milan/",
  "title": "Mikel Arteta proud of Arsenal  hunger  after win over Inter Milan",
  "date": "20260121T093000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta proud of Arsenal’s ‘hunger’ after win over Inter Milan\nBy Philip Duncan, Press Association, Milan\nMikel Arteta hailed the “hunger, desire and ambition” of his Arsenal players after they secured their place in the Champions League last 16 with a statement 3-1 victory against Inter Milan at San Siro.\nGabriel Jesus, making his first European start in 405 days, sent Arsenal on the way to their seventh straight victory in this season’s competition when he scored in the 10th minute.\nPetar Sucic fired back for the home side eight minutes later, only for Jesus to restore the Gunners’ advantage later in the first half. Substitute Viktor Gyokeres added a third on a brilliant evening for Arteta’s men in Italy.\nArsenal are now certain of finishing the 36-team group either first or second which means home advantage for the second legs of their knockout games. And a point against Kazakhstan side Kairat at the Emirates next week will ensure top spot in the group as they chase their first Champions League title.\nArsenal have seen off Bayern Munich, Atletico Madrid and now last season’s beaten finalists, and Arteta said: “We’re very proud, not only for tonight’s game but for what we’ve done in the competition so far, and with one game to go to be already in the position that we want to be in.\n“It is a massive prize to the team because we know how difficult it is. We really had the hunger and desire to come to a place like this against a top, top side and prove what we are and what we can do.\n“We have ambition and the conviction that we can compete against any team. I love the attitude to come to this atmosphere against the opponent that we had. The team has matured, are very ambitious and emotionally very controlled. We have to carry on going.”\nJesus, who was sidelined for 11 months following knee surgery, staked his claim to usurp Gyokeres as Arteta’s go-to number nine with an impressive display.\n“I watched a lot of Serie A when I was a kid so to be in this stadium and score, I have tears in my eyes because I always dreamed of being here,” Jesus told Amazon Prime.\n“Everyone wants to start, but I am a very respectful guy. I am not a kid anymore, I am 28, so I understand football and I am very happy Vik came on and scored a goal.”\nArsenal, seven points clear in the Premier League, will host Manchester United at the Emirates Stadium on Sunday.\nFor Inter, the defeat leaves them staring at the probability of a play-off tie to reach the next stage.\nHead coach Cristian Chivu said: “I am never worried. We knew the Champions League journey would be difficult.\n“We don’t know if it will be enough, but we are ready to play the play-offs if necessary. Arsenal deserved to win tonight because they seized the opportunity, and they were stronger than us.”",
  "word_count": 502,
  "scraped_at": "2026-02-14T02:12:22.658061",
  "_text_extracted": true
}