{
  "article_id": "45331e44f75d",
  "url": "https://www.justarsenal.com/arsenal-eye-sensational-move-for-man-city-star-a-strategic-masterstroke-or-risky-gamble/391858",
  "title": "Arsenal eye sensational move for Man City star : A strategic masterstroke or risky gamble ? ",
  "date": "20250507T114500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are reportedly exploring the possibility of signing Manchester City midfielder Kevin De Bruyne on a free transfer this summer. The 33-year-old Belgian international is set to leave City at the end of the season after a decade of service, and his openness to remaining in the Premier League has alerted several top clubs, including the Gunners.\nAccording to reports, Arsenal manager Mikel Arteta, who previously worked with De Bruyne during his time as assistant coach at Manchester City, is keen on reuniting with the playmaker to add experience and creativity to his midfield.\nDe Bruyne’s potential arrival raises questions about how he would fit into Arteta’s system, which currently features Martin Ødegaard as the primary attacking midfielder and Declan Rice anchoring the midfield. While Ødegaard has been a consistent performer until perhaps more recently, De Bruyne’s vision, passing range, and leadership could potentially provide an additional dimension to Arsenal’s midfield, especially in high-stake matches.\nHowever, concerns about De Bruyne’s age (he’ll be 34 years old in June 2025) and his recent injury history cannot be overlooked. Some Arsenal fans have expressed reservations about signing a player in his mid-30s who commands a high wage, around £400,000 per week.\nDespite these concerns, De Bruyne’s track record speaks for itself. With six Premier League titles, two FA Cups, five League Cups, and a Champions League trophy, he brings a wealth of experience and a winning mentality that could benefit Arsenal’s relatively young squad.\nThe decision to pursue De Bruyne will ultimately depend on Arsenal’s assessment of the player’s physical condition and their willingness to integrate him into a midfield that already boasts significant talent. If managed correctly, De Bruyne could serve as a mentor to younger players and provide crucial contributions in key moments.\nWhether this potential signing materializes remains to be seen, but it undoubtedly adds intrigue to Arsenal’s transfer strategy.\nArsenal Debate: Is Kevin de Bruyne really the best every midfielder? I think not!\nWhat are your thoughts Gooners? Do we need a Kevin de Bruyne in our midst?\nMichelle M\n______________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us here…",
  "word_count": 415,
  "scraped_at": "2026-02-14T02:02:47.555855",
  "_text_extracted": true
}