{
  "article_id": "453894ee885b",
  "url": "https://news.yahoo.com/manchester-united-vs-tottenham-hotspur-103010335.html",
  "title": "Manchester United vs Tottenham Hotspur LIVE : Women Super League team news , line - ups and more",
  "date": "20230507T111500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United vs Tottenham Hotspur LIVE: Women's Super League latest score, goals and updates from fixture\nFollow The Independent's live coverage of all the action in the FA Women’s Super League today.\nThe WSL is the top tier of English women’s football with international players from all over the world plying their trade in one of the most competitive and entertaining leagues around.\nChelsea have won three of the past four titles and Emma Hayes’ side will be right in the hunt again, with the likes of Arsenal - champions in 2018-19 – and Manchester City, who have been runners-up for each of the past four seasons, among their competitors.\nWith the top three sides qualifying for the UEFA Women’s Champions League, all 12 WSL teams have plenty to play for, although some clubs’ main ambition will simply be to avoid the drop.\nThe side who finish bottom will be relegated to the FA Women’s Championship – a fate that befell Bristol City in 2020-21 – and newly-promoted Leicester City, competing in the top flight of the women’s game for the first time, will be eager to avoid an immediate return.\nWe will bring you all the action and updates from today's game in the live blog below:\nManchester United WFC 0 - 0 Tottenham Hotspur WFC\nManchester United vs Tottenham Hotspur\n12:39\nAttempt saved. Molly Bartrip (Tottenham Hotspur Women) right footed shot from outside the box is saved in the centre of the goal.\nManchester United vs Tottenham Hotspur\n12:36\nCorner, Manchester United Women. Conceded by Shelina Zadorsky.\nManchester United vs Tottenham Hotspur\n12:39\nAttempt blocked. Ona Batlle (Manchester United Women) right footed shot from the right side of the box is blocked. Assisted by Alessia Russo.\nManchester United vs Tottenham Hotspur\n12:39\nAttempt missed. Alessia Russo (Manchester United Women) header from very close range misses to the left. Assisted by Vilde Bøe Risa with a cross following a corner.\nManchester United vs Tottenham Hotspur\n12:35\nCorner, Manchester United Women. Conceded by Tinja-Riikka Korpela.\nManchester United vs Tottenham Hotspur\n12:36\nAttempt blocked. Leah Galton (Manchester United Women) right footed shot from very close range is blocked. Assisted by Ona Batlle with a cross.\nManchester United vs Tottenham Hotspur\n12:32\nFirst Half begins.\nManchester United vs Tottenham Hotspur\n12:00\nLineups are announced and players are warming up.\nManchester United vs Tottenham Hotspur\n11:30\nFollow live football coverage with The Independent today.\nWhether it's Premier League, Champions League, a European Championship or the World Cup we will keep you up to date with everything you need to know.\nWe will have all the latest scores, goals and updates plus analysis and reaction throughout the game here.",
  "word_count": 445,
  "scraped_at": "2026-02-14T02:03:44.220730",
  "_text_extracted": true
}