{
  "article_id": "453971cc2ccd",
  "url": "https://www.france24.com/en/live-news/20240209-malen-double-fires-dortmund-past-freiburg",
  "title": "Malen double fires Dortmund past Freiburg",
  "date": "20240209T221500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Malen double fires Dortmund past Freiburg\nDortmund (Germany) (AFP) – Donyell Malen scored a first-half brace as Borussia Dortmund eased to a 3-0 home victory over Freiburg in the Bundesliga on Friday.\nIssued on: Modified:\nStriker Niclas Fuellkrug, celebrating his 31st birthday, laid on both goals for the Netherlands winger, before grabbing one of his own in the dying stages.\nThe win sends Dortmund four points clear of fifth-placed RB Leipzig, with the Saxons playing at Augsburg on Saturday.\nMalen, who was linked with a move away from Dortmund in the winter transfer window, has now scored four goals in his last four games.\n\"From the start we had the right intensity and scored at the right moments,\" Malen told DAZN. \"We've made some good steps since (the) winter (break).\"\nDortmund have taken 13 points from five league games to boost their bid for a Champions League place.\n\"I wished for a win for my birthday -- and maybe a bit of birthday cake as well,\" Fuellkrug told DAZN.\nCoach Edin Terzic could call on the services of several returning first-team players, including Marco Reus, Julian Brandt and Julian Ryerson, along with Englishman Jadon Sancho, who started on the bench.\nIn the 16th minute, Malen was teed up by Fuellkrug, who held up the ball with his back to goal and found the Dutchman, who spun on the spot before unleashing a rocket into the roof of the net.\nFuellkrug was again the provider for Dortmund's second, holding up the ball on the counter-attack before passing to Malen, who blasted across the face of goal and in.\nThe goal came deep into first-half injury time. The match was delayed by 12 minutes due to fans throwing tennis balls onto the pitch as part of ongoing league-wide protests against foreign investment in German football.\n\"I can understand the fans, it's their stage and they want to use it to make themselves heard,\" Fuellkrug said.\n\"But from a sporting perspective it's not so great when you're frequently interrupted and have to keep warm -- it's not like it's 25 degrees at the moment.\"\nFuellkrug scored a goal of his own late in the game, heading in a cross from Chelsea loanee Ian Maatsen with three minutes remaining.\nBrought on with the clock winding down, Sancho -- who missed last week's draw with Heidenheim with a muscle injury -- had two chances to score but fired his efforts wide.\nWith nine Bundesliga goals so far this campaign, Malen has already equalled his total from last season.\nThe loss continued seventh-placed Freiburg's poor record in Dortmund.\nThey have not won at the Westfalenstadion since 2001, having lost 15 and drawn one of their past 16 games there.\nThird-placed Stuttgart can restore the gap to Dortmund to three points with a win over struggling Mainz on Sunday.\nOn Saturday, league leaders Bayer Leverkusen host second-placed Bayern Munich.\nXabi Alonso's Leverkusen, still yet to lose a match after 30 games in all competitions this year, sit two points ahead of Bayern.\n© 2024 AFP",
  "word_count": 508,
  "scraped_at": "2026-02-14T01:56:44.634341",
  "_text_extracted": true
}