{
  "article_id": "45592f7c758e",
  "url": "https://www.geosuper.tv/latest/31070-heres-is-the-new-uefa-champions-league-format-from-next-season",
  "title": "Here new UEFA Champions League format from next season",
  "date": "20231214T201500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nDecember 14, 2023\nMatchday 6 of the 2023/24 Champions League season was the last set of the group stage matches which took place in their present form.\nSince 2003, UEFA's premier club competition has kicked off with a group stage involving 32 teams, divided into eight groups of four. The top two teams from each group, constituting half of the initial group stage entrants, advance to the knockout rounds.\nHowever, the forthcoming competition will mark the debut of a new structure. In the next edition, all 36 teams will feature in a unified league table in the initial phase. This represents a significant shift for Europe's top club tournament. Let's delve into how these alterations will unfold in the 2024/25 season.\nOn Thursday, 31st August 2023, UEFA held the customary Group Stage draw for the UEFA Champions League. The 32 qualifying teams were allocated into eight groups, each comprising four teams.\nBefore the Champions League's mid-season hiatus, every team will face their group opponents twice, hosting one match and playing away in another. The top two teams from each group progress to the Round of 16; the third-place teams descend into the Europa League. The eight teams finishing at the bottom of their respective groups will exit European competition for the season.\nBut that's all set to change. The revised format for the UEFA Champions League includes an extra four teams, making a total of 36 teams, all competing within a single league.\nWithin this league, teams will be divided into four pots of nine. Pot One will comprise the reigning Champions League victors, alongside the top eight clubs with the best coefficients.\nIn the initial round of the 2024/25 tournament, each club will play eight matches: four at their home ground and four away.\nInstead of concluding in December, the group stage will end at the close of January. Following the eight rounds, the top eight teams will directly qualify for the Round of 16. Teams ranking from 9th to 24th place will engage in a two-legged qualifying round. The remaining teams will be eliminated from the competition.\nFrom the Round of 16 onwards, the tournament will proceed in the same manner as in previous years, featuring two-legged knockout ties culminating in a single-legged final.\nCuriously, the name originates from chess. In a Swiss-system chess tournament, players are ranked in a league table, despite not playing against every other competitor. This same concept is now poised to occur in the Champions League.\nIn the revamped Champions League, teams will engage in two fixtures—one at home and one away—against opponents from each of the four seeding pots. This ensures that, while not everyone will face off against each other, they will have participated in a roughly equivalent set of eight matches against teams of differing quality.\nDuring the 2024/25 overhaul, teams will play group-stage fixtures against opponents from the same pot as them. This means we might witness clashes like Bayern Munich and Manchester City competing against each other in the group stages, a scenario unlikely in the current format.\nEvery team in the group stages of the Champions League will confront two teams from Pot 1, two from Pot 2, two from Pot 3, and two from Pot 4.\nUEFA states that the new format is \"crafted to ensure the positive future of European football at every level and address the changing requirements of all its stakeholders.\" It aims to enhance the value of broadcast rights and increase viewership by offering more fixtures and facilitating more encounters between major teams in the group stage.\nThe final for the 2024/25 Champions League is scheduled to be held at the Allianz Arena in Munich on 31 May 2025. These significant changes aren’t confined to the Champions League alone. Both the Europa League and the Conference League will also adopt the Swiss Model in 2024.\nTheir capacity will increase from 32 to 36, akin to the Champions League. The Europa League will feature eight group-stage games, while the Conference League will have six.",
  "word_count": 674,
  "scraped_at": "2026-02-14T02:10:33.602854",
  "_text_extracted": true
}