{
  "article_id": "45abcf03de0e",
  "url": "https://metro.co.uk/2024/07/20/manuel-ugarte-sends-message-psg-man-utd-close-agreement-21263889/",
  "title": "Manuel Ugarte sends message to PSG with Man Utd close to agreement",
  "date": "20240720T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manuel Ugarte has told Paris Saint-Germain that he is intent on joining Manchester United this summer, according to reports in France.\nUnited have completed two new signings this month as they followed up last week’s €42.5m (£36.5m) move for Joshua Zirkzee by securing a £52m deal with Lille for 18-year-old centre-back Leny Yoro on Thursday.\nUnited are working on signing a new central midfielder to strengthen Erik ten Hag’s squad and Ugarte has emerged as their top target.\nIt’s understood that United have agreed personal terms with the Uruguay international, who wants to make the move to Old Trafford despite the lack of Champions League football.\nReports this week have claimed that PSG are holding out for a €70 million (£58.9m) fee for Ugarte, while United are unable to meet that figure until they offload more players.\nHowever, FootMercato reports that an agreement between PSG and United is now ‘close’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe report adds that Ugarte has also ‘warned’ PSG that United is his first-choice destination and has ruled out a move to another club.\nMore Trending\nUgarte was signed by PSG from Portuguese side Sporting last year in a deal worth €60 million (£51.1m).\nThe 23-year-old started 27 games in all competitions for PSG last season but was left on the bench by Luis Enrique for both legs of their Champions League semi final against Borussia Dortmund.\nWhen asked if he wanted to stay at PSG during an interview with Prime Video in May, Ugarte said: ‘I hope so, I’d love to stay here. We will see what’s going to happen.’\nUgarte is currently on holiday after Uruguay reached the semi final of the Copa America earlier this month.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd revive transfer interest in ‘overpriced’ English Premier League star\nMORE: Why Marcus Rashford, Harry Maguire and Antony miss Rangers v Manchester United friendly\nMORE: Arsenal reach breakthrough in Riccardo Calafiori transfer with £42m deal ‘very close’",
  "word_count": 393,
  "scraped_at": "2026-02-14T02:08:01.874068",
  "_text_extracted": true
}