{
  "article_id": "45abe25ef8ae",
  "url": "https://www.myjoyonline.com/man-utd-interested-in-wolves-striker-cunha/",
  "title": "Man Utd interested in Wolves striker Cunha",
  "date": "20250422T234500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nManchester United are interested in signing Wolves forward Matheus Cunha this summer.\nThe Brazilian, who has a £62.5m release clause in his Wolves contract, is expected to leave Molineux at the end of the season.\nMultiple club sources have told BBC Sport the 25-year-old is one of a number of attacking options on United's shortlist, with Ipswich Town striker Liam Delap, 22, also of interest.\nImproving United's scoring record is a priority for head coach Ruben Amorim. Only Southampton, Leicester City, Ipswich, Everton and West Ham have scored fewer than the 38 goals United have managed in 33 Premier League matches this season.\nCunha is viewed as an ideal addition to play in one of the two attacking midfield positions in Amorim's preferred 3-4-2-1 formation.\nCunha - Wolves' top scorer this season with 16 goals to his name in all competitions - plays in a similar system under current boss Vitor Pereira.\nUnited are set to face competition from a number of Premier League clubs for Cunha, with Liverpool, Arsenal, Chelsea and Newcastle all known to be looking to sign a forward this summer.\nCunha has scored 32 times in 87 appearances for Wolves but his disciplinary record may be of some concern to suitors.\nThe former Atletico Madrid striker has been sent off twice this season, missing six games in total through suspension.\nThe forward said in an interview with the Observer in March that he has told Wolves he needs to \"take the next step\" and fight for titles.\nUnited's planning for next season is hindered by uncertainty over their financial situation.\nAt a conservative estimate, the club stand to gain around £100m in additional funds if they win this season's Europa League and qualify for the Champions League.\nBut, with each league position worth £3m in the Premier League, United stand to lose around £24m should they finish in their current position of 14th compared to an eighth-placed finish last season.\nFollowing Sunday's home defeat by Wolves, Amorim said the club have a \"plan\" to improve the squad but that the situation could not be addressed until the summer.\nUnited desperate for forwards - analysis\nSimon Stone, Chief football news reporter\nCunha would seem to be a very good fit for Manchester United.\nAn aggressive attacking player, capable of dropping deeper and linking play or threatening the opponents' goal - and scoring.\nHe is the kind of player Amorim's squad has been crying out for all season, with neither Rasmus Hojlund or, before his season-ending injury, Joshua Zirkzee looking like the answer in the most advanced position.\nWork is going on behind the scenes at Old Trafford to come up with a summer transfer plan.\nHowever, there is a big but.\nIt is quite obvious United's status, in terms of the finances they have to spend, will be shaped by whether they win the Europa League or not.\nIf they beat Athletic Bilbao in the semi-final, then either Tottenham or Bodo/Glimt in the final, United can count themselves fortunate the damage of this appalling campaign has not been too extensive and can create a more rounded squad in the belief results will be far better in 2025-26.\nIf they don't, a decision will have to be made over whether they prioritise a couple of positions, believing all the spare midweek fixture slots will give Amorim a chance to work with his players, or lower their sights and bring in more players with the profile the former Sporting boss wants.\nIt is clear United are desperate for forwards. But they probably need more than one. They also need wing-backs, central midfield players and central defenders.\nThe interest in Cunha is real. It doesn't mean the signing will happen.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n28 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n53 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n55 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n4 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n4 hours",
  "word_count": 847,
  "scraped_at": "2026-02-14T01:52:20.892592",
  "_text_extracted": true
}