{
  "article_id": "45d393aa8857",
  "url": "https://news.yahoo.com/frank-lampard-ludicrous-decision-causes-210923633.html",
  "title": "Frank Lampard ludicrous decision causes Chelsea Champions League demise",
  "date": "20230418T214500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Lampard’s ludicrous decision causes Chelsea’s Champions League demise\nThe hard-running figure on the right of the front three scored once. Then he scored again, powering his team into the Champions League semi-finals. It was almost Frank Lampard’s gameplan paying off perfectly. Except that the goalscorer was Rodrygo, the logical choice by Carlo Ancelotti, who is proof that four Champions Leagues can be won with the aid of a willingness to do the obvious.\nThe man on the right of Lampard’s front three, however, was N’Golo Kante. That N’Golo Kante. The one often deemed the world’s best defensive midfielder. The one with 13 goals in 266 games for Chelsea. And the one who, when granted an early chance to break the deadlock, scuffed a shot well wide in the manner of a man who had no belief he would score.\nAided by Rodrygo’s double, Real Madrid reached an 11th Champions League semi-final in 13 seasons. Aided by the galvanising powers of a Todd Boehly team talk, Chelsea exited Europe. Perhaps they were always doomed to: from the 2-0 defeat last week, from the moment the draw was made, from the time Boehly decided to buy a football club. But there will be no redemption now: their season is a crushing, costly failure, a masterpiece of stupidity.\nLampard at least lent it one last twist. It was supposed to be Pep Guardiola who overthought Champions League knockout ties. Along came Lampard. Ancelotti would not have seen this Chelsea side coming. He presumably greeted them with a raised eyebrow. A teamsheet featuring three centre-backs, two full-backs, three defensive midfielders, one more attacking midfielder and a false nine suggested Lampard thought Chelsea were two goals to the good. A bench with seven attack-minded players indicated he placed too much importance on the concept of the super-sub.\nThe second surprise was how they were configured. Chelsea don’t score goals with attacking players in attack so Lampard tried inserting a non-scoring midfielder in his front three. Kante didn’t score either. Lampard borrowed a system deployed to great effect by Thomas Tuchel and Antonio Conte, but never quite like this.\nHe opted for a 3-4-2-1 with Conor Gallagher and Kante as the two No 10s; a squad with a £600m refurbishment giving the creative roles to the winner of the bleep test and a specialist ball-winner. Perhaps it was taking the idea of a high-pressing game to a new extreme by choosing the two players likeliest to hassle and harry in roles usually reserved for flair players. It was the latest illustration that there was no strategy to the spending spree. Certainly, it was an indictment of Joao Felix, Raheem Sterling and Mykhailo Mudryk, all omitted before they came on together in a triple change. Chelsea have a host of actual No 10s and, with the arguable exception of the pseudo striker Kai Havertz, Lampard picked none of them. Was it counter-intuitive brilliance? Well, no, actually.\nNeeding at least two goals, Lampard picked a starting 11 that boasted just 17 between them this season. Marc Cucurella – career tally: eight goals in 244 matches – could have made it 18 when afforded a golden chance on the stroke of half-time. His finish lacked conviction. Chelsea’s recent tally now stands at one goal in six matches.\nPerhaps desperate times called for desperate measures. Lampard tried a front three who had never played together before. They probably never will again. Kante was named the man of each match against Real in the 2021 semi-finals; but not for playing in a position more associated at Stamford Bridge with Pedro and Willian.\nKante spent much of his evening making darts out to the right wing. The tackler supreme had to become a crosser. It was not his forte. At least six of Chelsea’s substitutes – Sterling, Mudryk, Felix, Christian Pulisic, Hakim Ziyech and Mason Mount – are better qualified to flank a forward in a front three; Carney Chukwuemeka may think he is, too. And Chelsea’s January signings included the right winger Noni Madueke, but their surfeit of players meant he was not even named in the Champions League squad. And so, in the sort of thing that happens at Chelsea these days, a manager sacked by Everton three months ago used Kante as a forward.\nAlongside him was the man with 100 per cent of the goals in Lampard’s second reign: all one. Gallagher charged round enthusiastically, testing the theory Real’s aged midfield could be conquered by energy alone. It amounted to a magnificent display of running: tracking back when Real mounted a counter-attack, he surged past five players. He didn’t actually get the ball, but the effort was admirable.\nAnd really, effort was all Chelsea added. They made a high-tempo start but a team largely shorn of creativity created very little. Real let them huff and puff and them picked them off. Chelsea have had far worse results this season, some of them with more conventional teams. Indeed, they finished with a far more normal side, with Sterling on the right wing and Kante in midfield. But if there was a certain logic to that, this has been a season of utterly illogical decision-making at Stamford Bridge. And so perhaps the tactics were Lampard’s tribute to Boehly.",
  "word_count": 879,
  "scraped_at": "2026-02-14T01:53:35.626754",
  "_text_extracted": true
}