{
  "article_id": "45e02f4c54a5",
  "url": "https://www.heraldscotland.com/news/23554264.billy-gilmours-perseverance-shows-can-fulfil-huge-potential/",
  "title": "Billy Gilmour perseverance shows he can fulfil his huge potential",
  "date": "20230529T223000Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THERE has rarely been any doubt about Billy Gilmour’s ability. But now everyone is aware of what Steve Clarke and others who have worked with the young midfielder have long known; he is made of stern stuff too.\nGilmour burst onto the senior Scotland scene back in the summer of 2019, and the then Chelsea prospect was greeted with huge excitement and accompanying expectation from the Tartan Army. He was the next big thing, with a hugely bright future ahead for both club and country.\nAs is often the case with young footballers though, their path to the top of the game is rarely so straightforward, and Gilmour has had his fair share of unwelcome diversions in his short career to date.\nREAD MORE: Steve Clarke names Scotland squad for Norway and Georgia qualifiers\nA disastrous loan spell at Norwich City hampered his progress, and when he left Chelsea for Brighton on a permanent basis in search of more regular first-team football, he came up against two of the best midfielders in the EPL this season in the battle for game time.\nIt has taken patience and perseverance, but finally, Gilmour seems to have broken down the door to manager Roberto De Zerbi’s starting XI, and he has seized his opportunity, turning in a series of highly impressive performances recently that have reminded everyone just why there was so much hype about him in the first place.\nThat is good news for Gilmour, for Clarke, and for the country.\n“I spoke to him briefly in the last camp and told him just to knuckle down and get on with it,” Clarke said.\n“You can’t feel sorry for yourself, and to be fair to him he has managed to get in the team and his performances have been good, so that’s good for him, good for Brighton and good for us.\n“He’s done well Billy. I think it was obviously a tough situation for him when he got there. He was competing against two world-class players in (Moises) Caicedo and (Alexis) Mac Allister, and it took him a long time to work his way into the team.\n“But since he has come into the team his performances have been good, which is a positive for Billy and probably a positive for Brighton moving into next season, and certainly a positive for the national team.\n“I think his performances made a lot of people very excited about what he could bring us.\n“I’ve always spoken about Billy as one for now, but definitely one for the future.\n“As a young player, you are always going to have ups and downs. You’re going to be in the team, you are going to be out of the team. You are going to have a good run of form…\n“You have to learn how to handle it, and I think he has handled this season quite well.\n“He had a disappointing loan at Norwich. He could have easily just crumbled and felt sorry for himself, but he hasn’t done that.\n“He has knuckled down, he’s obviously impressed the manager in training and he’s found his way into the team.\n“I think Brighton have more or less admitted that they are going to sell at least one of the two players [he’s up against], if not both, which is the way Brighton run their business, and hopefully that will mean more football for Billy next season.\n“But he will be challenged by other people that they bring into that club, because they have a good structure and a good scouting system, and they always bring in decent players Brighton.”\nOne player who won’t be joining the Scotland camp as they prepare for a crucial European Championships qualifying double-header against Norway and Georgia is striker Che Adams, with the Southampton forward’s absence opening up opportunities for Edinburgh rivals Lawrence Shankland and Kevin Nisbet.\n“Che got injured in the March camp,” Clarke said.\n“He did his rehab and got himself into a position where he tried to push himself to help his club stay in the league but aggravated the injury, so there was no chance of making it for the middle of June. It’s disappointing but a chance for someone else.\nREAD MORE: Billy Gilmour opens up on decision to exit Chelsea for Brighton as he looks forward to next chapter\n“Kevin was out for a long, long time with a knee injury but since he came back, he has shown he has still got an eye for a goal. His fitness has gradually improved over the games he has played.\n“I went to the [Edinburgh derby] on Saturday and watched both Kevin and Lawrence Shankland and thought they both did okay in what was a pretty scrappy game.\n“When you are out for a long period of time [as Nesbit has], you do have to spend more time in the gym and you do work on your rehab properly and concentrate on parts of your body that you might ignore a little bit if you are playing week in, week out.\n“So, he has that base fitness and a number of games now. He has always shown he has an eye for a goal and scored again at the weekend. Hopefully he can bring that goalscoring form to the squad.”\nClarke will take his men to Spain for a training camp in order to give them the best possible chance to peak for the forthcoming games, but he doesn’t necessarily concur with the view of star man John McGinn, who recently said that the national side got their preparation for last year’s June fixtures wrong.\nScotland suffered hugely disappointing defeats to Ukraine and Ireland in the corresponding window 12 months ago, but Clarke doesn’t agree with McGinn that the team were undercooked. Rather, they just underperformed.\n“I saw those comments,” he said. “We actually had two camps last year. We had one for Championship players, who had stopped early on May 8th.\n“We then had a secondary camp for players who had stopped mid-May and the Scottish season stopped on the 14th last year.\n“So, we did have a camp, but with the English-based boys who played later, they got two or three days off and the only time we had the full squad together was 24 hours before the Ukraine game, because Andy Robertson was playing in the Champions League final and Scott McKenna in the Championship play-off.\n“To be honest, it’s similar this year. We have cup finals this week and players are involved in those. The Italian and Belgian seasons don’t finish until next weekend and those players (Lewis Ferguson and Jack Hendry) will need two or three days off to rest their bodies a little bit before coming into camp.\n“So, it’s still going to be a little bit bitty, but we will manage to get some structured training into the group.\n“The Championship boys have had to work on their own now for the best part of three weeks. We’ve got them on monitors - now they could be sticking the monitor onto their dogs for all we know! But we trust our players and know they will be working hard individually.\n“I think they underperformed in the games against Ukraine and Ireland. I don’t think the players would argue with me over that.\n“This year we have two games we understand the importance of - not to say we didn’t understand the importance of the games last year, as they were obviously massive.\n“But we underperformed and hopefully going into these games we will perform better and get the points that we need.”\n*Steve Clarke was speaking at a McDonald’s Fun Football session in George Square as part of the Scottish FA’s Week of Football, a week-long series of celebratory events that will shine a light on the clubs, schools, bodies, volunteers and fans across Scotland who make football possible to mark the association’s 150th anniversary.",
  "word_count": 1326,
  "scraped_at": "2026-02-14T02:00:19.989756",
  "_text_extracted": true
}