{
  "article_id": "45e10380904b",
  "url": "https://www.cityam.com/lionesses-lauren-james-goal-helps-england-keep-100-per-cent-record-but-keira-walsh-injury-overshadows-win/",
  "title": "Lionesses : Lauren James goal helps England keep 100 per cent record but Keira Walsh injury overshadows win",
  "date": "20230728T121500Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lionesses: Lauren James goal helps England keep 100 per cent record but Keira Walsh injury overshadows win\nLauren James’ maiden World Cup goal was enough for England to maintain their 100 per cent record in Group D with a 1-0 victory over Denmark at the Sydney Football Stadium.\nThe Chelsea forward struck the sixth-minute opener, but England suffered a major blow after 38 minutes when midfielder Keira Walsh was stretchered off with an apparent knee injury and later appeared on the touchline using crutches.\nJames’ goal was England’s first from open play since April’s Finalissima at Wembley, while Denmark came within inches of a last-gasp leveller when Amalie Vangsgaard’s header clipped the post.\nEngland now have to wait for the result of China and Haiti in the late kick-off to learn if they have advanced to the knockouts with a match to spare.\nSarina Wiegman stuck with the same starting line-up for every game of the Lionesses’ Euro 2022-winning campaign, but she shook things up against Denmark with two changes from England’s 1-0 tournament opener against Haiti.\nJames, who came on as a substitute in that match for her World Cup debut, replaced Lauren Hemp on the left wing while Rachel Daly returned to a more familiar left-back where she started every match of the European Championships.\nThat pushed Alex Greenwood to centre back, leaving Jess Carter looking on from the bench after starting against Haiti.\nWiegman’s decisions were almost instantly justified when Daly slipped the ball to James, who curled past Denmark goalkeeper Lene Christensen.\nElla Toone nearly set up James for a second soon after, but this time the 21-year-old was only able to drill a low attempt into Christiansen’s arms.\nWith England largely dictating play, Denmark’s first real chance of an equaliser came when Rikke Madsen collected the ball and pivoted on the right edge of the penalty area but sent her effort across the face of goal.\nLars Sondergaard’s side were picking up the pace with Janni Thomsen firing over and ex-Chelsea forward and Denmark skipper Pernille Harder denied by Mary Earps, while at the other end Lucy Bronze nodded Chloe Kelly’s corner over.\nThen came what could be a devastating blow to Wiegman’s side when Walsh slid to collect the ball and was in immediate pain when she stopped.\nWalsh waved off help from her team-mates as she could clearly be seen telling the team’s medical staff: “I’ve done my knee.”\nThe Champions League winner, named player-of-the-match in the Euro 2022 final, was stretchered off and replaced by Manchester City’s Laura Coombs.\nHarder rolled an effort wide to end the first half, while Kathrine Kuhl could not find the finishing touch for Denmark after the restart.\nAlessia Russo came close to extending England’s advantage when she collected the ball in midfield and drove down the pitch before firing wide of the near post from 12 yards.\nEarps, who made a vital save to deny Haiti a late leveller, was tested again when she parried Katrine Veje’s cross – which seemed destined to clip the crossbar – out of harm’s way.\nBoth Toone and Russo’s shifts came to an end after 77 minutes as Hemp came on for the former and Russo was replaced by Beth England, who was part of the Lionesses European Championship-winning squad but did not play a single minute.\nThe Spurs striker directed a header wide and Bronze missed from a late attempt from distance.\nThe Lionesses narrowly avoided late drama when a pair of Denmark substitutes nearly combined for an equaliser, but to their relief Vangsgaard’s header from Nicoline Sorensen’s cross came back off the right post, and a leaping save from Earps in four minutes of stoppage time sealed another too-close-for-comfort result.\nPress Association – Rachel Steinberg",
  "word_count": 627,
  "scraped_at": "2026-02-14T02:00:36.689599",
  "_text_extracted": true
}