{
  "article_id": "45f3890f7480",
  "url": "http://europe.chinadaily.com.cn/a/202302/04/WS63dd9af2a31057c47ebacdfd.html",
  "title": "Harry Kane has records in sight , but trophies elude him",
  "date": "20230204T014500Z",
  "domain": "europe.chinadaily.com.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harry Kane has records in sight, but trophies elude him\nMANCHESTER, England — Harry Kane will become Tottenham's all-time leading scorer with a goal against Manchester City on Sunday.\nThe striker's wait for a major trophy, however, will go on.\nKane is set to surpass the late Jimmy Greaves' club record of 266 goals, which has stood for 53 years. He is also tied with Wayne Rooney with 53 goals for England's national team and has a chance to eclipse that record total before the season ends.\nAlan Shearer's benchmark of 260 Premier League goals remains the long-term target, with Kane currently at 199.\nWhile those statistics confirm Kane's status as one of the finest forwards in soccer history, at 29 years old his career is in danger of being left unfulfilled in terms of trophies.\nIt could have all been so different if Pep Guardiola got his way in 2021 when Kane was the City manager's leading transfer target. Had that move gone through, Kane might already have ended his wait for silverware — and be much closer to Shearer's record.\nInstead, it is Erling Haaland now knocking in the goals for City and on course to break Premier League scoring records this season.\nThe Norway international has thrived from the service of Kevin De Bruyne, scoring 25 league goals already — two more than last season's co-Golden Boot winners, Mo Salah and Son Heung-Min, managed in the entire campaign. In total, Haaland has 31 goals in only 26 appearances for City.\nWhile Kane cannot match that daunting strike rate, he has been as consistent as ever, with 16 goals in the league and 18 overall in a Tottenham team that is nine points below City and uncertain of qualifying for the Champions League next season.\nSome believe that Kane would have been more suited to Guardiola's tactics than Haaland because of his ability to drop deep and link the midfield with the attack.\nCity's system has become more direct with Haaland up front and, at times, more predictable as a result.\nEven with the numbers being produced by the 22-year-old Haaland, the reigning champions trail Arsenal by five points at the top of the standings, having played a game more. It could be eight points by time City kicks off at Tottenham, with Arsenal playing Everton on Saturday.\nKane is focused on putting himself in a position to win the biggest team prizes, rather than just individual honors. And that may well have to be at a club other than Tottenham.\nHis name did not feature highly during the January transfer window, but it could be a different story at the end of the season when he will have one year left on his contract. Manchester United is looking for a replacement for Cristiano Ronaldo and has long-been linked with Kane.\nThat move is one of the few realistic options if Kane does leave Tottenham, given the Premier League's greater spending power in comparison to Europe's other big leagues.\nTottenham's reported price of about $123 million for Kane would also be an obstacle to all but the richest clubs.\nKane's age is another factor. He will be 30 by the start of next season.\nAnd while recent years have proved there is a market for forwards in their 30s, Kane's price tag could be prohibitive. At the same age, Sadio Mane joined Bayern Munich from Liverpool for $43 million last year. And Barcelona signed Robert Lewandowski from Bayern for $52 million when he was about to turn 34.\nKane has suggested in the past that he would rather stay in England and the Premier League might be the best chance of Tottenham demanding maximum money, even if it means selling to a direct rival.\nChelsea and Newcastle are the other teams likely to try to strengthen their attack at the end of the season.\nIf he did go overseas, Paris Saint-Germain may need to replace Kylian Mbappe if Real Madrid renews its interest in the France striker. Alternatively, Madrid might see Kane as competition for Karim Benzema, who is 35.\nAs one of the few players capable of enhancing just about any team in the world, a case could be made for Kane at the majority of Europe's leading clubs. For now, Tottenham still has the benefit of his rare goal-scoring talents and is hoping he can lead the team to a top-four finish.\nGuardiola, meanwhile, will hope Kane doesn't inflict another blow to City's title ambitions on Sunday.\nAP\nMost Popular\n- Guangdong beats Macao 2-0 in first leg of soccer cup\n- Para teams set to leave mark on ice\n- US skier Johnson wins women's downhill as Vonn crashes at Milan-Cortina Games\n- Su Yiming clinches first medal at Milano-Cortina\n- Over 300 athletes from 35 countries and regions kick off Asian championships in Tianjin\n- Legacy of Beijing 2022 lives on as Milan welcomes Games",
  "word_count": 821,
  "scraped_at": "2026-02-14T01:53:21.836174",
  "_text_extracted": true
}