{
  "article_id": "46001e120350",
  "url": "https://metro.co.uk/2026/01/31/leeds-vs-arsenal-predicted-lineup-today-confirmed-team-news-26611975/",
  "title": "Leeds vs Arsenal : Predicted lineup today and confirmed team news",
  "date": "20260131T091500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal have cruised to a dominant win over Leeds United to open up a seven point lead at the summit of the Premier League.\nAfter defeat to Manchester United last weekend that allowed Manchester City and Aston Villa to close the gap on them, the Gunners delivered an emphatic response to those doubting their title credentials at Elland Road.\nGoals from Martin Zubimendi, an own goal from Karl Darlow, Viktor Gyokeres and Gabriel Jesus sealed the emphatic win on the road that will have eased some of the nerves beginning to build back at the Emirates.\nMikel Arteta opted to leave his captain Martin Odegaard out his starting XI after his disappointing performance last week with Kai Havertz starting his first league match in almost a year.\nBukayo Saka was also withdrawn from the starting XI minutes before kick-off with what appeared to be a groin injury with Noni Madueke brought into replace him.\nThe former Chelsea star was without an assist in the league all season but was the provider for Zubimendi’s header on 27 minutes. It was his corner too that caused havoc in the box 11 minutes later with Darlow punching into his own net.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nViktor Gyokeres ended his long wait for a league goal with 20 minutes remaining, capping a much-improved performance with a neat finish from Gabriel Martinelli’s cross.\nMore Trending\nGabriel Jesus, off the bench to replace the Swede, added a fourth late on.\nArsenal’s win puts the pressure back on City and Villa to keep pace on Sunday. They are in action away to Tottenham and at home to Brentford respectively.\nRelive the action with Metro’s LIVE matchday blog.\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nFULL-TIME! Leeds 0-4 Arsenal\nWhat a response from Arsenal! They are seven points clear at the top again.\nLeeds 0-4 Arsenal\n90 mins | Four minutes added on here.\nLeeds 0-4 Arsenal\n89 mins | They all want one now – Martinelli is the latest to have a pop but Darlow makes the save.\nLeeds 0-4 Arsenal\n88 mins | Third time lucky for Jesus! Odegaard finds him and the Brazil international dances past his marker with a sublime dummy to make room for the shot. The finish is class, steering it into the bottom corner.\nGOAL! Leeds 0-4 Arsenal | Gabriel Jesus, 86 mins\nNow Jesus has his goal!\nLeeds 0-3 Arsenal\n79 mins | Jesus denied again! Timber this time does brilliantly to lift the ball into him but his header is pushed away by Darlow.\nIt is starting to hammer it down at Elland Road now; a few of the home fans have decided to call it a day.\nLeeds 0-3 Arsenal\n77 mins | And Jesus should score straight away! It’s a brilliant run from Rice who tees up the Brazilian but he sends his shot wide.\nLeeds 0-3 Arsenal\n74 mins | Two more changes for the Gunners, Gabriel Jesus and Riccardo Calafiori are on for Hincapie and Gyokeres.\nLeeds 0-3 Arsenal\n71 mins | They have had to weather the storm a bit, but Arsenal are on their way to victory now. It’s good work from Martinelli who beats Struijk to lift the ball in towards the big Swede who volleys home.\nGOAL! Leeds 0-3 Arsenal | Viktor Gyokeres, 69 mins\nArsenal can breathe easy!\nLeeds 0-2 Arsenal\n62 mins | There is definitely still a bit of life in Leeds – get one back at the roof is going to come off this place.\nLeeds 0-2 Arsenal\n60 mins | Martin Odegaard and Gabriel Martinelli are on for Havertz and Madueke.\nMadueke could have had three assists today but leaves with two – a good day at the office after he was drafted in just minutes before kick-off.\nLeeds 0-2 Arsenal\n58 mins | Timber picks up a booking after blocking Gudmundsson. Arsenal scramble the free kick clear and we are about to have our first Arsenal substitutions of the game.\nLeeds 0-2 Arsenal\n54 mins | Okafor is involved again after Leeds eventually find a way in behind that Arsenal defence but his looping effort is collected by Raya.\nLeeds 0-2 Arsenal\n52 mins | Big chance for an Arsenal third! Madueke swings in another excellent cross but Timber glances it over the bar.\nLeeds 0-2 Arsenal\n48 mins | Much better from Leeds in these opening few minutes. Okafor, off the bench alongside Longstaff at half-time is causing problems and Leeds have a corner.\nStruijk is onto it and draws the first save out of the afternoon out of Raya.\nSECOND-HALF UNDERWAY!\nHave Leeds got something to show here?\nHALF-TIME! Leeds 0-2 Arsenal\nThe Gunners are on top and going seven points clear again if it stays this way.\nLeeds 0-2 Arsenal\n45 mins | Two minuted added on at the end of the first-half.\nMORE: Estevao ruled out of Chelsea vs West Ham and returns to Brazil\nMORE: Why Bukayo Saka is not playing for Arsenal against Leeds United today\nMORE: Man Utd star makes U-turn over transfer exit ahead of January deadline",
  "word_count": 914,
  "scraped_at": "2026-02-14T01:53:15.574804",
  "_text_extracted": true
}