{
  "article_id": "4602c387389e",
  "url": "https://www.teamtalk.com/leeds-united/three-hurdles-to-clear-leeds-chances-re-signing-kalvin-phillips-catapult-towards-reality",
  "title": "Leeds United transfer news : Verbal agreement in place as Whites aim to sign 31 - cap England star and player stance is revealed",
  "date": "20250311T173000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leeds United\nPremier League • England\nThree hurdles to clear as Leeds chances of re-signing Kalvin Phillips catapult towards reality\nLeeds United are very much on course to bring Kalvin Phillips back to Elland Road this summer, sources have confirmed, with the player’s stance on a move and the obstacles needed to clear for his return all coming to light.\nHometown hero Phillips departed West Yorkshire in summer 2022, joining Manchester City in a £42m deal, which was one of two major departures – Raphinha’s £55m move to Barcelona being the other. But while Phillips won a Treble in his first season at the club, peaking with Champions League glory against Inter Milan in Istanbul, the move to the Etihad has not worked out with form, fitness and injuries all playing their part in a dramatic fall from grace.\nNow, with Leeds pushing hard for a return to the Premier League, though their lead at the summit has been reduced to goal difference only after taking just one point from their last two games, plans are afoot to add to their squad should they return to the promised land.\nIndeed, it will be a big summer at Elland Road if they are promoted and sources have confirmed they have a verbal agreement lined up to bring Phillips back to Elland Road.\nHe was sent out on loan to Ipswich Town this season, but the Tractor Boys do not look likely to make the deal permanent, regardless of whether they can somehow survive in the Premier League, with a return to Phillips’ boyhood club on the cards instead.\nWe understand that Leeds have been keen on bringing him back in 12 months now and almost completed the deal last year. Indeed, the England international was at the play-off final and was lined up for a return that summer had they managed to secure victory and get promoted. But when they lost the game to Southampton and had to accept they would remain in the second tier of English football for another year, their hopes of re-signing the 29-year-old were also brought to an end.\nBut with City still open to a parting of ways and his exit green-lit by Pep Guardiola, a season’s loan to Portman Road was lined up instead.\nNow, though, we can reveal a verbal agreement has been reached between Phillips and Leeds to return, while City themselves are also well aware of the interest.\nAny deal, though, will likely be subject to Leeds once again securing promotion, as well as the two clubs agreeing on a fee. We understand, though, City will not stand in his way and a £20m offer would be enough for them to accept.\nThirdly, Phillips would also need to agree on a reduction in wages, though that is unlikely to be an issue either with the player eager to return to his roots.\nDON’T MISS ⚪🟡🔵 Exclusive: Leeds considering bid for ‘intelligent’ left-back as Junior Firpo succession plan emerges\nLeeds transfer latest: Czech star targeted; Meslier to Man Utd cleared up\nMeanwhile, we can confirm Manchester United have shelved their interest in signing Illan Meslier this summer after identifying the Frenchman as a possible backup goalkeeper for Andre Onana.\nThe Frenchman’s deal at Leeds is due to expire in summer 2026, meaning the Whites will have a big decision to make this summer. As a result, and with the Red Devils having eyed a cut-price move, they have instead put that on the backburner and could instead look to sign a new No.1 with another Championship star wanted instead.\nElsewhere, Leeds are one of three sides being credited with an interest in Viktoria Plzen playmaker Pavel Sulc, who could be available for a bargain fee this summer.\nThe talented 24-year-old has an impressive 23 goal contributions in 39 matches this season.\nAnd finally, Daniel Farke has been warned he will need to splash out some £200m this summer if he is to prevent the Whites from dropping immediately back down to the Championship, while a big update on Manor Solomon’s future has dropped.\nIN-FOCUS: How Kalvin Phillips’ career has tumbled since Leeds exit\nJuly 4, 2022: Manchester City complete the signing of Phillips from Leeds for £42m.\nAugust 7, 2022: Pep Guardiola gives Phillips his City debut as a substitute for Rodri in a league game against West Ham.\nSeptember 6, 2022: Phillips makes his first Champions League appearance as a substitute against Sevilla.\nSeptember 17, 2022: Phillips suffers a shoulder injury that requires surgery and keeps him out of action until November.\nDecember 23, 2022: Guardiola claims Phillips is overweight after coming back from World Cup duty with England.\nJanuary 11, 2023: Phillips finally makes his first start for City in an EFL Cup quarter-final loss to Southampton.\nFebruary 19, 2023: Guardiola issues an apology for his comments about Phillips’ weight.\nMay 21, 2023: With the title already wrapped up, Phillips makes his first league start for City.\nJune 3, 2023: Phillips remains an unused sub as City win the FA Cup final.\nJune 10, 2023: Likewise, Phillips – unpicked since the round of 16 – stays on the bench as City complete the treble by winning the Champions League final.\nDecember 13, 2023: Phillips scores his first goal for City from a penalty against Club Brugge in the Champions League, on his first start in the competition.\nJanuary 26, 2024: After he was an unused sub for nine Premier League games in a row for City, West Ham sign Phillips on loan for the rest of the season.\nFebruary 1, 2024: On his West Ham debut, Phillips commits an error leading to goal against Bournemouth in the opening few minutes.\nFebruary 17, 2024: Phillips is sent off for getting two yellow cards in a loss to Nottingham Forest.\nMarch 14, 2024: Gareth Southgate leaves Phillips out of his England squad, citing a lack of confidence in his performances.\nMarch 30, 2024: Phillips gives away a penalty against Newcastle after coming on as a substitute and later shows his middle finger to fans berating him.\nApril 21, 2024: Phillips makes his final West Ham appearance before not being picked by David Moyes in their last four games of the season.\nAugust 16, 2024: Ipswich take Phillips on loan for the 2024-25 season after gaining promotion to the Premier League.\nAugust 28, 2024: Phillips debuts for Ipswich as a starter in an EFL Cup game against AFC Wimbledon.\nNovember 2, 2024: Phillips receives two yellow cards, leading him to be sent off against Leicester.\nJanuary 12, 2025: Phillips scores his first Ipswich goal in an FA Cup game against Bristol Rovers.",
  "word_count": 1109,
  "scraped_at": "2026-02-14T02:02:35.608167",
  "_text_extracted": true
}