{
  "article_id": "4604c1638433",
  "url": "https://metro.co.uk/2026/01/01/enzo-maresca-held-talks-another-premier-league-club-chelsea-exit-25982096/",
  "title": "Enzo Maresca held talks with another Premier League club before Chelsea exit",
  "date": "20260101T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Enzo Maresca informed Chelsea he had held multiple talks with another Premier League club before his departure from Stamford Bridge.\nChelsea confirmed on New Year’s Day that Maresca, who arrived in the summer of 2024, had left the club by mutual consent.\nThe Italian’s exit comes less than six months after he helped Chelsea win the Club World Cup at the end of his first season in west London.\nMaresca also guided Chelsea to the Conference League title last season, while the Blues qualified for the Champions League on the final day.\nChelsea were tipped by many as dark horses to win the Premier League this season but any hopes of clinching the title quickly evaporated.\nThe Blues have won just one of their past seven league games, slipping 15 points behind Premier League leaders and London rivals Arsenal.\nA dip in form coincided with growing tensions at boardroom level, with Maresca saying last month that a lack of support from ‘many people’ had made it his ‘worst 48 hours’ in the job.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMaresca had already been critical of Chelsea’s failure to sign a new centre-back last summer after Levi Colwill’s ACL injury and had started wearing his own clothing rather than club tracksuits.\nChelsea were booed off after Maresca’s final game in charge of the club – a 2-2 draw at home to struggling Bournemouth.\nAnother sign that the writing was on the wall for Maresca was speculation linking him with Manchester City, where he worked as an U23 coach and then as Pep Guardiola’s assistant before his stint at Leicester City.\nChelsea statement on Enzo Maresca exit\nChelsea Football Club and Head Coach Enzo Maresca have parted company.\nDuring his time at the Club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup. Those achievements will remain an important part of the Club’s recent history, and we thank him for his contributions to the Club.\nWith key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the Club believe a change gives the team the best chance of getting the season back on track.\nWe wish Enzo well for the future.\nMaresca publicly dismissed the links but The Athletic say he held talks with Man City on at least three occasions since late October.\nIt is claimed Maresca had conversations with ‘people associated with Manchester City’ about the manager’s job at the Etihad Stadium if and when a vacancy arises.\nMaresca, who has been talked up as a potential successor to Guardiola, was obliged to inform Chelsea about the talks due to a clause in his contract.\nGuardiola, one of the greatest managers of all time, looks set to end his long association with Man City next summer.\nMore Trending\nMaresca recently dismissed the speculation linking him with the Manchester City job, telling reporters: ‘It doesn’t affect me. It’s 100% speculation.\n‘There is no time for this kind of thing. I have a contract here until 2029. My focus is just about this club. I’m very proud to be here.\n‘It’s speculation. One week ago was the same thing with Juventus. I don’t pay attention because I know it’s not true.’\nIronically it is Manchester City who Chelsea face next in their first game since Maresca left the club by mutual consent.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Chelsea-linked Liam Rosenior has already named club he supports and job he wants\nMORE: I snubbed Manchester United transfer – and then became a legend at Liverpool\nMORE: Premier League club shortlist two Chelsea stars for January transfers",
  "word_count": 673,
  "scraped_at": "2026-02-14T01:59:31.501535",
  "_text_extracted": true
}