{
  "article_id": "46235731373f",
  "url": "https://www.fourfourtwo.com/features/he-sat-us-all-down-in-the-hotel-and-his-aura-was-instantly-clear-he-kept-repeating-that-we-were-going-to-win-the-league-the-following-season-john-terry-opens-up-on-his-first-meeting-with-jose-mourinho",
  "title": "  He sat us all down in the hotel and his aura was instantly clear . He kept repeating that we were going to win the league the following season  John Terry opens up on his first meeting with Jose Mourinho",
  "date": "20250830T084500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘He sat us all down in the hotel and his aura was instantly clear. He kept repeating that we were going to win the league the following season’ John Terry opens up on his first meeting with Jose Mourinho\nThe Portuguese boss made a strong first impression at Stamford Bridge\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nJose Mourinho didn’t mess around when it came to announcing his arrival in English football back in 2004.\nHe was hired by Chelsea fresh from his Champions League triumph with Porto, with his first press conference being one of the most iconic introductions ever, as he declared himself ‘a special one’, much to the delight of the assembled media.\nAnd it would appear that Mourinho was just as confident when he met up with his new players for the first time.\nJohn Terry recalls first Jose Mourinho meeting\nJohn Terry - who was ranked by FourFourTwo as Chelsea’s best-ever player in 2023 - quickly became one of Mourinho’s most trusted lieutenants and recalls the impact that the Portuguese had when he arrived in west London.\n“He’d just won the Champions League with Porto and we all remember that press conference when he referred to himself as a ‘Special One’,” Terry recalls to FourFourTwo. “Everybody watched that and started calling each other, going, “Crikey, get a load of this guy!”\n“But one of the first things he did was come to Portugal to meet us Chelsea lads at the England camp for Euro 2004. He sat us all down in the hotel and his aura was instantly clear.\n“He kept repeating that we were going to win the league the following season and that myself, Frank and the others would be a big part of that. We lapped it up. It was a really powerful first meeting.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“Then we got back after the Euros and discovered what a brilliant worker he was. He demanded so much from everybody, from the kit man to canteen staff to the players. The detail he gave us before games, whether it was in the Premier League or Champions League or against a smaller team in the FA Cup, was something I’ve never seen with any other manager. He was incredible.”\nMourinho would win two Premier League titles, an FA Cup and two League Cups in his first three seasons with the club, but was sent on his way in September 2007 amid reports that he’d fallen out with owner Roman Abramovich.\n“I was devastated,” Terry continues. “In our final game under Jose, we drew with Rosenborg in the Champions League and I felt I was at fault for their goal - the man I’d been marking got away from me at a corner and scored. So, when I heard Jose had been sacked, I blamed myself a bit.\n“Could he have stayed and turned things around if we’d kept a clean sheet that night? Who knows? He was an incredible manager, and a big loss. People cried when he said goodbye, including me. Avram Grant came in and he was very different; the players took charge of the dressing room. We were a strong group, but there was definitely a feeling we’d lost a top manager. We were all gutted.”\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.\n- Ed McCambridgeStaff Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 795,
  "scraped_at": "2026-02-14T01:52:36.764509",
  "_text_extracted": true
}