{
  "article_id": "4635bf9413f4",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=307274",
  "title": "Mendy moves on",
  "date": "20230629T011500Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mendy moves on\nEdouard Mendy has left Chelsea after three seasons and completed a permanent transfer to Saudi Professional League side Al-Ahli.\nThe 31-year-old will be best remembered at Stamford Bridge for the key role he played on our run to Champions League glory in 2021. Mendy conceded just twice in seven knockout matches and those goals were unstoppable volleys by Porto forward Mehdi Taremi and Karim Benzema of Real Madrid.\nThe Senegal international registered nine Champions League clean sheets in 2020/21, a feat achieved by no other goalkeeper in their debut season in Europes elite club competition.\nThose performances resulted in Mendy being named UEFA Champions League Goalkeeper of the Season, The Best FIFA Mens Goalkeeper, and helped him to second place in the voting for the Yashin Trophy, an award that recognises the games top stoppers. He became only the second goalkeeper in Chelsea history to be shortlisted for that honour.\nMendys second campaign at Stamford Bridge brought more success. We won the UEFA Super Cup and FIFA Club World Cup, the second of those coming just days after he had been the hero for Senegal in the Africa Cup of Nations final, saving the decisive spot-kick in the penalty shootout.\nMendy kept 23 clean sheets for Chelsea during the 2021/22 season, including in both domestic finals. He also kept five consecutive shutouts in Champions League home fixtures, a first by a goalkeeper of an English club.\nHis 30th clean sheet for the Blues came in his 54th appearance. Only Petr Cech reached that figure in fewer matches.\nMendys minutes were limited last term, but he did pass the 100-game barrier. In total, he featured 105 times for Chelsea and 49 of those games ended with a clean sheet.\nHaving started his career in the lower tiers of French football and even spending several months without a club Mendy rose to the pinnacle of European football with Chelsea. A hugely likeable character on and off the pitch, he will always have a place in our history for his significant contributions to our 2021 Champions League triumph.\nFor that, and for everything else, we are grateful. Good luck, Edou!\n( Press Release Image: https://photos.webwire.com/prmedia/8/307274/307274-1.jpg )\nWebWireID307274\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 390,
  "scraped_at": "2026-02-14T01:56:02.401718",
  "_text_extracted": true
}