{
  "article_id": "46367dd8c11f",
  "url": "https://www.90min.com/posts/antonio-conte-worst-moments-at-tottenham-ranked",
  "title": "Antonio Conte worst moments at Tottenham",
  "date": "20230326T221500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Antonio Conte's worst moments at Tottenham - ranked\nBy Sean Walsh\nThe Antonio Conte era at Tottenham Hotspur is finally over.\nSpurs have confirmed that they have now parted ways with the Italian head coach little over a year-and-a-half after he joined the club.\nConte was not expected to extend his stay at Tottenham beyond the summer, but after such a dismal run of results and performances, chairman Daniel Levy decided to cut the cord immediately.\nWhile there were certainly highs for Conte's Spurs, there were also terrifying lows. Here are the very worst moments of his tenure in north London.\n6. Have you heard of NS Mura?\nThe answer is no. You could be the biggest Football Manager nerd out there, you could even live in Slovenia - you did not know who NS Mura were until they beat Tottenham.\nAs Spurs were forced to forfeit the final game of the group stage due to a coronavirus outbreak, a 2-1 loss in Maribor effectively eliminated them the UEFA Europa Conference League - a competition they had a great chance of winning.\n5. Three losses to Chelsea in one month\nThe Tottenham-Chelsea rivalry has become particularly one-sided in recent years, with the Blues consistently compounding Spurs' misery.\nConte was given a great chance to get one over his former side when the two were drawn together in the semi-finals of the 2021/22 Carabao Cup, meaning Tottenham and Chelsea would meet three times in as many weeks.\nSpurs lost all three, failing to score in any of their meetings.\n4. FA Cup humiliation - Middlesbrough edition\nWith Tottenham out of Europe and falling to Chelsea in the Carabao Cup, their only hope of winning silverware in 2021/22 came in the FA Cup.\nThey were given a rather favourable draw away at Championship side Middlesbrough in round five. But despite playing their strongest team, Spurs were beaten 1-0 after extra-time.\nMaybe it was for the best as they would have played Chelsea in the quarter-finals.\nREAD NEXT\n3. FA Cup humiliation 2 - Sheffield United Boogaloo\nThe writers of Groundhog Day wouldn't be allowed to get away with this narrative.\nThis season, Spurs were again drawn away at a Championship outfit in the fifth round of the FA Cup.\nConte - at this point managing from Italy following gallbladder surgery - and his coaching team selected a weakened XI and were duly punished, again being dumped out following a 1-0 loss. A home tie with Blackburn Rovers awaited them in the quarter-finals.\nTottenham's trophy drought goes on.\n2. That fateful AC Milan substitution\nThe moment that Conte effectively handed in a resignation.\nSpurs trailed AC Milan 1-0 in the second leg of their UEFA Champions League last 16 tie and had failed to really lay a glove on them over the 170 minutes that had been played to that point.\nCristian Romero had just been sent off, but the Rossoneri were still not overly inclined to add to their lead, while Tottenham still had to score.\nConte brought on defender Davinson Sanchez for forward Dejan Kulusevski. Fans booed and chanted the name of Mauricio Pochettino.\nHe was done.\n1. That post-Southampton press conference\nLevy might have given Conte some leeway to finish the season had he just deflected his answers in his post-match presser following the Southampton draw, but he instead took a giant can of gasoline and poured it all over the Spurs fire.\nHe aggressively questioned his players' commitment, calling them selfish and saying they are overly protected from criticism. He wondered why Tottenham had not swept up silverware under this ownership. For a man who only recently recovered from surgery, he was lively and fiery.\nConte dropped the mic and ended his Tottenham career.\nOn this edition of Oh What a Night, part of the 90min podcast network, Sean Walsh & Jude Summerfield discuss the issues at Tottenham Hotspur and who is to blame for where the club find themselves. If you can't see this embed, click here to listen to the podcast!",
  "word_count": 674,
  "scraped_at": "2026-02-14T02:09:52.188888",
  "_text_extracted": true
}