{
  "article_id": "4638911a7b5d",
  "url": "https://thenationonlineng.net/juric-doubts-lookmans-future-with-atalanta-2/",
  "title": "Juric doubts Lookman future with Atalanta - The Nation Newspaper",
  "date": "20250830T093000Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nAugust 30, 2025 by Our Reporter\nJuric doubts Lookman’s future with Atalanta\nAtalanta coach Ivan Juric still expects more new signings before the transfer deadline, but admits ‘it is difficult to hazard a guess’ on whether Ademola Lookman will stay or go.\nLa Dea opened their campaign with a disappointing 1-1 draw against Pisa and now face a tricky trip to Parma today.\n“The second half against Pisa was excellent, but the only problem was that we failed to capitalise on our chances. We’ve got to improve on dealing with the long ball game of opponents,” noted the coach in his press conference.\n“Parma are a tough opponent, they had the first really big chance of their game against Juventus, even if they eventually lost. Carlos Cuesta comes from Arsenal, so I expect an aggressive pressing game and danger on set plays.\n“We use zonal defending and know how to adjust from game to game. Arsenal and in general the Premier League are tactical inspirations for me, there is such a maniacal focus on certain aspects that we don’t really pay attention to.”\nEderson was struggling with injury problems ahead of that game and will also miss out tomorrow, while Lookman remains an outcast following his attempts to walk away this summer.\nRead Also: Int’l Friendly: NFF hails Abiodun on cash gifts to Falcons, Lionesses\n“I think that could still get some more moves done before the transfer deadline. I don’t know anything about Lookman, it’s difficult to hazard a guess on what will happen or if he will remain,” added Juric.\nLookman had wanted a transfer to Inter, but the club withdrew after their offer was turned down, then nobody else was prepared to match it.\nHe has been training separately from the rest of the squad, but remains under contract and could be welcomed back into the fold.\nAtalanta are in the Champions League again this season and the draw pitted them against Chelsea, Paris Saint-Germain, Club Brugge, Eintracht Frankfurt, Slavia Praha, Olympique Marseille, Athletic Club Bilbao and Union Saint-Gilloise.\n“There are no fragile teams in there,” insisted Juric. “I faced Union before and know how good they are, while Slavia Prague play really good football too, I scouted a few of their players. Obviously, then facing champions of PSG or Chelsea will be special.”",
  "word_count": 388,
  "scraped_at": "2026-02-14T01:58:57.503240",
  "_text_extracted": true
}