{
  "article_id": "4670f1255632",
  "url": "https://www.arsenal.com/news/merino-we-cant-wait-go-paris",
  "title": "Merino :  We cant wait to go to Paris  | Interview | News",
  "date": "20250430T001500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Merino is already counting down the days for our Champions League semi-final second leg at Paris Saint-Germain, despite us heading to the French capital behind on aggregate.\nWe fell to our first European loss in 12 games against the French champions thanks to Ousmane Dembele’s fourth-minute strike, but the Spanish international feels that we have plenty to be optimistic about heading into the rematch, given OUR encouraging display against tough opposition where fine margins weren’t in our favour.\n“It was a tough game,” he reflected. “Every minute counts, and in the first 10-15 minutes maybe we didn't perform at the level we are used to, but I think the team recovered really well from the goal. We showed a lot of character and personality, and we almost dominated the rest of the game.\n“We know we have a really good team, a powerful team, and we are really confident that we're going to win the second leg. I think people are optimistic. We know that what we showed today is just the beginning of what we are, and obviously really confident, really full of power for the second leg.\n“I think what we'll learn is that we are able to dominate any team, anywhere. This is a team that really wants to be the ball the whole time, really wants to keep you in your box. Today we proved that we can play against anyone and be the main team on the pitch. Today showed us that we are really capable of performing anywhere. We can't wait to go to Paris.”\nMikel thought he had got on the scoresheet once again in a fruitful 2025 for him so far when he headed in a Declan Rice free-kick just after half-time, but an agonisingly long wait saw the VAR disallowed the goal for offside.\nHe admitted he was gutted to see the goal wiped out which proved to be a huge turning point in the game, but he hopes that luck will be on our side next week when we meet PSG again and we look to capitalise on any advantage we can find.\nReflecting on his disallowed goal, he added: “It was tough, but those are the margins that we manage in these kinds of games.\n“This is elite football, and a few centimetres can determine your future. So, hopefully in the second leg, those 10 centimetres can go to our side.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 430,
  "scraped_at": "2026-02-14T02:09:01.850582",
  "_text_extracted": true
}