{
  "article_id": "4697baeaebf8",
  "url": "https://www.caughtoffside.com/2025/02/21/ronald-araujo-united-transfer/",
  "title": "Ronald Araujo transfer : Man United ready €100m bid for Barcelona star",
  "date": "20250221T141500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly ready to pay as much as €100million for the transfer of Barcelona defender Ronald Araujo in an ambitious summer move.\nThe Red Devils are keen to make a statement signing in defence for new manager Ruben Amorim, and it seems Barca star Araujo could be the priority.\nThat’s according to a report from Spanish outlet Fichajes, who claim that Man Utd are preparing a €100m offer for the Uruguay international.\nThe report adds that Barcelona’s financial problems could perhaps open the door for this deal, as the Catalan giants may be forced to accept such a big proposal.\nAraujo is a world class centre-back on his day, and one imagines he could have a really positive impact at Old Trafford if he were to join.\nWould Ronald Araujo really want to join Manchester United?\nHowever, Fichajes note that Champions League football could be crucial in Araujo’s thinking, and that almost certainly won’t be on offer at United next season.\nIt generally isn’t looking like the best time to be joining MUFC, who remain a bit of a mess this season despite so many changes behind the scenes.\nSir Jim Ratcliffe and INEOS are now co-owners and have sporting control ahead of the Glazers, but it’s remained pretty chaotic with several changes to personnel on and off the pitch.\nAraujo would probably be better off staying at Barcelona rather than joining United in their current state, even if big players will always likely be tempted by the chance to play in the Premier League.\nThe 25-year-old would also surely be an important addition to Amorim’s squad, giving him an upgrade on unconvincing summer signing Matthijs de Ligt, as well as on backup players like Harry Maguire and Victor Lindelof.",
  "word_count": 292,
  "scraped_at": "2026-02-14T01:58:05.341128",
  "_text_extracted": true
}