{
  "article_id": "4698f52b0499",
  "url": "https://www.caughtoffside.com/2024/12/13/jamie-carragher-man-united-sell/",
  "title": "Jamie Carragher has told Man United to sell Marcus Rashford",
  "date": "20241213T124500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have entered a crucial phase under new manager Ruben Amorim.\nWith the January transfer window approaching, changes could be made to their squad in order to make improvements as they aim to turnaround their disappointing season.\nThe Red Devils are currently in the bottom half of the Premier League table and their target to finish in the top four of the league is now looking like a distant dream.\nThe era under Amorim is off to a mixed start with the players showing some signs of improvement but also showing that they need time to adapt to the playing style of the manager.\nMarcus Rashford has been linked with a move away from the club this week and football pundit Jamie Carragher has suggested to Man United to cash in on the English attacker.\nWriting in his column in The Telegraph, Carragher said:\n“Given how many signings have dropped in value since joining United, it does not surprise me that big names such as Marcus Rashford are being linked with a move. United should sell him as he is not delivering value for his lucrative contract. Eleven goals in his 48 league appearances over the past 18 months is not good enough.\n“There has been too much of a pantomime around Rashford for the last few seasons, the promise he showed when breaking into the side not realised. He is 27 now and should be in his prime. In a front three, Rashford is the third attacker. United will never win the Premier League or Champions League if he is leading the line.”\nMarcus Rashford to leave Man United?\nRashford’s form has dropped every season in the last few seasons. His issues off the pitch have not helped his cause.\nThe Man United attacker has still not fully lived up to the expectations of the fans and the club.\nWith Rashford, it always feels like he can do so much better than what he has already done.\nHis poor form also became the reason of his elimination from the England squad for Euro 2024.\nA player of his age should be at the peak of his career and not struggling like Rashford.\nPerhaps a move away from Old Trafford could work in his favour and Barcelona have emerged as one of the contenders to sign the unwanted Man United star.",
  "word_count": 392,
  "scraped_at": "2026-02-14T01:58:00.751170",
  "_text_extracted": true
}