{
  "article_id": "46aebab252fa",
  "url": "https://dailytrust.com/nigerias-quartet-embark-on-continental-quest-as-2025-26-caf-campaign-begins/",
  "title": "Nigeria quartet embark on continental quest as 2025 / 26 CAF campaign begins – Daily Trust",
  "date": "20250920T123000Z",
  "domain": "dailytrust.com",
  "source_country": "Niger",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The air around Nigerian club football is charged with anticipation as September 2025 marks the beginning of another Confederation of African Football (CAF) interclub campaign. This time, four clubs – Remo Stars, Rivers United, Kwara United and Abia Warriors – will shoulder the country’s hope of continental glory.\nThe quartet have rich storylines where Nigeria Premier Football League (NPFL) champions, Remo Stars will be chasing redemption, just as league runners-up and veterans, Rivers United will be seeking consistency, while newcomers, Kwara United and Abia Warriors are daring to dream.\nWhile 120 clubs gear up across the continent, Nigerians’ eyes are fixed on this quartet as they chase continental glory. Trust Sports offers a cursory look at their chances on the African club football stage.\nRemo Stars\nIn Ikenne, Ogun State, the atmosphere has been electric since Remo Stars lifted the NPFL trophy earlier this year. The Sky-Blue Stars, as they are fondly known, now carry the responsibility of representing the country as league champions in the CAF Champions League. Their first assignment looks straightforward on paper: a preliminary clash against US Zilimadjou of Comoros at the MKO Abiola International Stadium in Abeokuta.\n- Razak Omotoyossi: All-time leading goals-corer and fantastic footballer\n- NGE lauds Mutfwang on peace building, infrastructure development\nThe Sky-Blue Stars will welcome Comoros’ Zilmadjou on September 21 before meeting them again at the same venue on September 26 for the return leg. With CAF rejecting their home ground for international fixtures, Zilmadjou opted to stage their “home” match in Nigeria.\nBut the weight of history hangs over the tie. Twice in succession, Remo Stars have stumbled at this stage, failing to reach the group phase. That bitter memory lingers, and the players know that a repeat would sting deeply.\n“We are leaving no stone unturned,” a club statement posted recently read, echoing the determination of both players and staff. The club has spent the offseason strengthening its squad and sharpening tactics, determined to avoid the pitfalls of previous years.\nIf they overcome Zilimadjou, the reward, or perhaps punishment, is a daunting second round tie against Mamelodi Sundowns. The South Africans are not just seasoned campaigners but also former CAF Champions League winners, regulars at the business end of the tournament and one of Africa’s representatives at the 2025 FIFA Club World Cup in the United States.\nFor Coach Daniel Ogunmodede and his players, the challenge is immense, but so is the dream. The Remo Stars Stadium in Ikenne will host their return leg, a venue that has become something of a fortress. Yet, as supporters know, continental football has its own rhythms, and Nigerian clubs have often been undone in hostile away grounds, where officiating, travel fatigue and atmosphere test mental steel as much as football skill.\nRivers United\nA little further South, Rivers United are plotting their own Champions League adventure. The Pride of Rivers, Nigeria’s runners-up last season, were drawn against the league champions from the Democratic Republic of Congo. Their opening tie at the 80,000-capacity Complexe Omnisports Stade des Martyrs in Kinshasa promises to be physical, contested in the kind of intimidating Congolese atmosphere that has historically tested Nigerian sides.\nVictory will send Rivers United into a second-round showdown against either the AC Léopards of the Republic of Congo or Mozambique’s Black Bulls. Neither opponent is a household name like Sundowns or Al Ahly, but both bring their own dangers.\nRivers United know the pain of near misses. In recent campaigns, they have shown flashes of brilliance but fallen short when it mattered most. For Coach Finidi George, this season is about converting promise into consistency. Their Port Harcourt base will be buzzing come late September when they host their return leg, with fans hoping to roar them past the first major hurdle.\nKwara United\nIn Ilorin, Kwara United are preparing for the Confederation Cup, a competition they earned entry into by winning the Federation Cup earlier this year. Their first continental opponent is no stranger to Nigerian fans: Ghana’s Asante Kotoko, a club steeped in history and one of Africa’s most decorated sides.\nFor the Harmony Boys, this is both a glamorous and intimidating draw. The first leg will take them to Kumasi, where the Baba Yara Stadium is expected to be packed with tens of thousands of Kotoko supporters. The return fixture in Nigeria will test Kwara’s composure in front of their home crowd.\nCoach Tunde Sanni has not shied away from the enormity of the task, saying, “I believe Asante cannot do more than what Warri Wolves did, and if we can survive this, we can survive in Ghana. It was a good game and a good test ahead of Asante Kotoko,” the coach said, reflecting on last Sunday’s goalless draw away at NPFL newcomers, Warri Wolves.\nHis confidence is bolstered by the club’s off field strides: just weeks ago, Kwara United secured a major shirt sponsorship deal worth over N50 million annually, a timely boost ahead of their continental push.\nIf they somehow overcome Kotoko, a colossal challenge awaits – Wydad Casablanca of Morocco, champions of Africa in 2017 and 2022. For Kwara, this is a baptism of fire but also the kind of opportunity every club craves: the chance to measure themselves against Africa’s best.\nAbia Warriors\nOf all four Nigerian clubs, perhaps none has a story as romantic as Abia Warriors. Based in Umuahia, this modest side is preparing for its first ever appearance in a CAF competition. For their players and fans, it is a dream come true.\nTheir debut pits them against Djoliba AC of Mali, a side with rich continental experience. On paper, it is a difficult draw, but for Abia Warriors, every step is a learning curve. If they advance, they will meet either USFAS of Mali or AS Gbohloesu of Togo in the next round.\nWhile the club has kept its preparations quiet, insiders suggest a sense of quiet belief runs through the camp. For Abia Warriors, success may not be measured by silverware, but by proving that they can compete, and perhaps, springing a surprise or two along the way.\nIn conclusion, this season is historic for CAF competitions. A record 120 clubs – 62 in the Champions League and 58 in the Confederation Cup – will battle for continental supremacy. CAF President Patrice Motsepe has also doubled the financial support for preliminary round participants from $50,000 to $100,000, a crucial move for clubs facing long travel, accommodation and logistics expenses.\nThe preliminary rounds will unfold across two weekends in September (19 to 21 and 26 to 28), with the winners progressing to second round ties in October. From there, the victorious teams will enter the lucrative group stages, beginning November 21. Knockouts will start in March 2026, with dreams of continental finals waiting on the horizon.\nNigerian clubs have not had it easy in recent years. No side has reached the Champions League group stage since Lobi Stars in the 2018/2019 season. Repeatedly, teams have fallen at the first or second hurdle, sometimes to less fancied opposition. However, the chase for continental glory is on. Nigeria’s quartet stand ready; and this time, the whole country is watching.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 1229,
  "scraped_at": "2026-02-14T02:12:04.363737",
  "_text_extracted": true
}