{
  "article_id": "46afcbd2c444",
  "url": "https://www.themag.co.uk/2025/02/hits-and-myths-a-few-home-truths-from-a-newcastle-united-fan/",
  "title": "Hits and myths : a few home truths from a Newcastle United fan",
  "date": "20250207T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hits and myths: a few home truths from a Newcastle United fan\nAs football fans, we expect to hear a load of codswallop from people with no great knowledge of our club. You know the sort: supporters of other teams, armchair critics who never or rarely step inside a stadium, overpaid ex-players with an axe to grind, happily masquerading as pundits while earning money for old rope.\nAs a Newcastle United fan, I give their views as much credence as John Fogerty’s ridiculously luscious locks. Talk about a revival; his barnet has been reborn more times than an evangelical preacher has ripped off thousands of gullible believers.\nTheir opinions are at best ill-informed, at worst wantonly malicious. Stuff the lot of them. They’re worth no more than a flying fig. The Flat Earth Society has more relevance in my book.\nWhat of our own fanbase? Should we hope for a bit more from those who purport to have the club’s best interests at heart?\nThe world would be a desperately dull place if we all agreed with each other day by day, year by year. Everyone has an opinion and, in a free society, everyone is entitled to air it…but I sometimes despair at the blinkered outlook reflected in online posts, social media and other platforms.\nAm I the only Newcastle United fan shocked by those who were calling for Eddie Howe to be sacked earlier this season? On what distant planet do these folk reside? One where their bonkers brains have imagined St James’ Park has hosted season after season of unalloyed success, presumably. Well, that rules out anyone other than those born before 1945, if my maths is up to snuff.\nWe truly were top dogs, kings of England from 1951-55, winning the most coveted domestic football trophy three times in five years. Is that the standard by which United’s current achievements should be judged? Give over, man!\nIn 2023, during Howe’s first full season in charge, we reached a Wembley cup final for the first time since 1999. We also qualified for the Uefa Champions League for the first time in a generation.\nLast season, one wrecked by an unimaginably devastating series of injuries, we would again have booked a berth on the great European gravy train, albeit in the low-key Uefa Conference League, if not for Manchester City’s feeble display against their noisy neighbours in the FA Cup final. How anybody can seriously call 2023-24 a failure is beyond my ken. Disappointing, yes. Frustrating, of course. Those emotions are part and parcel of being a football supporter, backing your team through thin and thinner.\nI count myself as a good loser, having had more than half-a-century of practice. Which, by the way, prompts an obvious question: how come a certain Senor Mikel Arteta is such a sour-faced, surly and utterly ungracious little man after years of winning sweet FA? Did you see his final whistle handshake with Emperor Eddie on Wednesday night? I’ve witnessed greater empathy when a bull encounters a tourist in Pamplona.\nThis season alone, Arsenal have been beaten three times in three matches by United, yet still Pep-lite plays the curmudgeonly card, grudgingly admitting we were better than his team in both boxes, as if that were a minor detail.\nSorry to be the bearer of bad news, you overpaid, underachieving nonentity, but that tends to be the deciding factor in nearly all football matches. They are not won or lost on possession percentages, passing statistics and other spurious measures. Just stick the ball in the opponents’ net while keeping it out of your own. Simples!\nOne standard by which I measure a manager is his ability to keep a level head, show some respect, some honesty and some (that current buzzword) humility.\nA team tend to reflect the gaffer’s personality, which perhaps explains the petulant streak that runs through the Arsenal players like a four-letter word through a stick of rock. While Howe is suitably humble, Arteta is more bumble and fumble. It must be the balls, they move a lot. What a shame.\nIn brief, given the choice between keeping our current manager and replacing him with whomever you care to name, I will vote every time for rock-steady Eddie. Before he has even won a trophy.\nThat view is by no means universal among United’s fans, though I would venture he is held in higher esteem today by thousands of Toon Army members than he was four or five months ago.\nMany reckoned he was inflexible, set in his ways, devoid of a Plan B. Hush such idle talk. Wednesday night’s tactical masterclass exploded that myth good and proper.\nOur already revered manager is by no means the only victim of ill-informed criticism from those who should know better.\nValuable players who always give 100% have been labelled Championship-level at best, despite helping United to qualify for the Champions League and acquitting themselves respectably in a Group of Death.\nThe mark of a great manager is an ability to make good players better, to blend individuals into a formidable line-up that is more than the sum of its parts. Sir Bobby Robson did it. Look at the squad from our remarkable European run in the 2002-03 season. Yes, there were some top performers. There were also some limited footballers who played to a level they probably doubted they could reach.\nI see the same alchemy in Howe’s work, ever since he was hired in November 2021. He helped to turn Miggy Almiron from an all-action but often wayward Duracell bunny (other long-life batteries are available) into an integral part of our attacking threat two seasons ago.\nThe manager has also brought the best out of Sean Longstaff, for far too long a target of the keyboard boo boys who stubbornly refuse to acknowledge what Lobby does for his teammates, allowing them freedom of expression while he covers the hard yards without the ball.\nAlmiron has departed and Longstaff is no longer a regular starter but both were important in lifting United from the depths of the Premier League to the cusp of greatness.\nThis season’s zero-to-hero in black and white is Jacob Murphy. He spent almost a decade as a professional before finding a manager willing and able to show faith in his mercurial talent. I suspect there are still thousands of St James’ Park regulars who would love to replace Smurf at the first opportunity. I also suspect a certain Alexander Isak will never agree with them. The Murphy-Isak interplay has bamboozled plenty of opposition defences in the past few months and I’m looking forward to it bamboozling a few more at the business end of the season.\nWhat’s my point? Only this: if Eddie Howe decides to select a player you don’t particularly rate, please remember the boss already knows a great deal more than you and I will ever learn.\nHis players may not be world class (with one or two exceptions).\nThere is always room for improvement (as he readily concedes).\nOther clubs are equally ambitious (if not more so).\nWhat none of us should doubt is his dedication and his team’s determination to turn United from also-rans into winners. For that, he and they deserve our overwhelming support.\nThe atmosphere for the League Cup semi-final was exceptional. Let’s make it a given at every home match. United we stand.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1248,
  "scraped_at": "2026-02-14T02:08:52.956088",
  "_text_extracted": true
}