{
  "article_id": "46ca0c727152",
  "url": "https://metro.co.uk/2025/12/08/cole-palmer-missed-chelsea-training-will-not-play-atalanta-25282938/",
  "title": "Why Cole Palmer has missed Chelsea training and will not play against Atalanta",
  "date": "20251208T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cole Palmer made his return to Chelsea’s starting line-up on Saturday, but will not be in Champions League action this week.\nThe England star had not started for the Blues since September 20 as he was given time to recover from an ongoing groin issue.\nThere were fears that the 23-year-old would need surgery to fix the injury but the club chose to rest him instead and he spent over two months out of action.\nPalmer returned off the substitutes’ bench in defeat at Leeds United last week and was back in the starting XI in the stalemate against the Cherries.\nHowever, he sat out training on Monday ahead of Chelsea’s trip to Italy to face Atalanta on Tuesday night and will not be in the squad for the match.\nInstead the Blues are being careful with their star performer, leaving him out entirely and saving him to face Everton at Stamford Bridge in the Premier League on Saturday.\nNot only was Palmer kept out for several weeks due to his groin problem, but also thanks to fracturing his toe in an accident at home, so he is being managed back to full fitness on both fronts.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nEnzo Maresca’s side has made a good start to the Champions League group stage, sitting seventh in the table after five games.\nHowever, they will still be tested in order to secure a top eight spot, with another trip to Italy in their last group game to face Serie A champions Napoli.\nA home game in between their Italian jobs sees them host Pafos, who have performed admirably so far, losing just once in five outings.\nMaresca will hope to have Palmer available for as much of the busy festive schedule as possible, with four Premier League matches still to play this month and a Carabao Cup quarter-final against Cardiff City.\nThe Italian’s options going forward were reduced due to a shoulder injury suffered by Liam Delap against Bournemouth.\nHow long the English forward is going to be out for is yet to be confirmed, but Maresca said it ‘looks bad’ for the summer signing after the game.\nMore Trending\nThe Club World Cup winners are hardly short of attacking talent, though, with Alejandro Garnacho and Pedro Neto also starting the game against the Cherries.\nChelsea's December fixtures\nTue 09: Atalanta (a) Champions League\nSat 13: Everton (h) Premier League\nTue 16: Cardiff (a) Carabao Cup\nSat 20: Newcastle (a) Premier League\nSat 27: Aston Villa (h) Premier League\nTue 30: Bournemouth (h) Premier League\nEstevao, Joao Pedro and Marc Guiu all came on as substitutes, while Jamie Gittens remained on the bench.\nDespite these various threats, Maresca was left frustrated by what they delivered against Bournemouth, saying after the draw: ‘I think it was a game where we lacked, we missed a little bit of quality in the last third.\n‘For me, many mistakes. We missed some passes in the last third, some moments that we could shoot and avoid that, cross. But yeah, overall, when you are not able to win, we said many times that it’s important that we don’t lose.’\nMORE: Emmanuel Petit claims Chelsea have replacement secured for £25million star\nMORE: When is the FA Cup third round draw? Start time, ball numbers and how to watch on TV\nMORE: Forgotten £39m Chelsea star in talks to leave in January",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:03:26.517318",
  "_text_extracted": true
}