{
  "article_id": "46ca211d331c",
  "url": "https://www.nytimes.com/athletic/6891537/2025/12/24/nottingham-forest-review-2025/",
  "title": "Nottingham Forest 2025 in review : Seville takeover , Elliot Anderson shines and City Ground hopes",
  "date": "20251224T083000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It has been another eventful year for Nottingham Forest.\nThey have had three managers, a flirtation with Champions League qualification and a return to European football, another £200million recruitment drive and an unexpected slide towards the wrong end of the table.\nAs 2026 approaches, things are definitely looking up again for Forest, but the last 12 months have not been short of surprises.\nHere, Paul Taylor looks at some of the highs and lows.\nAdvertisement\nBest moment\nThe sight (and sounds) of thousands of Forest fans lining every bar and cafe in Seville as the club made its first return to Europe in three decades was something very special.\nForest fans had waited a long time to return to the European stage, and the party atmosphere they generated in Spain before, during and after the draw with Real Betis was something to behold.\nSeville is a beautiful city. For a few days, it was bathed in a sea of red.\nWorst moment\nThe appointment of the former Tottenham and Celtic boss, Ange Postecoglou, on September 9. Has there been a bigger error of judgment at Forest in the modern era?\nTo attempt to go from the organised, disciplined and electric counter-attacking style that had been built successfully under Nuno Espirito Santo, to something from the very opposite end of the football spectrum, with the season already underway, was — admittedly with a significant dollop of hindsight — total lunacy.\nPostecoglou’s 39-day tenure was doomed from the start. He did not seem to understand the club, he definitely did not understand the fans, and his football was a disaster.\nBest game\nPerhaps there is a bit of recency bias involved, but the 3-0 win over Tottenham on December 14 felt like a landmark moment under Sean Dyche.\nThe thumping 7-0 win over Brighton in February will live long in the memory, as will other home wins over Manchester United and Manchester City last season — and the 3-0 victory at Anfield more recently.\nBut with Forest having started the season with worryingly poor home form, the dominant win over Thomas Frank’s side felt timely. Plus, Forest played some great football, which was perfectly exemplified by the third goal, which saw a flurry of passes culminate in a thunderous strike from Ibrahim Sangare. This will be a contender for goal of the season.\nAdvertisement\nThis was not only an important win, but a strong hint that there may be more to come from Dyche’s side.\nBest player\nThe only possible answer is Elliot Anderson. Other players have been very good, but they have not been Anderson good.\nForest immediately believed they had got an outstanding deal when they effectively signed Anderson for £15million — with Odi Vlachodimos moving as a £20m makeweight in the deal — from Newcastle. But, over the past year, the midfielder has evolved into one of the brightest prospects in the country, not just at the City Ground. There is an argument to be made that it is the best business Forest have done in the modern era.\nHe is a joy to watch. Enjoy every moment.\nThe stat that sums up 2025\nThree managers in 42 days, between September 9 and October 21.\nNuno had three games in charge, then Postecoglou lasted eight — without winning one.\nBy the halfway point of the year, Forest had finished the season just a point away from Champions League qualification. As 2025 draws to a close, Dyche has been leading them in a very different battle — largely because of the chaos of those 42 days.\nThankfully, he definitely has Forest moving in the right direction.\nFavourite quote\n“I prefer the boring 1-0 wins, you know that… it is far too exciting when we start passing it around and knocking in goals like that…” Dyche said in the aftermath of that 3-0 win over Tottenham.\nDyche is a manager who seems entirely aware of the perception — fair or otherwise — that many opposition fans seem to have of him.\nBut he is shaping his Forest side into one that has proved capable of delivering performances that can alter that narrative. Yes, Forest like to play direct football, but they also like to pass it around when the opportunity arises.\nMost surprising thing that happened\nNuno talking himself out of a job.\nAdvertisement\nAfter finishing seventh and securing a return to European football, one thing that was not on anyone’s Nottingham Forest bingo card was that there would be a change in manager by September.\nBut the most successful manager since Frank Clark began grumbling about recruitment in July and, by August, he twice publicly questioned his relationship with the then recently appointed global head of football, Edu and, more tellingly, club owner Evangelos Marinakis. There were inevitable consequences.\nWhich of your club’s players will do best at the World Cup?\nThe prospect of an England midfield trio made up of Anderson, Declan Rice and Jude Bellingham already feels like an exciting blend of attributes.\nAnderson is a young man with the quality and mental strength to shine on the biggest stage. He was part of the England side that won the Under-21 European Championships last summer, so he does understand how to achieve tournament success.\nChris Wood is already a legend in New Zealand and will be a massive player for them. Dan Ndoye is an important player for Switzerland, while Willy Boly and Ibrahim Sangare will be heavily involved with the Ivory Coast.\nIs it too late for Murillo or Igor Jesus to force their way into the Brazil squad, along with goalkeeper John Victor?\nPlayer to watch in 2026\nOmari Hutchinson… and Dilane Bakwa.\nForest fans have recently got to see more of what Hutchinson, the club’s £37.5million record signing, can deliver, with Dyche giving him more regular opportunities. His explosive acceleration and pace are already a vital asset.\nFollowing his debut campaign in the top flight last year, Forest have wanted to be patient with the former Ipswich player as he finds his feet at a new club. But they have had no choice but to be patient with Bakwa, who has only recently returned to full training following a hamstring injury that had kept him sidelined since early October.\nAdvertisement\nAt the time of writing, the £30million signing from Strasbourg has only made two Premier League starts and two substitute appearances. Forest were genuinely excited when they signed Bakwa. They felt that he, like Hutchinson, was a young man with genuine attacking quality and considerable potential.\nA wish for 2026\nThat all of the very many required pieces fall into place for Forest and work can finally begin on the ambitious redevelopment of the City Ground next summer.",
  "word_count": 1123,
  "scraped_at": "2026-02-14T01:52:59.285714",
  "_text_extracted": true
}