{
  "article_id": "46dd77d6f5c6",
  "url": "https://www.90min.com/supercomputer-predicts-winners-of-champions-league-2024-25",
  "title": "Supercomputer predicts winners of Champions League",
  "date": "20240927T061500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Supercomputer predicts winners of Champions League\n- Opta have predicted most likely 2024/25 Champions League winners\n- Real Madrid are the current holders after securing a 15th title last season\n- Man City, Arsenal and Inter among the sides hoping to dethrone the Spanish side\nReal Madrid and Manchester City have been crowned victors in the last three Champions League seasons and it's difficult to look beyond the European heavyweights in 2024/25.\nOf course, there could be some surprise candidates in the lew-look and expanded Champions League format, with Borussia Dortmund, Bayern Munich and Paris Saint-Germain all reaching last year's semi-finals.\nHowever, in many people's opinions, it remains a battle between two of football's most esteemed coaches in Carlo Ancelotti and Pep Guardiola.\nBut do stat experts Opta agree with the consensus of the masses, or are they backing an underdog for victory?\nSupercomputer ranks favourites for 2024/25 Champions League\nWell, just to eliminate any element of doubt, Opta are in agreement with the majority, placing Manchester City (25.3%) and Real Madrid (18.2%) as significant favourites for the title this term.\nSomewhat surprisingly, Guardiola's side have been given a 7.1% stronger chance of being crowned champions, despite Madrid knocking the City out of the competition last season en-route to glory and also adding Kylian Mbappe to their squad during the summer.\nThe only other side to come register a similar backing to the two runaway favourites is Serie A champions Inter (10.9%). Simone Inzaghi's side reached the final of the competition in 2022/23 and narrowly lost to Man City, but only made the round of 16 last season before being dumped out by Atletico Madrid.\nArsenal (6.3%) registered a quarter-final appearance on their return to the Champions League last season and have an outside chance of winning their first title. Bayer Leverkusen (5.4%) reached the Europa League final in 2023/24 and are fancied ahead of Barcelona (5.2%), Liverpool (4.2%) and Bayern Munich (4.1%) - who boast a combined 17 European Cups.\nWith Mbappe having finally departed, could Paris Saint-Germain (4.1%) win a first ever Champions League title? It seems unlikely but the French giants did reach the semi-final last term and will likely top Ligue 1 by some distance by the time the knockout stages arrive, allowing for greater rotation in key games.\nBorussia Dortmund (2.4%), Atletico Madrid (2.2%) and Juventus (1.1%) are offered a surprisingly slim chance of winning Europe's top prize. The German side reached the final last season, while Atletico and Juve made four finals collectively in the 2010s.\nEuropa League victors Atalanta (1.7%) have little hope of winning a second successive European trophy, while Aston Villa (0.2%) have been given almost no hope of repeating the success of 1982. Spare a thought for 1967 champions Celtic (0%) too, who have been literally zero chance of winning.",
  "word_count": 470,
  "scraped_at": "2026-02-14T02:08:12.419647",
  "_text_extracted": true
}