{
  "article_id": "471c878bf65a",
  "url": "https://www.empireofthekop.com/2025/01/30/roy-keane-liverpool-ian-wright-disagree/",
  "title": "Roy Keane refused to support Ian Wright Liverpool score prediction",
  "date": "20250130T123000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In the grand scheme of things, Liverpool’s final-day defeat to PSV (3-2) in the Champions League league stage was inconsequential.\nThe Merseysiders still topped the table, owing to Barcelona’s 2-2 draw with Atalanta, whilst managing to rest several key stars ahead of a return to Premier League action at the weekend.\nNonetheless, we’ve no doubt that Arne Slot’s side will be itching to get back to winning ways – starting with a trip to Andoni Iraola’s in-form Bournemouth outfit.\nThe European football hopefuls will be no pushovers, of course; their form against the current top six has been seriously impressive.\nIan Wright disagrees with Roy Keane over Bournemouth v Liverpool\nBearing in mind the circumstances surrounding Liverpool’s trip to the Netherlands, Ian Wright was initially keen to throw the weight of his support behind the Premier League toppers.\n“Liverpool win that, I think,” the former Arsenal striker spoke on The Overlap.\n“No, no, no,” Roy Keane responded.\n“You don’t think?” Wright said.\nGary Neville urged his colleague to stick with his guns regarding his prior support of Bournemouth in match predictions.\nAfter some deliberation, the 61-year-old eventually changed his mind and backed Bournemouth for a 2-1 win at home to Arne Slot’s travelling Reds.\nHere’s hoping the Cherries don’t spoil our party!\nWhy Liverpool need a result at the Vitality Stadium\nPut simply, we’ve got some incredibly challenging fixtures coming up on the horizon.\nBetween the last Merseyside derby at Goodison Park and a trip to the Etihad Stadium a week later, there are already two strong opportunities for Liverpool to drop valuable points in the title race.\nGoing to one of either ground needing all three points to ensure we don’t let Arsenal or Forest back into the race would be a far from ideal situation.\nThat all said, we’ve faith in this Reds side doing the business at the weekend – even against Iraola’s giant-killers!\nJoin our channel of readers on WhatsApp to get the day’s top stories straight to your mobile",
  "word_count": 334,
  "scraped_at": "2026-02-14T02:20:55.376735",
  "_text_extracted": true
}