{
  "article_id": "472c3cf6d482",
  "url": "https://www.90min.com/features/6-outrageous-transfer-rumours-currently-doing-the-rounds",
  "title": "6 outrageous transfer rumours currently doing the rounds",
  "date": "20240629T090000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "6 outrageous transfer rumours currently doing the rounds\n- Erling Haaland has been linked with Barcelona\n- Alexander Isak is reportedly a target for Chelsea\n- The most ridiculous rumours so far this summer\nAlthough Euro 2024 is dominating the headlines at the moment, the transfer rumour mill is still chugging along in the background.\nAnd, as expected, the rumour mill is conjuring up some utterly ridiculous stories.\nFrom the biggest clubs in world being linked to Hull City players, to world class forwards being linked with clubs with zero pounds and zero pence in the bank, we've every type of lunacy thus far this month.\nHere's our picks for the most outrageous rumours of the 2024 summer transfer window so far:\nAlvaro Morata to Man Utd\nThe rumour\nAccording to Turkish website Sabah, Manchester United are interested in activating a €12m release clause to sign Alvaro Morata from Atletico Madrid this summer.\nOur take\nA Turkish outlet linking a La Liga player with a Premier League club always screams 'this is never happening in a million, billion, trillion years'.\nHowever while this deal does scream that too, it actually does make a bit of sense.\nFor United, Morata is in that sweet spot of being good enough to contribute when called upon, but also not being good enough or young enough to take too much of Rasmus Hojlund's minutes up top. He's also reportedly quite affordable too.\nUnited could do a lot worse.\nAmadou Onana to Bayern Munich\nThe rumour\nThe Telegraph are reporting that Bayern Munich are set to step up their efforts to sign Everton's Amadou Onana this summer.\nOur take\nThere are two big questions surrounding this rumoured deal:\n- Is Onana a viable alternative to Joao Palhinha?\n- Is Onana even good enough to play for Bayern Munich?\nThe answer to both right now is probably 'no'. The towering midfielder is a different type of player to Palhinha, who sweeps up play effectively in front of the defence, and he's rarely shown that he can get to the next level required to play for a top club like Bayern.\nIt would be quite the step up from playing at Everton.\nAlexander Isak to Chelsea\nThe rumour\nAccording to the Daily Mail, Chelsea are ready to break their own £115m Premier League record fee in order to poach Alexander Isak from Newcastle United.\nOur take\nIn a pre-PSR world, this may have made a semblance of sense.\nBut we don't live in a pre-PSR world, we live in the real world.\nIn the real world Chelsea are currently focused on selling players in order to not earn themselves a points deduction ahead of the 2024/25 season.\nThis is not a deal that'll happen.\nJaden Philogene to Barcelona\nThe rumour\nRelevo are reporting that Barcelona have entered talks with Hull City over potentially signing Jaden Philogene, who they view as an alternative target if a deal for Nico Williams falls through.\nOur take\nYes, a Hull City player has been linked with Barcelona.\nYes, that is very, very, very strange.\nMats Hummels to Mallorca\nThe rumour\nThe Mallorca Zeitung are reporting that Mats Hummels is ready to take a huge pay cut in order to join Mallorca after leaving Borussia Dortmund as a free agent.\nOur take\nHummels to Mallorca...no not on holiday.\nWith all due respect to Mallorca, moving from the UEFA Champions League finalists to a team that finished 15th in La Liga would be quite the step down for the veteran defender.\nErling Haaland to Barcelona\nThe rumour\nAccording to Sport, Barcelona president Joan Laporta is trying to sign Erling Haaland as part of his re-election campaign.\nOur take\nErling Haaland, arguably the most valuable footballer in the world today, joining arguably the most financially decrepit football club in the world today.\nSomehow, the maths just doesn't quite add up for us.",
  "word_count": 648,
  "scraped_at": "2026-02-14T01:57:18.878475",
  "_text_extracted": true
}