{
  "article_id": "473279149393",
  "url": "https://www.nytimes.com/athletic/6407933/2025/06/07/spain-portugal-uefa-nations-league-betting-odds/",
  "title": "UEFA Nations League final best bets : Can Spain shut down Portugal late - game scoring ? ",
  "date": "20250607T120000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For more stories like this, click here to follow The Athletic’s sports betting section and have them added to your feed.\nThroughout his career, Cristiano Ronaldo has won virtually every individual and team award imaginable. Sadly, for those who have admired his brilliance for the past two decades, Ballon d’Or and Champions League triumphs are no longer within reach. But with his Portugal team taking on Spain in the UEFA Nations League final on Sunday, there’s perhaps one last chance for the 40-year-old to secure silverware on the international stage.\nAdvertisement\nRonaldo’s Portugal pitted against Yamine Lamal’s Spain is essentially football’s past taking on its future. If this weekend’s action is anything like the semi-finals, buckle up. Let’s set the narratives aside and dissect the two most intriguing bets.\nHighest scoring half: Second (11/10)\nGiven that international football creates a never-ending struggle for reliable data, it’s near-impossible to pinpoint trends accurately. With that said, Portugal look like a second-half team. Both goals in the 2-1 semi-final win against Germany came after the 63rd minute. That trend showed in their 5-2 quarter-final second-leg win over Denmark, where Roberto Martinez’s side scored four of their five goals after the 72nd minute. This pattern was also evident in the 5-1 group-stage win over Poland last November, in which all five goals were scored in the second half.\nSpain have shown a similar tendency of letting second halves dominate the proceedings. La Roja’s 5-4 second-leg semi-final showdown against France featured a whopping seven goals after half-time. In their quarter-final second-leg contest against the Netherlands, five shots found the back of the net in the final 45 minutes. Although this is a small sample size, a broader trend seems to be emerging.\nIn many international contests, the condensed nature of the tournament often leads to more aggressive substituting. With the Nations League not as prestigious as the European Championships or a World Cup, managers are less likely to risk putting their core players through the wringer.\nAdditionally, countries like Spain and Portugal have such an embarrassing collection of attacking talent that it’s almost foolish not to rotate. Cast your minds back to Portugal’s 2-1 semi-final victory against Germany, where Martinez had the luxury of bringing on a midfielder who just won the Champions League with Paris Saint-Germain (Vitinha) and an attacker who celebrated a Premier League title win with Liverpool (Diogo Jota).\nAdvertisement\nIn this final, subbing will become even more crucial, as each team will only have a few days — two in Spain’s case — to rest. A quick turnaround increases the chances of early, aggressive subbing by both managers. And, in turn, likely extending the trend of the final 45 minutes producing the most goals. Betfair are pricing over 2.5 goals at 8/13, and 3.5 at 13/8.\nPortugal to lift the trophy (13/8)\nThese two bets do go together, but not in the way you might think. Sure, Portugal’s manager is far more comfortable with open, chaotic phases of the game. But this isn’t about a tactical advantage Martinez has over Luis de la Fuente.\nThe reason Portugal seems like one of the best value bets out there is because it’s hard to imagine a world where any of the top national teams should be nearly 2/1 underdogs. Holding this tournament so close to the end of the club season in a competition that doesn’t have the same gravitas as a World Cup makes it feel almost like a glorified exhibition. Given this context, should La Roja really be a 1/2 favourite to lift the trophy?\nThe FIFA rankings indicate a relatively modest gap as Spain are ranked No 2 in the world, with Portugal a bit further behind at No 7. But FIFA isn’t the only organisation assessing the strength of national teams. The World Football Elo Ratings have a much smaller gap, ranking Spain as the best team in the world and placing Portugal third.\nThere’s further evidence to suggest Spain aren’t as ship-shape as they seem. Against France, without Rodri providing cover, the back four — Pedro Porro, Marc Cucurella, Dean Huijson and Robin Le Normand — conceded 24 shots. In contrast, Portugal’s defensive line-up of João Neves, Rúben Dias, Gonçalo Inácio and Nuno Mendes are on a different level. Three of those four players are key members of two of the world’s top four teams, and they recently limited a strong German side to just nine shots.\nAdvertisement\nWhether it happens in extra time (14/1) or on penalties (12/1), Ronaldo’s squad seem the shrewd betting pick to lift the trophy at the Allianz Arena.\nMore Nations League stories\n- Spain 5-4 France: Genius Yamal and Cherki wonderstrike in Nations League semi-final\n- Germany 1-2 Portugal: Ronaldo the hero as 137th international goal seals place in final\nBetting/odds links in this article are provided by partners of The Athletic. Restrictions may apply. The Athletic maintains full editorial independence. Partners have no control over or input into the reporting or editing process and do not review stories before publication.\n(Photo of Cristiano Ronaldo: Alexander Hassenstein / Getty Images)",
  "word_count": 848,
  "scraped_at": "2026-02-14T02:09:11.430055",
  "_text_extracted": true
}