{
  "article_id": "475769921981",
  "url": "https://www.anglocelt.ie/2025/05/02/harry-maguire-determined-to-create-more-memories-with-europa-league-glory/",
  "title": "Harry Maguire determined to create more  memorie with Europa League glory",
  "date": "20250502T143000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harry Maguire determined to create more ‘memories’ with Europa League glory\nBy Simon Peach, PA Chief Football Writer, Bilbao\nHarry Maguire has created some special memories over the past fortnight and is targeting more after Manchester United moved within touching distance of the Europa League final at the end of a season he admits was a “mess” in the middle.\nAfter the makeshift striker headed home to secure a jaw-dropping 5-4 extra-time quarter-final win against Lyon, the 32-year-old centre-back produced a momentum-changing moment of magic on the wing on Thursday at Athletic Bilbao.\nMaguire’s neat footwork, composure and fine cross led to Casemiro’s opener in the semi-final first leg at a stunned San Mames, where the hosts imploded as Dani Vivian saw red for bringing down Rasmus Hojlund in the box.\nBruno Fernandes scored from the resulting spot-kick and added another before the break to complete a 3-0 win that puts them on course to return to Bilbao for the May 21st finale against Bodo/Glimt or, more likely, Tottenham.\nA post shared by Manchester United (@manchesterunited)\nEuropa League glory would not only secure silverware but much-needed Champions League qualification for a side sat 14th in the Premier League having started slowly with Erik ten Hag and stumbled under successor Ruben Amorim.\n“It wouldn’t save the season because I think it’s been disappointing,” Maguire said, echoing the United head coach’s comments on the eve of the first leg. “There’s been too many games that we’ve lost, far too inconsistent.\n“It’s been a bit of a mess in the middle of the season. The transition period, we didn’t handle it well enough. Us players didn’t take the responsibility well enough from moving manager to manager and we took too long in embedding into new ideas.\n“It’s been a difficult season, it’s been a disappointing season but of course football is about memories.\n“It’s about creating memories, it’s about winning trophies and we have a great opportunity to win a trophy. For our fans, (it’s) what they deserve, so that’s the most important thing.”\nMaguire has certainly put smiles on United fans’ faces in recent weeks, with the defender going from the subject of mockery in recent years to being mocked up in a Brazil shirt and nicknamed ‘Harrydinho’.\n“I’ve always got nicknames,” the smiling defender said. “I’m happy with that one. That’ll do.”\nBut while Maguire’s delight with how things are panning out in Europe is palpable, there appears little chance of complacency seeping in ahead of the second leg.\nAmorim’s men were fortunate not to fall behind as Athletic flew out of the blocks and the LaLiga side will be sure to come out swinging at Old Trafford next Thursday.\n“Listen, there’s still a long way to go,” Maguire said. “I think we’ve still got a job to do in the second leg of the tie.\n“I think we’ve put ourselves in a great position. There’s no doubt about it.\n“Coming here and winning 3-0 it’s a great position but I think everyone expects us to be in the final, so we’ve just got to prepare well.\n“We’ve got to prepare like it’s a game at 0-0 and go into the game and be aggressive and play on the front foot.\n“We’ll be going into that game next Thursday going to win the game and that’s the mentality we must have because we’re at Old Trafford and playing at Old Trafford demands winning football matches.”",
  "word_count": 574,
  "scraped_at": "2026-02-14T02:09:01.836471",
  "_text_extracted": true
}