{
  "article_id": "47572d88e2b4",
  "url": "https://www.dutchnews.nl/2024/02/draws-for-ajax-and-feyenoord-in-european-competition/",
  "title": "Draws for Ajax and Feyenoord in European competition",
  "date": "20240216T101500Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Draws for Ajax and Feyenoord in European competition\nAjax narrowly escaped defeat in their encounter with FK Bodø/Glimt in the first leg of their Conference League tie on Thursday when Steven Berghuis equalised for the Amsterdammers in the 97th minute.\nAjax came back from a 2-0 deficit in injury time. In the 91st minute, substitute Branco van den Boomen, who was back after almost 100 days of injury, scored from the penalty spot and six minutes later, Berghuis turned the deficit into a 2-2 draw.\nAjax are still without a win in their last seven UEFA competition knockout phase matches.\nThe return leg in the intermediate round is on 22 February in Norway. The winner will go through to the round of 16 of the third-tier European competition.\nEarlier in the evening Feyenoord keep their sights on qualifying for the Europa League round of 16 with a 1-1 draw against AS Roma. The return leg is on 22 February in Rome.\nCoach Arne Slot was without several key players, including Gernot Trauner (hamstring injury) and midfielder Quinten Timber, who is recovering from concussion.\nSlot said after the match he considered the result to be “the right one”. “And I am pleased about the fact that when you have so many other lads on the pitch… that you still see the Feyenoord football structure,” he said.\nPSV Eindhoven, the other Dutch club still in Europe, will meet Dortmund in the first leg of the round of 16 of the Champions League next Wednesday.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 308,
  "scraped_at": "2026-02-14T01:48:39.897583",
  "_text_extracted": true
}