{
  "article_id": "4760421adbe9",
  "url": "https://www.mirror.co.uk/sport/football/news/rio-ferdinand-manutd-sabitzer-verdict-29101536",
  "title": "Rio Ferdinand delivers verdict on Marcel Sabitzer transfer with no hesitation",
  "date": "20230201T094500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rio Ferdinand delivers verdict on Marcel Sabitzer transfer with no hesitation\nManchester United made a late move to sign Marcel Sabitzer on transfer deadline day following Christian Eriksen's injury - with a move going down well with Rio Ferdinand\nRio Ferdinand has hailed Manchester United 's recruitment team after they acted quick to bring in Marcel Sabitzer.\nThe Austrian made a deadline day switch from Bayern Munich, signing on loan until the end of the season. Sabitzer was struggling for minutes at the Allianz Arena and United were looking for cover following the injury to Christian Eriksen, which will sideline him for three to four months.\nThe switch therefore suited all parties and was completed late in the day. Sabitzer has previously been a key cog for RB Leipzig - masterminding victories over the Red Devils. Ferdinand is adamant that the club got the best player possible given the time scale they were working on.\nHe said on his Vibe with Five YouTube channel: \"I'm absolutely delighted. If I was going to say I'm going to get a short-term replacement for Eriksen at the drop of the hat, Sabitzer is the player you'd want. I watched a hell of a lot of this player at Leipzig when he was in the Champions League and he was integral to everything they've done. Yes he's gone to Bayern and he's not become a regular, but he's behind household names.\n\"He will be a really good signing, really experienced player, played in big games, play in the Champions League regularly, he knows his way around the football pitch. For what Man Utd need in this short window, when they needed a player, they couldn't have done better I don't think - so well done to the recruitment team.\"\nEriksen had been a regular in midfield alongside Casemiro, offering a creative influence for the forwards. Sabitzer is set to perform the same role with Scott McTominay and Fred among his competition at Old Trafford.\nWill Sabitzer be a starter for Man Utd? Have your say in the comments section\nUnited are still looking to consolidate their top four spot as they target a return to the Champions League. They also remain in both domestic cup competitions and are in the Europa League knockout stages. Games will therefore come thick and fast, but Sabitzer is confident he can contribute.\nHe told the club's website: “Sometimes in life you have to make quick and important decisions. From the moment I heard about this opportunity I knew it was right for me. I am a competitive player; I want to win and help the club achieve its aims this season.\n“I feel that I am at my peak as a player, and that I can contribute a lot of experience and energy to the squad. I am excited to start with my new team-mates and manager and to show my qualities to Manchester United fans.”",
  "word_count": 488,
  "scraped_at": "2026-02-14T01:59:41.727570",
  "_text_extracted": true
}