{
  "article_id": "47638ff322bc",
  "url": "https://www.the42.ie/champions-league-power-rankings-3-6817800-Sep2025/",
  "title": "Ranking the 8 teams most likely to win the Champions League",
  "date": "20250916T034500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "8. Chelsea\nCHELSEA’S RESULTS so far this season — they have dropped points against Crystal Palace and Brentford — suggest they are not a side that will contend for the Champions League, nor indeed the title in England.\nThat said, the likes of Liam Delap, João Pedro and Estêvão appear strong summer signings.\nThey already boast some of the most highly rated midfield players in Europe — a World Cup winner in Enzo Fernandes, the 2024 PFA Young Player of the Year in Cole Palmer and Moises Caicedo, who they bought for a then British record fee of £115 million (€133 million).\nThe Blues also have a defence that includes Euro 2024 winner Marc Cucurella, and they spent more than €200 million in transfer fees on that area of the pitch alone.\nHowever, Chelsea still finished fourth last season, 15 points behind champions Liverpool.\nIf Enzo Maresca can get his squad of talented players to gel, then they could be a force to be reckoned with in Europe.\nBut the early signs suggest they are still a work in progress.\n7. Man City\nIn previous seasons, Man City would have been much nearer the top of this list.\nBut for the first time in a considerable period, the Etihad outfit are somewhat of an unknown quantity.\nPep Guardiola is in the process of rebuilding his squad.\nLegends of the club like Kevin De Bruyne, Ederson, Kyle Walker and Ilkay Gundogan have departed.\nOf the 11 that started against Man United on Saturday, only five were part of the City squad that won their first-ever Champions League in 2023 — Ruben Dias, Rodri, Bernardo Silva, Phil Foden and Erling Haaland.\nIt still feels too early to say whether individuals such as Tijjani Reijnders, Omar Marmoush, Nico O’Reilly, Abdukodir Khusanov and Gianluigi Donnarumma are good enough to emulate their illustrious predecessors.\nThey certainly looked competent on Sunday, albeit against a tepid Man United side, and the Citizens were less convincing in recent defeats to Tottenham and Brighton.\nConsequently, there are more questions than answers. Has time caught up with trailblazing manager Pep Guardiola, who appeared burnt out on occasion last season? Is Ballon d’Or winner Rodri the same player he was before suffering the ACL injury? Can the club still be as dominant as they were in the past while still accommodating a pure goalscorer like Haaland?\nThis forthcoming campaign should go some way towards answering those queries.\n6. Bayern Munich\nAfter Leverkusen’s shock Bundesliga triumph in 2024, normal order was resumed last season, as Bayern won their 12th title in 13 seasons by a 13-point margin.\nVincent Kompany’s side are already top of the league after three games this season, and will be strong favourites to land a 35th title in their history.\nThe Champions League, though, is a different story. While they have triumphed in Europe more than any other club apart from Real Madrid and AC Milan (they are joint on six wins with Liverpool), their last victory was in 2020, and they have only once got beyond the quarter-finals since then, losing to Madrid in the semis in 2024.\nBut it would be unwise to write off a squad that contains one of the best strikers in the world, Harry Kane.\nIn attack, Michael Olise and Luis Díaz, formerly of Crystal Palace and Liverpool, are no slouches either.\nOn the other hand, the long-term loss of attacking midfielder Jamal Musiala is a serious blow after the 22-year-old suffered a fractured fibula at the Club World Cup this summer.\nThey have also sold Thomas Müller, Kingsley Coman and Leroy Sané, who have all been key players in recent years but adjudged not quite up to the task anymore.\nWhile their team contains several other top-class performers like Serge Gnabry, Leon Goretzka, Joshua Kimmich, and Dayot Upamecano, it remains to be seen whether they have comparable strength in depth to some of the other contenders.\nNicolas Jackson, for example, who recently joined in a loan deal, didn’t exactly set the world alight at Chelsea.\nMeanwhile, at 39, goalkeeper Manuel Neuer, for all his experience and leadership, has seen better days.\n5. Real Madrid\nWith 15 victories to their name, no other team comes close to matching Real Madrid’s Champions League/European Cup record, with their last triumph as recent as 2024.\nIn Xabi Alonso, they have one of the best young managers in the game, and their wealth and power mean they can consistently recruit some of the best players in the world.\nStarting with four victories from four La Liga games suggests they will be a formidable force again this season.\nLast year, however, was far from a vintage campaign for the Spanish giants.\nCarlo Ancelotti’s men suffered a comprehensive 5-1 aggregate loss to Arsenal in the competition’s quarter-finals, while they finished four points behind champions Barcelona in La Liga.\nSince then, they have lost Luka Modric and Lucas Vázquez, while gaining Trent Alexander-Arnold, Dean Huijsen and Álvaro Carreras.\nWill these new signings make Madrid considerably stronger? And can Alonso, who has big shoes to fill as he takes over from a serial winner like Ancelotti, live up to expectations?\n4. Barcelona\nBarcelona’s attackers are the envy of most sides in Europe.\nLamine Yamal, Raphinha, and Robert Lewandowski are among the best players in the world in their positions.\nThey also boast an abundance of classy midfielders like Pedri, Gavi, Fermín López, Dani Olmo and Frenkie de Jong.\nDefensively is where the biggest question marks lie.\nThe likes of Pau Cubarsí, Jules Koundé, and Eric García are respected players, but the system Barca play sometimes leaves them exposed.\nThe high line they adopted let them down time and again in last season’s Champions League semi-final, where they were knocked out after extra-time, losing a thriller 7-6 on aggregate against an Inter Milan side who were subsequently outclassed 5-0 by PSG in the final.\nThe fact that their main summer signings have been a teenager (Roony Bardghji), a goalkeeper (Joan García) and a player unwanted by Man United (Marcus Rashford) doesn’t exactly bode well either, and they have already dropped points domestically, drawing 1-1 in their third game against Rayo Vallecano.\n3. Arsenal\nOf all the top clubs that have strengthened in the summer, there is a case to be made that Arsenal have done the best business of anyone.\nViktor Gyökeres has never played in the Premier League until this season, despite spending four years at Brighton.\nBut three goals in his first four top-flight matches suggest the €63.5 million man will provide the Gunners with the cutting edge up front that they previously lacked.\nFellow new faces Noni Madueke and Martín Zubimendi have already shown their class, with the latter hitting an impressive brace in the win over Nottingham Forest at the weekend, while ex-Crystal Palace winger Eberechi Eze also looks like an astute acquisition.\nIn addition, the departures of stars like Jorginho, Kieran Tierney, Oleksandr Zinchenko and Thomas Partey — none of whom were ever considered integral — are unlikely to hurt them too badly.\nPerhaps the biggest doubt about them is the manager, Mikel Arteta.\nThe Spaniard has adopted an increasingly conservative style in recent seasons.\nThe approach has paid off to a point — Arsenal have gone from a side that went six campaigns without Champions League football to a team that has finished second for three consecutive seasons.\nBut this defence-oriented approach has hurt them occasionally, with the latest example being the humdrum 1-0 loss to Liverpool last month when Arne Slot’s side looked out of sorts and there for the taking for large portions of the game.\nThere has also been a slight case of diminishing returns — they finished 10 off Liverpool on 74 points last season, compared to tallies of 89 and 84 the previous two seasons, as they were two and five adrift of champions Man City.\nSo can the new players revitalise a club that has shown signs of flagging, or will they continue to go in the wrong direction under Arteta?\n2. Liverpool\nThe six-time winners are usually among the favourites, and the 2025-26 season is no different.\nNonetheless, the Reds are undergoing a transitional era.\nTheir attack has been dramatically altered owing to the tragic passing of Diogo Jota, coupled with the departures of Luis Díaz and Darwin Núñez, and they will also have to cope without the unique levels of creativity offered by Trent Alexander-Arnold at full-back.\nBut the arrivals of Florian Wirtz, Milos Kerkez, Hugo Ekitike, Giovanni Leoni, Jeremie Frimpong, and Alexander Isak ostensibly make the Merseyside outfit stronger overall.\nArne Slot’s side are top of the Premier League with four wins from four, although none of those victories have been convincing, as they needed late goals in each to prevail.\nBut a team winning regularly while not playing well is often considered the mark of champions, so Liverpool are expected to get better as the season progresses and the multitude of new signings fully adapt to life at Anfield.\n1. PSG\nPSG have had squads full of world-class stars for well over a decade now, and especially since the Qatari takeover in 2011.\nBut until last season, the French giants were perceived as perennial chokers in the Champions League, having never won the competition until 2025 and suffered some dramatic collapses.\nThey bucked the trend spectacularly, thanks to Luis Enrique’s force of personality and exacting standards, plus a change in approach that discarded the old system that relied on talented but egomaniacal superstars in favour of a more disciplined, unified team ethic.\nBut they also still have several highly gifted individuals — of the 30 players nominated for the 2025 Ballon d’Or, almost a third (nine) represented PSG last season.\nAnd perhaps most worryingly for their rivals, nearly all of the French champions’ key players are in their 20s, meaning there is serious potential there for the club to dominate for years to come, especially given that they have usually wrapped up the Ligue 1 title long before May, and so can focus most of their energy on the Champions League’s latter stages while their rivals are battling on several fronts.",
  "word_count": 1696,
  "scraped_at": "2026-02-14T02:09:24.924705",
  "_text_extracted": true
}