{
  "article_id": "4772c447aef0",
  "url": "https://www.dailynews.com/2023/08/22/done-juggling-tournaments-lafc-focused-on-mls-playoff-seeding/",
  "title": "Done juggling tournaments , LAFC focused on MLS playoff seeding",
  "date": "20230823T061500Z",
  "domain": "dailynews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Despite the final third of the Major League Soccer calendar awaiting them, the Los Angeles Football Club has already appeared in a season’s worth of games.\nAfter juggling CONCACAF Champions League, U.S. Open competition and the just-completed Leagues Cup alongside its MLS slate from March through August, LAFC can now focus almost exclusively on the MLS regular season.\nWith 11 league matches left prior to the postseason, last year’s Supporters’ Shield winners are 14 points behind FC Cincinnati in that race. Eight teams reside between the Black & Gold and the top spot in the standings.\nLAFC, however, is in the hunt for a second straight Western Conference title, which comes with home-field advantage at least up until the MLS Cup final as well as a berth in the rebranded 2024 CONCACAF Champions Cup.\n“We would want to be a part of that,” LAFC head coach Steve Cherundolo said of the continental tournament. “What path we take to get there I’m not too concerned with.”\nRelative to what would be a major Supporters’ Shield comeback or capturing consecutive MLS Cup titles, winning the West appears to be the least challenging option.\nLAFC (10-6-7, 37 points) sits in second place, seven points behind expansion club St. Louis City.\n“We’ve pushed to be right at the top of the Western Conference,” said goalkeeper John McCarthy, who has started 21 of LAFC’s 23 MLS matches. “You can’t ask for much more besides being at the top. We’re right there.”\nWhile McCarthy and his teammates hunkered down Sunday as remnants of Tropical Storm Hilary prompted the postponement of LAFC’s match against conference bottom dweller Colorado, St. Louis added to its lead by beating Austin.\nThe resumption of league play comes as Cherundolo, for the first time in 2023, believes he has a fully formed and fit roster to utilize through the end of the season.\n“Within the next couple weeks we should be firing on all cylinders and have everyone on board,” Cherundolo said.\nWednesday night’s match to BMO Stadium won’t feature Ecuadorian defender Diego Palacios, who is excused to tend to a private family matter.\nTeam captain Carlos Vela missed Leagues Cup contests against Real Salt Lake and Monterrey, but he is ready to return after looking good on the training field.\nAnd each newcomer added during the transfer window is eligible to participate, the club confirmed, with the final piece coming in the form of 21-year-old Uruguayan forward Cristian “Kike” Olivera.\nLAFC and Colorado will meet for the second time this year following a scoreless draw near Denver on April 1.\nThe struggling Rapids (3-10-10, 19 points) have lost each of their four away games at LAFC, but splashy new signings Rafael Navarro and Sidnei Tavares could bring life during their anticipated debuts.\nNavarro, a striker, joined Colorado as a Designated Player from the reigning Brazilian club champions S.E. Palmeiras.\nThe visitors should also have their leading scorer from last year, Chilean forward Diego Rubio, who has missed 70% of the Rapids’ available minutes this season due to various injuries.\n“It’s nice that it’s back to league play,” McCarthy said. “You don’t have to worry about anything else. A game at a time. Focus on Colorado and three points at home would be big for us.”\nCOLORADO AT LAFC\nWhen: Wednesday, 7:30 p.m.\nWhere: BMO Stadium\nTV/Radio: Apple TV+ – MLS Season Pass/710 AM, 980 AM",
  "word_count": 564,
  "scraped_at": "2026-02-14T01:56:26.907861",
  "_text_extracted": true
}