{
  "article_id": "47916ab49ab0",
  "url": "https://theathletic.com/4948890/2023/10/11/mary-earps-lionesses-goalkeeper-shirt-nike/",
  "title": "When Mary Earps asks for her goalkeeper shirt , next time Just Do It properly",
  "date": "20231011T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If you looked closely at the crowd in Leigh Sports Village on Tuesday night, as Manchester United took on Paris Saint-Germain in their first Women’s Champions League game, you might have noticed something different.\nFlashes of bright pink, yellow and green dotted around the stands. Fans were wearing Mary Earps’ elusive England goalkeeper shirt, which finally went on sale on Monday. But the journey to that point has been long and arduous.\nAdvertisement\nNearly three months ago England’s No 1 sat down in the Lionesses’ hotel conference room ahead of their first World Cup match. The expectation was that she would provide an update on the bonus dispute with the Football Association (FA), but what she said stunned everyone in the room.\nEarps revealed she had been “fighting” with Nike for the public to be able to buy her goalkeeper shirt. Earps said she had been desperately trying to find a solution with the FA and Nike but was told it was not possible and when she offered to fund the sale of the shirts herself, she was told that was not possible either.\nGO DEEPER\nThe day Man Utd staff confronted CEO Arnold over Greenwood, Antony and behaviour towards women\nHer complaint attracted significant public support. The comedian and actress Sue Perkins tweeted that she wanted an Earps shirt, while the ITV and TNT Sports presenter Laura Woods tweeted how “mad” it was not to sell the shirts.\nThe momentum was there. The pressure built on Nike. Then it stopped. Nike provided no comment on their position and Earps became absorbed by the demands of the tournament. England lost the final to Spain and Earps was the only Lioness to pick up a trophy, receiving the Golden Glove award.\nThroughout the tournament, Earps commented only once on the goalkeeper shirt issue, in a press conference ahead of the Lionesses’ quarter-final against Colombia.\n“I spoke about (the shirts) before the tournament, I expressed my views on it and I know that it’s being looked into by the relevant parties at various levels and it’s a conversation that we’ll pick up post-tournament. I want to thank everyone for their support on that, but I’m very much football-focused at this moment.”\nFollowing the final, Nike issued a statement confirming it was “working towards solutions for future tournaments”. Earps responded on her Instagram account on August 23 by writing: “Is this your version of an apology/taking accountability/a powerful statement of intent?”\nEarps also posted a link to a petition on Change.org asking people to support her and all female goalkeepers. The petition, which started on July 21, had by this stage been signed 120,000 times.\nAdvertisement\nTwenty-four hours later, on August 24, Nike said they acknowledged the “unprecedented passion and interest in women’s football this year” and accepted that, during the tournament, they “didn’t serve those fans who wished to show their passion and support to the squad’s goalkeepers”.\nBy way of amends, Nike confirmed that “limited quantities of goalkeeper jerseys for England, the U.S., France and the Netherlands” would be “sold through the federation websites over the coming days”. Nike also “committed to retailing women’s goalkeeper jerseys for major tournaments in the future”.\nThen it fell silent again, with Nike failing to explain when the shirts would go on sale and how many would be available. Earps didn’t let matters lie. In an ITV interview on September 12, Earps said: “I feel really strongly that there’s a large group of people who are not being served by our main sponsor.\n“It’s a really damaging message to send to young kids. I feel really strongly about making goalkeeping cool and making it accessible to people.”\nShe added: “I never expected to make any sort of change. I wanted to feel heard and for the fans to know that I have really been trying hard and fighting for them.”\nGO DEEPER\nMary Earps: My Game In My Words\nEighty-two days on from when Earps first spoke publicly about the issue, she finally has what she should never have had to ask for: the England goalkeeper’s home, away and third shirts have been put on sale.\nThe shirts appeared on the FA website on Monday with no formal announcement being made by Nike or the FA about their availability. It retailed at £99.95 ($123). The England men’s black home goalkeeper shirt retails at £38 on Sports Direct’s website.\nThe women’s goalkeeper shirts were snapped up within hours of going on sale and eBay was flooded with resales the same day.\nEarps thanked fans for their “incredible support”, though commented she “didn’t realise these were going on sale (on Monday)”.\nAdvertisement\nIt was a missed opportunity. In an alternative version of the story, Nike would have collaborated with Earps to coordinate the release. They would have provided details in advance, perhaps even offered an apology for their previous shortcomings. There would have been suitable fanfare upon release and there would have been enough on sale for everyone to buy them at a reasonable price.\nInstead, all the campaigning Earps did to get her shirt sold resulted in a limited quantity silently going on sale — and now they’re gone, with no indication of when the next release might take place. It was difficult to see what long-lasting and genuine change had been made.\nWhen The Athletic asked Nike to confirm if they are committed to selling Lionesses goalkeeper shirts going forward, a spokesperson said: “The England goalkeeper jersey will be available in limited quantities on the FA’s website in the coming weeks, and we are currently working to make youth goalkeeper jerseys available by the holiday season. We are committed to retailing women’s goalkeeping jerseys for major tournaments in the future.”\nEarps said: “More are coming before the end of the year and in more sizes (adults and children).”\nGO DEEPER\nFull Time with Jessy Parker-Humphreys: Mead lifts Arsenal and City in Roord health\nBut as a global powerhouse in sportswear, Nike — who have still not put the U.S., France or Netherlands women’s goalkeeper shirts on sale — can move mountains if they really want to.\nThis weekend, AC Milan striker Olivier Giroud played in goal after Mike Maignan was shown a red card. Giroud made a save to deny Genoa’s George Puscas in the final minutes. Within 24 hours, Milan had added Giroud to the list of first-team goalkeepers on their website and released a statement announcing that “fans can now purchase the goalkeeper jersey and customise it with ‘Giroud 9’”. The shirt, sponsored by Puma, was sold out by Monday. Nike should take note.\nThe entire goalkeeper shirt saga is entirely at odds with the perception of Nike as being a pioneering brand — a brand at the forefront of female empowerment. In February 2019, Nike launched the ‘Dream Crazier’ campaign aimed at shining a spotlight on female athletes who have “broken barriers, brought people together through their performance and inspired generations of athletes to chase after their dreams”. The headline advert was narrated by one of the most decorated female tennis players of all time — Serena Williams.\nSo when the world’s best female goalkeeper asks for her shirt to be sold and for it to be done properly, meaning in sufficient numbers with a known release schedule and with the fanfare it deserves, Just Do It.\nGO DEEPER\nMary Earps interview: From crying on kitchen floor to 'fantasy' of being Euros winner\n(Top photo: Robert Cianflone via Getty Images)",
  "word_count": 1248,
  "scraped_at": "2026-02-14T02:10:28.710993",
  "_text_extracted": true
}