{
  "article_id": "4797af77d577",
  "url": "https://www.caughtoffside.com/2025/04/03/liverpool-news-arne-slot-everton/",
  "title": "Liverpool news : Arne Slot on Everton red card decision",
  "date": "20250403T114500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool manager Arne Slot has admitted that we’ll never have a perfect system where no one in football ever makes any mistakes.\nThe Dutch tactician, speaking at his press conference today, was inevitably asked about the controversial incident in last night’s game between Liverpool and Everton at Anfield.\nThe Reds won 1-0 thanks to a second-half strike from Diogo Jota, but it seems very clear that the Toffees should have been down to ten men.\nJames Tarkowski got very lucky with a nasty challenge, which Howard Webb has since admitted was wrong not to be punished with a red card, according to the Times.\nSlot, however, did not want to dwell on it too much, insisting that mistakes happen at every level, with managers, players and match officials.\nArne Slot asked about refereeing in the Premier League\nWhen asked about the standard of refereeing in the Premier League, Slot responded, as quoted by BBC Sport: “I think everywhere around the world mistakes are being made. This is something in the league where I came from.\n“We are all aiming for a league without mistakes. I am aiming for a season without me making one mistake in the line-ups I make, but unfortunately this will probably never happen – not with me and not with referee decisions.”\nMost importantly for Liverpool, they picked up an important three points last night to take them closer to winning the Premier League title.\nThe Reds were recently knocked out of the Champions League and then lost the Carabao Cup final, so it was crucial for them to get back to winning ways last night.\nStill, Everton were pretty lucky with the Tarkowski decision, and LFC will just be glad it didn’t end up coming back to haunt them by drastically changing the final result on the night.",
  "word_count": 303,
  "scraped_at": "2026-02-14T02:26:33.624433",
  "_text_extracted": true
}