{
  "article_id": "47a107e69b07",
  "url": "https://www.france24.com/en/live-news/20231003-psg-boss-luis-enrique-says-no-one-wanted-to-face-newcastle",
  "title": "PSG boss Luis Enrique says no one wanted to face Newcastle",
  "date": "20231003T201500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSG boss Luis Enrique says no one wanted to face Newcastle\nNewcastle (United Kingdom) (AFP) – Paris Saint-Germain boss Luis Enrique says Newcastle are the team nobody wanted to face in the Champions League group stage.\nIssued on:\nNewcastle were arguably the strongest team in pot four when the groups were drawn and it was Luis Enrique's side, along with AC Milan and Borussia Dortmund, who were pitted against the Magpies.\nEddie Howe's men are back in the Champions League after a 20-year absence following last season's fourth place Premier League finish.\nPSG will be the first visitors to St James' Park in this season's tournament on Wednesday and Luis Enrique knows they face a \"spectacular\" atmosphere from the vociferous Toon Army.\nLuis Enrique, part of the Barcelona side which lost 3-2 at St James' Park in Newcastle's very first fixture in the competition in 1997, believes Newcastle could be a major threat on their return to the European stage.\n\"They are the team from the fourth pot in the draw that no one really wanted, of course. We know that they play at a high level,\" Luis Enrique told reporters on Tuesday.\n\"They're very good in possession, they're very good off the ball as well. They play with a very high press - they're almost a compete football team.\n\"Tomorrow, they're going to be playing in front of their extremely passionate supporters as well and that's going to help them.\n\"All teams can go far in the Champions League. There's no reason why Newcastle can't go far either. No one wanted to play them, I guess, also because we saw how good they were last season.\n\"It's a spectacular place to go and play and it will also be good for us to see what our team is made of playing at St James' Park.\n\"I'm envious of my players because they're going to get to experience that first-hand out on the pitch tomorrow and I just hope that it's a great game.\"\nNewcastle kicked off their group fixtures with a goalless draw at AC Milan, while PSG beat Dortmund 2-0.\nLuis Enrique remembers his visit to Tyneside with Barca well, although not fondly despite scoring on a night when Tino Asprilla's brilliant hat-trick saw Kenny Dalglish's men secure one of the club's most famous victories.\n\"Obviously it was a tough game, a really tough game. Twenty-six years ago seems a lifetime ago, I guess - I was certainly a lot younger than I am now,\" Luis Enrique said.\n\"It is true that I scored. I think it finished 3-2? They had great players, a great atmosphere generated by the crowd. It wasn't easy then and I don't suppose it will be easy tomorrow either.\"\n© 2023 AFP",
  "word_count": 459,
  "scraped_at": "2026-02-14T02:10:28.717886",
  "_text_extracted": true
}