{
  "article_id": "47bd5e1aa890",
  "url": "https://www.caughtoffside.com/2025/02/15/arsenal-compete-tottenham-igor-paixao/",
  "title": "Arsenal to compete with Tottenham for Brazilian attacker with 22 - G / A this season",
  "date": "20250215T190000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal and Tottenham are keen on signing the Brazilian attacker Igor Paixao from Feyenoord.\nThe 24-year-old has done quite well for the Dutch outfit this season, and he has impressed with his performance in the Champions League as well. He has been linked with Liverpool recently.\nAccording to a report from Calciomercato, he is likely to cost around €30 million and the two English clubs are keen on securing his signature. Arsenal need more depth in the wide areas so that they can rotate players like Bukayo Saka and Gabriel Martinelli more often. The Brazilian would be the ideal acquisition for them.\nHe will add pace, flair and unpredictability to the Arsenal attack. The Brazilian has eight goals and 14 assists in all competitions this season and his end product could improve when he is playing in a better team alongside better players. He could develop into a top-class player for Arsenal with the right guidance. Arsenal are one of the biggest clubs in the world and the opportunity to play for them can be hard to turn down for most players.\nArsenal have the financial resources to pay the asking price as well. It will be interesting to see if they can convince the player to join.\nSpurs keen on Paixao\nMeanwhile, Tottenham need more depth in the attacking unit. Paixao would be an upgrade on players like Timo Werner and Richarlison if he joined the club. It remains to be seen whether Tottenham can convince him to join the club in the summer. Arsenal could offer Champions League football and that could give them an extra edge in the transfer race.\nThe 24-year-old needs to join a club where he will get ample time. He will not want to sit on the bench at this stage of his career.",
  "word_count": 301,
  "scraped_at": "2026-02-14T01:58:05.349209",
  "_text_extracted": true
}