{
  "article_id": "47c4843d4db8",
  "url": "https://www.bbc.co.uk/sport/football/65912821",
  "title": "Jude Bellingham says his  heart was close to stopping  when he found out about Real Madrid interest",
  "date": "20230615T170000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jude Bellingham says his 'heart was close to stopping' when he found out about Real Madrid interest\n- Published\n- comments\nEngland midfielder Jude Bellingham said he had \"goosebumps\" and his \"heart was close to stopping\" when he was told Real Madrid wanted to sign him.\nBellingham, 19, has joined the Spanish club from Borussia Dortmund for an initial 103m euros (£88.5m).\nThe fee could reach 133.9m euros (£115m) with add-ons.\n\"I'd always been aware of the interest from England so that was pretty normal,\" said Bellingham at his presentation as a Real Madrid player.\n\"It was a bit of a surprise when my dad sat me down and said: 'You've had a bit of interest from Real Madrid.'\n\"I think that was maybe about 12-15 months ago. When he said that I had goosebumps, my heart was close to stopping. It's something you don't expect growing up - being able to play for a team like this.\"\nDortmund made Bellingham the most expensive 17-year-old in football when they signed him from Birmingham City for £25m in 2020 and he enhanced his reputation with his performances for the German club.\nHe became Dortmund's youngest captain at 19 and was named the Bundesliga's player of the season for the last campaign.\nBellingham had been linked with Liverpool, Manchester City and Manchester United before choosing to move to Real Madrid.\nAt his presentation, he called it the \"proudest day of my life\" in joining \"the greatest football club in the history of the game\".\nHe added: \"Money is not a thing for me. I don't think about money at all when I make these kind of decisions. I never have and will - I play the game purely out of love.\n\"I spoke to the people when I was given permission by Borussia Dortmund. I loved the feeling I got from the club. I couldn't hide it.\n\"I told them more or less straight away what I felt about the club and, after I made my decision, I wanted it to happen very quickly.\n\"It wasn't a case of other teams are bad or they weren't good but, for me, Madrid is the greatest.\"\nLast season, Real Madrid failed to win the Champions League - going out in the semi-finals - or La Liga, with rivals Barcelona taking the Spanish title.\nBellingham said: \"A club like Madrid and its fans and the people who work for the club deserve to have trophies every year. This year they didn't manage to get La Liga and the Champions League.\n\"That is the standard I want to help the club reach, where they can compete for these honours very closely every year.\n\"Manchester City had a great season, but it just gives us more fire to go for it next year.\"\n'It's just so exciting and an opportunity I couldn't turn down'\nBellingham is the sixth English men's player to sign for Real Madrid after Laurie Cunningham, Steve McManaman, David Beckham, Jonathan Woodgate and Michael Owen.\nHis presentation began with a showreel of some of his best moments at Birmingham and Borussia Dortmund as well as with the England national team.\nBellingham watched on with his parents and brother before a speech by Real president Florentino Perez, who called it an \"exciting\" day for the La Liga club as \"one of the best players in the world\" had joined them.\n\"I've not just come here because of the size of the club. Obviously, it is huge but when the guys pitched the vision of the team, I was completely involved and all in,\" said Bellingham.\n\"It's not just 'we're Real Madrid, we want you to come and join for us'. That is enough for me, to be honest, but then the ideas they had were so good, it's just so exciting and an opportunity I couldn't turn down.\"\nAsked about when he had decided to choose Real, he added: \"I had the meeting where they came to my house and I was sold.\n\"I was at the [Champions League] final in 2022 when they beat Liverpool. That was another huge factor. There were a load of things that go into making a decision to join this club.\"\nWhat about the pressure of the fee?\nBellingham could become the most expensive English player if his fee surpasses the £100m Manchester City paid Aston Villa for attacking midfielder Jack Grealish in 2021.\nReal Madrid have also made him their second-most expensive signing, after Eden Hazard's 115m euro move from Chelsea in 2019, and he is the third-most expensive teenager in history.\n\"It's not something I'm concerned about. I'm never really interested in knowing what it [the fee] is exactly,\" said Bellingham.\n\"For me, it doesn't matter how much I have come here for - the objective is the same, to win trophies and help Real Madrid continue to be the biggest team in the world.\n\"I'm a footballer and not a lawyer or an accountant and my job is to take care of business out on the pitch.\"\nWhat about Kane or Mbappe joining him at Real?\nReal Madrid are believed to want Tottenham striker Harry Kane, Bellingham's England colleague, as they look to replace Karim Benzema, who has agreed to join Saudi Arabian champions Al-Ittihad.\n\"As far as the Harry Kane rumours, I can't comment on that,\" said Bellingham.\n\"He's a world-class player, he's my captain for the national team. I love him as a player and as a person. Whatever happens there happens but it is not really for me to comment about.\"\nFrance striker Kylian Mbappe has also been linked with Real after he said he would not extend his deal with Paris St-Germain beyond the summer of 2024.\n\"They are both unbelievable players and the best in the world at their positions,\" Bellingham added.\n\"But I can't really comment. I don't know his situation.\n\"I have seen some of the coverage on the internet and on Twitter. If there's anything that my whole saga has taught me it is not everything that you see is true. Don't take things word for word.\n\"Would I like to play with a player like Kylian Mbappe? Who wouldn't?\"\nIs he the next Zidane?\nBellingham will wear the number five at his new club, with the shirt number having previously been adorned by France and Real Madrid legend Zinedine Zidane.\nZidane, who won the World Cup with his country in 1998, played for Real from 2001 to 2006 and scored a stunning goal when he helped them win the Champions League in 2002., external\n\"I have said in many interviews how much I admire Zinedene Zidane,\" said Bellingham.\n\"The legacy within the club and this number. I am not trying to be the same as him, I am just trying to be Jude, but it is definitely a bit of a homage to how great he was.\n\"As far as [my previous number] 22 is concerned, it is a number I have worn and is a number that has a lot of meaning to me. In my heart, I am still a 22 but just wearing five on the back.\n\"We will see what happens in the future, but, right now, I am just happy to have been given the honour of wearing that number.\"",
  "word_count": 1218,
  "scraped_at": "2026-02-14T01:50:37.808210",
  "_text_extracted": true
}