{
  "article_id": "47c62f4300f7",
  "url": "https://www.bbc.co.uk/sport/football/67232561",
  "title": "Men Ballon dOr : Lionel Messi wins eighth award , beating Erling Haaland to trophy",
  "date": "20231031T030000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Men's Ballon d'Or: Lionel Messi wins eighth award, beating Erling Haaland to trophy\n- Published\n- comments\nArgentina and Inter Miami forward Lionel Messi has won the Men's Ballon d'Or for an eighth time.\nThe 36-year-old was recognised at the ceremony in Paris after helping his country win the World Cup in Qatar last year.\nEngland and Real Madrid midfielder Jude Bellingham won the Kopa Trophy for the world's best player aged under 21.\nMessi won his record-extending Ballon d'Or award ahead of Manchester City forward Erling Haaland.\nFrance forward Kylian Mbappe - who became just the second man to score a World Cup final hat-trick in the 4-2 penalty shootout loss to Argentina - finished third.\n\"It's nice to be here once more to enjoy this moment,\" Messi said. \"To be able to win the World Cup and achieve my dream.\"\nThe former Barcelona and Paris St-Germain star added: \"I couldn't imagine having the career I've had and everything I've achieved, the fortune I've had to be part of the best team in history.\n\"All of them [Ballon d'Or awards] are special for different reasons.\"\nNorway international Haaland scored a record-breaking 36 goals in 35 league games and hit 52 in all competitions as City won the Treble of Premier League, Champions League and FA Cup.\nHe was recognised for his achievements with the Gerd Muller Trophy for best goalscorer.\n\"I want to thank Manchester City, the whole club,\" said Haaland.\n\"I also want to thank my family and all the people around me for making me who I am today.\"\nMessi moves further out in front of the rest\nThe Ballon d'Or recognises the best footballer of the year and is voted for by 100 journalists from around the world.\nAs well as helping Argentina to World Cup glory, Messi also played a key role as Inter Miami won their first trophy - the Leagues Cup - and has scored 11 goals in 14 appearances for the Major League Soccer side.\nHe has now won three more Ballon d'Or awards than anyone else, with Cristiano Ronaldo having won it five times, most recently in 2017.\nThe Portugal international, who plays for Al Nassr in Saudi Arabia, was not named on the shortlist for the first time since 2003.\nMartinez recognised as world's best goalkeeper\nArgentina World Cup winner and Aston Villa goalkeeper Emiliano Martinez won the Yashin Trophy for the best goalkeeper in the world.\nMartinez won the Golden Glove in Qatar, saving a spot-kick from Kingsley Coman in the penalty shootout win against France in the final.\nHe also helped Aston Villa finish seventh in the Premier League and secure a place in the Europa Conference League.\nHowever, Martinez was jeered by some of the crowd at the Paris ceremony. The goalkeeper was criticised for this celebration after winning the World Cup against France last year.\nManchester City win club of year award\nManchester City were named the club of the year at the awards for the second year running.\nPep Guardiola's side became only the second English team to win the Treble of Champions League, Premier League and FA Cup last season.\nThey had seven players shortlisted for the men's Ballon d'Or award.\nVinicius Jr recognised as he vows to fight against racism\nReal Madrid winger Vinicius Jr received the Socrates Award for his contribution off the field and vowed to keep speaking out against racism in world football.\nVinicius has been the target of racist abuse regularly in La Liga games for the past two seasons.\nHe was recognised for starting a foundation that is building schools in impoverished areas and investing in education in Brazil.\n\"I will remain strong in the fight against racism,\" said the Brazilian. \"It is a very sad thing to talk about racism nowadays, but we have to continue in the fight so that people suffer less.\"\nBeckham pays tribute to Sir Bobby Charlton\nFormer England and Manchester United midfielder David Beckham presented the men's Ballon d'Or to Messi, but before announcing the winner he paid tribute to Sir Bobby Charlton.\nThe England World Cup winner died at the age of 86 earlier this month.\n\"I probably don't have to tell this room how special Sir Bobby was to the world of football,\" Beckham said.\n\"He was respected on the field for what he won but was respected even more off the field for what he stood for.\n\"He will be missed. When we looked up into the stands he would always be there cheering us on.\n\"He started it off for me. If it was not for Sir Bobby turning around to Manchester United and saying 'watch this young man' I probably would not have played for Manchester United.\n\"I owe him everything.\"\nBallon d'Or top 10\n1. Lionel Messi (Argentina and PSG/Inter Miami)\n2. Erling Haaland (Norway and Manchester City)\n3. Kylian Mbappe (France and PSG)\n4. Kevin De Bruyne (Belgium and Manchester City)\n5. Rodri (Spain and Manchester City)\n6. Vinicius Jr (Brazil and Real Madrid)\n7. Julian Alvarez (Argentina and Manchester City)\n8. Victor Osimhen (Nigeria and Napoli)\n9. Bernardo Silva (Portugal and Manchester City)\n10. Luka Modric (Croatia and Real Madrid)",
  "word_count": 866,
  "scraped_at": "2026-02-14T02:13:18.797150",
  "_text_extracted": true
}