{
  "article_id": "47d9dd31f7d3",
  "url": "https://metro.co.uk/2025/02/25/andres-iniesta-names-arsenal-hero-top-five-players-time-22620817/",
  "title": "Andres Iniesta names Arsenal hero in his top five players of all time",
  "date": "20250225T111500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Andres Iniesta has named Arsenal hero Santi Cazorla in his top five favourite players of all time in a list that doesn’t include his old Barcelona teammate Lionel Messi.\nThe Spain and Barcelona legend retired at the age of 40 last October, having seen out his career in Japan and the United Arab Emirates.\nDuring an extraordinary 22 years at Barcelona, the midfielder won 29 major honours including nine La Liga titles and four Champions League crowns.\nIniesta and Xavi were at the heart of many of those triumphs, also helping Spain win the 2010 Cup and European Championships in 2008 and 2012.\nAsked to name his five favourite players of all-time on TikTok at his recent appearance at the Match for Hope charity game, Iniesta named his old partner in crime alongside two other Barcelona legends in Michael Laudrup and Pep Guardiola.\nThere is also room for former Manchester City star David Silva, with another former La Roja teammate in Cazorla taking the last spot.\nCazorla shone in La Liga for Villarreal and Malaga before Arsene Wenger brought him to north London in 2012.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHis final years at the club were ravaged by injury however, undergoing eight operations on what was initially an Achilles problem that at one stage left the midfielder fearing he would lose a leg.\nCazorla remained a firm fan favourite during his six years in north London, winning Player of the Season in his first campaign and helping the club end their nine-year trophy drought in 2014.\nIn 2018, he returned to Villarreal where he was able to resume his career. In 2023, he returned to his first club Real Oviedo.\nThe Spain international suggested at the end of last year he would like to return to Arsenal when he hangs up his boots to work alongside his former midfield partner Mikel Arteta in the dugout.\n‘He’s [Arteta] doing an amazing job,’ Cazorla said in December.\nMore Trending\n‘I think it’s difficult to fight last year with Man City and this year with Liverpool but they have to keep on going. I believe in them.\n“I hope Liverpool loses a few games. I hope Arsenal can win this league.\nWhen asked if he would consider a return to the Emirates, he replied: ‘Yes, why not? Arsenal is my home. I love the club and the people, so we will see in the future.\n‘I don’t know [what role I would have]. I would have to think about that but something in football for sure, because that is what I love.’\nMORE: Jamie Carragher names Liverpool’s biggest rival for the Premier League title next season\nMORE: Sven Botman, Joelinton and Sandro Tonali injury latest from Newcastle boss Eddie Howe\nMORE: Ethan Nwaneri injury update provided by Arsenal boss Mikel Arteta",
  "word_count": 518,
  "scraped_at": "2026-02-14T02:14:59.447944",
  "_text_extracted": true
}