{
  "article_id": "47ef8d23d890",
  "url": "https://www.caughtoffside.com/2024/06/23/arsenal-preparing-formal-offer-lutsharel-geertruida-liverpool-target/",
  "title": "Arsenal to step up efforts to sign Liverpool target Lutsharel Geertruida",
  "date": "20240623T074500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal and Liverpool are looking to improve their defensive options this summer and they have identified Lutsharel Geertruida as a potential target, as per Fichajes.\nThe 23-year-old final defender has impressed in the Eredivisie this season and he could prove to be a useful acquisition for the two English clubs. He is capable of slotting into multiple defensive roles and his versatility will add some much-needed depth and tactical flexibility to the side. Liverpool could certainly use some like him next season.\nGeertruida could be attracted to the idea of reuniting with Arne Slot at Anfield, and it remains to be seen whether Liverpool can get the deal done. The defender can operate as a full-back, a central defender as well as a defensive midfielder. He will be able to cover multiple roles at Liverpool and his arrival would allow them to rotate their squad better.\nLiverpool will be competing in the UEFA Champions League next season and they need a deeper squad to do well across multiple competitions.\nArsenal keen on Geertruida\nMeanwhile, Arsenal need more quality in the squad as well. They lost out to Manchester City in the title race for two consecutive seasons and they will be hoping to go all the way this time around. Signing a versatile defender could prove to be a wise decision, and it will be interesting to see if they can beat Liverpool to his signature.\nThe report states that Arsenal are now preparing a formal bid for the defender and Liverpool will probably need to act quickly if they want to get the deal done.\nBoth clubs have the financial muscle to sign Geertruida, and it remains to be seen where he ends up. A move to the Premier League will be an exciting opportunity for the player and he will be tempted to join both clubs.",
  "word_count": 308,
  "scraped_at": "2026-02-14T01:48:52.510253",
  "_text_extracted": true
}