{
  "article_id": "47f7aeed1d9a",
  "url": "https://www.fourfourtwo.com/features/mary-earps-everything-you-need-to-know",
  "title": "Mary Earps : Everything you need to know",
  "date": "20241018T053000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Who is Mary Earps? Everything you need to know about the England goalkeeper\nMary Earps is one of the best goalkeepers in the world but who has she played for? And what is her England journey?\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nMary Earps is one of the best goalkeepers in the world and is currently plying her trade at Paris Saint-Germain.\nShe became a household name after she helped the Lionesses win the European Championships in 2022 and had a viral moment in the 2023 World Cup final after saving Jenni Hermoso's penalty.\nBut who else has she played for and when did she receive her first England cap? Here's all you need to know.\nMary Earps: Which clubs has she played for?\nDuring Earps' youth career she played for West Bridgford Colts, Tottenham and Leicester City. She started playing regular first team football in the 2009/10 season with Leicester and she signed for Nottingham Forest the following season.\nSpells at Doncaster Rover Belles, Birmingham City and Bristol Academy followed. The goalkeeper signed for Reading in 2016 and impressed at the club, who played in the English top-flight at the time. In her first season at Reading she made the PFA Team of the Year.\nHer good performances caught the eye of Frauen Bundesliga team Wolfsburg who she joined in 2018. She spent a season at the German club where she won her first pieces of silverware. Earps helped the team to the Frauen Bundesliga title and and the DFB-Porkal.\nEarps steady career progression meant Manchester United wanted to sign her and she joined just before their first season in the Women's Super League in 2019. During her time at United she became one of the world's best keepers and she cemented herself as England's number one.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nVIDEO Why Lauren James Will Change Women's Football Forever\nUnited struggled to win silverware in their first few seasons in the top-flight but finally claimed a trophy in the 2023/24 season with the FA Cup. During that season there were transfer rumours surrounding Earps, mainly linking her to Arsenal. That deal did not come to fruition but Earps did leave at the end of her United contract to join Paris Saint-Germain on a free transfer, in FourFourTwo's view United should have sold her in the winter window in order to make profit for the club.\nThe deal also reportedly made her the highest-paid goalkeeper in the world. Earps said upon leaving United: “Dear the United family. After five years of service to your great club, I have decided that it’s time for a new challenge. It’s a decision I’ve gone backwards and forwards on for some time, and is not one I’ve made lightly.\n“The club is about to undergo a period of transition, and unfortunately I don’t feel it aligns with the timing of where I’m at in my career, therefore I think now is the right time to make a change and embark on a new challenge. There aren’t the right words, or enough words, to express my heartfelt gratitude to you all.”\nMary Earps' England career\nEarps won her first cap for England in 2017 against Switzerland but struggled to break into the starting team. When Sarina Wiegman was appointed as England manager in 2021, the boss made Earps the number one - a title that has been Earps' ever since.\nThe goalkeeper has had viral moments in an England shirt. Her first came with her celebration after the Euros in 2022. The England team interrupted Wiegman's press conference and Earps climbed on top of a table and danced. Her second social media moment came when she said f**k off after saving Hermoso's penalty in the World Cup final.\nHer heroics for England saw her win BBC Sports Personality of the Year in 2023.\nEarps is getting more competition with the likes of Hannah Hampton performing well at Chelsea. But Wiegman still values Earps and recently said: \"She's the number one goalkeeper [for PSG]. There's competition there, too. That's obvious. She started this weekend. I think moving to France, of course, she's adapting, a new situation.\n\"Unfortunately, they didn't qualify for the group stage in the Champions League which is a disappointment for them, for Mary and for us too, because we want to see her in the Champions League.\n\"So that's not the start I think she had hoped for but still, we know what she brings for us and we also know there's a huge competition going on between her and Hannah, and Anna [Moorhouse] also coming in.\"\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 922,
  "scraped_at": "2026-02-14T01:57:46.245093",
  "_text_extracted": true
}