{
  "article_id": "480bbb2330a3",
  "url": "https://www.thedailystar.net/news/rosenior-not-scared-challenge-world-class-chelsea-4077081",
  "title": "Rosenior not scared of challenge at  world - clas Chelsea",
  "date": "20260109T174500Z",
  "domain": "thedailystar.net",
  "source_country": "Bangladesh",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rosenior not scared of challenge at 'world-class' Chelsea\nLiam Rosenior said that his challenge is to carry Chelsea to the \"next level\" as he prepares to take charge of the Blues for the first time on Saturday.\nThe 41-year-old has been parachuted into one of the most high-pressure jobs in English football after a successful spell at Strasbourg, who are also run by Chelsea's owners BlueCo.\nEnzo Maresca left Stamford Bridge on January 1 despite winning two trophies -- the Club World Cup and Europa Conference League -- during his first season in charge.\nBut Chelsea have won just one of their past nine Premier League games to slip to eighth in the table and the pressure is on Rosenior to secure Champions League qualification next season via a top-four finish.\n\"The talent levels I have seen over the last few days -- the ability levels are world class,\" Rosenior said on the eve of Chelsea's FA Cup trip to second-tier Charlton.\n\"The previous coach Enzo has done a good job tactically and it is my job to take it to the next level, and me and my staff are going to work very hard to do that.\n\"If you are scared or fearful, there is no point being a coach. I am going to work 24 hours a day. I am going to push them to try and be successful.\"\nRosenior watched from the stands as Chelsea lost 2-1 at west London neighbours Fulham on Wednesday.\nThere were banners and chants amongst the visiting fans at Craven Cottage lashing out at BlueCo's running of the club.\nMaresca became the fourth permanent manager to depart the club in three and a half years since the American-backed consortium took control of Chelsea.\nRosenior rejected suggestions, though, that he has been hired to toe the line of his superiors.\n\"I don't think it is possible to be in this job and not be your own man,\" he said.\n\"I understand, I am not an alien and I know what is being said in the press, but there is no way you can be a manager if you don't make the decisions for yourself.\n\"We have had huge success at Strasbourg and I intend to work the same way here.\"\nUnder BlueCo, Chelsea's model has focused on hoovering up young talent from around the globe.\nBut amongst Maresca's complaints was a lack of experience that resulted in inconsistent performances.\nRosenior said that he is confident that the approach can succeed from his time at Strasbourg.\n\"A club of this stature, the fans want success and they have every right to want success now. My job, to win over the fans, I have to win football games,\" he said.\n\"We're trying to build things here in a different way. I'm very confident that in time we will show everyone why we have done it in this way.\"",
  "word_count": 483,
  "scraped_at": "2026-02-14T02:27:10.764819",
  "_text_extracted": true
}