{
  "article_id": "4828f9ae42ca",
  "url": "https://metro.co.uk/2025/11/01/arsenal-burnley-live-premier-league-latest-score-result-24587682/",
  "title": "Burnley vs Arsenal LIVE : Premier League latest score and goal updates | Football",
  "date": "20251101T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal cemented their place at the top of the Premier League with a 2-0 win over Burnley.\nThe Gunners arrived at Turf Moor in confident mood after a near flawless October and started the new month in similar style.\nAfter bossing the early stages of the game, Mikel Arteta’s side took the lead in familiar fashion in the 14th minute.\nDeclan Rice’s deep corner was prodded back across goal by Gabriel Magalhaes and Viktor Gyokere headed home from virtually on the line.\nBukayo Saka missed two opportunities to extend the lead but a second goal duly arrived 10 minutes before the interval when Rice timed his run into the box to perfection and headed home Leandro Trossard’s pinpoint cross.\nMore Trending\nArsenal retreated into their shells in the second period with their attack lacking fluency in the absence of Gyokeres who was taken off at the interval.\nBurnley huffed and puffed but lacked the quality desired to really test a defence that recorded an astonishing seventh straight clean sheet.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSubstitutes Ethan Nwaneri and Christian Norgaard did threaten late on but the damage, ultimately, was done in the first half.\nMarcus Edwards did come close to finally beating Raya with the last kick of the game but his free kick cannoned off the post.\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nFull Time: Burnley 0-2\n90 mins: Arsenal cement their place at the top of the table with what ultimately proved to be a routine win thanks to first half goals from Viktor Gyokeres and Declan Rice. Follow Metro.co.uk for our post match coverage.\nBurnley 0-2 Arsenal\n90 mins: The board has just gone up and we’ll have four minutes of added time.\nBurnley 0-2 Arsenal\n86 mins: You have to praise Burnley for giving this a go. Arsenal are dropping deep and defending in numbers now and are coming under increasing pressure as they look to see this one out and secure another clean sheet.\nBurnley 0-2 Arsenal\n82 mins: Arsenal have rarely threatened as an attacking force in the second half but Nwaneri nearly put the game to bed but his low shot drifted just wide following a superb driving run.\nBurnley 0-2 Arsenal\n77 mins: A last roll of the dice for Scott Parker who makes two more changes with Armando Broja and Hannibal entering the fray. Arsenal are also freshening things up with Christian Norgaard on for Martin Zubimendi.\nBurnley 0-2 Arsenal\n75 mins: Burnley are definitely enjoying their best spell of the game and threatened a goal from a set piece but Florentino Luis can’t steer hisheader on target with David Raya stranded.\nBurnley 0-2 Arsenal\n71 mins: Changes now for the Gunners with Piero Hincapie and Ethan Nwaneri replacing Ricardo Calafiori and Eberechi Eze\nBurnley 0-2 Arsenal\n65 mins: An early impact from Brunn Larsen who at last registers and attempt on goal for Burnley but it never threatened David Raya. At the other end Bukayo Saka manufactures an opportunity for Jurrien Timber but he fires well wide.\nBurnley 0-2 Arsenal\n62 mins: A double change for the hosts. Lesley Ugochukwu and Jaidon Anthony are replaced by Loum Tchaouna and Jacob Brunn Larsen.\nBurnley 0-2 Arsenal\n57 mins: Leandro Trossard fires in a low effort, Arsenal’s first on target of the second period, but Martin Dubravka is equal to it. Zian Flemming, meanwhile, has gone into the book following a late challenge on Gabriel.\nBurnley 0-2 Arsenal\n53 mins: A slight tactical tweak from Burnley who are trying to press a little higher up the pitch but Gabriel and William Saliba aren’t unduly worried on the early evidence.\nBurnley 0-2 Arsenal\n49 mins: An inauspicious start for Merino who treads on the ball, falls awkwardly and a promising attack comes to nothing.\nBurnley 0-2 Arsenal\n46 mins: A change at the break for the Gunners with Mikel Merino replacing Viktor Gyokeres. The Spain international looks like he’ll fill in up front.\nHALF-TIME: Burnley 0-2 Arsenal\nJust to underline Arsenal’s dominance in that opening period, the xG stats really do tell the story\nHALF-TIME: Burnley 0-2 Arsenal\nGoals from Gyokeres and Rice give Arsenal a comfortable buffer at the half-time.\nMikel Arteta’s side had all the running in that first half, and now look en course for yet another win to extend their lead at the top of the table.\nBurnley 0-2 Arsenal\n45 mins: A slight lull in proceedings as we approach the half-time interval. Trossard makes a burst into the area to try and collect Rice’s searching pass, but Walker does well to bully the Belgian off the ball.\nTwo minutes of added time.\nBurnley 0-2 Arsenal\n39 mins: Arsenal get creative from their latest set-piece and it almost works out, but Trossard can’t apply the finishing touch to the move.\nBurnley 0-2 Arsenal (Rice, 35 mins)\nAnd Arsenal do get their deserved second!\nThe Gunners have created a boatload of chances, but it’s Rice who has the goal after heading home Trossard’s cross from the left.\nA clinical counterattack, which was kick-started by a superb Gyokeres crossfield pass.\nBurnley 0-1 Arsenal\n32 mins: Burnley hanging on by a thread. Gyokeres feeds through Saka, but his effort is saved by Dubravka. The loose ball finds it way to Trossard but his strike is cleared off the line by Tuanzebe.\nDogged defending from the hosts, but Arsenal are peppering the goalmouth.\nBurnley 0-1 Arsenal\n27 mins: The first yellow card of the day goes the way of Burnley captain Cullen after a foul on Eze.\nMORE: Man Utd fan ‘heartbroken’ as haircut hopes fade following Nottingham Forest draw\nMORE: Jamie Carragher hails ‘absolutely fantastic’ Chelsea star after Tottenham win\nMORE: Ruben Amorim demands ‘much more’ from Manchester United star after Nottingham Forest draw",
  "word_count": 1026,
  "scraped_at": "2026-02-14T01:59:14.376796",
  "_text_extracted": true
}