{
  "article_id": "48292ac2511d",
  "url": "https://ghanaiantimes.com.gh/cwc-gives-liverpool-arsenal-premier-league/",
  "title": "CWC gives Liverpool , Arsenal Premier League",
  "date": "20250611T091500Z",
  "domain": "ghanaiantimes.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CWC gives Liverpool, Arsenal Premier League\nEngland boss, Thomas Tuchel, has said Liverpool and Arsenal will have a “huge advantage” in next season’s Premier League title race due to them not being involved in the Club World Cup.\nChelsea and Manchester City will represent the Premier League in the expanded 32-team tournament which starts on June 14 and both teams will play a minimum three games. If either side reaches the final, they could play seven matches in a month.\nMeanwhile, Liverpool and Arsenal, the top two from the 2024-25 league campaign, can rest before their first preseason friendlies in July.\nTuchel believes that could make a marked difference.\n“I think it the Club World Cup will have a huge impact and it will give Liverpool and Arsenal a huge advantage in the next season to not be there,” the former Chelsea manager said.\n“After a long season, they feel the tiredness. Harry [Kane] said he felt like coming [to England’s training camp] after one week would have been much harder.\n“It was easier to come after two weeks. It gave him a kind of refreshment, and there were many players who came back after one week, and they said ‘Ah, we were just getting into holiday mode, and now we put the boots back on.’\nTuchel also believes the fatigue from the Club World Cup along with gruelling schedules next year could have consequences for him on the international stage.\n“I think it will be a very nice experience for the players who are there to play this tournament for the first time so it is mixed feelings about it,” he added.\n“I decided not to worry too much because why should I? It is a given and no one knows what will be the outcome of it or the effect. We will deal with the effect when the effect comes.\n“We have a lot of teams in Champions League next season and European football and let’s see.”-ESPN",
  "word_count": 329,
  "scraped_at": "2026-02-14T02:15:31.425395",
  "_text_extracted": true
}