{
  "article_id": "483f36fc9d2b",
  "url": "https://www.marketscreener.com/quote/stock/PUMA-SE-436505/news/PUMA-SE-PUMA-well-on-track-to-achieve-full-year-outlook-after-Q2-44418594/",
  "title": "PUMA SE : PUMA well on track to achieve full - year outlook after Q2",
  "date": "20230726T084500Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EQS-News: PUMA SE\n/ Key word(s): Half Year Results/Quarterly / Interim Statement\nPUMA SE: PUMA well on track to achieve full-year outlook after Q2\n26.07.2023 / 08:00 CET/CEST\nThe issuer is solely responsible for the content of this announcement.\nPRESS RELEASE\nPUMA well on track to achieve full-year outlook after Q2\nHerzogenaurach, July 26, 2023\n2023 Second Quarter Facts\n- Sales increase to € 2,121 million (+11.1% currency-adjusted (ca) / +5.9% reported /\nQ2 2022: € 2,002 million), driven by strong growth in EMEA and APAC, including Greater China -\nGross profit margin declines to 44.8% (Q2 2022: 46.5%), mainly due to currencies, sourcing costs and promotions\n-\nOperating expenses (OPEX) increase by 6.6% to € 843 million (Q2 2022: € 791 million), mainly due to DTC growth and higher marketing expenses\n-\nOperating result (EBIT) declines by 21.2% to € 115 million (Q2 2022: € 146 million), resulting in an EBIT margin of 5.4% (Q2 2022: 7.3%), mainly due to lower gross profit margin\n-\nNet income down by 34.7% to € 55 million (Q2 2022: € 84 million)\n-\nInventory up 8.1% to € 2,146 million (June 30, 2022: € 1,984 million); back to normalized levels\nProduct, Marketing & Other Highlights\n- PUMA team Manchester City wins the Champions League and completes the treble\n-\nPUMA signs Xavi Simons, one of Europe’s most exciting footballers\n-\nPUMA signs Julien Alfred, one of the greatest up-and-coming 100 m runners\n-\nPUMA golfer Rickie Fowler wins his sixth PGA Tour title\n-\nPUMA signs landmark deal with Formula 1\n-\nPUMA and NBA star LaMelo Ball launch their first European tour as part of the MELO FASTER TOUR\n-\nPUMA and New York streetwear brand Noah unveil the first collection of their multi-seasonal collaboration\n-\nPUMA sees strong demand for its first drops of the terrace sneakers Palermo and Super Team\n-\n7 out of 10 PUMA products were made from better materials in 2022\n-\nIn line with its strategic priorities, PUMA nominates Richard Teyssier as Global Brand & Marketing Director and Shirley Li as General Manager China\n-\nPUMA extends contract of CFO Hubert Hinterseher until end of 2027\nArne Freundt, Chief Executive Officer of PUMA SE:\n“On the back of our Q2 results, we are perfectly on track to achieve our full-year outlook in the transition year 2023. PUMA continued to grow by double-digits, demonstrating continued strong brand momentum, despite the volatile environment. As the best partner for Wholesale, we worked together with our retailers through elevated inventory levels in the market and successfully normalized our own inventory levels as planned.\nOur strategic priorities Brand Elevation, winning in the U.S. and China are key for PUMA’s future growth trajectory. We are making good progress on all levels and with the announcement of new leaderships for Global Marketing and Mainland China, we have put the required organizational foundation in place.\nMoreover, I’m especially proud to welcome Xavi Simons, who is one of Europe’s most exciting footballers, and Julien Alfred, one of the greatest up-and-coming 100 m runners with chances for World Championship gold medal, to our PUMA Family.”\nSales Development:\nSecond Quarter 2023\nSales increased by 11.1% (ca) to € 2,120.7 million (+5.9% reported). The EMEA region recorded strong sales growth of 25.0% (ca) to € 846.0 million, which was driven by strong performance in EEMEA. The Asia/Pacific region grew by 24.4% (ca) to € 413.3 million, supported by a continued trend of recovery in Greater China after the market reopened. Sales in the Americas region were at € 861.5 million (-4.4% ca) due to ongoing softness in North America, while Latin America continued to show strong growth. The decline in North America was related to macroeconomic headwinds and PUMA’s relative dependency on the off-price Wholesale business which will be strategically contained going forward. In an overall soft North American market, PUMA continued to grow its Performance categories and DTC business. The PUMA Group benefited from the geographic diversification of its business as strong growth in other regions more than offset the decline in North America.\nPUMA’s Wholesale business increased by 6.9% (ca) to € 1,605.3 million. This is fully in line with the objective of being the best partner for retailers while working with them to manage elevated inventory levels. Direct-to-Consumer (DTC) business was up by 26.5% (ca) to € 515.4 million. Sales in owned & operated retail stores increased 30.4% (ca) and e-commerce was up 19.1% (ca). The strong growth in DTC was primarily driven by continued brand momentum and improved product availability. This resulted in an increased DTC share of 24.3% (Q2 2022: 21.9%).\nSales in Footwear were up 18.2% (ca), driven by continued strong demand for our Football, Basketball and Performance Running categories as well as for Sportstyle. Sales in Apparel grew by 4.2% (ca) and Accessories were up by 3.3% (ca).\nThe gross profit margin decreased by 170 basis points to 44.8% (Q2 2022: 46.5%). Currency effects were a stronger headwind in the second quarter. Other factors such as sourcing and freight costs as well as promotional activity continued to weigh, while price adjustments and a positive impact from geographical and distribution channel mix were beneficial.\nOperating expenses (OPEX) increased by 6.6% to € 843.4 million (Q2 2022: € 791.2 million). The moderate increase in operating expenses was driven by the growth of our DTC channel, higher marketing expenses and sales-related costs, while other cost areas provided operating leverage. As a result, the OPEX ratio increased by 20 basis points to 39.8% (Q2 2022: 39.5%).\nThe operating result (EBIT) decreased by 21.2% to € 115.3 million (Q2 2022: € 146.3 million), mainly due to an unfavorable gross profit margin. This resulted in an EBIT margin of 5.4%\n(Q2 2022: 7.3%).\nConsequently, net income decreased by 34.7% to € 55.0 million (Q2 2022: € 84.3 million) and earnings per share amounted to € 0.37 (Q2 2022: € 0.56).\nFirst Half Year 2023\nSales increased by 12.7% (ca) to € 4,308.3 million (+10.1% reported).\nThe Asia/Pacific region led the growth with a sales increase of 26.0% (ca), followed by the EMEA region with a sales increase of 25.2% (ca). Sales in the Americas region declined 2.7% (ca) due to macroeconomic headwinds, high inventory levels in the trade and PUMA’s relative dependency on the off-price Wholesale business in the U.S..\nThe Wholesale business was up 9.6% (ca) to € 3,327.4 million and the Direct-to-Consumer (DTC) business increased by 24.6% (ca) to € 980.9 million. Sales in owned & operated retail stores increased 24.0% (ca) and e-commerce increased 25.6% (ca). This resulted in an increased DTC share of 22.8% (H1 2022: 21.0%).\nFootwear continued to lead the growth with 23.5% (ca), while Apparel and Accessories grew modestly and were up 2.9% (ca) and 0.8% (ca) respectively.\nThe gross profit margin decreased by 120 basis points to 45.7% (H1 2022: 46.8%). Unfavorable currency effects, higher sourcing and freight costs as well as industry-wide promotional activity had a negative impact on the gross profit margin. However, the negative effects were partially offset by price adjustments, a favorable geographical and distribution channel mix.\nOperating expenses (OPEX) increased by 12.5% to € 1,691.7 million (H1 2022: € 1,504.1 million). The increase was driven by sales-related distribution and other variable costs, the growth of our DTC channel and higher marketing expenses, while other cost areas provided operating leverage. As a consequence, the OPEX ratio increased by 80 basis points to 39.3% (H1 2022: 38.4%).\nThe operating result (EBIT) decreased by 15.0% to € 290.9 million (H1 2022: € 342.4 million) due to an unfavorable gross profit margin and higher operating expenses, which resulted in an EBIT margin of 6.8% (H1 2022: 8.7%). This is line with expectations that our gross profit margin and profitability will be under more pressure in the first half of the year than in the second half.\nConsequently, net income decreased by 16.2% to € 172.3 million (H1 2022: € 205.6 million) and the earnings per share amounted to € 1.15 (H1 2022: € 1.37).\nWorking Capital\nThe working capital increased by 58.6% to € 1,693.0 million (June 30, 2022: € 1,067.4 million). Inventories were up by 8.1% to € 2,145.9 million (June 30, 2022: € 1,984.4 million). PUMA achieved its objective to normalize its inventory levels by mid-year. Trade receivables increased by 13.3% to € 1,348.4 million (June 30, 2022: € 1,189.8 million). On the liabilities side, trade payables decreased by 12.1% to € 1,457.3 million (June 30, 2022: € 1,657.1 million).\nCash Flow and Liquidity Situation\nThe free cash flow was at € -341.4 million in the first half of 2023 (H1 2022: € 38.6 million). As of June 30, 2023, PUMA had cash and cash equivalents of\n€ 307.9 million (June 30, 2022: € 498.4 million). The decrease of 38.2% compared to last year is mainly related to cash outflows for working capital. In addition, the PUMA Group had available credit lines totalling € 1,592.5 million as of June 30, 2023\n(June 30, 2022: € 1,276.9 million). The increase of credit lines is due to the issuance of promissory note loans totalling € 300.0 million in the second quarter of 2023. Unutilized credit lines amounted to € 846.0 million as of June 30, 2023 (June 30, 2022: € 923.6 million).\nBrand & Strategy Update\nIn 2023, PUMA celebrates its 75th anniversary as a company and its proud history alongside the world’s fastest athletes, pushing sports and culture forward.\nPUMA started the year by further refining its strategic priorities, which will guide the business going forward. The core of the strategy remains unchanged: to elevate the PUMA brand, enhance our product excellence and improve the quality of our distribution. This is based on three foundational pillars of focussing on people first, evolving sustainability and digitalizing our infrastructure. Within that strategic framework, we defined three top strategic priorities for PUMA’s future growth trajectory: brand elevation, winning in the U.S. and rebounding strongly in China\nNew versions of ULTRA, FUTURE and KING football boots\nIn the first half of 2023, we launched new versions of our successful football boots ULTRA and FUTURE and re-launched our legendary boot KING as a third silo to broaden our offering in the light of our strong market share gains. Each football boot has a very clear proposition to our consumers and is endorsed by best-in-class players to underline its credibility. With the signings of Jack Grealish and Xavi Simons, we have further strengthened our ambassador rosters for our FUTURE and KING boot.\nPUMA teams among the best in football around the world\nWith Jack Grealish in the starting lineup, PUMA team Manchester City won the treble for the first time in its history: the UEFA Champions League, the Premier League and the FA CUP, showcasing that it’s currently the best football team.\nAlso our other PUMA teams were among the best in their countries: In Germany, Borussia Dortmund was a close runner up in the Bundesliga, in France, RC Lens and Olympique de Marseille finished second and third in Ligue 1, and in the Netherlands, PSV Eindhoven once again won the KNVB Cup. At the FIFA U-20 World Cup in Argentina, the young talents of PUMA team Uruguay became world champions.\nAt the FIFA Women’s World Cup in Australia and New Zealand, which started this month, around 90 players are wearing our football boots. After two years of research, we are proud to offer all our boots in women’s specific fits with a lower volume in the midfoot and a smaller instep compared to our unisex sizes. The fact that more than 90% of our professional female players choose our boots in women’s specific fits shows us that there is a real demand for these products.\nPUMA further establishes NITRO™ technology for excellence in Running\nIn our Running category, we continued to focus on establishing our NITRO™ foam technology in the market. Our NITRO™ foam is one of the best foams in the industry and maximizes responsiveness and cushioning while being extremely lightweight. Our NITRO™ foam technology is at the core of our award-winning Running styles DEVIATE, VELOCITY and the latest addition FOREVERRUN. We continue to see strong market share gains in this category and further underlined our credibility in this field with signings of new ambassdors: European 5,000 m Champion Konstanze Klosterhalfen, marathon legend Edna Kiplagat and European marathon Champion Aleksandra Lisowska.\nPUMA athletes dominate in track and field\nIn Track & Field, PUMA demonstrated its dominant position by celebrating 17 medals at European Indoor Championship in Istanbul and great performances throughout the year, including a pole vault world record by Armand “Mondo” Duplantis at the indoor event in Clermont-Ferrand. With Marcell Jacobs, current Olympic 100 m Champion, and Julien Alfred, current NCAA 100m Champion, PUMA further reinforced its strong ambassador roster ahead of the World Athletics Championships in Budapest.\nAt the World Para Athletics Championships in Paris, PUMA athletes took 13 medals, with Cuban sprinter Omara Durand adding to her status as one of the most successful para athletes of her generation with 3 gold medals.\nPUMA Golf athletes win big\nIn Golf, PUMA ambassador Rickie Fowler captured his sixth PGA Tour victory at the Rocket Mortgage Classic in Detroit, while Patricia Isabel Schmidt secured her maiden European Tour win at the Belgian Ladies Open.\nPUMA signs landmark deal with Formula 1\nIn Motorsport, we added to our exceptional line up of partnerships by signing a landmark deal with Formula 1 to become the official supplier at F1 races and securing the rights to produce F1 branded apparel, footwear and accessories. As part of this agreement, our subsidiary stichd will exclusively sell F1 fanwear and products of all ten teams around the race circuit. Through our partnerships in F1, PUMA strongly benefits from the surging popularity of the sport, especially in the United States, which hosts two of the hottest races of the F1 season in Miami and Las Vegas.\nPUMA further builds on success with LaMelo Ball\nTo win in the important US market, our Basketball business plays a crucial role in our strategy. Together with PUMA ambassador LaMelo Ball, we launched his successful signature shoe MB.02 in a version inspired by the popular cartoon Rick and Morty. We teamed up with NBA rookie and the 3rd NBA Draft Pick Scoot Henderson to present the new All-Pro NITRO™, PUMA’s newest Basketball silhouette which features our NITRO™ foam technology. And for Breanna Stewart, our WNBA ambassador, we introduced the Stewie 2 Earth, the latest edition of her signature Basketball shoe.\nTo capture the popularity of Basketball outside of North America, we organized the “Melo Faster Tour” around Europe, connecting LaMelo Ball with his European fans at events in Berlin, London, Milan and Paris.\nRihanna is back!\nAway from the pitches, courts and tracks, we announced the return of global superstar Rihanna, one of our most successful partners ever, as a brand ambassador. Over the course of three years starting in 2015, we launched several best-selling products with her, including the Footwear News Shoe of the Year 2016, the PUMA Creeper. PUMA’s new agreement with Rihanna is a multi-year partnership, in which she will co-create new collections with us, with a special focus on unisex and kids ranges. The first Fenty x PUMA product will drop in the market in September this year and showcase Rihanna’s point of view on the terrace trend.\nPUMA captures the terrace trend with successful new models\nSpeaking to the emerging terrace trend, we reintroduced our classics Palermo OG and Super Team OG to the market and saw a strong demand for the first drops. These low-top styles were a popular fashion item on the terraces of football stadiums of the 1980s and are part of PUMA’s line-up this year to capture the increasing popularity of this trend. With our CA Pro and Slipstream, we continued to have strong propositions for the ongoing demand for white court shoes, with our RS-X we further built on our strong Progressive Running offer and with Mayze we continued to excite our female consumers.\nThroughout the year, we worked together with inspirational brands such as Noah, Koché, Juun.J, Liberty, Rhuigi, PLEASURES and JJJJound to create sought-after Sportstyle collections which created great hype moments in the market.\nPUMA named global Top Employer in 2023\nPutting our people first is an important part of our corporate strategy and we were thrilled to be named a global Top Employer in 2023. We received this award, which follows a comprehensive survey by the Top Employers Institute, for the first time in North America and Latin America and once more in Europe and Asia Pacific.\nThis was closely followed by our announcement that PUMA closed the adjusted pay gap between women and men among its employees in Germany. FPI Fair Pay Innovation Lab, which independently certified the results, made PUMA only the second company in Germany to receive the title “Universal Fair Pay Developer”, which is given to companies that can show an adjusted gender pay gap of between +1 and -1%.\nBuilding on our People First strategy, we were able to fill key positions with strong internal talents. In line with our strategic priorities to further elevate the brand and rebound strongly in China, we nominated Richard Teyssier as Global Brand & Marketing Director and Shirley Li as General Manager China.\nContract of PUMA CFO Hubert Hinterseher extended\nThe Supervisory Board of PUMA SE has extended the contract of Hubert Hinterseher as Chief Financial Officer until end of 2027. Hubert Hinterseher has been member of the Management Board and CFO of PUMA SE since June 2021.\nPUMA improves global distribution quality\nTo constantly improve our global distribution quality, we worked closely with our Wholesale partners to give them the best possible service and make our products stand out in a multi-brand environment. While we continue to prioritize our wholesalers, our Direct-to-Consumer offering complements our distribution strategy. We opened new PUMA stores in Bangkok, Beijing and Mexico City, while rolling out our PUMA App in Oceania. In China, we introduced a new store format, which was developed by a local agency to fit the needs of Chinese consumers.\nPUMA makes 7 out of 10 products with better materials\nIn Sustainability, we announced the achievement of another milestone in April 2023: 7 out of 10 products were produced from better materials in 2022, such as cotton and viscose from certified sources or recycled polyester. Our legendary football boot PUMA KING is now produced without using animal leather, making PUMA the first major sports company to no longer source kangaroo leather for its products. Our better materials have a smaller environmental footprint in terms of CO2 emissions and allow us to improve our environmental impact across our product range. We expect to make 9 out of 10 products from better materials by 2025.\nPUMA puts future generations at the centre of its sustainability strategy\nAs the sustainable choices we make today will impact future generations, we started our “Voices of a RE:GENERATION” initiative. The Voices, who are GEN-Z activists and environmentalists, will join us for a year to regularly give our senior management feedback on how PUMA can further strengthen its sustainability initiatives. They will also help us communicate our sustainability efforts to young audiences. As part of this effort to be more transparent and to make the information more accessible, we launched the sustainability section of our annual report as a podcast series.\nOutlook 2023\nIn the first half of the year, PUMA continued to build its brand momentum, launching exciting products and strengthening its partnerships along the value chain with athletes, retailers and suppliers. PUMA continued to benefit from the strong geographical diversification of its business as strong growth in key markets such as Greater China offset a decline in North America. The sustained demand for PUMA products, supported by operational agility, resulted in a normalization of PUMA’s inventory levels, as expected.\nAt the same time, the macroeconomic environment and volatile retail demand remain challenging, particularly in North America and Europe, as recession risks weigh on consumer sentiment. In addition, the pattern of China’s economic recovery after COVID-19 remains uncertain.\nIn the context of above mentioned conditions and taking into consideration PUMA's strong sales growth in the first half of the year as well as the continued brand momentum, we confirm currency-adjusted sales growth in the high single-digit percentage range for the financial year 2023. In line with the previous outlook for 2023, PUMA expects an operating result (EBIT) in the range of € 590 million to € 670 million (2022: € 641 million) and a respective change in net income. PUMA continues to expect an improved profitability towards the end of the year, mainly driven by a sequential improvement in the gross profit margin due to lower sourcing and freight costs.\nIf our business continues to develop favorably in the third quarter of 2023, PUMA will be able to adjust its outlook for 2023. As in previous years, PUMA will continue to focus on overcoming short-term challenges without compromising the brand’s mid- and long-term momentum, prioritizing sales growth and market share gains over short-term profitability.\nFinancial Calendar:\nOctober 24, 2023 Quarterly Statement Q3 2023\nThe financial releases and other financial information are available on the Internet at “about.puma.com“.\nMedia Relations:\nRobert-Jan Bartunek - Teamhead Corporate Communications – PUMA SE - +49 9132 813134 -\nrobert.bartunek@puma.com\nInvestor Relations:\nGottfried Hoppe – Head of Investor Relations & Finance Strategy - PUMA SE - +49 9132 81 3157 -\ngottfried.hoppe@puma.com\nNotes to the editors:\n- The financial reports are posted on about.puma.com\n-\nPUMA SE stock symbol:\nReuters: PUMG.DE, Bloomberg: PUM GY,\nBörse Frankfurt: ISIN: DE0006969603– WKN: 696960\nNotes relating to forward-looking statements:\nThis document contains statements about the future business development and strategic direction of the Company. The forward-looking statements are based on management's current expectations and assumptions. They are subject to certain risks and fluctuations as described in other publications, in particular in the risk and opportunities management section of the combined management report. If these expectations and assumptions do not apply or if unforeseen risks arise, the actual course of business may differ significantly from the expected developments. We therefore assume no liability for the accuracy of these forecasts.\nPUMA is one of the world’s leading sports brands, designing, developing, selling and marketing footwear, apparel and accessories. For 75 years, PUMA has relentlessly pushed sport and culture forward by creating fast products for the world’s fastest athletes. PUMA offers performance and sport-inspired lifestyle products in categories such as Football, Running and Training, Basketball, Golf and Motorsports. It collaborates with renowned designers and brands to bring sport influences into street culture and fashion. The PUMA Group owns the brands PUMA, Cobra Golf and stichd. The company distributes its products in more than 120 countries, employs about 20,000 people worldwide and is headquartered in Herzogenaurach/Germany.\nFor more information, please visit https://about.puma.com.\n26.07.2023 CET/CEST Dissemination of a Corporate News, transmitted by EQS News - a service of EQS Group AG.\nThe issuer is solely responsible for the content of this announcement.\nThe EQS Distribution Services include Regulatory Announcements, Financial/Corporate News and Press Releases.\nArchive at www.eqs-news.com",
  "word_count": 3859,
  "scraped_at": "2026-02-14T02:29:25.744497",
  "_text_extracted": true
}