{
  "article_id": "484abfd48196",
  "url": "https://punchng.com/edo-queens-aduku-targets-champions-league-trophy/",
  "title": "Edo Queen Aduku targets Champions League trophy",
  "date": "20241008T021500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Edo Queens head coach, Moses Aduku, says the Nigerian champions are aiming for nothing less than lifting the CAF Women’s Champions League trophy.\nThe gaffer made the assertion while sharing his thoughts on the team’s journey, aspirations, and the growing standard of women’s football in Africa during an interview with cafonline.com.\n“We aim for nothing less than lifting the trophy. That is our desire. We know it won’t be easy, but we are focused on taking it one game at a time,” said Aduku, who guided the team to impressive victory in the WAFU B competition, which secured their qualification for the prestigious tournament.\nReflecting on their WAFU B triumph, the gaffer said the road was not easy but described the competition as wonderful , “It was a wonderful competition. It was our first time participating, and we approached it believing that we were not just there to compete but also to see if we could win the competition. Every game felt like a cup final.\n“My players were on top of their game. We treated every match as crucial. We started with a victory against the Niger team, winning 1-0, followed by a 3-0 win against the team from Ghana. Then we faced Burkina Faso’s team, which ended in a 1-0 victory for us. This success came not just from winning but from understanding the importance of why we were in Côte d’Ivoire. We seized our opportunities and managed to defeat the host team in the semi-finals, winning 2-1, and then secured a 3-0 victory in the final against the team from the Republic of Benin.\n“The road was not easy, but hard work pays off. My players were ready to put in the effort. We had intensive training sessions and played friendly matches to shape the team. So, it was challenging, but we are grateful to be representing West Africa,” he said.\nHowever, Aduku remains optimistic that the team will aim not only to compete but to make their mark in this prestigious tournament with a fierce determination to lift the trophy, hinging his confidence in team play.\n“Having reached this stage, we certainly don’t want to come back empty-handed. Our preparations have already started since the day we qualified. We are thankful to the Edo State government for providing us with the resources to move from our regular camp into a more focused training environment for the Champions League. It’s going to be tough, but just as we succeeded in WAFU B, we plan to take it one game at a time and push hard to bring home the trophy. For me, I believe our strength lies in the team as a whole rather than focussing on individual players. Fans should watch out for our entire squad.”\nHe expressed gratitude to the Edo State government, highlighting the competitiveness of the Champions League and the inherent pressure his team will strive to overcome.\n“Definitely, everyone competing in the Champions League will feel the pressure, not just our team. Yes, we are giants of African football, but the reality is that matches are played over 90 minutes, and preparation is key. I am grateful to the Edo State government for facilitating our thorough preparation. The expectation is high since we have never won this title before, but we are committed to overcoming any pressure by focusing on our game plan and executing it well.”\nBayelsa Queens previously reached the semi-finals of the competition, and Aduku believes they were undone by mistakes his team has learnt from, saying, “Lessons can be learnt from those who have represented us in the past. For instance, Bayelsa Queens, who reached the semifinals, played well but missed key opportunities. We aim to capitalise on those lessons and take our chances.”",
  "word_count": 626,
  "scraped_at": "2026-02-14T02:08:12.417195",
  "_text_extracted": true
}