{
  "article_id": "487ceb7215a5",
  "url": "https://economictimes.indiatimes.com/news/international/us/psg-vs-real-madrid-fifa-club-world-cup-semifinal-ticket-details-schedule-and-what-fans-should-know/articleshow/122284254.cms",
  "title": "psg vs . real madrid tickets : PSG vs . Real Madrid FIFA Club World Cup Semifinal : Ticket details , schedule and what fans should know",
  "date": "20250706T200000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The road to the semifinals has seen some intense action. PSG triumphed over Bayern Munich 2-0, while Real Madrid dispatched Borussia Dortmund to seal their berth. With these victories, the stage is set for what could become a classic Club World Cup showdown.\nWhere and When: PSG vs. Real Madrid Semifinal Details\nThe semifinal between Paris Saint-Germain and Real Madrid will take place on:- Date: Wednesday, July 9\n- Time: 3:00 PM Eastern Time\n- Venue: MetLife Stadium, New Jersey\n- Tickets: Starting from $271\n- Broadcast: Live streaming on DAZN\nHow to Purchase PSG vs. Real Madrid Tickets\nFans interested in attending the match can purchase PSG vs. Real Madrid tickets through popular online platforms such as StubHub. As of now, entry prices begin at $271, with premium seating commanding higher prices.Ticket categories include general admission, lower bowl, club-level seating, and VIP packages. Due to high demand, especially with two of Europe’s biggest clubs in contention, early purchase is strongly advised.\nThe official resale platform is StubHub, which has been authorized for this tournament by the organisers. Ticket buyers are also advised to confirm authenticity and not fall prey to fraudulent resellers.\nA Showcase of Continental Excellence\nThe 2025 edition of the FIFA Club World Cup is historic for many reasons. Not only is it being held entirely at a single venue in the United States, but this year’s semifinal lineup includes a diverse representation of Europe’s footballing might.Alongside PSG and Real Madrid, Chelsea and Brazilian club Fluminense round out the final four. While PSG represents France and Real Madrid brings Spain’s legacy, Chelsea stands for the United Kingdom and Fluminense carries the flag for South American excellence.\nThe other semifinal, Chelsea vs. Fluminense, is scheduled for Tuesday, July 8 at 3:00 PM ET at the same venue.\nComplete Semifinal Fixture Schedule\nHere’s a look at the semifinal fixtures of the FIFA Club World Cup 2025, as mentioned in a report by USA Today:Semifinal 1\n- Match: Chelsea vs. Fluminense\n- Date: Tuesday, July 8\n- Time: 3:00 PM ET\n- Venue: MetLife Stadium\n- Tickets: From $27\n- Streaming: DAZN\nSemifinal 2\n- Match: PSG vs. Real Madrid\n- Date: Wednesday, July 9\n- Time: 3:00 PM ET\n- Venue: MetLife Stadium\n- Tickets: From $271\n- Streaming: DAZN\nRoad to the Final: When and Where\nThe final match of the 2025 Club World Cup will be held on Sunday, July 13, again at MetLife Stadium, marking the culmination of the global football tournament.- Club World Cup Final\n- Date: Sunday, July 13\n- Venue: MetLife Stadium\n- Tickets: Available on StubHub\nThe Global Appeal of PSG vs. Real Madrid\nThis semifinal is not just another football match — it is a meeting of two global brands, with PSG's rising star power and Real Madrid’s storied legacy making this clash a must-watch.Fans can expect to see superstars like Kylian Mbappé, Jude Bellingham, Vinicius Jr., Eduardo Camavinga, and Achraf Hakimi battling it out in what may be one of the most-watched Club World Cup matches in history.\nGiven the caliber of players and the stakes involved, this encounter is being likened to a UEFA Champions League final and is a true showcase of the best in club football.\nTravel Tips for Attendees\nFor those planning to attend the game in person, MetLife Stadium is accessible from both New York City and Newark International Airport, with ample public transport and ride-share options available.Fans are encouraged to arrive early due to enhanced security protocols and heavy traffic on match days. Stadium gates will open approximately two hours before kickoff.\nWhat Makes This Edition Special\nThe 2025 Club World Cup is being viewed as a dress rehearsal for the 2026 FIFA World Cup, co-hosted by the United States. Organisers are using this tournament to test logistics, security, and fan management systems.With international fans pouring in, this tournament is a litmus test of the U.S.'s capability to handle mega sporting events at a single venue over multiple days.\nFAQs\nWho will PSG or Real Madrid face in the final?\nThe winner will face either Chelsea or Fluminense, who play their semifinal on Tuesday, July 8 at the same stadium and time.Where can I watch the FIFA World Cup Semifinal live?\nYou can stream the match live on DAZN. Check your local region for subscription access or free trial options.(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 791,
  "scraped_at": "2026-02-14T01:49:44.684658",
  "_text_extracted": true
}