{
  "article_id": "48aa2300b5ca",
  "url": "https://www.fourfourtwo.com/features/reviewing-every-manchester-united-manager-since-sir-alex-ferguson",
  "title": "Reviewing every Manchester United manager since Fergie",
  "date": "20241019T100000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every Manchester United manager since Sir Alex Ferguson: How they performed and who was the best\nManchester United have struggled to replace the iconic manager since his 2013 retirement\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester United's success rate on managers over the past decade has been bordering catastrophic as a combination of big names and exciting newcomers have tried, and failed, to restore the club to its former glory.\nThe Red Devils have spent more time outside the top four than in it since Sir Alex Ferguson's retirement, with this season looking increasingly unlikely to break the mould.\nWe've taken a look at each hopeful manager to have taken on the enormous task of replacing the club legend to see exactly how they got on in charge at Old Trafford.\nRating Manchester United's manager\nVIDEO: Why Thomas Tuchel Is PERFECT For England\n1. David Moyes (2013-2014)\nFerguson's hand-picked successor, Moyes arrived at Old Trafford after a fantastic spell at Everton, establishing them as consistently the fifth-best team in England.\nHowever poor transfer planning, an ageing squad and a complete upheaval of backroom staff left Moyes stranded from minute one, frequently teetering around midtable before his sacking less than a year into his tenure.\nMoyes foreshadowed the brutal reality of life post-Fergie which many fans simply didn't know how to process: little did they know what the next decade had in store for them.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n- 51 games\n- 27 wins\n- 9 draws\n- 15 losses\n2. Louis Van Gaal (2014-2016)\nThe first genuine superstar manager to try and tame the bucking bronco that Manchester United had turned into, was legendary Dutchman and former Champions League-winning manager Louis Van Gaal.\nFormerly of Ajax, Barcelona and Bayern Munich, Van Gaal was seen as possessing the pedigree required to replace a man like Ferguson. While undoubtedly steadying the ship in his first season, Van Gaal quickly came under fire for the absolute snooze=fests his side would produce on a weekly basis, eventually getting the sack two years after arriving having just won the FA Cup.\nOn a positive note, he was responsible for introducing Marcus Rashford to senior football...\n- 103 games\n- 54 wins\n- 25 draws\n- 24 losses\n3. Jose Mourinho (2016-2018)\nHaving been heavily touted as Ferguson's initial replacement, Jose Mourinho finally arrived at Old Trafford equipped with a summer spending spree including Zlatan Ibrahimovic, Paul Pogba and Henrikh Mkhitaryan.\nA serial winner equipped with one of the most talented squads in Europe, Manchester United were back! Until they weren't...\nA sixth-placed debut campaign followed up by a runners-up spot the season after showed promise, but multiple fallings out caused things to spiral in 2018, with Mourinho sacked a week before Christmas in his third campaign at the club.\n- 144 games\n- 84 wins\n- 32 draws\n- 28 losses\n4. Ole Gunnar Solskjaer (2018-2021)\nArriving initially on a temporary basis, Ole Gunnar Solskjaer was tasked with bringing the feel-good factor back to Old Trafford with the board slowly accepting that the side was no longer capable of really challenging at the top any more.\nSolskjaer succeeded in stopping the rot in spectacular fashion with exciting attacking football landing him a permanent job. A few seasons of steady progression culminated in a summer transfer window of Cristiano Ronaldo, Jadon Sancho and Raphael Varane raising the mood around the ground to the highest levels since 2013.\nIt eventually, however, became apparent that feel-good factor alone would never actually land you a title, as the performances quickly declined and a club legend left in almost as much chaos as he found the club in three years prior.\n- 161 games\n- 98 wins\n- 37 draws\n- 40 defeats\n5. Ralf Rangnick (2021-2022)\nDespite only acting as a caretaker manager, Ralf Rangnick's reign deserves mention for all the wrong reasons. United appointed the German on the assumption he would join the sporting department behind the scenes come the end of the season.\nThis did not come to fruition.\nRangnick not only failed to steady the ship but proceeded to brutally and publicly point out the glaring issues with United as a club, leading to the owners deciding to part ways with arguably the most famous sporting director in the world before even giving him a chance to do what he was signed to do.\n- 29 games\n- 11 wins\n- 10 draws\n- 8 losses\n6. Erik ten Hag (2022—)\nErik ten Hag's arrival at Old Trafford was a breath of fresh air - a young manager capable of playing exciting football with pedigree on the continental stage. After a tough start, ten Hag managed to wrestle his side into a title race around the midpoint of the season, even lifting the club's first trophy since 2017 before eventually finishing third in the league.\nHis second season, however, failed to meet the same standards. An unprecedented injury crisis only worsened what appeared to be a misguided side devoid of ideas as the Red Devils slumped to their worst league finish in the Premier League era, with FA Cup success acting as a mere consolation such was the mood around the club.\nThe Dutchman remains in charge of United despite wave after wave of calls for his dismissal, although another poor start to the current season would suggest he is set to become the latest victim of the ongoing search for the next Sir Alex Ferguson.\n- 125 games\n- 69 wins\n- 22 draws\n- 34 losses\nJames Ridge is a freelance journalist based in the UK. He recently spent time with The United Stand as an online news editor and has covered the beautiful game from England’s eighth tier all the way to the Premier League.",
  "word_count": 1077,
  "scraped_at": "2026-02-14T01:57:46.244766",
  "_text_extracted": true
}