{
  "article_id": "48bf1c9b3935",
  "url": "https://www.the42.ie/pep-guardiola-manchester-city-10-6044792-Apr2023/",
  "title": "  If we lose the game , we will not be champion - Guardiola on edge for Leicester test",
  "date": "20230414T230000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PEP GUARDIOLA BELIEVES defeat against Leicester this weekend would cost Manchester City the title.\nThe champions host the struggling Foxes on Saturday and can move within three points of leaders Arsenal with victory.\nYet with the Gunners – who City face in a crunch clash later this month – tackling another troubled team in West Ham on Sunday, Guardiola feels any slip-up could be ruinous for their chances.\nThe City manager said: “Everybody knows that if we lose games we lose competitions. That’s why our attention to details is higher.\n“It’s the same tomorrow – if we lose the game, we will not be champions. If we win we could still be there.\n“But we cannot forget, we are six points behind Arsenal, a team who have dropped few points during the season and have one game a week, with a lot of time for recovery, to analyse and prepare for games.\n“It’s so difficult if you drop points. That’s why you have to be there as much as possible.”\nWhile Arsenal have just their eight remaining Premier League games to play this season, City are still involved in the Champions League and FA Cup.\nGuardiola’s side have coped well with heavy schedules in the past and he hopes they can use it to their advantage again.\nHe said: “Sometimes our experience, when we are (playing) games every three days, every four days, we are in rhythm and focus and that helps us. In the past it was like that, playing competitions until the end.\n“Sometimes when you have a week (between games) you lose this type of feeling.”\nGuardiola expects a reaction from Leicester following the appointment of Dean Smith as interim manager earlier this week.\nThe Foxes, who are 19th in the table, turned to the former Aston Villa and Norwich boss after sacking Brendan Rodgers.\nGuardiola said: “They are in a difficult situation but he’s going to help Leicester a lot.\n“When you have a new manager in this situation, I am pretty sure it will have a massive impact on the players.”\nGuardiola, speaking at his pre-match press conference, denied he had an issue with Kevin De Bruyne after the Belgium playmaker looked frustrated at being substituted against Bayern Munich on Tuesday.\nHe said: “It’s normal. It’s not the first time it has happened in modern football, it has happened in all other clubs. It will happen in the future.\n“I understand completely. Everyone wants to play but in the right moments I try to do the best to win the game.”\nCity are still without midfielder Phil Foden, who is not yet back in training after appendix surgery last month.\nGuardiola refused to discuss the possibility of City signing England midfielder Jude Bellingham from Borussia Dortmund this summer.\nIt was widely reported this week that Liverpool had pulled out of the race to sign the 19-year-old, increasing speculation linking him with other clubs, including City.\nBut Guardiola said: “How many press conferences have you come here? You know the answer.”",
  "word_count": 505,
  "scraped_at": "2026-02-14T02:24:37.522481",
  "_text_extracted": true
}