{
  "article_id": "48dbeae86911",
  "url": "https://www.teamtalk.com/news/man-utd-legend-shut-down-liverpool-tipped-beat-ten-hag-real-madrid-huge-deal",
  "title": "Man Utd legend shut down as Liverpool tipped to beat Ten Hag , Real Madrid to game - changing £100m deal",
  "date": "20230320T124500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd legend shut down as Liverpool tipped to beat Ten Hag, Real Madrid to game-changing £100m deal\nFormer Manchester United defender Rio Ferdinand has been shut down by one of his fellow pundits after he made a huge prediction about where Jude Bellingham would end up.\nBellingham is facing a big decision ahead of the summer transfer window. Transfer insider Graeme Bailey has told TEAMtalk that the central midfielder has several options on the table.\nHe could choose to remain at Borussia Dortmund by agreeing a new deal with them. Dortmund are preparing a massive contract offer which would make Bellingham the best-paid player in their history.\nAlternatively, Bellingham has the offer of leaving Dortmund for one of Europe’s biggest teams in an expensive deal. Liverpool, Manchester City, Manchester United and Real Madrid are all interested in landing him. As per a recent report from The Telegraph, Man Utd are ready to break the British transfer record when signing Bellingham.\nFor Bellingham to move on this summer, one of those clubs will have to spend an eye-watering £130million.\nIf the Englishman ends up extending his Dortmund contract, it will not be the end of the world. That deal should include a release clause which will be far less than £130m.\nREAD MORE: Liverpool move under serious threat as Arsenal swoop in for midfielder Mikel Arteta ‘appreciates’\nFollowing Liverpool’s Champions League round of 16 exit at the hands of Real, Man Utd legend Ferdinand predicted Bellingham to reject Jurgen Klopp’s side in favour of a move to La Liga.\n“If Real Madrid are in for me and Liverpool, there’s only one place I can go – and they [Liverpool] don’t finish in the Champions League as well maybe,” Ferdinand said.\n“As a player – nothing to do with my allegiances to United or Liverpool – you look at it cold and you go: ‘I see more trophies here [at Madrid]’.”\nRio Ferdinand transfer claim dismissed\nHowever, former Arsenal star Paul Merson does not agree. He thinks Bellingham will still end up at Anfield as Liverpool potentially not qualifying for next season’s Champions League is not the end of the world.\n“I get where Rio Ferdinand is coming from when he says Jude Bellingham will be picking Real Madrid over Liverpool on the basis of their Champions League knockout clash,” Merson said during an interview with the Daily Star.\n“But I’ve read stories about Bellingham and his family and all they were ever interested in was ensuring he plays football when they picked Borussia Dortmund over Man United.\n“One year out of the Champions League at 19 isn’t going to define his career if Liverpool miss out on fourth. He’s not an egotistical player and my feeling is he likes the challenge.\n“It’s alright playing in the Champions League but what’s the point if you don’t win it anyway? He’s an example for every kid out there, it’s not about money, it’s about performing.\n“I still think he might swallow a year out of the Champions League if Liverpool don’t qualify. He has a very long career ahead of him.”\nMerson raises some very good points. Bellingham’s family want him to play week in, week out when he leaves Dortmund. And this is guaranteed to happen at Liverpool, as he will walk straight into their midfield trio.\nBellingham could become the face of Liverpool’s revamp as they aim to win Premier League and Champions League trophies once again.\nIn contrast, he might find it harder to become Real’s most important midfielder given the fact they already have Eduardo Camavinga, Federico Valverde and Aurelien Tchouameni waiting to take over from Luka Modric and Toni Kroos.",
  "word_count": 613,
  "scraped_at": "2026-02-14T02:16:40.061697",
  "_text_extracted": true
}