{
  "article_id": "48f50c31b585",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-sack-liverpool-legend-taunts-man-utd-boss-gareth-southgate-talk-gain-more-momentum",
  "title": "Ten Hag sack : Liverpool legend taunts Man Utd boss as Gareth Southgate talk gains serious momentum",
  "date": "20240320T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nLiverpool legend taunts Ten Hag sack as Man Utd move for Gareth Southgate gains serious momentum\nThe chances of Gareth Southgate becoming the next Manchester United manager are growing by the day and amid claims by a Liverpool icon that Sir Jim Ratcliffe has “already decided” to sack Erik ten Hag at the end of the season.\nThe Red Devils showed real promise under the Dutchman in his first year at the helm, guiding the club to Carabao Cup success, the FA Cup final and, most importantly, a third-placed finish in the Premier League. But this season has been swamped by inconsistencies that has seen Manchester United fall seriously behind the country’s three top sides as well as humiliated on their return to the Champions League.\nAnd while Sunday’s dogged and determined 4-3 victory over Liverpool in the FA Cup finals showed what they are capable of at their best, it remains uncertain if that will be enough to save Ten Hag for what some now feel is the growing inevitability of his sacking as manager.\nDON’T MISS ~ Ten Hag sack: The eight Man Utd players whose standards have most dipped and leave Dutchman in danger of axe\nIndeed, reports have been gathering pace for several months now that Ten Hag is on borrowed time with what was, at one stage, their worst part to a season for since 1930/31 putting him under serious pressure.\nSince then, British billionaire Ratcliffe has finalised his £1.3bn investment into 27.7% of the club and is about to draft in some key appointments behind the scenes, not least Omar Berrada as CEO and Dan Ashworth as sporting director.\nAnd between the three of them, a decision on Ten Hag’s future will be made at the end of the season.\nGareth Southgate to Man Utd rumours gather serious pace\nHowever, the signs do not look good for the Dutchman and strong reports on Tuesday claim the axe will not only fall but that United were also increasingly confident of persuading Southgate to become their new manager.\nThe 53-year-old’s deal with the FA to manage the England national side is due to expire come the end of the calendar year and a move to appoint him after the country’s European Championship campaign is over would reportedly set the Red Devils back a mere £800,000.\nAnd with Ratcliffe reportedly canvassing both INEOS officials and respected former United players on Southgate’s arrival, it seems there is a growing optimism at Old Trafford that he would be the perfect candidate to step into the Dutchman’s shoes.\nSuch an appointment would also curry favour with Ashworth, who knows the England boss’ methods well from his time at the Football Association.\nPer fresh reports, United are now pressing Southgate into a decision on taking the job soon, so as to help with their planning and over the increasingly-likely possibility that Ten Hag will be removed from his role, regardless of how the rest of the season pans out.\nHowever, sources have stessed to TEAMtalk that no decision has yet been made over Ten Hag’s future and that success in the FA Cup and in qualifying once again for the Champions League would make a decision to axe him hard to justify. To that end, we understand that, quite simply, any decision on his future will be held off until the season’s end.\nREAD MORE: Ten Hag next? 10 of the strangest managerial sackings as bizarre Man Utd axe claims emerge\nSouthgate playing down Man Utd rumours\nSouthgate himself has been quick to play down talk of a move to United, with the England coach insisting just last week he did not want anything to distract from his mission of leading the country to Euro 2024 glory.\nTo that end, he is well aware of the expectations on his shoulders and that anything less than an England victory will be considered a failure.\n“I have to deliver in the job I’m in, so there’s no point in me thinking any further ahead than that,” Southgate said when questioned about Manchester United links recently.\n“My focus is delivering the best possible European Championship for England. Since I came to St George’s, our target has been being in the final four of things, with the ultimate aim of winning.\n“If you look at the trajectory of a team, we’re at that point where we’ve done a lot of the climb and the enjoyable bit and we’re at that last bit, really, of winning and getting over the line.\n“We’ve shown the consistency in the world ranking for the last five years, so there’s consistency of performances. We have to translate that with the next step now.\n“That’s the challenge I have to accept as well and I’m really comfortable with that. There’s no point in speculating about what might happen after the summer.”\nSouthgate added: “I think we would have to sit and think about that at the end of the tournament. I’m happy to talk about it briefly now, but I’m not going to talk about for the whole summer, what’s next.\n“We’ve consciously shelved any discussions internally about what might be next, because I think if we had sat and signed a new contract and done that before the tournament, everybody would have said: ‘Well, you did this with (Fabio) Capello and you should be proving yourself before you sign.’\n“So, look, I’m completely relaxed about that and I have no idea where we’ll be in the middle of July, other than I hope it’s Trafalgar Square and let’s get the party on!”\nLiverpool icon goads Ten Hag over Man Utd sack\nTen Hag, meanwhile, remains determined to fight on in the United hotseat and continues to state that his players are both behind him and that he is planning for next season at the Old Trafford helm.\nAs it stands though, his deal is currently due to expire in summer 2025, meaning this summer was always going to represent something of a crossroads in his time at United regardless of whether he was coming under pressure of the sack or not.\nIndeed, former Liverpool player and manager Graeme Souness is adamant that the decision to remove Ten Hag as manager has already been taken, with the axe set to fall regardless of how this season pans out.\n“I think they will have made their mind up already that he there’ll be a change at Man Utd, Souness said on talkSPORT.\n“There’ll be a new coach in place next year, unless they go on the most amazing run and find themselves in the top four.\n“But I come back to it, that group of players. With average players, you get up and down performances. They’ve got away with it.\n“His argument will be, ‘We’ve had lots of injuries’ – but every manager can point to injuries over a season.\n“I think what will cause him difficulty – or danger – with the people now making the decisions will be that the players he’s brought in.\n“The spin he’s trying to put on their performances, they will see through that.”\nIN DEPTH: Three ways Ten Hag can miraculously avoid Man Utd sack, as Ratcliffe prepares to swing the axe\nTen Hag ‘doesn’t have the chops for Man Utd job’\nAsked if United will stick with Ten Hag, fellow presenter Simon Jordan added: “I honestly don’t know. And it’s not me sitting on the fence.\n“I think a lot depends on how he runs his season out and what I think he represents.\n“For me sitting remotely, no. I’ve started from the outset believing that Ten Hag doesn’t have the chops for this job.\n“But that’s also laced with the idea that when you ask me: ‘Who does then?’ Not sure.\n“My gut feel says no, I wouldn’t [keep Ten Hag]. But my gut feel is they will for a period of time.”\nTen Hag has already lost 16 of 41 matches played so far this season in all competitions, while the Dutchman’s overall win percentage rate currently sits at 60.78% with 62 victories from 102 matches in charge.",
  "word_count": 1362,
  "scraped_at": "2026-02-14T02:10:47.911334",
  "_text_extracted": true
}