{
  "article_id": "4935dbe5f1d1",
  "url": "https://www.justarsenal.com/are-saka-and-odegaard-the-main-driving-force-behind-arsenals-recent-super-run/360535",
  "title": "Are Saka and Odegaard the main driving force behind Arsenal recent super run ? ",
  "date": "20240221T011500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Lineker impressed by Saka and Odegaard\nArsenal have been firing on all cylinders recently and our front line and midfield have looked at their very best. Walking away on the weekend with another dominant victory over Burnley at Turf Moor has obviously caught a lot of attention and rightly so. Arsenal look like they come into a part of the season where they truly believe in themselves and believe they can go all the way this season.\nArsenal currently sit in 2nd spot on 55 points and are only 2 points behind league leaders Liverpool, while Manchester City follow shortly behind on 53 points after dropping points to Chelsea this weekend in a 1-1 draw. Arsenal will be looking to build on that and with a lot of important games to come, our front line is very important and will need to continue their fine scoring form.\nGary Lineker, the former Tottenham Hotspur striker and England legend has spoke about how impressed he was with both Martin Odegaard and Bukayo Saka after watching the Gunners demolish Burnley 5-0 on the weekend.\nSpeaking on ‘The Rest is Football’ podcast this week he said this “Saka back to his best, although I don’t think he has ever been poor. Let’s make that absolutely clear”.\n“The same I think you can say for Odegaard. He has not quite had the numbers that he had the previous season, but he was brilliant again yesterday”.\nAnd I couldn’t agree with him more. Martin Odegaard has had a shaky season especially compared to last season when he was one of our best players all season, but recently he’s looked back at his best and has been involved in a lot of the goals we’ve been scoring. He himself has picked up 3 assists and a goal in the last two games and has looked to be back to his very best.\nSaka is another player who has been in incredible form recently, scoring 6 goals and 1 assist in his last 5 games and has been unreal for us going forward. He’s always been a big player for us but since coming back from the warm weather training and having a break, he also looks at his best, and if we want to continue to challenge for the title this year, we will need him to continue this great form.\nWe face Porto on Wednesday in The Champions League, in which Is a massive game for us and the fact we haven’t been in The Champions League for a while, makes it that more important, hopefully our in-form players can continue to shine as we look to progress further in the competition.\nHaving two such great players in our side gives us the confidence we can sweep all before us. Let’s hope that they don’t succumb to injury or we could be in trouble.\nFingers crossed!\nDaisy Mae\nWhat is your TOP TEN Arsenal players of the Decade? – Watch the latest COUCH COACH PODCAST with Bjorn &Dean and listen to their choices\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 532,
  "scraped_at": "2026-02-14T01:51:19.053249",
  "_text_extracted": true
}