{
  "article_id": "4962753c1634",
  "url": "https://timesofindia.indiatimes.com/city/goa/al-nassr-was-a-defeat-that-made-the-team-stronger-manolo/articleshow/125066715.cms",
  "title": "Al - Nassr was a defeat that made the team stronger : Manolo | Goa News",
  "date": "20251103T191500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Trending\nPanaji: FC Goa have lost more official games than they have won this season, yet there’s no cause for alarm. In fact, as coach Manolo Marquez points out, his team has been successful in achieving the first two season objectives for the club: making it to the group stage of AFC Champions League Two and semifinals of the Super Cup. “You can say we achieved another target, score in the ACL,” joked Manolo, referring to Brison Fernandes’ calm strike against Al-Nassr FC last month. Probably now it’s time to pick up a point or more. In a season marred by uncertainties and delays, three of Goa’s four losses have come in ACL2, Asian football’s second tier club competition, against higher-ranked opposition, while the other defeat was against NorthEast United, after the team had topped the group and qualified for the knockout stage of the Super Cup. Next up for Goa is a giant of a clash, against Al-Nassr away in Riyadh. “We know that this one will be another very difficult game,” Manolo told TOI. “We face a team that will emerge as winners of our group and will be favourites to win the tournament. Now we play them in Saudi (Arabia). Obviously, we want to be competitive, but we also want to enjoy this experience and pick up lessons which will help us for the future. This is why I keep repeating that it’s important for us to qualify again for next season.\nGet an chance to win ₹5000 Amazon Voucher by taking part in India's Biggest Habit Index! Take the survey here\nEnd of Article\nFollow Us On Social Media",
  "word_count": 273,
  "scraped_at": "2026-02-14T02:03:26.537582",
  "_text_extracted": true
}