{
  "article_id": "497d3d1a8be3",
  "url": "https://metro.co.uk/2024/08/22/mikel-arteta-urged-sign-ex-chelsea-star-instead-30m-arsenal-target-21468866/",
  "title": "Mikel Arteta urged to sign ex - Chelsea star instead of £30 , 000 , 000 Arsenal target | Football",
  "date": "20240822T123000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emmanuel Petit believes Arsenal should withdraw their interest in £30m target Mikel Merino and launch an audacious move for former Chelsea midfielder N’Golo Kante.\nMikel Arteta is keen to sign a new midfielder before the summer transfer window shuts at the end of the month and is close to bringing in Spain international Merino from Real Sociedad.\nThe 28-year-old, who featured for Euro 2024 winners Spain over the summer, is believed to be closing in on a move to north London, with Arsenal set to pay around £30m for his services.\nEx-Arsenal midfielder Petit believes Merino would adapt quickly to Premier League football but is unsure of his favoured position and says he could struggle with the ‘physicality’ of the English top-flight.\nAs a result, Petit has urged his former club to turn their attentions to two-time Premier League winner Kante, who is currently at Saudi Pro League side Al-Ittihad.\nKante is loved at Stamford Bridge after helping Chelsea win a host of trophies – including the Premier League and Champions League – and has been linked with a return to England this summer, although courtesy of West Ham rather than Arsenal.\n‘I really liked Granit Xhaka, he went through a difficult time at Arsenal and fell out with the fans, but he came back like a warrior and he is the definition of a sportsman,’ Petit told Safest Casino Sites.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘He proved everyone wrong. I think Mikel Merino is a good replacement for him, I watched him closely in the Euros and against PSG in the Champions League last season.\n‘I can’t tell if he is a number eight or a holding midfielder, but that would be a good problem for Mikel Arteta to have. Merino could adapt to the Premier League like how Rodri has, but he could also struggle with the physicality.\n‘If Arsenal want to bring a player who will be great competition for the midfielders, I don’t think it should be Merino or Frenkie de Jong because they’re primarily number eights.\n‘I think Arsenal should bring back N’Golo Kante to the Premier League. I want him to play for Arsenal, he would be so important to the side in terms of rotation.\n‘Kante’s spirit, reading of the game and breaking the opposition lines is still top quality. He can play as a holding midfielder and as a number eight.\nMore Trending\n‘When you look at Arsenal’s squad, they’re all humble, that fits Kante perfectly and Arteta would love him.’\nIf Merino completes a move to the Emirates Stadium he will become Arsenal’s third summer signing following Riccardo Calafiori, who joined from Bologna, and David Raya, who made his loan move from Brentford permanent.\nArsenal are bidding to become Premier League champions for the first time since 2004 following back-to-back second-place finishes and beat Wolves 2-0 in their opening game of the new season.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ivan Toney’s agent wants Brentford striker to join Arsenal, says Alan Pardew\nMORE: Raheem Sterling rules out one transfer option as Chelsea exit looms\nMORE: The £321m 11-a-side team Chelsea could make from their exiled ‘bomb squad’",
  "word_count": 591,
  "scraped_at": "2026-02-14T01:57:35.677494",
  "_text_extracted": true
}