{
  "article_id": "4980d401b412",
  "url": "https://metro.co.uk/2025/04/12/toni-kroos-aims-dig-arsenal-issues-warning-ahead-real-madrid-clash-22897753/",
  "title": "Toni Kroos aims dig at Arsenal and issues warning ahead Real Madrid clash",
  "date": "20250412T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Toni Kroos believes Arsenal’s lack of Champions League heritage offers Real Madrid a chance of producing another stunning European comeback against Arsenal.\nA devastating second half display in last week’s first leg at the Emirates Stadium has put the Gunners in a commanding position, but not an unassailable one.\nReal have made a habit of coming back from the brink in Europe in recent seasons and an early goal at the Bernabeu on Wednesday would dramatically change the complexity of Arsenal’s assignment.\nArsenal were eliminated at the quarter final stage last season following a tame second leg defeat against Bayern Munich and they haven’t been beyond the last eight since 2009.\n‘The emotional factor will be a huge decider against Arsenal,’ recently retired former Real Madrid star Kroos told Einfach mal Luppen.\n‘The team has to decide it in the first 15 minutes. That’s how it should go ideally. You need to make Arsenal, who have no Champions Leaguequarter-final experience, especially not in Madrid, think: ‘woah, it’s not over yet’.’\nHe added: ‘I can say from experience, usually when Real Madrid are chasing, there’s always that phase where you have a feeling that they will score one goal, even if it’s five, six or seven minutes left.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘And as you know a goal in this stage is always important to survive. That one goal is so crucial for the 2nd leg.\n‘But you felt that from the boys’ body language (I can assume since I’ve played with them for years), they’re saying ‘Please don’t score the fourth goal’.\n‘And that’s very weird, because it was never this way. It didn’t matter against who, there were some matches which we lost, but that’s not how it was.’\nArsenal and Mikel Arteta, meanwhile, are certainly making the right noises and taking nothing for granted given Real’s recent acts of European escapology.\n‘We’re going to enjoy the win, because we feel we deserve to do that, but we know it’s just half-time, and we’re going to have to be even better in Madrid to go through,’ said Arteta in Wedneday’s post match press conference.\n‘They were talking about it immediately. You know, great, enjoy it, and now let’s prepare for Saturday very well, and then we’ll have the time to prepare for the next challenge in Madrid. But they are all very excited.’\nSpeaking ahead of today’s game against Brentford, captain Martin Odegaard echoed those sentimements, saying: ‘At the final whistle we enjoyed it, but what I really liked was the reaction from every player as soon as we got back inside the dressing room.\n‘We know it’s only halfway through the tie – it’s different when you go to Madrid. We have to go there and put in another performance like the first leg if we want to get through.\nMore Trending\n‘That was the mindset of everyone in the dressing room and it was great to see everyone focused like that straight away.’\n‘We ‘can’t get carried away, it was a top performance against probably the best team in Champions League history, but we know it’s going to be a tough battle out there and we have to be ready.\n‘We’ve spoken about being able to win in any context against any team and now we get a chance to prove that against Brentford.’\nMORE: Arsenal 1-1 Brentford: Yoane Wissa’s acrobatic finish secures point for Bees\nMORE: Barcelona set asking price for Chelsea and Arsenal to sign Raphinha\nMORE: What is semi-automated offside technology? Premier League debuts major VAR change",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:26:33.614892",
  "_text_extracted": true
}