{
  "article_id": "4988988cfca9",
  "url": "https://www.90min.com/posts/andre-onana-man-utd-big-afcon-boost",
  "title": "Andre Onana tipped to hand Man Utd big AFCON boost",
  "date": "20231006T114500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Andre Onana tipped to hand Man Utd big AFCON boost\n- Onana previously retired from international duty but reconsidered stance on playing for Cameroon\n- Manchester United off to their worst top-flight start in decades\n- Summer signing's performances in goal have been up and down in early weeks\nManchester United goalkeeper Andre Onana could turn down the opportunity to play for Cameroon at the upcoming Africa Cup of Nations to instead focus on improving his performances at Old Trafford.\nThe 27-year-old arrived in Manchester over the summer, costing the Red Devils close to £50m, and took over as the club's number one after United mutually agreed to release David de Gea at the end of his contract.\nBut Onana's first couple of months at United have been difficult, with a couple of individual errors contributing to a particularly slow start to the season for Erik ten Hag's side. United have lost four of their opening seven Premier League games and were beaten in both of their Champions League group games - first to Bayern Munich in a seven-goal thriller before slipping to a disappointing 3-2 home defeat to Galatasaray.\nOnana was responsible for conceding possession in the build-up to Casemiro's sending off in midweek, and previously allowed Leroy Sane's tame effort to squirm under his body in Munich.\nAnd a report from ESPN suggests Onana may decide against representing Cameroon at the Africa Cup of Nations, with his priority instead to turn things around at United and help the club ascend the Premier League table.\nOnana previously quit international football after falling out with head coach Rigobert Song in the build-up to the 2022 World Cup, but reversed his decision in September after being contacted by Cameroon's FA and also the government.\nA potential stay during the winter months could be of huge benefit to Ten Hag, with United's understudy goalkeeper Altay Bayindir, signed from Fenerbahce in the summer transfer window, yet to make an appearance for the club.\nOnana will however need to improve his performances to ward off growing interest in his displays. His ability to play out from the back was hailed in the lead up to his arrival at Old Trafford, but a number of ill-advised short passes have often invited unnecessary pressure onto United's defence.\nHis positioning has also been called into question when facing shots on goal - United's concession of two early goals to Nottingham Forest drawing particular ire after Onana failed to advance and close down the angle for Taiwo Awoniyi's second-minute breakaway goal.",
  "word_count": 423,
  "scraped_at": "2026-02-14T01:56:32.778490",
  "_text_extracted": true
}