{
  "article_id": "499588b92651",
  "url": "https://www.finanznachrichten.de/nachrichten-2023-02/58315186-ol-groupe-first-half-2022-23-results-650.htm",
  "title": "OL GROUPE : FIRST - HALF 2022 / 23 RESULTS",
  "date": "20230215T074500Z",
  "domain": "finanznachrichten.de",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ALL REVENUE STREAMS ARE UP\nTOTAL REVENUE[1] (6 mos.): €134.8M (UP €18.7M OR 16%)\nincluding the 1st payment related to the LFP/CVC transaction\nIn the absence of European competitions,\nOPERATING PROFITABILITY DECLINED: EBITDA OF €-23.7M\nEAGLE FOOTBALL ACQUIRED 77.49% OF OL GROUPE'S CAPITAL\nand subscribed to a reserved capital increase of €86m\nLyon, 15 February 2023 8:00 am\nOn 14 February 2023, the Board of Directors of OL Groupe approved the financial statements for the first half of the 2022/23 financial year.\nRevenue for the first half of 2022/23 totalled €134.8 million, up €18.7 million or 16% from €116.1 million in H1 2021/22. All components of revenue increased, even though the club did not qualify for a European competition in 2022/23, reflecting the attractiveness of OL and its brand, as well as the quality of its infrastructure for hosting major events.\nNevertheless, EBITDA was a loss of €23.7 million. The following factors had a strong impact: (i) the club did not participate in any European competition this season, (ii) expenses related directly to revenue rose along with revenue, (iii) operating expenses rose, in particular electricity as a result of the international and inflationary context and (iv) personnel costs rose, tied to summer 2022 transfer activity and government aid on payroll taxes in 2021/22 (€37 million related to the Covid crisis).\nThroughout the first half of the financial year, OL Groupe continued to advance on its strategic projects and in particular on the construction of the LDLC Arena, which is scheduled to begin operations at the end of 2023.\nIn parallel, on 19 December 2022, Eagle Football finalised the acquisition of 77.49% of the share capital of OL Groupe from OL Groupe's principal historical shareholders (Pathé, IDG Capital and Holnest), and subscribed to a reserved capital increase of €86 million (incl. fees). The composition of the Company's Board of Directors has been changed to reflect the change in its shareholder structure.\n1/ ALL COMPONENTS OF REVENUE INCREASED - EBITDA DECLINED\n* the financial statements have been audited (in accordance with AMF recommendation 2016-05).\nH1 2022/23 TOTAL REVENUE: €134.8M (UP €18.7M OR 16%)\nTICKETING: €15.8M (UP €1.6M OR 12%)\nIn the first half 2022/23, ticketing receipts rose by 12%, despite the absence of a European cup competition. They included a record amount for a Ligue 1 match (OL/PSG) in September 2022.\nMEDIA AND MARKETING RIGHTS: €37.7M (UP €7.2M OR 23%)\nIn August 2022, OL Groupe received an initial payment of €16.5 million, deriving from CVC's investment in the commercial subsidiary of the LFP. LFP/FFF media rights received a boost from OL's improved Ligue 1 ranking as of end-December (8th vs 13th as of 31/12/2021) and from the new breakdown of international media rights.\nSPONSORING - ADVERTISING: €19.0M (UP €1.6M OR 9%)\nSponsoring-Advertising revenue rose 9% to €19.0 million, a record high for the first half, demonstrating the continued attractiveness of the OL brand, despite the club's absence from European cup play this season.\nBRAND-RELATED REVENUE: €11.1M (UP €2.0M OR 22%)\nBrand-related revenue also set a new record, underpinned by good performance on derivative products and fees earned with regard to concerts held in the summer of 2022.\nEVENTS: €7.4M (UP €3.7M OR 97%)\nThe Events business also set a new record of €7.4 million in revenue, owing in particular to three major musical events held before a sold-out Groupama Stadium crowd during the summer of 2022: Rammstein on 8 & 9 July and the Rolling Stones on 19 July, attracting a total of more than 150,000 spectators.\nAt the same time, the Seminars/stadium tours activities posted revenue of €3.4 million (up 12% from H1 2021/22), exceeding their pre-Covid record.\nPLAYER TRADING: €43.8M (UP €2.6M OR 6%)\nDuring the first half of 2022/23, Olympique Lyonnais transferred Lucas Paqueta to West Ham for €35.7 million and Léo Dubois to Galatasaray for €2.4 million. The Club also received high sell-on fees and loan payments, totalling €5.7 million.\nIn the first half of 2021/22, the sale of player registrations had totalled €41.2 million, corresponding to four transfers totalling €39.8 million, plus €1.4 million in sell-on fees.\nEBITDA: €-23.7M (€14.7M IN H1 2021/22)\nExternal purchases and expenses totalled €56.6 million during the first half, vs €42.8 million in H1 2021/22, reflecting the higher topline as well as the overall inflationary context, which impacted operating expenses. The cost of electricity, in particular, rose fivefold during the half-year period.\nPersonnel costs totalled €86.2 million. During the year-earlier period, the Company benefited from Covid-related government aid on payroll charges of €37.1 million. This aid had reduced personnel costs to €34.9 million. After restatement of the 2021/22 amount, personnel costs increased by €14.2 million, or +20%, principally reflecting the arrival of new players and contract extensions (Lacazette, Tolisso, Tagliafico, Lepenant, Caqueret, etc.)\nIt is estimated that the club's absence from European cup play this season cost OL Groupe ca. €15 million in EBITDA during the first half. EBITDA thus totalled €-23.7 million in H1 2022/23, vs €+14.7 million in H1 2021/22.\nNET LOSS (GROUP SHARE): €60.2M (€33.1M MORE THAN IN H1 2021/22)\nNet depreciation, amortisation & provisions totalled €26.2 million during the period, down €7.6 million from €33.8 million in H1 2021/22, principally reflecting player trading in the summer of 2022. As a result, OL Groupe posted an operating loss of €51.8 million in H1 2022/23, €31.6 million greater than the loss reported in H1 2021/22.\nNet financial expense totalled €9.5 million in the first half, vs €7.8 million in H1 2021/22, as it included new interest expense on the second government-guaranteed loan (PGE), granted in December 2020, and on the financing for the LDLC Arena.\nThe pre-tax loss for the first half of 2022/23 totalled €61.3 million, vs €28 million in H1 2021/22, and the net loss (Group share) was €60.2 million, vs €27.1 million in H1 2021/22.\n2/ BALANCE SHEET AND DEBT\nCondensed balance sheet*\n* Simplified presentation, not IFRS-compliant\nPlayer registration assets were down €16.9 million to €56.4 million (vs €73.3 million as of 30 June 2022), reflecting player trading during the 2022 summer transfer window as well as amortisation. As of 31 December 2022, the market value of the men's professional team was estimated at €255 million[2], implying that potential capital gains were still high; they were estimated at nearly €200 million.\nThe increase in property, plant & equipment to €417.5 million (vs €384 million as of 30 June 2022) principally reflected progress on the construction of the LDLC Arena (increase of €36 million during H1 2022/23).\nShareholders' equity (including non-controlling interests) totalled €103.5 million as of 31 December 2022, up €25.4 million, reflecting (i) the reserved capital increase of €83.3 million net (€86 million including fees) subscribed by Eagle Football on 19 December 2022 and (ii) the first-half loss. Shareholders' equity totalled €78.1 million as of 30 June 2022.\nInfrastructure bank and bond debt (stadium and arena) declined by €46.0 million to €114.5 million (€160.5 million as of 30 June 2022), reflecting debt paydown of €50 million in December 2022 as a result of the transaction with Eagle Football and of commitments made to bank lenders in connection therewith.\nOther borrowings and financial liabilities totalled €300.0 million, up €77.1 million (from €222.9 million as of 30 June 2022), reflecting a €+34 million increase in Arena lease obligations, in accordance with progress on construction, a shareholder loan from Eagle Football of €21 million and a €17 million drawdown on the revolving credit (RCF) line.\nAs of 31 December 2022, cash totalled €18 million (€27.3 million as of 30 June 2022). The Group also had undrawn RCF availability of €83 million.\nThe balance of receivables less payables on player registrations improved by €50.2 million to a net receivable of €34.6 million as of 31 December 2022.\nDebt net of cash (including net receivables on player registrations) totalled €321.1 million as of 31 December 2022, down 3% from €330.8 million as of 30 June 2022.\nAs of 31 December 2022, OL Groupe benefited from a \"covenant holiday\" granted by its bank and bond lenders.\n3/ RECENT EVENTS AND OUTLOOK\nOL Groupe was particularly active during the winter transfer window, transferring Malo Gusto, a player trained at OL, to Chelsea for €30 million + €5 million in incentives, which strengthened 2022/23 EBITDA. The player will remain at OL on loan until the end of the season. Several players were loaned out to other clubs until the end of the season: Da Silva to Volendam, Toko Ekambi to Rennes, Faivre to Lorient, Camilo to Molenbeek, Reine-Adélaïde to Troyes, Pollersbeck to Lorient and Da Silva Damien to Melbourne. Tetê's contract was terminated, at his request, and the player signed with Leicester. In addition, Dejan Lovren joined OL from Zenit St Petersburg with no transfer fee, and the club acquired the contracts of Saar from Heerenveen (€11 million + up to €1 million in incentives + sell-on fee of 10% of any capital gain) and Jeffinho from Botafogo (€10 million + up to €2.5 million in incentives).\nOL Groupe reaffirms its on-the-pitch goals for the 2022/23 and subsequent seasons. It will rely on its fundamentals, including the OL Academy, to recapture a European berth in 2023/24.\nThere is already a wealth of events scheduled for Groupama Stadium, starting in the spring of 2023, including the following concerts: Depeche Mode (31 May 2023), Muse (15 June 2023), Mylène Farmer (23 & 24 June 2023), Red Hot Chili Peppers (11 July 2023). Other sporting events are also planned: the World Supercross French Grand Prix Lyon 2023, five Rugby World Cup matches (September/October 2023) and football matches (men's and women's) as part of the 2024 Paris Olympic Games.\nConstruction of the LDLC Arena, 100% assumed by OL Groupe, is continuing on schedule. Construction began in January 2022, and the arena is expected to enter service at the end of 2023. Programming has been officially launched, with a Shaka Ponk concert set for 2 February 2024. Other shows have also been confirmed.\nOL Groupe also reiterates its medium-term objectives, which are to achieve the following by 2025/26: (i) total revenue in the region of €400-420 million (scenario includes a Champions League qualification and player trading) and (ii) EBITDA in excess of €90 million. These objectives also include net debt of less than €180 million by 2025/26 (scenario wherein the balance of stadium debt is refinanced over seven years from 1 July 2024).\nIn accordance with applicable regulations, Eagle Football will file, on behalf of the concert with Holnest, a simplified cash tender offer on the balance of the OL securities, at a price of €3 per share and €265.57 per OSRANE.\n[1] Alternative Performance Indicator (API): \"Total revenue\" corresponds to the previous definition of \"Total revenue\", i.e. revenue excluding player trading plus proceeds from the sale of player registrations.\n[2] OL market value, based on Transfermarkt and CIES\n- SECURITY MASTER Key: nWdyaJlnk5iXmG6eYpaWa5dpbGqWlWSdZmPJlGpvZJvIb2lnm5liZ8aeZnBpmm1o\n- Check this key: https://www.security-master-key.com.\nhttps://www.actusnews.com/documents_communiques/ACTUS-0-78582-olg-150223-rs-2022-2023-gb.pdf\n© Copyright Actusnews Wire\nReceive by email the next press releases of the company by registering on www.actusnews.com, it's free\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 1925,
  "scraped_at": "2026-02-14T01:38:58.334236",
  "_text_extracted": true
}