{
  "article_id": "49c9e708174d",
  "url": "https://www.namibian.com.na/muzeu-shines-as-leopards-battle-fifa-ban/",
  "title": "Muzeu shines as Leopards battle Fifa ban",
  "date": "20250923T084500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Namibian striker Bethuel Muzeu is standing out in South Africa, scoring goals for Black Leopards despite the club’s International Federation of Association Football (Fifa) transfer ban and goalkeeper crisis.\nThe 25-year-old forward joined the Limpopo-based team in 2022. Through the chaos, he has maintained his performance, scoring two goals in three matches. He found the net in a 2-2 draw against the University of Pretoria and again in a 1-1 draw with Lerumo Lions, proving to be a key player for the struggling team.\nIn an interview with The Namibian, Muzeu says the situation hasn’t been easy, but he praises the team’s resilience.\n“The season has definitely started with challenges. The Fifa ban limits our squad options. It’s tough playing without key players, but we’ve shown great character and resilience as a team,” he says.\n“As a striker, it’s a test of patience and adaptability. I need to adjust to new dynamics and take on more responsibility in attack. Every game is a chance to grow. We are learning to work better together under pressure. While the results haven’t always gone our way, our team spirit remains strong despite the tough circumstances we face.”\nLeopards are currently under a Fifa ban inherited from Cape Town All Stars. The previous club failed to complete necessary checks through the Fifa Clearing House portal before selling their status to Leopards three years ago.\nAs a result, the squad is limited to only 17 registered players, with no goalkeepers available. Defender and captain Thendo Mukumela has had to play in goal during all three matches so far. Even though Namibian international goalkeeper Loydt Kazapua has joined the club, he cannot be registered until the ban is lifted.\nClub chairman Chief Thidiela says Leopards are paying for issues from the previous ownership. “We are under a Fifa transfer ban imposed on Cape Town All Stars for not doing an assessment on the Fifa Clearing House portal. Since we bought their status, we now face the consequences,” he says.\nThe season began poorly with a 3-0 loss to Casric Stars, where Leopards could field only 10 players and had no substitutes. Their third match, against Upington City, was postponed after the PSL and the opponents agreed to give Leopards time to address their situation.\nDespite these setbacks, Muzeu has remained a bright spot, encouraging his teammates to stay positive.\n“Complaining doesn’t help you become a great player. It’s better to look at the situation positively, learn from our mistakes, and improve. We’re focused on staying positive, getting better each week, and making the most of this situation,” he adds.\nWith Leopards still searching for their first win, the road ahead looks tough without a natural goalkeeper as they continue to concede goals. However, Muzeu’s scoring ability and the squad’s determination to adapt give them hope.\nNAMIBIANS ABROAD\nA few more Namibians players abroad were in action this past weekend. In the South African Premier Soccer League, Deon Hotto played the entire match and assisted Tshegofatso Mabasa as Orlando Pirates beat Lioli FC 3-0 in the CAF Champions League preliminary round. The second leg will be held at Orlando Stadium on 27 September. The 2024 CAF Champions League finalists aim to keep their lead and qualify for the group stage.\nJoslin Kamatuka scored the first goal in Durban City FC’s 3-1 loss to Mamelodi Sundowns. The Namibian winger had another chance to score his second goal of the game, but his penalty was saved. This marked his second goal of the season after seven games.\nHis team is currently in fifth place with 11 points. Fellow Brave Warriors player Peter Shalulile came on in the 73rd minute for Sundowns, who are in second place with 18 points, just one behind the leaders, Sekhukhune United.\nIn Zimbabwe, Isaskar “Bio” Gurirab made his CAF Champions League debut for Simba Bhora, coming on in the 52nd minute during their historic 1-0 win over Eswatini’s Nsingizini Hotspurs. The match took place in Francistown, Botswana, marking Simba Bhora’s first time in the competition.\nMeanwhile, Moses Shidolo played the entire match for Scottland FC, which was eliminated from the Zimbabwe Chibuku Super Cup quarterfinals after losing 2-1 on penalties to Highlanders following a 2-2 draw in regular time.\nIn Botswana, Ivan Kamberipa played the full game for Gaborone United in their close 1-0 loss to Tanzanian giants Simba SC in the CAF Champions League preliminary round, also held in Francistown. The second leg will take place in Tanzania on 28 September.\nDynamo Fredericks was active for Jwaneng Galaxy, playing 68 minutes in their 1-0 defeat to Mighty Wanderers of Malawi in the CAF Champions League. The return leg will be played on 27 September in Francistown, Botswana.\nSisqo Haraseb started his sixth straight match for Mochudi Centre Chiefs, who drew 1-1 with Sau Flamingoes in the Botswana Premier League. This result kept their unbeaten streak alive and moved them to third place with 12 points, two behind the leaders.\nIn Georgia, Tjipe Karuuombe started for Gonio FC in their 2-0 loss before being replaced in the second half. Gonio continues to struggle in the Georgian second tier, currently sitting second from the bottom.\nIn Malaysia, Petrus Shitembi was in the starting lineup as his team won 1-0 against Selangor FC in Round Four of the Malaysian Premier League, moving up to fourth place.\nIn Kosovo, Romeo Kasume started for Liria Prizren FC in their 3-0 loss to bottom club KF 2 Korriku. His teammate Kambato is still sidelined. After seven games, Liria is in seventh place.\nIn England, Ryan Nyambe was an unused substitute as Derby County suffered a 1-0 loss in the English Championship. Their team is currently 17th in the log table after seven games.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 1058,
  "scraped_at": "2026-02-14T02:12:04.362878",
  "_text_extracted": true
}