{
  "article_id": "49d669946c9f",
  "url": "https://www.nytimes.com/athletic/5851079/2024/10/18/england-thomas-tuchel-how-hired-coach/",
  "title": "How England hired  outstanding  Thomas Tuchel – and why not everyone is happy about it",
  "date": "20241018T110000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Gareth Southgate resigned the day after the Euro 2024 final, the Football Association had a huge task ahead of it: to replace England’s greatest manager of the modern era, the man who had redefined the role.\nIt was not a position it ever wanted to be in. The hope had been that if England had beaten Spain in Berlin, Southgate could have been persuaded to go on another two years. But with Southgate leaving, the FA’s CEO Mark Bullingham and technical director John McDermott had no choice but to look elsewhere.\nAdvertisement\nThree months later, Bullingham was sat in Wembley Stadium’s media room, with McDermott watching on a few yards away. And next to Bullingham was Thomas Tuchel, the new England manager, having signed his 18-month contract eight days earlier.\nThe FA was delighted to land a manager who Bullingham described as giving England “the best chance of winning the World Cup” and who had been keen on taking the job for some time. His contract, which is worth around £6million a year, includes a bonus for winning the World Cup and he will be assisted by his long-time lieutenant, Anthony Barry.\nTuchel arrives with a glittering CV and a sense of glamour. He won the Champions League and the Club World Cup at Chelsea. Unlike Fabio Capello, who took the job at 61, Tuchel — aged 51 — is at his peak.\nBut it was not an appointment without its challenges or even controversies. The Athletic has spoken to multiple people with knowledge of the FA’s process — all of whom wished to remain anonymous to protect their relationships — and can reveal:\n- A shortlist of candidates to succeed Southgate had been drawn up before the European Championship.\n- Pep Guardiola was the FA’s ideal candidate but he would not commit to taking the job.\n- Bullingham’s claim that the FA “interviewed approximately 10 people” riled some of those connected to leading contenders, who felt it mischaracterised how seriously other candidates had been considered.\n- The treatment of Lee Carsley, who was left to struggle with questions about whether he wanted the permanent job even after Tuchel had signed his contract, surprised former FA insiders.\n- Tuchel will not attend either of England’s November internationals against Greece and the Republic of Ireland as he prepares to start formally on January 1.\nWhen the FA put its succession plan into action, it had one clear goal: to try to win the World Cup in 2026. “As we set out our process,” Bullingham said on Wednesday, “our priority was to find someone that can give our players the best possible chance to win.”\nThe first public step in the recruitment came at the end of the week in which Southgate resigned. On the morning of July 18, the FA published its job description for the role of Men’s Senior Team Head Coach.\nThe very first bullet point proved that the FA was going for someone to help it win that first major men’s trophy since 1966. “Lead and develop the England senior men’s team to win a major tournament,” it read, “and be consistently ranked as one of the top teams in the world.” The posting also mentioned that the successful candidate must have a “strong track record delivering results in the Premier League and/or leading international competitions”.\nAdvertisement\nAs soon as the FA published that, it was clear what its “ideal profile”, in Bullingham’s words, was for the job. It was looking for an experienced winner who had a proven record at the top of the game rather than someone who would just keep the Southgate culture ticking along.\nThe other key factor from the start concerned nationality. Southgate had been hugely successful during his near eight-year tenure and was very proud of his work building a distinctly English identity for the national team, but the FA wanted to cast the net as wide as possible in pursuit of his successor.\nIn the summer, the FA board held a vote on whether the new coach should be English or not. While there was some appetite for England to choose an English coach — citing the belief that the game’s major countries should not be looking outside their own borders for managers — the vote went overwhelmingly the other way.\nSo while being English would not be a criterion in the search, experience of English football and of developing English players would be. There was to be no repeat of the Capello situation in 2007, when a previously successful manager was parachuted into the England job with no prior experience in English football.\nPut all of those criteria together and a few names clearly stood out. Tuchel, Mauricio Pochettino, Jurgen Klopp and, above all, Pep Guardiola.\nGuardiola was the FA’s dream candidate. In 15 full seasons of senior management, he has won 12 league titles, three Champions Leagues, six domestic cups, four UEFA Super Cups and four Club World Cups. He has done so with a distinctive style that has arguably revolutionised how football is played in this country. And he is deeply rooted in English football, having developed a sizeable percentage of the current England team, including Kyle Walker, John Stones, Phil Foden and Rico Lewis, since joining Manchester City in 2016.\nGO DEEPER\nThomas Tuchel: England have hired a 'winner' but that is no guarantee in international football\nBut there were two problems. The first was that Guardiola is contracted to City until the end of this season. With City taking part in the Club World Cup next summer, he would be unable to manage England until the September 2025 break, less than a year before the 2026 World Cup. It is hard to see how such a limited time with the England players could ever have been deemed conducive to the FA’s goal of winning that tournament, which will be co-hosted in the United States, Canada and Mexico.\nAdvertisement\nThe second was that Guardiola himself has not decided what he will do at the end of this City contract: stay, take a break, or go to a different job. There were other factors at play here outside the FA’s control, not least City’s ‘115 charges’ legal battle with the Premier League, the outcome of which could have a significant bearing on the club’s prospects next season and beyond.\nPeople in the industry, including some who know him well, have noted that Guardiola changes his mind almost every day about what he wants to do next summer. When he went on Italian TV last week to discuss his future — after Tuchel had signed his England deal but before the news broke — he said that he had not decided what he would do next, but that “anything can happen”.\nThe FA did reach out to Guardiola, but he would not commit to taking the job. He would have been ideal and there was excitement about the prospect of appointing the most successful manager of the 21st century to lead the England team. But with Guardiola unable to commit, that optimism faded and the talks never became advanced.\nBullingham did not reference Guardiola specifically in his press conference on Wednesday but did acknowledge that “clearly some (candidates) were more up for the role than others” when asked whether the FA had been rejected by anyone. When contacted by The Athletic, the FA and City declined to comment.\nWith Guardiola out of the picture, who else was there? Jurgen Klopp ticked all the same boxes as Guardiola and, unlike the City manager, was out of work having left Liverpool at the end of last season. But he made clear that he would not be jumping straight back into the game after ending a draining nine-year tenure at Anfield. Speaking at a coaching conference while the FA was still accepting job applications, Klopp said it would be “the biggest loss of face in the history of football” if he were to go into another job immediately. He has subsequently taken a role as Red Bull’s head of global soccer.\nPochettino was also out of work then, having left Chelsea at the end of last season. He would also have scored highly based on what the FA were looking for. Plenty of England players from the Euros — Luke Shaw, Walker, Harry Kane, Kieran Trippier, Conor Gallagher, Cole Palmer — owe much of their development to the Argentinian and his coaching staff. Pochettino, however, has since become the new manager of the United States’ men’s national team.\nIn terms of English candidates, Graham Potter has been out of work since he was sacked by Chelsea in April last year. There was support for Potter’s potential candidacy from other Premier League managers, but contact never got beyond the informal stage.\nAdvertisement\nWhen Potter was a guest analyst on UK broadcaster Sky Sports’ Monday Night Football show on September 30, he said he was “supportive of whatever the FA decide to do” and “supportive of whoever the coach is”. When asked whether he would prefer his next job to be in club or international football, he said that he was “open to anything”.\nEddie Howe was one of the early favourites and the possibility of an England approach for him overshadowed his Newcastle United side’s start to the season after what had already been a summer of upheaval. The FA approaching Newcastle and trying to negotiate compensation for their head coach would have been a difficult situation for everyone involved. Ultimately, Howe was never put in a position where he had to make a tough decision: there was no direct approach to him and he did not apply for the role.\nWhen asked whether he was contacted on Friday, Howe said “no” and confirmed that he was not interviewed. He added: “I was lucky and fortunate enough to watch him at Chelsea. What a brilliant guy, person and coach, I had two days with him and thought he was fascinating. I really wish him well. I think he’s a great appointment. I hope he leads England to many trophies.”\nThere was consternation among some candidates at Bullingham saying on Wednesday that the FA “interviewed approximately 10 people”. Some of those closely connected to the candidates took issue with that presentation of the hiring process, pointing out that one informal phone call did not necessarily constitute an interview.\nGO DEEPER\nWhat sort of football will Thomas Tuchel's England play?\nUltimately, it was Tuchel who ticked more of the FA’s boxes than anyone else, especially once it was clear that Guardiola was not going to happen. Here was a candidate who had won things at the highest level and who was at the cutting edge of modern tactics and coaching. He was unattached, having left Bayern Munich at the end of last season, meaning there would be no wrangling over compensation.\nAnd while he was not English, he had a direct connection to English football. Tuchel had a fantastic 20-month spell at Chelsea, bonding with the fans and developing English talents including Mason Mount, Reece James and Ben Chilwell, all of whom played for Southgate’s national team. Tuchel was a big admirer of English players. He signed Kane and Eric Dier for Bayern and wanted Declan Rice, too.\nHe loved living in England and was widely known to be keen to return, but Tuchel was not going to be on the market forever. He spoke to Manchester United in June about potentially replacing Erik ten Hag, but no deal was reached, and he had been linked to the club again more recently after United’s poor start to the new season.\nAdvertisement\nOnce the FA identified Tuchel as their preferred candidate, it moved fast and secretively. The first meeting was just with McDermott. Tuchel — who told the BBC that the FA had first approached him in late August — spoke on Wednesday about the good feeling he got when he learned this job was “about football” and specifically about the focus on trying to win the next World Cup.\nThe second meeting was with McDermott and Bullingham, where Tuchel gave a presentation about how he intended to work, which hugely impressed his interviewers. “Thomas was absolutely outstanding,” Bullingham said on Wednesday, “providing a really clear vision for the role and how he would work with our players and get the best out of them and to give us the best chance at the World Cup.”\nFrom there the process was, as Tuchel put it on Wednesday, “very fast, very exciting, very confidential, very trustful”, with his agent Olaf Meinking doing the deal directly with the FA. On October 8, Bullingham presented Tuchel’s proposed appointment at a hurriedly convened meeting of the FA board.\nIt was a very brief meeting held on Microsoft Teams, with some members unable to even make the start of it. While there was no debate on the call, it did leave some members wondering afterwards why there was such a rush to secure Tuchel’s signature, given Carsley was already in place to manage the two November games and England will not play again after those until next March.\nIt was only at the end of that week that news of England’s serious interest in Tuchel started to emerge in Germany, but he and the FA wanted to keep this as discreet as possible, Tuchel admitting on Wednesday he did not even call Kane, England captain and his former player from Bayern, to discuss his taking over.\nThe FA did not want the news to emerge during the course of this month’s international break, when England played Greece and Finland still under the interim management of under-21s head coach Carsley. But this meant that he was placed in the difficult position of having to answer questions about whether he wanted the permanent job even though someone had already signed a contract to take over.\nCarsley visibly struggled with it twice, first after the Greece game, when he said that he would “hopefully” return to the under-21s after November, and then again following the Finland match, when he said England should appoint a “world-class” manager who had won things, unlike him.\nAdvertisement\nBoth of those statements make far more sense in the context of what was happening behind the scenes, but at the time they caused confusion and left Carsley looking out of his depth. One former senior FA employee told The Athletic they had been surprised by the organisation’s handling of Carsley’s situation.\nGO DEEPER\nTuchel's unveiling dissected: '10 interviews', national anthem and Kane's role\nFor all the pride in securing Tuchel, Wednesday’s unveiling press conference still left plenty of questions for the FA.\nThere is the matter of his start date, not until January 1, which means that Carsley will take England for two more games in November. The FA confirmed to The Athletic Tuchel will not even attend those matches against Greece in Athens and the Irish at Wembley.\nOn Wednesday, Bullingham said the January start date was decided on so that Tuchel could have a “singular focus” on the World Cup qualification campaign, but if England finish second in their Nations League group — which is the position they are currently in — they will have play-offs in that competition next March anyway.\nThere is also the issue of the Football Leadership Diversity Code.\nAt the start of this process, the FA said it would comply with its requirements. The code, set up in 2020 to encourage diversity in football jobs, states that: “Shortlists for interview will have at least one male and one female Black, Asian or of Mixed-Heritage candidate if applicants meeting the job specifications apply.” At the end of the process, it did not appear that this specific criteria had been met, although the FA did take the unusual step of advertising the job publicly so as to encourage the broadest range of possible applicants.\nThe fact that, after eight years of Southgate, the FA has decided to go for an elite foreign manager has caused disappointment in some quarters, but the pool of English managers is quite shallow and Bullingham admitted on Wednesday that the FA was not awash with English options for this post.\nAdvertisement\n“Clearly, you would love to five to 10 domestic candidates who are coaching clubs in your domestic league, challenging and winning honours,” he said. “We are not quite in that place at the moment.” Once the FA board had approved the idea of going for a non-English coach in the summer, the likeliest outcome was a big European name such as Tuchel.\nOverall, the appointment has met with a positive reaction from fans who recognise that Tuchel has an excellent track record, competing at the highest level of the club game all over Europe. Anyone who saw him on Wednesday will have been impressed by his charisma and clarity on stage. He will be a compelling and recognisable frontman for English football on the biggest stage in 2026 (assuming England qualify, as they have for the past seven World Cups). He may even help them to win it.\nEngland now have a manager who is at the cutting edge of European football and that has not always been the case in the past, but at the same time, it is clearly a risk.\nTuchel is unlikely to be here for a long time and if he does not deliver the trophy he has been brought in to target, England may have to start all over again.\nAdditional reporting: David Ornstein, Simon Hughes, Dan Sheldon, George Caulkin\n(Top photo: Michael Regan – The FA/The FA via Getty Images; design: Meech Robinson)",
  "word_count": 2952,
  "scraped_at": "2026-02-14T01:51:57.645191",
  "_text_extracted": true
}