{
  "article_id": "4a0120128460",
  "url": "https://www.sbs.com.au/news/podcast-episode/sbs-news-in-easy-english-22-may-2025/kie823o7u",
  "title": "SBS News In Easy English 22 May 2025",
  "date": "20250522T043000Z",
  "domain": "sbs.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Listen to Australian and world news, and follow trending topics with SBS News Podcasts.\nTRANSCRIPT\nPrime Minister Anthony Albanese has offered his condolences for a man who died in flooding impacting New South Wales.\nNew South Wales Police say the body of the 63-year-old man was found on Wednesday afternoon [[3pm; 21 May]] near Taree on Mid North Coast at a property at North Moto Road, Moto.\nIt is the first death reported in record flooding that has impacted the region for the past few days.\nIn a statement, Mr Albanese says it is devastating news and his thoughts are with the man's loved ones and the local community at this time.\n+++\nSouth African President Cyril Ramaphosa says his visit to the White House was a \"a great success\" - despite a tense moment.\nUS President Trump used the White House meeting to confront Mr Ramaphosa with baseless claims of the systematic killing of white farmers in that country.\nAt one point, Mr Trump dimmed the lights in the Oval Office to play a video of a far-left politician playing an anti-apartheid song that included lyrics about killing farmers.\nMr Ramaphosa says he feels he made a positive impression on the President.\n+++\nBritish police have charged a member of Irish hip-hop group Kneecap with a terrorism offense for allegedly waving a Hezbollah flag at a concert.\nThe Metropolitan Police force says Liam O'Hanna, known by his stage name Mo Chara, has been charged under the Terrorism Act with displaying a flag in support a proscribed organisation.\nBoth Hamas and Hezbollah are banned in the UK and it is a crime to express support for them.\n+++\nEleven culturally significant objects are returning to Country in Australia after almost a century overseas.\nThe ten glass spearheads and a kangaroo tooth headband have spent the last almost 100 years at the Fowler Museum in California.\nThe objects had been collected from Larrakia Country in the Northern Territory in the late 19th and early 20th centuries and donated to the museum.\nIt's understood elders have been working with the museum and the Australian Institute of Aboriginal and Torres Strait Islander Studies to have the objects returned since 2021.\n+++\nIndian author Banu Mushtaq and translator Deepa Bhasthi have won the International Booker Prize for fiction for a collection of 12 short stories, entitled Heart Lamp.\nThe work was written over more than 30 years and chronicles the everyday lives and struggles of women in southern India.\nIt is the first time the award has been given to a collection of short stories.\nBhasthi is the first Indian translator - and ninth female translator - to win the prize since it took on its current form in 2016.\nMs Mushtaq says it is an incredible honour to showcase the richness of the Indian language of Kannada.\n+++\nIn football, Ange Postecoglou says his side's victory in the Europa League final is reward for those who have kept the faith during a difficult season.\nThe Australian coach has made history with his side, Tottenham Hotspur, defeating Manchester United, one goal to nil in the final in the Spanish city of Bilbao.\nIt's the club's first trophy in 17 years, and winning the Europa League automatically qualifies Tottenham for the top competition, the European Champions League, next season, despite their severe struggles in the English Premier League that have put Postecoglou's job under threat.\nManchester United dominated the game, but Brennan Johnson scored the game's only goal with Tottenham's only shot on target.",
  "word_count": 589,
  "scraped_at": "2026-02-14T02:11:36.681027",
  "_text_extracted": true
}