{
  "article_id": "4a04f7c4b9e1",
  "url": "https://allafrica.com/stories/202504150482.html",
  "title": "Southern Africa : Cosafa Under - 17 Girl Championship in Numbers",
  "date": "20250415T214500Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2025 COSAFA Under-17 Girls' Championship will be hosted in Windhoek, Namibia from May 10-17 and is the sixth time a tournament will be staged in this age-group in the region.\nWe highlight the numbers surrounding the vital competition for the development of young players.\n0 - You don't have to miss a minute of the tournament with all matches streamed live on FIFA+.\nFollow us on WhatsApp | LinkedIn for the latest headlines\n0 - There is no formal African Women's Under-17 Championship, merely rounds of two-legged knockout ties that decide which teams will advance to the FIFA Under-17 Women's World Cup every two years. The next global tournament is set for 2025 in Morocco and Zambia have made the final round of qualifying for that event and will face Benin.\n1 - Uganda were the inaugural winners of the COSAFA Under-17 Girls' Championship after they beat South Africa 2-1 in the decider in Mauritius in 2019. Another guest nation, Tanzania, claimed the prize in 2020.\n1 - South Africa captain Jessica Wade was named the inaugural Player of the Tournament in the 2019 COSAFA Under-17 Girls' Championship. Tisilile Lungu of Zambia won the Player of the Tournament prize in 2020, while her compatriot Pumulo Lubasi claimed the prize in 2021. Sinazo Ntshota from South Africa won in 2022 and Mercy Chipasula from Zambia in 2024.\n2 - Zambia became the first Southern African side to lift the trophy when they triumphed in 2021 by beating Botswana 4-0 in the final. They lifted the trophy again in 2024 when they defeated Lesotho 15-0 in a one-sided decider. Zambia are the only team to lift the trophy twice.\n2 - Chitete Munsaka from Zambia won the Golden Glove for best goalkeeper in both 2020 and 2021. She is the only two-time winner of award surrounding the competition. Daphine Nyayenga from Uganda won in 2019, Casey Gordon from South Africa in 2022 and Loveness Chingwele from Zambia in 2024.\n2 - Uganda were the second guest nation to win any COSAFA tournament in 2019 after Tanzania broke the mould by claiming the Under-20 Women's Championship just a few months before in Nelson Mandela Bay. Since then, Tanzania have also won the COSAFA senior women and Under-17 titles, and Senegal and Morocco have won the Beach Soccer Championship.\n2 - South Africa and Zambia are the only two COSAFA nations to have appeared at the FIFA Under-17 World Cup. South Africa managed the feat in 2010 and 2018, while Zambia were there in 2014 and 2024.\n4 - South Africa became the fourth different side in as many years to lift the COSAFA Under-17 Girls' Championship trophy when they edged Zambia 4-3 in a thrilling decider in 2022.\n5 - The COSAFA Under-17 Girls' Championships are one of five women's events in the calendar in 2025, along with the COSAFA Women's Championship, COSAFA Under-20 Women's Championship, COSAFA Women's Champions League and Girls' competition at the African Schools Football Championship COSAFA Zonal Qualifiers.\n5 - Only five nations from the COSAFA region have entered the qualifiers for the FIFA Women's Under-17 World Cup before - Botswana, Mauritius, Namibia, South Africa, Zambia. With the regular playing of the COSAFA Under-17 Girls' Championship, that number should rise.\n5 - Namibia will become the fifth host of the competition in six editions after Mauritius (2019), South Africa (2020, 2024), Lesotho (2021) and Malawi (2022). Mozambique were due to host in 2024 but withdrew.\n9 - There are nine teams that will compete at the 2025 COSAFA Under-17 Girls' Championship - Botswana, Comoros, Lesotho, Malawi, Mauritius, Mozambique, Namibia, Zambia and Zimbabwe.\n10 - Aisha Masaka of Tanzania was the leading scorer in the 2020 COSAFA Under-17 Girls' Championship with 10 goals. She has since been elevated to the senior women's team and scored at the 2021 COSAFA Women's Championship. She plays in England for Women's Super League side Brighton & Hove Albion.\n14 - The COSAFA Under-17 Girls' Championship is open to all 14 of the nations that make up the Southern African regional body, while Reunion, as an associate member, may also enter tournaments.\n18 - Juliet Nalukenge from winners Uganda finished as the leading scorer in the 2019 championship with 18 goals in the five matches she played. It remains the biggest haul in the competition's history, and no player has managed to top her tally over the five previous editions.\n28 - The number of goals scored by South Africa as they overwhelmed Seychelles in their Group B clash in 2019. It was the biggest score in an international match in Africa, the biggest winning margin in a women's competitive international and the largest margin of victory by any South African team.\n110 - There were 110 goals scored in 21 games (5.24 per match) at the 2024 edition of the COSAFA Under-17 Girls' Championship, showcasing the entertaining nature of the competition.\n158 - There were a massive 158 goals scored in the 16 games in the championship in 2019, an average of almost 10 per match! That remains the highest to date.",
  "word_count": 849,
  "scraped_at": "2026-02-14T02:18:17.723624",
  "_text_extracted": true
}