{
  "article_id": "4a130eeb3413",
  "url": "https://www.france24.com/en/live-news/20230526-dortmund-s-terzic-urges-calm-ahead-of-title-euphoria",
  "title": "Dortmund Terzic urges calm ahead of title  euphoria  ",
  "date": "20230526T050000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dortmund's Terzic urges calm ahead of title 'euphoria'\nBerlin (AFP) – With a Bundesliga title just 90 minutes away, Borussia Dortmund coach Edin Terzic called for calm on Thursday, saying \"the key is to do nothing special\".\nIssued on:\nTwo points clear atop the table, Dortmund can win their first title for 11 seasons by beating Mainz at home on Saturday, regardless of second-placed Bayern Munich's result at Cologne.\nIf Bayern lose or draw, the title is Dortmund's.\nBut while the city of Dortmund is planning a parade for hundreds of thousands of people on Sunday, Terzic has urged his side to keep doing the things \"which played ourselves into a situation which created this euphoria\".\n\"The pitch is just as big as it was last week and the ball is just as round,\" Terzic said at Thursday's pre-game press conference in Dortmund.\nBorn and raised in the city, the 40-year-old is a lifelong Dortmund fan.\nThis week, a picture again went viral of the coach draped in a yellow and black scarf, standing in the crowd at the 2012 German Cup final in Berlin.\nDortmund won that match 5-2 over old foes Bayern, having also collected the league title that year.\n\"The key is not to do anything special in a special week,\" said Terzic, exuding a calm which has likely escaped most Dortmund fans this season.\nDortmund's run to what may be a ninth German title has been built on a superb second half of the season, which has seen them rise from sixth to first, closing a nine-point gap with perennial title winners Bayern.\nIn the 18 league matches since the winter break, Dortmund have lost just once, dropping just nine of a possible 54 points.\nWith Bayern struggling, picking up just 34 points over the same period, Dortmund have clearly been the best side in German football.\nHowever, their poor early season form -- with six losses in their first 15 games -- has kept things close at the top.\n- Fourth time lucky? -\nWith the season entering its final straight, the major question was not whether Dortmund had the quality to win the title, but the nerve.\nTerzic is only too aware of the role nerves have played in his side's run this season, where Dortmund have frequently given away golden opportunities in the title race.\nOn three occasions in the run home this season, Dortmund have risen to the top of the table only to subsequently drop points, allowing Bayern to return to the summit.\nThe first time, Dortmund travelled to Bayern atop the table, only to collapse in the first half, conceding three goals to a side playing under Thomas Tuchel for the first time, eventually losing 4-2.\nThe second time was perhaps the most concerning, with Dortmund giving up a 2-0 lead against a 10-man Stuttgart to draw 3-3, seemingly losing their cool after word filtered in that Bayern were being held to a 1-1 draw by lowly Hoffenheim.\nThe third time, Dortmund drew 1-1 at neighbours Bochum, after referee Sascha Stegemann waved away claims for a clear penalty against Karim Adeyemi.\nWhile Stegemann later apologised and at one point considered police protection due to the incident, Terzic was able to re-focus his side's sights on the task at hand.\n\"It's not about extraordinary things. It's about blocking out where we are and just focusing on the game,\" Terzic said Thursday.\nFormer Dortmund striker Karl-Heinz Riedle, who won two Bundesliga titles and the Champions League at Dortmund, told AFP in a conference call that Terzic had it right.\n\"You should do your normal routine and not get too involved in the other stuff,\" Riedle said, explaining \"the moment when the game starts, it's all gone.\"\n\"You can be a little nervous because you know what you can achieve and what you've got to lose. The pressure is on every player, but a good player should be able to handle this pressure.\"\nThe home side were given a boost on Wednesday, with defender and captain Mats Hummels extending his deal in Dortmund by another year.\nAs the only current member of the side to have won a league title with Dortmund, the 2014 World Cup winner's calm and experience blocking out the noise will be crucial on Saturday.\n© 2023 AFP",
  "word_count": 719,
  "scraped_at": "2026-02-14T02:24:42.732773",
  "_text_extracted": true
}