{
  "article_id": "4a23e12d2eae",
  "url": "https://www.dailyrecord.co.uk/news/scottish-news/tartan-army-munich-city-guide-32983385",
  "title": "Tartan Army Munich City Guide ahead of Germany v Scotland Euro 2024 clash",
  "date": "20240607T164500Z",
  "domain": "dailyrecord.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tartan Army Munich City Guide ahead of Germany v Scotland Euro 2024 clash\nHere's some things to see and do in Munich - where Scotland take on Germany on Friday, June 14 - from fan zones to culture.\nEuro 2024 kicks off with Germany v Scotland at the Allianz Arena in Munich on Friday, June 14. The ground, home to Bayern Munich, is also known as the Munich Football Arena.\nAhead of the clash, here's a quick guide to what to see and do in the city for the Tartan Army foot soldiers lucky enough to be heading to Munich, from fan zones and attractions to tours and pub rules.\nFan Zones\nThe city is home to the Olympiapark Fan Zone, where supporters from across the globe will come together, watching all 51 Euro 2024 matches will be broadcast live.\nEntry is free, and it is open every day from June 14 to July 14, with the matches shown on a large floating screen on Olympic Lake.\nREAD MORE: Euro 2024: Germany's booze and drug laws, from smoking cannabis to pub closing times and drinking ageREAD MORE: Czech Tartan Army in Euro 2024 pilgrimage as Scots boys and dads head to GermanyUEFA says fans can \"settle down on the grass steps, enjoy the live music from the stage and soak in the unique surroundings\".\nA host of bands, from mainstream acts to alternative groups, will perform within the arena, and there will also be health classes, such as yoga and fitness, and classes for kids.\nFor those fans wishing to play a bit of football themselves, there is a small-sided pitch with the arena, and there will also be workshops and freestylers showcasing their skills.\nOther entertainment comes in the form of an open-air cinema, performances from stand-up comedy acts, theatrical performances, poetry slams, live interviews and podcasts and eSports tournaments.\nThe Olympic Park has been home to national and international football for over three decades, hosting the 1974 World Cup and the 1988 European Championships.\nIt was first used as an official fan meeting point at the 2006 World Cup in Germany and also delighted tens of thousands of visitors with a party for the 2012 Champions League final.\nAttractions\nTrip Advisor lists Marienplatz as the top-rated attraction in the city, and says: \"This prominent public square, the largest in Munich, still stands as the center of social activity in the city, much as it has throughout history\".\nMarienplatz will also be home to the Münchner Kindl - the city's coat of arms - with the installation dressed in EURO 2024 colours, which UEFA says \"will serve as a memorable photo opportunity for fans from all over the world\".\nSix park benches, decorated in EURO 2024 colours, will also be installed at selected locations in the city, such as the old Gasteig building, the airport and Olympic Park.\nThey have the motto #hockdiher, which stands for 'sit yourself down', and UEFA says they are \"meeting points... intended to encourage people to chat to one another\" – about football or anything they choose.\nAccording to Trip Advisor, the scenic park English Garden, speciality museum Residenz, historic site Nymphenburg Palace, and BMW Museum complete the city's Top 5 must see attractions.\nPubs, Clubs and Drinking Rules\nLast orders in German pubs can vary, with states allowed to decide their own closing times, but most have periods where alcohol is not sold, known as a \"cleaning hour\".\nIn Bavaria, where Munich is, pubs and clubs normally close between 5am and 6am, with those aged between 14 and 16 able to drink beer and wine if accompanied by a parent or guardian.\nFans aged 16 or over will be able to drink beer and wine in pubs without a parent or guardian, but only those aged 18 or over can drink spirits.\nTop news stories today\nDon't miss the latest news from around Scotland and beyond - Sign up to our daily newsletter here.",
  "word_count": 661,
  "scraped_at": "2026-02-14T02:10:54.429959",
  "_text_extracted": true
}