{
  "article_id": "4a248f33b5f6",
  "url": "https://mwnation.com/will-ascent-ascend/",
  "title": "Will Ascent ascend ? - Nation Online",
  "date": "20240815T074500Z",
  "domain": "mwnation.com",
  "source_country": "Malawi",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Will Ascent ascend?\nThe stage is set for the 2024 CAF Women’s Champions League Cosafa Qualifier as eight teams, including Malawi representatives Ascent Soccer Academy battle it out at Mpira Stadium in Chiwembe, Blantyre from today to August 24.\nThe tournament kicks off with a midday fixture between Herentals Queens from Zimbabwe and FC Ongos of Namibia before 2022 champions Green Buffaloes of Zambia and University of the Western Cape of South Africa clash in another Group A tie.\nAscent Soccer are participating in the tournament for the first time after Kukoma Ntopwa Women’s Football Club became Malawi’s first representatives last year, but never made it past the group stages.\nThe Lilongwe-based outfit will kick off their campaign tomorrow against Group B opponents Young Buffaloes of E-swatini who have been to the competition three times.\nBut before they take to the pitch, the other Group B teams Gaborone United of Botswana and UD de Lichinga of Mozambique clash in an early kick-off.\nThough debutants in the tournament, Ascent have vastly experienced players that won 2023 Cosafa Women’s Championship with the Scorchers.\nThe Goshen-FAM National Women’s Football Champions contributed seven players to the squad; namely, Cosafa Most Promising Player Leticia Chinyamula, two-time Malawi Player of the Year Rose Kabzere, midfielder Faith Chinzimu, central defender Alinafe Majora, Mariam Mnenula, Maureen Kenneth and Maggie Chavula.\nAscent coach Thom Mkolongo said they expect these battle-hardened campaigners to guide the up and coming players.\nHe said: “The experienced players have the responsibility of guiding these up and coming players. This is their assignment and we are getting good feedback. The morale in camp is high.”\nMkolongo said although Ascent have home ground advantage, they will not underrate any team, starting with tomorrow’s match.\n“There is no easy group. In modern football, every team is a tough team,” he said.\nFootball analyst Patrick Zgambo in an interview said all the teams at the tournament are almost at par.\nHe said: “The women’s game in the region is growing tremendously, almost at the same rate, except for imbalanced financing. So, you can’t really get sides that are completely out of your league.”\nMeanwhile, Cosafa says it expects a successful tournament.\nCosafa chief executive officer Sue Destombes said: “I think this will be a very entertaining tournament. We are looking forward to a very interesting competition and encouraging all of the fans to come and be part of this..\nThe group stages will be played in round-robin format with the top two teams in each pool advancing to the semi-finals where the top side in Group A will take on the runner-up in Group B.\nThe final will be played on August 24 and the winner will join 2023 champions Mamelodi Sundowns who already qualified for CAF Women’s Champions League finals as defending champions.",
  "word_count": 466,
  "scraped_at": "2026-02-14T02:08:01.868598",
  "_text_extracted": true
}