{
  "article_id": "4a2e41d995b3",
  "url": "https://metro.co.uk/2026/01/26/gary-lineker-urges-arsenal-sign-81m-star-manchester-united-defeat-26526515/",
  "title": "Gary Lineker urges Arsenal to sign £81m star after Man Utd defeat",
  "date": "20260126T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Lineker has claimed it would be ‘game over’ for Arsenal’s Premier League title rivals if Mikel Arteta signed long-term transfer target Julian Alvarez.\nArsenal’s bizarre record in the final third was highlighted after Sunday’s deflating 3-2 defeat to Manchester United at the Emirates Stadium.\nThe Gunners were hoping to reclaim their seven-point lead at the top of the table after Manchester City’s win earlier in the weekend but now lead the title race by just four after losing at home for the today time this season.\nArsenal started well and took the lead through Lisandro Martinez’s own goal but were pegged back, first by Bryan Mbeumo’s equaliser and then Patrick Dorgu’s stunning strike.\nMikel Arteta’s side looked to have snatched the momentum back when Mikel Merino levelled late on but Matheus Cunha scored a brilliant winner shortly after to give caretaker boss Michael Carrick back-to-back wins.\nArsenal are top of both the Premier League and Champions League despite the fact no Gunners player has more than five goals so far this season.\nViktor Gyokeres is the club’s top-scorer but his return of five goals represents a poor return for a player Arsenal paid £64m for last summer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt was hoped Gyokeres would solve Arsenal’s goalscoring problems but the Sweden international has endured a frustrating start to his Premier League career.\nGyokeres’ struggles were highlighted last week when it emerged Arsenal were considering reviving their interest in Atletico Madrid striker Alvarez, who won two Premier League titles at Manchester City.\nArsenal were linked with Alvarez around this time last year but cooled their interest during the summer in favour of prioritising a move for Gyokeres.\nBut ex-England striker Lineker has suggested Arsenal should pursue Alvarez this summer and says his arrival in north London would be devastating for their domestic rivals.\n‘They’ve not got anyone really banging in the goals on a regular basis,’ Lineker said on The Rest is Football podcast after Arsenal’s defeat to Manchester United.\n‘Gabriel Jesus has come back and scored one or two but there was a reason they needed to sign a new No. 9 in the first place.\n‘I like Jesus and always have, he’s got a great work ethic, he chases and harries and does get a few goals. He’s a bit streaky – when he’s on he’s on but when he’s off he a bit of a confidence player.\n‘It’s probably complete b*** as most of these things are on social media but I saw they were linked with Julian Alvarez who I know is not entirely happy with life at Atletico.\n‘Now that is the sort of player you know can handle the big occasion – he’s a World Cup winner for crying out loud. Someone like that at Arsenal would be game over.\nPrefer us to the others? Then tell Google!\nAs a loyal Metro reader, we want to make sure you never miss our stories when searching for your news. Whether it is the latest politics news explained, live football coverage or a showbiz scoop.\nClick here and tick Metro.co.uk to ensure you see stories from us first in Google Search.\n‘But they do need one or two of these current forwards to start scoring on a reasonably regular basis.’\nArsenal’s defeat to resurgent United and Manchester City’s victory over basement boys Wolves means the gap at the top of the Premier League is now just four points.\nBukayo Saka said the United loss was ‘tough to take’ but urges his teammates to ‘stick together’ as they bid to end Arsenal’s 22-year wait for a league title.\nMore Trending\n‘I think we didn’t show our best level for the full game, which is frustrating,’ Saka said. ‘It’s such a big game with a lot riding on it.\n‘Obviously, the Emirates has been a place where we’ve been so strong this season. It’s a tough loss to take, but we have to stick together. We go again next week; we’ll try and get back to winning ways.\n‘In football, you can score, you can concede – it’s your reaction after it. Obviously, we would have wanted to make it 2-0, but we didn’t. Overall, we’re just not too happy with the performance.’\nArsenal face Champions League minnows Kairat next while Manchester United return to Premier League action next weekend against Fulham.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: The games Patrick Dorgu will miss as Man Utd suffer devastating injury blow\nMORE: Mikel Arteta’s former teammate defends struggling Arsenal star – ‘I love him’\nMORE: Aston Villa in talks to beat Chelsea to sign Brazil international",
  "word_count": 836,
  "scraped_at": "2026-02-14T01:53:15.580815",
  "_text_extracted": true
}