{
  "article_id": "4a36b7cea139",
  "url": "https://gamerant.com/dandadan-evil-eye-review/",
  "title": "DANDADAN : Evil Eye Review",
  "date": "20250607T133000Z",
  "domain": "gamerant.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The following contains spoilers for DANDADAN: Evil Eye. Proceed with caution.\nSummary\n- DANDADAN: Evil Eye is a brilliant anime theatrical release highlighting the Evil Eye arc with stunning visuals and direction.\n- The desaturated color scheme serves to characterize the eerie Daija Town and Byakuja Village, while dynamic animation lives up to, and even supercedes that of the first season.\n- The Tsuchinoko and Evil Eye antagonists set up for a thrilling battle at the end of the film, the conclusion to which we will have to wait until July to witness.\nThe theatrical release of DANDADAN: Evil Eye, the compilation film of the first three episodes of the second season of DANDADAN officially released on May 30, and on June 6 in North America. The film continues the Cursed House arc where Momo and Okarun investigate the strange happenings in Jiji's house that left his parents hospitalized, uncovering a centuries-old secret about the house, and about the sleepy but eerie Daija Town where the Kito family has ruled for generations.\nWith brilliant visuals that do something a little different from the first season, triumphs in direction and a stellar third act, DANDADAN: Evil Eye is emblematic of what an anime theatrical release is meant to do, as it brilliantly brings to life the Evil Eye arc from Yukinobu Tatsu's hit manga. GameRant got the opportunity to watch a preview screneer of DANDADAN: Evil Eye in May, and with it finally officially out in theatres, it's review time.\nDANDADAN: Evil Eye Premiere Proves to Be a Roaring Success\nGKIDS' World Premiere of DANDADAN: Evil Eye on Thursday meant that North American fans were the first to experience the theatrical release.\nFirst Things First: The Recap\nDANDADAN: Evil Eye Begins With a Refresher on Season 1\nThe first twenty minutes or so of the DANDADAN: Evil Eye film serve as a quick refresher on the events of the first season of the anime, from Momo and Okarun's first encounter with aliens and the supernatural, to each of their subsequent battles since. The recap is nicely paced, without giving too much priority to any one moment in the first season, and while it could have been easier to just cut together a bunch of scenes and call it a day, what makes even the recap enjoyable is Momo's narration of the events that took place. The recap doesn't take up too much time and it quickly segues into the main event: the continuation of the Cursed House arc, which was left on a terrible cliffhanger at the end of the first season of DANDADAN.\nTurbo Granny to the Rescue\nAddressing the Cliffhanger\nAt the end of the first season, Momo decides to take advantage of being in a hot spring town and goes to take a bath, where the male members of the Kito family appear and have nefarious intentions. However, thanks to Turbo Granny sneaking into Momo's belongings back when she overheard them talking about going to investigate Jiji's house in Daija Town, Momo is saved from a terrible fate as Turbo Granny unleashes her power all at once, flinging the Kitos all around and causing major destruction to the hot springs to reveal a gorgeous view of the surrounds, and a volcano in the distance.\nMomo escapes unscathed, but the incident is just one of many involving the Kitos, who have a ghoulish complexion that almost serves as a visual cue that they have something critically wrong with them. One of the biggest things that is noticeable about DANDADAN: Evil Eye is the desaturated colour scheme present throughout the film, which, according to season 2 co-directors Fuga Yamashiro and Abel Gongora, was inspired by Japanese horror and is to highlight a certain eeriness to the sleepy town while contrasting the bright colours prevalent throughout the first season of the DANDADAN anime, and the greyish hue to the Kito family seems to be leaning into this.\nOkarun and Jiji's Discovery\nJiji's Landlords Come and Go As They Please\nWhile Momo is out, Jiji and Okarun are left to bond, and do so over a kickabout with a football, an element that becomes very important later on. While outside, they notice a strange part of the house that appears to be a room of sorts, but there's no door in the house leading to that area. When they break through the wall, they discover an ominous-looking room with talismans all around. It clearly was never meant to be found. However, they must halt their investigation as the Kito family, Jiji's landlords, arrive in droves, and in a manner connected to Momo's earlier attack, these people are domineering. It's evident in how comfortable they are in imposing on Jiji's space, because they \"let\" him live there rent-free after his parents' hospitalization that they have a sense of entitlement that we soon learn goes beyond Jiji's house.\nWe're treated to the first somewhat proper fight of DANDADAN: Evil Eye when Momo finally returns from the bath after taking the time to explore more of Byakuja Village, running into a shrine where she learns that there are people there who believe in offering sacrifices to a fabled serpentine beast called a \"Tsuchinoko\" to prevent disasters like volcanic eruptions. Hilariously, the shrine caretaker, despite having a snake skin relic to symbolize the region's relationship to this ancient beast, doesn't believe in its existence at all.\nHaving learned this, Momo puts two and two together and heads back to Jiji's house, only to find some of the creeps who attacked her casually sitting with Okarun and Jiji, and this is one of the first moments in the film that standout for their fluidity in motion, as well as the sheer hilarity of the Kito grandma naming her Kung-Fu styled attacks after celebrities like Jennifer Lopez and overall being an absolute menace. The combination of humour and conflict is brilliantly done and feels emblematic of the action-comedy that DANDADAN does best.\nGoing Underground\nNot One, But Two Major Antagonists\nThe battle Momo engages in against the Kito family ends with the three of them being tied up and presented to the first major antagonist of the Cursed House arc: the Tsuchinoko, which Okarun identifies as a \"Mongolian Death Worm\". The Kito family has been sacrificing people who lived in Jiji's house to this beast for several generations, with the current generation witnessing the giant worm for the first time in their attempt to sacrifice Jiji, Okarun, and Momo. The Death Worm feeds by emitting a psychic wave that causes those who experience it to become violently suicidal. Jiji is the only one unaffected by it at first, but their problems don't end with the Death Worm, as a strange entity, the very one Jiji had been seeing in his house that had been keeping him awake on several nights appears, counteracting the psychic waves with some of its own. The greatest part of DANDADAN: Evil Eye is in the way Jiji is connected to the evils that have taken place in and under his home, and how the emergence of the entity – the Evil Eye, features a vibrant change from the desaturation of the early parts to a blue-violet colour scheme.\nMuch like Turbo Granny and some of the other entities presented throughout DANDADAN, the Evil Eye is not simply a malicious entity, but the manifestation of the Kito family's consistent disregard for human life and a small child's attempt at preventing further tragedy. The way we are given a foray into the horrific existence of the Evil Eye prior to becoming what it is now, is another element of DANDADAN as a whole that make it a truly exceptional series, and when it comes to DANDADAN: Evil Eye, the events that take place after Jiji allows himself to be possessed by the Evil Eye as a result of his compassionate nature give him the kind of main character treatment he'd have if he were the protagonist of any other supernatural shōnen. His movements while possessed are athletic, flexible, and most importantly, reflective of his love for football and the Evil Eye's once denied desire to play with other kids before his senseless sacrificial murder. The parallel between the Evil Eye-possessed Jiji's fight against Okarun, and their earlier football passabout is particularly brilliant for Jiji's characterization. The movements are, as exaggerated as they are, proof of the production team's attention to detail, and the colour scheme, while similar, is by some miracle, unrelated to Jiji's love for French football team (and Champions League winners) Paris Saint-Germain.\nGreat For Hype, Yet Not-So-Conclusive\nDANDADAN: Evil Eye's Cliffhanger\nDANDADAN: Evil Eye is a great taste of what we can expect from the second season, with brilliant direction, amazing art and cinematography, great character development for Jiji, and amazing, dynamic and fluid animation, but just like the last episode of the first season, it simply isn't conclusive. We don't get to see the Evil Eye arc in its entirety, although we do get quite far into things, which is great for building anticipation, but once you realize that you still have to wait a month for the rest of it, it can feel a little disappointing. However, with the second season set to broadcast on July 3, and the definite proof of its brilliance in the form of DANDADAN: Evil Eye, the lack of a conclusive ending to the arc over the course of the compilation film's runtime is a small concern.\nThe deliberate use of contrasting colours, with the yellowish earthen tones for the Tsuchinoko, and the violet hue engulfing the screen when the Evil Eye appears and possesses Jiji are just some of the ways in which the visuals augment the story being told; while the animation and high stakes of the final battle between Okarun and Jiji create a palpable excitement for what's to come. The soundtrack by kensuke ushio makes the scenes even more engrossing, showcasing his genius as a composer. One thing's for sure: DANDADAN season 2 is going to be a definite banger, and I can't recommend going to watch the theatrical release of DANDADAN: Evil Eye even just for the hype alone.\nFinal score: 4.5/5 stars\n- Release Date\n- 2024 - 2025-00-00\nCast\n-\nNatsuki HanaeKen Okarun Takakura\n-\nShion WakayamaMomo Ayase\nBased on Yukinobu Tatsu's popular manga that debuted in 2021 on Shonen Jump+, Dandadan blends action, comedy, romance, and supernatural thrills to create a unique and satisfying adventure. Momo Ayase and Ken Takakura believe in the extraordinary, although the former believes in ghosts and the latter believes in aliens. Determined to confirm their side's existence, they set out to find their proof.",
  "word_count": 1782,
  "scraped_at": "2026-02-14T02:24:07.900767",
  "_text_extracted": true
}