{
  "article_id": "4a72f6ccbe60",
  "url": "https://www.90min.com/best-defenders-of-all-time",
  "title": "Best defenders of all time",
  "date": "20240410T231500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 50 Best Defenders in Soccer History—Ranked\nIn soccer, defenders rarely get the glory.\nInstead, it’s the strikers, the midfield maestros, and wingers with their dazzling dribbling that usually get the plaudits.\nEven the goalkeepers tend to get more credit than the back four. After all, who would remember a seemingly innocuous but perfectly-timed tackle over a diving save that stops the ball going into the top corner?\nHere at Sports Illustrated, however, we think it’s about time someone gave these unsung heroes their dues. So, with that being said, here’s our list of the top 50 soccer defenders of all time.\n50. Antonio Cabrini\nThe Juventus teams of the 1970s and ’80s were ones always brimming with attacking talents like Marco Tardelli, Michel Platini, Paolo Rossi and Zbigniew Boniek.\nAntonio Cabrini, meanwhile, was the rock at the back.\nIn 13 years with the Old Lady, Cabrini won six Serie A titles, two Coppa Italias, and one European Cup.\nHe was also a vital member of the Italy team that won the 1982 World Cup, ending the Azzurri’s 48-year wait for soccer’s greatest prize.\n49. Jürgen Kohler\nJürgen Kohler won major honours with Bayern Munich, Juventus and Germany’s national team during his career, but it’s at Borussia Dortmund where he is regarded as a soccer “God.”\nArriving at the club as a 30-year-old in 1995, Kohler went on to spend seven years on the Ruhr, helping Dortmund win two Bundesliga titles, two German Super Cups, and a first-ever Champions League.\n48. Walter Samuel\nInter Milan were one of the most dominant sides in the game in the noughties, and a huge part of their success was having an almost impenetrable defensive line, at the heart of which lied Walter Samuel.\nThe Argentine was a brick wall in defense. Quick, powerful, an expert at making goal-saving tackles, and, according to Inter teammate Javier Zanetti, the “hardest player” he ever shared the pitch with.\n47. Pepe\nAttackers (and opposition fans) simply hated coming up against Pepe, which is about as big as compliments come for defenders.\nTough, tenacious and a little bit terrifying, the Portuguese legend enjoyed successful domestic spells with both Porto and Real Madrid, the latter with whom he won a trio of La Liga and Champions League titles.\nPepe also helped Portugal win the 2016 European Championships, where he was named as the player of the match in the final, as well as the inaugural UEFA Nations League in 2019.\n46. Ruud Krol\nIn order for Ajax and Johan Cruyff’s free-flowing “Total Football” to work in the 1970s, the team needed defenders who were capable of not only stopping opponents, but could also transition between positions freely and were comfortable with the ball at their feet.\nRuud Krol was exactly that.\nAs a testament to his talents, Cruyff named Krol as one of the three best defenders of all-time in his 2016 autobiography “My Turn,” alongside Carlos Alberto and Franz Beckenbauer.\n45. Marcelo\nHaving won an astonishing 25 trophies with Real Madrid, Marcelo is one of the most decorated players in soccer history.\nThe Brazilian spent the last of his 15 years at Madrid as the club’s captain, becoming the first non-Spaniard to wear the armband in 97 years.\n44. Lucio\nLúcio was truly one of a kind.\nA physical specimen renowned for his strength in the tackle, speed, and aerial ability, he also possessed an uncanny ability to carry the ball out defence with powerful, galloping runs, which earned him the nickname, “The Horse.”\nOnce on one of those trademark runs, the former Inter Milan and Bayern Munich star was nigh on impossible to stop. When coupled with his capacity to score from distance, they also made him a serious offensive threat.\n43. Jordi Alba\nJordi Alba ranks among the finest fullbacks in Spanish soccer history.\nDiminutive yet technically gifted and extremely mobile, the jet-heeled defender roamed up and down the left flank for fun, both effectively stopping opposition wingers and providing deliciously dangerous deliveries into the box at the other end of the pitch.\nA European champion at both club and international levels, he won 16 major honours during his time with Barcelona, including six La Liga titles. To cap off a glittering career, Alba reunited with his favourite teammate, Lionel Messi, to win MLS Cup at Inter Miami in his final ever professional appearance.\n42. Nemanja Vidic\nEvery bit as tough and intimidating as his appearance suggested, Nemanja Vidić was a relentless opponent for Premier League forwards during his eight seasons at Manchester United.\nThe Serbian defended like his life depended on it, which, rather ironically, often led to him laying it on the line to stop the opposition, putting his head into places it really had no place being.\n41. Thiago Silva\nHaving already conquered Brazil, Italy and France, Thiago Silva was the ripe old age of 36 when he moved to Chelsea in 2020.\nProving age is just a number, however, his mature performances at the heart of the Blues’ defence helped the club win the Champions League in his debut season.\nHe continued to star at Stamford Bridge for three more years before eventually calling it quits and returning to Fluminense, where he once again defied the ageing process to play a key role in helping his boyhood club escape relegation from Brazil’s top flight.\n40. Alan Hansen\nWhile working as a pundit post-retirement in 1995, Alan Hansen famously rubbished Manchester United’s “Class of ’92,” claiming after a 3–1 defeat to Aston Villa that “you can’t win anything with kids.”\nThat same United side went on to win both the Premier League and FA Cup that season, leaving the Scotsman red in the face.\nIn his own playing days, however, Hanson rarely ever put a foot wrong.\nA rock solid centre back, he won eight league titles and three European Cups with Liverpool from 1977–90.\n39. Jose Santamaria\nJosé Santamaría is one of Real Madrid’s original Galácticos.\nPlaying alongside the likes of Alfredo Di Stéfano, Paco Gento and Ferenc Puskás, the Uruguayan defender helped Los Blancos win six La Liga titles and four European Cups in just nine years.\nNicknamed “The Wall,” Santamaría also won five league titles in Uruguay with Nacional.\n38. Djalma Santos\nWhen people think about the Brazil team that won the 1958 and 1962 World Cups, it’s Pelé, Garrincha and Didi that are the names that typically spring to mind, not Djalma Santos.\nThe defender, however, was arguably the Seleção’s most consistent performer across those two tournaments, being named in FIFA’s All Star team on both occasions.\nSantos also won a glut of domestic honours in Brazil during his career, and, quite astonishingly, was never sent off in over 1,000 games for club and country—which serves as a testament to his composed and consistent performances at right back.\n37. Ricardo Carvalho\nRicardo Carvalho followed Portuguese manager José Mourinho almost everywhere he went, acting as his most trusted defender during trophy-laden spells at Porto, Chelsea and Real Madrid.\nIn some ways, the two were very similar—both hard nosed, tactically astute and ready to win at all costs, even if it wasn’t necessarily pretty.\nIn other ways, they were distinct opposites. While Mourinho was, and remains, known for his loud mouth rants, Carvalho was quiet and unassuming, instead letting his game do the talking.\n36. Laurent Blanc\nLaurent Blanc claimed club silverware with Manchester United, Barcelona, Auxerre and Montpellier during his career, while he was also part of the France teams that won the World Cup in 1998 and European Championships in 2000.\nBefore he became one of the most dominant centre backs in world soccer, however, he used to play as an attacking midfielder, once scoring 18 goals in a single season.\n35. Gianluca Zambrotta\nGianluca Zambrotta was the sort of player every manager wants in their team.\nHugely versatile, as consistent as they come and solid in both attack and defence, the Italian won major honours with Juventus, Barcelona, Milan and Italy during his career, including the World Cup in 2006.\n34. Marius Trésor\nFormer France centre back Marius Trésor stood out as one of Les Bleus' brightest stars in the era before the golden generation of the 1980s, shining at the 1978 and 1982 World Cups.\nTrésor’s career was not defined by honours. He would win a single Coupe de France with Marseille before finishing his career at Bordeaux with his first and last Ligue 1 title. But he boasted a talent worthy of a far bigger trophy cabinet.\nPossessing an intoxicating blend of nonchalance and ferocity, Trésor would relish crunching into tackles with his socks rolled around his ankles.\n33. Gerard Pique\nIt’s an age-old adage, but Gerard Piqué was the Robin to Carles Puyol’s Batman for both Barcelona and Spain.\nWhile Puyol was the valiant and vocal leader, Pique was the strong, smart and savvy sidekick who was always there to lend a hand and provide some much-needed tactical sense when Puyol had flown off on one of his crime-stopping adventures.\n32. Vincent Kompany\nVincent Kompany joined Manchester City in 2008 for a fee of just $7.5 million, just a month or so before Sheikh Mansour’s big money takeover.\nBut despite the club going on to spend hundreds of millions on new players, defenders included, in the years that followed, the bargain Belgian remained one of its most important players—both because his own performances and his ability to inspire others.\nIn 11 years at Etihad, eight of which he was captain, Kompany won four Premier League titles, two FA Cups and four EFL Cups, while he was also named as the Premier League’s Player of the Season in 2011–12.\n31. Ashley Cole\nFew players in the history of the game have ever been able to stop Lionel Messi.\nFormer Chelsea defender and Arsenal invincible Ashley Cole is one of them.\nThe Argentine never netted a goal or won a game against the Blues when Cole was his opposing number, with the Englishman often keeping him quiet with a combination of hard-hitting tackles, tireless pressing and smart positioning.\nCristiano Ronaldo once also described Cole as the toughest opponent he’s ever faced, saying: “He does not give you a second to breathe.”\n30. Rio Ferdinand\nAt a time when most Premier League centre backs were bruisers who liked to lump the ball long, Manchester United’s Rio Ferdinand stood out like a sore thumb thanks to his composure on the ball and ability to step out of defence and find a pass.\nOne of those bruisers, Nemanja Vidić, was his partner in crime at Old Trafford, and together, their perfect combination of brains and brawn was one few attackers could handle.\nA five-time Premier League champion and a Champions League winner, Ferdinand was Europe’s best centre back at his peak.\n29. Gaetano Scirea\nGaetano Scirea was a key figure in the legendary Juventus team of the 1970s and ’80s, and is widely regarded as one of the greatest Italian defenders of all time.\nHe amassed an astounding 14 major trophies during his career with Juve and the Italian national team, and was renowned for his elegance and composure on the field.\nScirea didn’t so much as rob opponents of the ball as persuade them to willingly give it to him, slipping his business card in the elastic of their shorts as he strode up the pitch.\n28. Andreas Brehme\nDescribed by former club Inter Milan as the “most legendary two-footed player in history,” Andreas Brehme left an indelible mark on the Italian game during his four years with the Nerazzurri.\nNot only did the versatile defender help Inter win a first Serie A title in almost a decade and a European Cup, in 1989, he also beat none other than the legendary Diego Maradona to the division’s Player of the Year award.\nBrehme was also a star for Germany as they won the World Cup in 1990, scoring the only goal in the final as Franz Beckenbauer’s side beat Argentina.\n27. Diego Godín\nHaving cost Atlético Madrid just $8.4 million back in 2010, Diego Godín can lay claim to being one of the best value-for-money signings in modern history.\nThe Uruguayan centre back made almost 400 appearances for the club, helping the proud underdogs win a host of major honours, including La Liga, the Copa del Rey and two Europa Leagues.\nA man-mountain at the back and vocal leader on the pitch, Barcelona icon Gerard Piqué fittingly described Godín as the “centre back of a generation” upon him leaving Spain in 2019.\n26. Dani Alves\nDani Alves is one of the most decorated players of all time winning 43 trophies in his career. A stalwart of Pep Guardiola’s great Barcelona team would leave the Catalan capital in 2016 to embark upon a trophy-laden conclusion to his playing career.\nThe champion of Italy with Juventus and two-time Ligue 1 title winner at PSG even made his way back to Barcelona for a brief spell between 2021–22.\n25. Jaap Stam\nWhile a gentle giant off the field, Jaap Stam was an animal on it.\nFast, strong, aggressive and never one to back down from a confrontation, the Dutchman truly struck fear into the hearts of his opposing forwards. Just ask Pietro Parente.\nTestaments from his former Manchester United teammates showcase best just how good, and scary, he was.\n“He wasn’t somebody you wanted to cross, he was a real animal on the pitch,” Paul Scholes once said of Stam.\nRyan Giggs, meanwhile described him as a “man-mountain, but as quick as a Ferrari,” while Peter Schmeichel called him “one of the best ever defenders.” We’d have to agree.\n24. Giacinto Facchetti\nGiacinto Facchetti was a member of Helenio Herrera’s legendary Inter Milan team, known as “Grande Inter,” that won four Serie A titles, a Coppa Italia and two European Cups from 1960–67.\nThe legendary fullback also captained Italy to their first ever European Championship on home soil in 1968.\nAhead of his time in terms of his technical ability, Facchetti was a frequent scorer of goals, too, managing no less than 78 for club and country during his career.\n23. Fernando Hierro\nReal Madrid legend Fernando Hierro first joined the club in 1989, and for the next 14 years, was its spiritual captain, even if he didn’t always wear the armband.\nA composed and intelligent figure in central defence, he steered Los Blancos to five La Liga titles and three Champions Leagues.\nPerhaps most impressively, however, post the turn of the century, he still stood out as an integral figure in a side that contained a flock of expensive superstars such as Ronaldo, David Beckham, Luis Figo and Zinedine Zidane.\nA Galáctico by nature, but not by price.\n22. Matthias Sammer\nMatthias Sammer started his career in 1985 as a midfielder, but it wasn’t until he was converted to a centre back by Borussia Dortmund coach Ottmar Hitzfeld in 1994 that he fulfilled his potential.\nFollowing the shift, Sammer established himself as the world’s best “libero,” a unique roll which allowed players to sweep up behind their fellow defenders before launching attacking moves from deep. In this position, Sammer won consecutive Bundesliga titles with Dortmund in 1995 and 1996, before then captaining the club to their first Champions League in 1997.\nHe also won the European Championship with Germany in 1996 and the Ballon d’Or the same year.\nSammer’s time at the top was short but sweet, however, as he was forced to retire through injury in 1998.\n21. Giorgio Chiellini\nGiorgio Chiellini would not stop at anything to win.\nWhether playing with a busted head, a broken nose or a twisted ankle, he would still continue to perform at the highest level, steering Italy and Juventus to win after win, and trophy after trophy.\nFrom leaving a dangling leg in a tackle, to simply grabbing opposition players by the scruff of the neck and saying: “You’re not going anywhere, son” (presumably in Italian), Chiellini was also a master of the game’s dark arts.\nSome, most notably England fans, would call it cheating, but he, like many other great defenders, would call it gamesmanship.\n20. Marcel Desailly\nMarcel Desailly was known as “The Rock” thanks to his consistency, strength and no-nonsense playing style (rather than any WWE references).\nThe first player to ever win back-to-back Champions Leagues with different clubs, he first scooped the prize with Marseille in 1993, helping the Ligue 1 side beat AC Milan in the final.\nMilan, clearly impressed, then brought him to San Siro just a few months later, where he won the title again, this time scoring the Rossoneri’s final goal in a 4–0 thumping of Barcelona.\n19. Carlos Alberto\nA frenetic force down the right flank, Carlos Alberto captained Brazil as they won the World Cup in 1970.\nHis goal in the final, which saw him finish off a sublime team move by rocketing the ball into the bottom corner with the outside of his boot, is widely regarded as one of the greatest in the sport’s history.\n18. Daniel Passarella\nFabio Cannavaro was small, but Daniel Passarella was tiny—at least for a centre back.\nJust like the Italian, however, that didn’t stop him from being one of the world’s best during his pomp.\nTough as nails and boasting great ball-playing skills and surprisingly good aerial abilities, Passarella won two World Cups with Argentina, as well as seven league titles in his home country with River Plate.\nHe was also a potent goalscorer, finding the net 175 times during his career.\n17. Fabio Cannavaro\nFabio Cannavaro is only non-German defender ever and the only defender this century to win the Ballon d’Or, having scooped the prize in 2006 shortly after captaining Italy to World Cup glory.\nThough just 5'9\" tall, what the diminutive Italian centre back lacked in height, he more than made up for in ability, boasting supreme tackling skills, lightening quick pace, and surprising strength.\nCannavaro also read the game brilliantly and was renowned for carrying the ball out from the back, qualities that are now widely considered as must-haves for modern defenders.\n16. Javier Zanetti\nFew things are as heartwarming to soccer fans than a player who spends almost his entire career with one club, which is exactly what Javier Zanetti did with Inter Milan, stepping out a record 858 times for the Nerazzurri between 1995 and 2014.\nHis longevity and commitment to Inter, however, are just two of the reasons why he can be considered one of soccer's greatest-ever defenders.\nAn impeccable defender with a second-to-none work rate and a deep understanding of the game, Zanetti won everything on offer with Inter, including an historic European treble in 2009-10.\n15. Lilian Thuram\nA published author, UNICEF ambassador and anti-racism activist—Lilian Thuram is perhaps among the game’s smartest players.\nOn the field, he played with similarly impressive intelligence, which, when combined with his warrior-like mindset and hulking frame, made him a force to be reckoned with in defence.\nA serial winner, the aptly named “Philosopher” won major trophies with Parma, Juventus, Barcelona and France—including the World Cup in 1998.\nAt that tournament, Thuram scored both of France’s goals in a 2–1 win over Croatia in the semifinals. They were his only two goals for the national team in 142 games.\nTalk about coming showing up when it matters.\n14. Ronald Koeman\nNo defender in the game’s history has ever been as good at putting the ball in the back of the net as Barcelona and Netherlands legend Ronald Koeman, who scored no less than 253 goals during his 17-year long career.\nOf all his goals, none is more memorable, nor important, than his iconic strike in the 1992 European Cup final, which saw him fire in a trademark free-kick from 25-yards out to secure Barca a 1-0 win over Sampdoria.\n13. Roberto Carlos\nDo a quick internet search for Roberto Carlos and no doubt one of the first things that will come up will be his famous free-kick against France in 1997, which saw him cannon the ball into the net with the outside of his boot from no less than 40 yards out.\nThe Brazilian, however, was much more than just a free-kick wizard.\nUndoubtedly the most offensive-minded left-back in the history of the game, the former Real Madrid star was a menace in the final third thanks to his mazy dribbles, whipped crosses and thunderous left foot.\n12. Alessandro Nesta\nIt feels a bit weird to call Alessandro Nesta unlucky. He’s a World Cup, two-time Champions League and three-time Serie A winner. He was also named Serie A Defender of the Year four times.\nSo was he really unlucky? Given that he missed pretty much two whole years of his career to injury, including one whole World Cup campaign and the most part of two others, yes.\nGraced with strength, speed and technical ability, he would probably be number one on this list had he always been fit.\n11. Virgil van Dijk\nIt’s often difficult to place current stars on lists of all time greats, but Virgil van Dijk has already done more than enough to warrant his place here.\nWhile his physical attributes (the Dutchman stands at 6'4\" and is insanely quick) are obviously useful when it comes to defending, it’s his reading of the game and composure that make him truly elite level centre back.\nHe is, in the words of former Liverpool teammate James Milner, a “Rolls Royce” of a defender—classy, elegant and coveted by the filthy rich all over the globe.\n10. John Terry\n“Captain, Leader, Legend.”\nThat's what a banner hanging from the stands at Stamford Bridge dedicated to former Chelsea captain John Terry reads, and it's extremely accurate.\nA graduate of Chelsea's academy, the Englishmen won it all with his boyhood club, captaining the Blues to five Premier League titles, four FA Cups, three League Cups, a Europa League and a Champions League before his retirement in 2018.\nKnown for his immense leadership qualities, never-say-die attitude, and willingness to, quite literally, put his life on the line to stop opponents scoring, Terry also has the most clean sheets of any player in Premier League history, and is the division's highest-scoring defender.\nThe Premier League's best-ever center back, without a doubt.\n9. Philipp Lahm\nPhillip Lahm was the sport’s first great inverted fullback—meaning rather than just simply fulfilling his traditional defensive duties, he also transitioned into a midfielder when his team was in possession.\nIt’s a role that few can do well, but Lahm made it look easy thanks to his ability to play with both feet, superior positional awareness and acute eye for a pass.\nOnce hailed by the great Pep Guardiola as one of the “best players ever,” the Bayern Munich and Germany legend retired in 2017 as an eight-time Bundesliga champion and World Cup winner.\n8. Carles Puyol\nIt’s the attackers and midfielders, notably David Villa, Andrés Iniesta and Xavi Hernández, who tend to get most of the credit when it comes to the all-conquering Barcelona and Spain teams of the late noughties and early 2010s.\nTheir defences, led by the unshakeable Carles Puyol, however, were just as important.\nPerhaps the greatest captain the game has ever seen, the lionhearted leader and his unmistakable mane always set the standard for his teammates, fighting for every ball and leaving blood, sweat and tears out on the pitch every game.\n“He gave 100%,” former Barca player and manager Johan Cruyff once said of Puyol. “That allowed the team to enjoy itself. Barcelona needed someone like him, someone with his way of being.”\n7. Sergio Ramos\nLove him or loathe him, there is no denying Sergio Ramos’s greatness.\nA combative and tenacious defender, the Spaniard helped Real Madrid win five La Liga titles and four Champions Leagues between 2005–21, while for his country, he won the European Championships in both 2008 and 2012, as well as the World Cup in 2010.\nHe’s also one of the sport’s greatest-ever goalscoring defenders, having found the net over 140 times during his career. As Ramos said himself, he has a “striker’s soul.”\nHis abysmal disciplinary record, however, does somewhat taint his legacy.\n6. Cafu\nAs you’ve probably figured out by now, Brazil has been responsible for producing some truly great fullbacks over the years.\nCafu was the best of the bunch.\nThe Roma and Milan legend, who captained Brazil to the World Cup in 2002, was the complete right back, equally astute in both attack and defence, while also possessing the perfect blend of intelligence, technical skill and flair.\nHis ability to sprint up and down the wing for the entirety of games was also a sight to behold, with his constant overlapping runs never giving the opposition a moment to rest.\n5. Paul Breitner\nOne of Germany’s most revered-ever left-backs, Paul Breitner lifted the World Cup in 1974, and enjoyed huge domestic success with Bayern Munich, winning five Bundesliga titles and a European Cup across two spells with the club.\nHis time away from Bayern was spent with none other than Real Madrid, with whom he also lifted two league titles.\n4. Bobby Moore\nGiven he scored (or at least so he claimed) 1,283 goals during his career, it’s safe to assume that Pelé knew a thing or two about attacking and how to get past defenders.\nBobby Moore, he once said, was the best he ever came up against.\n“Bobby Moore was my friend as well as the greatest defender I ever played against,” Pelé said of the England legend, who famously captained the Three Lions to World Cup glory in 1966.\n3. Franco Baresi\nFranco Baresi possessed every single quality you can ask for from a defender: speed, strength, versatility, a gigantic leap, passing skills, an ability to read the game, leadership qualities, and more.\nYou name it, he had it. Just ask his former Milan teammate Ruud Gullit.\n“A leader at the back, very strong and quick, with an excellent understanding of the game,” Gullit once said of Baresi, who between 1978–96 helped Milan win six Serie A titles and three European Cups.\n“As a defender, he could do everything,” the Dutchman gushed. “A lot of the time, he would know what the attacker was going to do before they knew themselves! How do you get past someone like that?”\nGood question, Ruud. Good. Question.\n2. Paolo Maldini\nPaolo Maldini won 26 trophies during a glittering 25-year career with AC Milan, including seven Serie A titles, five Champions Leagues and one Coppa Italia.\nBut it’s more than just his impressive trophy cabinet that makes him one of the game’s greatest ever defenders.\nSeemingly always one step ahead of everyone else around him, the Italian played the sport as if it was a chess match—pre-empting his opponents’ moves and planning his own so that he was always in the right position.\nIn fact, Maldini considered it a “mistake” if he had to make a tackle, averaging less than one each game throughout his career, according to some estimations.\nThat’s what you might call, a checkmate.\n1. Franz Beckenbauer\nFrankz Beckenbauer wasn’t just a center back—he was the complete player.\nWidely regarded as the pioneer of the modern sweeper role, he was not only a master at halting opposing forwards, but also excelled further up the pitch, able to both orchestrate the play from midfield and find the net himself.\nA legend for Germany and Bayern Munich, Beckenbauer’s illustrious career saw him win nearly every major honour: the World Cup, European Championship, European Cup, and multiple Bundesliga titles. He also claimed the Ballon d’Or twice, first in 1972 and again in 1976.\nREAD MORE ON THE GREATEST IN SOCCER\nBarnaby Lane is a highly experienced sports writer who has written for The Times, FourFourTwo Magazine, TalkSPORT, and Business Insider. Over the years, he's had the pleasure of interviewing some of the biggest names in world sport, including Usain Bolt, Rafael Nadal, Christian Pulisic, and more.",
  "word_count": 4670,
  "scraped_at": "2026-02-14T01:54:34.171708",
  "_text_extracted": true
}