{
  "article_id": "4a80e906a5c9",
  "url": "https://www.90min.com/features/power-rankings-the-best-teams-in-europe-week-7-2024-25",
  "title": "Power Rankings : The best teams in Europe",
  "date": "20241010T081500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Power Rankings: The best teams in Europe - Week 7\n- 90min ranks the 10 best teams in European football after week seven of 2024/25\n- Arsenal, Man City and Liverpool continue to win\n- Robert Lewandowski starred for Barcelona\nBad news folks: yet another international break is upon us. And, sadly, that means that club football has been paused for a couple of weeks.\nWhile that is terrible news, the break gives us a bit of time to reflect on what we've seen around Europe so far this season.\nSo far, it's been a pretty great season of European football. Last week alone we saw top clubs spurn massive leads (Tottenham Hotspur and Bayer Leverkusen), star players score stunning goals (Vinicius Junior) and veteran strikers rolling back the years (Robert Lewandowski).\nAfter all of that fun, here's our rankings for the top ten teams in Europe right now.\n10. Bayer Leverkusen (down 5)\nBayer Leverkusen have been as fun as ever so far this season, but not quite as effective as previously.\nXabi Alonso's men defensive deficiencies have been an issue, and they reared their ugly head over the weekend when Leverkusen gave up a two goal lead at home to Holstein Kiel.\nThe goals were the 11th and 12th that Leverkusen have conceded in just six Bundesliga games. That's quite bad.\n9. PSV Eindhoven (re-entry)\nSpoiler alert: PSV Eindhoven are one of two teams on this list to have won every single one of their league games in 2024/25.\nThe Dutch giants made it eight wins from eight in the Eredivisie with a 2-1 win over Sparta Rotterdam at the weekend. Nice one.\n8. Real Madrid (-)\nIf you've watched Real Madrid at all this season, you'll be well aware that things haven't quite clicked for the Kylian Mbappe-led attack.\nThat being said, through the sheer individual talent of their players, they're still winning games. The victory over Villarreal at the weekend was yet another in which a moment of brilliance from a star player - this time Vinicius Junior - was enough to see Madrid over the line.\n7. Juventus (down 5)\nJuventus' stunning 3-2 win over RB Leipzig in the Champions League made fans exclaim: \"we're back, baby!!!!\"\nJuventus' rather disappointing draw with Cagliari in Serie A made fans exclaim: \"we're still a work-in-progress, baby!!!\"\nThe latter exclamation is a better representation of where Thiago Motta's new-look Juve are right now.\n6. Sporting CP (-)\nThe other team on this list who have won every single league game thus far this season is Sporting CP.\nAnd considering the fact that they've scored 27 goals and conceded just two in Liga Portugal in their first eight games, it's easy to see why they have a 100% record.\nThat is ridiculous form.\n5. SSC Napoli (new entry)\nHis stock may have plummeted thanks to his spell at Tottenham Hotspur, but Antonio Conte is still one of the best managers in the world.\nProof of that statement can be found in the fact that Conte has taken a Napoli team which finished 10th in Serie A last season to first place heading into the season's second international break.\nAnd he's done it by signing Scott McTominay and Romelu Lukaku. Remarkable stuff.\n4. Barcelona (up 4)\nIt's fair to say that everyone who wrote Robert Lewandowski off after a down 2023/24 campaign looks pretty stupid right about now.\nThe Poland international have been back to his very, very, very best under Hansi Flick this season. His hat-trick in the weekend win over Deportivo Alaves has taken his tally to 12 goals in 11 appearances in all competitions.\nThat's pretty damn good if you ask us.\n3. Liverpool (up 1)\nWhere Liverpool fans expecting their team to keep pace with Arsenal and Manchester City in a title race in Arne Slot's first season in charge?\nPerhaps not.\nAnd yet here we are, with Liverpool actually sitting top of the table after seven games.\nThey've managed to win six of their opening fixtures thanks in large part to how solid they've been defensively - conceding just two goals to date.\n2. Manchester City (up 1)\nNo Rodri? No problem.\nWell, when Mateo Kovacic puts in performances like the one against Fulham anyways.\nThe Croatian was in fine form, bagging a brace to secure another vital win for Manchester City.\n1. Arsenal (-)\nStaying in top spot this week after yet another weekend win is Mikel Arteta's Arsenal.\nThe win over Southampton saw the Gunners extend their unbeaten start to the season to 10 games in all competitions.\nAnother 'invincible' year incoming? You never know...",
  "word_count": 772,
  "scraped_at": "2026-02-14T01:51:57.649444",
  "_text_extracted": true
}