{
  "article_id": "4abe139c6fac",
  "url": "https://celtsarehere.com/celtic-linked-with-finland-international-goalkeeper/",
  "title": "Celtic Linked With Finland International Goalkeeper",
  "date": "20240502T170000Z",
  "domain": "celtsarehere.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Celtic are continually linked with goalkeepers amid Joe Hart’s looming retirement. The Englishman has just five games left of a stellar career.\nHe will put on his gloves for the final time on the 25th of May in the Scottish Cup final but already, the Hoops are on the lookout for a replacement for the veteran number one.\nNames like Ugurcan Cakir and Patrick Pentz have been mentioned as potential options with Viljami Sinisalo the next.\nAccording to The Sun, Celtic are interested in a move for the 22-year-old with manager Brendan Rodgers set to be impressed by him.\nOn the books at Aston Villa, Sinisalo, who has two caps for Finland, is just off the back of a solid loan spell with Exeter City in England’s third tier.\nHe made 50 appearances for the club in all competitions, helping them to the last 16 of the English league cup. In senior football, Sinisalo has hailed the recent campaign as his best.\nThe ‘keeper is highly rated at Villa Park and made the move to Birmingham from FC Espoo in his homeland as a 16-year-old.\nHe will have a year left on his contract with Unai Emery’s side come the summer and a move to Scotland wouldn’t be Sinisalo’s first. He spent the Covid season on loan at Ayr United where he caught the eye as a youngster.\nWith Emi Martinez and Robin Olsen as valid options between the sticks at Villa, Sinisalo may find minutes hard to come by there. A permanent move to Celtic where he will be the number one and play Champions League football could be tempting.\nThere is a long way to go before any deal is done, but the Finn is certainly a player to monitor over the next few weeks and months as the Hoops’ summer recruitment steps up.",
  "word_count": 306,
  "scraped_at": "2026-02-14T02:07:51.312161",
  "_text_extracted": true
}