{
  "article_id": "4abe83f79ece",
  "url": "https://dailytimes.com.pk/1236008/man-utd-hit-five-to-start-life-after-ten-hag-man-city-out-of-league-cup/",
  "title": "Man Utd hit five to start life after Ten Hag , Man City out of League Cup",
  "date": "20241101T054500Z",
  "domain": "dailytimes.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruud van Nistelrooy enjoyed a winning start as interim Manchester United manager by beating Leicester 5-2 to reach the League Cup quarter-finals on Wednesday as Manchester City crashed out 2-1 to Tottenham.\nArsenal and Liverpool were among the other sides to book their place in the last eight, but Chelsea were beaten 2-0 at Newcastle.\nA United legend as a player, Van Nistelrooy was thrust into the role of caretaker boss after the Red Devils sacked Erik ten Hag on Monday following a dreadful start to the season.\nSporting Lisbon coach Ruben Amorim is the man the English giants have targeted to take over but are still in negotiations with the Portuguese champions to agree compensation for the 39-year-old.\nAccording to reports in Portugal, Amorim will remain at Sporting for the next three matches before completing his move during the November international break.\n“I came here as an assistant to help the club. I’m helping as long as I’m needed and in the future, in any capacity, I’m here to help the club build towards the future,” said Van Nistelrooy. “The reaction of the players was excellent. They deserve the credit for a good win and I’m happy the crowd goes home with a nice night of football.”\nThe Dutchman said before the game that United “can be unstoppable” when “players, staff and supporters pull together” and they cut loose by scoring four times in a thrilling first 45 minutes.\nCasemiro’s stunning effort into the top corner opened the scoring before Alejandro Garnacho swept home Diogo Dalot’s cross to please a jubilant Van Nistelrooy on the touchline.\nBilal El Khannouss quickly pulled a goal back for the much-changed Foxes. Bruno Fernandes’ deflected free-kick restored United’s two-goal cushion before Casemiro slammed home his third goal in two games.\nConor Coady grabbed another consolation for Leicester but United were not to be denied just a second win in nine games.\nFernandes rounded off the scoring when he pounced on a short back-pass to round Danny Ward and fire home.\nUnited’s reward is a trip to Tottenham in the last eight after they eliminated a City side without Erling Haaland. Timo Werner slotted home his first goal since March from Dejan Kulusevski’s inviting cross to open the scoring.\nPape Sarr’s long-range strike doubled Spurs’ lead before Matheus Nunes got an injury-hit City back into the tie in first-half stoppage time.\nBut they could not find an equaliser and Pep Guardiola showed where his priorities lie as Haaland remained on the bench for the full 90 minutes.\nCody Gakpo was the match-winner for Liverpool in a 3-2 win at Brighton to continue Arne Slot’s excellent start to life with the Reds.\nGakpo has not scored in the Premier League or Champions League this season but now has four goals in two League Cup games. The Dutch international was ruthless with two powerful finishes cutting inside onto his right foot from the left wing. Luis Diaz was also on target for Liverpool, while Simon Adingra and Tariq Lamptey struck late on for Brighton.\nLiverpool are away to Southampton in December’s quarter-finals. Teenager Ethan Nwaneri caught the eye with a sensational strike as Arsenal eased to a 3-0 win at Championship side Preston.\nGabriel Jesus and Kai Havertz got the other goals for the Gunners.\nArsenal host Crystal Palace, who beat Aston Villa 2-1, in the quarters.\nNewcastle gained revenge for their Premier League defeat at Chelsea at the weekend to ease the pressure on manager Eddie Howe.\nThe Saudi-backed Magpies are winless in five in the league, but are desperate to end a 55-year wait to win a major trophy.\nAlexander Isak’s strike and an Axel Disasi own goal inside three first-half minutes proved decisive at St. James’ Park.\nNewcastle will fancy their chances of making the last four after being handed a home draw against Brentford.",
  "word_count": 642,
  "scraped_at": "2026-02-14T01:51:57.629500",
  "_text_extracted": true
}