{
  "article_id": "4acc9c63628c",
  "url": "https://theathletic.com/4634596/2023/06/26/neymar-psg-transfer/",
  "title": "What next for Neymar ? Messi gone , Mbappe in limbo and an offer from Saudi Arabia",
  "date": "20230626T053000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Follow the Route de la Celle Saint-Cloud in the quiet suburban town of Bougival, west of Paris, and on the top of the hill, you will find a statue of Francois Debergue.\nDebergue was a local gardener who became a war hero. As Prussia laid siege to Paris during the Franco-Prussian war of 1870, he cut telegraph lines to stop the local Prussian garrison from communicating with their headquarters in Versailles, a few kilometres to the south. Most villagers had fled the occupying forces, but he remained and cut those communication lines three times before he was captured. He was executed before the end of the war and the statue marks the spot where he was shot.\nAdvertisement\nFor now, Debergue is the only famous Bougival resident to have a statue. It is a small place, with a population of around 9,000, but its charm means it has attracted more than a few famous faces. The town sits on the banks of the River Seine and along its narrow main street it boasts, among other small shops and cafes, a 12th-century church, L’Eglise Notre Dame de l’Assomption, while large homes are tucked away behind trees up on the hill. It has a secluded feel, yet it is also only 15km from the centre of Paris.\nMany creatives have lived here. Georges Bizet, the composer, wrote Carmen here from his riverside home on the Seine. The town also attracted some of the great impressionist artists of the late 19th century, such as Claude Monet, who painted The Bougival Bridge here in 1869, and Berthe Morisot, one of the three grand dames of the movement. In modern times, the French actor Gerard Depardieu made Bougival his home for a time, too.\nElsewhere on The Athletic…\n- Gundogan’s Barcelona transfer: Why City’s captain decided to leave\n- Declan Rice: This is why Man City and Arsenal want him\n- Latest transfer news from The Athletic\nConsidering the town is around 10km away from Paris Saint-Germain’s Camp des Loges training ground, some of the club’s most famous footballers have settled here as well. Pauleta moved here and so did Ronaldinho, a flamboyant artist of a different kind.\nToday, the town’s most well-known resident is another entertainer, of a similar mould. Neymar, the gifted Brazilian forward who became the most expensive footballer in history when he signed for PSG for €222million (now £190m; $242m) in 2017, now lives in Ronaldinho’s old home.\nIt is a comfortable place to be. It is out of the way but near to the training ground, yet also close enough to hop into Paris for the glitz and glamour. For the most part, it is idyllic.\nBut in recent times, it has not always felt like that. In the first week of May, as fan anger erupted following Lionel Messi’s unauthorised trip to Saudi Arabia, Neymar became a target. Supporters travelled to Bougival to make their feelings known and, outside his home, they chanted for him to leave the club, with a less-kind translation of “Neymar, get lost”.\nAdvertisement\nNeymar has not always been a popular figure since his big-money move, but the protests left a mark. He had not played for the club due to injury since February and his partner is pregnant. Those close to him, speaking on condition of anonymity to protect their relationships, described him as deeply upset, more so than at any point during his stay in Paris. The club increased security around his home and condemned the protestors.\nNeymar has previously indicated he wanted to stay at PSG for the rest of his career, but in that recent context, not everything looks as settled or certain. PSG want to head in a new direction this summer, putting their soft spot for glamour signings behind them and building a team that is younger, more homegrown and fundamentally more sustainable. Neymar, a symbol of excess in Paris, does not fit that bracket.\nMoving him out of this desirable suburb of Paris would not be a simple thing. Nor is it cheap, even if a lucrative offer from Saudi Arabia has been made in recent weeks. Neymar has four years to run on his contract and that’s not easy to give up.\nThere are other variables at play, too, at the moment, including whether the expected appointment of Luis Enrique at PSG, his coach at Barcelona, will offer him a fresh start. Or indeed if uncertainty around Kylian Mbappe’s future may allow him to reclaim centre stage of the Parisian project.\nBut six years on from his stunning transfer that made the world take notice, it is not clear for how long Neymar will remain Bougival’s most famous resident.\nNeymar arrived with a shock-and-awe transfer that was met with consternation within football but also excitement in Paris. He was a step up for the QSI project and for supporters, he was supposed to be the key to European success. His talent and ability to turn mediocrity into magic has never really been doubted over his six years in the French capital, but the problem would be how often he has been able to display it. Only once has he made 30 appearances in all competitions for PSG in a season: 2017-18, his first year at the club.\nAdvertisement\nThere is fatigue now at PSG. It is not that Neymar has not delivered footballing excellence. In nearly every season in Paris, he has managed more goals and assists combined than the number of appearances he has made. His output has been strong and even this season his form was among the best he has shown at the club, especially before the World Cup. His return has been 35 goals and assists from 29 appearances and his combinations with Mbappe and Messi helped the team pass the first half of the season unbeaten.\nBut then, as always seems to be the case with Neymar, he got injured.\nAbsences are a key thing and particularly their timing. They tend to fall at the most crucial part of the season, in early spring, as PSG mount their assault on the Champions League. It is also the time close to both his and his sister’s birthdays, a point that often raises eyebrows considering his penchant for a party.\nThe link with his sister’s birthday has been labelled a curse, as he has played a match only once (2020) on the fixture around her birthday on March 11 since 2015. In Barcelona, he attended two parties of hers when suspended and while they are close — Neymar has a tattoo of his sister on his arm — at PSG, it is injuries that have kept him out around that time.\nThat’s not to play down the parties, though, and the role they have played in shaping Neymar’s image in Paris. In 2018, he threw a birthday party 72 hours before the match with Sochaux, which the whole team, including coach Unai Emery, attended. The following year, after suffering a metatarsal injury in January, there was another big party. In 2020, a similar party, 48 hours before a match with Nantes (for which he was suspended), didn’t go down as well. “Is it the best way to prepare for a game? No, obviously,” said Thomas Tuchel, his coach. “Is it the worst thing that can happen? No, but it’s a pity because we gave people the opportunity to talk badly about us.”\nNeymar’s parties, which are not just confined to birthdays, have also annoyed a few of his neighbours. This year, a party for his 31st birthday ruffled a few feathers in quiet Bougival. “It wasn’t just background music,” the mayor, Luc Wattelle, told Le Parisien. “It was prodigiously annoying.” His parties are rarely docile affairs.\nIn general, though, most residents don’t get to see him. He lives in self-sufficiency, a “ghost” on the hill, as the mayor put it.\nAdvertisement\nThe off-field distractions have contributed to the disillusionment around Neymar’s commitment and also a feeling that it undermines the club. It is not just about the parties. Last month, as PSG secured the title away at Strasbourg with a 1-1 draw, Neymar was absent despite other injured players travelling to the Stade de la Meinau for the game. Coach Christophe Galtier said afterwards that Neymar had “difficulty moving around”, but pictures emerged on social media of Neymar playing poker in Monaco on the same evening. The next day, he was filmed at the Monaco Grand Prix. His movement, evidently, could not have been that bad. It caused frustration at PSG.\nOver six years, Neymar has played less than 55 per cent of possible matches for PSG. That is more than 100 matches missed, when, at Barcelona, he missed 26 across his three years. Crucially, Neymar has been available for only one Champions League round-of-16 tie for PSG. That was in 2020 when the club reached the final.\nFor a €222million player, that return falls well short of expectations and it compounds the negativity. Not just for the club and fans, but for the player, too. “It’s horrible to be deprived of matches, to be injured,” he said on Friday in an interview with Brazilian TV channel Bandsports during an auction for his foundation. “I like to play too much, to be on the field. When this is not the case during a game, it is already difficult. So imagine when it lasts four to five months. It’s awful. I miss it. I was born for this, to play football.”\nNeymar was sidelined this year after injuring ankle ligaments in his right foot following a poor challenge from Lille’s Benjamin Andre during a 4-3 win on February 19. It led to ankle surgery, which he had in Doha, and ruled him out for the season. He has had ankle issues for the past two seasons, affecting him last year and in 2020-21, when adductor problems also forced him to miss games. The season before, in 2019-20, was interrupted by repeat hamstring issues and a rib knock, while his first two seasons in Paris saw successive metatarsal injuries.\nMost of these injuries have tended to stem from challenges. Ligue 1 is a physical league and Neymar, a honeytrap for a tough tackle, has felt that more than most. His flamboyant style and willingness to pull off tricks and deploy theatrics can wind up opponents and they bite back. His second metatarsal injury, in 2018, followed a match against Strasbourg when midfielder Anthony Goncalves fouled him three times in succession. It would eventually force Neymar off injured, but not before he had humiliated his opponent with a rainbow flick. “Neymar? That’s his style, he’s a great player but we’re not there to have fun with him,” said Goncalves afterwards. “We respond with the weapons we have and we have colours to defend.”\nPSG struggled in Neymar’s absence this season as form collapsed en route to the title and Bayern Munich eliminated them in the Champions League round of 16. The club’s poor form amplified frustration with the PSG project. Off-field matters have taken centre stage, not least after Messi’s trip to Saudi Arabia, and when that happens, Neymar, the entertainer, the extrovert, the distraction, comes to mind. While some may attribute PSG’s limp run-in to the absence of the Brazil star, for many, he is symbolic of PSG’s indulgence of galacticos at the expense of the team.\nBut will he stay? Or will he go?\nAdvertisement\n“Ney joined us this week, he’s a ray of sunshine in a locker room,” said Christophe Galtier after Neymar returned to Paris from Brazil, where he had been staying during the first part of his recovery from ankle surgery. “He brings a smile and joy… it’s important.”\nNeymar’s popularity tends to be evoked as a positive influence, but it is not always so. In February, Neymar confirmed he had a dressing-room altercation with Luis Campos, the club’s consultant sporting adviser, following a 3-1 defeat in Monaco when Neymar reportedly reprimanded team-mates Vitinha and Hugo Ekitike for not passing him the ball. He later described it as being blown out of proportion.\nDressing-room squabbles are not new. Penalties can be a flash point. In 2017, Neymar had a public dispute with Edinson Cavani against Lyon and this season there was a similar instance against Montpellier in August. Mbappe missed a penalty and, in the second half, after PSG were awarded another spot kick, Neymar took the ball and scored. After the game, Neymar liked posts on social media criticising Mbappe as first-choice kick taker. Mbappe took issue with this and is thought to have confronted Neymar face-to-face the next day.\nThe imbalanced squad building at PSG has brought a few problems and one of them has been stars wanting the limelight. Messi, Mbappe and Neymar have dazzled on occasion, but over the two years they have played together, PSG have struggled to make things click as a team.\nIt also costs a lot of money to retain three superstars. With financial fair play again a big handicap this summer, there is a question over whether it is worth retaining Neymar.\nMessi’s departure for Inter Miami, following the expiry of his contract, has loosened the strings a little, but Neymar’s contract remains a heavy one. The squad needs a lot of work, with several positions in need of strengthening, and while there are imminent arrivals, such as Lee Kang-in, Marco Asensio and Milan Skriniar, more will be needed.\nThose close to Neymar point out the club were eager for him to sign his current deal in 2021. Last summer, Neymar was able to activate an extension on his contract and he did, which now runs until 2027. This makes it very difficult “if not almost impossible”, says one source, that he moves this summer. For the club, though, they would be open to moving on a player who does not fit their new direction of travel, away from the big names of the past and towards younger, homegrown players built, ideally, around Mbappe.\nAdvertisement\nNeymar himself has previously intimated that he wants to see out his career at PSG, but the events of last season have left the possibility of an exit ajar. Finding appealing suitors is the challenge. There has been a very large offer from Saudi Arabia as the country continues its pursuit of high-end players. Again, though, giving up his current contract is not easy, particularly at 31, when he still has peak years ahead of him. Chelsea were also believed to hold some interest and there is a residual hope in Paris that their sales to Saudi Arabia may make a move feasible for the west London club.\nBut it seems difficult as PSG may still want a fee for a player of impressive talent, though removing his salary from their wage bill might also appeal.\nWithout a means of manoeuvre, or indeed a willingness to depart Bougival, retention in Paris seems the most likely option for now. And there are factors at play that may make that more accommodating. Mbappe publicly declaring he will not be extending his contract beyond 2024 puts PSG in a tricky spot. Mbappe has repeated that he wants to stay for his final year but that could be part of a strategy to leave in circumstances that play well for him because PSG have made it clear they will not allow him to depart for free next year.\nWhile that stand-off simmers, it presents a possibility that Neymar may be the only star left in the room. If Mbappe goes, PSG gain the FFP headroom they crave. There is also another important variable. Luis Enrique is set to be appointed as Galtier’s successor at the Parc des Princes and while he and Neymar had the odd dip in their relationship at times in Barcelona, his arrival offers an opportunity. “The truth is that he has a very good relationship with Luis and very good memories of his time with FC Barcelona,” said one source close to the player. It is not inconceivable that Neymar takes centre stage in a post-Mbappe era.\nFundamentally, though, the question is whether the comfort of Paris and Bougival is too much to lose for Neymar. As much as things have soured with those on the terraces and his club desires a new direction without him, he still has a secure, advantageous contract, playing at the top end of European football.\nQuestions may be asked about whether these six years have been worth it for him or the club, particularly considering how they have covered his peak years. But at 31, there are still key years ahead.\nUncertainty exists around Bougival’s most famous resident. While Debergue cut lines, it is not clear if Neymar is ready to cut ties just yet. Although a statue does not seem on the cards.\n(Top photo: Sylvain Lefevre/Getty Images)",
  "word_count": 2817,
  "scraped_at": "2026-02-14T01:56:02.422211",
  "_text_extracted": true
}