{
  "article_id": "4ae86a8dc2d1",
  "url": "https://www.empireofthekop.com/2025/10/13/champions-league-opening-fixture-2027-28/",
  "title": "Champions League will begin with standalone fixture from 2027 / 28",
  "date": "20251013T223000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA have today confirmed a slight tweak to the Champions League schedule which’ll commence in a couple of years’ time.\nWe’re now into the second season of the competition’s 36-team single league phase, with Liverpool finishing top in that new format last term before penalty shootout elimination to eventual trophy winners Paris Saint-Germain in the round of 16.\nThe Reds have a battle on their hands to repeat the former feat this time around, having lost 1-0 to Galatasaray in their previous European outing, which dropped them to 17th in the table after matchday two.\n2027/28 Champions League to begin with standalone fixture\nOn Monday, The Athletic reported that, from the 2027/28 season, the Champions League will begin with a standalone fixture on the Tuesday night of matchday one which’ll be played at the home of the reigning title winners, with the remaining matches played across the Wednesday and Thursday.\nThe change was announced by UC3, the joint venture between UEFA and European Football Clubs (formerly the European Club Association), and mirrors American sporting competitions such as the NFL and NHL, in which the defending champions commence the new season at their venue.\nLiverpool began the defence of their Premier League title in August against Bournemouth at Anfield, although that was coincidental rather than deliberate.\nLiverpool have work to do in this season’s Champions League\nToday’s news isn’t anywhere near as revolutionary as the major format change which kicked in just over a year ago, but Reds fans will obviously be hoping the opening Champions League match in 2027/28 is played at Anfield, as it means we’ll have won the tournament a few months previously.\nWith England guaranteed four places and more likely than not to have a fifth due to UEFA’s allocation of an additional berth for the two nations with the best coefficient, LFC will fully expect to at least be involved in the competition on an annual basis (indeed, they’re among the favourites to lift the trophy next May).\nFor now, Slot’s side have work to do if they’re to get back on track for a top eight finish and direct entry to the round of 16 in this season’s edition, and that might now require them to win away to Eintracht Frankfurt in their next European game on Wednesday week.\nFinishing first in the league phase isn’t of paramount importance, as Liverpool discovered to their cost a few months ago, but bypassing a knockout play-off round in February would be most welcome. Let’s hope the Reds aren’t left reliant on that route when the league phase ends in the New Year.\nYou can watch Slot’s post-Chelsea press conference via Empire of the Kop on YouTube:",
  "word_count": 449,
  "scraped_at": "2026-02-14T02:19:01.976800",
  "_text_extracted": true
}