{
  "article_id": "4b0888037209",
  "url": "https://www.caughtoffside.com/2024/10/13/santiago-castro-transfer-arsenal-chelsea/",
  "title": "Exclusive : Arsenal & Chelsea scouts impressed after watching 20 - year - old South American talent",
  "date": "20241013T110000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal and Chelsea have been among the Premier League clubs to recently scout talented Bologna forward Santiago Castro, who has impressed in both Serie A and the Champions League.\nThe 20-year-old looks like a big prospect for the future, and sources have informed CaughtOffside that Arsenal, Chelsea, Aston Villa, Everton and Nottingham Forest have all been closely monitoring him in recent times, and were left impressed with what they saw.\nCastro moved to Bologna last season but did not play regularly straight away, though he’s now making a very impressive start to the season with more minutes in the Italian club’s first-team.\nArsenal and Chelsea would surely be tempting destinations for Castro in the future, but it remains to be seen if these teams will end up stepping up their interest, while it’s also not yet clear if the player himself sees his future in English football.\nSantiago Castro to Arsenal or Chelsea in the future?\nIt could be that Chelsea will end up viewing Castro as another top young talent that they feel they have to bring to Stamford Bridge, as has been their transfer policy under current owners Todd Boehly and Behdad Eghbali.\nThe Blues have signed a long list of promising youngsters, including South American talents such as the likes of Estevao Willian and Kendry Paez, who will be moving to Stamford Bridge when they’re a bit older.\nCastro, an Argentina Under-20 international, may feel that would make Chelsea a good destination, but the Arsenal project would also surely be a tempting one for him.\nThe Gunners have also long been well known for signing and developing top young players, with the likes of Bukayo Saka, Gabriel Martinelli and William Saliba showing that there is a pathway into the first-team at the Emirates Stadium.\nArsenal are also further ahead than Chelsea in their project right now, so might be viewed as the better move by Castro if he wants to be winning major trophies in the near future.",
  "word_count": 331,
  "scraped_at": "2026-02-14T01:57:46.248704",
  "_text_extracted": true
}