{
  "article_id": "4b1008348c47",
  "url": "https://www.fourfourtwo.com/opinion/why-aston-villa-want-a-new-deal-for-england-forward-morgan-rogers-despite-faltering-premier-league-performances",
  "title": "Why Aston Villa want a new deal for England forward Morgan Rogers despite faltering Premier League performances",
  "date": "20251012T194500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWhen England line up against Latvia on Tuesday, Aston Villa star Morgan Rogers will expect to be in the starting line-up.\nRogers has been on a hugely impressive upwards tear. After four years at Manchester City, for whom he signed from West Bromwich Albion, the 23-year-old took a while to make his mark.\nMan City loaned out the Halesowen-born attacking midfielder to Lincoln City, AFC Bournemouth and Blackpool between 2021 and 2023. Two years ago he was sold to Championship club Middlesbrough without playing a Premier League game.\nRogers’ progress at Villa lifted expectations\nRogers joined Villa in January 2024 after fewer than 30 Championship appearances for Boro. Unlike many other new Villa signings, the former West Brom youngster was essentially thrown straight into the side.\nHe hadn’t looked back until August, when question marks over his form – question marks whose origins emerged last season – became one of the dominant features of Villa’s dreadful start to 2025-26.\nRogers, who has represented England at every age level within the last decade, barely put a foot right before the September international break.\nAdored though he is at Villa Park, a string of substandard displays resulted in heavy criticism. Even in the context of Villa’s awful form, Rogers’ shortcomings stood out.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nBy the time he was ironically cheered for completing a pass against Bologna in the Europa League and subsequently cheered through an improved display in the Premier League against Fulham, another narrative was taking hold.\nLong before Rogers started to look a little like his old self in a Villa shirt, he’d won plaudits for his contributions for England in September. Some took it as a positive sign, others as a sort of twisted confirmation that he was committed to one more than the other.\nAfter scoring his first senior international goal against Wales on Thursday, it’s fair to say that Rogers’ best two performances of the new season have indeed been for England.\nModest improvements match after match for Villa have begun to show glimpses of a terrific talent returning but Villa’s approach has been consistent amid the noise.\nManager Unai Emery has started Rogers as a matter of course despite frequent suggestions that he shouldn’t, showing faith in a player whose quality is beyond dispute and attempting to play him into form.\nBehind the scenes, it’s understood that Villa are eager to sign the England international to a new deal despite his agreeing an extension within 11 months of joining the club and being committed until the summer of 2030.\nWhy Villa want to extend Rogers’ contract\nFundamentally, Villa’s admiration for Rogers is rooted in a belief that his recent form, though not without precedent in 2025, is a blip.\nHe has dominated Champions League matches and made an impact for England, and Villa’s football department aren’t prone to short-term thinking.\nRogers is still seen as one of Villa’s key players – in terms of a combination of on-field ability to financial potential, he is arguably the most important player at the club.\nThose financial factors can’t just be shrugged off.\nRogers was linked with possible transfers to Chelsea and Tottenham Hotspur in the summer transfer window and the potential fees mentioned would have put Villa on their most stable regulatory footing for years.\nHe might very well be sold within a year. Villa’s transfer strategy necessarily includes otherwise unwanted player sales and Rogers is where the big bucks can be unlocked in a squad that has a lot of quality but also a ton of miles on the clock.\nA new deal before the January transfer window would protect his transfer value from Villa’s perspective, putting the club in a position of strength whether they choose to keep him, sell him willingly or sell him reluctantly next summer.\nA pay increase and a release clause could go a long way towards persuading the player to sign the paperwork.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 834,
  "scraped_at": "2026-02-14T01:52:49.027490",
  "_text_extracted": true
}