{
  "article_id": "4b11fa589932",
  "url": "https://www.themag.co.uk/2025/06/nottingham-forest-fans-comments-on-newcastle-united-trying-to-sign-anthony-elanga-intriguing/",
  "title": "Nottingham Forest fans comments on Newcastle United trying to sign Anthony Elanga - Intriguing",
  "date": "20250609T091500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nottingham Forest fans comments on Newcastle United trying to sign Anthony Elanga – Intriguing\nNottingham Forest fans have been reacting to weekend reports that Newcastle United are trying to sign Anthony Elanga.\nLast summer it was widely reported that on deadline day, United failed with more than one offer to buy the winger.\nNow Nottingham Forest fans with comments on what think of the latest claims, of Eddie Howe wanting to line up Anthony Elanga alongside his international teammate Alexander Isak.\nI think in situations like this, when Newcastle United are claimed to be trying to sign a player, the best way of finding out how good the player is (or isn’t…), is by looking at what his current club’s fans think about him…\nNottingham Forest fans commenting via their LTLF message board on Newcastle United trying to buy Anthony Elanga:\n‘I reckon Elanga will want the move to Newcastle United and we will pocket loads of profit and can buy elsewhere – not a move I want, but I can see it happening.’\n‘If we were to lose Elanga ( hopefully not ) Madueke would be a decent addition.’\n‘it’s not Elanga’s decision as he’s contracted to Forest for another 3 years\nI’m not sure he’s looking for a move.’\n‘I hope not but champions league is a lure.’\n‘He played in it with Man United but still took the chance to come to us.\nI can’t see him dropping us for a season in the champions league that Newcastle may not replicate next season with or without Elanga.’\n‘If he leaves it will be on our terms, not Elanga’s or Newcastle’s.\nHe either stays or we get a massive fee (far more than £50m) that the club feels would benefit us more than Elanga staying. If Newcastle don’t pay a fee that matches what Forest demand, then what Elanga wants to do is irrelevant.’\n‘What the player wants is never irrelevant. I don’t think you can work like that these days, you have to find an acceptable compromise, whatever that may end up being.’\n‘It is unless an acceptable bid comes in though. It doesn’t matter what Elanga wants unless Newcastle put in an offer worthy of Forest’s consideration. No transfer happens until a deal is agreed between the buying and selling club.\nHe has three years on his contract, Forest hold the cards here. No sale will happen unless the deal is beneficial enough to Forest.’\n‘We’re in denial if we think Elanga wouldn’t fancy Newcastle, CL football, and being in a side with his good mate Isak.\nHowever, I’m still expecting someone else to fire a massive bid in for Isak this summer.’\n‘He might fancy those things, but he might fancy playing for us, in Europe and with his good mates CHO, Aina and MGW, more.’\n‘Not many clubs can afford Isak, Newcatle will want £150mil – the only clubs I can think of that can buy him are PSG and Man City or a Saudi club. Can not see Isak going anywhere. Would be surprised if Elanga did not go to Newcastle. Due to the sell on clause with Man Utd assume some players would come to use as part of transfer fee.’\n‘Liverpool will give it a go I think.’\n‘Newcastle bid £40m last summer. They want to start with that 40m plus add ons.\nForest want to start at £50m plus add ons.’\n‘People seem to forget that transferring to Newcastle United necessitates moving to somewhere in the North East. There are plenty of nice places there for normal people but it’s certainly not going to be a big lure a footballer who doesn’t already live there and Newcastle itself is an absolute sh..hole.’\n‘Your post isn’t unreasonable in general but to suggest this about Newcastle is ridiculous, it’s a brilliant city.’\n‘Agree: Newcastle is really nice and has loads of amazing Victorian architecture.\nArchitecturally, far superior to Nottingham as all of the best Notts buildings were sadly demolished in the 50’s -70’s.’\n‘It’s not and I should know.\nThe city centre apart from a few streets is a monstrosity and the rest of the city is 95% dire. It’s actually quite a scary place at certain times and more so than most places.’\n‘I was there for uni too and a fair bit after and I loved every minute, a brilliant city.\nMy sister still lives up that way so get back as much as I can too. Genuinely don’t understand your perspective on the place, I couldn’t disagree more.’\n‘I went for a stag do about 10 years ago and have to say I absolutely loved it. Great city and good vibe. Seemed a very high proportion of pubs and clubs mind you.’\n‘Went to uni in Newcastle, it’s a great city. Personally think only Manchester beats it in the UK.’\n‘Depends, If we plan on setting up in the same fashion as last season then we cant afford to lose him.\nIf were looking to have more posession then let him go for 45m, very effective with balls in front, not effective with ball to feet.’\n‘I’m in Newcastle on Tuesday evening.\nWill leave a big steaming , unflushed log in the strawberry as a warning.’\n‘Why are they looking to sell Gordon out of interest? Not had the greatest season but I do rate him. PSR thing maybe?\nI think it’s one of those things that clubs tactically float out into the public domain. Their thinking will likely be that they don’t want to lose him but half expect a bid to come in from Liverpool if they sell Luis Diaz. They’ll float the £80M figure out and if Liverpool still bite they’ll get good money for him.’\n‘Howeball is essentially a version of our play under Nuno but with added dirtiness and diving. The main thing that has been pointed out on here though is that Newcastle failed to sign him for £50m a year ago.\nIf they are psr worry free and have champions league money to boot there is no way on this earth that Marinakis sells him for less than he was offered last year, the same fee isn’t going to be acceptable either really, its needs to be stupid money because we don’t need or want to sell and whilst they will play 8 champions league games next year, Newcastle won’t win it or the league.’\n‘Where does the term ‘Howeball’ come from?\nSky influence again probably, get a managers name and add ball to it as though that describes a particular style\nEngland won the World Cup playing Alfball!!’\n‘Well their fans seem to think £50m is the most they should be paying for him. They seem upset at even paying £50m.\nSeems odd given we turned that down last year and after the season he has just had as you say his price has gone up.\nI don’t think they can afford him due to PSR I imagine it will hopefully be a none story.\nHopefully we plan on keeping all our best players and adding to our squad this summer.\nI am not sure many other clubs fans understand EM wants to win and compete for actual trophies we are not here to do a Brentford or Fulham and just be an EPL club and make up the numbers. We have actual ambition which is hard due to PSR.’\n‘Tell ‘em Isak + £20m.\nIf they ask why – just tell ‘em they started it.’\n‘I would have sold him last year for the £40m we got offered but after the season he’s had an given his fairly unique blend of pace merchant and finishing then I think we’re well within our rights to seek £70m+.\nHard to replace and similar to MGW in that everything good we do tends to go through him.’\n‘As expected Newcastle and their fans getting delusions of grandeur.\nWe and they were on a par last season and they nicked a CL place at the death.\nWe’ll be looking to put them back behind us next year.’\n‘I think we will let Elanga go for 50-60m and get somebody like Madueke in on the cheap.’\n‘Why would we do that, Madueke is rubbish compared to Elanga.’\n‘Miley wants away too.\nDon’t really want to sell Elanga but this could have PSR vibes written all over it.\nNot sure I want some washed up player in any deal, so I guess IF there is anything in this talk a young prospect joining us….like Anderson from last year dare I say….is slightly more palatable.’\n‘I do really like the look of Lewis Miley too. Still only 19 but looks to have the world at his feet, genuinely surprised that Newcastle would let him go.\nMaybe they’ve seen what they can do with manoeuvring young players out such as Anderson after having a successful season and beating PSR so they’re happy to work the same approach.’\n‘Harvey Barnes if we could get him + 25-30m.’\n‘Thank you for your interest in Anthony, Eddie, he’s quite good isn’t he? Yes, and he’ll continue to look good playing on our right flank next season. Jog yourself on, there’s a good lad.’\n‘It should be a £80m start point\nWe should remain stubborn in our prices or we will get picked apart like Bournemouth & Brentford are. We don’t need to sell.’\n‘I read that palace were trying for Miley.’\n‘Probably as a part ex if Newcastle goes back in for Guehi.’\n‘Might be nothing in this, who knows yet.\nNewcastle may well be a club we are fairly friendly with though, last years deals highlighted that. Probably a strong ownership link, so favourable PSR deals could be a regular thing.’\n‘Elanga is great. Hands off!\nSolid output, improving all the time and a really great character.\nHe’ll end up as an across the line striker in time imo. I don’t think Newcastle will get close to his valuation though – not sure why as a club they think Gordon is worth 80m and have our Tony not far off half that? We’ll want similar…’\n‘Elanga would be quality at Newcastle. I can see it. Competing with Jacob Murphy. Then you’ve got Gordon and Barnes on the other side.\nBut there’s no way Forest should be giving in to silly offers.\nHe’s a game changer.’\n‘He can blow a little hot and cold but he’s a real game changer, can generate a goal from nothing either for himself or someone else (usually Wood). When he’s on form (which was the majority of last season) he’s a massive threat.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1792,
  "scraped_at": "2026-02-14T01:58:41.950105",
  "_text_extracted": true
}