{
  "article_id": "4b232f194b80",
  "url": "http://www.gdnonline.com/Details/1309975/Man-City-book-FA-Cup-final",
  "title": "Football : Man City book FA Cup final",
  "date": "20240421T000000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Holders Manchester City beat Chelsea 1-0 with a late Bernardo Silva goal yesterday to reach the FA Cup final after an absorbing end-to-end Wembley semi-final.\nSilva sidefooted the ball home in the 84th minute after Chelsea goalkeeper Djordje Petrovic parried a shot from former Blues midfielder Kevin De Bruyne.\nCity will meet Manchester United or second-tier Coventry City, who play today, in the showpiece game on May 25.\nThe result offered some consolation for Pep Guardiola’s side, who were eliminated on penalties in the Champions League quarter-finals by Real Madrid in midweek.\nSilva, who missed a penalty in the shootout against Real, said he was: “Very happy after a very frustrating week for all of us, for me personally.\n“The good thing is in football, if you play at Man City you play every three days, so after two to three days, you have a chance for a bit of revenge and to put things right.”\nCity are still on for a double, standing two points clear at the top of the Premier League.\nChelsea, whose last visit to Wembley ended in League Cup final defeat by a late Liverpool goal in extra time two months ago, squandered some of the best chances.\nSenegalese Nicolas Jackson was particularly profligate.\nHe took the first shot on target in the eighth minute but it was easily collected by Stefan Ortega in the City goal.\nEarly in the second half, Jackson had two chances to put the ball away but Ortega intercepted both.\nThere were also opportunities for 21-year-old former City forward Cole Palmer, who scored four goals against Everton in the league last Monday, and for Noni Madueke.\nA last-gasp free kick from substitute Mykhailo Mudryk sailed over the bar, summing up a miserable afternoon for Chelsea and their manager Mauricio Pochettino.\nChelsea have now been eliminated from six of their last eight FA Cup ties against Manchester City, including in the third round last season.\nGuardiola lashed out at the FA Cup schedule. “It’s unacceptable to let us play today. “It’s impossible, for the health of the players. It’s not normal. 120 minutes, the emotions of Madrid, the way we lose, honestly.\n“I know this country is special (with the FA Cup) but it’s for the health of the players. I don’t understand how we survived today. I just want to protect my players. It’s common sense. I’m not asking for something special or privilege.”",
  "word_count": 404,
  "scraped_at": "2026-02-14T02:07:51.323601",
  "_text_extracted": true
}