{
  "article_id": "4b2b3da60a7c",
  "url": "https://metro.co.uk/2025/01/23/erik-ten-hag-blocked-man-utd-signing-man-citys-new-33m-star-22419214/",
  "title": "Erik ten Hag blocked Man Utd from signing £33m Man City star",
  "date": "20250123T123000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag blocked Manchester United’s deal for new Manchester City signing Abdukodir Khusanov, believing the Uzbekistan defender was ‘not quite ready’.\nKhusanov has signed a four-and-a-half year contract with Man City after completing a £33.6m move to the Etihad Stadium earlier this week.\nThe Premier League’s first-ever Uzbek footballer made 16 appearances for Ligue 1 side Lens this season after attracting interest from Manchester United last summer.\nUnited first scouted Khusanov in 2023 when he was playing for Uzbekistan at the U20 World Cup and soon considered bringing the centre-back to Old Trafford.\nBut the player’s agent, Gairat Khasbiullin, says Ten Hag blocked the deal as he did not believe Khusanov was ready to contribute to the Premier League giants.\nTen Hag was sacked by Manchester United in November but the club have continued to struggle under the Dutchman’s replacement Ruben Amorim.\nAsked which club was the ‘first’ to show interest in Khusanov, the agent told Championat: ‘Manchester United.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘In May 2023, United scout Nicolas Chenalli was in Argentina for the U20 World Cup. After the second match of Uzbekistan at the tournament, he found my contact and wanted to meet.\n‘I was also in Argentina then, and we thought of meeting in Buenos Aires, but it didn’t work out because of the matches.\n‘Then it turned out that he stayed in Rosario only for a day and then flew away. I just went out onto the street in Buenos Aires and caught a taxi to Rosario.\n‘The driver turned out to be a River Plate fan. All the way we tried to communicate about football through a translator.\n‘When a Manchester United scout came up and gave him his business card, the driver went nuts: “Who are you anyway?”\n‘[He said] that Khusanov has Manchester United DNA. It was at that moment that I realised that the guy would end up in a top club.\n‘The scout made a detailed report, but coach Ten Hag said that the defender was not quite ready to help the team at that time.\n‘Recently we corresponded with that Manchester United scout. He congratulated us on the move to Man City but regretted that the player did not end up at Man United.’\nFollowing his move to Premier League champions Manchester City, Khusanov said: ‘I’m absolutely delighted to be joining City, a club that I have enjoyed watching for a long time.\n‘This squad is full of the best players in the world, and I can’t wait to meet them and play alongside them.\n‘And of course Pep Guardiola is one of the greatest coaches ever and I am so excited to learn from him and improve my game even more.\n‘This is a very proud moment for me and my family to be joining a great Club like Manchester City and I’m more than ready for this challenge.’\nMan City director of football Txiki Begiristain added: ‘We are very happy that he has joined us, and we are all very excited about what he will bring.\n‘For such a young defender, Abdukodir is already very intelligent, as well as being strong, aggressive and extremely quick.\n‘Working with Pep will only make him better and, speaking to him, he is determined to keep improving.\nMore Trending\n‘He is a really exciting signing as we aim to keep progressing to maintain one of the best squads in Europe.’\nManchester City have signed four players so far in January – Claudio Echeverri, Vitor Reis and Omar Marmoush joining Khusanov at the Etihad.\nCity are hoping to rebuild following a dismal season in which they have slipped outside the top-four in the Premier League and dropped to 25th out of 36 teams in the Champions League.\nSome pundits suggests Manchester City were ‘back’ after they thrashed Ipswich Town 6-0 at the weekend, but Guardiola’s side then threw away a two-goal lead to lose 4-2 to Paris Saint-Germain in midweek.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Thierry Henry sends message to Arsenal fans demanding a new striker this January\nMORE: Kieran Tierney set for Arsenal exit but rejects move to Premier League club\nMORE: ‘Go and get him’ – Paul Merson tells Arsenal to beat Nottingham Forest to £60m signing",
  "word_count": 774,
  "scraped_at": "2026-02-14T01:49:18.063427",
  "_text_extracted": true
}