{
  "article_id": "4b2cf325ba67",
  "url": "https://www.teamtalk.com/chelsea/struggling-star-new-danny-drinkwater-team-mate-signing-of-season",
  "title": "Chelsea news : Struggling star brutally called  new Danny Drinkwater  but team - mate could be  signing of the season  ",
  "date": "20241125T154500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nStruggling Chelsea star brutally called ‘new Danny Drinkwater’ but team-mate could become ‘signing of the season’\nChelsea midfielder Kiernan Dewsbury-Hall has been warned he is going in the same direction as Danny Drinkwater, while Blues winger Pedro Neto has received exciting praise.\nEnzo Maresca instructed Chelsea to sign Dewsbury-Hall in July after the Englishman played a key role in helping his Leicester City side win the Championship title last season. Dewsbury-Hall moved to Stamford Bridge for £30million (€36m / $37.7m) and was hopeful that he could become an important asset for Chelsea.\nHowever, things have not worked out that way. Dewsbury-Hall has featured for just 44 minutes in the Premier League so far and has had to rely on competitions such as the Europa Conference League and League Cup for game time.\nDespite his good relationship with the 26-year-old, Maresca prefers to use the likes of Moises Caicedo, Romeo Lavia and Enzo Fernandez in midfield.\nFormer Chelsea star Emmanuel Petit thinks Dewsbury-Hall could end up being like Drinkwater, who only made 23 appearances for the Blues despite costing £35m in 2017.\n“Kiernan Dewsbury-Hall looks like the new Danny Drinkwater at Chelsea,” Petit said in a new interview (via Metro).\n“He spent so much time on the bench and ended up going out on loan and that could well happen again with Dewsbury-Hall.\n“If I was a footballer being targeted by Chelsea, I’d be very, very careful about making my decision.\n“They have splashed so much money and bought so many young talented players that they have two or three teams in the dressing room.\n“I’d have to speak with the club to make sure that the board and the manager really want me because you’re taking a big risk with your career.\n“If they don’t have confidence in you then you’ll end up on the bench and then in the stand and then gone. Be very careful when you join Chelsea.”\nDewsbury-Hall had been hoping to make an impact when Chelsea faced his former club Leicester on Saturday. But he only got off the bench in second-half stoppage time as Chelsea picked up a 2-1 away win.\nIt has been claimed that Chelsea chiefs are already looking at whether to loan Dewsbury-Hall out, with Manchester United, Tottenham Hotspur and Aston Villa all linked.\nDON’T MISS: Reece James brutally called ‘new Jack Wilshere’ following ‘strange’ Chelsea decision\nPedro Neto enjoys different Chelsea fortunes\nNeto followed Dewsbury-Hall to Chelsea over the summer, joining from Wolverhampton Wanderers in a £54m (€64.8m / $67.9m) deal.\nThe forward had to settle for a role as a substitute towards the start of his Chelsea career, but he is now a regular starter for Maresca when fit.\nNeto scored a great goal to give Chelsea a point against Arsenal earlier this month but was missing for the win over Leicester after picking up a knock while representing Portugal during the international break.\n“Pedro Neto could be the signing of the season. Step by step he has shown his qualities and his talent on the left-hand side and he has been superb for Chelsea of late,” Petit continued.\n“He’s taking advantage of a position where some players have failed and that’s a great thing for Chelsea.\n“You can see that there is more fluidity as well with the strikers and their movements and I’ve been really impressed with his performances.\n“He is often the main threat for Chelsea and now it’s just about improving his goals and assist stats. He is playing with confidence and overall, Enzo Maresca should be very happy.”\nREAD MORE: Chelsea remain huge fans of £100m-rated Prem striker, with second thriving attacker also in view\nChelsea transfers: Huge striker battle; stunning Barcelona rumour\nMeanwhile, TEAMtalk can reveal Chelsea have expressed interest in signing Arsenal striker target Alexander Isak from Newcastle United.\nIsak is reluctant to sign a new contract with Newcastle as he wants to play Champions League football and also believes he can get a better offer elsewhere.\nChelsea have enquired about Isak and have been told that he will cost a mammoth £115m (€137.8m / $144.6m) to sign.\nBarcelona pair Jules Kounde and Ronald Araujo are two other players Chelsea have been linked with.\nReports in the Spanish press claim Chelsea are looking to test Barca’s resolve with a sensational £125m (€149.8m / $157.2m) double bid for Kounde and Araujo.\nWhile Chelsea do hold long-term interest in Kounde, it would be a big shock if such a massive offer ended up being launched.\nHow well do you know Chelsea’s players?",
  "word_count": 763,
  "scraped_at": "2026-02-14T02:26:24.525476",
  "_text_extracted": true
}