{
  "article_id": "4b32a2cf9911",
  "url": "https://theathletic.com/4212825/2023/02/19/european-super-league-fans-survey/",
  "title": "European Super League : This week was a glimpse of what that world could look like",
  "date": "20230219T061500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool vs Everton, Paris Saint-Germain vs Bayern Munich, AC Milan vs Tottenham Hotspur, Arsenal vs Manchester City, Borussia Dortmund vs Chelsea, Barcelona vs Manchester United.\nFrom Monday to Thursday, this week’s football fixtures have offered night after night of glamorous, high-profile match-ups between some of European football’s elite clubs.\nAdvertisement\nThose games listed above came in three different competitions — the Premier League, Champions League and Europa League — but it is not difficult to imagine a scenario where that’s the midweek schedule in a new European Super League.\nLast week, A22 Sports Management — the company offering its vision for a revamped European football structure — published “the preliminary results of a comprehensive dialogue with stakeholders across Europe on the future of club football”, which outlined its grand vision in more detail.\n“A European football league should be an open, multi-divisional competition with 60 to 80 teams, allowing for sustainable distribution of revenues across the pyramid,” its report said. “Participation should be based on annual sporting merit and there should be no permanent members.”\nThe last time a European Super League was proposed, in the spring of 2021 (albeit in a very different form, with just its 12 founding members involved), there was a huge backlash among supporters, with fans protesting and clubs involved — including Manchester United and Liverpool — publicly apologising as a result.\nNearly two years have passed since all that happened, so The Athletic wanted to gauge what fans think of these latest proposals.\nWe conducted a survey of our readers, and also asked our reporters covering matches across Europe this week to speak to supporters to get a sense of what they make of the potential new structure.\nA common theme emerged when we asked fans to tell us what they thought was the motivation behind the proposals for a new European football setup.\nEighty-one per cent of respondents to our survey said self-interest is the driving force for a European Super League.\nJust one per cent said a desire to create the best possible competition is at the heart of the plans.\n“It’s greed and self-interest, pure and simple,” said Dan Kay, 45, a Liverpool season-ticket holder who lives in the Mossley Hill area of the city. “The bigger, richer clubs want even larger slices of the pie than they already have, and have no sense of their responsibility to filter cash down the pyramid to help support smaller clubs and the grassroots of the game.\nAdvertisement\n“There will be some who think it would be good news for Liverpool, as it would bring in increased revenues. So for those whose primary motivation is money, the appeal is clear. But for many of us ‘legacy’ supporters, it would be bad. It was Bill Shankly who said the league championship is Liverpool’s ‘bread and butter’, and even for all the joy and pride our successes in Europe have brought, a Super League would take us further away from that.”\nKent Lundkvist is an Arsenal supporter from Sweden. “It’s bulls**t,” he said. “I want the traditional game. It would be a bad thing for Arsenal. I like it the way it has always been. Money is the motivation, of course. I just hate it.”\n“The motivation is money, money, money,” said Danny Mills, 42, who lives in Scotland but is a regular at Manchester City matches. “The big European clubs are envious of the Premier League and its commercial pulling power — they want a piece of that pie. Over half of the top 20 clubs, in terms of revenue generated, come from the Premier League. Real Madrid, Barcelona, the Milans and Bayern Munich simply can’t accept this.\n“The old guard in Europe have always had their own way in their own domestic leagues and they can see, as the Premier League gets bigger with every broadcasting deal signed, that if they don’t do something, they become marginalised.”\nThe proposed Super League would appear to be more of a threat to the Champions League than domestic leagues, as games in it would be played on midweek nights not at weekends.\nEuropean football’s elite club competition has produced countless iconic moments and its success is part of the appeal of a Super League — the idea being that the Champions League is great, so let’s have more of it.\nBut almost three-quarters (70 per cent) of respondents in our survey said they did not want the existing Champions League format to be altered.\nThey may not want a Super League, but change is afoot one way or another.\nAdvertisement\nUEFA, European football’s governing body, has already announced plans to expand the Champions League, starting in the 2024-25 season. In the new setup, there will be 36 teams in one overall league table, not the current eight groups of four. Each club will play eight group matches (up from the six now), all against different opponents rather than facing just three teams twice in the present format, four at home and four away.\nGO DEEPER\nChampions League: How the competition will look from 2024\nFor some fans, a structure that offers more games between the continent’s elite teams than we get now is an attractive proposition. That is something the Super League idea taps into.\n“I’m a Manchester United fan, but I also like PSG,” said Kang Do-youn, 28, from Busan in South Korea.\n“This is my first time watching PSG in Paris. Last time I came to Europe, I watched Real Madrid vs Juventus in the Champions League.\n“I like the Champions League very much, but I also love the idea of the Super League. Every match would be a big event. That to me sounds very positive. So if PSG are playing Bayern Munich or Manchester United or Chelsea, that’s better.”\nBut doesn’t the Champions League already offer that setup?\n“Yes, but sometimes Chelsea, Arsenal, Manchester United or Barcelona aren’t in the Champions League because they don’t qualify,” Kang adds. “But if or when the Super League opens, we will see all the big clubs.\n“It would be positive if Asian fans or American fans had the opportunity to see these matches in their countries. I think a lot of people want the Super League more than the Champions League because there are always some weak teams in the Champions League. Super League would be all the really big clubs.”\nThat global appeal will be attractive to A22, with markets beyond Europe an obvious area for growth.\n“No one talks about how Euro-centric the media coverage has been about the supposed outcry of fans with regards to the possibility of a Super League,” says Debraj, a Barcelona supporter who responded to our survey. He has also been a Leicester City fan since 2013.\nAdvertisement\n“You’ll show Chelsea fans saying it’s a death knell for football (how ironic) and fan associations releasing statements on behalf of the continent, thereby completely disregarding the opinions of the majority of fans outside Europe. The clubs may be based in Europe and the competition they’re trying to replace is European, but that does not preclude our standpoint.\n“People outside continental Europe, from Africa and Asia, make up the bulk of fanbases anyway. If it wasn’t for us, the Premier League with its storied clubs like Liverpool and United wouldn’t be earning the hundreds of millions in revenue from international broadcast rights and merchandising. We may not be native to our clubs’ locale, but we’re just as much invested in them, if not more — waking up in the wee hours to catch prime-time Champions League games.\n“The guardians of European football cry foul and claim that this venture is only in it for the money, which is pretty ironic coming from FIFA and UEFA. The Champions League, with its extended teams, is not much different from what the Super League might realistically look like.\n“There are no good guys. If the Super League is able to offer its partnering clubs a more lucrative offer than UEFA and higher quality of matches, then I’m all for it. We fans owe no loyalty to anyone but our clubs. If the Super League is better for football and evens out the playing field to an extent, then good.\n“I’ll miss the Champions League anthem, though.”\nOne of the most striking results of The Athletic’s survey was that 74 per cent of respondents think a European Super League will exist within 20 years, and 39 per cent expect it to happen inside the next decade.\n“I don’t like it at all, but I understand why there are certain teams pushing for it,” said Adam Latham, 32, an Everton season ticket holder from the Wirral, Merseyside. “Our Premier League is an outstanding product and most of the other domestic leagues in Europe are inferior, so they want a piece of what we’ve got.”\nAdvertisement\nSteve Cavalier is co-chair of the Tottenham Hotspur Supporters’ Trust and has been supporting the north London club for 50 years. He took the scenic route to Tuesday’s Champions League last-16 first leg away to Serie A champions AC Milan, travelling across France and into Italy by train.\n“We refer to it as ‘the European Super League debacle’,” Cavalier says. “I don’t think it’s something that fans want. One of the beauties of the Champions League in its current format is that you’ve got to qualify for it, which then makes domestic leagues more interesting. If you had someone running away with the title every season, the league loses its interest.\n“Without that jeopardy, European qualification would mean nothing. Yes, it’s exciting to play teams like AC Milan, Barcelona or whoever, but if those fixtures happened twice every season it ceases to be special.\n“We haven’t been to Milan for a decade, and it’s exciting to be here. We’ve had great trips to Lisbon, Frankfurt and Marseille as well this season, but you’d lose that level of interest if it was a regular fixture.”\nTwenty-one per cent of respondents to our survey said they would stop following their Premier League club if they broke away from competing in their own country to join a continent-wide Super League (although the plan presented by A22 is not being pitched as a replacement for the major domestic leagues but as an addition to them, as the current UEFA competitions are).\nTim Payton is an Arsenal Supporters’ Trust member from Finsbury Park, north London.\n“From an Arsenal perspective, I fear we would end up playing endless meaningless group games in a franchise structure designed primarily for revenue generation rather than sporting entertainment,” Payton says.\n“I also worry that there are already too many football games. This is a burden on the pockets of fans but we also need to protect the players. They are overplayed, which is a personal risk to their health and will also see a lessening in the quality of the matches.”\nThilo Dalwigk, 63, is a Bayern Munich fan and travelled to Paris this week to watch his side take a first-leg advantage over the French champions in the last 16 of the Champions League. He has barely missed any of Bayern’s European ties since he was a teenager.\nAdvertisement\n“I’m against it (a Super League), because there would no longer be possibilities for many teams,” Dalwigk says. “I heard that it might be 40 or 60 teams, but it would always be the biggest clubs playing each other, the same matches. That is not in the spirit of football or competition. The majority of German fans would be against this, because it would make the gap between the rich clubs and the poorer clubs even bigger.\n“At the moment there is inequality, yes, from a financial point of view. But there’s a big difference between a club like Bayern, with the wealth it has built over a long period of time, and, for example, Manchester City or Paris Saint-Germain, where they are using the money from whichever country (in their cases, Abu Dhabi and Qatar). To generate your own money, as a business, is not the same as a club becoming successful just because someone wants to spend billions of euros on the club.\n“Since I was 15, I’ve travelled all over Europe watching Bayern. I have been to every final Bayern has reached during that time. I enjoy travelling over Europe to watch the Champions League. But if it’s the Super League and if it’s only playing against the same teams, that would be very unattractive. If it’s a closed Super League, I won’t travel.”\nThere is clearly no homogenous supporter view. Opinions will be shaped by where you are based, the club you follow and what you want football to be.\nGO DEEPER\nWhat are the implications of a European Super League for women's football?\nBut perhaps the thoughts of Connor Woodahl, an Arsenal fan from San Diego in the US state of California, are a neat summary of the difficulties facing supporters on this issue.\n“I’m not a fan of a Super League,” Woodahl says, “but also I don’t want to be left out of it. I definitely don’t want Arsenal to be the first to sign up, but I’d probably accept it if they were the last.”\nOther contributors: Greg O’Keeffe, James McNicholas, Tim Spiers\n(Top photo: Robbie Jay Barratt – AMA/Getty Images)",
  "word_count": 2227,
  "scraped_at": "2026-02-14T01:37:04.309952",
  "_text_extracted": true
}