{
  "article_id": "4b780a145c63",
  "url": "https://www.nytimes.com/athletic/6464247/2025/07/03/lionel-messi-inter-miami-contract-mls-club-world-cup-argentina/",
  "title": "What were hearing on Lionel Messi future : Inter Miami contract talks , links to Argentina and the 2026 World Cup",
  "date": "20250703T083000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The world that surrounds Lionel Messi is one that is fraught with speculation — that’s certainly nothing new for a superstar athlete of his caliber.\nMessi has been in the U.S. for two years with Inter Miami, thousands of miles away from his home country Argentina, where a media frenzy that tracked his every move became toxic up until 2022. After Messi led his nation to World Cup glory in Qatar that year, the reporting became much friendlier, but that hasn’t stopped many in his homeland from guessing how his final years as a professional soccer player might unfold.\nAdvertisement\nWithin 24 hours of Miami’s elimination from the Club World Cup, Messi’s future with his MLS club became a talking point. Pundits in Argentina hypothesized that Messi would consider leaving MLS for a more competitive league. And according to at least one report, contract negotiations between Messi and Miami had stalled.\nIt’s true that Messi’s Miami contract expires at the end of 2025 and that he hasn’t signed a renewal yet. But he is still expected to extend his stay in MLS at least through 2026, as The Athletic reported in April, and a source close to the player, speaking anonymously to protect relationships, has reiterated that in recent days.\nIn Messi’s world, though, it doesn’t take much to stir the pot.\nEven before the Club World Cup, and after Miami had conceded 15 goals in five matches in May, the Argentinian columnist and broadcaster Ariel Senosiain described Messi’s club as “a franchise that does not even remotely do justice to his unparalleled career.”\nSenosiain’s theory was that Messi’s competitive streak, which at times in 2025 has looked more like displeasure, is a result of “the lack of excellence around him,” which in turn has affected his mentality within a less competitive environment. Senosiain pondered whether the Argentina manager Lionel Scaloni is growing concerned about Messi’s situation inside a Miami dressing room that is “cold” in comparison to the family-like setting of the current world champions.\nOther reporters in Argentina suggested that Newell’s Old Boys, Messi’s boyhood club, would be the player’s preferred destination. But Newell’s finished ninth in the latest Apertura tournament after finishing 25th in the final Primera División standings in 2024. That’s hardly a more competitive environment, considering that Miami, despite the club’s limitations from a squad-building perspective, has either won a trophy or competed among the best teams in MLS since Messi’s arrival.\nAdvertisement\nFurthermore, the quality of Argentina’s first division has lessened considerably over the past decade. Brazilian clubs are the powerhouses in South America, as evidenced during this Club World Cup.\nPalmeiras and Fluminense advanced to the quarterfinals, while Boca Juniors and River Plate, Argentina’s biggest clubs, crashed out in the group phase. Argentine football, however, is among the most passionate and stress-filled competitions in world football. That alone can raise the level of play. But why would Messi, who played at the top level of the sport for nearly two decades, consider leaving the comforts he enjoys in South Florida for a mid-table club that hasn’t won a trophy since 2013?\nIt may pain Argentines and especially Newell’s supporters to hear this, but for now, Messi’s club loyalties are set in pink and black.\nAnd what about those pining for his return to Barcelona? A possible reunion with the Catalan club gained internet steam this week, too, but that scenario is even more unlikely.\nIn Miami, Messi has surrounded himself with people he trusts. That includes his close friends and ex-Barça teammates Sergio Busquets, Jordi Alba and Luis Suárez. The head coach Javier Mascherano is a former Barcelona and Argentina teammate too. The Miami co-owners Jorge and Jose Mas and David Beckham are club executives and decision-makers who have Messi’s trust — something that Barcelona president Joan Laporta does not.\n“Honestly, I have barely spoken to Laporta. Maybe once or twice at the most,” Messi told Mundo Deportivo in 2023, after he revealed to the Spanish outlet that he would sign with Inter Miami.\nTo Senosiain’s point, yes, Messi has clashed with MLS referees and opponents and has looked irritated with Miami’s struggles in 2025. Even so, by not re-signing yet, it’s more likely that Messi is playing the long game and seeking to establish even more leverage over his current employer rather than genuinely eyeing an exit. It’s a basic negotiation tactic.\nAdvertisement\nOn Tuesday, the source within Messi’s inner circle told The Athletic that the Miami captain “knows perfectly well what the goals, motivations, and also the challenges of coming to Miami are.”\nThe same source, who is familiar with the eight-time Ballon D’Or winner’s thoughts on his MLS stint, relayed that Messi understands Miami is “a young club, that it’s a new project, and Messi is there to contribute and to help.”\nIf Messi is frustrated with MLS’s lack of real progress since he arrived, it’s clear that he’s open to accepting it. One can assume that the most important reason for that is the well-being of his family. Messi has been seen at his sons Thiago and Ciro’s Miami academy matches, beaming with pride alongside his wife Antonella. It certainly appears that Messi has settled nicely in Florida.\nHe’s gracious when local residents see him at a stoplight. He recently paused to sign a jersey for a starstruck fan outside Miami’s training facility. In other words, life is good for the Messi family. His old club Paris Saint-Germain delivered a healthy dose of reality on the pitch with the 4-0 drubbing in Atlanta, but the fact that Miami was even in the second phase of the Club World Cup was arguably more surprising than Sunday’s final score.\n“Well, the game was what was expected,” Messi said after the loss to PSG. “They are a big team, (and) they are the champions of the last edition of the Champions League. It was the game we expected, we tried to do the best possible and we left a good image at the Club World Cup level.”\nIn the inaugural match of the competition, Miami struggled against Egyptian champion Al Ahly. The game ended 0-0, and after tangling with opposing players both physically and verbally, Messi was clearly annoyed as he trudged off the field after the final whistle. A win over Porto changed everything for Miami, though. Messi’s free-kick goal led to a shock result and the first time that an MLS side had defeated a European club in an official competition.\nMiami then nearly defeated Palmeiras, which would have sent the club to the top of Group A. But after Palmeiras stormed back from 2-0 down to force a draw, Messi stood at the center circle after the final whistle, ruing what could have been.\nAdvertisement\nNow Miami are left to shift their focus to the MLS regular season and a potential title run. It’ll be quite the change to go from facing PSG to setting up a tactical plan to defeat CF Montréal.\nAnd still, Messi remains locked in contract negotiations with Inter Miami over a deal that would keep him in Miami colors through the 2026 World Cup and the opening of the new Miami Freedom Park stadium. The Athletic understands that both parties are aligned on a renewal, although it’s unclear when Messi will put pen to paper.\n“The stars are aligning for something great, for a beautiful future for the club and for Lionel. It’s solely his decision,” Jorge Mas told FDP Radio in April. “I expect that within 60-90 days, we’ll have to determine all of this. My hope has always been — and everything we’re doing — is to see Messi play at our new stadium in 2026. Hopefully, that happens.”\nDespite this week’s rumor mill, there’s an acceptance in Argentina that Messi has chosen a more tranquil life in the U.S. after two decades as the world’s best player. After that 2022 World Cup win, Messi’s retreat to Fort Lauderdale with his family was justified, and his place within the Argentina national team isn’t jeopardized because he plays in MLS.\nScaloni has said on more than one occasion since 2022 that Messi will be part of the national team for as long as he wants to be. The manager is unbothered by the perception of MLS that some may still have in Argentina. Messi has scored six times for Argentina during the CONMEBOL 2026 World Cup qualifying campaign, tied for second best behind Colombia’s Luis Díaz, who has seven.\nMessi’s impact in Miami, and perhaps even in MLS as a whole, should not be judged on how many goals he scores or whether he can repeat as MLS MVP. He’ll have a future stake in the club, which means he’ll influence both the sporting department and commercial interests of the club for years to come.\nOn Sunday, Alba was asked if he believes that Messi will prepare for the 2026 World Cup by continuing to play his club football on U.S. soil.\nAdvertisement\n“Yes, why not?” replied Alba, who recently extended in Miami through 2027. “I can’t see him playing anywhere else, honestly. But it’ll be his decision. The decisions he has made have always been wise ones, and obviously I believe he can compete at the next World Cup.”\nLast week, as Messi turned 38, Newell’s named a stand at their home stadium after him. It’s a tremendous honor – but not one that will likely change Messi’s club future.\nAnything can happen between now and December. But a return to previous stomping grounds seems like an implausible reality.\n(Top photo: Franck Fife/AFP via Getty Images)",
  "word_count": 1604,
  "scraped_at": "2026-02-14T01:49:39.532405",
  "_text_extracted": true
}