{
  "article_id": "4b876272b433",
  "url": "https://www.nytimes.com/athletic/6629630/2025/09/15/lamine-yamal-spain-barcelona-injury/",
  "title": "Lamine Yamal Spain - Barcelona painkillers row – should we be worried ? ",
  "date": "20250915T074500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Until last night, Hansi Flick’s Barcelona had never won a game in La Liga that Lamine Yamal had to miss through injury. But that’s not why the German was so angry in the build-up.\nIn his pre-match press conference a day before Sunday’s home meeting with Valencia, Flick said Yamal would miss the game because of an injury sustained on international duty last week — and he blamed the Spanish Football Federation (RFEF).\nAdvertisement\nHe said Yamal had already joined the Spain camp with a minor problem, that he did not complete a full training session with the national team and that he even took painkillers to play against Bulgaria and Turkey, World Cup qualifiers that Spain won 3-0 and 6-0 (with Yamal playing 73 minutes in Sofia and 79 minutes in Konya).\nIt feels like a stretch, to put it mildly, that any player from a dominant national team should have to take painkillers to play the first two games of World Cup qualifying — even more so if that player only turned 18 in July.\n“I’m very sad about this,” Flick said on Saturday. “Spain have the best team in the world. The best players in every position, unbelievably good. Maybe when we talk about taking care of young players, it’s things like that. This is not taking care of players.”\nFlick’s Barca did not have to pay the price for Yamal’s absence. The Catalans thrashed Valencia 6-0 in their first home game of the season, played at the 6,000-capacity Estadi Johan Cruyff stadium by the club’s training ground because of delays in the Camp Nou works (more on that to come from The Athletic this week).\nBesides Yamal, Flick left Raphinha on the bench because he turned up late to a morning training session that same day. The Brazilian came on at half-time and scored two goals. One of them was assisted by Marcus Rashford with a fantastic cross from the left.\nYamal, though, was watching from the stands. Right now, Barca see him as a very serious doubt for Thursday’s Champions League match at Newcastle United.\nSources at the RFEF — who, like all those cited here, preferred to speak anonymously to protect their position — said they had been surprised by Flick’s words. They said Barcelona had never disclosed Yamal had any problems before he joined up, and that is why he was not discharged from international duty.\nAdvertisement\nThey said Paris Saint-Germain had sent them a medical report explaining that Fabian Ruiz had a minor injury, and it was decided the midfielder should be released, and that the same happened with Crystal Palace’s new signing Yeremy Pino.\nThey also highlighted that Yamal’s personal physiotherapist in the national team, Fernando Galan, is the same one he has at Barcelona, adding: “How is it possible they did not know Yamal was injured?”\nSpain reported last week that Yamal suffered minor discomfort in his lower back after the first game against Bulgaria. It did not prevent Luis de la Fuente from starting him three days later.\nYamal wanted to play the Turkey game, and that played a part in his selection — but this is where elite coaching and backroom staff have to step in. Yamal is a fearless footballer with the world at his feet. It’s those around them who have to make sure he knows the risks in his job.\nTake the example of Pedri. Back in the summer of 2021, then 18, he was asked to play for Spain in both the European Championship and Olympic Games. Across all competitions with club and country, he competed in 73 matches during the 2020-2021 campaign.\nIn the following three seasons, he missed 85 games, as muscular problems kept piling up. He wasn’t able to recover his best version until last season, when Barcelona conducted a revamp in their fitness and medical team. He is now in the form of his life.\nBarcelona labelled Yamal’s latest injury as a groin problem, contrary to the lower-back pain Spain reported. However, Barca sources say it is the same issue.\nAfter the win against Valencia, Flick was asked whether he had heard from the RFEF since his strong words. “No, I have not,” he replied.\nIt does not seem Flick will soften his stance with this one — and he has his reasons. Pedri isn’t the only precedent to look back to at Barcelona: there is also the case of Ansu Fati.\nAdvertisement\nOnce labelled as the next great hope coming through Barca’s academy — and given Lionel Messi’s No 10 shirt after the Argentinian left — he suffered a meniscus tear when he was 18. He underwent surgery but the recovery process did not go well. He was rushed back into action and soon after coming back, he tore his hamstring.\nFati refused to undergo surgery again, and he has never been the same player. Now out on loan at Monaco, he has never fully returned to his best. He is yet to make his debut for the French club, as he is still trying to build full match fitness.\nAnother Barca youngster, Gavi, is in a critical spot too. The 21-year-old came back to action last season after recovering from an anterior cruciate ligament injury that he sustained in 2023 while playing for Spain. Three weeks ago, he picked up a new injury in that same knee while training at Barcelona.\nClub sources said his ligaments are not affected, but his meniscus is. Gavi remains sidelined while Barca doctors monitor his knee on a daily basis. It is not yet dismissed that he undergoes surgery to fix the problem, if the pain continues.\nThe list is very long, and the pattern is clear. Flick has a strict no-risk policy when it comes to injuries with his team — and he demands footballers be open about their fitness.\n“Players need to be honest with me and the team regarding whether they are fit to play,” he said in a pre-match press conference before last April’s Champions League semi-final second leg against Inter. He played that important tie with Jules Kounde sidelined, and pushed Robert Lewandowski back from forcing a quick return from a hamstring tear. Ferran Torres started up front instead.\nHe will make no exception with Yamal now, and in a football world where teenagers are bursting onto the scene as never before, that should be a case to set boundaries in the industry.\n(Top photo: Flick and Yamal in May last season; Elianton/Mondadori Portfolio via Getty Images)",
  "word_count": 1090,
  "scraped_at": "2026-02-14T01:49:53.053213",
  "_text_extracted": true
}