{
  "article_id": "4b9a321a5cc1",
  "url": "https://www.teamtalk.com/liverpool/arne-slot-sack-liverpool-transfers-dayot-upamecano-virgil-van-dijk",
  "title": "Liverpool : Emphatic Arne Slot sack update revealed as Liverpool eye new centre - back amid Van Dijk  decision  ",
  "date": "20260129T233000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nEmphatic Arne Slot sack update revealed as Liverpool eye new centre-back amid Van Dijk ‘decision’\nA fresh report has outlined four key reasons why Arne Slot will NOT be sacked by Liverpool anytime soon, while the club are exploring an eye-catching centre-back signing amid an update on Virgil van Dijk’s future.\nPressure has been ramping up on Slot. Even though he led the Reds to the Premier League title last season, the performances this season haven’t been consistent enough, especially given close to £450million was spent on new additions last summer.\nThis has led to speculation that Slot could be relieved of his duties, but Liverpool’s fantastic 6-0 win over Qarabag FK on Wednesday has eased that pressure, with a reliable source explaining why FSG will back the Dutchman.\nLiverpool to back Arne Slot amid sack rumours\nIt was claimed earlier on Thursday that Liverpool are ‘expected to part ways’ with Slot at the season’s end amid growing fears there’s an irreparable disconnect between the players and manager.\nHowever, The Athletic’s James Pearce – who specialises in covering Liverpool – those hoping Slot will be sacked are going to be disappointed.\nPearce insisted Liverpool’s hierarchy have ‘no plans’ to sack Slot and pointed to four reasons as to why.\nThe quartet of reasons are: 1) No breakdown in relations with senior executives. 2) Acknowledgement the mass squad changes have lead to a ‘transitional’ season. 3) Numerous key, long-term injuries. 4) Continued belief Slot can and will turn the season around.\nDelving deeper into those four reasons, Pearce wrote: ‘They currently have no intention of following the lead of Man Utd, who dispensed with Ruben Amorim, or Chelsea, who parted company with Enzo Maresca.\n‘Both teams have enjoyed an initial upturn in fortunes following the appointments of Michael Carrick and Liam Rosenior. However, in both cases, change was brought about by a breakdown in relations with club executives as well as results and performances.\n‘At Liverpool, Slot’s bond with sporting director Richard Hughes remains strong. It was Hughes who led the search for Jurgen Klopp’s successor in 2024 and was convinced that Slot was the outstanding candidate to take over. That belief in his coaching acumen remains.\n‘Unlike Amorim and Maresca, Slot is a Premier League title-winning boss. That buys you time and patience. There’s sympathy for everything that the Dutchman has had to contend with since the glory of last season sent expectation levels through the roof.\n‘From the tragic loss of Diogo Jota to the sweeping changes to the squad that led to talk internally that this was always likely to be a transitional campaign, and the succession of injury setbacks.\nPearce added: ‘The Anfield hierarchy aren’t blind to the problems that have blighted performances and caused Slot’s side to be so inconsistent.\n‘Questions are frequently asked about what could have been done differently. Even taking into account the hurdles placed in Liverpool’s way, no one would argue that having just 36 points after 23 league games is anything other than unacceptable.\n‘Slot has certainly made mistakes. He hasn’t been able to impact matches as he did so often last season. But he’s still the same coach who previously hit such heights, and there’s faith internally that he will turn things around.\n‘Their form in the Champions League, taking 18 points out of a possible 24, including the scalps of Real Madrid, Atletico Madrid and Inter, shows what this team is capable of.’\nWant more breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nLiverpool eyeing Bayern Munich star – but there’s a problem\nMeanwhile, Bayern Munich centre-back Dayot Upamecano is still being heavily linked with a sensational move to Liverpool.\nThe 27-year-old French international is out of contract at the season’s end, and Bayern are doing all they can to convince him to sign an extension.\nRespected journalist Florian Plettenberg previously claimed that Upamecano is reluctant to pen fresh terms as he is “waiting” to join Liverpool or Real Madrid.\nTEAMtalk transfer insider, Fraser Fletcher, has also been able to verify that Liverpool are indeed interested in signing Upamecano.\nHowever, sources tell us the Reds harbour concerns over the salary commitments it will take to hijack Bayern’s deal.\nUpamecano has already verbally agreed a new Bayern contract worth €20m per season. That roughly to equates to a weekly wage of around £330,000-a-week.\nIf Liverpool were to match that offer, Upamecano would become the club’s third highest paid player behind only Van Dijk and Mo Salah.\nThis is clearly a huge outlay, but if he doesn’t agree a contract extension at Bayern he will be available on a free transfer, so he’s certainly a player to keep an eye on.\nLiverpool make big Van Dijk decision\nDespite Liverpool still prioritising the signing of a new centre-back, as evidenced by the interest in Upamecano, the expectation is that club captain Van Dijk will stay for another season.\nVan Dijk’s current contract expires in the summer of 2027, and Liverpool are prepared to risk losing him on the free at the end of next season, rather than selling him this year.\nIndeed, according to Football Insider’s Pete O’Rourke, a decision has been reached and Liverpool do NOT plan to offload Van Dijk prematurely.\nO’Rourke explained: “Liverpool plan to allow Virgil van Dijk to see out the end of his contract and have no intention of selling him in the summer.\n“The 34-year-old’s current deal at Anfield doesn’t expire until the summer of 2027, and he is still seen as a key part of the Reds’ plans for next season as the club captain.”\nThe situation is not so clear with Ibrahima Konate, however, given his deal expires at the end of the current campaign.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 996,
  "scraped_at": "2026-02-14T01:50:01.807996",
  "_text_extracted": true
}