{
  "article_id": "4ba72850a364",
  "url": "https://www.caughtoffside.com/2024/03/06/newcastle-plotting-bargain-move-for-25-year-old-premier-league-utility-man/",
  "title": "Newcastle Transfer News : Magpies pushing to sign Lloyd Kelly on a free",
  "date": "20240306T111500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United are keen on signing the Bournemouth defender Lloyd Kelly at the end of the season.\nAccording to a report from Daily Mail, Newcastle are hoping to sign the player on a bargain when his contract expires in the summer. The 25-year-old has been a reliable performer for the Cherries in the Premier League and he has been linked with other clubs as well.\nSigning a player of his quality and experience on a free transfer would represent a major bargain for Newcastle and it remains to be seen whether they can get the deal done.\nThey will need to add more quality and depth to their defensive unit in the summer and Kelly will certainly improve them. The 25-year-old is versatile enough to operate as a central defender as well as a left-back. The opportunity to join an ambitious club like Newcastle could be an attractive proposition for him.\nLloyd Kelly could be temped to join Newcastle\nNewcastle played in the Champions League this season, and although they might not secure a top four finish next year, they have an exciting project and enormous resources to build a formidable squad in the near future. Kelly could be tempted to join them in the summer, if there is a lucrative proposal ahead of him.\nThe report further states that Steve Nickson is currently pressing ahead with talks to sign the player at the end of the season and Newcastle hope to appoint him as their next sporting director.\nKelly is in the peak year of his career and he will hope to help Newcastle win major trophies in the coming seasons.",
  "word_count": 272,
  "scraped_at": "2026-02-14T01:48:46.208559",
  "_text_extracted": true
}