{
  "article_id": "4bf9a9b92ed2",
  "url": "https://www.bbc.com/sport/football/articles/c3g3r62p3kdo",
  "title": "Euro 2024 final : England  58 years of hurt  extended after loss to Spain",
  "date": "20240714T221500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Defeat extends England's '58 years of hurt'\n- Published\nEngland failed to end '58 years of hurt' as their Euro 2024 final defeat by Spain in Berlin meant the 1966 World Cup remains their only men's trophy.\nFor the fourth game in a row England came from behind, but this time they fell short with Mikel Oyarzabal scoring a late winner to snatch a 2-1 victory.\nNico Williams' strike early in the second half put Spain ahead but Cole Palmer's brilliant leveller looked set to send the game into extra time before Oyarzabal pounced four minutes from time.\nThis was the second European Championship final in a row that Gareth Southgate's side have lost, after falling to Italy on penalties in 2021, with 1966 their only major tournament final before that.\nThe country has yet to win senior football tournament abroad, with the 1966 success and Women's Euro 2022 final - which England won - both at Wembley.\nSouthgate's contract runs until the end of the year so this could prove to be his final major tournament after eight years in charge.\nEngland started slowly in Germany, with performances criticised and the Three Lions close to elimination twice, but the past two rounds gave England fans cause to dream - until losing to Spain, the outstanding team throughout this Euros.\nSouthgate says 'now not the time' to decide future\n- Published15 July 2024\n'England have the best squad, but not the best team'\n- Published15 July 2024\n'Lowest of the lows' - England stars 'devastated' after loss\n- Published15 July 2024\nThe pain goes on\nWhen England won their home World Cup in 1966, beating West Germany 4-2 in the final with Geoff Hurst scoring a hat-trick, many fans may not have imagined that would remain their only success for at least 60 years.\nSince then a combined 29 men's World Cups and European Championships have passed and, until 2021, they had never been back to a final.\nEngland fans dwelled on the agonising near misses in the knockout stages of major tournaments - Diego Maradona's handball in 1986, losses on penalties to Germany in 1990 and 1996. Current boss Southgate missed a penalty in the latter too.\nAnd there were all the years they did not even get close, failing to qualify for the 1994 World Cup and 2008 Euros - and a few group-stage exits - too.\nIt felt as if all that may change in 2021 when England reached the final in the continent-wide Euro 2020, although most of their games were at Wembley, including the showpiece against Italy.\nThey took an early lead but ended up losing on penalties after extra time. Having waited 55 years for that final, it is a fine achievement by Southgate and his team that the next one followed just three years later.\nBut this one too ended in tears.\nThe Lionesses won the 2022 European Championship, beating Germany 2-1, also at Wembley.\nEngland grow into the tournament - but fall short\nIt is fair to describe England's Euro 2024 campaign as a slow burner.\nA win over Serbia was followed by drab draws against Denmark and Slovenia in the group stage.\nHad the Danes netted a late winner in their final group game against Serbia, England would have finished second - and arguably had a tougher route to the final.\nSome England fans threw cups at Southgate after that disappointing Slovenia result and memes flooded social media showing the manager in various overly cautious scenarios.\nThe Slovakia game in the last 16 was not much better in terms of performance and they were set to be eliminated until Jude Bellingham's injury-time overhead kick sent it to extra time - with Harry Kane then netting the winner.\nSome supporters still called for Southgate to be sacked after that game - something Ivory Coast did with their coach during this year's Africa Cup of Nations on their way to winning the tournament.\nBut the mood seemed to lift when he changed from a back four to a wing-back system against Switzerland in the quarter-finals. They were 10 minutes from elimination before Bukayo Saka struck and his side went on to win on penalties.\nThey trailed yet again in the semi-final against the Netherlands but Ollie Watkins netted in the 90th minute to send the Three Lions to another final.\nThe latter two displays were not amazing, and did involve spells where they went into their shells, but it was still a far cry from those early matches.\nEuros fever grew across England - and Germany - as thousands of fans travelled just to be near to the action, but they are coming home without the trophy.\nWho shone as they came so close?\nThere were no Hurst-style hat-trick heroics - but there are still plenty of names who will go down in English footballing folklore.\nChelsea's Palmer became just the fourth player to score in a men's final for England after Hurst, Martin Peters and Luke Shaw.\nBayern Munich striker Kane, still without a first trophy of a goal-laden career, netted three goals, extending his record as England's all-time top scorer, to secure a share of the Golden Boot. Real Madrid's Bellingham scored twice - including his amazing last-gasp equaliser against Slovakia.\nThat boosted Bellingham's chances of winning the Ballon d'Or, having won the Champions League and La Liga in his first season with Real too.\nAll five goals were crucial with England never winning a game by more than one goal.\nAston Villa striker Watkins did not have a lot of game time - but he had one of their greatest moments with a neat turn and finish in the final minute of the Dutch semi-final.\nArsenal winger Saka netted a late equaliser against Switzerland in the quarters, and in the resulting shootout - a cathartic moment for a player who missed a penalty in the 2021 final.\nEverton keeper Jordan Pickford's save from Swiss defender Manuel Akanji's spot-kick also set them up for that shootout success as it was the only one missed of nine taken.\nWhat now for Southgate and England?\nSouthgate's contract runs out at the end of this year - and it is not certain if he will stay on.\n\"I don't think now is a good time to make a decision like that,\" he said afterwards.\n\"I need to talk to the right people. It's not for now.\"\nEngland are next in action on 7 September when they go to Dublin to take on the Republic of Ireland in their first 2024-25 Nations League game.\nTheir homecoming will be three days later against Finland. Those games are in the second division of the Nations League after England were relegated last time.\nIf Southgate was to leave at the end of his deal, he would see out the six Nations League games but be gone before qualifying started for the 2026 World Cup next year.",
  "word_count": 1158,
  "scraped_at": "2026-02-14T02:08:01.877273",
  "_text_extracted": true
}