{
  "article_id": "4c07b57ccff2",
  "url": "https://www.africanexaminer.com/bayern-hit-nine-real-madrid-and-liverpool-win-as-new-champions-league-kicks-off/",
  "title": "Bayern Hit Nine , Real Madrid And Liverpool Win As New Champions League Kicks Off",
  "date": "20240918T121500Z",
  "domain": "africanexaminer.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Hit Nine, Real Madrid And Liverpool Win As New Champions League Kicks Off\nLatest Headlines, Sports News Wednesday, September 18th, 2024(AFRICAN EXAMINER) – Bayern Munich became the first team to score nine goals in a game in the modern Champions League as the new format of Europe’s elite club competition kicked off on Tuesday, with title holders Real Madrid and Liverpool also among the winners.\nHarry Kane scored four goals, including three penalties, as Vincent Kompany’s Bayern hammered Croatian champions Dinamo Zagreb 9-2 at the Allianz Arena.\nMichael Olise scored twice on his Champions League debut, while Raphael Guerreiro, Leroy Sane and Leon Goretzka were also on target for the home team in Germany.\nDinamo were 3-0 down at the break but scored twice in two minutes just after half-time to give the hosts a scare, with Bruno Petkovic and Takuya Ogiwara on target. But Bayern then scored six times from the 57th minute onwards.\n“An amazing game, a bit of a crazy game,” Kane told broadcaster DAZN.\n“It’s the first time I’ve scored three (penalties) in a game. That doesn’t happen at all really.”\nBayern had been the last team to score eight in a Champions League match, when they beat Barcelona 8-2 in the quarter-finals in 2020.\nIt was a remarkable way to mark the opening night of the brand-new Champions League, with the competition now featuring 36 teams all pooled together in one giant league instead of the old group stage.\nEvery participant now plays eight games against eight different opponents, with the top eight teams at the end of the league phase advancing automatically to the last 16.\nThose finishing from ninth to 24th will go through to a play-off round to decide the remaining sides in the last 16, while the bottom 12 will be eliminated.\nUEFA, European football’s governing body, introduced the new format to ward off the threat of a breakaway Super League by the biggest clubs, but it also hopes the changes will breathe new life into the competition.\nThere was plenty of excitement around the continent on Tuesday, with reigning champions Madrid made to work hard before beating VfB Stuttgart 3-1 at the Santiago Bernabeu.\nKylian Mbappe marked his first game in the competition with Real by scoring the opening goal just after half-time.\nHowever, Deniz Undav equalised midway through the second half for a Stuttgart side appearing in the Champions League for the first time since 2010.\nReal nevertheless emerged victorious as Antonio Rudiger headed them back in front against his old side seven minutes from time, and Brazilian youngster Endrick got the third goal in stoppage time.\n“I know I can do more, each game I feel better and now I’m scoring goals, and I’m happy here,” new signing Mbappe told broadcaster Movistar.\n“What we know is that the Champions League has changed and it’s important to win quickly to see if we can qualify quickly or not.”\nLiverpool marked their return to Europe’s top table by coming from behind to win 3-1 away to seven-time champions AC Milan in Italy.\nChristian Pulisic gave Milan an early lead, but Ibrahima Konate equalised and Virgil van Dijk headed the away side in front before the interval. Dominik Szoboszlai then wrapped up the victory for Liverpool at San Siro.\nAston Villa enjoyed a 3-0 win away to Swiss champions Young Boys in Bern in their first ever match in the modern Champions League, 41 years after they last appeared in the old European Cup.\nYouri Tielemans and Jacob Ramsey scored in the first half for the 1982 European champions, and Amadou Onana completed their victory late on.\nVilla boss Unai Emery wanted his team to take three points as a tribute to the club’s former striker Gary Shaw, a member of their European Cup-winning side who died on Monday aged 63 after being injured in a fall.\n“Forty-two years (ago) they achieved winning the Champions League. We want to try and follow what that team achieved,” Emery said.\nElsewhere Juventus beat PSV Eindhoven 3-1 in Turin, with Kenan Yildiz opening the scoring in some style and Weston McKennie and Nicolas Gonzalez also netting. Ismael Saibari pulled one back.\nPortuguese champions Sporting beat Lille 2-0 at home, with impressive Swedish striker Viktor Gyoekeres on target before a Zeno Debast piledriver. The French side had Angel Gomes sent off.\nThe action continues on Wednesday, including a rematch of the 2023 final between Manchester City and Inter Milan.\nRelated Posts\nShort URL: https://www.africanexaminer.com/?p=97866",
  "word_count": 750,
  "scraped_at": "2026-02-14T02:11:06.649002",
  "_text_extracted": true
}