{
  "article_id": "4c11211bb8b4",
  "url": "https://www.90min.com/barcelona-confirm-new-contract-500m-release-clause-midfielder",
  "title": "Barcelona confirm new contract and €500m release clause for key midfielder",
  "date": "20241031T171500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona confirm new contract and €500m release clause for key midfielder\n- Fermin Lopez has signed a new contract with Barcelona\n- Deal will run until 2029 and includes huge €500m release clause\n- Midfielder made Barca debut last year\nBarcelona have confirmed midfielder Fermin Lopez has signed a new contact with the club that will run until 2029, with a release clause set at a whopping €500m (£419m).\nFermin enjoyed a breakout 2023/24 campaign despite Barca's difficulties under former boss Xavi Hernandez. The 21-year-old contributed 11 goals in all competitions, with only elite striker Robert Lewandowski outscoring him with 26.\nManchester United reportedly had a summer bid turned down for the midfielder, whose previous deal was due to expire in 2027.\nA statement from the club reads: \"FC Barcelona and Fermin Lopez have reached an agreement to extend the player's contract through to 30 June 2029. The young midfielder's buyout clause has been set at €500m.\n\"Pen was put to paper this Thursday at midday in the company of Barca president Joan Laporta; first vice-president Rafa Yuste; the director responsible for youth football Joan Soler; and director of sport Anderson Luis de Souza 'Deco'.\"\nFermin is one of a number of impressive Barca youngsters primed to enjoy the majority of his career in Catalonia. Pedri and Gavi have enjoyed more notable starts to their senior careers, though Fermin has now joined the pair as a Spain international having made his debut earlier in 2024.\nHe was part of the squad that won the Euros during the summer, though his only appearance came as a substitute in La Roja's final group game against Albania which they won 1-0. Fermin also won gold at the Olympics in Paris.\nHis sole start in La Liga so far this season arrived in the recent 4-0 thrashing of Real Madrid in El Clasico, while he also began the 4-1 thumping of Bayern Munich in the Champions League.\nEarlier in October, club president Joan Laporta confirmed Barca were also in talks with first-team trio Ronald Araujo, Pedri and Frenkie de Jong over new contracts.",
  "word_count": 349,
  "scraped_at": "2026-02-14T01:57:46.236086",
  "_text_extracted": true
}