{
  "article_id": "4c23bc601694",
  "url": "https://metro.co.uk/2025/07/30/michael-owen-says-three-clubs-can-win-premier-league-next-season-23790049/",
  "title": "Michael Owen says only three clubs can win the Premier League next season",
  "date": "20250730T164500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michael Owen rates Liverpool as the favourites to win the Premier League next season and has surprisingly dismissed Manchester City’s chances.\nLiverpool cruised to the Premier League title in Arne Slot’s first season at Anfield, drawing level with Manchester United on 20 titles.\nThe Reds became Premier League champions with four games to spare and would have finished even further ahead of second-placed Arsenal had they not taken their foot off the gas after the title celebrations.\nOwen has been impressed by Liverpool’s summer transfer business and says his former club look well-placed to defend their Premier League title.\nLiverpool have bolstered Slot’s squad with the signings of Florian Wirtz, Jeremie Frimpong, Milos Kerkez and Hugo Ekitike, while they could yet sign superstar striker Alexander Isak from Newcastle United.\nOwen is ‘firmly in Liverpool’s camp’ in regards to the 2025-26 title race and views Arsenal and Chelsea as their two biggest rivals.\nArsenal finished second for the third year in a row last season and have strengthened Mikel Arteta’s squad with the £64m signing of prolific striker Viktor Gyokeres.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nChelsea, meanwhile, qualified for the Champions League and won the Conference League in Enzo Maresca’s first season at Stamford Bridge, before winning the Club World Cup over the summer.\nWhile Owen is optimistic for Arsenal and Chelsea, he is less hopeful for Man City, who finished third last season as they chased a record-extending fifth successive Premier League title.\n‘Liverpool won the league by ten points last season despite getting two points from the last four games when they weren’t really trying,’ Owen said on talkSPORT.\nPremier League 2025-26 title odds\nLiverpool 7-4\nArsenal 9/4\nManchester City 3/1\nChelsea 9/1\nNewcastle United 33/1\n(Odds courtesy of Betfair)\n‘They could have won the league by 20 points. That’s winning the league by a mile.\n‘It’s going to take some effort for anyone else to catch them when it also looks like Liverpool will be stronger than they were last season. It’s going to be hard for anyone to catch them.\n‘I just think Man City were far off it last season and there’s been so much change over the summer.\n‘They’re almost unrecognisable given the amount of players they’ve brought in over the last year. I think that takes a little bit of time to bed in.\n‘Rodri will be back of course but there’s no guarantee with him coming back from an ACL injury.\n‘No, I don’t think they will win the Premier League. I don’t think so.\n‘I’m firmly in Liverpool’s camp, if there’s going to be an upset I think Arsenal and the big outside is maybe Chelsea. I don’t think Man City can bounce back that quick.’\nAsked about Arsenal’s hopes following the signing of Gyokeres, Owen added: ‘The pressure on him is incredible because Arsenal have been needing a centre forward for a long time now.\n‘All of a sudden they’ve got one and everybody thinks it’s the missing piece of the jigsaw.\n‘He’s then gone and taken number 14 [made iconic by Arsenal legend Thierry Henry], which just adds a load of pressure on.\n‘But if, if he strikes and he’s good, then Arsenal are serious challengers again. But if not, then I can’t see anything but Liverpool. This lad needs to be good for Arsenal, doesn’t he.’\nTwo clubs who were miles off challenging for the Premier League last season were Manchester United and Tottenham, who finished 15th and 17th respectively.\nMore Trending\nOwen expects improvement from both clubs but doubts they will climb back into Champions League contention under Ruben Amorim and Ange Postecoglou’s replacement Thomas Frank.\n‘They can’t be as bad as they were and if you give them some leeway, they knew they weren’t going to go down so they both prioritised that competition,’ Owen, 45, said.\n‘They won’t be as bad as they were but I can’t see them jumping straight back into the Champions League positions next season.\n‘But you would expect a far better showing from both clubs.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Benjamin Sesko makes decision over Newcastle transfer after Manchester United approach\nMORE: The seven players Chelsea are trying to sell this summer after £50m double exit\nMORE: Arne Slot praises Liverpool youngster after Yokohama FM win – but reveals where he must ‘learn’",
  "word_count": 788,
  "scraped_at": "2026-02-14T02:02:51.942373",
  "_text_extracted": true
}