{
  "article_id": "4c2833cc3d19",
  "url": "https://www.france24.com/en/live-news/20231003-castro-strikes-late-to-ruin-union-berlin-s-home-champions-league-debut-1",
  "title": "Castro strikes late to ruin Union Berlin home Champions League debut",
  "date": "20231004T001500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Castro strikes late to ruin Union Berlin's home Champions League debut\nBerlin (AFP) – Braga overturned a two-goal deficit to win 3-2 at Union Berlin on Tuesday, an injury-time strike from Andre Castro helping to spoil the German side's home Champions League debut.\nIssued on:\nSheraldo Becker took advantage of Union's early dominance to score a first-half brace.\nBraga, top scorers in the Portuguese league this season, fought back immediately, Sikou Niakate pouncing on a rebound to score, before Bruma unleashed a stunner to level the scores early in the second half.\nIn the fourth minute of injury time, Castro, subbed on with three minutes remaining, slid a fierce shot into the bottom left corner, to give his side the win.\nBraga manager Artur Jorge toasted his side's first Champions League victory, telling reporters \"it was a great win, but a great win which we fought for.\"\n\"In this giant stadium, to have gone 2-0 down and to come back to win, it's an outstanding performance.\"\nUnion manager Urs Fischer told the post-match press conference he lamented the \"completely bitter loss\", the side's sixth in a row.\n\"You ask yourself, how many hits can you take? But it's up to us to stand up after these blows.\"\n\"Right now there's a lot going against us,\" Union striker Kevin Volland told DAZN immediately after the match.\n\"We need to invest a whole lot of effort to bring the luck back to our side.\"\nBerlin debut\nUnion's first Champions League game in Berlin was moved by the club to the 74,000-seat Olympic Stadium ground of rivals Hertha Berlin, from the 22,000-seat Alten Foersterei home in the city's east.\nThe Hertha blue of the stadium and the Olympic running track were covered by Union red as Champions League football returned to the German capital for the first time since 2000, other than the 2015 final which was hosted by the city.\nUnion came in having lost five games in a row for the first time since 2004, when Champions League football was just a pipe dream for the then second division club.\nLike Union, who lost 1-0 to Real Madrid at the Santiago Bernabeu after an injury-time Jude Bellingham strike, Braga fought hard for no reward in their opening Champions League fixture, going down 2-1 to Napoli thanks to 88th-minute Niakate own goal.\nUnion broke through after 30 minutes, the length-of-the-field effort reminiscent of the counter-attacking goals which took them to an unlikely fourth place in the Bundesliga last season.\nWith Braga pushing for an opener, Czech midfielder Alex Kral regained possession and hit a 40-metre pass that reached Becker, who slotted past Matheus for Union's first ever Champions League goal.\nThe captain quickly doubled up, again showing his speed to latch onto a Lucas Tousart flick and blasting in again, before jumping the advertising hoardings to celebrate in front of supporters.\nWhile Becker's second had Union's fans in full voice at a rain-soaked Olympic Stadium, the side took their foot off the pedal slightly.\nBraga took swift advantage, Niakate tapping in on the rebound after Union goalie Frederik Ronnow failed to save a powerful long-range Ricardo Horta strike.\nUnion's sloppiness continued after the break, Josip Juranovic's failure to control a ball in the box gifting Braga a corner.\nThe Portuguese side took the invitation, Bruma giving Ronnow no chance with a precise and powerful long-range curler.\nWith the clock winding down, the visitors launched one last attack, Castro smacking a long-range effort along the ground and past Ronnow, bringing teammates running from the bench.\n© 2023 AFP",
  "word_count": 595,
  "scraped_at": "2026-02-14T02:25:00.756711",
  "_text_extracted": true
}