{
  "article_id": "4c5ba83b20e8",
  "url": "https://www.manningrivertimes.com.au/story/8935545/tom-sermanni-uncertain-on-matildas-future-ahead-of-newcastle-game/?cs=305",
  "title": "Tom Sermanni uncertain on Matilda future ahead of Newcastle game | Manning River Times",
  "date": "20250406T093000Z",
  "domain": "manningrivertimes.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Interim coach Tom Sermanni still doesn't know if Monday night's Matildas match against South Korea will be his last at the helm as the clock ticks down towards next year's Asian Cup.\nSubscribe now for unlimited access.\nor signup to continue reading\nIncredibly, the Matildas have been without a full-time coach for eight months, since Tony Gustavsson's official departure on August 1 last year.\nWhile the recruitment process has dragged on, and players' frustrations have intensified, Sermanni, who took the reins in September, has continued to front up with good humour.\nHe has managed Sam Kerr's long-awaited return to camp, and led the players through difficult friendlies that would ideally have served as a new coach's introduction.\n\"My last game? I don't know, I don't know,\" Sermanni said on Sunday.\n\"As I've said, if you'd asked me in September, would I still be here now, I'd probably say, 'It's probably doubtful', but I'm still here.\n\"And, whether this is my last game or not, I don't know that. I really, honestly don't know.\n\"But, I do think if it's not this one, it's more than likely the next one. It's a funny old game. You never know.\"\nFootball Australia has flagged a coach will be in place by mid-year, and their May-June friendlies against Argentina in Melbourne and Canberra could be a launching pad.\nLyon coach Joe Montemurro looms as that coach.\nMontemurro, who was among those to miss out to Gustavsson in 2020, is contracted at the French powerhouse, where Matildas defender Ellie Carpenter is among the stars, for another season.\nHe has left the door open for a link-up with the national team - though clearly that won't happen until his current season is completed.\nLyon have already won the French league but face Arsenal in the Women's Champions League semi-finals later this month - and the final is May 25.\nSocceroos great John Aloisi is among the outside contenders, but Montemurro is the clear front-runner.\nSermanni plans to continue his work on developing the squad after Friday night's 1-0 win over South Korea in Sydney.\nEverton midfielder and Adamstown Rosebud junior Clare Wheeler is in the mix to start at McDonald Jones Stadium on Monday night after an impressive and impactful 30-minute performance of the bench on Friday night.\nThe 27-year-old Newcastle Jets product was ruled out of the SheBelieves Cup in the United States in February, when the Matildas produced underwhelming performances, due to injury.\n\"Any time that I'm wearing the jersey, I want to do my best, and given any minute I just want to go out there and make an impact, and that's my mindset going into the game,\" Wheeler said on Sunday.\n\"Growing up in Newcastle, the first place I kicked a ball was not too far from the stadium. I've got a lot of friends and family in the stadium and to play in front of them is something that I'm really grateful for.\n\"As a team, we're all trying to do the best for club and for country so that we can put up our hand for selection come every camp and hopefully that Asian Cup. That's my focus. I want to be in that team and hopefully in the staring 11.\"\nDudley Redhead United Football Club junior Emily van Egmond forced a Korean own goal in the 54th minute on Friday night and Newcastle Jets centre-back Tash Prior could be injected after being left on the bench in the first exchange of the two-game series.\nGoalkeeper Mackenzie Arnold (arm) will miss a second-straight match through injury with Teagan Micah expected to start again.\nCarpenter, Hayley Raso and Katrina Gorry are also unavailable through injuries.\nBut Mary Fowler, who ignited Australia off the bench on Friday, is fit despite having her hamstring taped at training.\n\"She's fit and ready to be selected, and I think it'd be fair to say she'll be featuring in the game,\" Sermanni said.\nWhen asked how he could balance his wealth of options in attack, including Fowler, Caitlin Foord, Raso and Holly McNamara, Sermanni quipped: \"Just pass it on to the next guy. I'll quite happily exit stage left.\n\"I don't know who's coming in next, but they might have an entirely different system that they want to play,\" he added.\n\"But ultimately, from my perspective as a coach, you want to get your best players out on the field.\"",
  "word_count": 734,
  "scraped_at": "2026-02-14T02:02:35.588743",
  "_text_extracted": true
}