{
  "article_id": "4c6fd7525e9e",
  "url": "https://www.caughtoffside.com/2023/04/28/marseille-eye-balogun-transfer-from-arsenal-plus-zaha/",
  "title": "Marseille eye Balogun transfer from Arsenal plus Zaha",
  "date": "20230428T081500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marseille could have an interesting summer in the transfer window, which may lead them to exploring potential deals for Crystal Palace winger Wilfried Zaha and Arsenal striker Folarin Balogun.\nThat’s according to CaughtOffside columnist Jonathan Johnson in his latest Substack piece, with the French football expert discussing the prospects of Marseille strengthening their attack with both Zaha and Balogun this summer.\n“Obviously Wilfried Zaha’s going to be of interest to a number of clubs around Europe as he nears becoming a free agent,” Johnson wrote.\n“The rumoured interest from Ligue 1 clubs such as Marseille makes sense as the Ivory Coast international is a French speaker, so I think there’ll be a number of French clubs looking at him.\n“Marseille are one of those and I think they’re an attractive team for him as they prepare to qualify for the Champions League. I think they’re an ambitious team and an attractive project for him – Zaha’s in his 30s now and he’ll want a new challenge and to test himself at a higher level.\n“Marseille are looking to do smart business, so a proven player like this on a free who’d definitely have a key role in their squad makes sense for them. I haven’t heard anything concrete in terms of contacts just yet, but I do think it’s a potential move of interest for Marseille.”\nHe added: “The other one I’d keep an eye on with Marseille is Arsenal loanee Folarin Balogun. There’s been a lot of debate about Balogun’s future and his price tag, but personally I can see that link between Arsenal and Marseille being used again, perhaps in the form of a loan, or a loan with an option or obligation to buy.\n“It would be good experience for Balogun, but it also gives Arsenal at least a semi-guarantee to be able to cash in on him, whereas other clubs might not yet be ready to pay top dollar for a player who’s just had one successful season in Ligue 1, as impressive as he has been for Reims.”\nZaha is set to become a free agent this summer unless he signs a new contract with Crystal Palace soon, and one imagines there’ll be plenty of interest in the Ivory Coast international.\nBalogun, meanwhile, has shone in his time on loan in Ligue 1 with Reims, and it makes sense that Marseille could now be keen on a move to keep him in France for next season.\nIf Marseille could pull off both of these deals, that would have to go down as superb business that could help them challenge Paris Saint-Germain’s dominance in Ligue 1.",
  "word_count": 440,
  "scraped_at": "2026-02-14T01:55:54.928712",
  "_text_extracted": true
}