{
  "article_id": "4c82f7f752f8",
  "url": "https://www.africanews.com/2024/12/05/fifas-revamped-club-world-cup-draw-what-you-need-to-know/",
  "title": "FIFA revamped club World Cup Draw : What you need to know",
  "date": "20241205T160000Z",
  "domain": "africanews.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "USA\nThe world's biggest club football competition will be held in the United States next year, with the draw for the 32-team group stage taking place this Thursday.\nEuropean powerhouses Real Madrid and Manchester City , Lionel Messi 's Inter Miami , recent South American champions Botafogo and top clubs from Asia, Africa and Oceania are among the teams set to take part in the draw for the new FIFA Club World Cup .\nThe tournament, which used to be held in December each year, will be held in 11 U.S. cities from June 15 to July 13 in an expanded format of 32 teams instead of the previous seven. In the future, the Club World Cup will be held every four years, as will the National Team World Cup, which will be co-hosted by the United States , Mexico and Canada in 2026.\nHere's what you need to know about the Club World Cup draw, which takes place in Miami on Thursday at 6pm GMT.\nWhat is the Club World Cup?\nFIFA and its presidents have long coveted a prime pitch for club football.\nThe 2025 Club World Cup is FIFA's most ambitious project yet. It involves creating a month-long tournament in the mid-June-mid-July slot historically used by the men's World Cup, which attracts the largest number of spectators in world sport.\nThe new club competition follows the traditional 32-team format used by the World Cup from 1998 to 2022. Eight groups of four teams each, with the top two advancing to a 16-team knockout stage.\nIn allocating the 32 spots, FIFA attempted to strike a balance between getting the best, most watchable teams and allowing every country in the world to participate in the competition and develop.\nEurope got 12 places, South America six, Africa, Asia and North America four each. One place was allocated to Oceania and another to the host country, which is expected to change with each edition.\nTeams qualified by winning their continental championship between 2021 and 2024, or by placing highly through consistent results over those four seasons. Countries are limited to two entries, unless more of them have won titles. Brazil will send four different Copa Libertadores winners, and Mexico three CONCACAF champions. The other North American champion is the Seattle Sounders.\nWho will play?\nThe big names of Europe are present: Real Madrid , Manchester City , Bayern Munich , Inter Milan and Paris Saint-Germain . The current leaders of most of Europe's most powerful leagues are absent: Liverpool , Barcelona , Napoli and Sporting Lisbon .\nSalzburg secured the final European entry last season according to the FIFA ranking system, although they cannot be considered one of the best clubs in Europe: they are currently 32nd in the new Champions League rankings, which feature 36 teams.\nThe two big Argentinian clubs, River Plate and Boca Juniors , are present. The Brazilian and Mexican clubs are respectively Fluminense and Pachuca , both currently 16th in their domestic league standings.\nAfrica is represented by Al Ahly (Egypt), three times African champions in the last four years, and Mamelodi Sundowns (South Africa), owned by FIFA vice-president Patrice Motsepe.\nSaudi Arabia sends Al-Hilal , the 2021 Asian champions, who won the domestic league last season despite losing Neymar to a long-term injury.\nIf they stay fit, the tournament will welcome a new generation of stars such as Kylian Mbappé , Vinícius Júnior and Jude Bellingham of Real Madrid, Erling Haaland of Manchester City and Jamal Musiala of Bayern Munich.\nLionel Messi's Inter Miami will also be there, after FIFA decided in October to grant the team entry into the host country. Two other stars from Messi's generation will be missing: Cristiano Ronaldo 's Saudi club Al Nassr and Barcelona 's Robert Lewandowski failed to qualify for their continent's Champions League.\nWhy is Inter Miami playing?\nThe previous version of the Club World Cup reserved a spot for the host nation's champion. But this time, FIFA didn't wait until Saturday's MLS Cup championship game, when the LA Galaxy will host the New York Red Bulls . Neither will be in Thursday's draw.\nInstead, Inter Miami, with the power of Lionel Messi on the pitch and co-owner David Beckham , was awarded the Club World Cup hosting spot in October, based on the regular season standings. Inter Miami will play three group stage matches in Florida, including the tournament opener at Hard Rock Stadium.\nWhy do they play?\nMoney and a trophy. Which of the two is more prized by club owners is up for debate.\nFIFA president Gianni Infantino has promised hundreds of millions of dollars in prize money, with $50 million guaranteed for Europe's top teams, but it is not yet clear from where.\nFIFA signed a global broadcast deal with streaming service DAZN on Wednesday to make all 63 matches available for free. The value of the deal was not disclosed, and it allows the streaming service to sell the rights to public broadcasters.\nDAZN has close ties with Saudi Arabia, which promotes and hosts high-profile boxing matches. Saudi Arabia 's financial support for the Club World Cup is expected after it was confirmed next week that the kingdom will host the 2034 World Cup.\nThe new gold trophy was designed by Tiffany and has Infantino's name engraved twice on it. It also bears his signature.\nWhat is the history of the tournament?\nTraditionally, the European and South American champions competed in the Intercontinental Cup . From 1980 to 2004, the match was held in Japan, usually in December.\nIn 2000, FIFA launched a club world championship, contested in January by eight teams in Brazil. It was not repeated for almost six years.\nSince 2005 and until last year, the FIFA Club World Cup has been held every December, with a seven-team knockout format: the six reigning continental champions and the national champion of the host country. Japan, Abu Dhabi, Morocco , Qatar and, for the last edition last December, Saudi Arabia, have hosted the competition in rotation.\nThe annual event was unloved in Europe. The winner of the UEFA Champions League would usually arrive to play two games in four days and lift the trophy. Chelsea in 2012 were the only European team to lose in the last 17 years.\nWhen he was first elected in 2016, Mr Infantino spoke of the need for FIFA to build a bigger, more attractive and more lucrative club competition.\nIn his previous role as UEFA general secretary, he helped organise the Champions League, when Messi won the title at Barcelona and Ronaldo at Manchester United and then Real Madrid.\nFirst, Infantino struck a secret $25 billion deal for new tournaments, including a $3 billion, 24-team Club World Cup every four years starting in 2021. That plan was blocked by European soccer officials.\nAn agreement was reached to host an inaugural 24-team tournament in June 2021 in China. Europe was only to send six teams.\nNo broadcast or sponsorship deals had been announced at the start of 2020, when the tournament was scrapped due to the COVID-19 pandemic. The June 2021 slot was needed for the postponement of Euro 2020 and the Copa America.\nAfter the failure of the Super League project in April 2021, which shook European football, FIFA has reached an agreement for a 32-team Club World Cup.",
  "word_count": 1224,
  "scraped_at": "2026-02-14T02:11:20.844385",
  "_text_extracted": true
}