{
  "article_id": "4ca906775a78",
  "url": "https://theathletic.com/4151466/2023/02/03/nottingham-forest-transfers-relegation/",
  "title": "If Nottingham Forest can integrate latest signings , safety is in their grasp",
  "date": "20230203T154500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is a number that, without the benefit of context, has raised eyebrows throughout football.\nWith the arrival of free agent Andre Ayew, Nottingham Forest have made 29 signings this season. There were 22 arrivals in the summer and seven more in January.\nBut, beyond the obvious response of ‘How many?’, there is little more nuance to the situation. There has been a change in the recruitment team and the recruitment policy.\nAdvertisement\nForest’s mentality had been to sign younger players to invest in the long-term future. Now their determination to stay in the Premier League has inspired a bout of short-termism. Of the seven January signings, only Danilo, 21, is likely to significantly increase in value (although the standing of 29-year-old Gustavo Scarpa might also grow if he can sustain his early impact).\nThe others were all signed to play one role: help Forest avoid relegation.\nAfter the summer, Steve Cooper faced the huge challenge of turning a group of strangers into something resembling a team, a task he will now face again.\nThis will be helped by the fact that Forest have assembled a squad that now looks to have the strength in depth to give them a decent chance of staying clear of the bottom three — and that has always been the priority, regardless of what those outside of Nottingham might make of it all.\nJanuary did not bring about the spectacular video unveilings of the summer when players such as Jesse Lingard and Emmanuel Dennis were introduced on a nightclub stage featuring flashing lights, smoke and music.\nBut there is still excitement among the hierarchy about the new arrivals.\nWhen he pulled up at the gates of the Nigel Doughty Academy on deadline day, Miltiadis Marinakis, the son of Forest owner Evangelos, wound down his window to inform those gathered around the entrance that Felipe, the Brazilian defender, had already arrived to complete his medical.\nThe enthusiasm, commitment and ambition of the Marinakis family have shaped the club’s transfer strategy.\nLast summer, Forest had been offered Dinamo Zagreb keeper Dominik Livakovic, a Croatia international. But the opportunity to get Dean Henderson on loan from Manchester United was more alluring. Henderson has been a solid signing and the thigh injury he sustained in mid-January was a major blow.\nAdvertisement\nLivakovic, who then starred at the 2022 World Cup, was again an option in January. But once it became clear that Keylor Navas — widely regarded as being one of the best goalkeepers of his generation — was available, Forest did everything in their power to get their man. And it took some work.\nAn agreement was eventually reached between the player, Forest and his parent club, Paris Saint-Germain, to bring the Costa Rica international to Forest on loan for the rest of the season.\nThis time last year, Forest were only just starting to believe Cooper could lead them into the Championship play-offs. Now they are signing a former Real Madrid star who has three Champions League titles to his name.\nFans could be forgiven for thinking they are dreaming. No signing better exemplifies how far Forest have come in a short space of time: they are in a different world and their work in the transfer market reflects that.\nThat change in status had a huge influence on Forest’s outgoings too.\nMidfielder Lewis O’Brien was one of the best players in the Championship last season and had shown moments of promise following his £10million ($12.2m) transfer from Huddersfield in the summer. Left-back Harry Toffolo also made the same switch to the City Ground from Huddersfield.\nBut there was always a sense behind the scenes that having Toffolo playing for Forest in the Premier League was not quite sexy enough. This played a part in the more glamorous Renan Lodi joining on loan from Atletico Madrid later in the summer — the first of many Brazilian players to arrive.\nSteve Cook and Jack Colback were viewed in a similar light. The role of the players who had helped Forest end their two-decade-long exile from the top flight will not be forgotten. But having invested more than £150m to strengthen the squad during the summer, there was an expectation within the hierarchy that the new signings would play a more prominent role in the Premier League.\nAdvertisement\nSix months after signing O’Brien and Toffolo, Forest were happy to sanction moves away. O’Brien’s potential move to Blackburn Rover will depend on the Championship club’s appeal to the EFL over late paperwork.\nO’Brien, Cook and Omar Richards have not been included in Forest’s updated 25-man Premier League squad. They won’t play for the club again this season.\nToffolo had actually been in Belgium, ready to formalise a loan move to Anderlecht, only for Forest to have a late change of heart in not wanting to leave themselves short, with Richards still working to regain fitness following a fractured leg.\nLoic Bade’s loan from Rennes was cancelled without him playing a game from Forest. Meanwhile, Cook had the chance to move to Luton Town or Blackburn, with Stoke City also interested. He opted to remain at Forest.\nEarlier in the window, Forest explored the possibility of finding a move for striker Dennis, another of the summer signings, who joined from Watford for £20million. But the situation was complicated by the fact that he had already played for Watford this season, which meant that the only moves available to him were to clubs outside of Europe if he wanted to play again before August. There was interest from Saudi Arabia and MLS but nothing concrete came to fruition.\nA flurry of younger players moved out on loan, including Billy Fewster (Scunthorpe United), Ateef Konate (Oxford United), Dale Taylor (Burton Albion) and Aaron Donnelly (Port Vale).\nBut the only confirmed departures were Brandon Aguilera, who joined Esteril on loan, Josh Bowler (Blackpool loan), Loic Mbe Soh (Guingamp loan) and Jordan Smith (Huddersfield loan), the academy product who joined the club aged seven. With Smith’s contract set to expire in the summer, it is likely to mark the end of his 21-year association with Forest.\nBut there was still a need to strengthen.\nAdvertisement\nAs well as Richards, Giulian Biancone (knee), Moussa Niakhate (hamstring), Cheikhou Kouyate (hamstring) and Taiwo Awoniyi (groin) have all suffered long-term injury problems.\nRecord £25m signing Morgan Gibbs-White is sidelined with an ankle problem, Lingard limped out of the pre-match warm-up against Manchester United on Wednesday with an Achilles issue, Henderson could be out for a month with his thigh injury and Ryan Yates has struggled with what Cooper describes as an illness. His inclusion in the Premier League squad is hopefully an indication that it is nothing too serious.\nAs the Forest players warmed up on the Old Trafford pitch before their Carabao Cup semi-final second-leg clash, the broad-shouldered figure of Filippo Giraldi could be seen keeping a careful eye on proceedings from a position close to the dugouts.\nThe sight of the Forest sporting director taking a watching brief is not unusual, either at the City Ground or at the Nigel Doughty Academy. He is a hands-on figure who likes to form his own opinions on the Forest players and on what might be required to strengthen the squad.\nCooper had a positive relationship with head of recruitment George Syrianos and head of scouting Andy Scott before they departed last October but Cooper has been quick to forge an association with Giraldi.\nGiraldi’s impact has been felt during this first window of his tenure, with the seven players signed including three Brazilians, a Champions League winner and some crucial Premier League experience.\nAs 33-year-old defender Felipe (capped twice by Brazil) completed the formalities of his move from Atletico Madrid on Tuesday, Forest had already effectively secured their first deadline-day signing in the form of 30-year-old Jonjo Shelvey.\nThe midfielder had undergone his medical the day before but, with Newcastle preparing for their Carabao Cup semi-final against Southampton in the evening, they requested the announcement of his signing be delayed until after the game to avoid any “distractions”. It also allowed the midfielder to attend the fixture and say his goodbyes to the Newcastle fans, as he took a final walk on the St James’ Park pitch at half-time.\nAdvertisement\nForest had already added some significant Premier League experience through former Burnley striker Chris Wood. While completing that deal, Forest had enquired about Allan Saint-Maximin, which would have been another audacious capture.\nForest had made a similar declaration with the capture of Danilo earlier in the window. Danilo, one of the brightest young talents in Brazilian football, arrived for £16m from Palmeiras, reuniting him with his former team-mate Scarpa, who had already settled into life in Nottingham after signing as a free agent.\nScarpa and Lodi have been drafted in to translate for Danilo, who speaks little English but has already started lessons. Their services will not be required for Felipe, who arrives with a basic grasp of English — not to mention Champions League experience.\nForest were also offered the chance to sign Rennes winger Kamaldeen Sulemana, who ended up moving to Southampton for £22m instead. A very late effort was made to add another Brazilian, 18-year-old Angelo Gabriel, but the logistics of signing a player from Santos, on deadline day, were too complicated. He is a target the club might revisit.\nBut even after the transfer window had closed, Forest found a way to add to their attacking options. The 33-year-old Ghana captain Ayew, who played under Cooper at Swansea, signed a deal until the end of the season after leaving Al Sadd in Qatar.\nAltogether, it will see Cooper needing to gel a squad together — again. “We do have to repeat the process a little bit, yes,” he said. “I try not to cry too much about the injuries, but we have picked them up. We wanted to add to what we had going, in terms of building a team and getting momentum in our play.\n“At least now we have enough people playing who understand what we want — and that can hopefully snowball with the new boys. There will always be good players who might not see me as their favourite person in the world, but I would rather have that.”\nThe proof will be in the pudding but after some chaotic activity, Forest have ended the window stronger than how they started it.\n(Top photo: Jon Hobley/MI News/NurPhoto via Getty Images)",
  "word_count": 1750,
  "scraped_at": "2026-02-14T01:59:41.723511",
  "_text_extracted": true
}