{
  "article_id": "4cad971f1ec4",
  "url": "https://www.90min.com/posts/psv-eindhoven-1-1-arsenal-player-ratings-12-12-23",
  "title": "PSV Eindhoven 1 - 1 Arsenal : Player ratings as rotated Gunners end group stage with draw",
  "date": "20231212T233000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSV Eindhoven 1-1 Arsenal: Player ratings as rotated Gunners end group stage with draw\n- Eddie Nketiah's first-half strike put Arsenal ahead before Yorbe Vertessen tied things up\n- Gunners had a goal ruled out for offside late on\n- Mikel Arteta's side had secured top spot in their group before kick-off\nBy Tom Gott\nArsenal ended their successful Champions League group-stage campaign with a hard-fought 1-1 draw with PSV Eindhoven.\nTop spot in their group had already been secured but Arsenal still gave their all in search for three more points here. Mikel Arteta named a mixed starting lineup but went strong off his bench, although the final ball was missing from Arsenal's play for the vast majority of the night.\nEddie Nketiah fired Arsenal ahead late in the first half before Yorbe Vertessen tied things up early in the second, ensuring the spoils were shared in Eindhoven.\nHow the game unfolded\nPSV could have opened the scoring after just a few minutes. The Dutch side flew forwards and Patrick van Aanholt was denied a tap-in from close range, before Ricardo Pepi's follow-up was somehow diverted away from danger by Gabriel.\nVertessen struck the post with a header ten minutes later and the dangerous Johan Bakayoko fizzed wide from range, with Arsenal's rotated side clearly lacking fluidity in the opening stages.\nArsenal's first half-sight of goal came shortly before the 30-minute mark as Mohamed Elneny's low drive from outside the box hit the outside of the post and went wide.\nThe Gunners slowly started to find their feet in the game and Nketiah fired his side ahead shortly before half-time. Picking up Reiss Nelson's cut-back, Nketiah arrowed his strike into Walter Benitez's bottom corner to send his side into the interval ahead.\nIt was a harsh scoreline on PSV but the Eredivisie leaders quickly made amends after the break. Vertessen's sumptuous curled effort was placed perfectly as it dinked off the post and into the back of Aaron Ramsdale's net.\nIsmael Saibari struck the post soon after, before Jakub Kiwior thought he had nodded Arsenal ahead. The defender rose highest to convert from a free-kick with ten minutes to go but the offside flag was quickly raised as Gabriel, who had jumped almost on top of his teammate, had made his run too early.\nArsenal had a late scare when Guus Til went charging down on goal, but the substitute failed to make the most of his counter and drove wide of Ramsdale's goal.\nArsenal player ratings vs PSV (4-3-3)\nGK: Aaron Ramsdale - 6/10 - Some nice saves when called upon. Could do absolutely nothing about the equaliser.\nRB: Cedric Soares - 6/10 - Really impressive in attack in the first half but undid his good work with a sloppy start to the second. Caught out of position for the equaliser.\nCB: William Saliba - 7/10 - An outrageous challenge early on to stop PSV going ahead. Did miss an interception for the equaliser but that was largely because he was out of position covering for Cedric.\nCB: Gabriel Magalhaes - 7/10 - A goal-saving tackle of his own on what was a busy, but impressive evening for the Brazilian.\nLB: Jakub Kiwior - 4/10 - Torched by Johan Bakayoko. Simply didn't have the required pace but, as a natural centre-back, he shouldn't be expected to.\nDM: Jorginho - 6/10 - Pulled the strings for Arsenal in the first half but failed to match that level after the break. Became somewhat of a liability in defence.\nCM: Mohamed Elneny - 6/10 - A solid cameo. Many fans wanted to see Nwaneri here but Elneny proved his worth with a decent, all-round showing.\nCM: Kai Havertz - 7/10 - Buzzed around with real confidence. Looks to be enjoying his football and made sure those around him knew that with some lovely flicks and passes.\nRW: Reiss Nelson - 7/10 - Really took his chance. Grabbed the assist for Nketiah's opener in a creative showing that saw him cause plenty of problems for PSV's defence.\nST: Eddie Nketiah - 7/10 - Nketiah wasn't particularly involved in proceedings but, when he did get the chance to work his magic, he made no mistake with a finish of real quality.\nLW: Leandro Trossard - 3/10 - Looked awkward out on the left. His attacking output was limited, while the Belgian was also guilty of not doing enough to help out in defence either.\nSubstitutes\nSUB: Declan Rice (61' for Cedric) - 6/10\nSUB: Ben White (61' for Saliba) - 6/10\nSUB: Martin Odegaard (61' for Elneny) - 6/10\nSUB: Emile Smith Rowe (88' for Havertz) - N/A\nSUB: Gabriel Jesus (88' for Nelson) - N/A\nSubs not used: Karl Hein (GK), David Raya (GK), Reuell Walters, Oleksandr Zinchenko, Lino Sousa, Ethan Nwaneri, Bukayo Saka\nManager\nMikel Arteta - 5/10 - In a match which meant absolutely nothing to Arsenal, Arteta's refusal to give any minutes to his exciting youngsters will be the only thing anybody remembers about this game. Did Jesus really need those two minutes off the bench?",
  "word_count": 847,
  "scraped_at": "2026-02-14T01:51:13.784547",
  "_text_extracted": true
}