{
  "article_id": "4cae5d61cfb9",
  "url": "https://metro.co.uk/2025/06/04/chelsea-playing-club-world-cup-2025-23330464/",
  "title": "Why are Chelsea playing in the Club World Cup 2025 ? ",
  "date": "20250604T170000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea’s season isn’t over quite yet, with the Blues currently stateside to take part in the FIFA Club World Cup 2025.\nThe expanded 32-team Club World Cup is taking place across 11 cities in the United States and is running from June 15 to July 13.\nThe tournament includes teams from all six continental confederations and features Premier League sides Manchester City and Chelsea – but not the likes of Arsenal, Manchester United and Liverpool.\nSo, why exactly are Chelsea taking part in the Club World Cup this summer?\nWhy are Chelsea in the Club World Cup?\nClubs automatically qualify for the tournament if they have won a continental club competition in one of the four most-recent seasons before the 2024/25 campaign.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAs one of the more recent winners of the Champions League in 2021, Chelsea are therefore eligible for the tournament.\nThe remaining teams are made up of the highest-ranking clubs in the respective continental ranking systems.\nEurope is the most-represented continent with 12 clubs, followed by South America with six competing sides.\nThere are four clubs each from Asia, Africa and the North American and the Central American Federation. Oceania only gets one spot while the US, as hosts, have been given an extra place.\nFIFA rules state that a maximum of two teams from the same country can take part, which is why Chelsea and Manchester City, who have both won the Champions League in the four years prior to this season, will be involved this summer at the expense of their Premier League rivals.\nFIFA Club World Cup 2025\nGroup A\nPalmeiras – Winners of the 2021 Copa Libertadores\nPorto – Fifth-best ranked eligible team in the UEFA four-year ranking\nAl Ahly – Winners of the 2020/21 CAF Champions League\nInter Miami – Winners of the 2024 MLS Supporters’ Shield\nGroup B\nPSG – Second-best ranked eligible team in the UEFA four-year ranking\nAtletico Madrid – Sixth-best ranked eligible team in the UEFA four-year ranking\nBotafogo – Winners of the 2024 Copa Libertadores\nSeattle Sounders – Winners of the 2022 CONCACAF Champions League\nGroup C\nBayern Munich – Best ranked eligible team in the UEFA four-year ranking\nAuckland City – Best OFC Champions League winners in the OFC four-year ranking\nBoca Juniors – Second-best ranked eligible team in the CONMEBOL four-year ranking\nBenfica – Seventh-best ranked eligible team in the UEFA four-year ranking\nGroup D\nFlamengo – Winners of the 2022 Copa Libertadores\nEsperance de Tunis – Best-ranked eligible team in the CAF four-year ranking\nChelsea – Winners of the 2020/21 UEFA Champions League\nLos Angeles FC – Winners of the play-in match\nGroup E\nRiver Plate – Best-ranked eligible team in the CONMEBOL four-year ranking\nUrawa Red Diamonds – Winners of the 2022 AFC Champions League\nMonterray – Winners of the 2021 CONCACAF Champions League\nInter Milan – Fourth-best ranked eligible team in the UEFA four-year ranking\nGroup F\nFluminense – Winners of the 2023 Copa Libertadores\nBorussia Dortmund – Third-best ranked eligible team in the UEFA four-year ranking\nUlsan HD – Best-ranked eligible team in the AFC four-year ranking\nMamelodi Sundowns – Second-best ranked eligible team in the CAF four-year ranking\nGroup G\nMan City – Winners of the 2022/23 UEFA Champions League\nWydad AC – Winners of the 2021/22 CAF Champions League\nAl Ain – Winners of the 2023/24 AFC Champions League\nJuventus – Eighth-best ranked eligible team in the UEFA four-year ranking\nGroup H\nReal Madrid – Winners of the 2021/22 UEFA Champions League\nAl Hilal – Winners of the 2021 AFC Champions League\nPachuca – Winners of the 2024 CONCACAF Champions League\nRed Bull Salzburg – Ninth-best ranked eligible team in the UEFA four-year ranking\nClub World Cup format and how it works\nThe teams in each of the eight groups play each other once and the top two teams from each group will progress to the knockout stage of the competition.\nThe knockout stage will consist of a Round of 16, quarter-final and semi-final stage, before the final itself takes place on July 13 at the MetLife Stadium in New Jersey.\nMore Trending\nClubs were warned by FIFA before the tournament that they must take their strongest squads to the US.\nChelsea's Club World Cup fixtures\nChelsea vs Leon (June 16, 8pm, Atlanta)\nFlamengo vs Chelsea (June 20, 7pm, Philadelphia)\nES Tunis vs Chelsea (June 25, 2am, Philadelphia)\nChelsea’s previous Club World Cup campaigns\nChelsea have appeared in two Club World Cups before – in 2012 and 2021 following their Champions League triumphs in the respective years.\nThe west Londoners – who as the European champions were parachuted into the tournament in the semi-final stage in 2012 – beat Mexican outfit Monterrey in the last four before suffering a shock defeat to Brazilian side Corinthians in the final.\nChelsea finally got their hands on the trophy in 2021, however, beating Al-Hilal in the semi-finals and then Palmeiras in the final.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Liam Delap sends message to Nicolas Jackson over striker position after Chelsea debut\nMORE: John Obi Mikel ‘frustrated’ by Chelsea star lined up for summer transfer\nMORE: Chelsea open talks to sign £17m Jadon Sancho replacement during Club World Cup",
  "word_count": 936,
  "scraped_at": "2026-02-14T02:09:11.433197",
  "_text_extracted": true
}