{
  "article_id": "4ccd100ab763",
  "url": "https://www.caughtoffside.com/2024/12/14/daniel-farke-praise-alex-cairns-leeds/",
  "title": "Alex Cairns : Farke heaps praise on Leeds  keeper despite 0 appearances",
  "date": "20241214T234500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Daniel Farke has hailed Leeds United back-up goalkeeper Alex Cairns as ‘one of the best’ at the club in terms of his application at training.\nCairns joined Leeds from Salford City in the summer but despite boasting vast experience in the Football League, he’s yet to make an appearance for the club.\nLeeds United ace urged to join Championship rivals in January!\nThe 31-year-old finds himself stuck behind first-choice Illan Meslier, while Karl Darlow has been on the bench for every Championship fixture so far this season and made one appearance in the EFL Cup.\nWith that in mind, some Leeds supporters might be surprised to find Cairns as the centre of conversation during Farke’s pre-match press conference ahead of Saturday’s 1-1 draw with Preston North End.\nNevertheless, Cairns came in for high praise from his manager thanks to his exemplary attitude.\nDaniel Farke heaps praise on Leeds back-up star Alex Cairns\n“I love him, I have to say,” Farke said of Cairns (via Leeds United News). “First of all, it’s good because we don’t have to play against him in the cup competitions anymore, he was outstanding against us and I don’t want to be reminded about this game because he was great in his performance and in what he did with our penalties.\n“Overall I actually love him because he came in knowing exactly about his role, we’ve got Illan, we’ve got Karl, top goalkeepers for this level. But he’s chipped in and tries to prove in each and every training session that he’s the best one that we have.\n“I want these players to know their role, but also not to rest. He wants to improve each and every day, he’s one of the hardest-working lads and it’s always a pleasure to have him around because he’s competitive and professional, but always in a good mood with a smile on his face.\n“He’s got a good sense of humour and in the dressing room he’s motivational for each and every player, discussing with Illan and Karl about the players of the opponents, to give a hint here and there.\n“He’s an experienced lad, obviously not played on the highest level before so it’s not like he’s already won a Champions League. But it means he has a hunger and desire to deliver on this level. It was totally the right choice to have him with us, he’s obviously club developed and has a high identification.\n“I speak quite often about the white blood running through these lads’ veins and Alex is definitely one of them. We need these type of players who more or less every day work their hardest and leave their heart on the pitch. He works his socks off because of the identification with this club.\n“How mature he is in the dressing room, it’s not always about the players who play each and every second, it’s about the group. Sometimes a player who is not that much in the spotlight has the same value for the group. That is my feeling with Alex.”",
  "word_count": 510,
  "scraped_at": "2026-02-14T02:26:24.515185",
  "_text_extracted": true
}