{
  "article_id": "4d0551e7235b",
  "url": "https://www.arsenal.com/news/13-things-you-need-know-about-neto",
  "title": "13 things you need to know about Neto",
  "date": "20240831T010000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Our deadline-day capture of Neto on loan from Bournemouth has induced a wealth of experience into the dressing room at Emirates Stadium - but what do you know about our latest recruit?\nHe’s played in four countries alongside some of the best players in world football, and been a Premier League regular over the past couple of campaigns, but there’s so much more to know about our Brazilian shot-stopper.\nLearn a few new things about Neto:\nGoalkeeping pedigree\nNeto always seemed destined to be a goalkeeper, as his father Betao, played professionally in Brazil, notably representing spells with Araxa and Botafogo. “My father was also a goalkeeper and was my great inspiration,” he has previously said. \"I wasn't going to run from one side to the other on the pitch: I wanted to save the team by stopping goals.”\nMajor change\nAt just 12 years old, however, Neto moved 600 miles from his hometown of Araxa to Curitiba to join the academy of Athletico Paranaense. “The beginning was very hard,” he admitted. “Me, my mum, my dad, we cried every day. We didn’t have a telephone, so we had to go to the public telephone to speak.”\nTeenage debutant\nHowever that move paid off, as a 19-year-old Neto made his professional bow in August 2009, and enjoyed a dream debut as he kept a clean sheet in a 3-0 win over Barueri. The following season he was made first-choice, and after recording 13 shutouts in 36 games, he received his first call-up to the Brazil squad in September 2010.\nFlying at Fiorentina\nHe made a £3 million move to Fiorentina in January 2011, and after initially playing understudy to Artur Boruc and former Gunner Emiliano Viviano, when he got possession of the number one shirt, he never looked back. He kept an impressive 34 clean sheets in 101 matches, helping I Viola clinch two successive fourth-place finishes.\nLondon Olympian\nWhilst in Italy, he became an Olympian at the London 2012 Games with his first taste of international football. Representing Brazil’s under-23 side alongside Neymar, Marcelo, Hulk and Thiago Silva, he played against Egypt in Cardiff and Belarus at Old Trafford before dropping to the bench, but received a silver medal after a final loss to Mexico at Wembley.\nBuffon backup\nHis impressive stats at Fiorentina prompted Juventus to bring him to Turin to be an understudy to the legendary Gianluigi Buffon, and Neto felt it benefitted him immensely. “I learned a lot, especially with Buffon,” he said. “It was a real experience playing with Gigi, I could learn a lot of things. He always transmitted security and incredible leadership.”\nCup king\nBuffon being Juve’s number one meant that Neto was restricted to 11 league games, but he did make a huge contribution in the cups, helping his side clinch back-to-back domestic doubles. He played in every round of the Coppa Italia in 2015/16 and 2016/17, and kept clean sheets in both finals as Juve beat Milan and Lazio respectively.\nValencia adventure\nSeeking more gametime, Neto swapped Italy for Spain in July 2017 when he joined Valencia. After they had suffered a couple of poor seasons, the Brazilan helped restore Los Ches in the higher echelons of La Liga by again recording successive fourth-place finishes, just as he’d done with Fiorentina, returning them to the Champions League.\nPatience pays off\nHaving received his first call-up to the main Brazil squad in 2010, the shot-stopper remained a regular in Selecao squads for the next eight years, including making it to 2015 Copa America. However after being named 24 times on the bench without coming on, he won his one and only cap in a 5-0 win against El Salvador in December 2018 in Washington DC.\nHighest level\nThen came an opportunity to sign for Barcelona, and Neto took it as he battled with Marc-Andre ter Stegen for a starting spot. His debut came in December 2019 in the Champions League as Barcelona beat Inter in the San Siro. The following campaign saw him keep Juventus at bay in a 2-0 success, and play in an El Clasico against Real Madrid.\nEuropean pedigree\nNeto brings a wealth of continental experience to N5. He has played 10 times in the Champions League and was on the bench in Juventus’ final defeat to Real Madrid in 2017. He also has 22 Europa League games under his belt, reaching the semi-finals at Fiorentina and with Valencia twice, including beating beaten by ourselves on our run to the 2019 final.\nStar-studded teammates\nOur new signing has shared a changing room with some of the 21st century’s greatest players: Neymar, Mohamed Salah, Giorgio Chiellini, Buffon, Thiago Silva, Dani Alves, Luis Suarez and more, but one stands above all others: “Messi, 100 percent,” Neto says. “When you are close to him, and you see what he can do, and when he can do it — you see he’s the best player in the world.”\nPremier League dream\nIn August 2022 he made the switch to Bournemouth, and marked his debut by keeping Wolves at bay, fulfilling a lifelong ambition of playing in England in the process. \"The Premier League has always been my dream,” he said at the time. “When I was a young guy, my dream was always to be here, in the Premier League.”\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 914,
  "scraped_at": "2026-02-14T02:08:01.862746",
  "_text_extracted": true
}