{
  "article_id": "4d146108c877",
  "url": "https://metro.co.uk/2025/04/30/ian-wright-very-surprised-mikel-arteta-tactic-arsenals-defeat-psg-22999036/",
  "title": "Ian Wright  very surprised  by Mikel Arteta tactic during Arsenal defeat to PSG | Football",
  "date": "20250430T101500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ian Wright admitted he was ‘very surprised’ by Arsenal’s tactics during their Champions League semi-final first leg defeat to PSG.\nThe Gunners stunned defending European champions Real Madrid in the last round and were hoping for more success against Paris Saint-Germain.\nBut Arsenal will need to overturn a one-goal deficit in Paris next week after suffering a 1-0 defeat at the Emirates Stadium on Tuesday night.\nPSG dominated the early exchanges and Ousmane Dembele’s 4th-minute goal was enough to separate the sides.\nWright was ‘very surprised’ by Arsenal’s subdued start to the tie and says the Gunners ‘missed a trick’ by not taking the game to PSG.\n‘I don’t want to be negative about the team but I’m very surprised by the start of the game,’ he said on the Wrighty’s House podcast.\n‘I wasn’t expecting that start. To be honest I was expecting PSG to back off but it was the other way around, it was the opposite.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We should have been pressing them but it didn’t happen. That’s the disappointing thing, without being too negative.\n‘I think we really missed a trick in the way we started, we didn’t take advantage of the crowd who were ready to scream and shout.\n‘I think we got away with out really because we didn’t start like I thought we would, I was very surprised by that.\n‘I would love to hear Mikel Arteta’s post-match interview because I want to hear what he says about the start.\n‘I cannot fathom that you have a team like PSG come to your place and your tactics are to sit off them and let them play it out from the back and ease across the halfway line.’\nPSG have arguably been the standout team in this year’s Champions League, having eliminated Liverpool and Aston Villa in the last two rounds.\nThe French champions are 90 minutes away from the Champions League final but Wright still has hope that his beloved Arsenal can pull off a comeback.\n‘It’s only 1-0 but PSG did look impressive,’ Wright added. ‘But anyone would if you give them that much time and space in a semi-final at your place.\n‘PSG are going to try and finish that game in the first 20 minutes and Arsenal have to be very much ready for that.\nMore Trending\n‘We’re in the semi-finals and this is it for our season, the league is gone. This is all we’ve got left. So I was expecting a performance because this is it now.\n‘I have got confidence in us because we’ve shown it before, we’ve shown we’ve got the balls to do it. I just hope we can.’\nArsenal return to Premier League action against Bournemouth this weekend before preparing for their huge clash in the French capital.\nPSG, already crowned Ligue 1 champions, visit Strasbourg on Saturday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Athletic Bilbao send Nico Williams transfer message to Arsenal ahead of Man Utd clash\nMORE: Arsenal slammed over ’embarrassing’ tifo after defeat to Paris Saint-Germain in Champions League",
  "word_count": 577,
  "scraped_at": "2026-02-14T02:09:01.848718",
  "_text_extracted": true
}