{
  "article_id": "4d2cf3abba16",
  "url": "https://metro.co.uk/2025/05/03/psg-face-ousmane-dembele-nightmare-arsenal-clash-injury-expert-gives-worrying-verdict-23018862/",
  "title": "PSG face Ousmane Dembele blow for Arsenal clash as injury expert gives verdict",
  "date": "20250503T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ousmane Dembele’s chances of playing for Paris Saint-Germain against Arsenal in next week’s Champions League semi-final showdown are ‘very small’.\nThe France international has enjoyed a sublime campaign leading PSG’s fearsome attack, scoring his 33rd goal of the season to silence the Emirates on Tuesday night.\nPSG took a 1-0 lead back to the French capital ahead of the second leg next Wednesday but Dembele is a doubt for that game after being forced off midway through the second-half in north London.\nLuis Enrique admitted post-match his star forward would have to be considered a doubt for the return leg, missing tonight’s Ligue 1 match against Strasbourg.\nPSG released a brief statement on Dembele earlier on Friday afternoon, noting ‘his condition is progressing well’ with further assessments still to be carried out.\nThe French champions have five days to make a decision on Dembele’s involvement in what is their biggest game of the season against Mikel Arteta’s side.\nBut with such a tight turnaround, allowing him to play could be too big a risk to take.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nStephen Smith, CEO and founder of Kitman Labs which specialises in injury welfare and performance analytics working with the Premier League, suggests it is very unlikely Dembele is passed fit to start against the Gunners.\n‘Even if that is a grade 1 hamstring injury, the likelihood of him being able to play within a week is very, very small,’ Smith told Metro. ‘My gut instinct would be that even if it is a minimal strain you are talking two weeks before you can get him back in.\n‘It is an important game too. If you’re not fully confident, can you take a risk with a guy who is not ready and risk damaging that even further and losing him for a longer period of time? It is a really high risk manoeuvre with a player who has been playing so well.\n‘I would put it in the unlikely category. If there is even any fibre disruption at all, it is such a high risk decision for a club to make, putting a player out there who could potentially suffer much more significant damage in a really problematic area within the sport. They would want to feel really good about thing before putting him out, regardless of how important the game is.’\nPSG wrapped up the French title at the start of April with the Champions League their sole focus. Winning Europe’s premier competition has become an obsession for the Parisians who have reached the final four in style in their bid to lift the trophy for the first time.\nWith nothing else to play for, there might be the temptation to rush Dembele back as soon as possible to ensure PSG get the job done against Arsenal.\nMore Trending\nBut Smith warns that is unlikely to be a scenario seriously discussed by PSG’s medical staff.\n‘I don’t think it is a realistic option to throw him in and hope for the best. It is very high risk. It is not the type of conversation any medics within the game are going to have, they will be having a conversation about what the right thing for that player is and how much risk that may present.\n‘What we also have to remember, they will have ‘return to play’ standards within the club. They will have information on him about his previous muscle strength, running distance, velocity, things of that nature, and they will be expecting him to display those comfortably or in a gradual fashion so he doesn’t get hurt as they are assessing things.\n‘So there is quite a bit of work to get through internally just to show he is capable. And in a seven day window, that can be hard to pull off.’\nMORE: Arsenal vs Bournemouth: Confirmed team news, predicted lineups and injuries\nMORE: Jamie Carragher names two sides who can still finish second ahead of Arsenal\nMORE: Arsenal open talks to sign £58m star with Andrea Berta pushing for move",
  "word_count": 724,
  "scraped_at": "2026-02-14T02:09:01.835237",
  "_text_extracted": true
}