{
  "article_id": "4d3c1e0e09f7",
  "url": "https://www.thenationalnews.com/business/energy/2025/08/07/egypt-signs-35bn-deal-to-import-natural-gas-from-israel/",
  "title": "Egypt signs $35bn deal to import natural gas from Israel",
  "date": "20250807T140000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Egypt has signed a $35 billion agreement to import Israeli natural gas as the most populous Arab nation looks to secure long-term gas supply agreements to meet its growing energy needs.\nThe deal – the largest export agreement signed by Israel and the biggest since the discovery of the natural gas reservoirs in the country – includes an aggregate export of about 130 billion cubic metres of natural gas from the Leviathan gasfield to the Egyptian market, NewMed Energy, one of the partners in the gasfield, said in a statement on Thursday.\nUnder the terms of the deal, signed by NewMed, its partners and Blue Ocean Energy – an existing off-taker of natural gas from Leviathan for Egypt – the supply of gas to Egypt is expected to continue until 2040, or until all of the contract quantities are fulfilled.\n“This is the most strategically important export deal to ever occur in the Eastern Mediterranean and strengthens Egypt’s position as the most significant hub in the region,” said Yossi Abu, chief executive of NewMed Energy. “This deal, made possible by our strong regional partnerships, will unlock further regional export opportunities, once again proving that natural gas and the wider energy industry can be an anchor for collaboration.”\nVital supply\nThe supply of Israeli gas is critical for Egypt to maintain and increase the pace of its economic growth. The International Monetary Fund this year upgraded Egypt’s economic growth forecast for the 2024-2025 fiscal year to 3.8 per cent. The Central Bank of Egypt said in May that it expected real gross domestic product to expand by 4.3 per cent during the fiscal year ending 2025, after a slowdown in growth to 2.4 per cent in 2023-2024 fiscal year.\nIsrael’s gas exports to Egypt were cut off during the 12-day Iran-Israel war in which the two sides also attacked each other’s energy infrastructure. The Egyptian government said at the time that it was prioritising the energy requirements of power stations instead of the production units, due to the peak summer season.\nBefore supplies were halted, Egypt imported about one billion cubic feet of gas per day from Israel, accounting for about 13 per cent of Egypt's total daily consumption of around 7.5 billion cfd. Of that total, about 3.8 billion cfd is produced locally.\nBuilding on deal\nLeviathan, which is off Israel's Mediterranean coast with reserves of about 600 bcm, began exporting natural gas to Egypt shortly after it commenced production in January 2020. Currently, the reservoir supplies a total contract gas quantity of about 60 bcm, with an annual volume of 4.5 bcm to Egypt through Blue Ocean Energy. Egypt also receives Spot quantities (interruptible daily sales), which are offset against the total contracted quantity.\nThe latest deal builds on the original export agreement with Egypt, signed in 2019, which is expected to end in 2030 once the full contracted quantity has been supplied from the Israeli reservoir. So far, Leviathan has sold about 23.5 bcm of natural gas to the Egyptian market, NewMed Energy said.\nPhased approach\nThe deal will eventually replace the existing agreement and is divided into two stages. Stage one of the deal, involving the sale of 20 bcm, is expected to take effect in the first half of 2026.\nThe remaining contracted supply of about 110 bcm will be completed in the second stage, which will begin “only after completion of the Leviathan expansion project and the construction of the new transmission pipeline from Israel to Egypt via Nitzana”, NewMed Energy said. The completion of the deal will also pave the way for a final investment decision for the Leviathan expansion project.\nAs part of the preparations, last February, the Leviathan partners submitted an update to the gasfield's development plan to increase annual production capacity to about 21 bcm, with a possibility of further expansion to 23 bcm of natural gas a year.\n“Since it began production, Leviathan has brought many benefits, both domestically and internationally, and the reservoir’s expansion has been NewMed’s key priority for years,” Mr Abu said.",
  "word_count": 675,
  "scraped_at": "2026-02-14T01:49:44.669974",
  "_text_extracted": true
}