{
  "article_id": "4d405e0fa224",
  "url": "https://www.namibian.com.na/vinicius-and-bonmati-named-fifa-best-players-of-the-year/",
  "title": "Vinicius and Bonmati named FIFA Best players of the year",
  "date": "20241218T011500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid attacker Vinicius Junior won the FIFA Best men’s player of the year award at a ceremony in Doha on Tuesday, while Barcelona midfielder Aitana Bonmati picked up the women’s prize for the second time.\nThe award comes two months after 24-year-old Vinicius was second in the Ballon d’Or, with Real electing to snub the ceremony when they found out beforehand that Manchester City midfielder Rodri was set to win the trophy.\nBut the Brazilian was this time on hand to collect the prize in person as he is in Qatar with his club ahead of their Intercontinental Cup final clash with Mexico’s Pachuca on Wednesday.\n“Thank you very much. I don’t know where to start. It was impossible to think of getting here. I grew up in a world of poverty, of organised crime. It’s for all the children who grow up in that world. I thank everyone who voted for me,” Vinicius said on stage.\n“(Thank you) To my family, to the club, to my teammates, to Carletto (Madrid coach Carlo Ancelotti), who always helps me.\n“To everyone who helped make my dream come true. I hope to be at Madrid for many years, because it is the best club in the world. To Flamengo (his first club in Brazil). To my team-mates in my national team. And to my country, which always supports me in my work.”\nVinicius succeeds Lionel Messi as the FIFA Best men’s player after the Argentinian scooped up the last two editions of the award.\nThe live wire forward scored 24 goals and laid on 11 assists in 39 matches across all competitions as he led Real to a La Liga and Champions League double last season.\nHaving already wrapped up his third La Liga title in May, Vinicius secured the second Champions League trophy of his career as Real beat Borussia Dortmund 2-0 on June 1.\nVinicius was on the scoresheet at Wembley with a pinpoint finish inside the final 10 minutes to make the game safe for his team.\nIf Vinicius at times played second fiddle to clubmate Jude Bellingham in La Liga, he was undoubtedly the main man for Madrid in Europe once the going got serious.\nHe was the top scorer for the Champions League winners with six goals in the competition, including the strike in the final and a brace in Madrid’s 4-3 aggregate win over Bayern Munich in the semi-finals.\nHe also scored a hat-trick in a 4-1 victory in the final of the Supercopa against arch-rivals Barcelona in January.\nBut it was not all plain sailing last season for Vinicius as he endured a disappointing Copa America with the Brazilian national team over the summer.\nHe scored two goals in a group-stage win against Paraguay, but his side ultimately crashed out on penalties to Uruguay in the quarter-finals.\nSerial winner Bonmati\nThe 26-year-old Spaniard Bonmati picked up the Best women’s player award for the second year running, adding to the two Ballon d’Or trophies she already boasts.\n“I’m grateful, I’m proud to receive this award,” Bonmati said via video link from Barcelona’s Olympic stadium.\nLast term, Bonmati led Barcelona to a historic continental quadruple of titles and claimed the Nations League with her national team.\nShe won every trophy available to her in club football in 2023/24 — the Spanish league, the Copa de la Reina, the Supercopa de Espana and a second-successive Women’s Champions League.\nBonmati scored a goal and put in a player-of-the-match performance as Barcelona beat Lyon 2-0 in the final of the Champions League to claim their third title in four seasons.\nManchester United’s Argentine forward Alejandro Garnacho won the Puskas award for the best goal of the year for his spectacular bicycle kick against Everton in the Premier League.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 733,
  "scraped_at": "2026-02-14T01:52:10.154482",
  "_text_extracted": true
}