{
  "article_id": "4d413e427681",
  "url": "https://metro.co.uk/2025/05/23/enzo-maresca-reveals-chelsea-double-injury-boost-ahead-nottingham-forest-game-23228528/",
  "title": "Enzo Maresca reveals Chelsea double injury boost ahead of Nottingham Forest game",
  "date": "20250523T093000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea boss Enzo Maresca has revealed Christopher Nkunku and Marc Guiu are in contention to play against Nottingham Forest on Sunday.\nThe Blues are set for a Premier League showdown at Forest on the final day of the season with Champions League qualification on the line.\nChelsea’s main striker Nicolas Jackson is unavailable for the trip to the City Ground after he was shown a red card in the 2-0 defeat to Newcastle United earlier this month.\nIt was thought that Nkunku would also miss the Forest game due to injury, with Tyrique George to lead the line against Nuno Espirito Santo’s side due to Chelsea being light on attacking options.\nChelsea head coach Maresca, though, has now revealed a double injury boost with forward Nkunku and striker Guiu set to make their returns.\n‘[Nkunku] is working with us in the last days, him and Guiu,’ Maresca told a pre-match press conference on Friday.\n‘Both can be available for the next game, knowing that neither of them has played some minutes. They are both available [for Forest] yes.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThere is also no injury concern over Reece James – despite the Chelsea captain training separately from the main squad earlier this week.\nNkunku’s injury was unspecified but saw him miss more than a month of action, with the player not included in the last three Premier League matchday squads.\nGuiu, meanwhile, has been ruled out since February due to the 19-year-old’s hamstring problem.\nIt means Maresca now has a number of attacking options for the match against Forest – and it’s somewhat up in the air who will start up front.\nNkunku, if deemed fit enough to start, would be the most experienced option but there has been massive speculation over his future.\nThe Frenchman is reported to be at the centre of a six-way transfer race this summer.\nArsenal, Liverpool, Manchester United, West Ham and PSG are all interested in signing the 27-year-old at the end of the season.\nMore Trending\nChelsea fans have grown tired of Nkunku and even cruelly celebrated his most recent injury setback.\nNkunku is believed to have told the west London club that he wants to leave in the summer window.\nThe Blues signed him for £52m in 2023 from German side RB Leipzig and he’s under contract at Stamford Bridge until the summer of 2029.\nHe’s played a total of 56 games for Chelsea to date, registering 17 goals and five assists.\nMORE: Alexander Isak injury update ahead of Newcastle United vs Everton\nMORE: Tottenham star tells Daniel Levy he wants to leave just days after Europa League win\nMORE: Manchester United set asking price for Chelsea to sign Alejandro Garnacho",
  "word_count": 501,
  "scraped_at": "2026-02-14T02:02:47.544619",
  "_text_extracted": true
}