{
  "article_id": "4d454b387a6b",
  "url": "https://metro.co.uk/2026/01/25/manchester-united-decide-sign-two-players-replace-casemiro-26505476/",
  "title": "Manchester United decide to sign two players to replace Casemiro",
  "date": "20260125T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are planning to sign two players to replace Casemiro after he announced he is leaving Old Trafford at the end of the season.\nFive-time Champions League winner Casemiro joined the Red Devils in 2022 in a £70m deal from Real Madrid.\nMuch was expected of the Brazilian legend given his success at the Bernabeu but Casemiro initially struggled at United.\nThe 33-year-old has largely impressed this season, however, and was named player of the match after Manchester United’s derby win over Manchester City last weekend.\nUnited were already planning to sign a midfielder this summer but now want two through the doors at Old Trafford to compensate for Casemiro’s departure.\nNottingham Forest’s Elliot Anderson, Brighton’s Carlos Baleba and Crystal Palace’s Adam Wharton have been heavily linked with the Red Devils but United were only expected to sign one of the talented trio.\nHowever, according to talkSPORT, Manchester United are now planning to sign two of the three transfer targets to bolster the midfield options for the next permanent manager.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMichael Carrick was appointed caretaker boss until the end of the season after Ruben Amorim’s sacking at the start of the month.\nAmorim was keen to sign a new central midfielder last summer but United decided to keep their powder dry after spending almost £200m on Bryan Mbeumo, Matheus Cunha, Benjamin Sesko and Senne Lammens.\nEx-Sporting manager Amorim also put pressure on United to sign a midfielder in January and United’s reluctance to do so was one of the reasons his relationship with the board turned sour.\nThe Daily Mail say new England star Anderson is United’s No. 1 target as things stand but Nottingham Forest are believed to want over £100m for the 23-year-old.\nAnderson has continued to impress despite Forest being dragged into a relegation battle and winning just six of their 22 league games to date.\nUnited are not alone in expressing interest in Anderson, however, with local rivals Manchester City known admirers and able to offer the player more lucrative wages.\nManchester United’s ability to sign Anderson is therefore expected to be dependent on whether or not Carrick is able to deliver the club Champions League football for next season.\nThe Red Devils are fifth, one point behind fourth-placed Liverpool, ahead of Sunday’s clash against Premier League leaders Arsenal.\nAnother option for United is Baleba, who Amorim was keen to welcome to Manchester United last summer.\nThe Cameroon international verbally agreed a move to the Theatre of Dreams and would be just as interested in a summer switch to United.\nBrighton wanted well over £100m for the 22-year-old six months ago but the Mail claim their asking price has now dropped to around £75m.\nUnited could decide to go all in on Wharton but will not have a free run at the Crystal Palace star, who is also a target for Liverpool.\nWharton is expected to be another big-name departure from Selhurst Park, with Palace already losing Eberechi Eze and Marc Guehi, while Jean-Philippe Mateta could yet leave before the transfer window shuts and manager Oliver Glasner is off in the summer.\nCasemiro’s departure may not have been felt a year or so ago but his upturn in form changes things.\nConfirming his decision to leave the club, Casemiro said: ‘I will carry Manchester United with me throughout my entire life.\nMore Trending\n‘It is not time to say goodbye; there are many more memories to create during the next four months.\n‘We still have a lot to fight for together; my complete focus will, as always, remain on giving my everything to help our club to succeed.’\nUnited caretaker boss Carrick added: ‘It is coming into that time of the season with contracts. We are working away through January. There will be conversations at the right time.\n‘The announcement for Case was for clarity. It was decided before I arrived. The type of personality and character he is shows with his performance. He is desperate to do well.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal 2-3 Man Utd: Dorgu and Cunha screamers harm Gunners title charge\nMORE: Why Cole Palmer misses Chelsea’s Premier League trip to Crystal Palace\nMORE: Next Liverpool manager odds as pressure mounts on Arne Slot",
  "word_count": 775,
  "scraped_at": "2026-02-14T01:53:15.582421",
  "_text_extracted": true
}