{
  "article_id": "4d6a38a6be1e",
  "url": "https://www.canberratimes.com.au/story/8917580/sam-kerrs-anticipated-return-to-chelsea-squad-against-manchester-city/?cs=14280",
  "title": "Sam Kerr anticipated return to Chelsea squad against Manchester City | The Canberra Times",
  "date": "20250315T070000Z",
  "domain": "canberratimes.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Between a drawn-out, highly-publicised court case, a magical Women's World Cup run and multiple injury hiccups, Matildas star Sam Kerr has had the most turbulent period of her career.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut soon Kerr will be able to put all her focus back into playing soccer with a potential return to the pitch next week.\nKerr was intriguingly named in Chelsea's 25-player Champions League squad to face Manchester City on March 20, which would mean a showdown with fellow Matildas striker Mary Fowler in her comeback.\nKerr, 31, hasn't played since a knee reconstruction in January last year, following a devastating ruptured ACL.\nDespite being named, Chelsea coach Sonia Bompastor wanted to temper expectations when the striker returns, as she only recently began training fully.\n\"For Sam, we will see,\" Bompastor told reporters in London.\n\"She is progressing really well in her rehab but I just want her to feel like the main focus for her will be to work really hard, be the best version of herself.\n\"If we have positive news and she can bring in to the team her experience but also her competencies, it will be great.\n\"I just want her to focus step by step, but the main thing for me is to make sure she works hard and she just comes back in the squad.\n\"I just want to make it clear I think it is not really fair to expect from a player who has been injured for now 15 months ... to be the hero in the team.\"\nThe Chelsea coach said she and the staff have had to deal with Kerr's lengthy absence with patience as she recovered.\n\"Everyone is different, everyone reacts differently from the beginning, the surgery and everything, so it's really difficult to say and put a timeframe for every injury,\" Bompastor said.\n\"For Sam, we have been in this timeframe and now we just need to focus on what we need to do with her every day to make sure she is the most close to coming back on the pitch.\n\"Sometimes even if you have high expectations it doesn't go the way you want, and you need to just have plan B, plan C for that.\"\nChelsea, yet to lose in all competitions this season, meet Manchester City four times over the next two weeks including Saturday's Women's League Cup final - Kerr won't play in that game.\nIf Kerr misses the first leg of the Champions League fixture against City, she could still play in the second leg on March 27.\nLast month, Kerr was found not guilty of racially aggravated harassment after calling a Metropolitan Police officer \"stupid and white\".\nAfter the high-profile trial, Football Australia said it remained supportive of Kerr while refusing to comment on her prospects of keeping the national captaincy.\nThe Matildas' next games are friendlies against South Korea on April 4 in Sydney and April 7 in Newcastle.\n- with AAP",
  "word_count": 500,
  "scraped_at": "2026-02-14T02:02:35.604212",
  "_text_extracted": true
}