{
  "article_id": "4d9aa1726d2c",
  "url": "https://www.dailymail.co.uk/tvshowbiz/article-13105417/WAG-16-years-sobbing-snowflakes-Married-Game-suck-reality-series.html",
  "title": "I was a WAG for 16 years and this is my message to the sobbing snowflakes of Married To The Game :  Suck it up , buttercup , this is the life you signed up for ! ",
  "date": "20240221T023000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I was a WAG for 16 years and this is my message to the sobbing snowflakes of Married To The Game: 'Suck it up, buttercup, this is the life you signed up for!'\n- Read former WAG Lizzie Cundy's verdict on the first episodes of Married To The Game which follows the trials and tribulations of footballers' wives\nAnother week, another deliciously fun reality series is out following women with far too much time and money on their hands.\nMarried To The Game is about to drop on Amazon Prime and it is a world I, as a former WAG, know about only too well.\nThe series follows the latest glut of wives and female partners who have hitched themselves to a top footballer. Yet amid the excessive lifestyles, the OTT hair, handbags and homes, they are all at pains to point out that their world isn't all it's cracked up to be.\nOne clip bemoaning the trials and tribulations of endless designer handbags and first-class travel from the series has gone viral – and no wonder!\nTaylor Ward, 26 – a gorgeous blonde glamazon with 2.8 million Instagram followers and collaborations with everything from hair straighteners to nail kits – is catnip for the fly-on-the-wall cameras.\nIn the craftily-cut trailer she is seen bursting into tears when her husband Riyad Mahrez, 32, bluntly tells her he is moving teams from Manchester City to Saudi Arabia in a lucrative deal worth a reported £750,000 a week. When she wails, 'I'm going to be sat at home on my own,' Riyad responds: 'It's part of the game, innit.'\nTaylor Ward is left in tears after her husband Riyad Mahrez tells her they are moving to Saudi Arabia in the trailer for Married To The Game\nLizzie Cundy was married to Premier League star husband Jason for 16 years\nMs Ward with Mahrez, who moved from Manchester City to Saudi Arabia in a lucrative deal worth a reported £750,000 a week\nThis WAG, for one, is Team Riyad. I moved four times in five years when I was married to former Chelsea player Jason Cundy. I'd been given more notice when my personal trainer moved an appointment than some of the club transfers my ex-husband landed on me.\nIn the first episode of the six-part show – out this Friday, February 23 – we're in the capacious dressing room of Taylor's Cheshire mansion as she chats with fellow WAG Sara Gundogan, 29, who is married to former Manchester City player Ilkay Gundogan. Taylor's 18-month-old daughter Mila is casually handed several designer handbags, including a black-quilted Chanel clutch and a Louis Vuitton number, to play with. When Taylor announces she's always lived in Manchester and her 'biggest fear is moving away'... Well – we know what's coming don't we?\nJuly 2023 footage of French-Algerian Riyad's hugely-hyped move to Saudi Arabia club Al-Ahli is used to announce his £30million transfer alongside clips of Taylor, a former model, driving her six-figure Mercedes 4x4 G-Class SUV along a posh country lane while moaning – with zero irony – about how the move was a 'shock to everyone' and the 'brutal thing about football'.\nI'm sorry Taylor, but you cannot go down the 'poor me' route when you are a WAG - you really do have to adopt the 'suck it up buttercup' approach to life.\nWhile you might have got your top-of-the-range interiors just the way you like them, the kids in the best schools and finally discovered the perfect nail salon, a transfer deal can happen in a matter of hours and you need to be prepared to leave at the drop of a hat. This is part of the deal – and, let's face it, what funds your lavish lifestyle.\nI get it – you don't know anyone in the new destination, let alone know how to speak the lingo. And Saudia Arabia is hardly known for its liberal women's rights.\nIn one scene after modelling jewellery with her sister, Taylor is in tears about the impending move to Saudi moaning: 'If I don't like it, I don't have any choice.'\nI get it, Taylor! You've got the cars, the clothes, the Cheshire mansion, the private jet and the perma-tan... but having the bespoke silk rug pulled out from under you as you start a new life thousands of miles from home is going to be very bloody lonely.\nEspecially if you go down the 'pity me' route.\nAs well as Taylor and Sara, the first episode features Cat Harding, fiancée of Arsenal player Jorginho (and mum to one of Jude Law's seven children).\nA former contestant on ITV's The Voice UK, Cat, 33, decides to throw her own birthday party, complete with a white baby grand piano, carnival dancers and harpists. The (somewhat frazzled) organiser lists some of the last minute changes she insists on, including a balloon entrance and 65kg of lemons.\nWe cringe as Cat asks her Brazilian beau Jorginho if she should keep her ring finger free for a proposal... The answer is a resounding 'no'! (The pair did eventually get engaged in December under a neon 'will you marry me?' sign inside a heart made out of flowers.)\nWe also see Sara sigh to the camera when her hubby Gundogan, 33, gets transferred for Barcelona: 'You just get a call and get informed… it changes your life.'\nShe's left behind in Manchester packing his suitcase, his framed shirts hanging on the wall behind her. And what does he want Sara to get flown out for him? His 'two treatment beds' (and that's after telling viewers he only trusts his mother to pack for him.)\nCat Harding is engaged to Arsenal's Jorginho\nMarried To The Game follows Everton centre-back James Tarkowski's wife Samantha on her path to opening her own gym, having achieved personal training qualifications\nSamantha with a more classic WAG look\nThere is nothing worse for a footballer than a wife who moans and groans. This is hard advice to dish out but my words of wisdom for the likes of Taylor, Cat, Sara and their generation are these: club moves are the bread and butter of life as a footballer; it's never a given that the club shirt they pull on this week is the same one they'll be wearing next season.\nYou have to be gloriously naïve if you assume your hubby will start and end his career in the same postcode. I'm sorry to break it to you, loves: but that simply isn't how The Game works.\nWhen you say 'I Do' you are also committing to his life as a footballer and all that goes with it.\nLook at Victoria Beckham. Despite being top of her own career as a Spice Girl, she circumnavigated the planet to follow David. She learnt her lesson early after making the foolish mistake of staying in Blighty during David's transfer to Real Madrid in 2003, when his alleged four-month liaison with PA Rebecca Loos took place.\nNo wonder Victoria swiftly uprooted her life to follow him to Los Angeles in 2007.\nIt's why I cringed when, at the end of the first episode, a wide-eyed Taylor says: 'I don't know when I'll see him next, which is quite sad.'\nBy now her husband was already ensconced in Saudi Arabia.\nLook, a five-year deal in a Middle Eastern country is not exactly a happily ever after is it? But seeing the person you love playing world-class football in a stadium with more than 70,000 fans chanting his name means he is routinely treated like a hunky A-lister – that adulation is bigger than a rockstar's because football is global. When he is doing well, a bit of that star dust sprinkles on you, too. You feel special when the world rolls out the red carpet.\nIt's why being a footballer's wife is so appealing. It's why young girls see the lifestyle as an accessible one. They can't be Jennifer Anniston or Angelina Jolie – but could they be the next Coleen Rooney or Rebekah Vardy? With enough hair extensions, fake tan and cleavage – you bet. There are clubs all over the country with local bars and nightspots brimming with footballers. And the reality is: if you look good it is very easy to snare one.\nThat's not to say, of course, that there aren't downsides to being a WAG – and I am proof of it.\nThere is the constant threat of other women trying to take your place in the bedroom. Never forget that, apart from those weekly games, footballers train in the morning, have a spot of physio and then have an awful lot of time on their hands. A young man, with a fit body and a lot of dosh who thinks he is invincible, is a green light to any woman with a pulse.\nAnd as for those wives with their head in the clouds thinking staying back in the comfort of their des res in Blighty is the better option for them and the kids, I have this to say: Big Mistake.\nI know only too well the pitfalls of the WAG world. Jason and I split up when I discovered he was seeing a younger woman in 2010. We'd been married for 16 years and had two sons, then aged ten and 16. But despite a lifetime of vigilance, I couldn't stop it happening.\nI know of one WAG who told her other half when he was transferred abroad: 'I'm happy in Surrey, I'm not going.' Choosing Cobham over the club move wasn't wise. Quelle surprise: they split two months later. It's a footballer's wife's job to support her husband. You might be married to him, but his first love will always be the game.\nThe likes of Taylor need to focus on their husband's happiness. Believe me, if he is happy then you will be, too.\nSo my advice would be: WAGs, when he gets the transfer to another country, mop up those tears, quit moaning and get on with it. This is the life he – and you – have signed up for.\nAs told to Samantha Brick\n- The documentary series Married to The Game, launches on Prime Video Friday 23rd February.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Moment driver veers to target e-bike riders before killing teen\n- Moment Swiss bar fire owners collapse after being confronted\n- Astonishing moment a street is swallowed by a sinkhole\n- Food vlogger dies after 'eating toxic devil crab'\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Toddler opens car door in traffic and sends biker flying\n- New video shows man with backpack similar to Guthrie kidnapper\n- Deepak Chopra confronted over his relationship to Epstein\n- Israeli hostage reveals how she survived being tortured",
  "word_count": 1839,
  "scraped_at": "2026-02-14T01:56:44.625135",
  "_text_extracted": true
}