{
  "article_id": "4da55c83b520",
  "url": "https://metro.co.uk/2025/06/14/inter-milan-star-stranded-iran-israel-attacks-ahead-club-world-cup-opener-23413404/",
  "title": "Inter star stranded in Iran after Israel attacks ahead of Club World Cup opener",
  "date": "20250614T130000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inter Milan striker Mehdi Taremi has been left stranded in Iran following attacks from Israel in Tehran.\nTaremi, 32, is part of the Inter squad taking part in the Club World Cup in the USA over the next month with their first match taking place on Wednesday against Mexican side Monterrey.\nTaremi returned to his homeland to accept Iran’s Footballer of the Year award and was planning to fly straight out to Los Angeles to link up with his teammates.\nHowever, the escalating conflict between Iran and Israel which saw Iranian military and nuclear targets hit with missile attacks has resulted in all flights from Iranian airports grounded.\nInter are in ‘constant contact’ with the striker, Sky Italia report, as they seek to find a solution that will allow him to leave Iran and join up with his teammates.\nIran was targeted with several waves of airstrikes on Thursday and Friday, launching retaliatory attacks on Israel overnight.\nMore than 78 people have been killed in Iran, including four of its top security chiefs, with 320 wounded, most of them civilians. Three people died in Israel, with dozens more injured in Iranian strikes.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nTaremi had also returned to Iran play for the national team in World Cup qualifying matches against Qatar and North Korea, the last of which took place at Teran’s Aazadi Stadium on Tuesday.\nMore Trending\nTaremi played for Iran in both games against Qatar and North Korea, scoring in the latter.\nWhile not a regular starter, Taremi has been an important member of the Inter squad.\nThe former Porto star remained on the bench in the brutal Champions League final defeat to Paris Saint-Germain but has made 43 appearances in all competitions this season with three goals and nine assists.\nInter will play Monterrey, Japanese side Urawa Red Diamonds and Argentine giants River Plate in their Club World Cup group phase, led by recently appointed head coach Christian Chivu.\nMORE: Inter Milan make new Rasmus Hojlund plan due to Manchester United’s asking price\nMORE: Chelsea fans proclaim ‘we are so back’ after watching Liam Delap training video\nMORE: Is it safe to travel to Cyprus? Latest Foreign Office tourist advice after Israel strikes Iran",
  "word_count": 420,
  "scraped_at": "2026-02-14T01:49:39.534435",
  "_text_extracted": true
}