{
  "article_id": "4db2ebd04b46",
  "url": "https://www.managingmadrid.com/2024/4/29/24144468/javi-martinez-the-thing-about-madrid-is-that-you-can-never-trust-them",
  "title": "Javi Martinez :  The thing about Madrid is that you can never trust them  ",
  "date": "20240429T233000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In an interview with Marca, former Bayern Munich midfielder Javi Martinez shared his insights ahead of the highly anticipated Champions League semi-final between Bayern Munich and Real Madrid.\nJavi Martinez: “The thing about Madrid is that you can never trust them”\nThe Spaniard told Marca why Real Madrid vs Bayern Munich is the European Clasico\nMartinez reminisced about the historical significance of clashes between the two European giants, highlighting the rich history and legendary battles witnessed over the years. “Bayern Munich vs Real Madrid is a classic of European football,” he remarked. “It sounds like history, like legend.”\nReflecting on past encounters, Martinez emphasized the intensity and epic nature of the matches, describing them as “matches to the death” filled with war-like atmosphere, particularly at iconic venues like the Bernabéu and Allianz Arena.\n“When you remember historical duels in the Champions League, those between Madrid and Bayern appear,” Martinez said. “I grew up with those battles of Salihamidzic, Kuffour, Kahn, Effenberg, Raúl, Roberto Carlos, Hierro... For my generation it is the first great duel we experienced.\n“They are two of the biggest clubs in Europe, if not the biggest. Those games, they were matches to the death, epic, mystical. It was war! In a good way. Going to the Bernabéu was incredible because of the atmosphere that was created. As happened at Allianz. You notice people’s desire. For me it is the great European classic, the best historical confrontation. And they have never seen each other in a final! It is the match that the Champions League has pending.”\nMartinez also acknowledged the unpredictability of facing Real Madrid, citing their formidable Champions League pedigree and knack for turning ties around, as seen in their recent victory over Manchester City. “The thing about Madrid is that you can never trust them,” he stated. “They have a mystique with the Champions League that makes them dangerous in any circumstance.”\nRegarding Real Madrid’s tactical approach, Martinez praised Carlo Ancelotti’s strategic acumen in their victory over Manchester City this season, highlighting the effectiveness of a disciplined defensive setup against top-tier opponents.\n“Real Madrid’s win over Manchester City this season may have surprised many people, but I am very clear that Madrid defends very well,” Martinez explained. “Carlo is a very intelligent coach. At Manchester City, and even less at the Etihad, you can’t go out and play face to face. They are the best team in Europe. If they play to press them high, to let them have spaces, then you are going to see an invincible team. That way no one beats them. Given that, Ancelotti, with his wisdom and intelligence, proposed an idea with a low block. He knew that it is not pretty, that it’s not what his team and his people are used to. But he said: this is the Champions League quarterfinals and what matters is the team that will be in the semifinals. And it was Madrid.”\nMartinez concluded by emphasizing the significance of the upcoming clash, labeling it as “the great European classic” and expressing anticipation for a compelling encounter between two of the continent’s footballing powerhouses.",
  "word_count": 520,
  "scraped_at": "2026-02-14T02:07:51.315729",
  "_text_extracted": true
}