{
  "article_id": "4dd5da9a9d70",
  "url": "https://www.teamtalk.com/news/arsenal-transfers-chelsea-aston-villa-converge-new-serie-a-sensation-transfer-battle-begins",
  "title": "Arsenal transfers : Gunners , Chelsea , Aston Villa all converge on new Serie A sensation as transfer battle begins",
  "date": "20241014T130000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal, Chelsea, Aston Villa all converge on new Serie A sensation as transfer battle begins\nSantiago Castro is the latest Serie A star to be linked with a big move to the Premier League, with Arsenal, Chelsea and Aston Villa all reportedly in the mix to sign him.\nAccording to CaughtOffside, Arsenal, Chelsea and Aston Villa are among the fix English sides who have scouted Castro recently, with those officials returning glowing reports. The centre-forward has taken Bologna’s No 9 shirt following Joshua Zirkzee’s summer switch to Man Utd and is looking to establish himself as their main striker.\nEverton and Nottingham Forest have also been hugely impressed by Castro’s recent form. The Argentina U23 international has notched three goals and one assist in his last four Serie A appearances for Bologna, which includes a goal during the 1-1 draw with Atalanta on September 28.\nOut of Castro’s potential suitors, CaughtOffside state that he would be most keen to join Arsenal or Chelsea, given the size of those two clubs.\nHowever, Aston Villa cannot be ruled out given their incredible rise under Unai Emery and the fact they could offer the 20-year-old Champions League football.\nCastro will almost certainly remain at Bologna for the full 2024-25 campaign as he aims to continue his development at the Italian outfit.\nPremier League clubs moving for him next summer will depend on how well he performs for the rest of the season and whether he manages to net 15 goals or more.\nWhere could Castro fit in at next club?\nCastro moving to a top English club in 2026 would make more sense, as he would have improved his game significantly by that stage.\nArsenal currently have Kai Havertz and Gabriel Jesus available up front, while they are also tracking RB Leipzig’s Benjamin Sesko as their next No 9.\nCastro could provide Sesko and Havertz with cover and competition for a starting role, with Jesus’ future increasingly looking like it is away from the Emirates.\nChelsea, meanwhile, remain eager to sign a top-class goalscorer such as Victor Osimhen, despite Nicolas Jackson’s great start to the season.\nBut Chelsea chiefs have regularly shown their ambition to sweep up the best young players around, and Castro is starting to put himself into that category.\nVilla can currently rely on both Ollie Watkins and Jhon Duran after the latter’s summer transfer to West Ham United fell through.\nDuran has earned a new contract at Villa amid his sensational scoring run. Although, the Colombian will not want to play second fiddle to Watkins for all of his career, setting up a blockbuster potential move away from Villa Park to a top team.\nThis is where Castro comes in, as he could become Watkins’ new backup in the West Midlands.\nDON’T MISS: Ranking every player that Arsenal have signed directly from Chelsea after Raheem Sterling deal\nTransfer news: Barcelona in for Arsenal star; Chelsea sent Cole Palmer warning\nMeanwhile, Barcelona are reportedly eager to sign Thomas Partey when his Arsenal contract expires at the end of the season.\nTeams in both Saudi Arabia and Turkey are keeping tabs on the midfielder’s situation, but the Spanish press claim that Barca could actually win the race for his services.\nHansi Flick has identified Partey as a top addition to his midfield options. Given the fact his contract is winding down, Barca will not have to spend big money to sign him, either.\nElsewhere, former Arsenal and Chelsea star William Gallas has told the Blues that they risk losing talisman Cole Palmer if they fail to meet his ambitions over the coming years.\n“Palmer looks like he is going to have a very similar season to last year and even though he is young, it will be tough to see his friends winning trophies if he isn’t at Chelsea despite the way he is playing,” the former defender said.\n“I won’t be surprised if he wants to speak to Chelsea in the summer if they again fail to win a trophy. He will want to know clearly what their targets are. He has the ability to go anywhere he wants and be a success because he is a very special player.\n“His quality is completely different to any other English player and he could be a huge success wherever he goes. Definitely. Barcelona would be a great move for him, but they have great young players already like Lamine Yamal and might also be signing Nico Williams.”\nREAD MORE: Arsenal line up fantastic signing of Serie A winner who must make major sacrifice before joining\nWho is Santiago Castro?\nA key reason behind Bologna breaking into the Champions League places last season was their shrewd recruitment – and it’s looking like January signing Castro is the next gem they have unearthed.\nCastro, born in Buenos Aires, began his career with Velez Sarsfield, scoring nine goals from 65 appearances for the Argentine side.\nHe earned his move to Bologna in January 2024, usually coming on as a substitute for future Manchester United forward Joshua Zirkzee during his first half-season in Serie A. Indeed, of his first six sub appearances for Bologna, five were directly in place of Zirkzee.\nSince the Dutchman’s departure in the summer, Castro has stepped up, starting six of Bologna’s first seven Serie A matches this season. He scored in all three of their league games – two of those goals being from outside the box – in September, the month in which he also made his Champions League debut.\nCastro has been playing as a centre-forward, but when Bologna announced his arrival 10 months ago, they described him as a player “who loves to be involved in all kinds of up-front action”, citing his “agility [and] rapid finishing skills”, along with the fact that he is “good in the air and determined.”\nBack in his native Argentina, Castro also showed his capability of playing on the wing, which explains partially why he currently has a far superior goals-to-games ratio with Bologna than he did with Velez.\nBut that may also be a natural side-effect of a 20-year-old player rapidly maturing and taking strides towards fulfilling his potential as he develops within one of Italy’s best talent systems in recent times.",
  "word_count": 1042,
  "scraped_at": "2026-02-14T01:51:57.647500",
  "_text_extracted": true
}