{
  "article_id": "4e0dd7a3460e",
  "url": "https://www.caughtoffside.com/2025/04/28/arsenal-win-league-10-points-sign-player/",
  "title": "Arsenal told they can win the league easily with Alexander Isak",
  "date": "20250428T080000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have won the Premier League title with Arsenal expected to finish in second place once again.\nThe Gunners have been challenging for the Premier League title for the last three seasons but Mikel Arteta’s side have failed to win the league.\nThey have always been one step behind the eventual Premier League champions and that was the case once again this season.\nThe North London club are widely expected to strengthen their squad this summer, particularly their attacking options.\nSporting striker Viktor Gyokeres is on the radar of the Gunners having shown exceptional form this season.\nHowever, football pundit and former Arsenal player Paul Merson believes there is a player in the Premier League who can help the Gunners win the league next season by ten points.\nMerson believes the gap can be closed, and not just closed, but obliterated, if Arsenal add Newcastle striker Alexander Isak to their squad this summer.\nSpeaking to Sportskeeda, Merson said:\n“Alexander Isak is expected to attract interest from a few clubs this summer, but I feel like he could play the waiting game before deciding his future.\n“Newcastle could be in the Champions League next season and they’ve already shown they can win silverware.\n“Let’s not forget — they’re a big club now and, if they qualify for the Champions League, they’ll be an attractive project for any player.\n“I think Isak surely wants to be involved in the Champions League next season and that will play a key role.\n“Arsenal seem like the best possible move for him if he leaves Newcastle.\n“If the Gunners get him, they will win the league by 10 points!”\nCan Arsenal sign Isak this summer?\nIsak could be a transformational signing for Arsenal because he brings something they currently lack.\nThey lack a lethal attacker who can prove to be prolific in front of goal.\nArsenal have an excellent team but they are missing that cold-blooded, world-class finisher who can turn tight draws into wins and smash weaker sides consistently.\nThe Gunners have played 13 draws in the Premier League this season and that has hampered their title hopes.\nIsak’s ability to produce moments of brilliance in tight games, as he has shown at Newcastle, could be the difference between coming second and winning it all.\nJamie Carragher, former Liverpool defender and Sky Sports pundit praised Isak by saying:\n“Alexander, I adore you. I think you’re a fantastic player, and if I had £150 million, I’d pay it to have you at any club.”\nReport: Arsenal consider surprise swoop for Chelsea star compared to Eden Hazard",
  "word_count": 431,
  "scraped_at": "2026-02-14T01:52:20.887073",
  "_text_extracted": true
}