{
  "article_id": "4e121eddec26",
  "url": "https://www.teamtalk.com/arsenal/real-madrid-trying-convince-top-arsenal-target-reject-gunners-brutal-hijack-attempt",
  "title": "Real Madrid transfers : Los Blancos  trying to convince  top Arsenal target to reject Gunners in brutal  hijack  attempt",
  "date": "20250211T210000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nReal Madrid ‘trying to convince’ top Arsenal target to reject Gunners in brutal ‘hijack’ attempt\nReal Madrid have surged into the race for Real Sociedad star Martin Zubimendi once again despite Arsenal pushing to reach a pre-agreement with the midfielder, TEAMtalk understands.\nCarlo Ancelotti’s side are looking to add to their world-class squad in the summer as they look to reestablish themselves as the dominant force in world football.\nMadrid have recently brought in Kylian Mbappe, giving him one of football’s biggest wage packets, but that will not stop them from investing more in the team.\nLos Blancos are now looking to bring in midfield reinforcements and sources state that they could ‘hijack’ Arsenal’s pursuit of Sociedad star Zubimendi.\nLiverpool attempted to sign the Spaniard last summer but he chose to stay with Sociedad for another season. Sources state however that he if finally set to be on the move this time around.\nArsenal have also tried previously to bring Zubimendi to London with no avail but are making strong progress on securing a deal that will see him join at the end of the campgin.\nHowever, we understand that Madrid have made advances in Zubimendi’s direction and are trying to convince the 26-year-old to join them instead.\nREAD MORE: Real Madrid in talks to sign Arsenal superstar in record-breaking deal\nArsenal are planning for a big summer window\nThe Gunners have been working tirelessly to convince Zubimendi that they are the right move for him. Mikel Arteta has made it clear to the club’s board that he wants him, too.\nZubimendi has a release clause in his current contract worth €60million (£51m, $62m) which Arsenal are ready to pay. The decision will come down to the player, however, if Madrid match the clause too.\nIt’s also worth noting that Liverpool were willing to pay the €60m clause last summer before he rejected the move to Anfield and it remains to be seen if they reignite their interest.\nIt will be a very busy summer for Arsenal as they are setting up for a major attack on the transfer window as Arteta looks to build a squad capable of dominating European football.\nThe London side are looking to bring in a new striker, with Newcastle’s Alexander Isak still considered to be their ‘dream ‘ target, per sources.\nHowever, Isak is valued at over £120million by Newcastle and luring him from St James’ Park will be incredibly difficult, especially if they qualify for the Champions League.\nFor that reason, we understand that RB Leipzig star Benjamin Sesko is Arsenal’s most likely striker signing for the summer and contact is ongoing with Leipzig and his agents, while another attempt for Aston Villa’s Ollie Watkins is less likely, but still possible.\nArsenal will hope that Madrid are not able to convince Zubimendi to switch. However, staying within Spain in a division he knows may be more appealing to the midfielder who has turned down Premier League offers previously.\nDON’T MISS: Seven top-class Serie A stars out of contract in 2025: World Cup winner; ostracised AC Milan captain",
  "word_count": 519,
  "scraped_at": "2026-02-14T01:58:05.353114",
  "_text_extracted": true
}