{
  "article_id": "4e1b5f1928b1",
  "url": "https://www.dailymail.co.uk/femail/article-13537581/jude-bellingham-girlfriend-laura-celia-valk-euros-selfies-instagram.html",
  "title": "Jude Bellingham flies solo after England opener as his glamorous girlfriend skips the game and plugs her modelling shots on Instagram - with no mention of her boyfriend winning goal",
  "date": "20240617T104500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jude Bellingham flies solo after England opener as his glamorous girlfriend skips the game and plugs her modelling shots on Instagram - with no mention of her boyfriend's winning goal\n- The Dutch influencer turned a blind eye to Jude's winning goal on Instagram\n- READ MORE: A kiss for Captain Kane! England stars beam as they are reunited with WAGs and families\nJude Bellingham's girlfriend has continued business as usual and not let the Euros 2024 intervene with her career as a model, TikTok star, and clothing designer.\nEngland football stars beamed as they were reunited with their WAGs following the Three Lions' gritty 1-0 Euros victory against Serbia last night.\nCaptain Harry Kane cuddled his wife Kate Goodland, while Dani Dyer played the supportive partner and joined boyfriend Jarrod Bowen in the stands.\nBut the man of the match who scored the winning goal, Jude Bellingham, 20, went without post-match cuddles, after his girlfriend, Laura Celia Valk, skipped the game.\nThe Dutch influencer, 25, has turned a blind eye to the Euros on social media and has instead stuck to posting glamorous selfies on Instagram in equally stunning locations.\nJude Bellingham's glamorous girlfriend, Laura Celia Valk (pictured), brushed off Jude's winning goal at the Euros yesterday evening with a glamorous selfie\nShe took to Instagram on match day yesterday to share a collection of photographs of herself.\nIn one snap, the 25-year-old showcased her model qualities and posed for the camera in lingerie.\nElsewhere, Laura, who continues to keep her relationship under wraps on social media, shared a selfie with her 506 thousand followers.\nLuckily, Jude's mother and father, Denise and Mark, and his brother Jobe, were in attendance, and appeared ecstatic when the 20-year-old powered home a header.\nThe Real Madrid midfielder appeared to point to his family in the celebrations and waved to them at full time when victory was confirmed.\nMeanwhile, Laura has recently shared photos of a sunny Madrid to her Instagram followers where her new flame Bellingham happens to have an apartment.\nBorn in the Netherlands on September 16, 1998, Laura is five years older than Jude, although the age gap has done nothing to keep them apart with the pair enjoying a sizzling romance over the last few months.\nLaura might have missed yesterday's match, but she has much to be proud about as Jude broke a long-standing record held by Cristiano Ronaldo in lining up for England at Euro 2024.\nTurning a blind eye to England's match against Serbia yesterday, Laura posted a series of glamorous pictures of herself on Instagram\nDespite Laura's apparent absence, Jude Bellingham (pictured) scored an opening goal in yesterday's gritty match\nThe Dutch beauty, 25, boasts a career as an influencer, model, TikTok star, and clothing designer\nThe Real Madrid midfielder headed in from Bukayo Saka's cross after 13 minutes in Germany to put his side ahead against Serbia, continuing his fine form this season at just 20 years old.\nHe lined up behind Harry Kane in manager Gareth Southgate's system, flanked by Phil Foden and Bukayo Saka in an attack that provided fans with excitement going into the tournament.\nBellingham, on the back of winning the Champions League just days ago, provided perhaps the most excitement for fans, and delivered early on in delivering his side's opening goal.\nAfter playing in the game, Bellingham became the youngest player to feature at three international major tournaments, having also featured at Euro 2020 and the World Cup in 2022.\nHis romantic life is also blossoming, and Jude's blonde bombshell is both beauty and brains, having studied communication and creative business at the Amsterdam University of Applied Science.\nThe course, which is fully taught in Dutch, allows students to learn about 'trends in the media world and how to be a content creator within an inspiring, internationally oriented environment'.\nThe astute businesswoman is also the founder and owner of social media consultancy agency Bobby Rose, an ambassador for PrettyLittleThing and even once tried her hand at presenting.\nAlthough news broke that the football star and Laura are currently dating, the player continues to keep his private life just that.\nJude Bellingham's girlfriend, Dutch model Laura Celia Valk, is reportedly 'completely smitten' with the footballer\nLaura, who studied creative business at Amsterdam University of Applied Science, is represented by top modelling agency The Four Models, based in Manchester\nAmong those gathered to cheer on their significant others were Aine Kennedy, Conor Gallagher's partner, Luke Shaw's partner Anouska Santos and Ollie Watkins' partner Ellie Alderson.\nKyle Walker's wife Annie Kilner also sat in the stands and was pictured chatting to the footballer.\nThe players' families arrived in full force in Gelsenkirchen yesterday evening to cheer on their loved ones as they hoped to get off to a winning start - after painfully losing out in the final to Italy in 2021.\nBukayo Saka's partner Tolami Benson was spotted in the stadium. Tolami is 23 and works in PR.\nShe has been dating Saka since November 2021, with their romance confirmed during the 2022 World Cup in Qatar.\nLaura continuously shares bikini snaps when she flutters in between Spain and France throughout the year and has also been ranked as one of the 500 hottest women in the Netherlands\nDespite her seemingly skipping the first match, she is expected to be in Germany supporting her beau throughout the Euro 2024\nElsewhere, Anouska Santos paid a double tribute to her partner, Luke Shaw, on Instagram.\nIn the sweet image, Luke, and his eldest son Reign, four, smiled for the camera in an England kit.\nMeanwhile, their newborn daughter, Lumie, perched on her father's lap and their middle child, Storie, two, sweetly stroked her sister.\nAnouska wrote: 'Happy Father's Day Luke Shaw. You make these three babies lives so happy, we're forever proud, but today, just a little more. Love you so much.'\nLuke and his long-term partner, Anouska Santos, 33, are believed to have started dating before May 2017.\nThe couple likes to keep their relationship private and is not accustomed to regularly posting updates on their activities.",
  "word_count": 1016,
  "scraped_at": "2026-02-14T01:51:32.429506",
  "_text_extracted": true
}