{
  "article_id": "4e543ca70479",
  "url": "https://www.meathchronicle.ie/2023/12/21/give-your-ticket-to-somebody-else-jurgen-klopp-hits-out-at-anfield-atmosphere/",
  "title": "Give your ticket to somebody else – Jurgen Klopp hits out at Anfield atmosphere",
  "date": "20231221T123000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Give your ticket to somebody else – Jurgen Klopp hits out at Anfield atmosphere\nBy Andy Hampson and Carl Markham, PA\nJurgen Klopp told Liverpool fans to give their tickets away if they are not prepared to get behind the side in Saturday’s clash against Arsenal.\nThe Reds manager was unimpressed with the atmosphere at Anfield as Liverpool cruised into a the Carabao Cup semi-finals by thrashing West Ham 5-1 on Wednesday.\nKlopp felt the crowd, coming off the back of last weekend’s frustrating Premier League draw against Manchester United, were flat and wants more for the upcoming top-of-the-table date with Arsenal.\nThe German said: “I thought in the first half when the boys played really exceptionally, I was not overly happy with the atmosphere behind me.\n“I asked people what do they want? We changed a lot of things and we dominated West Ham like crazy and missed chances.\n“If I was in the stands I would be on my toes, 1,000 per cent. I don’t know, if the Man United game was that bad that we have to say sorry we didn’t smash them?\n“We need Anfield on Saturday. Arsenal didn’t play this week. They’ve prepared for this game and anyone who knows anything about them knows they will be prepared.\n“So we need Anfield on their toes from the first second, without me having an argument with the opposition coach.\n“If it is too much football in December, if you are not in the right shape, give your ticket to somebody else.\n“It was just not the excitement I felt. There were so many good performances but we were only 1-0 up.”\nLiverpool led through a stunning Dominik Szoboszlai goal at the interval before going on to win comfortably against a limp Hammers side with a double from Curtis Jones and further efforts from Cody Gakpo and Mohamed Salah.\nLiverpool, who are bidding to win the competition for a record-extending 10th time, will now play Fulham for a place in the final.\nKlopp said: “Wembley is a great stadium and yes we want to go there again. I was happy we could show a performance like we did tonight.\n“We had a lot of really good performances. It was is one of those nights where we could enjoy the game.”\nWest Ham boss David Moyes believes he is battling raised expectations following last season’s Europa Conference League win even after a sequence of seven wins and just one defeat before their Anfield humbling.\n“We’ve had an unbelievable run,” said Moyes, whose side managed only a Jarrod Bowen consolation. “What would West Ham’s expectations be?\n“Would you expect us to win a European trophy? Would you expect us to be challenging for the Champions League? Not many nodding their head in here so that’s the facts.\n“We’re doing well for what we’re doing. We’ll keep trying to win as many games as we can, we’ll keep trying to challenge top teams and challenge in cup competitions when we get the opportunity to do so.\n“The facts are we’ve been doing pretty well. We had to beat Arsenal at home to get to this game – maybe you expected us to beat Arsenal.\n“Tonight was a really tough tie for anyone coming to Anfield.”",
  "word_count": 545,
  "scraped_at": "2026-02-14T02:07:27.045325",
  "_text_extracted": true
}