{
  "article_id": "4e75fee08590",
  "url": "https://www.thisdaylive.com/index.php/2024/08/27/obaseki-rewards-edo-queens-with-n100m-for-winning-wafu-b-cup/",
  "title": "Obaseki Rewards Edo Queens with N100m for Winning WAFU - B Cup – THISDAYLIVE",
  "date": "20240827T021500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nObaseki Rewards Edo Queens with N100m for Winning WAFU-B Cup\n*Charges team to win CAF Champions League\nThe Governor of Edo State, Mr Godwin Obaseki on Monday, announced a N100million cash reward for the victorious Edo Queens Football Club on their outstanding performance and title conquest at the 2024 WAFU-B Zonal Champions League qualifiers in Côte d’Ivoire.\nThe sports-loving Governor announced during a grand reception the Edo State organised for the reigning Nigeria Women Football League (NWFL)2024 champions at the Festival Hall in Government House Benin City.\nReceiving the West African champions Edo Queens whose exceptional skill and resilience earned them a commanding 3-0 victory against Ainonvi FC of Benin Republic in the final in Abidjan on Friday to lift the 2024 WAFU-B Zonal Champions League cup and qualification to CAF Champions League proper, Governor Obaseki showered encomium on the entire team, including the supporters club.\n” You have all done well. For me, this is our season of celebration. Tomorrow, Edo will be 33 years old. When I look at the present you have come to give me, I am so glad.\n“Before we came into power, there was no respect for Edo women; nobody gave them the chance but thank God all that has changed now. Some past governments didn’t understand that sports is a vital aspect of youth development and thank God we recognize that. I am happy that the work and investment we have put in since the past eight years is showing now and we will continue to encourage our youth.\n“I congratulate you girls. I encourage you to win the CAF Champions League. I will not tell you what I will do for you yet but for this you have done, you have made us proud and you have made Nigeria proud. So, I give you all one hundred million Naira, ” Governor Obaseki said.\nEdo Queens before emerging as the 2024 WAFU-B champions as the second Nigerian team to do so in history, they had previously won the Sheroes Cup, Betsy Obaseki Cup and the NWFL Premiership titles.\nThe representatives of Edo Queens were outstanding throughout the WAFU B zonal qualifiers, winning all their five matches convincingly. They scored 14 goals and only conceded one goal in the match against\nInter D’Abijdan which they won 2-1.\nEdo Queens will be in Egypt for the 4th Edition of the CAF Women’s Champions League finals later this year.,\nMeanwhile, the Executive Chairman, of Edo State Sports Commission, Yusuf Alli and the head coach of the victorious Edo Queens Moses Aduku have heaped praise on the Edo State Governor and the First Lady Dr Betsy Obaseki for their support and investment in women’s football, which has been instrumental in the team’s success. They ascribed the success of the team to Governor Obaseki’s prompt response and release of funds for preparations.\nThe Edo Sports Commission boss maintained that the commitment of the Edo State Government to developing women’s football and sports in general is what has led to the success of Edo Queens.\n“Since I assumed office in Edo, I have been winning. We reigning national champions and now West African champions. We played five games in Cote d’Ivoire, winning all with 14 goals and only conceded one. Our girls have done well. We sincerely thank our Governor for the huge support he has given us in everything we have done. I made a huge mistake in applying for funds to take care of the girls’ bonuses but upon realizing my mistake, I wrote to the governor again, drawing his attention, instead of query, the governor gave express approval and immediately we got the money we requested. What else can we say than to say thank you to our governor for his understanding and support,” Alli said.\nThe head Coach of the team Moses Aduku said that the Governor’s interest and prompt release of funds gave him and his team more confidence while going into the West Africa battle.\n“I was confident that we were going to achieve good results. I told my inner man that we were capable of winning the zonal ticket even though we were going there for the first time. We were not rated but God saw us through. We remain grateful to the governor and I want to start preparation for the Champions League proper as soon as I present this cup because early preparation is key. We want to assure our Governor of bringing another cup home,” Aduku enthused.",
  "word_count": 750,
  "scraped_at": "2026-02-14T02:14:29.072292",
  "_text_extracted": true
}