{
  "article_id": "4e77e8897bb1",
  "url": "https://metro.co.uk/2025/04/12/thomas-frank-makes-prediction-real-madrid-vs-arsenal-champions-league-showdown-22899023/",
  "title": "Thomas Frank makes prediction for Real Madrid vs Arsenal Champions League showdown | Football",
  "date": "20250413T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brentford boss Thomas Frank has made a prediction for the Champions League showdown between Arsenal and Real Madrid on Wednesday.\nThe Gunners head into the quarter-final second leg clash at the Bernabeu with a 3-0 lead after hammering the Spanish side at home in the first leg.\nBut Real Madrid superstar Jude Bellingham has warned Arsenal that ‘anything can happen’ in the mouth-watering fixture in the Spanish capital.\nThe La Liga champions are the most successful team in the history of the Champions League – having clinched 15 titles – and are the current holders.\nFrank, though, speaking after Arsenal’s 1-1 draw against Brentford on Saturday, has suggested that he thinks the north Londoners will progress.\nThe Danish head coach is adamant that Mikel Arteta’s side will be ‘fine’ as he spoke about the game in his post-match press conference.\nAsked for his own approach if he was heading to the Bernabeu with a 3-0 lead, Frank said: ‘I’m not (laughing) but I’d love the challenge!\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think you need to speak with Mikel about that. He and his coaches have shown how good they are and how much they’ve progressed as a club.\n‘Mikel has done an exceptional job to make Arsenal extremely competitive for the last three years.\n‘They are in a good position. Looking from the outside, Arsenal work hard and they are very good defensively.\n‘They’re very good on defensive set-pieces. So I think they’ll be fine [against Real Madrid on Wednesday].’\nArteta, meanwhile, says Arsenal must now start preparing ‘for the most beautiful game of the season’ against Carlo Ancelotti’s men.\n‘We still have six games to play in the Premier League – which are going to be really important for sure – but, for now, it’s all about Wednesday,’ Arteta said.\nMore Trending\n‘Now it is time to recover well and tomorrow we have to start to prepare for the most beautiful game of the season.’\nQuizzed if the Real Madrid game was in the players’ minds against Brentford, Arteta added: ‘No.\n‘I think the players know that when you come to the Premier League and the position that we played today, how tough it was going to be and what it requires and it requires your best every time to win.’\nArteta has also provided injury updates on Thomas Partey, Jorginho and Ben White ahead of the second leg with Real Madrid.\nMORE: Gabriel Martinelli reveals ‘broken leg’ fear ahead of Real Madrid v Arsenal game\nMORE: Mikel Arteta reveals Ben White injury setback ahead of Real Madrid match\nMORE: Arsenal tipped as ‘most concrete option’ for wantaway Bayern Munich star",
  "word_count": 492,
  "scraped_at": "2026-02-14T02:26:33.614143",
  "_text_extracted": true
}