{
  "article_id": "4e7b19202513",
  "url": "https://greatbendpost.com/posts/0f83aafe-18f1-4944-b4a8-df60b624d6f4",
  "title": "Thursday Sports Headlines and Scores presented by Barton Community College",
  "date": "20250828T154500Z",
  "domain": "greatbendpost.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NEW YORK (AP) — Two days before the U.S. Open’s singles competition began, Billie Jean King sat around a table in the Arthur Ashe building with a small group of up-and-coming players on the women’s tour. Steps away from the tournament’s biggest stage, the group shared stories, raised questions and listened to King’s advice. It’s a meeting called the Billie Jean King Power Hour, and it’s been a behind-the-scenes staple in New York for 28 years. She was joined last week by WTA veterans Ilana Kloss, Leslie Allen and Shelby Rogers.\nNEW YORK (AP) — U.S. Open opponents Taylor Townsend and Jelena Ostapenko got into a face-to-face argument on the Court 11 sideline right after their second-round match ended. Townsend said Wednesday that Ostapenko told her she has no class and no education. Townsend, who is from Chicago, was a 7-5, 6-1 winner against 2017 French Open champion Ostapenko, who is from Latvia. After the two players met at the net for a postmatch handshake, they stayed near each other instead of going their separate ways, as players usually do. Ostapenko wagged a finger at Townsend as they spoke.\nWeek 1 of the 2025 college football season is packed with marquee matchups, quarterback debuts and revenge games. Key games include Texas at Ohio State, LSU at Clemson and Notre Dame at Miami. Other notable matchups feature Virginia Tech vs. South Carolina, Syracuse vs. Tennessee and Alabama at Florida State. Here's what you need to know about each matchup, and how the playoff picture could begin to take shape as early as Week 1.\nLOS ANGELES (AP) — Shohei Ohtani’s reliance on his fastball caught up with him recently, making the Los Angeles Dodgers’ two-way superstar intent on changing his pitch mix. He had given up a combined nine runs and 14 hits in his two previous outings, a pair of Dodgers losses to the Los Angeles Angels, his former team, and the Colorado Rockies. Making his 11th start as he returns from elbow surgery two years ago, Ohtani struck out a season-high nine over five innings in a 5-1 victory against the Cincinnati Reds for his first win on the mound with the Dodgers. His previous pitching win came on Aug. 9, 2023, with the Angels against San Francisco.\nNEW YORK (AP) — Three games into his major league career, Nolan McLean has already accomplished something Tom Seaver, Dwight Gooden, Jacob deGrom or anyone else wearing a New York Mets uniform could not. McLean became the first Mets pitcher to win his first three MLB starts, tossing eight marvelous innings in a 6-0 victory over the Philadelphia Phillies that completed a three-game sweep. Facing the Phillies, who entered Wednesday with the second-best batting average in the majors, the 24-year-old right-hander allowed four hits and walked none with six strikeouts. He threw 95 pitches — just 55 through the first six innings.\nGRIMSBY, England (AP) — Manchester United sank to a new low under Ruben Amorim by getting eliminated by fourth-tier Grimsby Town after a marathon penalty shootout in the second round of the English League Cup on Wednesday. Grimsby won a dramatic shootout 12-11 at the 9,000-capacity Blundell Park, with Bryan Mbeumo missing the decisive penalty. United needed late goals by Mbeumo and Harry Maguire just to salvage a 2-2 draw in regulation, having trailed 2-0 at halftime. It will go down as one of the most embarrassing results in United’s history and leaves the team winless in three games so far this campaign, after a woeful 15th-place finish in the Premier League last season.\nARLINGTON, Texas (AP) — Adolis García, Joc Pederson and Kyle Higashioka each hit a three-run homer, Corey Seager went deep a team-leading 21st time and the Texas Rangers blew out the Los Angeles Angels 20-3. García’s 17th home run highlighted a four-run first inning. Pederson made it 7-1 in the second with his seventh of the season and Seager added a two-run shot in the fourth. Higashioka’s 10th homer for a 20-3 lead came on the last of 21 very slow pitches by first baseman Oswald Peraza. His pitches were all clocked between 30 and 40 mph. Peraza allowed eight runs while getting one out.\nDawn Staley said she would have felt compelled to leave South Carolina for the New York Knicks head coaching job if she'd been offered the position. Staley is a three-time national champion with the Gamecocks. She was interviewed by the Knicks, who ultimately hired Mike Brown. She spoke about her interest in the job on the “Post Moves” podcast. Staley said she wanted to break barriers for women. And she questioned whether her inquiries about the impact of hiring the NBA's first female head coach affected her chances.\nMONACO (AP) — European soccer’s heavyweights and unheralded newcomers will find out their Champions League opponents when the draw is made on Thursday in Monaco. All are gathering at a beach-side concert hall for the draw ceremony starting at 6 p.m. local time (1600 GMT). They include titleholder Paris Saint-Germain and newcomer Pafos of Cyprus. The record 15-time champion Real Madrid and first-timer Kairat Almaty of Kazakhstan. English champion Liverpool and Norway’s Bodo/Glimt from inside the Arctic Circle. It's the second season of the league phase format with 36 teams playing eight different opponents and ranked in a single-standings table.\nFORT LAUDERDALE, Fla. (AP) — Lionel Messi scored twice in his return and Inter Miami beat Orlando City 3-1 on Wednesday night to advance to the Leagues Cup Final. Inter Miami will be on the road to face the Seattle winner in the final Sunday. The Sounders beat the LA Galaxy 2-0 on the road later Wednesday. Messi was back for the second time in two weeks after a setback in his recovery from a hamstring injury. Marco Pašalić opened the scoring for Orlando just before halftime. Messi tied it in the 77th, converting from the penalty spot after Tadeo Allende was pulled down in the box. It was more Messi magic in the 88th when he combined with Jordi Alba to put Miami ahead.\nFinals\nINTERLEAGUE\nFinal N.Y. Yankees 11 Washington 2\nFinal Seattle 4 San Diego 3\nFinal Houston 4 Colorado 0\nAMERICAN LEAGUE\nFinal Cleveland 4 Tampa Bay 3\nFinal Boston 3 Baltimore 2\nFinal Toronto 9 Minnesota 8\nFinal Kansas City 12 Chicago White Sox 1\nFinal Texas 20 L.A. Angels 3\nFinal Athletics 7 Detroit 0\nNATIONAL LEAGUE\nFinal Atlanta 12 Miami 1\nFinal N.Y. Mets 6 Philadelphia 0\nFinal Pittsburgh 2 St. Louis 1\nFinal Arizona 3 Milwaukee 2\nFinal L.A. Dodgers 5 Cincinnati 1\nFinal San Francisco 12 Chicago Cubs 3",
  "word_count": 1106,
  "scraped_at": "2026-02-14T02:11:49.082455",
  "_text_extracted": true
}