{
  "article_id": "4e8b9d37e9f4",
  "url": "https://theathletic.com/5304696/2024/02/28/barcelona-ilkay-gundogan-la-liga-xavi/",
  "title": "Ilkay Gundogan Barcelona impact : He is now Europe most prolific creator",
  "date": "20240228T131500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "An impressive stat surfaced after Barcelona’s 4-0 victory over Getafe on Saturday: Ilkay Gundogan had become the first player in Europe’s top five leagues to create 100 chances this season.\nWhen he joined Barca last summer there was some scrutiny over his signing; a 33-year-old arriving on a three-year deal, with a reported yearly wage of €9million (£7.7m; $9.7m at current rates) after tax.\nAdvertisement\nTime will tell whether that investment continues to pay off but, eight months later, it certainly looks a good one. Gundogan has provided 10 assists (the most in the team) and scored five goals across 38 games in all competitions. He is Xavi’s most used player (more than 3,000 on-pitch minutes) and his most effective. No Barca midfielder has matched the quality of his performances.\nGundogan’s desire for success remains undiminished (as shown by his words of frustration after October’s Clasico defeat by Real Madrid) and his versatility has helped solve some of the team’s biggest tactical problems — sometimes to the detriment of his opportunities to create chances in attack, which makes this weekend’s landmark all the more impressive.\nLet’s start by dissecting the stats.\nGundogan’s total of 100 chances created in all competitions has to be contextualised. First, he starts for a team involved in a European competition, so has played more football than many others. He is also his team’s regular set-piece taker.\nOf those 100 chances, 30 came through set pieces — but even then, his tally of 70 open-play chances is only bettered by Manchester City’s Phil Foden, with 72.\nIf we focus just on La Liga players, Isco is closest to Gundogan, although the Real Betis midfielder suffered a hamstring injury this month that could keep him out for the rest of the season.\nAlso in Spain’s top 10 are Toni Kroos, Alex Baena, Ivan Rakitic, Iago Aspas and Takefusa Kubo — all regular set-piece takers. If we focus on chances created from open play, Gundogan’s lead looks even healthier. Real Madrid’s Jude Bellingham is his closest rival (58 open-play chances), but even he is some way behind.\nWhen it comes to ranking Gundogan among his Barca team-mates, his creativity becomes even starker. Full-back Joao Cancelo is the closest to him (37 chances created).\nAdvertisement\nAs mentioned, Gundogan has played the most minutes of the Barca squad, but that’s certainly not reason enough for him to be so far ahead. For context, he is, on average, creating three chances per 90 minutes, while Cancelo has created 1.5 per 90. Gundogan’s closest rival at Barca is Raphinha, who is creating 2.8 chances per 90 from a significantly smaller sample size.\nThe numbers confirm a feeling that was quickly established among Barca’s manager and his coaching staff this term.\n“When Gundogan has the ball, everything gets better,” Xavi said after September’s 5-0 win over Royal Antwerp in the Champions League. “He does everything well, absolutely everything. If we play well, it’s because of guys like him. His signing was heaven-sent, honestly. He is a superlative player, a total joy to watch.”\nBefore this weekend’s win at home to Getafe, Xavi added further praise. “Gundogan can make the difference as a deep-lying midfielder but also between the lines. He can do it anywhere,” he said. “He is having an outstanding season in numbers, but also with what he adds to the group. He’s a fundamental piece of the team.”\nGundogan’s versatility has been a big positive for Barcelona this season but the fact they have relied on that so heavily also reveals the team’s dysfunctions.\nBarcelona (and specifically Xavi) had planned to use Gundogan primarily as another creative force in the final third. The manager believed 21-year-old Pedri, who had been struggling with injury in consecutive seasons, needed a partner in that department.\nBut of Gundogan’s 23 La Liga starts this season, only 12 have come as an attacking midfielder. Instead, he has often found himself covering further back.\nIn the summer, Xavi planned to use Oriol Romeu as Sergio Busquets’s replacement in the anchor role — a very tough act to follow. Despite promising signs in pre-season, Romeu’s performances quickly turned him into a liability in Xavi’s eyes.\nAdvertisement\nThe last straw for the manager came after uninspiring September displays at Porto in the Champions League and Mallorca in La Liga. Both opponents profited from putting pressure on Romeu, who struggled to find solutions.\nThat was when Xavi decided to deploy Gundogan into a more defensive position, with Romeu losing his place. It was not a new position for him — he performed there with Manchester City — nor is it one he dislikes, but it is not where Barcelona need him most.\nOnce more, the team was left short of what they were looking for in the final third, leading Xavi to the idea of reinventing centre-back Andreas Christensen as a holding midfielder this month, with Gundogan relocated back to his preferred spot higher up the pitch.\nIs Christensen an ideal fit? Possibly not. But is it a fair price to pay to enable Gundogan to play closer to the box? It clearly is for Xavi, as it’s been his game plan for the past five matches.\nDespite starting nearly half of his games this season as a defensive midfielder, no one in the Barcelona squad has completed more than Gundogan’s 49 passes into the opponent’s penalty area. Lamine Yamal has 47, while Frenkie de Jong and Cancelo share third spot with 33. Gundogan also tops the team’s ranking in ‘progressive passes’ completed (those that move the ball towards the opponent’s goal at least 10 yards from its furthest point in the last six passes, or any completed pass into the penalty area).\nHowever, it’s not only Gundogan’s passing and creativity that pushed Xavi to rethink his line-up — it’s also his skill at crashing into the box.\nHere are two prime examples from the last month.\nIn the screengrab below, from Saturday’s match against Getafe, Raphinha has the ball on the right flank, waiting for team-mates to join the move before crossing. Gundogan arrives at full pace, indicating the space he plans to attack behind the defence.\nRaphinha sends the ball to the right spot, with Gundogan unmarked thanks to a perfectly timed run — but he could not connect properly with his header on goal.\nLooking a little further back to Barcelona’s La Liga trip to Alaves on February 3, we can find another prime example of Gundogan’s movement. This time, he did find the back of the net.\nAdvertisement\nThe screengrab below shows Pedri receiving the ball on the left wing, with Gundogan quickly joining the attack from a deeper position. Pedri is smart enough to read the situation and wait for him to make his run.\nFrom here, Gundogan fakes a move to the near post, drawing the attention of Alaves defender Ruben Duarte. At the same time, he indicates to Pedri that his final destination will be the far post where there is now space, with Duarte having been dragged out of position.\nThe connection between them does the rest. Pedri crosses to the exact spot for Gundogan, who finds the goal with a perfect volley.\nNo Barca player performs these kinds of actions better than Gundogan, and it hasn’t gone unnoticed by Xavi.\nIn their Champions League last-16 first leg at Napoli, the manager adapted his system to get the best out of Gundogan, playing him as a No 10 in a 4-2-3-1 formation that saw Pedri in an unfamiliar role as a ‘false’ left-winger. Gundogan was one of the best players on the pitch in the 1-1 draw on February 21.\nGundogan wants to become a leader at Barca in the way he was at Manchester City, where he was captain. He is not known to be the most vocal member of a dressing room, but former team-mates at the Premier League club told The Athletic his work ethic and the standards he sets on the pitch did all the talking necessary.\nIf there’s any potential criticism he might face, it’s in situations where his lack of pace has been exposed in quick defensive transitions. He is older than a typical box-to-box midfielder and Barcelona’s disorganised high-pressing system can leave him vulnerable.\nHere, there is a comparison to draw with Busquets, the legendary midfielder who has been deeply missed by members of the coaching staff, who believe his departure was not properly covered.\nAdvertisement\nEven though Busquets was a generational talent, arguably the best-ever in his position, he did not escape criticism in his final campaigns at the club. But again, that criticism has to be qualified: as soon as Barca lost their structure and left Busquets on his own to cover wide spaces, he was powerless. When players such as Busquets and Gundogan provoke fans’ ire, questions might be better asked of the system rather than the individual.\nThat said, Gundogan’s impressive returns should not make him immune to the criticism levelled at the team as a whole and, by the sounds of it, he is more than aware of that himself.\n“Each one of us can improve what we are adding to the team. We are performing at a lower level than our expectations at the beginning of the season,” he said in a recent interview with the Catalan newspaper La Vanguardia.\nAt the same time, members of the player’s camp believe his numbers would easily be better if Barcelona had not been so wasteful in front of goal. According to data on La Liga matches from Fbref.com, Gundogan has the biggest discrepancy between assists and expected assists (xA) in Barca’s squad this season (-2.3), suggesting his team-mates are converting the chances he creates at a below-average rate.\nIt is another revealing figure in a season that has brought a reality check at Barcelona and poured more doubts over the club’s long-term project, with Xavi leaving at the end of the campaign.\nBut there should be no doubt about Gundogan’s impact.\n(Top photo: Angel Martinez/Getty Images)",
  "word_count": 1675,
  "scraped_at": "2026-02-14T01:51:19.048845",
  "_text_extracted": true
}