{
  "article_id": "4e8ea6328191",
  "url": "https://www.caughtoffside.com/2024/08/06/tottenham-initiate-move-dominic-solanke/",
  "title": "Tottenham have held talks to sign Dominic Solanke",
  "date": "20240806T093000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are looking to sign Dominic Solanke from Bournemouth and they are hoping to make progress over a deal for him.\nThe striker has a £65 million release clause in his contract and Spurs have already held talks regarding a move for him, according to the Telegraph.\nIt is no secret that Spurs need a quality striker and Solanke certainly fits the profile. The 26-year-old scored 21 goals in all competitions last season and he could transform Spurs in the attack.\nThe North London club have missed a clinical goal scorer since the departure of Harry Kane and Solanke could fill that void next season. The player will be keen on joining the North London club as it would be a major step up in his career. He will want to compete at the highest level and Tottenham will be able to provide him with that platform. The North London club will compete in the UEFA Europa League and they need more quality and depth in the side.\nSolanke could add a new dimension to their attack with his goal-scoring ability and hold-up play.\nTottenham used Son Heung-min as a makeshift striker last season but they need to bring in a more natural goalscorer to lead the line for them. It remains to be seen whether they are ready to pay £65 million for the Englishman this summer.\nDominic Solanke could transform Tottenham\nSolanke is at the peak of his powers and he is well settled in English football. He could make an instant impact at Tottenham if the move goes through. The London club will be hoping to secure Champions League qualification excision and do well in the domestic competitions. Signing the right players will help them improve.\nMeanwhile, Bournemouth will not want to let their prized asset leave for a knock down price. It is fair to assume that Spurs will have to accept their demands in order for the move to go through.\nThey will have to improve the other areas of their squad as well and it remains to be seen whether Daniel Levy is willing to sanction a £65 million move for the striker.",
  "word_count": 360,
  "scraped_at": "2026-02-14T01:51:48.880132",
  "_text_extracted": true
}