{
  "article_id": "4e9fc516e27d",
  "url": "https://www.theguardian.com/world/2024/oct/24/thursday-briefing-first-edition-send-special-education-needs-disability-england",
  "title": "Thursday briefing : How the state is failing children with special needs – and what it costs",
  "date": "20241024T090000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning. The annual budget for children with special educational needs and disabilities (Send) in England now stands at £10.7bn, an increase of 58% in a decade. Despite that, there has been no improvement in outcomes, and many parents say that their children are being sold short. The need for services is so great against the backdrop of years of council cuts that two in five local authorities are at risk of effectively declaring bankruptcy by 2026. In other words: the system is somehow underfunded and financially ruinous at the same time, and failing the children it is supposed to support.\nThat is the grim diagnosis contained in a report by the National Audit Office (NAO) published this morning, which warns that system-wide reforms are needed to keep councils afloat. And there is no doubt that the figures it contains are eye-watering.\nBut the question of whether costs can be brought under control without placing the most vulnerable children in society at an even greater disadvantage is not one that the NAO can answer on its own. And its report comes at a time when the very legitimacy of these children’s needs is coming under scrutiny as never before.\nToday’s newsletter, with the Guardian columnist John Harris – who has been writing about this furiously for years – is about what’s gone wrong, where responsibility lies, and how the problem might start to be fixed. Here are the headlines.\nFive big stories\n-\nBudget | Rachel Reeves will announce at the International Monetary Fund a plan to change Britain’s debt rules that will open the door to more borrowing for long-term capital investment. After weeks of speculation, the change could release up to £50bn extra for infrastructure projects.\n-\nFrance | Gisèle Pelicot, the French woman who has become a feminist hero for insisting that the rape trial of her ex-husband and 50 other men should be held in public, has told a court in southern France she was driven by her desire to change society and expose rape culture. She said: “I wanted all woman victims of rape … to say: Mrs Pelicot did it, we can do it too.”\n-\nPolice | The identities of armed police officers charged after opening fire at suspects are likely to stay secret in future unless they are convicted, the home secretary has announced. Yvette Cooper’s statement came after the acquittal of the Metropolitan police sergeant Martyn Blake for shooting dead Chris Kaba.\n-\nUS | A former model who says she met Donald Trump through the late sexual abuser Jeffrey Epstein has accused the former president of groping and sexually touching her in an incident in Trump Tower in 1993. Trump’s presidential campaign called the allegation “unequivocally false”, calling it a fake story “contrived by the Harris campaign”.\n-\nDementia | Tens of thousands of dementia patients are to be enrolled in clinical trials designed to dramatically speed up the hunt for a cure, leading scientists have announced. The initiative is intended to challenge “historically low” numbers enrolled into trials in the UK.\nIn depth: ‘The numbers can obscure the human cost of all this – and what’s at stake’\nThere are about 1.9 million children and young people with special educational needs because of disabilities or learning difficulties. The children who need the most help tend to have an education, health and care (EHC) plan, a legally enforceable agreement that sets out what they are entitled to. That group is about 576,000 – up 140% from 2015 – and is expected to reach 1 million within a decade.\nBecause EHC plans include things such as transport to a school outside the council area if no adequate provision is available locally, the costs can tot up quickly, and often run to thousands of pounds each year. But they are of crucial importance to the families concerned. “If you’re a special needs parent, an EHC plan is often the only bit of certainty you have,” John said. “It’s a legal document which, at least in theory, says that your local authority is committed to it. But even now, a lot of the time, those things just aren’t being delivered.”\nHere’s what you need to know about what’s going wrong.\nHow we got here\nThe crisis can be traced back to 2014, and the Children and Families Act, which expanded eligibility for Send provision in both directions – downwards to preschool, and upwards to the age of 25. That would all be governed by an EHC plan. A document explaining the changes to young people set out a key provision with deceptive simplicity: “The Act says the council must make sure the child or young person actually gets the help with their education that their plan says they should get.” And, in the foreword: “It is about making children’s lives better.”\n“It was a good thing on paper,” John said. “At least rhetorically, it was intended to ease some of the problems that children with special educational needs faced.”\nBut the act did not explain how all this would be paid for – and even as the government introduced major new obligations for councils, town halls faced savage cuts to their budgets. “The story of that bill is of good intentions completely shredded,” John said. “It is the story of the depth of austerity – and the part of the state that got the most brutal treatment was the councils.”\nAt the moment, councils are allowed to exclude these costs from their accounts, so that they do not breach their statutory obligation to set a balanced budget. If that accounting sleight of hand expires as it is supposed to in 2026, the cumulative deficit across English councils will be about £4.6bn, the NAO says, and 43% will be at risk of effective bankruptcy.\nThe effect on children\nThe NAO report largely casts the problem in financial terms, and maybe you can’t blame them – they are literally auditors, after all. But the first victims of the way council budgets have fallen apart are the children with a legal entitlement to support.\nIn order to access central government money to help them with their budget problems, councils have to show how they are going to make savings. And while former Conservative children’s minister Claire Coutinho said that the idea was “not about targeting a particular reduction in EHC plans”, there is lots of evidence that councils are setting reduction targets and refusing more requests for assessments.\n“In a way, the numbers can obscure the human cost of all this, and what’s at stake in people’s lives, and the potential that is being lost,” John said. Only this week, he met the father of an autistic teenager whose crucial transport to school had been summarily withdrawn and only reinstated after endless panicky phone calls.\nThe ‘golden ticket’ myth\nMeanwhile, the families struggling in a system that only issues EHC plans within the statutory 20-week limit 50% of the time are increasingly being made to feel as if they are pushy parents or making unreasonable demands, rather than doing exactly what the government told them they should do. EHC plans have been called “golden tickets”, and the parents who fight for their children have been cast as “middle-class parents pushing it”. Even in the NAO report, the need for special needs provision is strikingly described as “demand”, as if this was just a consumer marketplace. It’s hard to imagine any of that language being applied to social care, for example.\nLast week, the Conservative leadership candidate Kemi Badenoch launched a pamphlet that claimed “being diagnosed as neurodiverse” (the wrong word) now comes with “economic advantages and protections”, with the rise in conditions such as autism cast as part of “a narrative built on fragility and medicalisation”. (John, whose son has autism, wrote an excellent piece dismissing that nonsense.)\nWe might ask why everyone is clamouring for this special treatment when research last month found that children with special needs have fallen further behind since the 2014 reforms, and on average are almost two years behind their peers in writing by year 6.\nThe truth is there is lots of evidence that disability and learning difficulties are the exact opposite of a path to economic advantage. “As I said in that piece, this has been in the culture for a while, this idea that autism is somehow got up,” John said. “But very often in these culture war things, you can eventually trace it to public spending. Nobody ever wants to say we’re making cuts because we can’t afford it. There is a drive to make the people with the needs look unreasonable instead.”\nThe cost of cuts\nPerhaps the most bitter part of this story is how severely self-inflicted much of the damage is: while it is true that the number of children with EHC plans has risen more than anyone expected, it is also true that the expense of fulfilling them has been made vastly worse by the failure to fund good local services.\nOne obvious example: if more had been spent on ensuring adequate local provision for children with disabilities and learning difficulties, the vast transport budget – which the NAO says has risen by 80% in real terms to £1.4bn a year in less than 10 years – would be far smaller. (See this First Edition from March for more on that.)\n“It’s always the same story,” John said. “Cuts are expensive. That is the cruel irony of the austerity years.”\nHe points to the demise of Sure Start, and how that led to a big fall in early intervention. “And councils’ children’s departments have been decimated. In Newcastle, for instance, at one stage there was only one educational psychologist to assess all of the children in the area for EHC plans. That means you end up having to hire locums on hugely expensive day rates.” And no parent wants to go to a tribunal – but when councils reject their assessment requests, they often feel they have no choice. The campaigning website Special Needs Jungle estimates that councils spent about £99m on defending these cases in a single year – and lose 98% of the time.\nThe slim hopes of a solution\nThe NAO report is pretty vague about the best way forward, but says the government should consider “whole system reform”. That might be code for ripping up the 2014 act and starting again – a move that would leave many families in anxious limbo. It also says that work needs to be done to understand the root causes of the increase in need for EHC plans, and that a more integrated system with a “vision and long-term plan for inclusivity” should be set out, hinting that mainstream schools should be used more of the time.\nAll of that sounds like it is more about the budgets than the children. “On an emergency level, the government should really put more money in to prop the system up, and then remedy the things that have gone wrong,” John said. “You might be able to get to a properly functioning system in a decade.”\nThe government acknowledges that changes will take time, and has responded to the report by promising “a greater focus on mainstream provision and more early intervention”. But, John said “I fear that removing EHC plans, or taking away the right to a tribunal, will be part of what they do. If that happens, there will be thousands of parents marching down Whitehall. And I will be one of them.”\nWhat else we’ve been reading\n-\nIn this conversation with the author Moustafa Bayoumi, Ta-Nehisi Coates (above) reflects on the reception of his writing about Palestine and Israel: “People who don’t want to talk about apartheid, because it’s uncomfortable … try to turn this into a conversation about manners.” Archie\n-\nAngelique Chrisafis lays out the profiles of the men accused of raping or assaulting Gisèle Pelicot, the 71-year-old French woman who was sedated and raped by her former husband who allegedly recruited dozens of others to attack her. The piece is a reminder of the chilling normality of people who are accused of such monstrous crimes. Nimo\n-\nJohn Burton was only 27 when he was given an £18m budget and told to build a rollercoaster at Thorpe Park. Tom Lamont’s long read about what happened next is an absolute delight. Archie\n-\nThe ubiquity of cocaine use in the 1980s crept into the NBA, which became “littered with addiction and lost potential”, writes Jacob Uitti, who traces the slow but marked shift in the league’s approach to dealing with drug use. Nimo\n-\nMindless mobs, stampeding hordes, herd mentalities: crowds get a very bad rap. In this excellent piece, Dan Hancox - who has a new book out on the subject - argues that a lot of the time, “joining a crowd of like-minded souls brings us kinship, confidence, and joy”. Archie\nSport\nFootball | Darwin Núñez scored the only goal against RB Leipzig as Liverpool made it three wins out of three in the Champions League. Meanwhile, Manchester City thrashed Sparta Prague 5-0 thanks to a spectacular double from Erling Haaland.\nCricket | England won the toss and batted first in the series-deciding third Test against Pakistan in Rawalpindi. A few minutes ago, they had reached 68-1. Follow it live here.\nAthletics | Geoff Capes, who competed for Great Britain in the shot put at three Olympic Games, won two Commonwealth titles and twice won the World’s Strongest Man competition, has died aged 75, his family have announced.\nThe front pages\n“Schools funding crisis grows as special needs costs soar to £10bn” is the top story in the Guardian this morning. “Starmer’s top aides drawn into Trump row” is the splash in the Telegraph while it’s a similar headline in the Times: “PM’s chief of staff is drawn into Trump row”. The Daily Mail leads with “Fury over Reeves raid on private sector pensions”, while in the i it’s “2024 Budget cuts are a disaster for crime victims, warn former UK justice secretaries”. “Will you force me to fly to Dignitas to die alone?” – the Daily Express continues to campaign on assisted dying. The page one lead in the Financial Times is “Goldman and Apple fined $89mn for dodging obligations over card tie-up”. The Metro has “Tower block baby” – doctors saved Posie, delivering her five weeks early, after her pregnant mother fell 10 floors to her death. “RIP, big man” – the Daily Mirror says farewell to Geoff Capes, Britain’s greatest shot putter and two-time World’s Strongest Man.\nToday in Focus\nLiam Payne: the heady rise and tragic death of a One Direction star\nOritse Williams of JLS and the Guardian’s head rock and pop critic, Alexis Petridis, reflect on the life of Liam Payne, including the extraordinary success of One Direction, and his struggles with the fame that came with it\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nThe hoolock gibbon faces extinction due to deforestation, pollution and mining. In Barekuri, a village in north-eastern India, there are just 19 gibbons left but they have a symbiotic relationship with the villagers, who are fighting hard to protect them. Especially Mohit Chutia, a farmer, who says the apes are like his own children, with Chutia feeding the gibbons fruit and making sure they are safe as can be.\nScientists and villages are pressuring the state government to stop further mining activity in the area, start planting trees to restore habitat and food resources, and explore “canopy bridges” to fix breaks in the tree canopy. To learn more, watch our new documentary, Guardians of the Gibbons.\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2655,
  "scraped_at": "2026-02-14T02:11:06.623706",
  "_text_extracted": true
}