{
  "article_id": "4ebebf8550cd",
  "url": "https://theathletic.com/4558221/2023/05/29/brighton-andy-naylor-europe/",
  "title": "Brighton and Hove Albion . Whod have thought it ? ",
  "date": "20230529T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I’ve been to numerous destinations in Europe to write about Brighton & Hove Albion.\nIreland (several times), Spain, Portugal, Austria, Switzerland.\nAlways for pre-season friendlies, when the result didn’t matter.\nThe result didn’t really matter on Sunday, as my 28th year covering Brighton full-time concluded with a 2-1 loss away to Aston Villa.\nAdvertisement\nThat’s because Roberto De Zerbi’s team had already reached a dream, clinching a European spot for the first time in the club’s history with a 3-1 win against Southampton in the penultimate home game.\nThree days later, the Europa Conference League turned into the more prestigious Europa League, as sixth place was sealed by a 1-1 draw against champions Manchester City at the Amex Stadium.\nTo those in the boardroom — and to me — that’s a bonus. Just getting to Europe… who’d have thought it?\nNot in September, when head coach Graham Potter left for Chelsea, taking five of the backroom staff with him, including former captain turned coach Bruno Saltor, who would have been an ideal interim.\nThen an Italian turned up. A passionate, demonstrative perfectionist who got his team playing sophisticated, fantasy football, playing out from the goalkeeper in tight spaces, sometimes under severe strain from the opposition.\nBrighton fans have never seen anything like it.\nWho’d have thought it?\nNot me, when I signed for The Athletic in August 2019. Three months earlier, owner-chairman Tony Bloom had sacked Chris Hughton as manager after relegation was too close for comfort.\nThe squad became younger, the football more stylish under Potter, but two more bottom-six finishes followed with him at the helm.\nThere was a jump forward to ninth last season. Even so, who’d have thought it?\nDefinitely not me, when I sat in the rain at the Goldstone on April 26 in 1997, watching the last game at the ground that had been the club’s home since 1901.\nThe season before — my second covering the club full-time for the Argus, the local daily newspaper — Brighton were relegated to the fourth tier. It wasn’t a great start.\nThe Goldstone had been sold with nowhere else to go. The club was a mess, the fans were protesting.\nAdvertisement\nI was banned by the chief executive David Bellotti (now deceased) as the Argus continued to uncover the scandal of the club heading on a one-way route to oblivion under owners Greg Stanley and Bill Archer.\nDisguised in a peaked cap, I still reported on matches from the south stand, where I’d sat in my youth with my late grandparents. They were long-serving season ticket holders.\nBrighton beat Doncaster Rovers 1-0 in that final game to stave off for another week the risk of relegation from the Football League that had seemed a formality until Steve Gritt came in as manager to inspire an improbable revival.\nSeven days later, at Hereford, Brighton were on the canvas, 28 minutes from going down when Robbie Reinelt equalised, relegating Hereford instead.\nFrom there to here. Who’d have thought it?\nNot me, when the press facilities were as basic as the football. I had to balance my laptop on an oil drum (Doncaster), work in a press box with window frames but no glass (Macclesfield).\nI drove for two and a half hours to cover home games for the next two seasons after the Goldstone closed and games were played out in front of 2,000 crowds at Gillingham, in another county.\nNew chairman Dick Knight’s hands had been tied by the mess he’d inherited.\nBrighton’s Knight in shining armour brought the club back to the city, to a temporary home that lasted 12 years while a fight for planning permission to build a new stadium went deep into extra time.\nWithdean, aka “the Theatre Of Trees”: a mainly open-air athletics track in a residential suburb converted into a fourth-tier football ground with a capacity of around 8,000.\nI remembered it as the place where I ran the 100 yards, representing Woodingdean Middle School at the annual county athletics championships.\nWho’d have thought it?\nWithdean served a purpose. Four promotions (under Micky Adams, Peter Taylor, Mark McGhee and Gus Poyet). Two relegations (under Steve Coppell and McGhee).\nAdvertisement\nIt was a prolonged stop-off, an important part of the journey, but it was never going to be a platform for the Premier League, yet alone Europe.\nThat platform was the Amex, built with Bloom’s money after the lifelong fan with bulging pockets from a business empire built on sports betting took over the club in 2009.\nThe entry point was the Championship after winning the League One title under Poyet in 2010-11, the final season at Withdean.\nThere were near-misses in the play-offs to reach the promised land for Poyet’s side and under Oscar Garcia in successive seasons (2011-12 and 2012-13). They came agonisingly close to automatic promotion in 2015-16 under Hughton before losing out in the play-offs again and making amends the following year, promoted alongside Newcastle.\nNow this, after covering the club at four home grounds in four divisions under 20 permanent managers.\nI was a happily-married (still am) father of two young children — a five-year-old boy and a two-year-old daughter — when Brighton escaped the noose at Hereford.\nNow I’m a grandfather for the first time, pushing a pram again. Omari, a little bundle of joy, is five weeks old. I’ve told his dad, an Arsenal supporter, to raise him as a Brighton fan.\nParents used to risk ridicule for that with their children at school. Not any more.\nWho’d have thought it?\nEurope beckons again, this time for real. It might be Villarreal in Spain, Sporting Lisbon in Portugal. Maybe Monaco, where the Europa League draw will be held on September 1, perhaps even AC Milan at San Siro.\nAlexis Mac Allister, a World Cup winner with Argentina, may not be playing for Brighton by then. Moises Caicedo, his midfield accomplice from Ecuador, might not be either.\nThey’re so good that plenty of bigger clubs want them. But Brighton’s planning and recruitment is so good that they have the capacity to keep on thriving.\nWhat next? From February onwards De Zerbi and his players targeted the Champions League.\nThey only fell short in the final few games, during an exhausting schedule with several players injured or fatigued.\nThe Champions League and Brighton & Hove Albion mentioned in the same sentence.\nWho’d have thought it?\n(Photo: Craig Mercer/MB Media/Getty Images)",
  "word_count": 1073,
  "scraped_at": "2026-02-14T02:24:42.730537",
  "_text_extracted": true
}