{
  "article_id": "4f015264b801",
  "url": "https://www.teamtalk.com/liverpool/reds-reluctantly-put-deadline-mo-salah-contract-renewal-talks-slot-picks-prem-star-replacement",
  "title": "Mo Salah : Liverpool reluctantly put date on new deal talks as Slot identifies two targets as replacements",
  "date": "20240626T181500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool reluctantly put deadline on Mo Salah contract talks as Slot picks Prem star as one of two replacements\nLiverpool remain both determined and hopeful of tying Mo Salah to a new deal at Anfield this summer, but have placed a deadline on when they want an arrangement sorted by and amid claims Arne Slot has identified a West Ham man as one of two possible heirs.\nThe Egyptian has proved nothing short of sensational since Michael Edwards convinced Jurgen Klopp to sign the player in what has proved a bargain £36.9m deal from Roma in summer 2017. Having scored a whopping 211 goals from 349 appearances for Liverpool over his seven seasons on Merseyside, few have done more to ensure Klopp’s era will forever be remembered as a glittering one.\nWhile Salah turned 32 earlier this summer, he continues to lead by example and is regarded as not only Liverpool’s most talismanic star, but also lives the cleanest and healthiest lifestyles off the pitch too, making him the perfect model professional.\nHis importance to the Reds cause cannot be underestimated either; while his long-term partners in attack Roberto Firmino and Sadio Mane have long since departed and following the money trail to Saudi Arabia – Mane after initially moving to Bayern – Salah continues to do the business week-in, week-out in the Premier League.\nIN DEPTH ➡️ Mo Salah: Liverpool superstar’s most outrageous stats which show Slot why he’s simply irreplaceable\nHowever, the player has himself been the subject of significant interest from Saudi with Al-Ittihad having seen a whopping £150m offer for the player rejected last summer at Klopp’s insistence.\nThey continue to hover, though, and would love to bring Salah to their Pro-League, with the man widely recognised as the greatest Muslim player of all time and an absolute icon to the people of Saudi, set to be offered a deal in excess of the £1.3m per-week contract earned by Cristiano Ronaldo.\nMo Salah: Liverpool stance on new contract revealed\nProviding a recent update on the saga, TEAMtalk transfer correspondent Rudy Galetti has revealed another significant bid from Al-Ittihad is in the works for Salah, with another Premier League icon slotted as their Plan B if a deal fails.\nAnd with his deal at Anfield due to expire in summer 2025, the two parties are about to reach a criticial crossroads over the player’s future.\nAs it stands, sources have indicated to TEAMtalk that Liverpool would very much like Salah to continue at Anfield, with new boss Arne Slot also making it clear he sees the Egyptian as a major part of his plans going forwards.\nTo that end, Liverpool will do all in their power to extend Salah’s stay beyond its current arrangement, though also staying mindful of the fact they do have a top limit on what they will pay the player, coupled with the fact that, on a £350,000 a week deal, he is already comfortably the club’s highest-earning star.\nHowever, Salah will also be mindful of the fact that whatever he earns, or may earn on Merseyside, would be dwarfed by the luxuries on offer in Saudi Arabia, where he to make the move.\nAs a result, Liverpool know they cannot compete on that front. But what they can offer if the chance to continue playing at the very highest level – and their return to the Champions League next season after a year in the Europa League certainly helps with negotiations – as well as continuing to make Salah the fulcrum of their team. To that end, Salah knows his value to Liverpool FC.\nNonetheless, the Reds are also wary of the time-constraints around negotiations. And with the player able to negotiate a Bosman free transfer from January 1, were a new deal not to be signed, the Reds are understood to have placed a deadline of August 1 on both themselves and Salah to have agreed an extension by.\nLiverpool target West Ham man as one of two Salah replacements\nFailure to have agreed a new deal by that time will reportedly see Liverpool, unofficially at least, put Salah up for sale. However, given the interest from Al-Itihad in his services, any move away from Anfield would likely be something of a foregone conclusion.\nAs reported though, Slot, CEO of football Michael Edwards and sporting director Richard Hughes are all on the same page as far as a Salah renewal is concerned.\nThat said – and like any well-run club – Liverpool do have contigency plans in place with a list of would-be replacements drawn cited as potential replacements.\nDON’T MISS ➡️ Summer 2023 Klopp signing at Liverpool bizarrely challenges Slot to bring in his replacement\nTo that end, Slot is reported as having identified two stars as priority targets to replace Salah were the Egyptian to move on, with West Ham star Mohammed Kudus and PSV livewire Johan Bakayoko the men in question.\nThe pair have both just enjoyed excellent seasons with their respective clubs, with Kudus scoring 18 goals and adding seven assists from 48 appearances over the season and Bakayoko playing a part in 28 goals (14 goals, 14 assists) from the same number of games.\nDeals for either would not come cheap. Bakayoko – recently also said to be more close to a move to Arsenal over any other side – is rated at a club record €45m by PSV.\nThat’s just a fraction, though, of what a deal for Kudus could potentially set the Reds back with a eye-watering valuation of £85m now being struck of the Ghanaian’s head.",
  "word_count": 938,
  "scraped_at": "2026-02-14T01:57:18.882854",
  "_text_extracted": true
}