{
  "article_id": "4f36f84ca193",
  "url": "https://www.bbc.com/sport/football/articles/crme9kw4l3eo",
  "title": "Jordan Pickford : Why Everton goalkeeper is England undisputed number one",
  "date": "20251008T071500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pickford breaks record - and why he is number one\n- Published\nJordan Pickford has broken Gordon Banks' record with his eighth consecutive clean sheet for England - taking him past a year without conceding a goal for his country.\nThe 31-year-old Everton goalkeeper marked his 79th cap by surpassing World Cup winner Banks' mark in Thursday's 3-0 friendly win over Wales.\nFriday marks a year since he last conceded for England, in a 2-1 Nations League defeat by Greece.\nSince then he has faced nine shots on target, keeping out Serbia, Andorra (twice), Latvia, Albania, the Republic of Ireland, Greece and Wales.\nIn the past year England conceded in both games he was an unused substitute - against Finland and Senegal.\nThomas Tuchel had previously said \"the race is on\" to be England's number one, but is Pickford's place really under any serious threat - and just how good is he?\nTuchel has yet to see Pickford concede a goal since taking over as England boss at the start of 2025.\n\"Well done, congratulations. Fantastic achievement,\" said the German.\n\"He's a fantastic shot stopper. There is no doubt about it.\n\"There was a challenge for him because they pressed us high. We want to have the chance to escape the pressing with short passes, and not only with long shots from him. So, he did very well.\n\"He kept his composure. He kept calm. This is basically what we demand of him.\"\nWhile most of those recent shutouts have come in one-sided World Cup qualifiers, we already know Pickford's worth in big games and penalty shootouts at major tournaments too.\nWith the help of former England goalkeepers Paul Robinson and Rob Green, and his old Toffees team-mates Wayne Rooney and Theo Walcott, BBC Sport explores every aspect of Pickford's game and examines his importance to his country now.\n'What matters is he makes the save'\nAs well as saving penalties for England, Pickford's most famous attribute is probably how animated he is on the pitch.\nBut what are the technical strengths and weaknesses behind his emotions - and how much do they matter?\n\"I remember having a talk with Marge [Martyn Margetson, England's former goalkeeping coach] about Pickford and asking him if, technically, he is that much better than everyone else?\" Green told BBC Sport.\n\"Possibly not, and he has his own flaws and his own idiosyncrasies, like every goalkeeper has.\n\"When he is facing a shot, he drops his hands wide and low behind himself, and puts one hand up slightly before the other. There are oddities in his set position, in that he is slightly out of sync, but you can unpick his style all you like because what matters is that he makes the save.\"\nPickford is rightly renowned for his fast reflexes when making stops but, like every modern-day keeper, he is no longer only judged by how good he is with his hands.\n\"He has definitely improved his all-round play with his feet,\" Robinson explained. \"Where Jordan has always been strong is with his long distribution and his ability to start a counter-attack - there are not many better than him at that in the Premier League.\n\"He can kick it accurately for absolutely miles in a similar way I used to do, and as a goalkeeper you enjoy that. The game has changed now, but he is still able to play out with shorter passes from the back too.\n\"You would do very well to find the perfect keeper anyhow but, when I analyse his overall game, I feel like Jordan understands his own qualities and he has grown and developed into the keeper we see now.\n\"He knows what he is good at and what he has maybe needed to work at, and he is still working at it now.\"\n'He has calmed down a lot'\nWith no obvious weakness when it comes to keeping the ball out of the net, Pickford's temperament has often been seen as his biggest issue.\nRooney once felt he was \"too agitated\", especially in comparison to his long-time keeper at Manchester United, Edwin van der Sar, who was always cool and composed.\nBut Walcott feels Pickford has changed as he has grown older and reduced the histrionics that used to be his trademark.\n\"Jordan has calmed down a lot - I just think he has got a bit more mature,\" Walcott told BBC Sport.\n\"Earlier in his career there were times I played with him where it felt like if he was bored in the game he thought he had to do something, just to feel like he was involved.\n\"Now, though, I think he actually doesn't mind taking a step back because he understands that it starts with the goalkeeper and if he is calm, it helps the back four to be calm and the rest of the team too.\n\"He is not really involved in any scuffles anymore and that is down to maturity.\"\nYou would still never describe Pickford as being impassive, however, and Green feels that emotion is still a big part of his make-up.\n\"Jordan literally makes his own noise at times but he has reached a point with every aspect of his game where he has proved it has worked for him - so who are we to question it now?\" Green added.\n\"He has been that good over such a length of time where perhaps everyone sat in a studio or in the stands, who used to say 'oh no, there goes Jordan ranting again', should just shut up or instead say 'well, perhaps he knows what he is doing'.\"\nImproved consistency, for club and country\nFor many years, people linked Pickford's on-pitch personality to his performances - in his first few seasons at Everton it felt like we saw as many errors from him as there were eruptions.\nThat has changed too - he has made much fewer mistakes leading to goals when playing for his club in recent seasons, and that increased focus has long been apparent for his country.\nPeter Shilton, with a record 125 caps, is the only man to have played more times in goal for England than Pickford, but he has still kept clean sheets in just over 50% of his appearances so far and has made only one error leading to a goal since his international debut in 2017 - a poor clearance against Belgium in March 2024.\n\"That stat about how only one mistake has led to a goal really shows the level of consistency he has achieved for England, because in terms of international games played, that equates to one error over more than two Premier League seasons,\" Green said.\n\"In the bigger picture, I think some of it is down to the increased importance of Nations League games now, as opposed to friendlies, because it means Jordan is hardly ever playing behind a team where there have been nine changes.\n\"The England manager is picking a strong side for every game, so that consistency is there in front of Jordan as well. That helps, but credit to him because he has reached the same levels with Everton too.\n\"Arguably he got there quicker with England, probably because he was being bombarded with shots and crosses every week at Everton, but both sets of fans are probably in the same place now, where they are just grateful to have him.\"\n'The mentality of being England's number one'\nRobinson, who played 41 times for England between 2003 and 2007 and came close to equalling Banks' record when he kept six consecutive clean sheets in 2006, feels Pickford's ability to deal with criticism is another reason why he has remained England's first choice for so long.\n\"Jordan has worked extremely hard on his game, but I also think he has worked extremely hard on himself, and the mentality of being England's number one as well,\" Robinson added.\n\"When you play for England, you come under huge scrutiny whenever a goal goes in and you have to deal with the noise - but Jordan has done more than that, he has silenced it. The criticism that he had in the past is just not there anymore.\n\"And while clean sheets are a collective effort, if you actually look at the way he controls his defence with Everton, and for them to be that strong and stable in a struggling team, then a lot of that is down to him.\"\nPickford, who joined Everton from Sunderland in June 2017 for £30m, then a British record fee for a keeper, made his 300th Premier League appearance for them in Sunday's win over Crystal Palace. He started talks over a new contract last month, to extend a deal that ends in 2027.\nThe last time his contract was close to running out, in 2023, he was linked with moves to Manchester United and Tottenham before committing to the Toffees.\n\"It has surprised me that he has been at Everton for so long,\" Walcott added.\n\"There have been times where I have thought Jordan is going to go now, for Champions League football somewhere, but it shows his character that he has stayed.\n\"He has always been happy being Everton's number one, which I can understand. It's an incredible football club - knowing that if he did move it could affect his England career, so he hasn't.\"\n'It's Pickford... and then the others'\nTuchel told his England players in June that there is \"a fight for every position\" and there was \"no exception\" for goalkeepers.\nFor Pickford, Crystal Palace's Dean Henderson, 28, and Manchester City's James Trafford, 22, both also named in the squad to face Wales and Latvia, must be seen as his main rivals.\nNick Pope, 33, and his Newcastle team-mate Aaron Ramsdale, 27, are also in the frame - but Pope has not been selected into any of Tuchel's four squads so far. Ramsdale made it into one but, like Trafford at Manchester City, he is not currently first-choice at his club.\n\"I don't think any of them have got the same presence as Jordan, who is not just England's best goalkeeper now, he's one of the best goalkeepers we have ever had,\" said Walcott, about a player who had a key role in runs to the 2018 World Cup semi-final and the European Championship final in 2021 and 2024.\n\"He is underappreciated,\" added Rooney. \"His performances for Everton but more so for England in the big tournaments have been incredible. When people talk about keepers worldwide, he doesn't get mentioned that often but he is definitely up there.\n\"He is a great character and great to have in the dressing room. I know Jordan well and he is great fun to be around. He is certainly someone you want in the dressing room and is not afraid to speak his mind as well, which is always good.\"\nThere are only two more international camps before the World Cup, in November and March, so opportunities are limited for Henderson, who currently has three caps, and Trafford, who has none, to add to their senior England experience.\n\"The pecking order is well and truly set,\" according to Green, who played 12 times for England from 2005 to 2012. \"It is Pickford, and then the others.\n\"You know Pickford has been there and done it, in the biggest moments and under the most pressure you can be as a keeper.\n\"I don't think we have been at the crunch point in the past few major tournaments and thought replacing Pickford would be the answer. It's never been part of the discussion before when people talk about what would have made the difference between winning and losing, and I don't think it is now.\"\nRobinson agrees that replacing Pickford should be a \"non-topic\" and feels instead we should focus on what he brings to the England team.\n\"This is the first time in a long time that there isn't a debate about who should be England's number one, which is credit to him because he has been superb,\" Robinson said.\n\"We had that with David Seaman and there was a short time when I was there as well, and I know from experience that when you put the question to bed, you know you are winning, because it is a constant discussion that everyone likes to have.\n\"With Jordan you look at the 79 caps he has won and his experience at major tournaments, how deep he has gone in them, and there is no question that when an England team-sheet comes out then his name is at the top of it, as Seaman's name always was many years ago.\n\"That's the level Jordan is at now, and we maybe take for granted what he brings to that position. There is a plethora of other goalkeeping talent, absolutely, but every single one is at different stages, ether with their confidence and experience or where they are at in their club football.\n\"Dean Henderson is having a fantastic season, technically he is very good and at some point he will be right up there to take the job. But there is no need for a conversation about that right now.\"\nA version of this article was first published before the Wales game",
  "word_count": 2224,
  "scraped_at": "2026-02-14T02:09:24.910955",
  "_text_extracted": true
}