{
  "article_id": "4f3a1f850961",
  "url": "https://www.fourfourtwo.com/features/ranked-the-25-worst-refereeing-decisions-of-all-time",
  "title": "Ranked ! The 25 worst refereeing decisions of all time",
  "date": "20230213T143000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 25 worst refereeing decisions of all time\nComplaining about referees has always been, and always will be, a big part of being a football fan - and here are the most controversial decisions in history\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nReferees are under greater scrutiny than ever before. Barely a match goes by without a missed incident or questionable call being endlessly analysed and debated, especially online.\nIf possible, managers and players will look to deflect blame for poor performances onto the officials. Supporters' judgments are often just as unforgiving. Worryingly, this can even spill over from accusations of incompetence into downright conspiracy.\nThe introduction of VAR was intended to help this situation by ensuring that more big decisions were made correctly, but its scope and use has become another bone of contention.\nPerhaps the best course of action, as it was in pre-VAR times, is simply to embrace the chaos. Mistakes will inevitably be made and some of them can be genuinely entertaining, even going down in history as all-time classics.\nIn that spirit, FourFourTwo have looked back at some of the worst refereeing decisions ever made in pursuit of the most baffling.\nThe worst refereeing decisions of all time: 25. Referee’s volley helps out cup strugglers\nBrian Savill was suspended by the FA for seven weeks in 2001 after deciding to take matters into his own hands to help out struggling Wimpole in their 20-2 Great Bromley Cup defeat to Earls Colnes reserves.\n\"The ball came over from a corner, the Wimpole forward headed it and it came to me,\" Savill told BBC Radio Five Live. \"I chested it down, or armed it down, and the ball bounced up and I just volleyed it into the net.\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe referee said English football’s authorities lacked a sense of humour about the incident and resigned in protest.\n24. Nigeria denied by blind-sighted referee\nIn something of a repeating theme, Nigeria were denied glory by a poor decision over whether the ball had crossed the line after hitting the crossbar.\nVictor Ikpeba’s spot kick in the shoot-out of the 2000 Africa Cup of Nations final clearly went in, but referee Mourad Daami didn’t think so, and his poor decision cost the host nation the cup as Cameroon triumphed 4-3.\n23. A litany of errors\nDundee United’s Paddy Connolly appeared to have sealed a hat-trick against Partick Thistle when he drilled a shot into the back of the net, where it hit the stanchion, came back onto the pitch and into the arms of a Thistle defender – who handed it over to his goalkeeper.\nAstonishingly, referee Les Mottram not only failed to award the obvious goal, but didn’t even give a penalty for handball. Thankfully for United it didn’t make too much difference, as they ran out 4-0 winners.\n22. Uruguay lay down the law\nIn the very first World Cup, host nation Uruguay were given a helping hand in their semi-final clash against Yugoslavia.\nWith the score level at 1-1, the ball looked to have gone out of play, only for a policeman at the side of the pitch to knock it back onto the field discreetly, allowing Peregrino Anselmo to race forward and put Uruguay back in front.\nYugoslavia later had an equaliser disallowed for a debatable offside decision, but Uruguay ran out 6-1 winners in the end.\n21. Hurst tows the line\nIt’s one of the great debates of England’s 1966 World Cup success – did Geoff Hurst’s strike in the final cross the line?\nThe Germans certainly don’t think so, with TV replays also hinting that his shot cannoned back off the crossbar and failed to completely enter the goal. It was given though – and the rest is history.\n20. Thatcher somehow avoids red\nManchester City’s Ben Thatcher smashed Portsmouth midfielder Pedro Mendes in the face with his elbow during their 2006 Premier League meeting in a brutal challenge.\nThe Portuguese was knocked out and needed oxygen, but somehow Thatcher escaped with a yellow card. The FA later later righted the wrong by banning him for eight matches.\n19. Reading’s ‘ghost goal’\nIn 2008, Watford were left fuming by the ‘ghost goal’ awarded to Reading, as Stuart Atwell confused almost everyone by pointing to the centre circle for no apparent reason.\nHis linesman said he had seen the ball cross the line, but it wasn’t even close, a fact perhaps best demonstrated by the lack of appeals from any Reading players.\n18. Marriner gets his wires crossed\nWith Chelsea already leading 2-0 against Arsenal, things got worse for the Gunners when Alex Oxlade-Chamberlain saved a shot with his hand to concede a penalty.\nReferee Andre Marriner brandished a red card – but astonishingly showed it to Kieran Gibbs instead, despite the Ox admitting his guilt. Marriner later apologised for the mistaken identity, after Arsene Wenger’s 1000th game in charge of the north London club ended in a 6-0 drubbing.\n17. Lampard’s luck runs out\nEngland were sure they had pulled a goal back in their 2010 World Cup meeting with Germany when Frank Lampard’s piledriver came down off the bar and over the line before bouncing out.\nIt was ruled out by the linesman, who judged it not to have gone over the line, but replays showed clear space between the line and the ball.\n16. Rodri's lucky escape\nWith Everton desperate for points to avoid relegation in the 2021/22 season, seeing Manchester City's Rodri attempting to control a loose ball in his own penalty towards the end of the game presented an opportunity. The ball had surely struck his arm outside of his natural silhouette, with VAR even magnifying the point of contact past his t-shirt line.\nEverton appeals were, somehow, unsuccessful though, something Everton manager Frank Lampard simply couldn't believe after the game.\n\"A three-year-old could tell you that is a penalty,\" he raged.\nQuite a fair statement, too, might we add.\n15. Bayern’s phantom goal dooms Nuremberg\nIn the Bundesliga, Thomas Helmer of Bayern Munich tried to outfox Nuremberg goalkeeper Andy Kopke with a close-range backheel, only to send it wide.\nHowever, the Bavarian giants were somehow awarded a goal courtesy of linesman Jorg Jablonski and it had serious knock-on effects. Nuremberg lost 2-1 rather than picking up a precious point, and were eventually relegated on goal difference – with the phantom goal costing them a place in the top flight.\n14. 'Maggot' ruins Leicester’s cup hopes\nChelsea’s 1997 FA Cup fifth round replay against Leicester looked destined for penalties after two ties had failed to separate the teams, until referee Mike Reed awarded the Blues a very controversial spot kick.\nErland Johnsen went down very easily under a challenge that wasn’t there, leaving the nation enraged as Danny Baker raved on BBC Radio Five Live: \"It was scandalous, an absolute scandal … football has a maggot at its golden core, and that maggot is referees.”\n13. We don't drink Fanta\nWolf-Dieter Ahlenfelder was only three games into his refereeing career in the Bundesliga when he made a decision that has gone down in history as one of the most baffling ever.\nDuring a meeting between Werder Bremen and Hannover in 1975, he blew the whistle for half time after just 32 minutes of action. The linesman intervened, but he still made it only as far as 43 minutes 30 seconds before deciding to head in for a breather.\nWhy? Well, he later admitted to getting smashed on beer and schnapps before the game, saying: \"We are men, we don't drink Fanta.\" Fair enough.\n12. Carroll’s blushes spared\nTottenham midfielder Pedro Mendes thought he had scored a sensational stoppage-time winner against Manchester United in 2005, as Roy Carroll fumbled a long-range lob into his own net.\nThe goalkeeper desperately scrambled the ball back into play after it had crossed the line, but official Rob Lewis didn't see it and the ref waved play on. \"There was nothing I could have done differently apart from run faster than Linford Christie,\" Lewis said in defence. Hmm.\n11. Graham Poll’s Merseyside mix-up\nPoll made himself an unpopular man among Everton fans in 2000 when he made a terrible call to deny the Toffees what would’ve been a memorable victory over Merseyside rivals Liverpool.\nWith the score 0-0 in the dying moments, Reds goalkeeper Sander Westerveld booted a free-kick into Don Hutchison’s back, and the ball trickled into the net... but Poll said he'd already blown the full-time whistle, despite some injury time remaining on the clock.\n10. Byron Moreno enrages Italy\nEcuadorian whistler Moreno became public enemy No.1 in Italy after a series of terrible decisions saw them knocked out of the 2002 World Cup by joint-hosts South Korea.\nHe awarded South Korea a soft penalty, showed Hwang Sun-hong yellow for a challenge that he later admitted deserved a red, overlooked an elbow in the face of Alessandro Del Piero inside the box and a boot on Paolo Maldini’s head, sent off Francesco Totti for diving when he should’ve had a penalty, and ruled out Damiano Tommasi’s would-be golden goal in extra time for offside.\n9. Nani’s cheeky tap-in\nThis is an odd one. In a meeting between Manchester United and Tottenham in 2010, Nani went down under a challenge in the box and caught the ball as he claimed a penalty.\nIt wasn’t given by referee Mark Clattenburg but crucially, neither was a free-kick for the handling offence. Spurs goalkeeper Heurelho Gomes thought he had a free-kick and as he prepared to take it, Nani cheekily sprang to his feet and tapped the ball into an empty net. Cue chaos.\n8. Referee scores late winner in Turkey\nMost of these examples feature decision-making errors, but here the referee had a far more direct impact on the outcome of a goal – he actually scored one.\nIn September 1986, defending Turkish champions Besiktas were being held 0-0 at Ankaragucu until ref Ahmet Akcay deflected a wayward shot into the net off his face, which he allowed to stand, giving the hosts a surprise victory. It wasn’t insignificant either, as Besiktas finished the season one point behind champions Galatasaray…\n7. Ball boy hits the target\nSantacruzense snatched a 1-1 draw against Atletico Sorocaba thanks to a last-minute equaliser…from a ball boy.\nImages showed that the cheeky lad tapped the ball into the net after collecting a wayward shot and the referee allowed it to stand, despite nearly 10 seconds passing between the shot going wide and the boy knocking it over the line. The referee, unsurprisingly, was suspended by authorities.\n6. Chelsea’s Champions League rage\nNorwegian official Tom Henning Ovrebo denied Chelsea a place in the Champions League final in 2009 after ignoring four separate penalty appeals against Barcelona in the second leg at Stamford Bridge.\nIt can’t have been much solace to Blues fans, but he did at least admit he was in the wrong a decade later. \"It was not my best day really,” he told Marca. “Some days you are not at the level you should be. I can't be proud of that performance.”\n5. Schumacher gets away with one\nIt was arguably the most blatant red card a World Cup has ever seen and yet, somehow, Germany goalkeeper Harold Schumacher was allowed to remain on the pitch in the 1982 semi-final.\nFrance’s Patrick Battiston was left knocked unconscious with two missing teeth, three cracked ribs and damaged vertebrae from the goalie's reckless 'tackle', yet the referee waved play on and no foul was given.\n4. Thierry Henry breaks Irish hearts\nIreland’s World Cup play-off against France in Paris was delicately poised at 1-1 when Thierry Henry clearly controlled the ball with his hand (twice) to set up William Gallas’ extra-time winner, which sent the French to South Africa at Ireland’s expense.\nAfter the second leg, Henry admitted to Irish defender Richard Dunne that he had illegally handled the ball in the build-up to Gallas' match-winning goal. The Irish FA campaigned to FIFA that they should take France's place at the 2010 World Cup, but to no avail.\n3. The ‘Hand of God’\nDiego Maradona’s infamous handball for Argentina, which knocked England out of the 1986 World Cup quarter-finals, is perhaps the most famous (or infamous) refereeing gaffe of all time.\nTunisian official Ali Bin Nasser later blamed his assistant referee for missing the blatantly obvious handball, claiming they shared authority on decisions and therefore assumed his eyes had deceived him.\n2. AFCON referee fails to tell time\nWith Mali leading Tunisia 1-0 at AFCON 2021, Zambian ref Janny Sikazwe decided to twice blow his whistle for the final time before the clock had even reached 90 minutes. Calling for full-time in the 85th and 89th minute, players returned to the dressing room on the second occasion, despite there still being stoppage time to play.\nPlayers were ordered to return to complete the game, with Tunisia refusing to leave the dressing room. The result stood, though, at Africa's biennial continental tournament.\nCAF's refereeing chief, Essam Abdel Fattah, defender Sikazwe, though: \"The truth is that Janny Sikazwe had heatstroke and was suffering from dehydration. He completely lost concentration.\"\n1. Simunic receives three bookings\nThis was something special. English referee Graham Poll ruined any chance of being handed the whistle for the 2006 World Cup final with this spectacular error in the meeting of Croatia and Australia.\nPoll managed to show three yellow cards to Croatian defender Josip Simunic, resulting in the referee packing his bags early and being sent home from the tournament.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 2449,
  "scraped_at": "2026-02-14T02:06:47.854816",
  "_text_extracted": true
}