{
  "article_id": "4f5a8873670b",
  "url": "https://www.justarsenal.com/arsenal-among-clubs-to-back-key-change-to-champions-league-knockout-format/393892",
  "title": "Arsenal among clubs to back key change to Champions League knockout format",
  "date": "20250604T134500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A UEFA Executive Committee met ahead of Saturday’s Champions League Final to review potential changes to European competition formats, and one significant update now looks set to be ratified.\nArsenal are believed to be among several clubs who raised concerns over the structure of the Champions League knockout stages. Despite finishing third in the new 36-team league format, the Gunners were drawn to play the first leg of both their quarter-final and semi-final ties at home. Many within the game argue that hosting the second leg offers a competitive advantage, allowing teams to approach the away leg more conservatively before returning to the comfort of their home stadium to decide the tie.\nHigher finish, greater reward\nUnder the newly agreed proposal, from next season onward, the team that finishes higher in the league stage will be guaranteed to play the second leg at home. This will apply across the Champions League, Europa League and UEFA Conference League. The idea is to create a greater incentive to finish at the top end of the table, rather than just inside the top eight.\nHad this rule been in place this season, Arsenal would have travelled to the Bernabéu and Parc des Princes first before hosting Real Madrid and Paris Saint-Germain at the Emirates. It reflects a shift toward rewarding performance in the league format with tangible advantages in the knockouts.\nOther proposed changes were dismissed, including giving clubs the choice of leg order and suggestions to scrap extra time if aggregate scores are level. Perhaps most disappointing to managers and supporters is that playoff winners will still not be seeded, meaning group winners can still face tougher opponents early on, as happened when Liverpool drew PSG despite topping the table.\nThe growing commercial influence\nUEFA President Aleksander Čeferin frequently cites “entertainment value” and increased opportunity as the reasons for ongoing changes, but privately, the motivation is often financial. More matches, more big names, and longer stays in the competition mean more revenue for clubs, broadcasters, and sponsors alike.\nWhat began as a tournament exclusively for champions has now expanded to include up to six Premier League clubs. With such growth, the pressure to protect high-profile participants has increased. The new structure ensures eight group games and a safety net via playoffs, making it difficult for top sides to miss out on the latter stages.\nThe concern is that football at this level is becoming overly contrived. Once clubs reach the quarter-finals, he argues, they should be ready to stand on their own two feet, without further protection.\nWhat are your thoughts?\nDan Smith\n_____________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 506,
  "scraped_at": "2026-02-14T02:09:11.433484",
  "_text_extracted": true
}