{
  "article_id": "4f70f8f6eb93",
  "url": "http://www.china.org.cn/world/Off_the_Wire/2023-12/30/content_116911943.htm",
  "title": "Yearender : The most memorable sports moments of 2023",
  "date": "20231230T091500Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- 0 Comment(s)Print E-mail Xinhua, December 30, 2023\nRIO DE JANEIRO, Dec. 30 (Xinhua) -- Here is Xinhua News Agency's selection of the most memorable sports moments in 2023:\nQIN HAIYANG COMPLETES BREASTSTROKE TREBLE\nChina's Qin Haiyang was the toast of world swimming in July after breaking the men's 200m breaststroke world record to complete a hat-trick of individual gold medals at the World Aquatics Championships.\nQin also claimed the 50m and 100m titles in Fukuoka, becoming the first swimmer to win all three breaststroke events in a single edition of the championships.\n\"I said that my pre-race target was to win three breaststroke gold medals,\" said Qin. \"I knew that nobody had achieved this, but I was very confident to fight for it.\"\nAnother star of the championships was Australia's Kaylee McKeown, who also achieved a world-first with her golds in the 50m, 100m and 200m backstroke events.\nBefore McKeown, no woman had ever secured gold in both the 50m and 100m at a single World Championships, much less the treble.\nNo list of highlights from the event could be complete without mentioning France's Leon Marchand, who broke Michael Phelps' world record in the men's 400m individual medley, a mark that had stood for 15 years.\nFEMKE BOL'S REDEMPTION\nThere was no shortage of drama at the World Athletics Championships in Budapest, particularly on track.\nLess than a week after she stumbled meters short of the finish line to miss out on gold for the Netherlands in the mixed 4x400m, Femke Bol made amends by charging to victory in the 400m hurdles final.\n\"It wasn't easy to forget what happened in the relay, but my teammates were around me and they put me at ease,\" said Bol.\nShe further banished her opening night demons by running a scintillating final leg in the women's 4x400m relay, overtaking Britain's Nicole Yeargin and Jamaica's Stacey Ann Williams in the final 50m to clinch her second gold of the competition.\nASIAN GAMES DEMONSTRATES RESPECT AND FRIENDSHIP\nOne of the enduring sports memories of 2023 will be the sight of China's Zhang Yufei sharing a tearful embrace with her Japanese rival Rikako Ikee at the Asian Games in Hangzhou.\nZhang had just won her sixth swimming gold medal of the Games by powering to victory in the 50m butterfly final ahead of Yu Yiting and Ikee.\nBut the bronze medal was a triumph in itself for Ikee. It marked her first appearance on an international podium since she was diagnosed with leukemia in February 2019.\n\"I told her don't cry, don't cry,\" Zhang said afterwards. \"When they announced her name on the podium, I already felt like crying.\n\"But I thought to myself, this is a live telecast, I cannot cry. Then I saw her hugging her coach in tears. In that moment, I could not hold back my tears any more.\"\nZhang was named joint MVP of the Asian Games alongside her teammate Qin Haiyang, who won five golds, including all three individual breaststroke titles.\nIkee, who secured the Asian Games MVP award in 2018 for her haul of six gold and two silver medals, lavished praise on Zhang.\n\"She has the look of a fighter when she races,\" Ikee said. \"I think she'll only get better from hereon and it motivates me, seeing another swimmer in Asia perform the way she has. I hope I can keep up.\"\nMANCHESTER CITY'S CHAMPIONS LEAGUE TRIUMPH\nManchester City lifted the UEFA Champions League trophy for the first time by beating Inter Milan in the final at Ataturk Olympic Stadium in Istanbul.\nSpanish midfielder Rodri netted the only goal of the game when he thumped home from 16 yards in the 68th minute, prompting joyous celebrations among City's players, coaching staff and fans.\nThe victory secured a historic treble for Pep Guardiola's men as they became only the second team to be crowned the Premier League, FA Cup and European champions, following their city rivals Manchester United's footsteps in 1999.\nGuardiola could barely contain his emotion after the match. \"This trophy is so hard to win,\" he said. \"It was written in the stars. It belongs to us.\"\nCARMONA'S BITTERSWEET MOMENT\nSpain clinched their first women's football World Cup title by beating England 1-0 in front of more than 75,000 fans at Sydney's Stadium Australia.\nReal Madrid left-back Olga Carmona, who scored the title-deciding goal in the 29th minute, learned after the match that her father had died after a long illness.\n\"I know that you have given me the strength to achieve something unique,\" Carmona said in a social media post.\n\"I know that you have been watching me tonight and that you are proud of me. Rest in peace, dad.\"\nIt marked a poignant end to a remarkable tournament that broke attendance records.\nIn total, 1,978,274 fans watched matches at 10 stadiums in Australia and New Zealand between July 20 and August 20, breaking the previous aggregate attendance record set in 2015 when 1,353,506 spectators saw 52 matches in Canada.\nAUSTRALIA'S SIXTH CRICKET WORLD CUP TROPHY\nFew international cricket observers gave Australia any chance of being crowned World Cup champions when they lost their first two matches of the tournament against India and South Africa.\nBut led by inspirational captain Pat Cummins, the team strung together nine consecutive victories thereafter, including a comprehensive six-wicket victory over hosts India in the final.\nTravis Head was named player of the match with a superb 137 off 120 balls as Australia took home cricket's ultimate prize for a record-extending sixth time.\n\"It's the pinnacle in cricket, winning a World Cup, especially here in India,\" Cummins said after the final, played in front of more than 100,000 fans at the Narendra Modi Stadium in Ahmedabad.\nThe result capped a remarkable 2023 for the Australian men's team, who also secured the World Test Championship trophy and retained the Ashes in England.\nDJOKOVIC'S MARCH TO IMMORTALITY\nIt was a year of records for Serbian tennis star Novak Djokovic. In June, he beat Casper Ruud in the French Open final to surpass Rafael Nadal as the first man to win 23 Grand Slam titles.\nThe 36-year-old continued to rewrite history three months later when he overcame Daniil Medvedev in straight sets to clinch his fourth US Open title and become the first player to win 24 Grand Slam singles title in the Open era.\nDjokovic finished the year with seven titles from only 12 tournaments, including three Grand Slams.\n\"The fact that I've won three out of four Slams and played a final in the fourth and it's still not the best year of my life... it's quite nice to have that kind of situation,\" Djokovic quipped.\nSOUTH AFRICA STAND ALONE IN WORLD RUGBY\nSouth Africa became the most successful team in rugby World Cup history by winning the sport's ultimate prize for a fourth time.\nThe triumphant campaign in France also marked back-to-back titles for a team that was given little chance of success before the tournament.\nRetirements to key players and an abrupt loss of form had left the Springboks rank outsiders to defend their title.\nIreland and France were above them in the world rankings while perennial contenders New Zealand also looked to be peaking at the right time.\nBut the Springboks grew in confidence as the competition progressed before eking out a dramatic 12-11 victory over the All Blacks in the final at Stade de France.\n\"This was not about us as players, this victory was for every South African, and we showed what is possible with this diverse team,\" captain Siya Kolisi said. Enditem\nNo comments.",
  "word_count": 1270,
  "scraped_at": "2026-02-14T01:51:13.758530",
  "_text_extracted": true
}