{
  "article_id": "4fa640a8a819",
  "url": "https://metro.co.uk/2025/05/31/champions-league-final-odds-paris-saint-germains-youngsters-can-lift-trophy-first-time-may-need-go-distance-inter-milan-23267903/",
  "title": "Champions League final odds : PSG youngsters can beat Inter Milan but may need to go the distance | Football",
  "date": "20250531T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain’s Champions League final with Inter Milan looks an enticing, intriguing, mouth-watering affair but it may not be laden with goals.\nSimone Inzaghi’s Nerazzurri reached Saturday’s blockbuster affair at the Allianz Arena in Munich by edging past Barcelona 7-6 on aggregate while Luis Enrique’s Ligue 1 winners began planning their trip to the heart of Germany after beating Arsenal 3-1 over two legs.\nBut when the biggest prize in European club football is at stake the showpiece occasions tend to be tentative, cautious affairs with less than three goals being scored in the last six deciders – four of them finishing 1-0 with the other pair being 2-0 at full-time.\nThe winners were Real Madrid, twice, Manchester City, Chelsea, Bayern Munich and Liverpool and they all had few problems whacking in the goals on their way to those finals.\nAn interesting factor in this box-office attraction is PSG boast the youngest squad in the competition and Inter the oldest, and both have changed their style of play in certain aspects since the group stages with the French club becoming more defensively minded after a swashbuckling start and Inter doing the reverse and being more cavalier in their approach.\nThis is the fourth Champions League or European Cup final to be staged in Munich and the previous winners – Nottingham Forest in 1979, Marseille in 1993, Borussia Dortmund four years later and Chelsea in 2012 – were first-time winners which augers well for PSG, who are chasing their initial success in this competition after losing to Bayern Munich in Lisbon five years ago.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nInter have lifted the trophy three times – in 1964, 1965, and 2010 – but have also suffered the agony of being runners-up in 1967, 1972 and a couple of years ago when they lost 1-0 to Manchester City.\nPSG vs Inter Milan odds\nUnder 2.5 goals is 10/11 with bet365, BoyleSports, StarSports and others which allows for the 1-0/2-0 trend to continue but also offers the options of 0-0 and 1-1 draws after 90 minutes and Betfred have priced up the match being all square and heading into extra-time at 12/5.\nMore Trending\nInter, fired up after losing their Serie A title to Napoli in a close finish to the season, would then be at a big disadvantage as PSG’s younger, fresher legs would help them nick victory and they are 13/20 with Unibet and BetMGM to be singing ‘Champione…’ when all’s done and dusted.\nOusmane Dembele has scored 32 times this season and is 9/5 with Betway to score for PSG inside 90 minutes. Inter striker Lautaro Martinez has been dealing with injuries but has been used sparingly since the semi-final triumph and is 12/5 with StarSports to celebrate a goal in Munich.\nMORE: From a Miffy hotel to new Jimmy Choo perfume – here are 23 buys for the weekend\nMORE: Cristiano Ronaldo makes decision over future after Club World Cup talks",
  "word_count": 542,
  "scraped_at": "2026-02-14T02:09:11.439801",
  "_text_extracted": true
}