{
  "article_id": "4fe6ab41b127",
  "url": "https://www.the42.ie/shelbourne-fc-3-6942918-Feb2026/",
  "title": "Shelbourne European adventure ( Part 2 ): Stradbally , Skopje , Slovenia , Alkmaar and Amsterdam",
  "date": "20260204T173000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THERE’S ONLY ONE place to start when telling the story of following Shelbourne on the road to North Macedonia, Netherlands and Slovenia for the Conference League league phase stint of Joey O’Brien’s European adventure.\nYou were thinking of Stradbally, Co. Laois, right? Okay, stay with me.\nIt’s 7:30pm on Electric Picnic Saturday. A ‘Duff 32’ 1996-98 Blackburn Rovers jersey is your outfit of choice. Ten weeks have passed since Duff walked from Tolka Park, but you’re clearly not ready to say goodbye. You’re standing at the back of the 3 Music tent waiting for spoken word artist and Shels supporter David Balfe (aka ‘For Those I Love’) to take to the stage.\nIt’s safe to say a few warm cans have been consumed by this hour. You’ve been looking forward to this set in particular all weekend. It’s a pretty bad time for Uefa to have organised the league phase draw to be made and for the fixtures to be confirmed.\nFlight prices will increase, and they’ll increase fast. It’s not worth the risk to leave it until you return home on Monday.\nThe draw is made, and you and your mate spend what feels like an eternity fumbling around Ryanair, Skyscanner, and the like, spending hundreds of euros on trips to Skopje and Alkmaar in the process. December’s trip to Celje, however, can wait for another day.\nIn truth, you only end up missing Balfe’s first tune. In further truth, your mate actually did the entirety of the work while you only had to concern yourself with Revoluting your share of the funds.\nAlkmaar in November is the only European away that Balfe, himself, will be able to fit into his own schedule. 2025, for the Donaghmede man, has been a year full of a very different kind of away day.\nSeven days on from Duff’s shock departure in June, Balfe joined Welsh electronic music duo ‘Overmono’ at Glastonbury, with a Shels flag in hand, to perform his biggest song ‘I Have A Love.’ Later in the year, he’ll join them at Alexandra Palace.\n“There’s some real odd cognitive dissonance going on when you’re closing Stage Three at Glastonbury with your friends, and there’s 35,000 people in front of you,” Balfe says.\n“You come off stage, and you’re looking at your phone because you’ve got work emails coming in, and you’re like: “I’m back in the office on Tuesday morning. This is bananas.\n“You do this three-and-a-half minutes on stage, and it’s otherworldly. You feel weightless for a moment.”\nBalfe’s 2025 release of his second album, ‘Carving The Stone’ saw him return to the stage for his first consistent run of shows since his debut tour in 2021.\nWhen Balfe took to the Olympia Theatre Stage on November 17, 2021, Shelbourne Football Club was on the cusp of entering a new era. Just two days previously, Shamrock Rovers had confirmed that defender Joey O’Brien would not be re-signing with the Hoops, as he would instead be taking up a coaching role with the recently promoted Shelbourne alongside Ireland legend Duff.\nThere was sheer ecstasy among the majority in attendance when Balfe acknowledged the Reds return to the top flight, saying: “I’m very sorry if you’re a rival fan. You’ll have your shot at us next year, but I have to do this, I have to do this”, before leading a chant of ‘We’re going up, we’re going up, we’re going, Shels are going up’.\nIn the four seasons that followed, the club reached an FAI Cup final, won the Premier Division in the most dramatic fashion and qualified for European football on three separate occasions. It’s safe to say nobody in the venue that night could have seen that coming.\n“In moments like that, in one respect, it doesn’t matter what comes next,” Balfe tells The 42.\n“It doesn’t matter whether you’re relegated again and you fall into the depths of darkness as a team, or whether you go on a run and win the league five years in a row. In a moment like that, it feels like you’re just celebrating for the jersey, for the crest and for what that means. It doesn’t matter what success might lie ahead for the club.\n“When you do that in a room full of Shels heads, and you see them hanging onto that moment and the elation of the chant, you see how much passion there is, and it feels limitless. In another way, you could think you’re going to win the Champions League in the next five years, and the promise seems eternal, like you could do anything.\n“We definitely couldn’t have predicted what was in store over the last few years, but the glory days were always going to come back at some stage. It felt like they had to. There was too much passion behind the club for them not to come back.”\nFor all of Shelbourne’s football achievements over the past few years, the greatest success has been that of the Save Tolka Park campaign, a movement which Balfe supported.\nIn November, the club confirmed that it had secured a 250-year lease for the ground.\nFor Balfe, Tolka Park is more than just a football stadium.\nHis love for Shels and Tolka came about thanks to his best friend Paul Curran’s passion for the Reds. Curran, who much of Balfe’s music is in tribute to, died by suicide in 2018, aged 27.\nThe first Shels game following Curran’s death saw the Reds beat Longford Town 3-2 in the First Division thanks to a 93rd-minute goal. Fans applauded in the 27th minute, to mark Curran’s age, and after the match, Balfe and his friends scattered their friends’ ashes on the Tolka Park turf.\n“Tolka is a place where friends, parents, grandparents, aunts and uncles are remembered. A place where, for a lot of people, this might be the final cultural touchstone that they have,” Balfe says.\n“It’s a place where they’ve built some of the most lasting and important characteristics of their life.\n“To steal that from people wouldn’t have just been to steal the concrete and grass of where football is being played, but to steal the very lifeblood of people’s family history, and to steal the heart and soul of some people’s existence. I think everybody can innately understand what it’s like to lose a loved one and have one hallowed ground that you connect with them through.\n“For a lot of people, for generations of people, that’s not necessarily a graveyard. For a lot of people, it’s a particular football pitch, like Tolka is to me.”\nNo matter what happens on the European away days that will follow in this piece, no matter the scores, Shels fans will have their home to come back to.\nFor the next quarter of a millennium, at least.\nSKOPJE:\n2:45am is no time to set an alarm to wake up to head to the airport, but we’re the lucky ones.\nOur connecting flights from Dublin to Frankfurt and through to Skopje all go exactly to plan as we reach the North Macedonian capital on the Wednesday afternoon, a day out from Shels’ battle with KF Shkëndija.\nIf you like cheap pints, stray dogs and an abundance of statues, then you’ll like Skopje.\nNorth Macedonia’s most popular beer is Skopsko, and it’s certainly popular with the travelling support who have made the journey to its capital. One eagle-eyed Red notes that it was first brewed in 1924, the same year Tolka was established.\nThere’s a serious buzz around the main square when matchday finally arrives, and Reds begin to gather.\nThis is a big one. With tough encounters with AZ Alkmaar and Crystal Palace to come, this game is being labelled a must-win if the Reds are to have any chance at reaching the seven-point target, which should be enough to earn a play-off.\nWhen the time finally comes, the police arrive to escort us to the National Arena Todor Proeski. There are just over 2,000 fans in attendance in a stadium which has a capacity to hold 33,000.\nShkendija hail from the town of Tetovo, rather than Skopje, with their support base primarily coming from North Macedonia’s Albanian community.\nSimilar to Shels, their home ground is not able to host league phase action, resulting in this move to the national stadium.\nThere’s a mix of locals and Shkendija supporters sprinkled across the ground, with their ultra group positioned by the corner flag at the opposite end of the ground from where we are, which makes for a strange atmosphere, but not a quiet one. They don’t really stop making noise, but nor do we.\nBehaviour from the Shkendija ultras labelled by Uefa as ‘racist and discriminatory’ will go on to result in a €20,000 for the club.\nUefa provided no further details on the matter, but it is believed that the chants were in relation to local tensions.\nIn terms of on-field action, the game is an absolute killer. A missed opportunity.\nEveryone in the away end has the same thought as the game progresses, these are no great shakes.\nAs expected, chances do come our way in the second half. But unfortunately, they set a trend for the rest of the European campaign that will follow – we just can’t find the net.\nWith half an hour left to play, Joey O’Brien really goes for it. In a bold move, he brings on two strikers together – Sean Boyd and John Martin.\nJust five minutes later, a Kerr McInroy free kick is met by the head of Martin.\nIt’s going in.\nThe away end braces itself to break into euphoria.\nIt comes back off the f**king post.\nAs the game approaches its climax, Martin’s substitute partner Boyd limps off injured, unable to stay on the pitch. O’Brien has no subs left; we’ve effectively been given a red card.\nWe’ve wasted some chances to pull off a huge win on the road, but we’re so close to picking up a solid second point of the campaign. But then disaster strikes.\n90+1’ Paddy Barrett (OG).\nShels lose by a goal to nil.\nSome Reds, of course, are feeling very down after the result. Being kept back in the ground for an hour after full-time probably isn’t helping either. It’s only later in the night when I consider the financial blow of conceding late; Shels have lost out on a potential €133,000 for a draw. It would have been €400,000 for a win. These are the big leagues.\nWhen we’re finally granted permission to leave the stadium and make our way back to the old town, we’re led by the police and Skonto. “Who’s Skonto?”, I hear you ask.\nHe’s Shelbourne’s newest fan, a stray dog from the streets of Skopje who some Shels fans had helped sneak past security at the stadium and who has just enjoyed the spectacle from the away end free of charge.\nWith his help, we make it back to the same bar that fans had congregated in the night previously, where punters are surprised to be treated to renditions of songs by Rick Astley, Lily Allen and more.\nThe police arrive in numbers at midnight, and just like that the show is over.\nThe following day, when our flight home from Frankfurt finally takes off after multiple delays, word spreads that St Pat’s have dropped points at home to Waterford in a 1-1 draw. It leaves them four points adrift of Shels with just one game left to play in the Premier Division.\nThe result guarantees that Shels will play European football again in 2026, for a third consecutive year.\nThe show goes on.\nALKMAAR:\n“Even against Real Madrid, you’ll always get one chance.”\nA throwaway comment by one Shels supporter in the fanzone in Alkmaar before the Reds take on AZ, but one which, unfortunately, will end up living long in the memory.\nBecause we do get a chance. But again, we leave it behind.\nWe’ve unsurprisingly come into the tie as big outsiders, but a remarkably solid display has us in the mix.\nWith 67 minutes on the clock and the game still scoreless, John Martin bears down on goal after exceptional play by Mipo Odubeko. The massive Shels travelling support prepare to spill down the steep steps of the away section of the AFAS Stadion, but Martin can’t sort his feet out with the goal at his mercy and is smothered by the goalkeeper.\nLess than three minutes later the ball is in the back of the Shels net as Dutchman Wessell Speel is beaten by a Mees de Wit strike in his home country.\nA second AZ goal in the 86th minute sees the game end 2-0 to the hosts.\nDespite his Republic of Ireland heroics in Hungary, Troy Parrott is booed at the full-time whistle. It’s a bit of craic, nothing more.\nSocial media commentators, unsurprisingly, lose their minds over it.\nThere’s a staggering 1,400 Reds in Alkmaar. The majority managed to get their hands on tickets, but a minority never find a way into the ground. One of the 1,300 in the away end is Shels legend Mark Rutherford.\nHis former Shels teammates Gary Howlett and Bobby Browne have also made the trip.\nRutherford faced a race against time to make it to the game, with work commitments preventing him from landing in Holland until Thursday evening, just hours before kick off.\n“It was the first time I was actually amongst the real hardcore supporters from the Riverside stand,” Rutherford tells The 42, “because I usually sit in the main stand behind the dugouts in Tolka. It was surreal standing there and getting beers spilled over me and jumping around.\n“It was great that so many supporters got to go, because I remember how few were able to travel to see us play against Rangers in the 90’s, and that was a ‘home’ game!”\nRutherford is referencing Shelbourne’s 1998 Uefa Cup encounter with Glasgow Rangers, which was moved from Tolka Park to Tranmere Rovers’ Prenton Park due to safety concerns. The controversial decision was only made a week before the game.\nThe Birmingham man belongs to an exclusive club of players who has played for Dublin’s big four clubs. He attends Pat’s, Rovers and Bohs games from time to time, but having spent the majority of his LOI career with Shels, it’s unsurprising that he spends more of his Friday nights in Tolka than elsewhere.\nOllie Byrne really looked after me when I first came to Shelbourne, and the supporters have been great to me since then.”\n“In Alkmaar I got to meet some of the fans who call themselves the ARC (Alternative Reds Club). I was chatting to one of them at the game. He was there back in 1991/92 when I first came to Shels, and he’s still there supporting them today.”\nWhen we eventually make it back to base in Amsterdam, we grab some grub before heading out for the night with a big group of Reds, but we’re not the only team in town. There’s a party happening in the Dutch capital.\nMartin O’Neill’s Celtic have beaten Feyenoord 3-1 in the Europa League, marking a first European away win for the Celts since 2021. It’s the first time they’ve won on Netherlands soil in over 24 years, when fittingly, it was O’Neill’s side who overcame Ajax by the same 3-1 scoreline.\nThere’s no getting tired of their ‘This is the day that we win away’ chant, even after its 100th rendition by the travelling Hoops.\nOur flight back to Dublin the following day is predominantly full of Celtic fans, some of whom have made the most of their time in Amsterdam.\nAs we prepare to board the flight, an announcement is made:\n“The captain is aware that some people have been enjoying themselves a little too much, and he will refuse to bring anyone home who is misbehaving, and they will have to stay in Amsterdam.”\nThe announcement is met by cheers and mock celebration.\nI’m not too sure how they didn’t see that coming.\nCELJE:\nThere’s three seven seater mini buses waiting for us when we land in Croatia on a chilly Thursday afternoon. Shels’ 2025 campaign will be wrapped up tonight, just a week before Christmas. Mental.\nThere’s a two-hour spin in store for us to Celje, Slovenia. When booking the transport, no formal question had been asked as to whether alcohol would be allowed on board, with the presumption being that the answer would inevitably be no.\nAfter everyone had cleared out the one shop selling cans in the arrivals section of Zagreb airport, we make our way onboard.\n“No eating. I am not cleaning service,” our driver announces.\nFair enough. Straight to the point. It’s safe to assume that drinking is also frowned upon.\nBut he didn’t say it!\nWe discreetly open our cans out of sight of the rear-view mirror and begin the journey north-west.\nOne man who enjoyed a smooth journey from Munich to Celje was German groundhopper Janik, who spontaneously fell in love with the club during the summer.\nYou might remember him from Shelbourne’s European adventure: Belfast, Baku, Batman, Croatian cages and German groundhoppers.\nA victory for Celje tonight will be enough to secure a top-eight finish and a direct route through to the last 16 of the competition. Their most eye-catching results so far have been a 2-0 victory away to Shamrock Rovers and a 3-0 defeat to Shels’ old foes Rijeka. They’re managed by ex-Liverpool man Albert Riera who you’ll recall from his fallout with Stephen Bradley.\nThere’s not an incredible amount of food or drink choices on offer in Celje so it’s not long before all fans end up in the one bar. A few hours later the police arrive and it’s time to be escorted to Stadion Z’dežele, a 13,000-seater ground.\nYou’d want to have a few layers on – it’s a far cry from Baku in July.\nThere’s around 150 fans in the away end when the game finally gets underway. Despite frustrations in front of goal throughout the campaign and missed opportunities rued, the privilege of watching your club playing on the European stage all the way up until Christmas isn’t lost on anyone.\nA solid Shels performance spearheaded by a tireless Odubeko up front earns Shels a point on the road to round out the campaign and adds €133,000, that had eluded the club in Skopje, to the coffers.\nThe league phase table doesn’t make for pretty reading, it must be said. Shelbourne finish 34th out of 36th, with no goals scored. Only Aberdeen and Rapid Wien lie beneath us. A 93rd minute Rapid Wien own goal actually keeps us above them, and results in an additional €30,000 windfall. Some sort of reprieve for the Barrett OG vs Shkendija, I suppose.\nA late night follows back in the same bar from before the game where tales of journeys throughout the year are traded. A season like no other.\nWhen I finally return to my hotel I make the ambitious request to book a 6am taxi to Ljubljana in a few hours time. Grim.\n“You’ve left it quite late,” the receptionist says. But thankfully he obliges.\nIt only feels like seconds later that I’m awoken in my room by a phone call from the same receptionist. I’ve slept in and the taxi is waiting.\nAt least I’m up, but here’s no reaching one of the lads who I had planned on carpooling with. But in the end we both make our flights with time to spare, even if we had to stomach some rough taxi fares in the process.\nUntil next time.",
  "word_count": 3292,
  "scraped_at": "2026-02-14T02:12:22.649876",
  "_text_extracted": true
}