{
  "article_id": "4fee6c1ac883",
  "url": "https://www.nytimes.com/athletic/6475713/2025/07/06/psg-club-world-cup-mentality/",
  "title": "PSG lean on new - found championship mentality as they target Club World Cup triumph",
  "date": "20250706T074500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic has live coverage of PSG vs Real Madrid at the 2025 FIFA Club World Cup.\nBefore the 2025 Champions League final, Paris Saint-Germain were a side known for wilting under the pressure of high expectations.\nIn previous years, even with Lionel Messi, Neymar and Kylian Mbappe in the starting XI, PSG could not get past the likes of Real Madrid, Barcelona, Bayern Munich or Manchester City in Europe’s top club competition.\nAdvertisement\nOver the last decade, PSG were like the star Hollywood actor accustomed to being snubbed on Oscar night: rich and powerful, talented and ambitious, but ultimately judged as second best to more established colleagues. Until the team’s glorious display in Munich on May 31, a 5-0 thrashing of Inter, this club was the Leonardo DiCaprio of European football.\nDiCaprio won his first Oscar in 2016 after years of hearing someone else’s name as the winner was revealed. It is fitting, then, that DiCaprio’s Oscar win came after his performance in The Revenant, a survival drama where he plays resilient frontiersman Hugh Glass.\nOn Saturday in Atlanta, one of the most anticipated games of this novel Club World Cup saw Bayern Munich, the intimidating German champions, pummel PSG for nearly 80 minutes. PSG striker Desire Doue ended the match battered and bloodied.\nFor long stretches, Bayern’s physical and relentless aggression tamed the talented French side. PSG had to dig even deeper after Doue’s 78th-minute goal was followed by red cards for Willian Pacho and Lucas Hernandez.\nResilience was what kept DiCaprio’s Glass alive in the frigid temperatures of the American wilderness. Under the air-conditioned roof of Mercedes-Benz Stadium, resilience kept PSG alive in the Club World Cup in the American South.\n“We’ve spoken a lot about resilience and we are a resilient team,” said PSG head coach Luis Enrique after the win. “We’re prepared to compete in any situation. The result doesn’t matter. We suffered a lot during this past season. But we suffered together.\n“We weren’t as efficient as we could’ve been, both during league play and in the Champions League. But we showed our team spirit. We fight together.”\nThe day before, Luis Enrique reminded the French press in Atlanta that they had often criticised his young team — and particularly PSG’s front line — during the Ligue 1 season. He may have reason to riposte, but before their impressive win in the Champions League final, PSG underwhelmed in the group stage and, initially, underachieved in Europe.\nAdvertisement\nDefeats by Atletico Madrid, Arsenal and Bayern led to a 15th-place finish in the table before the Champions League knockout round. Luis Enrique’s side were not as well drilled as they appear today. For a while, it looked as if PSG and their Spanish coach were on the same path as his predecessors Mauricio Pochettino and Thomas Tuchel — big names who fell short.\nYet, after recovering to lift the Champions League trophy, PSG’s next challenge was to sustain their success.\nThe club embodied the type of European power that could have looked upon the Club World Cup as a nuisance after a tiring season. Instead, as one of the youngest squads at the competition, PSG is rewriting its own history.\nLeading 1-0 but down two men late on, PSG still pushed for a second. A team replete with young flair players like Doue, 20, Bradley Barcola, 22, Vitinha, 25 and Joao Neves 20, weathered Bayern’s frenzied search for an equaliser in a stadium on the verge of bedlam after each attacking sequence.\nAfter a fantastic individual move by Achraf Hakimi, second-half substitute Ousmane Dembele smashed home the decisive second from close range six minutes into added time at the end. Dembele blew kisses towards his Moroccan team-mate before they embraced, as they celebrated their passage to the semi-finals.\nIt was the culmination of a professional performance that was far from flawless. Bayern were sharper, but PSG’s players had revenge on their minds. In football, those emotional motivators are often the difference when tactics and principles of play are so evenly matched.\n“Revenge? Maybe a little,” Barcola said on the eve of the quarter-final. “It’s our biggest source of motivation right now.”\nBarcola epitomizes the confidence that oozes from PSG’s dressing room. It’s not arrogance, although it can be mistaken as such. PSG are a brash outfit of highly-skilled internationals who do not want to be mentioned in the same breath as the club’s disappointing sides of the past. A 1-0 loss at Bayern’s Allianz Arena during the Champions League group stage in November was a turning point in PSG’s season, Barcola said.\nAt that point, PSG were on the ropes yet again in Europe.\nAdvertisement\n“It’s really that feeling of revenge because we lost at their place,” continued Barcola. “It was very tough for us, even afterwards, but that’s why we really have the desire to win. I think it’s that loss that hurt us. It made us realise that, at that moment, we didn’t have many chances left to continue in the Champions League. And it motivated us even more to push even harder.”\nPSG’s win over Inter finally put an end to the notion that the perennial French champions were overqualified domestically, but ill-prepared mentally for Europe’s top club competition. Saturday’s win over Bayern reinforced the point. There is a mental fortitude to this group. This is a team of true champions.\n“We can really learn from this match because it took us out of our comfort zone,” said PSG captain Marquinhos. “We had a few chances that we missed and some dangerous balls that gave them some chances. These little things will help us grow moving forward. And this shows the mentality of our group, because that’s something we talk about a lot.\n“Winning is already very difficult — but continuing to win is even harder. That’s the mentality we have.”\nEfficiency in front of goal, Marquinhos said, was the difference on the day. But when he was asked where the new-found attitude comes from, the Brazilian international wasted no time in crediting his manager.\n“Our coach — he brought his philosophy, his mindset, and he prepared the team very well from the first day he arrived,” Marquinhos said. “He started from scratch with how he wanted us to play. He worked on improving the team mentally so we’d be ready for anything that could happen during a match.”\nWe’ve all seen the video of Luis Enrique’s inspired speech, in which he told Mbappe that, in order to become a truly great leader, he’d have to emulate NBA great Michael Jordan.\nAdvertisement\n“I’ve read that you like Michael Jordan,” Luis Enrique told the then PSG striker. “Michael Jordan grabbed all his team-mates by the balls and defended like a son of a b****. You have to set that example first — as a person and as a player — by pressing.”\nIt took time for PSG to adopt Luis Enrique’s demands. The talent was there; this team is gifted in nearly every position. They rebuilt and reset after Mbappe left for Real Madrid. And the commitment to the collective over the individual star was a drastic shift from the PSG of old.\nOn Friday, Luis Enrique was told that Dembele had discussed the freedom that the player enjoys on the pitch in an interview with PSG’s social media team. “It’s not just about playing well or doing your part — it has to benefit the team,” said the coach. “And that involves a set of responsibilities and hard work.\n“If people want to call that ‘freedom’, then freedom is fighting for your team-mate. Freedom is fighting for your team. Freedom is fighting for your club — playing football, which is what we’re aiming for.”\nMadrid are next, in a massive semi-final at MetLife Stadium in New Jersey.\nA reunion with Mbappe will fuel the run-up to the match. But can a battle-tested PSG go from conquering Europe to conquering the world?\n(Top photo: Sven Hoppe / picture alliance via Getty Images)",
  "word_count": 1338,
  "scraped_at": "2026-02-14T01:55:17.428835",
  "_text_extracted": true
}