{
  "article_id": "50085b2ec77d",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-brutally-puts-253m-worth-man-utd-stars-up-for-sale-seven-exits-free-up-funds-monster-double-deal",
  "title": "Ten Hag brutally puts £253m worth of Man Utd stars up for sale with seven exits to free up funds for monster double deal",
  "date": "20230301T180000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTen Hag brutally puts £253m worth of Man Utd stars up for sale with seven exits to free up funds for monster double deal\nErik ten Hag will reportedly tell seven Manchester United players their time at the club will come to an end this summer as the Dutchman looks to generate some additional transfer funds for a significant summer spree.\nTen Hag has impressed everyone since his appointment at Old Trafford last summer. Taking over from interim manager Ralf Rangnick, he has overseen major changes on and off the field not seen since the days of Sir Alex Ferguson.\nAnd the Dutchman’s no-nonsense streak has already helped the club collect their first piece of silverware in six years. Indeed, their success in the Carabao Cup will hopefully just be the start for United.\nThe club also hopes to make inroads in the FA Cup and Europa League, while Premier League title glory is not altogether impossible either.\nTruth be told, Ten Hag has massively exceeded expectations since taking the reins at United.\nPhase one of his rebuilding programme is only just underway. Six new names were signed last summer in the wave of a series of big-name departures. To that end, the likes of Nemanja Matic, Juan Mata, Paul Pogba and Jesse Lingard all left as free agents.\nAnd Ten Hag also operated a similar one in, one out policy during January. That saw United sign Jack Butland and Wout Weghorst as replacements for Martin Dubravka and Cristiano Ronaldo, respectively.\nTen Hag, though, did add one more late in the window in Marcel Sabitzer following injury to Christian Eriksen.\nHowever, this summer the United is preparing to take his rebuilding programme on to another level.\nREAD MORE: Man Utd given clear path to seal first two signings of summer as cautious Ten Hag offers response\nHarry Maguire, Anthony Martial to lead Man Utd clearout\nAnd the Daily Mirror reports that seven players are likely to be chopped as Ten Hag savagely rids United of its deadwood.\nThe seven names on the chopping block cost United a combined £253m in transfer fees. And while Ten Hag knows the players will only generate a fraction of that, he will reportedly listen to offers for the septet to generate additional transfer funds. This feature here takes a look at how they should sell this summer.\nLeading the group of departures will be club captain Harry Maguire, one of the club’s costliest-ever signings at £80m. He has fallen down the pecking order this season thanks to the excellent form of Lisandro Martinez and Raphael Varane.\nHe will be joined through the exit door by fellow defenders Eric Bailly, who has spent this season on loan with Marseille, Brandon Williams and Alex Telles.\nUnited currently have four left-backs on their books, with Luke Shaw and Tyrell Malacia the preferred options.\nIn midfield, Donny van de Beek may also be offloaded, though his situation is complicated by a knee injury. He has failed to impress since a £40m move from Ajax, with United seemingly willing to cut their losses.\nPerhaps the two most surprising exits, though, will be Anthony Martial and Aaron Wan-Bissaka.\nMartial is a player much admired by Ten Hag, though his injury record has done him no favours. As such, he may well be sacrificed to free up some funds.\nWan-Bissaka’s sale will also come as a surprise given his recent resurgence at Old Trafford. Initially written off by Ten Hag, the player has come good of late with some excellent displays at right-back.\nBen Jacobs touched on several of these potential departures in a recent one-to-one with TEAMtalk.\nTen Hag ready to sign new striker and midfielder\nAnd while Ten Hag will use the funds to further strengthen his squad, it is reported that the United boss will focus on quality over quantity.\nTo that end, his main focus is likely to be on the addition of a new striker and midfielder.\nIndeed, his quest for a new top centre forward is likely to hit United hard in the pocket. Victor Osimhen is United’s top target and the Napoli man is likely to cost in the region of £120m. The Serie A side are not of the mind to sell, though president Aurelio De Laurentiis has suggested a hefty bid could yet twist his arm.\nIn addition, Ten Hag also wants to add a top-quality midfielder to partner Casemiro.\nDeclan Rice has been mentioned as a potential target, especially in light of the England man pushing to leave West Ham.\nHowever, the Red Devils could yet make a move for Jude Bellingham. United are not seen as the main contenders to sign the Borussia Dortmund teenager, with that race seemingly led by Liverpool.\nHowever, United’s ability to offer Champions League football, together with the rise Ten Hag’s side seem to be enjoying, could yet convince the player to choose to make Old Trafford his next destination.",
  "word_count": 831,
  "scraped_at": "2026-02-14T01:55:49.880783",
  "_text_extracted": true
}