{
  "article_id": "500ceaec88bb",
  "url": "https://www.themag.co.uk/2023/12/hello-is-that-the-disaster-police-please-send-help-urgently-newcastle-united/",
  "title": "Hello , is that the Disaster Police ? Please send help urgently ! ",
  "date": "20231220T131500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello, is that the Disaster Police? Please send help urgently!\nOh n0, Newcastle United knocked out in the quarter-finals of a cup!\nSend for the disaster police! It’s all over.\nSack the board, bring back Steve Bruce and the firing squad.\nAlso, a case of two semi-finals not placed amongst the other January matches, a blessing potentially in disguise with the FA Cup and some tough Premier League fixtures?\nThe injury list continues to grow.\nSome players are returning but possibly (all but certainly?) not all 100% fit, as last night showed.\nEddie Howe had no other choice with Kieran Trippier, still carrying some sort of injury but sent into battle along with BDB, also probably not 100% fit. Whilst 34 year old Matt Ritchie (by the way a fantastic professional throughout his NUFC career), who just seems to be out of his depth within our current squad.\nSo, more time for players’ injury recovery and giving the players fit enough to play, more recovery time, along with the January transfer window now being less than two weeks away. Things may not be that bad?\nThe thrill of the FA Cup against a team who’s name escapes me and who were once in the Premier League but now of little concern.\nWhilst currently sixth in the Premier League table. four points potentially off a Champions League place (again) and only five points behind Manchester City (in fourth).\nA lighter schedule than would otherwise have been the case, which now gives us a better chance to concentrate on finishing as high as possible… and potentially more Champions League football at SJP.\nMerry Christmas all and best wishes for 2024.\nStats via BBC Sport:\nChelsea 1 Newcastle 1 (Chelsea win 4-2 on penalties) – Tuesday 19 December 8pm\nGoals:\nNewcastle United:\nWilson 16\nPenalties: Wilson scores, Trippier wide, Bruno scores, Ritchie saved\nChelsea:\nMudryk 90+2\nPenalties: Palmer scores, Gallagher scores, Nkunku scores, Mudryk scores\nPossession was Chelsea 78% Newcastle 22%\nTotal shots were Chelsea 15 Newcastle 4\nShots on target were Chelsea 4 Newcastle 2\nCorners were Chelsea 7 Newcastle 1\nReferee: Jarred Gillett\nAttendance: 38,058 (4,300 Newcastle)\nNewcastle team v Chelsea:\nDubravka, Krafth (Trippier 45), Lascelles, Botman (Burn 45), Livramento, Bruno, Longstaff, Lewis Miley, Almiron, Gordon (Ritchie 52), Wilson\nUnused subs:\nKarius, Gillespie, Dummett, Hall, Alex Murphy\n(Absolutely loving this from Kieran Trippier – An absolute credit to Newcastle United – Read HERE)\n(Chelsea 1 Newcastle 1 (Chelsea win 4-2 on penalties) – Match ratings and comments on all of the NUFC players – Read HERE)\n(Chelsea 1 Newcastle 1 (Chelsea win 4-2 on penalties) – Instant Newcastle United fan / writer reaction – Read HERE)\n(Chelsea 1 Newcastle 1 (Chelsea win 4-2 on penalties) – Late late heartbreak – Read HERE)\nConfirmed Newcastle United matches to end of January 2024:\nSaturday 23 December 2023 – Luton v Newcastle (3pm)\nTuesday 26 December 2023 – Newcastle v Forest (12.30pm) Amazon\nMonday 1 January 2024 – Liverpool v Newcastle (8pm) Sky Sports\nSaturday 6 January 2024 – Sunderland v Newcastle (12.45pm) ITV\nSaturday 13 January 2024 – Newcastle v Man City (5.30pm) TNT Sports\nTuesday 30 January 2024 – Aston Villa v Newcastle (8.15pm) TNT Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 548,
  "scraped_at": "2026-02-14T01:56:38.147370",
  "_text_extracted": true
}