{
  "article_id": "500f2582c0a2",
  "url": "https://www.solomonstarnews.com/strong-start-for-coast/",
  "title": "STRONG START FOR COAST",
  "date": "20250501T013000Z",
  "domain": "solomonstarnews.com",
  "source_country": "Solomon Islands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The reigning champions Central Coast Football Club (FC) have already sent out a strong message in their Super League 2025 season campaign.\nThis was when they humiliated FC Juniper Tree with a commanding 5-0 victory in their opening match on Sunday at Lawson Tama stadium.\nThe victory has sent a strong tone for their title defence this season.\nIt was the Coast’s formidable midfielder Marlon Tahioa who opened the scoring for his side with a penalty in the first half breaking the deadlock by giving Central Coast a 1-0 lead at halftime.\nCoast with the one goal lead in the first half, continued to dominate the match resulting in more scoring chances but only not to find the right combination.\nHead Coach Jacob Moli in the second half made a key substitution, introducing forward Clifford Fafale, who made an immediate impact by scoring a hat trick before Hudson Oreinima added the final goal, sealing the 5-0 triumph over FC Juniper Tree.\nCentral Coast in a statement after the match said it is good to have a strong start of the season.\n“It’s better to have a good start in the season. It’s important to start off with a win, the club management is proud of the boys for their effort and hard work during the match and able to got the first 3 point.\n“The season will not be an easy ride for the team. It’s a long season, and all games will be crucial for the team as we defend our title.\n“We also have a few players who are yet to start their season after recovering from injuries, so we are hoping for the best in our upcoming matches.\n“We will go back to the drawing board and work on key areas that need improvement before our next game. We need to put in extra effort, taking our matches one at a time. As understood all teams this season are well-prepared, and we know this journey will not be easy. We will push harder in our preparation to achieve our goals.”\nCentral Coast is still fresh from the recent OFC Club Champions League competition held in Honiara few weeks ago.\nMeanwhile, Central Coast FC will face Waneagu United FC in their next match this weekend.\nBy FLOYD TERRY JNR\nSolomon Star, Honiara",
  "word_count": 384,
  "scraped_at": "2026-02-14T02:15:07.786907",
  "_text_extracted": true
}