{
  "article_id": "501069e9bf89",
  "url": "https://www.nytimes.com/athletic/6673062/2025/09/30/pafos-champions-league-bayern/",
  "title": "Meet Pafos , the first - timers whose owner  wants to win the Champions League  ",
  "date": "20250930T053000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Years before Pafos had won the Cypriot league — let alone reached the Champions League — owner Roman Dubov had hung pictures of the Bernabeu, Stamford Bridge and a few other iconic stadiums on the walls of their training centre.\nThe message, repeated to employees who were there and who Dubov was trying to recruit, was: we will play there one day.\nAdvertisement\n“F***. These guys are really ambitious,” was the reaction of chief scout Rodolfo Vaz, who was weighing up whether to join the club when he saw the photos.\nOutlandish ambitions are not uncommon for aspirational football clubs. Not so many of them actually achieve those goals, though.\nBut Pafos have. After qualifying for the Champions League proper for the first time in their history, beating Maccabi Tel Aviv, Dynamo Kyiv and, finally, Crvena Zvezda in dramatic fashion through an 89th-minute goal, they were drawn against some of the giants they always said they would face.\nTheir first game was against European stalwarts Olympiacos. But bigger fish are ahead: they will travel to Juventus in December and Chelsea in January. But before all of that, they host Bayern Munich — Harry Kane, Luiz Diaz, Joshua Kimmich and all — on Tuesday.\nIt will be the biggest game in the history of the club. But then again, they’ve had quite a few of those. “It’s amazing because every single month, every single week, you have the most important game in the history of the club,” says Vaz.\nThat is partly because there is not much history: Pafos are technically only 11 years old. The club that exists today was formed in 2014 from the merger of two teams — AEK Kouklia and AEP Paphos — the latter of which also came about due to a merger in 2000. They spent their early years flitting between the top two divisions of Cypriot football before being taken over by Total Sports Investments (TSI), led by Dubov, in 2017.\n“When I first arrived in Pafos, the idea was simple,” Dubov tells The Athletic. “To build something that would last. Not just a football team, but a sustainable football project and business. Cyprus offers sunshine, passion and football-mad people, and there was an opportunity to create a professional, competitive club that the city could truly be proud of.”\nAdvertisement\nIt took a little while to get things right. The first few years of Dubov’s tenure featured a string of lower/mid-table finishes, and they got through 10 head coaches in six years, including former Scotland defender Steven Pressley, Michel Salgado, Henning Berg, Cameron Toshack (son of John) and globe-trotting journeyman coach Stephen Constantine.\nThen things all seemed to click when they recruited Juan Carlos Carcedo in 2023. Carcedo had a modest record as a manager, his biggest achievement being promotion to the Spanish second tier with Ibiza, but his pedigree comes from the 15 years he spent as Unai Emery’s assistant.\n“We wanted something fresh,” says Pafos chief executive Charis Theocharous, who says it was that experience with Emery at Sevilla, Paris Saint-Germain and Arsenal that drew them to him. “We wanted someone who would grow up with us.”\nThe first season under Carcedo was up and down, but ended with them winning the Cypriot Cup. In his second, they won the Cypriot league for the very first time, finishing seven points clear of 2023 champions Aris Limassol and a whopping 29 ahead of title holders and 29-time winners APOEL.\nThat got them as far as the second qualifying round for the Champions League, where they beat Maccabi Tel Aviv narrowly on aggregate. Next up were Dynamo Kyiv, who were dealt with relatively easily, but the biggest test came in the playoff round, the final hurdle, against Crvena Zvezda: Pafos won the first leg in Belgrade 2-1, but the Serbian visitors took a 1-0 lead into the 89th minute of the return fixture. Extra time beckoned, penalties loomed, but up popped Brazilian winger Jaja to lob in a dramatic equaliser on the night and winner in the tie.\n“The emotions were crazy,” says defender, and man of the match in that Olympiacos game, Derrick Luckassen, with the sigh of a man who has never quite experienced anything like that before. “If you go into the Champions League qualification round as a club like Pafos, you don’t think you will really get that far. It’s a dream if you can get there. But we deserve to be in the Champions League.“\nAdvertisement\nThey are just the third Cypriot team to make it, after Anorthosis Famagusta and APOEL (the latter reached the quarter-finals in 2012), but those two are relative giants by comparison. To reiterate just how modest Pafos’ history is, the biggest success among the clubs that merged to form them was a few second division titles. It would be a little like Hull City merging with Huddersfield Town, then merging with Sheffield Wednesday, then going on to win the Premier League.\nMaybe that is overstating it a little. It is not exactly a fairytale underdog story: Pafos have received significant investment and have recruited players from far and wide — including former Chelsea, Paris Saint-Germain and Brazil defender David Luiz — but they insist their budget is comparable to other clubs in Cyprus.\nThey are playing their home games at the home of Limassol, as their own Stelios Kyriakides Stadium did not meet UEFA’s exacting standards to host matches. But work is already being done to upgrade their facilities, including an on-site block of apartments for their younger players to stay in.\nAnd recruiting players is not as easy as just offering them big money. Cyprus is not typically thought of as among the most attractive leagues, and salaries are an issue. “It’s extremely difficult to bring in a quality player of a good age,” says Theocharous. “For a quality player, we are not always the pick for them. We are not in the best championship in the world.”\nLuiz is an outlier in terms of player profile: their other permanent signings this summer came from Turkey, the Brazilian second tier and Ajax’s bench. They apply a hybrid recruiting approach that combines old-fashioned scouting (after we talk, Vaz hops on a plane to the Under-20 World Cup in Chile) and data, and are starting to prioritise the classic buy low, sell high model that has made so many smaller clubs self-sustaining. “We have to try as well to sell players, so a new player can see that there is an actual pathway to be sold to a more advanced championship,” says Theocharous.\nOne trump card they have is the lifestyle in Cyprus: a player who has an offer from Pafos and another club in shall we say, a less attractive location, will often be persuaded by the scenery, sunshine and pace of life on the holiday island in the eastern Mediterranean.\nThey are persistent, too. They called Luckassen around a dozen times, trying to get him to join them. “I went to talk with them and they had a whole project planned out,” he says, “and they wanted me so bad. So I was like, if the club wants you so bad, maybe you should do it.”\nAdvertisement\n“We’re also a club who pay on time,” says Theocharous, which is the sort of thing that probably should not be used as a boast, but for teams outside the big leagues it is not a given.\nBehind all of this is Dubov. Born in Hungary to a Russian family but a British citizen since 1999, Dubov is CEO of TSI, a group with a broad portfolio that takes in Esports, artificial intelligence, padel and a range of other concerns. At one point, it was almost a multi-club ownership group: Dubov was on the board of FC Riga in Latvia until 2017 and was more informally involved with Russian second-tier side Rodina Moscow, but Pafos is its only current involvement in football.\nThose with a keen memory may recall that Dubov was a member of a group that briefly owned Portsmouth, in those late 2000s/early 2010s years when the English club barely seemed to go a year without changing owners. Dubov was part of Convers Sports Initiatives, alongside Vladimir Antonov, a Russian businessman later jailed for his role in a multi-million-dollar bank fraud.\nDubov had no connection with those crimes, but it clearly informs part of his answer when I ask what he learned from that experience: “I learned the importance of carefully choosing your partners.”\n“Always, and above all, it’s about people,” he says, when I ask what he attributes Pafos’ success to. “The right coaches, players who are committed to the project, staff who work tirelessly day and night, and fans who support us no matter what. Success does not come from one individual; it is achieved when everyone moves forward together. We recruit our staff from top clubs around the world, including Benfica, Udinese, Valencia, Porto and Atletico Madrid, as well as Brazil, among others.”\nThe day after Pafos drew their opening league-phase game against Olympiacos, 0-0, I message Dubov to say what a good result it was. A point, against a more established team, in their first ever Champions League match, despite having a man sent off after 25 minutes: I thought it was a pretty good result. “It wasn’t the result we wanted,” comes the reply. I relay that to Vaz and Theocharous, and they both start laughing before I have a chance to actually tell them what Dubov’s response was. They’ve heard it before.\n“If you ask Roman, he wants to win the Champions League,” says Vaz.\nAdvertisement\nAmong the crowd for the Bayern game tonight will be Nikos Christodoulides, the president of Cyprus and a big Pafos fan. Does having the leader of the country present bring extra pressure? “I certainly hope it does, at least for the players,” says Dubov. “When the president is in the stands, you do not want your striker to miss from two metres. But honestly, it is a great sign. It shows that Pafos is becoming an important part of the community.”\nPafos are not going to win the Champions League. Winning one of their eight league-phase matches would be an achievement. Coming close to qualifying for the knockout rounds (teams with 11 points managed that last season) would be astonishing. But in the minds of those at the club, they’re not just happy to be here.\n“We want to make a noise,” says Theocharous. “We already made noise and we want to make even more noise on the bigger stage. We might not have this opportunity again.”\n(Top photo: Srdjan Stevanovic/Getty Images)",
  "word_count": 1780,
  "scraped_at": "2026-02-14T02:12:04.360854",
  "_text_extracted": true
}