{
  "article_id": "5018a0b16797",
  "url": "https://www.arsenal.com/news/preview-athletic-club-v-arsenal",
  "title": "Preview : Athletic Club v Arsenal",
  "date": "20250916T081500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Our dream of lifting the Champions League for the first time in our history can start once again on Tuesday (5.45pm UK) when we head to Bilbao for a first competitive meeting with Athletic Club.\nAfter being beaten in the semi-finals back in April by eventual winners Paris Saint-Germain, we start the league phase against the La Liga outfit, looking to make their mark after an 11-year wait for the continent’s biggest competition to return to the San Mames Stadium, in what is sure to be a party-like atmosphere.\nHowever, we head to Bilbao looking to become the first side in the history of the European Cup to win six consecutive matches against Spanish sides, having beaten Real Madrid and Sevilla twice, as well as Girona during our first couple of campaigns back amongst the elite, and complete a dream return to the Basque Country for Mikel Arteta.\nLong wait over\nLegendary boss Ernesto Valverde’s most recent return to the club saw him end a 40-year wait to win the Copa del Rey in 2024, and last season’s fourth-place finish sealed a Champions League return for the first time since 2014.\nHeading into this game, Athletic Club sit third in La Liga, but their promising start to the campaign ended on Saturday when they lost 1-0 in a home derby against Alaves, when they were without the services of talisman Nico Williams through injury.\nThey started the campaign with a 3-2 victory against Sevilla where Williams scored one and assisted two others, including a late winner for Robert Navarro on his debut. Last season’s top scorer Oihan Sancet then netted a penalty to beat Rayo Vallacano 1-0, before their only away game this term came at Real Betis, who were beaten 2-1.\nWhat the managers say\nArteta: “We’re excited to start again from scratch in a beautiful place, in a stadium that is going to generate something special. We’re looking forward to that and I’m very excited again to step by step build some momentum, and start to have some wins.\n“We landed in Bilbao, that’s normally where I land when I go back home to San Sebastian, it’s an hour's drive from there. All my family is from there, and you just sense the passion, the rivalry, the football atmosphere. It’s great to be here - I’ve never been in this stadium before, so it’s a good experience.” - read every word from Mikel’s pre-match press conference\nValverde: \"We're really excited to play in this competition and we want to compete. We know the difficulty is increasing, that the clubs aren't holding anything back, and that it's also a way for us to test ourselves.\n\"When you're playing against one of the favourites to win the competition, you have to be very careful, take advantage of your opportunities and not concede too many. They have a very high pace, which pushes you towards your goal. It's like when Real Madrid or Barcelona come to us, you'll have to try to put on a perfect performance.\"\nTeam news\nMartin Odegaard was forced off early against Nottingham Forest on Saturday with a recurrence of the shoulder problem that has hampered his season so far, and he hasn't travelled with the squad, nor has Ben White despite being named on the bench on the weekend.\nWilliam Saliba returned to training last week after his ankle injury and could be fit enough to return, but Bukayo Saka remains out of action with his hamstring issue, while Kai Havertz and Gabriel Jesus are also missing from the trip due to their knee injuries.\nThe big news for Athletic is that star man Nico Williams is out with a groin injury sustained in Spain’s 6-0 win against Turkey, a problem that he struggled with at the end of last season, while new signing Aymeric Laporte wasn’t signed in time to be included in their Champions League squad.\nFellow centre-back Yeray Alvarez was handed a 10-month doping ban last week, further limiting Valverde’s options in the heart of his defence after Unai Egiluz suffered a cruciate knee ligament injury in pre-season and will sit out the entire season. A regular over the past two seasons, Benat Prados has also recently suffered a long-term knee injury and will require surgery.\nTalking tactics\nAdrian Clarke: Valverde loves to play fast-paced, pressing football in a 4-2-3-1. They average just 48% possession in La Liga and tend to be much more direct and incisive when they burst forward. They are strong from corners and wide free-kicks too, racking up 18 set play efforts on goal in less than 400 minutes of league action.\nAthletic Club, who tend to attack with pace and panache down the sides. Inaki and Nico Williams are usually their wide forwards, but also look out for right-back Jesus Areso. He has produced 18 open play crosses in four La Liga games, flying forward on the overlap. Alex Berenguer [above] is another to keep an eye on as he can play anywhere across the front line and chips in with plenty of goals and assists. Bright and technically excellent, Berenguer has made seven chances this season.\nValverde will want his players to press us, but given our quality on the ball, he may set up slightly more pragmatically than usual. If we begin to play through the thirds, they will switch to a hostile mid-block. Boasting La Liga’s best expected goals against number (2.0xGA), they defend well as a team and are not easy to break down.\nIf we press Athletic, we could experience plenty of joy. Their defensive players have made several errors during the early weeks, so it could be a good idea to apply pressure in a bid to force fresh mistakes. Viktor Gyokeres, our new pressing machine, has a big role to play in this regard.\nFacts and stats\nWe haven’t started any of our last eight European campaigns with a defeat (W6 D2) since a 2-1 loss at Dinamo Zagreb in the 2015/16 Champions League.\nThis will be just the third time the Lions have faced an English opponent in the European Cup/UEFA Champions League (eliminated by Manchester United in 1956/57 quarter-final and Liverpool in 1983/84 last 16).\nAthletic won six of their seven home games in last season’s Europa League, with their only defeat coming in the semi-final against Manchester United (3-0).\nAcross the last two editions of the Champions League, only Real Madrid (33) have accumulated more points in the group/league phase than our 32.\nErnesto Valverde has only lost nine of his 42 games as a manager in the Champions League (W23 D10). Among Spanish managers with 10+ matches in the competition, only Pep Guardiola has a lower loss rate (17.1%) than Valverde (21.4%).\nWe have conceded just 18 goals in 24 Champions League matches under Mikel Arteta. Among teams with 20+ games under a manager, only four sides in the competition have a better goals conceded per game average (0.75): Fabio Capello’s Milan (0.38), Louis van Gaal’s Ajax (0.63), Frank Rijkaard’s Barcelona (0.68) and Valverde’s Barcelona (0.71).\nViktor Gyokeres was directly involved in seven goals in eight appearances in the Champions League last season (six goals, one assist for Sporting Lisbon), averaging a goal or assist every 87 minutes played.\nNo non-Spanish player has ever appeared for Athletic in the European Cup/UEFA Champions League, while two could do so in this game: Ghanaian international Inaki Williams and Moroccan Maroan Sannadi.\nMatch officials\nLithuanian official Donatas Rumsas has been handed control of this game in Bilbao, the first time he has overseen either ourselves or Bilbao. A construction project manager by day, he has been refereeing in his homeland’s professional leagues since 2011, and five yeats later was added to the FIFA list of officials.\nHe made his Champions League debut back in 2021/22 and has refereed seven group stage matches so far, and in those he has sent off three players and awarded four penalties.\nReferee: Donatas Rumsas (LTU)\nAssistants: Aleksandr Radius, Dovydas Suziedelis (LTU)\nFourth official: Robertas Valikonis (LTU)\nVAR: Pol van Boekel (NED)\nAssistant VAR: Tomasz Kwiatkowski (POL)\nRecent trips to Spain\nAcross the last two seasons, we have won all five of our Champions League games against Spanish sides, with three of those victories coming away from home. In November 2023 goals from Gabriel Martinelli and Jesus beat Sevilla, while in January Jorginho and Ethan Nwaneri struck in a 2-1 win against Girona. Two months later, Saka and Martinelli were on target in the Bernabeu as we beat Real Madrid to progress to the semi-finals.\nYou have to go back to April 2021 for the last time we lost in the country when Villarreal defeated us 2-1 in the first leg of our Europa League semi-final, while you have to go back to March 2016 for the last time it happened in the Champions League, when Barcelona beat us in the round of 16 at the Nou Camp.\nLive coverage\nOnce again this season, Live From N5 is the place to be for live commentary of all our men’s first-team games across 2025/26.\nTune in from just before kick-off on Tuesday, when Dan Roebuck and Adrian Clarke will once again be behind the mics to guide you through the on-field action.\nYou can also find out which broadcasters are showing the action live wherever you are in the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1591,
  "scraped_at": "2026-02-14T01:55:21.391618",
  "_text_extracted": true
}