{
  "article_id": "503019926d99",
  "url": "https://thepeoplesperson.com/2024/01/22/francesco-farioli-emerges-as-surprise-managerial-target-should-erik-ten-hag-be-sacked-274850/",
  "title": "Francesco Farioli emerges as surprise managerial target should Erik ten Hag be sacked - Man United News And Transfer News",
  "date": "20240123T031500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A lot was expected from Erik ten Hag after a fantastic debut season in which the Dutchman guided Manchester United back to the Champions League and ended their six-year trophy drought as the Red Devils clinched the Carabao Cup.\nDespite a few big-money signings, the team has simply not clicked with the manager’s tactics letting the side down while injuries have also played a major role behind the disappointing results.\nUnited crashed out of Europe in humiliating fashion, finishing bottom of their Champions League group while also exiting the Carabao Cup in the fourth round.\nThe 20-time English league champions are also in danger of missing out on qualifying for Europe’s premier club competition as they are currently a lowly eighth, 11 points behind Aston Villa who are fourth in the standings.\nEtH’s position not safe\nThe Glazers, who always cared more about finances rather than on-pitch results, are no longer set to call the shots at Old Trafford with INEOS securing a 25 percent stake in the club recently.\nSir Jim Ratcliffe has planned a major overhaul behind-the-scenes with Omar Berrada already named as the new CEO while more changes are afoot.\nAnother huge change that is being planned is bringing in a new manager, especially if results do not show any upturn now that injured stars are slowly coming back into the first-team squad.\nThe Peoples Person has already covered reports linking us with a swoop for Roberto de Zerbi and Graham Potter should Ten Hag be handed his marching orders.\nNow TeamTalk have added a brand new name into the mix, Francesco Farioli. The Italian is currently leading OGC Nice in Ligue 1 and is “highly-regarded” by the INEOS leadership.\nThe French club are also under the umbrella of the British petrochemicals giant and the 34-year-old coach has Nice in an unlikely second place in the league standings, eight points behind Paris Saint-Germain and in the Round of 16 of the French Cup.\nFrancesco Farioli, a surprise contender\n“TEAMtalk can exclusively reveal that Ratcliffe has eyes on several potential managerial candidates.\n“Graham Potter, Roberto De Zerbi and Francesco Farioli are among the names that have been continuously floated by those close to the club.”\nFarioli has worked with De Zerbi in the past, during his spell at Benevento and Sassuolo while serving as a manager at Turkish clubs Fatih Karagümrük and Alanyaspor.\nRatliffe has intentions of expanding the umbrella of clubs and talent exchange from within will be a great business model to have with the City Football Group already reaping its rewards.",
  "word_count": 426,
  "scraped_at": "2026-02-14T01:54:27.642458",
  "_text_extracted": true
}