{
  "article_id": "50767f1e1c3f",
  "url": "https://www.justarsenal.com/louis-saha-predicts-next-seasons-top-four-and-names-teams-arsenal-will-finish-below/343233",
  "title": "Louis Saha predicts next season top four and names teams Arsenal will finish below",
  "date": "20230629T203000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Manchester United striker Louis Saha has expressed doubts about Arsenal’s ability to replicate their impressive form from last season in the upcoming campaign. He predicts that the Gunners will finish below several other clubs in the league table.\nArsenal surprised many football fans with their improved performances last season, coming close to winning the league and securing a place in the Champions League. Under the guidance of Mikel Arteta, the club has been undergoing a rebuilding process since 2020, and their progress has made them a formidable team on the continent.\nAlthough Arsenal is expected to make significant signings in the current transfer window to bolster their squad and sustain their previous standards, Saha remains unconvinced that they will secure a top-four finish in the league.\nHe said via The Sun:\n“I believe that Liverpool are going to be up there and will most likely be the main threat.\n“Everybody will probably say Arsenal because of what they did last season.\n“But even if they make some good signings this summer, I’ll still be surprised if they finish ahead of Man City, Liverpool, Man United and Chelsea next season.”\nJust Arsenal Opinion\nNo one believed we could stay atop the league standings for as long as we did last season, but we did and we expect to have more doubters in the next campaign.\nThe most important thing is that we remain focused on the job at hand and do our best whenever we step on the pitch.\nSick of transfer news ??? Check out the Dublin Arsenal Supporters 22/23 ARSENAL SEASON REVIEW WITH SPECIAL GUEST – THE BBC’S CONOR MC NAMARA\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 297,
  "scraped_at": "2026-02-14T01:56:02.399311",
  "_text_extracted": true
}