{
  "article_id": "50802d949ede",
  "url": "https://www.nytimes.com/athletic/6725556/2025/10/17/aston-villa-maccabi-tel-aviv-ban/",
  "title": "Political backlash over Israeli fan ban at Villa Park . Plus : Are tactics making EPL dull ? ",
  "date": "20251017T121500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nToday, we bring you the news that fans of an Israeli team have been banned from an English football ground. It’s causing controversy and a political backlash. We’re here to explain.\nAdvertisement\nPlus: Is the Premier League getting boring? And look inside the mind of the midfielder who hit the high notes for Pep Guardiola and Jurgen Klopp.\n‘National disgrace’: Starmer and Badenoch slam Villa ban on Maccabi Tel Aviv fans\nMatchday four in the Europa League takes place next month and on November 6, Aston Villa host Maccabi Tel Aviv. It’s not a fixture that, in plain footballing terms, was likely to make major headlines. The competition is in its early stages and is very much the Champions League’s lesser cousin.\nBut the game shot to the top of the agenda yesterday after The Athletic revealed that fans of Maccabi Tel Aviv, one of Israel’s most recognisable clubs, would be banned from attending Villa Park. The decision was made on the advice of West Midlands Police, the constabulary with responsibility for overseeing security at the match. A statement from Villa said it had been implemented on the grounds of “public safety concerns”.\nPolice anticipate that the tie could attract protests over the conflict involving Israel and Hamas in the Middle East, a crisis that, after two years of fighting, is now subject to a negotiated ceasefire. Football has not been immune to the war. Before the ceasefire, there were calls for Israel to be banned from UEFA and FIFA competitions in response to the nation’s actions in Gaza. Israel’s recent World Cup qualifier in Norway became highly political, owing in part to Norway’s pro-Palestinian stance.\nLast November, Maccabi Tel Aviv played a Europa League game against Ajax in Amsterdam. The contest was marred by violent disorder, with five people taken to hospital and 62 injured. Maccabi fans were among the victims of the violence. Police reported how others had burned a Palestinian flag and attacked a taxi. An extra 800 officers were on duty because of safety concerns.\nAdvertisement\nBanning away fans from Villa next month, however, is a controversial step, essentially blocking Israeli — and therefore many Jewish — fans from freely following Maccabi Tel Aviv. Last night, the UK prime minister, Sir Keir Starmer, intervened by publicly criticising the move on X. His post followed another from the leader of the opposition, Kemi Badenoch, who described the ban as a “national disgrace”.\n‘Decision based on current intelligence’\nStamer’s rebuke will intensify the debate around West Midlands Police’s position in the days ahead. Here’s what he said in his tweet: “This is the wrong decision. We will not tolerate antisemitism on our streets. The role of the police is to ensure all football fans can enjoy the game, without fear of violence or intimidation.”\nWest Midlands Police had earlier sought to justify its stance — which Europa League organisers, UEFA, are expected to follow — referencing the trouble seen at the Ajax-Maccabi Tel Aviv meeting 11 months earlier. “This decision is based on current intelligence and previous incidents, including violent clashes and hate crime offences that occurred during the 2024 UEFA Europa League match between Ajax and Maccabi Tel Aviv in Amsterdam.”\nThe clash of views and the depth of the politics involved was further underlined by Ayoub Khan, a member of parliament for the Birmingham Perry Barr constituency, signing a petition calling for the game to be called off, staged in a neutral country or held without an away crowd. The petition said this was to ensure “community harmony”. According to a 2021 census, Birmingham has a 30 per cent Muslim population.\nMaccabi Tel Aviv have said nothing about the ban. The Athletic asked the club for comment and is awaiting a response. But the backlash to it, and the delicacy of the entire debate surrounding Gaza, meant it was no surprise to hear this morning that the police and crime commissioner for West Midlands has ordered an immediate review.\nAdvertisement\nNews round-up\n- Lamine Yamal and Jude Bellingham have jumped into Forbes’ list of the top 10 highest-paid footballers in the world. Cristiano Ronaldo remains way, way out in front on £208million ($280m).\n- England’s Football Association is considering using Miami as a training base for Thomas Tuchel’s squad during the build-up to the 2026 World Cup.\n- Tuchel’s No 1, Jordan Pickford has agreed a new contract with Everton until the end of 2028-29.\n- Juventus are facing a UEFA investigation over a possible breach of the European governing body’s financial rules. The probe covers the campaigns from 2022-23 to 2024-25.\n- A couple of significant injury blows as international football gives way to club football again: Chelsea’s Cole Palmer is out for another six weeks with a groin problem. And Mikel Arteta confirmed Arsenal have lost Martin Odegaard to ligament damage.\nBeautiful game?\nI know a hot potato when I see one. Any time spent writing about football, or sports in general, teaches you that certain subjects invite a hail of arrows from the audience. For example, articles daring to besmirch the brilliance of Neymar.\nTactics fall into that category, largely because beauty is in the eye of the beholder (and beholders in football are extraordinarily tribal). When Oli Kay took on that topic yesterday — effectively asking if the Premier League was becoming harder to enjoy — comments beneath his column landed in spades.\nOli’s point of view (and he’s not alone) is that football in England’s top flight is experiencing an identity crisis. The Premier League has come through the era when Pep Guardiola’s style, the precision in possession which took Manchester City to a treble in 2022-23, was everybody’s cup of tea. We’re now in a period where the Pep supremacy is being viewed with more disdain.\nSome, such as ex-Manchester United defender Patrice Evra, think Guardiola drained the life out of football by turning players into “robots”. Whether driven by that attitude or not, the aesthetics of the Premier League are clearly changing. Long throws are back in business, passing numbers have fallen, long goal kicks and goals from headers are on the rise, and so are goals from set-pieces.\nTo Oli’s eye, the shift is making the spectacle attritional and “a difficult watch”. “Those who accuse Guardiola of sucking the fun and creativity out of the game should be careful what they wish for,” he wrote. I have to be honest: I’m not in any way hating this season but a poll run by us found that 68 per cent of people are on Oli’s side. So where do you stand? Hit me at the usual email address.\nPass master: How Gundogan thrived under Guardiola and Klopp\nSticking with that theme, some food for thought: were it not for Guardiola, the Premier League would not have had the pleasure of Ilkay Gundogan in technicolour. Jordan Campbell met up with the German playmaker — now at Galatasaray in Turkey — for The Athletic’s My Game In My Words series. The piece is online this morning, and it’s superb.\nGundogan won’t go down as a Premier League great (that’s a very exclusive club) but he had it all: the passing, the movement, the assists and the goals. And what Jordan rightly notes is that no other player ever thrived so spectacularly under the coaching of both Guardiola and Jurgen Klopp.\nAdvertisement\nIn some ways, coping with those contrasting styles should be nigh-on impossible. In layman’s terms, they’re chalk and cheese, and players tend to have specific skill sets. But Gundogan possessed the brains and the talent to do it, and as I read him breaking down his own qualities, it occurred to me that, in an understated way, not many footballers have appealed to me more.\nAround TAFC\n- If you’re looking for potential World Cup breakout stars, look no further than Estevao. The 18-year-old winger is causing a stir in Brazil and he could well be a success story from Chelsea’s scattergun transfer approach.\n- Virtually every part of the body is properly understood in sport but as Charlotte Harpur writes, not enough attention has been paid to the pelvic floor historically. She set out to change that.\n- Felipe Cardenas is questioning Argentina’s preparation for their World Cup defence. The friendlies they’re choosing seem to be driven by commercial interests more than competitive value. In short, they won’t have learned much from beating up Puerto Rico.\n- The college soccer scene in the U.S. looks set for a major, and much-needed, overhaul. Henry Bushnell reports.\n- Friday quiz: name the six men who have played in 13 or more World Cup games for England. Answers here a little later today, and in Monday’s TAFC.\n- Most clicked in Thursday’s TAFC: Real Madrid’s ownership model changes.\nCatch a match\n(Selected games, times ET/UK)\nFriday: Ligue 1: Paris Saint-Germain vs Strasbourg, 2.45pm/7.45pm – beIN Sports, Fanatiz, Fubo/Amazon Prime.\nSaturday: Premier League: Nottingham Forest vs Chelsea, 7.30am/12.30pm — USA Network, Fubo/TNT Sports; Fulham vs Arsenal, 12.30pm/5.30pm — NBC, Fubo, Peacock Premium/Sky Sports; La Liga: Barcelona vs Girona, 10.15am/3.15pm — ESPN+, Fubo/LaLigaTV; German Bundesliga: Bayern Munich vs Borussia Dortmund, 12.30pm/5.30pm — ESPN+, Fubo/Sky Sports; Serie A: Roma vs Inter, 2.45pm/7.45pm — Paramount+, Fubo, DAZN/TNT Sports, DAZN; MLS: Nashville vs Inter Miami, 6pm/11pm, Colorado Rapids vs LAFC, 9pm/2am — MLS Season Pass/Apple TV.\nSunday: Premier League: Tottenham Hotspur vs Aston Villa, 9am/2pm; Liverpool vs Manchester United, 11.30am/4.30pm — both USA Network, Fubo/Sky Sports; La Liga: Getafe vs Real Madrid, 3pm/8pm — ESPN+, Fubo/Premier Sports; Serie A: Milan vs Fiorentina, 2.45pm/7.45pm – Paramount+, Fubo, DAZN/TNT Sports, DAZN.\nAnd finally…\n👀 Nothing to see here…\nJust that time @ClubBrugge goalie Senne Lammens scored in the #UYL pic.twitter.com/72DaJjBCGC\n— UEFA Men’s Youth (@UEFAMensYouth) September 5, 2022\nMark Critchley hopped across to Belgium to find out more about Manchester United’s new goalkeeper, Senne Lammens. His feature told me that in his younger years, Lammens was actually a striker — which gave TAFC the excuse it needed to dig up Lammens’ pinpoint header for Club Brugge against Real Madrid in a UEFA Youth League tie in 2019 (above).\nPerhaps every club should put their keepers through finishing school.",
  "word_count": 1723,
  "scraped_at": "2026-02-14T01:52:49.024127",
  "_text_extracted": true
}