{
  "article_id": "50901b79447d",
  "url": "https://www.caughtoffside.com/2024/10/30/jamal-musiala-transfer-liverpool-united-chelsea/",
  "title": "Exclusive : Liverpool , Man United & Chelsea following world class attacker in precarious transfer situation",
  "date": "20241030T161500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool, Manchester United and Chelsea are among the clubs monitoring the situation of Bayern Munich star Jamal Musiala as he approaches the final year of his contract.\nMusiala has shown himself to be a world class performer at Bayern, as well as with the German national team, and sources close to the player’s situation have provided CaughtOffside with some insight into how much interest there is in him at the moment.\nAlthough Bayern will try hard to keep Musiala, they are under pressure to tie him down to a new deal as soon as possible, or else there is the serious risk that they’ll have to sell him for below market value in summer 2025.\nIf they don’t, Musiala could leave the Allianz Arena on a free transfer in the summer of 2026, and CaughtOffside understands there are plenty of top clubs keen to snap him up.\nJamal Musiala attracting transfer interest from Premier League giants\nCaughtOffside understands that Manchester City have the strongest interest in Musiala at the moment, though his contract situation also has Liverpool, Man United, Chelsea and Real Madrid on alert.\nCity’s interest stems from the fact that they have Kevin De Bruyne in the final year of his contract and facing an uncertain future.\nThe Belgium international has been a tremendous servant to City but he’s not getting any younger and is understood to have interest from the Saudi Pro League.\nMusiala could be an ideal long-term replacement for De Bruyne, but other big clubs can’t be ruled out either, with Liverpool also in the market for an elite attacking player like this as Mohamed Salah is in a similar situation to De Bruyne – in the final year of his contract and attracting interest from Saudi Arabia.\nMusiala had a spell at Chelsea earlier in his career so might be tempted to go back there and prove a point, though the Blues would surely struggle to lure in a talent of this calibre if they once again miss out on Champions League football.\nUnited, meanwhile, have often signed big names like this who went on to struggle, so Musiala might want to think twice about going to Old Trafford until the new regime at the club steer things back in the right direction.",
  "word_count": 379,
  "scraped_at": "2026-02-14T01:57:46.236384",
  "_text_extracted": true
}