{
  "article_id": "5091d16b49a6",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/lauryn-goodmans-son-kyle-walker-33242241",
  "title": "Lauryn Goodman son with Kyle Walker reveals his two favourite England players",
  "date": "20240714T194500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EXCLUSIVE: Lauryn Goodman's son with Kyle Walker reveals his two favourite England players\nLauryn Goodman is believed to have spoken of the heartache she is facing as her son Kairo who she shares with Kyle Walker is 'unaware' of the drama surrounding them\nLauryn Goodman and Kyle Walker's son is completely \"unaware\" of the drama surrounding them.\nThe Celebs Go Dating star and Manchester City ace share two children from what sources have described as a brief fling. But since the paternity of the children was revealed, Lauryn, 33, and Kyle, 34, have been embroiled in drama. While the Sheffield-born England vice-captain and his team have been battling it out to be crowned, Lauryn has put the drama aside and has been vocal about supporting Kyle.\nShe previously flew out to see Kyle and his teammates play in Germany but was met with criticism from some social media users who claimed she should \"stay away\". However, others were keen to praise Lauryn for taking Kairo to the game against Serbia so he could see his dad play in real life.\nNow, sources close to the Brighton-based star have revealed the heartache she is facing behind the scenes. Speaking exclusively to the Mirror, a source said: \"Kairo is unaware of the situation currently and is fully supportive of his father and loves him dearly. Kairo loves showing his sister who their daddy is.\"\nREAD MORE: Lauryn Goodman reveals plans for cheering on Kyle Walker with kids despite baby dad 'feud'But it appears that the youngster is following in Walker's footsteps, with the source adding: \"Kairo often wins football trophies and won one recently. He is hoping his dad can win the trophy at the final tonight. Kairo naturally has his dad's sporting abilities and follows his every achievement with his little girl starting to kick a football around. \" After Manchester City won The Treble after a 1-0 victory against Milan in the Champions League final, his son was said to be over the moon.\nThe source went on to say: \"Kairo was so proud of his dad winning the premier league.\" But while Walker is his dad, Kairo is apparently hoping either Foden or Saka will score the winning goal in the nail-biting final. Our source continued: \"He loves Bukayo Saka and Phil Foden. He's hoping one of them scores the winning goal this evening. It's going to be a late night for Kairo tonight but he is beyond excited. The children are positive it's coming home and the family are looking forward to watching a historical evening.\"\nAlthough Lauryn had previously flown to Germany, she has much more low-key plans for the final and is instead, celebrating at home. Our source revealed: \"Lauryn's children with Kyle will be supporting their dad for the Euro final. Kairo often shows his friends his football book and is proud to show off his daddy.\"\nThe quarter-finals last week saw Southgate's team beat Switzerland a whopping 5-3 on penalties as they sailed through to the semi-final against The Netherlands. Lauryn captioned the post, which was posted before they won: \"Come on England. [lion emoji] Always Supporting [lion emoji]. *Last slide sums up the entire nation right now.\" In one snap, Kairo and their daughter - who were both wearing 'Daddy' shirts - were watching the screen with intense interest.\nFollow Mirror Celebs on TikTok , Snapchat , Instagram , Twitter , Facebook , YouTube and Threads .",
  "word_count": 574,
  "scraped_at": "2026-02-14T02:08:01.877614",
  "_text_extracted": true
}