{
  "article_id": "509d094f6b1c",
  "url": "https://www.justarsenal.com/chris-sutton-worries-for-arsenal-if-saka-does-not-face-city/350543",
  "title": "Chris Sutton worries for Arsenal if Saka does not face City",
  "date": "20231007T110000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal is facing the possibility of not having Bukayo Saka available for their Premier League clash against Manchester City this weekend due to a recent injury setback. Saka was unable to complete the match against Lens in the Champions League midweek due to an injury sustained during the game.\nDespite expectations that Arsenal manager Mikel Arteta might rest Saka for the match against City, he featured in the match against Lens. However, this decision may have backfired, as Saka’s injury could potentially sideline him for an extended period.\nBBC pundit Chris Sutton has expressed concerns about the impact of Saka’s potential absence on Arsenal’s performance against City. Saka has been a key player for the Gunners, and his absence could pose a significant challenge for the team as they prepare to face one of the top sides in the Premier League.\n“I worry for Arsenal if they are without Bukayo Saka, I really do.\n“This is a test of their mettle now.\n“They are already without Gabriel Martinelli through injury, so will they carry enough of a threat against City if Saka is out as well? I am not sure.”\nJust Arsenal Opinion\nEvery Arsenal fan knows Saka is a massive player for us and we want to face an opponent like City with him in the squad.\nThe attacker would make winning easier for us, but injuries are a part of football, and relying on one player is never advisable.\nWe expect our team to find another match winner if the Hale End graduate is not fit enough for the match.\nJustArsenal Show –\nNEO analyses our Win Against Bournemouth and our loss Against Lens…….\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 300,
  "scraped_at": "2026-02-14T02:00:57.111458",
  "_text_extracted": true
}