{
  "article_id": "50b1edac8e3d",
  "url": "https://www.barcablaugranes.com/barcelona-uefa-champions-league/106572/enzo-maresca-urges-chelsea-to-be-aggressive-against-robert-lewandowski-and-barcelona",
  "title": "Enzo Maresca urges Chelsea to be aggressive against Robert Lewandowski and Barcelona",
  "date": "20251124T181500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea manager Enzo Maresca has previewed Tuesday’s clash with Barcelona in the Champions League and shared his thoughts on Hansi Flick’s side.\nEnzo Maresca urges Chelsea to be aggressive against Robert Lewandowski and Barcelona\nThe two teams meet at Stamford Bridge this week.\nMaresca highlighted in-form striker Robert Lewandowski as a real threat to his side and vowed to defend aggresively against the Catalan giants.\n“Without a doubt, he is a fantastic player. He has shown all his life that the most important thing in football is to score goals. We’re going to try to defend as a team, be aggressive, as always. But they have a lot of players: Lamine Yamal, Fermín, Frenkie de Jong. But we’re going to try to win the game,” he told reporters.\n“The (high) line is a factor, for sure, but we also have to pay attention without the ball. They can create a lot of chances and score goals every time. We need to find the right balance between attack and defense.”\nMaresca also had plenty of kind words for Flick’s side and is expecting a difficult test at Stamford Bridge.\n“I think they’re spectacular, it’s a team that whenever I look at it there are things that can be learned, things that can be looked at, how they attack, how they defend, which in the end has given them the chance to win La Liga last year, to get to the Champions League semi-final,” he added.\n“They do a lot of things very well and it’s a team that always wants initiative, always wants value and we try to do the same on our side.”\nChelsea currently sit second in the Premier League table and, like Barcelona, have seven points from their opening four Champions League games so far in 2025-26.",
  "word_count": 299,
  "scraped_at": "2026-02-14T02:09:38.460107",
  "_text_extracted": true
}