{
  "article_id": "50f49ab52f62",
  "url": "https://www.fourfourtwo.com/features/jose-mourinho-s-wildest-moments-from-touchline-fracas-to-calculated-press-conferences",
  "title": "Jose Mourinho wildest moments , from touchline fracas to calculated press conferences",
  "date": "20240930T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jose Mourinho's wildest moments, from touchline fracas to calculated press conferences\nThe former Chelsea, Real Madrid, Manchester United and Tottenham Hotspur boss has had more than his share of dramatic incidents over the years\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nJose Mourinho has been no stranger to bizarre and controversial moments over his long managerial career, racking them up even more frequently than he has taken trophies.\nThe latest in his highly-entertaining career saw Mourinho receive a yellow card after he protested against a VAR decision to disallow his Fenerbahce side a goal by placing a laptop in front of a TV camera in an attempt to highlight the apparent injustice.\nFrom strange press conferences to pitchside melees, here's some of the Portuguese manager's wildest and most headline-capturing moments... with a focus on keeping it at least mildly light-hearted (so no Eva Carneiro disgrace here).\nVIDEO: The ONLY Way Man City Can Survive Without Rodri\nJose Mourinho's wildest moments\n8. \"Respect, respect, respect\"\nIt was still early in the 2018/19 season and Manchester United had just lost 3-0 at home to Tottenham Hotspur, which of course would never happen nowadays.\nUnhappy at a line of questioning about the fans departing the ground early, Mourinho held up three fingers and said: \"What was the result? 3-0? You know what this means? 3-0. But it also means three Premierships, and I've won more Premierships alone than the other 19 managers together. Three for me, and two for them.\"\nGetting out of his seat, Mourinho then did the 'calm down' flat-palm hand gesture to the media and repeatedly said 'respect, respect man' as he made his way out the door to bemused laughter.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n7. Handbags with Arsene Wenger\nA rare instance where Mourinho appeared to be on the more innocent end of things (ish), the manager was then in his second spell at Chelsea and entered the Arsenal technical area after Gary Cahill's awful foul left Alexis Sanchez in a heap.\nWenger went over and pushed Mourinho back into his own box, sparking angry words between the two managers, with the Gunners boss amusingly explaining afterwards: \"I wanted to go from A to B, and somebody confronted me before B without any sign of welcome.\n\"Honestly, I don’t listen to what he says. Push him? You would know if I really tried to push. Come on. \"\n6. Sparking scenes by going after Marco Ianni\nActually, another one where Mourinho had the right to feel like he was the aggrieved party as Chelsea coach Marco Ianni celebrated a late equaliser right in the face of then-Man United boss Mourinho.\nMourinho leapt up to pursue Ianni down the tunnel, but was restrained by stewards and Manchester United staff, including Phil Neville. Ianni was fined for his provocation and both he and Chelsea boss Mauricio Sarri offered apologies.\n5. Breaking kayfabe to laugh before remembering he was actually outraged\nThis is hilarious! 😆Mourinho walks off chuckling after Gundogan misses Man City's penalty and Sterling goes down 🤣Then he remembers that Sterling has received a yellow card and charges towards the fourth official to remind him! 🏃💨 pic.twitter.com/8lfd2r2guKFebruary 3, 2020\nMourinho? Putting on a performative outrage to try and get a competitive edge for his side? Surely not.\nThe silliness of his play-acting was spelt out very vividly during Mourinho's Tottenham spell, though. Mourinho laughed out loud at Raheem Sterling's theatrics as he tried to earn Manchester City a second penalty in a row on the rebound from Hugo Lloris' saving Ilkay Gundogan's spot kick.\nMourinho was then was reminded by an assistant that Sterling had already been booked, and instantly decided was absolutely apoplectic that Sterling had not been carded again, sprinting to the fourth official to plead his case. Spurs ended up winning 2-0 against ten men - but it was Oleksandr ZInchenko who was dismissed, rather than Sterling.\n4. Wearing a wire on the touchline after repeated red cards\nMourinho headed off to Roma after his time at Spurs came to an end, but was unable to have any meaningful impact on their results over his two and a half seasons in charge.\nNaturally, the referees needed to share in the blame as far as Mourinho was concerned, receiving three red cards in the 2022/23 season, Mourinho admitted he had decided to wear a wire in case he ended up in any more altercations and needed the recording for his defence.\nHe said after a 1-1 draw at Monza: “I’m not stupid, you know. Today, I went to the game with a microphone. I recorded everything. From the moment I left the locker room, to the moment I returned. I protected myself.\"\n3. A calculated no-question press conference\nMourinho has been around the block long enough to know exactly what he was doing here. Post-match press conferences at Manchester United are manic affairs with questions from a packed media room going in in rapid-fire fashion.\nHowever, after the final league game of the 2016/17 season, Mourinho made sure he got to the room before the majority of the written press (who get their audience last of everyone after broadcasters and club media) and sat down.\nThe press officer asked the stunned handful of people in the room if they had any questions, and clearly unsure as to whether they should wait for their colleagues, they hesitated for a moment. Mourinho declared \"good\" and promptly left.\n2. Hiding in a laundry basket to evade ban\nDuring his first season at Chelsea, Mourinho picked up a touchline ban for a Champions League quarter final against Bayern Munich that also prohibited him from entering the dressing room before or during the game.\n\"I go to the dressing room during the day so I was there from midday and the game is seven o'clock. I just want to be in the dressing room when the players arrive,\" he told Sky Sports years later. \"I went there and nobody saw me. The problem was to leave after. And Stewart Bannister the kit man put me in the basket. It was a little bit open so I could breathe.\n\"But when he is taking it outside the dressing room, the UEFA guys were following and desperate to find me so he closed the box and I couldn't breathe! When he opened the box I was dying! I am serious! I was claustrophobic, I promise! It's true!\"\n1. Poking Tita Vilanova in the eye\nTempers were running high at a typically feisty El Classico in the Spanish Super Cup in August 2011, and Real Madrid and Barcelona players angrily confronted one another after Lionel Messi's late winner captured the trophy for Tito Vilanova's side.\nIn the middle of the melee, Mourinho was captured calmly meandering over to his opposite number and patiently jamming his finger right into Vilanova's eye before wandering off. A shove in the back received in return prompted a smug 'who, me?' expression from Mourinho.\nBarcelona opted against making an official complaint, saying: \"The public have given their opinion. They are very clear that what this person did wasn't right. The (Spanish football) federation will act if they want to.\"\nThey did: Mourinho got a two-match ban, though it was later rescinded in a general amnesty on suspensions across Spanish football.\nSteven Chicken has been working as a football writer since 2009, taking in stints with Football365 and the Huddersfield Examiner. Steven still covers Huddersfield Town home and away for his own publication, WeAreTerriers.com. Steven is a two-time nominee for Regional Journalist of the Year at the prestigious British Sports Journalism Awards, making the shortlist in 2020 and 2023.",
  "word_count": 1390,
  "scraped_at": "2026-02-14T02:25:58.977468",
  "_text_extracted": true
}