{
  "article_id": "50f6d79a0407",
  "url": "https://www.managingmadrid.com/2025/4/29/24420159/where-real-madrid-and-a-new-coach-go-from-here",
  "title": "Where Real Madrid And A New Coach Go From Here",
  "date": "20250429T173000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "These observations — where I look at Real Madrid’s history, its players on loan, Castilla, tactical tidbits, and other relevant thoughts — are now a regular thing. All previous editions can be found here.\nWhere Real Madrid And A New Coach Go From Here\nWhat changes are needed?\nSince losing Cristiano Ronaldo in 2018, Real Madrid won three league titles, two Champions League titles, one Copa del Rey title, and a plethora of minor trophies consisting of Super Cups and Club World Cups. Then Karim Benzema left in 2023, and Real Madrid responded by winning a double. Two days after lifting the Champions League trophy on June 1st, Real Madrid announced the signing of Kylian Mbappe.\nFor a solid five years, it seemed like the team could do no wrong. Everything worked. Even when the team played poorly and everything was stacked against them, they found a way to win. And then they kept winning, and winning, until it just became a joke: This team will just always end up on the winning side no matter which star player leaves and no matter who stands in the way.\nMaybe the culmination of all of that success is why even the biggest pessimist didn’t see this coming: Real Madrid fell off a cliff this season — nose-diving into their worst campaign in years. Finally, a lack of reinforcements got exposed. Finally, the well ran dry. Finally, individual brilliance was not enough.\nWas the humbling needed? Maybe. These intangible things: Pain, humiliation — they are hard to assess. Sometimes teams and players need to go through this kind of adversity to make some real changes. Real Madrid have to do soul-searching now: You have signed Kylian Mbappe and paired him with two Ballon D’or candidates in Vinicius Jr and Jude Bellingham. None of these guys are going anywhere, and so the ultimate question is this: What are the surrounding pieces that need to be plugged in to make this work?\nAnd a follow up: Who is the manager who can find the solution?\nNot all is lost. If you were to build a team from scratch, you’d draft a bunch of these guys. Fede Valverde and Bellingham would start in any midfield on the planet. Thibaut Courtois is a cheat code in nets. Mbappe is Mbappe. Vinicius is Vinicius.\nThat’s a world-class, generational nucleus to build around. But beyond that, a reality-check of multiple humiliations has helped expose how poor the majority of this roster is outside its superstars.\nThis is arguably the worst wing-back situation in Real Madrid history, and if it’s not the bonafide worst, it’s not far from the abyss. Dani Carvajal is the only world-class full-back the team has (not counting Fede Valverde, who is a midfielder) — and even he will be coming off a horrific long-term injury at the age of 33. If Trent Alexander-Arnold arrives (‘if’ used intentionally because you never truly know for sure until you see it inked officially), the team quickly needs to shift to reinforce the left-back position.\nReal Madrid extended Ferland Mendy’s contract mid-season, which seemed too rushed at the time. They could’ve waited to see how the season unfolds before hastening into re-signing a player that has deteriorated with injuries. Now they are tied to him beyond this season. Add Mendy to the list of albatross contracts, along with David Alaba, which will be close to impossible to move unless the club has stern conversations with both of them and come to agreements to pay some of their salary — in hopes someone can take one or both of them, possibly even on a loan, akin to Gareth Bale’s stint at Tottenham in the 2020 - 2021 season.\nBut contracts didn’t stop Real Madrid from trying to sign Alphonso Davies and Leny Yoro. But they did ultimately fall short due to the financial demands of both of those players. Davies and Yoro were names that Real Madrid wanted. Someone like Miguel Gutierrez may not move the needle enough for them when Mendy and Fran Garcia are already in the roster. What about Theo Hernandez? His contract expires in 2026, and AC Milan have a historically good relationship with Real Madrid. He would be a much more feasible player to sign compared to someone like Nuno Mendes who some fans have suggested. (Mendes is inked until 2029, and plays for one of the most difficult clubs to negotiate with. Vitinha, another name commonly floated around to replace Toni Kroos, is in the same impossible situation.)\nIs Dean Huijsen this season’s Leny Yoro? The club is not as adamant about him, but they should look at him as a real option. The difference between Yoro and Huijsen is that the latter has a real desire to play for Real Madrid that Yoro didn’t have. Huijsen is a strong presence that reads the game well and is an excellent ball progressor. He fits the timeline of what Real Madrid are building towards. Given Eder Militao and Alaba’s health and uncertainty, it’s very possible Real Madrid can only realistically rely on two center-backs next season — Rüdiger, Raul Asencio — if they don’t bring someone in. There should be no tolerance for using Tchouameni as a center-back instead of letting him hold down the midfield.\nSigning two wing-backs and Huijsen would be a good start to getting this team back on track. Not all problems get solved, but for a team that relies so much on heavy two-way wing-back production, it’s imperative those needs are address.\nThe rest of the squad can be guided by a manager with fresh ideas. Carlo Ancelotti was exactly what Real Madrid needed when he came in, and remained the perfect coach for the job for three years — which is typically around the time where managers lose their influence. Ancelotti is one of the greatest managers in football history for a reason — but players were frustrated with their roles this season, and the team was repeatedly battered by teams with far inferior squads on paper.\nStruggles in ball progression have been well documented; and the team’s defensive structure gets carved with minimal effort — typically one or two passes. Ancelotti has struggled implementing a successful pressing scheme over the years, and his cardinal sin is that the team doesn’t compensate by sitting in a compact block. There is no one way to play football. The best football is the one that works. Real Madrid don’t have to press, but if they don’t, they have to fall into a compact mid-to-low-block to make up for it. Far too often is the team in limbo: kind of, sort of pressing with a high line.\nThe insistence to field three attackers also hurt Real Madrid. Rodrygo was seen as indispensable as Vinicius and Mbappe, which meant there were three wingers on the field at once — making runs redundant while taking a player away from both the box and from midfield. Rodrygo was often pinned deep on the right. Those minutes could’ve been soaked up by a fourth midfielder to provide more balance. Perhaps a new manager will come to the conclusion that all three attackers can play together — much like how Luis Enrique is cooking with PSG. But it will be in a different scheme, not this one.\nThere is no one single person to blame. Not Rodrygo, not Vinicius, not Mbappe — who has put up the best numbers but scapegoated because of his transfer coinciding with the downfall. It’s also not Ancelotti — neither is it all on Florentino Perez.\nBut it was a bad combination. Real Madrid’s lack of reinforcements may have not been as big of a problem had Ancelotti had more trust in youth team players. Could Jesus Fortea and / or Lorenzo Aguado have been groomed when Carvajal dropped injured in October? Fortea, as a reminder, is one of the most promising right-backs in Spanish football. Raul Asencio came out of nowhere to save the destroyed defensive line. Someone like Fortea emerging could’ve mitigated problems. Instead, Ancelotti trusted Lucas Vazquez — slow, weak defensively, and little to show for in attack — all season. How many points did Real Madrid drop from opposing teams attacking Vazquez relentlessly?\n(Vazquez is another who doesn’t deserve blame. It’s not his fault he’s being trusted. He does his best — this is why blaming one individual solely is ridiculous. For better or worse, the easiest to replace is always the manager, and that’s where Ancelotti will fall on the sword.)\nAncelotti also can’t do much about Vinicius having one of his worst seasons as a Real Madrid player. Countless of transition attacks were squandered while goals and points were left on the table. Poor decision-making in the final third cost the team. Had those attacks have been more efficient, Ancelotti and the board’s decisions wouldn’t have been magnified as much.\nBut here we are: Real Madrid suffered a blip this season, and that’s likely all that it will be. This team can bounce back quickly. But it’s up to the board to make sure that mediocrity is not tolerated. Running it back would be disastrous. At least three roster changes are needed, and a new manager should be able to take advantage of the remaining talent — not to mention a budding star in Arda Güler and an Aurelien Tchouameni who looks back to his best.",
  "word_count": 1571,
  "scraped_at": "2026-02-14T01:58:31.692234",
  "_text_extracted": true
}