{
  "article_id": "5104770f6f79",
  "url": "https://metro.co.uk/2025/04/01/morgan-gibbs-white-chris-wood-injury-latest-nuno-espirito-santo-22826893/",
  "title": "Morgan Gibbs - White and Chris Wood injury latest from Nuno Espirito Santo",
  "date": "20250401T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nottingham Forest manager Nuno Espirito Santo was giving little away on his selection headaches ahead of a clash with Manchester United on Tuesday night.\nHigh-flying Forest are enjoying an incredible season as they sit third in the Premier League table with just nine games to play.\nHowever, there has been frustrating news of late on the injury front, with two of their star performers suffering setbacks.\nMorgan Gibbs-White collided with a post during the FA Cup quarter-final win over Brighton at the weekend, while Chris Wood missed that game after suffering a hip problem on international duty with New Zealand.\nEspirito Santo was asked about the English midfielder first, telling a press conference on Monday that he will be assessed right up till Tuesday afternoon before the meeting with the Red Devils.\n‘We need to assess many of the players. We are doing this,’ said the Forest boss. ‘The game is later on in the day, so we will have the rest of today, the morning and the afternoon to assess the players. We will make a decision on them then.\nOn Wood’s progress, he added: ‘He is improving. He is getting better day by day.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We have to assess him every day. It is all about him being pain free and then getting back to fitness. We are recovering well.\n‘The joy and the happiness of coming through and getting to play at Wembley will give us an extra run for tomorrow, for sure.’\nIt has been a quick turnaround after playing 120 minutes against Brighton on Saturday, followed by the penalty shootout win, which the Portuguese admits is tough on his squad.\n‘It’s very difficult on the players but we see them and they are recovering well,’ he said. ‘They are always being positive so we are confident we can perform again against a good team.\n‘In this short turnaround, it is all about recovering. We’re going to be OK.’\nEvery game is huge for Nottingham Forest as they continue their push for the unlikeliest of Champions League finishes, so the manager will want his star men back as quickly as possible but without rushing them and risking further injury.\nMore Trending\nThe game against Manchester United at the City Ground is followed by a trip to Aston Villa and then a home meeting with Everton and an away match at Tottenham, before the huge FA Cup semi-final against Manchester City on April 26.\nWhile Espirito Santo has concerns over two key players another standout performer will be fit and ready to go on Tuesday in the form of Callum Hudson-Odoi.\n‘He’s improving. He has had some outstanding performances this season and is getting better and better,’ his manager said of the winger. ‘You have to have pleasure and enjoy who you work with and Callum is a happy boy playing and working with his team-mates.’\nMORE: Darren Bent names the ‘first’ player Arsenal will sell this summer\nMORE: Mikel Arteta tells Arsenal fans he is ‘excited’ about summer transfer window plan\nMORE: England legend Wayne Rooney reveals three clubs tried to sign him from Man Utd",
  "word_count": 573,
  "scraped_at": "2026-02-14T02:02:35.594001",
  "_text_extracted": true
}