{
  "article_id": "51641cb8823d",
  "url": "https://www.dailymail.co.uk/news/article-14801563/Inside-Britain-deadliest-gang-mobsters.html",
  "title": "Inside Britain deadliest gang",
  "date": "20250803T140000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside Britain's deadliest gang: Meet the mobsters who gun down rivals, firebomb homes and attack innocent children on our streets\n- Have YOU got a story? Email chris.matthews@mailonline.co.uk\nScotland has been embroiled in a savage gangland feud with warring clans fighting over control of the drugs market in Glasgow and Edinburgh.\nThe bloodshed has even spilled across the continent with two mobsters executed while enjoying a holiday in Spain.\nOne gang, calling themselves Tamo Junto (TMJ), has claimed responsibility for a series of shootings, fire bombings and attacks on children.\nThe crew share sick boasts of their horrific crimes on social media with videos on TikTok.\nSpeaking after a 12-year-old was seriously assaulted at a house in Glasgow, one of the crew bragged to the Daily Mail: 'F*** 'em mate, it's called caught in the crossfire of war.'\nHe added: 'You're talking like innocent people are being attacked n hurt which is not true at all.'\nThankfully, the child survived. But sadly for Scotland, this gang war has shown no signs of stopping.\nTamo Junto are run by Ross 'Miami' McGill, a Dubai-based Scottish gangster pumping cocaine into Scotland. This is Tamo Junto's emblem\nThe mobsters behind a deadly gang war in Scotland have taken to sharing their campaign of violence on TikTok\nTamo Junto (TMJ) have posted 63 videos, including death threats and images of people with targets on their heads. The Mail has blurred their faces for their safety\nTamo Junto's leader is a football hooligan who fled Scotland for Dubai with the threat of drug charges hanging over him. What he offers his crew is a shot at the big time.\nBut Tamo Junto hoods unleashed hell on the streets when their boss Ross 'Miami' McGill, also known as Mr Big, ordered them to kill his rivals: the Richardson clan in Edinburgh and the Daniel clan in Glasgow.\nMcGill felt he had been disrespected. He had just brokered a £500,000 cocaine deal in February this year when he realised the cash used was fake.\nA former gangster told the Daily Mail: 'When you disrespect someone, they have no choice but to kill you.'\nMcGill had the same thought, and he wasted little time. On March 6, masked thugs threw Molotov cocktails through the windows of the Belle Cheveux beauty salon in Edinburgh, which is run by Stephanie Dignan, the girlfriend of rival kingpin Mark Richardson.\nMcGill's Tamo Junto lieutenants claimed responsibility and said their mission was to 'exterminate' the Richardsons and Daniels.\nScores of gangland attacks have followed and the Lyons clan, who are the Daniels' arch-rivals and fellow Kinahan Cartel allies, have joined Miami's call to arms.\nA revenge plot even saw the war spread to the gangster hub of the Costa Del Sol, where Lyons bosses Eddie Lyons Jr, 46, and Ross Monaghan, 43, were gunned down in a mafia-style execution.\nMessages from Tamo Junto said the Daniels and Richardsons should 'leave Scotland immediately'\nIn one post, the group said 'this is what happens to rats' with an image of the Scottish Scarface Steven 'Bonzo' Daniel, who had his face almost sliced off with a meat cleaver by a rival gangster\nSpanish police have said the suspected killer was a member of the Daniels clan.\nBut despite the rift between the warring factions, a TikTok account loyal to the Daniels and Richardsons refused to 'grass' on Tamo Junto by revealing their rivals' identities.\nInstead, they too bragged about the revenge attacks carried out in Scotland and Spain.\nSpeaking about the two Lyons bosses' murders, the rival account said: 'Let's laugh at Ross Monaghan and Eddie Lyons [three crying with laughter emojis].\n'F*** Ross, f*** Eddie and f*** the Lyons, f*** Ross McGill and f*** TMJ.'\nThe police has stepped up its investigations into the mobsters and arrested at least 50 people so far.\nHowever, this is a war between gangsters who live by a mafia code of silence.\nA source close to the Daniel crime family told the Mail this wave of tit-for-tat violence has no end in sight.\nSpeaking to our reporter in the heart of the clan's territory, he furrowed his brow, smirked and simply said: 'It'll never change.'\nWHAT IS HAPPENING?\nScotland is being torn apart by a violent gang war. Machete attacks, firebombs and shootings are the new normal on the streets of Glasgow and Edinburgh.\nIn February, Dubai-based gangster Ross 'Miami' McGill, also known as Mr Big, was allegedly swindled out of £500,000 of cocaine by associates of jailed Edinburgh kingpin Mark Richardson when they paid for the drugs with counterfeit cash.\nBefore this year, McGill was not considered a major mobster. He was a former Rangers hooligan who had posed with Steven Gerrard and fled Scotland around four years ago, supposedly afraid he would be arrested on drug charges.\nHomes and shops supposedly connected with the Daniels and Richardsons have been targeted with firebombs\nA series of firebombs across the country has rocked a relative peace within some of Scotland's largest cities. Pictured: A gangster throws a firebomb into a house\nLyons gangsters Eddie Lyons Jnr, 46, (left) and Ross Monaghan, 43, (right) were shot dead by a masked gunman while they were watching the Champions League final at Monaghans Irish pub in Fuengirola, Spain on May 31\nThe shooting took place in front of terrified locals and tourists at the popular Costa del Sol bar\nPictured: Monaghans bar, where the killings occurred. When the Mail visited this month, the bar remained closed, its glass doors locked, lights off and chairs neatly tucked under tables\nA joint funeral was held after mobster pals Ross Monaghan and Eddie Lyons Jr were shot to death\nThe two gangsters' families shared loving tributes to their murdered gangland relatives\nMob godfather Eddie Lyons Sr, 67, (second from right) at his son's funeral in Glasgow on July 4\nMourners carried the coffins of the two mobsters into the crematorium to the tune of Braveheart, played by a violinist at the entrance\nLyons associate Liam Boyle, 44, (centre) was seen arriving at the gangland funerals in a silver Mercedes limousine\nSince then, he has capitalised on the jailing of key drug bosses such as Glasgow's Jamie 'Iceman' Stevenson as well as Richardson to take control of much of Scotland's cocaine supply.\nMcGill allegedly put £100,000 bounties on the heads of the Richardsons and their Glasgow allies the Daniel family, which is run by the Scottish Scarface Steven 'Bonzo' Daniel.\nMcGill teamed up with the Daniels' arch-enemy, the Lyons mob, also from Glasgow and allied with the infamous Irish Kinahan Cartel, and told his gang of secretive thugs Tamo Junto (TMJ) to wage a fierce gang war to 'eradicate' the Richardsons and the Daniels.\nSince March 2, there have been dozens of firebombs, machete attacks — and even a double murder.\nTIKTOK TARGETS\nA little more than a month after the first firebomb in this deadly gang war, a mysterious post appeared on TikTok.\nIt was a warning to all members of the Daniels and Richardsons. 'Every associate, every business will be targeted,' it said. 'Leave Scotland immediately.'\nIt was released by an account calling itself Tamo Junto (TMJ) with a profile picture of a skull painted with the Scottish flag over the top of a pair of crossed automatic guns in place of bones.\nThe people running these accounts appear to have strong knowledge of the gangland underworld and the key - and lower level - mobsters involved.\nFor months, TikTok accounts claiming to represent TMJ and their rivals have posted death threats to the Daniels and Richardsons, boasts about injuring their rivals and videos of firebombings.\nAfter the Daily Mail pointed out these accounts to TikTok, the social media giant banned them, although new ones were created within hours.\nThe people running the accounts bragged to the Mail about murdering and maiming their gangland enemies - and even tried to justify hurting children.\nThe TMJ2025 TikTok account has posted a series of videos that include sordid claims about rival gang members as well as death threats\nThe account calls its rivals 'rats' and has included the hashtags '#gangster' and '#tmjdisorder' in its posts\nIt recently issued another warning to its rivals, stating: 'We are coming for you'\nTMJ also posted a video of three masked thugs smashing their way into what they claimed to be a rival gangster's home\nIt all started in February, when the drug deal that started this war took place and Ross McGill was allegedly duped out of £500k worth of cocaine.\nThen, on February 26, at 39 minutes past midnight, the Tamo Junto TikTok account was created.\nFour days later, the attacks started.\nWhether or not the owners of the account are actually the gangsters part of the vicious crew is difficult to verify.\nBut the Mail believes the Tamo Junto TikTok is run by a trio of well-known gangsters with a history of carrying out firebombing attacks long before this war started.\nOn April 10, the account posted: 'Keep it going lads keep the heat on these rats who have stolen that stuff no f… giving [sic].\n'Like it says ever[y]one who's got or had problems with these two dirty rotten mobs should come together n stick together I'm right up for that ma boy as nothing more than my hate for both these mobs.\n'I'm loving seeing them on the run being hit in pocket n everything being put on fire. Yass don't stop keeping the heat on lads.'\nThen on April 15, they said: 'Exterminate the Daniel virus. To be continued...'\nOn April 29, TMJ posted a video of a firebombing with a caption of: 'Let's get this stage two rocking n rolling lads, up the TMJ, gets [these] rats gone forever'.\nOn May 20, it praised a machete attack on two men, one of whom is believed to be a top-ranking Daniels family member, as a 'fine day' and 'a little bit of justice'.\nJust days before, on May 14, the account posted a news report about the firebombing of the ex-wife of slain Daniels enforcer Kevin 'Gerbil' Carroll, adding it was 'just what we love to see'.\nIt is understood a young boy was in the house at the time but he was not injured.\nOn June 11, the group posted a video with two suspected rival gangsters with targets on their heads in the latest death threat posted on TikTok.\nAt the time of writing, TMJ has published 63 TikToks, including death threats against all of the Daniels and Richardsons, who they call a 'virus' and 'rats' that need to be 'gone forever'.\nTheir videos have been watched more than 1.6 million times.\nMESSAGES FROM THE MOB\nWhen the Daily Mail approached the TMJ account, they were initially suspicious our reporter could be a 'mole' for jailed mob boss Mark Richardson.\nHowever, they soon became chatty and almost childlike in their enthusiasm for their account.\n'No one knows who's behind the TMJ2025 account, it's cool,' they said.\n'Stay faceless n fearless n do our talking on the streets.'\nHowever, after being challenged on the gangland feud bringing violence to the streets, the suspected gangsters snapped back.\nThe TMJ account said: 'You're talking like innocent people are being attacked n hurt which is not true at all.'\nOn April 12, a 12-year-old and a 72-year-old were seriously assaulted at a house in Glasgow.\nWhen we put this to Tamo Junto, they said the child was simply 'caught in the crossfire of war'.\nThey said: 'Listen that was a Daniels house who has been hiding her son in da house with young kids.\n'Them Daniels aw beast b******s. F*** em mate, it's called caught in the crossfire of war.'\nPictured: The charred remains of a carpet shop owned by an associate of the Daniel family\nThis beauty salon in Glasgow was targeted by a firebomb in April. Police discovered a cannabis farm in an unconnected neighbouring house\nYet despite the fierce rivalry between the gangs in this gangland war, the mafia code of silence remains strong.\nWhen the Mail approached a rival TikTok account claiming to be connected to the Richardsons and Daniels about Tamo Junto, the suspected gangster running the account, which was called 'Famous.Mr.Big' - a sarcastic dig at Ross 'Miami/Mr Big' McGill - refused to reveal his rivals' identities.\nAlthough he said Tamo Junto were 'w********s [and] grasses', he said he wouldn't give up their names.\nTalking about slain Lyons gang bosses Ross Monaghan and Eddie Lyons Jr, who were killed in a Costa del Sol bar on May 31, he added: 'F*** Ross Monaghan and f*** Eddie Lyons Jr. F*** them all. I ain't no grass.\n'Let's laugh at Ross Monaghan and Eddie Lyons [three crying with laughter emojis].\n'F*** Ross, f*** Eddie and f*** the Lyons, f*** Ross McGill and f*** TMJ.'\nWILL INNOCENT PEOPLE BE HURT?\nThis cavalier attitude to the law could heighten the danger to innocent members of the public. A former Glasgow police detective, who spoke on the condition of anonymity, told the Daily Mail: 'People are just collateral damage if you get in the way. That's just how cold and callous [mobsters] are.\n'If it all goes horribly wrong with [the Daniels and Richardsons] and there's a vacuum, someone is going to fill it.\n'Where there's money to be made, there will be serious and organised crime. If a vacuum is created, there could be a power struggle.'\nExplaining the gangsters' mindsets, former international drug smuggler turned Harley Street addiction counsellor Mark Dempster (pictured) said: 'When you disrespect someone, they have no choice but to kill you'\nGlasgow (pictured) and Edinburgh could erupt into a wider gang war if the two main clans in Scotland are killed off, a former detective warned\nLike Glasgow, Edinburgh (pictured) has already seen a spate of firebombs as part of Mr Big's campaign to kill the Daniels and Richardsons\nExplaining the gangsters' mindsets, former international drug smuggler turned Harley Street addiction counsellor Mark Dempster said: 'You get people whose egos are fragile.\n'It's no different to when you have mafia - when you disrespect someone, they have no choice but to kill you. It's all about feeding the egos for the people in power.\n'No matter how much any [crime] family gets, they want more. It's the same process of expanding their empire. They have got to commit violence.'\nHe added: 'They get put on a pedestal. Young people want to be involved and think violence will go unpunished.\n'[Gangsters] drive nice cars, they have nice girlfriends and there appears to be no justice.'\nDempster said the shameless flaunting of their wealth 'continues the same dysfunction for the next generation'.\nA source close to the Daniel crime family agreed. He told the Daily Mail that the existence of gang crime in Glasgow would 'never change'.\nAnother reformed Scottish gangster said: 'We've got kids ourselves now and don't want them to grow up in this environment.\n'I'm not on social media but I don't agree with it. We'd rather our kids join the army and die fighting for their country rather than live a bad lifestyle of crime the gangster way.\n'You don't want your kids to be bad . You want your kids to go to university or do the opposite.\n'Because you have got money sometimes the kids can live off that and end up bad cause they don't want to work themselves.'\nHis wife added: 'I don't agree with young kids thinking this is a superstar lifestyle. It's not all glamorous.'\nNevertheless, many join these gangs to enjoy a life of fast cars, beautiful women and sunny holidays.\nThe Mail recently visited the gangster hub of Marbella on the Costa Del Sol.\nThere, a British gangster in the region said: 'It's a good place to meet people. It's like a permanent convention for guys in the game.\n'You go to a pub or a bar and you never know what sort of gig could fall in your lap.\n'As long as you know when to keep your mouth shut, it's a fun place to be. It's the gangster life - get a tan, find a girl, make some money.'\nHe added: 'You'll find loads of gangs in Marbella. Obviously, there was the Fuengirola shooting not far away as well.\n'Even so, the ladies love it too. You just have to make sure you're not caught out, like if your missus is staying when certain women are about.'\nTikTok's community guidelines prohibit violent threats, promotion of violence, incitement to violence, or promotion of criminal activities that may harm people, animals or property.\nAs a result of the Daily Mail's investigation, the social media platform banned both accounts, TMJ2025 and Famous.Mr.Big, for violating TikTok's community guidelines.\nDespite TikTok's ban, at least one new account appearing to be run by the same people was created just hours later.\nTHE KEY PLAYERS\nRoss 'Miami' McGill AKA Mr Big\nThe man at the centre of the violent gang war is believed to be Ross McGill, a Rangers football hooligan who headed up the team's ultras group the Union Bears.\nHe quit as the Union Bears 'lead capo' in 2021 and was treated to a personal goodbye from then-manager Steven Gerrard.\nIt is believed he fled to Spain in 2022 as a court date approached in Scotland for allegations he was involved in serious organised crime and drug dealing.\nThe man at the centre of the violent gang war is believed to be Ross McGill, a Rangers FC hooligan pictured here with former Rangers boss Steven Gerrard - whose daughter Lilly is engaged to the son of a top ranking Kinahan cartel thug associated with the Lyons gang\nMcGill is the partner of Olivia Newall (left), whose cousin is a jailed gangster who is part of the Stevenson crew\nHe then moved to Dubai, where Lyons gang boss Steven Lyons and members of the Kinahan Cartel also live.\nIt is thought he was joined in Spain and Dubai by his girlfriend, Olivia Newall, whose cousin Lloyd Cross is the right-hand man of Jamie 'Iceman' Stevenson.\nBoth Cross and Iceman were jailed last year for their part in a £100m cocaine smuggling plot.\nCross is close friends with McGill, grew up less than a mile away from him in Glasgow and was also part of the Union Bears.\nTamo Junto (TMJ)\nTamo Junto is McGill's secretive violent gang. TMJ for short, the gang's name means 'We are together' in Portuguese, although it remains unclear why the name was chosen.\nThey have claimed responsibility for a string of firebombings, shootings and machete attacks in Glasgow and Edinburgh.\nTamo Junto's videos have been viewed more than 1.6 million times on social media platform TikTok\nRoss McGill's gangsters in Scotland have filmed themselves setting homes on fire in their campaign of violence\nIn Edinburgh, one home's window had a visible bullet hole (pictured) after an attack in March. Police Scotland have arrested at least 50 people in connection with the violence in Glasgow and Edinburgh\nThe gang's alleged TikTok account has published calls to 'eradicate' the Daniels and Richardsons and has published death threats against specific gangsters.\nIt is believed the account is run by three criminals with experience of firebombings before this gangland war broke out, however it has not been possible to verify that the people behind the account are the same as the thugs wreaking havoc on the streets as they have said.\nSteven Lyons\nThe suspected head of the Lyons gang, Steven is the son of former mob boss Eddie Lyons Sr.\nDespite his connections to the gang, he has never been convicted of a serious crime.\nHe fled Scotland to Spain in 2006 after he was shot at his uncle's garage in Glasgow. His 21-year-old cousin Michael was shot dead in the same attack.\nSteven Lyons (pictured) is now the boss of the Lyons gang after two senior members were gunned down in Spain\nThese days it is thought he spends some time in Spain and some in Dubai, where he rubs shoulders with the Kinahans.\nHis family's feud with the Daniels dates back to 2001, when a stash of cocaine was allegedly stolen from the Daniels and sold to the Lyons.\nHowever, this latest feud is far more violent and sustained than the conflict between the two clans has been in the last 25 years.\nMark Richardson\nMark Richardson is the head of the Richardson clan.\nHe is currently in solitary confinement at HMP Low Moss and has been in jail since his imprisonment in 2018 for having a Glock handgun and being part of a 65-mph police car chase in north Glasgow.\nHe is still thought to be running his infamous gang smuggling cocaine and heroin into Scotland.\nBonzo's Edinburgh-based associate, mob boss Mark Richardson (pictured), has also been targeted. A former police detective told the Daily Mail that if the Daniels and Richardsons are wiped out a more widespread gang war could take hold in Scotland\nHis friends and family have been targeted by TMJ. On March 6, his girlfriend Stephanie Dignan's beauty salon Belle Cheveux in Edinburgh was torched.\nThen on May 6, his brother Dale Richardson's house was reportedly firebombed and on May 23, his friend David McMillan, 54, was allegedly slashed with a machete.\nSteven 'Bonzo' Daniel, the Scottish Scarface\nSteven 'Bonzo' Daniel is the boss of the Daniel family.\nHe was scarred for life after Lyons gangsters tried to slice his face off with a meat cleaver and machete while he was unconscious at the wheel of his car following a 100mph car chase in 2017.\nKingpin Steven 'Bonzo' Daniel (pictured), who was scarred in a grisly attack by rival gangsters armed with a meat cleaver, is being targeted in the gang war\nWhen emergency workers found him, they thought he had been shot because of the severity of his wounds.\nHe is believed to have initially gone into hiding after a firebomb attack on his home on April 14 and an attack on his mother's house on April 18.\nHowever, despite the threats made against him and his family, he is now thought to have returned to protect his business interests and his fellow gang members from TMJ.\nJamie 'Iceman' Stevenson AKA the Scottish Tony Soprano\nJamie 'Iceman' Stevenson, who has been dubbed the Scottish Tony Soprano, was finally brought to justice in 2024 following a long criminal career of global drug smuggling and brutal violence.\nThe 59-year-old was jailed for 20 years in October after a five-year police operation involving cocaine smuggled under bananas from South America sent to a Glasgow fruit market, a Kent drugs factory and an Amsterdam brothel.\nStevenson had spent decades as one of the UK's most notorious gangland figures and in 2001 was charged with the murder of his former close friend and the best man at his wedding Tony McGovern before the case was later dropped.\nNotorious crime boss Jamie 'Iceman' Stevenson, who has been dubbed the Scottish Tony Soprano, with wife Caroline\nThe cocaine Stevenson tried to import was hidden in boxes of bananas bound for a fruit market in Glasgow\nStevenson's gang had tried to import almost a ton of cocaine, valued at roughly £100million\nThe gangster originally rose up through the Glasgow underworld in the 1990s and became close friends with McGovern, whose family ran the so-called McGovernment mob in the north of the city.\nIceman and five of his associates are now behind bars after being snared as part of the joint Police Scotland and National Crime Agency (NCA) probe, Operation Pepperoni.\nThey were snared after officials smashed the encrypted EncroChat phone network, revealing scores of messages relating to the smuggling plot.\nSentencing him, Judge Lord Ericht said Stevenson had 'directed a complex operation for the importation and supply of cocaine' and 'played a leading role in manufacturing street valium', with 13.5 million pills seized by police.\nThe Kinahan Cartel\nThe Kinahan Cartel, also known as the Kinahan Organised Crime Group (KOCG) is one of the most infamous gangs in the world.\nOriginally from Dublin, they are part of the ongoing gangland feud with fellow Dublin gangsters the Hutch Family (also known as the Hutch Organised Crime Group and HOCG) that has claimed 19 lives since 2015.\nChristy 'The Dapper Don' Kinahan Snr (pictured) was born in Dublin's north inner city but while in prison in the 1980s he worked on learning languages and business. Upon his release, he relocated to the continent where he established links to European, Asian and South America. He worked in the shadows, creating one of the most ruthless drugs networks in the continent\nDaniel Kinahan (pictured) is a suspected crime boss and boxing promoter who once represented 'The Gypsy King' Tyson Fury\nDaniel Kinahan, Christy 'The Dapper Don' Kinahan Snr and Christy Jnr are all wanted, with US rewards totalling $15million\nThese days, leading figures from the Kinahan Cartel live in Dubai. Law enforcement authorities in the US have put $5million bounties on the heads of Kinahan godfather Christy 'The Dapper Don' Kinahan Sr as well as on the heads of his sons Christopher 'Mano' Kinahan Jr and Daniel 'Chess' Kinahan.\nThey are allied with gangs across the world, including the Lyons mob in Glasgow.\nIt is understood Ross Monaghan approached Daniel Kinahan to set up a partnership between the two families.\nPolice Scotland has arrested at least 50 people in connection with the current gang war so far and Chief Constable Jo Farrell has called to make Scotland a 'hostile environment' for gangsters.\nOfficers have dubbed their investigation into the ongoing gang war in Scotland Operation Portaledge.\nPolice Scotland's Detective Chief Superintendent Dave Ferry said: 'I want to be clear that violence will not be tolerated, and we will not stop until we bring those responsible to justice.\n'We are still following positive lines of enquiry, and this arrest highlights our continued resolve to target organised crime.\n'The support of our communities remains vital, and I want to again express my sincere thanks to the public for their continued help and information so far.\n'If you know anything that could assist our ongoing investigation, please do the right thing and speak to us.'\nAnyone who can assist their enquiries is asked to contact Police Scotland via 101 quoting incident number 0562 of Friday, 21 March, 2025.\nAlternatively, you can call Crimestoppers on 0800 555 111 where information can be given anonymously.",
  "word_count": 4415,
  "scraped_at": "2026-02-14T02:11:49.092413",
  "_text_extracted": true
}