{
  "article_id": "516b00de3fcd",
  "url": "https://www.uefa.com/uefachampionsleague/news/0280-17d117efe0db-6c86500a1e4e-1000--highlights-report-inter-set-up-milan-derby/",
  "title": "Inter 3 - 3 Benfica ( agg : 5 - 3 ): Inter set up Milan derby in semi - final",
  "date": "20230419T234500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inter 3-3 Benfica (agg: 5-3): Inter set up Milan derby in semi-final\nWednesday, April 19, 2023\nArticle summary\nInter will face city rivals Milan in the Champions League semi-finals after seeing off Benfica at Stadio San Siro.\nArticle top media content\nArticle body\nInter set up a UEFA Champions League semi-final against city rivals AC Milan as they saw off the challenge of Benfica in an eventful quarter-final second leg at San Siro.\nKey moments\n14': Barella curls in Inter opener\n38': Aursnes heads Benfica level\n65': Martínez fires in for hosts\n77': Correa makes it three with thumping finish\n86': António Silva reduces Benfica deficit\n90+5': Musa secures last-gasp draw on night\nMatch in brief: Inter make it through\nInter led 2-0 from the first leg and extended that lead inside quarter of an hour thanks to a fine strike from Nicolò Barella, who drove forward, exchanged passes with Lautaro Martínez and then curled in with his weaker left-foot.\nMartínez had a goal disallowed as Inter looked to press home their advantage, but Benfica drew level on the night when Fredrik Aursnes rose superbly to head in Rafa Silva's right-wing cross.\nDavid Neres was introduced at the break by the visitors and they started the second half brightly, but just before the midway point of the half, the home side got the crucial third goal of the evening when Martínez blasted in Federico Dimarco's low pass across the box.\nInter substitute Joaquín Correa then got in on the action when he collected Dimarco's pass and cut inside before finishing well via the far post.\nBut the drama was far from over as António Silva headed in to reduce Benfica's arrears before Petar Musa fired in through a crowd of bodies to prevent his side from suffering a fourth successive loss in all competitions.\nPlayStation® Player of the Match: Lautaro Martínez (Inter)\n\"The goal was the icing on the cake. An excellent performance with probing runs, a key pass for opening goal and confidence on the ball.\"\nUEFA Technical Observer panel\nPaolo Menicucci, Inter reporter\nIt will be a special tie against city rivals Milan. Unpredictable in Serie A, the Nerazzurri have rarely missed a beat in the UEFA Champions League. The goals from Martínez and Correa are also important signs for the future – with this spirit and their forwards in form, Inter can go further still.\nLuis Piedade, Benfica reporter\nBenfica depart this season's UEFA Champions League with plenty of honour. They were brilliant in the group stage and round of 16, but ran into a calculating and very effective Inter. The Eagles found this one tough going, lacking in the creativity across the two legs that had taken them to this stage. The late goals to salvage a draw on the night in Milan will surely leave them wondering what might have been had they had managed a better result in the first leg at home.\nReaction\nSimone Inzaghi, Inter manager: \"There is great happiness. It's an important evening for Inter. We played a great match over the 180 minutes against a top-quality team who had lost twice in the eight months before facing us.\"\nRoger Schmidt, Benfica coach: \"We played fantastic football in an international competition and, in 14 games, we lost just once. Unfortunately, it was a very important one. In Lisbon, we didn't play with the same focus and intensity. Still, I liked what I saw today: the team believed in themselves and never gave up, even when it was 3-1.\"\nJoaquín Correa, Inter goalscorer: \"There is happiness, we wanted the semi-final and we deserved it. The group is giving everything, even when things don't go the way we want. This is the real us. If we find a way to always play like tonight we will do many beautiful things. We want to end the year on a high note.\"\nMichael Owen, BT Sport\n\"I love the second Inter goal. It's a great team goal. In the Champions League you can't grumble with three goals on the night and five in the tie and they will take that into a big game in the next round.\"\nKey stats\n- This was only Inter's second draw in their 12 European home matches against Portuguese clubs (W10).\n- Benfica are unbeaten in their last ten European away games (W6 D4).\n- Lautaro Martínez scored a UEFA Champions League goal at San Siro for the first time since October 2019.\n- Benfica have lost all six of their quarter-final ties in the UEFA Champions League era.\nFantasy star performers\nLautaro Martínez – 12 points\nFredrik Aursnes – 8 points\nNicolò Barella – 8 points\nFederico Dimarco – 8 points\nAntónio Silva – 8 points\nLine-ups\nInter: Onana; Darmian, Acerbi, Bastoni (D'Ambrosio 80); Dumfries, Barella (Hakan Çalhanoğlu 76), Brozović, Mkhitaryan, Dimarco (Gosens 80); Martínez (Correa 76), Džeko (Lukaku 76).\nBenfica: Vlachodimos; Gilberto (Neres 46), António Silva, Otamendi, Grimaldo; Florentino, Chiquinho (Musa 80); Rafa Silva (João Neves 80), João Mário (Schjelderup 89), Aursnes; Gonçalo Ramos (Gonçalo Guedes 74).\nWhat's next?\nInter play city rivals Milan in the semi-finals on 10 and 16 May; the Nerazzurri will be the designated away team in the first leg.",
  "word_count": 867,
  "scraped_at": "2026-02-14T01:50:29.479336",
  "_text_extracted": true
}