{
  "article_id": "51eb1a264acd",
  "url": "https://www.fourfourtwo.com/features/players-who-never-won-an-international-cap",
  "title": "Players who never won an international cap",
  "date": "20240219T093000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Players who never won an international cap\nA look at some of the finest footballers who never represented their national teams at senior level...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFootball is full of examples of players who, for one reason or another, never quite fulfilled their potential.\nThere are also plenty of cases of players who were effective in their club careers, but less so at international level.\nOften, top talents have been underused by their national teams and sometimes, not used at all.\nHere is a look at some of the best players who, despite their ability at club level, never won a senior international cap...\n32. Mark Noble\nAside from early loan spells with Hull City and Ipswich Town, Mark Noble spent his entire career with West Ham.\nThe midfielder made 550 appearances for the Hammers and is the English player with the most Premier League games without an international cap, despite previously representing the Three Lions from Under-16 level all the way through to the U-21s.\n31. Manuel Almunia\nManuel Almunia made 175 appearances for Arsenal in all competitions between 2004 and 2011 and later had spells with West Ham and Watford.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe Spanish goalkeeper was never picked to play for La Roja and often said he would be open to an England call-up, but that did not materialise either.\n30. Raul Amarilla\nRaul Amarilla was an impressive long jumper in his youth but opted for a career in football and after a short spell in his homeland with Sportivo Luqueño, he moved to Spain with Real Zaragoza in 1980.\nAfter impressing at Zaragoza, the forward went on to play for Barcelona between 1985 and 1988. During his time in Spain, he accepted a call-up to the Under-21 side and appeared twice. That ruled him out of representing Paraguay and he was never selected for Spain's senior side, either.\n29. Alessandro Renica\nAlessandro Renica played for Napoli between 1985 and 1991 and was at the heart of the club's back line for the most successful period in their history.\nUsually operating as a sweeper, Renica featured in two Serie A title triumphs and a UEFA Cup win in the great side led by Diego Maradona. The defender also played for Vicenza, Sampdoria and Verona, but never won a cap for Italy.\n28. Ruud Hesp\nRuud Hesp was signed for Barcelona by compatriot Louis van Gaal and played in 146 official matches for the Catalan club across three seasons, winning La Liga twice.\nAt international level, he was part of the Dutch squads at Euro 96 and the 1998 World Cup, but was behind Edwin van der Sar and Ed de Goey and never did win a cap for the Netherlands.\n27. Fran Yeste\nFran Yeste spent 11 years of his career at Athletic Club and made over 350 appearances for the Basque outfit, scoring 59 goals.\nThe attacking midfielder represented Spain at Under-18, U-20 and U-21 level, but never won a full cap for La Roja. He made five appearances for the Basque Country.\n26. Horst Blankenburg\nA three-time European Cup winner with Ajax in the early 1970s, Horst Bankenburg was a talented sweeper who also had spells at 1860 Munich and Hamburg.\nWith Franz Beckenbauer so impressive for West Germany in the role of libero, Blankenburg was not given a chance. Ajax team-mate Johan Cruyff asked him to play for the Dutch at the 1974 World Cup, but he declined, hoping to be selected by West Germany. He never was.\n25. Luis Vinicio\nLuis Vinicio was born in Brazil but played most of his career in Italy, where he represented Napoli, Bologna, Vicenza and Inter.\nBarred from Brazil internationals after leaving the country, the striker chose not to play for Italy either. Serie A top scorer in the 1966/66 season, Vinicio netted over 150 goals in the competition overall.\n24. Benito Carbone\nBenito Carbone was one of the most exciting attackers around in the 1990s and early 2000s, but the Italian never seemed to stay anywhere for very long.\nAcross his career, Carbone played for 17 different clubs – including Napoli, Inter, Sheffield Wednesday and Aston Villa – and never won a trophy. He didn't win an international cap with Italy, either, despite eight appearances for the Under-21s.\n23. Albert Stubbins\nAlbert Stubbins was one of the best centre-forwards in England during the 1940s and 1950s, but much of his early career came during World War II.\nThe striker signed for Liverpool in a British record transfer in 1946 and helped the Reds win the league in his debut season. His sole appearance for England came in an unofficial game against Wales in 1945.\n22. Andres Palop\nAndres Palop achieved the unique feat of winning an international tournament without ever earning a cap.\nSpain's third-choice goalkeeper at Euro 2008, the former Valencia, Villarreal and Sevilla goalkeeper never did make an appearance for La Roja. But he's still a European champion. Not bad.\n21. Carlo Cudicini\nCarlo Cudicini was Chelsea's first-choice goalkeeper in the early 2000s until the arrival of Petr Cech and was considered one of the best in the Premier League in his prime.\nCudicini later joined Tottenham and played internationally at Under-18 and U-20 level but, in a great era of Italian goalkeepers, he never won a full cap for the Azzurri. His father, Fabio Cudicini, was also a highly regarded goalkeeper in the 1960s for Roma and AC Milan – but he did not win a cap for Italy either.\n20. Craig Johnston\nCraig Johnston was born in South Africa to Australian parents and moved to England as a 17-year-old for a trial with Middlesbrough.\nThe midfielder went on to win a host of trophies with Liverpool in the 1980s, including five First Division titles and a European Cup. Internationally, he appeared twice for England's Under-21s.\n19. Arsenio Erico\nArsenio Erico is the all-time top scorer in Argentine league football, with 295 goals in 325 games for Independiente across two spells in the 1930s and 1940s.\nConsidered Paraguay's best-ever player, Erico was named as an inspiration by the great Alfredo Di Stefano, but his only international appearances came in a Red Cross touring team.\n18. Gunnar Andersson\nGunnar Andersson was born in Sweden but became famous in France, starring for Marseille in eight successful years at the Stade Velodrome.\nThe prolific striker remains the club's all-time top scorer to this day, with 194 goals. He played just once for France B in 1956 and died at the age of 41 while on his way to the Stade Velodrome to watch Marseille play Dukla Prague.\n17. Breno\nBreno signed for Bayern Munich after impressing in his homeland with Sao Paulo, but his time in Germany was troubled and ended in disgrace after a suspicious fire at his villa resulted in a charge for arson and a jail sentence.\nFollowing his release in 2013, the centre-back struggled to rebuild his career in Brazil and failed to live up to the early promise which had seen him feature and win a bronze medal with his nation at the 2008 Olympics.\n16. Agostino Di Bartolomei\nAgostino Di Bartolomei was an elegant deep-lying playmaker who could operate as a sweeper or in central midfield.\nA Serie A winner and three-time Coppa Italia champion with Roma, Di Bartolomei was also a runner-up to Liverpool in the 1984 European Cup final. He suffered from clinical depression and tragically took his own life 10 years later on the anniversary of Roma's loss to the Reds on penalties.\n15. Stefan Klos\nA two-time Bundesliga winner with Borussia Dortmund, goalkeeper Stefan Klos was also in the team which claimed the Champions League in 1996/97.\nKlos went on to win a further 10 trophies at Rangers, including four Scottish Premier League titles. Internationally, he represented Germany at Under-21 and U-23 level, but never won a full cap.\n14. Dario Conca\nDario Conca may not be a household name, but the Argentine midfielder was once the third highest paid player in the world after Lionel Messi and Cristiano Ronaldo.\nConca was on huge wages after signing for Guangzhou Evergrande from Fluminense in 2011 and later returned to China with Shanghai SIPG after a spell back in Brazil. Capped only at Under-20 level by Argentina, he considered playing for Brazil but ultimately was not selected for a senior appearance with either nation.\n13. Nicola Amoruso\nNicola Amoruso played for 14 clubs in a long career and scored 113 Serie A goals in 380 appearances.\nBest remembered for his time at Juventus, where he won three Serie A titles and was a Champions League runner-up, Amoruso appeared four times for Italy's Under-21 side but never did win a cap for the senior side.\n12. Steed Malbranque\nSteed Malbranque was born in Belgium to French parents and was a runner-up with France in the Under-21 European Championship in 2002.\nThe former Lyon, Fulham and Tottenham midfielder was called up by France's senior side in 2004 and 2012, but did not get on the pitch either time. He also expressed an interest in playing for Belgium, but their coach Aime Anthuenis claimed he was ineligible.\n11. Sergio Brio\nSergio Brio was a rugged centre-back who played alongside Gaetano Scirea, Claudio Gentile and Antonio Cabrini in a legendary Juventus back line.\nHe won four Serie A titles with Juventus and is one of a select group of players to have claimed all UEFA club competitions. A member of Italy's Olympic squad in the late 1980s, he never did play an official match for the senior side.\n10. Delio Onnis\nDelio Onnis was born in Italy but moved to Argentina at an early age, gained citizenship and started his career with Buenos Aires-based club Almagro.\nBut the striker was best known for his time at Monaco. He became one of the club's best-ever players and was Ligue 1 top scorer in 1975, 1980, 1981, 1982 and 1984. He remains the competition's highest scorer to this day. During his career, Argentina favoured footballers playing domestically.\n9. Arthur Rowley\nArthur Rowley started his career at Manchester United and was the younger brother of Red Devils' forward Jack Rowley.\nHis 434 goals from 619 league games is a record to this day. He had long and successful spells with Leicester City and Shrewsbury Town, but was never capped by England.\n8. John McGovern\nCaptain of the Nottingham Forest side which won the European Cup twice under Brian Clough, John McGovern also collected league titles with the Reds and Derby County before that.\nThe midfielder made over 300 appearances for Forest and more than 200 for Derby but received little recognition from Scotland, winning just two Under-23 caps in 1972 and 1973.\n7. Dario Hubner\nAfter spending most of his career in Serie B, Dario Hubner impressed in Italy's top flight with Brescia and Piacenza in the early 2000s.\nHubner, an Italian striker of German heritage, became the oldest top scorer in Serie A history when he netted 24 goals in the 2001/02 season at the age of 35. He never did earn a cap for Italy, though, and Luca Toni later finished as top Serie A scorer at 38 years old in 2015.\n6. Gabi\nAn indefatigable central midfielder and symbol for Atletico Madrid in Diego Simeone's early years in charge, Gabi helped the Rojiblancos win a number of trophies – including La Liga in 2014 – in over 400 appearances across two spells.\nPicked by Spain at Under-20 and U-21 level, Gabi found himself behind an array of talent in a golden generation of midfielders for La Roja and he never did win a senior cap.\n5. Jimmy Case\nJimmy Case enjoyed huge success at Liverpool in the late 1970s and the start of the 1980s, winning three European Cups and four league titles with the Reds.\nThe midfielder went on to play for Brighton and Southampton, but his talents were never recognised by England. He made just one appearance with the Under-23 side in 1976.\n4. Steve Bruce\nSteve Bruce played over 400 matches for Manchester United between 1987 and 1996 and as club captain, he was a big part of the team's success in the early years under Alex Ferguson.\nOne of the best central defenders in the country at that time, Bruce had earlier featured for England Youth and won a cap with England B in 1987, but was kept out of the reckoning by the likes of Des Walker, Mark Wright, Martin Keown, Terry Butcher and Tony Adams.\n3. Tomas Carlovich\nThere is hardly any footage of Tomas Carlovich playing football still in existence, but those who saw him speak wonders of his talent. Diego Maradona said he was better than him, while Marcelo Bielsa used to watch him every weekend in Rosario.\nCarlovich shone in a selection of Rosario-based players against Argentina ahead of the 1974 World Cup and had to come off at half-time with the scores at 3-0 to avoid further humiliating the national team. Former Argentina coach Cesar Luis Menotti later claimed to have called him up, saying that the midfielder went fishing instead. That was denied by Carlovich, who never played for a big club and preferred to live a humble life. He passed away in 2020 after being beaten and assaulted by a youth who stole his bicycle.\n2. Paolo Di Canio\nOne of an array of exciting attackers in Italy in the 1990s and early 2000s, Paolo Di Canio never featured for the Azzurri at senior level.\nDi Canio impressed in spells at Lazio (twice), Juventus, Napoli and AC Milan, while also featuring for West Ham, Sheffield Wednesday, Charlton Athletic and Celtic. He was capped nine times at Under-21 level and once by Italy B. But with players like Roberto Baggio, Alessandro Del Piero and Gianfranco Zola around, his path to the first team was blocked.\n1. Mikel Arteta\nMikel Arteta appeared regularly for Spain's youth sides and can consider himself hugely unfortunate never to have won a full international cap for La Roja.\nHad he played at another time, the Basque would have been picked and perhaps even key, but he was around in an era when Spain were blessed with extraordinary players in their midfield. With the likes of Xavi, Andres Iniesta, Cesc Fabregas, David Silva, Santi Cazorla all ahead of him, the former Arsenal and Everton midfielder never did win a cap. England even asked FIFA if he could play for them after a long career in the Premier League, but their request was turned down.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 2629,
  "scraped_at": "2026-02-14T01:56:44.627186",
  "_text_extracted": true
}