{
  "article_id": "51f423e331a4",
  "url": "https://metro.co.uk/2024/10/30/cole-palmer-names-premier-league-star-toughest-opponent-21892741/",
  "title": "Cole Palmer names Premier League star as his  toughest opponent  ",
  "date": "20241030T203000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea and England star Cole Palmer has named Liverpool defender Virgil van Dijk as his ‘toughest opponent’.\nPalmer has taken the Premier League by storm since joining Chelsea in a £40m move from Manchester City in the summer of 2023.\nThe 22-year-old scored 25 goals during his first season at Stamford Bridge, with his sensational form earning him a call-up to the England squad for Euro 2024.\nPalmer’s form shows no sign of slowing down, with the playmaker – who is contracted to Chelsea until 2033 – already scoring seven goals and making five assists in nine Premier League games this season.\nAnother player who has made a superb start to the 2024-25 campaign is Van Dijk, who Palmer rates as his ‘toughest opponent’.\nVan Dijk has established himself not only as a Liverpool legend but an all-time Premier League great since arriving at Anfield in 2018.\nThe Netherlands international was a key member of the Jurgen Klopp team that ended Liverpool’s long wait for a Premier League title and lifted the Champions League trophy either side of two runs to the final.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nVan Dijk has been named in the Premier League Team of the Year four times in the last six seasons and finished runner-up for the Ballon d’Or in 2019.\nLiverpool boast by far the best defensive record in the Premier League so far this season, Arne Slot’s side conceding just five times as they look to rival Manchester City and Arsenal for the title.\nLiverpool are one of the few Premier League clubs Palmer is yet to score against. In five games against the Reds he has also yet to register an assist.\nChelsea suffered only their second defeat of the season against Liverpool a week and a half ago and Palmer struggled to make an impact.\nHe produced an influential performance in Sunday’s 2-1 win over Newcastle United, however, scoring the second-half winner and playing a sensational pass in the build-up to Nicolas Jackson’s opener.\nAsked about Palmer’s influence at Stamford Bridge in the aftermath of the Premier League win, Chelsea boss Enzo Maresca said: ‘I’m very pleased, especially because I can see him enjoying himself.\n‘That is the most important thing that they can enjoy playing football. This is the first thing and then you can see he is continuing to improve; no matter which position he is playing.\n‘The other day, he was playing in a different position in a different part of the pitch and he did fantastic.\n‘He has to work hard but also enjoy it. They decide to be football players, to be happy and enjoy that moment. They just have to continue doing that.’\nPalmer’s form since arriving in west London has been so good he has the potential to win the Ballon d’Or in the future, according to Chelsea hero Gianfranco Zola.\n‘The pass he made to Pedro Neto for the first goal – it was a brilliant pass,’ Zola recently told the Daily Mirror.\n‘I see a lot of things like this that I used to work on in his game. Being able to see the pass before you receive the ball. That is one skill he is developing a lot.\n‘I saw this skill a lot yesterday and I am impressed because the majority of players, they want to be able to do something when they have received the ball.\n‘But actually, if you know what you are going to do with the ball before you receive it, it is like you are putting yourself ahead of the opposition.\n‘I was really impressed with him. I promise you that one of the biggest compliments I can pay to a player is this type of quality.\n‘He needs to work a lot on his game, of course, because he is still young and there are things that can make him better.\nMore Trending\n‘One thing for sure he can work on is his physique. He can get a little bit faster and maybe a little bit stronger in one-on-ones. I know his mind is very quick. He will have to get his body a little bit quicker.\n‘But seeing him when he first played for Chelsea and seeing him now, I can see how much ground he has covered, I can see him also covering other ground.\n‘If he does that, he can be in contention for the Ballon d’Or because the numbers and the skills are there. There is still work to do but potentially he can do that.\n‘He has a very, very good coach to work with in Enzo Maresca and I am sure he will make sure he works on that.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal target talks up big move after rejecting summer Premier League offer\nMORE: Gary Neville says Erik ten Hag made ‘two of the worst signings in Manchester United’s history’\nMORE: Jurgen Klopp responds to criticism after taking controversial new Red Bull job",
  "word_count": 895,
  "scraped_at": "2026-02-14T01:51:57.630002",
  "_text_extracted": true
}