{
  "article_id": "520753ca1e43",
  "url": "https://www.dailymail.co.uk/news/article-13529941/Hilarious-moment-German-TV-host-finds-really-Scotland-fans-kilt-Tartan-Army-fans-hit-steins-ahead-tonights-Euro-2024-opener.html",
  "title": "Stunned German TV host finds out what is REALLY under a Scotsman kilt during live Euros coverage ... ( and immediately regrets it !) ",
  "date": "20240614T110000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Germany v Scotland kicks off at 8pm UK time tonight as Euro 2024 begins\n- Are you a Scotland fan in Germany and do you know the fan whose manhood was exposed? Email: tips@dailymail.com\nIt's a long-held observation that you should never ask a Scotsman what's under his kilt.\nBut that tradition was ignored by one German TV host, who was left extremely red-faced after a major wardrobe malfunction live on air.\nWhile covering the build-up for Euro 2024, an unsuspecting presenter for Welt TV saw a lot more of the Tartan Army than he bargained for.\nSteffen Schwarzkopf was reporting live scenes of beer-guzzling, kilt-wearing fans drinking in the streets and decided to approach one group.\nBut the TV segment soon descended into mayhem when they planted a sticker on the reporter's head and chest.\nAs they continued chanting and drinking, one of the fans decided to play a prank by lifting up a fan's skirt and proving what we all know to be true about what's underneath a kilt.\nBut despite having his manhood exposed live on air, the fan didn't seem to mind and laughed along with his friends.\nThe camera quickly zoomed back to Mr Schwarzkopf who appeared rather embarrassed and shielded his eyes with his hands, sparking hoots of laughter by the raucous bunch.\nThe group are among thousands of Tartan Army fans who headed to Munich for the opening clash against Germany tonight.\nThousands more will watch from home as Scots try to will the national men's football team on to victory as they take on Germany in tonight's Euro 2024 opening match.\nLISTEN TO THE EUROS DAILY PODCAST:\n- LISTEN: On today's EUROS DAILY - Should England drop Bellingham?\n- EUROS DAILY: Why Gary Lineker is WRONG about journalists\n- Are Harry Kane and Declan Rice right to bite back at Gary Lineker?\n- LISTEN: Do Portugal need Cristiano Ronaldo or are they scared of him?\n- LISTEN: On today's EUROS DAILY, what's happening with Harry Kane?\nA man is seen on the TV station Welt wearing a Germany shirt and a kilt in Munich yesterday\nOne of the Scotland fans then lifts up the man's kilt and exposes his genitals live on television\nWelt chief reporter Steffen Schwarzkopf says 'oh my God' after the fans lift up the kilt last night\nThe Scotland fans were in a raucous mood as they had a party in Munich yesterday evening\nThe fans also put a sticker on the shirt of Welt chief reporter Steffen Schwarzkopf in Munich\nThe man whose kilt was lifted up was wearing a Germany shirt but it was not immediately clear who he is supporting.\nScotland fan Cameron Angus, 25, was in the group of supporters in Munich around the fan.\nThe recruiter from Glasgow revealed to MailOnline that none of the group knew the man - and they hadn't seen him since.\nMr Angus said: 'We're obviously in Munich and there's journalists and media with microphones wanting to talk to our pals.'\nHe told how Welt chief reporter Steffen Schwarzkopf was among the broadcasters who approached them in the square.\nMr Angus continued: 'A guy came up to us and we gave him a bit of banter and stuck a sticker on his head.'\nThe presenter then began his broadcast and one of Mr Angus's friends lifted up the man's kilt.\nBut he added: 'The guy whose kilt got lifted, we don't know who he is - he's just a random guy. I think he must have been Scottish with the kilt on.'\nMr Angus said that after the broadcast, Mr Schwarzkopf 'kind of shook his hand and he was laughing a bit but he did look a bit concerned'.\nThe fan added that he woke up this morning to a 'billion messages from everyone', and heard someone claim that the man has a wife and daughter.\nMr Angus said scenes in Munich were 'chaos', adding that the ratio between Scotland and fans and German fans was about 7-1 and it is 'just a sea of kilts as blue'.\nHe said had bought a one-way ticket to Germany, and knew most of the people in the video, but added: 'It's just coincidence that the guy whose c**k came out, no one knows.'\nSpeaking about the experience of being in Germany, Mr Angus - who has a ticket for tonight's match - said: 'We've been really building up to this tournament. For us we just want to be there.\n'I'm 25 and this is the second Euros I've seen us in. Just being here is magic and to get some sort of result tonight, a draw, would be unbelievable.'\nMailOnline has translated what Mr Schwarzkopf told viewers in German during the report.\nOne hilarious video showed a plane full of Scots on the way to Munich - with one lone woman with her headphones on in the middle, looking thoroughly miserable\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFormer First Minister of Scotland Alex Salmond with Scotland fans in Munich this morning\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA police officer looks away from the legs of a Scotland fan wearing a kilt in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nHe said: 'Really, really traditional, I would say. I'm not just talking about their football jerseys, but naturally also about the Scottish skirts, the kilts, that are worn here.\n'They are part of it. What is surely also part of it is the beer. But what I also see relatively often - I won't necessarily wear this to the game tomorrow [as the reporter points to the Scotland sticker a fan stuck to his shirt] - what I also see and think is quite pretty is the Germany jersey on top and the Scottish kilt on the bottom.'\nA fan then pulled up the kilt to reveal the man's genitals, and the reporter said: 'Oh my God.' He then said the shirt and kilt mix 'shows a little bit what the mood is like here and it is, in the end, a pure advertisement for Germany what we can see here'.\nA later report on the Welt website said the presenter 'mingled with the kilt-wearers who had travelled there in a celebratory mood - and gained some deep insights'.\nThe game in Munich is the first of 51 to be played over the next month to decide the next European champions, with the final at Berlin's Olympic Stadium on July 14.\nOne hilarious video showed a plane full of Scots on the way to Munich - with one lone woman with her headphones on in the middle, looking thoroughly miserable.\nIt comes after some outlets in Munich ran out of beer earlier this week - including Woerners' bar in the city's Marienplatz, just hours after some had fans arrived.\nAt London Heathrow Airport this morning, Scotland fan Cameron Moffat, 30, told MailOnline that he was excited to be flying to Munich.\nMr Moffat, who turns 31 tomorrow, said: 'It'll be a bit of a party. First to Munich and then me and my pals are out to Cologne as well.\n'It's a bit expensive but it's not happened for a wee while. I'll see the sights but I imagine it'll be too busy to do anything - plenty of the Tartan Army out there.\n'I have tickets to the Switzerland game but the opener was unaffordable. The Olympic Park fanzone is where we're aiming for. Come on the Scots.'\nAlso at Heathrow today was Scotland fan Ian, 62, who met fellow supporters Alan and Dan on the way to the airport.\nHe said Scotland had a 'very good' chance at the competition and thought there would be a big upset against Germany tonight. 'It's a big one,' he told MailOnline. 'They should be careful what they wish for.'\nGermany are third favourite to win the tournament behind France and England and while the odds appear to be stacked heavily against Scotland beating them, many supporters are hoping their side can take something from tonight's game.\nScotland have never beaten Germany in a competitive fixture and have won only one of their last nine matches - a 2-0 friendly win over minnows Gibraltar at the start of the month.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nSpeaking to a packed media conference at the Munich Arena yesterday evening, manager Steve Clarke said every one of his players was 'desperate' to be picked to play in tonight's clash.\n'Everyone is fully fit, flying, desperate to be selected and ready to go,' he said.\n'The enormity of the opener, however, is a bit of a sideshow and hopefully we don't get too involved in that.\n'It's a difficult game. One of the mantras I've always had is respect everyone and fear no one.\n'We have respect for the host nation, we know they're a good team but hopefully we can show everyone we're a good team as well.\n'I can enjoy it. I've been lucky enough to be involved in big matches, the Champions League final for example, it was nice to be involved in the last Euros.\n'I can enjoy it, but I'll enjoy it even more once we've got four points on the board.'\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nGermany fans play football at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes on a train heading from Berlin to Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans pose with a football at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nIt is the second successive Euros for the Scots under Clarke and he said: 'I think we should all be proud that we're here.\n'It's been a long time since 1998 when we actually travelled abroad to appear in a tournament like this.\n'That's why everyone is so excited. We're proud we've been able to do back-to-back European Championships and hopefully by the end of this we'll be even more proud at having done something a little bit more special in regards to Scottish football.'\nAsked about Germany, who are unbeaten in four games this year after an unconvincing 2023, Clarke said: 'They're a good team, I think people were trying to talk them down a little bit.\n'I think Julian Nagelsmann found, like I did, it takes a while to find your best squad and team formation.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nMayor of Munich Dieter Reiter with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nA Scotland fan plays the bagpipes at a train station in Munich in Germany today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland and Germany fans pose for a photo with a replica trophy at Marienplatz square today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fan Cameron Moffat, 30, at London Heathrow Airport today on his way to Munich\n'When the draw was made I expected it to be a tough game and nothing has changed my mind.'\nClarke admits the invasion of the Tartan Army will 'give us a big boost'.\nThe former Kilmarnock and West Brom boss added: 'They're going to be behind us in every minute of every game and that's really important for us.\n'We've had a little taste of it already at our base in. I'm sure there will be a few around in Munich tonight that we won't see. We hope they will enjoy themselves and behave themselves.'\nFirst Minister John Swinney, who will be attending the match, told Holyrood during First Minister's Questions yesterday it was 'great to see Scotland back in Europe where we rightly belong'.\n'As First Minister I want to wish Steve Clarke's team the best of luck and wish the huge numbers of Scotland supporters making the journey a safe and memorable trip,' he said.\nFootball fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans pose at Marienplatz square in Munich this morning\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nA Scotland fan plays the bagpipes after disembarking from a train in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\n'I know the Tartan Army will be an absolute credit to Scotland. I know the team will be a credit to Scotland because they have inspired so many of us by their success in getting to Euro 2024.'\nScottish Conservative leader Douglas Ross, Scottish Labour leader Anas Sarwar and Scottish Liberal Democrat leader Alex Cole-Hamilton also wished the team good luck ahead of kick-off.\nCaptain Andy Robertson said he wants Scotland to achieve 'legendary' status by reaching the knockout stages of Euro 2024.\nScotland sides have played at eight World Cups and three European Championships without being able to get past the first stage.\nSteve Clarke's side reached the 2020 Euros - the first major tournament for the country since the 1998 World Cup in France - but again fell short by losing to Croatia and the Czech Republic either side of a goalless draw with England at Wembley.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nFootball fans at the Marienplatz in Munich today ahead of tonight's match in Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nLiverpool left-back Robertson, who revealed he is in a good place physically and mentally after a scare in training on Monday, was bold in his ambitions at a media conference at the Munich Arena yesterday.\nHe said: 'The first Euros was massive for us, now we want to compete. Last time we felt in the England game we did pretty well but let ourselves down in the other two or thought we could do a bit better.\n'We don't want to have any regrets this time. What's the worst that can happen? We go into a long list of teams that have failed to make it out the group so let's start from that point and move on from it.\n'We believe we can be the team to make history. We have put ourselves in a good position by qualifying first and foremost and let's see what we can do.\n'We're excited by the challenge, we're excited about what's ahead and if we perform the way I know we can perform then I'm confident we can make history.\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans at the Marienplatz in Munich today ahead of tonight's match with Scotland\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nA Scotland fan plays the bagpipes after disembarking from a train in Munich today\nA Germany fan on an escalator in Munich today ahead of the match with Scotland tonight\nGermany fans play football at Marienplatz square in Munich this morning\nPresenter Laura Woods with Scotland fans at Marienplatz square in Munich today\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nGermany fans at the Marienplatz in Munich today ahead of tonight's match with Scotland\nScotland fans at the Marienplatz in Munich today ahead of tonight's match with Germany\nScottish supporters (left to right) Ian, Alan and Dan head out to Germany from Heathrow today\nScotland fans at Glasgow Airport this morning as they head to Germany for Euro 2024\n'We know what is at stake. As I said, what's the worst that can happen? You join the list of good Scotland teams that failed to make it out the group.\n'The flipside to that is we can be the first team to do that.\n'We have lots of incentives to do well but that is the main one, to become a legendary squad, the first team to make it to the knockout stages.\n'That is driving us forward but we are in a difficult group and we have to be at our best to have a chance of doing that.'\nAre you a Scottish fan heading out to Germany? Email: tips@dailymail.com\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Food vlogger dies after 'eating toxic devil crab'\n- New video shows man with backpack similar to Guthrie kidnapper\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Moment Swiss bar fire owners collapse after being confronted\n- Moment driver veers to target e-bike riders before killing teen\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Chilling police interview of ISIS fanatic plotting UK attack\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named",
  "word_count": 3644,
  "scraped_at": "2026-02-14T01:48:52.512455",
  "_text_extracted": true
}