{
  "article_id": "52082d4b1ea3",
  "url": "https://metro.co.uk/2025/07/12/viktor-gyokeres-speaks-arsenal-offer-reveals-important-transfer-wish-23644381/",
  "title": "Viktor Gyokeres speaks out on Arsenal link and reveals  important  transfer wish | Football",
  "date": "20250712T113000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Viktor Gyokeres says he wants to return to the Premier League but insists he will only join a club ‘who really wants me’ following interest from Arsenal and Manchester United.\nArsenal have held extensive talks with Sporting CP to sign Gyokeres this summer but have so far been unable to reach an agreement with the Portuguese club.\nManchester United and Juventus have also approached Gyokeres this summer but the 27-year-old has told both clubs that Arsenal is his preferred destination.\nHowever, Sporting are standing firm over their €80 million (£68.6m) asking price and have been upset by claims from Gyokeres’ agent that a private agreement had been reached to sell the striker for €60m (£51m) plus €10m (£8.5m) in add-ons.\nGyokeres is now attempting to force through a move by refusing to report back to pre-season training with Sporting this weekend and the Portuguese champions are now exploring disciplinary proceedings.\nWhen asked about his future in an interview with France Football, Gyokeres said: ‘It’s football, you never know. I’m not thinking about it, we’ll see what happens.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘If something is going to happen, it will happen. The most important thing for me is to play for a club that really wants me.’\nHowever, Gyokeres made it clear that he is keen to return to the Premier League after failing to make an impact at Brighton.\n‘It’s one of the biggest leagues in Europe,’ Gyokeres said.\n‘I spent several years there without being able to play a single match. So, of course, it’s something I would like to do. It would be a great revenge.’\nGyokeres made his debut in the Champions League last season and impressed in Europe’s elite competition with six goals in eight appearances for Sporting, including a hat-trick in the 4-1 win at home to Manchester City last November.\nWhen asked if any players have impressed him during Sporting’s Champions League run which ended with a 3-0 aggregate defeat to Borussia Dortmund in the knockout phase play-offs, Gyokeres replied: ‘Yes, of course, there were a lot of players who impressed me.\n‘When we played against City and Arsenal you could see the quality that they have in the squad is amazing. You could see the midfielders like Bernardo Silva, [Mateo] Kovacic, Arsenal with [Bukayo] Saka.\n‘Centre-backs that I played against – Gabriel Magalhaes and William Saliba, very good players, good to play against those kind of players.’\nGyokeres also believes he ranks among the top strikers in the world alongside Erling Haaland, Harry Kane and Robert Lewandowski.\n‘I’m definitely one of them,’ Gyokeres said.\n‘It’s difficult to rank me but yes, I’m at the same table as them now.\n‘What I managed to do at Sporting, I’m convinced I can do anywhere. You haven’t seen the best of Gyokeres yet.’\nMore Trending\nGyokeres, who scored 54 goals in 52 appearances last season, also dismissed suggestions that his scoring record at Sporting is inflated because he is playing in Portugal.\n‘That’s just people’s opinion. And I don’t care,’ Gyokeres said.\n‘I know what I’ve achieved here, I’ve always done my best.\n‘It’s a very good league, with a lot of technical players. Maybe less physical than England, but with a really good level.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: How much Man Utd get from Anthony Elanga transfer as he seals Newcastle move\nMORE: Liverpool confirm plans for Diogo Jota’s no20 shirt after his tragic death\nMORE: Enzo Maresca sends message to Noni Madueke with Arsenal move ‘hours away’",
  "word_count": 651,
  "scraped_at": "2026-02-14T01:49:44.681145",
  "_text_extracted": true
}