{
  "article_id": "5231fc5cfd4d",
  "url": "https://www.dailymail.co.uk/sport/football/article-12482771/Man-United-spent-combined-402-5M-likes-Pogba-Antony-Maguire-Sancho-Lukaku-got-business-wrong.html",
  "title": "Man United have spent a combined £402 . 5M on the likes of Pogba , Antony , Maguire , Sancho and Lukaku but have almost NOTHING to show for it ... how have they got their business so wrong ? ",
  "date": "20230905T223000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man United have spent a combined £402.5M on the likes of Pogba, Antony, Maguire, Sancho and Lukaku but have almost NOTHING to show for it... how have they got their business so wrong?\n- Paul Pogba is Man United's all-time record signing at £89million from Juventus\n- None of the club's top-five most-expensive acquisitions have been successful\n- Listen to the latest episode of Mail Sport's podcast It's All Kicking Off\nManchester United may be the most successful team in Premier League history, but there is a strong argument that as dominant as they were in the 1990s and early 2000s, they have been just as bad when it comes to spending big in the transfer market.\nNowhere is that more clear than in the comparative success of their five record transfers; Paul Pogba (£89million), Antony (£85.5m), Harry Maguire (£80m), Romelu Lukaku (£75m) and Jadon Sancho (£73m).\nGranted there are a number of mitigating factors in these players' defence. One, they are playing at the club in a time of great turmoil for the most part, as the Red Devils look to reinvent themselves with vary degrees of success following the departure of the messianic Sir Alex Ferguson.\nSecondly, the club's greatest success came under the aforementioned Ferguson in an era built on developing talent that they had nurtured themselves, rather than acquired from elsewhere. Thanks to the famous 'Class of '92' there are perhaps no sides more famed for their academy products.\nBe that as it may, though, United's recruitment has on the whole been poor, particularly when it comes to bringing in landmark signings. In recent seasons, there have not been many big-money acquisitions that have really set the club on fire, barring Bruno Fernandes, Raphael Varane, Casemiro and perhaps Christian Eriksen.\nPaul Pogba is Manchester United's all-time record signing at £89million from Juventus in 2016\nHarry Maguire's time at United has seen a dramatic downturn in performances in recent years\nAntony - the second-most expensive United signing of all-time was made under Erik ten Hag (pictured)\nFor a combined £402.5m - £66m more than Manchester City spent in the last two seasons on nine players including Treble-winners Erling Haaland and Manuel Akanji - United's record purchases have returned a grand total of five trophies between them, three of those being last season's Carabao Cup.\nIt's not just by the metric of silverware that the unfortunate quintet can be judged to be failures, either. Sancho is now at loggerheads with Erik ten Hag, Lukaku was regularly mocked by his own fans, Pogba consistently failed to deliver on the promise and price paid for his prodigal return, and Maguire, well, you could write a Shakespearean tragedy on the England defender's time at Old Trafford.\nEven Antony's future is now uncertain, amid allegations of domestic abuse and threatening his ex-girlfriend, with United yet to comment on the situation. It begs the question - how, at one of the biggest clubs in the world with one of the most illustrious reputations and scouting departments, have United got things so wrong, so consistently?\nPaul Pogba - £89m from Juventus in 2016\nIn terms of falling short of expectation, Pogba perhaps outranks his fellow United recruits. It is not beyond reason to suggest that a world record fee might bring something close to a world-class performer, but any United fan will tell you that the Frenchman fell far short of that.\nPogba had erupted through the ranks at Juventus to become the premier midfielder of his generation, but failed to deliver the big prizes that he claimed he was ready to win on his return. His performances for France infuriatingly went from strength to strength as he became the focal point of Les Bleus' World Cup success at Russia 2018.\nThe message was pretty clear to see - Pogba was still the player United broke the banks for, just not when playing for them.\nIn terms of his performances on the pitch, the numbers suggest Pogba's time at United was decent, with 90 goal contributions in 233 games as a slightly more progressive midfield pivot in a two-man unit behind the front four.\nWhat was missing was the flashes of breath-taking brilliance he showed at Juventus - the long-range goals, the snippets of skill, the effortless, swaggering control that let him boss the game.\nThere are certain things in a footballer's career that they cannot avoid, with injury being the chief among those. In many ways, Pogba might claim that his body robbed him of a better career at United, spending 531 days on the treatment table during his time at Old Trafford.\nPocketing a £3.8m loyalty bonus on his way out the door for seeing out the entirety of his contract left a bitter taste in fans' mouths, but by that time the overall feeling was that the player's opportunity to show his quality was long gone.\nIt speaks volumes to the inefficacies of United's record captures that Pogba is the most decorated of the five, with two whole trophies (the Europa League and Carabao Cup in in 2016-17) since his return.\nPogba's time at United was consistently punctuated by injuries particularly in the latter stages\nAntony - £85.5m from Ajax in 2022\nAntony's future is shrouded in uncertainty, with the player now dropped from Brazil's international squad amid allegations of domestic abuse and threatening his ex-girlfriend, with United yet to comment on the situation.\nBut his future aside, his past at the club has hardly been electrifying. Just eight goals and three assists from 48 games - as well as a raft of internet memes about fidget spinners - to show for the huge outlay plants him firmly in the territory of 'poor return on investment'.\nThere is a different dynamic to Antony's transfer fee that is missing from the other four names. While the others had already made names for themselves in one of Europe's top five leagues, and had a fair amount of international experience, Antony arrived at Old Trafford with little more than Ten Hag's word in his favour.\nAt Ajax he had shown himself capable of putting in truly enthralling performances, but lacked the cutting edge that separates the great from the good. Antony managed only eight goals and four assists in 2021-22 in Amsterdam.\nA player cannot control their transfer fee, and in a sense a player that has never truly shown themselves to be a prolific goal scorer cannot be judged to have fallen short of expectations in that respect. What a fan might expect, though, is to have seen that player truly impose themselves on games.\nOf his 48 games it is hard to pick many out as 'Antony's game' since his debut against Arsenal, scoring after 35 minutes, but even then it is a match best remembered for poor substitutions on Mikel Arteta's part and a questionable VAR call.\nFailing that, a winger that might not have a natural eye for goal can assert themselves through weight of assists - once more, though, the numbers would suggest that this is not where Antony's strengths lie.\nThe Brazilian is young, and it shows in his play. There is so much left for the player to give at United, and plenty of room for development that he cannot be dubbed a flop after just 12 one season. But things will need to change fast this term for him to be considered in any way, shape or form a successful signing.\nAntony has struggled to impress at United since arriving on an £85.5m deal from Ajax in 2022\nThe Brazilian is facing an uncertain future at United amid allegations of abuse and threat from ex-girlfriend Gabriela Cavallin\nHarry Maguire - £80m from Leicester in 2019\nAt times it seems as though Maguire must be the most unlucky footballer in the game, the way his United career has been constantly plagued by setbacks, misfortune and above all overwhelming pressure.\nThe England defender's shortcomings have become so infamous now that his early spell at the club has been overlooked, and when you look at the numbers, it was a pretty successful first campaign for United.\nIn 58 games Maguire helped to keep 24 clean sheets as United finished third and qualified for the Champions League, and midway through the season, he was named the new captain at the club. He was by no means viewed as the long-term heir to Roy Keane's armband, but having played every single minute of the campaign - the first outfield United player since 1995 to do so - there were few better candidates.\nBut the starting point for his demise at the club came that summer, when he was arrested on holiday in Mykonos. Since his return from the Greek island frequented by the sport's partying stars his game on the field has been far more fragile and the confidence he played with prior to that has been nonexistent.\nIn the two years following that nightmare for the player, he has been stripped of the captaincy at the club, dropped to fourth-choice centre back, and become something of a pantomime fool at Old Trafford.\nEvery deflection off his back seems to find the bottom corner, every pass out the back is into the path of an opposition attacker, and every clearance goes for a corner rather than a throw. The impact on his presence in a game is evident, and it has brought with it an unrelenting pressure and spotlight that he has been unable to shake off.\nNow the one-time stubborn backbone of the side has been relegated to the bench, the furore surrounding his every move has only increased, and although he can't get a sniff for his club, he remains a staple of Gareth Southgate's England side.\nIt is hard to see a way back for Maguire at United. An exit to West Ham broke down despite a £30m fee being agreed between the clubs, and it seems it was his best chance to get himself in the England squad on merit, rather than simply being handed a call-up next summer due to having excelled in the past.\nHarry Maguire has been plagued by misfortune since a high-profile incident in Mykonos in 2021\nMaguire is now fourth-choice centre back at United and has had the armband taken away\nRomelu Lukaku - £75m from Everton in 2017\nLukaku's United career was a very strange one. In his first season - at least the first half of the first season - the Belgian looked the answer to many fans' prayers for a proper, robust yet effective No 9.\nA return of 22 goals from 45 games in all competitions was fantastic. It might not be £75m levels of fantastic, but maybe for £50m that sort of return would've had fans chanting his name for all the right reasons. Take away the money, and Lukaku was a good performer for United.\nHis second season, however, saw only 15 goals from 45 games, and patience really start to wear thin. It wasn't just that he was struggling in front of goal, but his fitness he was plagued by poor form; his fitness was suffering, question marks - and memes - were raised over his first-time control, and with perceptions arising that he was suffocating development time for Anthony Martial and Marcus Rashford, he was erroneously played out wide.\nIn 32 games in the Premier League, he would score 12 goals, but six of those would come in three games, meaning he only actually got on the score sheet in nine games across the league season. The player was struggling to have an impact on games in the way that he had shown himself capable of at Everton, where he regularly gave left backs nightmares coming off a wide-right position to wreak havoc.\nLukaku's time at United yielded no trophies - something that undoubtedly plays a massive part in the perception of his time at the club. Really, he did little wrong at Old Trafford; he was played out of position by Ole Gunner Solskjaer, and suffered the same dips in form that any player at a club bereft of confidence and identity would have.\nIt didn't help that much like Pogba with France, he continued to thrive with Belgium, for whom he is the all-time record goal scorer. The finger when it comes to Lukaku should perhaps not be pointed at the player, but more so at the manager, system and culture at the club, for whom he was ultimately a poor fit.\nRomelu Lukaku had initially impressed on arrival at United but was later played out of position\nJadon Sancho - £73m from Borussia Dortmund in 2021\nThe former Dortmund starlet came to United to take his career to the next level having thrived at the Bundesliga's perennial silver medallists, but if anything he has regressed if his on-pitch performances are anything to go by.\nAt the German club, Sancho was the toast of England's future, scoring goals for fun and never far from the action, beaming from ear to ear all the while. Show the player a highlight reel of his best performances in Germany, and perhaps even he won't recognise the player that is currently at odds with Ten Hag.\nSince his arrival at Old Trafford two summers ago, the player has managed only 12 goals and six assists in 82 appearances, and has been dropped from the side on two occasions.\nThe first time came in a bid to help him resurrect his career at the club by the Dutch manager, sending him to the Netherlands to train with hand-picked specialists to help Sancho recover the spark that made him so effervescent not so long ago.\nThe second time comes amid reports of poor training performances, lazy time-keeping and sulking over international snubs, with any speculating that his time at the club is over already, before it has even begun.\nHe has already had his own say on the matter, claiming: 'I believe there are other reasons for this matter that I won't go into, I've been a scapegoat for a long time which isn't fair!'\nScapegoat or not, while Ten Hag has objectively improved Man United as a club in the last 12 months, Sancho has shown little sign of developing back into the star that emerged in the iconic yellow-and-black shirt at Dortmund.\nAs with Antony, he has so much more time to turn his career in the right direction, and there is every chance he can do so at United should clear-the-air talks with Ten Hag prove fruitful, but he is a year further down the line than his Brazilian team-mate, and in that sense his race against time is somewhat more desperate.\nJadon Sancho's place in the Man United squad is under threat after Ten Hag claimed his training performances have been sub-par\nMost watched Sport videos\n- Disgusting drink act caught on camera at ICC T20 World Cup\n- Tiffany Salmond dazzles in red bikini at Bondi Icebergs\n- IOC President in tears after Ukrainian athlete is kicked out\n- Viral Man United fan reacts to draw extending 493-day streak\n- NBA player makes long-awaited debut after battle with cancer\n- Team USA skier Breezy Johnson gets engaged after crash\n- Aussie snowboarder Scotty James shows off his dance moves\n- Super Bowl Champ wears Sam Darnold t-shirt with middle finger up\n- Has VAR broken football? Arsenal fan grills Mark Clattenburg\n- Alisa Camplin provides an update on Cam Bolton\n- How Deontay Wilder CAN recover from Tyson Fury losses\n- Stephen A. Smith calls Trump's criticisms of Bad Bunny valid",
  "word_count": 2608,
  "scraped_at": "2026-02-14T02:00:57.139829",
  "_text_extracted": true
}