{
  "article_id": "524b7e0d539c",
  "url": "https://thepeoplesperson.com/2023/01/24/manchester-uniteds-forgotten-man-returns-to-training-to-help-boost-erik-ten-hags-options-258763/",
  "title": "Manchester United forgotten man returns to training to help boost Erik ten Hag options",
  "date": "20230125T001500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ever since the World Cup break, Manchester United’s fixture pile-up is increasing by the day and they now face the prospect of playing 10 games in the space of one month.\nErik ten Hag knows the importance of squad depth ahead of a crucial second-half of the season where United will be fighting on all four fronts.\nWhile a few first-team stars are frustrated at the lack of minutes, a few are slowly regaining fitness and have started training after a long absence.\nOne of them is Axel Tuanzebe, who was spotted in team training earlier this week and is keen to try and impress the Dutch manager.\nPromising United career petering out\nThe centre-back has not played competitively for well over a year, with his last appearance coming for Napoli in a Copa Italia defeat to Fiorentina on January 13, 2022.\nHis last appearance in a United shirt was in the heart-breaking Europa League final loss to Villarreal in May 2021.\nThe 25-year-old was tipped for success by both Jose Mourinho and Ole Gunnar Solskjaer and he put in one of his best performances against Paris Saint-Germain in the Champions League.\nThe United academy graduate also became the youngest player to captain United since Norman Whiteside in 1985, during an EFL Cup victory against Rochdale in September 2019.\nAxel Tuanzebe back training with the group pic.twitter.com/peUCshc8KO\n— academyarena Utd (@academyarenaUTD) January 23, 2023\nBut injuries and poor form have derailed his career with last season being one to forget. It started promisingly back in Aston Villa, where he had shone on loan earlier in his career.\nBut he soon lost his place in the first XI and after playing only 11 times in six months, Tuanzebe decided to take a risk and moved to to Napoli in the Serie A.\nThat proved to be a disaster as the England U-21 international ended up playing only 10 minutes in the league.\nAfter disastrous last season, Axel back in training\nHe was supposed to be part of Erik ten Hag’s pre-season squad but an injury meant he had to fly back to Manchester and recuperate.\nThe defender returned to solo training last month and was placed on a personal training plan at Carrington by the Dutch manager.\nAfter a long time away from competitive football, Tuanzebe was finally back on the grass with his teammates this week. He was pictured jogging and taking part in rondo games.\nAs reported by The Manchester Evening News, he is not expected to go out on loan and will provide the Dutchman extra options in defence.\n“Tuanzebe is expected to remain at the club after the January window to provide extra competition and back-up for senior centre-halves Raphael Varane, Lisandro Martinez, Victor Lindelof and Harry Maguire, as well as Luke Shaw.”\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 560,
  "scraped_at": "2026-02-14T01:53:21.838092",
  "_text_extracted": true
}