{
  "article_id": "524dd024de36",
  "url": "https://time.com/7000067/olympics-2024-paris-gaza-israel-ukraine/",
  "title": "The IOC Wants the Olympics to Be Apolitical . That Impossible",
  "date": "20240718T184500Z",
  "domain": "time.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When French historian Pierre de Coubertin founded the International Olympic Committee (IOC), the governing body of the modern Olympic Games, in the late 19th century, he billed the competition as a peace movement that could bring the world together through sport. “Wars break out because nations misunderstand each other,” he said. Competition, the reasoning went, would foster greater understanding and reconciliation between adversarial countries.\nMore than a century later, Coubertin’s vision hasn’t exactly borne out. Far from bringing an end to wars, the Olympics have been embroiled in and even canceled by them. For while the Games are ostensibly apolitical, the world in which they operate is not. Indeed, authoritarians past and present have used the spectacle of the Olympics for their own political propaganda. And despite Olympic officials’ insistence that the Games be strictly neutral, the IOC has on many occasions made decisions derided by some as partisan—most recently, its move to suspend the Russian Olympic Committee in the aftermath of Moscow’s full-scale invasion of Ukraine.\nThe upcoming Summer Games are poised to be “the most politically charged Olympics in decades,” says Jules Boykoff, an international expert in sports politics. Set against the backdrop of two major ground wars—in Ukraine, where Russia continues to occupy 18% of the country’s territory, and in Gaza, where Israel’s ongoing war on Hamas has leveled much of the Strip and killed more than 37,000 people, according to figures from the enclave’s Hamas-controlled health ministry, which are deemed credible by the U.S. and the U.N.—the 2024 Games, he and others warn, cannot be held in a geopolitical vacuum.\nIf recent international competitions are any indication, they aren’t wrong. From the Eurovision Song Contest to the UEFA Champions League, global events have been subsumed by the wars in Ukraine and Gaza. But the responses haven’t been identical: while Russia was summarily barred from several international tournaments and matches following its 2022 invasion of Ukraine—including the Paris Olympics, where Russian and Belarusian athletes will be permitted to compete only as neutral participants—activists’ calls for Israel to be similarly excluded have largely fallen flat.\nThe IOC, which has previously dismissed such calls on the basis that the situation in Gaza is “completely different,” cites Russia’s violation of the Olympic Charter—specifically, the Russian Olympic Committee’s takeover of regional Olympic organizations in occupied Ukrainian territory—as the reason for its ban. “This situation cannot be compared with any of the other armed conflicts in our world,” an IOC spokesperson tells TIME in an email.\nStill, some critics argue that the IOC’s relative silence on Gaza represents a double standard. For while Israel hasn’t annexed Gaza or taken over its sporting organizations, its military has destroyed much of its infrastructure, including its sports facilities. What little remains, like Gaza’s iconic Yarmouk Stadium, has reportedly been converted by the Israeli military into a space to hold Palestinian detainees, a move the Palestinian Football Association denounced as a “clear violation of the Olympic Charter.” As of late May, the Palestinian Olympic Committee estimated that 300 Palestinian athletes had been killed since Oct. 7, including Palestinian Olympic soccer coach Hani Al-Masdar and karate champion Nagham Abu Samra. For those who have survived, the prospect of sports returning to Gaza is years, if not decades, away.\nSeveral Palestinian athletes have qualified for the Paris Games, along with athletes from Israel, Ukraine, and Russia. (Unlike the others, Russian athletes will not be permitted to compete as a team, nor will they be represented by any flags, anthems, or other national identifications.) What remains to be seen, however, is how the athletes are received, both by other participating teams and by each other. Previous competitions have seen athletes refuse to shake hands, as was the case when Ukrainian Olympic fencer Olga Kharlan snubbed her Russian opponent Anna Smirnova at the World Championships in Milan last summer and, more recently, when the Irish women’s basketball team declined the customary handshake with their Israeli counterparts at a EuroBasket qualifier in February.\n“I think athlete activism will come out in ways we’ve not seen before,” says Shireen Ahmed, a journalist who writes on the intersection of sports and politics. “You will not only get athletes refusing to compete against Israeli athletes, you will get protests in the streets, you will get people talking about divestment. This is going to be incredibly polarizing, and in an event that’s meant to unify, there will be pushback at every level.”\nWhen asked about the prospect of athletes staging political protests or demonstrations during the Games, an IOC spokesperson tells TIME that “athletes cannot be held responsible for the actions of their governments” and that if anything deemed discriminatory does occur, the IOC will work with the national Olympic committee and the international federation concerned to ensure that “swift action” is taken.\nThe spokesperson didn’t delve into specifics, though past instances offer some clues. During the 2021 Tokyo Olympics, Algerian judoka Fethi Nourine was handed a 10-year competition ban over his refusal to face an Israeli opponent. At the same Olympics, American shotputter Raven Saunders made the first podium demonstration when, after being awarded her silver medal, she crossed her raised arms into an X shape, which she said symbolized “the intersection of where all people who are oppressed meet.” Although the IOC investigated the incident, which flouted its ban on athletes staging protests during competition or while on the medal podium, it did not issue any sanctions. “When it comes to dealing with political protests,” Boykoff says, the IOC “has been inconsistent at best.”\nPerhaps that’s because, contrary to Coubetin’s vision, the Olympics have always been regarded both by its host countries and athletes as inherently political events. Such was the case in 1936, when Adolf Hitler used the spectacle of the Olympics into a propaganda tool for his Nazi regime. It was also the case decades later when, during the height of the civil rights movement, American athletes Tommie Smith and John Carlos used a 1968 Olympics medal ceremony to stage a demonstration against racial discrimination in what was perhaps the most famous moment of political speech in the history of the games.\nIn a press conference addressing the potential impact the geopolitical landscape stands to have on the Paris Games, IOC president Thomas Bach referred to Coubertin’s founding credo, noting that in times of conflict it is “more important to have this link and to give this symbol of hope.”\nBoykoff, for his part, isn’t convinced. “If they think this is going away,” he says, “they are living in even a more insulated fairyland than I could even imagine.”",
  "word_count": 1098,
  "scraped_at": "2026-02-14T02:25:54.613958",
  "_text_extracted": true
}