{
  "article_id": "5288373d35ec",
  "url": "https://squaremile.com/article/champions-league-2023-24-key-dates/",
  "title": "Champions League 2023 / 24 : the key dates you need to know",
  "date": "20231129T113000Z",
  "domain": "squaremile.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UEFA Champions League is the pinnacle of European football. However, as a busy working person in the city, it’s easy to lose track of the multitude of games taking place each month.\nThis article will help you mark your calendars for crucial dates, matches and the competition's final.\nAs the competition enters matchday five, plenty of top-tier clubs are on the edge of elimination.\nThe football on tv today has never been more exciting, making it even more critical for you to catch every single second of the Champions League 2023/2024 as it continues into the new year.\nMatchday five: key fixtures\nManchester United travel to Galatasaray on November 29 after losing three of their opening four Champions League matches, with their chances of progressing to the competition's knockout stages hanging by a thread.\nUnited lost to FC Bayern Munich and Galatasaray before beating FC Copenhagen in front of the Old Trafford crowd. However, a shock 4-3 defeat in matchday four in Copenhagen has left them clutching at straws.\nPremier League club Newcastle United faces an uphill struggle to emerge unscathed from Group F after back-to-back defeats to German giants Borussia Dortmund.\nThey travel to the French capital to play Paris Saint-Germain on matchday five in what is a must-win fixture for the Magpies should they want to progress to the knockout stages.\nWhen do the Group Stages finish?\nThe group stages of the 2023/2024 UEFA Champions League will finish on matchday six of the competition. The games for matchday six will take place on December 12 and 13.\nWith plenty of groups still undecided, you will want to mark down these two dates; you won't want to miss any blockbuster Christmas action in the Champions League.\nWhen are the knockout stages?\nThe 2023/24 UEFA Champions League knockout matches begin in February 2024. The Round of 16 fixtures will occur on February 13/14/20/21.\nThe Quarter-finals of the 2023/2024 UEFA Champions League will occur on April 9/10 and 16/17, 2024. Transfer these new dates into your 2024 calendar so you don't miss out.\nAs the competition ends, the Semi-finals will occur on April 30/May 1 and May 7/8, 2024. The fixtures will be played over two legs like the previous knockout rounds.\nThe 2023/2024 Champions League final\nThe 2023/2024 UEFA Champions League final will occur on June 1, 2024. The final will be held at Wembley Stadium in London, England. For those looking for a more immersive football experience in London, it may be worth grabbing some tickets for the final before it's too late.",
  "word_count": 425,
  "scraped_at": "2026-02-14T02:07:27.056303",
  "_text_extracted": true
}