{
  "article_id": "529be6e1ad79",
  "url": "https://www.uefa.com/insideuefa/news/0284-18da3397e997-7636a712a4d2-1000--klose-to-receive-uefa-president-s-award/",
  "title": "Miroslav Klose to receive UEFA President Award | Inside UEFA",
  "date": "20230830T064500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Miroslav Klose to receive UEFA President's Award\nTuesday, August 29, 2023\nArticle summary\nThe career of the former Germany forward has been hailed by Aleksander Čeferin as \"not only a testament to determination and skill but also sportsmanship that transcends the borders of professionalism and the sport itself.\"\nArticle top media content\nArticle body\nUEFA President Aleksander Čeferin has paid tribute to Miroslav Klose by selecting him to receive the 2023 UEFA President's Award.\nThe award recognises outstanding achievements, professional excellence and exemplary personal qualities, the values that the former German international forward embodies like few others. Klose's impact reached far beyond the confines of the scoresheet, with two instances of remarkable fair play that epitomised his exceptional class and sportsmanship, unparalleled in the world of football.\nOn two occasions throughout his illustrious career, Klose demonstrated a commendable refusal to capitalise on the referee's errors, favouring his team's integrity over potential advantage.\nIn 2005, donning the Werder jersey, Klose experienced a challenge from Bielefeld goalkeeper Mathias Hain within the penalty box. The goalkeeper received a yellow card, and a penalty was awarded. Yet, Klose contested the decision, asserting that the goalkeeper had made contact with the ball prior and that the punishment should not stand. Subsequently, the referee re-evaluated the situation, rescinding the foul and yellow card. Seven years later, during a Serie A showdown between Napoli and Lazio, Klose again showcased his remarkable character. While it appeared he had secured an early lead with a headed goal, the striker unhesitatingly informed the referee of his use of hand to redirect the ball beyond Napoli's goalkeeper Morgan De Sanctis, leading to a decision reversal.\n\"Throughout glorious football history, certain names shined with an aura of excellence that is hard to replicate. One such name is Miroslav Klose. From humble beginnings to becoming the all-time leading scorer in World Cup history, Klose's journey is not only a testament to determination and skill but also sportsmanship that transcends the borders of professionalism and the sport itself. His behaviour and determination to stand for what is right set an example for generations of athletes worldwide,\" Aleksander Čeferin said.\nFollowing his move from Poland to Germany at age eight, Miroslav's prodigious talent at FC 08 Homburg soon caught the attention of scouts nationwide, leading him to join the youth ranks of 1. FC Kaiserslautern. His ability to find the back of the net with remarkable consistency quickly became his trademark. His proficiency in front of goal earned him a spot in the German national team, and he made his senior debut in 2001.\nThe pinnacle of his career came twelve years later, during Germany's 2014 World Cup gold medal run in Brazil, where he became the tournament's all-time top scorer. This remarkable feat solidified his place in history and demonstrated his consistency, adaptability and longevity at the game's elite level. His time in club football was also remarkably fruitful, marked by the acquisition of trophies and top-scorer accolades in Germany and Italy with Werder, Bayern and Lazio.\nAs his playing days drew to a close, Klose seamlessly transitioned into coaching, further contributing to the sport he loved. His knowledge and experience continue to inspire a new generation of players. Whether it's his on-field intelligence, his integrity, or his ability to seed a winning mentality, Klose's influence on football's future is undeniable.\nThe award will be presented to Klose at the 2023/24 UEFA Champions League group stage draw ceremony, which will take place on Thursday 31 August at the Grimaldi Forum in Monaco.\nThe list of previous winners of the UEFA President's Award can be found here.",
  "word_count": 602,
  "scraped_at": "2026-02-14T02:10:09.473896",
  "_text_extracted": true
}