{
  "article_id": "52a0c5e01297",
  "url": "https://theathletic.com/4189842/2023/02/14/koulibaly-chelsea-champions-league/",
  "title": "Kalidou Koulibaly can use Champions League to rescue sinking Chelsea prospects",
  "date": "20230214T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League could provide Kalidou Koulibaly with a much-needed opportunity for redemption.\nChelsea resume their European campaign in Germany on Wednesday evening when they play the first leg of their last-16 tie against Borussia Dortmund.\nJust as in the two years they won it (2012, 2021), the club are beginning the knockout phase sitting mid-table in the Premier League and with very few people expecting them to win the biggest prize in European club football.\nAdvertisement\nNobody will be more motivated than Koulibaly to prove them wrong. As well as the obvious attraction of winning silverware, this competition represents his best chance at first-team football and to show that leaving high-flying Napoli wasn’t a mistake.\nCentre-back Koulibaly was one of Chelsea’s high-profile signings last summer. After years of speculation linking him with a move to the Premier League, the 31-year-old finally made the switch after Chelsea agreed a fee with Napoli worth £33.8million ($40.9m)\nThe transfer was seen as a shrewd bit of business as Chelsea urgently needed to find a replacement for Antonio Rudiger, who left on a free transfer to Real Madrid. Koulibaly rang former captain John Terry to ask if he could wear the No 26 shirt, the number he wore at Napoli and that Terry adorned throughout his Chelsea career.\nTerry gave Koulibaly his blessing and though matching the former centre-back’s exploits at Chelsea was always unlikely, the Senegalese was still expected to bring similar experience and know-how. But so far, the move has not worked out for club or player.\nAnd if Koulibaly does start in Dortmund, it will be by default.\nChelsea boss Graham Potter could add only three players to his Champions League knockout squad from the one that was used in the groups. And with the club investing heavily in January, tough choices had to be made.\nEnzo Fernandez and Mykhailo Mudryk, bought for £106m and an initial £62m, were always going to be included.\nSo realistically, it came down to a choice between Joao Felix, acquired from Atletico Madrid on loan, and centre-back Benoit Badiashile for the third slot.\nPotter clearly prefers Badiashile, 21, as the left-sided centre-back alongside Thiago Silva ahead of Koulibaly.\nHe joined from Monaco for around £33m last month and has started four games in a row. Unlike Koulibaly, he has looked assured and comfortable, making an instant impact on his debut against Crystal Palace.\nAdvertisement\nHowever, Joao Felix was chosen due to his confidence, ability to improve a stagnant attack — and the need to justify the £9.7m loan fee.\nPotter does have other options, so there are no guarantees Koulibaly — who has played just 12 minutes in the past month — will be in the XI.\nTrevoh Chalobah is in contention and if Chelsea revert to a back three, Marc Cucurella and Ben Chilwell are options for the left-sided centre-back role. Plus, Wesley Fofana is close to a return after four months out with a knee ligament injury.\nSources close to Koulibaly, who spoke to The Athletic anonymously to protect their relationships, explain nothing untoward is to blame, just a scenario that frequently occurs with new signings.\nAfter spending eight years at Napoli, building an understanding with his team-mates and feeling comfortable in the city, Koulibaly has found it difficult to adjust to a new working environment.\nHe is still getting used to the pace of the Premier League and this hasn’t been helped by Chelsea’s patchy form. The team also keeps changing, which makes it more difficult to develop an understanding with team-mates.\nAnd though Badiashile has played well under the same circumstances, the pressure and expectation on him aren’t as great as they are on Koulibaly.\nAfter helping Chelsea secure a 2-0 victory over Bournemouth on December 27 (the club’s seventh win of the league season from 15 matches), Koulibaly admitted he had not been performing as well as expected. That match was Chelsea’s first since the World Cup, where Koulibaly had played for Senegal. The break from club football had given him a chance to reflect.\nKoulibaly said: “I took some moments to think about everything — about football, about Chelsea — and to come with more motivation because the impact with this team didn’t come like I wanted.\n“I want to make a new start. The game against Bournemouth was really important. I wanted to show everybody that I am back and will give everything for this team.\n“The more I play, the better I can be. I will give everything to win a title.”\nAdvertisement\nKoulibaly must be experiencing some mixed emotions though. At Napoli, he was idolised. He was regarded as one of the finest defenders in their history and was in Serie A’s team of the year four times during his eight seasons in Italy.\nAnd this season, his old club are firmly on course to win their first Serie A title since 1990. Should they get over the line, all the players will be revered in Naples for life. Missing out on such an opportunity has to sting.\nInstead, just seven months after Koulibaly left Italy, Chelsea supporters are expressing concern on social media at the prospect of him featuring against Dortmund.\nHowever, the doubters would be wrong to suggest he has failed to perform in every game since moving to Stamford Bridge. He was assured in the two Champions League wins over AC Milan and even though Chelsea lost 1-0 to Manchester City at home last month, he combined well with Silva to keep Erling Haaland subdued.\nYet there are still suggestions his future at the club is in doubt and that Chelsea will consider selling him at the end of the season, especially now Silva has agreed to stay for another 12 months.\nBut Koulibaly does not come across as someone who is ready to give up on making his Chelsea move a success. According to the sources referred to above, he is enjoying being around London and is in the process of buying a new house in the city.\nStill, just like Chelsea, Koulibaly could do with a run of fine performances in the Champions League to ensure this is not a season to forget.\n(Top photo: Chris Lee – Chelsea FC/Chelsea FC via Getty Images)",
  "word_count": 1044,
  "scraped_at": "2026-02-14T01:59:41.713268",
  "_text_extracted": true
}