{
  "article_id": "52a2f26c5520",
  "url": "https://www.teamtalk.com/sunderland/every-completed-sunderland-transfer-summer-2025-signings-sales-loans",
  "title": "Sunderland : Every completed transfer in summer 2025",
  "date": "20250712T211500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sunderland\nPremier League • England\nEvery completed Sunderland transfer in summer 2025: Signings, sales, loans\nSunderland mean business ahead of their long-awaited return to Premier League football, so here are all the changes they’ve made to their squad since their promotion.\nComing up via the play-offs, Sunderland secured top-flight status for the first time since 2016-17. They’ve wasted little time to strengthen their squad ever since, breaking their transfer record twice in succession already.\nHere, you can find a recap of every first-team signing and sale Sunderland have overseen during the summer 2025 transfer window.\nSunderland signings\nEnzo Le Fee\n- From: Roma\n- Fee: £19.3m\n- Position: Midfielder\n- Age: 25\nSunderland’s first signing of the summer was sealed as soon as they won the Championship play-off final, even though it wasn’t announced until 10 days after their win over Sheffield United.\nWhen Sunderland signed Le Fee from Roma in January on loan, part of the agreement was that they would be obligated to buy him if they won promotion.\nAlthough Le Fee had an injury during his loan spell, he managed to make 18 appearances before sealing his permanent move.\nThe Frenchman, who worked with Regis Le Bris before at Lorient, signed a four-year contract after becoming Sunderland’s record signing – a title he didn’t hold for long…\nHabib Diarra\n- From: Strasbourg\n- Fee: £30m\n- Position: Midfielder\n- Age: 21\nSunderland broke their transfer record for the second time since their Premier League return by winning the race for Diarra from Strasbourg, where he was captain.\nThe midfielder signed a five-year contract to come to the Premier League for the first time in his career after also catching the attention of fellow promoted side Leeds United.\n“Everyone saw last season’s success and I guarantee that I’ll give everything for this team and fight for these colours in the Premier League,” he said at the time of his announcement. “I’m ready for this challenge and I can’t wait to get started.”\nNoah Sadiki\n- From: Union Saint-Gilloise\n- Fee: £15m\n- Position: Midfielder\n- Age: 20\nSunderland spent their third eight-figure transfer fee of the summer on July 4 by buying Sadiki for £15m from Belgian side Union Saint-Gilloise.\nMainly a midfielder, he has played in a range of positions throughout his blossoming career, committing the next five years to Sunderland.\n“This is a huge Club, but what convinced me was speaking to the people,” he reasoned. “They spoke about the history, what they want to build, and their belief in the part that I can play.”\nReinildo Mandava\n- From: Atletico Madrid\n- Fee: Free\n- Position: Left-back\n- Age: 31\nThe most experienced of Sunderland’s new recruits so far, Reinildo was a free agent after his contract with Atletico Madrid expired.\nA former Ligue 1 champion with Lille, the left-back was with Atleti for three seasons and has now arrived in the Premier League for the first time in his career.\nReinildo’s contract on Wearside will be valid for two years.\n“It is a dream come true because it has always been my ambition to play in the Premier League – and I can’t wait to play for an historic club like Sunderland,” he enthused.\nChemsdine Talbi\n- From: Club Brugge\n- Fee: £18m\n- Position: Winger\n- Age: 20\nTalbi has signed a five-year contract with Sunderland and is another player with no prior experience of English football.\nMost recently with Club Brugge, where he gained Champions League experience, Talbi has been purchased for an initial £18m that could rise to £21.5m with add-ons.\n“I made the decision because it’s a great project with a talented, exciting team full of young players – and that really motivated me,” the Morocco international hopeful explained.\nSimon Adingra\n- From: Brighton\n- Fee: £21m\n- Position: Winger\n- Age: 23\nSunderland’s sixth signing of the summer is their first to have actually played in the Premier League before.\nAdingra has arrived in the North East from Brighton, where he made 60 top-flight appearances over the past two seasons and scored eight league goals.\nThere are add-ons on top of the £21m Sunderland have spent to sign Adingra on a five-year contract.\n“The club and the project are really exciting,” he declared. “I spoke with everyone and their interest in me made the decision easy – I wanted to be part of Sunderland’s future.”\nGranit Xhaka\n- From: Bayer Leverkusen\n- Fee: £13m\n- Position: Midfielder\n- Age: 32\nAdding even more significant Premier League experience to their squad, Sunderland have successfully lured former Arsenal captain Xhaka back to English football.\nIt’s quite the coup, given Xhaka became a key part of the Bayer Leverkusen side that went Invincible in the 2023-24 Bundesliga season.\nThe Swiss midfielder has signed a three-year contract at the Stadium of Light after pushing for a move to Sunderland.\nThe initial fee for the transfer has been reported as £13m, but it could rise to £17m with add-ons.\n“I’m very proud to be here. When I spoke to the club, I was excited and I felt the energy, and the mentality that all the people and players have,” Xhaka said in his first interview.\n“It’s exactly what I wanted, and I have a very good feeling. We are back to where this club needs to be, and we want to stay here to write our own history.\n“I feel that I’m ready to help the team with my experience but with quality as well.”\nRobin Roefs\n- From: NEC Nijmegen\n- Fee: £9m\n- Position: Goalkeeper\n- Age: 22\nAfter failing to complete deals for previous goalkeeping targets Marcin Bulka and Djordje Petrovic, Sunderland have landed their new first-choice shot-stopper, Roefs.\nMaking his first move into English football, Roefs has signed a five-year contract after costing £9m rising to £11.5m to sign.\n“It feels really good to have signed for Sunderland,” the Dutchman explained. “Joining such a big Club with a rich history is a proud moment for me, and I’m excited for the challenge ahead in the Premier League.\n“Last season was my first real experience as a senior goalkeeper, and I was happy with how it went, especially with the stats at the end of the campaign. To be part of this journey at a Club like Sunderland is really special, and I’m looking forward to the campaign ahead.”\nRoefs kept 10 clean sheets from 32 Eredivisie appearances last season.\nArthur Masuaku\n- From: Besiktas\n- Fee: Free\n- Position: Left-back\n- Age: 31\nAfter three seasons with Besiktas, Masuaku is back in the Premier League as one of Sunderland’s more experienced new additions.\nThe left-back was a free agent after his contract with the Turkish Super Lig club expired, so has returned to English football following a previous spell with West Ham.\nSunderland have given Masuaku a two-year contract.\nHe said: “I’m excited to be here and I’m also really happy to be back in the Premier League. It’s clear that Sunderland is a top Club and I’m grateful for the opportunity.\n“I had three good years in Turkey, and now I have this exciting new challenge in front of me. I want to bring a winning mentality and joy to the fans, and I’m excited to get started.”\nOmar Alderete\n- From: Getafe\n- Fee: £10m\n- Position: Defender\n- Age: 28\nSunderland have signed Omar Alderete from Getafe for £10million, with a further £900,000 in add-ons.\nThe Paraguay international central defender has signed a four-year contract with the Black Cats.\nAlderete told Sunderland’s official website: “I’m feeling great about signing for this great team, so I’m really happy.\n“I’m looking forward to my first experience in the Premier League – it’s a great challenge for me.\n“I know it’s a historic club, and when they told me there was an opportunity, I was excited about coming here.\n“It’s always important to have the support of the people, and I’m going to give it my all on the pitch.”\nNordi Mukiele\n- From: Paris Saint-Germain\n- Fee: £12m\n- Position: Right-back\n- Age: 27\nMukiele has signed a four-year contract to become a Sunderland player after three years on the books of PSG, the last of which was spent out on loan with Bayer Leverkusen.\nBest known for his spell with RB Leipzig, Mukiele is now in the Premier League for the first time in his career.\nAfter completing his move, he said: “It’s a new challenge and I’m happy to be here. I saw the atmosphere of the stadium, and this is something I really like. The fans are very important in football, and especially in Sunderland. I came here to fight for them.\n“I see some good players and see their quality, so I believe that we can do something good together – and when I say together, I mean the players, the fans and the city. We will need everyone this season.”\nBrian Brobbey\n- From: Ajax\n- Fee: £21.3m\n- Position: Striker\n- Age: 23\nBrobbey left Ajax for a second time in his career to join Sunderland and he will be hoping he takes it in his stride more than he did with his previous spell at RB Leipzig.\nComing to the Premier League for the first time, the big striker has signed a five-year contract at the Stadium of Light after sealing a deadline day move.\nAnd despite his struggles at RB Leipzig, a connection he made there helped convince him to sign for Sunderland.\n“It feels great to be a Sunderland player,” he explained. “I spoke with Nordi Mukiele, who I know from my time in RB Leipzig, and he told me about the Club, the fans, and how it feels like a family.\n“I first talked with Sunderland over a month ago, and I have seen the stadium and the fans this season, and I can’t wait to be a part of that passion.\n“It’s emotional to say goodbye to Ajax, as I grew up here and I’m going to miss everyone, but the Premier League is the biggest stage in the world, and I’m ready for this next chapter.”\nBertrand Traore\n- From: Ajax\n- Fee: £2.5m\n- Position: Winger\n- Age: 29\nTraore made the same deadline day move as Brobbey, leaving Ajax for Sunderland, although in his case this won’t be his first time in the Premier League.\nThe winger is back for another crack at English football after his previous spells with Chelsea and Aston Villa.\nTraore’s contract will only last for a year, but there will be an option to renew his deal for another season.\n“I’m really happy to join Sunderland,” he said. “It’s a huge Club, and for me it feels great to be back in the Premier League. I had some good times here before, so it’s special to return, and I can’t wait to get started.\n“From far away, I’ve seen the way the team has started the season, the movements, the atmosphere around the Club – everything looks positive. I’m excited to be part of this project and part of this team. It helps as well that I already know a few players, like Simon Adingra, and of course Brian (Brobbey), who also joined today.\n“Having those relationships and my past experiences in England will make it easier to settle quickly. I’m looking forward to stepping out at the Stadium of Light and giving my best for the fans.”\nSunderland loan signings\nMarc Guiu\n- From: Chelsea\n- Length: Season-long (recalled in September)\n- Position: Striker\n- Age: 19\nGuiu showed some promise in the Conference League last season by scoring six goals for Chelsea, but was only given three Premier League outings.\nSunderland were hoping to be able to give him more of a platform to test himself in the Premier League after signing him on a season-long loan deal.\nHowever, Chelsea were never willing to let Sunderland have an option to buy Guiu and recalled him far earlier than expected, terminating his loan on deadline day to make up for Liam Delap’s injury and allow Nicolas Jackson to move to Bayern Munich.\nDespite his short stay, in which he scored one goal from three games, Guiu posted on Instagram: “Short, really short… but intense… In just a few weeks, I’ve come to understand what football truly means to this city and how that passion creates a unique and unmatched atmosphere at the Stadium of Light.\n“It has been an absolute honor to wear this jersey, and although fate is unpredictable and had other plans for me, I can assure you that these colors and this city will forever hold a place in my heart.\n“Thank you to everyone at Sunderland AFC for the warm welcome and support , I wish you all the very best for the future.\n“See you soon @sunderlandafc. Ha’way the lads!!!”\nLutsharel Geertruida\n- From: RB Leipzig\n- Length: Season-long\n- Position: Defender\n- Age: 25\nSunderland signed Geertruida on deadline day, just a year after he joined RB Leipzig from Feyenoord.\nThere is believed to be an option to buy the versatile defender, who’s mainly a right-back, for £18m.\nGeertruida said: “First of all, I want to thank God for this opportunity, and I also want to thank the Club for their trust in me. I’ve always wanted to play in the Premier League, and I’m so excited now that my opportunity is here.\n“We are new to the league, so we need to fight, and I want to be a part of that. I’ve seen the recent games and think the group looks fresh and energetic.\n“Now, I just want to be as important as possible for this Club. I’m ready, and I can’t wait to see the fans in the stadium.”\nSunderland exits\nTom Watson\n- To: Brighton\n- Fee: £10m\n- Position: Winger\n- Age: 19\nSunderland academy graduate Watson made 20 Championship appearances last season and scored twice.\nThat was all before the play-offs, when Watson wrote his name into the history books by scoring the stoppage-time winner to send Sunderland back into the Premier League after a lengthy absence.\nBut by that point, he had already sealed a move away from the club, since Brighton confirmed they had an agreement in advance to sign him in April.\nOnce the transfer window opened, Watson was able to formally complete his move on a four-year contract.\nJobe Bellingham\n- To: Borussia Dortmund\n- Fee: £27m\n- Position: Midfielder\n- Age: 19\nThe wait to see a Bellingham in the Premier League will go on after Jobe followed in the footsteps of his brother Jude by moving to Germany with Borussia Dortmund.\nJobe made 90 appearances across two seasons for Sunderland, scoring 11 goals, but has now become one of their biggest exports.\nDortmund signed him in time for him to make his debut at the Club World Cup, where he was also able to get his first goal for them.\nThe transfer fee Sunderland received for Bellingham, which could rise by another £4m approximately with add-ons, is believed to be the biggest ever going to a newly promoted Premier League club.\nJobe: ‘It’s time for me to say farewell to all the loyal people of Sunderland, who have powered me through two incredible years in red and white. Your support, on so many occasions, has completely blown me away, especially in the times of adversity, which we pulled through… pic.twitter.com/PqAxe8DMZG\n— Sunderland AFC (@SunderlandAFC) June 10, 2025\nNathan Bishop\n- To: AFC Wimbledon\n- Fee: Undisclosed\n- Position: Goalkeeper\n- Age: 25\nAfter joining from Manchester United in 2023, Bishop only played once in the league for Sunderland.\nLast season, he dropped into League One for loan spells with Wycombe Wanderers and Cambridge United, making five appearances for the former and 14 for the latter.\nHe will be playing in the third tier next season as well after a deal was agreed for him to join AFC Wimbledon on a three-year contract.\n“I am delighted to be here and cannot wait to give everything to the people who built this place brick by brick,” said Bishop.\nPierre Ekwah\n- To: Saint-Etienne\n- Fee: £5.2m\n- Position: Midfielder\n- Age: 23\nEkwah spent last season on loan with Saint-Etienne and the move has become permanent in August.\nA former Chelsea and West Ham youth player, Ekwah made 63 appearances for Sunderland before his move back to his native France.\nSunderland loan exits\nAdil Aouchiche\n- To: Aberdeen\n- Length: Season-long\n- Position: Attacking midfielder\n- Age: 22\nAouchiche spent the second half of last season on loan at Portsmouth and has now moved north of the border to join Scottish Premiership side Aberdeen, who will have an option to make his stay permanent for £1.5m.\nOtherwise, Sunderland still have Aouchiche on contract until 2028.\nLuis Semedo\n- To: Moreirense\n- Length: Season-long\n- Position: Striker\n- Age: 22\nAfter spending last season on loan with the Juventus Next Gen team, Semedo has returned to his native Portugal to spend the season with Moreirense.\nHe previously played in half of Sunderland’s Championship games in the 2023-24 season.\nAlan Browne\n- To: Middlesbrough\n- Length: Season-long\n- Position: Midfielder\n- Age: 30\nSunderland took Browne away from Preston last summer on a three-year deal after his decade of service to his former club.\nHe has dropped back into the Championship for year two of his contract, staying in the north east with Middlesbrough.\nNiall Huggins\n- To: Wycombe Wanderers\n- Length: Season-long\n- Position: Defender\n- Age: 24\nHuggins was unable to feature due to injury last season and will now develop with Wycombe in League One.\nSporting director Kristjaan Speakman said: “After performing well in our team, Niall’s had an incredibly difficult 18 months, and I know I speak for players, coaches, and supporters alike when I say that it’s great to see him back in action.\n“He’s worked tirelessly to return, and this loan represents an excellent opportunity for him to play regularly throughout the upcoming campaign.\n“We all wish him well at Wycombe Wanderers.”\nPatrick Roberts\n- To: Birmingham City\n- Length: Season-long\n- Position: Forward\n- Age: 28\nRoberts only missed one game in the Championship last season for Sunderland and played once in the Premier League before a deadline day loan to ambitious Birmingham City.\nSpeakman said: “Patrick was a catalyst in the success of Sunderland over the past four years. He joined us in League One, believed in what we were doing, where we were going, and immersed himself in our Club, on and off the field.\n“He made a huge impact for us, and with limited opportunities this season, it’s appropriate to ensure he can continue to play regularly throughout the campaign.\n“We wish him the best of luck and thank him for his immense contribution. Patrick will always be able to call Sunderland home, and he will always be welcome at the Stadium of Light.”\nJenson Seelt\n- To: Wolfsburg\n- Length: Season-long\n- Position: Defender\n- Age: 22\nSeelt earned only one appearance last season in the Championship after recovering from a serious knee injury, but did go on to play twice in the early weeks of the Premier League campaign. He will now look to get back on track with Wolfsburg.\nNazariy Rusyn\n- To: Arka Gdynia\n- Length: Season-long\n- Position: Striker\n- Age: 26\nRusyn ended last season on loan with Hajduk Split and has now gone to Poland with Arka Gdynia.",
  "word_count": 3270,
  "scraped_at": "2026-02-14T02:02:51.949493",
  "_text_extracted": true
}