{
  "article_id": "52bce84e38d0",
  "url": "https://www.con-telegraph.ie/2023/03/09/time-wasting-crackdown-could-mean-equivalent-of-three-extra-games-fifpro-study/",
  "title": "Time - wasting crackdown could mean equivalent of three extra games – FIFPRO study",
  "date": "20230309T124500Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Time-wasting crackdown could mean equivalent of three extra games – FIFPRO study\nBy Jamie Gardner, PA Chief Sports Reporter\nA clampdown on time-wasting could mean players being involved in the equivalent of up to three extra matches per season, according to a new report from world players’ union FIFPRO.\nThe sport’s world governing body FIFA ordered referees to more accurately calculate the length of stoppages during last year’s World Cup in Qatar, focusing on goal celebrations as well as injuries, VAR checks and substitutions.\nThose guidelines are to be rolled out worldwide from July 1 after the International Football Association Board, which sets the laws of the game, gave the go-ahead at its annual general meeting last Saturday.\nFIFPRO said the changes meant that on average 11.6 minutes of stoppage time were played at matches in Qatar, an increase of almost 60 per cent on the 2018 finals in Russia and an increase of around four minutes compared to the seven-minute average FIFPRO’s data compiled with Football Benchmark shows across 34,000 matches studied over the last four seasons.\nThe union looked at the playing time of a select group of players who featured in 60 matches or more during the 2021-22 season, and calculated that among that group, the 11.6 average stoppage time would mean a 4.8 per cent likely increase in total minutes per season.\nFor Tottenham and England striker Harry Kane, the report found it would be equivalent to 2.6 extra games per season.\nA survey of 64 players who participated in the Qatar finals found 53 per cent were in favour of the clampdown, but FIFPRO said that fixture planning must take account of the extra toll being placed on players.\n“The workload impact of this change must not be dismissed,” FIFPRO stated in its report.\n“If this new interpretation was adopted more widely across all competitions, players would be forced to cope with longer effective playing times amid their already overloaded match calendars.”\nFIFPRO general secretary Jonas Baer-Hoffmann added: “We were caught by surprise with this one (before the World Cup) the same way that everybody else was. There was no real dialogue that would have alerted us that this would happen.\n“As long as behaviour isn’t changed…what we see now is that it would add an extra three or so matches to the year and that’s roughly the equivalent of the Champions League reform that has been widely criticised by people for what it does to the calendar.”\nA BBC report found the average amount of time indicated to be added on in the first round of group games in Qatar was 11 minutes and eight seconds, dropping to 10min 22secs for the second round of group games before rising slightly to 10:26. It fell to 8:49 by the knockout stages, the BBC found.\nFootball Association chief executive Mark Bullingham, a director of the IFAB, said on Saturday he would expect that time added on would initially spike in the Premier League next season under the new guidance but would expect it to quickly come down again.\n“Players (in Qatar) realised that if they went down, time was going to be added, so there was no point in staying down,” he said.\n“We can’t prove that, but it could be something. There were lots of things that were really positive to learn there and I think the aim is to communicate that and get everyone onside with that and explain the benefits.”\nThe FIFPRO report also looked at the impact of the World Cup on players and their attitudes towards it.\nOnly 11 per cent said they would favour a World Cup being played in November and December again, amid reports Saudi Arabia wishes to co-host a winter finals in 2030.\nEighty-six per cent of players said there should be a minimum of 14 days’ preparation time prior to a tournament and 61 per cent said there should be a 14 to 28-day recovery period afterwards.\nThere were only seven days’ preparation time for many players leading into Qatar and FIFPRO found 55 per cent of players who featured in the finals had returned to club duties by January 1.\nForty-four per cent felt extreme or increased physical fatigue in January compared to a normal season, while 53 per cent reported an injury or felt more likely to suffer one this season due to the congested calendar.\nBaer-Hoffmann said: “Repeating what we had (in Qatar) is clearly not acceptable and shouldn’t be a viable option for anybody.\n“If you want to pursue a winter World Cup again, I think you need to go into conversations with the leagues that they completely change their schedule and provide appropriate training and recovery time pre and post that tournament.\n“But that would of course resemble a two or two-and-a-half-month break in competitions. I find it unlikely that they will agree to that.”",
  "word_count": 814,
  "scraped_at": "2026-02-14T02:16:40.086532",
  "_text_extracted": true
}