{
  "article_id": "52c6ccf92225",
  "url": "https://finance.yahoo.com/news/following-share-stake-sale-executive-120500166.html",
  "title": "Following Share Stake Sale to Executive Chairman Daniel McClory , Alessandro Aleotti to Focus on AleottiLab",
  "date": "20240411T123000Z",
  "domain": "finance.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following Share Stake Sale to Executive Chairman Daniel McClory, Alessandro Aleotti to Focus on AleottiLab\nControl Block Sale of Brera FC Founder’s Position Results in New Majority Shareholder\nDUBLIN, Ireland and MILAN, Italy, April 11, 2024 (GLOBE NEWSWIRE) -- Brera Holdings PLC (“Brera Holdings”, “Brera” or the “Company”) (Nasdaq: BREA), one of the world’s first publicly-listed multi-club ownership (“MCO”) companies for football (American soccer), announces that Alessandro Aleotti has resigned from all his positions with the Company effective as of April 4, 2024, to pursue philanthropic endeavors.\n“I am proud to have given life to a project that has now landed on the international sporting and financial stage,” Aleotti declared. “I am now eager to pivot back to my greatest passions: pioneering ideas and developing experimental initiatives under the umbrella of AleottiLab. This organization will dedicate its efforts towards projects in culture, communication, philosophy, non-profit sports activities, and human rights,” furthered Aleotti.\nAleotti founded Brera FC in 2000 and was president until 2022 when acquired by Brera Holdings, the Company’s first football club acquisition. Aleotti served as a director and the Chief Strategy Officer of Brera Holdings since July 2022. On February 29, 2024, Aleotti sold approximately 90% of his Brera Holdings’ shares to Daniel McClory.\nBrera Holdings’ Executive Chairman, Daniel McClory, said “I would like to express my gratitude towards Alessandro Aleotti for his pivotal role in the founding of Brera FC, and wish him great success. Alessandro’s commitment to fair play, on and off the pitch, will remain engrained in our DNA, as we press forward with a new chapter in our evolution, dedicated to professional sports such as football and volleyball by harnessing international resources and expertise. Our primary focus remains on Italy, where we are actively pursuing the acquisition of a Serie B football club.”\nABOUT BRERA HOLDINGS PLC\nBrera Holdings PLC (Nasdaq: BREA) is focused on expanding its social impact football (American soccer) business by developing a global portfolio of emerging football and other sports clubs with increased opportunities to earn tournament prizes, gain sponsorships, and provide other professional football- and sports-related consulting services.\nThe Company seeks to build on the legacy and brand of Brera FC, the first football club that was acquired by the Company in 2022. Brera FC, known as “The Third Team of Milan,” is an amateur football association which has been building an alternative football legacy since its founding in 2000. The Company owns the trademarked FENIX Trophy Tournament, a non-professional pan-European football competition recognized by UEFA, inaugurated in September 2021 and organized by Brera FC. “FENIX” is an acronym for “Friendly European Non-professional Innovative Xenial.” BBC Sport has called the FENIX Trophy “the Champions League for amateurs,” and Brera FC hosted the 2023 finals at Milan’s legendary San Siro Stadium. In October 2022, the Internet Marketing Association at its IMPACT 22 Conference named Brera FC as its award recipient for “Social Impact Through Soccer,” recognizing the Company’s focus at an international level with this distinction.",
  "word_count": 496,
  "scraped_at": "2026-02-14T02:25:26.765991",
  "_text_extracted": true
}