{
  "article_id": "52e263aa79ef",
  "url": "https://www.fourfourtwo.com/features/the-worst-ever-premier-league-players",
  "title": "The worst ever Premier League players",
  "date": "20231212T091500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The worst ever Premier League players\nCounting down the biggest flops in the history of the Premier League\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Premier League is the greatest league in the world – so it's obviously been graced by some truly great players.\nBut England's top flight has seen more than it's fair share of flops over the years, too, from struggling superstars to unknown quantities who proved hopelessly out of their depth.\nIn FourFourTwo's humble opinion, these are the worst Premier League players EVER...\n35. Radamel Falcao\nWhat is one of the best strikers of the 2010s doing on a list of the worst ever Premier League players? Well, he was absolutely pants during his time in England, basically.\nIn loan spells from Monaco at Manchester United and Chelsea, Radamel Falcao made 36 league appearances – and scored five goals.\nThe Colombian then returned to Monaco and found the net 83 times in three seasons...\n34. Afonso Alves\nHaving banged in 45 goals in 39 Eredivisie games for Heerenveen, Afonso Alves looked like a pretty handy signing for Middlesbrough in January 2007.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe big Brazilian couldn't recapture that form on Teesside, though, managing just 10 goals in 42 Premier League outings – three of which came in an 8-1 drubbing of a hapless Manchester City side on the final day of the 2007/08 campaign.\n33. Salif Diao\nOne of several Senegal players who earned Premier League moves of the African country's run to the quarter-finals of the 2002 World Cup, Salif Diao joined Liverpool alongside international teammate El Hadji Diouf.\nBut, unlike his compatriot, the midfielder never even looked like making the grade at Anfield (and he hardly set the world alight at Birmingham, Portsmouth or Stoke either).\n32. Jo\nOne of Manchester City's worst ever signings, Jo arrived from CSKA Moscow for a club-record £19m in the summer of 2008 – and barely made an appearance for every million City spent.\nIn 21 Premier League games, the gangly Brazilian was on the scoresheet... once. And he didn't fare much better when loaned to Everton, striking five times in 27 outings.\n31. Yaya Sanogo\nDubbed Sanogoals, it's fair to say Yaya Sanogo was anything but prolific for Arsenal, who he joined in the summer of 2013 (ok, he did get a goal in the Champions League).\nAs it turned out, the striker's record of 10 goals in his final 13 games for Auxerre in the French second tier wasn't a sign that he might cut it in the Premier League (who'd have thought it?).\n30. Jean Makoun\nSigned from Lyon for around £6m in January 2011, Jean Makoun's time at Aston Villa was nothing short of a disaster.\nThe Cameroon midfielder made nine Premier League appearances for the West Midlands giants, with his notable, uh, contribution a straight red card for a two-footed horror tackle on Blackpool's DJ Campbell).\n29. Kostas Chalkias\nBrought to Portsmouth by Harry Redknapp in January 2005, Greek international Kostas Chalkias did nothing to dispel the old adage that goalkeepers are all crazy.\nErratic to say the least, Chalkias' antics between the sticks saw him dropped for Jamie Ashdown in double-quick time – and he left Pompey after playing just five Premier League games.\n28. Kleberson\nHailed as a key force in Brazil's 2002 World Cup-winning team by manager Luiz Felipe Scolari, Kleberson was hot property that summer – and Manchester United won the race to sign him from Athletico Paranaense.\nBut the midfielder was an enormous disappointment at Old Trafford, getting injured in his second appearance and featuring only 20 times in the Premier League altogether.\n27. Jean-Alain Boumsong\nJean-Alain Boumsong made a decent start to life at Newcastle after arriving from Rangers midway through the 2004/05 season – but it didn't last.\nDespite featuring in 33 of the Magpies' 38 Premier League games the following campaign, the France centre-half became known for mistakes leading to goals.\nHe was sold to Juventus (then just demoted to Serie B) in the summer of 2006.\n26. Antonio Nunez\nRafael Benitez made a lot of good signings as Liverpool manager; he also made some seriously naff ones – among them his second acquisition after being named Reds boss in 2004, Antonio Nunez.\nPicked up from Real Madrid, the Spanish midfielder was a bit-part player throughout his sole season at Anfield (although he did get a Champions League winners' medal).\n25. Marcelino\nSigned by Newcastle from Real Mallorca for £5.8m in 1999, Marcelino came with a big reputation – but he would end up making just 17 Premier League appearances for the Magpies.\nPlagued by injuries throughout his time on Tyneside, the centre-back once missed two months with a snapped finger tendon.\n24. Roque Junior\nAnother 2002 world champion with Brazil who flopped in the Premier League, Roque Junior joined Leeds from AC Milan in 2003 – to much excitement at Elland Road.\nThe centre-half didn't exactly help shore up the Whites' defence, though: they conceded 25 goals in his seven league appearances (although he did, somehow, score twice himself).\n23. Gilberto\nHis namesake and fellow Brazil international earned legendary status at Tottenham's arch-rivals Arsenal – but there's a reason no one really remembers this Gilberto.\nCapped 36 times, the left-back was Spurs' first Brazilian player – but he did nothing of note in his seven Premier League games other than score the last goal in a 4-0 drubbing of West Ham.\n22. Corrado Grabbi\nProlific for Ternana in Serie B, Corrado Grabbi caught the eye of Blackburn Rovers in the summer of 2001 – so much so that they broke their transfer record to sign the striker for £6.75m.\nWhat a waste of money that proved to be: Grabbi managed a truly paltry two goals in 30 Premier League appearances and returned to Italy in 2004.\n21. Ade Akinbiyi\nStriker Ade Akinbiyi made 73 Premier League appearances for four different clubs – the vast majority of them for Leicester between 2000 and 2002. He scored 11 goals.\nThe fact that Akinbiyi – who developed a reputation for missing sitters – surpassed that total in three separate second-tier campaigns suggests that he was probably better suited to that level...\n20. Kostas Mitroglou\nHe went on to enjoy a prolific two-season spell with Benfica – but, for whatever reason, Kostas Mitroglou and Fulham just was not meant to be.\nSigned for a then club-record fee of £12m from Olympiacos in 2014, the Greek striker was hampered by injuries during his time at Craven Cottage and made just three Premier League appearances – without scoring.\n19. Andriy Voronin\nWhen Andriy Voronin left Liverpool in 2010, Soccer AM ironically set a compilation of the ponytailed Ukrainian forward's multitude of glaring misses to commentary of great goals.\nVoronin registered five times in 27 Premier League games for the Reds – although they did manage to get £4m from Dynamo Moscow for the flop who had arrived as a free agent in 2007.\n18. Tomas Brolin\nA major star for Parma and Sweden during the first half of the 90s, Tomas Brolin moved to Leeds in 1995 – and his time at Elland Road began well enough.\nBut then it all went pear-shaped: Brolin clashed with manager Howard Wilkinson over his role in the team and was accused of not pulling his weight defensively.\nHe was loaned out to FC Zurich less than a year after arriving at Leeds.\n17. Ricky van Wolfswinkel\nIf this were a list of the Premier League's best names, Ricky van Wolfswinkel would be near the very top – but, unfortunately for the goal-shy Dutchman, it's not.\nBig things were expected of Van Wolfswinkel when he joined Norwich from Sporting Lisbon in 2013 – but they simply didn't come, and he found the net a mere one time in 25 Premier League appearances.\n16. Leon Cort\nWhen FourFourTwo asked fans of every League club in England to vote for their worst ever player in 2017, Leon Cort came out on top among Burnley supporters: \"Lacking mobility to the extent of looking like Bambi's slow cousin on ice.\" Ouch.\nThe defender had previously played for Stoke in the Premier League – but he enjoyed the best days of his career with fourth-tier Southend United in the early 00s.\n15. Marco Boogers\nWest Ham manager Harry Redknapp had never seen Dutch frontman Mark Boogers play – so it probably wasn't the best idea to pay £1m to sign him from Sparta Rotterdam in July 1995.\nAnd it really wasn't: almost immediately after coming off the bench for his second of just four Hammers appearances, Boogers saw red for a shocking tackle on Manchester United's Gary Neville.\nHe later claimed the wet grass had made him slide too far. Hmm.\n14. Claude Davis\nClaude Davies was a decent enough defender – he won 69 caps for Jamaica – but he did spend most of his career in English football's second tier.\nAnd his disastrous 2007/08 Premier League campaign with Derby – when the Rams were relegated with a record-low 11 points – rather proved why, as he earned himself the nickname Calamity Claude.\n13. Sean Dundee\nBought from German club Karlsruher SC for £2m in July 1998 as cover for the injured Robbie Fowler, Sean Dundee would become one of Liverpool's most forgettable signings.\nDundee made three appearances for the Reds – all of them off the bench – and was sold to Stuttgart for £1m at the end of the 1998/99 season.\nLiverpool probably would have been better off signing Crocodile Dundee.\n12. Andrea Silenzi\nAndrea Silenzi became the very first Italian to play in the Premier League after joining Nottingham Forest from Torino in the summer of 1995.\nA £1.8m signing – a fairly big amount of money back then – featured 12 times in the league without scoring a single goal, returning to his homeland the following year.\n11. Bosko Balaban\nStriker Bosko Balaban's goals helped fire Croatia to 2002 World Cup qualification – but he barely got a look-in after his £5.8m switch from Dinamo Zagreb to Aston Villa, making a grand total of eight Premier League appearances in two-and-a-half years.\nDefending his time at Villa Park in a 2019 interview with FFT, Balaban said: \"If you're a club that throws big money at signings and then doesn't let them actually play, the jokes should really be at your expense.\n10. Winston Bogarde\n\"I may be one of the worst buys in the history of the Premiership, but I don't care\": Winston Bogarde might as well have asked to be included in this list.\nBrought to Chelsea from Barcelona by Gianluca Vialli in 2000, Bogarde wasn't wanted by Vialli's successor in the Stamford Bridge dugout, Claudio Ranieri – who tried to offload the Dutchman.\nBut Bogarde refused to budge, opting to see out his four-year, £40,000-a-week contract as the ultimate benchwarmer (if he even made the bench at all).\n9. Eric Djemba-Djemba\nEnvisaged as a potential successor to Roy Keane in the Manchester United midfield, Cameroon international Eric Djemba-Djemba fell well short of the mark at Old Trafford.\nSigned from Nantes for £3.5m in September 2003, he was moved on to Aston Villa for a £2m loss less than 18 months later.\nAnd, by 2007, Djemba-Djemba was on loan in the Championship at Burnley.\n8. Bebe\nThere's a conspiracy theory which might explain why Manchester United raised eyebrows by signing Bebe for more than £7m in the summer of 2010 – but he was still an almighty flop.\nAfter featuring just twice in the Premier League and going out on loan to three different clubs, the winger – who Sir Alex Ferguson had never even seen play – left for Benfica in 2014.\n7. Igors Stepanovs\nIgors Stepanovs is one of Latvia's greatest players of all time; he's also one of Arsenal's worst, enduring a torrid time with the Gunners after joining from Skonto Riga in 2000.\nThe disappointing defender was a 2001/02 double winner under Arsene Wenger – but Arsenal achieved that triumph in spite, rather then because, of him.\n6. Jozy Altidore\nWhen Hull City took Jozy Altidore on loan from Villarreal in 2009, it didn't seem like a bad idea: after all, the great American hope was still only 20 years old.\nBut when Sunderland signed him permanently from AZ Alkmaar five years later, were they not at least slightly concerned by his record of one goal in 28 Premier League games for Hull?\nAltidore fared even worse with the Black Cats, netting... once in 42 top-flight appearances. Oof.\n5. Milton Nunez\nIt's Sunderland again... and this time, the curious case of Milton Nunez – who the Wearsiders seemingly didn't even mean to sign from Greek giants PAOK.\nThe Honduran striker played just once in the league for Sunderland, claiming that they had thought he and international teammate Eduardo Bennett were the same player (Bennett never even played for PAOK!).\n4. Junior Lewis\nLampooned for his \"incredible ability of being six-foot-two standing height and five-foot-eight when jumping\" by a Leicester fan as part of a FFT poll getting supports to pick their club's worst ever player, Junior Lewis was not remotely cut out for the Premier League.\nAlso voted as Stevenage's worst ever player in the same poll – which rather says it all – the midfielder probably wouldn't have got the move to Leicester had they not been managed by Peter Taylor – who signed him six times in all.\n3. Savio\nPlayer of the tournament while winning the European U-19 Championship with Germany, Savio joined West Ham from Italian outfit Brescia in January 2009.\nThe Hammers paid close to £10m for the forward – who proceeded to look hopelessly out of his depth in the Premier League, making 10 appearances before being sold to Fiorentina at the end of the season for a loss of £7m. Oh dear.\n2. Massimo Taibi\nThe worst goalkeeper in Premier League history, it's something of a miracle that Massimo Taibi ever played for Manchester United – who he joined from Venezia for £4.5m in August 1999.\nThen came the howlers – most notably letting Matt Le Tissier's weak shot through his legs and into the goal against Southampton.\nThat Gaffe saw Taibi (rather humourously) dubbed The Blind Venetian by one British newspaper.\n1. Ali Dia\nAli Dia? More like Oh Dia, are we right? It's gone down as one of the most infamous transfers of all time: in 1996, Southampton boss Graeme Souness (pictured) was duped into signing the Senegalese striker from non-League Blyth Spartans.\nHow? Well, Souness had received a call from someone claiming to be 1995 Ballon d'Or winner George Weah – and that he was Dia's cousin.\nIt was all nonsense, of course, and it took a five-minute substitute appearance to suss that Dia was not of Premier League calibre.\nHe was released two weeks into what had only been a one-month contract in the first place.\nTom Hancock started freelancing for FourFourTwo in April 2019 and has also written for the Premier League and Opta Analyst, among others. He supports Wycombe Wanderers and has a soft spot for Wealdstone. A self-confessed statto, he has been known to watch football with a spreadsheet (or several) open...",
  "word_count": 2663,
  "scraped_at": "2026-02-14T01:51:13.786208",
  "_text_extracted": true
}