{
  "article_id": "52f88a3aa3e0",
  "url": "https://www.rri.ro/en/news-and-current-affairs/newsflash/july-19-2024-id791773.html",
  "title": "July 19 , 2024 - Radio Romania International",
  "date": "20240719T134500Z",
  "domain": "rri.ro",
  "source_country": "Romania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "July 19, 2024\nA roundup of domestic and international news\nNewsroom, 19.07.2024, 13:55\nEnergy. The government is preparing a plan of immediate and medium-term measures to cover the electricity consumption needs of both citizens and companies, regardless of the weather conditions, the Romanian Prime Minister Marcel Ciolacu said today, at the end of the meeting of the Energy Command team. The immediate measures, as stated in the Government’s press release, include, among other things, the increase in energy production and the identification of a standard format for the transmission/communication of electricity measurement data between distributors and suppliers. At the same time, the National Energy Regulatory Authority has announced that it will analyze the pricing mechanism in order to protect the final consumer from market fluctuations. Recently, the national energy system has been under pressure due to the heat wave. There have been problems with covering the needs, and the distribution infrastructure causes concern, as it is overloaded during periods of high temperatures, when electricity consumption is much higher than in normal periods.\nEPC. At the fourth meeting of the European Political Community, held in Great Britain, the President of Romania, Klaus Iohannis, pleaded for cooperation in the field of energy and for the continuation of the support given to Ukraine invaded by Russian troops, the Presidential Administration in Bucharest has stated. The Romanian president stressed that the efforts to strengthen cooperation in the field of energy and connectivity “are essential goals for strengthening national and European resilience, in a context marked by the challenge of managing climate change, but also by developments such as those in Ukraine, which have reconfirmed the need for action to limit strategic dependencies”. A meeting of the leaders from Romania, Great Britain, Poland, France and Germany with the pro-European president of the Republic of Moldova (ex-Soviet, majority Romanian), Maia Sandu was held on the sidelines of the main event. The Western partners have reaffirmed their determination to continue supporting the Republic of Moldova reach its goals of peace, prosperity and democracy – states the quoted source.\nPoverty. Almost 20 million children in the European Union were exposed to the risk of poverty and social exclusion last year, with Romania registering the highest level among EU member countries, according to the data published today by Eurostat. The figure refers to children aged up to 18 and is relatively stable compared to 2022. The highest values reported last year were in Romania (39%), Spain and Bulgaria, and the lowest in Slovenia, Finland and Lower Countries.\nParis. On Thursday evening, the centrist MP Yaël Braun-Pivet was elected leader of the new French National Assembly. According to the Radio Romania correspondent in Paris, there were three long rounds of secret voting for the president of the former assembly to regain her seat, thanks to the support received by the Macron camp, especially from the conservative right, the Republican Party. Analysts note that while the left-wing alliance, ranking first in the early elections, is unable to propose a common candidate for the position of prime minister, the cooperation between the Macron’s supporters and the Republicans for the presidency of the assembly could be an indication of the color of the future French government.\nFootball. The holders of the Romanian Football Cup, Corvinul Hunedoara, (south-west) has qualified for the second preliminary round of the Europa League, although they were defeated by the Hungarian vice-champion, Paksi FC, with a score of 2-0, on Thursday evening, in Sibiu (center), in the second leg of the first round. Returning after four decades in the European cups, the squad from Hunedoara had won the first match, in Hungary, 4-0. In the next round, they will take on the Croatian team NK Rijeka. Qualified for the 2nd preliminary round of the Champions League, after 11-1 overall with Virtus of San Marino, the holder of the title in Romania, FCSB (Bucharest), will play next against Maccabi Tel Aviv, from Israel. In the second preliminary round of the Conference League, Universitatea Craiova (south) will face the vice-champion of Slovenia, NK Maribor, and CFR Cluj (north-west) will play against the Belarusian team Neman Grodno.\nTennis. 7th seed Romanian tennis player Jaqueline Cristian, qualified, on Thursday evening, for the quarter-finals of the WTA 250 tournament in Palermo (Italy), with 232,244 euros in prize money, after defeating the Italian Lucia Bronzetti 6-3, 6-2. In the quarters, Jaqueline Cristian will face the 1st seed Chinese Qinwen Zheng (21 years old, 7 WTA). The other player from Romania qualified for the quarters, Irina Begu, will play against the American Ann Li (24 years old, 127 WTA). (MI)",
  "word_count": 764,
  "scraped_at": "2026-02-14T02:25:54.613441",
  "_text_extracted": true
}