{
  "article_id": "52f93943e9c8",
  "url": "http://thepeninsulaqatar.com/article/27/04/2025/al-sadd-seek-to-turn-domestic-dominance-into-asian-success-in-kawasaki-quarter-final",
  "title": "Al Sadd seek to turn domestic dominance into Asian success in Kawasaki quarter - final",
  "date": "20250427T093000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nAl Sadd's Cristo Gonzalez (left) and Guilherme Torres during a training session yesterday.\nDoha, Qatar: Qatar giants Al Sadd are in the midst of a dream domestic campaign – crowned Qatar Stars League champions, finalists in the Qatar Cup, and strong contenders to defend their Amir Cup title. But today, Felix Sanchez’s side will step onto a different stage as they face Japan’s Kawasaki Frontale in the AFC Champions League Elite quarter-finals in Jeddah.\nThe Wolves have delivered outstanding performances on the domestic front, overtaking long-time leaders Al Duhail to clinch the QSL crown before thumping Al Ahli 3-0 in the semi-finals to book a place in the Qatar Cup final. They are also favourites to reach the Amir Cup final on May 24 as they face Second Division side Al Kharaitiyat in the Round of 16 next week.\nAl Sadd captain Hassan Al Haydos said the team is brimming with confidence, with all players eager to maintain their form on the continental stage.\n“Winning the league title recently has been a motivation for us. We’ve been improving and qualified for the Qatar Cup final,” said the two-time Asian Cup-winning former Qatar skipper, who was quick to acknowledge the challenge posed by Kawasaki.\n“It is a different competition and facing Kawasaki in the quarter-finals will be tough. But we are fully focused and determined to achieve a positive result. We need to stay focused against them,” Al Haydos said on the eve of the clash at Prince Abdullah Al Faisal Stadium. The match will kick off at 7pm.\nSeeking their first Asian crown since 2011, Al Sadd defeated Al Wasl in the Round of 16, while Kawasaki advanced after overcoming Shanghai Shenhua.\nAl Sadd coach Sanchez expressed his satisfaction at reaching the quarter-finals, stating that his team is aiming for further success on the continental stage.\n“We’re among the top eight clubs in Asia. We know it will be a tough match, but the players are ready. We’ve been following Kawasaki in the Japanese league – they have strong individual players and good solutions. But we’ll focus on ourselves and if we give our best, we can compete with any team,” he said.\n“We’ll approach the Kawasaki match as if it were a final. After that, we’ll look to the next game. We have to take things step by step and stay focused only on tomorrow’s match.”\nKawasaki head coach Shigetoshi Hasebe, meanwhile, anticipated a tough match against Al Sadd.\n“Al Sadd are a very strong team with an experienced coach and players. We have to keep our attacking football and show that. And we cannot concede goals easily,” he said.\n“Our target is of course to win the three games and the title, but the most important thing now is to focus on the first one and win that.”\nThe semi-finals will be played on Tuesday and Wednesday, with the title clash scheduled for May 3 at King Abdullah Sports City Stadium.\nThe final will not only determine the champion but also offer a record prize pool of at least $12m.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 580,
  "scraped_at": "2026-02-14T02:09:01.855758",
  "_text_extracted": true
}