{
  "article_id": "52fef522e391",
  "url": "https://www.themag.co.uk/2025/03/heres-the-photo-all-newcastle-united-fans-are-absolutely-loving-on-monday-west-ham-0-newcastle-1/",
  "title": "Here the photo all Newcastle United fans are absolutely loving on Monday",
  "date": "20250311T014500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Here’s the photo all Newcastle United fans are absolutely loving on Monday\nWest Ham 0 Newcastle 1 – Monday 10 March 8pm\nThe photo that Newcastle United fans had all really really wanted to see on Monday night.\nA hard fought match to say the least.\nNewcastle the better team against a negative West Ham set-up but the players toughed it out.\nHarvey Barnes delivered a sweet ball and Bruno getting his reward when guiding it home via his studs.\nWhilst the better football generally came from Newcastle, nobody would claim this was victory via great play.\nIt was all about character and after recent setbacks, Eddie Howe and his players did us proud.\nA winning snapshot post-match.\nAnother photo = The twentieth of this season.\nThe Newcastle United Head Coach introduced this tradition of a post-match everybody included photo following each victory, as he felt it had worked as a bonding exercise when he was at Bournemouth.\n(It is actually the twenty second victory of the season for United but for whatever reasons, no winning photo after the win over AFC Wimbledon. Then at the Emirates, I think for sure that no post-match dressing room photo was done due to the fact the Arsenal semi-final tie was only at halfway.)\nGreat to see, as NUFC fans have had to wait 15 days and a couple of defeats before seeing another winning dressing room photo.\nIt is also a massive bonus just how much it winds up fans of certain other clubs and journalists.\n‘Look at them, think they have won the Premier League / Champions League… etc etc’\nI absolutely love it.\nTen more Premier League games to go, as well as the small matter of Sunday at Wembley, so hopefully many more of these photos to come this season.\nWest Ham 0 Newcastle 1 – Monday 10 March 8pm\n(Stats via BBC Sport)\nGoals:\nNewcastle United:\nBruno 63\nWest Ham:\nPossession was Newcastle 49% West Ham 51%\nTotal shots were Newcastle 9 West Ham 9\nShots on target were Newcastle 3 West Ham 2\nCorners were Newcastle 4 West Ham 3\nTouches in the box Newcastle 28 West Ham 21\nNewcastle team v West Ham:\nPope, Trippier, Schar, Burn, Livramento, Joelinton, Tonali, Bruno (Longstaff 88), Barnes (Willock 79), Isak (Wilson 79), Murphy\nUnused subs:\nDubravka, Targett, Krafth, Osula, Miley, Neave\n(West Ham 0 Newcastle 1 – Instant Newcastle United fan/writer reaction – Read HERE)\n(Match Report – Massive for Champions League AND Carabao Cup Final – West Ham 0 Newcastle 1 Read HERE)\nThe remaining Newcastle United match schedule:\nSunday 16 March – Newcastle v Liverpool (4.30pm) Carabao Cup final Sky Sports\nWednesday 2 April – Newcastle v Brentford (7.45pm)\nMonday 7 April – Leicester v Newcastle (8pm) Sky Sports\nSunday 13 April – Newcastle v Man U (4.30pm) Sky Sports\nWednesday 16 April – Newcastle v Palace (7.30pm)\nSaturday 19 April – Villa v Newcastle (5.30pm) Sky Sports\nSaturday 26 April – Newcastle v Ipswich (3pm)\nSaturday 3 May – Brighton v Newcastle TBC\nSaturday 10 May – Newcastle v Chelsea TBC\nSunday 18 May – Arsenal v Newcastle TBC\nSunday 25 May – Newcastle v Everton (4pm)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 545,
  "scraped_at": "2026-02-14T01:49:31.516533",
  "_text_extracted": true
}