{
  "article_id": "52ff2e0d699f",
  "url": "https://www.geosuper.tv/latest/30942-uefa-champions-league-schedule-for-final-matchday",
  "title": "UEFA Champions League schedule for final matchday",
  "date": "20231211T153000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nDecember 11, 2023\nThe last week of group stage action will take place this week during the ongoing UEFA Champions League.\nThe likes of Napoli, Galatasaray, Milan, Shakhtar, Paris and Manchester United are still in the race for the four remaining knockout spots.\n12 December\nGroup A: Man United vs Bayern, Copenhagen vs Galatasaray\nGroup B: Lens vs Sevilla (18:45), PSV Eindhoven vs Arsenal (18:45)\nGroup C: Napoli vs Braga, Union Berlin vs Real Madrid\nGroup D: Inter vs Real Sociedad, Salzburg vs Benfica\n13 December\nGroup E: Atlético de Madrid vs Lazio, Celtic vs Feyenoord\nGroup F: Dortmund vs Paris, Newcastle vs Milan\nGroup G: Leipzig vs Young Boys (18:45), Crvena zvezda vs Man City (18:45)\nGroup H: Porto vs Shakhtar, Antwerp vs Barcelona\nAll kick-off times 21:00 CET unless stated\nThe draw for the round of 16 will be held on Monday 18 December, from noon CET. Group winners will be drawn against runners-up, though no side can face another team from the same national association and clubs cannot face opponents they met during the group stage.\nThe round of 16 first legs will be held over two weeks. The first leg will take place on 13/14/20/21 February, meanwhile the second legs are scheduled for 5/6/12/13 March.\nThis is the 69th season of Europe's elite club competition and the 32nd since it was renamed the UEFA Champions League.\nThe 2023/24 UEFA Champions League final will take place at London's historic Wembley Stadium.\nThe UEFA Champions League trophy stands 73.5cm tall and weighs 7.5kg.\n\"It may not be an artistic masterpiece, but everybody in football is keen to get their hands on it,\" said creator Jürg Stadelmann.\nThe winners will also earn the right to play against the champions of the 2023/24 UEFA Europa League in the 2024 UEFA Super Cup.",
  "word_count": 305,
  "scraped_at": "2026-02-14T02:17:09.412001",
  "_text_extracted": true
}