{
  "article_id": "5302a0fce0a0",
  "url": "https://www.caughtoffside.com/2025/08/30/aston-villa-want-lucas-paqueta-tottenham-target/",
  "title": "Aston Villa working to sign Lucas Paqueta from West Ham",
  "date": "20250830T230000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa are interested in signing Lucas Paqueta from West Ham United before the summer transfer window closes.\nAccording to a report from the BBC, the two clubs have held initial discussions regarding a total package of around £50 million for the Brazilian. Aston Villa are hoping to sign the player on loan with an obligation to buy. The £50 million package will include the loan fee.\nAston Villa could use Lucas Paqueta\nMeanwhile, West Ham are still hoping to keep the 28-year-old Brazilian, but he is open to joining Aston Villa before Monday’s transfer deadline. The Brazilian midfielder has been a key player for West Ham since joining the club. It remains to be seen how the situation develops. Tottenham Hotspur and Everton are keen on signing the midfielder as well.\nAston Villa could use more quality and depth in the middle of the park, and Brazilian would be the ideal acquisition. They have an ambitious project and quality. They have a top-quality manager like Unai Emery as well. It is no surprise that the Brazilian is open to joining them.\nSpurs keen on Paqueta\nMeanwhile, Tottenham could be an exciting destination as well. They will be able to offer him Champions League football. It remains to be seen whether they decide to make a move for the player before the window closes.\nThey need more technical ability in the middle of the park, and the Brazilian could be the ideal fit. He is a hard-working midfielder who is capable of operating in multiple roles. He will help Tottenham and Aston Villa improve.\nThe 28-year-old has been linked with top clubs in the past. This could be the right time for him to try out a new challenge. It will be interesting to see if West Ham are prepared to sanction his departure.",
  "word_count": 304,
  "scraped_at": "2026-02-14T01:58:57.501665",
  "_text_extracted": true
}