{
  "article_id": "530be158ad47",
  "url": "https://www.90min.com/posts/luke-shaw-injury-progress-potential-return-man-utd-defender",
  "title": "Luke Shaw injury : Progress & potential return for Man Utd defender",
  "date": "20240222T034500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luke Shaw injury: Progress & potential return for Man Utd defender\n- Luke Shaw has missed over 200 games through injury since joining Man Utd\n- Left-back was out for three months earlier in the season\n- Shaw picked up new setback in recent 2-1 win over Luton Town\n2023/24 had once been regarded as a campaign of tumult at Old Trafford, but 2024 has been much more steady for Manchester United so far.\nErik ten Hag's side have been productive without particularly impressing in the Premier League, with their recent string of victories thrusting them back into top-four contention. Defeat against Fulham has thrown up the same old doubts, but there have been evident improvements in Manchester.\nHowever, injuries have once again threatened to derail Man Utd's campaign, with the likes of Lisandro Martinez and Rasmus Hojlund having added their name to an extensive list of absentees.\nUnfortunately for the Red Devils, first-choice left-back Luke Shaw is also set for another spell on the sidelines, having already missed much of the season through injury.\nWhat injury does Luke Shaw have?\nHaving seemingly put his injury issues behind him for the season, Shaw is now set for another chunk of time in the treatment room after sustaining a serious muscle injury at Kenilworth Road on 18 February.\nWhile Man Utd provided no further clarification on the exact nature of the injury, the England defender was withdrawn in the first half against Luton in what is another massive blow to Ten Hag and Man Utd.\nWhen could Luke Shaw return from injury?\nThe bad news for Man Utd supporters is that Shaw will likely be out for the rest of the season - or at least the bulk of it - after the club confirmed he will spend several months on the sidelines despite \"further assessment\" being needed.\nThat potentially puts his participation with England at Euro 2024 in doubt as well, especially if he suffers any setback or complications on the road to recovery. However, even if he doesn't play another minute for the Red Devils this term, Shaw is likely to be in Gareth Southgate's squad if fit by this summer's tournament.\nWhat Man Utd games has Luke Shaw missed due to injury?\nShaw is likely to miss the remainder of a difficult season for Man Utd as the club desperately push to finish inside the top four. However, his absence has proved costly so far, with the Red Devils falling to a 2-1 defeat in the only game since he's been sidelined.\nFulham were the side to put Man Utd to the sword, with Alex Iwobi grabbing all three points for the Cottagers at Old Trafford last weekend with a 97th-minute counter-attack goal.\nHow have Man Utd done without Luke Shaw and who has replaced him?\nMan Utd seriously struggled without Shaw earlier in the season, even drafting in Sergio Reguilon on loan from Tottenham to cover for him. Things didn't go particularly smoothly, with Shaw's return helping the Red Devils rediscover some of last season's form.\nHowever, they will have to cope without the left-back again moving forward, with Tyrell Malacia's long-term injury only exacerbating things. Victor Lindelof featured on the left side of defence against Fulham, but didn't enjoy the Cottagers' trip to Old Trafford, putting in a questionable display defensively.",
  "word_count": 555,
  "scraped_at": "2026-02-14T01:56:44.622468",
  "_text_extracted": true
}