{
  "article_id": "5326a14edf49",
  "url": "https://thepeoplesperson.com/2023/01/13/manchester-united-the-only-english-club-left-in-four-competitions-258079/",
  "title": "Manchester United the only English club left in four competitions",
  "date": "20230113T214500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s 13 August 2022, and Manchester United’s heads are hung low in disappointment with nowhere to hide after a 4-0 drumming at the hands of Brentford. Hardly anyone would have predicted United’s now fortunate predicament.\nAccording to The Athletic, United are the only team that can boast that they’re still in four major competitions (via The Athletic).\nThe resurgence of Old Trafford is a tangible possibility, and the turnaround from previous misgivings a factual reality.\nThe return of the Red Devils\nUnited went into the break for the World Cup in impressive form. Since the return of competitive football, they’ve managed to maintain the momentum.\nErik ten Hag’s men have won 11 in 12 games and are now in fourth place in the Premier League. United also have a semi-final clash with Nottingham Forest in the Carabao Cup and a fourth-round battle against Reading in the FA Cup.\nIt’s a feat that few would have foreseen.\nThe calm before the storm\nThe majority of opponents faced during this run of good form were favourable.\nNonetheless, it is plain to see that Ten Hag turned what seemed like a motley crew of uninspired players into a well-oiled competing machine.\nUnited transition fluidly into sharp counterattacks reminiscent of United teams of old.\nSimilarly, the backline is solid and unforgiving in the tackle. This balanced team has fashioned United’s longest winning streak since the beginning of the Ole Gunnar Solskjaer era.\nHowever, the revival of United aside, there is still the matter of featuring in four competitions. Manchester United is the only English club to have to compete on four fronts – an ordeal that can be very taxing on players.\nTen Hag is more than aware of this but has only been able to bring in Wout Weghorst on a short-term loan to combat his human resource problem. Ten Hag’s side still lacks an out-and-out striker who can deliver 20 goals comfortably – an asset most big clubs have at their disposal.\nA necessary evil\nWith everything still to play for but limited resources, there might be merit in forfeiting one or more competitions. It wouldn’t be the first time a United side chose a necessary evil for the greater good of adding silverware to the trophy cabinet.\nAs The Athletic’s Carl Anka points out, ex-United boss Jose Mourinho prioritised the Europa League over a top-four finish in the league. It was a risky strategy, but ultimately United won the club’s most recent piece of silverware and qualified for the Champions League.\nThere’s a thin line between bravery and brashness or pride and prudence. It will be up to United’s competitive 52-year-old manager to find the balance this season.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 541,
  "scraped_at": "2026-02-14T01:53:21.842798",
  "_text_extracted": true
}