{
  "article_id": "53616c81095e",
  "url": "https://www.the42.ie/5-reasons-for-man-citys-dramatic-collapse-6571943-Dec2024/",
  "title": "5 reasons for Man City dramatic collapse",
  "date": "20241215T104500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "1. Rodri’s prolonged absence\nMAN CITY have generally dealt well with the absence of key players in recent seasons.\nHowever, Rodri is arguably their one indispensable squad member.\nIt is no coincidence that the reigning champions have a far superior record with the 2024 Ballon d’Or winner than without.\nGuardiola’s side won their opening four Premier League games before losing the 28-year-old to an ACL injury\nRodri said last month that he hoped to return to action by the end of this season.\nBut City will likely have to cope without him for most of the campaign and they have struggled to adapt in the interim.\nGuardiola has tried playing the likes of Ilkay Gundogan, Mateo Kovačić and Rico Lewis in the holding midfield role.\nBut the evidence suggests they have no one of Rodri’s calibre to fill the void.\nThe club will undoubtedly be tempted to rectify this issue in the January transfer window.\nOne potential solution is Martin Zubimendi, the Spanish international who rendered Rodri’s absence barely noticeable when he replaced him at half-time of the Euro 2024 final win over England.\nReal Sociedad star Zubimendi has already rejected a move to Liverpool, so there is no guarantee he will agree to join City.\nNewcastle’s Bruno Guimaraes is another player strongly linked with the Etihad outfit, who must surely act promptly to alleviate the glaring problem.\n2. Bad Pep Guardiola decisions\nWhatever happens between now and the end of his football career, Guardiola will be remembered as someone pivotal to transforming the way football has been played in the last two decades and a figure who is among the greatest coaches ever.\nBut for all his brilliance, Guardiola is not infallible.\nWhile the players are largely responsible for the team’s poor performances, some bad decision-making by the manager has exacerbated their issues.\nThe most obvious example is the case of Cole Palmer — the man driving Chelsea to new heights in the Premier League this season.\nThe 22-year-old is somewhat of a maverick and the point has been made that such a player would have been difficult to fit into a Guardiola side.\nHowever, occasionally, individuals can be so talented that it is worth changing the structure of the team to benefit them rather than expecting these stars to adapt to the system.\nThat is what Guardiola did for Erling Haaland and perhaps he now regrets not accommodating Palmer.\nOf course, it is not always easy to predict which young players are destined for greatness.\nAnd Palmer wasn’t exactly ostracised at City — he made 19 appearances, scoring zero goals, causing some people to baulk at the €48 million fee paid as another example of reckless spending by Chelsea.\nSince then, however, the England international has justified his price tag, scoring 33 goals in 48 Premier League appearances.\nIt is not the only ostensible gaffe Guardiola has made in the transfer market.\nOther talented young players including Julian Alvarez, Liam Delap and Aymeric Laporte were conceivably dispensed with prematurely.\nConsequently, with several serious injury problems, their expensively assembled squad has looked very thin at times this season.\n3. The 115 charges hanging over them\nThe hearing over Man City’s 115 Premier League charges concluded this week with an outcome drawing closer.\nThe charges were first announced in February 2023, so this saga is almost two years old.\nFor much of that time, they have not looked like a side with the weight of the world on their shoulders.\nHowever, the continual speculation and doubt cast on their innocence is bound to be wearying for everyone at the club.\nIt would be naive to dismiss suggestions this problem has impacted on-field performances.\nEqually, this hearing has ostensibly influenced their recent behaviour in the transfer market.\nThis summer, their only two signings were Ilkay Gundogan on a free deal and Savinho for €25 million — modest spending by their standards.\nBy comparison, the season before after winning the treble, they spent a reported total of €280 million on the likes of Joško Gvardiol, Jérémy Doku and Matheus Nunes.\nWhether they are innocent or guilty, at this stage City will surely be keen to get this unwanted distraction out of the way and be able to move on.\n4. An ageing squad\nWhen you consider the Man City squad, it’s worth looking at not just the age of individual players but the number of games they play at the highest level.\nIn football, the best players invariably play the most games.\nMany of City’s squad were at Euro 2024 so did not get an extensive break over the summer.\nThe likes of Kyle Walker (34), Kevin De Bruyne (33), Ederson (31), İlkay Gündoğan (34) and Bernardo Silva (30) have struggled at times this season to replicate the high standards they set in previous campaigns.\nEven a 24-year-old and last season’s Footballer of the Year, Phil Foden, has shown signs of burnout after a demanding summer that saw his England side nearly go all the way at the Euros.\nIn addition, some of the less established players have not produced the types of performances that put pressure on the experienced pros to perform.\nJack Grealish, Jérémy Doku, Matheus Nunes, Savinho and Joško Gvardiol may yet become invaluable players. But this contingent have yet to fully justify the many millions the club has spent on them.\n5. The strengthening of others\nGuardiola has suggested that it might be a rare instance in the Premier League this season of the champions not prevailing by picking up 90-plus points as has tended to be the case for much of the last decade.\nWith all the money spent, the Premier League has long been cited as the best domestic competition in the world.\nThe fact that City have won the last four successive titles undermines that point to an extent.\nWhile the collapse has primarily been down to their negligence, it also does seem to have coincided with a Premier League where the talent is more evenly distributed than in past seasons — both on the field and behind the scenes.\nEven leaders Liverpool have dropped points in seemingly winnable games against Nottingham Forest, Newcastle and Fulham.\nMuch has been made of City unexpectedly losing seven of their last 10 matches, but when you hone in on the defeats, it is more explicable.\nDomestically, they have lost to the likely title winners in Liverpool, a Spurs side with enough talent to overcome any top-flight opponent on their day, as well as Brighton and Bournemouth teams who are massively outperforming their status as one of the league’s supposedly weaker outfits — both are in the top 10 and only a few points off City in fourth.\nGuardiola’s side standards have certainly dropped, but others — perhaps buoyed by the shock City collapse — have undoubtedly raised theirs.",
  "word_count": 1140,
  "scraped_at": "2026-02-14T01:58:00.748732",
  "_text_extracted": true
}