{
  "article_id": "53862c0944d7",
  "url": "https://cosafa.com/trio-up-for-cosafa-womens-most-promising-player-award-had-a-stellar-year/",
  "title": "COSAFA | Trio up for COSAFA Women Most Promising Player Award had a stellar year",
  "date": "20240418T141500Z",
  "domain": "cosafa.com",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Trio up for COSAFA Women’s Most Promising Player Award had a stellar year\nThe nominees for the COSAFA Women’s Most Promising Player Award for 2023 all had an outstanding year and will have a bright future in the game no matter who goes away with the top prize.\nThe award has been introduced to shine a light on the budding stars of tomorrow, but who have enjoyed success today, and provides encouragement to young players across the region that they too can receive recognition for their talent.\nZambian Esther Banda has been nominated along with the 17-year-old Malawi duo of Leticia Chinyamula and Rose Kadzere.\nThe final three was selected from a longer list of candidates, and while there may always be those who would have liked to see another name present, no-one can dispute they deserve their place in the final three.\nBanda, 19, was on the radar before 2023 having travelled to the Women’s Africa Cup of Nations in Morocco the year before, though she did not play.\nIt was the same story at the 2023 FIFA Women’s World Cup where was part of the squad but did not make it onto the pitch.\nDespite this, both those experiences at two major international competitions will hold her in good stead and her objective now will be to be a part of the Zambia squad at the Paris 2024 Olympic Games later this year, having helped them reach the tournament.\nShe did feature at the 2023 COSAFA Women’s Championship and was a stand-out performer for Zambia as they took home the silver medal, losing 2-1 to Malawi in the final.\nShe also helped her club Green Buffaloes to the semifinals of the COSAFA Women’s Champions League, where they were defeated by eventual winners Mamelodi Sundowns. Again, more big international tournament experience for her to learn.\nOne of Banda’s rivals for the COSAFA Women’s Most Promising Player Award is Malawi youngster Chinyamula, who is only 17 but has technical qualities well beyond her years.\nHer year started with helping Ascent Academy to the final of the FAM National Women’s Championship where the young team was ultimately beaten by Ntopwa, but still recorded a major achievement that showed all their potential.\nThat led to international recognition and selection for the 2023 COSAFA Women’s Championship, where Malawi would go on to take the gold medal, with Chinyamula playing an integral part.\nShe netted in a famous 4-3 victory over South Africa in their opener and scored again against Madagascar in the pool stages and was one of the stars of the historic maiden regional title for the Malawians.\nIn the build-up to the tournament she also netted twice in a 17-0 win over Seychelles.\nChinyamula’s club and national teammate Kadzere had a year that mirrored hers closely, and with only four days separating the duo in age, they have much in common.\nKadzere has shown her huge potential the year before when she finished as top-scorer in the 2022 COSAFA Under-17 Women’s Championship and was able to translate that form to the senior national team.\nShe enjoyed the same success with the Ascent Academy and also netted against Seychelles in one of Malawi’s twin 17-0 wins over the islanders, and got a goal against Eswatini in the COSAFA Women’s Championship pool stages. She played in every match, including starting the final.\nWhoever ultimately wins the COSAFA Women’s Most Promising Player Award, there is no doubt all three nominees deserve their recognition and have a big future in the game if they can continue to develop.\nThe winner will be announced at a gala awards ceremony in Johannesburg on May 9, with a panel of judges from across the region having assessed their performances for the period of January 1 to December 31, 2023.\nThe judging panel from across the 14 member nations that make up COSAFA are renowned for their knowledge of Southern African football and are as follows:\nHoussamidine Ben Ahmed (Comoros), Ivan Capuepue (Angola), Rob Delport (South Africa), Gerard Govinden (Seychelles), Peter Kanjere (Malawi), Jesse Kauraisa (Namibia), Kagiso Kgaogano (Botswana), Sibusiso Masilela (Eswatini), Sandra Mwila (Zambia), Boitelo Radebe (Lesotho), Heriniaina Samson (Madagascar), Benoit Thomas (Mauritius), Steve Vickers (Zimbabwe) and Raimundo Zandamela (Mozambique).",
  "word_count": 702,
  "scraped_at": "2026-02-14T01:51:24.797783",
  "_text_extracted": true
}