{
  "article_id": "5389acf2e5ca",
  "url": "https://thetrivelaeffect.com/ranking-the-5-best-managers-at-euro-2024/",
  "title": "Ranking the 5 best managers at Euro 2024 - The Trivela Effect",
  "date": "20240617T140000Z",
  "domain": "thetrivelaeffect.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Euro 2024 gets underway and the storylines develop during this exciting tournament, it’s time to take a look at the key decision-makers who can often make the difference between a team exceeding expectations and flopping.\nHere is a ranking of the five best managers at Euro 2024. Some of these managers are well-known and have acclaimed resumes from club coaching, while others are proven at an international level, too.\nFrench national team manager Didier Deschamps and England national team manager Gareth Southgate are big, polarizing names and have taken teams far in tournaments, but their track records at the club level are lacking and their achievements at the international level in comparison to expectations are also lukewarm.\nBoth of those things count when assessing the best managers at Euro 2024 and ranking them in order.\n5. Domenico Tedesco, Belgium\nDomenico Tedesco replaced Roberto Martinez as Belgium’s manager, and even though he isn’t as big of a name, the Italian-German coach has a strong resume at the club level.\nYou may recall that Tedesco inexplicably led Schalke to second in the 2017/18 Bundesliga season. He finished 14th in the 2018/19 and got sacked, but considering how woeful the Royal Blues have been since then, Tedesco honestly wasn’t doing a bad job then either.\nThe fact that he pushed Bayern Munich a bit in the 2017/18 season with a team that would become the worst in German footballing history just a couple of years later is a massive accomplishment.\nTedesco would then join Spartak Moscow before returning to the Bundesliga to coach RB Leipzig. He only lasted one season in Leipzig, but he helped bring them their first trophy with the immense Christopher Nkunku in his side, as they took home the DFB Pokal over underdogs Freiburg.\nAlthough Tedesco’s philosophy is controversial and he doesn’t last long at any given stop, he has legitimate accomplishments at the club level and is thus one of the top coaches at Euro 2024.\n4. Zlatko Dalic, Croatia\nZlatko Dalic will forever base his name off helping Croatia reach the 2018 World Cup Final, defying the odds and perfectly guiding a team of world-class veterans.\nIn truth, Dalic probably didn’t have to do a whole lot of coaching with players like Luka Modric, Ivan Rakitic, Ivan Perisic, Mario Mandzukic, and Domagoj Vida in his XI.\nAlthough these five players represent the upper echelon of international football, not everyone in that Croatia side was at that level, and there were some volatile attacking personalities on the bench.\nBut Dalic did everything right and even helped make the world aware of some breakout stars like Ante Rebic\nAt the next World Cup, Croatia would finish third, producing even more breakout stars, such as current Manchester City standout Josko Gvardiol.\nCroatia have been disappointing in the European Championships over the last few tournaments, but Dalic deserves plenty of praise for what he has done as his country’s manager at the international level.\n3. Ralf Rangnick, Austria\nAustrian national team manager Ralf Rangnick remained committed to the team and rejected overtures from Bayern Munich, who were interested in hiring the Bundesliga coaching legend to turn their tumultuous organization around.\nRangnick couldn’t quite do that at Manchester United because of their impossible circus, but time has proven the German coach correct, given the Man United’s struggles since then and the fact that the Glazers are indeed out.\nThose deriding Rangnick as a failed manager are ignoring years of evidence of his ability to run successful organizations, as he wisely used the resources at Hoffenheim and RB Leipzig to turn them in to Champions League sides after starting in the lower divisions from the ground up.\nRangnick is even proven at the highest level, too, as he successfully coached Schalke, one of the three biggest clubs in Germany, to the DFB Pokal and even a Champions League semifinal.\nSo many great managers and tactical ideas today have come from Rangnick, who transformed the way Germany played its football and helped them find the ideas that turned their international results around 20-30 years ago.\n2. Luciano Spalletti, Italy\nNapoli went from winning their first Scudetto since the days of Diego Armando Maradona to not even qualifying for European football after losing Luciano Spalletti.\nThe Italian manager blew away the likes of Max Allegri and Jose Mourinho, proving that he should be as big of a name as anyone in European football at the managerial position.\nSpalletti is adept at getting the most out of his players, trusting them, developing them, and putting them in positions to succeed with tactics that are as simple as they are elegant.\nAlready, Italy look like a much stronger, more balanced, and more consistent team under Spalletti, who does a great job of identifying his best players and their best roles.\nBefore his sensational 2022/23 season with Napoli, Spalletti won two Coppe Italie with Roma and the Russian Premier League twice with Zenit. He is a three-time Serie A Coach of the Year.\n1. Julian Nagelsmann, Germany\nGerman national team manager Julian Nagelsmann comes directly from the Ralf Rangnick coaching tree, as the current Austrian national team manager was his boss at both the Hoffenheim and RB Leipzig projects.\nNagelsmann is the biggest coaching phenom in the history of German football and was selected by Bayern Munich to lead their new era, yet the club inexplicably gave up on him in the middle of the 2022/23 season in what could prove to be one of the worst organizational decisions in the history of modern German football.\nThat may seem like an outrageous statement, but if the early turnaround is anything to go off, Nagelsmann is an upgrade over two acclaimed German coaches in Joachim Low and Hansi Flick.\nFor the first time since they won the 2014 World Cup, Germany looks like a well-oiled machine, and they are even more exciting now than they were back then because of the successful integration of young stars Jamal Musiala, Florian Wirtz, and Kai Havertz.\nNagelsmann has also accurately identified several underrated Bundesliga stars as key players for the German national team, including Stuttgart left-sided standouts Maximilian Mittlestadt and Chris Fuhrich.\nAlready accomplished at the club level, Nagelsmann is one of the best managers in the world at the age of 36 and could be writing an impressive legacy at the international level with Germany.\nJoe Soriano is the editor of The Trivela Effect and a FanSided Hall of Famer who has covered world football since 2010. He’s led top digital communities like The Real Champs (Real Madrid) and has run sites covering Tottenham, Liverpool, Juventus, and Schalke. He also helped manage NFL Spin Zone and Daily DDT, covering the NFL and pro wrestling.",
  "word_count": 1124,
  "scraped_at": "2026-02-14T01:54:40.189389",
  "_text_extracted": true
}