{
  "article_id": "53a67fd60e46",
  "url": "https://www.thenationalnews.com/business/economy/2025/09/07/uae-gdp-hits-dh455bn-in-first-quarter-as-non-oil-economy-breaks-another-record/",
  "title": "UAE GDP hits Dh455bn in first quarter as non - oil economy breaks another record",
  "date": "20250907T134500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UAE’s economy maintained strong momentum in the first quarter of 2025, with real gross domestic product rising 3.9 per cent year-on-year to Dh455 billion, according to preliminary estimates released by the Federal Competitiveness and Statistics Centre (FCSC).\nNon-oil GDP posted 5.3 per cent growth, reaching Dh352 billion, while oil-related activities accounted for 22.7 per cent of GDP.\nThe UAE broke another record in non-oil economic activities that contributed 77.3 per cent of total real GDP as the country continues to diversify its economy.\nNon-oil contributions to GDP stood at 71.3 per cent in 2020 and have gradually increased over the past five years.\nThe figures highlight the “strength and resilience of the national economy and its ability to continue its exceptional growth journey”, Abdullah bin Touq, Minister of Economy and Tourism, said in a Wam report on Sunday.\nHe noted that the performance reflects “the confidence of investors and the international community in the UAE’s business and investment environment, which has become a global model for adopting advanced economic policies and developing a legislative infrastructure that stimulates growth”.\nThe minister added that the milestone non-oil contribution affirms the UAE’s success in implementing its diversification strategy, aligned with the We the UAE 2031 vision, which aims to raise the country’s GDP to Dh3 trillion by the next decade.\nHanan Mansour Ahli, director of the FCSC, said that the results confirm the efficiency of the UAE’s economic model and the government’s success in developing sectors on a sustainable basis. She said the non-oil growth rate of more than 5 per cent reflects the UAE’s push to build a knowledge – and innovation-driven economy that empowers businesses and entrepreneurs.\nManufacturing emerged as the fastest-growing sector in the first quarter of 2025, expanding 7.7 per cent compared with the same period last year. The finance and insurance and construction sectors followed with 7 per cent growth each, while real estate activities grew by 6.6 per cent and trade by 3 per cent.\nIn terms of contribution to non-oil GDP, trade led with 15.6 per cent, followed by finance and insurance (14.6 per cent), manufacturing (13.4 per cent), construction (12.0 per cent), and real estate activities (7.4 per cent).\nThe latest figures reinforce the UAE’s trajectory towards sustainable, diversified growth, supported by policies that emphasise innovation, investment, and global competitiveness.\nTrade agreements\nThe UAE has concluded 28 Comprehensive Economic Partnership Agreements (Cepas) to date with 10 already in effect and easing trade.\nIn the first quarter of 2025, the UAE’s non-oil foreign trade surged sharply with partners under these agreements – including a 33 per cent increase with India, 41 per cent with Turkey, 29 per cent with the US, and 15 per cent with China.\nTrade with non-Cepa partners also grew, while exports rose from 18.4 per cent to 21.4 per cent of non-oil trade, driven by strong demand for UAE-made goods and services.\nIn the first half of 2025, Abu Dhabi alone recorded a 34.7 per cent jump in non-oil foreign trade, reaching Dh195.4 billion – a testament to its strategic role as a logistics and trade hub, supported by its geographic advantage and modern infrastructure.\nThe UAE and EU have commenced free trade negotiations, aiming to enhance trade in goods, services, investments, and strategic sectors such as renewable energy, healthcare, and AI.\nIn April, UAE President Sheikh Mohamed and EU Commission President Ursula von der Leyen agreed to initiate the free trade agreement negotiations, with the official talks beginning in May.\nThe EU remains the UAE's second-largest trading partner with 8.3 per cent of non-oil trade.\nStrategic investments\nThe UAE’s progress has also been underpinned by major strategic investments across high-growth industries. In first quarter of 2025, there was a strong wave of mergers and acquisitions, with 63 deals worth more than $20 billion according to Wam in May, marking the highest in the Mena region.\nNotably, Abu Dhabi’s Group 42 acquired a significant stake in Khazna Data Centres, underscoring the nation’s commitment to expanding its digital economy and positioning itself as a regional technology hub.\nThe aviation sector also provided a substantial boost, following Etihad Airways’ landmark $14.5 billion agreement with Boeing and GE Aerospace for 28 wide-body aircraft powered by next-generation engines. This deal not only strengthens the UAE’s aviation industry but also drives demand in related sectors such as logistics, maintenance, and tourism.\nClean energy partnerships are also emerging as a cornerstone of the UAE’s non-oil growth. In January, the UAE signed a €1 billion agreement with Italy and Albania to develop renewable projects, including solar and wind infrastructure.",
  "word_count": 761,
  "scraped_at": "2026-02-14T01:49:53.055295",
  "_text_extracted": true
}