{
  "article_id": "53abc515401c",
  "url": "https://www.themag.co.uk/2025/04/what-is-wrong-with-first-come-first-served-newcastle-united-fans/",
  "title": "What is wrong with first come first served ? ",
  "date": "20250430T071500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What is wrong with first come first served?\nOn Saturday, I was amongst the 50,000 or so Newcastle United fans who had the privilege of watching NUFC see off what I thought was an aggressive Ipswich Town team.\nAlthough not firing on all cylinders, we came out of it comfortable winners with a three goal win and back up to third.\nI had predicted a five nil my lad being more conservative and on the money with a three nil call.\nIt will probably be our last home game of the season as our luck in the ballot appears to be drying up but I will continue to apply just like the many tens of thousands of others.\nAfter the game I met up with a couple of mates who I haven’t seen for more than a quarter of a century. The same lads (now in their very early sixties) who I stood shoulder to shoulder with and sometimes closer in the packed terraces of the Leazes, next to the away support.\nThey are season ticket holders now.\nOne lad who reads The Mag was quick to point out how much he disagreed with an article I had written about the importance of getting kids into the game.\nGreat debate, that’s what it is all about in my opinion, and I admit to writing some stuff to try and provoke people and so open up conversations.\nThis all in the shadow of the fact that when we were teenagers we had all paid in at the turnstiles together.\nFirst come first served, no problem.\nWe both agreed times have changed and you really should not compare the 1980s with the 2020s, two completely different worlds.\nHowever, the basic principle of getting into a game will not go away.\nWhat is wrong with first come first served?\nWhen I was pre-teenage, we would be waiting for when the turnstiles opened.\nTicket prices are rising and Manchester City fans didn’t take up some ten thousand tickets for a Wembley cup semi-final.\nA good article on The Mag pointing out how Man City and Chelsea time after time are not selling all their tickets when getting to FA Cup semi-finals.\nWhat a strange football world is evolving, where a European Champions League and treble winning team cannot sell their allocation for a cup semi-final.\nMeanwhile, the paradox which is the mission to acquire football tickets for Newcastle United games appears to be getting ever more difficult.\nMore and more Newcastle United fans, competing to get hold of a limited number of match by match tickets that are getting ever more expensive, season after season.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 455,
  "scraped_at": "2026-02-14T02:09:01.848924",
  "_text_extracted": true
}