{
  "article_id": "53da7c395d6a",
  "url": "https://www.teamtalk.com/news/chelsea-exclusive-explosive-osimhen-transfer-possible-boehly-crazy-package-table",
  "title": "Chelsea exclusive : Explosive Osimhen transfer IS possible with Todd Boehly putting crazy package on table",
  "date": "20231018T163000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea exclusive: Explosive Osimhen transfer IS possible with Todd Boehly putting crazy package on table\nChelsea are once again on the hunt for new players to help bolster the side as they try to turn around a slow start to the season that has seen them trailing in the race for Champions League football.\nThe club were in desperate need of a striker last summer and turned to RB Leipzig’s Christopher Nkunku and Villarreal talent Nicolas Jackson in a bid to try and get more goals in the side.\nWith Nkunku injured and Jackson struggling to lead the line, manager Mauricio Pochettino has expressed a desire to see a top-quality, experienced forward arrive at the club.\nNapoli striker Victor Osimhen has topped Chelsea’s wish list for a long time and sources at the club believe him to be the perfect solution to their goalscoring problems. Liverpool and Arsenal are also interested, however, so they could face competition for his signature.\nThe Blues have been keen to do a big-money deal for the Nigerian in previous transfer windows, but Napoli are desperate to hold onto their prize asset with Italian sources stating the Serie A holders won’t accept anything less than £140million.\nIn the last few weeks, an exit has become more likely after the Napoli social media team released highly offensive TikTok videos aimed at Osimhen after he missed a penalty against Bologna.\nThe 24-year-old even considered legal action against Napoli and is now more open to an exit from the Stadio Diego Armando Maradona.\nChelsea ready to splash out on Osimhen\nSources say the Chelsea recruitment team are on red alert and will jump if they see a realistic opportunity to bring in their dream target.\nThe London side have spent vast sums since the Todd Boehly-led takeover and are up against FFP as well as Premier League regulations, but the owners are confident of finding a way around this issue.\nTEAMtalk has been told that a deal for Osimhen in January is not impossible and that the owners are ready to move heaven and earth to bring the Napoli talisman to the club. The former Lille striker would become the highest-paid player at Stamford Bridge.\nDespite a plethora of signings in the summer, Pochettino’s side still need more goals if they are to match their rivals and obtain Champions League qualification, which was the club’s objective at the outset of this campaign.\nLast season’s top scorer in Serie A is contracted until 2025 and the Italian champions have been keen to tie him down to a new deal. Talks are on hold and the likelihood of a new contract has been squashed after recent events.\nA deal for Osimhen could become the biggest of the winter window and his agent Roberto Calenda has already begun looking and speaking to potential suitors for his client.\nDON’T MISS: Exclusive: Man City, Chelsea, Man Utd poised to battle for sensational 16-year-old Irish striker",
  "word_count": 492,
  "scraped_at": "2026-02-14T01:56:32.774295",
  "_text_extracted": true
}