{
  "article_id": "547ebbfc6c13",
  "url": "https://en.vietnamplus.vn/vietnam-to-host-first-afc-womens-champions-leagues-group-round-post288788.vnp",
  "title": "Vietnam to host first AFC Women Champions League group round",
  "date": "20240618T174500Z",
  "domain": "en.vietnamplus.vn",
  "source_country": "Vietnam",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hanoi (VNS/VNA) - Vietnam will host a group stage of the Asian Football Confederation (AFC) Women’s Champions League, which will be staged in August and when huge bonuses will be given away.\nThe continental football governing body recently confirmed that as many as 22 clubs will take part in qualification of the tournament's inaugural season, heralding a new era of success and progress for women’s football in Asia.\nClubs from the top eight member associations, as ranked according to FIFA, will qualify directly into the group stage, which comprises three groups of four teams to be contested in a centralised league format from October 6 to 12.\nThe remaining 14 clubs will have to make it through the preliminary stage that features four groups – two groups of four teams and two groups of three - to be played in a centralised league format between August 25 and 31, with the four group winners qualifying.\nJordan, Malaysia, Saudi Arabia and Thailand will host one group each in the preliminary stages, while China and Vietnam will be hosting one group each in the group stage. The third remaining host for the group stage will be identified after a draw and confirmed prior to the commencement of the group stage.\nNational reigning champions Ho Chi Minh City 1 will be the Vietnamese representative in this competition.\nThe official draw ceremonies for both the preliminary and group stages will be conducted on July 18 at the AFC House in Kuala Lumpur, Malaysia.\nThe dynamic format in line with the AFC drive to keep women's football flourishing, will feature the top two finishers of each group and the two best third-placed sides progress to the quarter-finals in March 2025.\nA knockout stage draw will be conducted prior to the quarter-finals to determine the four pairings, which will be contested in a single-leg format, with the higher-ranked team of each tie to serve as the home side.\nThis will be followed by a centralised finals, which will see the semi-finals and final, being played in single-leg ties, from May 21 to 24.\nAlong with the thrilling showcase of top-class women’s clubs, the organisers will deliver an attractive prize purse.\nEvery participating club in the group stage will receive a minimum of 100,000 USD each, with additional monies available depending on their eventual placings. It means that the first-ever champions of the prestigious tournament can expect to be rewarded with at least 1.3 million USD./.\nSee more\nThe image of horse in the lives of Vietnamese people\nHorses have long been embedded in Vietnamese culture, carrying layered symbolism in language and belief while remaining part of daily life in many ethnic minority communities.\nHorse mascot leaves strong impression at spring fair\nA major attraction is a unique “Eight galloping horses” (Bat Ma) sculpture displayed at the To Trinh gemstone booth. Carved from a rare monolithic jade block, the artwork features eight spirited horses racing across golden rice fields. The harmonious blend of pure jade veins and natural golden tones enhances both its aesthetic depth and symbolic meaning, evoking prosperity and abundance associated with Vietnam’s rice civilisation.\nTran Temple Festival 2026 to boast record 15 activities\nThe ceremonial part will proceed with full solemnity under traditional rites, including commemorative orations, incense offerings to the Tran Kings, water and land processions, and other ritual observances.\nFestive activities herald Lunar New Year of the Horse\nA vibrant array of cultural and media events has been launched across Vietnam to welcome the Lunar New Year of the Horse 2026, highlighting both the country’s enduring traditions and its dynamic socio-economic progress.\nHang Luoc - A market that blooms once a year, lives for generations\nSince the mid-point of the 12th lunar month, Hang Luoc street has assumed a celebratory guise. Soft and vivid pink peach blossoms, golden kumquat trees bowed under the weight of ripe fruit, and crisp white apricot blooms herald the onset of spring.\nColours, flavours of Vietnam’s three regions draw crowds at Spring Fair 2026\nEach culinary stall at the Spring Fair 2026 presents its own regional specialities, meeting on-site dining needs while promoting the richness of Vietnamese culinary culture.\nSun Group’s world record holding water park officially opens in Vung Tau\nAs the flagship zone of Sun World Vung Tau, Aqua Adventure spans 15 hectares and features 20 major attractions with nearly 100 high speed water slides. Holding multiple world records, it stands among the region’s leading water parks in both scale and advanced technology integration.\nProgramme revives traditional Tet in ancient capital\nIts activities recreate the traditional Tet (Lunar New Year Festival) atmosphere of the former royal court. Visitors enjoyed court and folk games, immersive light displays, and traditional Tet cuisine.\nSpring Fair 2026: Central Highlands culture showcased in capital\nExhibition spaces of Gia Lai and Dak Lak provinces in the Central Highlands have made a strong impression by combining agricultural product displays with cultural performances, offering visitors a unique and engaging experience.\nSpring Calligraphy Festival 2026 opens in Hanoi\nA central attraction remains the traditional New Year calligraphy request activity, featuring 35 booths staffed by calligraphers selected through a rigorous, transparent evaluation process.\nPhoto, video contest “Happy Tet” spreads message of peaceful, compassionate Vietnam\nThrough photos and videos, the contest seeks to honour the traditional values of Vietnam’s biggest and most important festival.\nImperial rituals revived in Hue with reenactment of Nguyen Dynasty New Year royal audience\nThe royal audience ceremony, one of the most significant court rituals under the Nguyen Dynasty, was traditionally held on the first day of Tet. Favourable weather conditions this year helped draw large crowds of both domestic and international visitors.\nUnique Lunar New Year traditions on display\nEach ethnic group brings its own unique Tet customs to the Vietnam National Village for Ethnic Culture and Tourism on the outskirts of Hanoi, creating a rich and colourful cultural mosaic.\nCultural, people-to-people interactions anchor Vietnam–Poland relations: diplomat\nSkoczek also pointed to striking similarities between Vietnam’s Tet and Poland’s Christmas Eve traditions, particularly the emphasis on family reunions, symbolic meals and shared rituals passed down through generations. Despite differences in customs and cuisine, she said the essence of the celebrations remains universal: bringing loved ones together to welcome a new start.\nTet flower street held for first time at Thang Long Imperial Citadel\nMore than a seasonal attraction, the flower street also functions as a formal cultural venue for receiving ambassadors, their spouses and representatives of diplomatic missions attending the Vietnam Discovery Day 2026 programme. Its linkage with an external event further reinforces the Thang Long Imperial Citadel’s position as a key platform for introducing Vietnam’s cultural identity to international friends.\nSun World Ba Na Hills cultivates one mln tulips on Mountaintop for Lunar New Year\nA total of 36 tulip varieties, all imported directly from the Netherlands, have been selected, marking the highest number of varieties and colour tones ever presented at Ba Na.\nHanoi recreates Lunar New Year court ritual at Thang Long Imperial Citadel\nOrganised by the municipal People’s Committee in coordination with the Vietnam National Commission for UNESCO, the programme recreated a range of ceremonial practices once performed in the royal court. These included the Tien lich ritual, in which calendars were formally distributed to the court and the public; the Thuong tieu ceremony featuring the ceremonial New Year pole erected to ward off evil spirits and welcome spring; the ritual release of carp to send the Kitchen Gods to heaven; and the solemn changing-of-the-guard ceremony inside the imperial citadel. Together, the activities helped audiences better understand the cultural, spiritual and ceremonial order of Vietnam’s feudal past.\nFireworks, festive events usher in Year of the Horse across Vietnam\nLocal residents and visitors can enjoy spectacular fireworks displays at locations like the Hanoi Post Office in Hoan Kiem ward; Coconut island in Thong Nhat park, Hai Ba Trung ward; the F1 racetrack area in Tu Liem ward; Lac Long Quan flower garden in Tay Ho ward; Van Quan lake in Ha Dong ward; and the Son Tay Ancient Citadel in Son Tay ward.\nStone steles exhibition highlights Vietnam’s learning tradition\nIntegrated with existing exhibition spaces, it presents in a cohesive and in-depth manner the exceptional historical, ideological, and artistic value of the doctoral laureates’ steles.\nSpring Fair 2026: Celebration of Vietnamese Tet flavours, cultural memory\nFood has long occupied a central place in Vietnamese Tet culture, symbolising abundance, harmony and gratitude. At the Spring Fair 2026, traditional Tet delicacies are presented in a modern setting while retaining their familiar essence, allowing visitors to experience both nostalgia and renewal.",
  "word_count": 1429,
  "scraped_at": "2026-02-14T02:10:54.423750",
  "_text_extracted": true
}