{
  "article_id": "54922d756dbc",
  "url": "https://www.nytimes.com/athletic/5863357/2024/10/23/jurgen-klopp-red-bull-origins/",
  "title": "Jurgen Klopp , Red Bull and the origins of an unlikely love affair",
  "date": "20241023T074500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dietrich Mateschitz was Austria’s richest man and, towards the end of his life, had accumulated a vast amount of property in the Alps.\nIn 2019, when Bloomberg profiled the billionaire’s portfolio of castles and mansions “bought from churches or aristocratic families that couldn’t afford their upkeep”, 22 red dots on a map identified just some of his abodes.\nAdvertisement\nThree years later, in September 2022, the co-founder of drinks manufacturer Red Bull was dying of pancreatic cancer. Mateschitz would have barely a month to live when he invited a special guest to one of his villas close to Salzburg, the city in Austria where his empire is based. That guest was Jurgen Klopp, then Liverpool’s manager.\nTwo years on from that meeting, Klopp’s appointment as Red Bull’s head of global soccer was confirmed — a move that surprised many at the time but may, in hindsight, appear more predictable.\nWith Liverpool playing RB Leipzig, part of the Red Bull empire Klopp is due to join in January, in the Champions League this evening (Wednesday), The Athletic spoke to multiple sources with knowledge of how and why the German signed up to a company that is, to many observers, the antithesis of what he stood for as a coach.\nThe 2022-23 season had not started particularly well for Klopp. Liverpool’s previous campaign had taken its toll as, in their efforts to secure an unprecedented quadruple of major trophies, a relatively small group of players had exhausted themselves across 63 games.\nFive months earlier, Klopp had signed a new contract, but he was sensing it would be his last at Anfield. He was not trying to leave but, inevitably, thoughts were turning to life post-Liverpool after seven gruelling years in charge. And one thing was certain: he did not want to jump straight from managing Liverpool into another public-facing role. He needed a rest.\nMateschitz was a huge admirer of Klopp’s work and would have loved to appoint him to lead one of his football teams. From 2005, he had invested heavily in the sport, buying clubs in Germany (RB Leipzig), the United States (New York Red Bull) and Brazil (Red Bull Bragantino), and bankrolling another in Austria through sponsorship (Red Bull Salzburg). All were identifiable by the branding of the company where he was so influential.\nWhile the rise of Salzburg and Leipzig was impressive, the two clubs were also divisive. Football supporters, especially in Austria and Germany, saw them as a threat to the soul of the game: vessels for a conglomerate with no natural links to the sport that simply wanted to sell its product and widen its reach — a sugary form of sportswashing.\nAdvertisement\nKlopp appeared to be a defender of tradition and an opponent of new money, telling Spanish outlet Marca in 2017: “I like tradition in football and all that stuff. In Germany, only two clubs sing ‘You’ll Never Walk Alone’ before the game — and that is (his former clubs) Mainz and Dortmund.” And Dortmund supporters were certainly among Leipzig’s fiercest critics as they emerged in the German top flight in 2016, a year after Klopp stepped down at the former and ended up at Liverpool.\nKlopp, however, quietly admired Mateschitz’s work, mainly because of the way his clubs recruited and took care of their players. New signings were never superstars, but the system Mateschitz helped put in place gave them the chance to reach new levels. Klopp saw comparisons with his own strategy — many of the players he signed for Dortmund and Liverpool were not household names before they arrived.\nA couple of months before that 2022 meeting with Mateschitz, Klopp’s Liverpool had played Salzburg in a friendly: “They (Red Bull) kind of change every year, they sell players but still a good team,” he told reporters. “It’s really interesting what they are doing. The football philosophy is not too far away from ours.”\nThere was another thing that brought Klopp and Mateschitz together. Though the pair had worked tremendously hard to become wealthy and famous, each person felt as though they had retained their sense of self.\nWhile it was common for Mateschitz to arrive for important meetings in Salzburg on his motorbike, dressed in double denim, Klopp — who was once turned down as a possible coach of Hamburg because of his appearance — regularly showed up at Liverpool’s training ground wearing jeans and pumps (very basic sneakers).\nThey were not quite kindred spirits, but there was more than enough in common between the pair for that conversation, high above Salzburg, to run deep into the evening.\nKlopp did not agree to join Red Bull straight away, but by the time he announced his departure from Liverpool in January, he had a good idea of where he would be a year down the line.\nAdvertisement\nFollowing Mateschitz’s passing in October 2022, the line of communication to Red Bull was managed by Klopp’s agent, Marc Kosicke, and Oliver Mintzlaff, the cross-country runner turned marketing specialist Mateschitz recruited because of the strength of his brand work at Puma.\nSince 2014, Mintzlaff has held several titles with Red Bull. Having initially worked under another former Liverpool manager, Gerard Houllier, who was the group’s head of global soccer between 2012 and 2015, Mintzlaff became RB Leipzig’s chief executive, overseeing the club’s rise into the Bundesliga.\nAfter Mintzlaff replaced Houllier in his more overarching role, Mateschitz rewarded him with another promotion just before his death and, since 2022, his focus has been on new investments.\nKosicke and Mintzlaff’s worlds have overlapped for nearly two decades and they get on well. The relationship would help ease the passage of Pep Lijnders from Liverpool to become Salzburg head coach after Klopp’s long-time assistant decided to leave Anfield at the same time as his boss.\nThat moment came in May, though Klopp had told Mike Gordon, president of Liverpool’s owner Fenway Sports Group (FSG) last November — nearly 14 months after his Salzburg meeting with Mateschitz — that he wanted to leave.\nIn the recently updated version of Raphael Honigstein’s book, Bring the Noise, Klopp’s other senior assistant, Peter Krawietz, reveals the manager decided to move on after realising he did not have the energy or focus to plan Liverpool’s 2024 pre-season, one that included making provisions for two major national-team tournaments this summer, the European Championship and the Copa America.\nWith Krawietz and other members of his inner circle, such as Lijnders, in agreement that it was time for a change, the news when it landed with Gordon came as a “surprise but not a shock”.\nSpeaking to Honigstein for the book, Gordon described managing Liverpool, when done correctly, as “not even a job, it’s much bigger than that, it’s a role, a way of life”. Gordon saw over time that the burden of leading the Anfield side was “wearing on him (Klopp)”.\nAdvertisement\nIt made Klopp’s decision easier that Liverpool had turned a corner on the pitch but, according to Gordon, the German wanted to minimise the impact it would have on the club while giving FSG the best chance of finding his replacement. “We knew we couldn’t keep it a secret for too long, that’s not how football works,” he said.\nIntriguingly, the news about Klopp deciding to join Red Bull had been communicated among some of the leading figures inside the company. After his arrival was formally announced only earlier this month, Helmut Marko, Red Bull’s chief motorsport advisor, told the Munich tabloid TZ that Klopp’s appointment had been an open secret. “It’s unbelievable how such a megadeal could remain secret for so long,” he said. “That would never have been possible in Formula 1.”\nMarko’s comments were supported by the multiple world title-winning F1 driver Max Verstappen, who told UK broadcaster Sky Sports: “I knew already for quite a long time that they were talking and it was close to being signed,” he said. “Red Bull is investing a lot in football with the teams they have and there is a lot of talent that has come through already. With someone like Jurgen in charge from the top, he has a lot of experience and he has managed a lot of great clubs.”\nKlopp’s summer was centred on Santa Ponsa, on the Spanish island of Majorca, where his wife Ulla is overseeing the refurbishment of their eco-retreat, which backs onto a golf course. Yet Klopp finds it hard to sit still and he has not spent all of his time since leaving Liverpool resting on a sun lounger. After attending matches in Berlin during the Euros, he was in Paris for the Paralympics in August — supporting his long-time friend Wojtek Czyz in the SL3 badminton event — when a story about his future first appeared in the Austrian press.\nInitially, the Salzburger Nachrichten newspaper, based in the city it shares with Red Bull, claimed Klopp was close to joining the company in the same role once held by Houllier and Mateschitz. When later republished online, it merely referenced “rumours”, and nobody outside Austria paid much attention to it.\nThe Athletic has contacted Red Bull and Kosicke for comment.\nWhen Klopp took charge of a Dortmund legends team in September, he described it as a “dream come true”. In the same month, he also made a hero’s return to Mainz, where he spent his entire professional career as a player before turning to management in a moment of crisis for the club.\nAdvertisement\nA cynical mind might conclude he was on a farewell tour, reminding old friends of the connections they used to share before a big reveal that was bound to upset at least a few people.\nFollowing the announcement, on October 9, that Klopp would join Red Bull in the new year, Mainz’s next game was against one of their clubs. During a 2-0 loss to Leipzig, Mainz supporters responded to the development by unfurling banners with messages like: “Did you forget everything we made you become?”\nAnother, an old quote of Klopp’s: “I like people until the point they disappoint me”, as well as, “Are you crazy?”\nThere is no doubt Klopp is taking a risk with his reputation. It has been argued in Germany that most will forget his new working arrangement if he returns to management with his homeland’s national team in a few years’ time, yet this ignores the feeling in Dortmund, especially, where significant elements of the supporter base are far more connected to club interests.\nAway from Germany, Klopp’s ties with Red Bull were strengthened in Liverpool. One of his first big decisions following his appointment in 2015 was over a new training ground. When plans were being drawn up for the site in Kirkby, a delegation from Liverpool paid a visit to Red Bull Salzburg, as he felt they could learn from the Austrian side’s setup and facilities.\nWhile Klopp subsequently signed Naby Keita, Takumi Minamino, Ibrahima Konate and Dominik Szoboszlai from Red Bull’s stable of clubs, Sadio Mane had also been with Salzburg before joining Southampton, the club he moved to Anfield from. Following the arrival of Minamino from Salzburg in 2019, Klopp told Liverpool’s website: “Coming from the club and the organisation he does, we know he’ll be well coached, used to an elite environment, and had all the right experiences.”\nKlopp liked signing players developed the Red Bull way because he felt as though the philosophy was closely aligned with his own. Each of the group’s clubs played with a high intensity and he felt as though this helped them deal with any period of adjustment on Merseyside.\nCentral to that identity from a Red Bull perspective was the current coach of the Austrian national team, Ralf Rangnick, who has held several titles within its football organisation. He was once described by Klopp as “one of the best if not the best German coach”, but they did not discuss the latter’s new role as head of global soccer, even though it was a job Rangnick did for a while after leaving Leipzig in 2019.\nAdvertisement\nThis involved recruitment and attempting to coordinate a common coaching philosophy. Yet Rangnick was frustrated by his experiences — he was serious about his responsibilities, but on trips to New York and Brazil, he found that the coaches he was educating, if they listened, realised he wouldn’t be back any time soon, so the impact he was having was negligible.\nKlopp is not expected to be in attendance when Liverpool face Leipzig at the Red Bull Arena on Wednesday, but his imminent career move adds an intriguing sub-plot to the occasion.\n“He always brought energy to our team,” Marco Rose, who played for Klopp at Mainz and is now Leipzig’s head coach, told reporters this week. “We had situations at Mainz when we felt helpless, but ‘Kloppo’ gave us the feeling that we wanted to play again the next day, giving us the foundations to always believe and the belief to always move forward.\n“He taught defensive football. We didn’t always have the same opinion, but I learned a lot from him and he is a great person and I am very much looking forward to working with him.”\nSzoboszlai, speaking at yesterday’s press conference, shared Rose’s enthusiasm. “It’s different, a new job, different to a coach but I am happy he is back. He’s such a name in football, you don’t want to forget about him and it is good he stays in football.”\nHe has history with the coaches working for Red Bull in Leipzig, Salzburg and New York in some way. Leeds’ German manager, Daniel Farke, does not fall into the same category, but at a pre-match press conference ahead of the club’s victory over Yorkshire rivals Sheffield United last week, he revealed that he and Klopp are “close and in touch — I can always contact him when I need to”.\nTo some extent, he can now classify those calls as work-related. Yet Farke realises the significance of identity. “We are Leeds United,” he said. “None of our fans would allow us to copy something from elsewhere. We are a unique club, with values and principles.”\nAdvertisement\nIn 2017, Klopp said something similar in that Marca piece mentioned earlier, insisting he was a “football romantic”.\nIf that was the case, his recent choices remind us that in football, nothing is sacred.\nAdditional reporting: James Pearce, Sebastian Stafford-Bloor\n(Top photo: Getty Images; design: Eamonn Dalton)",
  "word_count": 2412,
  "scraped_at": "2026-02-14T02:25:58.968096",
  "_text_extracted": true
}