{
  "article_id": "549ac56375f8",
  "url": "https://www.nytimes.com/athletic/6890841/2025/12/16/bundesliga-briefing-urs-fischer-mainz-bayern-munich/",
  "title": "Bundesliga Briefing : Welcome back , Urs Fischer – to Bayern Munich detriment",
  "date": "20251216T071500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome back to the Bundesliga Briefing. And welcome back to the Bundesliga, Urs Fischer.\nFischer took charge of Mainz in the league for the first time on Sunday. They left Allianz Arena with a point after a 2-2 draw with Bayern Munich from a game they led with four minutes of the 90 to go. Mainz are still bottom of the table, but this result broke a streak of four consecutive league defeats away from home that stretched back to the end of September.\nAdvertisement\nThe match was classic Fischer. Mainz had just 15.3 per cent possession, managed five shots to Bayern’s 24, and accumulated an expected goals rating of 0.5 to their opponents’ 4.4, but it was enough. Their first goal was a well-worked set piece. Their second came after a very smart bit of direct football finished by a superb Lee Jae-sung header. They rode their luck, certainly, but the point was reward for resilience shown in a deep, packed 5-4-1.\nThat was also a characteristic of Fischer’s Union Berlin sides. Union’s run from the 2.Bundesliga in 2019 to playing in the 2023-24 Champions League depended on them being comfortable without the ball and being happy to defend their own box for long periods with unwavering discipline. And while season-to-season they had high squad turnover, particularly in attack — they had four different leading goalscorers in Fischer’s five seasons — they always had players capable of being efficient and bucking xG trends. Think of Sheraldo Becker or Taiwo Awoniyi, both of whom built reputations as excellent chance-converters during their time at Union and earned lucrative moves as a result.\nCan that kind of success be replicated now at Mainz? It’s a long way back and just avoiding relegation will be a great success this season. They remain four points adrift of second-bottom Heidenheim but face St. Pauli, who are third-bottom, at home next on Sunday. Then Fischer returns to Koepenick to face Union on January 10, immediately after the Bundesliga’s winter break.\nSpeaking of St. Pauli, they won in the league on Saturday for the first time since September 14, beating Heidenheim 2-1 to climb out of the relegation zone. A goal in each half from Martijn Kaars allowed them to survive an Eric Smith red card just before half-time and a late rally from the visitors.\nAdvertisement\nThose were Kaars’ first goals in the Bundesliga, having moved from second-tier Magdeburg in a transfer featuring one of the most slapstick tales of this year’s summer window.\nBack in August, before the deal was done, Magdeburg’s under-23s were playing a game with Otmar Schork, the club’s sporting director, in attendance. Schork had his laptop with him, but left it unguarded at a particularly bad time. He had recently received St. Pauli’s emailed offer for Kaars — subject title “transferangebot Martijn Kaars”— and it was open on his screen when an eagle-eyed fan passed by.\nThis unidentified supporter photographed the contents of the email, posted it to a fan forum, and from there it found its way to the mainstream media. That’s how the story broke. Magdeburg were understandably furious, describing it as a gross invasion of Schork’s privacy.\nOn the pitch, Kaars has certainly found the step up to the top flight difficult, but those goals should do him good. The first was truly excellent and depended on a clever pass from Japan international Joel Fujita, who also had a strong game, and has an unusual pre-game habit.\nFujita is another summer arrival at St. Pauli, from VV Sint-Truiden in Belgium, and before games, ahead of the warm-up, he likes to walk the pitch barefoot to get a feel for the surface and the occasion. Whether he does it on a given matchday can depend on the weather conditions — as he explains in the video below — but it’s one of the coolest sights in the Bundesliga when it happens.\nView this post on Instagram\nElsewhere, Wolfsburg produced one of the performances of the round, ending Borussia Monchengladbach’s recent revival with a 3-1 away win. Mohamed Amoura scored one of the goals and is arguably their most important attacking player. He now heads to AFCON with Algeria, so he will miss next week’s home game against Freiburg.\nAdvertisement\nIn Sinsheim, Hoffenheim thumped Hamburg 4-1 to move back into the fifth-placed Europa League spot, while Eintracht Frankfurt rebounded from that awful 6-0 defeat in Leipzig a week earlier to beat Augsburg 1-0 at home, and Union derailed visitors RB Leipzig 3-1.\nThree players scored what will most likely be the best goals of their careers over the weekend.\nMartin Terrier’s scorpion kick for Bayer Leverkusen helped secure a 2-0 home victory that condemned Koln to a fifth straight match without a win, Jamie Leweling’s long-range missile (measured at 122km/h — 75.8mph — and with an xG of 0.02) nearly broke the Weserstadion netting during Stuttgart’s 4-0 defeats of hosts Werder Bremen, and finally perhaps the goal of the round: Lucas Holer’s control and volley to equalise for Freiburg in a 1-1 draw against Borussia Dortmund.\nSo, a good day for Holer and Freiburg, less so for visitors Dortmund and Jobe Bellingham.\nThe Englishman made his fifth league start of the season and had a good first half, involved in every area of the game, contributing to the attacking and defensive phases, but he was sent off for a professional foul in the 53rd minute.\nBellingham was unlucky.\nHe had dropped deep to receive a pass from Gregor Kobel, his goalkeeper. Kobel sold him short — he acknowledged as much post-game — and Freiburg’s Philipp Treu got to the ball first, went down under Bellingham’s challenge, and the latter was rightly dismissed for denying a goalscoring opportunity. That the red card was brandished by Felix Zwayer, who had an infamous run-in with Jude Bellingham when he was a Dortmund player four years ago this month, was not missed by the German media.\nFor the younger Bellingham brother, this has been the way of it during his debut season in Germany. Growing momentum has been stalled by ill fortune or an untimely setback. It has not been an easy situation.\nDortmund agreed a €38million (£33.4m/$44.7m at current rates) deal to sign the now 20-year-old from Sunderland, creating the expectation that he should immediately be a starter in the Bundesliga. Not unreasonably so, given the size of the fee. But with a midfield already containing Felix Nmecha, Marcel Sabitzer, Pascal Gross and Carney Chukwuemeka, winning a full-time role was always going to be a challenge. There are also the issues created by inevitable comparisons with his elder brother.\nAdvertisement\nHe has acquitted himself well. There has been some noise, and everyone will remember the fracas that occurred earlier in the season, between members of the Bellingham family and Sebastian Kehl, the club’s sporting director. There has also been grumbling from among the fanbase about his performances, but nobody has expressed any concern over his professionalism or commitment.\nNevertheless, one of the obstacles is his definition as a player. Among those he is competing with, Bellingham is probably the most generalised. Instead of possessing a specific, outstanding attribute — such as Nmecha’s skill, Sabitzer’s off-the-ball contribution, or Gross’ passing — he has more of a jack-of-all-trades profile, and that can be difficult to accommodate.\nBellingham is the kind of midfielder who needs to be part of a combination. He’s a team component rather than a soloist. For that adaptation to take place, though, he needs time on the pitch, and with fewer than 500 minutes played in the first half of the Bundesliga season so far, his candidacy is weak.\nSo, this will be one of the storylines of the second half of the season.\nMuch of the commentary has been unkind to Bellingham, ignoring the virtues he has as a player and the asset he could yet become for Dortmund.\nOLHA ESSE MOSAICO! AMIZADE FORTÍSSIMA ENTRE SCHALKE E NUREMBERG! 😱💙❤️\n— Schalke Brasil (@FCSchalke04BR) December 14, 2025\nLastly, a tifo of the weekend — above — which comes from Veltins-Arena and Schalke’s 1-0 home win against Nuremberg on Sunday in the 2.Bundesliga.\nIt’s common within Germany and across continental Europe for different teams’ ultras to have friendships, often because of ideological compatibility or shared rivalries.\nThe one between Schalke and Nuremberg is among the oldest and has a more wholesome backstory than most. Existing since the 1970s, it grew from a chance meeting between sets of supporters from the two clubs during a train journey and became something really meaningful, which is now celebrated whenever the sides face each other.\nThere’s an excellent account of it on Schalke’s website, which should translate automatically into English for non-German speakers and explain the depth of the relationship.",
  "word_count": 1463,
  "scraped_at": "2026-02-14T01:52:59.293976",
  "_text_extracted": true
}