{
  "article_id": "549ca2bcf6e4",
  "url": "https://thepeoplesperson.com/2025/06/06/manchester-united-unlikely-to-pursue-a-deal-for-victor-osimhen-due-to-the-costs-involved-295074/",
  "title": "Manchester United unlikely to pursue a deal for Victor Osimhen due to the costs involved - Man United News And Transfer News",
  "date": "20250606T233000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are inching closer to securing their second attacking midfielder this summer, but their striker search has not gone according to plan.\nA deal for Matheus Cunha was wrapped up pretty early, and all indications point towards Bryan Mbeumo arriving at Old Trafford. And while both of them can play up top on their own, Ruben Amorim would ideally like a ruthless centre-forward.\nRasmus Hojlund is likely to depart, with Inter Milan, Real Madrid, AC Milan, and Atletico Madrid all chasing his signature, albeit on loan.\nCurrent Director of Football Jason Wilcox was pushing for a deal for Liam Delap but the Englishman opted to switch to Chelsea instead.\nStriker hunt\nThe Red Devils have a B list of options ready, Randal Kolo Muani and Jean-Philippe Mateta being among them. But even those names might not arrive.\nThe two biggest names on the market — Victor Osimhen and Viktor Gyokeres were both chasing huge wages and had their eyes on playing Champions League football.\nWhile the Swede could be back on the menu, a move for the Nigerian is firmly off the table if ESPN are to be believed.\nThe Napoli ace was close to a move to Al-Hilal of Saudi Arabia, only for his wage demands to scupper the deal. In his talks with INEOS, the 26-year-old had made clear that he wanted to be the highest-earning member of the squad.\nThe United co-owners are trying to trim an already bloated wage bill, and they are unlikely to accept. On top of that, the Serie A champions are demanding clubs pay Victor Osimhen’s €75 million release clause in full despite the striker having only one year left on his current deal.\nUnited unlikely to pursue Victor Osimhen\nAs a result, the 20-time English league champions will look at someone else, with the report even going as far as to say the Nigeria international does not fit Amorim’s system.\n“Despite his availability, sources have told ESPN that United will not be pursuing a move for Napoli’s Victor Osimhen, who spent last season on loan at Galatasaray in Turkey.\n“Sources added that United believe Osimhen is not the profile of striker required by manager Ruben Amorim, while his reported €75m transfer fee would also be an issue.”\nThis might indicate why chatter about Gyokeres has suddenly spiked, or this could be United’s ploy of trying to get Osimhen’s price down by getting Napoli all riled up.\nIt will be interesting to see how this saga pans out in the end. Fans would have loved to see the ex-Lille ace at Old Trafford, especially given his impressive form for loan outfit Galatasaray last season, where he scored 37 times while also registering eight assists. It seems United will be heading back to the drawing board again, for now.\nFeature image Ahmad Mora via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 479,
  "scraped_at": "2026-02-14T01:58:41.955593",
  "_text_extracted": true
}