{
  "article_id": "549e0cc10efb",
  "url": "https://ca.finance.yahoo.com/news/mikel-arteta-drops-major-hint-223931968.html",
  "title": "Mikel Arteta drops major hint over Kai Havertz role at Arsenal in welcome message",
  "date": "20230629T000000Z",
  "domain": "ca.finance.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta drops major hint over Kai Havertz role at Arsenal in welcome message\nArsenal boss Mikel Arteta has immediately hinted at his plans for Kai Havertz after officially welcoming the player from Chelsea.\nThe Gunners finally announced the £65million arrival of the German international from their London rivals on Wednesday evening, with Havertz passing a medical during a post-season holiday in Spain and penning a long-term contract at the Emirates Stadium as he takes on the familiar No29 shirt.\nHe is the first capture of a major early summer recruitment drive in north London, with Arsenal having also agreed a club-record £105m deal in principle with West Ham for England’s Declan Rice as they continue negotiations with Ajax over Netherlands defender Jurrien Timber.\nHavertz spent most of his mixed three seasons at Chelsea following a £75m switch from Bayer Leverkusen in 2020 playing as a central forward, sometimes flattering to deceive but most memorably scoring the winning goal in the 2021 Champions League final triumph over Manchester City in Porto.\nAnd while Arteta appreciates that the 24-year-old can play anywhere across the front line, he highly values his versatility amid a belief that he can operate effectively in midfield.\nArsenal believe that Havertz could help fill the void in the No8 role alongside captain Martin Odegaard next season with Granit Xhaka now on his way to Bayer Leverkusen for £13m, with Rice shielding the back four if indeed he does go on to join as expected.\nAnd Arteta appeared to strongly hint at Havertz’s role during his welcome message to the player in which he referred specifically to the qualities he would bring to Arsenal’s midfield.\n“Kai is a player of top quality,” the Spaniard told Arsenal’s official website. “He has great versatility and is an intelligent player. He will bring a huge amount of extra strength to our midfield and variety to our play.\n“We welcome Kai and his family to Arsenal Football Club and we are all excited to start working with him when we start pre-season training soon.”\nLIVE BLOG: Follow all the latest Arsenal transfer news and rumours\nArsenal’s sporting director Edu also lauded Havertz’s prized versatility in his own praise of the £65m deal.\n“We’re excited to bring Kai to the club and great work by everyone to get this deal complete,” Edu said. “Kai is an exciting addition to our squad, who will bring great attacking quality and versatility.\n“As an experienced 24-year-old, his signing represents another important step in strengthening our young core of talented players we have at Arsenal. We look forward to working with Kai.”",
  "word_count": 435,
  "scraped_at": "2026-02-14T01:50:37.770341",
  "_text_extracted": true
}