{
  "article_id": "54ae5c6cd679",
  "url": "https://www.caughtoffside.com/2024/04/10/transfer-news-amorim-liverpool-edwards-plans/",
  "title": "Transfer news : Amorim Liverpool , Edwards recruitment & more",
  "date": "20240410T233000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on the Daily Briefing, a subscription service. If you would like to receive Neil Jones’ exclusive articles via email ahead of publication on caughtoffside.com, please sign-up for the service at thedailybriefing.io\nTwo points dropped for Liverpool as the title is now out of their hands\nThere’s no doubt that Liverpool will have come away from Old Trafford on Sunday frustrated, and viewing their 2-2 draw as two points dropped rather than one gained.\nThe Reds’ dominance, especially in the first half, was so absolute that the game could and should have been put to bed inside 45 minutes. But as in the FA Cup tie last month, missed opportunities and careless final passes came back to haunt Jurgen Klopp’s side. And when you add in a once-a-season mistake from Jarell Quansah and a once-in-a-lifetime finish from Kobbie Mainoo, it’s a bad recipe!\nLiverpool need to be more clinical in finishing teams off going forward, if they are to have any chance of further success this season. The likes of Darwin Nunez, Luis Diaz, Mohamed Salah and Dominik Szoboszlai all had big chances which should have been taken, and the longer you leave an opponent alive when they should be dead, the more chance there is of something like Sunday happening.\nI think it was a significant moment in the title race, as it takes matters out of Liverpool’s hands for now, but I also expect further twists to come. The Premier League at the moment is wild, full of goals and full of teams that can hurt you. Liverpool have four away games to come, all of which will be tough, and Arsenal and Manchester City have to go to Tottenham before the season is out, as well as balancing Champions League football. I would expect all three to drop at least two points between now and May.\nManchester United surely searching for a new manager after lack of progress made by Erik ten Hag\nManchester United under Erik ten Hag, I’m not entirely sure what they are or what they are trying to be.\nHe says they aim to be “dominant” with and without the ball, but they are neither, as far as I can see. They have some talented individuals who can produce moments of magic – Garnacho, Rashford, Mainoo, Fernandes, Antony – but as a team, I just don’t see the same levels of structure, organisation and desire as at, say, Liverpool or Arsenal or City. Even Tottenham.\nTheir pressing structure, in particular, is appalling at times. How easy is it to play through the lines and get at United’s back four? They cough up chances – good chances – at an alarming rate for a so-called top side, and it happens week after week, home and away, whether against the good sides or the average ones.\nTwo years in, a lot of the blame for that has to fall at Ten Hag’s feet. Either his message isn’t clear, isn’t getting through or he hasn’t got the players to make it work. And if it’s the latter, then questions must be asked as to some of those he has brought in. Their better players at the moment are either academy products – Mainoo & Garnacho – or those who he has previously discarded – Maguire & Wan Bissaka.\nIt feels to me like the FA Cup might save Ten Hag this season, but I’d be amazed if United aren’t at least starting to look at their next managerial target, because right now they look miles off the likes of Liverpool, Arsenal and City.\nRuben Amorim is the leading candidate for the Liverpool job – here’s why that’s the right choice\nRuben Amorim is certainly the main name in the frame for Liverpool this summer, but I should stress that Anfield sources have been adamant that there has been no agreement reached with him, and that even the idea that he has been identified as the No.1 candidate is premature right now.\nIt’s definitely not an easy market right now, finding a manager for a Champions League level club. There are good candidates out there, but none which come close to being ‘risk-free’. Amorim is clearly a very good coach and his achievements at Sporting demand respect, but there have to be at least some questions as to how quickly or effectively that will transfer to England, and to a club with such tradition and expectation as Liverpool.\nWhat I think works in his favour is the fact that he has had success as an underdog, taking on Benfica and Porto in Portugal, and that he seems to encourage a style of play which mixes ambition with control. I think Klopp’s style is often misrepresented in this country – he is a lot more defensively-minded than many believe – and to be successful in the Premier League, your team needs to be good with and without the ball. Amorim’s Sporting seem to be both.\nIn an imperfect market, I think he represents a good option; young, with medals in his back pocket, good communication skills and room to develop further as a coach.\nIf he is to be Liverpool’s man, and I suspect he will be, it will be interesting to see how he gets on.\nLiverpool linked with Estevao Willian amid bid to improve global talent ID\nI think with all transfer rumours regarding Liverpool at the moment, it’s important to step back and understand that the appointment of the new manager will take priority.\nI have not heard anything regarding Estevao Willian, and indeed it would be a change of tack for Liverpool to target a 16-year-old Brazilian straight from Palmeiras, however talented he is. I can’t think of the last time the Reds did that, if ever.\nBut what is clear is that the Reds want to improve in terms of global talent ID and development. That is one of the main reasons Michael Edwards is back in the fold, and why Fenway Sports Group are targeting a second club – to help attract, develop (and sell) elite young talent. If and when that happens, then we may well see a few more players moving directly from South America into the Liverpool ‘system’.\nAs for now, there are already a lot of good young players at Liverpool – we have seen many of them this season – and the club’s reputation as a place where talented kids will get opportunities is well-earned. I don’t expect that to change in the post-Klopp era, although whether the next manager can empower his young players is another matter entirely. Certainly, in Jarell Quansah (21), Harvey Elliott (21), Fabio Carvalho (21), Ryan Gravenberch (21), Conor Bradley (20), Bobby Clark (19), Stefan Bajcetic (19), Ben Doak (18) and Jayden Danns (18), Liverpool have bags of potential to work with!",
  "word_count": 1144,
  "scraped_at": "2026-02-14T01:56:51.557717",
  "_text_extracted": true
}