{
  "article_id": "54b91ce094ec",
  "url": "https://www.fourfourtwo.com/features/every-player-to-have-won-the-ballon-dor",
  "title": "Every player to have won the Ballon dOr",
  "date": "20231029T130000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every Ballon d'Or winner: A complete list of every men's player to have won the award\nThe Ballon d'Or is the most prestigious award in football, having been lifted by the greatest players ever since 1956\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Ballon d'Or is the most prestigious individual accolade in the world of football. Ever since its inception in 1956, the gong – conceived by France Football – has been a yardstick for the great and the good in the beautiful game.\nThe favourites for the BDO remain constant in the modern age but over the course of nearly 70 years, there have been shock winners and intriguing entries on the list. And while Lionel Messi and Cristiano Ronaldo both top the chart for most triumphs of the golden ball, the complete catalogue of champions reads like a galaxy of the elite.\nHere's the full list of Ballon d'Or winners. Is your favourite player ever on the list?\nBallon d'Or: Every winner of the award\n1956-1959\n1956: Stanley Matthews, Blackpool\nIn 1956, Matthews won the first Ballon d'Or, beating Real Madrid stars Alfredo Di Stefano and Raymond Kopa into second and third, respectively. At 41 years old, Sir Stan is still the oldest-ever winner of the award.\n1957: Alfredo Di Stefano, Real Madrid\nAlfredo Di Stefano won the second Ballon d'Or with 72 points – Wolverhampton Wanderers' Billy Wright came a long way second on 19. Duncan Edwards of Manchester United and Raymond Kopa of Real Madrid tied on 16 points for third.\n1958: Raymond Kopa, Real Madrid\nAfter holding the podium twice, Kopa finally got his time, pipping Helmut Rahn of Rot-Weiss Essen into second and 1958 World Cup Golden Boot winner Just Fontaine of Reims into third.\n1959: Alfredo Di Stefano, Real Madrid\nDi Stefano became the first man to win two Ballons d'Or in 1959. Raymond Kopa, now of Reims came second; Juventus legend John Charles became the first Welshman on the podium in third.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n1960-1969\n1960: Luis Suarez, Barcelona\nSpanish inside-right Luis Suarez won the 1960s' first Ballon d'Or. Ferenc Puskas of Real Madrid came second, with Uwe Seeler of Hamburg third.\n1961: Omar Sivori, Juventus\nAfter naturalising to play for Italy, Argentina-born Omar Sivori became the first man at an Italian club to win the Ballon d'Or. Luis Suarez of Barcelona came second that year; Johnny Haynes of Fulham finished third.\n1962: Josef Masopust, Dukla Prague\nMasopust won the title in 1962, ahead of Mozambique-born Portugal forward Eusebio, who had just won his second consecutive European Cup with Benfica. Karl-Heinz Schnellinger of Koln was third.\n1963: Lev Yashin, Dynamo Moscow\nLev Yashin is still the only goalkeeper to have ever won the award. Gianni Rivera of AC Milan finished second in 1963, his former teammate Jimmy Greaves of Tottenham coming third.\n1964: Denis Law, Manchester United\nDennis Law became Manchester United and Scotland's first Ballon d'Or winner, despite United not winning a trophy in 1963/64. Spaniards Luis Suarez – now of Internazionale – and Amancio of Real Madrid came second and third respectively.\n1965: Eusebio, Benfica\nEusebio got his time in the sun in '65, becoming the first African-born winner of the award. Giacinto Facchetti and Luis Suarez of European champions Inter took second and third respectively.\n1966: Bobby Charlton, Manchester United\nBobby Charlton received a then-record 81 votes for the Ballon d'Or the year that England won the World Cup. Tournament top scorer and Benfica forward Eusebio finished second on 80 points with West Germany runner-up and Bayern Munich Franz Beckenbauer behind on third.\n1967: Florian Albert, Ferencvaros\nFlorian Albert of Ferencvaros took glory in 1967, with United's Bobby Charlton coming in second. Lisbon Lion and European Cup winner Jimmy Johnstone came third, for Celtic's first podium finish.\n1968: George Best, Manchester United\nManchester United became the first club to have three separate winners in '68, while Charlton again finished second, as the club won the European Cup. Dragan Dzajic of Red Star Belgrade came third.\n1969: Gianni Rivera, AC Milan\nAC Milan star Gianni Rivera won the award in '69, finishing four points ahead of compatriot Gigi Riva from Cagliari. Gerd Muller of Bayern Munich came third.\n1970-1979\n1970: Gerd Muller, Bayern Munich\nDer Bomber became the first German to lift the accolade in 1970, for his exploits at the World Cup in Mexico, where he scored 10 goals. West Ham and England captain Bobby Moore was second with third place going to Gigi Riva of Cagliari and Italy.\n1971: Johan Cruyff, Ajax\nJohan Cruyff won his first award in 1970, as Ajax swept to the European Cup title. Sandro Mazzola of Inter Milan came second, George Best of Manchester United third. Cruyff's 116 votes became a record win.\n1972: Franz Beckenbauer, Bayern Munich\n1972 saw the first year in which three players from the same nation – West Germany – won the Ballon d'Or; Der Kaiser took gold, Bayern team-mate Gerd Muller took silve with bronze going to Gunter Netzer of Borussia Monchengladbach.\n1973: Johan Cruyff, Barcelona\nCruyff was back on top in '73, becoming the first player to win two BDOs at two different clubs. Juventus and Italy keeper Dino Zoff was given silver, with Muller once again third.\n1974: Johan Cruyff, Barcelona\nAnother record for Cruyff as the World Cup finalist became the first three-time Ballon d'Or winner with 116 votes, ahead of Beckenbauer – West Germany's World Cup-winning. captain on 105. Poland and Liegia Warsaw's Kazimierz Deyna came third, after helping his country to third at the World Cup.\n1975: Oleg Blokhin, Dynamo Kiev\nBlokhin received nearly three times the votes (a record 122 votes) of Beckenbauer (42) to snatch 1975's prize. Cruyff came third.\n1976: Franz Beckenbauer, Bayern Munich\nAnother win for Der Kaiser after three European Cups of the trot with Anderlecht and Netherlands star Rob Rensenbrink holding second. Ivo Viktor of Dukla Prague and Euro 76 winners Czechoslovakia came third.\n1977: Allan Simonsen, Borussia Monchengladbach\nThe first Danish winner, Simonsen helped carry Gladbach to a European Cup final and scored a leveller against Liverpool before the Reds overpowered his club. A winner with Liverpool, Kevin Keegan (who moved to Hamburg that year), came second, Nancy's Michel Platini third.\n1978: Kevin Keegan, Hamburg\nKing Kev took the title in '78, with Hans Krankl of Barcelona second and Anderlecht's Rob Rensenbrink third.\n1979: Kevin Keegan, Hamburg\nKeegan kept his crown two years running, with Karl-Heinz Rummenigge of Bayern Munich second in 1979 and Ruud Krol of Ajax sneaking into third. Keegan is still the only Englishman to have won the title twice.\n1980-1989\n1980: Karl-Heinz Rummenigge, Bayern Munich\nThere was no keeping Kalle Rummenigge down for long, with 1980 seeing a German one-two, as Bernd Schuster of Barcelona came second. Michel Platini was third and halfway through leading Saint-Etienne to a title.\n1981: Karl-Heinz Rummenigge, Bayern Munich\nAnother all-German podium: Schuster took third with Rummenigge's Bayern team-mate Paul Breitner second.\n1982: Paolo Rossi, Juventus\nWorld Cup winner Paolo Rossi took the Ballon d'Or in 1982. Alain Giresse of Bordeaux came second, with Zbigniew Boniek, also of Juve, in third.\n1983: Michel Platini, Juventus\nPlatini's 1983 win was the first time a player had finished in the top three of the Ballon d'Or with three different clubs. Kenny Dalglish of Liverpool was second, while Allan Simonsen – who'd moved from Charlton Athletic to Vejle BK that year – in third.\n1984: Michel Platini, Juventus\nMagnificent at Euro 84 was rewarded with back-to-back titles for Platini; French comrade and Bordeaux attacker Jean Tigana took silver, while Preben Elkjaer of Hellas Verona and Denmark finished third.\n1985: Michel Platini, Juventus\nNo one had ever won three in a row before – but Platini garnered a record 127 points for his third BDO in '85, having lifted the European Cup with Juventus that season. Elkjaer came second, Schuster third.\n1986: Igor Belanov, Dynamo Kiev\nSoviet striker Belanov edged World Cup Golden Boot star Gary Lineker to 1986's prize. Lineker had also finished second with Everton to arch-rivals Liverpool in both the league and FA Cup. Spain forward Emilio Butragueno came third after leading Real Madrid to a second UEFA Cup on the bounce.\n1987: Ruud Gullit, AC Milan\nAC Milan's world-record signing Ruud Gullit took the Ballon d'Or in '87, while Paulo Futre of Atletico Madrid came second. Butragueno earned a second bronze finish in a row.\n1988: Marco van Basten, AC Milan\nJust like Euro 88, that year's BDO belonged to the Dutch. The top three all played for Milan too: final scorer Van Basten collected a record 129 votes ahead of holder Ruud Gullit and Frank Rijkaard.\n1989: Marco van Basten, AC Milan\nAnother one-two-three for Milan, the first time a club had managed consecutive podium sweeps in the award's history. Van Basten won his second Ballon d'Or, Rijkaard took third once more, with Italian stalwart Franco Baresi coming third.\n1990-1999\n1990: Lothar Matthaus, Inter Milan\nInter star Matthaus broke the AC Milan stranglehold of the Ballon d'Or for his Italia 90 exploits with West Germany – winning a then-record 137 votes – while his club and international team-mate Andreas Brehme came third that year. Salvatore Schillaci of Juventus and Italy finished second.\n1991: Jean-Pierre Papin, Marseille\nLigue 1 champion and European Cup runner-up Jean-Pierre Papin broke Matthaus's 137-vote record by four to clinch the 1991 Ballon d'Or. For the first time, three players tied for second: Dejan Savicevic, Darko Pancev – both of European champions Red Star Belgrade and Yugoslavia – and Inter's Lothar Matthaus.\n1992: Marco van Basten, AC Milan\nVan Basten returned to the throne in 1992. Second went to Barcelona's Hristo Stoichkov and third to Ajax's Dennis Bergkamp.\n1993: Roberto Baggio, Juventus\n142 votes saw Roberto Baggio crowned winner in 1993. Bergkamp – now of Inter – took second, while Eric Cantona came third for Manchester United's first podium finish in 22 years.\n1994: Hristo Stoichkov, Barcelona\nWorld Cup top scorer and Champions League runner-up Stoichkov won the award in 1994 with 210 votes. Juventus star Roberto Baggio – who missed the World Cup final's decisive penalty – followed in second with his international colleague Paolo Maldini of AC Milan third.\n1995: George Weah, AC Milan\nIn 1995, the Ballon d'Or diversified to open its criteria. Previously just for players from Europe, the award was now eligible to footballers from all over the world.\nGeorge Weah became the first African recipient that year after getting to the Champions League final, thanking former manager Arsene Wenger on stage. Jurgen Klinsmann of Bayern Munich came second with Finland and Ajax playmaker Jari Litmanen third.\n1996: Matthias Sammer, Borussia Dortmund\nThe last sweeper to win the Ballon d'Or, Matthias Sammer lifted the award following his exploits in Germany's triumphant Euro 96 campaign. Fellow Euro 96 star Alan Shearer came third, after breaking the world transfer record when he moved from Blackburn Rovers to Newcastle United.\nRonaldo became the first Brazilian to feature in the top three, when the Barcelona star (formerly of PSV) came second.\n1997: Ronaldo, Inter Milan\nRonaldo won the UEFA Cup and Copa Del Rey during his and manager Bobby Robson's sole Barcelona season in 1996/97. He then broke the transfer record that summer when he moved to Inter Milan and became the first Brazilian to win a Ballon d'Or in 1998.\nPredrag Mijatovic of La Liga champions Real Madrid bagged second, with Zinedine Zidane of Champions League finalists Juventus coming third.\n1998: Zinedine Zidane, Juventus\nZinedine Zidane's legendary France '98 saw him gifted the Ballon d'Or of that year. Zizou once again finished second in the Champions League that season, before scoring two goals in Paris's World Cup final.\nTournament top scorer Davor Suker came second that season, with Ronaldo third: another star of the tournament, whose final was shrouded in mystery.\n1999: Rivaldo, Barcelona\nin 1999, Barcelona became the first club to have four separate Ballon d'Or winners, when Rivaldo followed Luis Suarez, Johan Cruyff and Hristo Stoichkov into the history books.\nThe Brazilian pipped Manchester United's treble-winning midfielder David Beckham into second. AC Milan striker Andriy Shevchenko came third, following his move from Dynamo Kiev.\n2000-2009\n2000: Luis Figo, Real Madrid\nOnce again, the most expensive player on Earth won the Ballon d'Or in 2000, when Luis Figo took the gong following his explosive move across the Clasico divide.\nFuture Galactico team-mate Zinedine Zidane of Juventus was second, with Shevchenko recording another third-placed finish.\n2001: Michael Owen, Liverpool\nA shock winner in 2001, 21-year-old Michael Owen won the Ballon d'Or to become England's third recipient and, incredibly, Liverpool's first. Owen was integral to a treble of FA Cup, League Cup and UEFA Cup that season. Owen racked up 18 goals across the calendar year.\nThe young striker beat Raul of Real Madrid into second and Oliver Kahn of Bayern into third – after the pair won Champions League titles in 2000 and 2001, respectively.\n2002: Ronaldo, Real Madrid\nBrazil's World Cup hero, Ronaldo beat out club and country teammate Roberto Carlos to win his second Ballon d'Or in 2002. R9 was the talisman for the Selecao in Japan and South Korea, netting twice in the final, while Carlos made the assist for the winning goal in the 2002 Champions League final for Real Madrid against Bayer Leverkusen.\nKahn of Bayern came third once more, after winning the Best Player award at the World Cup.\n2003: Pavel Nedved, Juventus\nAnother surprise choice, Czech schemer Pavel Nedved won the 2003 Ballon d'Or after losing the Champions League on penalties against Milan in Manchester. The Czech Cannon's conqueror, Paolo Maldini, came third after captaining his side to glory 40 years after his father had done the same.\nThierry Henry of Arsenal finished second after an FA Cup with the Gunners, Confederations Cup and Best Player award with France, and a record 20 assists in the Premier League during the 2002/03 season.\n2004: Andriy Shevchenko, AC Milan\nShevchenko just squeezed into first place in 2004, off the back of a few storming seasons at the San Siro. Sheva had won the title with Milan but in the Champions League, the usual superpowers had all struggled: the semi-finals were contested by Chelsea, Porto, Monaco and Deportivo La Coruna.\nChampions League-winning Deco – who moved from Porto to Barcelona in the summer – came second, with new clubmate Ronaldinho not far behind in third.\n2005: Ronaldinho, Barcelona\nDuring Barcelona's assault to the 2006 Champions League final, showman Ronaldinho picked up the Ballon d'Or, meaning all three R's of the 2002 World Cup win now had an award each. Ronnie won his gong as much for being considered the most brilliant player on Earth, as much as what he was winning, however.\nSecond and third went to Frank Lampard and Steven Gerrard, respectively: the first time two Englishmen had been on the podium since 1957. Lampard had won the league with Chelsea and narrowly beaten in the semi-final of the Champions League to Gerrard's Liverpool, who went onto win it.\n2006: Fabio Cannavaro, Real Madrid\nIn 2006, the last Ballon d'Or to be won by a defender was given to Fabio Cannavaro.\nThe defender won the league with Juventus – later stripped after the Calciopoli scandal – before captaining a stringent Italy side to a fourth world title and moving to Real Madrid. Given that the Azzurri had no star attacker, really, Cannavaro was a natural choice.\nAs was Gianluigi Buffon, also of Juventus, who came second in the stakes, while Thierry Henry finished third. The Arsenal striker had finished second in the Champions League and World Cup final, top-scoring in the Premier League in 2005/06, too.\n2007: Kaka, AC Milan\nThe first year that Lionel Messi and Cristiano Ronaldo got into the top three of the Ballon d'Or vote, neither of them won it. Ronaldo won the league with Manchester United to scoop second in the vote, while Messi enjoyed a breakout season with Barça but crashed out of the Champions League in the last-16.\nThe award went to Kaka, mesmeric in midfield as AC Milan glided to a seventh European title. This was the last time that a player other than the big two would win the award for a little while.\n2008: Cristiano Ronaldo, Manchester United\nCR7's first award win came as United won a league and European double. Ronaldo was at the heart of it, scoring 31 goals in the Premier League: he'd move to Real Madrid the following summer to become the most expensive player on Earth.\nMessi trailed in second, while Liverpool striker Fernando Torres finished third, thanks in part to his role in Spain's Euro 2008 win.\n2009: Lionel Messi, Barcelona\nMessi's first Ballon d'Or win was a unanimous decision. The little genius was the catalyst to Barça's legendary 2009 in which the club won six trophies – and Messi scored in the 2009 Champions League final. Clubmate Xavi, also integral, finished third in the vote.\nRonaldo was second in the stakes, despite his transfer to Spain – but this edition of the award marked the beginning of four straight calendar years in which the top three in the Ballon d'Or vote were all playing in La Liga.\n2010-2019\n2010: Lionel Messi, Barcelona\nMessi made it two in a row in 2010, despite Barcelona losing their Champions League title. The Argentine managed 58 goals in 54 games in Blaugrana colours that season, including four in a single match against Arsenal in the last-16 of the Champions League.\nBarça completed a unique one-two-three of their own when Spain World Cup stars Andres Iniesta and Xavi were voted second and third, respectively. 2010 became the first season in which a single academy had provided the top three players in a BDO vote.\nStarting from 2010, the award became the FIFA Ballon d'Or, replacing the governing body's own award for the best player on Earth.\n2011: Lionel Messi, Barcelona\nBarcelona were back on top on the continent and Messi made it three in a row in the Ballon d'Or, becoming the first player to do so since Michel Platini in the 1980s. Once again, club team-mate Xavi was voted third, for a third successive season.\nCristiano Ronaldo hit 60 goals in 60 games that season, winning silver in the Ballon d'Or vote for 2011.\n2012: Lionel Messi, Barcelona\nOnce again, Lionel Messi made Ballon d'Or history to lift the trophy four times on the trot. This put him out in front as the greatest winner in the competition's history, as the Argentine scored an astonishing 91 goals in all competitions for club and country in 2012.\nRonaldo trailed with 63 and was voted second for the prize, despite Real Madrid wrestling the league title back from their rivals' grasp. Andres Iniesta, who had won a third successive international tournament with Spain, was voted third.\n2013: Cristiano Ronaldo, Real Madrid\nCristiano Ronaldo snatched back the BDO from his nemesis, repeating the feat of getting the prize despite losing the title. CR7 scored 69 goals to Messi's 45 that year: he won 27.99% of the vote to Messi's 24.72%.\nBayern Munich won the Treble – including the Champions League – in 2013, seeing Franck Ribery crowned third on the list… and break the four-year dominance of La Liga stars on the podium.\n2014: Cristiano Ronaldo, Real Madrid\nRonaldo won a third BDO after lifting the Champions League with Real Madrid – and was probably helped in his win by Lionel Messi losing the World Cup final with Argentina. The Flea was voted the best player of the tournament but trailed the Portuguese in the end-of-year vote.\nManuel Neuer, who introduced the world to the sweeper keeper in Brazil that summer, came third in the vote.\n2015: Lionel Messi, Barcelona\nLionel Messi was given the Ballon d'Or in 2015 for a fifth time, having won another treble with Barça and having scored 54 goals as part of the MSN triumvirate. Ronaldo actually scored more that calendar year – but came second all the same.\nNeymar, who scored in Berlin's Champions League final, took third in the poll. This was the last time that FIFA had the Ballon d'Or, the award reverting back to France Football's for the following year.\n2016: Cristiano Ronaldo, Real Madrid\nCristiano Ronaldo won his fourth Ballon d'Or and became the outright second-best player in the vote's history in 2016, when he won another Champions League with Real Madrid and lifted his first international trophy, Euro 2016.\nFor a second summer in a row, Messi was beaten on penalties in the Copa America final with Argentina. He ended the BDO polling with less than half (316) of Ronaldo's votes (745).\nAntoine Griezmann, Best Player and top scorer at Euro 2016, as well as a Champions League runner-up with Atletico Madrid, came third.\n2017: Cristiano Ronaldo, Real Madrid\nOnce again, Real lifted the Champions League as Ronaldo starred for Los Blancos. The Portuguese equalled Messi's tally of five Golden Balls and beat his rival to the Ballon d'Or – while also beating him to a league title that the Argentine had almost carried Barça to.\nNeymar finished third again, having swapped Barcelona for PSG in a record-breaking £198m transfer.\n2018: Luka Modric, Real Madrid\nThe duopoly was finally broken – but it went to another Real Madrid star. The club's Threepeat saw midfield metronome Luka Modric honoured, since he'd also finished as a World Cup runner-up and Best Player. Ronaldo crept into second, having moved to Juventus that summer.\nThis year became the first since 2008 not to see Messi in the top three of the voting: instead, Europa League and World Cup winner Griezmann took third.\n2019: Lionel Messi, Barcelona\nDespite Barcelona's spectacular collapse in the Champions League semi-final to Liverpool, Lionel Messi won La Liga and a record sixth Ballon d'Or in 2019. Ronaldo finished third on the list, having also fired his club, Juventus, to a title but shockingly crashed out of the Champions League.\nVirgil van Dijk, who had won the Champions League and lost the Premier League despite Liverpool collecting 97 points, finished just seven votes behind Messi in second.\n2020—\n2020: Cancelled\nThe 2020 Ballon d'Or was cancelled, owing to the COVID-19 pandemic.\nRobert Lewandowski was considered the worthy winner, should there have been an award, with 40 goals in 36 appearances, as Bayern Munich won the Champions League behind closed doors.\n2021: Lionel Messi, PSG\nIronically, the first player from outside La Liga to win a Ballon d'Or since 2008 was… Lionel Messi. Having won the Copa Del Rey with Barça and the Copa America with Argentina before his underwhelming move to Ligue 1, many were surprised with the award going to the Argentine for the seventh time.\nLewandowski continued his incredible form, scoring 69 all year, including a record 43 in the Bundesliga for Bayern. Jorginho got third in the vote, having won the Champions League with Chelsea and Euro 2020 with Italy.\n2022: Karim Benzema, Real Madrid\nBenzema lifted the big golden ball aloft after a superb season in which he won a La Liga and Champions League double with Real Madrid, and the UEFA Nations League with France.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.\n- Conor PopeOnline Editor",
  "word_count": 4054,
  "scraped_at": "2026-02-14T01:51:09.217934",
  "_text_extracted": true
}