{
  "article_id": "54dfdf144835",
  "url": "https://www.thenationalnews.com/news/mena/2025/07/08/evacuations-in-syrias-latakia-countryside-as-wildfires-advance-on-homes/",
  "title": "Evacuations in Syria Latakia countryside as wildfires advance on homes",
  "date": "20250708T101500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Syrian firefighters were evacuating people from their homes in the Latakia countryside on Tuesday as wildfires advanced \"dangerously close\" to populated areas.\nThe forest fires have been burning since last Wednesday across coastal regions that are home to most of Syria's green cover, fanned by strong winds and high temperatures.\nNeighbouring countries have stepped in to help, with Turkey and Jordan sending fire engines and planes to help contain the blazes.\nOn Tuesday, Syrian state news agency Sana said the fires had expanded to areas near Al Ghassaniya village in the Ras Al Basit district of Latakia, where they were approaching homes as the wind speed accelerated.\nFirefighters were working to halt the fire’s advance and evacuate residents, said Abdul Kafi Kayyal, director of Syria's civil defence in the coastal region.\nThe flames are now \"dangerously close to populated areas in Al Ghassaniya, and teams are making every effort to contain the blaze\", Sana quoted him as saying.\nWildfires devastate Latakia\nRaed Al Saleh, Syria's Minister of Emergency and Disaster Management, previously described the wildfires as “one of the most difficult\" to tackle due to the rugged terrain.\nThe region contains most of Syria's green space, covering about 4,000 square kilometres, or 2 per cent of the nation's land mass, according to data recorded in 2010 before Syria's civil war broke out.\nDecades of illegal logging along with unlicensed building and farming, particularly during the 13-year war, have compromised the country's forests.\nBesides Latakia, the fires have also ravaged the Baniyas and Tartous governorates.\nSyria, once a regional breadbasket, is undergoing one of its worst droughts in decades. In the late 2000s, the country became a wheat importer due to a lack of rain and the illegal use of water wells, which affected underground reservoirs.",
  "word_count": 295,
  "scraped_at": "2026-02-14T01:49:44.683116",
  "_text_extracted": true
}