{
  "article_id": "551584c78fe3",
  "url": "https://www.teamtalk.com/tottenham-hotspur/league-leading-manager-implies-spurs-transfer-mistake-spotting-void-ousted-star-four-useful-traits",
  "title": "League - leading manager implies Tottenham transfer mistake by spotting void for ousted star with four useful traits",
  "date": "20230318T184500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nLeague-leading manager implies Tottenham transfer mistake by spotting void for ousted star with four useful traits\nA manager benefitting from a Tottenham transfer decision has explained how his initial ‘doubt’ about the call has grown into a conviction that the player in question could still be useful in north London.\nFor the current campaign, Tottenham have offloaded several first-team players on loan deals to other clubs. Most of those players had failed to earn a regular place in Antonio Conte’s plans, so needed fresh challenges.\nIn some cases, Tottenham might have preferred permanent sales, but had to get rid of their flops in whichever way possible.\nFor example, Spurs have been trying to find a solution for Tanguy Ndombele for a while. He became their record signing when joining from Lyon in 2019, but struggled for consistency over the next two-and-a-half years before returning to the Ligue 1 side on loan.\nAfter Lyon neglected the chance to buy Ndombele back in the summer, Tottenham had to try and find a new buyer. Ultimately, they settled for loaning him to Napoli in Serie A.\nNdombele has become part of a title-chasing squad in Naples. After 26 Serie A games this season, Luciano Spalletti’s side are already 18 points clear at the top of the table.\nThe Tottenham loanee has played in 24 of those 26 league matches so far, although he has only started six. He has added eight appearances, including three starts, between the Champions League and Coppa Italia.\nDespite not starting in Serie A for Napoli since before the World Cup, Ndombele retains the faith of his current head coach. In fact, Spalletti has now claimed that the 26-year-old would be capable of filling a perceived hole in Tottenham’s lineup.\nREAD MORE: Tottenham ‘above all’ in race for standout World Cup midfielder but face battle with Barcelona\nSpalletti suggests Tottenham should have kept Ndombele\nSpalletti told a press conference: “Ndombele is a strong player. At the beginning I didn’t know him much. There was a doubt as to why Tottenham had let him leave.\n“From what I saw, watching the Milan-Tottenham match, I would have kept him in the side.\n“He’s someone I train willingly. He’s also a very sweet boy, physically strong. In the modernity of football, there is this physical strength which is important. He has strength, engine, technique, flashes in which he sees where the hole is.\n“I like him – as they say in Tuscany.”\nAs Spalletti referred to, Milan recently eliminated Tottenham from the Champions League. In the first leg at San Siro, Spurs had to use a relatively inexperienced midfield pairing of Pape Matar Sarr and Oliver Skipp.\nFor the return leg, the more senior Pierre-Emile Hojbjerg took Sarr’s place alongside Skipp. Rodrigo Bentancur and Yves Bissouma were both unable to play due to injury.\nHence, with a fully fit squad, Ndombele may have struggled to get in anyway. But he is acting as a depth player for Napoli and perhaps could have done the same for Spurs, providing more senior cover than Sarr or Skipp.\nIf Ndombele was to return to the Tottenham fold at the end of the season, he would have a contract there lasting until 2025. However, Napoli have the option to buy him for €30million (£26.5m).\nAs things stand, they would not want to buy Ndombele for that price. But if Tottenham are willing to negotiate, they could make a lower offer to keep the Frenchman in Italy.",
  "word_count": 586,
  "scraped_at": "2026-02-14T01:59:46.885388",
  "_text_extracted": true
}