{
  "article_id": "5537320c9df6",
  "url": "https://www.arsenal.com/news/three-gunners-puskas-and-marta-awards",
  "title": "Three Gunners up for Puskas and Marta Awards",
  "date": "20251114T150000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Declan Rice has been nominated for the 2025 FIFA Puskas Award, while Mariona Caldentey and Kyra Cooney-Cross have received nominations for the 2025 FIFA Marta Award.\nThe awards recognise the greatest goals of the year, and two of our most spectacular goals have been nominated across the two shortlists, along with a stunning strike from a Gunner on international duty.\nDeclan’s nomination for the Puskas Award comes from one of our most memorable nights at Emirates Stadium, as his second free-kick in our 3-0 win over Real Madrid makes the shortlist.\nThe England midfielder had already scored the first free-kick goal of his career to open the scoring in the Champions League quarter-final, but doubled his tally with an even more spectacular effort 12 minutes later.\nFrom where the ball was set up, the seemingly obvious option would have been to dip the ball over the wall and into the near post, but Declan had other ideas, whipping the ball around the wall and right into the far top corner.\nMariona’s nomination for the Marta Award also comes from a famous Champions League victory, as she produced a stunning, curling effort away to Lyon in last season’s semi-final success.\nAfter the ball was laid off to her by Alessia Russo, our Spaniard shimmied away from two Lyon challenges, before curling an outrageous effort into the top corner, putting us ahead on aggregate for the first time in the tie.\nThe timing of the goal was just as perfect as the execution from Mariona, as we went in at half-time 2-0 up on the day and with a 3-2 aggregate lead having lost the first leg 2-1 at Emirates Stadium.\nWe went on to win the game 4-1, securing a 5-3 aggregate victory, and of course beat Barcelona 1-0 in the final to lift our second Women’s Champions League title.\nKyra Cooney-Cross has also been nominated for the Marta Award for her spectacular long-range strike in Australia’s friendly against Germany in October 2024.\nWith the goalkeeper off her line, Kyra lobbed the ball into the roof of the net from just inside the German half, marking her first goal for the Matildas in style.\nOur midfielder’s goal was the equaliser in the friendly, and her side went on to win the game 2-1 through Clare Hunt’s header, also her first international goal.\nThe Puskas Award and Marta Award are part of The Best FIFA Football Awards, for which we’ve received four other nominations.\nRenee Slegers has been nominated for the Best Women’s Coach, while Mikel Arteta has received a nomination for the Best Men’s Coach.\nAlongside her nomination for the Marta Award for her strike against Lyon, Mariona Caldentey is also up for the Best Women’s Player Award.\nOur final nomination is for David Raya for the Best Men’s Goalkeeper Award, after he helped us match an English club record of eight consecutive clean sheets, keeping seven of the eight.\nVoting for the awards is divided between international coaches, international captains, journalists and supporters, with each group’s votes counting for 25% of the overall total.\nSupporters can vote for our Gunners and all of The Best FIFA Football Awards here.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 556,
  "scraped_at": "2026-02-14T02:09:38.464580",
  "_text_extracted": true
}