{
  "article_id": "556476568bef",
  "url": "https://www.thenationalnews.com/news/uae/2025/04/12/uae-to-lead-new-interpol-committee-aimed-at-enhancing-global-security-co-operation/",
  "title": "UAE to lead new Interpol committee aimed at enhancing global security co - operation",
  "date": "20250412T114500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UAE is to lead Interpol's governance committee, a body established last year to strengthen the global police agency's operations.\nThe Emirates is the first country to assume this role and will serve a two-year term.\nIt will be responsible for steering discussions on Interpol’s governance, enabling decision-making and ensuring effective co-ordination among member states to enhance the functioning of Interpol.\nLt Col Dana Hamid Al Marzouqi, director of the international affairs office at the UAE Ministry of Interior, was elected as chairwoman of the committee with 67 per cent of the votes from member states participating in the committee’s activities.\nThe election took place in Lyon, France, at Interpol's international headquarters.\nThe committee will oversee the review of Interpol’s statutes, regulations, and related documents, advising on necessary amendments or clarifications.\nAdditionally, it will provide guidance to the General Assembly on how to interpret and improve the organisation’s foundational legal frameworks, ensuring transparency and efficiency in its operations.\nThe committee will also address any concerns regarding the interpretation of these legal documents and include high-level experts in governance and international law from member states, ensuring broad and inclusive representation.\nIn late 2024, during the 92nd General Assembly of Interpol in Glasgow, Scotland, the decision was made to establish the governance committee as a permanent body under the general assembly.\nIt previously operated as a technical team, but now stands as a core part of Interpol's governance structure.\nThe UAE has played a leading role in international policing by hosting major events such as the Interpol General Assembly and the World Police Summit.\nIt has also introduced advanced technology to improve border security.",
  "word_count": 272,
  "scraped_at": "2026-02-14T01:49:31.510047",
  "_text_extracted": true
}