{
  "article_id": "5583671636e6",
  "url": "https://thepeoplesperson.com/2025/09/16/why-united-must-replace-ruben-amorim-with-ole-gunnar-solskjaer-298989/",
  "title": "Why United must replace Ruben Amorim with Ole Gunnar Solskjaer - Man United News And Transfer News",
  "date": "20250916T103000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim’s future at Manchester United is currently the talk of the town. With 17 wins from 47 games, the Portuguese head coach has managed just a 36.17% win ratio since taking charge in November last year.\nHe has managed just one win in five games across competitions this season, including the 3-0 defeat to Manchester City, despite investing a fortune in the squad over the summer.\nInterestingly, the Red Devils have been far less patient with his predecessors.\nDavid Moyes left Old Trafford after less than a year with a 52.94% win ratio. When Louis van Gaal was sacked, he had managed 54 wins in 103 games, registering a 52.43% win percentage.\nJose Mourinho departed having won 58.33% of his games, while Ole Gunnar Solskjaer had a 54.17% win ratio when he was sacked. Amorim’s immediate predecessor, Erik ten Hag, left his position having won 70 of his 128 games in charge, with a 54.69% win ratio.\nAs such, there is a possibility that Amorim won’t survive the nightmare at the Theatre of Dreams.\nOptions to replace Amorim\nThere is no dearth of options for INEOS, should they decide to part ways with Amorim in the coming weeks. Unai Emery has been mentioned in recent reports, while Andoni Iraola, and Oliver Glasner have been linked as well. Zinedine Zidane’s name is inevitably going to be in the mix as soon as the opportunity arises.\nHowever, none of those appointments are without risks, especially since highly rated young managers have previously failed to live up to expectations at Old Trafford.\nPerhaps United should consider giving one of their former managers a second chance instead.\nAn era of optimism\nWhen United appointed Solskjaer as their interim manager in December 2018, the club was in turmoil. Mourinho’s third-season syndrome had kicked into effect and the squad was low on morale.\nThe Red Devils needed a miracle and in stepped the Baby-faced Assassin.\nUnited fans of old were swept by a wave of nostalgia at the sight of his charming smile. As a player, Solskjaer was clinical, composed, and intelligent, qualities which he sprinkled on the squad immediately upon arrival.\nThe Norwegian won his first game in charge 5-1 against Cardiff City, which was the first time the team had scored five goals in a game since Sir Alex’s retirement.\nOle embarked on a run so impressive that he was handed the full-time job before the end of the campaign.\nWhile the Norwegian finished within the top three in both of his two full seasons in charge, he failed to win a trophy and ultimately lost his job in November 2021.\nSolskjaer is available to take over\nSolskjaer, interestingly, took a lengthy sabbatical following his departure from Old Trafford, before taking charge of Besiktas in January this year.\nUnfortunately, he was relieved of his duties last month, but his record at Istanbul – 15 wins from 29 games with a 51.72% win ratio – is still superior to Amorim’s at Old Trafford.\nWhat United need right now is someone to come in and steady the ship, even if on a short-term basis. Ole already has a tremendous record of doing just that.\nFamiliarity with the United Way\nSolskjaer is well versed in the “United way” and relied heavily on youth during his previous stint. The Norwegian also oversaw some of the best football at Old Trafford since Sir Alex’s retirement.\nThe likes of Kobbie Mainoo could benefit immensely from Ole’s arrival, while veterans like Bruno Fernandes will also thrive once again under his man-management.\nAfter an overload of tactical acumen, perhaps it is “vibes” that will come to United’s rescue now.\nA squad ready made for the fluid 4-3-3\nDuring his tenure, Solskjaer was extremely fluid in his formation and tactics, something that cannot be said about Amorim. Many would argue that the 3-4-3 stifles the likes of Bruno and Mainoo, and relies too much on Patrick Dorgu.\nOle’s 4-3-3 could be a welcome change, with a ready-made attacking trio that would thrive off a midfield trident of Bruno, Mainoo and Casemiro. A back-four of Noussair Mazraoui, Leny Yoro, Matthijs de Ligt and Dorgu would be solid as well.\nIn Manuel Ugarte, Amad Diallo, Diogo Dalot and Harry Maguire, the Norwegian would also have enough quality on the bench. Interestingly, of the squad Ole oversaw during his time at Old Trafford, only Maguire and Bruno remain.\nA move not devoid of risks\nSceptical fans, though, will point out that Ole’s time at Old Trafford is done. There will be references to his alarming spell with Cardiff City, where he managed a mere 30% win ratio. The abrupt end to his tenure with Besiktas will draw eyebrows as well.\nHowever, it has to be remembered that the Norwegian had to drift through chaos during his time in charge of United. The recruitment let him down, there was instability behind the scenes, and the squad was marred by injuries.\nYet, Ole fought to secure back-to-back top four finishes for the first time since Sir Alex Ferguson’s departure. He also took the team to the Europa League final, where, with some luck and a fit Maguire, the result could have been entirely different.\nWith INEOS stabilising things at the club, and a recruitment structure now in place, Ole is bound to perform better. Having already experienced ups and downs during his previous reign, the Norwegian is more equipped to deal with the turmoil of managing United.\nMountains to be climbed\nIn February 2019, United succumbed to a 2-0 defeat at home against Paris Saint-Germain (PSG) in the Champions League Round of 16 first leg. Ole faced a daunting task of beating the Parisians at their home ground to progress in the tournament.\nTo make matters worse, at least 10 players would be missing due to injuries and suspension for the second leg. However, at the end of the defeat at Old Trafford, the Norwegian gave a defiant response when asked about the enormous task at hand.\n“Mountains are there to be climbed,” said Solskjaer.\nTwo weeks later, Ole had gifted fans with ‘that night in Paris’, as the Red Devils powered to a 3-1 win in the enemy’s backyard.\nIt cannot be just a coincidence that Ole Gunnar Solskjaer is available for his next assignment at the moment. There are mountains to be climbed at The Theatre of Dreams as well right now.\nThe prodigal son’s story with United is far from over.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1082,
  "scraped_at": "2026-02-14T01:55:21.391423",
  "_text_extracted": true
}