{
  "article_id": "558fca72bebe",
  "url": "https://www.teamtalk.com/manchester-city/pedro-porro-manchester-city-tottenham-hotspur-real-madrid-decision",
  "title": "Man City news : Pep Guardiola targets £50m Tottenham star who  like a bulldog  after Real Madrid U - turn",
  "date": "20250422T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City target £50m Tottenham star who’s ‘like a bulldog’ after Real Madrid U-turn\nManchester City are interested in signing Pedro Porro in the summer transfer window, according to a report, which has revealed the decision that Tottenham Hotspur chairman Daniel Levy has made on the right-back’s future.\nIt has been a hugely disappointing season for Man City, who could end up outside the Premier League top five and missing out on qualification for next season’s Champions League. While Pep Guardiola’s side have reached the semi-finals of the FA Cup, they could not win the Carabao Cup and failed to do anything of note in the UCL this season.\nThere are likely to be changes in the Man City squad in the summer transfer window, especially with players such as Kevin De Bruyne leaving.\nAn area that last season’s Premier League champions are keen on strengthening this summer is at right-back.\nKyle Walker left for AC Milan on a loan deal in the January transfer window, and while the Englishman’s contract at the Etihad Stadium is until 2026, it is hard to see the 34-year-old staying at the club beyond the end of the season.\nRico Lewis has done well at right-back this season, but he is only 20 and is still developing and progressing as a footballer.\nAccording to TBR, Man City have identified Tottenham and Spain international star Porro as a potential target at right-back.\nPorro moved to Man City from Girona in 2019 and left for good in 2022 after loan spells at Real Valladolid and Sporting CP.\nMan City have kept tabs on Porro’s progress since and have been impressed with his performances for Tottenham this season.\nTBR has noted that Spanish and European giants Real Madrid have also been interested in the 25-year-old Spain international right-back, who, according to his Tottenham team-mate Dejan Kulusevski in Football.London in January 2024, is “like a bulldog” who is “always bringing energy and always having fun”.\nHowever, with Liverpool right-back Trent Alexander-Arnold set to move to the Santiago Bernabeu as a free agent this summer, Madrid have decided to abandon their pursuit of Porro, who is valued at £50million by Tottenham.\nDaniel Levy stance on Pedro Porro sale\nAccording to TBR, Tottenham chairman Daniel Levy has personally decided to sell Porro in the summer transfer window.\nIf Spurs get an offer of £50m or more, then the north London club would cash in on the 25-year-old right-back, who has scored three goals and given eight assists in 46 matches in all competitions this season.\nWhile Djed Spence did well at left-back this season, with Destiny Udogie now fit, the former could start at right-back, leaving Porro’s future in doubt.\nTottenham reportedly see Spence as a first-choice right-back and are willing to offload Porro for £50m or more, according to the report.\nDuring his time at Tottenham so far, Porro, who cost the Premier League club £40m in transfer fees, has made 100 appearances, scoring 10 goals and providing 19 assists in the process.\nLatest Man City news: Rodri decision, left-back target\nAn out-of-favour Man City midfielder has been tipped to move to Leeds United in the summer transfer window.\nLeeds will play in the Premier League next season after winning promotion from the Championship.\nCurrently on loan at another Premier League club, the expensive midfielder does not have a long-term future at Man City under manager Pep Guardiola.\nRodri has made a decision on his future amid interest from Real Madrid, according to a report.\nLos Blancos have taken a shine to Rodri, who is one of the best midfielders in the world and has already made up his mind where he would play next season.\nMeanwhile, Man City are said to be admirers of a left-back Liverpool are determined to sign.",
  "word_count": 639,
  "scraped_at": "2026-02-14T01:58:31.710894",
  "_text_extracted": true
}