{
  "article_id": "55adfb190ae3",
  "url": "https://apnews.com/article/fifa-european-commission-union-fifpro-leagues-26755d17d3fe610f302df72f88eac2ef",
  "title": "Soccer player unions and leagues in Europe go to Brussels with latest legal challenge against FIFA",
  "date": "20241014T234500Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Soccer player unions and leagues in Europe go to Brussels with latest legal challenge against FIFA\nSoccer player unions and leagues in Europe go to Brussels with latest legal challenge against FIFA\nIn a busy soccer season when players have talked of going on strike, their union teamed up with domestic leagues to go to the European Union on Monday with a long-promised challenge to FIFA about how it adds new and bigger men’s competitions.\nThe European division of player union FIFPRO and the 33-nation European Leagues group filed a formal complaint on competition grounds, alleging FIFA fails to consult properly on decisions that are to its commercial benefit.\nIt is the latest dispute playing out in the legal arena, where FIFA has been pressured in the past year by rulings related to the European Super League, player agent regulations and — just this month — the global transfer market.\nOn the field, FIFA will launch a 32-team Club World Cup — including 12 from Europe — in the United States next June and July, and the 2026 World Cup, also in North America, will have 48 teams instead of 32 and last for one extra week.\nFIFPRO said “the oversaturated international football calendar risks player safety and wellbeing,” and at a briefing played a video montage of Kylian Mbappé and star players talking about their increasing workload.\n“You have so many competitions and we are happy to play but when it’s too much, it’s too much,” Mbappé said at an awards ceremony in May.\nThe France superstar is set to go to the Club World Cup with Real Madrid.\nThe complaint delivered Monday to the European Commission targets FIFA, which manages the calendar of protected dates for national-team games. Clubs must release players who are selected.\n“The complainants are not seeking financial compensation from FIFA, but instead a fair and inclusive decision-making procedure,” their lawyer Mark English said, adding the EC was asked to make a “cease and desist” decision on FIFA breaking European competition law.\nIt does not cite European soccer body UEFA, which this season has committed hundreds of players to extra competitive games by expanding three of its men’s international competitions: the Champions League and Europa League for clubs, and the Nations League, which has a new playoffs system.\n“We have some representation (at UEFA) and we use that,” English Premier League lawyer Mathieu Moreuil said, when asked why the European body was left off the complaint. “With FIFA we have literally nothing.”\nOfficials from leagues, clubs and unions once had a formal seat at the table with FIFA on its Football Stakeholder Committee. It was shut down in 2021 by president Gianni Infantino.\nThis season, Europe’s domestic leagues have had their fixture scheduling options squeezed by four extra midweeks from September through January now occupied by UEFA club competitions.\nHowever, FIFA’s new club event was compared by Belgian league CEO Lorin Parys as a threat, like the Super League plan by elite clubs defeated in 2021 by a fan-led backlash.\n“Here comes FIFA through our back door whistling and yelling: ‘Surprise,’ saying: ‘We have got a present for you guys’, and it’s really the Super League under a different name,” Parys said.\nThe leagues’ grievance with FIFA is also in not being fully consulted during talks to agree the latest calendar renewal through 2030 for national-team games, which mostly force them to shut down lucrative weekend fixture slots.\nFIFA has said its offers this year of talks were not taken up.\nThe complaint in Brussels, to the executive arm of the 27-nation EU bloc, also was joined by Spain’s La Liga and claims FIFA abuses its dominant position in soccer.\nFIFA’s role, the complaint states, as governing body and regulator conflicts with its commercial objectives as a competition organizer.\nFIFA previously suggested there was hypocrisy in European soccer, which sees clubs play lucrative offseason games worldwide, while it had a global duty to protect and develop the game.\n___\nAP soccer: https://apnews.com/hub/soccer",
  "word_count": 667,
  "scraped_at": "2026-02-14T01:57:46.248098",
  "_text_extracted": true
}