{
  "article_id": "55be0fb960b0",
  "url": "https://dailynews.co.tz/46877-2/",
  "title": "Simba , Yanga on litmus test - Daily News",
  "date": "20231202T113000Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Simba, Yanga on litmus test\nDAR ES SALAAM/GABORONE: TANZANIA’s CAF Champions League (CAF CL) envoys, Simba and Young Africans today, when engage in crucial group stage fixtures as they face Botswana’s Jwaneng Galaxy and Egypt’s Al Ahly respectively.\nIn the first match, Simba go head-to-head against Jwaneng Galaxy at Obed Itani Chilube Stadium in Francistown, Botswana in an electric match set to attract attention of many people.\nThe teams are playing their second fixtures of Group B of the contest, with Simba salivating to produce their first win of this season’s competition.\nAfter being held to a 1-1 draw by ASEC Mimosas at Benjamin Mkapa Stadium in Dar es Salaam, refreshed Simba under the tutelage of new tactician, Abdelhak Benchikha who eyes to bring smiles back to the Reds family faces, are likely going to step up their campaign for a place in the knockout stages of Africa’s premier club football competition.\nAfter today’s match, Benchikha’s men will have another away tricky fixture versus Wydad Casablanca on Saturday next week in Morocco.\nA 20-man Simba strong squad tasked for today’s encounter is made up of goalkeepers Ally Salim, Hussein Abel and Ayoub Lakred.\nDefenders are Shomari Kapombe, Mohamed Hussein, Che Malone, Henock Inonga, Kennedy Juma, Israel Mwenda and Hussein Kazi.\nMidfielders are Clatous Chama, Fabrice Ngoma, Sadio Kanoute, Louis Miquissone, Essomba Onana, Saidi Ntibazonkiza and Mzamiru Yassin while strikers are Jean Baleke, Moses Phiri and Kibu Denis.\nFrom the paraded list, Aishi Manula and skipper John Bocco have not been included, hence they are not going to be part and parcel of the game.\nIn the second duel in Group D, Yanga will host the Champions League title holders, Al Ahly at Benjamin Mkapa Stadium in Dar es Salaam in a sparkling game, bringing together last season’s finalists of the Champions League and Confederation Cup.\nIt is Yanga who are heading into the duel heads down, following a heavy 3-0 upset from CR Belouizdad in their previous match in Algeria, but their Coach Miguel Gamondi has pledged that their members and fans should expect good results.\n“Our training sessions have been progressing well for this great match, and I am sure that they are going to work hard to attain such status, as we look forward to redeem ourselves from the disappointing 3-0 loss to CR Belouizdad.\nMoreover, Gamondi noted that football is a game of mistake, and as such they have to minimise committing blunders that can earn their opponents an opportunity to score.\nOn his part, Al Ahly Coach, Marcelo Kohler said he is aware that the match is set to be difficult, but they have prepared well and they target to produce nothing but good results, to continue with a winning streak in their Group D of the contest.",
  "word_count": 462,
  "scraped_at": "2026-02-14T02:20:16.283051",
  "_text_extracted": true
}