{
  "article_id": "55e3f86444ea",
  "url": "https://tribune.com.pk/story/2458729/bellingham-hits-out-at-ridiculous-two-game-ban",
  "title": "Bellingham hits out at  ridiculou two - game ban",
  "date": "20240308T013000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bellingham hits out at 'ridiculous' two-game ban\nReal Madrid midfielder set to miss Sunday's home game against Celta Vigo\nReal Madrid midfielder Jude Bellingham said his two-match ban for dissent is \"ridiculous\" and that he is being made an example of as a newer player in LaLiga.\nThe Spanish Football Federation (RFEF) suspended the 20-year-old for showing contempt towards referee Jesus Gil Manzano after receiving a red card in Real's 2-2 league draw with Valencia on Saturday.\nThe referee's report said Bellingham had displayed an \"aggressive attitude\" when he disputed Manzano's decision to blow the final whistle as the England international headed in Brahim Diaz's cross for what would have been the winning goal in added time.\n\"I didn't think I said anything very offensive towards him,\" Bellingham told Movistar after his side's 1-1 draw with RB Leipzig in their Champions League last-16 second leg tie on Wednesday.\n\"I think I ran in a manner that was similar to the rest of my team mates. I feel like at times because I'm new and stuff, they want to try and make an example ... I need to be responsible for my actions, and I gave him the excuse to send me off.\n\"I'm not happy with that. But I think if LaLiga and the club appeal, there can be a better agreement, because I think two games is a bit ridiculous. If I have to miss those games I take responsibility and I'll support the team from the stands.\"\nReal reached the quarter-finals of the Champions League with a 2-1 aggregate victory over RB Leipzig. Bellingham is set to miss Sunday's home game against Celta Vigo and the trip to Osasuna on March 16 in LaLiga.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 310,
  "scraped_at": "2026-02-14T01:48:46.207850",
  "_text_extracted": true
}