{
  "article_id": "55ee6bd5ed78",
  "url": "https://www.twtd.co.uk/blogs/21957/opposition-preview--sheffield-wednesday",
  "title": "Opposition Preview - Sheffield Wednesday by ad _ wilkin - Ipswich Town Blog",
  "date": "20230914T120000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Written by ad_wilkin on Thursday, 14th Sep 2023 10:06\nTown return from the international break to face lowly Sheffield Wednesday who sit in 23rd place with only one point so far.\nThe Owls are only off of the bottom courtesy of goal difference ahead of Middlesbrough. Following promotion back to the Championship after some dramatic play-off exploits, Wednesday parted company with manager Darren Moore in acrimonious circumstances with disagreements over budgets and ambitions cited as the reasons.\nTo add to this chaos, chairman Dejphon Chansiri released a statement on Wednesday throwing his former manager under the bus.\nIn has stepped Xisco Munoz who will be known to some as being one of Watford’s many managers to have entered and exited the revolving door at Vicarage Road.\nDuring his time at Watford Munoz managed 36 games, taking them back to the Premier League before he was sacked and replaced by Claudio Ranieri as the Hornets slid to relegation. Since then, he hasn’t been overly successful. Having one season at Huesca and then a three-month spell at Anorthosis in Greece.\nSo far, Wednesday’s only win this season has been the 1-1 penalty victory against Stockport in round one of the Carabao Cup. However, they were dumped out of the second round on penalties by League Two side Mansfield.\nIn the league they have lost to Southampton (2-1), Hull (4-2), Preston (1-0), Cardiff (2-1) and finally got their first points of the season on the board against Leeds in a 0-0 draw. They switched back to their 5-3-2 of last season against both Cardiff and Leeds and have given better showings in both of those games.\nAs you can see below, they reduced their number of goals conceded, managed to create more shots on goal and force more corners. They were also more solid defensively and gave away less fouls. They’re likely to stick with this formation as they look to get their first win on the board.\nThis is how their squad shapes up.\nGoalkeepers\nNumber one from last season Cameron Dawson started the season in goal against Southampton before immediately being replaced by loan signing from AC Milan Devis Vasquez. The Colombian, despite being 25, is only in his second full season of senior football as a number one, with his other one coming for Club Guarani in Paraguay. He’s had a tough start so far conceding seven goals in three appearances.\nThis has left Dawson on the bench for now. In his 22 League One games last season, having come in and taken the number one spot from David Stockdale, he kept 13 clean sheets, making 43 saves and only conceding 16 goals. Dawson came back in for the cup game against Mansfield and looked solid so will definitely be pushing for that spot back from Vasquez coming into this one.\nDefenders\nThere’s quite a lot of rotation in the right-back area with players who can play right wing-back, right-back or right centre-half and in Callum Paterson even one who can play up top.\nThe 17-times-capped Scotsman is one of very few players who can play as a centre forward (133 career apps), right midfield/wing (58 career apps) and right-back (99 career apps). He’s got a decent goal record with 23 in 134 Sheffield Wednesday appearances and his versatility makes him a vital part of the squad.\nHis work rate and versatility have seen him slot in at right wing-back for the last couple of games and give Munoz the option to change the formation mid-match if he needs to.\nA familiar name who can also play there is former Town loanee Dominic Iorfa, who made 23 appearances for the Super Blues in the 2017/18 season on loan from Wolves before finding a permanent home at Sheffield Wednesday the season after.\nIorfa is now going into his fifth season with the Owls, making 32 appearances last term. Used mainly as a right-back/right wing-back in his Town times, he’s featured a lot more as a centre-back for Wednesday. He started the season as one of the two centre-backs in a 4-2-3-1 but seems to be out of favour in the back five currently.\nA lot of the reason Iorfa was moved across was Liam Palmer's form, with him taking that right-back position for the majority of last season.\nPalmer, now 31, has spent his whole career at Hillsborough apart from a brief loan spell at Tranmere Rovers. He’s racked up 402 appearances for them and scored seven goals last season, including the dramatic last-minute equaliser against Peterborough in normal time of the play-off semi-final in the miraculous comeback after they had been 4-0 down from the first leg.\nIt may seem that Wednesday are covered in the right-back position in that case but they still went and spent £300,000 on Pol Valentin. The 26-year-old Spaniard signed in the summer from Sporting Gijon having spent all of his career in Spain. His only appearances have come in the cups so far but he did impress against Mansfield. With Wednesday’s poor form he may get a chance in this one.\nMoving along the defence we have the more natural centre-backs. Michael Ihiekwe was picked up on a free from Rotherham in July 2022.\nIhiekwe made 20 starts in the League One-promotion season, dropping out of the squad in November before coming back in for the crucial play-off games. He started this season in the team but was dropped after a poor performance against Hull and like Iorfa doesn’t seem to be favoured in that back three.\nArriving to bolster the central defence is Bambo Diaby who has signed from Preston North End on an undisclosed fee. The 25-year-old was a bit-part player for Preston last season, only making nine starts. He’s also had spells at Barnsley, Belgian side Lokeren and Spanish side CF Peralada without ever properly finding a home. Diaby’s played the full 90 minutes in each of Sheffield Wednesday’s last three games and will be hoping that Hillsbrough is the place he can finally stabilise his career.\nAlso coming in to compete in that spot is young Jamaican Dishon Bernard. Picked up on a free transfer following his release by Manchester United, Bernard will be looking to build on loan spells at Salford, Hull and Portsmouth and make the step up to Championship level.\nHe’s made one league and one cup start so far as Munoz continues to shuffles his backline to find the right set-up. He was part of the back three that kept the clean sheet against Leeds so should keep his place for this one.\nThere’s a former Canary at left-back in Akin Famewo. He joined Wednesday in July 2022. He only made one appearance for Norwich with most of his game time coming in two loan spells at Charlton. Last season he made 17 appearances in Wednesday’s League One campaign and he has featured three times so far this season.\nHowever, Munoz has switched to a back five and looks to favour other options as the left wing-back, but Famewo has been trialed at left centre-back and slotted in there fairly well against Leeds so may still keep his place in the starting line-up.\nAnother left-back option is loanee-turned-permanent-signing Reece James. James excelled on loan last season and has made that move permanent this summer.\nHe has a lot of League One experience with 170 appearances but only has 32 in the Championship. He also provides versatility and can slot in at centre-back or even defensive midfield.\nJames has had to make do with minutes off of the bench so far this season but will be hoping to get a run in the side soon. Fans are pessimistic that this may happen as he came in before the appointment of Munoz and doesn’t seem to be favoured by the Spaniard so it may take an injury for him to force his way into the starting line-up.\nThe final defender is also a new signing. Chilean Juan Delgado signed for an undisclosed fee from Pacos De Fereira this summer and although a natural right-back has started the season on the right wing before being switched to play as an inverted left wing-back against Cardiff.\nHe’s another who is untested in the Championship having spent the majority of his career in Portugal, Mexico and Spain. He’s not got a bad goalscoring record over his career and netted in the 4-2 defeat by Hull.\nMidfielders\nThe first midfielder I want to look at is Wednesday’s latest signing. Jeff Hendrick joined on loan from Newcastle on deadline day. Known for his spells at Derby and Burnley, Hendrick comes with vast Championship experience with 251 appearances. He also has 147 in the Premier League.\nThe Irish international's move to Newcastle hasn’t gone as he’d have liked and he’s spent time on loan at Reading last season and QPR the season before. He played 45 games for Reading and scored four goals last season.\nHendrick will bring a bit of bite, experience and an ability to shoot from range to the midfield and could make his debut against Town.\nThat should free up star man Barry Bannan to do his thing. The Owls' playmaker notched up seven goals and 13 assists last season. He’s only netted once this season but there’s surely more to come.\nStatistically ,he has struggled a lot more in the Championship in terms of numbers: 0.19 goals per game in League One but that drops to 0.05 in the Championship. His assist tally is the same, 0.28 dropping to 0.15. An ever-present for Wednesday last year his age, 33, and the step-up could mean that his influence starts to wane this season.\nA midfield face in there that Town fans will recognise is Tyreeq Bakinson. The 25-year-old spent the second half of the 2021/22 season on loan at Portman Road, scoring two goals in 17 appearances.\nTown were rumoured to be interested at the end of that season with his Bristol City contract being up but opted against the deal. Bakinson instead joined the Owls making 26 appearances last term, although only 13 of those were starts. He’s still an important part of the squad for Wednesday with good physicality and the ability to pop up with a goal every now and then.\nAlso in that central midfield pack is George Byers. The Scotsman has spent most of his career at Swansea and had two years of Championship appearances under his belt with them before he made the choice to step down and join the Wednesday promotion project.\nByers has hit six goals in each of his last two league seasons so knows where the back of the net is. He drifts about the midfield and pops up a lot on the right-hand side but he’s another one who seems to have struggled a bit with the step back up to the Championship.\nAnother holding midfielder in that squad is Will Vaulks. The Welshman is one who comes with a bunch of Championship experience with two seasons at Rotherham and three more at Cardiff who paid £2.4 million for his services back in 2019.\nSheffield Wednesday picked him up for a free in July 2022 and he was another who excelled in League One. With Hendrick's addition and a switch to a back three for now, he could end up finding starts more limited.\nAdding to that unit this year is Mohamed Diaby who has joined on loan from Portimonense. The 27-year-old Frenchman has spent the majority of his career in Portugal but has only ever really been a bit-part player for Portimonense and Pacos Fereira.\nHis only game-time so far this season has been against Preston North End where he came off injured and hasn’t featured since so is unlikely to start this one. With more depth added he could find it hard to get his place back when he is fit again.\nForwards\nI’m grouping this next lot into forwards as there is a lot of versatility there and ability in a lot of Wednesday's forward players to play in different positions in what was at first a front three in a 4-3-3 but what Munoz looks to have switched to a one with the wingers further back in a 5-4-1 more recently with some success.\nWe’ll kick-off with stalwart Lee Gregory. The man who lost his mask in the play-off semi-final and had to ask a fan for it back is now 35 years old. He has spent his career roughly half and half in the Championship and League One with a decent goalscoring record of 137 goals in 388 appearances.\nGregory scored in the opening game against Southampton with a smart finish but is yet to find the next since then, having been deployed on both the left wing and as the central striker.\nNext up is the play-off winner. It was Josh Windass’s 123rd minute goal that broke Barnsley hearts and secured a return to the Championship for Sheffield Wednesday.\nHe started his career at Accrington Stanley and good form there saw him make a big move to Rangers. He made his move back to England with Wigan and spent one and a half seasons with the Latics in the Championship netting nine times in 56 appearances.\nThe second half of the 2019/20 season was spent on loan with the Owls before he made the move permanent as Wigan entered administration. His first full season with Wednesday was impressive but his nine goals and six assists weren’t enough to keep them up.\nWindass missed a lot of the 2021/22 season but played in both play-off semi-finals before becoming an indispensable member of the squad last season with 11 goals and seven assists.\nHe’ll be crucial again for Sheffield Wednesday this season and Ipswich will know all too well what an impact he can have with Windass providing both assists in the teams’ 2-2 draw at Portman Road in February.\nWith a lot of Wednesday’s players in their late 20s and early 30s they have tried to sprinkle in a bit of youth with the signing of Anthony Musaba. The 22-year-old Dutchman has spent the majority of his career at Monaco but has only made one appearance for them, playing two minutes in a Champions League qualifying match against Sparta Prague.\nThe majority of his football has come in four loans (Cercle Brugge, SC Heerenveen, FC Metz and NEC Nijmegen), the most productive of those at Cercle Brugge where he scored six in 29 matches. Still young, he’ll probably have to make the most of time off of the bench when trying to make an impact.\nFurther youth has been brought in with the addition of Djeidi Gassama who is a permanent signing from PSG. He’s featured once off the bench so far as he looks to be slowly introduced to the team. At only 20-years-old, Gassama looks to have been signed as more of one for the future.\nHe spent last season on loan at Belgian side Eupen in what has so far been his only taste of senior football but with the condensed fixture list coming up he could get some time off of the bench.\nA perhaps surprising deadline-day loan was the addition of John Buckley on loan from Blackburn. The 23-year-old comes with 114 Championship appearances and knows the division well but has fallen out of favour at Ewood Park.\nBuckley is still clearly a quality player, scoring a brace in Blackburn's 8-0 demolition of Harrogate in a standout performance. He also provides the versatility to play on the left, right or down the middle and will bring a bit more energy and thrust than the ageing Bannan.\nSheffield Wednesday’s main striker, Miachael Smith, is another who has impressive recent form against Town with two goals in two games against the Blues.\nThe big target man scored 17 goals in League One last term and has already added one to his tally of 18 Championship goals netted in two seasons at Reading, using his strength to hold off the defender and slot the ball past the onrushing keeper to score a second consolation goal in the 4-2 defeat to Hull.\nLuke Woolfenden and Cameron Burgess will be hoping to perform better in keeping him quiet than they did last season.\nTo provide competition for Smith up top, Wednesday have signed Ashley Fletcher on loan from fellow Championship side Watford. The former Manchester United youth product has bounced around a bit in his career with his most consistent spell at Middlesbrough coming after spells at Barnsley and West Ham.\nFletcher scored 28 goals in 109 appearances in that spell at Middlesbrough so knows where the net is but has always struggled with consistency.\nHis move to Watford hasn’t worked out with him having only made six appearances for the Hornets. This will be his third loan spell away from the club following time with New York Red Bulls and Wigan last season. He only scored twice at Wigan and will be looking to rediscover his scoring form at Hillsborough.\nPredicted Line-Ups\nWith Saturday-Tuesday double headers coming up, it’s hard to predict either team.\nFor Sheffield Wednesday Vasquez looks set to start in goal with Patterson at right wing-back. The centre-halves have been mixed round this season but I think it’s hard to change a defence that has kept a clean sheet, especially against a team like Leeds so I expect Bernard, Diaby and Famewo to continue.\nAt left wing-back I've gone with Delgado although there’s also the option to have him play further forward with Reece James potentially coming into that role.\nThe starting midfield of Bannan and Byers should continue if the formation stays the same with the extra stability of a Vaulks or Hendrick more likely to come on off the bench.\nOn the sides of the midfield, I've gone for the only change from the draw against Leeds with Musaba coming in for Gregory. Gregory has worked hard but it’s clear that left midfield slot is not his position and anyone who has watched Town's last couple of games and seen tricky winger cause problems down that side will see it as a weakness. Musaba is the man in the Sheffield Wednesday squad with the best profile to have a go at doing something similar.\nThat leaves Windass on the right to float inside and pick up spaces in between the lines, with the man who loves playing against Ipswich, Smith, up front.\nFor Ipswich I think these next two games are perfect for using the versatility and different skillsets of the squad with Sheffield Wednesday looking to sit deep and likely starting with a low block and Southampton looking to do the opposite, to dominate possession and suffocate us with the ball. Considering those factors I’m going with three changes from the Cardiff starting line up.\nVaz [Vaclav Hladky] keeps his place in goal and I've gone for an unchanged back four. I think Brandon Williams is getting more and more up to speed and I did consider him for Harry Clarke as a potential fourth change and I do think they’ll share minutes in this one again but Clarke's ability with the ball going forward means I can see him starting this one.\nWoolfenden and Burgess have continued to be solid so again new signing Axel Tuanzebe will have to wait for minutes off the bench.\nThe first change I've picked is in the centre of the park. Sam Morsy didn’t play too much in the international break and with Massimo Luongo having one of his poorer games against Cardiff, I think it’s time for Jack Taylor to be given a start. Against a Wednesday team that sit deep, his movement in the box and ability to pop up with goals from deep provide more to the team in this one than Luongo’s attributes for me.\nThe next change is on the right where I expect Omari Hutchinson to come in and play alongside Conor Chaplin and Nathan Broadhead. This is a change that I thought could happen even before Burns picked up a knock on international duty.\nLike the Taylor-Luongo switch, I think Hutchinson's abilities are better suited to this kind of game where he can look to open the defence up with his dribbling and try and create those opportunities and chances.\nFor similar reasons, that’s also why I’ve gone for Freddie Ladapo over George Hirst. Freddie changed the game against Cardiff with his back to goal hold-up play and ability with the ball at his feet which will suit this game perfectly as well. It will also give Hirst more time to shake off his knock and come back fit and firing for the Southampton game.\nAction Areas\nIf Sheffield Wednesday stick to their back three then Chaplin might finally be able to find some space in this one having been marked out of most of Town’s previous games. I expect him to play very close to the striker and almost form two up top at times.\nThe midfield battle will see Morsy renew acquaintances with Bannan which I'd back the former to win in his current form. Woolfenden and Burgess will likely have a less than enjoyable game against Smith but will this be the one where they finally keep him quiet?\nPrediction\nAway from home against a team down the bottom without a win so far, I'm expecting this one to be a scrappy battle much like the QPR game. Much like that match I'm going for a 1-0 Town win with our quality hopefully proving to be the edge.\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nYou need to login in order to post your comments",
  "word_count": 3630,
  "scraped_at": "2026-02-14T01:48:28.235066",
  "_text_extracted": true
}