{
  "article_id": "55f5c1d1ac87",
  "url": "https://www.thecable.ng/at-last-the-npfl-kicks-off",
  "title": "At last , the NPFL kicks - off",
  "date": "20231004T171500Z",
  "domain": "thecable.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There is this saying that, “the more things change, the more they stay the same”. That captures the story of club football in Nigeria, since we began to pretend that our domestic football league is “premier”. It is premier, but only in name. Ours is a country, where we like window-dressing, especially, using the most colourful of nomenclatures to tag anything we do. We rarely care about some inherent incompatibilities between the nomenclatures, and the substance of the projects.\nIt is only in Nigeria that a political office holder would drill a borehole that uses a “manual hand pump”, which technology came about, centuries ago, in other climes, and still have the audacity (induced, either by ignorance, or the will to be deceptive) to refer to it as “Ultra-Modern” on the day of its commissioning. Meanwhile, this is technology that has been phased out by its inventors, and replaced by more sophisticated, but less stressful ones. Or some would construct pit toilets as constituency projects, and call it “ultra-modern” in the 21st century.\nIt is in continuation of this culture of addiction to fanciful nomenclatures that we named our domestic club football competition, the Nigerian Premier Football League (NPFL). Meanwhile, the organisers, within themselves, know that there is nothing premier about the league. A league in which there is a little or no regard for date, time, and fixtures. A league that is not televised in the 21st century. Come to think of it, a league that has been running for about a decade now with neither a corporate sponsorship, nor a television package, being referred to as “premier”. Is that not ridiculous? I doubt if there is a functional insurance package for the league and the players in case of accidents (life-threatening or career-ending ones), as we speak.\nFurthermore, the manner of contracts governing the relationship between players and clubs are rarely enforceable. Apart from being ridiculously short-termed, players are, sometimes, not allowed to have a copy let alone hire a lawyer to examine the clauses, on their behalf, to avoid legal loopholes, and to know what to do, in case the club defaults. And that has led to many players (active or retired) being owed both sign on fees and salaries, leaving them with nothing to fall back on upon retirement. Some go bankrupt as soon as they retire. Some of them have had to resort to self-help to recoup parts, or all, of their outstanding salaries years after they have left the club or retired. Some would even need to hire thugs to waylay the debtor-clubs on away grounds before they get part, or all of their entitlements.\nAdvertisement\nTo the crux of this piece. Nigerian football stakeholders have been yearning for the alignment of the country’s football season with those of most European countries, and most parts of Africa, nay the entire world that run their league calendar, from August to May. This was to, among other things, avoid a situation where players would abandon their contracts with domestic clubs in the summer (when European clubs are off-season) and leave for trials abroad, searching for the proverbial greener pastures, in the middle of the Nigerian footballing season. This has jeopardised the performance of many clubs, both in the domestic league and in the CAF continental completions.\nI could remember, sometime around 1996 when Col. Abdulmumuni Aminu (retired) was the chairman of the Nigeria Football Association (NFA), the attempt at streamlining the country’s football calendar went afoot to protect local clubs from that mid-season “transfer rumour”. Since then, every successive season up to the last season, fixtures are cramped into a space of less than six months, forcing teams to honour two league fixtures, every other week, so they could round up by summer. Whenever they did “finish in time”, to commence the new season on time became an issue. They start postponements after postponements, after which there would then be commencement. That could last for up to five months. This is due to no other reasons than the tardiness of the football governing body in the land, the Nigerian Football Federation (NFF).\nFor the past 27 years, Nigerian club football has been moving in circles. Last season, due to their characteristic tardiness, they did not start the league until January this year (2023), as the commencement date suffered several postponements in 2022. That January was the time the league was supposed to be on mid-season break like it is done in saner climes. The league organisers, the Interim Management Committee (IMC) under the leadership of Honourable Gbenga Elegbeleye, having run out of time had to force an abridged version of the league down the throats of football stakeholders in the country. The 20 teams were divided into two groups –A and B– of ten each. So, instead of playing 38 games, they played 18 games after which the top three teams in each of the groups competed in a mini-league tournament in Lagos tagged, “The Super-six”.\nAdvertisement\nRemo Stars, Enyimba, Sunshine Stars, Bendel Insurance, Rivers United, and Lobi Stars were the top six from the two groups in no particular order. But Enyimba International, it was, who emerged the winner. The end of the mini-league signalled the conclusion of the 2022/2023 season by the second week of June. So every stakeholder became upbeat about the possibility of an early commencement of the 2023/2024 season, in fulfilment of a 27-year aspiration of changing the league calendar from January-December to June-May. People, including yours sincerely, thought they would build on the achievements recorded in terms of finishing a few weeks after those of European countries ended and set the league on the path of an upward trajectory with the timing.\nThe league organisers then told the whole nation that the new league season would commence on August 26, only for them to postpone it simply because they suddenly realised that they’d scheduled the annual general meeting (AGM) of the NFF for a day before the set commencement date. They, therefore, had to postpone. September 9 became the new chosen date and it was postponed again due to another frivolous reason. September 30 was proposed again but this time around, it finally kicked off, safe for the matches involving Bendel Insurance and Rivers United who had continental engagements over the weekend. The league did start but the momentum and the enthusiasm of the fans had been killed by the lack of organisation on the part of the league minders.\nIn contrast, before the end of last season (2022/2023) on May 28, 2023, the English Premier League had already announced that “the 2023/24 Premier League season would start on August 12 this year, and finish on May 19, 2024”. That is where things are done the way they are planned because those in charge know what they’re doing – they have their heads properly screwed on their shoulders. Even in the face of force majeure, like the demise of Queen Elizabeth ll and her funeral, the organisers of the league were able to minimise the impact of the disruption it caused on the league fixtures and ensured that the league ended exactly on the day it was billed to end. All the fixtures with date and time, barring any unforeseen circumstances, are already known. I can assure you that work would have, by now, begun on the fixtures for the next season and I won’t be surprised if the work is concluded before December this year. But here in Nigeria, things as frivolous as a naming ceremony at the residence of one of the NFF bigwigs could cause the league to be postponed. That is how we roll. That is who they (we) are. They can spend as many as five years preparing for one Christmas. Every date on the calendar meets them unprepared, even though, they picked it for themselves.\nThe frivolous postponements occasioned by the lack of seriousness of the minders of the league, apart from extinguishing the excitement of Nigerian football fans (who have been blamed for their strong loyalty to foreign clubs), are also causing Nigeria to pay a very high price on the continental front. Nigerian representatives in the CAF’s two flagship club competitions – the CAF Champions League and the CAF Confederation’s Cup, are usually been knocked out in recent years, by clubs from countries with less football pedigrees than Nigeria. For instance, Enyimba and Remo Stars who hoisted Nigeria’s flag in this season’s CAF Champions League got eliminated in the preliminary round by Al Ahli Benghazi of Libya and Medeama FC of Ghana respectively. While Enyimba lost 4-3 on aggregate after a barren draw at home, Remo Stars got eliminated 3-2 on penalties following a 1-1 aggregate scoreline.\nAdvertisement\nMeanwhile, of the two Nigerian representatives in the Confederation’s Cup, Insurance of Benin, and Rivers United, only the latter survived the preliminary round, defeating Etoile Filante of Côte d’Ivoire, 2-0 on aggregate in Port Harcourt on Sunday, October 1, after having registered a goalless draw away in the first leg. The story was no better in the last season’s campaign and the reason is not far-fetched. Eliminating the Nigerian teams becomes very easy because, by the time the competition starts, leagues in other African countries are already on with the players in a better competitive mood and physical as well as mental state for the rigours of the competition. Meanwhile, Nigerian clubs would still be struggling to find their feet in terms of fitness – mental and physical. That is, by the time the CAF competitions are afoot, Nigerian club sides are yet to hit top gear. That makes them become easy prey and more vulnerable to defeats that culminate in early exits.\nIf you are wondering why we keep losing our best legs to clubs, both in the mainstream and backwater of European football, there you have it. The league is not run in a way that attracts serious sponsorship that guarantees enough revenue for adequate remuneration of the players, hence the (leg) brain drain. It is heartbreaking to note that countries like Zambia, Tanzania, and Sudan as well as South Africa, Egypt, Tunisia, Algeria, Libya, etc., now attract the best of the best from our so-called premier league leaving our clubs weaker than expected.\nThis has been reoccurring but nobody seems bothered, let alone, be ready to do something about it. We need to get a bit more serious, than we currently are, about how the league is run. It must be noted that no nation has ever won the FIFA World Cup, and other major international honours, without a very vibrant domestic league. I wonder how those in charge of our football administration think our own case will be different! I found it disgusting and uncharitable when someone, some time ago, gave the full meaning of (NFF), as “Nonentities Feeding on Football”. But now, I am beginning to have a rethink. People who have nothing to offer must recuse themselves from the space and allow those who are more serious-minded, with the requisite expertise, and the genuine interest of the nation at heart to administer our beautiful game and put a stop to the current situation of “motion without movement”.\nOne of the most recent and eloquent testimony to how badly the league is being managed was when former Super Eagles captain, Austin Jay Jay Okocha, recently criticised the Nigeria Premier Football League (NPFL) for its management during an event in Kenya. Come to think of it, being a global icon, the former PSG mercurial midfielder is in Category A of people who you’d expect to take up an ambassadorial role in promoting the brand that the domestic league represents. But here he is, baring his mind (in regret) on the shambolic manner in which the beautiful game is being administered in the land, and how he prefers watching European football, to watching the Nigerian league. You can’t get it any worse. Things are that bad! We, therefore, just need to be more serious.\nAdvertisement\nAbubakar writes from Ilorin, Kwara state. He can be reached via 08051388285 or [email protected]\nAdvertisement\nViews expressed by contributors are strictly personal and not of TheCable.",
  "word_count": 2031,
  "scraped_at": "2026-02-14T01:56:32.781008",
  "_text_extracted": true
}