{
  "article_id": "55fc8d923da5",
  "url": "https://www.westmeathindependent.ie/2025/01/31/ollie-watkins-wants-to-stay-at-aston-villa-unai-emery/",
  "title": "Ollie Watkins wants to stay at Aston Villa – Unai Emery",
  "date": "20250131T201500Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ollie Watkins wants to stay at Aston Villa – Unai Emery\nBy Jonathan Veal, PA\nAston Villa boss Unai Emery says Ollie Watkins wants to stay at the club after Arsenal made a bid for the striker.\nWatkins was the subject of a rejected offer from the Gunners earlier this week, reported to be £60 million (€71,707,000).\nThe striker reacted by scoring in Wednesday’s Champions League win over Celtic, tellingly tapping the badge in celebration.\nWhile fellow striker Jhon Duran is set to join Saudi Arabian club Al Nassr later on Friday in a deal worth up to £71million, Emery says Watkins will be staying at Villa Park.\n“Yes, he is happy to stay,” the Spaniard said. “You can ask him, but we asked him how he is feeling every day, every year he has been here with Aston Villa, with us and without us.\n“We talked with him and he is very focused on the message we have.\n“The commitment of Ollie Watkins with us is a huge commitment, he appreciates a lot how Aston Villa was always supporting him, helping him and when we joined him here two years ago, how we worked with him, always trying to get the best of him.\n“Now we need him, like he needed Aston Villa. The conversation we are having usually, I am speaking with him a lot, he is always adapting of every circumstance we have in the squad and individually with him.\n“When there are some teams calling us being interested in the players of course it is very good for us and very good for the players.\n“Some players prefer to leave and some players accept to stay here, to be here and commit with us here and to be with our challenge. One of those is Ollie Watkins.”\nWith Duran set to head out before Friday night’s transfer deadline in Saudi Arabia, Villa are looking for attacking recruitments.\nThey are interested in Chelsea’s Joao Felix and Paris St Germain’s Marco Asensio, but can only bring in players if it is financially viable.\nPresident of football operations Monchi revealed in an interview with Spanish radio that Emery has always been a big fan of Portugal forward Felix.\n“There are names, one of them being Joao,” he told El Larguero. Emery likes him, because in the three transfer markets I have been in, the fourth with this one, he has always been mentioned and has been a small object of desire for Emery.\n“But it is complicated and I don’t know if we will be able to be there.\n“He is a player with a lot of quality and Emery has been able to recover players who were considered lost in his history as a coach and he trusts in Joao’s talent.\n“The first time, Aston Villa were in the Conference and he wanted the Champions League, that’s why he went to Barcelona.\n“Then, in the operation with Gallagher and Atletico he had to enter into negotiations with Chelsea and we couldn’t get in.”\nVilla are in action at Wolves on Saturday and have injury problems.\nMatty Cash (calf), Tyrone Mings (knee), Ross Barkley (calf) and Pau Torres (metatarsal) are all out.",
  "word_count": 533,
  "scraped_at": "2026-02-14T02:02:19.842685",
  "_text_extracted": true
}