{
  "article_id": "55fe30d23592",
  "url": "https://metro.co.uk/2024/03/20/euro-2024-stadiums-guide-ten-venues-host-cities-germany-20497273/",
  "title": "Euro 2024 stadiums : Guide to the ten venues and host cities in Germany | Football",
  "date": "20240320T134500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024 finally kicks-off on Friday, with the 51 games across the four weeks to be staged across ten stadiums in Germany.\nThe opening game of the tournament will see the hosts take on Scotland, with Steve Clarke’s men facing a daunting opening night at the Allianz Arena in Munich.\nEngland, meanwhile, will kickstart their Euro 2024 campaign against Serbia on Sunday night at the Veltins-Arena in Gelsenkirchen, with the Three Lions hoping that is the first of seven games en route to the final in Berlin.\nGermany is no stranger to hosting major international football tournaments, most recently having staged the 2006 World Cup, with nine of the ten stadiums in use 18 years ago set to see action once again.\nHere is your full guide to the venues which will host games at the Euros.\nOlympiastadion – Berlin\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nCapacity: 71,000\nHome team: Hertha Berlin\nFixtures:\n- Spain vs Croatia (June 15)\n- Poland vs Austria (June 21)\n- Netherlands vs Austria (June 25)\n- Round of 16 (June 29)\n- Quarter-final (July 6)\n- Final (July 14)\nThe Olympiastadion is the largest venue in use at Euro 2024, and will stage the final on July 14.\nOriginally built for the 1936 Olympics, the ground played host to the 2006 World Cup final between Italy and France and the 2015 Champions League final between Barcelona and Juventus.\nRheinEnergieStadion – Cologne\nCapacity: 43,000\nHome team: Cologne\nFixtures:\n- Hungary vs Switzerland (June 15)\n- Scotland vs Switzerland (June 19)\n- Belgium vs Romania (June 22)\n- England vs Slovenia (June 25)\n- Round of 16 (June 30)\nA stadium has existed on this spot since 1923, but the current iteration was constructed ahead of the 2006 World Cup.\nThe ground, which hosted England’s group stage draw with Sweden in that tournament, is the venue for several annual American football and ice hockey matches.\nSignal Iduna Park – Dortmund\nCapacity: 62,000\nHome team: Borussia Dortmund\nFixtures:\n- Italy vs Albania (June 15)\n- Turkey vs Georgia (June 18)\n- Turkey vs Portugal (June 22)\n- France vs Poland (June 25)\n- Round of 16 (June 29)\n- Semi-final (July 10)\nDortmund’s home is famed for its incredible atmosphere, featuring the iconic ‘Yellow Wall’ which houses 25,000 spectators behind one of the goals.\nSignal Iduna Park, which was built for the 1974 World Cup, was the backdrop for Italy’s semi-final extra-time win over Germany in the 2006 World Cup.\nMerkur Spiel-arena – Dusseldorf\nCapacity: 47,000\nHome team: Fortuna Dusseldorf\nFixtures:\n- Austria vs France (June 17)\n- Slovakia vs Ukraine (June 21)\n- Albania vs Spain (June 24)\n- Round of 16 (July 1)\n- Quarter-final (July 6)\nFortuna Dusseldorf, who currently reside in the second tier of German football, moved into the stadium situated on the river Rhine in 2004 – complete with a retractable roof.\nEuro 2024 will mark the first time that the stadium is used at a major tournament, although it is no stranger to international events having hosted Eurovision in 2011 as well as the likes of the Rolling Stones, Madonna and Beyonce.\nDeutsche Bank Park – Frankfurt\nCapacity: 47,000\nHome team: Eintracht Frankfurt\nFixtures:\n- Belgium vs Slovakia (June 17)\n- Denmark vs England (June 20)\n- Switzerland vs Germany (June 23)\n- Slovakia vs Romania (June 26)\n- Round of 16 (July 1)\nThe stadium, which is approaching its 100th anniversary, is built on a former military shooting range.\nIt hosted its first NFL games in 2023, whilst Muhammad Ali claimed the World Heavyweight title against Karl Mildenberger there back in 1966.\nVeltins-Arena – Gelsenkirchen\nCapacity: 50,000\nHome team: Schalke\nFixtures:\n- Serbia vs England (June 16)\n- Spain vs Italy (June 20)\n- Georgia vs Portugal (June 26)\n- Round of 16 (June 30)\nVeltins-Arena opened in 2001, featuring a retractable pitch which allows for the grass to be grown in more natural conditions.\nThe stadium played host to England’s agonising World Cup 2006 quarter-final defeat to Portugal on penalties, which saw Wayne Rooney sent off for a stamp on Ricardo Carvalho – sparking one of the most famous winks in football history from a certain Cristiano Ronaldo.\nVolksparkstadion – Hamburg\nCapacity: 49,000\nHome team: Hamburg SV\nFixtures:\n- Poland vs Netherlands (June 16)\n- Croatia vs Albania (June 19)\n- Georgia vs Czech Republic (June 22)\n- Czech Republic vs Turkey (June 26)\n- Quarter-final (July 5)\nHamburg’s stadium was opened at the turn of the millennium and was built from materials that were recovered from a region of the city which was bombed during the Second World War.\nThe stadium, which has hosted Ukrainian side Shakhtar Donetsk’s Champions League fixtures this season, used to feature a clock in one corner to commemorate the fact Hamburg had never been relegated from the Bundesliga, although it had to come down when the club slipped into the second tier in 2018.\nRed Bull Arena – Leipzig\nCapacity: 40,000\nHome team: RB Leipzig\nFixtures:\n- Portugal vs Czech Republic (June 18)\n- Netherlands vs France (June 21)\n- Croatia vs Italy (June 24)\n- Round of 16 (July 2)\nHaving opened in 2004, the Red Bull Arena is the biggest stadium in former East Germany and has been home to RB Leipzig since 2010.\nAn angry Zinedine Zidane kicked a dressing room door after France’s 1-1 draw with South Korea at the 2006 World Cup, with the dent subsequently signposted with a golden frame by the club for everyone to see.\nEuro 2024\nAllianz Arena – Munich\nCapacity: 66,000\nHome team: Bayern Munich\nFixtures:\n- Germany vs Scotland (June 14)\n- Romania vs Ukraine (June 17)\n- Slovenia vs Serbia (June 20)\n- Denmark vs Serbia (June 25)\n- Round of 16 (July 2)\n- Semi-final (July 9)\nBayern’s home opened in 2005, becoming the first stadium in the world to have an outer shell which can completely change colour.\nThe Allianz Arena will be the venue for the opening game of the tournament between Germany and Scotland, making it the first ever stadium to host a match in back-to-back European Championships having staged fixtures at Euro 2020.\nMHPArena – Stuttgart\nCapacity: 51,000\nMore Trending\nHome team: Stuttgart\nFixtures:\n- Slovenia vs Denmark (June 16)\n- Germany vs Hungary (June 19)\n- Scotland vs Hungary (June 23)\n- Ukraine vs Belgium (June 26)\n- Quarter-final (July 5)\nBuilt in 1933, Stuttgart’s charming home has staged two European finals in its history, in 1959 and 1988, as well as the 1993 World Athletics Championships.\nRedevelopment of the venue in 2009 saw 18 undetonated World War II bombs found beneath the stadium, three years after it was the scene of England’s World Cup Round of 16 win over Ecuador.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Who is Declan Rice’s girlfriend and childhood sweetheart Lauren Fryer?\nMORE: Micah Richards rates Scotland’s Euro 2024 chances ahead of Germany opener\nMORE: Serbia star highlights England ‘flaw’ his side will target in Euro 2024 opener",
  "word_count": 1233,
  "scraped_at": "2026-02-14T02:10:47.911444",
  "_text_extracted": true
}