{
  "article_id": "5612f1666132",
  "url": "https://www.teamtalk.com/manchester-united/next-man-utd-signing-completed-next-week-fabrizio-romano-confirms-new-bid-coming-mason-mount-chelsea",
  "title": "Next Man Utd signing  has to be completed by the end of next week  as Fabrizio Romano confirms new bid coming",
  "date": "20230623T003000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nNext Man Utd signing ‘has to be completed by the end of next week’ as Fabrizio Romano confirms new bid coming\nIf Mason Mount hasn’t become a Man Utd player within the next 10 days, then it appears he won’t be at all this summer – judging by Fabrizio Romano’s latest update.\nMount has become a top target for Man Utd as they aim to add a new dimension to their midfield. He has become a gettable target after deciding not to extend his contract at Chelsea. With only one year remaining on that deal, his current employers have come to terms with selling him.\nThey still want to get the right price for their academy graduate, which is why they rejected an initial £50m bid by Man Utd. But confidence is growing from his potential buyers.\nMount has made it clear internally that Man Utd are the club he wants to join this summer, despite also being linked with Liverpool and Arsenal.\nAnd reports earlier on Thursday suggested a compromise was close for Man Utd to buy him for a £60m transfer fee.\nIn the latest update from Fabrizio Romano, it has been confirmed that Man Utd ‘will bid again’ – though it is reiterated they do not want the situation to drag out.\nIndeed, Romano began his update by stating that “sources feel [the] Mason Mount deal has to be completed by the end of next week.”\nTherefore, there is a 10-day window – at a maximum – for Man Utd to get the signing over the line.\nIt would seem to tie in with Chelsea’s need to sell players before the end of the month. That way, the Blues could balance their books for the 2022-23 season.\nTodd Boehly oversaw spending sprees in the summer of 2022 and January 2023 after becoming Chelsea’s new owner. But to avoid extreme scrutiny regarding Financial Fair Play, they need to raise funds while they still can.\nA number of their players are being offloaded to clubs in Saudi Arabia. Closer to home, they have agreed to sell Mateo Kovacic to Manchester City and Kai Havertz to Arsenal.\nMount greenlights Man Utd move\nMount might also be able to make a domestic exit in the coming days. Romano reminds that he has already ‘agreed’ personal terms with Man Utd.\nIt will count for nothing, though, if Chelsea do not give the green light to his exit. It will take a bid between £60m and £65m to ‘convince’ them, according to Romano.\nThere seems to be optimism that the two clubs will meet in the middle, but a final push will soon be required by his suitors.\nBy leaving Chelsea for Man Utd, Mount would get to play in next season’s Champions League, in contrast to having no European football on offer at Stamford Bridge.\nHaving come through the ranks at Chelsea, though, his eventual departure will be an emotional moment – especially knowing he could come back to haunt the Blues in the future.\nYet Chelsea don’t have much choice at the moment and may have to make the sacrifice imminently.\nREAD MORE – Man Utd prepare luxurious offer for UCL midfield dynamo to follow Mount in stunning double upgrade",
  "word_count": 545,
  "scraped_at": "2026-02-14T01:56:02.429799",
  "_text_extracted": true
}