{
  "article_id": "561be50a1d85",
  "url": "https://www.westmeathindependent.ie/2025/08/27/live-updates-athlone-town-face-briedablik-of-iceland-in-champions-league/",
  "title": "LIVE UPDATES : Athlone Town face Briedablik of Iceland in Champions League",
  "date": "20250827T140000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Briedablik of Iceland defeat Athlone Town in Champions League\nATHLONE TOWN 1 BREIDABLIK 3: This was our live blog on today's Champions League second qualifying round fixture which ended in defeat for Athlone against the champions of Iceland.\nFull-time: Disappointment for Athlone, who were hugely competitive throughout against high-quality opposition. Madison Gibson levelled things up after Athlone went behind early in the second half, but two clinical finishes in two minutes swung the tie decisively in favour of the team from Kópavogur in Iceland.\nThis isn't the end of Athlone's European involvement, however. This Saturday, August 30, at 12 noon in the Netherlands they will face the loser of this evening's tie between FC Twente and Crvena Zvezda (Red Star Belgrade). The winner of that third-place playoff on Saturday will then have a chance to progress to the new Women's Europa Cup.\nThanks for following our live updates today and see the Westmeath Independent, in print and online, for more coverage and reaction.\n90 mins + 3: Athlone are continuing to press forward in search of a goal which unfortunately looks as though it would just be a consolation at this stage.\n90 mins: Six minutes of injury time have been added.\n86 mins: Double substitution for Athlone Town as Hazel Donegan comes on for Alexis Strickland and Shauna Brennan replaces Sarah Rice.\n83 mins: Chance! Athlone come desperately close to pulling one back, courtesy of Sligo native Roisin Molloy. Gibson played the ball in to Molloy who took it on the turn, from the edge of the box, and fired a shot that went just past the upright.\n82 mins: Those two goals in quick succession have taken the wind out of Athlone's sails. Breidablik have just made their second substitution, taking off Samantha Smith, the scorer of their first two goals.\n77 mins: GOAL - And, just like that, Breidablik have taken control of this tie. Thorvaldsdóttir produced an unstoppable effort from outside the box to put her side 3-1 in front.\nIt's a real uphill battle for Athlone now.\n75 mins: GOAL - Breidablik are back in front. Athlone lost possession in midfield and Samantha Smith clinically converted an excellent cross that came in from the right flank. It's Smith's second goal of the game for the Icelandic side.\n70 mins: After some nice build-up play from Athlone, Strickland attempts to chip the 'keeper but her effort is wayward.\n68 mins: A fast counter attack from Breidablik is well-defended by Athlone. The goal has clearly give the Town a lift - there's a bit more zip to their play since it went in.\n66 mins: First substitution for Athlone Town, as captain Izzy Groves, who hasn't been at her best today, is replaced by Kate Slevin.\n65 mins: Some frantic exchanges at both ends since the Athlone equaliser. If it remains level after 90 minutes we'll be heading for extra time and possibly penalties, but there's a lot of football to be played before then.\n58 mins: GOAL for Athlone! It's 1-1! Madison Gibson, who has had a quiet game so far, scores direct from a corner kick, just as she did twice in the previous Champions League game against Croatian side Agram in Athlone.\nThe stadium announcer credited Izzy Groves with getting a touch - but to me it looked as though Gibson's corner went in directly. Game on!\nHere's the goal:\n57 mins: Athlone's conditioning will really be tested here, as this game is coming after a big league clash against Shelbourne last Saturday evening. They now have a little over half an hour to try to overturn the one-goal deficit.\n55 mins: A late challenge by gifted Athlone midfielder Hannah Waesch results in her being shown a yellow card.\n48 mins: Conceding right after the half-time interval is a huge blow for Athlone. Rosin Molloy attempted to produce an immediate response but her shot flew wide.\n47 mins: GOAL - Breidablik take the lead. Athlone goalie Megan Plaschko produced some fine saves in the first half but she made an error here. A Breidablik corner was claimed but then dropped by the Town 'keeper, with Samantha Smith on hand to tap home from inside the six yard box.\n46 mins: The winners this afternoon will, on Saturday, face the winners of a game taking place at 6pm today between FC Twente and Red Star Belgrade.\n45 mins: The second half is underway.\nHalf-time: The half-time whistle goes and it remains scoreless in Enschede after a keenly-contested opening 45 minutes in which both sides had some decent chances to break the deadlock.\nA big second half to come - stay with us for updates.\n42 mins: Breidablik almost score direct from a corner kick with Megan Plaschko just getting her fingertips to it to keep it out. This is followed by another corner for the Icelandic side which is headed over the bar.\nAfter a positive start for Athlone, Breidablik have gotten on top and Colin Fortune would probably welcome the half-time whistle now to get his players in and give them a chance to regroup.\n39 mins: Briedablik come close with a powerful long-distance strike from Bjarnadóttir, which is well-held by Plaschko in the Athlone goal.\n37 mins: At the other end, a corner for Briedablik is headed just over. At the risk of stating the obvious, the first goal will be of huge significance in determining the outcome of this game.\n35 mins: Two corners in a row for Athlone, but neither came to anything despite good deliveries from Madison Gibson.\n31 mins: A few chants of \"The Athlone\" can be heard from visiting supporters in the Netherlands...\n29 mins: Breidablik have been getting on top in the last few minutes and threatened just now as Sam Smith sent a cross into the box which was blasted over the bar by Thorvaldsdóttir. That was the Icelandic side's best chance so far.\n25 mins: Breidablik were strong favourites heading into this game, but so far Athlone have acquitted themselves very well and are unfortunate not to be in front. The Icelandic side has been moving the ball well at times, but Athlone had the more clear-cut chances in the game's opening quarter.\n21 mins: A chance for Briedablik as the Icelandic champions' captain Heiða Ragney Viðarsdóttir twists and turns in the box before delivering a low shot that was well-saved by Athlone netminder Megan Plaschko.\n18 mins: Another good chance for Athlone, as captain Izzy Groves heads wide from a superbly-delivered Madison Gibson corner kick. Breidablik look threatening on the counter attack, so hopefully Athlone won't rue these missed opportunities.\n15 mins: Off the post! Athlone couldn't have come closer to opening the scoring just now, as Kelly Brady produced a terrific left-footed shot from outside the box which bounced off the inside of the post. So unlucky.\n9 mins: Chance! Athlone produce the best move of the game so far, with Madison Gibson whipping in a dangerous cross for Roisin Molly who was waiting at the edge of the six-yard box. The ball bounced awkwardly, however, and an Icelandic defender got a touch to help avert the danger.\nIt's been a lively and quite evenly-matched affair so far.\n4 mins: We've had a fast start here, with Breidablik attacking from the kick-off and forcing a corner in the opening seconds. Athlone countered well, with Roisin Molloy threatening on the right wing before the attack ultimately petered out.\n12pm: And the game is underway....\n11.58am: The teams are out on the pitch, with Athlone wearing white shirts and blue shorts, and Breidablik in green.\n11.57am: The astro turf pitch at Sportpark Schreurserve Enschede should pose no issue for Athlone given that their home games in Lissywollen are played on a similar surface. The weather in Enschede is 23 degrees Celsius. It was cloudy earlier but the sun is breaking through as kick-off approaches.\n11.56am: Chloe Singleton of Athlone Town arriving for the game earlier:\n11.55am: Athlone's subs bench is as follows: Matthlaou, S. Brennan, Singleton, Browne, Ryan, Mooney, Slevin, Murphy-O'Connor, Donegan, C. O'Neill, Fitzgerald, D. O'Neill.\n11.50am: Athlone booked this trip to the continent by defeating Cardiff City 4-0 at home and following it up with a comprehensive 3-0 defeat of Croatian champions ZNK Agram.\nBreidablik, who top the Icelandic league, are expected to be a much tougher proposition and Athlone are going into this game as underdogs.\n11.45am: A selfie from Athlone Town coach, and Athlone native, Gordon Brett ahead of the big game:\n11.35am: Team news: Athlone Town boss Colin Fortune has named a side that's unchanged from the big 2-1 win at home against Shelbourne in the league last Saturday.\nAthlone's starting line-up is as follows: Megan Plaschko, Sarah Rice, Kayleigh Shine, Natalie McNally, Kellie Brennan, Hannah Waesch, Izzy Groves (captain), Alexis Strickland, Madison Gibson, Kelly Brady, Roisin Molloy.\n11.30am: Adrian Cusack. I'll be bringing you updates over the next couple of hours on a historic occasion for the Athlone Town women's team as they play their third Champions League qualifying game - and the first one away from home - against Icelandic champions Breidablik.\nThe match is being played in the Dutch city of Enschede, close to the border with Germany. Enschede is the home of FC Twente, who face Crvena Zvezda (Red Star Belgrade) in the other semi final of a four-team mini-tournament at this, the second qualifying round stage of Europe's most prestigious club football competition.\nKick-off is at 12 noon Irish time, so continue to refresh this page for updates as they happen.",
  "word_count": 1596,
  "scraped_at": "2026-02-14T02:09:18.614783",
  "_text_extracted": true
}