{
  "article_id": "56211e6598ec",
  "url": "https://cartilagefreecaptain.sbnation.com/2023/3/25/23654024/daniel-levys-imaginary-managerial-shortlist-julian-nagelsmann",
  "title": "Daniel Levy Imaginary ( Managerial ) Shortlist : Julian Nagelsmann",
  "date": "20230325T121500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "To: daniel.levy@tottenhamhotspur.com\nFrom: cartilagefree@gmail.com\nSubject: Let us help you! (Manager search)\nDaniel Levy’s Imaginary (Managerial) Shortlist: Julian Nagelsmann\nDAN! DAN! DANIEL! DANNY! DAN! DAN!\nDAN!\nDAN! WAKE UP DAN! DID YOU SEE THIS? ARE YOU WATCHING?\nARE YOU ON TOP OF THIS, DAN? WHY AREN’T YOU ON TOP OF THIS? THIS IS PERFECT, DAN. YOU WANTED HIM LAST TIME TOO! GET ON THE PHONE! BETTER YET BORROW FABIO’S PHONE, HE WON’T BE NEEDING IT IN A BIT.\nDAN! DAAAAAAAAAAAAAAN!!\nYours etc.,\nDustin George-Miller\nCartilage Free Captain\nThe Basics\nName: Julian Nagelsmann\nAge: 35\nTeam: Unemployed (last: Bayern Munich)\nNationality: German\nCumulative ELO rating: 1883\nThe Specifics\nTrophies:\nBundesliga (Bayern Munich, 2021-22); German Super Cup (Bayern Munich, 2021-22, 2022-23); U19 Bundesliga (Hoffenheim, 2013-14 yes it totally counts shut up)\nWhen Julian Nagelsmann was named head coach at Hoffenheim in 2016 at the age of 28, he entered the record books as the youngest permanent head coach in the history of the Bundesliga. That appointment started a meteoric rise for the German coaching prodigy, who swiftly moved up to RB Leipzig and by the age of 33 was in charge of German giants Bayern Munich. Well, until Friday. Now he’s out of a job, the first sacking of his career, but that doesn’t really change his status as one of the brightest and most dynamic coaches in all of football.\nNagelsmann was a promising young central defender with no senior appearances but stints in the youth teams of Hoffenheim and FC Augsburg; he was considered a future star until knee injury forced him to hang up his boots at the age of 20. He swiftly moved into coaching, starting off as a scout at FC Augsburg (under Thomas Tuchel, no less), then the youth ranks at Hoffenheim where he swiftly moved up the ranks and became head coach in 2016 at a time when Hoffenheim were flirting with regulation. He not only kept them up, but Hoffenheim finished fourth the following season. Nagelsmann turned his Hoffenheim experience into a successful stint at RB Leipzig. While Leipzig were an established team prior to his arrival, under Nagelsmann Die Roten Bullen finished third and second in the Bundesliga, but well behind Bayern whom he joined in 2021.\nTactics:\nNagelsmann once famously said that coaching is “70% social competence, 30% tactics.” That’s a pretty good way of describing his approach to the game. Nagelsmann, as you might expect, is a gegenpressing manager whose teams tend to emphasize possession and ball control.\nIn all three of his former positions, Nagelsmann liked to set up his Bayern teams in a 4-2-2-2 (late a 4-2-3-1), but at Hoffenheim and Leipzig would frequently use a 3-1-4-2. Nagelsmann’s teams typically use two central midfielders — one who stays deeper as a deep-lying playmaker to screen the defense and break up play (at Bayern, this was Kimmich), one as a box-to-box runner (Goretzka). In addition, a more advanced midfielder at the 10 (Muller) will often drop deeper into midfield to support and facilitate ball progression if needed. Nagelsmann does like to have his fullbacks/wingbacks move forward into attack, though in a back four usually only one moves up with the other sliding into the back line to help defend in the event of a counter. Up front, the wide midfielders can either stay wide and overlap with the fullbacks, or cut inside to pull defenses apart.\nNagelsmann’s sides tend play out of the back, progressing centrally through the DM whenever possible, and using the box-to-box mid to spray passes forward to the attackers or out wide to the FBs. They also press from the front, to force mistakes or push the ball wide, and the attackers are especially expected to press situationally. The idea is to create overloads in attacking spaces and facilitate space between the lines and runs into the box.\nAt Bayern, there was so much individual talent that the tactics were somewhat mooted; it was less about the opposition not knowing what the players were going to do and more about opponents not being able to stop it from happening. But really, the formations don’t especially matter. On his (slightly) less talented sides, Nagelsmann emphasized tactical flexibility — the players were all drilled to understand the system and how it was supposed to work, but weren’t assigned to strict or prescribed roles. Especially at Hoffenheim, Nagelsmann was able to take underperforming players and shift them to slightly different positions or responsibilities to maximize their qualities.\nIt’s often very attractive style of football, offensive and free-flowing, but requiring solid defense to stop counters when they happen. But if needed, Nagelsmann can shift into something more defensive and soak up pressure if he feels the situation warrants it, or into a low block and counter if opponents are committing numbers forward and leaving space behind. Predicting Nagelsmann’s lineups at Spurs would likely be much more difficult than it is under Conte. The only real question is whether he can replicate his Bundesliga successes in the meat grinder that is the Premier League.\nStrengths\nThose who know Nagelsmann speak often about his intelligence. Nagelsmann is a self-described “tactics buff” who embraces technology in order to get an edge over his opponents. He’s been described as a fastidious worker with an encyclopedic knowledge of the game for someone so new to coaching. He’s been compared — sometimes favorably! — to Pep Guardiola in his ability to set up a team and manage game states in matches. But above all, he’s a teacher — Nagelsmann is excellent at explaining tactics and concepts to his players. More than that, he improves players, looking for skill sets in players that he can use in various positions and then maximizing their potential.\nAs to whether he’s a project coach? Well, he certainly successfully built the Hoffenheim project in his first position as head coach. His subsequent jobs didn’t require as much tinkering or overhauling, but he’s certainly shown an ability to examine a team and find ways to maximize their potential.\nNagelsmann is also highly adaptable. While he has his preferred formations, his system of play is less important than making sure he has his players filling certain roles within the squad. He is known for making tactical changes when needed, and is not afraid to make substitutions at times he feels is appropriate and when the situation requires it.\nWeaknesses\nHere’s the part where we get into something a lot more murky, especially in the immediate wake of Nagelsmann’s sacking from Bayern. For all his positive qualities — and there are many — you won’t have to look too far online to find people willing to criticize his methods, personality, and results. Nagelsmann is described as “brutally ambitious,” but also somewhat fragile — he reportedly does not take criticism well and has struggled in his interactions with the press, something that did not serve him well at Bayern.\nAnd in fact it’s at Bayern where the bulk of Nagelsmann’s critics come from. There were reports of player dissatisfaction with his methods — a recent report in The Athletic discussed Bayern player complaints about “overcomplicating training,” “making too many changes in matches,” and micromangement, though with the egos and age profiles of Bayern’s stars and the Bayern brass’ insistence on playing “the Bayern Way” I tend to be somewhat skeptical of these claims, and there aren’t nearly as many complaints from earlier in his career. There were also some suggestions that his meteoric rise to the top echelon of coaching came too quickly, as though he didn’t “pay his dues.” He’s a young manager, and some of that immaturity has shown through at times. Maybe these are partly why he’s no longer at Bayern, replaced by Tuchel, his former boss at Augsburg.\nBut I have rarely heard of Nagelsmann belittling players, flying off the handle, or letting teams collapse. The reasons for his sacking at Bayern had more to do with a substandard performance in a 2-1 loss to Bayer Leverkusen and Bayern officials frowning at Nagelsmann taking a family ski vacation during the international break. Bayern are currently (clutches pearls) second in the Bundesliga behind Dortmund, but have only lost three matches all season, lead the league in goals, xG, and GD by comfortable margins, and are in the Champions League quarterfinals. I’m honestly not sure whether Nagelsmann’s sacking has more to do with Julian Nagelsmann, or with Bayern Munich just wanting something that Nagelsmann wasn’t able to provide. Sometimes, managers are fired for just being a bad fit, not because they’re bad managers.\nThe Verdict\nLikeliness of being hired\nThis is the big question, isn’t it? Daniel Levy reportedly tried to hire Nagelsmann from Leipzig two years ago after sacking Jose Mourinho and there was reportedly some interest (some recent reporting has Nagelsmann desirous to manage in England, and with a “soft spot” for Tottneham) before Bayern came calling. Spurs are also now “wanting to speak” with him about the position, despite not having fired their current head coach. This would be a situation where Spurs might need to move quickly — Real Madrid has for some reason been covetous of Nagelsmann for a few years now, and there are even thoughts Chelsea might consider snap-firing Graham Potter to land Nagelsmann first. So he will have options, assuming he even wants to come now instead of this summer or a longer period of time off. But if Daniel Levy can move fast, there’s a greater-than-Lloyd-Christmas chance of it happening.\nGrade if Hired: A+\nAlmost everything I’ve read about Julian Nagelsmann, his ability, and his tactics has endeared me to him. Nothing I’ve read about him, lately or otherwise, has given me anything more than slight pause. Is he a win-now manager? He might be, but he should also be given the time to turn this currently-constructed side into something better. Nagelsmann is without question the newest and biggest whale in a offseason managerial pool that currently includes an unemployed Mauricio Pochettino and Luis Enrique, and any club that lands him is going to enjoy the hell out of him. Why shouldn’t it be us?",
  "word_count": 1690,
  "scraped_at": "2026-02-14T01:53:35.634032",
  "_text_extracted": true
}