{
  "article_id": "56439e4acc68",
  "url": "https://www.france24.com/en/live-news/20230131-new-competitions-open-international-doors-to-mls-clubs",
  "title": "New competitions open international doors to MLS clubs",
  "date": "20230201T004500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New competitions open international doors to MLS clubs\nMiami (AFP) – The days when football clubs from the United States and Canada were largely restricted to domestic competition, barely noticed by the rest of the world, are about to end.\nIssued on:\nWhen the Seattle Sounders take the field on Saturday in the Club World Cup, they will be 90 minutes away from a meeting, in official FIFA competition, with one of the greatest names in world football - Spanish giants Real Madrid.\nThe Sounders must beat the winners of the first round tie between Egypt's Al Ahly and New Zealand's Auckland City to make the clash with the 14-times European champions in Rabat, Morocco, a reality.\nNot surprisingly the prospect of facing Carlo Ancelotti's star-studded European champions, has captured the imagination in the Pacific North West city.\n\"The players are excited for this. They love the fact that they have an opportunity to be on a world stage,\" said Sounders head coach Brian Schmetzer.\nThe Sounders are in the competition as winners of the CONCACAF Champions League, until recently the only official international competition open to clubs from Major League Soccer.\nIt is the first time a U.S. or Canadian team has played in the FIFA tournament for continental champions.\nIt is perhaps fitting that the Sounders are the ones to make history -- next year they will celebrate the 50th anniversary making them the oldest American club in MLS having played in the now defunct North American Soccer League (NASL) and other leagues before MLS debuted in 1996.\nTwo new competitions\nMLS teams have been far from successful in regional competition, with the Sounders victory last season only the third time a club from the US or Canada has triumphed in the Mexican-dominated tournament.\nBut the volume of international fixtures for MLS clubs is about to significantly increase with the addition of two new competitions and changes to the Champions League.\nIn July, all MLS clubs will be involved in a new month-long 47-team, CONCACAF-sanctioned Leagues Cup, alongside teams from Mexico's Liga MX. The competition will be organised similar to a World Cup and feature a group stage before knockout fixtures.\nThe competition winners will go straight into the round of 16 of the newly-expanded, 27 team CONCACAF Champions League (CCL) with the runners-up and third-placed teams going into the first round.\nThe Champions League will also feature teams from the Caribbean, qualifying via a new Caribbean Cup and Central American clubs via their own sub-regional competition.\nThat tournament in turn, feeds into the Club World Cup where it is likely there will be more spaces available to CONCACAF clubs with FIFA's planned expansion from eight to 32 teams for the 2025 edition featuring clubs from Europe, Asia, Africa and the Americas.\nCONCACAF president Victor Montagliani has seen increased international competition as vital for the growth of the game in the region.\n\"This will elevate clubs and leagues from CONCACAF and provide even more compelling regional rivalries. It will also provide more international relevance to our club competitions, and a very competitive pathway as clubs strive to qualify for the FIFA Club World Cup and succeed on the global stage,\" he said after announcing the changes.\nIf all those games aren't enough chances for MLS teams to test themselves against international opponents, last week Montagliani announced another competition.\nCurrently under the working title of 'Final Four', the event will see two teams from CONCACAF take on two from the South American CONMEBOL region.\nWhile the exact details have yet to be worked out, it is likely that the two finalists from the CONCACAF Champions League will play either the finalists of the Copa Libertadores or the champions of that tournament and the winners of the secondary Copa Sudamericana.\nWhatever the final name or qualification route, it means a chance for American clubs to face off against the elite of South American football - if they can beat Mexican and other regional rivals first.\nThat tournament is slated to start in 2024 and people with knowledge of the discussions say it is possible that this year's CONCACAF Champions League and South American competitions could already be used for the first route to the potentially lucrative games.\nIt all means that, in 2025, a team which was succesful in the Leagues Cup, Champions League and qualified for the Club World Cup, could face as many as 22 official international games.\nFor clubs used to a domestic league with 34 regular season games before a short playoff campaign, it is a whole, new world.\n© 2023 AFP",
  "word_count": 766,
  "scraped_at": "2026-02-14T02:16:35.980632",
  "_text_extracted": true
}