{
  "article_id": "566cf0ce7b8b",
  "url": "https://www.caughtoffside.com/2024/06/17/jude-bellingham-emulates-liverpool-man-utd-greats-england-1-0-serbia/",
  "title": "Jude Bellingham emulates Liverpool and Man Utd greats in England 1 - 0 Serbia",
  "date": "20240617T100000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England’s 1-0 win over Serbia in their Euro 2024 opener on Sunday wasn’t pretty but if one man stood out from the crowd, it was Jude Bellingham.\nHeading to Germany off the back of a stunning debut campaign for Real Madrid in which he notched 23 goals and 13 assists across all competitions — winning La Liga, Champions League and Supercopa de Espana titles — Bellingham carries great expectations for the Three Lions at this tournament.\nBut despite being just 20 years old, Bellingham doesn’t look at all fazed by the pressure. In fact, he thrived in Gelsenkirchen on Sunday, opening the scoring and deciding the game after just 13 minutes with a powerful header to convert Bukayo Saka’s deflected cross.\nBellingham has truly adapted to the international stage. Though he only has four goals and five assists to his name in 30 caps, six of those direct goal involvements (3g/3a) have come in his last five outings.\nBut that wasn’t the only impressive stat Bellingham threw up on the night, with Opta revealing some stunning facts about the former Birmingham City youngster:\n- Bellingham (World Cup 2022 and Euro 2024) became just the second player ever to score at both the World Cup and European Championships before turning 21, joining compatriot and former Liverpool striker Michael Owen (1998 World Cup and Euro 2000).\n- Bellingham also became the first player to score for England at both the World Cup and European Championship while playing his club football outside of England.\n- With goals on Sunday and against Iran at the 2022 World Cup in Qatar, Bellingham is just the fifth player to score England’s opening goal at two different major tournaments after Bobby Charlton, Alan Shearer, Gary Lineker and Bryan Robson.\nBellingham earns widespread praise for Serbia performance\nNaturally, Bellingham’s standout performance against Serbia — which also saw him post a 96% pass completion rate and win nine of his 15 ground duels — saw him lavished with praise from those alongside him in the England camp.\n“He’s an unbelievable player,” said England captain Harry Kane, adding: “The confidence he plays with and the way he affects games – it’s important for players playing in his position to get goals and assists, and that’s what he does.”\nThree Lions boss Gareth Southgate said (via BBC Sport): “He seems to write his own scripts. He welcomes the attention and he keeps delivering.\n“He had some outstanding moments in the game and equally our two wide players and central midfielder players did well working around him.”\nEngland continue their Group C campaign against Denmark in Frankfurt on Thursday, while Serbia travel to Munich to take on Slovenia.",
  "word_count": 446,
  "scraped_at": "2026-02-14T01:51:32.429607",
  "_text_extracted": true
}