{
  "article_id": "56864dddf028",
  "url": "https://www.the42.ie/premier-league-transfer-news-3-6142420-Aug2023/",
  "title": "Chelsea loan Kepa to Real Madrid , while Ward - Prowse joins West Ham",
  "date": "20230814T120000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LAST UPDATE | 14 Aug 2023\nCHELSEA GOALKEEPER KEPA Arrizabalaga has completed a season-long loan move to Real Madrid.\nThe 28-year-old Spain international, who joined the Blues in a £71.6million switch from Athletic Bilbao in August 2018, is contracted at the Bernabeu until June next year.\nReal needed a new keeper after Thibaut Courtois was ruled out for the majority of the season with an ACL injury.\nA statement on Real’s official website said: “Real Madrid CF and Chelsea FC have agreed on the loan of the player Kepa Arrizabalaga, who is linked to the club this season, until June 30, 2024.\n“In his five seasons at Chelsea, he has won one Champions League, one Club World Cup, one European Super Cup and one Europa League.\n“This year, he has received the award for the best save in the Premier League for the 2022-2023 season.\n“Kepa is an international with the Spanish team, with which he has been proclaimed champion of the 2023 Nations League. With Spain, he also won the U19 European Championship in 2012.”\nKepa will be formally presented as a Real Madrid player on Tuesday afternoon.\nHis return to Spain follows the arrival of 25-year-old compatriot Robert Sanchez at Stamford Bridge.\nSanchez made a £25million switch from Brighton earlier this month and started Sunday’s 1-1 home draw with Liverpool as youngster Lucas Bergstrom provided the back-up on the bench.\nKepa has 163 Chelsea appearances under his belt and was handed the captaincy last season.\nHowever, he has become surplus to requirements under new boss Mauricio Pochettino and will now work for a season under former Chelsea head coach Carlo Ancelotti.\nA statement on the club’s official website said: “Chelsea goalkeeper Kepa Arrizabalaga has completed a season-long loan move to LaLiga side Real Madrid.\n“The club wish him well for the season ahead in Madrid, where he will work with former Chelsea head coach Carlo Ancelotti.”\nMeanwhile, West Ham have announced the signing of midfielder James Ward-Prowse from Southampton.\nThe 28-year-old made 410 appearances for Saints and was captain as they were relegated from the Premier League last season.\nHe has made a swift return to the top flight after joining the Hammers for an undisclosed fee – reported to be in the region of £30million – signing a four-year contract at the London Stadium.\nWard-Prowse told the club’s official website: “I’m buzzing to be here at West Ham United. It’s great to be here and I’m looking forward to getting going.\n“From the outside looking in, this is a club that has been on the rise for a number of years now and coming off the success in the UEFA Europa Conference League last year, you can feel there is real momentum around this club. It’s great to be a part of it and I can’t wait to play my role in the games to come.\n“When I think about my game, it is based on hard work, graft, and giving 100 per cent. West Ham United has always been a club that epitomises that. You can feel that from the fans and you can see it in the players who are here and the lads that have come through the academy too.\n“I feel as though I will fit straight in and I can promise I will give my all for this football club in my time here.”\nWard-Prowse spent two decades on the south coast having joined Southampton’s academy at the age of eight.\nDuring his time at St Mary’s, he earned 11 senior England caps and scored two goals for his country.“From the outside looking in, this is a club that has been on the rise for a number of years now and coming off the success in the UEFA Europa Conference League last year, you can feel there is real momentum around this club. It’s great to be a part of it and I can’t wait to play my role in the games to come.\nWard-Prowse scored 17 Premier League free-kicks for Southampton and needs just one more to draw level with the record, held by David Beckham.\nHe becomes West Ham’s second major signing of the summer following the recent acquisition of fellow midfielder Edson Alvarez from Ajax.\nManchester United defender Harry Maguire could be the next player in at West Ham as manager David Moyes looks to improve a team that finished 14th last season but went on to lift the Europa Conference League.\nThey opened their season with a 1-1 draw at Bournemouth on Saturday and lost former captain Declan Rice to Arsenal for £105million in July.\nAston Villa have also bolstered their options following a long-term injury to Emi Buendia, signing Leeds winger Jack Harrison on a season-long loan.\nHarrison returns to the Premier League following Leeds’ relegation to the Championship last season.\nThe 26-year-old becomes Everton’s fourth signing since the end of last season after spending the last five years at Leeds.\n“Jack Harrison passed his medical with the club yesterday before completing the necessary paperwork this morning,” Everton said in a statement.\n“He will now continue his rehabilitation from a minor hip injury before being available for Sean Dyche’s squad.”\nDyche had signed Arnaut Danjuma from Villarreal, Ashley Young from Aston Villa and Youssef Chermiti from Sporting Lisbon since his team narrowly avoided relegation last season.\nEverton opened the Premier League season with a disappointing 1-0 home defeat against Fulham on Saturday.\nHarrison, who joined Leeds from Manchester City, is the ninth player to leave the Elland Road club following their relegation.\nHe scored 34 goals in 206 appearances in all competitions for Leeds after making his debut in 2018.\nHarrison helped Leeds win promotion to the Premier League in 2020 and signed a new five-year deal in April before the club’s three-year stay in the top-flight ended in May.\n- With reporting from AFP",
  "word_count": 978,
  "scraped_at": "2026-02-14T02:00:36.671741",
  "_text_extracted": true
}