{
  "article_id": "56907a606a22",
  "url": "https://www.dailymail.co.uk/news/article-14591239/Prince-William-Aston-Villa-secret-meeting-Marcus-Rashford.html",
  "title": "How Prince William has become Aston Villa royal 12th man",
  "date": "20250410T104500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Revealed: Prince William and George's secret incognito life at Aston Villa\nPrince William's hugs for Prince George and Aston Villa's players in Paris last night again showed his passion for the team, which has clearly rubbed off on his eldest son.\nBut MailOnline can reveal that his love for the club goes much further and includes clandestine trips to the training ground for lunch with the players and to talk tactics with the manager Unai Emery.\nAfter big wins William has even been invited to the changing rooms to celebrate with his heroes where on occasion he has given a rousing speech.\nA club insider told MailOnline: 'His passion for Villa goes way beyond that of a normal fan. He is obsessed with football and his team. It is the same with England.'\nGeorge has also been to a number of games - including one at Villa Park with his father just after his mother was diagnosed with cancer last April - and is believed to have met his footballing heroes behind closed doors.\nThere have also been persistent chat online amongst fans about whether William could have influenced Marcus Rashford's decision to join from Manchester United.\nThe pair shared a big hug in the Parc des Princes before the crunch match with PSG with William heard saying he had 'missed him', revealing a genuine connection and camaraderie between the prince and the Manchester Unite loanee.\nThe heir to the throne personally awarded Rashford an MBE for his campaigning work to make sure school pupils in need received meals across the summer during the pandemic. William also spoke out against racist abuse Rashford suffered.\nMailOnline's source has claimed it is 'hard to believe' that William wouldn't have reached out to Rashford if it had helped get the deal over the line for his beloved football club in January.\nPrince William hugs Prince George very tightly during the Champions League match at Parc des Princes in Paris when Villa went one up\nGeorge was in the middle of a bear hug during the Champions League match when Rogers scored from close range\nPrince William hugs Marcus Rashford in the tunnel before the game where the royal said he'd missed him\nWilliam has been a regular at the club's training ground, discussing tactics with manager Unai Emery. He is also seen in the club canteen with star player Morgan Rogers\nFootballer Marcus Rashford is made an MBE by William in 2021\nWilliam is a regular at games - including with his son George, who he embraced tightly when Villa scored first last night.\nNext to them was the future king's childhood friend Thomas van Straubenzee - who previously described by Prince Harry as William's real best man at his 2011 wedding when his younger brother was given the job.\nBack home in Britain known to pop into the Villa training ground to chat to players and watch them play if passing through the West Midlands or going to games.\nA keen five-a-side footballer himself, he enjoys chatting about the team with Emery, who he has hailed as a tactical genius.\nThe future King has also been known to give rousing speeches to the dressing room after a big win, with the source adding: 'Prince William goes to a lot of the games and attends some training sessions'.\nThe insider also said it was 'inevitable' that William would have been in contact with Rashford before he signed for the club on loan from Manchester United in February, given their contact over the years and the royal's deep love for Villa.\nThe insider said that given they 'know each other already, it's even likelier' that William would have spoken to him about joining his beloved Villa.\nFamous fans getting involved in transfer deals was in the spotlight this season when it was revealed that Ed Sheeran called England's hottest young striker Liam Delap - dubbed the new Alan Shearer - before one of his gigs to convince him to join Ipswich Town.\nAn England source told MailOnline that there is 'no way' William would have been involved in the Rashford deal and would never interfere with the work of the club and agents.\n'He doesn't overstep - but would do whatever he could to help Villa', they added.\nThomas van Straubenzee (left) was also at the match in Paris last night. Prince Harry was William's best man in 2011 but Harry later admitted Thomas was the real best man\nThe Prince of Wales said bringing Prince George to Aston Villa's Champions League quarter-final in Paris was a 'big deal', as he spoke to pundits Ally McCoist and Rio Ferdinand last night\nThe Prince of Wales said he was 'pretty terrified' ahead of the quarter-final first-leg in France while standing alongside TNT Sports hosts Rio Ferdinand and Ally McCoist.\nWilliam also insisted he was on his 'best behaviour' when asked whether he was on a 'lads' tour', adding that Princess Charlotte and Prince Louis were probably watching at home.\nThe royal hugged some of Villa's players, including Marco Asensio and England international Marcus Rashford as they came out of the dressing room.\nHe called Tyrone Mings 'big man', said to Ross Barkley 'nice to see you again' and told Rashford: 'Marcus, nice to see you, I missed you earlier'\nWilliam also told Lamare Bogarde: 'New contract, very happy, so pleased, thoroughly deserved.'\nThe Prince, who was invited by PSG president Nasser Al-Khelaifi to the Parc des Princes, explained how the tie would help create 'special memories' with George.\nWilliam, who has been seen at various Villa matches throughout this season, also discussed his support of the team, their manager Unai Emery and his tactics.\nAnd fans were quick to praise the royal, with one tweeting: 'Prince William is a really good pundit, he is articulate, intelligent and really knowledgeable about football.'\nThe royals celebrated as Aston Villa took a first half lead through Morgan Rogers against PSG\nThomas van Straubenzee, Prince George and Prince William at the match in Paris last night\nAnother said: 'Never thought I'd hear Prince William talk so thoughtfully about football with knowledge of the game and tactics. Very cool! Get him in the studio.'\nA third said 'what a guy', and a fourth wrote: 'Absolutely amazing. Brilliant to listen to him, eloquent, knowledgeable but also passionate. God save the future King.'\nFormer Manchester United defender Ferdinand was also full of praise for 42-year-old William, joking: 'Do not go for a punditry job, please, because I could be out of the game. The way he just dissected that there, I'm going to nick that for later on.'\nWilliam later punched the air and hugged George, who was wearing a Villa scarf, as he celebrated Morgan Rogers giving the Premier League side a first-half lead.\nBut PSG fought back to win 3-1 with goals Desire Doue, Khvicha Kvaratskhelia and Nuno Mendes. The second-leg takes place at Villa Park next Tuesday.\nAsked on TNT Sports by Ferdinand whether he was on a 'lads' tour' in Paris, William responded: 'Well I've got my son here as well so I'm on best behaviour as well.\n'But I thought, you know what, it's been 43 years since anything like this has happened in my generation as a Villa fan and I want George to experience a night out away from home in a big European competition.\n'I hope it's not 43 years until the next time it happens but I think those memories are really important to create and bringing him along tonight is a big deal to me.'\nOn how he was feeling ahead of the match, William said: 'I'm pretty terrified. It's been a while coming, so it's a big game. 43 years since the last time this happened - a big European night for Villa so I'm nervous.\n'I'm confident but I'm also excited by the whole prospect. I'm wearing all my lucky clothes and have done all my routines, so I'm hoping it's going to bring some luck tonight.'\nDiscussing what he expected from PSG, he added: 'So I think we all saw the Liverpool game [Champions League round of 16 last month], and PSG's intensity. In the first leg, they were unbelievable.\n'They gave a lot of pressure, they pressed very high. And so I think for Unai tonight, and the team, it's about managing that press.'\nWilliam also spoke about PSG's new approach of targeting youngsters rather than superstars.\nHe said: 'I think not having [Kylian] Mbappe there, I think the PSG guys have talked about that quite a bit in the media around not having the superstars maybe makes it a bit more of a gel.\n'Vitinha in the midfield, I've been really impressed by, bearing in mind he was at Wolves two, three years ago, and he could hardly get a game and now look at him.'\nThe Prince also praised Emery, saying: 'First of all, I think I speak for most Villa fans saying we're so thrilled and really lucky to have a manager of Unai's quality.\n'As a person, he is an absolute gentleman, a lovely guy. He's an absolute tactician. I try, when I get the odd chance to talk to him, and take some nuggets of information from him but he's very guarded.\n'I went up and watched training once. What Unai was doing, he was moving players on the pitch about a centimetre left and right. I thought, 'That's a man who cares about the little details.''\nWilliam also praised Declan Rice for his two free-kicks against Real Madrid in Arsenal's 3-0 Champions League win on Tuesday.\nHe said: 'Unbelievable. I'm sure Declan will agree to this but I've never seen Declan take a free-kick like that in my life. But what a couple of amazing free-kicks.\n'I'm really excited for seeing Declan, what he can do for the England team. I think if he can do that now, he's going to be the England set-piece taker and that's really exciting.'\nThe Prince had predicted a 2-1 win for Villa, who ended up losing 3-1.\nWilliam was also in the crowd for Villa's victory over Bayern Munich earlier in the competition and away to Monaco in January.\nPrince William smiles during the Champions League quarter final first-leg match last night\nPrince William has his head in his hands later on in the match, which Villa ended up losing 3-1\nPSG fought back to win 3-1 with goals Desire Doue, Khvicha Kvaratskhelia and Nuno Mendes\nPrince William puts his hand on his face as Villa's lead crumbles at the Parc des Princes\nVilla have been playing at this level of European football for the first time since 1983, had enjoyed a serene run to the last eight but faced their toughest challenge yet against PSG.\nThey were dreaming of another famous night when Morgan Rogers put them ahead in the 35th minute but superb goals from Doue, Kvaratskhelia and Mendes turned it around for the French champions.\nVilla now have a mountain to climb to turn the tie around at Villa Park in the second-leg next Tuesday.\nThe Prince has previously explained how he came to support Aston Villa.\n'A long time ago at school, I got into football, big time,' William, who first visited Villa Park in November 2013, told the BBC in 2015.\n'I was looking around for a club to support, and all my friends at school were either Manchester United fans or Chelsea fans.\n'I didn't want to follow the run-of-the-mill teams, I wanted to have a team that was more mid-table, that could give me the more emotional rollercoaster moments.\n'To be honest, now, looking back, that was a bad idea - I could have had an easier time!\n'Aston Villa has always had a great history. I've got friends who support Aston Villa and one of the first FA Cup games I went to was Bolton versus Aston Villa, it was a semi-final.\n'It was fantastic, I sat with all the fans with my red beanie on, and I was sat with all the Brummie fans and had a great time.\n'It was the atmosphere, the camaraderie, and I really felt that there was something I could connect with.'\nWilliam has also spoken in the past about how his interest in the club intensified following a downturn in their fortunes.\n'I kept an eye on Villa from then on but didn't get too involved initially,' he told the Sun last month. 'But Villa being relegated to the Championship in 2016 got me even more interested, strangely.\n'A few years earlier, we'd finished sixth under Martin O'Neill and now we weren't even in the Premier League. I'm not certain why I became much more interested then, but it might have been due to the rise of the smartphone.\n'I'd grown up looking at Ceefax on the television or the back pages of newspapers, and if you didn't have those to hand you were a bit out of the loop.\n'But now you can get so much data and follow how your team is doing all the time and there's so much more discussion and debate. That's how my passion really increased.'",
  "word_count": 2202,
  "scraped_at": "2026-02-14T01:55:09.084220",
  "_text_extracted": true
}