{
  "article_id": "56a70b4f39bd",
  "url": "https://www.cafonline.com/caf-champions-league/news/north-african-derby-headlines-totalenergies-caf-champions-league-weekend/",
  "title": "North African derby headlines TotalEnergies CAF Champions League weekend",
  "date": "20231206T154500Z",
  "domain": "cafonline.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "North African derby headlines TotalEnergies CAF Champions League weekend\nThe TotalEnergies CAF Champions League resumes with Match Day 3 fixtures on Friday, 08 December, as Africa’s premier club football competition shifts into higher gear.\nHeadlining this weekend’s fixtures is undoubtedly the North African derby between record holders, Al Ahly who will be home to Algeria’s CR Belouizdad in a late afternoon kick off in Cairo.\nThe two sides are separated by a mere point in Group D, with Ahly leading the pack on 4 points ahead of the Algerians, Medeama of Ghana as well as Tanzania’s Young Africans.\nA simultaneous Group D fixture taking place in Ghana sees Medeama playing host to Young Africans.\nYanga, as the Tanzanian giants are affectionately known must get a result against the Ghanaians should they harbour any hopes of progressing further.\nAnother side that will be desperate for a victory will be last season’s silver-medalists, Wydad Athletic Club, who yet to collect a point following their shock defeat to Botswana’s Jwaneng Galaxy as well as last weekend’s loss to Ivorian powerhouse, Asec Mimosas.\nIn Tunisia, ES Tunis face a high in confidence Petro de Luanda who occupy the summit of Group C.\nThe Angolans have won both their opening group matches against ES Sahel and Al Hilal and will be looking at continuing their fine form.\nConcluding Match Day 3 is an exciting north versus south duel between hosts, Mamelodi Sundowns and Pyramids FC of Egypt.\nThe South Africans are in good form lately with their most recent achievement being the African Football League that they won on home soil last month.\nTheir draw against TP Mazembe in Lubumbashi last week sees all four Group A clubs tied on 3 points.\nPyramids on the other hand will be looking at putting their defeat to Nouadhibou behind them who stunned them with a 2-0 defeat last weekend.\nTotalEnergies CAF Champions League Match Day 3 Fixtures\nFriday December 8\n16h00 GMT | Medeama - Young Africans\n16h00 GMT | Al Ahly - CR Belouizdad\n19h00 GMT | ES Sahel - Al Hilal\nSaturday December 9\n13h00 GMT | Jwaneng Galaxy - Asec Mimosas\n16h00 GMT | Nouadhibou - TP Mazembe\n19:00 GMT | Wydad - Simba\n19:00 GMT | Hope - Petro de Luanda\nSunday December 10\n19:00 GMT | Sundowns - Pyramids",
  "word_count": 387,
  "scraped_at": "2026-02-14T02:20:16.281080",
  "_text_extracted": true
}