{
  "article_id": "56f7daeb1a24",
  "url": "https://www.thisdaylive.com/2026/01/23/osimhen-galatasaray-will-get-decent-result-at-man-city-next-week/",
  "title": "Osimhen : Galatasaray Will Get Decent Result at Man City Next Week – THISDAYLIVE",
  "date": "20260123T010000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nOsimhen: Galatasaray Will Get Decent Result at Man City Next Week\n*Reveals he’s in talks to persuade Lookman, Onyedika to join the Turkish giants\nDuro Ikhazuagbe\nAs the race for the playoffs stage of the UEFA Champions League gets tougher, Nigerian international striker, Victor Osimhen, remains confident that Galatasaray will be able to get a decent result at Manchester City next week to stay alive in the foremost European club football competition.\nGalatasaray forced Atletico Madrid to a 1-1 draw at home in Istanbul on Wednesday night in continuation of the Champions League.\nAfter Match-day 7 of the UCL, Galatasaray are 17th in the standings with 10 points from seven matches.\nAlthough the are out of the eight teams for direct qualification to the quarterfinals, the Turkish giants are good to be amongst the 24 teams to go into the playoffs of the new format started last season.\nA draw in the final group game at Manchester City next Wednesday should be enough to get the Turkish champions into the knockout rounds of the competition.\nAccording to Osimhen, “Manchester City are one of the best teams in the world. We will focus on the league first, then that match,” Osimhen said shortly after the draw with Atletico.\n“It won’t be easy, but I trust my team. We can get something out of it. We need to play like we did against Atletico,” he pledged.\nThe Super Eagles striker said the home draw with Atletico Madrid was evenly balanced and Galatasaray had chances to even win it.\n“I congratulate my teammates, we did a good job against a great opponent,” he said.\n“The match was 50-50. We had chances to finish the game in some moments. I’m happy with our performance.”\nMeanwhile, Osimhen has revealed that he is personally involved in trying to persuade Ademola Lookman and Raphael Onyedika to join the Turkish champions.\nLookman and Onyedika are widely believed to be top on the transfer agenda at Galatasaray as the Turkish giants step up their plans to strengthen their squad for the second half of the season.\nThe Istanbul club are believed to be eager to add quality and depth as they chase domestic honours and aim to go deeper in European competition, and both Nigerian internationals have emerged as serious targets.\nOsimhen admitted that he has already held informal talks with both players during international duty. All three helped Nigeria win bronze at the just -concluded 2025 AFCON in Morocco.\n“I spoke with Onyedika during the Africa Cup of Nations. I also spoke with Lookman during the matches we played for the World Cup,” Osimhen was quoted as saying by news medium Futboo.\n“I told them about the Galatasaray fans, how big a club we are, and the beauty of the country. They are adults. They will make their own decisions.”\nOsimhen believes that their arrival would not only raise the quality of the squad but also excite the supporters.\n“Their arrival would be good for our club, our players, and our fans,” Osimhen added. “Onyedika is a very good player. He plays very fluently. If he comes here, he will contribute a lot to us.\n“He is a very talented player. I am trying to convince both of them. I would like them to come to one of the biggest clubs in the world and play with us,” concludes the former Napoli striker.\nRESULTS (Europa League)\nBologna 2-2 Celtic\nBrann 3-3 Midtjylland\nFenerbahce 0-1 Aston Villa\nFeyenoord 3-0 Sturm Graz\nFreiburg 1-0 Maccabi T’Aviv\nMalmo FF 0-1 Crvena Zvezda\nPAOK 2-0 Betis\nPlzen 1-1 FC Porto\nYoung Boys 0-1 Lyon\nAS Roma 2-0 Stuttgart\nBraga 1-0 Nottingham\nCelta Vigo 2-1 Lille\nDin. Zagreb 4-1 FCSB\nFerencvaros 1-1 Pana’kos\nRangers 1-0 Ludogorets\nSalzburg 3-1 Basel",
  "word_count": 628,
  "scraped_at": "2026-02-14T02:12:22.655582",
  "_text_extracted": true
}