{
  "article_id": "56fc23cea7f4",
  "url": "https://www.the42.ie/rory-mcilroy-troy-parrott-kate-oconnor-6913398-Dec2025/",
  "title": "Highlight , star , disappointment : Our writers review the 2025 sporting year",
  "date": "20251231T070000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gavin Cooney\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nAside from Parrott’s winner in Budapest, Rory McIlroy’s absurd, rollicking, maddening, emotional, genius Masters victory.\nAnd what was your biggest disappointment?\nThat Rhasidat Adeleke wasn’t fit to compete at this year’s World Championships. The silver lining to the fourth-placed finish at the Paris Olympics was the sense of her upward trajectory, but that hasn’t been the case in 2025. Injury has stalled her progress, while Sydney McLaughlin-Levrone’s decision to switch to the 400m flat has further crowded an already stacked field in Adeleke’s preferred event.\nWho is your Irish sports star of the year?\nRory McIlroy. To win Pebble Beach, the Players, the Masters, the Irish Open, an away Ryder Cup and the DP World Tour order of merit would mark a great career for almost any other player. For McIlroy it was just another year in the career of Europe’s greatest-ever golfer. Honourable mentions for Caoimhín Kelleher and Troy Parrott.\nWho is your international sports star of the year?\nI picked Mondo Duplantis last year and he is close again in 2025, but for the sake of variety I’ll go for Scottie Scheffler. McIlroy partly owes his Masters triumph to the fact Scheffler started the year slowly having sliced his hand open making ravioli. Once he found his groove, he knocked off another two majors, and is now only a US Open away from following McIlroy into the halls of the Grand Slam. He is freakishly consistent, having finished outside the top-10 in only three of his events all year, and not at all following the Players Championship in March. Oh, and he rocked up to Portrush and casually delivered a press conference-cum-sermon that was as fascinating an insight into elite sporting mentality as this writer has ever heard.\nWhat sporting event are you most looking forward to in 2026?\nThe Fifa World Cup is decadent and depraved. It is also, unfortunately, utterly unmissable.\n*****\nRonan Early\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nTroy Parrott, Hungary, and Rory McIlroy, Georgia – the same as everyone else probably. Otherwise the increasingly frantic Ireland 10 debate has kept me entertained. It’s a conversation about regional conflict, with a more universal need for a hero to come along and save us.\nWhere have all the good men gone and where are all the gods? Where’s the streetwise Hercules to fight the rising odds? I can’t think about this selection quandary without hearing Bonnie Tyler going through the octaves . . . Isn’t there a white knight upon a fiery steed?\nThere are no gods in this case, and there probably never were despite what we fans of sport tell ourselves.\nAnd what was your biggest disappointment?\nCork City getting relegated, again.\nWho is your Irish sports star of the year?\nObjectively it’s Rory but I’ll go with Troy, if only because I’ve always talked him up to those around me, in the bad times too, and it’s nice to be right once every few years.\nWho is your international sports star of the year?\nShohei Ohtani. Ok, I’ve never watched him play a full game. In fact I’ve never watched any baseball game start to finish. But the fact that he leads teams to the World Series while batting and pitching appeals to me. We need more generalists in the world, more people who are prepared to fail aiming high rather than succeed in one, more narrow, discipline. Maybe this guy is the streetwise Hercules to fight the rising odds?\nWhat sporting event are you most looking forward to in 2026?\nThe World Cup.\n*****\nDavid Sneyd\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nThe release of that beautiful, uncontrollable joy around the country – and among the diaspora – when the winning goal hit the net in Budapest was unforgettable, a feeling that infuses you with happiness and helps to restore optimism.\nOn the League of Ireland front, Shamrock Rovers and Shelbourne both qualifying for the league phase of the Uefa Conference League set a new standard, although their results fell flat.\nEarlier in the year, there were nerves that gnawed away in the pit of the stomach as Kate O’Connor – her leg strapped due to injury – prepared for the 800 metre run in the final event of the women’s heptathlon at the World Athletics Championships in Tokyo. She then produced her fifth Personal Best from seven events to secure an historic silver medal, Ireland’s first at those championships for 12 years.\nAnd what was your biggest disappointment?\nThe first two that sprung to mind were the struggles that Rhasidat Adeleke had to face with her fitness and form. Here’s hoping the Tallaght native can rediscover the levels that excited everyone so much. The other was the way in which Damien Duff’s time with Shelbourne came to an end before we got the chance to see how they did in Europe.\nWho is your Irish sports star of the year?\nTroy Parrott produced five goals in a week, including the first ever senior men’s hat-trick away from home, to keep the World Cup dream alive and rekindle an excitement around the country that wasn’t matched in 2025.\nWho is your international sports star of the year?\nA bit of a cop out, perhaps, seeing as he’s Irish but let’s go with Rory McIlroy… Winning the Masters to complete the career Grand Slam, and then dealing with horrendous personal abuse to lead Europe to victory away to the USA in the Ryder Cup is a phenomenal achievement. Sandwiched in between just happened to be a thrilling Irish Open victory, too.\nWhat sporting event are you most looking forward to in 2026?\nThe World Cup, but only if Ireland qualify. Extortionate ticket prices and the vulgar levels of cash grabbing will hopefully blow up in Fifa’s face – luckily for Gianni Infantino, of course, they’ll have their recent Peace Award recipient, Donald Trump, on hand to solve such a crisis.\n*****\nCiarán Kennedy\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nTroy in Budapest is hard bet, but I was totally absorbed by Rory McIlroy at the Masters, and I think the way I experienced it had a lot to do with that as I’m not a golf lover. In Bordeaux to cover Munster’s Champions Cup quarter final, we caught some of it on the Saturday night in a bar, a small crowd chanting ‘Rory, Rory’ at the TV. That’s when I realised something was stirring.\nOn Sunday people were glued to phones at the airport, and the phones were whipped out again as soon as we landed in Dublin, updates trickling in through disembarking and down the halls to passport control. I made it home in time to watch the final stretch and felt emotions golf never made me feel before. (It was a long weekend).\nAnd what was your biggest disappointment?\nThe Waterford hurlers being out of the Championship in May. May! Armenia v Ireland might have had a mention here but Troy saved the year.\nWho is your Irish sports star of the year?\nSorry Rory, I’m going for Kate O’Connor. There’s something so compelling about O’Connor, ferociously competitive and bursting with self-belief, but also half-pinching herself that this is all actually happening. What a year, what a star.\nWho is your international sports star of the year?\nI’ll go for Louis Bielle-Biarrey, because I’m a rugby writer, and no player gave me as much joy to watch over the last 12 months as the Bordeaux Bègles and France winger, even if some of that came at Ireland’s expense through his double in Dublin. Any year where you win a Six Nations and Champions Cup is a good year. One of those athletes, like O’Connor, who just makes sport fun.\nWhat sporting event are you most looking forward to in 2026?\nFrance v Ireland in Paris on the opening week of the Six Nations. The Stade de France under lights, Antoine Dupont back in a France jersey, it’s going to be electric.\nSaying that, Mexico v Ireland in Mexico City at the World Cup could change all of our lives. Make it happen, lads.\n*****\nDeclan Bogue\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nWell sure lookit, Troy Parrot’s miracles each and every time for the obvious reasons and the communal joy that international sport can provide. Out of nothing at all, Parrott dragged his country to something magical in a few days and we also got to have a laugh at Ronaldo, who is indeed, A Cod.\nAnd I’ll throw in a mention of David Clifford’s two-pointer just before half-time of the All-Ireland football final for Kerry against Donegal. Everyone in the stadium could see what was going to happen, so when it did, it was the defining moment of the season. I loved it myself but I’m in a tiny minority as the very rule dictating that the ball must go dead to end the play was soon taken out of the new rule book.\nAnd what was your biggest disappointment?\nIn May of this year, Ciara Mageean talked about being able to run without pain for the first time in seven or eight years. This came after she missed out on the Paris Olympics the previous summer with an Achilles injury the night before her heat.\nA couple of weeks later after that interview, she was diagnosed with cancer. For someone who has been such a likeable, intelligent voice and a great advertisement for female sport in general, this is beyond cruel and everyone will wish her a successful recovery, all the way to the Los Angeles Olympics in 2028.\nWho is your Irish sports star of the year?\nIt had to be Rory McIlroy’s moment of deliverance in Augusta. Always an emotional sort, he let it all out after winning the play-off against a supremely sporting Justin Rose. It’s rare you see someone being themselves in that moment.\nUntil of course you go on a small bit and come to Shane Lowry and his Ryder Cup clinching putt. In a sport that wallows in bullshit, this was beautiful authenticity.\nI’m gonna give honourable mentions also to the following; watching Ben Healy wear the maillot jaune after Stage 10 of Le Tour was pretty special. Kate O’Connor’s performances in the Heptathlon was also pretty special.\nWatching Therese Donohue and Eoin Bradley doing their pretty special thing at an advanced age gives us all hope. And finally, to get hyper-local and keep it within the parish while also operating at the other side of the world, what Bláthín Bougue of Tempo Maguires, Fermanagh and North Melbourne did in the last few months in the AFLW (equalled the record number of goals in a season, won the Premier title and named on the All-Australian team) was, well, pretty special.\nWho is your international sports star of the year?\nHave to say, not a vintage year for the anointed world leaders in sport. And there’s a certain level of fame that is a huge turn off.\nSo while I’ll chuck a mention to Wilfried Nancy for the sheer Banter era that he is ushering in at Parkhead, the international sports event that I enjoyed most in 2025 was the first scrap between Chris Eubank Jnr and Conor Benn.\nWhat sporting event are you most looking forward to in 2026?\nThe World Cup. Destroyed by FIFA and the appalling people like Gianni Infantino, dominated by Donald Trump, undermined by the absolute curse of dynamic pricing. It’s going to be crass, tasteless, vulgar, grotesque and crass and corny and disgusting for the most part and above all, crass.\nThe only people on the planet that can save it is Heimer Halgíimsson’s Ireland.\n*****\nSinead Farrell\nWhat was your sporting highlight of the year (both Troy Parrott and other)?\nTroy Parrott’s heroics against Hungary were incredible, as was his two-goal performance against Portugal earlier that week. A famous few days for Irish football, and for Irish sport in general.\nBeyond that, I must also pay tribute to Rory McIlroy’s long-waited victory at the Masters. The final round was such compelling viewing capped off by that sensational approach to 18 in the play-off to give McIlroy his deserved Grand Slam.\nShane Lowry’s nerveless putt at the Ryder Cup to secure victory for Europe was among the top moments too, as was Dublin’s unexpected victory over Limerick in the All-Ireland hurling quarter-final.\nWho is your Irish sports star of the year?\nThis is a difficult category. Kate O’Connor is a worthy candidate after her superb silver-medal showing at the World Athletics Championships.\nBen Healy deserves a shoutout too for his Tour de France campaign as does world boxing champion Aoife O’Rourke, Champions League winner Katie McCabe and Footballer of the Year David Clifford.\nBut I just can’t look past Rory McIlroy. He is just the sixth man to complete the career Grand Slam after, and is the first European to do so as well. Not only that, McIlroy also won the Players Championship, the Irish Open and a fourth straight Race to Dubai on the European Tour in 2025. A season to savour for him.\nWho is your international sports star of the year?\nFor making the Formula 1 championship exciting again, I’m giving this one to Lando Norris. The championship went down to the wire this season with Max Verstappen still in the running to complete his five-in-a-row on the final day.\nAnd even though Verstappen won that Abu Dhabi Grand Prix, Norris did enough to hold on and win his maiden world title after finishing third. The sport needed some excitement in the title race again.\nWhat sporting event are you most looking forward to in 2026?\nIt has to be the Fifa World Cup. Assuming all goes well with our play-off ambitions, we will be there too for the first time since the 2002 tournament. Over to Heimir Hallgrimsson and the boys to get that ticket stamped in March.\nThe annual events shouldn’t be ignored here either. I always look forward to the Six Nations and the GAA championships too as well as the golf majors and Cheltenham.\n- Unlock every article and every podcast\n- The only place to read Murray Kinsella, Gavin Cooney, Declan Bogue & more\n- Specialist analysis that makes sense of the action\n- Weekly fan-favourite rugby, football and GAA podcasts\n- Unmissable sportswriting and features that you won’t find anywhere else",
  "word_count": 2446,
  "scraped_at": "2026-02-14T01:52:59.279965",
  "_text_extracted": true
}