{
  "article_id": "571126fb2197",
  "url": "https://www.90min.com/posts/premier-league-confirm-2024-25-season-dates",
  "title": "Premier League confirm 2024 / 25 season dates & Christmas Eve plan",
  "date": "20231222T210000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League confirm 2024/25 season dates & Christmas Eve plan\n- 2024/25 campaign to start on Saturday 17 August and end on Sunday 25 May\n- Premier League reiterates commitment to reducing demands at Christmas\n- No Christmas Eve fixture slated after backlash to Wolves vs Chelsea\nBy 90min Staff\nThe Premier League have confirmed the start and end dates for the 2024/25 season, with particular emphasis put on allowing more rest time over the festive period.\nThe new season will get underway a little later than usual because of Euro 2024, with the final round of fixtures taking place simultaneously on Sunday 25 May.\nA statement revealed: \"The Premier League 2024/25 season dates have been confirmed with the season starting on 17 August 2024.\n\"The final match round of the campaign will be played on 25 May 2025, when all games will kick off simultaneously as usual.\n\"In keeping with previous commitments made to clubs to address the congested schedule across Christmas and New Year, arrangements will be made to allow more rest time over three of the festive match rounds, with no club playing within 60 hours of another match.\"\nThe Premier League schedule will be further disrupted by the planned expansion of the Champions League, which will see ten midweek match rounds replace the previous format of six group stage fixtures, and that in turn could have a knock-on effect on FA Cup replays and the two-legged Carabao Cup semi-finals.\nThere will four allocated midweek match rounds, as well as one fixture set built in around Bank Holidays, and sees the domestic season stretched out across nine months.\nThe 2022/23 season was disrupted by the staging of the World Cup in Qatar and many Premier League managers have been outspoken on the demands of players all-year round.\nBecause of the value of television deals, English football is yet to fully embrace the idea of a winter break - though a reduction of fixtures in January is aimed at allowing players time to rest and recuperate before European competition heads into the knockout stages.\nThere will at least be no games played on Christmas Eve - the decision to stage Wolves vs Chelsea this season having generated a significant backlash from clubs and supporters.",
  "word_count": 376,
  "scraped_at": "2026-02-14T02:07:27.043661",
  "_text_extracted": true
}