{
  "article_id": "571461e6687f",
  "url": "https://www.nytimes.com/athletic/5491906/2024/05/15/west-ham-squad-audit-lopetegui/",
  "title": "West Ham squad audit : What Julen Lopetegui must prioritise this summer",
  "date": "20240515T070000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It will be an important summer for West Ham United.\nWith David Moyes leaving his role as manager at the end of the season, his replacement, Julen Lopetegui, will want to build the club in his image.\nHowever, the former Real Madrid and Wolverhampton Wanderers boss could lose key players, including Lucas Paqueta and Mohammed Kudus. In defence, Angelo Ogbonna and Ben Johnson are expected to depart when their contracts expire, and Nayef Aguerd, Thilo Kehrer and Vladimir Coufal are all open to leaving.\nSo what should Lopetegui’s priorities be?\nAdvertisement\nHere, The Athletic explains the situation of every squad member, who is at risk of leaving, and what weaknesses need to be addressed.\nGoalkeepers\nAlphonse Areola (contract expires 2027)\nAreola, 31, has been a consistent performer and vindicated Moyes’ decision to make him No 1 at the start of the season. The goalkeeper position is one of the strongest areas of West Ham’s squad and Lopetegui will likely not need to strengthen it.\nLukasz Fabianski (contract expires 2025)\nThe 39-year-old has made 199 appearances since joining from Swansea City in June 2018 but lost the No 1 jersey to Areola at the start of this season. Since then, Fabianski has been mostly restricted to cup competitions — only seven of his 20 starts this season have come in the Premier League — but he showed enough for West Ham to activate the one-year option on his contract.\nJoseph Anang (contract expires 2024)\nAnang, 23, is yet to make his first-team debut for West Ham but has been third choice this season after loan spells at Stevenage, St Patrick’s Athletic and Derby County. Behind the scenes, Anang, who was born in Ghana and moved to London as a teenager, has helped summer signing Kudus settle at the club. His long-term future will be decided in the coming weeks.\nFull-backs\nAaron Cresswell (contract expires 2024)\nCresswell’s soon-to-expire deal does not include a one-year option. He has been at West Ham for 10 years, having joined from Ipswich Town in 2014, and West Ham are hopeful the 34-year-old left-back will stay for another season.\nVladimir Coufal (contract expires 2025)\nSimilar to Fabianski, a one-year extension on Coufal’s contract was activated in January. However, Coufal was annoyed at not being offered a new, improved contract. West Ham have since offered the 31-year-old Czech Republic international a two-year deal but have failed to reach an agreement. He intends to reassess his long-term future in the summer, having had interest from a Premier League club in the January transfer window.\nBen Johnson (contract expires 2024)\nJohnson is set to leave when his contract expires in June. Rangers, Crystal Palace and Leeds United are interested in signing the 24-year-old, who has rejected multiple contract offers from West Ham. Their most recent offer was a four-year package, but both parties failed to reach an agreement. Johnson has received limited game time this season, with Coufal the first-choice right-back.\nThilo Kehrer (contract expires 2026)\nAdvertisement\nKehrer had started only three games in all competitions for West Ham this season before he joined Ligue 1 side Monaco on loan in January. It has been a positive move for Kehrer, who has made 17 appearances and helped Monaco qualify for the Champions League. The Germany international is open to a permanent deal, with Monaco holding an option to sign him in the summer.\nEmerson Palmieri (contract expires in 2026)\nThe Italy international is likely to remain West Ham’s first-choice left-back next season. He has been dependable under Moyes and has registered one goal and two assists in 35 league appearances this season. West Ham have the option to extend his contract by a further year.\nCentre-backs\nKurt Zouma (contract expires 2025)\nZouma has struggled with consistency this season. The centre-back was named as Declan Rice’s successor as captain in September but is yet to show the same leadership credentials as part of a porous defence that has conceded 71 league goals. The 29-year-old has made 102 appearances since joining from Chelsea in August 2021 and one of Lopetegui’s first decisions will be whether Zouma should retain the captaincy.\nAngelo Ogbonna (contract expires 2024)\nOgbonna looks likely to leave this summer. The 35-year-old bid farewell to supporters following last Saturday’s 3-1 win over Luton Town. It is yet to be determined if Ogbonna will continue his playing career. The former Italy international, who joined from Juventus in 2015, initially intended to retire at the London Stadium.\nNayef Aguerd (contract expires 2027)\nThe 28-year-old attended the victory over Luton but has not featured in a first-team game in nearly a month. Aguerd, who joined from Rennes in June 2022, received offers to leave last summer — from a club in the Saudi Pro League and two unnamed European suitors — but informed his representatives he was happy at West Ham. However, a dip in form has seen him lose his starting place to Konstantinos Mavropanos and Aguerd would like to leave in the summer.\nKonstantinos Mavropanos (contract expires 2028)\nAdvertisement\nIt has been a solid debut season for the 26-year-old. Mavropanos, whose signing was recommended by technical director Tim Steidten, recovered from a shaky start and repaid Moyes’ faith. Mavropanos was a previous transfer target for Wolverhampton Wanderers when Lopetegui was manager.\nMidfielders\nTomas Soucek (contract expires 2027)\nSoucek, who scored his 10th goal in all competitions this season against Luton Town, signed a four-year deal in August. After the summer break to Greece, he started the campaign in great form with goals against Bournemouth, Sheffield United and Newcastle, and the 29-year-old has been a key performer for Moyes. He will now aim to be as reliable a presence for Lopetegui.\nEdson Alvarez (contract expires 2028)\nLast summer, West Ham saw off competition from Bayern Munich to sign Alvarez, who was identified as Rice’s replacement — however, a few months later, he told Sky Sports Germany he would not rule out another move. “I’m always open, but at the moment, I’m really enjoying my time at West Ham,” he said. “I want to play and show the people my best qualities. But in the summer, you never know what’s going on.”\nAfter the midfielder was brought off at half-time in the 5-0 loss away to Chelsea, Moyes said West Ham were leaky defensively due to Rice’s absence, which was hardly a ringing endorsement of Alvarez’s performance. He was dropped for the win over Luton.\nFlynn Downes (contract expires 2027)\nSouthampton want to turn Downes’ impressive season-long loan into a permanent deal this summer, regardless of whether he can help them secure an immediate return to the Premier League via the play-offs.\nManager Russell Martin, who also managed Downes at Swansea City, believes the 25-year-old midfielder is one of the best players in the Championship. “I would love to stay here next season,” Downes told the Daily Echo. “I love it here. I love the gaffer. I love the staff. I love this place. I won’t know too much until I go back to West Ham.”\nGeorge Earthy (contract expires 2026)\nAdvertisement\nEarthy scored his first senior goal against Luton and the 19-year-old midfielder has impressed Moyes and staff behind the scenes with his attitude. The 19-year-old will have the opportunity to impress in pre-season before a decision is made on whether he will go out on loan. “George is a really, really talented player,” said Moyes. “What George will need to do is build up and improve his strength and his power. His football ability is not in question one bit, but it will be more about how he can handle and come into the Premier League.”\nFreddie Potts (contract expires 2026)\nSimilar to Earthy, Potts will be given an opportunity to impress in pre-season before a decision is made on whether he will go out on loan next season.\nThe 20-year-old’s performances on loan at League One side Wycombe Wanderers saw supporters vote him as the club’s player of the season. The son of under-21s manager and former defender Steve Potts, he also helped Wycombe reach the final of the Bristol Street Motors Trophy, where they lost to Peterborough United.\nJames Ward-Prowse (contract expires 2027)\nWard-Prowse is among the candidates to take over as captain if Lopetegui opts to replace Zouma. The 29-year-old has put together a solid debut season, amassing seven goals and 11 assists across 50 appearances. He is unlikely to make Gareth Southgate’s England squad for this summer’s European Championship, but if he kicks on again next season, he could win his first international cap since 2022.\nKalvin Phillips (contract expires 2024)\nThe 28-year-old is not on our squad graphic as he has already returned to Manchester City following a calf injury, in what felt like an exit via the backdoor. It was an unsuccessful loan for Phillips, who arrived hoping to cement his place in the England squad travelling to Germany this summer, but his lack of confidence showed. He made plenty of errors and just three starts. The nadir was putting his middle finger to a supporter who called him useless.\nAdvertisement\nAttacking midfielders and wingers\nLucas Paqueta (contract expires 2027)\nManchester City are expected to reignite their interest in Paqueta when his £85million ($106.8m) release clause becomes active in June. The Brazil international has registered eight goals and seven assists this season across 42 appearances, but despite the 26-year-old still being under investigation by the FA for alleged betting breaches, his departure seems inevitable.\nSaid Benrahma (contract expires 2026)\nIn January, Moyes informed Benrahma he could not guarantee him game time, which led to his loan move to Lyon, who have the option to sign the playmaker permanently in the summer. Benrahma has benefited from the change of scenery, registering three goals and two assists in 11 Ligue 1 appearances. He is expected to leave West Ham in the summer, a departure that feels like the right move for all parties.\nMohammed Kudus (contract expires 2028)\nThe 23-year-old has helped form a potent attacking trio alongside Paqueta and Jarrod Bowen and will not be short of admirers this summer. Arsenal and Chelsea considered signing the Ghana international last season before Steidten convinced Kudus to join West Ham. There is a buyout clause in Kudus’ contract, although those close to the attacker refuse to disclose the exact figure.\nMaxwel Cornet (contract expires 2027)\nAll things considered, the 27-year-old has been disappointing since joining from Burnley in August 2022. He has only made 37 appearances, scoring once. In January, he was a transfer target for Crystal Palace, but a deal could not be agreed. This summer, West Ham will listen to offers for him.\nJarrod Bowen (contract expires 2030)\nThe 27-year-old signed a seven-year contract extension in October and is the face of the club. This campaign, he has elevated his game, earned an England recall and became the first West Ham forward since Marlon Harewood in the 2004-05 season to score 20 goals in a campaign. Unlike Paqueta and Kudus, his long-term deal does not include a buyout clause.\nGO DEEPER\nIn Jarrod Bowen, West Ham finally have a 20-goals-a-season forward again\nStrikers\nMichail Antonio (contract expires 2025)\nLast summer, the forward had interest from Galatasaray in Turkey and Saudi Arabian side Al Ettifaq. This season, the Jamaica international has scored seven goals across 30 appearances and is attracting interest from MLS clubs and, once again, teams in the Saudi Pro League. The 34-year-old, who signed a two-year deal with an option for a further 12 months in 2022, was a transfer target for Lopetegui while manager of Wolves.\nDanny Ings (contract expires 2025)\nAdvertisement\nIngs will reassess his future in the summer. He is not guaranteed game time at West Ham, although he wants to remain in the Premier League. If interest develops this summer, whether a loan or permanent, it may be a good time to move him on. Ings has a paltry return of one goal across 29 appearances this season.\nDivin Mubama (contract expires 2024)\nThe young forward is set to leave when his contract expires. Mubama has rejected contract offers from West Ham, having wanted assurances over his playing time — the 19-year-old only played 75 minutes of league football under Moyes this season.\nWest Ham refused to sanction a move in January with Dutch side Twente, who were interested in signing him on loan. Corinthians forward Wesley has been targeted to boost West Ham’s options, but the asking price of £30million is proving prohibitive.\nGO DEEPER\nMoyes' emotional West Ham farewell: 'He wanted to be with players in good and bad times'\n(Top photo: Michail Antonio and Lucas Paqueta; by Justin Setterfield/Getty Images)",
  "word_count": 2113,
  "scraped_at": "2026-02-14T02:01:16.463794",
  "_text_extracted": true
}