{
  "article_id": "57474f8c15fa",
  "url": "https://www.kingfut.com/2024/09/28/koller-pressure-led-to-defeat/",
  "title": "Koller : Pressure led to my pre - match remarks",
  "date": "20240929T124500Z",
  "domain": "kingfut.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Al Ahly coach Marcel Koller discussed why his team lost to Zamalek in the CAF Super Cup.\nDuring the post-match press conference, Koller stated: “Anyone involved in sports understands that matches can be won or lost. We tried, but in the final quarter, they equalized, and we eventually lost on penalties, which is a common occurrence in football.”\nHe added: “It’s not my job to assess the opposition, I focus on my own team. We played two matches in the CAF Champions League and won, but in this game against Zamalek, we didn’t make the most of our chances.”\nKoller also addressed his pre-match remarks about a “surprise” lineup: “During the pre-match conference, I was under pressure from journalists to reveal the starting lineup. I mentioned the ‘surprise’ due to that pressure, but there was no other meaning behind it.”\nHe concluded: “We trained for a while without our international players, which affected the group’s performance, and we still have a lot of work to do to reach the desired level.”\nZamalek secured their fifth African Super Cup title after defeating Al Ahly on penalties.\nAl Ahly took the lead through a penalty by Wissam Abou Ali in the 44th minute, but Zamalek equalized through Nasser Mansi in the 77th minute.\nIn the penalty shootout, both Yahya Attia Allah and Wissam Abou Ali missed for Al Ahly, while Zamalek’s players successfully converted all their penalties.\nAl Ahly suffered their second consecutive defeat in the competition, keeping their record at eight titles—the most in the competition’s history.",
  "word_count": 256,
  "scraped_at": "2026-02-14T02:25:58.978843",
  "_text_extracted": true
}