{
  "article_id": "5761a0e8524c",
  "url": "https://thepeoplesperson.com/2024/02/21/pep-guardiola-feels-marcus-rashford-is-good-enough-to-play-for-man-city-276386/",
  "title": "Pep Guardiola feels Marcus Rashford is good enough to play for Man City - Man United News And Transfer News",
  "date": "20240221T174500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United secured all three points against newly-promoted Luton Town on Sunday but it was far from a comfortable outing.\nDespite taking a two-goal lead, the visitors, as has often been the case this season, conceded control and looked jittery whenever the Hatters had the ball.\nThe midfield and defence looked extremely shaky while the forward players with the exception of Rasmus Hojlund all fluffed their lines from promising positions.\nOne player, in particular, who is enduring a difficult campaign is Marcus Rashford, last season’s top scorer with 30 goals in all competitions.\nRashy’s difficult season\nHe has made more headlines with his off-field antics rather than his on-field exploits, much to the disappointment of manager Erik ten Hag.\nThe Mancunian was spotted partying after the Manchester Derby debacle while he reported sick after a 12-hour tequila bender in Belfast.\nHe was not selected for the subsequent game and was heavily fined but the forward apologised and was reintegrated back into the squad.\nAll these misdemeanors coupled with a crippling lack of form, the 26-year-old only has five goals and six assists, means there has been a lot of talk regarding his future.\nBoth Paris Saint-Germain and Real Madrid have been linked with shock moves and now, Football Insider have claimed Manchester City boss Pep Guardiola is a huge admirer of the England international.\nGood enough for City\nThe Spaniard believes Rashford is the only United star who can make the City squad on a consistent basis currently.\nHowever, the Englishman has flaws in his game which will require further polishing, especially his link-up play.\nAt United, the academy graduate has largely been tasked with providing moments of magic on his own since his breakthrough and it is not a surprise to see him struggle to combine with other teammates.\n“Pep Guardiola has privately admitted that Marcus Rashford is the only Man United player good enough to play regularly for Man City, sources have told Football Insider.\n“It is believed that the Spaniard rates Rashford’s talent and playing style very highly, to the extent that he would thrive in the all-conquering City team.\nPep is a Rashy fan\n“But Guardiola is said to have told allies that but he believes United’s other first-team stars do not have the capability to be a key player in his system.\n“However, sources have told Football Insider that the one doubt Guardiola has about Rashford, 26, is his combination play, something the manager puts great store in at City.”\nThese quotes do not mean City will now go after the United man but it shows how highly-rated Rashford is among the elite circles.\nUnited and Ten Hag will be hoping the forward can get his act together soon as the club tries to finish in the top four of the Premier League and qualify for next season’s Champions League.",
  "word_count": 475,
  "scraped_at": "2026-02-14T01:51:19.052933",
  "_text_extracted": true
}