{
  "article_id": "5779c29882a5",
  "url": "https://www.teamtalk.com/aston-villa/aston-villa-star-furious-marcus-rashford-man-utd-loanee-immediately-ruffles-feathers",
  "title": "Marcus Rashford : Aston Villa star  furiou at Man Utd loanee who immediately ruffled feathers",
  "date": "20250210T161500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa\nPremier League • England\nAston Villa star ‘furious’ at Marcus Rashford as Man Utd loanee immediately ruffles feathers\nMarcus Rashford has already angered a high profile Aston Villa star, though the Manchester United loanee is completely blameless in the dispute, according to reports.\nRashford, 27, received a rapturous welcome upon making his debut for Aston Villa off the bench. The Man Utd loanee replaced Donyell Malen in the 67th minute of Villa’s FA Cup fourth round victory over Tottenham on Sunday.\nRashford showed glimpses of the threat he can add to Unai Emery’s attack and if he proves a success, Villa can turn the loan spell permanent via a £40m option to buy.\nBut while Rashford’s debut was wholly positive, a fresh update from The Daily Mail has revealed tension in the dressing room.\nVilla recently registered their squad for the knockout stages of the Champions League. Clubs can only add a maximum of three winter window signings to their squads.\nEmery elected to include Rashford as well as fellow new recruits Axel Disasi and Marco Asensio. That left Malen and another new boy, Andres Garcia, as the odd men out.\nThe suggestion in the piece is had Rashford not been signed, Malen would have been selected. And per the report, Malen’s snub has gone down like a lead balloon with the Dutch forward.\nMalen – who cost roughly £21m when signed from Borussia Dortmund last month – arrived with an expectation he’d feature prominently in Villa’s UCL campaign.\nThat opportunity has now been handed to Rashford, with The Mail claiming Malen is ‘extremely unhappy’ with the turn of events.\nThe report went on to add: ‘Emery effectively admitted Malen was furious to be omitted.’\nMarcus Rashford already has post-Villa plans?\nAs mentioned, Villa hold an option to turn Rashford’s loan spell permanent to the tune of £40m.\nHowever, TEAMtalk’s transfer insider, Fraser Fletcher, has been informed Rashford may already be thinking of his next step.\nSome sources have suggested that Rashford has already decided that he wants to play his football elsewhere in the long-term.\nWe understand that Rashford is still very interested in playing abroad and there have been whispers from those close to his situation that a move is already in motion for the summer.\nThe winger’s favoured outcome in the winter window was joining Barcelona. The LaLiga giant were willing to sign Rashford, though an inability to finance the move opened the door for Villa.\nIn any case, what is clear is Rashford has no future back at Old Trafford even if Villa ignore their option.\nAccording to a remarkable update from The Guardian, Rashford will be denied the chance to play for Man Utd again – even if Amorim isn’t in charge.\nTheir report stated: ‘Marcus Rashford is extremely unlikely to play competitively for Manchester United again even if Ruben Amorim is no longer the head coach, with the relationship between the forward and his boyhood club near irreparable.’\n‘It is understood, too, that there is no call-back clause in the forward’s loan terms with Aston Villa should he start to score prolifically.’",
  "word_count": 520,
  "scraped_at": "2026-02-14T01:58:05.353599",
  "_text_extracted": true
}