{
  "article_id": "577fe8baf091",
  "url": "https://www.caughtoffside.com/2023/04/08/falk-arsenal-like-bundesliga-defender/",
  "title": "Falk : Arsenal interest in Bundesliga star ; Chelsea  made a call  in January",
  "date": "20230408T094500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Christian Falk has exclusively revealed in his latest Fact Files for CaughtOffside that Arsenal ‘are interested’ in Wolsburg’s Ridle Baku, though will face competition from two clubs for his signature this summer.\nThe 25-year-old fullback has registered five goals in 26 German top-flight appearances this term to help fire his outfit to ninth in the table – three places above where the club finished in 2021/22.\n“Ridle Baku of Wolfsburg got the call from Arsenal. The Gunners are interested in the German player who can play right-back and right-wing,” the Bundesliga journalist wrote. “But they’re not alone in their interest, as Chelsea made a call themselves during the winter window. Villarreal also want to make a bid this summer.”\nValued at £23.17m, according to Football Transfers‘ estimations, the Gunners would hardly have to break the bank to land the German star.\nWith Chelsea suffering some serious injury scares with Reece James this year, their interest in the Wolfsburg man is certainly far from surprising whilst Cesar Azpilicueta’s (the club’s only genuine backup for the England international) contract continues to tick down to its expiry in 2024.\nThat being said, they’ll be hard-pressed to beat out interest from their city rivals – especially if they secure a first Premier League title since 2004 – whilst languishing outside the Champions League spots.\nThere’s the reality to consider that the Blues will need to offload some members of the squad this summer to make up funds after some hefty spending under Graham Potter.",
  "word_count": 250,
  "scraped_at": "2026-02-14T01:59:46.865069",
  "_text_extracted": true
}