{
  "article_id": "578e88475e10",
  "url": "https://www.arsenal.com/news/who-we-could-face-uwcl-quarter-finals",
  "title": "Who we could face in UWCL quarter - finals",
  "date": "20250206T140000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The draw for the quarter-finals of the UEFA Women's Champions League coming up at 12pm GMT on Friday, February 7.\nAs we finished top of Group C with 15 points, we will face one of the runners-up from Group A, B or D, and play the first leg away from home.\nThe quarter-finals will take place on March 18 or 19 (first leg) and March 26 or 27 (second leg), with full fixture details to be confirmed in due course.\nFind out more about our potential opponents:\nVfL Wolfsburg\nWolfsburg finished second in Group A with three wins and three defeats, level on points with Roma but with a much better goal difference thanks to two 5-0 wins against Galatasaray and a 6-1 victory at home to Roma. They also ended up nine points behind Lyon.\nIn domestic football, Wolfsburg are third in the Frauen-Bundesliga with 31 points from 13 games, one point behind Bayern Munich and Eintracht Frankfurt.\nGerman forward Alexander Popp has been on fine form with 12 goals in all competitions\nWe have been knocked out by Wolfsburg three times in this competition - in the semi-finals in 2012/13 and 2022/23 and in the quarter-finals in 2021/22\nThey have won the competition on two occasions, in 2012/13 and 2013/14.\nReal Madrid\nMadrid finished second in Group B with four wins and two defeats, six points behind Chelsea and six ahead of Twente, who they beat 7-0 at home.\nIn domestic football, they’re second in Primera Division, five points behind Barcelona, who they lost 4-0 at home to in November, and lost 5-0 to in the final of the Supercopa de España Femenina on January 26.\nThe top scorer so far this season is Signe Bruun with 12 goals in all competitions.\nMadrid have never got past the quarter-finals.\nManchester City\nManchester City finished second in Group D with five wins and one defeat, level on points with Barcelona - who they beat 2-0 at home and lost 3-0 to away - but with a much lower goal difference.\nCity are fourth in the WSL after last weekend’s 4-3 defeat at home to us and they’re now two points behind us.\nTheir top scorer this season has been Khadija Shaw with 14 goals in all competitions.\nCity have never gotten past the semi-finals of the Champions League.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 416,
  "scraped_at": "2026-02-14T02:08:52.957527",
  "_text_extracted": true
}