{
  "article_id": "57be1eafa933",
  "url": "https://thepeoplesperson.com/2025/04/10/paul-scholes-believes-ruben-amorim-doesnt-like-his-team-after-man-united-draw-with-olympique-lyonnais-292802/",
  "title": "Paul Scholes believes Ruben Amorim doesnt like his team after Man United draw with Olympique Lyonnais - Man United News And Transfer News",
  "date": "20250411T021500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United legend Paul Scholes believes manager Ruben Amorim doesn’t like his team in a withering assessment of his former club’s players after tonight’s 2-2 draw with Olympique Lyonnais.\nThe Red Devils have certainly played much worse than they did at the Parc Olympique Lyonnais, and were unlucky to concede a last-gasp equaliser.\nBut for Scholes, speaking on TNT Sport after the game, the issue runs far deeper than their quarter-final first leg performance.\nResponding to the manager’s post-match comments that his team are continuing to improve, Scholes bluntly said: “I don’t think Ruben Amorim believes that. I don’t think he likes his team to be honest.\n“I think he knows he hasn’t got a great football team, I think he wants better, he needs better.\n“I think you can see that from the way he is on the touchline, he always looks disappointed to me.”\nIn his relatively brief stint in charge at Old Trafford the Portuguese boss has had to contend with everything from injury crises to individual howlers, and it was one of these that cost United the win tonight.\nIt’s little wonder, then, that he can cut a forlorn figure at times, but there are definitely signs that his side are playing better football now than they were a couple of months ago.\nIf the lack of goals can be addressed in the transfer market, with some further strengthening elsewhere, the outlook needn’t be as bleak as Scholes makes out.\nHowever, the former England international doubled down on his criticism of the current squad.\nHe said United “look a long way off the Champions League,” adding “there’s a lot of money to be spent before they’re at that level.\nTo illustrate the point Scholes noted the gulf in class between the Red Devils and Paris Saint-Germain, who blew Aston Villa away in that competition last night.\nHe is correct that how the club act in the summer transfer window will be a major indication of how the team can be expected to perform next season, and it remains to be seen whether they get the chance to fight for the Champions League or not – for now, that hinges on next week’s second leg clash at Old Trafford.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 377,
  "scraped_at": "2026-02-14T02:02:35.583870",
  "_text_extracted": true
}