{
  "article_id": "57c98c37be49",
  "url": "https://www.thenationalnews.com/business/economy/2025/09/27/uae-commercial-licences-at-nearly-40000-on-tourism-powered-economic-momentum/",
  "title": "UAE commercial licences at nearly 40 , 000 on tourism - powered economic momentum",
  "date": "20250927T114500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UAE has granted nearly 40,000 commercial licences in a number of key tourism-related industries, reflecting the country's continued economic momentum, Economy Minister Abdulla bin Touq has said.\nThe 39,546 licences issued through the middle of September amounted to a nearly four-fold surge from the same period in 2020, Mr Bin Touq said, state news agency Wam reported on Saturday.\nThose licences were in the sectors of tourism and digital tourism, hospitality, aviation, air transport and aviation technology, which \"reflects the UAE's leadership as an incubator for companies and commercial licences across various tourism sectors\", the minister said.\nTourism remained a major driver for the UAE economy, with Gulf visitor numbers growing: tourists from the six-nation council hit 3.3 million in 2024, accounting for about 11 per cent of total guests, boosted by the unified tourist visa approved in 2023, Mr Bin Touq said.\nTourists from Saudi Arabia comprised nearly 60 per cent of guests with 1.9 million, followed by Oman (777,000), Kuwait (381,000), Bahrain (123,000) and Qatar (93,000).\n\"The unified Gulf tourist visa represents a strategic step towards enhancing tourism integration,\" Mr Bin Touq said.\n\"It will represent a qualitative shift in the tourism sector across the Gulf and the region, enhance the visibility of the diverse tourism assets that characterise each GCC country, and contribute to strengthening the attractiveness of the Gulf countries as a unified regional tourism destination,\" he added.\nThe UAE's tourism industry is one of its economic pillars, complemented by a host of hospitality, retail and entertainment offerings, and forms part of the key non-oil economy.\nDubai welcomed nearly 10 million international visitors in the first half of 2025, up 6.1 per cent annually, while passenger traffic through the Abu Dhabi and Dubai airports topped about 62 million combined, latest government data shows.\nThe UAE has been boosting efforts to diversify its economy away from oil. Non-oil GDP rose 5.3 per cent rise on a yearly basis in the first quarter of 2025, rising to Dh352 billion, contributing more than 77 per cent of total real GDP, preliminary estimates released this month by the Federal Competitiveness and Statistics Centre have shown. The country’s overall GDP from January to March rose to Dh455 billion.\nThe UAE Central Bank last week increased its 2025 growth forecast for the country’s economy from 4.4 per cent to 4.9 per cent, as a surge in non-oil activity drives momentum.\nAlso last week, the UAE announced the launch of the National Policy for Economic Clusters, with the goal of boosting the country's gross domestic product by more than Dh30 billion ($8.16 billion) a year.\nTourism is expected to continue its key contribution to the UAE economy, with the Ministry of Economy boosting initiatives to encourage entrepreneurship both from local and international investors, enhance tourism infrastructure and enhancing the labour force, Mr Bin Touq said.\n\"The UAE places the tourism sector at the forefront of its economic priorities, considering it a pivotal pillar and a key driver of sustainable development,\" he added.\n\"It is also an effective element in promoting growth, diversifying sources of income, and increasing its contribution to the country's GDP.\"",
  "word_count": 521,
  "scraped_at": "2026-02-14T01:49:53.050650",
  "_text_extracted": true
}