{
  "article_id": "57e80a0930dd",
  "url": "https://fansided.com/playmaking-greats-top-5-assist-makers-history-champions-league",
  "title": "Playmaking greats : The top 5 assist makers in the history of the Champions League",
  "date": "20241218T144500Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The current season has seen the debut of a new format for the UEFA Champions League. Instead of the traditional, four-team group stages for which the competition has come to be known, this campaign has seen the introduction of a league table format for its opening stages, having been announced a few years ago.\nThe new format has certainly had a mixed reception thus far. Though still in its infancy, the new-look Champions League has perhaps given smaller sides, teams that usually would not have a prayer of qualifying from the group stage, a chance at progressing further into the competition. Understandably, though, there have been questions raised about the change and whether it was at all necessary.\nThe Champions League is a competition with a storied history, both under its current name and when it was known as the European Cup, prior to 1992. In both phases of its life, it has been regarded as the continent’s most prestigious honor to win. With that being said, it bears asking, just which five players are the all-time highest assist makers in Champions League history?\n5. David Beckham\nSomething of a footballing icon, David Beckham has long been a recognizable name in the sport. Throughout his playing career, he was famed for his technique when striking the ball, particularly from set piece situations, and his pinpoint passing ability. Since retiring, he has entered the business side of the sport, with both Salford City and in particular, Inter Miami in Major League Soccer.\nBeckham was a part of the Manchester United, treble-winning team of the 1998-99 season, playing a crucial role in helping the Red Devils become the first-ever English side to win a continental treble. Somehow, despite playing on for Man United and later Real Madrid, Beckham would never win another Champions League trophy.\nFor those two sides, Beckham made 107 appearances in the Champions League, scoring 16 goals. Unsurprisingly, it was for his playmaking that Beckham often captured plaudits and his 38 assists in the competition has him ranked as the fifth-best assist-maker in Champions League history.\n4. Angel Di Maria\nNow 36 years old and in the twilight of his career, Angel di Maria is plying his trade with Benfica at the time of writing, returning to the club last year after a three-year stint with them between 2007 and 2010. The Argentinian attacker retired from international duty earlier this year, but not before helping his country end their trophy drought with a Copa America and World Cup triumph.\nDi Maria moved to Real Madrid in 2010, joining Manchester United four years later for what was a British transfer record at the time. Di Maria, who can play either on the wing or at the 10, struggled to adapt and settle in Manchester and moved on to Paris Saint-Germain just a year later, where he would spend the next seven seasons before spending a campaign with Juventus.\nHaving competed in the Champions League with every club that he played for excluding Manchester United, Di Maria has racked up 113 Champions League matches at the time of writing. With 24 goals to his name, Di Maria also has 42 assists, one of just four players with over 40 assists in the Champions League.\n3. Ryan Giggs\nTo be a one-club man has always been an impressive feat, but especially in modern football, where lucrative contracts can serve as such powerful motivation to move clubs. Ryan Giggs, though, is often cited as an epitome of loyalty within football. Moving to Manchester United from Manchester City as a youth player in 1987, Giggs made his senior debut in 1990 and spent his entire, 24-year career with the Red Devils.\nA crucial cog in the system of managerial legend Sir Alex Ferguson, Giggs was ever present as Man United won 13 Premier League titles under the Scot, alongside seven domestic cups and two Champions League triumphs; one as part of the 1998-99 European treble and the other in 2008, against Chelsea.\nGiggs made 145 Champions League appearances in his career, one of the highest tallies of any player in history. In those games, the Welshman racked up 45 assists which, for a time, was the best record of assists of any player in the competition’s history, until a certain star duo usurped him.\n2. Lionel Messi\nNow playing in Major League Soccer for Inter Miami, Lionel Messi is undoubtedly one of the greatest to ever have played the beautiful game. To many, he is the absolute best. Messi spent two seasons with Paris Saint-Germain in recent years but, of course, he is famed for his near 20-year spell with Barcelona.\nA product of the La Masia youth academy, Messi quickly became a crucial player for Barcelona and only improved with each passing season. The World Cup winner has triumphed in the Champions League four times, the latest success having come in 2015 when he won the competition as part of the “MSN” attacking trio alongside Neymar and Luis Suarez.\nThe second-highest goal-scorer in Champions League history, Messi also ranks second among assist makers in the competition. Across his 163 games on the European continent, the Argentinian notched 45 assists alongside his 129 goals, a return to be expected of such a brilliant player.\n1. Cristiano Ronaldo\nNo player in Champions League history has more appearances than Cristiano Ronaldo, nor has any player scored more goals in the competition than the Portuguese attacker. Not only that, but Ronaldo also holds the record for having the most assists of any one player throughout the Champions League’s existence, with 48 assists to his name.\nRonaldo, who now plays in Saudi Arabia and is approaching the age of 40, turned out for Manchester United, Real Madrid and Juventus in the Champions League, racking up 183 appearances across all three teams. His 140 goals sits him 11 strikes higher than Lionel Messi, the only player to have come remotely close to his tally.\nAlso the record scorer for his country, Ronaldo’s first Champions League triumph came in 2008 under the management of Sir Alex Ferguson with the Red Devils. In nine years with Madrid, Ronaldo won the competition four further times, including a run of three back-to-back triumphs, a first for any team in history.",
  "word_count": 1047,
  "scraped_at": "2026-02-14T01:52:10.153591",
  "_text_extracted": true
}