{
  "article_id": "57e9c27fdae8",
  "url": "https://www.teamtalk.com/news/liverpool-position-themselves-sensational-alexander-isak-transfer-newcastle-target-153-goal-heir",
  "title": "Liverpool  best positioned  for British record Alexander Isak transfer as concerned Newcastle target 153 - goal heir",
  "date": "20250122T133000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool ‘best positioned’ for British record Alexander Isak transfer as concerned Newcastle target 153-goal heir\nLiverpool are described as Alexander Isak’s ‘most persistent suitors’ with a sensational report claiming the Reds are ahead of Arsenal and are now the side ‘best positioned to strike a deal in the future’ for the Swede.\nIsak is regarded as one of the best strikers in world football right now, having struck an impressive 12 goals in his last 11 games, a run of form that saw him become only the fourth player in Premier League history to score in eight successive matches. With 15 goals now to his name from 20 games in the competition, Isak trails only Mo Salah (18) and Erling Haaland (17) in the race for the Premier League Golden Boot.\nAnd while contracted at St James’ Park until the summer of 2028, Newcastle are eager to tie him down to a new deal and hand their talented No.14 a hefty pay rise to mark his increased stature in the game.\nHowever, Isak has so far resisted Magpies’ efforts to tie him down to an extension, preferring instead to see where the club will finish in the league this season. Understandably, a player of his stature sees himself as wanting to play in the Champions League, something he has tasted under Eddie Howe last season.\nAs a result, strong speculation has seen Isak emerge on Arsenal’s transfer radar, with sources strongly underlining the Gunners’ interest in the Swede and with the 50-times capped striker described to us as a ‘dream target’ for boss Mikel Arteta.\nNow though, according to Football Transfers, it is Liverpool who are now described as the side most strongly fancied to sign the 129-goal striker.\nThe report claims that while ‘Arsenal hold the Swede in high esteem’, it is Liverpool who are ‘among his most persistent suitors and are best positioned to strike a deal in the future’.\nTEAMtalk has previously reported that any move for Isak would likely set a new British transfer record, with bidding for the striker likely to start at £115m (€136.1m, $142.1m).\nFurthermore, the report goes on to say that a concerned Newcastle have also already put the feelers out over the capture of a high-profile replacement in the form of Viktor Gyokeres. Isak’s fellow countryman has also been tearing it up this season, scoring an impressive 27 goals across all competitions, while he also boasts an impressive 153 goals in 312 appearances across his career.\nAnd per the report, Gyokeres has been identified as the player that Newcastle are ready to push for amid concerns that Isak could be poached away by a Premier League rival.\nDON’T MISS ➡️ ‘I’m out of here’ – Liverpool told Mo Salah behaviour confirms damaging exit decision.\nNewcastle chances of keeping Isak revealed as Liverpool eye Nunez upgrade\nDiscussing Isak’s future earlier this week, TEAMtalk correspondent Ben Jacobs admitted that the Swede’s future at St James’ Park would be intrinsically tied up with whether Newcastle qualify for the Champions League or not this season.\nShould the Magpies return to Europe’s top table for next season, a move to prise the super Swede away from Tyneside would be seen as extremely difficult.\nJacobs also acknowledged, though, that Isak has very much been signposted as Arsenal’s dream signing if given an opportunity to bring him to north London.\nHowever, he is not the only No.9 on their radar either, with the Gunners also keeping a close eye on Benjamin Sesko, Brighton’s Evan Ferguson and Botafogo forward Igor Jesus.\n“We are actively looking in the market to improve the squad, and that’s been the same since day one,” Arteta said in response to Gabriel Jesus’ ACL injury that looks set to sideline the Brazilian for the majority of the calendar year.\n“It would be naive not to do that because it is always an opportunity to evolve the team and improve the squad, especially with the circumstances. So yes, we are looking and we are trying and let’s see what we are able to do.”\nHowever, news that Liverpool are now ready to join the hunt for his signature poses more question marks over the future of Darwin Nunez.\nThe Uruguayan has fallen down the pecking order under Arne Slot this season, starting just seven times in the Premier League this season for the Reds.\nAnd while he served as a reminder of his abilities when stepping off the bench to score both goals in last Saturday’s 2-0 win at Brentford, his inconsistencies in front of goal has seen speculation rise over his future.\nThat has seen Nunez linked with a lucrative move to Saudi Arabia in recent weeks. And while TEAMtalk sources moved to play speculation that a January move is on the cards, the striker’s future remains very much under the spotlight amid claims an upgrade will be targeted this summer.\nLiverpool transfer latest: Salah’s coy update; Trent’s huge pay-day\nMeanwhile, Mo Salah was put on the spot on Tuesday night after setting another Liverpool landmark in the Champions League. Now the first man in Reds history to net 50 times in Europe for the club, Salah was once again asked about his future, with the Egyptian dropping a coy 11-word response and with Alan Shearer also jokingly branding the star ‘terrible’.\nElsewhere, the chances of retaining Trent Alexander-Arnold’s services appear to be fading by the day amid new claims in Spain that an agreement was ‘on the verge’ of being finalised with Real Madrid and that the 26-year-old is poised to land a mammoth signing-on fee with the Spanish giants.\nAnd finally, Slot has dropped a hint that the Reds could re-enter the chase for Martin Zubimendi after both confirming his admiration for the player and revealing just how important the No.6 role is to his side.",
  "word_count": 973,
  "scraped_at": "2026-02-14T02:02:19.847854",
  "_text_extracted": true
}