{
  "article_id": "57ea5ac7c19f",
  "url": "https://www.yahoo.com/news/city-real-meet-again-cl-131351391.html",
  "title": "City and Real meet again in CL quarters as rivalries are renewed",
  "date": "20240315T140000Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "City and Real meet again in CL quarters as rivalries are renewed\nTitle holders Manchester City renew their rivalry with record winners Real Madrid in the Champions League quarter-finals drawn on Thursday, and there is also a feeling of deja vu when Arsenal face Bayern Munich and Paris Saint-Germain take on Barcelona.\nCity and Real crossed swords in the past two seasons as well, then in the semi-finals. Carlo Ancelotti's Real advanced in dramatic fashion in 2022 and went on to win a 14th title while pep Guardiola's City prevailed 5-1 on aggregate last term en route to lifting the trophy for the first time.\n\"We have to remember we beat them last season in the semi-finals so we will try to remember that,” City's director of football Txiki Begiristain said.\n“We did a top, top job in the second leg but we need to remember how strong they are and that they are top of their league and that they enjoy this competition.\n“It’s the history of Real Madrid. Every time they face up in this competition, they think they are going to win. The only thing is that we are confident. We are doing well, we have been in the last years fighting for this competition and at the end we won it,\" he said.\nThe winner of that tie will in the semis face 2006 runners-up Arsenal or six-time winners Bayern whose former Tottenham striker Harry Kane returns to London for the date with the Premier League leaders en route to another possible trip there for the June 1 final at Wembley.\nBayern have won all their previous knock-out ties, in the round of 16 in 2013, 2014 and 2017, but have gone out in the last eight the past three seasons, and owing to a fan ban will not have any of their fans at the first leg at Emirates Stadium.\n\"It will definitely be a tough journey to Wembley! Premier League leaders Arsenal are in top form and it will be a match of equals. They're no longer the Gunners who we've won the last three ties against,\" Bayern CEO Jan Christian Dreesen said.\n\"Nevertheless, the objective is clear: after three successive quarter-final exits, we're determined to progress.\"\nThe PSG v Barca rivalry is highlighted by their memorable 2016 last 16 clash where Barca overturned a 4-0 defeat from the first leg 6-1 at home.\nFive-times winners Barca have won three of their five knock-out ties, but PSG, who are yet to win the elite event, advanced from the last one in the 2021 round of 16.\nThe winner faces three-time finalists Atletico Madrid or 1997 winners Borussia Dortmund who complete the quarter-final line-up and have previously met twice in the group stage, with two wins for each side.\nMore in Sports\nDortmund coach Edin Terzic named Diego Simeone's Atletico \"a little monster especially in knock-out games\" and is happy to have the second leg at home.\nThe draw makes it possible that Bayern and Dortmund can contest the Wembley final like in 2013, with Bayern winning 2-1, but Dortmund CEO Hans-Joachim Watzke remained cautious.\n\"It would be cool, against Bayern again at Wembley as a revenge. But it will be tough. We know about Atletico's strength,\" he said.\nThe quarter-finals are April 9/10 and 16/17, and the semis April 30/May 1 and May 7/8.\nThe draw at the UEFA headquarters in Nyon was fully open, without country, group stage or seeded teams protection like for the round of 16.\nIt was also the last draw in the current format as all European competitions will undergo an overhaul to a league format from next season onwards.",
  "word_count": 611,
  "scraped_at": "2026-02-14T02:10:47.913824",
  "_text_extracted": true
}