{
  "article_id": "57fbbda9ab3c",
  "url": "https://www.bnnbloomberg.ca/europe-gets-serious-about-women-s-football-apart-from-money-1.1870460",
  "title": "Europe Gets Serious About Women Football , Apart From Money",
  "date": "20230115T131500Z",
  "domain": "bnnbloomberg.ca",
  "source_country": "Canada",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Weekend Edition\nEnergy & Commodities\n‘We were expecting better from Barrick,’ analyst says after Newmont calls to fix Nevada Gold Mines\nNewmont Corporation has asked Toronto-based Barrick Gold to improve operations at its joint venture before Barrick moves ahead with a planned initial public offering (IPO) later this year.\nWasserman to Sell Talent Agency After ‘Past Personal Mistakes’Opens in new window\nChina’s Wang Meets US’ Rubio Before Planned Trump-Xi SummitOpens in new window\nPhilippines’ First Gen to Buy Into Hydropower Business for $1.3 BillionOpens in new window\nThailand’s Richest Man Becomes Top Shareholder in KasikornbankOpens in new window\nFord CEO, Trump Officials Discussed China-US Carmaking JVsOpens in new window\nMalaysia’s Cabinet Orders Probe Into Anti-Graft Chief AzamOpens in new window\nAnduril in Talks to Raise Billions at Over $60 Billion ValuationOpens in new window\nTrump Says Regime Change in Iran ‘Best Thing That Could Happen’Opens in new window\nCatch up on business and market news, data and analysis from Bloomberg.comOpens in new window\nTrade War\nDominic LeBlanc to lead large trade mission to Mexico next week\nThe minister in charge of Canada-U.S. trade is leading a large delegation to Mexico next week as Ottawa looks to diversify its trade links in response to Donald Trump’s tariffs and threats.\nEditor's Picks\nGuest Schedule\nFind out who's on BNN Bloomberg TV today.\nSee all guestsMoney Talk\nCut out the noise. Hear what matters.\nWatch nowBNN Bloomberg App\nGet a customizable stock list and breaking news alerts.\nDownload now",
  "word_count": 246,
  "scraped_at": "2026-02-14T02:03:35.868083",
  "_text_extracted": true
}