{
  "article_id": "57ff949a0038",
  "url": "https://www.justarsenal.com/arsenal-fans-dont-need-to-lose-their-heads-nothing-much-has-changed-really/337488",
  "title": "Arsenal fans dont need to lose their heads , nothing much has changed really",
  "date": "20230418T140000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s over when it’s over…Arsenal can still do it! by Aziz\nIn the last two games, Arsenal had lost two-points from a winning position. Arsenal had both 2-0 leads against Liverpool at Anfield and West Ham at London Stadium ‘squandered’, that left many fans and pundits alike wondering if this Arsenal team can sustain the push to the EPL’s triumph come the end of the season.\nArsenal can do it despite these glitches of recent. It’s still within their hands.\nArsenal has to take one game at a time, starting the one against the Saints on Friday and more importantly the one against, the closest foes, the Cityzens, come 26 April. Theoretically, Arsenal needs to win all games NOW and avoid any ‘margin for error’. It’s never a fool’s errand: Arsenal is capable of winning all of its remaining games.\nOf course, Manchester City is a brilliant team and, in my opinion, the best team in Europe at the moment, but they can still be beaten.\nMan City has some upcoming tricky games that come thick and fast! Their players, like Arsenal players, are human beings, you will never know for certain what they can offer in these games. Fingers crossed, Man City won’t be their usual 100% and Arsenal can capitalize on them. Let’s hope our players do their best during that period, taking into consideration Arsenal has relatively fewer games to play compared to Man City.\nArsenal fans should realize one thing, even if Arsenal had won both games at Anfield and London Stadium, they would still need to get a result at Etihad Stadium and win as many remaining games as possible to make sure they stand a chance of winning the EPL…so it’s only a “minor” thing that changed after these two disappointing draws. So, Arsenal needs to win this six-pointer game against Man City on 26 April, regardless.\nLet’s not lose our heads by excessively moaning about players and managers.\nThey need to believe in themselves, be resolute and go there with one aim, “to get all three points” and win all other remaining games… we will be good to go!\nAn alternative scenario: If we finish second and play Champions League football next season, I don’t think, it would be a “disaster” season by anyone’s standard…. taking into consideration Chelsea spent over $350 in just the winter transfer window alone and are not in the top four of the EPL!\nI would have taken the second position at the start of the season. Wouldn’t you have?\nBy Aziz Senzia\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 449,
  "scraped_at": "2026-02-14T01:55:54.950810",
  "_text_extracted": true
}