{
  "article_id": "5805efc55816",
  "url": "https://www.france24.com/en/live-news/20230420-juventus-transfer-penalty-revoked-but-new-ruling-looms",
  "title": "Juventu transfer penalty revoked but new ruling looms",
  "date": "20230420T214500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Juventus' transfer penalty revoked but new ruling looms\nMilan (AFP) – Juventus' 15-point penalty for illicit transfer activity was revoked on Thursday but the spectre of sanction did not disappear completely after Italy's highest sporting court ruled that the case should be re-examined.\nIssued on: Modified:\nIn a statement, the Sports Guarantee Board asked the Italian Football Federation's (FIGC) appeals court to revise punishments handed down in the original ruling to the club and some key figures, including former deputy chairman Pavel Nedved.\nHowever the long bans given to former chairman Andrea Agnelli, ex-CEO Maurizio Arrivabene and sporting directors Federico Cherubini and Fabio Paratici were upheld.\nThe Sports Guarantee Board has a month to publish the reasoning behind its ruling, only after which the FIGC court can then reassess the case, meaning the affair will likely drag on until the end of the season.\nThursday's decision moves Juve up from seventh in Serie A to third on 59 points while they await a new ruling from the FIGC court.\nJuve are 16 points behind league leaders Napoli, who they host in Turin on Sunday, while AC Milan have been bumped out of Serie A's Champions League places as a result.\nThe news came on the same evening Juve were trying to get past Sporting Lisbon and into the Europa League semi-finals.\n\"We have always considered ourselves as having 59 points, those points which the players have on the pitch,\" said Juventus coach Massimiliano Allegri ahead of Thursday's kick-off.\nFrancesco Calvo, the club's head of football, expressed his \"satisfaction\" after a decision which \"brings certainty, both to us and to our rivals for the top four places\".\nIn January, Juve were found guilty by the FIGC appeals court of having \"systematically altered accounting documents... from at least the quarter ending March 31, 2019 to the quarter ending March 31, 2021\".\nTwo-year bans\nThe offences related to around 60 million euros ($65.7 million) of \"phony capital gains\" from transfers \"aimed at making financial results look better than they were in reality\", according to the appeals court.\nAgnelli and Arrivabene were both hit with two-year bans, while Cherubini was banned for 16 months.\nParatici, who by the time of January's ruling had left Juve and had become managing director at Tottenham Hotspur, was banned for two-and-a-half years.\nParatici's ban caused turmoil at Tottenham as it was extended worldwide by FIFA in March, a ruling which Paratici appealed earlier this month.\nThe decision to dock Juve points came after the reopening of a suspect transfer activity trial at the FIGC appeals court which had originally ended with Juve and a host of other clubs -- including Serie A leaders Napoli -- being acquitted.\nIt was reopened following new evidence from a separate criminal probe into Juve's finances conducted by prosecutors in Turin, with the club awaiting a potential trial on that matter.\nAgnelli and the rest of the Juve board stepped down in November under pressure from the criminal investigation, with a new board led by Gianluca Ferrero being appointed earlier this year.\nAgnelli's departure ended a 12-year reign which brought a host of trophies and for a period re-established Juventus as one of Europe's top teams.\nThe criminal probe also led to another by FIGC prosecutors into claims Juve lied about their players giving up salary payments during the Covid-19 pandemic while privately assuring players they would only miss out on a portion of what was publicly communicated.\n© 2023 AFP",
  "word_count": 578,
  "scraped_at": "2026-02-14T01:55:54.945214",
  "_text_extracted": true
}