{
  "article_id": "580ccd855cb7",
  "url": "https://www.maitlandmercury.com.au/story/9059368/newcastle-jets-denied-australia-cup-finale-at-home/",
  "title": "Newcastle Jets denied Australia Cup finale at home | The Maitland Mercury",
  "date": "20250906T000000Z",
  "domain": "maitlandmercury.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "JETS CEO Tain Drinkwater was disappointed for Hunter football fans after Newcastle was overlooked to host the final of the Australia Cup for a suburban ground in Melbourne.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe Jets will take on Heidelberg in the showpiece game at Lakeside Stadium on Saturday, October 4.\nLakeside is the home base of Heidelberg's rivals South Melbourne and has a capacity of 12,000 of which 7,400 are seated.\nThe stadium also doubles as an athletics centre and has a race track around the outside of the playing surface.\nJets officials worked closely with Venues NSW and were confident of drawing more than 15,000 to the final had it been at McDonald Jones Stadium.\n\"We are deeply disappointed,\" Drinkwater said. \"I felt we put forward a comprehensive community-backed proposal. We worked really hard over the past 24 hours to convince FA that it was right to bring the match to Newcastle.\n\"We worked with Venues NSW, who went back to Football Australia with another proposal to try and bring the game to Newcastle.\n\"When you look at the purpose of the Australia Cup, it is really about bringing games to the regions.\n\"There is no better place for this game than a region that lives and breathes football.\"\nWallsend state member for Parliament, Sonia Hornery, weighed in on the decision to overlook Newcastle to host the 'biggest game for the Jets since the 2008 A League grand final'.\n\"I'll be writing to the FA to let them know my thoughts on this decision,\" Hornery posted on Facebook. \"I'm a long-time Jets member and I'm behind them 110 per cent. I know the Wallsend Electorate is behind them too!\n\"The decision to play the Australia Cup Final at Lakeside Stadium in Victoria, a ground with 12,000 capacity was a bit of a shock to me.\"\nThe Cup final is broadcast live on free-to-air by Channel 10.\nAAMI Park in Melbourne, which has hosted four Cup finals, is unavailable due to a Monster Truck show.\nThis will be the first time the feature game hasn't been played at a major stadium since the inception of the national knockout in 2014.\n\"Heidelberg have done really well. They have defeated three A-League teams on the way to the final,\" Drinkwater said. \"That was the basis that FA provided to us for hosting it in Melbourne.\n\"We are very disappointed, but it's onwards and upwards.\n\"We have a game to play. The best thing we can do is win.\"\nThe Jets accounted for Avondale 4-2 in the sem-final to book a place in the final two.\nHeidelberg upset Auckland FC 2-0 in the other semi.\nNeither Newcastle nor Heidelberg have lifted the Cup before.\nSince the Cup's inception in 2014, the biggest attendance for a final was in 2016 when 18,751 watched Melbourne City beat Sydney FC 1-0 at AAMI Park in Melbourne.\nThe next best was in 2022, when 16,461 witnessed Macarthur beat NSW NPL club Sydney United at CommBank Stadium.\nA crowd of 13,289 was on hand for Macarthur's1-0 triumph over Melbourne Victory at AAMI Park last year.\nApart from entering the history books, the winner of the Australian Cup secures a place in the Asian Champions League Two next year.\nMeanwhile, the Australian Professional Leagues (APL) have confirmed that Western United will not play in the A-Leagues in 2026/27.\nThe APL issued a statement saying that in light of the uncertainty surrounding the club, their licence will be placed in \"a conditional hibernation for Season 2025/26 in relation to their men's and women's teams.\"\nThe move means that men and women players, who were contracted to the club, are now free agents.\nThe APL will now proceed with a 12-team draw, eliminating a bye, which should be released soon. The competition starts on October 17.",
  "word_count": 640,
  "scraped_at": "2026-02-14T02:09:24.929579",
  "_text_extracted": true
}