{
  "article_id": "58155cb597e5",
  "url": "https://metro.co.uk/2025/10/21/diego-simeone-makes-arsenal-real-madrid-liverpool-claim-atletico-madrid-defeat-24488812/",
  "title": "Diego Simeone makes Arsenal and Real Madrid claim after Atletico Madrid",
  "date": "20251021T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Diego Simeone hailed Arsenal as the ‘best team’ Atletico Madrid have faced this season after his side were beaten 4-0 at the Emirates Stadium in the Champions League.\nThe European clash was goalless at half-time but Arsenal scored four goals in 13 second-half minutes to pull well clear of La Liga side Atletico.\nGabriel Magalhaes broke the deadlock on the hour mark, heading home Declan Rice’s inviting cross as Arsenal’s dominance from set-pieces once again proved crucial.\nFellow Brazilian Gabriel Martinelli doubled the hosts’ lead less than ten minutes later following a superb run from England’s Myles Lewis-Skelly.\nAlready in control of the game, two goals from Viktor Gyokeres capped off a brilliant night for the Gunners, who are joint-top of the Champions League after three matches.\nFollowing Atletico Madrid’s heaviest Champions League defeat, Simeone hailed Arsenal as the ‘best team’ his side have faced this season.\nThat represents huge praise from Simeone considering Atletico have already played Premier League champions Liverpool and La Liga giants Real Madrid this term.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAsked whether Arsenal are the best team Atletico Madrid have played this season, Simeone told Amazon Prime through a translator: ‘Yes, I would say the best team we have faced this season.\n‘They compete so well, their players run and run and they have quality all over the pitch. They deserved to win today and I want to congratulate them.\n‘It is a learning curve. We just need to keep improving. I thought we competed really well to begin with. From 60 minutes they were the better team and deserved to win.\n‘We have to put this behind us now and we need to focus in training on the things that went right and we need to make improvements as well.’\nAtletico defender David Hancko was also full of praise for Arsenal, telling UEFA: ‘It was a very tough game. You can expect this because they’re one of the best teams in the world right now – definitely.\n‘Personally I was up against Bukayo [Saka], which is always a big challenge. It was close at half-time, we were able to defend their set pieces and they’re the best in the world at them right now.\n‘In the second half, suddenly they went 1-0 up, from a set piece. Suddenly in five minutes it was 3-0. It just shows you how good they are, you cannot stop even for one second.\n‘We are really disappointed that we were not able to get a better result and now the 4-0 looks really bad.’\nArsenal boss Mikel Arteta, meanwhile, insisted he was ‘very happy’ after watching his team maintain their perfect start to this year’s Champions League.\n‘It was a tough match,’ he said. ‘After the goal they opened up a bit and it was a little easier for us to find the spaces.\n‘I’m very happy with the result. At this level in the Champions League you really need to step up and we certainly did that in every phase of the play. Very happy.’\nOn Gyokeres, who ended a nine-game drought without a goal with his brace against Atletico, Arteta added: ‘Delighted as he fully deserved it.\n‘The work-rate he brings to the team is outstanding. We value a lot of things that he does for the team and it was the biggest smile on his face today and look at his team-mates.\n‘Hopefully this is the start of some beautiful sequence for him.’\nArsenal’s £64m summer signing Gyokeres also spoke to the press after his Player of the Match performance in north London.\nThe 27-year-old had gone nine games without a goal before ending his drought with a welcome brace against Atletico.\n‘I am very pleased,’ he told UEFA. ‘They had some good opportunities but I think we controlled it overall.\n‘To score four and keep a clean sheet again is very good. We always keep going. We do the things right when we defend and when we get the chances we are extremely strong in taking those.\nMore Trending\n‘Both [my] goals were great. I try to do my best all the time and work hard, contribute with different stuff and the goals would have come sooner or later.\n‘We want to do well, we want to win football matches but there’s a long journey to go. We will take it game-by-game, even if that sounds boring.’\nArsenal’s next Champions League fixture is against Slavia Prague on November 4, while Atletico will look to bounce back against Union Saint-Gilloise.\nBoth teams return to domestic action at the weekend, with Arteta’s side facing Crystal Palace and Atletico travelling to Real Betis.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Jose Mourinho names ‘best player on the pitch’ as Newcastle United beat Benfica\nMORE: Paul Merson admits Viktor Gyokeres worry despite ‘massive’ goals in Arsenal win\nMORE: Atletico Madrid star slams key referee mistake in Arsenal defeat",
  "word_count": 884,
  "scraped_at": "2026-02-14T01:52:49.020283",
  "_text_extracted": true
}