{
  "article_id": "5828b27fde2b",
  "url": "https://www.namibian.com.na/ballon-dor-should-go-to-champions-league-winner-says-ronaldo/",
  "title": "Ballon dOr  should go to Champions League winner , says Ronaldo - Sport",
  "date": "20250607T141500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Five-time Ballon d’Or winner Cristiano Ronaldo said Saturday the individual honour should be awarded to a player who won the Champions League.\nSpeaking ahead of Sunday’s Nations League final in Munich between Portugal and Spain, the veteran said “trophies” should determine who wins the Ballon d’Or.\n“In my opinion, whoever wins it should be on a team that has won trophies. The Ballon d’Or winner should be in a team that has won the Champions League,” the 40-year-old forward told reporters.\nFirst awarded in 1956 by French magazine France Football, the Ballon d’Or is awarded to the player considered the best over the previous season.\nParis Saint-Germain’s 5-0 thumping of Inter Milan in the Champions League final last Saturday led to growing calls for Ousmane Dembele to win this season’s gong.\nSpain starlet Lamine Yamal’s superb display in Thursday’s 5-4 Nations League semi-final win over France however had some arguing the teenager should be awarded the Ballon d’Or, which would make the 17-year-old the youngest winner in its history.\nFrance coach Didier Deschamps backed Dembele for the award, saying “considering the season Ousmane is having, he deserves it and that’s all I wish for him”.\nAt a press conference in Stuttgart on Saturday, France captain Kylian Mbappe told reporters he backed Dembele.\n“Does anyone really need me to explain? Right now we’re talking about Lamine Yamal and Ousmane Dembele, but I’m voting for Dembele.”\nRonaldo said he “cannot tell you who deserves it” this season.\nRonaldo’s five wins is bettered only by Argentinian Lionel Messi, who has won the award eight times.\nThe duo had a monopoly on the award for a decade from Ronaldo’s first win in 2008 to his last in 2017.\nThe current holder is Spain and Manchester City midfielder Rodri.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 398,
  "scraped_at": "2026-02-14T02:09:11.428564",
  "_text_extracted": true
}