{
  "article_id": "582ec9c07718",
  "url": "https://metro.co.uk/2024/06/24/michael-olise-rejected-chelsea-transfer-two-reasons-ahead-bayern-munich-move-21094155/",
  "title": "Michael Olise rejected Chelsea transfer for two reasons ahead of Bayern Munich move | Football",
  "date": "20240624T181500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace midfielder Michael Olise rejected a move to Chelsea because Bayern Munich were able to offer Champions League football, according to reports.\nChelsea failed with an attempt to sign Olise last summer after activating a £35 million release clause in his deal with Palace.\nOlise opted to remain at Selhurst Park for another season but Chelsea retained their interest and made a fresh move to sign him this month.\nChelsea had been granted permission by Palace to hold talks with Olise and were ready to activate his release clause, which had increased to £60m after he signed a new contract last August.\nHowever, Olise rejected Chelsea for a second time, as well as a late approach from Manchester United, in order to join Bayern.\nAccording to The Telegraph, Olise was persuaded to join Bayern following talks with their new head coach, Vincent Kompany, who replaced Thomas Tuchel last month.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe report adds that the prospect of playing Champions League football was also a factor behind Olise’s decision – something which both Chelsea and United are unable to immediately offer.\nMore Trending\nHowever, Kompany is said to have played a key role in convincing Olise with his plans to improve Bayern’s style of play.\nMeanwhile, former Palace midfielder, Darren Ambrose, claims the club have already earmarked a replacement for Olise.\n‘I have reached out to one of my sources at Crystal Palace,’ Ambrose told talkSPORT at the weekend.\n‘They said the club has a replacement in mind who potentially can be better than Olise in the long-run.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Andy Cole reveals major concern over Manchester United transfer target\nMORE: Arsenal boosted as Chelsea drop out of transfer race for Stuttgart star Serhou Guirassy\nMORE: Dwight Yorke urges Manchester United to ‘rescue’ Euro 2024 wonderkid from Real Madrid",
  "word_count": 372,
  "scraped_at": "2026-02-14T01:57:18.885266",
  "_text_extracted": true
}