{
  "article_id": "58321ca45a66",
  "url": "https://www.gdnonline.com:443/Details/1371332/Indias-Mohun-Bagan-suspended,-fined-over-$100,000-for-refusing-to-visit-Iran",
  "title": "Football : India Mohun Bagan suspended , fined over $100 , 000 for refusing to visit Iran",
  "date": "20251218T103000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Indian club Mohun Bagan Super Giant have been banned from Asian Football Confederation competitions and ordered to pay more than $100,000 for refusing to travel to Iran for an Asian Champions League Two clash with Sepahan SC in September, the Asian soccer body said in a statement.\nThe AFC's disciplinary and ethics committee excluded Mohun Bagan from the next edition of Asian competition they qualify for, up to the 2027-28 season, in a decision made on Wednesday.\nThe Indian champions were also handed a $50,000 fine and told to pay an additional $50,729 for damages and losses incurred by the AFC and Sepahan. Mohun Bagan have also forfeited any subsidy for participating in the continental second-tier tournament.\nMohun Bagan were withdrawn from the competition after they refused to travel to Iran for the group stage match, citing lack of security assurances and medical insurance coverage in Iran, and their matches were declared null and void by the AFC.\nThe club had moved to the Court of Arbitration for Sport asking for the match to be relocated to a neutral venue, but CAS turned down their initial request.\n\"The players decided they can’t take this risk, where lives and their families' future are at stake. So we have to stand with them,\" a senior Mohun Bagan official told Reuters.\nMohun Bagan have five players from Australia, Spain and the United Kingdom, countries that have advised their citizens against travelling to Iran, the official added.\nThe club also did not travel to Iran last year for a match against Tractor SC scheduled for October 2, 2024, the day after Iran launched ballistic missiles towards Israel. Mohun Bagan were withdrawn from the tournament as a result.\nMohun Bagan are considering appealing against the suspension, he said.",
  "word_count": 293,
  "scraped_at": "2026-02-14T02:12:17.561214",
  "_text_extracted": true
}