{
  "article_id": "584c023c1488",
  "url": "https://www.france24.com/en/live-news/20230717-five-players-to-watch-at-fifa-women-s-world-cup",
  "title": "Five players to watch at FIFA Women World Cup",
  "date": "20230717T041500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Five players to watch at FIFA Women's World Cup\nSydney (AFP) – The top women's footballers on the planet will be in action when the World Cup kicks off on Thursday in Australia and New Zealand.\nIssued on:\nAFP Sport picks out five players to watch:\nAlexia Putellas (Spain)\nThe 29-year-old attacking midfielder is considered by many to be the best women's footballer in the world.\nWinner of the Women's Ballon d'Or in each of the last two years, in February she retained her crown as The Best FIFA's Women's Player for 2022, despite missing the second half of the year with a serious knee injury.\nBarcelona star Putellas is the first woman to reach 100 caps for Spain and they badly missed her creativity and goals at the 2022 European Championship, where they lost to eventual champions England in the quarter-finals.\nPutellas was among the Spanish players demanding change within the national side, but did not join in with 15 players who last year asked not to be called up, amid differences with coach Jorge Vilda and the Spanish football federation.\nSam Kerr (Australia)\nIf the co-hosts are to go far at the World Cup they will need Chelsea forward Kerr firing on all cylinders.\nThe 29-year-old Australia skipper made her international debut aged just 15 and has played over 120 times for her country, averaging a goal every other game. She scored five times at the 2019 World Cup.\nHer numbers are just as impressive at Chelsea, hitting 29 goals in 38 appearances this season.\nKerr is such a big name at home that she was Australia's flag-bearer at the coronation of King Charles.\nMegan Rapinoe (United States)\nShe needs little introduction as the most instantly recognisable player in women's football.\nThe attacker has played 199 times for the United States, scoring 63 goals and making 73 assists. She has won the World Cup twice. Now Rapinoe plays in the United States for OL Reign.\nShe is set for retirement at the end of this season and is something of a fading force at 38, but she remains the face of women's football for the casual fan.\nOff the field, the openly gay Rapinoe is outspoken on a number of issues that go beyond sport, including advocating for LGBTQ rights.\nKeira Walsh (England)\nEngland's hopes of winning the World Cup for the first time have taken a hit with the injury loss of several key players, putting even more onus on midfielder Walsh.\nBarcelona snapped her up from Manchester City for a reported 400,000 pounds ($508,000) last September, a world record for a woman footballer.\nWith her passing, reading of the game and ability to win the ball back, Walsh was instrumental in Sarina Wiegman's England winning the Euro on home soil in 2022.\nShe was named player of the match when England defeated Germany 2-1 in the final at Wembley in extra time.\nAda Hegerberg (Norway)\nThe Norwegian was the first winner of the Women's Ballon d'Or, in 2018, and is a prolific striker with leading French side Lyon.\nHer Norway career has been stop-start, however. She withdrew from the international scene in 2017, citing concerns over the inequality of treatment given to men's and women's teams by the Norwegian federation. She only returned last year.\nThe 28-year-old forward has also been dogged by injuries.\nBut when on form and firing she is one of the best players in the world, and averages more than a goal a game for her club.\nShe is the all-time top scorer in the UEFA Women's Champions League with 59 goals.\n© 2023 AFP",
  "word_count": 603,
  "scraped_at": "2026-02-14T02:24:50.287751",
  "_text_extracted": true
}