{
  "article_id": "5851907adc8d",
  "url": "https://www.bbc.co.uk/sport/football/65008212",
  "title": "Arsenal 4 - 1 Crystal Palace :  Fearless Gunners have a beautiful attitude  - Martin Keown analysis",
  "date": "20230320T053000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal 4-1 Crystal Palace: 'Fearless Gunners have a beautiful attitude' - Martin Keown analysis\n- Published\nI loved hearing Bukayo Saka say Arsenal don't fear anyone when we asked him what he thinks about the Gunners' title run-in on MOTD2.\nIt's a beautiful attitude for any side to have, and it's especially important in the situation that Saka and his team-mates are in now, eight points clear of Manchester City at the top of the table with 10 games to go.\nI know from my own experiences as an Arsenal player that when you reach this stage of the season with a chance of winning the Premier League, then your eyes are drawn straight to the fixture list. The finish line is in sight and you kind of go into countdown mode, working through your remaining games.\nWhen we spoke to him after the Gunners beat Crystal Palace on Sunday, we asked Saka about their remaining fixtures - but he threw it back at me and asked me what I thought.\nI said there were a lot of tough games coming up, especially away from home. They are probably going to have to win at Anfield and St James' Park, and their trip to the Etihad is obviously massive, so there is no time to relax, even with the points cushion they have got. They have to keep going until it is done.\nHe was like, 'Yeah I'll take that answer', and I am not surprised that he is thinking the same way we did when we won the title under Arsene Wenger in 1998 and 2002, after fierce battles with Manchester United each time.\nWinning run reminds me of past glories\nArsenal will have to hold off City's challenge to take their crown, and everyone can see that Pep Guardiola's side are beginning to click and move up a gear. Erling Haaland is a goal machine, and he isn't missing at the moment.\nI have heard some absurd things about Haaland and how he is somehow making City weaker, even as recently as their draw with RB Leipzig at the end of last month. But I've not heard anyone suggest that this week. We've all seen how deadly he is.\nIt is obvious why he is doing so well - because City have so many intelligent players that they were always going to find a way to feed him. But so far, whatever City have done, Arsenal have found an answer, firstly to maintain their advantage and now extend it.\nCity went top when they beat the Gunners at Emirates Stadium five weeks ago but Arsenal have hit back with six successive league wins, which is just an incredible response.\nIt reminds me of when we won 12 successive games under Wenger from the start of February to clinch the title in 2002, and also the 10 wins in a row from March onwards that took us to glory in 1998.\nWe came from behind then, but this situation is really no different despite Arsenal having the advantage this time. It still feels like they are going to have to win all of their games, apart from their trip to City.\nAgain, that reminds me of 2002, when we beat our nearest rivals United at Old Trafford in the penultimate game to clinch the title. Our thinking beforehand was that we just needed to not lose, and we could wrap it up at the weekend. But Sylvain Wiltord's goal meant we went one better and actually won it there.\nYou wouldn't dare to dream that Arsenal could do that at the Etihad. But, as Saka told us, they believe they can beat anyone. And on their day I think they can, which is what has helped to get them into this amazing position in the first place.\nIt is going to be fascinating to see how the title race unfolds from here, but I would say Arsenal have done all they can do until now.\nThere is still so much work left, but they have got the points in bag to build up this lead and City will have to deal with some fixture congestion in order to catch them while they try to win the Champions League and FA Cup too. Basically, this lead might still not be enough, but Arsenal have put the defending champions under the maximum possible amount of pressure.\nSaka keeps delivering goals and assists\nCompared with some of Arsenal's forthcoming games, beating Palace at home was probably seen as being relatively simple. But that has not been the case against the Eagles in recent years - they hadn't lost on any of their previous four visits to the Emirates.\nThis time was different, and as well as the result, Arsenal's performance was the perfect way for them to sign off for the international break.\nI made a point of praising Gabriel Martinelli when I spoke about the game on MOTD2 because he missed a penalty in the shootout against Sporting Lisbon in midweek but did not show any kind of hangover from that Europa League defeat.\nMartinelli started the game so well, and was a real driving force with his determination down the left-hand side. In front of goal, he just gets better and better, and I think of him as a natural finisher when he gets into those central areas like he did to score the opener against Palace.\nAnother Arsenal player who had some disappointment this week was Ben White, who wasn't named in the England squad, and he played like he had a point to prove.\nWhite's link-up play with Saka down the right is sensational and there always seems to be a chance at the end of it too.\nSaka gives so much to this team that I was joking with him afterwards that Gareth Southgate should give him a rest in these next two England games. We don't want him injured now.\nHe has started every league game this season and, whether it is a goal or an assist, he keeps on delivering. Every Arsenal fan is hoping for more of the same in the final two months of the campaign.\nHow Arsenal are kings of the capital\nIt has gone under the radar a bit, but there is another reason why beating Palace is something for Arsenal to shout about.\nThey became the first side in 135 years of English Football League history to win nine London derbies in a single league season. So far they have only dropped points in one, in last month's draw against Brentford, which is some record.\nYes, there are more derbies than usual this year, but you cannot underestimate how difficult those games are. That makes things harder for Arsenal, not easier.\nI know from playing in them that it is not just the north London derby with Tottenham that is fiercely contested. You have local rivals from the east, west and south of the city too.\nIt means a hell of a lot for them to beat you, and they are always waiting for their opportunity, especially in a season like this where Arsenal are getting lots of plaudits.\nThis season, almost a third of Arsenal's league games - 12 out of the 38 - are derbies, which is a huge chunk. It makes it relentless, because there is always one on the horizon - in fact, there are two still to go.\nSo it's not just, say, the Liverpool and City fixtures that stand out for me as being tough in Arsenal's run-in. The games against Chelsea and West Ham will be horrible too.\nNeither of those teams are having great seasons, but they know they could stop Arsenal from winning the title. Whatever else they are playing for, that is all the incentive they need.\nMartin Keown was speaking to BBC Sport's Chris Bevan.\nOur coverage of the Gunners is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 1343,
  "scraped_at": "2026-02-14T02:19:40.792874",
  "_text_extracted": true
}