{
  "article_id": "58585b397379",
  "url": "https://www.dailymail.co.uk/sport/football/article-11657233/Every-word-Pep-Guardiola-said-rants-Arsenal-Man-Utd-Man-players-fans.html",
  "title": "Every word Pep Guardiola said in rants about Arsenal , Man Utd , Man players and fans",
  "date": "20230120T120000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola's THREE extraordinary rants in full: Arsenal 'having fire' after 'two decades', telling journalists 'prepare better', asking WHEN Man United last won the title, and attacking 'happy flower' stars and fans\n- Pep Guardiola launched into an extraordinary broadside aimed at his players and Manchester City's supporters following their 4-2 win over Tottenham Hotspur\n- City fought back from two goals down to stay in touch with leaders Arsenal\n- But he then questioned the 'passion' and 'guts' of his players after the match\n- Guardiola said his team 'lacked fire' and called for more backing from the fans\n- Here is the transcript of Guardiola's TV interviews and press conference\n- READ: Micah Richards says Guardiola's interviews showed he has lost patience\nPep Guardiola certainly didn't hold back in a scathing attack on his players and Manchester City's supporters following their comeback win over Tottenham.\nDespite seeing his team show fighting spirit to battle back from two goals down to win 4-2 on Thursday night, keeping up the pressure on leaders Arsenal, Guardiola was far from impressed.\nFirst of all, Guardiola admitted in his post-match Sky Sports interview that his City team are 'far away' from where they were and demanded more passion from his players.\nPep Guardiola launched into a huge rant at his players and the Manchester City supporters despite their come-from-behind 4-2 win over Tottenham on Thursday night\nRiyad Mahrez scored a brace as he inspired City's comeback win - but Guardiola wasn't happy\nGuardiola then went into another rant talking to Jan Aage Fjortoft on Norwegian TV channel Viaplay.\nThis continued when Guardiola sat down to speak to the written press afterwards, as he launched into an 11-minute tirade which offered a fascinating glimpse into his mindset.\nHere's every word from Guardiola's interviews after Thursday night's game.\nINTERVIEW ON SKY SPORTS\nREPORTER: What did you say at half-time because whatever it was worked?\nGUARDIOLA: Do you believe that?\nREPORTER: It's a question.\nGUARDIOLA: You have to prepare better [smiles].\nREPORTER: People keep telling me that.\nGUARDIOLA: We cannot deny how happy we are but we are far away from the team we were. Not in terms of play because we played good in the first-half but there are many things in terms of competitiveness, in terms of what we have to do and there are many things that we are far away, far away. Rico Lewis concedes four fouls and, of course, no yellow card because it's Rico Lewis and we don't react. So, we give the first goal and the second goal it's ridiculous. We play short and we play because my manager told me how to play like this and have to do this. But there is nothing from the stomach, from the guts. We were lucky, but if we don't change we are sooner or later going to drop points.\nGuardiola felt that his team were lacking 'guts, fire and passion' in their performance\nREPORTER: So what are the things that are missing? Guts, for one of the things you're talking about?\nGUARDIOLA: Passion, fire and desire to win from minute one. It is similar for the spectators, our fans. They are silent for 45 minutes.\nREPORTER: Then they booed at half-time…some of them.\nGUARDIOLA: We played good. We were losing but not because we played bad. We played good, we had chances, expected goals from Tottenham was 0.89, so we were better. They booed because we were losing. But maybe it is the same like our team, we were so comfortable winning four Premier Leagues in five years and that is why we… and after we scored a goal, they react but that is not the point.\nREPORTER: Do you think from players and spectators maybe four titles in five years, a load of success, lots of success, maybe a little bit of the fire has gone out of everything?\nGuardiola was full of praise for his Tottenham counterpart Antonio Conte after the match\nGUARDIOLA: Definitely. Otherwise we would not concede the goals we have conceded in every single game. We need them. When we score the goals, congratulations, but we need them. Today, we were lucky but the day after we will not be lucky.\nREPORTER: So how do you get that back? The fire, the guts you are talking about…\nGUARDIOLA: That is my duty, my job. I want my fans back, I want my fans in here. Not my away fans, my away fans is the best. My fans here, the real ones, to support every corner and every action, support it, because we play. We cannot expect [to win] because Tottenham is one of the toughest opposition I ever faced, from Antonio [Conte] in how they defend, how good they are organised, how good they make the build-up, how they link with Harry Kane, [Dejan] Kulusevski, Son [Heung-min], even [Rodrigo] Bentancur in the other one. Incredible switch of plays on the opposite side, the threat they have in every single moment is incredible. I could not expect to concede like we did, so I don't know then, but sometimes you need the game we have done, but after we got better.\nREPORTER: In some ways, do you think the players need to give the spectators more? The guts and the fight are not there…\nJulian Alvarez struck City's first goal moments after the restart to begin their fightback\nGUARDIOLA: We have to do it, but everyone is like relaxed. You know. But the Premier League doesn't wait, we have an opponent in Arsenal, they have the fire.\nREPORTER: Do you think they look like a team that hasn't won the Premier League for a long time and you look like a team that has won four in five?\nGUARDIOLA: Two decades.\nREPORTER: I know.\nGUARDIOLA: Without winning the Premier League. Every player knows they will be I history like we felt when we won the first Premier League and the one where we broke all the records, then the one back-to-back, two times back-to-back. In life and everything we have the fire inside, it's not, we don't have to ask anything, I just explained the reality that everything is so comfortable. Opponents don't wait, the opponents are there. Are we down there? No, we are second in the league, so we are not 20 points behind.\nErling Haaland found the back of the net with a header to restore City onto level terms\nREPORTER: But it is not my questions, is it, you are not happy with your team?\nGUARDIOLA: Of course I'm not, I don't recognise my team. My team always had passion, had desire in everyone, and run and everything.\nREPORTER: And obviously you have told this to them in the dressing room?\nGUARDIOLA: I don't have to tell you what I said.\nREPORTER: Come on, tell us!\nGUARDIOLA: No, absolutely not.\nVIAPLAY INTERVIEW\nJAN AAGE FJORTOFT: Well boss, congratulations on your birthday yesterday and on your win of course. When you are 2-0 down more or less out of the blue with two big chances with Erling [Haaland], try to explain to the fans, the supporters, what is going through your mind when you're going from the bench into the dressing room. Change players, change tactics? What do you say?\nGUARDIOLA: You're right, we were not playing bad, the expected goals from Tottenham, one of the best teams, was 0.89 but we gave them. We gave them today, we gave them to opponents many, many times. We don't have passion, we play good but we don't have passion. We don't defend ourselves. Rico Lewis concedes four fouls and nobody defends him. Yeah, we play good, yeah, it was good, but we are far away. Right now today, I realise. Today we are winning 4-2 but this season, we change or we are not going to win anything.\nFJORTOFT: So what are you going to change?\nGUARDIOLA: That is my duty.\nFJORTOFT: Where do you start?\nGUARDIOLA: For the future?\nFJORTOFT: To win the title…\nGUARDIOLA: Of course, four Premier Leagues in five years. For Arsenal it is two decades, don't win the Premier League. Two decades. There is no one playing except Gabriel [Jesus] and Oleks Zinchenko that won the Premier League. They kill every action of the game, we don't have that. Four Premier Leagues in five years, we don't have that. The two goals we gave them is because we don't have what you have to do to win it. We change, but not just this competition - the FA Cup, the Champions League, we don't have an option. No chance.\nFJORTOFT: So in bad English, you have a lack of 'balls' in those situations?\nGUARDIOLA: No, it is not a lack of balls. I don't believe the ball make a solution. It is love for what you do, it is guts, it is stomach, these kind of things, we don't have it.\nJulian Alvarez (right) was one of several players name-checked by Guardiola in the interview\nFJORTOFT: What will you do to get it? For the rest of the season, because there are some games coming up now…\nGUARDIOLA: We will see. Now we will put in some effort and we will see. Try to put it in the players. I need that passion from Julian [Alvarez], from Rico Lewis, Nathan Ake, I need that, we need that. Every duel is winning, every action is the last action of their lives. Otherwise, against this Arsenal or United - for example, it is not two decades but how many years United don't win a Premier League? I was in Germany or in Spain when they won the last one and they have to do it, that is normal. But we have to do it again, this is the deal.\nFJORTOFT: If the passion is lost, where did it go? When did you lose that passion?\nGuardiola asked when Manchester United last won a Premier League title - it was back in 2013\nGUARDIOLA: The stadium is comfortable, everyone is comfortable, it's fine, we won, we are nice. In October or November we should win the league and everything. You know. Now they cannot say we are the team that spends the most money because the last five years, spend net, we are the fifth or the sixth here in England, 12 or 13 in Europe. So you cannot say that. They have to change the argument but we have to find ourselves. Do you think I did something at half-time, I put the reality to all of us. People will say, 'nah because Kevin [De Bruyne] didn't play, Kyle [Walker], Joao [Cancelo] don't play, Phil [Foden] don't play, Aymeric [Laporte] don't play, Ruben [Dias] don't play, Bernardo [Silva] don't play, that is the reason why. With the other ones it is the same, when they start to realise that we will make a step forward for the rest of the season.\nPRESS CONFERENCE\nWhy have you criticised the players?\nGUARDIOLA: I'm incredibly happy. But without change we aren't going to win anything. I said I don't care if we don't win anything, I said the last years I said I have to see my team, you have to have passion for something.\nIf our fans are comfortable, are you going to tell me we played bad in first half? Absolutely not. Against that team plays a good build-up, what a striker Harry Kane, Kulusevski, Son, even Bentancur, [Pierre-Emile] Hojbjerg, the wing-backs.\nThe organisation they have in many things. I'm pretty sure Antonio Conte wouldn't agree with me but they are a fantastic team. We didn't concede anything. At the beginning of the game, you have to see something is wrong and react. It's too late.\nWe have the problem that we have four Premier Leagues in five years and Arsenal have two decades without nothing. Gabriel [Jesus] and Oleks Zinchenko, they didn't win every Premier League but every game, every ball, every action. Every time is there. We miss it, we don't have it.\nRico Lewis concedes four fouls, who defends him? I know it's not a yellow because he's 18 years old. Who defends him? No-one.\nGuardiola shouts in the direction of Jack Grealish as a chance goes begging on Thursday night\nYou think I said anything special at half-time or changed players? I know I don't play Joao [Cancelo] Kyle [Walker], Ayme [Laporte], Bernardo [Silva] or Kevin [De Bruyne]. It's not about that, with them it's the same. Play bad? No. We always play good.\nThe quality that we have, we do it. It's not about that, it's about you have to lose something to do it. That's why now I'm happy but they prove me. We give the goals, today it's Eddy [Ederson] or Rodri.\nThe other day will be a full-back or a central defender. It's not about that, it's about our fans. I'm here. Just listen to the Spurs fans.\nCan you get that passion back?\nGUARDIOLA: Of course we're going to come back, we have to. I have to move the team.\nI want the passion from Julian [Alvarez], I want it from Rico, from Nathan [Ake]. I want this every ball happen. 1-0, free kick, Rico and Manu [Akanji], all the players up front, nine players to find and they play short. You have to read that.\nGuardiola said that Arsenal are more motivated to win their first league title in two decades\nAfter, the manager has to tell them this? You think I said something tactical at half-time? Why should we change? We were playing good. It doesn't matter the substitutions, it's not about that. It's that right now we don't have it.\nWho was complaining?\nGUARDIOLA: Not the fans, they come here and we have to give them. They expect 'Oh, we're Manchester City, we have to do it'. No, we don't have it right now.\nThe tendency of the human being when you've won a lot is 'Ah, I should do this, I should do that'. No, you have to work.\nYou have to put fire there - in every ball, in every action, in every situation. It's not about being better or not. It's 'Come on, let's go'. It's normal to be in a situation behind another team.\nWe have been in this position a few times, behind Liverpool, then let's go. And now, we were lucky today. I didn't expect to come back at half-time against Tottenham when they were 5-4-1 and aggressive.\nBentancur, Hojbjerg fouls and every action go to the referee five, six players and defend each other. What do we expect? It's football, sometimes you don't know why we come back.\nAt 3-2 I said to my staff 'We are winning 3-2 after the way we played?'. Yeah, it happened. If we want to do something we have to come back.\nArsenal, who are managed by Guardiola's former assistant Mikel Arteta, have a healthy lead\nWhat are the reasons behind the drop?\nGUARDIOLA: This is a challenge. I want it, this is what I expect. I see the team do this. They are the details, it's not about the way we play.\nThe quality of the players, are you going to judge the quality of the players? I love them, they are fantastic players, all of them. But they are the details. They come from the success we had in the past.\nPeople say it was not a success because we didn't win the Champions League - bull****. We won a lot. In this country, two back-to-back [league titles] and the consistency against this Liverpool. What a success, this is normal.\nBut we have to look at ourselves, it is not enough. I said to Erling [Haaland] - 'Erling, runners, you cannot drop because of runners'. One before half time. One. The quality is there, that's why we bought it. I want to help you. I want you to go there. One [run]. I want more.\nI want to score 50 goals. I want more from everyone. It is not about performing well or bad. It is Nathan [against] Kulusevski - what a player. Against [Mohamed] Salah in the Carabao Cup in the 10 duels, he won nine. That doesn't make the highlights.\nGuardiola spoke about Rico Lewis not receiving a yellow card despite committing four fouls\nBut without Nathan right now we can't play good. Rico Lewis, 19 years old - why we don't play this one or the other one? Rico, look at the Carabao Cup against Chelsea, in Leeds, the most aggressive team in the Premier League - they don't give you two seconds.\nChelsea [in the league], second half he arrived and changed the game. Why? Because 'I want to live in this job and world. I want a better contract and to win Premier Leagues I have never won'.\nJulian will run and that's what we come back to, everyone. We need everyone and today we don't have it. Football is not just about playing good or bad or having skills. Sometimes you need to have something inside all of us.\nChallenge of catching Arsenal\nGUARDIOLA: The players don't realise, but they want it. They train really good but there is something which is here in the clouds which you cannot express in a million details, and we don't have it.\nI see the Arsenal games and they do everything good - that's why they're in front and they deserve it. I said yesterday and I say this after 4-2, and I said your colleagues. I am incredibly happy and I will sleep tonight like a baby, but it's not about that.\nGuardiola wasn't happy with a perceived lack of noise from the crowd at the Etihad Stadium\nI have experience. In 14 years I won 11 leagues. That's a lot. It means [being there] every day and seeing things that you cannot see because you are not there. It's not one single player, everyone is there.\nIf I said it was this 11 it would be easy - I would play this 11 all the time. But if everyone realises it, we will come back for here or for the future. Our fans have to push us, demand more, have to shout: 'Come on guys, I know how good you are, show us again'.\n'Ah well we come, score a goal. No. It cannot be 2-0 down to react'. Today we were lucky. Nine times out of 10 you don't come back. We are able to do it, we came back at Aston Villa and many times, but we are not able to do it every time.\nWhy are you telling us this now?\nGUARDIOLA: I want a reaction for all the club, the whole organisation - not just the players, the staff and everyone. We're a happy flowers team. Happy flowers organisation, ah it's good. No, I don't want to be a happy flower.\nI want to beat Arsenal. But if we play in that way Arsenal will destroy us. Arsenal will beat us. People say 'Pep doesn't want to win the Premier League'. Of course I want to win the Premier League. I want to see my team. This is how I want to do it.\nMost watched Sport videos\n- Disgusting drink act caught on camera at ICC T20 World Cup\n- Tiffany Salmond dazzles in red bikini at Bondi Icebergs\n- IOC President in tears after Ukrainian athlete is kicked out\n- Viral Man United fan reacts to draw extending 493-day streak\n- NBA player makes long-awaited debut after battle with cancer\n- Team USA skier Breezy Johnson gets engaged after crash\n- Super Bowl Champ wears Sam Darnold t-shirt with middle finger up\n- Aussie snowboarder Scotty James shows off his dance moves\n- Has VAR broken football? Arsenal fan grills Mark Clattenburg\n- Alisa Camplin provides an update on Cam Bolton\n- How Deontay Wilder CAN recover from Tyson Fury losses\n- Stephen A. Smith calls Trump's criticisms of Bad Bunny valid",
  "word_count": 3348,
  "scraped_at": "2026-02-14T01:53:21.840963",
  "_text_extracted": true
}