{
  "article_id": "585cb7a0db6c",
  "url": "https://arseblog.com/2023/10/jesus-out-who-gets-the-nod-up-front-against-sheffield-united/",
  "title": "Jesus out , who gets the nod up front against Sheffield United ? | Arseblog ... an Arsenal blog",
  "date": "20231028T043000Z",
  "domain": "arseblog.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Morning all.\nA quick preview for you ahead of our game against Sheffield United this afternoon. The injury news was fairly significant, with both Gabriel Jesus and Thomas Partey being ruled out for a few weeks. The former is due to a hamstring strain picked up during our win over Sevilla on Tuesday, the latter an issue from training on Monday.\nMikel Arteta spoke about how they were cautious with Partey for the Chelsea game, planning to play him in Spain, but those plans were scuppered:\nWe decided not to load him on the first game to play him in Seville, and then that happened in training. So it’s difficult – you try to prevent it, but him getting injured against Chelsea you would have said we had rushed him. But then you rest him and he gets injured. It’s things that can happen in football.\nThings that happen to Partey with too much frequency, and as I wrote yesterday, that really should inform our plans going forward. As for Jesus, Arteta was perhaps a bit more optimistic about his ability to return sooner, saying:\nWith Gabby I cannot give you any time frame because he always surprises us, but there is something there.\nThe absence of the Brazilian feels more impactful than Partey though – especially after his incredible display with a goal and an assist in the Champions League, and the manager has a bit to think about when he picks his team for today.\nDoes he go with Eddie Nketiah who has been given the nod this season when Jesus has been absent, but who has just two goals in his last twenty-six appearances? Will it be Kai Havertz who gives us a different option up there, but he too has found goals hard to come by since his move from Chelsea in the summer? Or do you go with Leandro Trossard up front, with Havertz an option from midfield, knowing the Belgian has the knack of scoring and assisting since he came in January?\nThere are other options in midfield too, of course. Emile Smith Rowe could slot into the left 8 position, Fabio Vieira may come into contention too, and given that we’re at home, this is the kind of game where you don’t necessarily need the security of someone like Jorginho at the base. Declan Rice can do that job, allowing you to get more attacking threat on the pitch.\nToday’s opposition are beset with injuries, and have yet to win a game this season since their promotion. On paper it looks one way, in reality a fixture like this can often be a potential banana skin. If Arteta rotates, he might be accused of taking them lightly, but in his pre-game press conference, asked how he prepares his players for a game against a team we’re expected to beat, he said:\nEverybody has been on their toes. When they walk in that door, they know what is coming and what to expect. I was very clear with them.\nThey [Sheffield United] are fighting for their lives … and it will be a tricky game.\nEarly goals haven’t been a feature of our season so far, but it feels today that would be very useful against a team who are going to pack the box, sit deep, stay organised, and make it difficult for us to break them down. Even without Jesus, we have plenty of quality in the attacking areas, so let’s hope we can take the points we need with minimum fuss.\nThis is Arsenal though, so I expect some fuss. I’m heading over for this one, looking forward to seeing the team for the first time this season, and to catching up with some of you lot. See you in the usual places, or just around.\nFor now, I’ll leave you with our preview podcast on Patreon. Take it easy.",
  "word_count": 649,
  "scraped_at": "2026-02-14T02:25:00.748274",
  "_text_extracted": true
}