{
  "article_id": "58a217f6b02b",
  "url": "https://theathletic.com/5332177/2024/03/14/ben-white-england-arsenal-future/",
  "title": "The Ben White puzzle : Why Arsenal defender has turned his back on England",
  "date": "20240314T190000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Editor’s note: This article was first published on March 14 but was updated on March 17 to reflect extra information that has been passed to the authors.\nIt is always slightly jarring for followers of the England national team when a footballer at the peak of his profession weighs up the pros and cons of playing for his country and decides, ultimately, that it is not for him.\nAdvertisement\nAt this stage of Ben White’s career, however, it did not feel like a monumental surprise when Gareth Southgate explained that the Arsenal defender would rather take no part in England’s final two matches before the squad for this summer’s European Championship is picked.\nNobody within the Football Association should have been hugely surprised either given the circumstances that led to White flying home from the World Cup, the day after England’s 3-0 win against Wales, for what the governing body described as “personal reasons”.\nThe truth is that White had found it difficult being out of the side, not even necessarily the second-choice for his position, and struggling to settle in the kind of environment, a long way from home, that once led Steven Gerrard to describe tournament life with England as a “five-star prison”.\nWhite flew back from Qatar to resume mid-season training with Arsenal — “We back baby,” he wrote on Instagram, accompanied by a smiling emoji – and has remained out of the England setup ever since. Fifteen months on, many people with knowledge of the situation believe it will remain that way now he has, in effect, ruled himself out of Euro 2024, relaying the news via a telephone call from Arsenal’s sporting director, Edu, to his counterpart at the FA, John McDermott.\nSouthgate, in other words, heard second-hand that White had no desire to be called up given his experiences with England, in particular at the last two major tournaments, had not been ones he looked back upon with great fondness.\n“Look, it’s absolutely the question you should ask,” said Southgate, having announced his 23-man squad for England’s friendlies against Brazil and Belgium. “Clearly, on form, I can’t sit here and say he doesn’t deserve to be in. John McDermott had a call from Edu last week to say Ben didn’t want to be considered for England squads at this time.\nAdvertisement\n“That’s a great shame. He’s a player I really like, a player we took to the Euros when he was at Brighton (in 2021), a player we took to the World Cup (2022). I spoke to him, post-Qatar, because I was keen to pick him but there was clearly reticence on his side. I don’t know fully why that is, but I have to respect that. I want to leave the door open for him because he’s a good player who can make a difference for England, but he’s not available to us.”\nSouthgate chose his words carefully, but it was clear he was struggling to grasp why the player in question, or any player, would not want to be involved, particularly so close to this summer’s tournament.\nNor is it absolutely clear from White’s side why he was apparently not willing to be talked around almost two years since he earned his fourth, and potentially final, cap in a 3-0 win against Ivory Coast at Wembley.\nHe can expect criticism – that is just the nature of the beast with England. Some will choose to see White’s position as near-treachery, but this is clearly not a snap decision and, if there is one thing we ought to know about White by now, it is that he follows his own mind.\nHis debut for England came in a friendly against Austria in June 2021, entering the play as a 71st-minute substitute. “Something you dream of as a kid,” he wrote on X, formerly Twitter, that night. “Loved every minute of it!!”\nSomething you dream of as a kid. Loved every minute of it!! @England pic.twitter.com/aybA6jWBIr\n— Benjamin White (@ben6white) June 2, 2021\nA first start followed four days later against Romania. England won both games 1-0, heading into a European Championship that ended with Southgate’s team reaching the final, losing in a penalty shootout against Italy.\nBut White did not get a single minute of action in that tournament and that is harder, perhaps, than many people will understand.\nAdvertisement\nWhite was on the fringes again in the World Cup, watching England’s group games against Iran and the U.S. as an unused substitute and missing out against Wales due to illness. There were some difficult moments in the build-up to the U.S. match.\nAt one team meeting, Steve Holland, England’s assistant manager, is understood to have made a comment in front of the other players and staff about White’s admission in an interview that the player did not like football. White, it is said, did not appreciate it being brought up in front of everybody, even in a lighthearted way. He and Holland are said to have spoken afterwards, however, to clear it up.\nHolland has denied reports that there was an angry bust-up sparked, it was alleged, by White not being seen to take preparations seriously enough. Holland also denies that he berated White in any way or that there was any issue between himself and the player. The two men greeted each other every day, shaking hands and talking regularly. It is also worth pointing out there was nearly a full week before the pre-USA team meeting and the decision being taken, on both sides, that White should head home.\nNone of the relevant people have ever discussed what was said between Southgate and White during the final meeting when that decision was made.\nEngland had been in Qatar for 15 days and had qualified for the knockout stages. The FA asked for “the player’s privacy to be respected”. Arsenal put out a social-media message offering their support — “We’re all with you, Ben” — and, judging by White’s Instagram post, he was glad to be home. He was training with Arsenal and preparing for a friendly against Milan by the time England lost to France in the quarter-finals.\nFor Southgate, a difficult situation is made easier by the fact England are hardly short of talented right-backs. His latest squad includes Kyle Walker and Joe Gomez. Trent Alexander-Arnold and Kieran Trippier would have been automatic picks but for fitness issues, whereas Reece James would also be in Southgate’s thinking but for his recurring injury problems.\nIt is never ideal, though, when a player says no, especially when that player is arguably in the best form of his life.\nAdvertisement\nOne eulogy in the online version of The Gooner, the long-running Arsenal fanzine, described White earlier this week as “a football supporter’s dream”.\n“He rarely drops less than a 7/10 performance,” wrote the author, Thomas Dow. “It’s a challenge to think of many attacking players who have got the better of him. He’s classy on the ball, but firm in the tackle. Most importantly though, he gives everything he can for the badge.”\nAt 26, White has reinvented himself as an overlapping full-back. He might not have the passing range of Alexander-Arnold or Trippier, but he does frequently break the opposition lines, whether it is trying to slip in Bukayo Saka or making his own runs to get behind the opposition defence and send over right-sided deliveries. White has more league assists this season (four) than Raheem Sterling at Chelsea or Jarrod Bowen of West Ham. Or, indeed, Gabriel Jesus and Kai Havertz, two of Arsenal’s attackers.\n“He’s clearly playing very well and has been for a long time,” said Southgate. “But he’s not the first player who, at certain times, hasn’t wanted to be available for selection. I’ve always tried to protect those players because I always want the door to be left open, even though on lots of those occasions I’m the one who gets it in the neck for not picking them and people don’t know the reasons.”\nSouthgate, a fierce protector of his own, went on to specify that whatever happened in the World Cup between White and Holland was, in his opinion, overblown and there was no direct line to the current situation. Whether White feels the same remains unclear, but Southgate was emphatic.\n“There’s no issue between us and there was never any issue with Steve Holland. That has been mentioned in articles and I don’t like that. People can talk about me and I have to accept that things get said that are false, about me. For whatever reason in this role, you have to stomach that. But I’m not prepared for that to happen to a key member of my coaching team. That is not the reason Ben is not available for selection.”\nFair enough. The unfortunate part for White, however, is that he will probably never be allowed to forget his admission in an old interview that, if he is not playing, he has no real interest in football. The latest developments will reinforce White’s image as being wired differently to your average footballer.\nAdvertisement\nA perception has grown that, if White does not like watching football, he cannot really care. But is that fair?\nAnybody who has watched White play in Arsenal’s colours should be able to recognise his competitive instincts. It matters to him greatly, otherwise he would not be playing for a side that is taking in the view from the top of the Premier League and has just made it into the Champions League quarter-finals.\nHe has just signed a new contract, approaching what should be the prime years of his career. He seems happy, playing for the best Arsenal team in years, and nobody questions his £50million ($63.7m) price tag in the way they used to. Not everyone will understand his reasons and Southgate, a fierce patriot, might find it hard to fathom, too, but the manager should also know from his own experiences that tournament life for a fringe player can be more challenging — and less fulfilling — than many people realise.\n“The very first squad I picked, I had a player call me and say, ‘Thanks but no’,” said Southgate. “You just have to move on. That’s the reality of the job. There are lots of things that are outside of your control. You are not always able to share the details of those things, but that’s the way it has to be.”\n(Top photo: Shaun Botterill/Getty Images)",
  "word_count": 1753,
  "scraped_at": "2026-02-14T02:10:47.914549",
  "_text_extracted": true
}