{
  "article_id": "58d2ffd2efb7",
  "url": "https://theathletic.com/4060218/2023/03/02/real-madrid-barcelona-rivalry/",
  "title": "Barcelona and Real Madrid , hated rivals who need each other more than ever",
  "date": "20230302T071500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on January 9, 2023\nIt’s a frosty December morning in Madrid. But inside its swish Hotel Ritz, there is the warm buzz of money and power.\nReal Madrid president Florentino Perez and Barcelona counterpart Joan Laporta enter together, just as the breakfast event at which they are the star guests is about to begin.\nAdvertisement\nThe diminutive pair of 75-year-old Perez and Laporta, 60, are guided to their seats under carved ceilings and glass chandeliers by the much taller Bernd Reichart, CEO of A22 Sports Management — the company promoting the stalled European Super League project.\nNeither Perez nor Laporta are here to say anything but to be seen offering joint support as Reichert claims the Super League is “not dead”, despite a European Court of Justice provisional ruling the day before appearing to suggest just that.\nThe whole event has been designed as a public demonstration that the two El Clasico giants remain firmly allied together against mutual enemies, including European football governing body UEFA’s president Aleksander Ceferin and Javier Tebas, who has the same role in the Spanish top flight.\nOver recent decades, Perez and Laporta had so often been on opposite sides as Madrid and Barca battled for domination of La Liga — and regularly for control of the Champions League trophy, too. But events have driven them together, and these two historic rivals have become intertwined in a new love story which has huge consequences for the future of Spanish and European football.\nSuch intimacy seems strange given Real Madrid and Barcelona are globally known as bitter enemies, whose Clasico meetings have famously been given greater significance and tension by deep cultural and social differences within Spanish and Catalan society.\nAs boyhood fans of Madrid and Barca who eventually took control of the two clubs, Perez and Laporta have always been well aware of the strength of this narrative.\nA politician turned ultra-successful businessman, Perez leveraged the feelings stirred by the Clasico divide to become Madrid president in 2000, winning that election by promising to “steal” Barcelona’s best player, Luis Figo.\nAdvertisement\nFigo’s betrayal caused anguish in Barcelona — symbolised by the pig’s head (and coins and golf balls) being thrown at the Portugal winger when he went back to Barca’s Camp Nou stadium as a Madrid player. The trauma led directly to Laporta sweeping to power at Barcelona in 2003, as the ‘Catalan JFK’ with a modern take on the club’s proud heritage.\nThat pride grew as Pep Guardiola coached a team based around La Masia youth academy products Lionel Messi, Xavi and Andres Iniesta to tremendous success while playing a beautiful style of football which drew praise and imitators from all over.\nGO DEEPER\nThe Airbnb-ification of Barcelona's once-unique style\nPerez’s reaction was to hire Jose Mourinho to knock Barcelona off their perch, through aggressive tactics on and off the pitch, which culminated/reached its nadir in August 2011 with the Madrid head coach poking a finger into the eye of Guardiola’s then-assistant Tito Vilanova during a touchline melee late in a Clasico at Camp Nou.\nBarcelona vs Real Madrid was by now must-watch TV for a supposed global audience of more than 500 million, who tuned in for meetings between the two best club teams on the planet as Messi, Xavi, Iniesta, Gerard Pique and Neymar faced off against Cristiano Ronaldo, Sergio Ramos, Karim Benzema and Luka Modric during the 2010s.\nThe football was tremendous, as were the politics behind the rivalry.\nWhile local politicians pushed for Catalonia’s right to self-determination, a Camp Nou crowd bedecked in the red and yellow of the region’s Senyera flag chanted “Independencia” during games, with one Clasico in 2019 even postponed amid security concerns.\nWhen Josep Maria Bartomeu was Barcelona president, from 2014-20, he often blamed his club’s increasing woes on a “black hand” somehow controlled from Madrid by Perez, whose guests at Real’s Bernabeu stadium often included establishment figures from politicians and business tycoons to even Spain’s former king, Juan Carlos I.\nAdvertisement\nBoth sides seemed to revel in their differences — the liberal Catalan freedom fighters against Madrid’s protectors of conservative Spanish values. And anything was allowed in love, war and Clasicos.\n“All our lives, it’s been Barca as the good guys, Madrid as the bad guys,” Perez claimed, with a hint of pride. The same idea was wrapped up in Barca’s ‘Mes que un club’ — More than a club — motto.\nThe similarities between the two clubs were less remarked upon.\nYet both were member-owned institutions with local roots but an international reach, imperfect democracies which allowed huge presidential power. They had the same massive strengths but also comparable deep insecurities, giving them a lot more in common than either club would really like to admit — at least publicly.\nThe most high-profile commitment now binding Barcelona and Real Madrid together is their shared obstinance over the European Super League.\nMadrid backing the whole project is no surprise, as Perez has been pushing the idea for decades, arguing it is the only way his member-owned institution can compete fairly with clubs elsewhere in Europe whose funding comes from outside football and even from the wealth of nation-states.\nManchester City beat Real Madrid and Barcelona to top Deloitte’s Money League for the first time last year with a revenue of €644.9million in 2021 — up 17 per cent from 2020. In the same period, Madrid’s revenue fell by seven per cent and Barcelona’s dropped 18 per cent. City’s transfer expenditure of €218.8million was significantly more than Madrid’s €44.7m and Barcelona’s €90.8m.\nBarcelona were not so openly committed to breaking away, although recent presidents including Laporta, Sandro Rosell and Bartomeu have rarely missed a chance to criticise UEFA’s running of the European club competitions.\nAdvertisement\nThere was still general surprise in October 2020 when Bartomeu, just as he was resigning in disgrace after a series of on- and off-pitch disasters, announced Barca’s willingness to participate in a future Super League. Although some insiders claimed not to be shocked at all.\n“Bartomeu was directed by Florentino,” La Liga chief Tebas said at the time. “Barcelona used to have its own voice but now it only repeats what Real Madrid says.”\nThat was all difficult to hear for fans for whom the Super League was still primarily associated with the man who had taken Figo from them, accepted Mourinho assaulting Vilanova, and even actively thwarted the cause of Catalan independence.\nDuring the elections to succeed Bartomeu, all candidates knew what would play best with the voting socios, as Barcelona’s club members are known.\n“The Super League is just about money. It could destroy the essence of football,” Laporta said in January 2021, and the lawyer was duly elected for a second stint as president in the March.\nBut then, just a few weeks later, the Catalan club were one of the 12 founding members of the new Super League project, which would have Madrid’s Perez as its president and guiding light.\n“It was not difficult to convince Laporta,” Perez told Spanish TV’s football talk show El Chiringuito de Jugones. “The Super League will save Barca, who are going through a bad time financially. Tomorrow, Laporta will come out and tell everyone.”\nGO DEEPER\nThe Barcelona-Negreira scandal is only deepening — here's what you need to know\nHowever, Laporta knew better than to show his face as the project quickly unravelled amid angry protests in England.\nThere was little such outcry in Catalonia, due to a widespread awareness that Perez was correct — their club’s huge debts of more than €1.3billion meant they could not afford to look a gift horse in the mouth. So, even as everyone else except Juventus of Italy drifted away from the Super League idea, Barcelona and Laporta became firm backers.\nAdvertisement\nLike Tebas, UEFA chief Ceferin kept pointing out the awkwardness of Laporta pursuing the project with Perez. “Barcelona have always been known as a club of the people, unlike Madrid,” Ceferin said last May in Spanish paper AS, as he tried unsuccessfully to prise the Clasico clubs apart.\nBy last summer, it was clear how the two clubs’ shared support for a Super League had detached them from their peers elsewhere.\nThe political situation meant no other European clubs would even play them in a friendly last summer. Instead, they organised a US Clasico in Las Vegas. Barcelona even had trouble finding suitable opponents for their traditional pre-season Trofeo Gamper curtain-raiser at Camp Nou. Italian club Roma first agreed to visit, then pulled out. Mexico’s UNAM ended up crossing the Atlantic for the game.\nStill, Laporta has not wavered. Indeed, over time he has become much more publicly supportive of the Super League project. At October’s club AGM he claimed the Super League would be “a more equal competition, an open league, based on meritocracy and respecting the state leagues” and predicted the European courts would decide UEFA is a monopoly which must be broken up.\nLaporta went further in an interview with Spain’s Cadena SER radio station last week, saying the Super League would “be a reality in 2025” — despite a legal opinion from the European Court of Justice (ECJ) last month stating the rules of UEFA and FIFA, the world game’s governing body, are compatible with EU law.\nIt was natural for Laporta to travel from Barcelona to sit with Perez in central Madrid at the A22 event mentioned at the start of this article to publicly maintain their shared project is still alive.\nThere was no real alternative, given how closely the two Clasico clubs are now aligned.\nThe Super League is not the only area in which Barca and Madrid have allied together in recent years. They have also grown increasingly close in domestic political battles against Tebas, the La Liga president.\nAdvertisement\nTebas’ mandate since his election in 2013 has been to protect the interests of smaller top-flight and second-tier clubs who historically felt pushed around by the big two. The Clasico duo have often opposed his policies, which they feel do not reward them sufficiently for generating about half the total business of all Spanish football.\nAlmost a decade of PR and legal battles culminated in December 2021 with Barcelona and Real Madrid refusing to enter into the €2.7billion ‘La Liga Boost’ partnership deal agreed with European private equity firm CVC Partners.\nBarcelona instead did a similar standalone deal last summer, although with different financial details, with US financiers Sixth Street, which brought in €517million to fill holes in the club’s finances. That arrangement was organised by Key Capital Partners, the financial backer of the Super League project, which two months earlier had agreed a €360million financing deal with Sixth Street to fund the renovation of Madrid’s Bernabeu.\n“Florentino Perez comes to the rescue of Barcelona to save the Super League,” smirked a Madrid business-press headline.\nCatalan media coverage did not trumpet so loudly the obvious connection to the Bernabeu, so Barcelona fans would not have to think about it so much. They preferred to focus on how these ‘financial levers’ helped Barca sign new players such as Robert Lewandowski and Raphinha in the summer transfer window.\nThrough the autumn, the Clasico duo were again allied together against most other clubs in La Liga in a battle to influence the Spanish government’s new general sports law.\nPerez was able to use his considerable political contacts to get the law’s wording amended to favour the interests of Real Madrid — and Barcelona — over everyone else, which led to a concerted lobbying campaign by Tebas and many other Spanish clubs to protect more equality within the legislation.\nAdvertisement\n“We’re all together in this — except just a few,” said Sevilla president Jose Castro, without having to say who those few were. The new law ended up as a fudge which left neither side fully happy.\nThe isolation of the two clubs within Spanish football was shown again last month when they both boycotted a La Liga-organised trip designed to build business links in the Middle East. Some Barcelona figures had initially planned to go, Tebas told reporters while at the World Cup in Qatar. “But then I guess a call came from you-know-who, Florentino, and they fell into line,” he said, again relishing the opportunity to point out the uncomfortable.\nNeither club now have any representation on the important La Liga sub-committees made up of directors and executives from other teams. Instead, they often send a proxy to argue their case as decisions are being taken. At the Dubai assembly mentioned above, both were spoken for by a lawyer from Clifford Chance, the firm which, not coincidentally, also represented the Super League in their ECJ case against UEFA.\nSuch isolation has consequences — in November, La Liga’s other 18 clubs agreed to tweak the league’s salary rules; changes which Barcelona feel were directed at them specifically and hampers their ongoing fight to fix their finances.\nBeing together on the outside is limiting the ability of Barca and Madrid to shape the environments in which they compete — both in Europe and domestically.\nThe idea of Real Madrid and Barcelona as bitter enemies has always been something for the media and the fans more than the directors of the clubs themselves.\n“The institutional relationship was fantastic. There were never any problems between the clubs — just the opposite,” Ramon Calderon, Madrid president from 2006-09, told The Athletic almost two years ago. “It was always friendly between directors at meals before the games and in the executive boxes. We knew we were representing rival teams but we were never enemies, always showing respect and courtesy for each other. The personal relationship (with Laporta) was always good and remains so after so many years.”\nAdvertisement\nPerez and Laporta also had cordial relations during their respective first terms, even as the tensions between fans, pundits and players intensified — for example, when Figo returned to Camp Nou as a Madrid player. In 2010, just before Laporta’s first term ended, he gave a speech in which he praised Perez as someone he had learnt a lot from.\nThe relationship during the Rosell and Bartomeu years was not quite as friendly — due to events such as Mourinho poking Vilanova in the eye, or Barcelona beating Real to the signing of Neymar — as political tensions generally rose between Catalan politicians seeking more autonomy and the central Spanish authorities in Madrid.\nStill, the behaviour around Clasicos was always good.\nLegend has it that when Perez spilt something on his tie during a pre-game dinner near Camp Nou, his Barcelona counterparts arranged for a tailor to arrive quickly with a selection of replacements to choose from. Another anecdote has Rosell being insulted by Madrid fans near the Bernabeu’s VIP zone and Perez arranging for those season-ticket holders involved to be moved permanently to another part of the stadium.\nBut there is still something new and different about just how close the two clubs have become, especially since Laporta returned to the Camp Nou presidency.\nThey have always shared many strengths and insecurities, but now the fates of the Catalan outsiders and the Madrid conservatives have become completely entwined.\nGiven Perez’s iron control of his club, there has been little dissent among fans or present or past directors about offering such strong support to their closest competitors. But around Camp Nou — and in other corridors of power in football — some wonder whether this is all really in Barcelona’s interests.\nThose who view Perez as the most machiavellian of all football figures wonder whether he might be taking advantage of weakness in his rivals to fatally undermine them in some way which is not yet evident.\nAdvertisement\n“The relationship between Florentino and Laporta should be the first among equals,” Evarist Murtra, a Barcelona director during Laporta’s first term, told Spanish newspaper La Vanguardia last July. “I don’t see it like that today. I see that Barca is following Madrid’s wheel. And personally, that annoys me.”\nAgain, however, such individual dislikes have been overtaken by events which are shaking up how football is organised.\nReal Madrid and Barcelona are so closely linked now that if one goes down the tubes, the other surely would, too. Without their Clasico counterpart around, they would be alone and almost completely friendless.\n“If Barcelona didn’t exist, we’d have to invent them,” Perez recognised early in his time in charge at the Bernabeu.\nLaporta’s response to Barcelona’s huge recent financial problems has been to reinvent the Catalan club as the best friend of their historic rivals from the capital.\nWhat this means for the future of both, and for Spanish and European football, remains to be seen.\n(Top photo: Getty Images/design: Sam Richardson)",
  "word_count": 2799,
  "scraped_at": "2026-02-14T01:55:49.880401",
  "_text_extracted": true
}