{
  "article_id": "58d9aeb33536",
  "url": "https://www.empireofthekop.com/2025/10/18/slot-de-bruyne-comparison-wirtz/",
  "title": "Slot draws De Bruyne comparison in emphatic defence of Wirtz",
  "date": "20251018T104500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot has pointed to the example of Kevin De Bruyne in pleading the case for patience with Florian Wirtz in the first few months of his Liverpool career.\nThe 22-year-old arrived at Anfield from Bayer Leverkusen in the summer in a £116m deal but, since claiming an assist on his official debut in the Community Shield, he’s gone nine Reds matches without a goal contribution (Transfermarkt).\nJamie Carragher lamented that the Germany international is ‘not at the races‘ since coming to the Premier League, and the media in his homeland weren’t overly impressed with his performance against Northern Ireland earlier this week.\nHowever, in sticking up for Wirtz, Slot has recalled how De Bruyne wasn’t an instant success at England but went on to become one of the greatest players the Premier League has seen.\nSlot points to De Bruyne example in defending Wirtz\nIn an interview with Sky Sports, the Liverpool head coach said of our number 7: “If you look at the passes he’s played to his teammates which unfortunately didn’t lead to goals, one of the greatest examples is the Chelsea game where after one minute [he came on as a substitute at half-time] he had this great flick to Mo Salah.\n“For Mo, this is 99 times out of 100 a goal. I have to say 98 out of 100 because the last time he got a ball like this was against Atletico Madrid from Florian Wirtz, but Mo hit the post.\n“He’s been a bit unlucky with the finishing when he’s given his teammates chances but, in general for a 22-year-old, it’s quite normal that you have to adjust to going to another country, let alone going to the Premier League.\n“Maybe I’m now underestimating the best midfielder who has ever played in the Premier League, Kevin De Bruyne. He was 21 or 22 when he went to Chelsea. Give him a bit of time, I would say. I’m definitely going to give him a bit of time and, in the meantime, he’s been unlucky.”\nDe Bruyne wasn’t an instant success in the Premier League\nSlot couldn’t have picked a better case study to make the case for not writing off Wirtz so early into his time at Liverpool.\nDe Bruyne was at a similar age when he started out at Chelsea, but after just nine appearances (with zero goals and one assist), he was promptly sold to Wolfsburg just a few months later.\nHe returned to England with Manchester City in 2015 and grew into one of the best players in world football, amassing 108 goals and 177 assists in 422 games at the Etihad Stadium and winning 16 trophies along the way, including six Premier League titles and the Champions League.\nEarlier this year, FourFourTwo ranked him as the sixth-best player in the 33-year history of the English top flight under its current guise. That he was placed above the likes of Eric Cantona, Harry Kane and Roy Keane contextualise how exceptionally he performed in this country.\nAdmittedly Wirtz has yet to catch fire at Liverpool, and he won’t be afforded patience outside of Anfield because of the lofty transfer fee, but he need only look at De Bruyne to see how a playmaker can conquer this league when he has a coach who puts his trust in him.\nYou can watch Slot’s full pre-Manchester United press conference via Empire of the Kop on YouTube:",
  "word_count": 573,
  "scraped_at": "2026-02-14T01:52:49.023688",
  "_text_extracted": true
}