{
  "article_id": "58ebbc9c22b2",
  "url": "https://metro.co.uk/2023/05/21/frank-lampard-sends-warning-mauricio-pochettino-chelsea-job-premier-league-18818973/",
  "title": "Frank Lampard sends warning to Mauricio Pochettino over Chelsea job | Football",
  "date": "20230521T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Lampard has warned Mauricio Pochettino there is no ‘quick fix’ at Chelsea as the former Tottenham manager prepares to take over at Stamford Bridge.\nPochettino is set to take charge of Chelsea at the end of the season after signing a three-year deal with the west London club.\nThe Argentine enjoyed an impressive five-year spell at Spurs but has been out of work since leaving French giants Paris Saint-Germain last summer.\nPochettino is joining a Chelsea side who have endured a miserable season despite Todd Boehly’s staggering £600m spending spree.\nChelsea are 12th in the Premier League with three games remaining, having won just 11 of their 35 matches under three different managers – Thomas Tuchel, Graham Potter and Lampard.\nLampard, who returned to Stamford Bridge as caretaker manager last month, believes Chelsea will benefit from a summer break following a turbulent year on and off the pitch.\nBut the Blues legend has warned Pochettino there is no ‘quick fix’ at Chelsea and says the battle for the top-four will be ‘even harder’ next season.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I don’t think there are many quick fixes in football,’ Lampard told Stadium Astro ahead of Chelsea’s clash against Premier League champions Manchester City.\n‘The Premier League moves on pretty quickly and that’s why this year has been difficult for us because the battle for the top four is harder than it has ever been and it will get harder.\n‘Teams are investing, the level of player, coaches and tactics is improving and that’s the beauty of the league.\nMore Trending\n‘We can only focus on ourselves as a club and understand the things we want to put right.\n‘It’s not for me to jump into the future and guess but it’s going to take a lot of hard work. I do think we’ll benefit from a break and a pre-season and a freshness.\n‘I’ve felt that since coming in, that we’ve needed a natural break. Of course it’s the desire of the club to get back to where it has been.’\nMORE: Chelsea join Liverpool in pursuit of Sporting midfielder Manuel Ugarte\nMORE: Ruben Neves puts clubs on alert as he reveals Champions League dream\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 437,
  "scraped_at": "2026-02-14T01:53:41.895882",
  "_text_extracted": true
}