{
  "article_id": "58fbc3838cab",
  "url": "https://www.dw.com/en/euro-2024-germany-captain-ilkay-g%C3%BCndogan-dreams-of-title/a-69386975",
  "title": "Euro 2024 : Germany captain Ilkay Gündogan dreams of title – DW – 06 / 17 / 2024",
  "date": "20240618T050000Z",
  "domain": "dw.com",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024: Germany captain Ilkay Gündogan dreams of title\nJune 17, 2024Ilkay Gündogan has hit a run of form just in time for the European football championship. Now he is aiming to win a first title with the German national team in front of a home crowd.\nIt was one of those moments that prove that Ilkay Gündogan is one of Germany's best midfielders. In the 19th minute of Germany''s match against Scotland, Gündogan took the ball in midfield and played a perfect pass to Kai Havertz in the penalty area, allowing him in turn to set up Jamal Musiala for Germany's second goal. A short time later, Gündogan drew a penalty, which Havertz converted to erase any doubt about the eventual outcome in what would be a dream start to Germany's home Euros.\n\"A world-class performance. Especially with the external pressure that he's always under,\" said teammate Thomas Müller after the match. \"He had a foot in on the first three goals,\" Müller added. \"Even the first one, he opened things up with his run. Nobody ever sees that in the end.\"\nMidfield general\nNot only did Gündogan create danger in front of the visitors' goal himself, he also played a key role in organizing Germany's attack, shouting instructions to his teammates. Musiala, Florian Wirtz and Havertz were among those who benefited most from his efforts.\n\"For me, and certainly for Flo too, it's important that our backs are covered and we can feel free to play our game,\" Musiala had said of Gündogan before the tournament kicked off. Against Scotland, 91% of Gündogan's passes reached their target in one of the attacking midfielder's best matches in a German jersey in months.\n\"It's always good to play well as a team. It's even better when you can contribute to it with your own actions,\" Gündogan said afterwards.\n\"I'm glad that I was able to be the improver for my teammates today, but it's important not to take a step back now.\"\nPrevious weaker performances by the 33-year-old had provided fodder for his critics\n\"I'm generally a very thoughtful and reflective person who also questions himself,\" Gündogan conceded prior to the start of the tournament.\n\"If I said it didn't bother me, I'd be lying.\"\nThe 'improver' wants more\nGündogan has hit his form at precisely the right time, and when he is at his best, he can be a very valuable asset to Germany. National team coach Julian Nagelsmann, who has stuck by his captain through thick and thin, had good reason to be pleased with his performance.\n\"He played very well, was very committed and focused, and he deserved a goal,\" the 36-year-old coach said.\nShortly after taking the job last September, Nagelsmann announced that Gündogan would remain captain of the national team – despite much criticism of the player in the media.\nGündogan, the first son of migrants to captain Germany at a tournament, doesn't take the role lightly.\n\"To be part of this team, to be part of this country, and to be able to represent the German team and the German people with pride is an incredible honor,\" he said.\n'Let's make our dream come true'\nUnder Pep Guardiola at Manchester City, Gündogan won the treble of the Premier League, FA Cup and Champions League in 2022-23. After his move to Barcelona last summer, the midfielder quickly established himself as one of the best players in La Liga.\nHaving won almost everything possible in club football, and now in his fifth tournament for Germany, he is fully focused on winning his first title with the national team.\n\"We want to become European champions,\" said Gündogan, who against Scotland made his 78th appearance for his country. He also called on the fans to unite behind the national team this summer.\n\"We can win on so many levels at this home European Championship. As good hosts, as a cosmopolitan society, and hopefully on the pitch at the end of the day. Please help us to make our dream come true together.\"",
  "word_count": 674,
  "scraped_at": "2026-02-14T01:51:32.428600",
  "_text_extracted": true
}