{
  "article_id": "5911eab38005",
  "url": "https://www.france24.com/en/live-news/20230811-spain-hit-extra-time-winner-to-reach-world-cup-semi-finals-for-first-time",
  "title": "Spain hit extra - time winner to reach World Cup semi - finals for first time",
  "date": "20230811T084500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spain hit extra-time winner to reach World Cup semi-finals for first time\nWellington (AFP) – Teenager Salma Paralluelo scored an extra-time winner as Spain beat the Netherlands 2-1 to reach the Women's World Cup semi-finals for the first time Friday and a clash with Japan or Sweden.\nIssued on:\nOver a tense 90 minutes in Wellington full of incident, Mariona Caldentey scored an 81st-minute penalty for Spain, only for Stefanie van der Gragt to equalise in added time.\nWith the quarter-final seemingly headed for penalties, the 19-year-old substitute Paralluelo produced a brilliant solo finish in the 111th minute to put Spain into the last four.\nThey will now face Sweden or Japan in Auckland on Tuesday while the tournament is over for the Dutch, beaten finalists four years ago.\nBarcelona forward Paralluelo, who had started every previous game at the tournament, said she was determined to make an impact when coach Jorge Vilda introduced her from the bench in the 71st minute.\n\"It means everything to me. It was a unique moment, great euphoria to have lived through it and I'm extremely happy,\" the teenager said.\nVilda predicted the former sprinter will blossom into a global star, having only made her Spanish senior debut nine months ago -- when she scored a hat-trick against Argentina.\nShe scored twice in last year's Under-20 Women's World Cup final win over Japan, before going on to taste European Champions League glory two months ago with Barcelona.\n\"Salma is a player with enormous potential and she's not reached her best,\" Vilda said.\n\"Right now she is excellent, but in the future it's going to be much, much more.\"\nTheir maiden semi-final place was reward for a display of controlled attacking football from the sixth-ranked La Roja, who have regained their swagger after crashing to a 4-0 group-stage loss to Japan.\nThe 90 minutes of normal time were largely dominated by Spain -- and some VAR decisions -- but it was the Netherlands who looked stronger in extra time, before Paralluelo's clinical left-footed finish on the break.\n\"We've always dreamed of something like this... but we're not stopping here,\" said Vilda, as his Spain side chase more history.\n\"We've reached somewhere we've never reached before.\n\"It was a match with a lot of emotions, VAR decisions. And the goal from Salma -- it was sheer joy,\" he added.\nVAR plays part\nSpain dominated the first half and were denied by the woodwork twice when Alba Redondo's header was parried onto the post by goalkeeper Daphne van Domselaar and her follow-up also struck the post.\nSpain captain Esther Gonzalez lashed a shot into the net but the striker was ruled offside by VAR.\nThe Netherlands got a foothold in the second half.\nThey looked set to go in front when Lineth Beerensteyn tumbled over in the box following contact with Irene Paredes, who was shown a yellow card and French referee Stephanie Frappert pointed to the spot.\nBut the decision was cancelled after VAR called for a review.\nSpain went ahead from the spot with nine minutes left of normal time through Caldentey after Paralluelo's cross struck Stefanie Van der Gragt's flailing hand inside the penalty box.\nDefender Van der Gragt, who is now set to retire aged 30, made amends in the first minute of stoppage time when her surging run was found by Victoria Pelova before blasting past Cata Coll in the Spain goal.\nThe Netherlands had the better chances in extra time, going close twice through Beerensteyn, before conceding the decisive goal as penalties loomed.\n\"It's hard now,\" said Van der Gragt, whose last game in football was an eventful one.\n\"We had the chance in extra time and we didn't score, they had one chance and they scored. That's football.\"\n© 2023 AFP",
  "word_count": 631,
  "scraped_at": "2026-02-14T02:07:08.853442",
  "_text_extracted": true
}