{
  "article_id": "5912e3195af4",
  "url": "https://www.con-telegraph.ie/2024/04/18/i-saw-only-one-team-rodri-bemoans-real-madrids-tactics-after-citys-euro-exit/",
  "title": "I saw only one team – Rodri bemoans Real Madrid tactics after City Euro exit",
  "date": "20240418T143000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I saw only one team – Rodri bemoans Real Madrid’s tactics after City’s Euro exit\nBy Andy Hampson, PA\nRodri claims he “saw only one team” trying to win as he bemoaned Real Madrid’s tactics following Manchester City’s heartbreaking Champions League quarter-final loss.\nCity’s European title defence ended in agonising fashion at the Etihad Stadium on Wednesday as the Spanish giants prevailed 4-3 on penalties after a 1-1 draw on the night meant the tie ended 4-4 on aggregate.\nIt was a clash the holders completely dominated, racking up 33 attempts on goal to the visitors’ eight, but Real defended deep to frustrate them and ultimately ended their hopes of a second successive treble.\nCity midfielder Rodri said: “To be honest, I saw only one team. In terms of defending, they defended (well). They knew how to suffer and we know how tough Real Madrid are.\n“But in my opinion we should go through with that amount of chances but this is the trick of this competition. They know how to play it. We congratulate them.\n“We gave everything, there is nothing to regret. This is football sometimes. This shows how difficult it is to win it, as we did last season. It was very frustrating and sometimes it is difficult to explain.”\nCity’s exit from the competition they won with a Rodri goal in Istanbul last year, coupled with Arsenal’s loss to Bayern Munich, means there are no English semi-finalists for the first time since 2020.\nCity had to chase the tie after Rodrgyo pounced to put Real ahead after 12 minutes.\nThey created a plethora of chances in a storming response, with Erling Haaland going the closest in the first half when he headed against the bar.\nFurther opportunities came and went after the break and it was not until the 76th minute that Kevin De Bruyne finally broke through to net a deserved equaliser.\nBut De Bruyne spurned a good chance to win it when he fired over soon after and, with extra-time failing to separate the sides, it came down to spot-kicks.\nEderson saved from Luka Modric but Bernardo Silva’s attempted Panenka was too easy for Andriy Lunin, who also denied Mateo Kovavic as Real went through.\nThe Premier League leaders now have little time to pick themselves up before heading to Wembley for an FA Cup semi-final with Chelsea on Saturday.\nRodri said: “We will have to digest the loss but we will have to wake up, stand up. We still have two more competitions to play for.\n“We need the mentality (to be) positive, to find any ambition that right now is difficult to find. Tomorrow we will find it and go against Chelsea, try to be in another final and fight for the Premier League.”\nCity will need to assess key pair Haaland and De Bruyne who, along with Manuel Akanji, were substituted before the penalty shoot-out.\nHaaland was removed at the end of the regulation 90 minutes with the influential De Bruyne leaving the action in the second period of extra-time.\nManager Pep Guardiola said: “Erling and Kevin asked me to go out – they could not continue, like Manu. The game we were playing, they were amazing, but they could not continue.”",
  "word_count": 541,
  "scraped_at": "2026-02-14T01:54:34.170161",
  "_text_extracted": true
}