{
  "article_id": "5928668d5123",
  "url": "https://metro.co.uk/2025/05/18/mikel-arteta-aims-dig-man-utd-tottenham-arsenal-confirm-second-place-finish-23108744/",
  "title": "Mikel Arteta aims dig at Man Utd and Tottenham as Arsenal confirm second place finish | Football",
  "date": "20250518T191500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Arsenal confirmed another second-place finish, manager Mikel Arteta pointed out that some teams have struggled so badly this season that they are down in 16th and 17th position in the table – where Manchester United and Tottenham are residing.\nThe Gunners beat Newcastle 1-0 at the Emirates on Sunday, confirming that they will finish second for the third straight season.\nIt is another season without silverware and there is an air of disappointment around the club as a result, despite an impressive run to the semi-finals of the Champions League and another runner-up spot in the Premier League.\nArteta admitted he is disappointed, but is proud of his players for how they dealt with injuries in the squad, reminding onlookers that other clubs have not handled injuries so well.\nWhile Arsenal are finishing second, Manchester United and Spurs are sitting just above the relegation zone with just one game to play.\nIt is unlikely the Spaniard picked 16th and 17th place at random when he noted how badly a season can go for big clubs.\n‘We are clearly very disappointed because we wanted to be here with the Premier League or the Champions League and it’s not the case,’ Arteta told Sky Sports after the win over the Magpies.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘But chasing a dream has it’s ups and downs. Make sure that doesn’t get blurry and it does get recognised what we’ve done.\n‘Any other team, and I’ve seen it, with one injury to finish eighth to 16th, 17th.\n‘What the team has done, in my opinion, to sustain the level throughout the season, with everything that has happened, is incredible.\n‘We don’t want anybody to value [it] but me as a manager has to value what these guys have done.’\nArteta added: ‘We have to start creating our own history here in this stadium and we started this season. There is much more to come and it won’t be easy. These players have the talent.\n‘We need to rest and finish at Southampton and then go on holiday. Any other club in this position would finish in a position that we cannot even dream of.’\nArteta’s only major trophy as Arsenal manager remains the 2020 FA Cup and the message is clear that the club must end their silverware drought next season.\nMore Trending\nCaptain Martin Odegaard said: ‘We can be proud of what we’ve done, especially in the Champions League, we had a great run there and some great experiences. We have to accept we haven’t been good enough in the league, but we have to take all experiences, good and bad, take them into next season and be better.\n‘Unbelievable [Champions League], those are the nights we live for. To play here at home with that support. Great game and hopefully we can have many moments like that next season. Unbelievable to feel that and the love from the fans.\n‘We want to thank the fans. We always feel the love, the support we have is amazing so thank you.\n‘We have to use all experiences from this season, to feel that pain of not winning and take it to next season and come back stronger and bring the club some trophies next season.’\nMORE: Taiwo Awoniyi speaks out and is ‘still fighting’ after waking from coma\nMORE: Man Utd and Real Madrid legend Cristiano Ronaldo receives ‘tempting’ transfer offer\nMORE: What Chelsea, Newcastle and Man City need to qualify for the Champions League",
  "word_count": 631,
  "scraped_at": "2026-02-14T02:02:47.547699",
  "_text_extracted": true
}