{
  "article_id": "592807953749",
  "url": "https://www.90min.com/6-takeaways-from-champions-league-matchday-six",
  "title": "6 takeaways from Champions League matchday six",
  "date": "20241219T171500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "6 takeaways from Champions League matchday six\n- Arsenal and Chelsea finish top of their groups\n- Cityzens fall against defending champions Barcelona\n- Quarter-final draw to set to take place on February 7\nThe UEFA Women's Champions League was back for the final matchday of the group stages on Wednesday as two English contenders secured their spot at the top of their standings.\nChelsea managed to complete the comeback against Real Madrid, as two brilliant penalties from Catarina Macario secured the side a 2-1 victory at Estadio Alfredo Di Stefano.\nAs injury woes continue to pile up, Manchester City had the top spot of their group stolen from them by defending champions Barcelona. Gareth Taylor's side struggled in Spain, suffering a 3-0 defeat at Estadi Olimpic Lluis Companys.\nAs for Arsenal, an instant Champions League spectacle saw Mariona Caldentey steal a 3-2 victory over Bayern Munich in the closing stages of the game. Renee Slegers extends her unbeaten run out to eleven games, as the Gunners claimed the top spot of their group.\n90min have looked at the six key learnings from matchday six of the Women's Champions League...\nRenee Slegers is deserving of the permanent job at Arsenal\nThere is no stopping Arsenal right now, after a triumphant 3-2 win against Bayern Munich fired the side into the top spot of the their group. The Gunners made it eleven games unbeaten under the interim management of Renee Slegers, and it was the fight and passion displayed by the players that made the moment all the more special.\nSince taking charge following Jonas Eidevall's resignation, Slegers has led Arsenal to new heights. The players have been injected with a new sense of confidence, and as star defender Leah Williamson described it, \"I am so happy coming into work every day\".\nSlegers hasn't made wholesale changes to Eidevall's previous system, but it is the small tweaks that have made the largest impact. The decision to play Steph Catley at centre-back on a permanent basis has helped Arsenal become formidable, as the Australian continues to work seamlessly along side Williamson at the heart of defence. After scoring a hat-trick in the reverse fixture, Catley made Pernille Harder look anonymous at Meadow Park.\nUnder the reign of Eidevall, fans began to forget the streaming talent that this side possess. Now, the Gunners look like their spirit alone could get them over the line against almost any opposition.\nIf eleven games unbeaten and a victory over Bayern Munich isn't enough to sell the Arsenal backroom staff on the 'Reneesaince', then perhaps the club need to rethink their fairytale search for a perfect manager and realise that their best option is already in the dugout.\nAlessia Russo continues to fire to new heights\nSlegers has gotten a lot of things right since taking charge at Arsenal, but the greatest impact of all has come from Alessia Russo. Following a dry spell that saw her goalless for the opening eight fixtures of the 2024/25 season, Russo's leveller against Bayern was her 10th in 11 straight games.\nThis is the striker that Arsenal and England fans alike have all been pining for, and they are finally beginning to see her shine. Russo looks unstoppable, rattling the back of the net like it's light work.\nWe saw glimpses of this ruthlessness in her final season with Manchester United, but nothing like we are witnessing now. Forwards rely heavily on confidence in order to perform at their best, and Russo is brimming with it.\nDespite injury woes, is there enough pressure on Gareth Taylor?\nManchester City's last seven days have catalysed many doubts in the squad's depth and talent. The Cityzens were outplayed by Everton in the Women's Super League (WSL), before travelling to Barcelona to put on another toothless display.\nIf it wasn't for the individual brilliance of goalkeeper Khiara Keating, it is safe to assume that Barcelona could have had a 5-0 lead inside of the first 45 minutes alone. Without Vivianne Miedema, Chloe Kelly, Lauren Hemp, Khadija Shaw and captain Alex Greenwood, it is impossible not to have some empathy for this City side.\nHowever, another club in England are facing troubles of their own. Chelsea are without Sam Kerr, Lauren James and Mia Fishel, and recently lost defender Kadeisha Buchanan to an ACL injury while in the form of her life. The Blues also travelled to Real Madrid wiithout Johanna Rytting Kaneryd, who has been key to their success this campaign.\nAn injury-clad Arsenal managed to out qualify Man City in the 2022/23 season, stealing third place and a Champions League spot despite injuries to Leah Williamson (ACL), Beth Mead (ACL), Vivianne Miedema (ACL), Lia Wälti and Kim Little as the season ran down.\nInjuries are a part of football, and City's rough week is a clear indication that the team is lacking depth in all areas. However, it's not the first time we have seen this happen.\nSitting in the driving seat to win the WSL title last season, an injury to Shaw was enough to derail City's campaign completely. Taylor often struggles to scour for a plan B, and often relies too heavily on moments of individual brilliance.\nThis injury crisis will pose as a great cover-up for the larger issue at hand, which is City's persistent struggle to comeback from any sign of adversity.\nWhen in doubt, call Cat Macario\nAnother questionable display. saw Chelsea fall behind early against Real Madrid on Wednesday evening, However, in true Blues fashion, they managed to get the job done.\nSonia Bompastor's side carry great strength in numbers, and the player that shone the most against Las Blancas was forward Catarina Macario.\nThe U.S. women's national team forward should have had a first brace before her goals finally transpired, with two near misses causing Real Madrid's breath to catch in their throat. Macario was brilliant, with pure strength and composure the 25-year-old made Chelsea look likely in the final third.\nTwo penalties scored by the American were enough to scrape the Blues over the line in a 2-1 win, but the spot kicks carry a story of their own. Hammering home both strikes into the top-right corner is something only a world class player would dare to do twice.\nA strong testament to Chelsea's powerful squad depth, Macario was able to lead the line alongside Mayra Ramirez and ensure that Sam Kerr's absence was barely felt.\nUEFA making fans wait a little too long\nAs the final matchday of the Women's Champions League group stages wrap up, fans are being made to wait until February 7 to find out who their side will face in the quarter-finals.\nThe next stage will commence across March 18/19, meaning fans will have under six weeks to plan their European journeys to go and support their club. With the group stages done and dusted, why is it that UEFA are prolonging the draw for another month and a half?\nAn earlier draw would provide clubs with ample opportunity to push ticket sales and draw up the hype on what is certain to be an epic quarter-final stage. Women's football deserves to be played on the biggest stage, and football bodies should have their sights on this expectation.\nManchester City have a 2/3 chance of facing one of their WSL rivals in the next round, having finished second in their group. The side will be pooled against Chelsea, Lyon and Arsenal. As for the London contenders, Arsenal will face off with one of Real Madrid, VfL Wolsburg or Man City. The Blues will be drawn against Bayern Munich, VfL Wolfsburg, or Man City.",
  "word_count": 1273,
  "scraped_at": "2026-02-14T02:02:07.175977",
  "_text_extracted": true
}