{
  "article_id": "596c548b51da",
  "url": "https://www.twtd.co.uk/ipswich-town-news/41782/mckenna-i-want-to-get-back-to-the-highest-level-as-a-manager-and-the-dream-is-to-do-it-with-town/onthisday",
  "title": "McKenna : I Want to Get Back to the Highest Level as a Manager and the Dream is to Do It With Town - Ipswich Town News",
  "date": "20231220T181500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Monday, 20th Dec 2021 16:29\nNew Blues boss Kieran McKenna says his aim is to get back to working at the highest levels of the game, as he has been as first-team coach with Manchester United, and that the ultimate dream would be to do that with Town.\nMcKenna became the Blues’ 19th manager since they turned professional when he was appointed on Thursday.\nAt 35, few would be taking reins of a club Town’s side but not many his age have 13 years of coaching experience, McKenna’s blossoming career as a midfielder at Tottenham having come to an end prematurely.\nThe Northern Irishman suffered a hip injury at Spurs at a time when he was the captain of their reserves and on the verge of breaking into the senior side, indeed he had played pre-season matches with the first team.\nFollowing a couple of years in which he underwent surgery and suffered setbacks before finally hanging up his boots, he quickly moved into coaching with the White Hart Lane youth set-up.\n“Obviously 35 is maybe a typical retirement age, people might say,” he reflected. “I don’t know if I’d quite be at my peak but I never was too quick so I probably wouldn’t have had too much [pace] to lose.\n“Obviously, for me it’s been a really good journey. I think one of the benefits, if you could call it that, of finishing your playing career, mine through injury, which obviously was an unfortunate situation, but one of the benefits of that is that you get a big head start as a coach.\n“I’ve coming on to 13 years of coaching now at what I feel is a really high level, working with players, developing players, developing teams.\n“I’ve put hundreds and hundreds of hours on to the grass and into developing myself, so I feel like all the experience I’ve had up to this point, the coaches and managers that I’ve worked under at Tottenham and at Manchester United, the sessions I’ve put on, the meetings I’ve taken, all of the work that I’ve done over the last 13 years, have put me in a really good position to be able to take this opportunity on.\n“I know there are some other skillsets as a manager that I want to develop in myself but I feel like I have the capabilities to do so and it’s about taking the experiences that I’ve had, learning from the people who I’ve worked under but also trusting myself, trusting my own personality, trusting my own ideas and looking to go on and imprint them now as a manager. Of course, this is a great opportunity to do that.”\nAsked about his long and short-term ambitions as a manager, he added: “I mean short-term and medium-term, I’m not going to be looking any further than this football club and we have to do to get it going in the right direction.\n“Obviously, as soon as you come down here, you realise how much it means to people, what a fantastic club it is and the passion and the fanbase and the support.\n“But also we realise where we are in the league table, it’s not been a successful couple of years, there’s a lot of work to be done behind the scenes in all aspects that need to be improved.\n“So short-term, my focus is on Gillingham coming up on Boxing Day but also on making the immediate little improvements I feel can be made around the training ground and around the building to improve the environment.\n“As I say, it’s been a difficult season so far for the team, but we feel that the season is still alive and we want to improve, we want to pick up results and we want to focus on improving the performances of the team as quickly as we can and hopefully results come from that.\n“I think with the quality in the squad it’s possible that we can put a run of results together and if we do that then let us see where we are at in a couple of months.\n“So the immediate focus at the moment is really around the team and the club and what differences we can make straight away.\n“In terms of the longer-term focus for the club, I think everyone knows that the owners are coming in with big ambition. They have invested a lot in the squad, they’ve invested in myself and my staff, and the ambition is to get Ipswich back up towards the top levels of English football where it was and where we feel it belongs and where everyone wants to see it.\n“And again, for myself longer term, I’ve worked well enough to get myself to a really, really high level as a coach in the coaching profession. I worked at the highest level in the Premier League and Champions League and coached Champions League games at 32 years old and worked at that level and enjoyed it.\n“And that’s definitely an aspiration to be back at that level as a manager, and of course, the ultimate goal and the ultimate dream is to do that with Ipswich Town.\n“But look, we know it’s step-by-step, there’s a long way to go. It’s nice to have long-term goals and long-term ambitions and to feel the passion of everyone at the club to get this club back up to the very top, but the most important thing now is the day to day and getting to work.\n“It’s step-by-step improving the team, improving the club in every little way that I can and that was a big part of the conversation with [CEO] Mark [Ashton].\n“We feel that if we put the right things in place if we work day by day, then with the support that we have and with the investment that we have, that eventually the success and moving up the leagues will come, but it will come as a product of the things that we do day today.”\nMcKenna is aware that the Blues have ground to make up if they’re to achieve promotion this season.\n“Yes, we do,” he admitted. “Of course, there’s expectation here and rightfully so because we feel like we are a big club and the club has invested in the squad.\n“But there’s no guarantees in this league. I’ve seen enough of it already to know that there are no guarantees.\n“There’s other big clubs in the division, who also feel, and their supporters probably feel, that they belong in a higher division and they deserve to be in a higher division, and they want to be in a higher division. But it doesn’t guarantee anything, in the end it doesn’t mean anything.\n“The only way that we’re going to win games and the only way that we’re going to climb this league is first of all by starting on the training pitch, doing the right things, setting up the team in a good way.\n“And then managing to put that on the pitch and put in some performances and pick up results.\n“We want to get promotion from the league when that comes, so does every other team in the league and certainly at the moment there are some big clubs in that league, who all feel like they should be and could be at a higher level.\n“But it doesn’t guarantee us anything, we need to go to Gillingham in the first instance and make sure that we do all the right things that give us a chance to win three points and then we’re going to have to do it again three days later [at home to Wycombe] and every game after that. That’s the only way to get success.\n“We aren’t going to get out of this league because we have a big fanbase or a big support, that certainly can help, it can help the club move forward but it’s going to be up to the players on the pitch and the staff around them to put performances on that are going to enable us to get those results.”\nPhoto: Focus Images/Daniel Hambury\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\n“I've put hundreds and hundreds of hours on to the grass and into developing myself, so I feel like all the experience I've had up to this point, the coaches and managers that I've worked under at Tottenham and at Manchester United\nLambert Germany history lesson on the cards.\nI like very much what I read and the manner of delivery ; can't see him indulging in hyperbole or loosely thought through comments ; looks like and speaks like a true professional who knows his business !\nCOYB\nIt will be interesting to see which players in this squad fall by the wayside ( I've got my list already formulating in my head ) , as the qualities expected as the “ norm” will now be substantially raised I feel .\nI'd say NOW the Gamechanger era really begins …. COYBs ðŸ‘\nBest of luck Keiran, we're all behind you.\nRobson bought 13 players in 13 years. Let's have the same precision.\nLet's hope for the best!\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1561,
  "scraped_at": "2026-02-14T01:51:13.771299",
  "_text_extracted": true
}