{
  "article_id": "597a273eb949",
  "url": "https://timesofmalta.com/articles/view/watch-champions-hamrun-wrap-successful-campaign-win-gudja.1027102",
  "title": "Watch : Champions Ħamrun party , as win leaves rivals trailing by 19 points",
  "date": "20230422T160000Z",
  "domain": "timesofmalta.com",
  "source_country": "Malta",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Watch: Champions Ħamrun party, as win leaves rivals trailing by 19 points\nPresident Joseph Portelli warms up for final few minutes before celebrations\nĦAMRUN SPARTANS 2\nMashike 2\nCamenzuli 11\nGUDJA UNITED 0\nĦAMRUN SPARTANS\nH. Bonello-6; S. Borg-6, M. Guillaumier-6, E. Mashike-6.5, R. Prsa-6, Ederson-6 (55 K. Holmberg-6), O. Bjelicic-6 (55 L. Montebello-6), J. Corbalan-6 (68 J. Mbong), Jonny-6 (55 Dodo-6), E. Marcelina-6, R. Camenzuli-7 (77 S. Xerri).\nGUDJA UNITED\nG. Zammit-6; J. Mintoff-6 (84 J. Claude Bugeja), T. Nagamatsu-6 (46 N. Navarrete-6), V. Plut-6, S. Attard-6 (84 D. Kolf), J. Arthur-6, N. Micallef-6, K. Micallef-6, N. Tabone-6 (56 N. Tabone-6), S. Gomes-6 (71 J. Attard), F. Zuniga-6.\nReferee Ishmael Barbara.\nBOV Player of the Match Ryan Camenzuli (Ħamrun Spartans).\nĦamrun Spartans completed their successful Premier League campaign in style as they defeated Gudja United in their season finale.\nThe Spartans, buoyed by the enthusiastic crowd that filled the enclosure stands at the National Stadium, picked up their 22nd win of the season as they wrapped up their campaign with a whopping 19-point lead above Birkirkara, who finished second.\nThis year’s title is Ħamrun’s ninth crown and their second in the last three seasons as the Spartans are looking to open a dynasty with further success in both the local and possibly in European football.\nThey will be making their debut in the Champions League next season having last played in this competition back in 1991 when it was still referred to as the European Cup.\nFor their season finale, Ħamrun’s coach Branko Nisevic fielded a strong starting formation including goalkeeper Henry Bonello and captain Steve Borg.\nForward Elvis Mashike was also fielded from the start as he was chasing the league’s top scorer Jefferson with the Spartans having the improbable task of netting four goals to pip him to the accolade.\nAlthough not registered as a player, there was a lot of attention around whether president Joseph Portelli would still introduce himself on the playing field and in the closing stages it looked like he was going to fulfil his dream.\nHowever, after warming up for a handful of minutes, he returned to the bench before the Spartans made their fifth and final substitution of the game.\nBack in January, the Malta Football Association’s executive board turned down a request made by the Spartans to register Portelli as a player on the recommendation of its ethics committee.\nGudja United were led by interim coach Ludvic Bartolo following the resignation of Andrea Agostinelli earlier this month.\nDeployed from the start were former Ħamrun captain Karl Micallef and youngster Shaisen Attard, who joined the Blues on loan from the Spartans this season.\nThe Blues finished their Premier League campaign in 10th with 29 points, having secured eight victories and five draws.\nĦamrun Spartans could not have wished for a better start when Ryan Camenzuli’s cross was converted into goal by forward Elvis Mashike inside the first minute of the game.\nAs expected, the Spartans dictated proceedings and they managed to find a second through Camenzuli who beat Glenn Zammit with a delightful volley from the edge of the area.\nGudja’s first chance dropped on the feet of Tatsuro Nagamatsu but his long-range volley failed to threaten goalkeeper Bonello.\nJonny replied for Ħamrun, firing a low drive from the edge of the area but Zammit managed to keep his effort at bay.\nGudja’s Vito Plut came close to pull one back for the Blues when he connected with a corner-kick but his towering header just glanced past Bonello’s goal.\nAt the break, Gudja made one change with Nicolas Navarrete coming on for Nagamatsu in bid to spark the attack into life.\nĦamrun came close to finding a third through substitutes Luke Montebello and Dodo, but neither of them managed to find the back of the net midway into the second half.\nHowever, that little mattered as at the end of the match the Spartans title party kickstarted with the thousands of Reds fans in full voice cheering their players on their way to receiving the championship trophy.\nThe volume levels reached their maximum when president Bjorn Vassallo presented the championship trophy to Ħamrun Spartans captain Steve Borg who lifted the trophy towards the sky amid the jubilation of the players, team officials and fans.",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:50:29.475334",
  "_text_extracted": true
}