{
  "article_id": "597cb354c499",
  "url": "https://www.caughtoffside.com/2024/04/18/chelsea-argentinian-world-cup-winner/",
  "title": "Chelsea news : Blues in the hunt for AS Roma ace Paulo Dybala",
  "date": "20240418T074500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As Chelsea approach this weekend’s FA Cup semi-final against Manchester City, they will know that it is their last hope of getting into Europe this season.\nIt is such an important fixture for the club that Mauricio Pochettino’s future as manager could hinge on the outcome.\nOwner, Todd Boehly, is quite happy to be a ‘hire em and fire em’ kinda guy, so he’ll think nothing of dispensing with the Argentinian’s services if the manager isn’t able to deliver a trophy and European football next season.\nChelsea looking at Paulo Dybala\nWith seven games left of their Premier League season, there’s an outside chance that the Blues could scrape into the Europa Conference League, but that surely won’t be good enough for the ambitious Boehly.\nPochettino’s countryman and World Cup winner, Paulo Dybala, might well be on his way to Stamford Bridge next season if information supplied by football journalist, Rudy Galetti, proves to be accurate.\n?? Paulo #Dybala is still waiting to discuss a new contract with #ASRoma.\n? The current agreement with the ?? expires in 2025.\n? Some clubs in ?? – including #Barcelona and #Chelsea – collected some preliminary info on the ?? and his release clause. ?? #Transfers pic.twitter.com/dXn2hlJpuy\n— Rudy Galetti (@RudyGaletti) April 16, 2024\nWriting on X (formerly Twitter), Galetti has suggested that both Chelsea and Barcelona have been in touch concerning any relevant details to acquire the player from AS Roma, where he has a contract until 2025.\nIt isn’t clear at this point how much the 30-year-old would cost if he could be prised from the Giallorossi, however, his experience could prove to be vital to any team that were able to sign him.\nThe Blues might fancy their chances of landing Dybala given their recent deal with the Serie A outfit for Romelu Lukaku.\nThe Belgian may not be able to stay at Roma unless they make the Champions League, and in that eventuality, Chelsea might also lose out on Dybala given that he’ll likely not want to drop down and play in what is an inferior European competition.\nDybala’s international captain, Lionel Messi, might also offer a few sage words of advice to his countryman too.",
  "word_count": 367,
  "scraped_at": "2026-02-14T02:07:51.328092",
  "_text_extracted": true
}