{
  "article_id": "598a9049f1b1",
  "url": "https://www.cityam.com/tottenham-chiefs-lobby-uefa-to-increase-champions-league-squad-size/",
  "title": "Tottenham chiefs lobby Uefa to increase Champions League squad size",
  "date": "20260128T083000Z",
  "domain": "cityam.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham chiefs lobby Uefa to increase Champions League squad size\nTottenham Hotspur are lobbying Uefa to increase Champions League squad sizes after Thomas Frank was forced to drop Mathys Tel for the second time this season.\nTel, who joined the club in a £30m deal last summer, was cut from Tottenham’s squad before last week’s 2-0 win over Borussia Dortmund to enable Dominic Solanke’s return from injury.\nThe Frenchman, 20, is not available for tonight’s final league stage game at Eintracht Frankfurt, where a win would guarantee Spurs a spot in the last 16.\nTel had originally been omitted from Tottenham’s Champions League list in September because a lack of homegrown players meant Frank was unable to name a full squad of 25, but a new rule handed him a reprieve in December after an injury to Solanke.\nWith Solanke fit again, Frank was forced to choose between the two for Tottenham’s final two games of the league phase.\nClubs that qualify for the Champions League knockout stages can make three changes to their squad before 5 February, but not beyond the 25-man limit for A-list players born before 2004. If a club has fewer than eight homegrown players, their squad size is reduced accordingly.\nChampions League squad regulations were introduced almost 20 years ago, with Tottenham arguing the rules should be relaxed to reflect the expansion of the competition.\nFollowing the introduction of the Swiss model league phase last season, all clubs play at least an extra two matches per season, while those who fail to finish in the top eight have an additional two games next month in the play-offs for the last 16.\nTottenham’s position has been influenced by their chronic injury problems over the last two seasons under Frank and Ange Postecoglou, but the club also harbour genuine concerns about player welfare given the increased demands they are facing.\nSporting director Johan Lange has raised the issue with other Premier League clubs in an attempt to garner more support, with Chelsea and Arsenal the most receptive so far, but rivals in Europe are opposed to the move for fear of increasing the advantage conferred by England’s financial firepower.\nAhead of tonight’s final round of games, which all kick off at 8pm, there are five English clubs in a top eight completed by holders Paris Saint-Germain, Real Madrid and Bayern Munich, while Manchester City also able to qualify automatically if they beat Galatasaray this evening and other results go in their favour.\nDiageo lines up Big Bash franchise\nDiageo, the multinational alcoholic beverage company, is exploring an investment in the Big Bash if it proceeds with a planned sale of reigning Indian Premier League champions Royal Challengers Bangalore.\nThe owner of 200 premium drinks brands including Guinness, Smirnoff and Johnnie Walker is in the process of conducting a strategic review of its ownership of RCB, which is valued at between $1.5bn and $2bn.\nA source with knowledge of the process told City AM that Diageo is likely to keep its majority stake at RCB, with the proceeds of a minority sale to be used to invest in a franchise in Australia’s T20 league, the Big Bash, which concluded last weekend with Perth Scorchers winning their sixth title.\nCricket Australia has yet to confirm that it is selling stakes in the eight Big Bash franchises but, having engaged US bank Raine to conduct a feasibility study into the privatisation of the competition, that is seen as the most likely outcome. Raine ran the Hundred auction last year which raised £520m for English cricket.\nMiddlesex chief probed by Cricket Regulator\nMiddlesex County Cricket Club have told staff and some of their members that chief executive Andrew Cornish has been suspended pending the outcome of an investigation by the Cricket Regulator into alleged misconduct.\nCornish took a leave of absence from the club at the end of November after Middlesex received a complaint from another member of staff – a move that now appears to have been formalised, according to club chair Richard Sykes.\nIn an email sent to one member this week, Sykes wrote: “The investigation into our CEO by the Cricket Regulator continues. He is currently suspended from the office and will remain so until we have clarity over the outcome of the investigation.\n“We are not able to influence this investigation, nor do we have any certainty over the timing of this. I am not in a position to comment any further on this matter.”\nCornish insisted that he is on “an extended leave of absence” and declined to comment further. He has denied any inappropriate behaviour, and said in November that he was stepping away from the club for personal reasons.\nCrouch advising Wednesday bidder Bord\nFormer Sports Minister Dame Tracey Crouch, who chaired the 2021 Fan-Led Review which recommended the creation of the Independent Football Regulator, now finds herself on the other side of the fence as she is advising the preferred bidder for Sheffield Wednesday.\nCrouch is managing director for sport at Hanover Communications, which has been engaged by James Bord’s lawyers, Sheridans, to provide support on the professional gambler’s proposed £30m purchase of Wednesday.\nHaving been given preferred bidder status by administrator Begbies Traynor in November, the next hurdle for Bord’s consortium to clear is the owners’ and directors’ test, which will be administered by the EFL before the IFR takes over the process in May.\nBumble in frame for Sky comeback\nSky Sports could offer David “Bumble” Lloyd more regular work on its cricket team this summer after his one-off return at the T20 Blast finals day last September was well received.\nThe former England coach left Sky after 22 years in 2021, but has continued to commentate for BBC Radio Lancashire and covered the Ashes for The Overlap’s Stick to Cricket podcast.",
  "word_count": 971,
  "scraped_at": "2026-02-14T02:19:21.165417",
  "_text_extracted": true
}