{
  "article_id": "5996fdf10e03",
  "url": "https://www.justarsenal.com/all-mikel-arteta-purchases-ranked-from-the-worst-to-the-best/387678",
  "title": "All Mikel Arteta purchases - Ranked from the worst to the best",
  "date": "20250226T130000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "So, I thought I would be influenced by some of the talking points occurring on the site.\nWith no weekend fixture, I will carry on doing so.\nI have noticed this week on JustArsenal the heaviest criticism Mikel Arteta has received since returning to the club. Even long-term readers who have defended his record over the last five years are suggesting whether he should start next season, fearing for his job.\nWhat is more divisive is who should be accountable for failing to improve our attack in January.\nOne theory is that the Kroenke family backed him but didn’t want to trust him with any more funds last month. That would contradict making him the third highest-paid coach in the world (they managed to find money then). In most workplaces, if your boss is getting tired of your output, they don’t give you a pay rise.\nLet’s, though, explore how much our manager has been backed and what his success rate is.\nThese are ranked from worst to best.\n(I love to know yours, peeps.)\nWillian – Free Transfer\nHow high this ranks depends on how much you consider that at least we didn’t pay a fee for the Brazilian.\nHe was, however, earning £240,000 a week in North London. He earned some respect from Gooners by not fighting against having his contract ripped up after one season, essentially walking away from guaranteed money in the region of £20 million.\nIt meant he never got to play in front of our fans.\nDid the pandemic impact him? Or did he struggle in our youthful dressing room compared to the standards set at Chelsea?\nGiven he got 11 goals in his final year at the Bridge and the form he has shown at Fulham, there are reasons we are not aware of as to why it didn’t work out at the Emirates.\nLokonga – £17.2 Million\nThis is just looking like a mistake.\nLoan moves for the Belgian were designed for his development, but at Palace and Luton, he did little to prove his doubters wrong.\nThe problem with a lot of players Arteta washes his hands of is that they are on such high wages it’s a struggle to find anyone willing to pay a fee.\nHence why Sevilla have been happy to borrow him but not with any obligation to buy.\nIt will stay that way until his contract expires.\nTavares – £8 Million\nWith Lazio’s obligation to buy, the Gunners could break even on the left-back, but Tavares’ experience in North London is an example of Arteta’s poor man management once he gives up on a player.\nOur manager subbed the Portuguese after just 35 minutes in an FA Cup tie and at half-time in the Premier League. Meanwhile, on Amazon’s All or Nothing documentary, he wasn’t shy about singling out the defender.\nThe 25-year-old clearly doesn’t agree with his treatment, insisting on his last two loans having a guaranteed transfer as part of the deal.\nGiven how he has performed in Serie A, we have lost out on serious money because of this friction between player and boss.\nAlex Rúnarsson – £2 Million\nIf you’re a young keeper who was only meant to be backup and played only six times as a Gunner, things have to go pretty wrong for you to be near the top of this list.\nHe was so evidently out of his depth in a League Cup tie against Man City that all parties immediately accepted he wasn’t ready for this level.\nAfter loans to Belgium, Turkey and Wales, he agreed to have his contract ripped up.\nTrusty – £1.8 Million\nLow on the list simply because paying any amount for a player who doesn’t play a second for you is not ideal.\nTo be fair to our manager, this is one of those signings a club makes with the long term in mind.\nThe American was immediately loaned back to Colorado Rapids and then sent to Birmingham to get him used to the physical nature of English football.\nHe couldn’t have done much more to impress in the Championship, voted the club’s player of the season.\nDid the left-back run out of patience, or was he simply not quite good enough?\nRelegated with Sheffield United might give you the answer, with Arsenal making a profit by getting £5 million. Now at Celtic.\nMarquinhos – £3.5 Million\nGooners originally got excited when we signed the 19-year-old Brazilian with a massive reputation in his homeland. As a teenager, he was voted for the prestigious Golden Boy award.\nHe scored and assisted in his Europa League debut.\nYet loans at Norwich and Nantes have left a question mark over whether he’s ready for European football, hence why he’s back in South America for the short term.\nOnly 21, though, so let’s not give up on him yet.\nVieira – £35 Million\nI’ve always felt our manager has got away with just how bad this piece of business has been.\nImagine giving Porto £35 million just to give him back for nothing two seasons later.\nAt 24, it could just be a case of too much too soon in terms of not being ready for the physicality of the English game. Yet he’s hardly pulling up any trees back in Portugal.\nArteta talks like the loan is part of the player’s development.\nWhy don’t I believe him?\nRaheem Sterling – Loan\nWhile no one at our club will publicly admit it, Sterling was simply a cheap option in the last few hours of August’s deadline day—a chance to bring in a body without paying a fee.\nWith Chelsea covering most of the player’s wages, it’s a risk-free loan.\nYet our manager clearly quickly identified the reasons Enzo Maresca didn’t want to register the winger in any of his squads. At 30, only the man himself knows those reasons, but even in games where we needed a goal, our manager has left him on the bench.\nWhen our boss was Pep Guardiola’s assistant at Man City, his ability to get the best out of talent in one-on-one situations was praised, with Sterling often cited as an example. So the two had a decent relationship at the Etihad.\nInjuries mean there is still a platform for Sterling to prove people wrong, which would be a great story.\nThe reality is, though, it’s been a few years now since his best form.\nNeto – Loan\nSome get too worked up about this, not understanding why we would loan someone knowing they were cup-tied for the Carabao Cup.\nI simply look at it as a case of needing a backup keeper in case anything happens to Raya, and there was a chance to bring in an experienced goalie without paying a fee.\nAll parties benefit. If you’re going to be number two at the Vitality, why not do the same at the Emirates?\nThe Brazilian is smart enough to know too many starts were unlikely.\nYet if the worst were to happen and our current number one got sidelined, I trust the 35-year-old to come in and do a job.\nHe didn’t exactly show that on his debut, but I’m glad he played so he feels part of the team.\nMatt Ryan – Loan\nVery similar to Neto, a chance to bring in a number two keeper who had ready-made experience in the division.\nPlayed three times for us, keeping one clean sheet.\nMatt Turner – £6 Million\nPlayed seven times for us as our cup keeper but never in the Prem.\nGiven what he would do in-between on the international stage, he was too good to be an understudy at his age—although he has yet to prove that at Forest or Palace.\nHis best performances have been for the USA.\nMari – Loan / £10 Million\nThe Gunners went through a few Januarys where the policy was not to make permanent signings (some things change yet stay the same). This was a deal that existed because it was a way to bring in a body without having to pay a fee until the summer.\nIn general, his stay in North London was not offensive. He was a solid squad player whom you could rely on. Arsenal got into a bad habit of loaning out players while their contracts ran down. The defender was loaned to Serie A for two years before Monza triggered a release clause, essentially meaning we broke even on the Spaniard.\nMerino – £32 Million\nMaybe too early to judge.\nHistory tells us some players need a season to get used to a new culture and the physical nature of English football, so he deserves the benefit of the doubt.\nFor the amount of money we paid, though, it could have been better spent elsewhere. He hasn’t been trusted to have a run in the team, and I’m still not sure what his strengths are.\nHis best contribution as a Gunner was his cameo at Leicester as a makeshift striker, which sadly tells you a lot.\nKiwior – £19 Million\nToo early to judge the 25-year-old, but there have been mixed messages so far from his boss.\nAt times, if Saliba or Gabriel had been injured, our manager chose to play Partey right back and Timber in the middle instead of trusting Kiwior.\nSome Gooners act like he’s an academy graduate and not someone who cost us nearly £20 million. That’s because it’s obvious Arteta doesn’t have faith in him.\nMany Italian clubs do, though, so watch this space.\nCedric – Loan / Free\nHe was originally signed on loan while his contract expired, but that felt more like a chance to bring a body in without paying a fee rather than anyone truly rating him.\nPut it this way: would we have been interested had we had to pay any serious money?\nDefensively, though, he could be trusted and was a decent crosser of the ball, a quality we didn’t exploit enough.\nWe eventually loaned him out to get him off the wage bill, while he spent his final year in North London knowing, if his employers had their way, he’d be elsewhere. Our manager, though, trusted the Portuguese enough to still include him in squads, something he didn’t do for other talent he phased out.\nCalafiori – £42 Million\nInjuries have meant he’s yet to manage a run of starts as a Gunner.\nIf all defenders were fit, I think long term he would be competing for the centre-back role instead of a makeshift left-back. We seem to be copying, at times, the Man City model of having centre-backs across the entire back four.\nThe Italian may have shocked some with his skill set. While he has a growing reputation in his homeland of being able to pass out from the back and start attacks, he seems to love carrying the ball and getting forward. This shows he has personality.\nA section of our fanbase seems frustrated that more money was spent on a defender, but that’s not the 22-year-old’s fault.\nTimber – £34 Million\nHarsh to rank him because a horrible injury means this essentially has been his debut season in English football. That’s literally the only reason I can’t put him higher on this list.\nHe’s done little wrong, though. You can trust him defensively, he has the tactical brain to know when to step into midfield, and doesn’t mind a physical battle.\nHe doesn’t get forward as much as I would like, but I assume that’s more his manager’s choice?\nBecause of his injury, Arteta probably wanted to manage his minutes this season, cautious if he could start every few days. He’s probably played more than he should have, though, which is a credit to the Dutchman.\nRamsdale – £28 Million\nI still maintain I never felt Ramsdale did enough wrong to be dropped, especially when other areas of the team needed strengthening.\nIt seemed harsh that, having played such a massive part in helping the club return to the Champions League, he got to play in the competition just once.\nAccording to his dad, Arteta never bothered to explain what the keeper did wrong or what areas he could work on to improve (probably didn’t help his son’s cause?).\nThe Kroenke family would have every right to know why Edu was authorising a pay rise for the goalie to then, a few months later, want another £32 million spent on the role.\nThis is what happens when you let a manager think it’s standard practice to just give up on a talent.\nAs a former player himself, the Spaniard must have known that goalkeeper is a position many don’t reach their peak until after the age of 30.\nSo if you’re spending £28 million on a goalie in his early twenties, surely you accept he’s learning on the job and a few mistakes are going to happen?\nHavertz – £65 Million\nLet me clarify, he’s only this low on the list because of the transfer fee and wages he earns.\nHe divides opinions among Gooners, but few would say he’s not a good footballer; he’s simply not a natural goalscorer.\nHe reminds me of the grief Giroud used to receive in the sense that it’s not his fault Arsenal chose not to bring in a proper striker to support him.\nOriginally, the plan seemed to be for the German to be a number 10 next to Odegaard, but when that didn’t work, he was moved up front. The issue being that if you’re one of the highest-paid players in our history, you should be the difference-maker, not someone whose manager can’t find his best position.\nThere were years of evidence at the Bridge that Havertz was never going to get you 15-20 league goals a season.\nNot sure how that wage was justified.\nTomiyasu – £18 Million\nWhen fit, he has been outstanding. The key word, though, is when.\nOften, Mikel Arteta is vague about the true nature of the defender’s injuries and plays down the length of time he will be unavailable.\nIt is, unfortunately, reaching the point where you question whether he ever be able to stay fit. This is a shame because, as someone who can play anywhere across the back four, we are missing him.\nZinchenko – £30 Million\nAnother player which sums up Arteta’s terrible habit of giving up on players the moment he feels they no longer suit his ethos.\nOur manager sees our players daily in training, so he might have his reasons, but it’s a long list of names he’s just washed his hands of.\nOriginally, he loved Zinchenko. Copying Pep Guardiola, our tactics were to have our left-back plan when to step into midfield. As time progressed, though, this was no longer catching opponents by surprise.\nThis season, it’s been clear that the Ukrainian is no longer trusted defensively, with him behind Tierney in the pecking order if we are protecting a lead.\nSurely, the third-highest paid coach in the world should be teaching the player on the training pitch how to improve? That’s got to be part of the job description?\nNot leaving a £30 million asset on the bench. With our lack of attacking options, I would be using him more.\nJorginho – £11 Million\nGiven that Caicedo had asked Brighton not to price him out of a move to Arsenal when we ended up with Jorginho that January, it seemed like an anticlimax.\nYet, he has given a young dressing room much-needed experience. I wouldn’t have had a problem if the Italian played more, as especially against top-level teams, I trust him next to Rice more than anyone else.\nOff the pitch, the 33-year-old is such a leader and has so much tactical understanding he’s being predicted to be a future manager.\nIt seems he’s heading to Brazil in the summer. Anyone else think he should have been offered a contract extension?\nTrossard – £24 Million\nLike Jorginho, Trossard originally seemed like an anticlimax when Edu had told us he had agreed a deal with Mudryk.\nVery quickly, it was apparent we found serious value.\nIf we had got over the line last year, his contribution in the run-in would have been more celebrated.\nPerhaps one of the best finishers at the club, although debates remain: is he better as an impact player off the bench?\nLacks the mentality to take responsibility and be the main man but a decent squad player.\nJesus – £45 Million\nStarted life in North London on fire. While not a natural goalscorer, the one attacker at times not afraid to at least try and do something different, taking on his man, altering position, always harassing defenders. Even when having a goal drought, you feel the Brazilian can do something unpredictable with his quick feet.\nOur current front three greatly miss him.\nUnfortunately, he is experiencing his second long-term ACL injury. Combined with niggling knee problems, the 27-year-old might have to accept that while his mind is willing, his body might not be anymore.\nHe’s in danger of his legacy as a Gunner being unlucky with his health.\nCruelly, it seemed he had finally refound his confidence after his last spell on the sidelines. Mentally, as much as physically, this must be an ordeal.\nI don’t think he will ever replicate his Man City form.\nPartey – £45 Million\nOf course, you can’t blame a player if he’s injury-prone, but the midfielder has had too many fitness issues to justify £45 million being considered well-spent.\nIt feels like every season since he moved to North London, he has a spell on the sidelines, meaning he’s not reliable.\nThe irony is that the one campaign he’s stayed largely healthy could be his last year at the Emirates.\nAt the age of 31, not trusted to play every few days, I can understand why his employers can’t defend continuing to pay him his current wage.\nRaya – Loan / £27 Million\nInitially, Raya divided opinion among the fanbase. Not because the Spaniard had done anything wrong, but did Ramsdale do so terribly that so much money needed to be invested in a position when other areas of the team needed strengthening?\nSince being made a permanent Gunner, though, the keeper couldn’t have done more to impress. The test of a decent goalie is their concentration level. Can they spend the majority of 90 minutes with nothing to do but deliver when called upon?\nHe’s produced some of the saves of the season.\nOdegaard – Original Loan / £30 Million\nSince moving to England, he has realised the potential many predicted he had, which prompted Real Madrid to buy him as a teenager.\nNot the most vocal, initially seemed an odd choice for captain but clearly leads by example.\nThe last two title challenges have coincided with his best form. Although comparisons with KDB are silly.\nAt times this campaign, he has been guilty of taking too many touches and overthinking his finishing, not helped by being our sole creative outlet. Wouldn’t shock me if he’s not fully fit after injury. He will find his confidence at some point.\nFor his price, though, incredible value.\nI sense some Gooners are turning on him, which seems harsh?\nRice – £105 Million\nEven when not playing well, I love his effort.\nHe was poor at the weekend, but recently I felt he was looking back to his old self, even trying to take responsibility by making more runs into the box to try and solve our attacking limitations.\nFor a while, it’s been predicted that the more the 26-year-old develops, he will become an all-round midfielder who adds goals to his game.\nPart of the problem is he’s great at so many things that it seems Arteta can’t decide what role he wants Rice to play.\nSet-piece delivery: world-class.\nA DM or box-to-box midfielder?\nA future Arsenal captain?\nBen White – £50 Million\nFor a while, I felt Ben White didn’t get enough credit, including from our fanbase.\nIronically, that changed just as he was announcing he didn’t want to represent England for the foreseeable future. Something tells me that will change now with the country having a new coaching staff.\nWhite has such a great footballing brain. He’ll start at right-back but knows when to form a back three, step into midfield, or overlap on the wing.\nWe’ve greatly missed his understanding with Saka, with White seemingly trusted more by Arteta to attack than other full-backs.\nIn a young dressing room where I still question the mentality, White is a leader who takes responsibility.\nGabriel – £26 Million\nIt’s easy to forget that there’s still a lot to like about our squad. That’s why so many Gooners are hurt, because they sense this young team is not far away from winning things but has let the moment pass us by.\nDefensively, though, we are one of the best in England – something I never thought I’d say about the Gunners.\nDuring the majority of Arsène Wenger’s reign, we didn’t score many goals from set pieces either.\nGabriel is a big part of us improving in both areas.\nI’ve always rated the 27-year-old but felt he had a mistake in him. This season, though, he’s really developed leadership skills. While Saliba gets the most headlines, it’s actually the Brazilian who is the vocal one, ordering his peers where to be and organising the entire back four.\nIt’s refreshing to see a centre-back who loves to defend, at times celebrating a block like it’s a goal.",
  "word_count": 3607,
  "scraped_at": "2026-02-14T01:52:15.327412",
  "_text_extracted": true
}