{
  "article_id": "59a24f4f23f6",
  "url": "https://www.nytimes.com/athletic/6265516/2025/04/09/arsenal-real-madrid-champions-league-analysis/",
  "title": "How Arsenal came of age on a night that could change everything",
  "date": "20250409T103000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Decorating one of the podiums outside the Emirates Stadium, just near the famous old clock, is an enormous artwork of young hopefuls walking towards a flag that bears the word “opportunity” and then, fully grown, back out under a flag that reads “greatness”.\nArsenal’s players poured their heart and soul into creating a zeitgeist of a night — when they had an opportunity in their grasp, they turned it into greatness. For this team, it was coming-of-age stuff.\nAdvertisement\nThe theme of the contest, which Mikel Arteta drilled into his players, was to seize the moment. “Make it happen,” he said. “Magic moments,” he repeated. It takes a lot for a group of players who crave winning a major trophy, who don’t have that shared experience yet, who needed to tackle a fearsome opponent knowing they are missing key members of their group, to have the courage not just to want it but to actually do it.\nThat’s what was on the line when Bukayo Saka dashed infield to win a free kick and had a little chat with Declan Rice as they hovered over the ball. In this era of micro-managed, pre-prepared football, Arsenal’s players took the initiative for themselves. Make it happen. Magic moments. Were those words ringing around inside their heads?\nArsenal set-piece specialist Nico Jover indicated for a cross. “But then Bukayo said, ‘If you feel it’,” Rice told Amazon Prime. He absolutely felt it. Guts overruled instruction. Instinct pushed the law of averages aside. With a sweep of his foot, Rice changed the trajectory of a knife-edge game in wondrous style.\nAs anyone who has endured Arsenal’s endlessly ineffective direct free-kick attempts over the past few years can testify — Arteta said afterwards it was the club’s first goal from such a scenario since September 2021 — success felt like sorcery indeed. So what better way to cast a lasting spell than to wave the wand once more for good measure? Rice’s second was struck with such elan that even a gargantuan goalkeeper of Thibaut Courtois’ stature and reach could not get anywhere near.\nSuddenly, this entire Arsenal team carried themselves with new confidence. They were unburdened from some of the caution of the first half. They pummelled Madrid with shots — some saved, some cleared off the line — and then crowned the scoreline with a sumptuous finish from Mikel Merino.\nAdvertisement\nAll over the pitch, Arsenal’s players seemed to grow before the eyes of the euphoric crowd. “Collectively, when you play the way we played and have the performance that we had, you need individuals at the highest level and they all took the game to a different level,” Arteta told reporters after the game.\nThe backstories behind some of these performances made it feel all the more remarkable. Consider Jakub Kiwior, under pressure to fill in for the influential Gabriel. Kiwior had sat on the bench as an unused substitute for three long months in the Premier League until very recently, but he was vigilant through and made some important interventions.\nJurrien Timber arrived at Arsenal and promptly missed almost an entire season with an anterior cruciate ligament injury. Here, he was at his tenacious best, loving the responsibility.\nMyles Lewis-Skelly, aged 18 and in the spotlight since his emergence, displayed a boldness and bravery that pushed his team on throughout the game. His contribution was immense.\nMerino, after a complicated start to his Arsenal career, has reinvented himself through sheer willingness to learn and has added a goal threat to his work ethic. Saka, not at peak fitness after his hamstring surgery, caused damage to Madrid and led by example. Even Kieran Tierney, who seemed surplus to requirements this season, came on for a spirited cameo at left midfield that he relished.\nThe entire squad were inspired by a team ethos that allowed them to craft probably the most impressive occasion at the Emirates since Arsenal moved here almost 20 years ago.\nOccasionally, in the life of a team, a pivotal experience changes their entire belief system. Whatever happens at Madrid’s Bernabeu stadium next week, Arsenal have taken a quantum leap in their development. Not so long ago, they were not even in Europe. Then they had the Europa League years. Next, they hauled themselves back into the Champions League — tentatively at first, then bit by bit, they have been trying to climb further into the competition.\nAdvertisement\nOverall, the 2024-25 season has been troubled, pockmarked by a range of destabilising injuries and weird game-affecting refereeing decisions that have never allowed them to hit their stride or find the momentum to build a convincing Premier League challenge. At times, Arsenal fans, players and staff must have thought to themselves: stop the season, we want to get off. The Champions League has given them highlights, and this was the best of the lot.\nThe next few weeks will tell more about the impact of this particular victory, and Arteta said all the right things about this being half-time of a contest that may well have twists and turns ahead. But whichever way things work, Arsenal have set themselves a new benchmark for what is possible — 3-0 against the most decorated of European champions is not the kind of result that comes along all that often.\nArteta tried to contextualise it afterwards. “I know how much work and how many decisions a lot of people have made in this football club, to live the night that we had,” he said. “I told them, ‘Thank you so much’. Now we have to go to the Bernabeu and do it, and that will be another step. There is still so much to do here.”\n(Top photo: Arsenal celebrate going 3-0 up; Adrian Dennis/AFP via Getty Images)",
  "word_count": 963,
  "scraped_at": "2026-02-14T02:02:35.585152",
  "_text_extracted": true
}