{
  "article_id": "5a3365749bbd",
  "url": "https://www.teamtalk.com/news/huge-ivan-toney-decision-revealed-arsenal-chelsea-battle-returning-strikers-signature",
  "title": "Huge Ivan Toney decision revealed as Arsenal and Chelsea battle for returning striker signature",
  "date": "20231218T140000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Huge Ivan Toney decision revealed as Arsenal and Chelsea battle for returning striker’s signature\nArsenal are determined to sign a new striker in January and Mikel Arteta has made Brentford front man Ivan Toney one of his top targets, TEAMtalk can exclusively reveal.\nWe can confirm that Toney would prioritise a move to Arsenal above other choices despite Chelsea also strongly considering making a bid for him in the winter transfer window.\nThe 27-year-old is a few weeks away from returning to competitive football on the back of a suspension for breaching the Football Association’s betting regulations.\nTEAMtalk understands that Real Madrid are also among the sides keeping tabs on Toney. They will soon complete the signing of the highly-rated Brazilian teenager Endrick from Palmeiras.\nThe Spanish giants are keen to build a new Galactico side fit for the future and added England midfielder Jude Bellingham to their ranks in recent months.\nBrentford, however, have offered a new deal to Toney and hope to convince him that he doesn’t need to move on.\nThe England international will have one year left on his deal come the end of the season – his current contract is due to expire in 2025 – but Thomas Frank’s side are desperate to tie him down to fresh terms before then.\nREAD MORE: Chelsea make decision on signing Arsenal goalkeeper Ramsdale, with another January splurge coming\nArteta keen on January move for Ivan Toney\nTEAMtalk sources have stated that Arsenal manager Mikel Arteta is a big fan of Toney and that is reciprocated with the frontman keen to play under the Spaniard.\nArteta has turned Arsenal into title contenders over the past two seasons and currently has them sitting top of the Premier League.\nThe Gunners are heavily favoured to make it into the Champions League next season regardless of their title bid and that is another factor in the decision-making of Toney. He is keen to play in the biggest competitions and at the highest level possible.\nThe prolific striker has been rumoured to have a release clause in his current deal of around £60million but sources have denied that any clause exists in his current deal.\nAny new deal that could be signed, however, would likely include a release clause and Brentford want at least £70million for his services.\nToney signed for Brentford in 2020 after showing his talent at Peterborough. The deal was done for below £5million, and any sale would see Frank and his side make a huge profit on their star man.\nHe scored an impressive 20 goals in the Premier League last season, with only Erling Haaland (36) and Harry Kane (30) scoring more.\nIf he could replicate that form for Arsenal, he could help fire the North Londoners to their first title since 2004.\nDON’T MISS: Champions League round of 16 draw: Man City get dream tie, Arsenal favourites to reach quarter-final",
  "word_count": 484,
  "scraped_at": "2026-02-14T01:56:38.153537",
  "_text_extracted": true
}