{
  "article_id": "5a36ef7c2657",
  "url": "https://www.arsenal.com/news/preview-arsenal-v-porto",
  "title": "Preview : Arsenal v Porto",
  "date": "20240312T074500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Having returned from Porto three weeks ago stung by a late winner for the hosts, Tuesday night sees us search for the two-goal victory that would clinch our first Champions League quarter-final in 14 years.\nGaleno’s stoppage-time strike has handed our opponents a slender 1-0 first-leg advantage, but having won all three of our league matches since to top the Premier League, Mikel Arteta will be hoping a combination of that form plus home advantage can see us advance.\nAmidst what is sure to be a special atmosphere in north London, we will be hoping history can repeat itself. Only once in our past 10 attempts have we managed to progress in the Champions League after losing the first leg, which was against the Portuguese giants in 2010 - ironically the last time we clinched a quarter-final berth.\nThe first leg\nPorto scored with virtually the last kick of the game to win a disjointed first leg in Portugal.\nThere was very little to choose between the sides in a stop-start encounter as the home team looked to stifle our play at every opportunity. Despite seeing more of the ball – and putting 10 corners into dangerous areas – we couldn’t break down our opponents, and were hit with a sucker punch very late on when Galeno curled home a wonderful strike from outside the area.\nPorto’s English hoodoo\nThe Primeira Liga title looks to be slipping away for Porto, as they trail leaders Sporting Lisbon by seven points with nine games remaining, but since we faced off in the first leg they have taken a couple of big steps towards closing the gap between them and Benfica, who occupy the second Champions League qualification spot.\nA 94th-minute equaliser for Gil Vicente salvaged a 1-1 draw that seemingly killed off all hopes of a top-two finish, but then an incredible 5-0 thrashing of reigning champions Benfica trimmed the gap to six points. A comfortable and expected 3-0 win at Portimonense on Friday saw the in-form Galeno score his fifth goal in his last five outings.\nHowever they have never won a competitive European game in England in 22 attempts, and despite boasting plenty of Champions League pedigree having lifted the trophy in 2003/04, they have never won both legs of a knockout tie in the competition before, but they head to north London knowing a draw after 90 minutes will be enough.\nFind out much more about Porto's history, their current squad and how their season has been so far\nWhat the managers say\nArteta: \"We’re certainly going to have to tweak a few things to generate much more than what we did against them. It’s the level of the Champions League; you’re facing top teams, the fact that there are two games as well plays on your mind and we’re going to have to be better tomorrow.\n\"Now we know them a bit better. We have played these kind of games many times in the Premier League, we played one two days ago. We’ll just focus on being ourselves and do more of the things that we can control better than we did a few weeks ago.- read every word from Mikel’s pre-match press conference\nSergio Conceicao: \"Arsenal is part of the best championship in the world, and is accustomed to an intensity much higher than all its opponents in Europe. We are always competitive and tomorrow we will certainly be.\n\"We have to look at what our team is, looking at the great quality of Arsenal, which understands every moment of the game, exerts constant pressure. It's a complete team, well-trained, and any of the players are very strong. We look at it with respect, not with any kind of fear.”\n\"[The atmosphere] means little to me. The atmosphere is part of football and we also have our fans, in fewer numbers, but with more passion. Declarations don't play, it's the players who play.\"\nTeam news\nDavid Raya is available again after not being able to play against his parent club Brentford on Saturday, while it remains to be seen if Gabriel Martinelli will be fit enough to be involved after he missed the game with a foot issue.\nArteta also hopes that Takehiro Tomiyasu might be available for the first time in 2024 after he returned to training, and since the first leg, Fabio Vieira, Oleksandr Zinchenko, Gabriel Jesus and Thomas Partey have all returned to action, leaving Jurrien Timber as our only other concern.\nProlific striker Mehdi Taremi missed the previous encounter with a thigh problem but may be fit enough for the return leg, most likely with a spot on the bench.\nLeft-back Zaidu Sanusi and veteran centre-back Ivan Marcano are sidelined for the season, while youngster Gabriel Veron has also been struggling all campaign with an Achilles issue.\nTalking tactics\nAdrian Clarke, writing in the official matchday programme: Conceicao inspired a defensive tactical masterclass at the Estadio Dragao by sacrificing a high-intensity pressing game for a well-organised, pragmatic approach. His 4-2-3-1 became a 4-5-1 out of possession, with their nominal No.10 Pepe dropping back into the right of midfield to pack central areas. Wide men Galeno and Francisco Conceicao were also extremely diligent in the way they retreated behind the ball.\nIn that game they enjoyed just a 35 per cent share of the ball, so we can expect them to sit back in their shape once again, attempting to frustrate us. From that solid five-man midfield base, they will try to force turnovers that catch us cold.\nIt was clear that the Portuguese side will also look to slow down the pace of the game and make it a fragmented affair that is bitty in style, rather than free-flowing, and they will likely repeat this ploy, adopting a mid-block designed to crowd space and disrupt our passing rhythm. Rarely making a mistake, they were supremely disciplined in carrying out the manager’s instructions. Conceding just 17 goals in 24 domestic league matches they are a very smart defensive outfit.\nMost of their most dangerous attacking forays come from the flanks, but they do lack a touch of creativity inside the final third. In the Primera Liga they have a combined xG of 28.01 in open play, which is way below the likes of Sporting (36.8), Braga (39.24) and Benfica (45.8). All those outfits have scored more open-play goals than Porto, as have minnows Estoril and Arouca.\nFacts and stats\nWe have won all three of our home meetings with Porto in all competitions by an aggregate score of 11-0.\nWe have lost each of our last five home games in the knockout stages of the Champions League, with each of these coming in the round of 16.\nPorto have won just two of their 22 away games in the knockout stages of the competition, with both of those victories coming in Spain – against Deportivo de La Coruna in the 2003/04 semi-final, and Chelsea in Seville in the 2020/21 quarter-final.\nWe have won all three of our European home games this season by an aggregate score of 12-0. We’ve never won four in a row at home without conceding in the Champions League.\nBukayo Saka has both scored and assisted a goal in all three of his Champions League home appearances so far. The only player to do so in four consecutive home games in the competition is Karim Benzema, who did so in the 2011/12 campaign for Real Madrid.\nGaleno has been involved in eight goals in six European appearances this season (five goals, three assists).\nMatch officials\nFrenchman Clement Turpin will be the man in the middle. An experienced official, he has been on the FIFA list since 2010 and has taken charge of matches at each of the last two World Cups and European Championships, as well as the 2022 Champions League final between Liverpool and Real Madrid.\nIt will be the fifth time the PE teacher has refereed us, with the first coming back in 2014 when we drew 3-3 with Anderlecht in the Champions League group stages when he awarded us a penalty that Arteta scored. We have not lost any match he’s officiated, which includes our Europa League win at AC Milan in 2018 and a 3-1 success over Valencia the following year.\nReferee: Clement Turpin (FRA)\nAssistant Referee: Nicolas Danos (FRA)\nAssistant Referee: Erwan Finjean (FRA)\nFourth Official: Ruddy Buquet (FRA)\nVAR: Jerome Brisard (FRA)\nAssistant VAR: Willy Delajod (FRA)\nPrevious meetings\nAll seven of our previous meetings have come in the Champions League, with our first-leg loss continuing the trend of no away victories recorded in those encounters.\nThe first meeting came back in 2006/07 when we won 2-0 at home thanks to goals from Thierry Henry and Alex Hleb before drawing 0-0 away, while in 2008/09 we were victorious by a 4-0 scoreline when Robin van Persie and Emmanuel Adebayor bagged braces, before losing 2-0 away from home.\nThose ties were in the group stage, and the last time we locked horns was in the round of 16 the following season, when we overturned a 2-1 loss in the first leg with an emphatic 5-0 home win to advance thanks to Niclas Bendtner’s treble.\nLive coverage\nAn hour before kick-off, Nick Bright and Adrian Clarke will be live on Arsenal.com and the official app to provide all the best build-up on this massive Champions League night.\nThey’ll be joined by Arsenal royalty as Aaron Ramsey and Faye White will provide their expertise as they try to predict what might pan out, while Nicole Holliday will be out and about getting the thoughts of our Gooners.\nActor Asa Butterfield will be popping by the studio to build his ideal Arsenal footballer, while social media stars ChrisMD, Arthur Hill and That’s Watson will also be showing off their knowledge\nThen from 8pm UK time, live commentary comes from Dan Roebuck and Jeremie Aliadiere as they hope to be talking you through a classic European encounter.\nYou can also find out what broadcasters are showing the game live on TV wherever you are in the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1715,
  "scraped_at": "2026-02-14T01:54:34.175134",
  "_text_extracted": true
}