{
  "article_id": "5a484a52df5a",
  "url": "https://www.barcablaugranes.com/2024/10/17/24270292/why-ronald-araujo-will-need-to-wait-his-turn-again-for-barcelona",
  "title": "Why Ronald Araujo will need to wait his turn again for Barcelona",
  "date": "20241017T104500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The time is getting closer for Ronald Araujo to be considered for the Barça starting XI.\nWhy Ronald Araujo will need to wait his turn again for Barcelona\nCan’t change a winning team...\nAt any other point during his career with the Blaugranes this would be a formality, however, the way things have been going this season, it won’t be a foregone conclusion.\nThe player himself has made his own stance clear of late, and one wouldn’t expect anything else from a player who has proven himself to be a real warrior at the heart of the Barca defence.\nHansi Flick too has recently talked up the Uruguayan’s candidacy, suggesting that there’s every chance Araujo won’t be long in returning to the fold.\nThat said, there’s the old saying in football that you don’t change a winning team, and surely that will be at the back of the German’s mind too.\nIt’s not as if culers could point to either Inigo Martinez or Pau Cubarsi being the fall guy and the one to make way, because both have been brilliant so far.\nBefore his injury, Araujo was making some elementary errors as well as some awful high-profile ones in big games that cost the Catalans dearly.\nDoes Flick really want to risk upsetting the equilibrium just to shoehorn the 25-year-old in?\nIt may well be that he gets his chance because of injuries or loss of form, however, he does still need to earn his place back in the starting XI… doesn’t he?\nIt’s a great conundrum for Hansi Flick to have and that kind of strength in depth is what wins cups and league championships.\nThere’s even a cogent argument for the coach to be selective once Araujo is back to full fitness and pick certain players for certain fixtures knowing that there won’t be any weakness to the XI in so doing.\nFor now, the XI is settled and playing well and it would take a brave man indeed to tinker with that just because he might feel under pressure to do so.\nFlick has already shown he isn’t frightened to make unpopular decisions, so Ronald Araujo might still be waiting a while yet before he gets to pull on the Blaugrana again in earnest.",
  "word_count": 377,
  "scraped_at": "2026-02-14T02:01:51.715844",
  "_text_extracted": true
}