{
  "article_id": "5a6d17096742",
  "url": "https://thepeoplesperson.com/2025/12/28/barcelona-shareholders-want-permanent-deal-for-rashford-poll-finds-302877/",
  "title": "Barcelona shareholders want permanent deal for Rashford , poll finds - Man United News And Transfer News",
  "date": "20251228T210000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United appear to be one step closer to finally sealing the permanent departure of Marcus Rashford.\nSince manager Ruben Amorim’s arrival at the club, he has indicated that Rashford has no role in his future plans.\nAs such, the Englishman was shipped off to Aston Villa last season on a short-term loan.\nPrior to the current campaign, Man United secured a season-long loan for the winger at FC Barcelona, a club that Rashford expressed a strong desire to represent.\nNow, it seems that a permanent deal for the player could be firmly in the works.\nRashford’s Barca breakthrough\nSince arriving at the Camp Nou at the start of the season, Rashford has completely revived his career, representing the Blaugranas in La Liga and the UEFA Champions League.\nRashford recently revealed how ecstatic he is to be playing for Barcelona, calling it a “huge honour.” In fact, he even revealed that he has enjoyed learning a new language and adapting to a new culture.\nAccording to a recent report, Barcelona has set two terms that Rashford needs to meet for a permanent deal to be considered. Firstly, he would need to work harder on the pitch, and secondly, he would need to be willing to take a pay cut, especially since Barca has been suffering from financial difficulties.\nBut, ultimately, Barcelona’s owners would need to be open to accepting Rashford at the club on a permanent deal. Following a fresh update, we now know their opinion on the player.\nThe verdict\nUnlike the typical football club, Barcelona is owned by its fans, who are known as “socios”. These members each own shares in the club and thus have democratic control over its operations.\nMundo Deportivo reported today that a survey was conducted among Barcelona members asking whether or not they would want to keep him at the club beyond his loan deal.\nOf all shareholders who were surveyed, 54.6% expressed their desire for the club to sign him permanently, while just 35.6% were against the move. Another 6.3% felt that it would be better to decide closer to the end of the season, when they have seen more of Rashford in a Barca jersey.\nThese results are crucial for the club’s management to take into account, as they express the desires of not only Barcelona’s core fanbase but their owners as well.\nIf democracy is considered when determining Barcelona’s transfer strategy, United may finally have found a permanent home for their academy graduate.\nFeatured image Paul Miller via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 443,
  "scraped_at": "2026-02-14T01:59:31.509760",
  "_text_extracted": true
}