{
  "article_id": "5a894f58c7fd",
  "url": "https://www.teamtalk.com/arsenal/pablo-barrios-martin-zubimendi-arsenal-alternative",
  "title": "Arsenal transfers : Gunners identify  outstanding  midfield  gem  as Zubimendi alternative for £82 . 5m",
  "date": "20250302T170000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal identify ‘outstanding’ midfield ‘gem’ as Zubimendi alternative, with £82.5m bid to seal deal\nArsenal have identified Pablo Barrios as a potential alternative to Martin Zubimendi, with a well-connected journalist revealing what the Gunners truly think of the Atletico Madrid midfielder, who has been linked with four other top Premier League clubs.\nZubimendi is one of the best defensive midfielders in the world and is unlikely to stay at Real Sociedad beyond the end of the season. TEAMtalk’s transfer correspondent Ben Jacobs has reported that Arsenal are “cautiously optimistic” about signing Zubimendi, adding that “a broad set of personal terms have been verbally agreed upon in terms of wage and bonus structure”.\nHowever, Arsenal are not getting carried away, especially with Real Madrid also keen on the Spain international midfielder.\nMadrid reportedly believe that their “extraordinary” relationship with Sociedad will help them get a deal done for Zubimendi.\nManchester United are also reported to have joined the race for the 26-year-old midfielder, who won Euro 2024 with Spain.\nAccording to journalist Graeme Bailey, Arsenal have identified Atletico and Spain international midfielder Barrios as a potential alternative to Zubimendi.\nBarrios has come through the Atletico youth system and has established himself in the first team.\nThe 21-year-old has given two assists in 27 matches in all competitions so far this season for Atletico, who are at the top of the LaLiga table and have also reached the Round of 16 in the Champions League.\nBailey told Arsenal Insider: “Arsenal want Zubimendi, we know that. He is the top choice for them and talks have been ongoing since January.\n“However, I would say that whilst confident, Arsenal are not naive and realise that there is other interest in him.\n“With that, there is a continual assessment of talent across the board and midfield is no different, and I am told one player who has stood out to them this season is Pablo Barrios – Atletico Madrid’s outstanding young talent.\n“He really is a gem of a player and let’s not forget Arsenal have raided Atletico for a midfielder before in the shape of Thomas Partey – who ironically could very well be leaving this summer and making room in midfield for another new name.”\nWhile Bailey has not mentioned the transfer fee that Arsenal will have to pay for Barrios, there is a release clause of €100million (£82.5m, $104m) in his Atletico contract.\nIf Atletico refuse to sell the midfielder for less than his release clause, then it would make Barrios a more expensive signing than Zubimendi, whose release clause is £51million.\nREAD MORE ➡️ Free agents: The three best unattached players available in each position\nArsenal face competition for Pablo Barrios\nWhile Arsenal may fancy a move for Barrios in the summer transfer window, the north London club are not going to have it all their way.\nThat is because the Gunners will face competition for the youngster from at least three other Premier League clubs.\nArsenal’s north London rivals Tottenham have already expressed an interest in Barrios and are said to be willing to break the bank to sign him.\nThe Spanish media has reported that Chelsea have taken a shine to Barrios as well and are ready to pay €70million (£58.3m / $72.3m) for him.\nIn October 2024, Liverpool were reported to have shown a “marked interest” in the Spaniard, while Manchester City were linked with him following the injury to Rodri before the defending Premier League champions signed Nico Gonzalez in the January transfer window.\nLatest Arsenal news: Partey contract, Saliba plan\nArsenal reportedly considered letting Thomas Partey leave at the end of the season, but there is now speculation that the Gunners are ready to hand the defensive midfielder a new contract.\nHowever, Arsenal want Partey to take a pay-cut to extend his stay at the Emirates Stadium.\nArsenal have also hatched a plan to stop Real Madrid from signing William Saliba in the summer transfer window.\nThe north London club are ready to offer Saliba a new contract worth £250,000 per week.\nMeanwhile, it has been reported that Arsenal are keen on a deal for Wolves left-back Rayan Ait-Nouri.\nIN PROFILE: Who is Pablo Barrios?\nBorn in Spain’s capital in 2003, Barrios spent six years in the Real Madrid academy before moving to Atletico’s youth system in 2017 for a further five years of development.\nDuring the 2021-22 season, Barrios was heavily involved as Atleti’s under-19s reached the semi-finals of the UEFA Youth League. For example, in one game, he scored a brace and provided an assist against Real Madrid.\nFor the following campaign, he was promoted to Atleti’s reserve team – but not long later, he would be promoted again to the first team. Indeed, he made his LaLiga debut on October 29, 2022 – just 56 days after his Segunda Division debut for the B team.\nOver that winter, the midfielder scored in the second and third rounds of the Copa del Rey and extended his contract, representing his permanent installation into the first team.\nAfter helping Spain’s U23s win the men’s Olympic football tournament in 2024, Barrios was also awarded the number eight shirt by his club, on the back of a season in which he played 35 times in all competitions.\nBarrios now has more than 50 LaLiga appearances to his name, although he is yet to score in the Spanish top tier. That said, he has been playing in a deeper role, though he is a reliable carrier of the ball and not just your typical, Diego Simeone-approved dogged midfielder.\nBut Barrios is learning plenty from the senior players around him, citing club captain Koke as his “role model both on and off the field.” All he is taking in will equip him for a solid career as a well-rounded midfield talent.",
  "word_count": 976,
  "scraped_at": "2026-02-14T01:58:05.311853",
  "_text_extracted": true
}