{
  "article_id": "5a92de1936f3",
  "url": "https://www.the42.ie/ange-postecoglou-spurs-4-6380426-May2024/",
  "title": "Postecoglou using fan debate to deflect and find leverage",
  "date": "20240516T001500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THIS WEEK HAS been a timely reminder that being a Football Man does not necessarily mean you know what it is to be a football fan.\nAnge Postecoglou is the latest figure at the elite level of the game to show himself up when it comes to his credentials.\nBack in March he rallied to the defence of those day-tripper supporters that help fill the Tottenham Hotspur Stadium and pay a hefty price to do so when they were labelled ‘plastic’ by a reporter in a press conference.\n“See, that’s really harsh. I’ll tell you why, because I’m probably plastic and touristy because I am coming from the other side of the world and am really passionate about football,” the Australian said.\n“If I could get access to see a Premier League game, that was the world to me.”\nBeing a fan of football – a student of the game, you might say – is not the same as being a fan of a team.\nMost of those who earn their living from the sport – managers, coaches, players – haven’t a notion of what it really means to be a supporter.\nWhy would they?\nThe love of the game would have been there early and got them hooked but once in the professional system it becomes a different existence.\nPaths diverge at a crucial juncture in the life cycle of the participant and the onlooker.\nThe game takes on a completely different meaning for those seeking to make a living from it and those who very often use it as the centrepiece for their lives, socially and emotionally.\nSpite, pettiness and jealousy are traits that all sides should be able to understand given the cut-throat, vindictive nature of the business is also what drives so much of the tribalism in the stands.\nPostecoglou couldn’t comprehend the feelings of those Spurs fans who were gleeful last night as Manchester City earned a 2-0 win that almost certainly ensures Arsenal will not win the Premier League for the first time in 20 years.\nEven if the result also ruled out their own side’s slim chances of qualifying for the Champions League.\n“I’m not interested mate. I just don’t care,” he said when it was pointed out to him that some home fans were singing ‘Are you watching Arsenal?’ during the game.\n“Maybe I’m out of step, but I just don’t care, I just want to win. I want to be successful at this football club, it’s why I was brought in.\n“So what other people, how they want to feel, and what their priorities are, are of zero interest to me. I know what’s important to build a winning team, that’s what I need to concentrate on.\n“I can’t dictate what people do. They’re allowed to express themselves any way they want.”\nBig Ange is a Football Man and it seemed as if he was doing what all good Football Men do by using the fan debate and discussion about what Spurs fans wanted as a way of finding leverage to get more from his bosses and make his job easier over the summer.\n“I think the last 48 hours has revealed to me that the foundations are fairly fragile, mate,” Postecoglou said after that 2-0 loss last night.\n“That’s just what I think. I just think the last 48 hours have revealed a fair bit to me. That’s alright. It just means I’ve got to go back to the drawing board with some things.”\n“Outside, inside, everywhere.”\nIt shouldn’t have taken until the last two days, and all of the talk about a supposedly weak, small-time fanbase feeding into the debate, for the Spurs manager to realise that.\nSpurs lost five of their last six games in the run-in to claim a Champions League spot.\nThat is why Postecoglou wasn’t able to get over the line for a top-four finish that, in truth, no one envisaged at the start of the season.\nHe was unable to find a way to get over the line at a time when rivals Aston Villa also dropped enough points (nine) in their last six games to hand Spurs the initiative.\nSpurs weren’t good enough when it mattered and that’s something any Football Man and fan could see.",
  "word_count": 713,
  "scraped_at": "2026-02-14T02:25:33.990293",
  "_text_extracted": true
}