{
  "article_id": "5a9c40eb66f7",
  "url": "https://www.caughtoffside.com/2026/02/01/arsenal-mikel-merino-injury-setback-title-race/",
  "title": "Arsenal hit by injury blow as Mikel Merino faces lengthy absence",
  "date": "20260201T213000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal are facing a significant injury blow with Mikel Merino set for a ‘sustained spell’ on the sidelines as per BBC.\nThe 29-year-old Spain international was a notable absentee from the Gunners’ dominant 4-0 victory over Leeds United on Saturday, with fears now mounting that a serious foot injury could derail his impressive season.\nManager Mikel Arteta confirmed that the former Real Sociedad star is set to consult specialists after complaining of persistent pain.\nMikel Merino has been a key player for Arsenal\nSince his arrival in August 2024, Merino has become an key player for Mikel Arteta’s side.\nMerino has already netted six goals and assisted another three across all competitions, providing a unique goal-scoring threat that has often bailed Arsenal out in tight fixtures.\nMikel Merino 25/26 stats across all competitions via Transfermarkt\nHis tactical versatility has also been vital. Whether shielding the back four alongside Declan Rice or acting as an “emergency striker” during late-game surges, Merino’s presence has allowed Arteta to rotate his squad effectively.\nWith a gruelling February schedule, including a Carabao Cup semi-final second leg against Chelsea and the return of Champions League football, his absence will leave a massive void in Arteta’s team.\nArsenal’s league title to lose?\nDespite the injury blow, Arsenal currently sit in a commanding position.\nThe victory at Elland Road moved the Gunners seven points clear at the top of the Premier League table, with 53 points from 24 matches.\nAfter finishing as runners-up for three consecutive seasons, the north London side are finally being viewed as the team to beat.\nHowever, the timing of Merino’s injury, coupled with a late scare for Bukayo Saka during the Leeds warm-up, has reignited fears about the squad’s depth.\nArsenal are considered favourites to win the title this year, however, with recent history not on their side, any setback could impact the team morale.\nArteta will hope that his side can navigate through this period without any more setbacks and maintain the lead on the top.",
  "word_count": 334,
  "scraped_at": "2026-02-14T01:53:15.572511",
  "_text_extracted": true
}