{
  "article_id": "5aa269ea8be4",
  "url": "https://metro.co.uk/2025/12/26/walked-man-city-medical-join-arsenal-man-utd-25531153/",
  "title": "I walked out of Man City medical to join Arsenal from Man Utd",
  "date": "20251226T154500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City were on the verge of signing a Manchester United hero when Arsenal manager Arsene Wenger hijacked the deal.\nFour-time Premier League winner Mikael Silvestre agreed a controversial move to Man City in the summer of 2008 as he entered the final year of his contract at Old Trafford.\nSilvestre had spent almost a decade at United, making 361 appearances for the Red Devils and helping Sir Alex Ferguson win four Premier League titles, the Champions League, FA Cup and League Cup.\nThe ex-France international played at least 45 games in six successive seasons at Manchester United but his game-time was affected by injury problems and a dip in form.\nThe then-Manchester City boss Mark Hughes tried to sign Silvestre from local rivals United and the defender was set to cross the city divide after agreeing a deal.\nSilvestre was in fact ‘halfway through’ a medical at the Etihad Stadium when he aborted the move due to an approach from Arsenal legend Wenger.\nThe Champions League winner revealed Wenger ‘reached out to me through a friend’ and says he immediately decided to snub Man City for Arsenal.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I almost signed for Manchester City in 2008, believe it or not,’ Silvestre told Casino Beats. ‘I was halfway through my medical in Manchester and was very close to finalising a move to the club.\n‘However, Arsene Wenger reached out to me through a friend to try and get me to sign for Arsenal during the medical. I couldn’t turn that offer down, and I signed for the club the very next day.\n‘It was a crazy situation. Nowadays when a club does a medical, they do it all in one day and don’t let the players leave the room to make sure the deal goes through.’\nMore Trending\nAfter Wenger worked his magic, Silvestre moved to Arsenal for an undisclosed fee, becoming the first player to make that particular transfer since Brian Kidd in 1974.\nA now injury-prone Silvestre did not leave a lasting legacy at Arsenal, however, leaving the club two years after his arrival having played 43 games.\nSince that transfer saga in 2008, Arsenal have signed two more players from Manchester United – Danny Welbeck in 2014 and Henrikh Mkhitaryan in 2018.\nRobin van Persie and Alexis Sanchez are two most high-profile Arsenal players to make moves to Manchester United, although young defender Ayden Heaven followed suit at the start of the year.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Transfer interest stepping up in Manchester United flop Manuel Ugarte\nMORE: I snubbed Manchester United transfer – and then became a legend at Liverpool\nMORE: Next Chelsea manager odds as Enzo Maresca agrees to leave",
  "word_count": 516,
  "scraped_at": "2026-02-14T01:59:31.513141",
  "_text_extracted": true
}