{
  "article_id": "5aa6dc6e9843",
  "url": "https://www.thenews.com.pk/print/1138334-man-city-go-for-full-house-of-trophies-at-club-world-cup",
  "title": "Man City go for full house of trophies at Club World Cup",
  "date": "20231214T223000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City go for full house of trophies at Club World Cup\nJEDDAH: Pep Guardiola is hoping to complete his trophy haul as Manchester City manager at the Club World Cup in Saudi Arabia as the Gulf Kingdom shows off its wares in hosting a major international football tournament for the first time.\nCity travel to Jeddah, the host for all seven matches in the tournament, looking to add a first Club World Cup to the treble of Champions League, Premier League and FA Cup they won last season.\n“We miss just one trophy to finish the circle and win all the titles City can have,” said Guardiola, who has already won the competition three times during his spells at Barcelona and Bayern Munich.\n“We will go there and prepare because for us it is a dream.” Despite a recent four-game winless streak in the Premier League, City are strong favourites to lift more silverware.\nNot since Corinthians beat Chelsea in 2012 have the Champions League winners failed to lift the Club World Cup. No matter who emerges victorious from the final on December 23, there will be a new name on the trophy.\nFluminense are South America´s representatives after winning the Copa Libertadores for the first time last month. However, the major threat to City could come from the rise of Saudi as a sporting hotbed.\nAl-Ittihad have only qualified due to their status as champions of the host nation but boast a wealth of previous Club World Cup winners in Karim Benzema, N´Golo Kante and Fabinho. Benzema became the first player to ever score in four Club World Cups as Al-Ittihad swept aside Auckland City 3-0 in the first round on Wednesday.\nNext up they face against African champions Al Ahly of Egypt in the quarter-finals. The winner of the other quarter-final between Mexico´s Club Leon and Urawa Red Diamonds will meet City when they enter the competition at the last four.\nBenzema, Kante and Fabinho were just some of the star names who have recently swapped top European clubs for the riches on offer in the Saudi Pro League.\nThat was just the beginning of an offensive to turn the country into a football powerhouse. Saudi is set to host the 2034 World Cup and looks almost certain to also be awarded future versions of a revamped Club World Cup.\nThis will be the final edition of the current format before it expands to a 32-team tournament every four years from 2025.\nThe United States will host the first expanded Club World Cup as it prepares for to welcome the World Cup the following year. However, Saudi is then expected to step in to add to its growing portfolio of major sporting events that includes a Formula One Grand Prix, major boxing bouts, tennis and golf events.\nThe conservative desert monarchy is also lining up a bid for the Olympic Games. A string of other sporting interests include Premier League club Newcastle United and LIV Golf.\nA huge investment in sport is designed to promote Saudi´s international reputation, diversify its economy and promote tourism. However, critics believe that under its 38-year-old de facto ruler, Crown Prince Mohammed bin Salman, there is an attempt to “sportswash” its human rights record.\nAmong the concerns raised by rights groups are laws against homosexuality, gender inequality, freedom of speech and frequent use of the death penalty. Micah Hamilton said he had been left struggling for words following his goalscoring debut for Manchester City in the Champions League.\nOnce a ball-boy with the English giants, the 20-year-old seized his chance after manager Pep Guardiola made several changes to the team for Wednesday´s concluding ´dead´ group-stage match away to Red Star Belgrade.\nHamilton opened the scoring in the first half with a fine strike and also secured a late penalty as holders City won 3-2 to end Group G with six wins from six.\n“I don´t even know what to say,” City academy graduate Hamilton told the club´s website. “I started just trying to ease into the game and then the moment came and I just took the opportunity. I didn´t know what to do to celebrate!\n“It´s not even sunk in yet. I´m just taking it all in. It´s amazing.” Manchester-born Hamilton joined City at the age of nine.\nInjuries delayed his entry into the first team but Hamilton showed his class in Belgrade alongside fellow academy ´graduates´ Rico Lewis and Oscar Bobb, the scorer of City´s second goal. “I´ve played with (Rico) right through the age groups and now to be doing it on the big stage is something mad,” said Hamilton.\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters\n-\n'A Very Special Visitor' Meets Queen Camilla At Clarence House\n-\nJodie Turner Smith Shares One Strict Rule She Follows As A Mom\n-\nHailey Bieber Reveals KEY To Balancing Motherhood With Career\n-\nPhoto Of Jay-Z, Other Prominent Figures With Jeffrey Epstein Proven To Be Fake\n-\nHillary Clinton's Munich Train Video Sparks Conspiracy Theories\n-\nFans Slam Talk Show Host For 'cringe' Behavior In Chris Hemsworth Interview\n-\nWoman Jailed Over False 'crime In Space' Claim Against NASA Astronaut\n-\nJames Van Der Beek’s Close Pal Reveals Family's Dire Need Of Donations\n-\nPrince William And Harry's Cousins Attend 'Wuthering Heights' Event\n-\nHailey Bieber Turns Heads Just Hours After Major Business Win\n-\nKing Charles' Andrew Decision Labelled 'long Overdue'\n-\nTimothee Chalamet 'forever Indebted' To Fan Over Kind Gesture\n-\nColumbia University Sacks Staff Over Epstein Partner's ‘backdoor’ Admission\n-\nOzzy Osbourne's Family Struggles Behind Closed Doors\n-\nDua Lipa Claims Long-distance Relationship 'never Stops Being Hard'",
  "word_count": 946,
  "scraped_at": "2026-02-14T01:51:13.780452",
  "_text_extracted": true
}