{
  "article_id": "5aab46fee6fa",
  "url": "https://www.thisdaylive.com/index.php/2024/03/15/champions-league-heavyweight-quarter-final-fixtures-loom",
  "title": "Champions League : Heavyweight Quarter final Fixtures Loom",
  "date": "20240314T233000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nChampions League: Heavyweight Quarter final Fixtures Loom\nToday’s UEFA Champions League quarterfinal draw is set to throw up a series of heavyweight ties after a midweek in which penalty shootout drama really brought Europe’s elite club competition to life.\nGoalkeeper Jan Oblak’s heroics in Atletico Madrid’s shootout win over last season’s runners-up Inter Milan on Wednesday – after the Spanish club came from behind in their last-16 tie – followed Arsenal’s triumph on penalties against Porto a day earlier.\nTuesday also saw Barcelona deliver a rousing performance to see off Napoli and make it through to the quarterfinals for the first time since their 8-2 annihilation at the hands of Bayern Munich in 2020 in Lisbon, at the height of the Covid crisis.\nWith record 14-time champions Real Madrid already having secured their last-eight berth, three Spanish clubs will be represented in the draw.\nThey are joined by two English sides in Arsenal and holders Manchester City, as well as the German duo of Bayern and Borussia Dortmund, and French giants Paris Saint-Germain.\nThe surprise is that none of Italy’s representatives reached the next stage, a year after Inter pushed City close in the final having eliminated neighbours AC Milan in the last four.\nOnly three of last season’s quarterfinalists – City, Real and Bayern – have made it back to the last eight this time, suggesting there is still a real degree of variety and unpredictability to the competition.\nYet the recent last-16 ties also more than hinted at the ever-growing polarisation at the very top of European football.\nFC Copenhagen could never really compete with Pep Guardiola’s City, while getting the better of PSG proved a step too far for Real Sociedad and Bayern ultimately brushed aside Lazio despite losing the first leg away.\nOnly the mega-rich can now aspire to winning the Champions League, with four of the quarterfinalists posting revenue last season of over 800 million euros ($874m) according to this year’s Deloitte Football Money League.\nGoing by Deloitte’s ranking, all eight quarterfinalists were in the top 15 clubs in the world last season in terms of income – Atletico had the lowest at just over 364 million euros.\nDiego Simeone’s side were the only team to win against a richer club in the last 16, and even then Inter generated only marginally more money last season.\nThe current format of the Champions League has been in place for two decades and will be changed for next season, when UEFA will revolutionise its flagship tournament by replacing the group stage with a league phase featuring 36 clubs, up from 32 now.\nClubs will play eight games in the league phase, instead of six in the old group stage, all against different opponents in what is known as the “Swiss system”.\nEUROPA LEAGUE\nRangers 0-1 Benfica\n(2-3 agg)\nS’Prague 1-3 AC Milan\n(3-7 agg)\nVillarreal 3-1 Marseille\n(3-5 agg)\nWest Ham 5-0 Freiburg\n(5-1 agg)",
  "word_count": 490,
  "scraped_at": "2026-02-14T02:10:47.914335",
  "_text_extracted": true
}