{
  "article_id": "5ac57e9edf69",
  "url": "https://www.teamtalk.com/manchester-united/arsenal-vs-man-utd-decided-signing-of-the-season-not-who-you-think",
  "title": "Arsenal vs Man Utd was just decided by the signing of the season",
  "date": "20260126T011500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nArsenal vs Man Utd was just decided by the signing of the season – it’s not who you think\nManchester United continued their impressive form under interim manager Michael Carrick with a dramatic 3-2 win over Premier League leaders Arsenal.\nThe Gunners started strongly at the Emirates and took the lead in the 29th minute when Lisandro Martinez diverted Martin Odegaard’s wayward effort into his own net.\nBut United equalised eight minutes later when Bryan Mbeumo capitalised on an error by Martin Zubimendi before rounding David Raya and slotting the ball into the Arsenal net.\n“It’s a lovely finish,” former United striker Michael Owen said. “When this lad’s in front of goal, I never, ever doubt he will score. He’s a really good finisher. He’s calm, calculated, opens his body up so sends the goalkeeper one way and does it quick… It’s a really confident finish.”\nUnited identified Mbeumo as a top transfer target in the summer after the 26-year-old scored 20 Premier League goals and registered eight assists for Brentford in 2024/25.\nThey failed with their first two bids for the winger, the second of which was worth an initial £55million and another £7.5million in potential add-ons.\nThe lengthy negotiations left many fans exasperated, while United accused Brentford of inflating the forward’s price and pressuring him to reduce his wage demands to secure a larger transfer fee.\nSix weeks after seeing their first offer rebuffed, United eventually secured his signature by paying a guaranteed £65million and £6million in potential add-ons.\n“Bryan’s goals and assists record in the Premier League is exceptional, his remarkable consistency has put him amongst the most productive players in England for the last three seasons,” United’s director of football Jason Wilcox said.\n“Bryan’s belief in our project and determination to join the club confirmed that he was the perfect fit for Manchester United and the culture that we are developing.”\nThe overall transfer fee made him the eighth-most expensive signing in United’s history and it did raise a few eyebrows, but he’s since silenced any doubters.\nFollowing the visit to the Emirates, Mbeumo has now netted eight times and registered one assist in 17 Premier League matches in the 2025/26 campaign so far. He is averaging a direct goal contribution in the top-flight every 171.7 minutes.\nThe 26-year-old is currently the joint-fifth top goalscorer in the Premier League this season, with a 57% shot accuracy and a 17% goal conversion rate.\nMbeumo is now the first United player to score against Arsenal, Tottenham, Manchester City and Liverpool in a Premier League season since Marcus Rashford in 2022/23.\nThe Cameroon international is also the first United player to do so in his debut campaign since Robin Van Persie in the 2012/13 season.\nMbeumo’s equaliser was the catalyst for the Red Devils not losing hope after Arsenal’s opening goal and they took the lead through Patrick Dorgu’s stunning strike at the start of the second half.\nHe was withdrawn in the 68th minute and replaced by fellow summer signing Matheus Cunha, who went on to score the winning goal after Mikel Merino’s equaliser.\nBest summer signing\nSince Sir Alex Ferguson retired at the end of the 2012/13 season, United have faced heavy criticism for their work in the transfer market.\nBut their recruitment has improved since the Ineos group assumed control of the football operations, and Mbeumo currently looks like the best Premier League signing from the summer transfer window.\nArsenal duo Martin Zubimendi and Eberechi Eze both won a lot of plaudits at the start of the season following their summer moves from Real Sociedad and Crystal Palace.\nBut Zubimendi’s mistake allowed Mbeumo to equalise at the Emirates, and Eze was named on the substitute’s bench for the seventh successive Premier League game.\nGranit Xhaka, Robin Roefs, Rayan Cherki, Hugo Ekitike and Dominic Calvert-Lewin all deserve honourable mentions, but Mbeumo arguably takes top spot at this stage of the season.\nHe has an impressive goal return, boasts a brilliant big-game record, works hard off the ball and has also shown his versatility by playing as a striker in Carrick’s first two games in charge.\nUnited had to be patient when chasing the winger in the summer, but his signing could prove to be the difference in their bid to secure Champions League qualification.\nREAD MORE: Ranking six midfielders Man Utd could sign on loan in January before big summer move",
  "word_count": 740,
  "scraped_at": "2026-02-14T01:53:15.580967",
  "_text_extracted": true
}