{
  "article_id": "5aca35fe2ca1",
  "url": "https://www.teamtalk.com/tottenham-hotspur/spurs-transfers-revamp-policy-sign-100m-difference-maker-tim-sherwood-exclusive",
  "title": "Tottenham transfers : Spurs told to  revamp  transfer policy to sign £100m  difference maker  ",
  "date": "20260101T064500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nTottenham told to ‘revamp’ transfer policy to sign £100m ‘difference maker’ – Exclusive\nFormer Tottenham manager Tim Sherwood has told Spurs chiefs to stand by under-fire manager Thomas Frank and urged them to revamp a transfer policy that has halted the club’s progress for the last two decades, while also firing the club a warning over the future of Micky van de Ven.\nSherwood has pointed an accusing finger at the club’s transfer decision makers, as he suggested their policy of signing second tier players is the primary reason why they are coming up short in the Premier League once again this season.\nAnge Postecoglou was sacked as Tottenham manager last summer, despite ending the club’s 17-year wait for a major trophy when he lifted the Europa League and secured their qualification to this season’s Champions League.\nNow his replacement, Thomas Frank, is under huge pressure after a woeful start to the season, with the Danish coach struggling put his mark on a team that has come up short time and again.\nRumours that the club’s sporting director, Fabio Paratici, is set for a shock exit is adding to the chaos at Tottenham and while there have been calls for Frank to be replaced, Sherwood has suggested the club’s refusal to splash the cash on proven top level players has been a recurring flaw in their strategy that is threatening to derail the ambitions of their latest manager.\nFrank is one of the favourites to be the next Premier League manager to lose his post, but Sherwood, who was Tottenham boss between 2013 and 2014, has insisted another managerial change now is not what the club needs.\n“They need to back Thomas Frank and give him signings that will fit into the system of a Tottenham team he is in charge of,” Sherwood told TEAMtalk with BetWright Betting UK.\n“They got rid of Postecoglou after what I believe was a successful season. I know they finished 17th, but that is because they focused on the Europa League and that was the right decision because they won it. Ange’s job was to end the long wait for a piece of silverware and he delivered on that, but still got that sack.\n“Where did that leave Thomas Frank when we went in? What is success for the next Spurs manager if the previous one got sacked for winning a major European trophy?\n“For me, you have to stick with this manager and back him properly in the transfer market and that has not happened for a long time at Tottenham.\n“Instead of signing players for £20m or £30m, put all the money in to sign a £100m player who can make the difference.\n“Tottenham have not done that down the years and I look at the squad they have now and a lot of the players who are all at a similar level.”\nWant breaking transfer lines from original sources? Add TEAMtalk as a preferred source on Google to your favourites list for news you can trust.\nSpurs get Van de Ven warning as four ordinary midfielders are named\n“Micky van de Ven is the only player who could play for most Premier League clubs and after that, I don’t see any player who I would call world class or even touching that.\n“Midfielders like [Pape] Sarr, [Rodrigo] Bentancur, Archie Gray and [Joao] Palhinha are all good players, they will do a job for you, but they are not game changers.\n“Then you look at forward like Richarlison up front and I’m not sure he is a player who will make a big difference.\n“So go and sign a player who will make a difference in January and not just add to what they have already got.\n“Too many players are signed these days from showreels of their highlights, but I could put together a showreel of the most average players and make them look good. That’s not what Tottenham need right now.”\nWith Daniel Levy removed from his position as Spurs chairman earlier this year, the upcoming transfer window will be the first to be overseen by a new management structure and Sherwood suggests they need to deliver.\n“All eyes will be on Tottenham in this transfer window,” states the former midfielder, who was Blackburn’s Premier League title-winning captain back in 1995. “We are waiting to see if it is going to be any different from the way Daniel Levy ran things.\n“As a club, they have always spent money, but there have always been big question marks on the players they have spent it on.\n“Bring in a player who makes a difference rather than two or three players who might be what I would call stocking fillers.”\nSherwood went on to fire out a warning that defensive talisman Van de Ven may look to move away from Tottenham next summer unless they are playing Champions League football.\nThe Dutch centre-back has been the shining star of the Spurs team since his arrival from Wolfsburg in 2023, but Sherwood suspects bigger clubs may come calling for him.\n“I think they will find it very hard to keep hold of Van de Ven at the end of the season,” added Sherwood.\n“If they don’t finish in the Champions League spots, and they will probably have to win this season’s Champions League to do that, then Van de Ven will probably look to join a team that can give him that top-level football.”\nTottenham latest: Leipzig livewire targeted; Johnson’s £35m exit dilemma\nOne man who could fit the agenda of the ‘£100m difference maker’ that Sherwood is demanding is RB Leipzig flyer Yan Diomande and sources can reveal that the exciting RB Leipzig winger is a player firmly on the Spurs radar ahead of the January window.\nSpurs are also understood to be showing an interest in Manchester City star Oscar Bobb, with the Norwegian potentially free to leave the Etihad once the Cityzens push through the £65m of Antoine Semenyo.\nCity are expected to finalise the transfer of the Bournemouth livewire soon after the window officially opens for business on New Year’s Day.\nIn the meantime, Spurs have also made it clear that Brennan Johnson is free to leave.\nThe Wales winger, last season’s top scorer with 18 goals, has fallen down the pecking order under Frank and our sources exclusively revealed on Tuesday morning how the club were open to his £35m departure.\nWith Palace now agreeing to meet that fee, the player has been given a major decision to make over his future.\nGet the inside story first by joining our TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 1124,
  "scraped_at": "2026-02-14T01:59:31.503561",
  "_text_extracted": true
}