{
  "article_id": "5ad105b01392",
  "url": "https://metro.co.uk/2025/11/26/eberechi-eze-finally-provided-arsenal-x-factor-mikel-arteta-missing-24788043/",
  "title": "Mikel Arteta has finally signed the X - Factor Arsenal have been missing",
  "date": "20251126T083000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Even before their thumping north London derby victory against a sorry Spurs, there was plenty to suggest that this incarnation of Mikel Arteta’s Arsenal was different to what had come before.\nThe 4-0 dismantling of Atletico Madrid in the Champions League, a superb late turnaround to snatch victory away at Newcastle, and even the late equaliser against Manchester City were all indicative of a side that has added yet more depth, steel and quality to its ranks.\nSix points clear at the top of the Premier League table, through to the quarter-finals of the Carabao Cup and boasting a perfect record in the Champions League, the Gunners are enjoying life.\nAnd yet, Wednesday’s visit from Bayern Munich represents another potential inflexion point, and the perfect opportunity to rubber-stamp the notion that Arsenal are a team finally ready to fulfil on their promise.\nArsenal fans need no reminding of their dismal record against the German giants with an infamous 10-2 aggregate defeat in 2017 representing the nadir of Arsene Wenger’s reign.\nThe construction of the Emirates Stadium was, according to former chief executive Ivan Gazidis, supposed to ensure that the north London club would be capable of fighting on an even footing with Bayern and the rest ofEurope’s elite clubs.\nAnd yet, as recently as two years ago, a 3-2 aggregate defeat in the quarter-finals showcased an Arsenal side that was still very much a work in progress, particularly during their insipid second-leg defeat, which saw them fail to land a glove on Bayern.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIn the aftermath of that defeat, Ian Wright was quick to diagnose the issue. ‘We need someone with that bit of X-factor,’ the ex-Gunners striker said at the time. ‘We need to find that, man, because that’s what wins these games.’\nInternally, Arsenal seemingly accepted that fact, too, and earmarked attacking reinforcements for the summer. When it arrived, though, an ill-fated loan move for Raheem Sterling was the only new face to bolster Arteta’s attacking options.\nEven after Gabriel Jesus’ serious knee injury in January, the Gunners opted to keep their powder dry, seeing their trophy hopes fade as a result when Kai Havertz and makeshift striker, Mikel Merino, failed to deliver the goods.\nAnd this summer, while the signing of Viktor Gyokeres provided a solution to Arsenal’s lack of a No9, it looked like Arsenal were set to ignore their need for a true gamechanger before their eleventh-hour swoop for Eberechi Eze.\nAnd while it had been a solid if unspectacular start to his life at the Emirates, Eze has now shown himself to be Arsenal’s X-factor with his derby-day hat-trick to dismantle Thomas Frank’s Tottenham.\nArsenal have worn down teams with their system, their relentless pressing, and their set-piece brutality this season. But here was an Arsenal side carving open a dogged and defensive opposition by another means, with individual quality and moments of magic.\nFor that, Arteta deserves credit. Former Tottenham striker Les Ferdinand, who helped nurture Eze at Queens Park Rangers, noted pre-match that the midfielder had been playing with ‘the handbrake on’ so far at Arsenal.\nBut here, he was given license to roam, to find space where few other teammates could not, and it proved pivotal. Combining a fleetness of foot with a tunnel-focused clarity of thought on the edge of the box, Eze only needed six shots to walk away with the match ball.\n‘When a player has such a talent, and his desire is at that level, then these things happen. And he fully deserves it. I’m so happy for him, because since the day that he came, he brought something else to the team,’ Arteta said glowingly of Eze post-match.\n‘So it’s a joy, it’s an aura that this team needed and hopefully it will give him a lot of confidence to him and the team, that at any moment he can win us a game. That’s the ability that he has and he certainly needs to fulfil that talent.’\nDoes Eze’s ‘aura’ give Arteta a selection headache?\nThat ‘aura’ which Arteta describes is something few Arsenal players, despite their collective quality, emit. Martin Odegaard, for all his brilliance and varied qualities in Arteta’s system, can’t quite take a game away from the opposition in the same way as his midfield counterpart.\nThe Norwegian is still yet to return to full fitness and could be in with a shout of featuring in Wednesday’s clash with Bayern. The 26-year-old offers plenty, not least in the way he marshals Arsenal’s front-footed pressing machine, and will be a welcome boost back in the matchday squad.\nArsenal’s relentless fixture schedule, which has Arteta’s side playing ten times in three competitions before the end of the year, will give Arteta plenty of opportunities to deploy both Eze and Odegaard in his system.\nBut as Gunners legend Thierry Henry noted on Sky Sports on Sunday: ‘This guy Eze is a 10 for me, he’s not a winger, he’s a 10.\n‘He needs to be in the middle of the park he showed it tonight, so that’s what you want, healthy competition, that’s what you want.’\nMore Trending\nIt is not just Odegaard coming back into the fold. Both Noni Madueke and Gabriel Martinelli were back on the bench at the weekend, and Arsenal’s returning cavalry will be the envy of many of their rivals in the coming weeks.\nHowever, Eze’s coming-out display was surely a message to his boss that the 27-year-old can’t be viewed as a versatile player to bolster squad depth, but rather a difference maker who should be thrust into the limelight and given the freedom in Arsenal’s biggest games.\nBayern will offer a stern test. Vincent Kompany’s side are unbeaten in all competitions and have only dropped points once this season: a 1-1 draw with Union Berlin at the start of November.\nBut if Eze is given the freedom to be his mercurial best once again, Arsenal have the perfect opportunity to banish their Bayern demons and lay down a marker in yet another competition.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Robert Sanchez mocks Lamine Yamal after Chelsea beat Barcelona\nMORE: Arsenal vs Bayern: Predicted lineup today and confirmed team news\nMORE: Craig Burley makes Arsenal claim after Chelsea’s Champions League win over Barcelona",
  "word_count": 1114,
  "scraped_at": "2026-02-14T02:03:26.522411",
  "_text_extracted": true
}