{
  "article_id": "5ae9d8b807a2",
  "url": "https://www.nytimes.com/athletic/6155883/2025/02/25/newcastle-inside-isak-pope-wilson/",
  "title": "Inside Newcastle Q & A : Howe cup final approach , Pope future and Al - Rumayyan visit",
  "date": "20250225T063000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Once a week (mostly) for an hour during the Premier League season, The Athletic’s Newcastle United subscribers can ask our writers covering the club for views and insight into what’s happening at St James’ Park.\nHere, we have pulled together some of their questions and our answers from Monday’s edition of our Inside Newcastle live Q&A, which included queries about the significance of Yasir Al-Rumayyan’s presence on Tyneside, Eddie Howe’s long-term job security and who could replace Alexander Isak should he depart.\nAdvertisement\nWant to ask us anything Newcastle-related? Chris Waugh will be back next Monday at 2pm GMT (9am ET).\nDo you think Howe will want to play different ways in the Liverpool league game and the cup final? — Mark R.\nWaugh: While it would be naive to take Howe entirely at his word that he is not even considering the Carabao Cup final at present — it is simply too important for him not to be thinking about it in the background — he is genuine when he says that the upcoming visit to Anfield is consuming his focus. For a start, Liverpool are Newcastle’s opponents at Wembley but also this is a critical period in the race for a Champions League qualifying position.\nIt is not really in Howe’s nature to double-bluff. He is willing to do so with his public pronouncements but not when it comes to game plans. If Howe believes he has a method for unsettling Liverpool, he will look to implement it on Wednesday and will not hold anything back for the final.\nWhat he will not do is risk the fitness of his players, though. If Sandro Tonali’s hamstring problem is still troubling the midfielder, then he will not start, despite his importance, and the same applies to Sven Botman.\nInstead, with Joelinton unavailable but set to be back for the final, what Howe can keep in reserve is the make-up of his strongest XI. I understand why some supporters are suggesting Newcastle should not give away their likely tactics ahead of the final but Arne Slot will have watched so much of Howe’s side that it should make little difference.\nIn my view, the best preparation for Wembley would be gaining confidence by going to Anfield, making life difficult for Liverpool, and hopefully recording a historic victory.\nWith the chairman at the Nottingham Forest game, are we expecting any updates from the club on wider issues (stadium/training ground)? Any updates on when someone from the club’s hierarchy will speak? — Michael M.\nWaugh: Al-Rumayyan’s presence at St James’ was certainly significant — it is only the second time, after the 2-1 win over Tottenham Hotspur in September, that Newcastle’s chairman has been at a game on Tyneside this season — and the delegation from Saudi Arabia’s Public Investment Fund (PIF), Newcastle’s majority owners, are taking part in a series of meetings regarding the future direction of the club.\nAdvertisement\nWhile these are part of a periodic programme of reviews — Newcastle tend to have departmental evaluations after most transfer windows — there is greater importance attached to this round given the key infrastructure questions. The future of St James’ Park and whether Newcastle relocate to a new stadium nearby is a pivotal issue being debated, as is the potential for a new state-of-the-art training ground.\nGO DEEPER\nSpecial report: The future of St James' Park\nThe overarching transfer blueprint and a general look ahead to the summer is also likely to be on the agenda, but lists of targets are yet to be narrowed down and no specific decision on which players Newcastle will pursue will be made. Al-Rumayyan’s involvement is very much about outlining the bigger picture, rather than getting into the minutiae of individual transfer targets.\nWhether anything will be categorically decided on the infrastructure front is unclear. Newcastle insist any key development on the stadium will be relayed to the club’s Fan Advisory Board (FAB) before being finalised, so that suggests an announcement is unlikely.\nIn terms of Darren Eales, the CEO, or Paul Mitchell, the sporting director, speaking publicly, the plan is still for the former to conduct a media briefing alongside the release of the accounts for 2023-24, but a date is not yet set.\nGiven Nick Pope’s poor form and Martin Dubravka obviously not being the long-term solution, are you expecting a new first-choice goalkeeper to be signed? Would it be one of James Trafford, Caoimhin Kelleher or Aaron Ramsdale? — Euan M.\nWaugh: Goalkeeper is definitely a position Newcastle are considering bolstering this summer. There may be quite a significant overhaul of the goalkeeping department, given John Ruddy and Mark Gillespie’s contracts are up, and Odysseas Vlachidimos is clearly not in favour, while Dubravka’s long-term future is still not certain despite the Slovakia international signing an extension.\nAdvertisement\nPope has not reached his previous consistently high standards throughout much of 2024-25 and, aged 32 and about to enter the final year of his contract, there is some doubt about how long he will remain No 1.\nRegardless, Howe signed Pope because he believes the England international is a magnificent shot-stopper and, while his distribution with his feet is poor, his throwing is excellent, as shown in Newcastle’s 4-3 win over Nottingham Forest last weekend when he started a string of first-half attacks.\nEven so, one of the next phases of Newcastle’s evolution is to have a goalkeeper who can essentially become an additional outfield player and contribute to phases of play. Pope is simply not competent enough with his feet to do that and, although Dubravka is better at that than the Englishman, he is still not a top-quality distributor.\nNewcastle’s long-standing interest in Burnley’s Trafford remains and, while claims that a deal has already been agreed are premature, the club continue to monitor his situation closely. Ramsdale is well known to Howe and Newcastle’s recruitment team, but whether they will revive interest once Southampton are relegated is unclear. Liverpool’s Kelleher is rated by some at the club but there are also goalkeepers Newcastle have been tracking beyond that trio, some of who play outside of England.\nIf Newcastle do sign another senior goalkeeper, the idea would be for them to challenge Pope for the No 1 jersey. A younger goalkeeper may be seen as a deputy in the short term but with the potential to become Pope’s successor, though the best-case scenario would be for two excellent shot-stoppers to push one another for the starting jersey.\nAs well as Dubravka has played since December, he has always been considered second choice, which means Pope has not been pushed enough for his place. Greater competition is required.\nGiven the ups and downs of this season, and the greater potential of a spending spree in the summer, is Howe under pressure if he doesn’t get a cup and/or Champions League? — David D.\nWaugh: There has been no indication that Howe is under any immediate or even medium-term pressure. Rather, there has been genuine appreciation of the mitigating circumstances which must be considered when discussing his performance (and Newcastle are fifth and still in both domestic cups anyway!).\nAdvertisement\nThe wider context remains that, despite having an excellent first XI and a few top-quality substitutes, Howe’s starting side has not been bolstered since the summer of 2023, and the squad depth at his disposal has actually become diluted.\nHowe spoke on Friday about having a small pool of senior players to work with given the January departures of Lloyd Kelly and Miguel Almiron, and due to the injuries which have afflicted his squad. He inferred that training quality had become diluted, given he has had to repeatedly call up lots of under-21s. While some of those youngsters are there on merit, Howe would ideally prefer to have seasoned pros competing for starting positions.\nConstraints due to the Premier League’s profit and sustainability rules (PSR) have forced the club to adopt a strategy whereby they have had to get their financial housekeeping in order to spend, but the desire to back Howe in the longer term remains. Mitchell believes Howe is an “elite” head coach and will look to rebuild the squad this summer. Once that happens, the pressure will increase on Howe because he will have been supported in the market and be expected to respond with positive results (even if he is not ultimately leading the transfer strategy and is just an influential voice within it).\nRegardless, despite the Newcastle hierarchy’s appreciation of Howe’s position, it is his job to deliver on the field and he will be judged as such. Eales and Mitchell’s stated goal for the season is European qualification. Should Howe secure a return to the Champions League and/or a trophy, then that only solidifies his long-term future.\nJust supposing Isak left in the summer, who would you suggest as a replacement? Please don’t say Darwin Nunez — David C.\nWaugh: This may seem like a cop-out answer, but Newcastle are confident that, as things stand, Alexander Isak is going nowhere. He has three years remaining on his deal, they plan to open discussions over a potential extension come the summer, there are few (if any) clubs who could realistically afford him, and, in the view of Howe and other senior figures at St James’, the Sweden international is pretty much irreplaceable.\nThat stance may be tested should Newcastle fail to qualify for the Champions League and especially if they fail to secure European football of any description for 2024-25, and particularly if Isak then pushes to go, but it is not an eventuality the club are currently considering.\nGiven Callum Wilson’s contract is set to expire at the end of the season and with Newcastle yet to determine whether they will unilaterally enact the one-year extension option in the 32-year-old’s present deal, a striker is on the agenda anyway. Lille’s Jonathan David, who is going to be a free agent, has admirers and he has been closely monitored, while younger European-based players have also been watched.\nAdvertisement\nBut the profile of striker required were Isak to leave is entirely different. Newcastle are currently looking for a player who can play alongside Isak, potentially out wide, and also who can cover as his deputy. A world-class striker to actually replace Isak would be far more challenging, if not nigh-on impossible.\nRB Leipzig’s Benjamin Sesko is well-liked — and Newcastle even had an offer rejected for the Slovenian during the summer of 2022 before they acquired Isak — and Liverpool’s Darwin Nunez was rated when he was at Benfica. Yet the striker who Howe really wants to build his refreshed side around going forward remains Isak, so Newcastle will do everything they can to keep him on Tyneside.\nGO DEEPER\nHow to move like Alexander Isak - a seven-part guide\nIs there a buy-back option for Elliot Anderson? Homegrown quota is invaluable in the years to come, especially if Sean Longstaff leaves? — Chris C.\nWaugh: There has been no indication that Newcastle do have a buyback option for Anderson. Although Newcastle would have preferred to have had one inserted, they were in a relatively weak negotiating position given their pressing need to secure the “pure profit” from his sale before the June 30 deadline last year.\nHomegrown and academy players will prove crucial going forward if Newcastle return to Europe, given UEFA’s strict requirements — and Howe was unable to register a full squad in last season’s Champions League because they did not have enough club-produced players to qualify for the maximum quota.\nLongstaff’s academy status makes him an attractive player to potentially sell from a PSR perspective, especially given he now appears to be a sixth-choice midfielder and is entering the final year of his deal, as Newcastle could bank all of the money from a sale.\nBut Newcastle’s dearth of home-produced players means that they must also consider the potential ramifications of selling Longstaff on their ability to name the maximum number of players in European competition. It is part of the reason why Tim Krul’s name was very briefly mentioned as a potential back-up goalkeeper option last year.\n(Top photo: Andy Buchanan/AFP via Getty Images)",
  "word_count": 2038,
  "scraped_at": "2026-02-14T01:52:15.328716",
  "_text_extracted": true
}