{
  "article_id": "5af20cdc9f99",
  "url": "https://www.westmeathexaminer.ie/2023/04/14/manchester-united-defender-lisandro-martinez-ruled-out-for-rest-of-the-season/",
  "title": "Manchester United defender Lisandro Martinez ruled out for rest of the season",
  "date": "20230415T001500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United defender Lisandro Martinez ruled out for rest of the season\nBy Simon Peach, PA Chief Football Writer\nManchester United have been hit by a huge double defensive injury blow after Lisandro Martinez was ruled out for the rest of the season and Raphael Varane for the next few weeks.\nThursday’s Europa League quarter-final against Sevilla looked set to end in a comfortable first-leg win, only for it to unravel in a chaotic and costly 2-2 draw.\nTyrell Malacia’s 84th-minute own goal was quickly compounded by a serious-looking injury to Martinez, who pulled up in pain gripping his right ankle and was eventually taken away on a stretcher.\nUnited had already lost fellow first-choice centre-back Varane to injury at half-time and his replacement Harry Maguire scored an unfortunate own goal in stoppage time.\nBoss Erik ten Hag was unable to provide an update when he faced the media on Friday lunchtime, but the club confirmed the severity of the respective issues that evening.\nUnited said in a statement: “Lisandro Martinez has been ruled out for the remainder of the season after fracturing a metatarsal bone in his foot.\n“However, the Argentinian defender is expected to make a full recovery in time to be ready for the start of next season.\n“Martinez sustained the injury in the 86th minute of Thursday night’s 2-2 draw with Sevilla in the quarter-final of the Europa League.\n“Lisandro’s defensive partner Raphael Varane was also substituted with an injury at half-time in the same game and is expected to be out for a few weeks.”\nMartinez, who won the World Cup with Argentina in December, has quickly established himself as a fan favourite at Old Trafford.\nThe 25-year-old centre-back joined from Ajax in the summer and has made 45 appearances, winning the Carabao Cup in his first season.\nThat triumph in February was also Varane’s first trophy since joining from Real Madrid the previous year.\nThe injured duo have established themselves as Ten Hag’s first-choice centre-back pairing and their absence leaves a huge void as United look to end the campaign on a high.\nTen Hag’s side are looking to qualify for the Champions League and enter the weekend fourth in the Premier League standings.\nSunday’s trip to relegation-threatened Nottingham Forest is followed by the second leg of their Europa League quarter-final against Sevilla in Spain.\nBruno Fernandes misses that match through suspension and club captain Harry Maguire is then banned for next Sunday’s FA Cup semi-final against Brighton at Wembley.\nMaguire’s absence is a major concern given that he and Victor Lindelof are now the only out-and-out centre-backs left at United’s disposal.\nAsked how much faith he had in the pair, Ten Hag said: “A lot. I think we have decent centre-halves and they have proved in the past, they have proved this season.\n“We have four or five very good centre-halves who can do the job.”\nAnother option is left-back Luke Shaw, who has impressed centrally when called upon this season.\nThe England international has missed recent matches through injury but could return against Forest this weekend along with midfielder Scott McTominay.\nAny shot in the arm is welcome right now given star man Marcus Rashford is out with an apparent groin injury, joining Alejandro Garnacho, Donny van de Beek and Tom Heaton on the sidelines.\nMartinez and Varane have swelled that list of absentees further at a frantic time and Ten Hag has underlined the importance of squad players stepping up.\n“Every game is a battle, every game is a fight and you have to be ready for that fight,” he said ahead of Sunday’s Premier League match.\n“We have a squad. I have said all season we have more than 11 starters, so now others are on and when their time is there you have to show and contribute to the team.\n“You have to be ready. That is what we expect, that is what we demand.”\nAsked if it might be difficult for some players to come into the side having not played much, Ten Hag said: “I think then you are finding excuses.\n“If you want to find excuses or set excuses, then you don’t have to play for Man United and you have to look for another club.\n“You have to wait for your moment and when the moment is there you have to contribute, you have to bring your performance and that is what we demand.”",
  "word_count": 739,
  "scraped_at": "2026-02-14T01:59:46.861516",
  "_text_extracted": true
}