{
  "article_id": "5b11b22af37e",
  "url": "https://theprideoflondon.com/chelsea-arsenal-interested-signing-french-midfielder",
  "title": "Chelsea and Arsenal interested in signing French midfielder",
  "date": "20251228T194500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea's inconsistent run continued on Saturday night, as they gave away a 1-0 lead to lose 2-1 to Aston Villa at Stamford Bridge when the visitors had not even looked to be in the game for the first hour. Following that, the Blues dropped to fifth place, 10 points behind Unai Emery's side, who remain in third place in the Premier League. After yesterday's match, it appears that Enzo Maresca's side may need to take the winter transfer window somewhat seriously to address their poor form.\nWith just a few days until the upcoming transfer window, Chelsea have been relatively quiet in terms of any big transfer noise for January, but there are certainly a few little rumours bubbling away. There are a few positions though, which the Blues would undoubtedly need to strengthen if they want to compete for the Premier League and Champions League titles.\nAnd it seems like they have found a new young prospect. According to a report from CaughtOffside, Chelsea have recently ramped up their interest in Marseille midfielder Darryl Bakola. Alongside them, Arsenal and Newcastle United are also monitoring his development closely.\nBakola has made 11 appearances for the French side this season. However, game time has been hard to come by since he has mostly been a substitute. He has played only 114 minutes of first-team football this season. The 18-year-old is garnering the interest of suitors since his current contract with Marseille expires in 2027.\nChelsea and Arsenal interested in signing French midfielder\nThe Ligue 1 team sees Bakola as a key component of their future and are believed to be currently negotiating a contract extension that would keep him with the club until 2030. However, things might quickly change if these talks fail and the player decides not to extend his stay.\nThe French midfielder has a long list of admirers, as the report claims that Manchester City and Manchester United are also keeping an eye on Bakola's progress, although they are still trailing Premier League rivals Chelsea and Arsenal. Furthermore, Paris Saint-Germain, Juventus, Bayern Munich, and Borussia Dortmund are all prepared to enter the conversation if the situation presents itself.\nBakola is a versatile midfielder with the ability to play at a higher level, so moving to the Premier League may be tempting for him. Furthermore, he is young, talented, and still on the rise, which fits the Blues' recruiting strategy of focusing on exceptional youngsters rather than signing established players.",
  "word_count": 411,
  "scraped_at": "2026-02-14T01:49:57.601722",
  "_text_extracted": true
}