{
  "article_id": "5b2a2bb3b639",
  "url": "https://www.themag.co.uk/2023/04/west-ham-1-newcastle-5-the-three-big-points-that-im-taking-from-the-match-newcastle-united/",
  "title": "West Ham 1 Newcastle 5 - The three big points that Im taking from the match",
  "date": "20230406T104500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "West Ham 1 Newcastle 5 – The three big points that I’m taking from the match\nThe team showed just two changes, with Isak and Willock dropping to the bench, Wilson and Joelinton coming in.\nWillock did look to have a niggling injury in the last match, while two games in four days obviously came too soon for Isak – with Wilson getting the chance to prove his worth up top.\nThe first half started with a big wobble, Bowen outpacing Burn and some penalty box pinball almost led to an own goal from Bruno in the opening moments, the ball creeping wide via the post.\nAfter a difficult five minutes, a brilliant price of footwork and cross from ASM picked out Wilson on the penalty spot, nodding the ball in easily! 1-0 within six minutes and Newcastle back in control of the game.\nThe 13th minute showed some more sleepy Hammers defending, as Joelinton ran through completely unmarked, rounding the keeper and after a lengthy VAR check, it was shown that Emerson kept him on and had Newcastle 2-0 up in less than 15 minutes!\nThe game began to even itself out after 20 minutes, with most of the action moving to the midfield, Newcastle still controlling most of the proceedings.\nThe first real West Ham chance came just before the half hour mark, with a free kick nicely saved by Pope, with Botman making a great tackle to deny Antonio shortly afterwards.\nAfter those chances, the pressure continued to build, leading to a West Ham goal from a corner, a Zouma header after an uncharacteristically weak attempt of a save from Pope.\nNewcastle responded with a few decent deliveries into the box from ASM and Schar, but no one on the end of them, and that was that for the first half.\nThe second half couldn’t have started any better for us!\nAguerd dithering on the ball and being robbed by Murphy, who slid the ball across to Wilson to prod home!\nNewcastle dominated play from then, almost a beautiful team goal coming in the 54th minute, with Fabianski saving well from Murphy, Rice clearing off the line from the resulting corner.\nASM really dominated the left flank, drawing another great save from Fabianski on the hour mark.\nA whole raft of changes saw a combined seven from the two teams in the same moment, threatened to shake up the flow of the game, but Newcastle continued to dictate the play.\nA few wobbly performances from corners aside, West Ham offered little threat, Newcastle threatened to score a fourth, Bruno’s shot whistling past the post.\nAnother defensive self destruction from West Ham in the 82nd minute, as Fabianski came flying out after Bruno’s long ball, only to deposit the ball right at Isak’s feet, leaving him to lob into an empty net!\nThe demolition was complete as Joelinton was put through again by Bruno, finishing smartly at the far post and ending the game at 5-1. What a performance from the entire squad.\nHere are my three key points that I am taking from the game:\nChanges ring true\nThere were two changes to the line-up and both made their mark on the game.\nWilson was on the scoresheet at the first opportunity and added another very quickly after the break.\nJoelinton was his usual energetic self, rewarded with two goals as well.\nIsak scored coming on and along with Gordon and Willock, all looked sharp.\nI’ll say it again, I’m very happy we have such quality options to rotate around.\nBreaking defences\nGoing into the match, West Ham were unbeaten at home in the previous five matches, but we put that record to flight in short order.\nFinally showing some clinical finishing- we scored from our first three shots on target- hopefully our runs of profligacy in front of goal are a thing of the past.\nBack to his best\nAfter creating six big chances in the previous game, ASM was proving he was getting back to his best form, and he showed it again within the first 10 minutes, assisting and creating a big chance, with more great play in the second half.\nKept injury free, he may well play a huge part in our bid for top four and Champions League football.\nStats from BBC Sport:\nWest Ham 1 Newcastle 5 – Wednesday 5 April 8pm\nGoals:\nNewcastle United:\nWilson 6,46, Joelinton 13,90, Isak 82\nWest Ham:\nZouma 40\n(Half-time stats in brackets)\nPossession was West Ham 42% (44%) Newcastle 58% (56%)\nTotal shots were West Ham 7 (6) Newcastle 15 (5)\nShots on target were West Ham 2 (2) Newcastle 8 (2)\nCorners were West Ham 7 (4) Newcastle 6 (4)\nReferee: Craig Pawson\nNewcastle United:\nPope, Trippier (Manquillo 87), Schar, Botman, Burn (Targett 85), Longstaff, Bruno, Joelinton, Murphy (Willock 64), Wilson (Isak 64), Saint-Maximin (Gordon 64)\nUnused Subs:\nDubravka, Lascelles, Ritchie, Anderson\n(West Ham 1 Newcastle 5 – The instant NUFC fan / writer reaction – Read HERE)\n(West Ham 1 Newcastle 5 – Match ratings and comments on all the NUFC players – Read HERE)\n(West Ham 1 Newcastle 5 – Capital fun – Read HERE)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 878,
  "scraped_at": "2026-02-14T01:59:46.866551",
  "_text_extracted": true
}