{
  "article_id": "5b840de67586",
  "url": "https://www.hudsonriverblue.com/aiden-oneill-transfer-new-york-city-fc-standard-liege-belgium-mls-ivan-leko-comments/",
  "title": "Standard Liege coach addresses Aiden ONeill - to - NYCFC rumor",
  "date": "20250422T153000Z",
  "domain": "hudsonriverblue.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aiden O'Neill, a rumored New York City FC transfer target, saw his manager at Standard Liege address his future and admit that the midfielder's departure is possible.\nO'Neill has been missing from the last two Standard Liege matchday squads as they compete in the Juliper Pro League's end-of-season playoffs to decide which Belgian clubs earn spots in next season's European competitions.\nStandard Liege manager Ivan Leko was asked about O'Neill in the media availability held before his club's 1-1 draw with KCV Westerlo on April 19. Leko's statements on O'Neill, as shared by Au Cœur du Standard on Twitter, entertained the possibility of the 26-year-old Australian leaving the Belgian side.\nLeko's comments on O'Neill, as translated from French, were: \"When Standard was short of money, my captain's contract was reviewed. This is a testament to his importance. A departure would be a loss, over which I ultimately have no influence. However, you have to leave for something, not peanuts.\"\nO'Neill served as Standard Liege's captain for the majority of the 2024-2025 season but reports first emerged one week ago via Belgian news outlet HLN indicating New York City FC held strong interest in signing the defensive midfielder with 17 international appearances for the Socceroos.\nWhy sell O'Neill?\nLeko's statement about O'Neill's contract refers back to the financial trouble Standard Liege encountered throughout 2024 while still under the control of troubled American ownership group 777 Partners.\n777 Partners at one time ran a version of a multi-club ownership group similar to New York City FC and City Football Group, outright owning or holding sizable stakes in teams like Genoa in Italy, Vasco da Gama in Brazil, Sevilla in Spain, Hertha Berlin in Germany, Melbourne Victory in Australia, and the team of interest for our Aiden O'Neill purposes, Standard Liege in Belgium.\nThe Miami-based financial firm built a small soccer empire, but it collapsed in grand fashion in 2024. May of last year saw a lawsuit filed in New York federal court accusing 777 Partners of committing financial fraud to the tune of $600 million. This wasn't the first bit of financial trouble to plague 777, as pointed out by the New York Times in its report on the lawsuit, with Tariq Panja writing the investment firm was \"trailed by a string of lawsuits, corporate failures and unpaid bills.\"\nOwnership's troubles trickled down to Standard Liege, as it was reported the club had \"no money in its accounts\" and couldn't pay players their owed wages. Standard's former CEO, Pierre Locht, handed in his resignation shortly after because he lost all faith in 777 and viewed the club's situation as \"hopeless.\"\nThe club faced multiple transfer bans due to ownership's financial issues and the heavy debts saddled on it, with a wave of players heading for the exit and finding new clubs as uncertainty hung heavy over Standard. Fan protests against 777 Partners even forced the postponement of one of Standard Liege's matches.\nBy the fall of 2024, 777 Partners had lost control of all its soccer assets, and Standard Liege was under the guidance of A-CAP, a different investment firm that bailed out 777 and promptly put Standard Liege on the sale block while looking for a reported €15 million in exchange for control of the club (and its debts, which reportedly approach €70 million).\nThere's still yet to be a sale of the team, which also still has a leadership vacuum at its top soccer levels, so players have continued to leave – possibly including Aiden O'Neill, next.\nWill a deal happen?\nStandard Liege is without a sporting director, though even HLN's first report linking O'Neill to NYCFC indicated they are actively trying to hire one.\nO'Neill is one of the few remaining Standard players to have weathered the tumultuous 2024 stretch when the club was in disarray and facing existential crisis after existential crisis. As his head coach alluded to, though, O'Neill would have to leave \"for something,\" reportedly at least €3 million, which is said to be Standard's asking price.\nAll reports from Belgium have indicated O'Neill is open to making the move to New York City and MLS, which would seem to bode well for NYCFC's chances. At 26 he's still in his prime years and his performances for Standard helped contribute to the troubled club finishing seventh in the Juliper Pro League's regular-season table, not in one of the coveted top-six spots that get to compete for UEFA Champions League qualification, but still high enough to take part in the playoffs for spots in other competitions like UEFA's Europa League and Conference League.\nNew York City FC is also no stranger to plucking talented players from troubled club situations. Sporting Director David Lee signed Talles Magno from Vasco da Gama shortly after the Brazilian club was relegated from the Serie A in February 2021 – ironically, not too long before 777 Partners swooped in to buy a stake in Vasco da Gama in February 2022.\nO'Neill isn't a prized young prospect chased after by top European clubs, but he would fill the hole left in New York City's squad when a now-injured James Sands left on loan for FC St. Pauli in Germany this January.\nAnother hint on O'Neill's future might emerge later today when Standard Liege returns to action in the Juliper Pro League European playoffs against Jovan Mijatović's OH Leuven (Jovan is out injured currently).\nIf O'Neill, who made 29 appearances in all competitions for Standard this season, is once again absent from Ivan Leko's squad, it will lend even more credence to the thought of him making the move to New York City FC. The question for NYCFC fans will be, when: The MLS Primary Transfer Window closes tomorrow, April 23, with the Secondary Transfer Window not set to open until July 24.\nTime is tight if O'Neill expects to jump right into the MLS season, but he seems like a player to watch given the recent events and uncertain future surrounding his current Belgian club.",
  "word_count": 1002,
  "scraped_at": "2026-02-14T01:58:31.710728",
  "_text_extracted": true
}