{
  "article_id": "5b8892f08850",
  "url": "https://punchng.com/full-list-from-salah-to-drogba-five-legends-without-afcon-gold/",
  "title": "FULL LIST : From Salah to Drogba , five legends without AFCON gold",
  "date": "20251218T071500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Africa Cup of Nations (AFCON) is the flagship international men’s football tournament in Africa. Organised by the Confederation of African Football (CAF), it determines the continent’s national champion and is one of the most watched football competitions in the world.\nSo far, the most successful teams in the history of the competition are Egypt, the most successful nation, with seven titles. Cameroon follows with five, Ghana have won four, while Nigeria have claimed three.\nWith the 35th Africa Cup of Nations scheduled to hold in Morocco from 21 December 2025 to 18 January 2026, BBC Sport Africa looks at five iconic players who never managed to get their hands on the coveted trophy.\nMohamed Salah (Egypt)\nAt 33, time may be running out for Egypt’s captain. Salah has already experienced Afcon heartbreak twice, finishing runner-up in 2017 and again in 2021.\nEgypt, the tournament’s most successful nation with seven titles, last lifted the trophy in 2010 – before Salah had truly established himself internationally. Remarkably, the Pharaohs failed to qualify for three consecutive tournaments between 2012 and 2015, delaying his Afcon debut until 2017.\nThat first appearance ended in defeat to Cameroon in the final. Four years later, Egypt again reached the showpiece match, only to lose on penalties to Senegal. Salah was held back for a potentially decisive fifth kick but never got the chance to take it.\nInjured at Afcon 2023, he watched from the sidelines as Egypt were eliminated in the last 16. Afcon 2025 may represent his final opportunity to complete his international legacy.\nDidier Drogba (Ivory Coast)\nFew players relished big occasions like Didier Drogba. A master of finals at Chelsea, he was decisive time and again in England and Europe. But at Afcon, the script was cruelly different.\nDrogba captained Ivory Coast in two finals – in 2006 and 2012 – and penalties proved his undoing on both occasions. Against Egypt in 2006, he missed in the shootout as the hosts triumphed. Six years later, facing Zambia, he blazed a late penalty over the bar in normal time before the Ivorians again lost on spot kicks.\nDespite multiple semi-final and quarter-final appearances, Afcon glory always slipped away. In a bitter twist, Ivory Coast finally won the tournament in 2015 – just months after Drogba had retired from international football.\nGeorge Weah (Liberia)\nGeorge Weah stands alone as Africa’s only Ballon d’Or winner, claiming football’s most prestigious individual award in 1995. At club level, he dazzled for Paris St-Germain and AC Milan, but international success was limited by Liberia’s modest footballing stature.\nLiberia qualified for Afcon only twice during Weah’s career, in 1996 and 2002. On both occasions, they failed to progress beyond the group stage. Weah scored just once at the tournament, in a 2002 draw with Mali.\nWhile Afcon success never came, Weah would later lead his country in another way – serving as Liberia’s president between 2018 and 2024.\nNwankwo Kanu (Nigeria)\nElegant and intelligent, Nwankwo Kanu enjoyed a glittering club career, winning the Champions League with Ajax and domestic honours with Arsenal. Internationally, he tasted success with Nigeria at youth level and famously won Olympic gold in 1996.\nAfcon, however, proved less kind. His closest brush with the trophy came in 2000, when Nigeria reached the final on home soil. Against Cameroon, the match went to penalties, and Kanu’s miss proved costly as the Super Eagles were beaten.\nNigeria would reach four semi-finals during Kanu’s career but never return to the final. He retired with silver and bronze medals, but no Afcon winner’s medal.\nMichael Essien (Ghana)\nMichael Essien was the heartbeat of a gifted Ghana generation that followed the country’s last Afcon triumph in 1982. Powerful, disciplined and technically superb, he mirrored his club success with Chelsea by becoming a leader for the Black Stars.\nYet injuries repeatedly struck at the worst possible moments. Essien missed Afcon 2006 entirely, captained Ghana to third place in 2008, and was sidelined midway through the 2010 tournament as his team reached the final – only to lose to Egypt.\nPersistent fitness problems curtailed his international career, leaving Essien as another African great whose brilliance was never rewarded with Afcon gold.",
  "word_count": 698,
  "scraped_at": "2026-02-14T02:09:38.451011",
  "_text_extracted": true
}