{
  "article_id": "5bafb9fb0b4e",
  "url": "https://clutchpoints.com/euro-2024-news-rasmus-hojlund-score-backheel-denmark-training-qualifiers",
  "title": "Euro 2024 : Rasmus Hojlund scores ingenious backheel in Denmark training",
  "date": "20231013T134500Z",
  "domain": "clutchpoints.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United forward Rasmus Hojlund has continued to impress both at the club and international level, showcasing his exceptional skills during Denmark's training session ahead of the Euro 2024 qualifiers, reported by GOAL. Despite being marked closely by Brentford's Christian Norgaard, Hojlund displayed his remarkable creativity by executing an ingenious backheel goal that left everyone in awe.\nThat finish from Rasmus Hojlund… 😮💨pic.twitter.com/J0NygdJ9aP\n— Football on TNT Sports (@footballontnt) October 13, 2023\nHojlund has been in fine form for Manchester United, making a strong comeback after recovering from a back injury sustained earlier in the year. Under the guidance of manager Erik ten Hag, he has showcased his goal-scoring prowess, notably netting three goals in two Champions League appearances, including a memorable brace against Galatasaray.\nTranslating his impressive club performance to the national team, Hojlund has been a standout player for Denmark in the European Championship qualifying campaign. He has already scored six goals, including a memorable hat-trick against Finland earlier in the year. His skill, agility, and ability to find the back of the net have made him a key asset for both his club and country.\nIn the upcoming Euro 2024 qualifiers, Rasmus Hojlund will be a player to watch as Denmark faces Kazakhstan on Saturday and San Marino on October 17. His exceptional goal-scoring abilities and creative flair make him a formidable force on the field, leaving fans and teammates alike excited about what he will bring to the upcoming matches. With his recent outstanding performances, Hojlund continues to prove his worth as a rising star in the world of football and in his international duties.",
  "word_count": 269,
  "scraped_at": "2026-02-14T01:51:09.238392",
  "_text_extracted": true
}