{
  "article_id": "5be11b6e712c",
  "url": "https://news.yahoo.com/frank-lampard-says-europe-offers-200643309.html",
  "title": "Frank Lampard says Europe offers Chelsea a welcome break from domestic struggles",
  "date": "20230411T204500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frank Lampard says Europe offers Chelsea a welcome break from domestic struggles\nThe Champions League will offer Frank Lampard’s Chelsea a chance to escape from “a place we don’t want to be” when they face Real Madrid at the Bernabeu on Wednesday.\nChelsea’s interim coach was referring to the team’s position in the bottom half of the Premier League table after they failed to score in any of their last three league outings, with the Champions League offering their only hope of salvaging a wretched season.\nIn the past Europe has offered respite during difficult domestic seasons, as happened in 2012 when the Blues – managed by interim boss Roberto Di Matteo – were crowned Champions League winners at the same time as finishing sixth in the league.\nDi Matteo, who spent five seasons as a player at Chelsea, took over from Andre Villas-Boas when the Portuguese coach was sacked in February, and led the team to a stunning with against Barcelona in the semi-final before beating Bayern Munich in the final.\nLampard was asked about the similarities between the club’s current situation and that season, when a former Stamford Bridge favourite took the manager’s job whilst the team floundered and pulled off an unlikely European success.\nHe warned against allowing history to prevent his side from taking seriously the threat posed by the reigning European champions.\n“I think there are parallels in a simple sense,” said Lampard. “We are (both) ex-players. The year Robbie was here he was an assistant, he had a big awareness of the squad. He got the job earlier in the year than I did.\n“He did an amazing job. I think my situation is different in practice. I do have an awareness of the squad, but not close-hand to all of them.\n“I have to be careful making that parallel, because obviously we have very tough games in front of us. There’s a lot of work to be done, but we’re very committed to trying to, if we can, make our own little bit of history.”\nDefeat to Wolves at Molineux on Saturday marked the first time since 2007 that Chelsea had gone three consecutive leagues games without scoring, following a goalless draw with Liverpool and meek home loss to Aston Villa.\nLampard suggested the chance to lead a challenge for the club’s third European title was a decisive factor in his agreeing to take the job whilst the hierarchy seek a permanent replacement for Graham Potter, who despite overseeing the team’s slide down the league had enjoyed his best moments at Stamford Bridge in leading the team to the last eight.\nVictory against Borussia Dortmund in the previous round was comfortably Chelsea’s best performance of 2023 and Lampard acknowledged the Champions League provides a welcome distraction from domestic struggles.\n“If you isolate this year (it looks like that), he said. “I’ve viewed it from the outside. There have been challenges this year.\n“But the Premier League is also one of the greatest challenges in world football. Those challenges have obviously taken us to a place where we don’t want to be.\n“The Champions League sometimes offers you a bit of escapism from that – a different speed of game, knockout football. Those things can contribute to getting different success in the same season.\n“When you get to this stage in the competition, playing teams of the level of Real Madrid, those sorts of comparisons are pretty worthless. It’s all about what’s in front of you.”\nChelsea will play at the Bernabeu for the third consecutive season after the last two campaigns both brought them to the Spanish capital in the knockout rounds.\nThey knocked out Real in the semi-final in 2021 en route to winning the tournament under former boss Thomas Tuchel but lost the chance to retain their crown as Carlo Ancelotti’s side took revenge in last season’s quarter-final.\n“Every new year in football brings a new story,” said Lampard. “The year before (in 2021), Chelsea came and here were successful in the Champions League in the knockout stage. Last year Real Madrid produced an incredible game that changed in the last moments.\n“Having watched Real Madrid and having a relationship with Carlo Ancelotti, who’s been incredible in his time here, the players have to understand that it’s a special arena and a special football club, and anything can happen.\n“Some things you can’t control. My focus will not be on last year, it will be on what we can do now as a team.”",
  "word_count": 753,
  "scraped_at": "2026-02-14T02:16:40.057198",
  "_text_extracted": true
}