{
  "article_id": "5c2d2a28afd2",
  "url": "https://weaintgotnohistory.sbnation.com/2023/3/20/23647990/chelsea-to-focus-on-ngolo-kante-fitness-during-international-break",
  "title": "Chelsea to focus on NGolo Kanté fitness during international break",
  "date": "20230320T073000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea head into the international break on the back of a disappointing 2-2 home draw against Everton, but also on the back of a three-match unbeaten run that has stabilized our position in midtable, well safe from relegation but also well out of contention for the top-four.\nChelsea to focus on N’Golo Kanté fitness during international break\nWe need a hero\nTop-six may be a possibility still in the eleven games that remain — especially if Spurs just absolutely implode after the pin was pulled in the Conte-grenade — but the primary focus for the rest of the season should be to develop some cohesion, find a consistent playing style, figure out whom we want to keep in the squad for next season, and get N’Golo Kanté healthy for our Champions League quarterfinal against Real Madrid.\nThose two games will be part of a “hectic” April, with 9 games scheduled (7 in the Premier League alone in just four weeks), but we certainly have the legs to handle that workload — as long as we rotate smartly, and prioritize appropriately.\nGetting Kanté fit and firing at the right time will be a massive part of that, and in fact it’s set to our focus for the next fortnight as well.\n“N’Golo’s due to carry on training Monday, Tuesday, Thursday and Friday with potentially a game to give him some minutes. We’re still planning it but I think it will probably be internal. That will be good.\n“We need to control it as much as we can and then I think we’ve got about four players [not on international duty], so it is what it is. We have to hope players come back injury free and that we use the break to refresh and prepare for a really hectic April.”\n-Graham Potter; source: Football.London\nNG was on the bench this weekend, but it sounds like he was never going to get on (so why was he there?). But it seems like we’re all aligned on getting this right at least.\n“Kante is there on the bench and he is ready. It was a difficult one to come into for his first game, he has been away for so long but he’s ready.”\n-Graham Potter; source: Metro\nReal ain’t ready!",
  "word_count": 378,
  "scraped_at": "2026-02-14T01:59:46.882209",
  "_text_extracted": true
}