{
  "article_id": "5c41c5c9db16",
  "url": "https://theathletic.com/4844750/2023/09/15/chelsea-goalkeepers-wsl/",
  "title": "Succession planning or hoarding ? Why are Chelsea the only WSL side to have five goalkeepers ? ",
  "date": "20230915T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was a surprise to see Chelsea announce the signing of yet another goalkeeper in July. Hannah Hampton’s arrival upon the expiry of her Aston Villa contract means Chelsea have five goalkeepers on their books.\nThe opportunity for Chelsea to sign England’s third-choice goalkeeper was too good a moment to miss. The Women’s Super League (WSL) title holders, fully aware of Hampton’s talent, had been keeping tabs on the 22-year-old. Upon signing, manager Emma Hayes described her as “one of the best young goalkeepers in the world” but no confirmation was given as to where she would be playing her football this season.\nAdvertisement\nHampton joined Hayes’ current first choice, German international Ann-Katrin Berger, Sweden’s World Cup star Zecira Musovic, Belgium international Nicky Evrard and 20-year-old Emily Orman (on loan to Women’s Championship side Reading, while also signing a new deal with Chelsea until 2025). Hampton, who is yet to have a Chelsea shirt number, always knew being loaned out was a possibility and was happy to take that risk given Chelsea’s dominance on the domestic and international stage.\nBut Chelsea have opted to loan 28-year-old Evrard to Brighton instead. They want to keep Hampton and patiently develop her with the long-term aim being for her to be Chelsea’s No 1. The club announced Evrard’s arrival in March on a pre-contract agreement. She penned a three-year deal having impressed during last summer’s European Championship and, upon her signing, Hayes said: “I know she will complement Ann and Zecira and add to our goalkeeping union.” Hampton’s arrival, however, has shuffled the pack.\nThe club assessed all four remaining goalkeepers in Portugal on their pre-season training camp. Berger and Musovic played 45 minutes each in their recent friendly at Kingsmeadow against Roma, so Hampton or Evrard seemed the likely loanees. Conversations took place regarding possible destinations but Evrard’s move to Brighton was only finalised on transfer deadline day.\nSo why do Chelsea have so many goalkeepers?\nAt the top end of the WSL there are stark differences in approaches to the goalkeeping department. Arsenal have four goalkeepers (Manuela Zinsberger, Sabrina D’Angelo, academy graduate Naomi Williams and Kaylan Marckese (on loan to Bristol City until 2024)), Manchester United have two (Mary Earps and new signing from OL Reign, Phallon Tullis-Joyce) while Manchester City have three (Sandy MacIver, Ellie Roebuck and Khiara Keating), so it isn’t hard to see why Chelsea having five goalkeepers is a clear example of player hoarding. Four of the five could be a No 1 for a WSL side and the league would be better off if these players were distributed across its clubs.\nAdvertisement\nThere is some method to the madness. Manchester City manager Gareth Taylor once described Chelsea as the “masters of succession planning”. They do their business early, anticipate players’ contracts coming to an end and will put plans in place for the next cycle way in advance. They do not want to be scrabbling around shopping in August.\nChelsea learned their lesson in 2014. On the final day of the season, a win against Manchester City would have secured the club’s first WSL title. Eleven minutes in, goalkeeper Marie Hourihan was forced off with a collarbone injury. At that time, Chelsea did not have a recognised No 2. Christiane Endler, the current Lyon No 1, had returned to her native Chile earlier that summer due to a knee injury.\nThey had to call upon Clare Farrow. Chelsea had signed Farrow from the Met Police women’s team a couple of weeks earlier as a precaution. In her only WSL appearance to date, Farrow failed to stop former England international Jill Scott’s shot, which put City 1-0 up. Chelsea went on to lose 2-1 and Liverpool pipped them to the title on goal difference. It was a costly mistake for the club and ever since they vowed to have at least three goalkeepers.\nBut why five?\nBerger, at 32 years old, is their ageing No 1. The German, who has made over 100 appearances for the club since signing in 2019, only has a year left on her contract. She was crucial for Chelsea last season. Her penalty heroics knocked out Champions League holders Lyon in the quarter-final, she started 15 out of 22 WSL matches and seven out of 10 Champions League games, including all knockout stages, plus the FA Cup final which Chelsea won.\nHayes has also called upon Musovic throughout the season — she is a hard worker who, throughout her career, has often been second choice and had to fight to become No 1. Sweden manager Peter Gerhardsson preferred her over Jennifer Falk at this summer’s World Cup and his decision was vindicated after Sweden knocked out the United States in the round of 16 on penalties.\nGO DEEPER\nZecira Musovic: Who is the Sweden goalkeeper that helped knock USWNT out of the World Cup?\nThe 27-year-old started Chelsea’s other seven WSL games but played only three group-stage Champions League matches. No 2 goalkeepers are rarely happy to sit on the bench and may want to leave to get game time, so a back-up plan is important.\nAdvertisement\nThen there is the new signing Evrard but Hampton cropped up and Chelsea could not resist. The former Villa goalkeeper was part of England’s Euro 2022 squad under Sarina Wiegman and, despite being dropped in September because of “personal issues”, she was recalled in March and kept her place for the summer’s World Cup. Her biggest quality is her distribution, no doubt aided by having been a former striker with Villarreal’s academy.\nAnother key factor is that Hampton is English. Out of a maximum WSL squad size of 25, a minimum of eight players have to be homegrown — they must have been trained by their club, or another club in England or Wales (Welsh clubs are affiliated to the English Football Association) for at least three years prior to their 21st birthday. If Chelsea’s No 1 in years to come is homegrown, it allows them more freedom to buy outfield players from overseas.\nChelsea have a very large squad and during pre-season could have easily fielded two high-quality 11-a-side teams with a goalkeeper playing a half each. Competition for places drives standards. Hayes can only pick a WSL matchday squad of 20 — 11 starters and nine substitutes — leaving players in the stands, let alone on the bench, disgruntled. But the Chelsea boss will be accustomed to making difficult decisions and managing players’ expectations.\nWith trophies at stake in several competitions (the WSL, FA Cup, Conti Cup and the Champions League) and a squad comprising largely of players who will be called up to international duty throughout the season, she needs depth in order to manage player loads and adapt to different challenges, while keeping one eye on ensuring Chelsea’s success for years to come.\n(Top photo: Harriet Lander – Chelsea FC via Getty Images)",
  "word_count": 1152,
  "scraped_at": "2026-02-14T02:00:57.133955",
  "_text_extracted": true
}