{
  "article_id": "5c51eb526df9",
  "url": "https://www.caughtoffside.com/2023/12/15/collymores-column-premier-league-managers-need-wings-clipped-potter-would-be-great-man-united-coach-mourinho-to-newcastle-and-more/",
  "title": "Stan Collymore column : Premier League managers need wings clipped",
  "date": "20231215T153000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In his exclusive column for CaughtOffside, former Liverpool attacker Stan Collymore discusses some of football’s biggest talking points, including Premier League managers’ behaviour towards referees, Jose Mourinho to Newcastle and Liverpool vs Man United.\nPremier League managers need their wings clipped when it comes to referees\nI agree with Ange Postecoglou, I think we need to get back to respecting referees. Around 10 years ago there was a respect campaign which revolved around players crowding around officials and they had discussed this with the captains of both the Northern and Southern Premier League teams. They said we are going to respect the laws of the game and referees and so on. Managers were involved in this and also agreed to it but as players have become unable to control themselves from crowding and pleading their cases to the referees after they feel a wrong decision has gone against them, managers have now taken it upon themselves to do it also.\nArteta is one of many culprits that do this. Concerning this latest occasion, where the Arsenal boss has been let off for his comments following their defeat to Newcastle last month, it is neither here nor there. It shouldn’t be about whether Arteta was let off or not, the bigger point that needs to stand is when are the authorities going to say to managers that all you are allowed to do in a post-match press conference or interview is talk about your own team – nothing about the referee or opposition. If they deviate from that, it is an automatic fine.\nI think it should be the same for pre-match press conferences too as all this would avoid blurring the lines. Referees should only be discussed by former referees and pundits on TV shows.\nWhat we are doing at the minute is flaming the situation to the point where it will end up like what happened in Turkey and a referee is getting hurt. They are not the bad guys so managers need to have their wings clipped a bit.\nThe Premier League needs to clamp down on this now so these petty spats can be eradicated in future seasons.\nPut yourself in Rebecca Welch’s shoes on 23 December\nI don’t see what all the fuss is about this. As a 52-year-old, I can remember around 41 years ago, the best referee when I was playing Under 11s or Under 12s junior football was a woman. I wish I could find her again because she was excellent. She was the only woman in the whole season to referee and at the time, she would have been one in a million. I remember her for simply being an excellent referee and that is what we are trying to get to with the current generation.\nSome horrible comments were going around when this news about Rebecca Welch was announced this week. We are shining a light on the fact that society still is not enlightened enough to accept people for just being good.\nRebecca has obviously passed the benchmark to referee a Premier League match, it should be no big deal, but when I saw the comments after the news broke, I would go one step further and employ a full team of women officials for a game in the Premier League.\nWe now have to make this situation normal. Unless women like Rebecca are given the chance to prove themselves, they will never get to be seen as good enough or not. We are currently in a crossover period, where we are now starting to see a lot more diversity within refereeing teams, in the media and on broadcasts. Within this, you are going to find people who make mistakes, come across as being not good, are not fully comfortable under the spotlight, but that all disappears with time.\nThink about it, this woman is going to be very nervous on 23 December when she walks out to referee Fulham against Burnley. She walks onto the pitch knowing that she is representing 52% of the population, knowing she is the first to do this, and around 85% of the stadium will be full of male football fans. She has nobody to ring for advice or nobody to look back on for encouragement before her big moment.\nFor every person reading this, put yourself in her shoes and ask yourself, if you were that person walking onto the pitch for the first time, would you be a little nervous? So when she comes off of the pitch having done a great job, remember she has done this with all this weight on her shoulders. All I can say to you Rebecca is good luck.\nJose Mourinho to Newcastle is a win-win situation for everyone\nJose Mourinho makes the most sense to take over as the next manager of Newcastle. Fans of the club love Eddie Howe but the more that I think about it it makes even more sense.\nThe Portuguese coach has a great relationship with Sir Bobby Robson, he has always talked fondly about Newcastle and most importantly, he is represented by Jorge Mendes. The superagent has a lot of players in the Saudi Pro League and there is a situation there for the Saudis where they are getting two or three things for the price of one.\nThey get a big-named manager for Newcastle who can lure quality players and has had success at the highest level; he spends around two years at Newcastle and then heads off to the Saudi league, a country where he recently said he will work someday; Mendes then banks on both ends so it turns into a scenario where Mourinho, the Saudis, Newcastle and Mendes all win.\nI retweeted it the other day, this tweet from a Newcastle fan who said ‘It is not going to be long before Mourinho’s name starts getting mentioned around the manager’s job at St James’ Park’ because of the Magpies form and I think at present, we are not a million miles away from that.\nNewcastle fans might not want him because of the style of football but if you are the head of PIF, it makes a lot of sense.\nWhat next for Eddie Howe if the Newcastle manager gets the boot?\nFollowing on from my last point, Eddie Howe’s stock is still quite high, considering where he has taken Newcastle from. If the Magpies don’t qualify for the Champions League this season, it wouldn’t surprise me if they sacked him.\nThe Saudis are here to win. They got into the Champions League faster than expected, which is great; however, you need to stay there and there is a good chance that they won’t qualify for the competition through the Premier League this season.\nThere is still a lot of football left to be played for Howe to keep his job, if he wins the FA Cup, for example. If he doesn’t win anything or qualify for the Champions League, I think the owners will look at the level above, which I discussed in the last point.\nYou could see a situation play out after EURO 2024, where Gareth Southgate moves upstairs with the FA and Howe takes over as head coach. They are very similar personality-wise and they could work well together to take the England national team forward, depending on what happens during the upcoming summer.\nHowe’s stock is high, he is an Englishman, has an attacking style of play, he has managed at the top of the Premier League and in the Champions League, so he is a good candidate if things start moving around the Newcastle manager.\nWill Liverpool be Ten Hag’s final Man United match?\nFans of both Liverpool and Man United fans know from years of watching their teams, that anything can happen in this type of match. However, this game on Sunday feels like there is another bad result incoming for Manchester United. United have had good runs against Liverpool in the past but you’d never head into a match between the Premier League giants thinking ‘This is going to be six or seven’, this situation is unusual. I am currently looking around thinking ‘How on earth can Man United win this match’ but the reality is they can because it is 11 vs 11.\nIf Ten Hag wins this game on Sunday, he will stick around for the rest of the season. I don’t think they will make a change anyway, no matter what happens. They are a big enough club and an adult club that makes its big decisions with all the facts at the end of the campaign.\nHowever, in saying that, if this is an absolute hammering again of a 7-0, I think it will be very difficult for Ten Hag to get respect from the fans and both local media and national media for him to limp through the rest of the season. Getting hammered at Anfield is bad in any season but what has happened proceeding it during the current campaign makes it very difficult.\nIn short, if it is six or seven again, there will be discussions at Man United saying ‘should we do it now’ before January. Overall, I don’t think Ten Hag is good enough for Man United but he should survive this weekend.\nOn a side note, I think the players will play for Ten Hag this weekend. Professional pride will see them put in some sort of performance at Anfield as they won’t want to be seen as the team that got hammered by Liverpool once again. At the end of the day, they have to live in Manchester, and they should play beyond the conversations happening around their manager.\nGraham Potter would a a great Man United coach\nGraham Potter would be a great coach for Manchester United, in my opinion. That club, however, needs a manager with a massive personality. Ten Hag hasn’t been that, David Moyes didn’t have it, Mourinho was but the job maybe came at the wrong time in his career and he wasn’t attack-minded enough for the Old Trafford faithful. Therefore, I don’t think Potter is a big enough manager to be able to turn things around at Old Trafford but he is still a very good coach.",
  "word_count": 1717,
  "scraped_at": "2026-02-14T02:25:08.292054",
  "_text_extracted": true
}