{
  "article_id": "5ca90a111c18",
  "url": "https://www.jamaicaobserver.com/latest-news/fernandes-fires-man-united-toward-the-champions-league/",
  "title": "Fernandes fires Man United toward the Champions League",
  "date": "20230430T184500Z",
  "domain": "jamaicaobserver.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fernandes fires Man United toward the Champions League\nMANCHESTER, England (AP) — There were protests at the start but celebrations at the end as Manchester United edged toward a return to the Champions League on Sunday.\nA 1-0 win against Aston Villa strengthened United’s hold on a top-four place in the Premier League, which was the primary target for manager Erik ten Hag in his first season in charge.\nBruno Fernandes struck in the 39th minute after Marcus Rashford’s shot was pushed away by Villa goalkeeper Emiliano Martinez.\nBoth teams had more chances to score, with United surviving a late push by the visitors, but Fernandes’ goal proved the difference.\nWith third-place Newcastle also winning, United remains two points behind in fourth, with a game in hand.\n“I’m really happy with the points but also with the performance,” Ten Hag said. “Really good performance against a Villa side who did not lose in 10 games, scored in every game and we were in complete control. It could have been 3-1 or 4-1 so a really good and impressive performance.”\nVictory came after supporters staged another protest against United’s American owners, the Glazer family, which came two days after a third round of bidding for the club.\nOn Friday, Qatari banker Sheikh Jassim bin Hamad Al Thani and British billionaire Jim Ratcliffe submitted latest offers, but fans are concerned the Glazers will retain a majority or minority stake in the 20-time English champion.\nSupporters held up a huge banner outside Old Trafford that read “Full Sale Only,” while there were chants of “We want Glazers out” inside the stadium.\nOn the field, Ten Hag’s encouraging first year at the club continued with a potentially vital win against a Villa team that had sparked hopes of a top-four push itself after a run of 10 games unbeaten before Sunday.\nUnai Emery’s team threatened to extend that run by mounting a late push, which saw Victor Lindelof clear off the line from Douglas Luis in the last 10 minutes.\nLoud cheers rang around Old Trafford as the final whistle blew.\nFernandes’ goal was his 11th of the season and came after United saw earlier chances go by, with Rashford denied by Martinez and Casemiro hitting the bar.\n“We have seen character today, we were determined, passionate and we had to win and played good football,” Ten Hag said.\nThe United manager has already led the team to a first trophy in six years — winning the League Cup in February — and looks set to secure qualification to the Champions League after the club missed out on a place in European soccer’s elite competition last season.",
  "word_count": 443,
  "scraped_at": "2026-02-14T02:12:37.698510",
  "_text_extracted": true
}