{
  "article_id": "5cb82a434608",
  "url": "https://www.teamtalk.com/liverpool/delight-pivotal-liverpool-star-rejects-bayern-munich-opportunity-new-anfield-era",
  "title": "Liverpool delight as pivotal star rejects massive Euro giant opportunity for new Anfield era",
  "date": "20240301T173000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool delight as pivotal star rejects massive Euro giant opportunity for new Anfield era\nLiverpool are not worried about losing Andy Robertson as the left-back is poised to reject the huge chance of joining Bayern Munich, according to a report.\nIn a shock twist, Robertson has been tipped to join Bayern this summer as the German titans look to replace current left-back Alphonso Davies. The pacy Canadian has reportedly reached a verbal agreement to join Real Madrid at the end of the season.\nBayern are on the lookout for a top full-back who can replace Davies in case the 23-year-old does head to Spain, and the Daily Mail claim this has seen them land on Robertson as a prime target.\nBut according to Football Insider, Liverpool are ‘very confident’ the Scotland captain will remain at Anfield even after hugely successful manager Jurgen Klopp departs.\nRobertson has no intention of leaving Liverpool and will communicate this decision to Bayern in the very near future.\nThis report comes after TEAMtalk revealed on Tuesday that the marauding wide man would love to commit his future to Liverpool by signing a contract extension, should the club offer him one. Robertson’s current deal runs until June 2026 and is worth a reported £100,000 a week.\nDON’T MISS: Liverpool incredibly put star forward up for sale, as post-Klopp Reds prepare to let three big names go\nLiverpool’s owners, Fenway Sports Group (FSG), will be delighted that Robertson is not enticed by the opportunity of signing for Bayern.\nThe Bundesliga giants usually manage to land their top targets as they are one of the biggest and most successful clubs in Europe. Plus, they already have two British stars in their ranks, Harry Kane and Eric Dier.\nLiverpool ace to reject Kane link-up at Bayern\nBut Robertson does not appear concerned about Klopp leaving and wants to continue Liverpool’s success in their new era.\nIt is likely the 29-year-old will once again be a crucial player for the next Liverpool manager, which could be Anfield hero Xabi Alonso.\nRobertson has proven to be one of the best-value signings in Premier League history. The Reds only paid Hull City £8million to sign him in July 2017.\nSince then, he has registered nine goals and 64 assists in 282 club appearances. Full-backs Robertson and Trent Alexander-Arnold have managed a host of goal contributions between them, helping Liverpool to win major silverware including the Champions League, Premier League, FA Cup and two League Cups.\nRobertson and Liverpool will next be in action on Saturday, when they travel to the City Ground to play Nottingham Forest in the Premier League.\nREAD MORE: Trouble for Liverpool as PSG ‘play the long game’ in pursuit of highly rated Chelsea star",
  "word_count": 461,
  "scraped_at": "2026-02-14T01:51:19.046539",
  "_text_extracted": true
}