{
  "article_id": "5ce0546c2dfc",
  "url": "https://www.france24.com/en/live-news/20240223-clarity-brings-freedom-departing-tuchel-banking-on-bayern-revival",
  "title": "  Clarity brings freedom : Departing Tuchel banking on Bayern revival",
  "date": "20240223T130000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Clarity brings freedom': Departing Tuchel banking on Bayern revival\nBerlin (AFP) – Bayern Munich manager Thomas Tuchel said Friday his summer departure could focus his squad, saying he \"can be a little more ruthless\" after the announcement.\nIssued on:\nBayern and Tuchel issued a statement on Wednesday saying the two would \"part ways\" in the summer, after a poor run of results, although the coach on Friday admitted \"I'm an employee. I'm not sure if I had the choice\" to stay at the helm for next season.\nAmid a three-game losing streak for the first time since 2015, Bayern are eight points behind league leaders Bayer Leverkusen with 12 games remaining.\nTuchel's side will also need to overturn a 1-0 deficit against Lazio to make it out of the Champions League last 16.\nBayern host RB Leipzig on Saturday and could be as much as 11 points behind, with Leverkusen hosting struggling Mainz on Friday.\nSpeaking with reporters, Tuchel said the decision gave \"clarity, and with clarity there's freedom\", saying Bayern were \"still playing for two titles, even if it doesn't seem likely.\"\n\"There's freedom in the decisions about how you act. You no longer have to weigh up what long-term effects it has.\n\"You can coach like in a cup game.\"\nIn 2021, Tuchel took over as manager of struggling Chelsea, taking the side to victory in the Champions League final.\nTuchel was named Bayern coach in March 2023, coming into replace the sacked Julian Nagelsmann.\nHis Bayern side were eliminated in the Champions League and the German Cup, eventually winning the league title after Dortmund's shock 2-2 draw at home to Mainz in the final game.\nAsked if he could become a 'lame duck' with waning influence on the squad in his final months, Tuchel said \"that would say more about the players than about my authority.\"\nWhile accepting the responsibility for the side's poor run, Tuchel said \"the overall picture is not clear.\"\n\"There's not one particular person to blame. If it was just the coach's fault, then there'd be someone else sitting here on the podium.\"\nThe former Chelsea, Paris Saint-Germain and Borussia Dortmund coach said his stint at Bayern \"was the first time for me that development in the players has not been recognisable.\"\nThe 50-year-old manager said there were \"other problems\" at Bayern, but would not reveal specifics.\n\"The club know my analysis and it's a very self-critical analysis, but it's not something to be made public.\"\nLeipzig coach Marco Rose on Friday praised Bayern despite the German champions' struggles.\n\"This is a great football team with excellent individual players and a great coach. Our performance needs to be right in Munich, it has to be really good.\"\n© 2024 AFP",
  "word_count": 457,
  "scraped_at": "2026-02-14T02:13:34.144939",
  "_text_extracted": true
}