{
  "article_id": "5d06a69f2b7a",
  "url": "https://www.unitedinfocus.com/news/ex-manchester-united-goalkeeper-coach-says-they-had-keeper-who-was-even-better-than-edwin-van-der-sar-its-not-peter-schmeichel/",
  "title": "Ex - Manchester United goalkeeper coach says they had keeper who was even better than Edwin van der Sar",
  "date": "20250214T120000Z",
  "domain": "unitedinfocus.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have had some excellent goalkeepers down the years.\nA reliable shot-stopper has always been an important ingredient for success. They’re often unsung heroes of countless victories and can be catalysts for winning silverware.\nAndre Onana is the current Manchester United goalkeeper, following a 2023 transfer from Inter Milan.\nThe Cameroon international impressed in the Champions League final weeks before his move, although his performances for United have been mixed over the past 19 months.\nOnana follows some great goalkeepers in being United’s first choice – from Peter Schmeichel to Edwin van der Sar – and he is under pressure to improve his game after making several high-profile errors between the sticks.\nThere is also the common debate of who is the best United goalkeeper of all time, but everyone has their own opinion on that.\nFrans Hoek names David de Gea as the best\nFormer Manchester United goalkeeper coach Frans Hoek worked alongside some legendary goalkeepers, including Van der Sar and Victor Valdes.\nBut neither of those goalkeepers were the best to have worked with Hoek.\nSpeaking to RG, Hoek revealed that David de Gea was the best goalkeeper he worked with throughout his career.\n“I was involved in the whole scouting process that brought Manuel Neuer to Bayern Munich,” Hoek said.\n“I could have stayed and coached him, but I wanted to remain loyal to Louis after his sacking and left alongside him. Everybody could tell Neuer was going to be one of the biggest talents ever.\n“I worked with Edwin van der Sar at Ajax, Victor Valdés and Pepe Reina at Barcelona, they are all exceptional, but if you ask me to pick, I’d go with David De Gea. I was very impressed that he was capable of playing at such an incredibly high level for two years in a row.\n“During my time at Manchester United (2014-16), he didn’t really have a dip, you didn’t see him fall. He didn’t make a lot of mistakes, but he also made a lot of important actions that gave us the win at the end. He was at an incredible level, three games a week.\n“I was also further along in my coaching journey than I was with Edwin… We were integrating goalkeepers more in training, and I could tell that David was dropping off a little bit in his form in the practices.\n“When I saw that, we sat down together and discussed it, I didn’t wait until the games. We could eliminate the problems before it happened during a game, I could identify earlier if something wasn’t going well and tackle it.”\nThat’s high praise for De Gea, who is currently playing his football in Italy with Fiorentina.\nDe Gea among best goalkeepers in Premier League history\nThe Premier League has been the home for many fantastic goalkeepers down the years.\nAlthough De Gea only won the Premier League once during his time at United, the Spaniard will be remembered for pulling off some of the best saves in Premier League history.\nThat’s why he deserves to be mentioned in the same breath as Schmeichel and Petr Cech.\nOnana has a lot of work to do to get on that list. One way to start is by cancelling out all the high-profile errors he makes between the sticks.",
  "word_count": 552,
  "scraped_at": "2026-02-14T01:58:05.350226",
  "_text_extracted": true
}