{
  "article_id": "5d097550903a",
  "url": "https://www.fourfourtwo.com/features/thomas-frank-tottenham-hotspur-brentford-interview-brondby",
  "title": "  To be stabbed in the back by your own chairman is unbelievable  Tottenham Hotspur boss Thomas Frank little - known journey to the top revealed",
  "date": "20250902T133000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'To be stabbed in the back by your own chairman is unbelievable' Tottenham Hotspur boss Thomas Frank's little-known journey to the top revealed\nTottenham Hotspur's new boss Thomas Frank almost quit football as a youth coach, then left Brondby when his chairman criticised him online under a pseudonym. Now he’s a Champions League manager…\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFourFourTwo sat down with the people who know Tottenham Hotspur's new boss Thomas Frank the best.\nSometimes it’s the paths we don’t take. This very thought was beginning to fester in the mind of a young Thomas Frank. In his early 30s and a father of two, Frank was completing a master’s degree in psychology while working as an instructor for the Danish FA. All while holding down a part-time job as youth coordinator of Hvidovre, a second-tier side in the suburbs of Copenhagen.\n“Nobody in Denmark was working harder than Thomas at that time,” smiles Teddy Hebo Larsen, the long-term chairman of Hvidovre and lifelong friend of Frank’s.\nThomas Frank almost quit coaching whilst still in Denmark\n“He’d been with us six years, overseeing our talented youth teams. Thomas hadn’t been much of a player, which he freely admits, but he’d arrived at Hvidovre highly recommended by his hometown club Frederiksværk, where he’d coached their youngsters, and it wasn’t difficult to see why.\n“He was bright, a brilliant educator and passionate about playing football the right way. He always encouraged possession football, intelligent pressing and, above all, strong communication.”\nFrank’s burgeoning reputation had earned him a job offer from professional outfit B.93 – a full-time position as the club’s head of development – though he’d felt compelled to turn it down. “Thomas was considering giving up on football coaching entirely,” recalls Hebo Larsen.\n“He and his wife had their family to think about and, as you can imagine, he wasn’t earning a fortune. Even at B.93 he wouldn’t bring home very much, so he said no. But you could see that feeling of ‘what if’ was niggling at him.”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nDespite having promised his wife he’d give up coaching, Frank had a change of heart and, in 2004, he joined B.93.\n“It was sad to see him go,” Hebo Larsen says. “But deep down, I was just happy to see him follow his dream.”\nFrank spent two years with B.93 before switching to Lyngby, where further good work earned him a move to the Danish FA’s youth ranks. From 2008 to 2013 he predominantly coached Denmark’s Under-17 and U19 teams, leading the former to their first ever World Cup, as well as a first Euros appearance in eight years.\n“He was entrusted with the best and brightest the country had to offer,” explains Hebo Larsen. “He was thought of as one of the best in Denmark when it came to honing young talent.”\nIt was exactly that reputation that led to Frank’s big break in June 2013, when the 10-time Danish champions Brondby came calling.\nThe Copenhagen giants were a shambles at the time, having only avoided relegation in the final few games of the 2012-13 season, as well as bankruptcy thanks to an 11th-hour intervention from new owners just one month prior to Frank’s arrival.\n“The whole club needed a reset, and Thomas was seen as the perfect man to lead that,” recalls Per Rud, who joined Brondby as sporting director that same summer.\n“We didn’t have the financial muscle to return to dominance, so it was decided we would concentrate on bringing through talented youngsters. Thomas had worked with many of them from his time at the Danish FA. He was inexperienced as a manager, but we saw it as a good long-term fit.”\nRud oversaw the establishment of 'Brondby Masterclass', an ambitious new academy that would help to polish the club’s next generation. Frank’s task was to turn them into a championship team. Brondby’s gaffer was given assurances time would be on his side.\n“There won’t be [managerial] changes just because our strategy isn’t going as hoped,” new chairman Aldo Petersen confirmed. “Development is our goal and it’s what we are keeping track of.”\nFrank’s side tested that patience, going seven without a win at the beginning of the 2013-14 Superliga campaign, while being dumped out of the cup by his old club Hvidovre. Yet Frank slowly got his ideas across to a young team featuring a teenage Christian Norgaard, who he would manage again later on.\nBrondby finished fourth, qualifying for Europe for the first time in three years.\n“The players immediately liked Thomas as he was a great communicator, was energetic and what I’d call a football romantic,” former Brondby midfielder Martin Ornskov recalls.\n“He insisted on playing the right way, being positive in possession and pressing high to win it back. We made a rocky start, but he turned it around. There was a process there and we could see that.”\nBut that process would swiftly be pushed aside when, in the April of that first campaign, minority shareholder Jan Bech Andersen bought a controlling stake in Brondby and become the new chairman. Bech Andersen wasn’t a fan of the youth-first strategy, and wanted a title tilt in Frank’s second season.\n“Suddenly, this project that we were working towards was torn up and a host of new players arrived,” recalls Rud, who often butted heads with Bech Andersen.\n“Money was being pumped into the first team, with big-name signings arriving.” Among those was Daniel Agger, who returned from Liverpool for £3 million, and ex-Bolton striker Johan Elmander, coming back after eight years away.\n“Others might have been upset about such a major shift, but Thomas just said, ‘OK then, now we have to try to win the league’,” Rud remembers.\n“He was such a hard worker – he and I used to tease each other about who’d get into the training ground earlier and who’d leave latest. If he got there before me, I’d say, ‘My goodness, Thomas, haven’t you slept? You look like s**t!’ He’d laugh and shout back, ‘I’d take a look in the mirror before criticising others, Per!’ Thomas had a great sense of humour.”\nBut the heavy investment would prove a hindrance, as Brondby crashed out of the Europa League qualifiers, losing 5-0 on aggregate to Club Brugge. Results in the league were only moderately better as a possession-heavy side struggled to break teams down. By the winter break, the club’s ultras were beginning to make their dissatisfaction known.\nA humiliating 7-0 defeat in a winter friendly with German outfit Hoffenheim didn’t help.\n“That result caused a lot of supporters, the media, and even some players to question Thomas,” admits Ornskov, who played the full 90 minutes on that miserable afternoon.\nAgger later admitted to confronting Frank, demanding the mild-mannered coach make an example of his players by forcing them to train the following day.\n“The morning after arriving back in Denmark, we were sent out on an exhausting run through the forest in the freezing cold,” Ornskov tells FFT.\n“Nobody complained, though. We knew it had been Daniel’s idea and he also took part. For Daniel, it was about setting the same sort of standards he’d experienced at Liverpool.\n\"Thomas was a good coach but he hadn’t yet learned that nasty side to management. That defeat marked a turning point.”\nThe beasting had the desired effect, with Brondby ultimately finishing third and again qualifying for the Europa League. Bech Andersen made it clear though, ahead of Frank’s third season, that failure to challenge for titles would have consequences.\nThe campaign started poorly – Frank’s side lost their opening three league fixtures while getting dumped out of Europa League qualifying again, this time 6-1 on aggregate by Greek outfit PAOK.\n“We always played nice football under Thomas, but we began to wonder if he was strong enough to handle the pressure,” recalls Ornskov.\nA slight improvement ahead of the festive period saw Frank’s team limp into the winter break fifth and facing another trophyless season. Cue one of the most scandalous sagas in Brondby’s recent history.\nOver the winter break, a new account appeared on the Brondby fan forum SydSiden Online. It heavily criticised Frank and sporting director Rud. Barbs included questions over Frank’s ability to integrate new players and his lack of authority.\n‘Oscar’, as the account was named, called for a change of coach.\nAll nothing unusual for a fan forum, of course, until those comments were revealed to have been written by none other than chairman Bech Andersen himself, operating under a pseudonym.\nThe revelations caused a media furore.\n“It was really quite shocking for the players, let alone for Thomas,” Ornskov says. “To be stabbed in the back by your own chairman is unbelievable. We really felt for Thomas as he was a good coach and a really great person. He was inexperienced as a manager, but he always gave his best for the club.”\nFor Frank, the betrayal was a step too far. “After the last days of massive media attention, Jan and I had a talk,” Frank told a press conference in March 2016. “Based on that, I have chosen to end our cooperation.” Bech Andersen also stepped down from his position, though he later reclaimed it and still remains on the board to this day.\nAfter leaving Brondby, Frank needed to spend time away from football. “Despite that episode, he was still in high demand in Denmark,” reveals sporting director Rud, who also left Brondby that season.\n“I was asked by a number of Superliga clubs about Thomas’s availability, and was quite sure that he’d return at some stage and become a leading coach in Denmark. I couldn’t have foreseen the path he eventually chose.”\nIn late 2016, after nine months out of the game, Frank took a phone call that piqued his interest – though not from any club in his home country.\nUnder the ownership of lifelong fan Matthew Benham, who’d made his fortune through a company offering statistical analysis to gamblers, Championship club Brentford had recently risen from League One and gained a foothold in the second tier.\nJust like Benham’s Smartodds punters, the Bees had earned a reputation for relying on in-depth statistical data to find talented but cheap players who had been overlooked elsewhere.\nAfter purchasing the West Londoners in 2012, Benham had also snapped up a controlling share in FC Midtjylland, in turn leading to an increased Danish influence at his Championship side.\nRasmus Ankersen, former chairman of the Superliga giants, was now serving as Brentford’s joint director of football and he wanted Frank – though not as manager.\n“When Rasmus offered me an assistant coach role, I wasn’t sure,” Frank later told FFT.\n“I wanted to be a head coach, but I had heard about Brentford and it suited me. We could maybe out-think bigger clubs.”\nFrank accepted an offer to serve under Englishman Dean Smith. The Dane was tasked with overseeing the transition of players from the club’s B team to the senior squad, as well as coaching and providing analysis to the first team. He made an instant impact.\n“Everyone liked him immediately, as he was a straight-talker and he clearly had a sharp football mind,” former Bees winger Alan Judge recalls.\n“He brought a good dynamic: Dean was the boss, whereas Thomas was more involved with us on the training ground. He was excellent at breaking down transition football and counter-pressing. He was engaging, and he communicated well. Everybody was impressed.”\nFrank’s arrival at Griffin Park coincided with an upswing in form, as Brentford rose from 18th in the table to finish 10th by the end of his first half-season on the staff.\nThey were ninth in 2017-18, before Smith departed in October 2018 to take charge of Aston Villa.\nRather than look outside for his replacement, the Bees chose to appoint the 45-year-old Frank instead.\n“It was a popular choice in the squad,” says Judge. “The transition for Thomas was easy and his demeanour didn’t change – just a few alterations to the way that we did things.\n“I’ll give you a great example of why he was so popular. Often, players that aren’t involved in the matchday squad on Saturday will train differently during the week, to help the others prepare. They also come in on the day after the game, just to get some running in their legs. Not with Thomas. He planned every session so everyone felt involved during the week and those that had to come in on the Sunday were given a proper, curated session. It made everyone feel part of the bigger picture.”\nEven so, Frank’s Brentford got off to a dreadful start, quickly dropping from seventh, where Smith had left them, down to 19th in the space of only two months. “We just tested the system, to see if they wanted to back me or not, by losing eight of the first 10 games,” Frank would joke with FFT.\n“He was an adaptable coach,” Judge remembers. “He realised 4-3-3 wasn’t working, so we switched to a back three – not something we were used to. But we turned a corner and never looked back.”\nThe reshuffled Bees went seven games unbeaten en route to finishing the campaign a respectable 11th.\nThe following season then saw huge progression thanks to a host of summer acquisitions who would become vital members of Frank’s Brentford, including his former Brondby midfielder Christian Norgaard, forward Bryan Mbeumo and goalkeeper David Raya.\nBrentford ended the season in third, before losing out to neighbours Fulham in the play-off final. “That was extremely painful,” the Dane told FFT of the Wembley defeat. “But it was also a driver for the unbelievable season we had after that.”\nInspired by the 31 league goals of summer signing Ivan Toney, Brentford again finished third, only to go up via the play-offs on this occasion, ending their 74 years away from the top flight.\n“It was an incredible achievement, particularly after the heartache of the year before,” lifelong fan and host of the Beesotted podcast Billy Grant says now.\n“During that promotion season, we asked Thomas if he would be open to joining us on the pod for a chat. He told us he would, but only if we did it in the local pub over a pint.\n\"We spoke about football, but also beer, the local area, his hometown, the people of Brentford. Not many managers would do that!”\nWith one of the lowest budgets in the Premier League, the Bees were widely tipped to go straight back down in the 2021-22 campaign, only to defy the odds and finish 13th.\nProving they were no one-hit wonders, they finished ninth the following year – just two points shy of qualifying for Europe – in a season that also saw them do the double over eventual champions Manchester City.\n“The wonderful thing about Thomas is that he always sets his side up to win, no matter who they’re playing against,” explains Judge, who left the club in the January 2019 window.\n“Other teams will shut up shop against the top sides, but Thomas will always try to win. That doesn’t mean he won’t ask his players to defend as well, but in those games against City, for example, he left Toney up high and got runners around him whenever they won the ball back. He’s positive, and fans love that about him.”\nFrank had to remain positive as bigger clubs repeatedly lured his best players away.\nToney, Raya, Christian Eriksen and others all moved on, yet Brentford stayed afloat thanks to smart scouting and their manager’s adaptability.\nAfter securing another top-half finish last term, the traditional elite came calling again. Only this time it was for Frank himself, as Europa League winners Spurs presented the 51-year-old with an offer he couldn’t refuse.\n“I sat down with Thomas back in 2019 and we spoke about a five-year plan,” friend and Hvidovre chairman Hebo Larsen says. “He told me his ambition was to take Brentford to the Premier League, help them stabilise in the top flight, and then take charge of a Champions League club. In the end it took him six years.”\nFrank knows he’ll have his hands full at Spurs, given they finished only one place above the relegation zone last term.\n“I promise you one thing,” he told journalists at his first press conference in north London. “We will lose football matches. I haven’t seen a team not losing any. There is Arsenal [and their 2003-04 Invincibles], who we can’t mention, so I’ve made my first rookie mistake there! Then there was Preston [in 1888-89] – those are the only two.”\nNobody is expecting Frank’s side to become the third, but challenging at the right end of the Premier League will be mandatory, regardless of performance in the cups. Those that know him best believe he has what it takes.\n“I think he’ll do very well there,” says Judge. “He’s walking into a Tottenham side that doesn’t have any superstars or big egos, and Thomas is an expert at getting everybody on board. The Spurs fans will want to see attacking football, and he’s superb at that.”\nOrnskov also wishes him well. “To be honest, I would never have expected this based on our time spent together,” he looks back. “Thomas had a brilliant tactical mind, but I wondered if he was mentally tough enough for it. There’s no doubt he’s gained that along the way. I believe he’ll be a huge success.”\nFor his old friend Hebo Larsen, the job represents the ultimate reward for a gamble that was made more than 20 years ago.\n“He was close to walking away from football, and now look at him,” Hebo Larsen says with a smile. “I may need to sit down with him and make a new five-year plan.”\nWith Thomas Frank, you never know where the path will lead next.\nEd is a staff writer at FourFourTwo, working across the magazine and website. A German speaker, he’s been working as a football reporter in Berlin since 2015, predominantly covering the Bundesliga and Germany's national team. Favourite FFT features include an exclusive interview with Jude Bellingham following the youngster’s move to Borussia Dortmund in 2020, a history of the Berlin Derby since the fall of the Wall and a celebration of Kevin Keegan’s playing career.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 3212,
  "scraped_at": "2026-02-14T01:52:36.761915",
  "_text_extracted": true
}