{
  "article_id": "5d0f6be842c4",
  "url": "https://www.meathchronicle.ie/2023/10/25/brendan-rodgers-believes-celtic-proved-they-can-match-top-level-team/",
  "title": "Brendan Rodgers believes Celtic proved they can match  top - level  team",
  "date": "20231026T014500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brendan Rodgers believes Celtic proved they can match ‘top-level’ team\nBy Gavin McCafferty, PA\nCeltic manager Brendan Rodgers hailed his side’s “terrific performance” after a 2-2 Champions League draw with Atletico Madrid.\nCeltic twice took the lead in the first half through Kyogo Furuhashi and Luis Palma, who netted shortly after Antoine Griezmann had netted the rebound from his own penalty.\nCeltic played with pace, purpose and confidence in the first half and both goals came after excellent moves, but they could not keep up the tempo after the break and Alvaro Morata levelled eight minutes into the second half.\nRodgers said: “I thought it was a terrific performance, especially the first 45 minutes – the quality of our football, the speed in our pressing and in our game, everything we would want.\n“We were unfortunate with the penalty. One, it was very harsh, and, two, they got the good fortune after the save hits the post and comes straight to the player.\n“But our reaction was superb, everything I wanted in terms of playing together, pressing and the intensity and a really aggressive mentality and then having the courage to play.\n“We expected them second half to have a spell in the game but they didn’t create so much. Their equaliser was fantastic, the early cross and great finish.\n“But we kept fighting and showed we can compete with a top-level team.\n“It will give us confidence to know we can create opportunities and play the football we want to play. The team pressed the game well and passed it for a lot of the game.”\nRodgers, who revealed Reo Hatate had suffered a hamstring injury, which forced him off for Paulo Bernardo inside seven minutes, admitted it was difficult to maintain the intensity for 90 minutes.\nCeltic never looked like taking the lead for a third time, despite Atletico going down to 10 men in the 82nd minute.\nHe added: “There’s a wee bit of tiredness that comes in the last 20 minutes because we are not used to playing at that tempo and against that level of opponent, so naturally a wee bit of fatigue kicks in. We also had to make an early sub with Reo’s injury.\n“It was a really big performance but we couldn’t quite get the result we were looking for.”\nCeltic are bottom of the group with one point from three games ahead of trips to Madrid and Lazio, the latter of whom have four points.\nRodgers said: “We wanted to get three points but if you can’t get the win then don’t lose it, and I don’t think we looked like losing. I can see development for sure.\n“We have shown we can perform and we go into the other three trying to get as many points as we can and see where it takes us.”\nAtletico manager Diego Simeone admitted his side had struggled to deal with Celtic in the first half.\n“As expected, they started really well, as they did in their first two games,” he said.\n“We really struggled to contain them early on and they scored with their first attack. We managed to respond but they quickly scored a fantastic goal.\n“The first half didn’t go as we would have liked but I was really pleased with the second half, it was a real Champions League performance. We showed a lot of personality and responsibility.”\nSimeone, who brought on Marcos Llorente and Rodrigo Riquelme at half-time, added: “In the first half we didn’t have the speed the game required, we weren’t up to scratch and they combined well in our half.\n“But the subs had a big impact and we had better solutions in our passing game.”",
  "word_count": 620,
  "scraped_at": "2026-02-14T01:51:09.225958",
  "_text_extracted": true
}