{
  "article_id": "5d1eb415766b",
  "url": "https://www.france24.com/en/live-news/20240606-rangnick-has-austria-primed-to-surprise-at-euro-2024",
  "title": "Rangnick has Austria primed to surprise at Euro 2024",
  "date": "20240606T024500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rangnick has Austria primed to surprise at Euro 2024\nBerlin (AFP) – Austria coach Ralf Rangnick believes his side can spring a surprise at Euro 2024 despite the absence of their leading player David Alaba and a tough opener against France.\nIssued on:\nJust over a month after rejecting the manager's job at Bayern Munich, Rangnick will want to prove he made the right move in sticking with Austria.\nThe 65-year-old, who had a brief spell at Manchester United in the 2021-2022 season, has been among the most important coaches in German football since the turn of the century, redefining playing styles and influencing a generation of coaches including Jurgen Klopp, Thomas Tuchel and Julian Nagelsmann.\nRangnick's know-how will be needed as Austria have been hit by injuries to crucial players ahead of the tournament.\nReal Madrid's Alaba, Austria's captain and best player, along with forward Sasa Kalajdzic and midfielder Xaver Schlager have all been ruled out of the tournament.\nThe biggest blow to Austria's hopes came in December, when Alaba -- winner of four Champions League titles -- tore his ACL playing for Real Madrid, depriving the side of their undoubted star over the past decade.\nAlaba has however pledged to travel with the Austrian side as a 'non-playing captain'.\nFresh from an excellent run to the Champions League final after which he was named in the team of the tournament, Borussia Dortmund midfielder Marcel Sabitzer will be even more important should Austria reach the knockout stage for just the second time in their history.\nRangnick the 'Godfather'\nAustria's hopes got a boost in May however when Rangnick resisted Bayern's overtures, pledging his future to the Alpine nation.\nOutside Germany, Rangnick is perhaps best known for his unsuccessful interim stint at United.\nBut his accurate outgoing assessment of crisis-ridden Man United as needing \"open heart surgery\", alongside his impressive current stint as Austria manager, have kept Rangnick in high regard -- particularly given the ongoing issues at Old Trafford.\nThe architect of the multi-club Red Bull system, Rangnick has revolutionised German football.\nNicknamed the \"godfather of gegenpressing\" -- an aggressive defence-into-attack ideology commonly associated with former Liverpool manager Klopp -- Rangnick seemed an unusual choice as an international manager.\nEither as a coach or sporting director, Rangnick is known for his hands-on approach to all aspects of club operations, from organising academy systems to the food in the cafeteria.\nBy contrast, international coaches have precious little time with their players -- a particular challenge for Rangnick, whose style of play is centred around adherence to a complex pressing ideology.\nAppointed in June 2022, Rangnick turned Austria around after a tough start with four losses and just one win in his opening six games.\nAustria have lost just one of their past 15 matches, winning 12. Rangnick's side qualified second, just one point behind Belgium in their group.\nRangnick's side open their tournament against France on June 17.\nPlaying in the European Championship for just the fourth time, Austria will be clear underdogs against France, who have made the final in three out of the past four major tournaments.\nWith Kylian Mbappe and his French teammates odds-on to top the group, Austria's matches against fellow Group D members Poland and the Netherlands will be crucial if Rangnick's side are to equal their best-ever result of reaching the last 16 in 2021.\n© 2024 AFP",
  "word_count": 564,
  "scraped_at": "2026-02-14T02:10:54.430850",
  "_text_extracted": true
}