{
  "article_id": "5d30cf983c81",
  "url": "https://www.managingmadrid.com/2023/11/30/23982063/another-win-30-november-2023",
  "title": "Another win : 30 November 2023",
  "date": "20231130T080000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nAnother win: 30 November 2023\nThursday Edition of the Daily Merengue\nShoutout to the mods who do a fantastic job, Valyrian Steel, Kung_Fu_Zizou, Juninho, NeRObutBlanco and yours truly, Felipejack\nAncelotti is Real Madrid coach with most UCL victories\nWith this result, Real Madrid have scored 12 goals in the last 3 games! Giving the injuries, the lack of forward signing, we are so far doing very well.\nCarlo deserves all the credits for the results and titles he achieves with Real Madrid. He is definitely a legendary Real Madrid coach.\nPress Conference\nCarlo was asked to compare Zidane and Bellingham. Carlo said:\nIt’s difficult to compare two different generations. What I see is [Jude’s] arrival into the box that Zidane didn’t have. And the individual quality of Zidane that Bellingham doesn’t have. I think the modern football demands more players that are physically strong like Bellingham, players that are capable to cover a lot of field in a very fast way.\nCarlo also made interesting comments about the defensive change he made after the game vs Atleti\nIn the game against Atleti, we conceded 3 goals from crosses because we weren’t able to control the penalty box well with the two center-backs. So we have modified a little. Now, the cover behind a fullback is done by a midfield, which allows to keep the center backs more inside the box to handle crosses. The team has improved and now we are very well defensively. There always are things to improve. Today we could have been stronger especially when we had the low block.\nCarlo confirmed that Modric most likely returns vs Bétis, not for next game against Granada.\nTop performances from...\nJude, of course, again MOTM performance. But let’s not forget Rüdiger, again with masterclass in a UCL game.\nI hope he stays fit and well for all UCL games this season.",
  "word_count": 341,
  "scraped_at": "2026-02-14T02:25:08.297843",
  "_text_extracted": true
}