{
  "article_id": "5d5f1ea4f1fe",
  "url": "https://www.fourfourtwo.com/features/ranked-the-10-most-controversial-moments-in-champions-league-history-chelsea-barcelona-arsenal-manchester-united-man-utd-liverpool-real-madrid-juventus-ac-milan-inter",
  "title": "Ranked ! The 10 most controversial moments in Champions League history",
  "date": "20250902T180000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 10 most controversial moments in Champions League history\nMarcos Alonso's disallowed goal against Real Madrid is nothing compared to the pantheon of close calls, dodgy decisions and downright outrageous moments of madness in Europe\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe Champions League is the greatest competition on Earth. Its prestige, from the star ball to the anthem, is dripping in glamour and glory. But boy, oh boy, has it cheesed off people in the past.\nFrom those claiming there's a draw-rigging conspiracy to those who believe referees favour certain clubs, there's no shortage of outrage when it comes to this competition. Certain decisions, moments and events, however, have sparked such ire and red-hot anger from fans that we're poking a beehive just by mentioning them here.\nIf you're still traumatised by how your side was robbed in Europe, look away now…\n10. The penalty gaffe that led to a swift rule change\nAtletico Madrid faced Real Madrid in the Champions League last 16 in March 2025, and the two sides could not be separated over the two legs. Penalties it is then.\nDespite slipping on his run-up, Julian Alvarez thought he has scored his effort to make it 2-2 on penalties, and so did the referee - but VAR buzzed down to say that both Alvarez's intended right foot and his slipping left foot had touched the ball. Under the rules at the time, the strike was ruled as a miss. Real went on to win the shootout 4-2.\nEven aside from the conversation about whether Alvarez had double-touched (he had, a tiny bit, but it was imperceptible from most angles), it felt wrong to many football fans that an unintentional error like that didn't allow Alvarez to re-take his penalty.\nUEFA agreed, and implored IFAB to change the rules; they did so just three months later. Now, if something similar happens, a retake is awarded as long as the double-touch was unintentional and the player actually scored.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n9. Ronaldo's double Bayern drama\nCristiano Ronaldo became the first player ever to score 100 goals in the Champions League in 2017, when he netted a hat-trick in a quarter-final win over Bayern Munich. As far as Bavarians are concerned, mind, he should've just scored once.\nReal and Bayern went hammer and tongs at each other over the course of those three hours, in an end-to-end Bernabeu tug of war. With the scores poised at 3-3 on aggregate, however, it was the two Ronnies that made the difference: first, Ronaldo slotted the ball past Neuer a yard offside from a cross, before Marcelo squared it to CR7 for his hat-trick when he was ahead of him.\nBayern were peeved – but also absolutely knackered. Neuer had taken a battering to his goal over those two legs and there was a sense that those goals would've come either way. Still, that's not the point…\n8. The ine-Legia-ble star (sorry)\nChampions League qualification play-offs are de rigueur for Celtic these days, but even they had never experienced anything like the bizarre situation that saw them pass through the first round of qualifying.\nLegia Warsaw thumped Celtic 4-1 in Glasgow in the first leg and secured their qualification with a 2-0 victory in the second leg. Unfortunately for them, a clerical error meant the result was struck off: Celtic were awarded a 3-0 win and went through on away goals.\nThe issue was that Bartosz Bereszynski had been sent off in the Europa League the previous season and still had a suspension to serve. Legia thought he had already sat out the required time in the previous qualifying round - but they had failed to register him in their squad for those games, which meant they didn't count.\nCeltic lost in the next round to Slovenian side Maribor, in any case.\n7. The abandoned Milan derby\nIf it's ever-so-slightly silly that AC Milan or Inter Milan could possibly be eliminated from a tie against one another on away goals, a 2005 tie between the rivals was stopped with Milan 3-0 up on aggregate for even more ridiculous reasons.\nWith Inter trailing and Esteban Cambiasso seeing his goal chalked off, Nerazzurri followers got tired of the football and started throwing missiles onto the pitch. Milan keeper Dida was hit by a firework, deemed to be the final straw by referee Markus Merk. The game was abandoned and that iconic photo of Materazzi and Rui Costa watching on was taken.\nInter were ordered to play their next six European games behind closed doors, with two of those games suspended for three years. They were fined 300,000 Swiss francs (about £132,000), too.\n6. Frisk leaves football\nIncredibly, this isn't even even the most controversial meeting between Chelsea and Barcelona: that came a few years later, and appears higher in our list.\nNo, this is the one from 2005, in which Didier Drogba was quite rightly sent off for an abysmal studs-up challenge on Victor Valdes that may have started innocently enough but ended up looking more like Eric Cantona's kung fu kick as Drogba threw his full weight behind the challenge.\nSome pointed to Valdes clutching his throat as evidence as simulation, which rather overlooks that Drogba had planted his shoulder right into the area in question in the process of making the challenge. It was the reddest card you ever will see.\nBut this is football we're talking about, and Frisk was sent death threats by some completely unhinged Chelsea fans who we can only assume (and hope) have terrible empty lives devoid and love and joy. He never officiated again, saying he was too afraid to even send his children to the post office.\n5. Buffon vs Oliver\nWith Juventus 3-0 up against Real Madrid in 2018 – them again – Cristiano Ronaldo was given a dramatic last minute penalty to give Los Blancos that all important consolation and drag Real through on aggregate. In all his long, long career, Gianluigi Buffon had never been so incensed.\nThe Italian No.1 went storming up to referee Michael Oliver, screaming at him that he had a rubbish bin for a heart. The Premier League official took exception to this, proceeding to send Buffon off for his foul language.\nJuventus felt robbed, as if Oliver had been looking for the very slightest excuse to rail against them, while Buffon later argued that Oliver was far too young to be a referee in that kind of atmosphere. Ahh, the youth today, eh Gigi?\n4. Van Persie's Camp Nou red\nThe first leg of Arsenal's 2011 Champions League tie against Barcelona is remembered for a virtuoso Jack Wilshere masterclass against one of the greatest midfields ever. The reverse game has gone down for a moment of genuine madness.\nWith the tie still in Arsenal's favour on 55 minutes, Robin van Persie was given perhaps the harshest second yellow card of all time. The Dutchman was clean through on goal, took a shot and then turned to see that the offside flag had been raised.\nSeeing RVP had kicked the ball away after the whistle was blown, referee Massimo Busacca brandished a booking. Van Persie argued he couldn't hear the whistle in the raucous atmosphere of the Camp Nou – but it was all in vain. The 10 men of Arsenal crashed out of the Champions League and Barca went onto Wembley.\n3. Chelsea's penalty denials\nThings were already heated between Chelsea and Barcelona thanks to what happened in 2005, but we hadn't seen anything yet. The two sides met again in a semi-final in 2009, with Barcelona going through on away goals after a 0-0 draw in the first leg and a 1-1 draw in the second leg, thanks to Andres Iniesta's 88th-minute equaliser.\nIt was the second game where it all kicked off. Chelsea had four shouts for penalties over the course of the game, with each and every one turned down by referee Tom Henning Ovrebo (who had also dismissed Barcelona's Eric Abidal for a last-man foul). He would later admit to having made mistakes in the game, and...yeah, at least one of them definitely should have been, arguably three.\nBut as journalist Gabriele Marcotti would point out in the aftermath, everyone agreed that the referee had got key penalty decisions wrong - yet no two people could seem to agree on which ones, specifically, were right or wrong even after watching multiple replays (Gerard Pique's blatant handball aside), and as such Ovrebo should probably have been given the benefit of the doubt. Also: Chelsea missed three sitters. They had themselves to blame just as much as anyone else.\nBut as Anders Frisk will tell you, it doesn't really work that way. Chelsea players swarmed Ovrebo after the game, and Drogba made his feelings explicitly clear right down the barrel of a live TV camera after the game - and we do mean explicit. Naturally, the death threats followed.\n2. The ghost goal of Garcia\nWhy is it always Chelsea? No one will ever know if Luis Garcia's shot in the 2005 Champions League semi-final for Liverpool actually crossed the line but the very ambiguity made this moment the most talked-about goal of the Reds' Champions League win that season.\n\"After that semi-final he came up to me and wished me luck for the final,\" Garcia told FFT about a raging Mourinho, who this time held his ire in. \"He’ll always deny my goal, but if I was him I’d do the same.\"\nThank goodness this could never happen again, thanks to goal-line technology… well, except for that time that it happened in the Premier League and helped Aston Villa avoid relegation.\n1. Marseille's expulsion\nThe most controversial moment in the history of the Champions League is one in which the perpetrators didn't get away with it. In fact, they didn't do anything wrong in this competition.\nMarseille president Bernard Tapie saw the 1993 Champions League final on the horizon and knew that some of his players might well be tired from playing Valenciennes just days before. Rather than suggesting his manager Jean-Pierre Bernes rest key men, the pair contacted three Valenciennes players, bribing them to go easy on l'OM. Two accepted the bribe, one refused and exposed them.\nThe very first winners of the tournament, following its rebrand from the European Cup, were unable to defend their title after a massive ban. Tapie was sentenced to prison, turning to threatre and TV among other endeavours later in life. It's still a stain on European football.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1972,
  "scraped_at": "2026-02-14T01:52:36.761004",
  "_text_extracted": true
}