{
  "article_id": "5d8fce771fcf",
  "url": "https://www.arsenal.com/news/loan-watch-two-two-biereth",
  "title": "Loan Watch : Two in two for Biereth",
  "date": "20240226T114500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mika Biereth continued his rich vein of form for SK Sturm Graz with another two goals last week.\nHe scored the only goal of the game in Thursday’s 1-0 win away to Slovan Bratislava in the second leg of the UEFA Europa Conference League knockout round play-offs, one week after scoring on his European debut in the first leg, setting up a round of 16 tie against LOSC Lille.\nOn Sunday, he then scored the opening goal of a 2-0 win away to WSG Tirol to remain second in the Austrian Bundesliga, just two points behind Red Bull Salzburg.\nIn the Premier League, Sambi Lokonga played the first half of Luton Town’s 4-1 defeat away to Liverpool on Wednesday.\nThe Hatters are 18th in the Premier League, one point behind Everton and with a game in hand.\nIt was a good weekend for our loanees in the Championship though, with Charlie Patino and Brooke Norton-Cuffy coming on in the 79th and 62nd minutes respectively of their wins with Swansea City and Millwall.\nSwansea won 2-1 at Sunderland to go 17th in the division, four points above the relegation zone, while Millwall’s much needed 2-1 win away to Southampton kept them 20th and one point above the drop zone.\nIn League One, Leyton Orient are six points off the play-off places following Saturday’s 2-1 win away to Oxford United, which Khayon Edwards came on in the 85th minute of for The Os.\nOne tier below, it was a disappointing week for Wrexham, who fell to fourth in League Two and four points behind leaders Mansfield Town after a 1-1 draw at MK Dons and a 1-0 loss away to Gillingham, Arthur Okonkwo in goal for both games.\nBromley dropped to third in the Vanarama National League and are level on points with Barnet after a 2-2 draw at home to Dagenham & Redbridge and a 2-0 loss away to Eastleigh last week. Alex Kirk played the full 90 minutes of both games, while Kido Taylor-Hart came on in the 84th minute of the former and the 74th minute of the latter.\nIn the National League South, Eastbourne Borough are four points from safety following Tuesday’s 2-1 win at home to Havant & Waterlooville, which Billy Vigar played 59 minutes of.\nOverseas, Salah-Eddine Oulad M’Hand played 73 minutes of Friday’s 2-0 defeat away to De Graafschap for FC Den Bosch, who are bottom of Eerste Divisie with 20 points.\nIn women’s football, Ruby Doe played 70 minutes of Sunday’s 4-1 win at home to Rugby Borough for Ipswich Town to go fifth in the FA WPL Premier Division South.\nPlayers who were unused substitutes:\n- Kieran Tierney - Real Sociedad\n- Marquinhos - Fluminense\n- Charles Sagoe Jr - Swansea City\n- Zane Monlouis - Reading\n- Catalin Cirjan - FC Rapid București\nPlayers who weren’t included in match day squads:\n- Nuno Tavares - Nottingham Forest\n- Tyreece John-Jules - Derby County\n- Omar Rekik - Servette\n- Brian Okonkwo - Leatherhead\nPlayers whose teams didn’t play last week:\n- Michelle Agyemang, Laila Harbert - Watford Women\n- Freya Godfrey - Charlton Athletic Women\n- Kathrine Kuhl - Everton Women\n- Gio Queiroz - Madrid CFF\nImage credit: Foto Atzler\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 566,
  "scraped_at": "2026-02-14T01:51:19.050165",
  "_text_extracted": true
}