{
  "article_id": "5dd1079c43a7",
  "url": "https://pragativadi.com/isl-2025-26-moves-to-centralised-venues-amid-funding-concerns/",
  "title": "ISL 2025 - 26 Moves to Centralised Venues Amid Funding Concerns",
  "date": "20251229T100000Z",
  "domain": "pragativadi.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2025-26 season of the Indian Super League (ISL) will take place across two or three centralised venues instead of the traditional home-and-away format.\nThe All India Football Federation (AIFF) and ISL clubs reached this decision during a meeting on Sunday.\nCommittee member Caetano Fernandes earlier suggested February 5 as the start date, but the final schedule remains undecided. Traditionally, the ISL begins in September, but this year’s edition faces delay because the business model remains uncertain after the expiry of the Master Rights Agreement between AIFF and Football Sports Development Limited.\nThe federation floated a tender for a new commercial partner, but no bidders came forward. Clubs pressed AIFF for clarity on two critical issues.\nFunding: With no commercial partner, clubs asked whether AIFF would finance the league independently. They demanded assurance that the federation could sustain the competition without external support.\nAsian Competitions: India currently holds two slots in the AFC Champions League Two—one group stage berth for the ISL Shield winner and one playoff spot for the AIFF Super Cup winner. FC Goa secured the Super Cup slot, but the ISL Shield winner risks disqualification because the shortened format fails to meet AFC’s mandatory criteria.\nAFC rules require domestic leagues to feature at least 24 matches per team, run for eight months, and follow a home-and-away format. AIFF’s proposed conference-based model allows only 15 matches per team, which falls short of requirements. Therefore, AIFF plans to request the AFC to retain India’s two slots, citing extraordinary circumstances. The federation must submit its methodology by March 31.\nAIFF will hold a physical meeting with clubs to discuss venues, operational expenses, salary caps, and long-term investment protection. The federation will also review the league’s future vision from the 2026-27 season onward.\nALSO READ: CM Majhi to Attend World-Famous Dhanu Yatra in Bargarh Tomorrow",
  "word_count": 304,
  "scraped_at": "2026-02-14T02:12:17.546995",
  "_text_extracted": true
}