{
  "article_id": "5dd38849fbee",
  "url": "https://www.aol.co.uk/ruben-amorim-braced-alex-ferguson-170501555.html",
  "title": "Ruben Amorim braced for  new Alex Ferguson  hype if Sporting beat Man City",
  "date": "20241104T183000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim braced for ‘new Alex Ferguson’ hype if Sporting beat Man City\nRuben Amorim will ignore talk he could be branded the next Sir Alex Ferguson as expectations increase ahead of his arrival at Manchester United.\nThe 39-year-old Portuguese was confirmed as Erik ten Hag’s replacement as United boss last week and will officially take charge at Old Trafford on November 11.\nPrior to that he has two final matches with Sporting Lisbon to see out, the first of which is against United’s fierce rivals Manchester City in the Champions League on Tuesday.\nAmorim recognises the demands are high at United, who have not won the Premier League title since Ferguson retired in 2013.\nAfter he guided Sporting to two league crowns – ending a 19-year title drought in the process – United hope they have finally found the right candidate to end their own wait.\nAmorim thinks anticipation will only increase if he can oversee a Sporting triumph on Tuesday, but he intends to avoid all the hype as he prepares for his final home game with the club.\n“The focus is on winning the game for Sporting,” said Amorim at a press conference to preview the game.\n“After that, the inferences that people will draw from this game are not important to me because they could be misleading.\n“If the result is negative, expectations will drop. If we win they will think that the new Alex Ferguson has arrived!\n“That will be very difficult to live up to. I don’t think about that. What interests me is to win.”\nAmorim was recently linked with City as a potential replacement for Pep Guardiola, a rumour which surfaced following confirmation Sporting’s director of football Hugo Viana would be moving to the Etihad Stadium next year.\nAmorim said: “Obviously, it is something that crosses your mind but I never had any doubt.\n“My decision is made. I wanted to work for Man Utd and that is what I did.”\nAmorim has some experience of United having been welcomed to the training ground by then manager and countryman Jose Mourinho when he took his coaching badges in 2018.\nAs one of the most successful coaches of his generation, former Chelsea, Tottenham and current Fenerbahce boss Mourinho has long been an inspiration to Amorim.\nHe said: “I haven’t spoken to him yet. He’s full of games and so am I.\n#SCPMCI loading… ⏳ pic.twitter.com/eTMKxZFrQW\n— Sporting CP (@SportingCP) November 4, 2024\n“The impact he had on my career was the way he treated me, he showed me that you can win everything and be a different person than you think.\n“He’s a special coach, who opened doors for us (Portuguese managers).”\nAnother manager Amorim respects greatly is Guardiola, whom he not only faces this week but will come up against in a Manchester derby next month.\nHe said: “I see a lot of matches from everywhere and draw inspiration from all sorts of coaches.\n“There is not just one but I did take a lot from Guardiola.”\nAmorim, despite being fluent and repeatedly asked, refused to answer any questions in English during his 27-minute session with media but denied this was a result of a request from United.\nHe said: “Tomorrow I will be Sporting’s coach and only Sporting’s. From the 11th onwards I will be United’s coach.”",
  "word_count": 556,
  "scraped_at": "2026-02-14T02:26:24.531855",
  "_text_extracted": true
}