{
  "article_id": "5dd77304bde2",
  "url": "https://www.fourfourtwo.com/news/when-you-think-of-when-we-were-at-united-we-should-be-pretty-ashamed-roy-keane-reflects-on-mad-manchester-united-decision",
  "title": "  When you think of when we were at United , we should be pretty ashamed  Roy Keane reflects on  mad  Manchester United decision",
  "date": "20251013T100000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nAs the 2025/26 FA Cup steps up a gear on Monday evening with the draw for the first round, former Manchester United skipper Roy Keane has looked back on one of his old side’s most controversial campaigns in the competition.\nKeane - who FourFourTwo ranked at no.12 in a list of Manchester United’s greatest ever-players - won the famous trophy four times with the Red Devils during his 13-year stint at Old Trafford.\nOne of these victories came during the club’s historic 1998/99 treble-winning campaign, but Keane and his teammates were infamously denied the opportunity to defend their crown the following season.\nRoy Keane on his 2000 FA Cup regrets with Manchester United\nThat’s because the club would end up withdrawing from the competition. With the Football Association bidding to host the 2006 World Cup, they encouraged Manchester United to give the world’s oldest cup competition the swerve and instead play in the inaugural World Team Championship, the forerunner of the Club World Cup.\nThis decision was widely criticised at the time by fans, media and politicians, with the club defending their decision and claiming that they made the decision ‘in the national interest’ and had ‘no alternative’\nSir Alex Ferguson’s team would make the trip to Brazil to play in FIFA’s eight-team competition, only to finish third in their group behind Mexican side Necaxa and Vasco da Gama.\nKeane has now looked back at the club’s decision to give up their FA Cup crown with regret in a conversation with his former team-mate Gary Neville on the Stick to Football podcast.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"I think one thing that was definitely better back in the day was the FA Cup. That was magic when we were playing,” Neville began, before Keane gave his take.\n\"I think the magic has come back a bit the last few years now,” Keane replied. “When you think of it when we were at United, we should be pretty ashamed because we pulled out of the FA Cup.\n“I know it wasn’t down to us but we accepted it as players. How mad was that, your team pulling out of the FA Cup.\"\nThe Red Devils’ withdrawal opened the door for Chelsea to win their second FA Cup in four years, when they saw off Aston Villa 1-0 in the final, which was the last one to be played at the old Wembley Stadium before is was rebuilt later that year.\nManchestet United, meanwhile, were able to successfully defend their Premier League title, but exited the Champions League in the quarter-final stage.\nGet Manchester United tickets from £199 at Seat Unique\nManchester United's hospitality offers comfortable, padded seating in the North West Quadrant. The package includes a concourse meal deal (hot food, drink, and snack) and the official matchday programme. Guests also receive a 10 per cent Megastore discount and non-matchday Museum entry, providing a great value, family-friendly match experience for home fans.\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 742,
  "scraped_at": "2026-02-14T02:12:04.353898",
  "_text_extracted": true
}