{
  "article_id": "5de2ee973e49",
  "url": "https://www.empireofthekop.com/2024/10/10/mane-friendship-wijnaldum-liverpool/",
  "title": "Sadio Mane says  special  ex - Liverpool teammate was  alway at his house",
  "date": "20241010T181500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sadio Mane has revealed that, more than two years on from leaving Liverpool, he remains in contact with one particular ex-teammate with whom he shared many great moments on and off the pitch on Merseyside.\nNow playing with Al-Nassr in the Saudi Pro League, the 32-year-old arrived at Anfield in the summer of 2016, the same transfer window in which Gini Wijnaldum signed for the Reds. The duo played just under 200 games together at LFC until the Dutch midfielder left in 2021.\nBoth players are now based in Saudi Arabia, with the ex-Newcastle dynamo part of Steven Gerrard’s squad at Al-Ettifaq, and the Senegal forward couldn’t speak highly enough of his one-time Liverpool colleague.\nVOTE for Empire of the Kop as Best Club Content Creator (Premier League) here: Football Content Awards\nOR on X with the FCA’s one-click X link with:\nI am voting for @empireofthekop in @The_FCAs for #BestClubContentCreator (Premier League)\nMane still good friends with Wijnaldum\nMane said (via Liverpool Echo): “Gini is one of my very good friends. It’s more than football, because our relationship came naturally. When I was in Liverpool, we came at the same time, and he’s this kind of person that once he’s in the team he becomes friends with everybody. Everybody likes him.\n“He is special, and this is the reason when I was there we’ve been good friends – and he was always in my house. Sometimes he would call me to come to my house, and I’m like ‘No, not yet. Get out of here!’.\n“He always wants to make fun, and I like this about him. He has a good heart; I can speak about him until tomorrow non-stop. He is amazing and we’re still keeping contact, and that’s really important.”\nMane and Wijnaldum shared some special times at Liverpool\nMane and Wijnaldum were both instrumental figures during an unforgettable period at Anfield in which Liverpool won the Premier League, Champions League, UEFA Super Cup and Club World Cup under Jurgen Klopp’s guidance.\nThey were both in L4 for the majority of the German’s tenure, having joined in his first summer in charge and staying for long enough to contribute toward some special times for Reds supporters.\nFootballers will have dozens of teammates throughout their career, particularly those who rack up a large number of clubs, so it’s a mark of how much of an impact the ex-Liverpool duo made on each other that they remain such good friends despite no longer playing together.\nIt also attests to the incredible bond which existed between Klopp’s squad during those glorious years when we were bringing major silverware back to Anfield after a long fallow period, and without that sense of unity on and off the field, the triumphs of 2019 and 2020 wouldn’t have happened.\nMaybe in a few years’ time, Mane and Wijnaldum will be teammates once more in an LFC Legends match!",
  "word_count": 485,
  "scraped_at": "2026-02-14T01:57:46.249963",
  "_text_extracted": true
}