{
  "article_id": "5de60c588e35",
  "url": "https://metro.co.uk/2025/11/16/were-really-sorry-brazil-boss-carlo-ancelotti-gives-injury-update-arsenal-star-gabriel-24719861/",
  "title": "  Were sorry  - Carlo Ancelotti gives injury update on Arsenal star Gabriel",
  "date": "20251116T111500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Carlo Ancelotti said he was ‘really sorry’ and ‘really disappointed’ Arsenal star Gabriel limped out of Brazil’s friendly against Senegal.\nGabriel, recently hailed as the ‘most influential player in the Premier League, was forced off in Saturday’s friendly against Senegal with a groin problem.\nThe 27-year-old pulled up off the ball on the hour mark and hobbled off after receiving treatment from Brazil’s medical team on his right thigh.\nThe friendly was played at Arsenal’s Emirates Stadium and Gabriel was seen limping out of the ground after the match.\nArsenal fans were understandably concerned by the scenes, with Gabriel one of the most important members of Mikel Arteta’s squad in recent years.\nGabriel has helped Arsenal concede just five goals this season and climb four points clear at the top of the Premier League table.\nArsenal return to Premier League action next weekend against north London rivals Tottenham, while Arteta’s side face Bayern Munich in the Champions League the following Wednesday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt remains to be seen whether Gabriel will be fit to feature against Spurs, with Ancelotti providing a cautious update on the Gunners star after Brazil beat Senegal 2-0 in north London.\n‘Bad? I don’t know,’ the former Real Madrid manager said. ‘He had an injury in his adductor. The medical staff has to check tomorrow.\n‘We are really sorry for this, really disappointed. When a player has an injury, you hope they can recover well and soon.’\nBrazil beat Senegal 2-0 at the Emirates Stadium thanks to goals from Chelsea winger Estevao Willian and Manchester United midfielder Casemiro.\nGabriel is not the only cause for concern among an Arsenal fanbase hoping to see their side win the league title for the first time since 2004.\nItaly boss Gennaro Gattuso has confirmed fellow Gunners defender Riccardo Calafiori has left the international camp following ‘a few issues’.\nCalafiori missed Italy’s World Cup qualifying win over Moldova on Thursday\n‘We tried Calafiori, he had a few issues,’ Gattuso told Sky Sports ahead of Italy’s match against Norway on Sunday.\n‘I thank him for his commitment. He stayed here for a week, he could have played perhaps, but it wouldn’t have been fair to him or Arsenal.’\nMore Trending\nAs well as starring in the most solid defence in Europe, Gabriel has developed into a real offensive threat over the past two seasons.\n‘I think you can make an argument that he could be seen as the most influential player in the Premier League right now,’ Liverpool legend Jamie Carragher said of Gabriel last month.\n‘When you think of the clean sheets and the defensive record Arsenal have and also his threat at set-pieces. He’s as influential as anyone, maybe even Erling Haaland.’\nArsenal captain Martin Odegaard, summer signing Noni Madueke and first-choice striker Viktor Gyokeres are all also recovering from injury problems.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Thierry Henry aims dig at Tottenham and makes north London derby claim\nMORE: Man Utd set price to sell Erik ten Hag’s £36.5m signing\nMORE: Arsenal star hailed as the ‘most underrated signing’ in the Premier League",
  "word_count": 584,
  "scraped_at": "2026-02-14T02:03:26.530029",
  "_text_extracted": true
}