{
  "article_id": "5e3ad0614d6e",
  "url": "https://www.bbc.com/sport/football/articles/clyk1nwg0wdo",
  "title": "Jordan Pickford : Everton goalkeeper talks about his career , World Cup dream and love of motocross",
  "date": "20251101T114500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pickford on England records, World Cup dream & love of motocross\n- Published\nThe Football Interview is a new series in which the biggest names in sport and entertainment join host Kelly Somers for bold and in-depth conversations about the nation's favourite sport.\nWe'll explore mindset and motivation, and talk about defining moments, career highs and personal reflections. The Football Interview brings you the person behind the player.\nInterviews will drop on Saturdays across BBC iPlayer, BBC Sounds and the BBC Sport website. This week it will be shown on BBC One at 23:55 GMT (and after Sportscene in Scotland).\n———————————————————\nJordan Pickford is Everton and England's number one and, fresh from signing a new contract at the Toffees, it will be something he hopes to remain for years to come.\nThe 31-year-old started his career at his boyhood club Sunderland and had spells on loan at several lower-league clubs before making the move to Merseyside in 2017.\nSince then Pickford has only gone from strength to strength, making more than 300 appearances for Everton and has won their player of the year award four times, including the past three seasons.\nMore recently, he set a new England record for consecutive clean sheets, which he extended to nine matches after the win against Latvia earlier in October.\nBefore Monday's return to Sunderland in the Premier League, Pickford sat down with Kelly Somers to talk about his childhood, taking his son to football training and a love of motocross.\nKelly Somers: Let's start with football, what does it mean to you?\nJordan Pickford: It is all I know really. As a young kid I played since I was five years old, so I grew up being a football fan and I had the opportunity to be a footballer which is every kid's dream. There are only so many people who can achieve that dream so it is a massive honour really and I take a lot of pride that I became a footballer.\nKelly: Did you always think you would be a goalkeeper?\nJordan: I was always in goal, my first memory was being in goal. I remember playing with my brother and his mates in the street and I was in the goal on the concrete. When my brother was playing for the district at the time there was a team training who needed a goalkeeper so I went in goal and that was pretty much the start of me.\nKelly: A goalkeeper playing on concrete as well?\nJordan: I'm daft aren't I?\nKelly: Who was your childhood idol?\nJordan: When I was watching football it was Kevin Phillips and Thomas Sorensen at Sunderland when I was young, but when I got older it was Wazza [Wayne Rooney] and Joe Hart.\nKelly: So you always had the attacking player you liked but the goalkeeper too?\nJordan: Wazza is a legend isn't he? I was a bit too young for Gazza [Paul Gascoigne].\nKelly: What was it like when you first joined Sunderland, because you were a boyhood fan?\nJordan: I was at Sunderland from the development squad at seven or eight and got my first contract at under-nine and then you had to do well every year to keep getting another year. Once I joined and was going to games and played every Sunday for them it was mint, but it is probably when you are a bit older at 14 or 15 that you realise you have an opportunity.\nKelly: Was there ever a moment you thought, 'I could make this here?'\nJordan: It starts at a younger age now but when I was growing up you used to get day release one day a week on a Tuesday, so you had the full day at training. At 14 or 15 I got invited to train on Thursday morning at Sunderland and train with the youth team, so I used to have a day and a half off school so that was when I thought that I was sticking it properly then.\nKelly: You didn't have it easy all the time at Sunderland going on a lot of loans, but then you did make it here to Everton. What was that move like for you?\nJordan: The loans I would say now if any goalkeeper can have an opportunity to go on loan and play in the lower leagues it will be more beneficial than youth team football. You are playing a proper game, there's a lot more pressure that you thrive off and you learn and mature more as a goalkeeper. It is probably the best thing that happened to me going on all those loans. I'll never forget when I was on loan at Preston, I was doing really well and big Sam [Allardyce] called me back and gave me a new contract and I made my debut in the FA Cup against Arsenal in the same week. A week later I made my Premier League debut, I was sat on the bench for the rest of the season but it was another good experience as well. The year after Vito Mannone got injured and that is where I grabbed the opportunity with both hands.\nKelly: It feels like there's a lot of excitement around the club but there's also a lot of hype around you. You are often linked to other clubs. Why was this the right time to sign a new deal?\nJordan: When I first signed we were in Europe and that was the driver then and that is where Everton should be. We had the two or three years that were a bit of a rollercoaster ride, weathered those storms and now it is all looking positive and the club is going in the right direction. You see with the signings the club has made and the drive we have this season to improve, it comes from the top of the club. I think we will see a lot more positive results and us pushing higher up the table. You want to be playing in the Premier League and I have that opportunity with Everton.\nKelly: What are the ambitions of Everton this season?\nJordan: I'll never look at the end of the season and say, 'I want to do this', I always take it game by game.\nKelly: But when you sign a new contract you must have an idea where you want Everton to go?\nJordan: We want to be pushing that top half of the table. The manager is driving us to be in the top half and try to get into Europe. I think getting into the top half and sustaining that momentum in the top half and not dropping down and keep putting us as players that pressure, to go get more results and keep improving, is definitely a drive. I think if we do that and, with the squad we have, we can push for Europe. We never know if it will be Champions League, Europa League, Conference League, but if we are in that bracket then we have had a good season.\nKelly: As for England that is not going too badly too - qualifying for the World Cup and keeping nine successive clean sheets for you as well, surpassing Gordan Banks' record. What does that mean to you?\nJordan: I don't take all the credit. It is a great honour to break a record like that because Banksy is an absolute legend of the game but I always say it is a team effort - we win together, lose together and keep clean sheets together. I know Harry Kane keeps scoring goals week in and week out, but the lads are there to provide service and I am there to help the lads when I am needed to make a save and be called upon, that is what I feel like I do. I am always in the moment as a goalkeeper because them games I probably have not had that much to do, but when called upon and making saves I am making the right decisions, playing out from the back. So there's a lot more to it than just clean sheets because it is not as if I am having seven or eight saves to make in a game, there's the concentration element to it. I take credit for that in terms of staying in the game and the moment but I'll never take the credit for keeping a clean sheet.\nKelly: How do you stay in the moment when you are not busy?\nJordan: You have to stay mentally prepared. Every goalkeeper is different. For me it will be if the ball is in the other half of the pitch I will always be on the right side, always mirroring the pitch and making sure I feel if it is breaking down I am in the right position to maybe get a through-ball or make a save. Communication as well, I feel like just being connected is key.\nKelly: It has been a remarkable career for you so far and you still have a fair few years left, but when you reflect on it all has there been a turning point or a moment where you think, 'if that hadn't happened, maybe I wouldn't have achieved what I have?'\nJordan: I think I have always had that mentality that I want to improve myself. I don't want to think that because I've got 80 caps for England or played 330 times for Everton that I've made it, I am always striving for more for myself. When my son Arlo was born that was a big change where there was an unknown to the family. It was new to me and Megan and that was a big change. That was when I had a bit of a dip of form and that is when I started using psychologists, rough with the smooth.\nKelly: There's been some interesting quotes from your team-mates where they have talked about your personality. I've heard James Tarkowski say you bark at him and you have had arguments on the pitch. Kyle Walker has described you in various ways, Declan Rice - I've read some of the quotes - but basically they are all just saying you are a bit bonkers!\nJordan: There is probably a line where sometimes I go too much that way. That is something I am trying to adapt. There has got to be a balance. When I put a football shirt on, if I am doing small-sided games with the lads in training I hate losing. It gets me right up. I think it shows the passion I have for wanting to win.\nKelly: We know how your team-mates describe you, how would your best friend or family describe you?\nJordan: I think they will say I am caring and that I look out for people like my mates and I always want the best for everybody. I think it is one thing I am good at.\nKelly: What are you like as a football dad? Do you try to blend in or are you shouting at your boy?\nJordan: If I am behind the goal, but the last few times he has switched on because I had a little discussion with him where I told him he'd enjoy football more if he was concentrating. I went to one game and he wasn't interacting and getting involved as much but he is only six. He took it so much on board and me and Meg went the next week, he was playing against Stoke's academy and it was when there was a storm and it was freezing but he was amazing. I didn't say anything to him then because he had taken it on board and it was amazing to see him enjoying it. I asked him if he was enjoying it and he said yes and I felt mint then. He played again at the weekend and he was really good again. I wouldn't shout at him, if he is lacking concentration I will just say \"switch on\".\nKelly: What was it like growing up in your house?\nJordan: Mad. That was mad. My parents brought me and my brother up really well. They were strict but not too strict. They let us do a lot of what we wanted to do. Times have changed now, you don't see kids out on the street as much now and I feel like we've lost that way a bit. I was out on the street and my mam was shouting, 'get in Jordan, you have school tomorrow'. I wanted to be out all the time,\nKelly: Were you a bit of a naughty kid, maybe?\nJordan: I think so. My mam would describe me as something else!\nKelly: I read a quote from you the other day that even when you get an England call-up now your mum still texts you congratulations so you are obviously very close.\nJordan: I will ring her every morning and on the way home from training every day. She will text me before every call-up and text me saying good luck before every game and would text me after saying well done whether I've had a good game or a bad game.\nKelly: Tell me one thing about yourself that would surprise me.\nJordan: I am not allowed to do it as a footballer but I would love to be able to do motocross. I grew up going to watch it every week with my mates, and my best best mate now rides in the British Championships. If I could I would go every week to watch as much as I can. I would do it if I could but there are strict rules in our contracts where we are not allowed to do activities like that. That is probably one thing in my life I would have love to have done.\nKelly: Is that a big passion of yours?\nJordan: Yes as I went from such a young age and we would stay in motorhomes and caravans at the racetrack as kids and it was mint. The adrenaline I get from watching my mates on the start line and the gate drops, then get to the first corner... the adrenaline I get if they get a good start and I am properly leaning over and cheering them on.\nKelly: Do you get spotted there?\nJordan: Yeah I get spotted but it doesn't bother me, I am leaning over the fence to push them on to try to do better. It gives me proper adrenaline and it is one of the things I love.\nKelly: If you could only achieve one more thing for the rest of your career what would it be?\nJordan: Win the World Cup.\nKelly: Next summer?\nJordan: Yep. That would do me. It is what the whole nation is waiting for.\nKelly: Do you feel like you've got the best opportunity now?\nJordan: Yes we've had some great opportunities. The more experiences you have in tournament football and see the lads winning cups and Champions League then you can lean on that. I think, for me, to lift that World Cup or a major trophy for England would be number one and if I could ever get silverware at Everton that would be number two. It has been that long since England has won something and to be a part of that would be amazing. We have to believe in ourselves, we have that opportunity and we have to take it with both hands but you are playing the best nations in the world and you have to play your best in each game and that's what takes you so far.\nKelly: What are you proudest of?\nJordan: As a young kid growing up, getting that opportunity to become a footballer, you might make your debut for Sunderland and it might become a dream but it is that sustainability for doing it for so many years and keep progressing and keep getting better that I think I am proud of myself for - and to keep putting the dedication I put in.\n- Published16 August 2025",
  "word_count": 2712,
  "scraped_at": "2026-02-14T01:52:49.007926",
  "_text_extracted": true
}