{
  "article_id": "5e6a13ba90e7",
  "url": "https://theathletic.com/4993150/2024/04/17/odegaard-wonderkid-arsenal-bayern-munich/",
  "title": "Martin Odegaard , a rare survivor of the curse of the teenage wonderkid",
  "date": "20240417T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In the 2013-14 season, Michael Reschke was investing heavily in young talent in his role as Bayer Leverkusen’s technical director.\nHe sanctioned a club-record €10million (£8.5m, $10.6m at current rates of exchange) fee for a 20-year-old Son Heung-min, €1.5m for Emre Can, then 19, and, in the January, €350,000 for 17-year-old Julian Brandt. And Reschke also had his eyes fixed on another wonderkid for the following summer.\nAdvertisement\nMartin Odegaard, a 15-year-old who had been training with Norwegian club Stromsgodset’s first team for two years, made his senior debut for them in April 2014.\nThe starting gun had been fired in the race for his signature. Reschke was determined to be at the head of the queue, except it would not be on behalf of Leverkusen.\n“I contacted the family to try to sign him for Leverkusen, and when I moved to Bayern Munich that summer (also as technical director) I tried to sign him there too,” Reschke tells The Athletic.\nOdegaard went on a Europe-wide tour, finishing his school day and hopping on a plane to trial at virtually every major club. That list included Arsenal and their opponents in this week’s Champions League quarter-final second leg Bayern, who Pep Guardiola managed at the time.\n“At 16, he trained with Pep, who was totally impressed after the first training,” Reschke says. “I came into the dressing room and Pep was talking about how intelligent he was and how he would improve — he was the type of player he loved. He was completely convinced.\n“We were both pretty sure we wanted to sign him, but he had the decision between Real Madrid and Bayern.\n“I had a present in my life working with Pep for two years. I saw him work with players like Kingsley Coman and if you are a young, talented player there is one thing that is pretty sure: he will make you a better player — the best player you can possibly be.\n“He is not from this world as a coach. I am sure if Martin had worked with Pep, he would have made some steps earlier.”\nAlas, Odegaard and his family were convinced Real Madrid were the best club for him to fulfil his potential and he signed for them in January 2015, but there were warning signs from the off.\nHis father Hans, who is a coach himself and was the person who made him focus on scanning during games from an early age, stayed with him in Madrid for most of the time to support his teenage son. But when it came to his unveiling as a Madrid player — surely a daunting experience for someone who was still a kid — Odegaard was not even told he was about to do a press conference and so was dressed in casual clothes rather than club attire.\nAdvertisement\nFor the first two years, he trained regularly with the first team but played games with the Castilla ‘reserve’ side in the second division, which did not help ingratiate him with Spanish youngsters who saw him as a threat.\nAfter making only one senior appearance — in a 6-1 win over third-division side Cultural Leonesa in the Copa del Rey — Odegaard spent over three years out on loan at Dutch clubs Heerenveen and Vitesse Arnhem and La Liga’s Real Sociedad between January 2017 and August 2020.\nThere were hints that he may eventually get his time in the spotlight at the Bernabeu, but he was still only used sparingly by his parent club.\nBy the December of the 2020-21 season, Odegaard was 22 years old and had played just 489 minutes for Madrid’s first team in 11 appearances, starting only three times in La Liga. The likelihood of him scaling the heights with them seemed to be fading.\nFast forward three and a half years and he is now 25, captain of Arsenal and has created the most chances of any player in the Premier League this season.\nYet, with this season being his first experience of Champions League knockout-phase football, there remains a sense Odegaard has belatedly joined the elite. It is an indication of just how extraordinary he was deemed to be when he signed for Madrid nine years ago for an initial fee of €4million.\nAfter joining Arsenal on an initial half-season loan in January 2021, Odegaard knew he had finally found his footballing home.\nWhen it came to making the £35million move to north London permanent, there were several delays because Madrid were still deciding whether they wanted to keep him or not. People inside Arsenal at the time recall him bounding through the doors at their training ground once the deal had gone through.\nThe marriage of player and club has since catapulted him back in line with his original lofty trajectory. Many footballers have been buried under the rubble of the failed wonderkid tag but not Odegaard, who has fulfilled those early expectations despite plenty of setbacks.\nWhether Madrid was a misstep for Odegaard or a necessary speed bump, just how mentally tough do you need to be to recover from those years in the spotlight and the crippling expectation that follows your entire career?\nAdvertisement\nNot many people can empathise with the life the Norwegian midfielder has lived, but Sergio Canales is one of them.\nThe Spanish midfielder is now 33 and playing for Mexican top-flight club Monterrey, but after breaking through at Racing Santander in 2008, aged 17, he was signed by Real Madrid the week before his 19th birthday for a fee of €4.5million.\nIn his 2010-11 debut season at the Bernabeu, he played just 518 minutes before getting loaned to Valencia for a year the next summer. He never returned, making his stay at the Mestalla permanent in 2012 before going on to enjoy a successful career in which he played over 161 games for Real Sociedad (2013-18) and 208 for Real Betis (2018-23).\n“Our journeys are similar because we weren’t prepared to be at a club that big at that young an age,” Canales says to The Athletic about the career paths he and Odegaard followed.\n“Today, young players are much more prepared. Academies are further along, too. There’s more gym work, nutrition and an emphasis on the player’s mind and psychology. When I was signed by Real Madrid, I was a kid, both mentally and physically. I had always been a good player — but you have to do much more to be a player at a club like Madrid. I learned a lot from that moment forward.”\nCanales has suffered three cruciate knee ligament injuries in his career but, beyond his accolades as a youth player with Spain, when he helped win the European Championship at under-17 and under-21 levels, he still went on to achieve at a high level.\nHe was voted into La Liga teams of the season for 2018-19 (by UEFA) and 2021-22, won the Copa del Rey with Betis in the latter campaign, earned 11 Spain caps after making his debut aged 28 and won the 2022-23 Nations League with them. He spent the majority of his career in a tier of footballer slightly below the true elite, though.\nIs there a sense of ‘What could have been?’ that hangs over him?\nAdvertisement\n“The expectations that people on the outside had for my career were very high. I was compared to (Barcelona and Spain stars) Xavi and Iniesta, that type of level,” says Canales. “But there can only be one No 1 — like Rafael Nadal in tennis, for example. That doesn’t mean everyone else’s career was a failure.\n“I don’t compare myself to anyone else. I was able to reach my highest level despite my setbacks. That’s what defines my success. It isn’t dependent upon the recognition I receive from other people, about whether I played enough or should have played more. You have to appreciate your career for the effort you put in, whether it was better or worse.\n“I saw Odegaard at Real Sociedad; he was the difference-maker and I knew then that it was only a matter of time before he broke through. I believe he is now one of the best central midfielders in the world. I really like him. He’s technical but I really like his mentality and the personality he shows when he plays.”\nAlen Halilovic looked to be on a parallel path to the very top, along with Odegaard. Both were late-1990s born, left-footed midfielders with hair down to their shoulders.\nFor years, the most-viewed video about Halilovic on YouTube was a highlights reel posted in 2012 called ‘Halilovic: The Next Big Thing’.\nIt has since been usurped by one titled ‘Halilovic vs Odegaard: totally different realities’, viewed 1.6million times as their careers have diverged.\nThe Croatian midfielder became the youngest player to score for Dinamo Zagreb and the youngest to represent the club in the Champions League, making 62 appearances in all competitions before the age of 18.\nBarcelona beat Tottenham to his signature in summer 2014, six months before Odegaard also moved to Spain. He spent the first two years with Barcelona B and on loan at Sporting Gijon, where he impressed, but he decided to leave for Germany’s Hamburg after less than 18 months.\nAdvertisement\n“That was the mistake I made: I didn’t follow the plan (Barca had for me),” says Halilovic, who made only one 28-minute substitute appearance for Barcelona’s senior side in a Copa del Rey game.\n“The first two years were perfect at Barca but I expected I would get a chance at the first team in the third. Then I realised Luis Enrique (Barca head coach at the time) did not see me there.\n“I was supposed to stay one more year, as I was doing really well. I expected to go to the Euros with the national team but didn’t get selected and Barca decided I had to go out on loan again, so I was a little frustrated with everything. I did not want to go out again, so I said, ‘F*** it, I go from here’.”\nHaving played 129 senior games as a teenager, Halilovic only made 123 appearances over the next seven years — 60 of them starts — while moving between eight clubs and six countries. More than a decade into his career, the 27-year-old is now finally settled and playing regularly for Fortuna Sittard in the Eredivisie, the Netherlands’ top flight.\nBut how easy is it to reshape perception when your name instantly evokes memories of that boy with the world at his feet — the FIFA and Football Manager star everyone signed because, in the gaming world, he never fails?\n“I can only give advice to the young generation and that is to enjoy and be patient,” Halilovic says.\n“I don’t even want to compare myself to Odegaard, as he is playing amazing the last few years and is one of the best midfielders in the world. I have a lot of respect, but they need to have patience.\n“I was thinking I needed to play (be picked) in front of Iniesta, but (as a young player) your time will come. It may take three or four years of playing until you are 21, or it may take until 25 like Odegaard. He changed from club to club and then found the best place for him, which has allowed him to show all the talent he has.”\nSuccess and failure are relative. Halilovic has had a lengthy career at a level the vast majority of players never reach, even if he has not turned out to be the Croatian Lionel Messi.\nAdvertisement\nThe same goes for others, like the ‘Scottish Messi’ Ryan Gauld, who moved from Dundee United to Portugal’s Sporting Lisbon in 2014 as an 18-year-old with a contract including a €60million buyout clause. He played only five times for Sporting in as many seasons but has recovered to the extent that last year he was a contender for MLS’ Most Valuable Player award with Canada’s Vancouver Whitecaps.\nThe list is endless with many different storylines, but Renato Sanches is an interesting comparison, as he is still in the upper echelons of European football — although his name no longer holds the same allure as when Bayern signed him from Portuguese club Benfica for €35million as an 18-year-old in summer 2016.\n“There are only a few different players, like Jamal Musiala, Jude Bellingham and Florian Wirtz — they are not only outstandingly talented, they have a mentality not from this world,” says Reschke, who was at Bayern when they signed the Portuguese midfielder Sanches.\n“There are also talented players who need their dancefloor at the right moment; a top player in the future may not be able to make his first step to a top club, and so it’s helpful to make steps between. It’s always a risk at this stage, but we were pretty sure Renato had great skill and Carlo (Ancelotti, Bayern manager at the time) loved him.\n“Looking back, it would have been much better for Renato to stay one or two more years with Benfica. It was too early for him.”\nSanches had just become the youngest player to win the senior European Championship, a feat which helped him win the Golden Boy award in 2016, when he swapped Lisbon for Munich but he failed to live up to expectations.\nAfter starting only six games in his debut Bundesliga season, he was loaned to Swansea City in summer 2018. He struggled with injuries, was part of Swansea’s relegation from the Premier League and became a social-media meme after mistakingly passing to a moving advertising board rather than a team-mate.\nAfter only four Bundesliga starts in 2018-19, he was sold to French club Lille for around half of Bayern’s outlay three years earlier.\nAdvertisement\n“Two bad decisions can cost you two or three years (of your career) as it’s difficult to come back on the top level. That’s what happened to Renato,” says Reschke. “He completely lost his confidence. When I saw him at Swansea I thought, ‘Gah, it is unbelievable what happened to this kid’.\n“Munich was a wrong step and Swansea was a wrong step. I had left by then but, to me, he should have gone back to Portugal to give him the feeling of home, improve and then come back.”\nSanches helped Lille win the Ligue 1 title in 2020-21, playing in 23 of the 38 league games, then joined Paris Saint-Germain in summer 2022, picking up another championship but in a far smaller role (just six league starts). Turning 27 in August, chronic injury absences have severely limited him and Italy’s Roma have already decided against turning this season’s loan from PSG into a permanent move.\nHaving earned 11 Portugal caps (four starts) between his debut in March 2016 and his move to Bayern, Sanches has only added another 21 (nine of them starts) since. His most recent appearance for his country came in November 2021.\n“Some of these kids are older in their minds but still kids,” says Reschke. “It’s not only a football story, it’s a social one. You need your family, your culture, your own language.\n“He (Sanches) had a special status at his own club. When he came to Munich, he was not the homemade player and came to a team with world-class players. They will not leave their position for you — (Bayern midfielder at that time and 142-cap Chile international) Arturo Vidal will kill you if you try to take his position!”\nOdegaard is one of the very rare examples of a lauded young player who has been able to bounce back from early disappointments and go on to be everything that was expected of him.\nSerge Gnabry is another: a player tipped for the top as a youngster at Arsenal only to find himself unable to get into Tony Pulis’ team at relegation candidates West Bromwich Albion while on loan in 2015-16 at age 20. But Gnabry has gone on to make 235 appearances for Bayern Munich, won the Champions League and five Bundesliga titles with them and earned 45 caps for Germany, scoring 22 goals.\nThere are more who sink down the levels of the game until their name barely registers anymore.\nAdvertisement\nHachim Mastour signed for AC Milan from fellow Italians Reggiana in 2012 for £500,000 as a 13-year-old. The Italian-born Moroccan midfielder gained a huge profile and Milan’s manager at the time Clarence Seedorf included him in the first-team squad for the final game of the 2013-14 Serie A season.\nMastour has 585,000 Instagram followers but his career has not matched his profile. He never made a senior appearance for Milan and after spells in Spain, the Netherlands, Greece and in Italy’s second and third divisions, he is now playing in Morocco’s top flight for Union Touarga and just about every post is littered with fans asking him what went wrong.\nThat is quite the burden to carry for your whole career but Odegaard broke off the shackles some time ago. No longer pigeonholed as a player whose individual career did not develop at the pace the world demanded, he has been able to grow as a leader too.\nHis emotional intelligence means he is always one of the players who will put an arm around new signings at Arsenal, while he has often sat with non-playing staff at lunch.\nIt meant that when manager Mikel Arteta named him captain before the 2022-23 season it was not a surprise to those inside the building, even if the outside perception was that Granit Xhaka fitted the traditional mould.\nOdegaard does not care much for convention. Sure, his route to the top has required a detour, but those close to him say he would not change a single ‘step’ of the journey.\nIt is what has made him the character and player he is now.\nFelipe Cardenas contributed to this piece.\n(Top photo: Marc Atkins/Getty Images)",
  "word_count": 3009,
  "scraped_at": "2026-02-14T02:25:26.760175",
  "_text_extracted": true
}