{
  "article_id": "5ea3033549e0",
  "url": "https://news.yahoo.com/newcastle-united-vs-southampton-live-120008728.html",
  "title": "Newcastle United vs Southampton LIVE : Premier League team news , line - ups and more",
  "date": "20230430T124500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United vs Southampton LIVE: Premier League result, final score and reaction\nFollow live coverage as Newcastle United face Southampton in the Premier League today.\nManchester City are reigning champions after beating Liverpool to the finish line in a neck-and-neck 2021/22 title race where a comeback win on the final day of the season against Aston Villa secured a fourth title in five years for Pep Guardiola's side.\nJurgen Klopp's Reds were on course for a quadruple last season but were forced to settle for just an FA Cup and Carabao Cup win and will return trying to win the title again just as they did in 2020.\nIt was a dramatic season for Chelsea a year ago with Roman Abramovich now replaced by Todd Boehly as owner in west London. He will want an instant return on his hefty investment at Stamford Bridge while Tottenham, back in the Champions League, will want to kick on once more too.\nIt's not all about the action at the top though with Fulham, Bournemouth and Nottingham Forest promoted to the top tier for 2021/22 and hoping to hold their own against the best English football has to offer and avoid the drop.\nWe will bring you all the action and updates from today's game in the live blog below:\nNewcastle vs Southampton LIVE: Premier League updates\nNEW XI - Pope, Trippier, Schar, Botman, Burn, Guimaraes, Willock, Joelinton, Murphy, Gordon, Isak\nSOU XI - McCarthy, Walker-Peters, Bella-Kotchap, Bednarek, Lyanco, Djenepo, Lavia, Ward-Prowse, S Armstrong, Sulemana, Alcaraz\nGoal - Armstrong bundles in from close range to give visitors surprise lead (0-1)\nGoal - Wilson equalises soon after the restart (1-1)\nGoal - Walcott puts through his own net (1-2)\nGoal - Wilson quickly wraps up the game with his brace (1-3)\nNewcastle United FC 3 - 1 Southampton FC\nNewcastle United vs Southampton\n16:06\nThat is all for today - thanks for tuning in!\nNewcastle United vs Southampton\n16:06\nNext up for both sides, Newcastle host Arsenal in a top-of-the-table clash while Southampton travel to Nottingham Forest for a relegation six-pointer.\nNewcastle United vs Southampton\n16:04\nA brace from substitute Wilson inspired a 3-1 comeback victory for Newcastle at home against relegation-threatened Southampton. Saints led at the interval after Stuart Armstrong converted from Sulemana's cross but after the break it was total domination from the home side. Wilson found his first after 54 minutes when he converted from Isak's cross and thought he had his second when he fired home in the 77th minute. That strike was ruled out by VAR for offside but Newcastle didn't have to wait long, with Walcott firing into his own net from a corner just two minutes later before Wilson rounded McCarthy and slotted home Newcastle's third in the 81st minute. The Magpies remain in third and now have an 11-point gap over Tottenham in fifth while Southampton remain rooted to the bottom of the Premier League table and six points from safety.\nNewcastle United vs Southampton\n15:59\nFULL-TIME: NEWCASTLE 3-1 SOUTHAMPTON\nNewcastle United vs Southampton\n15:58\n🎶 HEEEEEEEEEEEY CALLUM WILSON! 🎶\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:57\nUNIIIIIIIITED! 🙌🙌 pic.twitter.com/xO8q68G7hj\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:57\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:56\nOFF THE BAR!! Wilson is denied by the upright as he looks for his hat-trick. The Magpies burst down the right and the cutback finds Wilson unmarked in the centre of the box. He wraps his foot around it expertly and has the beating of McCarthy but it cannons off the bar and Saints can clear.\nNewcastle United vs Southampton\n15:56\n90' So, so close to a Wilson hat-trick 😫\nSchär's cross from the right is hit first time by Wilson but it hits the bar and loops up in the air before hitting the bar again and going behind.\n[3-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:52\n90' Two more changes.\nSuperb, lads! 🙌\n[3-1]#NEWSOU // #NUFC // @eToro pic.twitter.com/q51J74PhFX— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:53\nSubstitution Joseph George Willock Elliot Anderson\nNewcastle United vs Southampton\n15:53\nSubstitution Alexander Isak Matthew Thomas Ritchie\nNewcastle United vs Southampton\n15:52\nTrippier whips in another enticing delivery but Southampton can clear.\nNewcastle United vs Southampton\n15:52\nAnother ball over the top has the Saints defence scampering back as Wilson eyes his hat-trick. They clear it away but Newcastle attack once more as Bednarek applies a crucial block to deny Willock's effort.\nNewcastle United vs Southampton\n15:49\nCALLUM. WILSON. SCORES. GOALS. pic.twitter.com/AaU1To4QZN\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:48\nWhat a whirlwind few minutes that was but Newcastle have come out of it with two vital goals. For Southampton, it's comedy defending really - they only have themselves to blame for the manner in which they conceded those goals. Guimaraes is the latest to fire wide as Newcastle continue to press forward.\nNewcastle United vs Southampton\n15:48\n86' Almost a sensational fourth!\nSome more outrageous footwork from Isak on the left and he plays it inside for Joelinton to cushion it to Bruno but his shot is just wide.\n[3-1] #NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:43\nYellow Card Joelinton Cassio Apolinário de Lira\nNewcastle United vs Southampton\n15:43\nCOME ON!!!!!!\nA long ball forward is chased down by Willock, Southampton don't deal with it and it falls to Wilson who rounds McCarthy before slotting into the net!\nYOU MAGSSSSS!!! 😍\n[3-1]#NEWSOU // #NUFC https://t.co/Mn0eYevzu2 pic.twitter.com/Ws6jSH6X3a— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:42\n81: Goal. Wilson. [3-1]\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:41\nGoal Callum Eddie Graham Wilson\nNewcastle United vs Southampton\n15:42\nIT'S THREEEEEEEEEE!!!!!!!\nCALLUM WILSON DOES IT AGAIN!!!!!! 🔥 pic.twitter.com/rEew40qlfk— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:41\nYESSSSSSSS!!!!!!!!!\nIT'S AN OWN GOALLLLLLL!! pic.twitter.com/U2Mysvxiou— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:40\nOwn goal Theo James Walcott\nNewcastle United vs Southampton\n15:40\n79: Goal for Newcastle. [2-1]\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:39\nDISALLOWED!! Wilson fires home and thinks he has completed the comeback but there is a lengthy VAR check. Replays show the ball clipped Almiron rather than the Southampton defender before it bounced through to Wilson, who was in an offside position, and therefore the goal is ruled out.\nNewcastle United vs Southampton\n15:38\n77: On comes @CheAdams_ for #SaintsFC! [1-1] pic.twitter.com/qdIZFSyQsv\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:38\n77' No goal.\nCallum Wilson was adjudged to be in an offside position and the goal doesn't stand.\n[1-1]#NEWSOU // #NUFC https://t.co/AFBM6C2DaG— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:38\nSubstitution Carlos Jonas Alcaraz Ché Zach Everton Fred Adams\nNewcastle United vs Southampton\n15:35\nAssist Miguel Ángel Almirón Rejala\nNewcastle United vs Southampton\n15:35\nHE DOES IT AGAAAAAAAAAIIIINN!!!!!!!! 🫡🫡🫡🫡 pic.twitter.com/Io6yvgsDP4\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:34\n72' Lavia goes into the book after a late challenge on Wilson.\n[1-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:33\nYellow Card Roméo Lavia\nNewcastle United vs Southampton\n15:33\n70: #SaintsFC make another three changes. [1-1] pic.twitter.com/iQ5FPcGcrS\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:32\nYellow Card Stuart Armstrong\nNewcastle United vs Southampton\n15:32\nSubstitution Stuart Armstrong Mohamed Amine Elyounoussi\nNewcastle United vs Southampton\n15:31\nMore chances fall Newcastle's way as Willock sees his effort blocked behind for a corner. From the set piece, Wilson's header is tipped over the bar by McCarthy with the follow-up corner going all the way through the box and out for a goal kick.\nNewcastle United vs Southampton\n15:31\nSubstitution Lyanco Evangelista Silveira Neves VojnoviÄ Ainsley Cory Maitland-Niles\nNewcastle United vs Southampton\n15:31\nSubstitution Kamaldeen Sulemana Adam James Armstrong\nNewcastle United vs Southampton\n15:30\n69' Come on, Miggy! 💪\n[1-1]#NEWSOU // #NUFC // @eToro pic.twitter.com/kCMuNv8KQw— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:30\nSubstitution Jacob Kai Murphy Miguel Ángel Almirón Rejala\nNewcastle United vs Southampton\n15:29\n68' Good play between Schär, Botman and Willock down the right and Willock's cross is met by Wilson but tipped over by McCarthy.\n[1-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:28\nAnother Newcastle shot, another Southampton block. Bednarek launches himself to divert Guimaraes' effort behind for a corner but it's wave after wave of Newacaslte pressure at the minute. The corner is cleared to the edge of the box but Willock''s effort is saved well by McCarthy.\nNewcastle United vs Southampton\n15:27\n66' Trippier's corner comes out to Bruno who lays it off for Willock to shoot but his low effort is held.\n[1-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:25\nAnother great block from the Saints defence, this time to deny Murphy's low shot.\nNewcastle United vs Southampton\n15:25\n7️⃣ goals in 7️⃣ games in April for @CallumWilson! 🫡 pic.twitter.com/iaRp0gK1i0\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:25\n63: #SaintsFC's first change, as @theowalcott comes on. [1-1] pic.twitter.com/Us51lFkI6z\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:25\nSubstitution Moussa Djenepo Theo James Walcott\nNewcastle United vs Southampton\n15:23\nAlmost a great chance for Newcastle as Murphy bursts into the box down the right. His cross would have found a Newcastle player in the box but for the excellent sliding block from Bednarek.\nNewcastle United vs Southampton\n15:22\nIt's down the Southampton right that Newcastle continue to find all their joy. Guimaraes whips in a tempting cross with the outside of his boot but McCarthy comes off his line to claim with Wilson lurking.\nNewcastle United vs Southampton\n15:17\nYellow Card Kyle Leonardus Walker-Peters\nNewcastle United vs Southampton\n15:17\nWE'RE LEVEL!!!!\nGreat work from Isak on the left and he plays a great ball into the middle for Wilson to steer past McCarthy to equalise!\nHOWAY THE LADS! 🙌 https://t.co/b0OZJDJQfW pic.twitter.com/cl53yCHfM1— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:16\nAssist Alexander Isak\nNewcastle United vs Southampton\n15:16\n54: Goal. Wilson equalises. [1-1]\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:15\nGoal Callum Eddie Graham Wilson\nNewcastle United vs Southampton\n15:15\nHE'S ON FIRREEEEEEEEE!!!!! 🫡🫡🫡🫡 pic.twitter.com/4cIs1PKHvF\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:14\n53' CLOSE! Trippier's free-kick causes havoc but Sven Botman can't quite get enough on it to force it past McCarthy before Wilson's follow up is deflected wide.\n[0-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:13\nLavia issues a robust challenge on Guimaraes but it's too robust for the referee's liking and Newcastle have a free-kick in a good position. It's clipped to the back post but Burn is unable to head it back across goal and Saints have a goal kick.\nNewcastle United vs Southampton\n15:10\nAn early free-kick for Newcastle on the left. It's whipped in with plenty of pace and Wilson can't keep his near-post flick down and the ball sails out for a goal kick.\nNewcastle United vs Southampton\n15:08\nWith that change, we are now underway in the second half!\nNewcastle United vs Southampton\n15:07\n⏱ Back underway...\nHWTL! ⚫️⚪️\n[0-1]#NEWSOU // #NUFC pic.twitter.com/t7FhBOuHZn— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:06\n46: Into a big second half...\nCome on, #SaintsFC 🌊 [0-1] pic.twitter.com/yiDwziNaBY— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:06\n45' A change for the Magpies at the break#NEWSOU // #NUFC // @eToro pic.twitter.com/wfQ9K6LEs6\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n15:06\nSubstitution Anthony Michael Gordon Callum Eddie Graham Wilson\nNewcastle United vs Southampton\n15:04\nStu with the breakthrough 🙌 pic.twitter.com/EPV3kS0huo\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n15:02\nIt will be interesting to see what Howe does at half-time. Towards the end of the half, Gordon and Murphy switched flanks and Newcaslte's attacking threat lessened somewhat. Gordon was having a good time up against Lyanco in the early goings and you wonder whether the Magpies boss may switch them back around when we restart. The task for Southampton is simple - keep it tight and try to hold on for a massive away win which would move them to within three points of safety.\nNewcastle United vs Southampton\n14:56\nStuart Armstrong's goal has given Southampton an unlikely lead as we enter the half-time break. Saints started brightly but Newcastle soon took hold of the game seeing plenty of the ball. Gordon was a constant outlet down the left and the winger missed the home side's best chance when he hit the post with a one-on-one effort against McCarthy. And having rode their luck, Saints cashed in when Sulemana's cross was turned home by Stuart Armstrong in the 41st minute. There's a long way to go in this contest but that could be a massive goal at the bottom of the table.\nNewcastle United vs Southampton\n14:51\nHALF-TIME: NEWCASTLE 0-1 SOUTHAMPTON\nNewcastle United vs Southampton\n14:50\nThere's the half-time whistle ⏱\nIn front as we reach the break 👊 pic.twitter.com/O8aEhvE2gn— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n14:50\n⏱ Behind at the break.#NEWSOU // #NUFC pic.twitter.com/JAPTFXHdw2\n— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:49\nThe forward is up and good to continue and we now enter the first of three minutes of added time to end this first half.\nNewcastle United vs Southampton\n14:48\nThere is a stoppage in play as Djenepo is down receiving treatment.\nNewcastle United vs Southampton\n14:45\n41: What a breakaway ⚡️\nCharly Alcaraz races forward and finds @Kamaldeenho10, who squares for Armstrong to finish! [0-1] pic.twitter.com/iYBa7diXYf— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n14:44\nAssist Kamaldeen Sulemana\nNewcastle United vs Southampton\n14:44\nSTUUUUUUUUUUUU 🙌 [0-1] pic.twitter.com/nrwIctZcot\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n14:43\nGoal Stuart Armstrong\nNewcastle United vs Southampton\n14:43\n41' Southampton lead. Armstrong.\n[0-1]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:42\nGordon looks now to have switched to the right-hand side and it's Murphy now who attacks Lyanco. He cuts inside onto his right foot but his curling effort from the corner of the box goes just over the bar.\nNewcastle United vs Southampton\n14:42\n40' Bruno floats the ball to Murphy on the left who cuts inside and tries to curl the ball into the far corner but his shot is over the top.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:39\nGordon gets on the ball in a promising position down the left but Lyanco does an expert job of marshalling the ball away from the forward as he looks to get to the byline.\nNewcastle United vs Southampton\n14:36\nNewcastle have lost just one of their last 22 Premier League games against sides starting the day in the relegation zone (W12 D9), going down 1-0 at Sheffield United in January 2021. The Magpies have remained unbeaten in all 12 such home games in that time (W6 D6).\nNewcastle United vs Southampton\n14:33\nNewcastle clearly feel Gordon can provide a big threat in their attacking build-up and the average positions so far show him and Willock high up on the side as the pair look to combine and get the better of Walker-Peters at right-back.\nNewcastle United vs Southampton\n14:32\nThrough the first 30 minutes on Tyneside 📸 [0-0] pic.twitter.com/hK2oX5rb5b\n— Southampton FC (@SouthamptonFC) April 30, 2023\nNewcastle United vs Southampton\n14:30\nNewcastle try a short corner routine after Guimaraes' cross is turned behind but the Saints defence is aware and can clear the ball away as the header comes in.\nNewcastle United vs Southampton\n14:27\nSouthampton now have their first corner of the game after Sulemena's cross is turned behind goal.\nNewcastle United vs Southampton\n14:23\nJoelinton now with a chance from the corner. Schar wins the initial header at the back post but it's Joelinton who flicks the ball toward goal with his head. The goalie is beaten but so is the post and it's off target from the Brazilian.\nNewcastle United vs Southampton\n14:23\n21' Trippier's deep corner is headed back into the middle by Schär and then glanced wide by Joelinton.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:21\nPOST!! The closest to the game's first goal and Southampton escape. Isak drops deep and threads through an inch-perfect ball to Gordon who has looked lively down the left. The winger bears down on goal and slides his effort past McCarthy but the ball flicks off the outside of the right post and goes wide for a goal kick.\nNewcastle United vs Southampton\n14:21\n19' POST! So nearly a first United goal for Gordon.\nSuperb ball through from Isak to release Gordon but his shot hits the outside of the post and goes behind.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:19\nSouthampton are finding themselves isolated when they look to go forward in attack. Sulemena makes a good burst down the right but finds himself out of options and the play breaks down shortly after.\nNewcastle United vs Southampton\n14:16\nit was a bright start by Southampton but Newcastle now look well on top of this game as they chase the opening goal.\nNewcastle United vs Southampton\n14:12\n10' CLOSE! Great work from Anthony Gordon on the left and his cross hits Isak before falling for Bruno on the volley but his shot is wide.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:12\nGordon gets to the byline well and wins the game's first corner as Bella-Kotchap clears the ball out of play. Trippier takes it short but the move falters and the cross doesn't come in.\nNewcastle United vs Southampton\n14:11\nStraight up the other end and Stuart Armstrong is able to fire an effort on goal which Pope reacts well to and palms away.\nNewcastle United vs Southampton\n14:10\nIt looks as if Gordon will be operating off the left flank instead of Joelinton and the winger has an early chance after he is played through. He has the beating of the Saints defence but fires into the side-netting from a tight angle.\nNewcastle United vs Southampton\n14:09\n7' Murphy releases Gordon with an excellent through ball and he races into the box before having a go on his left but it hits the side netting.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:09\nIsak is keeping the Southampton defence on their toes in the early stages as he almost latches onto a ball over the top. It skips of the surface though and runs through to McCarthy.\nNewcastle United vs Southampton\n14:06\nBednarek hauls down Willock as he looks to break down the Newcastle left and it is an early yellow card for the Saints centre-back.\nNewcastle United vs Southampton\n14:05\n4' Bednarek is in the book as he catches Joe Willock after the United midfielder had knocked it past him on the left.\n[0-0]#NEWSOU // #NUFC— Newcastle United FC (@NUFC) April 30, 2023\nNewcastle United vs Southampton\n14:04\nA fast start from the away side sees a good break down the left. The ball is cut back into the box but Walker-Peters' eventual effort is saved well down low by Pope.\nClick here to read the full blog on The Independent's website",
  "word_count": 3320,
  "scraped_at": "2026-02-14T02:12:37.700064",
  "_text_extracted": true
}