{
  "article_id": "5ec3a1b941c8",
  "url": "https://menafn.com/1108118954/Laliga-Title-Race-On-The-Line-At-Clasico-Against-Uobeat-Real-Says-Barcas-Xavi",
  "title": "Laliga Title Race On The Line At  Clasico  Against Uobeat Real , Says Barca Xavi",
  "date": "20240421T040000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Laliga Title Race On The Line At 'Clasico' Against Uobeat Real, Says Barca's Xavi\nBarcelona boss Xavi Hernandez said winning Sunday's \"El Clasico\" in the Spanish capital is the only way his side can hold off Real Madrid's run to the LaLiga title - the only remaining major silverware Barca could win this season.\nReal, brimming with confidence after their statement Champions League win at Manchester City midweek, sit comfortably on top of LaLiga on 78 points, ahead of Barca on 70 and Girona on 65. A win on Sunday would give Real an 11-point lead with only six games left.\n\"On Sunday we are playing for the league title. We have to win,\" Xavi told a press conference on Saturday.\n\"We have to manage our feelings and move on, let the frustration and impotence of the other day (elimination from the Champions League) which are difficult to digest turn in our favour. We will have a morale-strengthened Real Madrid in front of us.\n\"On Sunday we have the chance to get back into LaLiga title race. It will be the most important game of the season.\"\nThe last chance saloon has opened its doors early for battered Barcelona as they travel to Madrid after another European disappointment suffered midweek at home.\nWhile Barca were knocked out of the Champions League, Real progressed with a shootout win at holders Manchester City on Wednesday.\nXavi praised Real for beating \"the best team in the world\" in Manchester City and said he will need a near flawless performance by his side to leave the Santiago Bernabeu stadium with a win.\n\"We will face a Real Madrid with euphoria through the roof. We need to overcome the Champions League hangover and have a team with all the enthusiasm in the world to fight for this league,\" Xavi said.\nReal manager Carlo Ancelotti acknowledged that his side is edging closer to the title but said it all could change if they lose focus and take their old rivals lightly on Sunday.\n\"We are doing well. The cake is ready and all that remains is the icing on top,\" Ancelotti told a press conference on Saturday.\n\"Barca is still alive and will be a very competitive opponent who are doing very well despite the PSG loss. We're convinced that it's going to be a usual Clasico, hard fought. But it's a great opportunity to get closer to the title.\"\nAt A Glance\nLa Liga \"El Clasico\"\nReal Madrid VS Barcelona\nDate: Sunday, April 21\nTime: 11:00 PM GST\nVenue: Santiago Bernabéu\nALSO READ\n- Cost of buying, selling $2million property cheaper in Dubai than London, Mumbai, Paris among other cities\n- Karim Benzema to leave Real Madrid to join Saudi's Al Ittihad, says report\n- Football: Real Madrid-bound Bellingham confident England will deliver major tournament win\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 527,
  "scraped_at": "2026-02-14T02:25:26.757492",
  "_text_extracted": true
}