{
  "article_id": "5ec59e1e36f8",
  "url": "https://www.90min.com/newcastle-prioritise-keeping-alexander-isak-bruno-guimaraes-arsenal-man-city-interest",
  "title": "Newcastle to prioritise keeping Alexander Isak instead of Bruno Guimaraes amid Arsenal & Man City interest",
  "date": "20240419T233000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle to prioritise keeping Alexander Isak instead of Bruno Guimaraes amid Arsenal & Man City interest\n- Newcastle braced for clubs to step up interest in Alexander Isak & Bruno Guimaraes\n- Man City admirers of midfielder while Arsenal keen on both\n- Magpies would rather sell Guimaraes instead of Isak\nBy Ben Jacobs\nNewcastle United would rather sell Bruno Guimaraes than Alexander Isak this summer, with Arsenal interested in both and Manchester City eyeing the midfielder, sources have told 90min.\nArsenal's priority for the summer transfer window is to bring in a new striker, but they would also like to add a central midfielder as well if it's within their financial means. Guimaraes, along with Real Sociedad's Martin Zubimendi, are concrete targets.\nArsenal aren't the only club interested in Guimaraes. City have already approached the player's camp, while PSG are also contemplating a move.\nCity are looking for a player to compliment Rodri and like the fact Guimaraes can play as a number six or a number eight. West Ham United's Lucas Paqueta is still a potential target as well following a failed pursuit in August 2023.\nThe reigning Premier League champions still want Kevin De Bruyne to extend his contract beyond 2025 and there is optimism he will, but if the Belgian midfielder was to agree to a move to the Saudi Pro League, then a creative and versatile midfielder like Paqueta would become a priority.\nHowever, there is nothing to indicate De Bruyne is entertaining such a move at this time despite the fact he can be classified as a top Saudi target. Unless De Bruyne signs a new deal before the season ends, it is almost certain Saudi dealmakers will make City an offer.\nPep Guardiola's side would have significant funds to utilise if De Bruyne did give the green light to a Saudi switch, perhaps even allowing for both Guimaraes and Paqueta to both be signed. Saudi Pro League sporting director Michael Emenalo is already aware De Bruyne will cost at least £100m even with only a year left on his current deal this summer.\n90min understands Newcastle need to bring in £30-50m to stay within the Premier League's Profit & Sustainability Rules (PSR), but more funds will be necessary if they are to also strengthen their squad.\nAlthough qualification to next season's Champions League can't realistically be attained, sixth-placed Newcastle are back on track for some form of European football next season. This is a welcome boost for the club's finances, but means further squad depth is likely required. Qualifying for Europe also comes with a squad bonus, albeit one the club budgeted for in pre-season.\nNewcastle are adamant Isak is not for sale, and it is unlikely the sporting director who replaces Dan Ashworth, who is expected to join Manchester United, will advise differently. 24-year-old Isak has 17 Premier League goals so far this season and is viewed as integral not just to Eddie Howe's squad, but the club's project as a whole. Replacing him would also prove costly, with no guarantees of filling the goals void, making a sale ill-advised.\nNewcastle would naturally love to keep Guimaraes as well, but if the Brazilian's £100m release clause is triggered, it will take the situation out of their control.\nWhen Guimaraes signed his new five-year contract at St James’ Park, a release clause was included, which is quite rare for Newcastle. But 90min understands there is also a verbal agreement in place that Guimaraes will be allowed to talk to Champions League clubs, and that offers below his release clause will be engaged with providing they exceed £80m.\nNewcastle realise it's preferable to lose just one player, if financial needs must, rather than having to sell several names to raise the same amount, many of whom they won't be able to readily replace.\nKieran Trippier and Miguel Almiron were subject of January approaches from Bayern Munich and Al-Shabab respectively, while clubs are aware that Callum Wilson and Jamaal Lascelles aren't unsellable if money is required to avoid PSR breaches. But all four together would likely command a similar collective fee as Guimaraes alone.\nThe advantage Newcastle has is there are already plenty of options in Eddie Howe's three-man midfield, even if not all the players fit into Guimaraes' exact mould.\nSandro Tonali will return from his ban for betting breaches next season, Joelinton - who can also play in attack - has just signed a new four-year deal, Lewis Miley and Elliot Anderson are both highly thought of at the club, Sean Longstaff has been key all season and Joe Willock is another option as well.\nAny significant fee procured for Guimaraes would also allow Newcastle to buy a replacement. Kalvin Phillips and Conor Gallagher have been looked at by the club in the past, and both could be on the move this summer.\nOf course, in an ideal world, Newcastle would simply keep Guimaraes, who has forged a strong connection with the fanbase and frequently made it clear how happy he is on Tyneside.\nAlthough the Magpies are not 'offering' him up just yet, there is no doubt they are braced for offers and succession planning to replace him. This is normal because of Guimaraes' release clause, which makes a summer transfer possible even if the club do find other ways to raise capital.",
  "word_count": 891,
  "scraped_at": "2026-02-14T01:56:51.550523",
  "_text_extracted": true
}