{
  "article_id": "5ed6a780dd25",
  "url": "https://www.islingtontribune.co.uk/article/arsenal-boss-we-have-a-point-to-prove",
  "title": "Arsenal boss :  We have a point to prove  | Islington Tribune",
  "date": "20260109T154500Z",
  "domain": "islingtontribune.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal boss: ‘We have a point to prove’\nLeague leaders are ignoring the stats\nFriday, 9th January — By Steve Barnett\nMikel Arteta [Jay-Patel/SPP]\nMIKEL Arteta isn’t about to get carried away by Arsenal’s favourites tag – insisting that the Premier League leaders “have a point to prove” every time that they step out onto the pitch.\nThe Gunners face a titanic league clash against Liverpool tonight (Thursday) at the Emirates. They can then take a break from the stresses that come with battling to remain at the summit and switch their focus.\nArteta’s side travel to Portsmouth this Sunday in the third round of the FA Cup, before heading to Chelsea on Wednesday for the semi-final first leg of the Carabao Cup.\nWith Arsenal also currently sitting top of the Champions League table, it seems the club could be destined to end their wait for a trophy this season.\nArteta, though, says his players must be ready to “go again and again”.\nThe Arsenal boss said: “Every week we have a point to prove. We had it a few days ago against Bournemouth after a great win against Aston Villa, and it’s going to continue like that until May. Once we are in the position that we are in we want to maintain and extend the lead that we have, and in order to do that our level of determination and desire has to be with that mindset.”\nWith glory edging ever closer, Arteta added: “We all want it that much – that’s what is driving everybody and that’s the superb quality that we have within the club.”\nAlthough Arsenal have already tasted defeat in the league this season, the strength-in-depth that the club have displayed has drawn comparisons to Arsene Wenger’s Invincibles that won the title in 2003/04 without losing a single game.\nHowever, Arteta was quick to shut down any talk of his current crop being as good as the one that earned a place in football folklore.\n“The Invincibles won a lot, they won consistently and they created that history and legacy and we have to do that,” said the Spaniard.\nAsked if the players ever talk about the comparisons, Arteta added: “No, obviously there are a lot of stats. In the last two or three years we’ve had stats and more points and more goals in the history of this and that.\n“At the end we have to translate that to major trophies and that’s what we want to do.”\nMeanwhile, in a year that has already seen Chelsea and Manchester United part ways with their managers, Arteta knows only too well the stresses he’s under.\nAsked his thoughts on Ruben Amorim being sacked as United boss, he said: “It’s always sad to see a colleague lose his job. You need support from the staff and the players. At the end of the day, you need to win a lot of football matches if you want to stay in the job.”",
  "word_count": 496,
  "scraped_at": "2026-02-14T02:09:43.015666",
  "_text_extracted": true
}