{
  "article_id": "5ef6bd389d14",
  "url": "https://theprideoflondon.com/chelsea-prepare-58m-summer-transfer-bid-spain-international",
  "title": "Chelsea prepare £58m summer transfer bid for Spain international",
  "date": "20250212T133000Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are willing to pay £58m (€70m) to sign Pablo Barrios from Atletico Madrid in the summer transfer window.\nIn the past, there have been some incredible players to play for both Chelsea and Atletico Madrid. There are some obvious examples, including Fernando Torres, Diego Costa, Thibaut Courtois and Cesar Azpilicueta.\nSo, it's fair to say that Chelsea and Atletico Madrid have a great relationship with each other off the field. Due to the overlap of club legends, there are possibly some fans who have a soft spot for both capital clubs, too.\nWell, this relationship might continue. After all, it won't come as a surprise to hear that Chelsea is considering yet another breakthrough Atletico Madrid star in the summer transfer window.\nChelsea prepare £58m summer transfer bid for Spain international\nAccording to a report by Spanish outlet Fichajes, Chelsea is one of the clubs interested in signing Pablo Barrios from Atletico Madrid in the summer transfer window.\nJournalist Nacho Estrella Dominguez-Mompell states that Chelsea is even prepared to pay £58m (€70m) to sign Pablo Barrios. Whether or not he is still worth this amount come the summer transfer window remains to be seen. However, the likelihood is that he will only be worth more.\nIndeed, having made his full Spain debut last season, Barrios is only forecasted to go from strength to strength. Within no time, he could even become a fully-fledged Spain international.\nThat said, do not be surprised if the usual La Liga culprits come crawling. After all, it is in the interest of La Liga giants to keep Spain's best talents in the top flight.\nNevertheless, this will not stop Chelsea. The capital of England has proven an attractive destination for the world's best players, so the Blues will aim to keep this alive.\nOf course, fans hope that the Blues will qualify for the Champions League anyway. However, becoming an attractive destination for the best players in the world only serves as another incentive to push for Champions League football.\nIt is a competition which has served Chelsea well in the past, proudly boasting two Champions League trophies. This is despite the claims that this club \"has no history.\"\nSo, Chelsea fans should certainly keep an eye on Pablo Barrios between now and the end of the season. Considering Atletico Madrid have a fast-pass-route to the Champions League knockouts, he will look to excel on the world stage.",
  "word_count": 404,
  "scraped_at": "2026-02-14T01:58:05.352558",
  "_text_extracted": true
}