{
  "article_id": "5f070f128a2f",
  "url": "https://theathletic.com/4218840/2023/02/20/liverpool-youll-never-walk-alone-anfield/",
  "title": "Youll Never Walk Alone : From Broadway lament to Liverpool terrace anthem",
  "date": "20230220T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This is an updated version of an article originally published in February 2023. Following the confirmation of Liverpool winning their 20th English top-flight title on Sunday with a 5-1 win over Tottenham Hotspur, Liverpool players, staff and supporters joined in an emotional rendition of You’ll Never Walk Alone.\nYou’ll Never Walk Alone ❤️ pic.twitter.com/tOjlx1iiKO\n— Liverpool FC (@LFC) April 27, 2025\nHere, we trace the roots of the song, how it became a terrace anthem and its importance to Liverpool.\nAdvertisement\nAnfield on a European night and Real Madrid are in town. It will be electric and not just because it is a repeat of last season’s Champions League final or because it is knockout football and all the jeopardy that comes with ties like these. It is also Real’s first visit — with fans — to Anfield since 2014. It is an occasion.\nIt will be a new experience for some visitors, yet it will also be familiar. Just before kick-off, the bars of the most famous anthem in football will roll out, 50,000 Liverpool fans will throw their voices into You’ll Never Walk Alone and for the next 100 seconds or so, scarves will rise, everything else will stop and Anfield will sing.\nIn the away dugout, Carlo Ancelotti will cut an interesting figure. His CV now states he is a former Everton manager but Real’s coach has a relationship with Liverpool and You’ll Never Walk Alone dating back to 1984, when he missed the Roma-Liverpool European Cup final through injury.\nAncelotti was Real manager from 2013 to 2015, so he was at Anfield for the last encounter with fans in the ground — the two clubs met during COVID-19 without spectators — and said of Liverpool before that 2014 meeting: “It’s always been a club that excites me. The You’ll Never Walk Alone they sing is incredible. Nobody sings an anthem like Liverpool fans.\n“Tomorrow before the game I’m going to go out onto the pitch early because I want to hear them sing it. I’m so excited… sometimes I look for it on the internet and put it on for my friends. It’s something really unique, seriously.”\nAncelotti’s European appreciation illustrates the reach of a song that is long synonymous with Anfield. If we stretch understanding further, it also takes YNWA back to its continental roots in Hungary at the start of the 20th century. A failed stage play in Budapest in 1909 feels like a distance from Anfield Road 2023, but the embryo of YNWA was there.\nAt the start of the 20th century, Ferenc Molnar, a Hungarian author, journalist and playwright, produced Liliom, a play about a doomed love affair with some social commentary. It had two settings — a merry-go-round in Budapest, and Heaven. Unfortunately for Molnar, the public was not won over and it flopped.\nAdvertisement\nWithin the theatre world, however, Liliom’s value was acknowledged and in 1921, the play re-opened on Broadway. It remained in production in various places for more than two decades, with Ingrid Bergman starring in a 1940 stage version six years after Fritz Lang had turned it into a film.\nMolnar, though, did not accede to all interpretations — he would not sell rights to allow Giacomo Puccini to turn it into an opera. But when, in 1945, the brilliant American songwriting duo, Richard Rodgers and Oscar Hammerstein — the Toshack and Keegan of their day — requested rights to base their latest musical, Carousel, on Molnar’s original, he agreed. He was living in New York by then, where Rodgers and Hammerstein were both from.\nFor this new musical, one of the songs Rodgers and Hammerstein created was You’ll Never Walk Alone and so impressive was it that when Christine Johnson, a Metropolitan Opera mezzo-soprano, sang it for the first time in Rodgers’ office, she said: “There was almost something spiritual about it — in the silence, we all just felt it. We knew this wasn’t just an ordinary little hymn-like song, this was some kind of classic.”\nMolnar agreed. He attended the opening night in Manhattan in April 1945 and he approved.\nLyrically, YNWA is a reflection on hard times, death, human defiance and faith. It is sung twice in Carousel, first when the character Billy Bigelow dies following a botched robbery, then at the end when Bigelow returns to earth as a ghost to witness the graduation of the daughter he never knew.\nStructurally the song is slow and melancholy but, penned just as World War II was ending, it appears to have caught a mood.\nNeither aspect of the song suggested pop music or football terrace but within 20 years, it had passed through the former and onto the latter.\nAdvertisement\nThe vehicle for this transition was the Liverpool band, Gerry and the Pacemakers. Gerry was Gerry Marsden, born in Toxteth, just to the south of Liverpool’s city centre, in 1942. The band were signed by promoter Brian Epstein, whose other group were The Beatles.\nIn 1963, Gerry and the Pacemakers released How Do You Do It? and it soared to No 1 in the UK pop charts. They followed it with I Like It, which also got to No 1.\nThe sound of Merseybeat had taken off and at Anfield, the PA system would play the top 10 in the charts as a countdown to kick-off. There is famous footage of the Kop swaying and singing The Beatles’ She Loves You in 1964.\nGerry and the Pacemakers now needed a third song for a hat-trick of No 1s and Marsden proposed YNWA to Epstein and George Martin, the musical arranger for the band and The Beatles.\nSpeaking in 2001, Marsden explained: “I first heard Walk Alone around 1960 on a record. I liked it, I liked the presentation of the song. Then I realised it was from Carousel, the musical. So I went to see the musical to understand where it was in it and it was at the sudden death scene.\n“We put it in our show — and we played rock ‘n’ roll. Every time we did Carousel, the audience stopped and watched and clapped and I thought: ‘That’s nice, that’.\n“We were making our first LP with George Martin at EMI and I said to George I’d like to put You’ll Never Walk Alone on the LP and he said: ‘Why?’.\n“I said: ‘Because I like it’. He said: ‘OK, fine, I’ll put some strings on it, some nice strings’. Which he did. I went to hear it a few days later I thought: ‘Cor, that’s brilliant. It really is excellent’.\n“We’d just had How Do You Do It? and I Like It at No 1 in the charts and we were looking for our third song. I said to George: ‘Why don’t we use You’ll Never Walk Alone?’. Brian Epstein was there and he nearly had a heart attack. He went: ‘No, no, Gerry, it’s too slow’. And even George said: ‘No’.\nAdvertisement\n“So we argued, and I won, and they said: ‘Be it on your head, if it doesn’t get to No 1, it’s your fault’.\n“So when I got to No 1, I rang Brian and George and said: ‘Nah, nah’.”\nGerry and the Pacemakers released YNWA in October 1963 and the song stayed at No 1 for a month. This gave the Anfield crowd time to get used to the song lyrically and melodically and the sweeping power of an almost gospel tune embedded itself quickly. At its end, Marsden’s sweet, silver voice cracks on “Neh-ever walk alone”.\nIn another interview, Marsden said: “When it went out of the top 10 they took the song off the playlist and then for the next match the Kop were shouting: ‘Where’s our song?’. So they had to put it back on.\n“Now every time I go to the game I still get goose pimples when the song comes on, and I sing my head off.”\nThe Pacemakers had added tempo to the opening bars via a gentle, skipping drumbeat from Gerry’s brother Freddie, though the Anfield crowd version remains closer to the slower original. By 1965, a UK television commentator would describe YNWA as Liverpool’s “signature” song.\nIts arrival chimed with the rise of not just Merseybeat, but Liverpool FC under its charismatic agitator of a manager, Bill Shankly. In the 1963-64 season — the season of YNWA — Liverpool won the league for the first time in 17 years. They won it again in 1966, on top of an FA Cup triumph in 1965. With Everton league champions in 1963 and FA Cup winners in 1966, the city, its music and its clubs were gaining a global profile.\nOn tour in America in the summer of 1964, Shankly’s squad were invited on the Ed Sullivan Show, the biggest programme in the United States, to join the Pacemakers. It was Marsden’s idea.\n“We got the whole team on stage and we sang Walk Alone on the Ed Sullivan Show,” he recalled. “Coming off, Bill Shankly said to me: ‘Gerry, my son, I have given you a football team and you have given us a song’.”\nPraise got no higher.\nAdvertisement\nYNWA was here to stay. As Liverpool developed into a European force in the 1970s and early 1980s, this was the constant soundtrack to their dominance. YNWA had become a part of the club.\nWhen Shankly died in 1981, Marsden sang a solo version of the song at his memorial and when the Shankly Gates were erected a year later in tribute, the words You’ll Never Walk Alone were incorporated in iron at the top.\nThe song was always on at Anfield and it would intermittently break out into the broader culture. BBC DJ John Peel, a Liverpool fanatic — his children’s middle names include Anfield, Shankly and Dalglish — would occasionally play the song as sung by the crowd and credit it to the ‘Anfield Road Choral Society’.\nPeel also played Aretha Franklin’s live and deeply soulful version on his Monday show on April 17, 1989.\nHillsborough had happened two days earlier and YNWA immediately took on a larger meaning for Liverpool fans and the families affected. The stoicism the song portrayed was then required for decades as the families sought, and still seek, justice. Margaret Aspinall of the Hillsborough Family Support Group said YNWA had become “our prayer. It belongs to the families now”.\nAll the while, the song spread through football — to Celtic in Glasgow, to Feyenoord in Rotterdam, the Netherlands, and, among others, to Germany where it was adopted by two clubs, Mainz and Borussia Dortmund.\nThis was a most happy coincidence for Jurgen Klopp as they were his previous clubs before joining Liverpool in 2015.\n“I’m a football romantic and I like tradition in football and all that stuff,” Klopp has said. “In Germany, only two clubs sing You’ll Never Walk Alone before the game and that is Mainz and Dortmund… now I’ve come to the original place, if you want, and it never stops feeling really special. It never stops creating goosebumps. That’s how it is.”\nAdvertisement\nCarlo Ancelotti concurs. He scored for Milan in a 5-0 defeat of Real in the European Cup in the week after Hillsborough, when a minute’s silence became a minute’s applause and fans broke out into YNWA.\nAncelotti is a generous man because, for the Italian, YNWA also carries painful memories, of Istanbul 2005, when his AC Milan team led Liverpool 3-0 at half-time in the Champions League final but did not win. Liverpool fans’ singing of YNWA at the interval has gone down in red Merseyside folklore.\nAs Steven Gerrard wrote in his autobiography: “Against all the odds, against all the evidence of Milan’s superiority, our fans were singing loud and proud.\n“’Listen’, I said to the players. ‘Listen to that!’. The singing of 40,000 Liverpool supporters floated down the tunnel, into the dressing room and into our hearts. Unbelievable… our fans were singing You’ll Never Walk Alone. All the players looked at each other in amazement, and pride.”\nThree-nil down at half-time, Liverpool had made it 3-3 by the 61st minute. It can happen.\nAncelotti knows. He will listen again tonight to a song that has been sung at Anfield for 60 years. He will not be alone.\n(Top photo: Chris Brunskill/Fantasista/Getty Images)",
  "word_count": 2060,
  "scraped_at": "2026-02-14T01:59:41.704208",
  "_text_extracted": true
}