{
  "article_id": "5f0f21f92325",
  "url": "https://www.france24.com/en/live-news/20240501-emery-s-transformation-allows-aston-villa-to-dream-in-europe-again",
  "title": "Emery transformation allows Aston Villa to dream in Europe again",
  "date": "20240501T030000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emery's transformation allows Aston Villa to dream in Europe again\nManchester (United Kingdom) (AFP) – Aston Villa head into a first European semi-final for 42 years against Olympiakos on Thursday but have the experience of a proven winner at this stage of continental competition in manager Unai Emery.\nIssued on:\nThe Spaniard is a four-time Europa League champion from his spells at Sevilla and Villarreal and is now targeting a first Europa Conference League success to cap his transformation of a sleeping giant.\nVilla sat just outside the Premier League relegation zone with just 12 points from their opening 12 games under the sacked Steven Gerrard when Emery took charge for the first time in November 2022.\nDespite that handicap, he still managed to qualify Villa for Europe for the first time since 2010 thanks to a seventh-placed finish.\n\"He does not miss a trick. He's obsessed with football and he wants us to be obsessed with football,\" said the club's captain John McGinn.\n\"He's completely transformed this place and it's a pleasure to work under him.\"\nEven more glamourous nights for Villa Park await next season with the side from Birmingham closing in on a first ever taste of the Champions League since it was rebranded from the European Cup.\nVilla are fourth in the Premier League, seven points clear of Tottenham, who have just five more games to overhaul that gap.\nChampions of Europe in 1982, Villa have not been back at that elite level since the season they defended the trophy 41 years ago.\nYet, Emery has still referenced the images of the club's European Cup triumph on the walls of the training ground as a source of inspiration for a new era of success that he is building.\n\"Everyday when I go to the training ground there is the '82 European Cup (picture). It's good to have that memory,\" said Emery at the start of Villa's European adventure this season.\n\"This is the history for Aston Villa and it's amazing. Of course we want to write a new history now, doing it our way and hopefully we can do something important here.\"\nAjax, Martinez memories\nA 4-0 win over Ajax in the last 16 is a memory most Villa fans will cling to for decades to come.\nEmiliano Martinez's antics to beat Lille in a tense penalty shootout in the quarter-finals will also go down in the club's folklore, particularly if they deliver on the tags of favourites to win the competition.\nThe toll of playing 51 games already this season began to show in a tired second half showing to blow a two-goal lead in a 2-2 draw against Chelsea on Saturday.\nBut an Olympiakos side that sits fourth in the Greek top flight ought to hold no fears with Fiorentina or Club Brugge awaiting the winners in the final.\nThe best news of all for Villa fans arguably came last week when Emery extended his contract until 2027.\n“We are enjoying our way together with Villa fans, the club owners, management and this great group of players that we are proud of,\" said the 52-year-old.\nEmery's achievements at Villa mirror his career path of success at clubs striving to make a leap and compete with the European elite.\nHe overcame financial difficulties to lead Valencia to three consecutive third-placed finishes in La Liga.\nThree straight Europa Leagues followed at Sevilla between 2014 and 2016 and he won Villarreal's first ever major trophy by beating Manchester United in the 2021 Europa League final.\nIn between times he struggled to match higher expectations and deal with inflated egos at Arsenal and Paris Saint-Germain.\nBut his detail-oriented approach has been welcomed with opening arms by a Villa squad desperate for their time to shine on the European stage.\n© 2024 AFP",
  "word_count": 634,
  "scraped_at": "2026-02-14T02:10:47.900244",
  "_text_extracted": true
}