{
  "article_id": "5f1aeff96743",
  "url": "http://www.china.org.cn/2025-11/21/content_118188123.shtml",
  "title": "Thomas Muller announces second season with Whitecaps in MLS",
  "date": "20251121T040000Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Press conferences with Thomas Muller have become a highlight of Major League Soccer and the Vancouver Whitecaps.\nThe 36-year-old German veteran often delivers analysis and occasional surprises that captivate audiences.\nAhead of Sunday's Western Conference semifinal against Los Angeles FC, Muller announced he would return for another season with the Canadian side.\nThomas Muller of Germany reacts after the Group E match between Costa Rica and Germany at the 2022 FIFA World Cup at Al Bayt Stadium in Al Khor, Qatar, Dec. 1, 2022. (Xinhua/Xu Zijian)\n\"Yes, full attack,\" Muller said in an interview with German magazine Kicker.\nMuller spoke about \"more emotional moments and thrill than I expected in advance of my move to the MLS.\"\nAs his move from the German Bundesliga came close to a journey into the unknown, \"I can now say, I am happy, satisfied, and enjoy playing here.\"\nMuller has nine goals and four assists in 10 games. \"It's not only the goals,\" he said. \"I can contribute my experience to help the team and the club, as well as achieve sporting success.\"\nEntering the \"Do-or-Die\"-modus against Los Angeles has triggered enthusiasm around the Whitecaps. The arena will be packed this Sunday, Muller said.\n\"One game is going to decide from now on,\" Muller said. Teams including San Diego, Los Angeles, and Vancouver in the Western Conference, and Miami with Lionel Messi, Philadelphia, and Cincinnati in the Eastern Conference are competing for the league title.\nVancouver fans are eager to win the title again after 1979, said the 2014 world champion and two-time UEFA Champions League winner.\nTo attract attention in the ice hockey country of Canada is an achievement, the 13-time German champion added. \"We see kids wearing our shirt in kindergarten and on the streets,\" he said, adding that the game against Los Angeles is completely sold out.\nGenerating excitement was part of the reason for signing him, Muller said, adding he values the team's success over his own goals.\nHe said the league benefits from the participation of many experienced players.\nCrossing swords with Los Angeles involves meeting former European football stars, such as Hugo Lloris, the former French national goalkeeper and 2018 FIFA World Cup winner, and Heung-Min Son, a former Tottenham striker.",
  "word_count": 373,
  "scraped_at": "2026-02-14T02:06:26.679645",
  "_text_extracted": true
}