{
  "article_id": "5f2826e8631e",
  "url": "https://thepeoplesperson.com/2025/12/03/every-word-from-amorims-embargoed-press-conference-west-ham-united-301888/",
  "title": "Every word from Amorim embargoed press conference - West Ham United - Man United News And Transfer News",
  "date": "20251204T014500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruben Amorim says he “doesn’t look at faces” when selecting his best XI.\nThe Manchester United head coach was speaking to the press in the embargoed section of the pre-match press conference ahead of Thursday’s Premier League tie against West Ham United.\nLuke Shaw\nThe first question in this section was about Luke Shaw. The reporter asked: “obviously made his 300th appearance at the weekend, which has obviously taken its time. He’s had a lot of issues at the club over the years, but he’s started every Premier League game this season. What’s been the key to that fitness? Has it just been the sparseness of the schedule or have you taken specific measures to try and protect him?”\nAmorim answered:\n“We took special consideration in the beginning. When we are building the player, we have to be careful, trying to control really the load, not putting so many minutes. Even the position is completely different. If you change the position, you know that the demands of that different position, he’s going to struggle. He adapts really well to that position because sometimes he’s playing with the ball like a fullback, but he’s defending more deeper.”\n“He’s really smart. For me, I said already, I think he’s a world-class player. Of course, he needs more continuity like he’s showing this season, we are playing just one game per week. That helps a lot. If he needs three days to recover, he’s not needing now, but if he needs, we can give them. I think it’s everything combined. We are not taking care We had special measures for him in this moment, but we had to do it. In the beginning when he was starting to have more minutes.”\nThe reporter asked “Is it too demanding for him to play on the wing now?”\n“No, it’s different,” he said. “You have to train there. Before you think to put a different player in that position, you need to train there, or he needs to do some minutes and then he needs to come off or return to a different position, but he’s ready if we need, and maybe we are going to need. In this system, he can play there.”\nOn Set Pieces\nThe next question was: “You obviously scored two more [set pieces] against Palace. We see on a match day that when there’s a set piece, you take a step back. It’s Carlos who is on the touchline and he’s directing everything. How important is his work in that area? Could you give us a little insight into the type of work that he does with the players in that?”\nAmorim replied:\n“First of all, it’s a group thing. We improve a lot in that department. There’s nothing to do with me, so I’m really upset with that. But we have an analyst, Kaita, we have Carlos doing all the study. We have the data guys that he brought that give us information. Then Carlos is doing the research, seeing all the opponents, all the moments of the opponents, watching all the trainings, all our games, what we need to improve.”\n“Then we have the trainings, and then we have to prepare a specific exercise for him. But that is normal in any squad. But I think it is not just Carlos, but all the guys are doing a massive job. In this league, set pieces can win you games or you can lose if you don’t pay attention to that. I’m really pleased with the job that they are doing.”\nThe next reporter asked “just following on from that, Ruben, you’ve talked about having more time with the players this year because obviously only playing once a week. Are we seeing the benefits of that in the set-pieces? Are you giving more time to Carlos to practice those set-pieces, or is it just a natural development?”\n“Yes, it is a point that helps you to have more time because last year we train without the real movement, so we can put the position,” he replied. “That is the idea. But if you don’t have space you cannot put load because they are recovering, it’s not the same thing. You have more time to kick corners, free kicks, and you can create real game situations this year. That helps. If you train more time, you will improve. That is normal.”\nThe next question referred back to Amorim’s comments in the first part of the presser about Mattheus Cunha overthinking things. How as a coach, does he “help a player like that who maybe just becomes a little bit too fixated on the figures?”\nThe boss replied:\n“I put my players in problems sometimes when I see things. What I mean is that I think he feels that he wants to score, he wants to assist, but he’s really happy playing the game. It is really important. I think he struggled with these two games out. He was struggling because he wants to play. He had fun playing the game, and that is so important in our team. Guys having fun, wanting the challenge, the pressure. He’s that guy.”\n“I think it was not good for him to stop playing. He watched a lot of players playing well, especially in his position. So he’s not happy. And tomorrow, maybe he will have the opportunity to come back and to score again or assist.”\nThe next question was whether, with a third of the season gone, Champions League is a realistic expectation.\n“I understand the question,” he said. “If the table are there, if you have the opportunity in one game per week, you need to go forward. But then you look at the table and everyone is two points behind. One week, everything can change.”\n“Let’s focus. I think the best way of doing things, especially with our team, is to focus just the next game. If we win the next game, we will maintain the position at least. That is the main focus.”\n“So it is realistic?” the reporter pressed.\n“To go in position of Champions League for the next week, yes, it’s realistic. The future, I don’t know. I just want to say I want to continue near that position next week, and then the rest we’ll see.”\nLisandro Martinez\nThe next question was about Lisandro Martinez. The reporter asked “What does he bring to you on the pitch, but also off the pitch? He’s in the leadership group. I know he’s got quite high standards around the place. On Samuel’s question as well, Luke Shaw’s position, does that give you a bit of a headache there, how to play those guys?”\nAmorim replied:\n“Yeah, they have to fight. We talk about that as a group last year. We needed to win Europa League. I was always telling to the players because you have no idea what is playing one game per week, and you are going to be upset because you are not going to play. He’s 11 players that can play, and then the rest, you have to fight. That is the situation. That is not a problem. That is a blessing. That is my job to choose.”\n“Licha is a guy but he has a big character. I feel that he wants to stop for a year, and now he wants the things really, really fast. You have to manage that to explain that injury. We need to go step by step, but he’s getting ready. He’s feeling really strong. This is one more guy to help the team to play better. I’m really happy with Licha at the moment.”\nThe next topic was set pieces again, and whether the next challenge is to make United as good at defending set pieces as they have been in attacking.\n“I think we are attacking better than we are defending;” he admitted. “But when you are defending, you need to take take the ball out. When you are attacking nowadays in Premier League, you don’t need to touch the ball. Just don’t allow the defender to take the ball because the ball is going to be there for the second ball. So it’s completely different defending and attacking.”\nIs he stealing ideas from Arsenal?\n“I’m not going to tell you who we are stealing ideas. It’s from everybody. A lot of smart managers doing a lot of things, specialists nowadays. We try to steal from everybody. Then you have to think about when you put the squad, if you play with Amad, Bryan, Bruno, all these guys, if you don’t have Casemiro, and we suffer against Tottenham with that. If we don’t have Casemiro, not Sesko, you have to make a balance sometimes thinking, Yes, the idea for the game is this one, but if you have set pieces against, cannot be this team.\n“Our league is like that in the moment. You need to think not just the way you are going to play, but also in set pieces. Of course, if you look with a little bit attention to the league, you understand that set pieces is massive for the game. Sometimes to open the game. If you score a goal, you are in the better conditions to win the game. Of course, we pay attention a lot, especially in preseason, but every week to prepare set pieces for the game.”\n“When we arrived, we struggled. I think we suffered a lot with set pieces in our first games here. We learn with time like any other manager.”\nFinally Amorim was asked about Kobbie Mainoo again, who is struggling to get a role in the United side. Would he be given a chance before January?\n“We’ll see,” he responded. “We could talk about Kobbie, we could talk about Ugarte, he’s also not playing. Josh is playing because we have a lot of injuries, and we need to be also clear with that. And football is like that. You just need to be ready when the opportunity comes. When the opportunity comes, when the opportunity comes, again, I just want to win.”\n“I don’t look at faces. I just want to win, and I will choose the best ones. And of course, I think when you have more games, if something happened, you will have your chance. You just need to be ready, and you will be fine. If you are ready, if you play well, I’m not going to take it from the team for any reason. I just choose for every game, the best starting 11, and the same thing with the other guys.”\nRead every word of the first part of the presser here.\nFeatured image Matt McNulty via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1811,
  "scraped_at": "2026-02-14T02:03:26.518248",
  "_text_extracted": true
}