{
  "article_id": "5f5e6fa2a637",
  "url": "https://www.liverpoolfc.com/news/every-word-arne-slots-press-conference-after-liverpool-2-1-west-ham-united",
  "title": "Every word of Arne Slot press conference after Liverpool 2 - 1 West Ham United",
  "date": "20250413T181500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "ReactionEvery word of Arne Slot's press conference after Liverpool 2-1 West Ham United\nArne Slot credited Liverpool's 2-1 victory over West Ham United to the never-give-up mentality of his team and power of Anfield.\nThe Reds moved a step closer to the Premier League title thanks to Virgil van Dijk's 89th-minute winner on Sunday afternoon.\nVan Dijk headed in Alexis Mac Allister's corner kick just three minutes after an own goal drew the Hammers level to cancel out the first-half opener from Luis Diaz.\nThe result leaves Slot's men needing a maximum of six points from their remaining six matches to clinch first place.\nRead on for a full transcript of the head coach's post-match press conference...\nOn the relief after Van Dijk's winner…\nIt was a big relief. Ali [Becker] made sure that they didn't score earlier. They had multiple chances to score the 1-1 in the second half and unfortunately they scored one which they didn't score but we scored. To be completely honest, I was expecting two minutes with three or four minutes of added time but all of a sudden seven minutes were added on with no time-wasting at all from both teams, which was a bit of a surprise for me. But OK, it helped because we scored a goal just before the extra-time and, of course, that was a relief because to me it felt after West Ham scored and the way the second half went, it was maybe more that you could expect them scoring.\nBut our fans and our players thought differently because from the moment they scored the 1-1, we started playing again, we started pressing again, the fans were really loud at that moment of time. Already the chance from Lucho [Diaz], some counter-press moments which led to the corner kick and then we saved a big set-piece for a very important moment because in the modern game of football set-pieces are that important, and that's what we saw today again as well.\nOn Van Dijk's contract and his comment about 'let's see what next week will look like'...\nI think he means let's see what next week means when we play Leicester City because that is, at this moment of time, by far the most important thing this club is looking at. Two more wins. I think the first 32 games have shown us how difficult it is – not only for us but for every team in the Premier League – to win a game of football. So, the competition has never been as strong as it is this season. That's what makes it so hard to win a game of football. Everybody can say, 'You have to win two.' We still have to win two, so we should be completely focused on that and if in the meantime a contract extension or whatever happens – but my full focus is on Leicester and, I'm sure, Virgil's as well.\nOn utilising the experience of Alisson, Van Dijk and Mohamed Salah…\nVery important. It would not be completely fair to only talk about them but I think as a manager what you're looking for is always the ones that have achieved already a lot of things in their careers, that they step up in the most important moments of the season. I think it is always in the end of the season [where] moments are getting bigger and bigger, and today all three of them showed up – not only these three but you're asking me about these three – in big moments. Alisson probably had his best game of the season today and Virgil scored the header that got us three points. And Mo was, again, very important in the first goal and he was really lively in the first half, so I saw the Mo Salah again from most parts of the season.\nOn the second-half performance...\nThey [West Ham] also have players and that's what makes the Premier League so strong this season. I think they are 16th or 17th in the league but I can name you one or two players that could have easily played with us today in terms of quality. That is what the Premier League is about.\nThey used them more and more in the second half, these two quality players, and they have more, but I think [Lucas] Paqueta and [Mohammed] Kudus were outstanding today, especially in the second half. Maybe because we were 1-0 up and we conceded one or two chances, it led to a situation where we were a bit too afraid or didn't press hard enough anymore. It's them taking more and more risk, bringing a lot of players into the midfield and they still had their threat in these runs with [Aaron] Wan-Bissaka, [Jarrod] Bowen and all the others. It was a bit of both.\nDefinitely credit to West Ham as well but you don't only see this here – I see this every game that I watch. I don't watch every game of the Premier League but the ones I do, I thought yesterday after 20 minutes that Crystal Palace were in a good place and they could have scored the 3-0 which was fractionally offside and they lost 5-2. So, these are the margins that are in the Premier League, which makes it such a hard league to play in but also why it's so popular.\nOn Darwin Nunez's absence...\nHe went in yesterday [from training] because he didn't feel well. So, he went in and that's why he couldn't be in the team today.\nOn securing Champions League qualification yesterday...\nI think it is the main aim for the club because they have experienced two years ago how much of an impact it is if you are not a part of the Champions League. So, yes indeed. The main aim in what they told me is look at the players, give your opinion about it so we can go into this project in the second and the third year, but do qualify for the Champions League. We all know that even the team who is in 16th at the moment has very good players, but the top eight all have incredible players.\nSo, it's getting more and more difficult to qualify for the Champions League. To be honest, if you would have asked this question to me in the beginning of the season, I would have said, 'Oh, nice.' But yesterday it wasn't that I opened a bottle of wine because we qualified for the Champions League. We have now, of course, a bigger aim than only qualifying for the Champions League.\nOn his celebrations with supporters following the full-time whistle...\nI think because we won a game of football where, maybe for the first time this season, you could debate if we deserved to win this game. Then to win it at such a big moment, where the fans helped us, I think that deserved [it] and that's why I tried to show a bit more how much I appreciate them – through the whole season, but definitely today.\nOn the prospect of potentially winning the Premier League title at Anfield...\nIf I have to win it 15 kilometres from here... I don't care where to win it. We know we still have to win two more games, which I have tried to come back to every single time: it has been on 32 occasions difficult enough for us. First win two and that's the only thing we should focus on and this week we should try to improve, improve, improve more and more to give ourselves a better chance of winning a game of football next week.\nWe face Leicester and everybody can talk, talk, talk but what I saw is that for the first time in 11 games they scored two goals and got a result, so they probably have a bit more confidence going into the game now. We've shown in the last 32 games that there have only been two or three wins that were quite comfortable, but the rest of them were very, very, very hard work and that's our only focus, that's my only focus: winning a game of football.",
  "word_count": 1375,
  "scraped_at": "2026-02-14T02:26:33.613228",
  "_text_extracted": true
}