{
  "article_id": "5f7bc88d0df6",
  "url": "https://www.themag.co.uk/2025/10/eddie-howe-reflects-on-sunday-and-newcastle-2-nottingham-forest-0-newcastle-united/",
  "title": "Eddie Howe reflects on Sunday and Newcastle 2 Nottingham Forest 0",
  "date": "20251006T123000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe reflects on Sunday and Newcastle 2 Nottingham Forest 0\nEddie Howe watched on as the game ended Newcastle 2 Nottingham Forest 0.\nThe away side defending in numbers in the first half and making it tough for United to break them down.\nHowever, the later stages of the opening half saw Newcastle looking more dangerous and getting some concerted pressure at last.\nThe half-time whistle Newcastle United could have probably done without but after the opening minutes following the break, Eddie Howe saw his players pick up that concerted pressure again that they finished the opening half with.\nBruno Guimaraes scoring a brilliant opening goal and then his determination winning the penalty that Nick Woltemade scored from.\nForest in the end were lucky not to lose by more, as United could and should have at least doubled that winning margin as they created a number of clear chances.\nEddie Howe reflecting on Newcastle 2 Nottingham Forest 0:\n“That was a huge win for us.\n“Huge.\n“The players have done really well this week to recover from the Arsenal game in the way that they have, with speed to put that game to the back of our minds, refocus on two hugely important games.\n“Champions League, to get our season going in that competition.\n“Then of course the importance of the Premier League. It’s such an important competition for us.\n“We have maintained very good standards the last few years and we needed to maintain them.\n“At home, I thought it was vital that we won today.\n“I thought it was a good performance.\n“Tough opponents.\n“They defended very deep, a lot of men behind the ball, we had to be patient.\n“I thought we played some really good football in both halves.\n“I thought in the second half we played a lot quicker and a lot more dynamic.\n“We asked more questions of them and eventually we got rewarded for that.\n“But I thought we controlled the game in both halves. I can’t really ask any more of the players.\n“Bruno’s goal was a moment of magic from an unbelievable player.\n“He has been so consistent for us for a long period of time and he makes a difference more often than not, so I’m delighted for him.”\nEddie Howe on a fifth clean sheet: in seven Premier League matches, the sixth in ten games in all competitions:\n“It is crucial.\n“I think we have started the season really well defensively, Arsenal game apart.\n“We have been solid, resilient, there has been a lot of effort given by all the players to protect their goal, and Nick Pope has been playing well too.\n“A good mix for us because you are only a goal away from winning a game.”\nEddie Howe on the latest international break:\n“The break has probably come at a bad time for us with the momentum.\n“We will take it, dust the players down and regroup.”\nEddie Howe on Nick Woltemade:\n“I thought this was a good performance.\n“He grew into the game.\n“The penalty was very composed.\n“A really good penalty from someone playing with confidence.\n“Nick spoke to me about taking penalties, he is confident in that respect.\n“It is a difficult moment for me because I just want to see the net ripple. I just want to see him score. I don’t really care how it gets there.\n“Obviously, there are better ways than others and that was a spectacular one.\n“So long as he scores in those moments, that is all that matters.”\nNewcastle 2 Nottingham Forest 0 – Sunday 5 October 2025 2pm\n(Stats via BBC Sport)\nGoals:\nNewcastle United:\nBruno 58 Woltemade 84 pen\nForest:\nPossession was Newcastle 52% Forest 48%\nTotal shots were Newcastle 18 Forest 5\nShots on target were Newcastle 9 Forest 4\nCorners were Newcastle 8 Forest 1\nTouches in the box Newcastle 33 Forest 16\nNewcastle team v Forest:\nPope, Trippier, Thiaw, Botman, Burn, Bruno, Joelinton (Miley 92), Tonali, Gordon (Barnes 70), Woltemade (Osula 92), Elanga (Murphy 70)\nUnused subs:\nRamsdale, Krafth, Willock, Lascelles, Schar\n(Match Report – Today was a welcome return to such happiness… Read HERE)\n(Newcastle 2 Nottingham Forest 0 – Match ratings and comments on all Newcastle United players – Read HERE)\n(BBC Sport comments from ‘neutrals’ – Interesting on Newcastle United after 2-0 Forest match – Read HERE)\n(Newcastle 2 Nottingham Forest 0 – Instant Newcastle United fan/writer reaction – Read HERE)\nNewcastle United fixtures (All of the Champions League matches will also be available to watch on TV in the UK):\nSaturday 18 October – Brighton v Newcastle (3pm)\nTuesday 21st October: Newcastle United vs Benfica (8pm)\nSaturday 25 October – Newcastle v Fulham (3pm)\nWednesday 29 October – Newcastle v Spurs (8pm) ITV and Sky Sports\nSunday 2 November – West Ham v Newcastle (2pm) Sky Sports\nWednesday 5th November: Newcastle United vs Athletic Club (8pm)\nSunday 9 November – Brentford v Newcastle (2pm) Sky Sports\nSaturday 22 November – Newcastle v Man City (5.30pm) Sky Sports\nTuesday 25th November: Olympique Marseille vs Newcastle United (8pm)\nSaturday 29 November – Everton v Newcastle (5.30pm) Sky Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 874,
  "scraped_at": "2026-02-14T01:49:53.049174",
  "_text_extracted": true
}