{
  "article_id": "5f90e4569005",
  "url": "https://www.mirror.co.uk/3am/celebrity-news/lauryn-goodman-reveals-plans-cheering-33242073",
  "title": "Lauryn Goodman reveals plans for cheering on Kyle Walker with kids despite baby dad  feud  ",
  "date": "20240714T194500Z",
  "domain": "mirror.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "EXCLUSIVE: Lauryn Goodman reveals plans for cheering on Kyle Walker with kids despite baby dad 'feud'\nKyle Walker will be cheered on from home by his two children with Lauryn Goodman as the Celebs Go Dating star and their kids will be praying for England to be crowned the Euros champions\nLauryn Walker will be cheering on Kyle Walker with their two children during the Euro 2024 final.\nWalker's son, Kairo, with Celebs Go Dating star Lauryn, will be allowed to stay up late to see the Manchester City ace play against Spain this evening. After Ollie Watkins' magnificent goal in the semi-final against the Netherlands, Gareth Soutgate's team secured a spot in the grand final.\nWhile Brits are eagerly awaiting the results with many predicting \"Football's coming home again,\" Kairo, Lauryn and Kyle's daughter with the star will be watching at home. Lauryn previously claimed Kyle had invited the pair out to Germany to see the team play against Serbia. Vice-captain Kyle, 34, later denied the claims.\nA source close to Lauryn exclusively told the Mirror: \"Lauryn's children with Kyle will be supporting their dad for the Euro final. Kairo often shows his friends his football book and is proud to show off his daddy.\" They added that Kairo appears to be following in Kyle's footsteps, saying: \"Kairo often wins football trophies and won one recently. He is hoping his dad can win the trophy at the final tonight.\n\"Kairo naturally has his dad's sporting abilities and follows his every achievement with his little girl starting to kick a football around. \" After Manchester City won The Treble after a 1-0 victory against Milan in the Champions League final, his son was said to be over the moon.\nThe source went on to say: \"Kairo was so proud of his dad winning the premier league.\" Although some criticised Lauryn for flying to Germany with Kairo, it appears that the Brighton-born personality is keen on allowing her son to embrace who his famous dad is. Earlier this week, Lauryn shared a heartwarming video, during which Kairo praised her for being a \"good mum\".\nTaking to social media on Saturday morning, Lauryn shared a clip of her son getting ready for a kickabout. In the footage, Kairo Walker, four, can be seen putting on a Manchester City jersey on, with 'Daddy' splashed across the back of the shirt as a nod to his famous father Kyle.\nAs Lauryn reminds her son he needs some shorts on too, Kairo can be heard off-camera saying: \"Yes I do need pants on. You're a good mummy!\" Captioning the sweet footage, an emotional Lauryn penned: \"Don't have to say a word... Your opinion @kairowalker and your sisters is all that matters.\"\nFollow Mirror Celebs on TikTok, Snapchat, Instagram, Twitter, Facebook, YouTube and Threads.",
  "word_count": 468,
  "scraped_at": "2026-02-14T02:08:01.877434",
  "_text_extracted": true
}