{
  "article_id": "5f918b626c0c",
  "url": "https://www.teamtalk.com/newcastle-united/woes-deepen-ac-milan-chief-rejects-potential-newcastle-signing-despite-prime-suitor-claim",
  "title": "Newcastle woes deepen as AC Milan chief rejects potential attacker transfer , with Magpies prime suitors",
  "date": "20230227T163000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nNewcastle woes deepen as AC Milan chief rejects potential attacker transfer, with Magpies prime suitors\nNewcastle United’s woes have continued after AC Milan director of football Frederic Massara rejected rumours Charles De Ketelaere might move to St James’ Park this summer.\nDe Ketelaere was heavily linked with Leeds United last year after an exceptional campaign with Belgian outfit Club Brugge. He managed 18 goals and 10 assists in 49 matches.\nLeeds began talks with Club Brugge, but De Ketelaere told them he only wanted to join a Champions League side next. And this put Milan at the front of the queue for the attacking midfielder.\nThe Serie A giants announced De Ketelaere’s transfer on August 2. According to the Daily Mail, he cost Milan £29million.\nBig things were expected of De Ketelaere in Italy after he became one of Belgium’s most exciting talents at Club Brugge. However, the 21-year-old has not lived up to expectations so far.\nHe is yet to register a goal in 28 appearances and has only managed one assist. De Ketelaere is struggling to get into the Milan starting eleven and is having to rely on late substitute appearances for game time.\nREAD MORE: Newcastle learn ridiculous £176m price tag for Brazilian wonderkid targeted by Arsenal and Man City\nDe Ketelaere’s struggles at Milan have led to rumours he could be moved on just one year into his Serie A journey. On February 17, Italian source Calciomercatoweb claimed Milan would offer De Ketelaere to Newcastle in the summer. They had apparently identified Eddie Howe’s team as ‘preferred buyers’.\nLeicester and Brighton are also thought to be keeping tabs on the situation. De Ketelaere could be available for a reduced price and this has piqued their interest.\nNewcastle unable to complete Serie A signing\nBut Milan chief Massara has now quashed claims the Belgium international might depart. He backed De Ketelaere to come good and reach his massive potential with Milan over the next few years.\n“He [De Ketelaere] is a very talented player,” Massara told DAZN (via Football Italia). “We see him in training every day. We see his belief growing every day that he can express that talent for Milan.\n“Compared to two or three years ago, he arrived at a Milan side that is the reigning champion of Italy, so that adds even more pressure. It takes a while for young players to flourish.”\nIt seems Milan will show De Ketelaere patience and allow him to fully get used to life in Italy, plus the playing style in Serie A, before making a final judgement on his future.\nMassara’s comments should help the attacker to relax, knowing that he is not going to be sold later this year. Perhaps next season we will see the devastating De Ketelaere from his Club Brugge days.\nWhile the player will be happy with Massara’s verdict, Newcastle will be frustrated. It seems they will struggle to capture De Ketelaere in the summer window.\nIt represents another blow for Howe following the Carabao Cup final defeat to Manchester United on Sunday. Goals from Casemiro and Marcus Rashford downed the Magpies.\nNewcastle will try to bounce back in their next game. However, they will have to be at their best to pick up a win as they will play Manchester City on Saturday.\nMeanwhile, an all-action midfielder would prefer to join Arsenal over Newcastle, according to the latest reports.",
  "word_count": 575,
  "scraped_at": "2026-02-14T01:46:30.515989",
  "_text_extracted": true
}