{
  "article_id": "5fc5feb1a551",
  "url": "https://punchng.com/lookman-eyes-super-cup-history-with-atalanta/",
  "title": "Lookman eyes Super Cup history with Atalanta",
  "date": "20240814T001500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Atalanta forward Ademola Lookman could make history for himself in a remarkable year by becoming the fourth Nigerian player to win the UEFA Super Cup after Nwankwo Kanu, Finidi George, and Celestine Babayaro as the Italian side take on Real Madrid in the final in Poland on Wednesday (today), PUNCH Sports Extra reports.\nBy so doing, he would have also etched his name on another page of the club’s history book, having helped them to their first European title with the Europa League win in May.\nAtalanta are playing in their first UEFA Cup final, and it’s all thanks to Lookman, whose hat-trick fired them to a 3-0 win over Bayer Leverkusen and earned Gian Gasperini’s side their second piece of silverware in 117 years.\nWith Atalanta still able to hold on to the 26-year-old despite attracting numerous offers from Europe and Saudi Arabia, they look poised to take another big scalp in European football as they aim to stop the Los Blancos from becoming the first team to win six Super Cup titles.\n“It’s not just me, but I think the whole squad is excited about the occasion. We deserve to be here through our hard work and perseverance. Wednesday night is another chance to show that,” Lookman said during the pre-match interview.\n“Madrid is a top team of top players, who are ready at any moment. I don’t think there’s any good time to face Real Madrid. Obviously, they have their powers, but we also have quality.”\n“We’re very pleased to have our fans here, to make the trip. We’ll do everything in our power to win the game. We’re all looking forward to working hard.”\nAlthough Madrid, like other Champions League winners, look like clear favourites to win, the pattern of Champions League winners claiming the Super Cup does not always apply. The UCL winners have won 28 of the 48 editions, just eight more than clubs coming from the Europa League like Lookman and his teammates.\nAtalanta coach Gasperini relished Lookman’s heroics in the Europa League final and hopes the team can deliver another incredible performance in Poland with their underdog status.\n“We really wanted Ademola Lookman’s third goal, because even when we were 2-0 up, we were well aware of Bayer’s ability to turn around a game, like they had done so many times throughout the season. When we got to 3-0, we allowed ourselves to believe we had done enough to win the cup.\n“We were the underdogs against Liverpool, maybe against Sporting CP too at the start. Everyone thought they would win—and in the end, we faced them four times (group stage, then round of 16). I should say that being the underdogs worked in our favour to a certain extent; it brought out the best in us.”\nIn terms of history, Lookman is the first player to score a hat-trick in a UEFA Europa League final. His first-half brace in that game had made him the first African to score a brace in the final of a major European competition before adding the historic third.\nHe could also follow in the footsteps of three Nigerian players who have won the title.\nThe history of Nigerians in the UEFA Super Cup began with Kanu and Finidi, with the latter scoring in the second leg as Ajax beat Real Zaragoza 5-1 on aggregate in the 1995 final.\nBabayaro also played a crucial role for Chelsea in 1998, as they edged out Real Madrid 1-0 at the Stade Louis II in Monaco, thanks to a late Gus Poyet strike.\nA win today would stake another claim for Lookman in the race for this year’s CAF Player of the Year Award, having scored three goals to help Nigeria reach the AFCON final in February.\nHe ended the season with 16 goals plus nine assists in all competitions.",
  "word_count": 641,
  "scraped_at": "2026-02-14T01:51:48.877832",
  "_text_extracted": true
}