{
  "article_id": "5fc81e45de89",
  "url": "https://www.gq.com/story/christian-pulisic-ac-milan",
  "title": "Christian Pulisic Is Doing Things In European Soccer That No American Has",
  "date": "20241218T224500Z",
  "domain": "gq.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nine minutes in at the San Siro, Milan’s cathedral of football, Inter midfielder Henrikh Mkhitaryan cushioned a looping ball on his chest to bring it under control—until Christian Pulisic flashed in to snatch it away, darting past him in one motion. The number 11 in red and black zipped by another defender and went barrelling into the box, the ball seemingly attached to his boot on a string as he slid by another black-and-blue-striped foe. He was quickly met by a fourth as he drove further and further towards goal, but he matched the shoulder-to-shoulder challenge and stabbed the ball past the goalkeeper to score the opening goal for AC Milan.\n“Oh, he’s done it!” cried commentator Matteo Bonetti on the US feed. Play-by-play man Chris Wittyngham matched his roar: “The American has scored in the Derby della Madonnina!”\nThis is not a succession of words you’re supposed to hear. Americans do not take part in Milan’s football feud, as a historical rule, nor do they score crucial goals that end up in documentaries. But this one did, because Christian Pulisic is doing things no American has, and Paramount+ made a series about it. The first episode, which dropped December 9, features Zlatan Ibrahimovic—one of the true greats of the new millennium, now a senior adviser to AC Milan—who declares that the Hershey, Pennsylvania native is “our Captain America.”\nIbrahimovic doesn’t stop there: “He’s playing low-profile, feet on the ground, but it’s not the case. You are Captain America. I don’t give a shit. You are. And if that’s more pressure on you, I don’t care.”\nIt’s a nod to Pulisic’s anti-superstar persona. He is the not-Beckham, the un-Zlatan. He’s been shy from the start, a reluctant celebrity, one of those who views fame as an unfortunate (even calamitous) byproduct of his talent and drive. But the hype started when he went to Borussia Dortmund’s famed academy at just 15, continued to build when Chelsea acquired his services for $73 million, grew further still when he won the Champions League at 22 years old. Even when things were petering out in West London, he was more and more talismanic for the United States Men’s National Team. And then he went to Milan.\n“Nobody expected such a champion from the United States!” says a man interviewed on the streets of northern Italy’s mighty metropolis in episode one. And another: “My favorite player is Christian Pulisic. [In] not even two years, he’s become the king of Milan.” In his second season with the Rossoneri, a 26-year-old American has become the most consistently dangerous attacker for one of the world’s great football institutions, and he’s doing pitchside interviews in Italian.\n“We've had players that have been main players on good mid-table teams, but nobody was the main player on one of the biggest teams in Europe,” says Clint Dempsey, one of the first American forwards to forge a path in England’s Premier League. “He's like, ‘Well, shit, I want to be the best I can be. I don't want to be just the best American. Let me see if I can be the best player on AC Milan. Let me see if I can be the best player in this league.”\nWe checked in with Pulisic to trace his stunning second season in Serie A and how he got here, the tumultuous details around ex-USMNT coach Gregg Berhalter’s departure, whether he sometimes feels like he’s doing a job he never signed up for, and what his Halloween costume this year says about how he’s grappling with all this.\nPulisic: It was just a rush of emotions. It was terrifying. On the one hand, I was just an American kid, and I had to make this big jump over to Germany not speaking the language. It was more than just the football side of things. But honestly, once I got on the field and could play, that was one of the easier times. It was just everything else behind it. It was leaving home. It was having to sacrifice a lot of things, leaving all my friends and family, knowing that I was going to be in Europe for a while and I was going to have to fight to try and make it. It wasn’t easy, definitely scary. But I had a goal in my mind, and I wasn’t going to let—I was going to accomplish it.\nYeah, for the first year and a little bit he came and lived with me in Dortmund, which was really, really nice at the beginning. And then once I had kind of established myself and became a part of the first team is when he left me.\nIt was unlike anything I'd done up to that point. Experienced, world-class players, where they had just been in the Champions League final the year before, and I’d been playing at youth level. And then you go into that, with big-time coaches and having to just try to be one of them and compete with them every day. I tried not to be too much of a fan. I had to go in, try to be myself and show that maybe I belong here. I want to be on the field, too. It was a huge step up, and it took some adjusting. I definitely needed to get stronger, to improve, make faster decisions in a lot of ways.\nIt would be hard to just pick one, to be honest, but when I first arrived and I watched the first game live in Dortmund, I was watching Marco Reus. He was in a position that I really liked, and I just couldn’t believe how smooth and silky he looked when he had the ball, and the way that he just was gliding on the field. And then, yeah, once I got to know him, train with him, see the level that he is and how he trains and how he works. A player like that is someone that I respected a lot.\nYeah, that was a whole ‘nother experience. I think 17 was my first camp with the team, and I kind of arrived late to the camp. They had a game away somewhere in CONCACAF, and I met them in Ohio, I remember. And yeah, just that new guy, youngest guy out there, and they’re like, “Who is this guy?” I kind of felt—I kind of felt that.\nBut to be honest, the guys were extremely nice. They definitely made me feel welcome. I was surprised. I thought it would be a little bit tougher and they would be a little bit rougher on me at the start. Maybe if I had brought it on myself a bit more, they would have been. But I feel like I was pretty shy and I wasn't always trying to be super flashy and, you know—that’s just never who I was.\nI definitely remember when I started playing in Dortmund, scoring a couple goals, went into the national team, was playing pretty well in the qualifying phases, I would say a lot more—especially when I was that age, I'm looking at stuff like that. It's so hard to avoid. Your social medias blow up, and you're like, “What is going on? People know me, they talk about me.” And you want to go and look at it and you get all excited, but then you get angry when people don’t write positive things. It’s definitely a thing that all players go through, and I had that at a young age for sure, my first two seasons. You add a little bit more pressure on yourself. But I feel like I handled it pretty well, and that's because of the people around me who helped me a lot through it.\nTough to say, you know? That’s definitely one of the most difficult moments I’ve gone through in this game for sure. In that moment, it feels like the end of the world. It feels like that World Cup—those opportunities don’t come around every day. But looking back at it, not to say it was a blessing, we wanted to be there, but I believe everything happens for a reason. I trusted and believed that I would have an opportunity to be back in a World Cup, which I did, and hopefully there'll be more in the future.\nNo, I mean, it's hard to say we were pleased. We were happy with how we played in the group stage. I thought we put on some really good performances, and I think we proved a lot of people wrong and showed what we were all about.\nRegrets? No, because I really do feel like we did try, we left everything out there. I mean, there’s so many games in my life, including that one, where I can look back and say, “Oh, if I’d just finished that chance there, maybe the game would have went differently.” But it didn’t, I learned from it, and then I worked on things. When you have those situations again, you're going to try to do your best to score or defend the play better or see the game out.\nSo I think we're happy with the showing, but we're not satisfied in saying, “Oh, yeah, now we've done it, we've accomplished this.” We haven't accomplished anything, but it's all part of the learning process, like I said. And honestly, that loss just [gives] us that much hunger to go into the next one and try to win.\nYeah, I mean, that was a really tough situation. Is it the player's decision to bring a coach back? No, no, not at all. So that's why it's kind of a crazy thing to say. But if we are looking from our perspective, we had just put on some really great performances at the World Cup and thought we had really grown as a team. So it did seem to us, at least from my perspective, and I know a lot of others’ perspective, it was kind of unfair what had been going on.\nSo it just kind of sucked at the time that that whole thing had to happen, because I think in any other normal world it would have just, it would have just continued. We wanted to keep growing. At the time, we wanted to just pick up where we let—we didn't want to have to restart anything. We felt like we were in a really good point, really good spot. And yeah, things going forward obviously didn't work out how we wanted, and now we have a new coach. It's all part of the process, but like I said, it was never mine, or any one player's decision to bring a coach back. That's just not how it works.\nYeah, that’s more or less—at least that’s how I saw it.\nYeah, I think not just because he’s coached at big clubs—I mean, it’s great, obviously—but also just, when there’s a new coach in the building at all, everyone is slightly more in tune and has to impress a little more and say, “You know what? I want to make a good first impression,” [and], “So do I.” In every little thing. So I think a lot of times that’s a really solid thing for a team, because it gets everyone just that much more alert. So you could feel that for sure at the start, and we’re just trying to build off that.\nHe’s very demanding physically for sure. You come in and the trainings are very intense. He expects a lot in the games. But that’s not to say he puts the football aside or anything, because we’ve worked on that a lot as well. And we want to play a beautiful attacking style as well. But yeah, running and doing all that work is a big part of it. I don’t think it’s anything that players aren’t used to, or something like that. It’s very important in his game, but not the only thing.\nA statement like that from Ibra—there’s not much more to it than he expects a lot out of me and the club expects a lot out of me, and that’s exactly the place I want to be in. I want to give everything for this club. I’ve shown in a short time that I can be a big part of this team and help us create goals. The “Captain America” title doesn’t necessarily have some bigger meaning than that to me. It’s just a funny name. It doesn’t add pressure, I don’t feel that way. It’s exactly like he said—he doesn’t care whether I like it or not or what the name is. It doesn’t matter. Do my friends and family call me that? No. But I do my best to just give my best always for Milan and for the national team, and whatever people want to say about it, that’s alright.\nYeah (laughs), yeah. We had this team Halloween thing, so choosing the costume was a pretty easy one for me. I was like, that’ll be funny, people will think that’s funny.\nPlaying in that Milan derby for sure, there’s nothing quite like that one. The tension in the air, the atmosphere in that stadium—it’s insane. You can feel the hatred between the clubs, the intensity, the preparation building up to it. There’s nothing like that one. And I’ve played in some incredible games across the world, whether that’s down in Mexico, playing against them, whether that’s in Dortmund, playing in some of the derbies over there. Playing in World Cups and Champions League finals. I’ve played in some big matches, but definitely the atmosphere in that stadium has a different feel to it.\nYeah, all the time. (Laughs) The doc—seeing that first episode, it kind of paints me that way, where I’m like, “Dang, am I that awkward?” Hopefully, I’m not that bad. But yeah, it is how I am, though. I struggle with it. I hope there’s some people out there that watch and say, “You know what? Maybe I’m kinda that way.” I wasn’t—I didn’t—I wanted to be a professional soccer player because I love the game so much. I’m so passionate about it. And I want to grow the sport in America. And everything that comes with it, I’m blessed. I get to do these things, I’m extremely lucky. I wouldn’t want it any other way. But that stuff can be extremely hard for me. I’m sure there’s a lot of people out there that would probably feel the same way.\nThat was a tough one. When they ask you the question, “Do you think it exists”—well, I think they showed in that clip where there’s a lot of people saying that Americans are crap or there’s no good players. You could see it’s there. But at the same time, I honestly never use that as an excuse in any way.\nDo I think there were times when there was potentially an opportunity for me or another guy, and they have to pick someone? Yeah. Could it have happened in my career? Yeah. But I never said, “Aw, that’s not fair.” It inspired me and drove me to want to be that much better, and improve, and say, “You know what? I’m not even going to let this be a decision, a 50-50.” So yeah, it exists, but I never saw it as that. I think my dad did a really good job of instilling that in me, that no-excuse mentality. “It doesn’t matter, you gotta just keep working.” And if you’re good enough, at the end of the day, you will overcome it all.\nYeah, just because that’s kind of their joke. They don’t like the whole “soccer” thing. They think any American take is a bad take. I think that’s just an English running joke as well, people may not be all that serious about it. And I think Americans have done a really good job of earning people’s respect in recent years.\nIt’s funny, I’ll be traveling across the world and you’ll hear a random person shout that, and you’re just like, there’s no way that has become a thing. LeBron was one of my favorite athletes growing up, too. The people that get offended by it, saying, “Don’t even compare those two!” It’s a joke. It’s a meme. People need to lighten up. I don’t think I’m the LeBron James of soccer. That’s why it’s funny, because the guy that said it I’m sure isn’t that knowledgeable about soccer.\nTo LeBron James’s level, no. But do I think I can be a big part of helping the sport grow and helping our national team grow and creating a whole culture around the sport, and hopefully trying to be—yeah. It’s the biggest sport in so many other countries and in the whole world. So I hope we can climb and try to get there and make it as popular as some of the other American sports are. But as far as LeBron, maybe not.",
  "word_count": 2852,
  "scraped_at": "2026-02-14T01:52:10.153180",
  "_text_extracted": true
}