{
  "article_id": "5fce0c60701b",
  "url": "https://english.aawsat.com/sports/5063180-guardiola-says-players-have-power-after-talk-strike-action-over-congested-schedule",
  "title": "Guardiola Says Players Have the Power after Talk of Strike Action over Congested Schedule",
  "date": "20240921T103000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola has told elite soccer players they are the only ones who can force change in a growing dispute over the number of games they are being asked to play.\nManchester City midfielder Rodri says players are close to going on strike because of an increasingly congested schedule that will be added to next year by an expanded Club World Cup in the United States.\nCity manager Guardiola said on Friday the game's stars might have to \"take a voice and do something\" if they want to make a stand.\n\"If something is going to change, always (it) must come from the players,\" Guardiola said. \"That business (soccer) can be without managers, can be without sporting directors, can be without media, can be without owners, but without the players (it) cannot be played.\n\"So, the only (ones) that have the power to do it is them.\"\nPlayers’ unions have legally challenged FIFA over the expansion of the Club World Cup, which will be a 32-team event for the first time next year, up from seven. It is slated for the offseason for many major leagues in June-July.\nWorld players union FIFPRO has raised concerns about the increasing physical and mental demands on players, but the competition has been welcomed by the European Club Association, which represents the continent's top clubs, including City.\nUnions in England and France filed a claim against FIFA at the Brussels Court of Commerce in June and challenged FIFA’s \"decisions to unilaterally set the international match calendar.\"\nThe Champions League has also been expanded this season with two more games in the new-look group stage.\nSpain international Rodri played in 10 different competitions in 2022-23 when the campaign was further congested by a midseason World Cup. He followed that last season by playing 64 times for club and country, including a run to the final of the European Championship, which Spain won.\nThis season will end with the Club World Cup, which could include seven more games if City reaches the final.\nRodri, who has been nominated for the Ballon d'Or, said strike action may have to happen.\n\"If it keeps this way, it will be a moment when we have no other option, I really think,\" he said. \"It’s something that worries us because we are the guys who suffer.\"\nBayern Munich coach Vincent Kompany believes a cap should be placed on the number of appearances a player can make in a season, putting an onus on coaches to limit the demands on their top stars.\n\"It’s not just the load for the players but the travels. Some of these guys, they go from playing in the Champions League to playing a national team game in Korea or something and then back,\" Kompany said. \"If you do that for 70, 75, 80 games, there’s a point where it’s not realistic anymore, so to this point I can only support the feeling of the players.\"\nStaging the Club World Cup in 2025 means top players face three straight years of major competitions during the usual offseason, given the Euros and Copa America were held this year and the next World Cup is in 2026.\nBayer Leverkusen coach Xabi Alonso said players need to be consulted about the demands being made of them.\n\"The calendar is very intense,\" Alonso said. \"They need to be heard, they need to participate in these decisions because we want good football. ... Rodri, he is totally right to have this opinion.\"",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:11:06.645982",
  "_text_extracted": true
}