{
  "article_id": "5fd7ae5dcd50",
  "url": "https://www.bbc.co.uk/sport/football/68688544",
  "title": "Champions League quarter - finals : Manchester City face Real Madrid , Arsenal play Bayern Munich",
  "date": "20240408T190000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League quarter-finals: Manchester City face Real Madrid, Arsenal play Bayern Munich\n- Published\nThe Champions League returns this week with Manchester City once again having to find a way past La Liga leaders Real Madrid.\nThese two sides have met in the knockout stages in three of the past four seasons, including at the semi-final stage in 2022 and 2023.\nThe first leg of their quarter-final takes place at the Santiago Bernabeu on Tuesday, 9 April before the second at Etihad Stadium on 17 April.\nCity won 4-2 on aggregate in the last 16 in 2020, Real triumphed 6-5 on aggregate after extra time in a thrilling semi-final in 2022, but Pep Guardiola got his revenge last year with a crushing 5-1 aggregate success, including a 4-0 second-leg thrashing, before City beat Inter Milan 1-0 in the final.\nCan anyone stop City retaining the Champions League this year?\nFor our experts on BBC Radio 5 Live's Euro Leagues podcast, the answer is a resounding 'no'.\n'Pound for pound the best team in Europe'\n\"It has to be Manchester City,\" said Guillem Balague. \"Now they know what happens when you lose and when you win and they are gaining a lot of experience and it's mostly the same players that have been in both positions.\n\"They have the best squad in Europe and the best manager that's capable to react to whatever happens during the games. They have everything you require to win this competition.\"\nJames Horncastle added: \"These players have shown they can do it and will draw even more strength from that, which is concerning considering they were already pound for pound the best team in Europe.\"\nDespite being favourites, City will have to do it the hard way as they play 14-time European champions Real, a side dominating La Liga, before a potential semi-final against either Premier League title rivals Arsenal or 2020 European champions Bayern Munich.\nRaphael Honigstein felt City would not want an all-English semi-final but still tipped Guardiola's side to win the final at Wembley on 1 June.\n\"It's hard not to go for City,\" he said. \"They're the best team in Europe despite their flaws and the sense they're more vulnerable than in recent years.\n\"It was a very bad draw for them, especially if they're up against Arsenal in the semi-final, which is not what they want, but City are still the best team in the competition so how can I not back them?\"\nOn paper, the opposite side of the draw looks weaker, with one of the quarter-finals seeing Atletico Madrid take on Borussia Dortmund, with both sides struggling domestically and in danger of missing out on qualifying for next season's Champions League.\nLigue 1 leaders Paris St-Germain take on a Barcelona side who are well off the pace in La Liga and lost twice in the Champions League group phase, although they still won their group.\nAn all-English semi-final?\nArsenal are in the quarter-finals of the Champions League for the first time since 2010 and will be up against a Bayern side that will include ex-Tottenham striker Harry Kane, who scored 14 goals in 19 games for Spurs against the Gunners.\nHowever, Bayern's Bundesliga dominance, after 11 successive titles, is set to end this year with the club second in the table, well behind leaders Bayer Leverkusen.\nBayern are managed by Thomas Tuchel, a Champions League winner with Chelsea in 2021, and they have beaten Arsenal 5-1 in each of their past three games, once in 2015 and twice in 2017.\nNevertheless, European football writer Julien Laurens, speaking on The Football News Show, believes there is a good chance of an all-English semi-final.\nHe said: \"City are too strong for Real Madrid, even with [England midfielder] Jude Bellingham. I don't see anything that has changed for Real Madrid compared to last season.\n\"They lost [Karim] Benzema and got Jude, but in the way they play they don't press that much and [are] not that press-resistant either. So if you go to them like City did last season in the second leg and I suspect will do, they will do the same again this year.\n\"The first leg is in Spain and the second leg is at the Etihad, which is a huge advantage, even without away goals any more. I can't see Real Madrid being able to beat City over two legs.\n\"Arsenal are at home in the first leg and go to Munich in the second game. Thomas Tuchel is coming back to England, but this Bayern team has been in crisis for much of this season because they are not going to win the league and got knocked out by a third division team in the [German] cup.\n\"They lost to Lazio in the first leg [of the last 16] and although they made it, it's far from being perfect.\n\"They are still good because they have [Harry] Kane, [Jamal] Musiala and [Leroy] Sane, but defensively or even in midfield it's not the team they used to be. Arsenal have a good chance to knock them out and in my opinion face City in the semi-finals.\"\nWhat do the data experts say?\nAccording to data specialists Nielsen Gracenote, with their Euro Club Index, external model, Manchester City are favourites to lift the trophy for a second time.\nNielsen Gracenote lists each side's chances of winning the competition as:\nManchester City 31%\nReal Madrid 19%\nBarcelona 12%\nParis St-Germain 10%\nArsenal 9%\nBayern Munich 7%\nAtletico Madrid 7%\nBorussia Dortmund 5%\n\"The Champions League quarter-final draw has produced four closely matched ties with no team given more than 59% chance of progressing to the semi-finals,\" said Nielsen Gracenote's head of analysis Simon Gleave.\n\"Manchester City, Arsenal, Barcelona and Atletico Madrid are the favourites to go through according to our Euro Club Index. The odds suggest one or two 'surprise' semi-finalists.\n\"Manchester City are favourites to win the Champions League with a 31% chance of doing so, despite being drawn against the second best team in the competition for this round. Arsenal are fifth favourites because they will have to face the winners of City - Real in the semi-finals and both are ranked above them on our Euro Club Index.\"\nIf you are viewing this page on the BBC News app please click here to vote., external",
  "word_count": 1058,
  "scraped_at": "2026-02-14T02:10:47.906728",
  "_text_extracted": true
}