{
  "article_id": "600b7704fea6",
  "url": "https://www.caughtoffside.com/2023/10/03/manchester-united-make-decision-on-erik-ten-hag-future-amid-poor-performances/",
  "title": "Manchester United make decision on Erik ten Hag future amid poor performances",
  "date": "20231003T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have had a mediocre start to the Premier League campaign and they find themselves 10th in the league table.\nErik ten Hag’s men have picked up just three wins from seven league matches and the Dutchman is under a lot of pressure to get things right. Manchester United have backed him significantly during the summer transfer window, but he has not been able to get his side firing on all cylinders.\nA club of Manchester United’s stature is expected to compete for league titles. Instead, they find themselves barely holding on to the top half of the table. A report from Football Insider claims that despite the poor start of the season, Manchester United are prepared to be patient with the Dutchman and they are not considering his termination yet.\nDespite the poor performances this season, Erik ten Hag did a commendable job last year and he helped Manchester United return to the Champions League. The Dutchman also helped them win the English League Cup and he guided them to the FA Cup final where they were beaten by crosstown rivals Manchester City.\nThe signs of progress are clear under his management but Manchester United will have to add more consistency to their performance. It remains to be seen whether they can turn things around in the coming months and compete for major trophies once again.\nThere is no doubt that they have a talented squad at their disposal and they should be performing at a high level every week.",
  "word_count": 252,
  "scraped_at": "2026-02-14T01:56:32.783510",
  "_text_extracted": true
}