{
  "article_id": "600dbf6cc63f",
  "url": "https://www.fourfourtwo.com/features/champions-league-live-streams-2024-25",
  "title": "How to watch Champions League : Live stream , TV , Fixtures",
  "date": "20250304T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How to watch the Champions League final: Live streams, TV channels\nHow to watch the action in UEFA’s new-look Champions League\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nThe 2024/2025 Champions League comes to a conclusion on Saturday 31 May with the final, between PSG and Inter Milan. This guide explains how to watch Champions League live streams wherever you are in the world – including options to watch the final for free.\n► UK: TNT Sports, Amazon Prime Video\n► Ireland: Virgin Media (free), RTÉ (free), Premier Sports\n► US: Paramount Plus\n► Australia: Stan Sport\n► Free streams: RTÉ, Virgin Media (Ireland), RTL, VTM (Belgium), Tabii (Turkey)\n► Watch from anywhere: Try NordVPN 100% risk free\nThe new Champions League format saw 36 teams play eight games each to determine their position in one giant league. After three knockout rounds, we are down to just two teams, but who will lift the trophy in Munich's Allianz Arena on Saturday night?\nUK viewers can once again tune in though TNT Sports and Discovery+, where you can watch the Champions League final for free, with the streaming platform bringing down its paywall for the night.\nYou can also watch the Champions League final for free in other countries, including Ireland through RTÉ. There are also streaming options in the US, Canada, and Australia.\nIf you’re going to be abroad for any of the action, don’t forget that you can use a VPN to watch your usual UCL live stream from overseas – find out more below.\nChampions League fixtures and channels\nSaturday May 31\nUse a VPN to watch from anywhere\nIf you’re overseas when the next round of UEFA Champions League fixtures kicks off, annoyingly your usual on-demand services won’t work. That’s because your IP address tells the broadcaster you’re in another country, and you’ll subsequently be blocked from tuning in – not ideal if you’ve already paid up for a subscription service you’re not able to use.\nThankfully there is another option that doesn’t involve resorting to one of those illegal feeds on Reddit. All you need is a VPN (Virtual Private Network), a handy piece of software which can make it look like your device is still back at home.\nAssuming it complies with your broadcaster’s T&Cs, you can use a VPN to create a private connection between your device and choice and the internet, meaning the streamer can’t work out where you are and won't automatically block the service you've paid for. All the info going between is also entirely encrypted – and that's a result.\nThere are plenty of good-value options out there, but FourFourTwo’s brainy office mates TechRadar are big fans of NordVPN:\nGet 70% off NordVPN with a 30-day money-back guarantee\nTechRadar love NordVPN’s super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS4 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Back of the net!\nWatch UCL live streams for free in Ireland\nIt’s good news for football fans in Ireland because numerous Champions League games will be available for free this season.\nVirgin Media TV has the rights to show several games every match week – some of which will air on the free-to-air Virgin Media Two and the Virgin Media Play streaming service - which can be used in-browser without registration. Other games will be available on Virgin Media More, which is exclusive to paying Virgin Media customers.\nYou’ll also be able to watch selected matches on the free-to-air RTÉ 2 and its RTÉ Player - also available as a browser player.\nSubscription service Premier Sports will be showing Champions league live streams for selected matches. You can subscribe to Premier Sports through Sky, Now and Virgin Media.\nWatch Champions League live streams in the UK\nUEFA Champions League live streams are shared between two broadcasters in the UK.\nTNT Sports (formerly BT Sport) and Discovery+ have rights to 187 of the 204 Champions League matches in 2024/25. A Discovery+ Premium subscription will set you back £30.99, but you also have the option to add TNT Sports to existing Sky, BT, EE or Virgin Media packages (prices vary).\nChampions League newbies Amazon Prime Video will show the other 17 matches this season, and have first pick of Tuesday night fixtures – chances are they’ll be prioritising matches involving English teams. You can sign up to Prime for £8.99 per month, and new subscribers can take advantage of a 30-day free trial.\nHighlights will also be available on BBC One and BBC iPlayer.\nCan I watch the Champions League on Amazon Prime Video?\nAmazon Prime Video customers in certain countries can enjoy live coverage of selected Champions League matches via their existing Prime subscription.\nViewers in the UK, Germany and Italy can all tune into UCL action through Prime Video – and if you're not already a subscriber you can take advantage of the 30-day free trial.\nCheck your country’s Prime Video homepage for more information.\nWatch Champions League live streams in the US\nParamount+ has the rights to Champions League live streams in the US. The Paramount+ Essential package costs $7.99 per month or $59.99 per year, while Paramount+ with Showtime (which allows you to stream over 40,000 movies and TV episodes without ads) costs $12.99 per month or $119.99 per year. Champions League soccer is available with both deals.\nWatch Champions League live streams in Canada\nDAZN holds the rights to Champions League football in Canada. Subscriptions start from $24.99 a month.\nWatch Champions League live streams in Australia\nAussies can watch Champions League live streams on Stan Sport, with all games available.\nA standard Stan subscription costs $12 a month and the Stan Sport add-on is $15, so all Champions League games are yours for a total of $27 a month.\nWatch Champions League live streams in New Zealand\nDAZN is the home of the Champions League in New Zealand, streaming the games live.\nA subscription starts at $14.99 per month, reduced to $149.99 if you sign up for a full year.\nWatch Champions League live streams in South Africa\nSoccer fans in South Africa can watch the UCL action on subscription service SuperSport through DStv.\nWe recommend VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nPatrick manages the How To Watch content across FourFourTwo and the other sports publications at Future. He's an NCTJ qualified journalist with a decade of experience in digital sports media. A lifelong Evertonian, he now plies his own footballing trade on the bobbly pitches of the famous Bristol Downs League.",
  "word_count": 1283,
  "scraped_at": "2026-02-14T02:18:17.730336",
  "_text_extracted": true
}