{
  "article_id": "60345e11cd20",
  "url": "https://www.thenationalnews.com/business/energy/2025/06/01/turkeys-kalyon-enerji-seeks-global-expansion-of-its-renewable-business-after-7bn-syria-deal/",
  "title": "Turkey Kalyon Enerji seeks global expansion of its renewable business after $7bn Syria deal",
  "date": "20250601T113000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Turkey's Kalyon Enerji, in which Abu Dhabi’s International Holding Company has a 50 per cent stake through Multiply Group, aims to grow its renewable energy portfolio globally, after signing a $7 billion deal in Syria to construct new power plants in the war-torn country.\nKalyon Enerji is co-owned by Turkish conglomerate Kalyon Holding, which has interests in several sectors including construction, energy and aviation.\n“Our renewable portfolio at the moment is more than 2 gigawatts in operation but, in the coming five years, our target is to increase our portfolio to 5 gigawatts,” Kalyon Enerji's chief executive Murtaza Ata said in Istanbul.\n“We are looking at opportunities in the Middle East, Eastern Europe and in the US to grow our portfolio.”\nIn Eastern Europe, Kalyon Enerji is considering Romania and Poland, while in the Middle East and North Africa, it is targeting markets including Algeria, Morocco and Libya, according to Mr Ata.\nIn the US, “there are many projects that have been offered to us and we are studying them”, he said, without disclosing details.\nGlobally, countries are boosting investments in renewable projects as they look to cut emissions to meet their clean energy goals. The US aims to achieve net-zero emissions by 2050, while other countries have set their own targets to cut emissions to reduce global warming.\nKalyon Enerji’s portfolio includes a 1.3-gigawatt solar power plant in Turkey, which is the “largest in Europe and has received the largest green financing from UKEF [UK Export Finance]”, Mr Ata said. Its other projects are also based in Turkey.\nThe Istanbul-based company has “all the capacity and capability to execute projects on its own”, Mustafa Kocar, chief executive of Kalyon Holding, said.\n“Currently, we are the biggest renewable investor in Turkey. So basically, we have the technical expertise, we have the capacity to inject more equity in new projects and we can secure the financing through our own resources,” he added.\n“We have very good relations with the international financing network.”\nNew power plants in Syria\nKalyon Enerji is building new power plants in Syria after economic sanctions were lifted on the country by the US and the EU last month.\nOn Thursday, it signed a $7 billion energy investment agreement with a consortium of companies including Qatar's UCC Holding as well as US company Power international and Cengiz Enerji of Turkey to build a solar power plant with a capacity of 1,000 megawatts and natural gas power plants with a combined capacity of 4,000 megawatts in the country.\n“The target is to complete natural gas power plants in three years after financial closure, which maybe four years from today. For solar one and a half year after financial closure, which is two and a half years from today,” said Mr Ata.\nAfter 14 years of war, Syria's electricity sector has been suffering from severe damage to its grid and power stations, ageing infrastructure, and persistent fuel shortages, generating only 1.6 gigawatts of electricity, down from 9.5 gigawatts before 2011, according to a Reuters report.\nReconstructing the country's power sector is expected to cost about $11 billion and the new administration is betting on the private sector shouldering the burden, underlining a shift from the state-led economic policies of the former regime led by Bashar Al Assad.\n“We are really happy to contribute to the development of Syria after the new situation,” Mr Ata said.\nGlobal expansion in construction\nMeanwhi, Kalyon Holding is also eyeing opportunities in other verticals of its business including in construction, according to Mr Kocar.\n“We were more [of] a local company, but in the last couple of years, with this strategy of internationalisation, on the construction side, we are undertaking some works in Azerbaijan in rail and highway,” he said.\n“We are also doing a gas pipeline project for Romania’ state-owned Transgaz and are bidding for many tenders on the construction side in the Middle East, CIS [Commonwealth of Independent States], North Africa and Eastern Europe.”\nKalyon Holding is also eyeing opportunities in airport construction in Turkey and other parts of the Middle East after building Istanbul airport in 2019.\n“We have a 55 per cent stake in Istanbul airport, and we have completed its construction, and we are now managing the airport together with our partner there,” Mr Kocar said.\n“Airport construction investment is also an area that we are looking at, not only in Turkey but also in the region.”",
  "word_count": 737,
  "scraped_at": "2026-02-14T01:49:39.544985",
  "_text_extracted": true
}