{
  "article_id": "60adc4033e3e",
  "url": "https://www.teamtalk.com/arsenal/arteta-in-dreamland-first-arsenal-summer-signing-explodes-into-life-e60m-agreement-claims",
  "title": "Arsenal transfers : Deal for €60m star  agreed  as Arteta puts star he no longer trusts up for sale",
  "date": "20240420T141500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArteta in dreamland as first Arsenal summer signing explodes into life amid talk of ‘€60m agreement’\nArsenal are reportedly on the cusp of reaching an agreement to make Martin Zubimendi their first signing of the summer with Mikel Arteta finding a massive upgrade for a star he wants gone and as a dream midfield partner for Declan Rice.\nThe arrival of England man Rice last summer has had a telling impact on the Gunners with the midfielder proving one of the Premier League’s outstanding performers this season. As a result, the £105m fee shelled out for his services already looks money very well spent by Arsenal.\nHowever, despite the presence of Rice, the midfield options available to Arteta remain very much an area of the side that needs attention this summer. And with Jorginho’s contract due to expire at the season’s end, and with Mohamed Elneny set to leave as a free agent, the need for Arsenal to strengthen there is obvious to all.\nGO DEEPER: Four glaring areas Arsenal must upgrade to challenge for Champions League glory next season\nHowever, it is the failure of Arsenal to be able to rely on Thomas Partey this season that gives Arteta the biggest cause for alarm. The Ghanaian was a £40m signing from Atletico Madrid in October 2020 and initially, appeared an inspired addition by the Gunners.\nBut the 30-year-old has suffered badly with injuries this season, making just 10 appearances across all competitions and looking bad-value-for money in light of the £200,000 a week deal the midfielder collects at Emirates Stadium.\nAnd with that deal having just a year to run come the summer, it’s reported Arsenal will look to cash in on the player – potentially even for a cut-price fee – to ensure he does not leave as a free agent come summer 2025.\nArsenal ‘reach Martin Zubimendi agreement’\nOne man strongly linked with a move to Arsenal over the last 18 months is Real Sociedad star Zubimendi.\nThe Gunners first looked at the 25-year-old Spain international as a signing back in January 2023, only to be told he was not in a hurry to leave his hometown club as they hunted down a Champions League spot.\nAnd while that interest remained over the summer, Arsenal’s decision to sign Rice instead, together with Zubimendi fulfilling a childhood dream by starring Sociedad in the UCL, meant a move was never likely to prevail.\nHowever, Arsenal have very much remained on his trail and now reports in both Italy and Spain claim a huge summer move to Emirates Stadium is looking like a strong possibility.\nThat’s because, with Sociedad now 11 points adrift of the Champions League places in LaLiga, the player is open to the possibility of moving on, having had the taste of performing in UEFA’s flagship competition.\nAnd while Barcelona and Juventus are also sniffing around his signature, TuttoJuve reports that it is Arsenal who are big favourites to sign the five-times capped Spain star this summer, who has a €60m (£51.7m) exit clause in his deal.\nAnd it’s reported the Gunners have already signalled their intentions to trigger that exit clause, effectively taking his transfer fee beyond the reach of their two main rivals.\nThe player is cut from the same cloth as his compatriot, Rodri, who has shone brightly for Manchester City over the past three seasons and emerged as arguably the best defensive midfielder in world football.\nAnd while he has also drawn comparisons to Sergio Busquets, a move to bring him to Arsenal would thrill Arteta, and finally allow him to field a settled midfield pairing alongside Rice for a good number of years to come.\nDON’T MISS: The world-class XI Arsenal could field next season if Arteta lands top midfield, striker targets",
  "word_count": 635,
  "scraped_at": "2026-02-14T01:56:51.549343",
  "_text_extracted": true
}