{
  "article_id": "60b6cff9c3af",
  "url": "https://www.90min.com/features/premier-league-predictions-20-best-defenders-2024-25-season-ranked",
  "title": "Premier League predictions : 20 best defenders of 2024 / 25 season",
  "date": "20240905T014500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League predictions: 20 best defenders of 2024/25 season - ranked\n- The 2024/25 Premier League season is underway\n- A number of the world's best defenders turn out in England\n- Predicting the top 20 in the division this season\nThe Premier League is home to some of the very best defenders in world football.\nFrom Liverpool stars Virgil van Dijk and Trent Alexander-Arnold, to Arsenal's main man William Saliba, to Man City's Ruben Dias and John Stones, the league is cluttered with genuinely brilliant defenders.\nBut who do we think will be the best of the bunch during the 2024/25 season?\nWell, as part of our Top 90 series, that's what we're here to find out.\nHere's our top 20 defenders in the Premier League - ranked.\n- READ MORE - Top 90 players of 2024/25 season - ranked\n- READ MORE - Top 10 goalkeepers of 2024/25 season - ranked\n20. Gabriel Magalhaes\nAfter starting the 2023/24 season rather unsure of his place in the Arsenal lineup, Gabriel Magalhaes forced himself into the forefront of Mikel Arteta's plans consistently impressive performances throughout the campaign.\nNow, at the start of 2024/25, Gabriel is one of Arteta's most trusted squad members and will play a huge part in the Gunners' inevitable title challenge.\n19. Noussair Mazraoui\nSigned as a replacement for Aaron Wan Bissaka at right-back, it's been easy to see why Erik ten Hag wanted Noussair Mazraoui in the summer window.\nUnlike Wan Bissaka, Mazraoui is able to provide some genuine quality in the final third.\nHe can also defend his flank pretty well too.\n£17.2m could end up looking like a bargain for the Red Devils.\n18. Levi Colwill\nAfter a bit of a lost season due to injuries, Levi Colwill is back to full fitness and looks set to have the breakout campaign Chelsea fans have been waiting for.\nThe defender certainly has all the attributes needed to thrive in Enzo Maresca's possession-based tactical system.\nHe's great on the ball, positionally malleable, and adept at reading the game too.\nThis could be his year.\n17. Riccardo Calafiori\nVery few summer signings made as much sense as Arsenal's acquisition of Riccardo Calafiori.\nThe Euro 2024 will plug an explicit hole in the Gunners' defence as an inverted left-back who can not only drift infield and create on the ball, but actually defend too (something Oleksandr Zinchenko doesn't excell at).\n16. Josko Gvardiol\nWithout Josko Gvardiol's four goals at the end of the 2023/24 season, Manchester City may not be the current Premier League champions.\nThat's how important his contributions were last season.\nAnd this season, we're expecting the left-back to be of similar importance to a Pep Guardiola side set to fight on all fronts.\n15. Murillo\nThe first 'big bold shout' of this list.\nMurillo wasn't a player anyone was too familiar with heading into 2023/24 - he had played 27 pro games in his entire life after all - but by the end of the campaign, it was clear that Nottingham Forest had a serious talent.\nFrom his last ditch challenges, to his multiple attempts to score from the halfway line, Murillo seems to have a bit of everything in his locker.\nDon't be surprised to see one of the big six try and sign him next summer.\n14. Leny Yoro\nWhen Real Madrid are hellbent on securing your services, chances are that you're quite good at football.\nAnd that's exactly what Leny Yoro.\nThe youngster opted to join Man Utd instead during the summer, and it's a decision they are set to reap the benefits of for the next decade.\nAlthough injured at the start of the 2024/25 campaign, when Yoro returns he'll become a key player for his new club.\n13. Cristian Romero\nHe may be rash at times, he may have the odd brain fart, but on his day one can't deny that Cristian Romero is a genuinely brilliant centre-back.\nIf Tottenham are to find a route back into the UEFA Champions League this season, those days will need to a bit more frequent than they were in 2023/24, and we have faith that they will be.\n12. John Stones\nIf we could guarantee that John Stones will be fit for the full 2024/25 campaign, then chances are he'd be much nearer the top of this list than he is.\nThanks to his consistent injury woes though, we struggled to put him any higher than 12th on this list.\nThat's not to say he can't contribute this season, as when fit he most certainly will. He's a top, top player.\n11. Marc Guehi\nHaving cemented his place in the England starting lineup during Euro 2024, Marc Guehi heads into 2024/25 looking to cement his place among the best centre-backs in world football.\nConsidering his talent and the improvements manager Oliver Glasner has made to Crystal Palace, we're back him to do so.\n10. Ruben Dias\nAfter a period of surprise underperformance and lack of gametime, former FWA Footballer of the Year Ruben Dias looks to have re-found his mojo.\nThe defender was thoroughly impressive during City's title-winning campaign last time out, and will be key to their search for yet more silverware in 2024/25.\n9. Ben White\nBen White is one of those players that you should have in your Fantasy Premier League team this season.\nHe'll start every game, he'll get you clean sheets, and he'll pop up with the odd goal contribution too thanks to his adeptness in the final third.\nHe's one of Arteta's most trusted players.\n8. Nathan Ake\nAfter seemingly being signed as a rotation option back in 2020, Nathan Ake has developed into one of Man City's most reliable defensive options in recent seasons.\nBe it at centre-back, left-back, right-back or even midfield on occasion, Ake is a consistent performer for Pep Guardiola's side.\n7. Jarrad Branthwaite\nHave you seen how bad Everton are when Jarrad Branthwaite isn't available?\nThey're bloody awful.\nWith him though, they looked extremely solid at the tailend of 2023/24.\nExpect the Toffees to be much improved upon his return.\n6. Matthijs de Ligt\nMatthijs de Ligt was once the most exciting defensive talent in world football.\nAfter a mediocre spell at Juventus and a failed one at Bayern Munich however, he finds himself in a bit of a last chance saloon situation at Manchester United.\nLuckily for the Dutch defender, Erik ten Hag - the man who previously got the best out of him at Ajax - is the current boss, so there's plenty of hope that De Ligt can rejuvenate his career at Old Trafford.\n5. Trent Alexander-Arnold\nDespite England's struggles to work out how to utilise Trent Alexander-Arnold, at club level the Scouser is rightfully considered to be the best right-back in the Premier League.\nAlexander-Arnold has been impressive in the early weeks of the campaign, and we're fully expecting him to continue that form after the September international break.\n4. Lisandro Martinez\nWhen Lisandro Martinez was out injured last season, Manchester United's defensive unit looked utterly hopeless.\nWhen he returned to action for the FA Cup final, they were good enough to beat Manchester City.\nCoincidence? Definitely not.\nThe Argentine is a gamechanger for the Red Devils, and his availabilty will largely dictate how the club perform in the Premier League in 2024/25.\n3. Micky van de Ven\nMicky van de Ven may be the fastest man on the planet.\nIt's that recovery pace which makes him one of the best defenders in the Premier League, and allows Tottenham to play an outrageously high defensive line.\n2. Virgil van Dijk\nAfter three weeks of the 2024/25 Premier League season, a Virgil van Dijk-led defence has conceded zero goals.\nThat tells you all you really need to know about the sort of form the veteran defender is in this season.\nHe's an all-time great.\n1. William Saliba\nFrom an all-time great, to a future all-time great.\nIn the past two years, William Saliba has developed into the best defender in the Premier League, and this year we're backing him to take his game to another level altogether.\nThe France international will be key to Arsenal's title hopes this season.",
  "word_count": 1370,
  "scraped_at": "2026-02-14T02:01:51.740880",
  "_text_extracted": true
}