{
  "article_id": "60d3dcb896c9",
  "url": "https://www.caughtoffside.com/2024/04/29/transfer-news-fofana-arsenal-nunez-liverpool-future/",
  "title": "Transfer news : Fofana Arsenal , Nunez Liverpool future",
  "date": "20240429T191500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on Fabrizio Romano’s Daily Briefing, a subscription service. If you would like to receive Fabrizio Romano’s exclusive transfer news via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\nYoussouf Fofana the latest midfielder being linked with Arsenal\nAn important win for Arsenal against Tottenham yesterday as they keep on passing these big tests to stay in the title race. I’m sure Arsenal will be competitive until the end, they will fight in the best way possible. But I have to say that Manchester City look in fantastic form, they look unstoppable and they remain the clear favourites also because they’re used to this kind of pressure.\nAnd away from the pitch, Arsenal continue to be linked with midfielders ahead of this summer’s transfer window, with Youssouf Fofana of Monaco the latest name circulating in some media outlets.\nI can guarantee that for Fofana there’s a lot of interest but nothing concrete at this point with Arsenal or any club. Fofana will decide his future in the summer, not now. So nothing concrete is happening at the moment. Arsenal have some priorities in the midfield and I can confirm the names I mentioned in the recent months such as Douglas Luiz and Martin Zubimendi.\nI’ve been impressed with Fofana’s performances so I’m not surprised he’s a name making headlines, but that’s just normal speculation that we always get at this time of year.\nDarwin Nunez’s future – plus did Klopp make a mistake announcing his exit?\nOne of the big stories of the weekend was of course the row we witnessed between Mohamed Salah and Jurgen Klopp, while it was also another disappointing result for Liverpool as they drew 2-2 with West Ham, making it very difficult to see them staying in the title race.\nObviously Liverpool can’t be happy with recent results. What happened between Klopp and Salah can happen in football, especially in negative moments. But despite what’s been suggested by some, my understanding is that there are no regrets on Klopp’s announcement that he’d be leaving at the end of the season.\nSome fans and pundits perhaps feel he should have waited, but he felt it was the best moment, he wanted to be 100% honest with the fans and no one believes that was the issue behind the team’s recent collapse.\nDarwin Nunez is another name in the spotlight as his recent form hasn’t been the best, but I can say I have zero information on Nunez possibly being someone on the move this summer, even with the new-look Liverpool board of Michael Edwards and Richard Hughes.\nI’m told nothing has been decided on Nunez, and in general it will be important to see what Arne Slot will decide once he takes over as manager and assesses the squad. Slot will discuss these matters with the directors in the next weeks, they have many things to discuss and decide this summer, so we can just wait. But, again, I’m told there’s nothing serious for Nunez so far, nothing decided at all.\nWhat next for Manchester United misfit Jadon Sancho?\nThere is a lot of attention on the Bundesliga at the moment, and one player doing well there is Manchester United loanee Jadon Sancho, who is impressing in his second spell at Borussia Dortmund since joining on loan in January. He’s now on five goal contributions since he joined from United, so what next for the English winger?\nThe intention of Borussia Dortmund, from what I’m hearing, is that they really, really want to try to keep Sancho at the club this summer. It would obviously be easier for them in terms of their transfer budget if they have Champions League football, otherwise it could be tough, it’s not an easy deal at all, but they will try.\nSancho himself is also keen on staying at Dortmund, so they will make an attempt and then let’s see how it will go. Let’s also see when negotiations will take place, because for now the focus is obviously on the Champions League semi-finals and their final games in the Bundesliga, but for sure Sancho will be a topic for discussion at Dortmund and Manchester United in the next weeks.\nBenjamin Sesko and Lois Openda – could they leave RB Leipzig?\nTwo RB Leipzig strikers Lois Openda and Benjamin Sesko could also be two players to watch as they continue their fine form in Germany. For Openda, next summer is more likely than this one, as he’ll have an €80m release clause then, but this summer it will be very difficult for clubs to negotiate with Leipzig for Openda because they want to keep him, and the clause is not active yet.\nThere are around seven clubs keeping an eye on Sesko – we’ve spoken before about Arsenal and Manchester United scouting the player, and their interest remains, but I’ve also always mentioned one club specifically, and that’s Chelsea. Chelsea remain keen on Sesko but they still have to decide how much they want to invest on a striker.\nIn any case, Leipzig expect that something could happen this summer with Sesko, so let’s see what’s going to happen. Chelsea have been tracking Sesko for more than two years, but also names like Victor Osimhen are there.\nBarcelona in advanced talks over Guido Rodriguez deal\nIt’s been an important week for Barcelona with Xavi staying at the club, but also with the first steps and movements towards the potential first signing – Guido Rodriguez. It’s still only potential as we know with some deals we really have to wait until the end, especially with free agents, but in this case Barcelona are advancing in conversations to sign the midfielder from Real Betis.\nRodriguez is out of contract at Betis this summer, and there have been many links, including with Napoli, while Atletico Madrid were interested back in November, but nothing happened. Now Barcelona are really interested in the Argentine.\nAs things stand, Barca want to go for Guido as an opportunity – they are still tracking important players for that position, but let’s see what will be possible with Financial Fair Play. Guido is another option seen as an important opportunity, and there have been positive contacts in recent weeks. They’re advancing towards a verbal agreement, so a two-year contract proposal is anticipated, with the option of one more year.\nThe player is keen, but now it’s on Barca – Financial Fair Play will be important, and there will be other steps internally before saying ‘okay let’s go ahead and sign Guido’ – at the moment they are considering him as an opportunity and they are advancing in discussions about the contract, but it’s not done yet.\nSurprise Jules Kounde to Aston Villa stories\nSome fans have made me aware of a bit of a surprise story about Aston Villa being interested in Jules Kounde this summer, with discussion of the Monchi connection with the former Sevilla defender.\nHowever, Villa fans – I’m afraid I have nothing to report here and it looks all quiet on Kounde for now. Barcelona remain happy with him and it would take an important, really important proposal to tempt the club into selling him. So far, nothing has happened and I have no confirmation on this story.\nTosin Adarabioyo leaving Fulham this summer\nAs previously reported, Tosin Adarabioyo will be leaving Fulham as a free agent this summer. His contract is expiring at the end of the season, and he’ll be moving on for a new challenge, though it’s not yet clear where he’ll be going next.\nFor now, Adarabioyo has not agreed terms with any club. He will take his time to consider options and decide for the best one as soon as possible. He’s open to clubs in Premier League as well as clubs from abroad, but we’ll have to wait a bit longer to see what he decides.",
  "word_count": 1326,
  "scraped_at": "2026-02-14T01:51:24.785421",
  "_text_extracted": true
}