{
  "article_id": "60e175caa846",
  "url": "https://menafn.com/1106429337/How-Manchester-City-Evolved-Under-Sheikh-Mansours-Leadership-To-Become-European-Champion",
  "title": "How Manchester City Evolved Under Sheikh Mansour Leadership To Become European Champion",
  "date": "20230613T041500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- Khaleej Times) Published: Tue 13 Jun 2023, 4:07 AM When Sheikh Mansour bin Zayed Al Nahyan, UAE Vice President, Deputy Prime Minister and Minister of Presidential Court, bought Manchester City in 2008, the club was languishing in the mid-table of the English Premier League.\nIt had just finished the previous season in ninth position, 32 points behind Manchester United, the champion of England and its famously successful city rival.\nUnited then was brimming with world-class talent.\nA team featuring Cristiano Ronaldo, Wayne Rooney, Carlos Tevez, Ryan Giggs, Paul Scholes, Rio Ferdinand, Patrice Evra, Nemanja Vidic and Edwin van der Sar, United had also won the Champions League that season.\nIt was Sir Alex Ferguson's second European triumph with United as manager following the famous treble winning season in 1999.\nSo it was following one of United's greatest seasons that Sheikh Mansour made his foray into English football with a club that was never able to sit alongside the elites in the sport.\nBut the visionary UAE leader went on to change the footballing landscape in such a way that City is now football's ultimate aristocrat.\nSo how did City, who completed a historic treble by winning the Premier League, FA Cup and the Champions League this season, become the most dominant team after Sheikh Mansour took over the club?\nLong-term goal Brazilian star Robinho joined Man City from Real Madrid in 2008. - Twitter City did not become successful overnight despite the takeover from Sheikh Mansour in 2008.\nIt was a slow and steady process and one that was backed by Sheikh Mansour in every step.\nIn the first season after the takeover, City finished 10th in the league despite acquiring a big-name player from Real Madrid, Robinho, the Brazilian superstar.\nBut City made gradual improvement and next season in 2010, the team became stronger after the arrival of Emmanuel Adebayor, Carlos Tevez and Kolo Toure.\nChelsea, United, Arsenal and Tottenham were the top four teams as City finished fifth that season, narrowly missing out on a place in the Champions League.\nFA Cup triumph Carlos Tevez lifts the FA Cup trophy in 2011. - Twitter The next season in 2011, City finally ended its trophy drought. A Carlos Tevez-inspired City won the FA Cup that season with a 1-0 win over Stoke City in the final – it was the team's first major triumph since 1976.\nCity had reached the final with victory over United in the semifinal, the club's first success in a knockout game against the bitter rival since 1975.\nCity then went on to finish third in the league, qualifying directly for the Champions League in what was another landmark for the club.\nPremier League ecstasy Sergio Aguero celebrates in front of City fans after his dramatic last-minute goal ended Man City's 44-year wait for the English league title in 2012. - Twitter After breaking into the top-three of the Premier League, City turned on the style in England. Sergio Aguero had just joined from Atletico Madrid and the Argentina made an instant impact.\nCity thrashed Tottenham 5-1 and humiliated United 6-1, signalling its arrival on the big stage as the big contender of the title.\nThe battle for the league title, though, was not easy with United bouncing back only to fall again.\nIt went to the last day with City needing a win against the Queen Park Rangers to pip United for the title.\nBut City was trailing 2-1 until the last few minutes of the game.\nThe Blues though scored an equalizer before Aguero found the winner with a moment of magic in the dying seconds, sparking wild celebrations on the field and in the stands.\nIt was City's first league title in 44 years and it was the start of a golden era for the club.\nGuardiola arrives Legendary Spanish coach Pep Guardiola. - Twitter City had added one more Premier League title in 2014. Two years later, the club hired Pep Guardiola, who famously led Barcelona to dizzy heights during his four-year stint as manager of the Catalan club.\nGuardiola arrived in City after a two-year spell at Bayern Munich.\nA man famous for building teams that play eye-catching football, Guardiola was entrusted with the responsibility of making City a serial winner as well as an aesthetically pleasing team.\nThe Spanish coach imposed his style on the team and it won the league in 2017-2018 by collecting the highest points for a season.\nCity retained the Premier League title next season, its first successful defence of the title in history.\nWith world-class players in the team, City was producing mesmeric football as it also won two more league titles in 2021 and 2022.\nBut the biggest dream - the Champions League title - remained unfulfilled after defeat to Chelsea in the 2021 All-England final.\nHistoric treble Manchester City players and staff celebrate with the Champions League trophy in Istanbul. - AFP Sheikh Mansour's team was finally rewarded in Europe for its perseverance.\nCity produced another masterclass in beautiful and brilliant football as Guardiola's team won its third straight Premier League title, overcoming a spirited challenge from Arsenal.\nThe club then beat city rival United in the final to win the FA Cup.\nAnd once it outplayed Real Madrid, the most dominant team in the history of European football, in the Champions League semifinal, City became overwhelming favourite in the final against Inter Milan.\nThe Italians put up a big fight in the Istanbul final, but the superior quality of City made the difference as Rodri's sumptuous goal separated the victor from the vanquished.\nCity's wait to be European champion was finally over as it also became the first team since Manchester United to complete the treble.\nIt has taken the team 15 years since the takeover from Sheikh Mansour to scale the highest peak.\nBut it was always a long-term vision to become the king of European football.\n“One of the main reasons why this club became what we are is because of the people from Abu Dhabi, Sheikh Mansour, took over the club,” Guardiola said.“Without that, we would not be here.”\nThe biggest tribute City can pay to Sheikh Mansour now is by becoming the first team since Real Madrid to defend the Champions League title.\nALSO READ:\nhigh fives, group hugs, cutting cake: how sheikh mansour, sons celebrated manchester city's win\nlook: man city receives hero's welcome in manchester after champions league glory\nwithout sheikh mansour, man city would not have won champions league, says guardiola",
  "word_count": 1088,
  "scraped_at": "2026-02-14T02:09:58.124289",
  "_text_extracted": true
}