{
  "article_id": "60e654300249",
  "url": "https://cartilagefreecaptain.sbnation.com/hoddle-of-coffee/68445/the-hoddle-of-coffee-tottenham-hotspur-news-and-links-for-tuesday-january-20",
  "title": "The Hoddle of Coffee : Tottenham Hotspur news and links for Tuesday , January 20",
  "date": "20260120T121500Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League football really does come at you fast.\nThe Hoddle of Coffee: Tottenham Hotspur news and links for Tuesday, January 20\nThat’s right everyone - we only have two more matches in the current phase before Tottenham find out if they progress to the next round. Thomas Frank’s side will play host to Borussia Dortmund today (more on that from the rest of the Carty Free gang later),\nBefore we get to that, though, why not take a quick look at some of the other leagues across Europe?\nBundesliga\n- Bayern (50 Pts, +57 GD)\n- Dortmund (39 Pts, +18 GD)\n- Hoffenheim (33 Pts, +14 GD)\n- Stuttgart (33 Pts, +7 GD)\nIt’s a dominant Bayern campaign this year. They’ve been lead by a formidable Harry Kane, who has scored 21 goals and recorded 4 assists in 18 games this season. Those are some mind-boggling stats.\nThe BBC did a breakdown of Bayern’s historic season by the numbers. Some of those include 82 goals scored in the Bundesliga for Bayern since joining the team, and he is also the quickest to reach 100 goal competitions in the competition.\nSerie A\n- Inter (49 Pts, +27 GD)\n- Milan (46 Pts, +18 GD)\n- Napoli (43 Pts, +14 GD)\n- Roma (42 Pts, +14 GD)\nBayern might be running away with the Bundesliga, but if you’re looking for a competitive title race than watch some of the Italian football. Just seven points separate first from fourth - your hoddler-in-chief is interested in seeing what Gian Piero Gasperini’s Roma are up to these days. Meanwhile, Antonio Conte’s Napoli are sitting third.\nLa Liga\n- Barcelona (49 Pts, +32 GD)\n- Real Madrid (48 Pts, +26 GD)\n- Villareal (41 Pts, +18 GD)\n- Atletic Madrid (41 Pts, +18 GD)\nThings are not alright with the Real Madrid fandom in Spain, though. Some of the players were subject to some heavy booing by their fans the other day shortly after manager Xabi Alonso departed the club. But Real are only one point behind their rivals Barcelona. Still, second is never good enough for Madrid.\nAlso keep an eye out for Espanyol who are somehow sitting in fifth.\nFitzie’s track of the day: Jinx Removing, by Jawbreaker\nAnd now for your links:\nAlasdair Gold: “Xavi Simons delivers verdict on Luca Williams-Barnett and Thomas Frank’s Tottenham future”\nBBC: “Under-pressure Frank ‘feeling trust’ of Spurs board”\nThe Standard: “Tottenham face new crisis as Micky van de Ven among up to 14 stars out for Dortmund clash”",
  "word_count": 422,
  "scraped_at": "2026-02-14T02:27:10.758124",
  "_text_extracted": true
}