{
  "article_id": "60e7d1078d3c",
  "url": "https://www.caughtoffside.com/2024/08/06/aston-villa-romelu-lukaku/",
  "title": "Aston Villa working  behind the scene to hijack complicated Chelsea deal",
  "date": "20240806T203000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa are reportedly working on a deal that could see Unai Emery welcome a top striker to Villa Park in time for next season.\nAfter finishing inside the Premier League’s top four, the Villains will spend the 2024-25 season playing in the Champions League.\nAnd looking to build a squad capable of competing with Europe’s elite, Emery, a serial European winner after lifting the Europa League four times, has already made eight first-team signings, including Amadou Onana from Everton and Ian Maatsen from Chelsea.\nAston Villa plotting Romalu Lukaku hijack\nThe Midlands-based giants aren’t done there. Emery has eyes on a new centre forward with Belgian forward Romelu Lukaku recently emerging as a possible option for the 52-year-old.\nThe 31-year-old is on Chelsea’s books despite spending the past two seasons out on loan with Inter Milan and Roma, respectively. Now with just two years left on his contract, the Blues are desperate to offload the former Man United striker and avoid recouping any of the £97.5 million they paid Inter for him three years ago.\nVilla threatening Victor Osimhen’s multi-million-pound exchange\nIn talks with Napoli over a possible reunion with former coach Antonio Conte, Lukaku’s proposed move to Naples could lead to Chelsea signing their top target — Nigerian forward Victor Osimhen.\nHowever, according to a report from Calcio Napoli 24, Villa are working ‘behind the scenes’ on a deal that would scupper Napoli’s chances of signing Lukaku and in turn hamper the possibility of Todd Boehly finally signing Osimhen — a player who has been linked with a move to Stamford Bridge for well over a year — which, considering Lukaku is contracted to Chelsea, makes the entire saga even more complicated.\nOf course, a lot depends on Lukaku’s preference and a return to the Premier League may not be top of his list, but should the 31-year-old feel he still has a point to prove, a move to Villa Park, as well as guaranteed Champions League football, would provide the former Everton man with the opportunity he needs to prove his critics wrong.",
  "word_count": 346,
  "scraped_at": "2026-02-14T01:51:48.879915",
  "_text_extracted": true
}