{
  "article_id": "60ec62a2394b",
  "url": "https://www.themag.co.uk/2023/09/champions-league-packages-club-risking-time-factor-on-special-newcastle-united-members-deal/",
  "title": "Champions League packages - Club risking time factor on special Newcastle United members deal",
  "date": "20230912T113000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League packages – Club risking time factor on special Newcastle United members deal\nSeason ticket holders were offered a special Champions League package.\nThey were given until 5 July 2023 to take up the offer, adults paying £165 for the trio of home matches.\nThe special packages were announced on 16 June 2023, when the club released their big update to season ticket holders (see below).\nFor Newcastle United members though, this was surely the most important / interesting bit…\n‘Purchase a three-match package for Newcastle United’s home UEFA Champions League group stage matches at a special season ticket holder rate. (Please note that after this period, any seats not sold to season ticket holders will go on sale as a three-match package to members – this member period will not include season ticket holders).’\nFor season ticket holders the deadline has long past, it is now ten weeks since they had to sign up for their three match Champions League packages.\nWith only 22 days to go until that first home Champions League clash at St James’ Park against PSG, surely the club must shortly be putting these three match Champions League packages on sale to members, whether that be by ballot, or a going on sale at 10am first come first served basis.\nThe new owners have had the luxury of knowing that every single ticket, for home and away matches, has been sold so far.\nHowever, there is never room for complacency and I think the NUFC owners need to get these Newcastle United members packages on sale ASAP, for a number of reasons.\nIt will help get excitement and momentum flowing ahead of a vital home game this Saturday against Brentford.\nPlus, we have to make sure all these Champions League games are sold out.\nMany of you may think this is a given BUT for older fans, they will remember that bizarrely, for whatever reason, under Sir Bobby Robson the CL home games against the likes of Inter Milan DID NOT sell out.\nSeason ticket holders were charged £165 for their three game packages, so the ones for members will be at least that. This is serious money, especially in today’s financial climate.\nIf the club let this drift beyond next Tuesday, what happens if we got hammered away at AC Milan? Would the demand still be so high for the home games?\nI would hope so BUT you can never be sure.\nLet’s be certain that all these three Champions League matches are sold out ASAP, so fingers crossed these special packages for members are put on sale very soon.\nNewcastle United Champions League fixtures:\nMatchday 1: AC Milan v Newcastle United – 19th September, 5.45pm\nMatchday 2: Newcastle United v Paris Saint-Germain – 4th October, 8pm\nMatchday 3: Newcastle United v Borussia Dortmund – 25th October, 8pm\nMatchday 4: Borussia Dortmund v Newcastle United – 7th November, 5.45pm\nMatchday 5: Paris Saint-Germain v Newcastle United – 28th November, 8pm\nMatchday 6: Newcastle United v AC Milan – 13th December, 8pm\nNewcastle United official announcement – 16 June 2023:\nNewcastle United has announced season ticket prices and cup scheme information for the eagerly-awaited 2023/24 season at St. James’ Park.\nSeason tickets will rise by a blended average of 3.3% with the club freezing season ticket prices for juniors, while prices for other categories will rise by 5%. Supporters on existing long-term price deals will continue to have their prices frozen for the upcoming campaign.\nAs well as reaching a first domestic cup final in 24 years last season, the Magpies achieved a top four finish in the Premier League last season and will be returning to the UEFA Champions League for the first time in 20 years in 2023/24. Accordingly, enrolment details for domestic cup schemes and a three-match European package can also be confirmed below.\nThe introduction of cup schemes follows a period of consultation with supporters via an online survey and in-person workshop, with 84% of those surveyed indicating a preference to guarantee tickets for all competitions by securing a seat with a package purchased in advance.\nDespite rising supply costs on matchdays, the club is continuing to invest on and off the pitch, with an overhaul of the first team training ground supplementing developments to the matchday experience at St. James’ Park, including enhanced concourse and hospitality facilities, increased connectivity, a new licensed standing area and proposals for a new fan zone.\nFor the upcoming season, the club has upgraded its stadium infrastructure and will introduce mobile ticketing for all season ticket holders, supporting both efficient stadium access and ongoing sustainability commitments.\nDarren Eales, Newcastle United’s CEO, said: “St. James’ Park is an amazing place to watch football and we look forward to welcoming our incredible supporters back for our upcoming Premier League, domestic cup and UEFA Champions League campaigns.\n“During the summer, we are continuing to invest in our facilities as we look to enhance the matchday experience for everyone, and we look forward to seeing our new licensed standing area in operation next season along with a new mobile ticketing system.\n“I would like to thank everyone who took part in our recent ticketing survey and workshop. Fan engagement is hugely important to us and it will continue to inform our decisions as we build sustainable success together.”\nWe ask all season ticket holders to read the following information carefully before proceeding with the renewal process.\nRENEWALS AND CUP SCHEMES\nRENEWING YOUR SEASON TICKET\nExisting season ticket holders can renew their season tickets from 10am (all times UK) on Monday 19 June. Season ticket renewals should be completed online at book.nufc.co.uk.\nThe deadline for season ticket renewals is at 5pm on Wednesday 5 July.\nSeason ticket prices for the 2023/24 season can be found here.\nPAYMENTS – SEASON TICKETS\nSeason tickets can be paid up front in full, or, for additional flexibility and convenience, via monthly direct debit. Instructions will be included during the renewal purchasing process.\nCUP COMPETITIONS\nDuring the renewal period, season ticket holders will have priority access to opt in to:\nA Carabao Cup scheme that will automatically trigger the purchase of the existing season ticket seat (subject to availability) for any home 2023/24 Carabao Cup matches (does not include the final if reached).\nAn Emirates FA Cup scheme that will automatically trigger the purchase of the existing season ticket seat (subject to availability) for any home 2023/24 Emirates FA Cup matches (does not include the semi-final or final if reached).\nPurchase a three-match package for Newcastle United’s home UEFA Champions League group stage matches at a special season ticket holder rate. (Please note that after this period, any seats not sold to season ticket holders will go on sale as a three-match package to members – this member period will not include season ticket holders).\nPurchase their Magpie Mover pass for use on public transport on home matchdays.\nYou must opt in separately to each cup scheme. Cup schemes must be opted in to online at book.nufc.co.uk by 5pm on Wednesday 5 July.\nYou will receive email confirmation of your purchases via email.\nCUP SCHEME PRICES\nPrices for the Carabao Cup, Emirates FA Cup and three-match UEFA Champions League package below (all prices per match) can be found here.\nPlease note that this is a reduced rate for season ticket holders.\nPAYMENTS – CUP SCHEMES\nIf you opt in to the Carabao Cup or Emirates FA Cup scheme, you will need to add payment card details on your online ticket account so that we can process payment for your relevant match ticket within seven days of the fixture being announced.\nFor the three-match UEFA Champions League package, payment for the first group stage home match will be taken three working days after the renewal period closes on Wednesday 5 July 2023. Payments for the second and third group stage matches will be taken on Friday 25 August 2023.\nPAYMENTS – MAGPIE MOVER\nMagpie Mover passes must be paid for in full by debit/credit card at the time of the transaction.\nIMPORTANT INFORMATION\nCUP SEATING\nOur aim is to ensure that all enrolled season ticket holders can enjoy eligible matches from their existing season ticket seat.\nHowever, for some domestic and/or European cup matches, seating requirements in specific areas may result in your existing season ticket seat not being available. Should this be the case, an alternative seat will be offered for affected matches.\nCANCELLATIONS\nIf you opt in to a cup scheme or purchase the three-match UEFA Champions League package and decide to cancel before or during the season, you will not be eligible to opt in to packages for the following season. Refunds will not be permitted.\nTRANSFERRING TICKETS\nFor the first time next season, season ticket holders will be able to transfer tickets to eligible registered family members or friends if they are unable to attend a match. This will be supported by ID checks at St. James’ Park.\nEligibility to access future rounds/finals will remain with the original season ticket holder.\nFurther information on this and on mobile ticketing will be communicated shortly.\nYOUR SEASON TICKET\nAs we approach the new season, season ticket holders will be advised how to download your digital season ticket.\nYou will need to download this once for the full season.\nIf you enrol in any cup schemes or purchase the three-match UEFA Champions League package, please note that separate tickets will need to be downloaded.\nAs we review our membership offering and look to minimise additional costs to season ticket holders, season tickets will no longer come with a membership pack or membership benefits automatically.\nMembership, including member packs and member benefits, can be purchased as an optional extra and details will be confirmed in due course.\nFREQUENTLY ASKED QUESTIONS\nSEASON TICKETS\nI submitted a change of details/category during the penalty free period and my account hasn’t been changed/I haven’t been contacted yet – what do I do?\nWe experienced a high number of enquiries and submissions during the penalty-free period and we are continuing to process requests. We will be in touch in due course and thank you for your patience.\nWhen will I receive my season ticket?\nWe will email you in July with full details on how to download your digital season ticket.\nWe will communicate full information – including answers to frequently asked questions – during this period and will advise supporters on how to download and best use their digital season ticket.\nWhat if I am unable to access or use a smart phone?\nWhile we anticipate the vast majority of supporters will be able to use their device without any issues, we understand that not everybody can or does use a smartphone. Accordingly, we are making appropriate arrangements and this process will be confirmed shortly.\nCan I learn more about how digital ticketing will work?\nYes, the club will be issuing comprehensive communications on digital ticketing across club channels prior to the new season. This content will also be informed by feedback we have received from supporters.\nIn addition, we will be contacting season ticket holders to provide details of drop-in sessions where we can introduce fans to digital ticketing and support your transition to using this as your entry method on a matchday.\nWhat happens if I can’t attend a game?\nYou will be able to forward your season ticket to eligible supporters that are linked to your account via our family and friends functionality.\nFull details of how to do this will follow.\nCUP SCHEMES\nIf I opt in to a Cup game, when will payment be taken?\nIf you opt in to the Carabao Cup or Emirates FA Cup scheme, you will need to add payment card details on your online ticket account so we can process payment for your relevant match ticket in advance of each game (at the time the fixture is confirmed next season).\nFor the three-match UEFA Champions League package, payment for the first group stage home match will be taken three working days after the renewal period closes on Wednesday 5 July 2023. Payments for the second and third group stage matches will be taken on Friday 25 August 2023.\nWhat if I miss a payment?\nIf we are unable to take your payment from your chosen payment method, you will have an immediate 48-hour window in which to make the payment and remain in the respective cup scheme.\nShould payment not be received within that 48-hour window, your seat will return to sale for eligible supporters and the club reserves the right to cancel your enrolment to the cup scheme.\nPlease note that if your cup scheme is cancelled, you will not be eligible to join the following season.\nIf I am on a long term deal and have already renewed my season ticket – how can I opt in to the Cup Schemes?\nPlease log on to your ticketing account and you will have the option to enter each of the Cup Schemes. If you wish to enter a cup scheme you must do this by Wednesday 5 July.\nIf the Cup Scheme option does not show on your account please check that the correct supporter number is linked to the account.\nIf you are unsure how to link your supporter number to your online account at book.nufc.co.uk – more details can be found here.\nIf you do not have an account on book.nufc.co.uk please register an account here and then link your season ticket to this new account. Details of how to do this can be found here.\nWhat if I don’t opt into a cup scheme during the renewal period?\nOpting into the respective cup schemes/packages is the only way to guarantee a seat at a home Carabao Cup, Emirates FA Cup and UEFA Champions League group stage fixtures.\nIf you do not opt in, the next opportunity to purchase a ticket will be when tickets go on sale to members.\nDuring the on-sale period for members, any season ticket holder that has not previously opted into the respective cup scheme will also be eligible to purchase, subject to availability.\nSeason ticket holders who have opted in will not be able to purchase additional tickets.\nWhat will happen if the club progresses to the Carabao Cup Final, Emirates FA Cup semi-final/final, or the UEFA Champions League knock-out phase?\nPriority access to tickets would be given to those who have already opted into the respective cup scheme or package. Information on any other priority periods will be communicated subject to progress in cup competitions.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 2450,
  "scraped_at": "2026-02-14T02:07:14.755830",
  "_text_extracted": true
}