{
  "article_id": "60f43530dfe5",
  "url": "https://www.90min.com/frenkie-de-jong-first-barcelona-appearance-since-april",
  "title": "Frenkie de Jong reflects on first Barcelona appearance since April",
  "date": "20241002T194500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frenkie de Jong reflects on first Barcelona appearance since April\n- Frenkie de Jong is back from a long-term ankle injury\n- Midfielder played closing stages of win over Young Boys\n- Both he and coach Hansi Flick reflect on comeback\nBarcelona midfielder Frenkie de Jong made his long-awaited injury comeback during Tuesday night's 5-0 Champions League win over Swiss side Young Boys.\nDe Jong appeared from the bench in the second half of the contest at Estadi Olimpic Lluis Companys, replacing Lamine Yamal in the latter stages of the game when Barca already led 4-0.\nThe Dutch midfielder has spent almost all of the last seven months sidelined with a troublesome ankle injury that first began plaguing him last September. After being stretchered off during Barca's goalless draw with Athletic Club in March, De Jong had managed just 45 minutes of football since - against Real Madrid in April.\nHe was still selected by Netherlands coach Ronald Koeman for Euro 2024, but was forced to withdraw from the squad a few days before the start of the tournament.\n\"I am really happy with the win and, personally, to be back playing,\" De Jong told reporters following the thrashing of Young Boys, handing Barca their first Champions League win of the season.\nThe 27-year-old, now in his sixth season with the Catalan giants, admitted that he didn't expect such a warm welcome from the fans when he stepped onto the field.\n\"The fans gave me a good reception and I'm grateful for that because you never know how you'll be received. I didn't expect it. I'm happy with the way I was welcomed back,\" De Jong said.\n\"The team is in good form and has been since the start of the season. We are playing well. We have to keep going now, keep improving and see where it takes us.\"\nHansi Flick has had to contend with a midfield crisis in the early weeks of 2024/25, with De Jong and Gavi starting the season injured, Ilkay Gundogan leaving the club and 17-year-old breakthrough talent Marc Bernal forced to have surgery on a long-term injury.\nAndreas Christensen, who has stepped into midfield from defence in the past, has also been unavailable.\n\"For Frenkie, it was an important step to come back to the team after having suffered such a serious injury,\" Flick reflected. \"Playing some minutes was important for him. I would have liked to have used him earlier but he came on when he did, he's come a long way, got some touches, ran a little bit, it was important for him to feel like a football player again, and get that feeling back.\"",
  "word_count": 444,
  "scraped_at": "2026-02-14T02:01:51.722111",
  "_text_extracted": true
}