{
  "article_id": "60fa922d41f8",
  "url": "https://www.newkerala.com/news/o/la-liga-no-room-slip-ups-atletico-first-two-madrid-810",
  "title": "Atletico Madrid Face Rayo Vallecano in Crucial La Liga Derby",
  "date": "20250923T161500Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid\n, Sep 23 (IANS) Atletico Madrid will play a derby against Rayo Vallecano on Wednesday in the sixth round of the Spanish La Liga. The game is the first of two derbies for Atletico this week, and Diego Simeone's side needs to win both, otherwise this season's title could already slip out of reach before September ends.\nAtletico's 1-1 draw in Mallorca left it nine points behind former champions Real Madrid, and with Real visiting Levante on Tuesday, that gap could stretch to 12 points before kickoff at the Metropolitano Stadium. With Atletico hosting Real on Saturday, anything other than two wins would leave Simeone's team with fading hopes of competing for the title.\nAtletico striker Alexander Sorloth will miss Wednesday's game after his red card in Mallorca. At the same time, Simeone is also concerned about forward Julian Alvarez, who has not scored since the opening game of the season, reports Xinhua.\nWednesday's fixtures will begin with Getafe at home to Alaves, with both sides returning from weekend defeats. Getafe could have expected a difficult trip to Barcelona, but Alaves disappointed in a home loss to Sevilla, and coach Eduardo Coudet may add more strength to his midfield against demanding opposition.\nThere is also likely to be tension in San Sebastian as 18th-ranked Real Sociedad and 19th-placed Mallorca meet in search of their first win of the season.\nSociedad arrive after three consecutive defeats and ahead of a weekend visit to Barcelona, while Mallorca showed fighting spirit to take a point against Atletico. Key players are expected to be Sociedad forward and captain Mikel Oyarzabal, and Mallorca striker Vedat Muriqi.\nDouble injury blow for Barca with bad news for Gavi\nMeanwhile, FC Barcelona have suffered a double injury setback on Monday, with the attacking midfielder Fermin Lopez suffering a muscle injury, while Spain international Gavi will need exploratory surgery on a knee problem.\nFermin went down on the pitch at the end of Sunday's 3-0 win at home to Getafe, holding the back of his left leg with clear signs of pain, before limping off the pitch.\nTests carried out on Monday have shown he has suffered \"an iliopsoas muscle injury in his left leg.. He will be out of action for around three weeks\", according to the official Barcelona website.\nFermin will miss Thursday's visit to Oviedo and next Sunday's home game against Real Sociedad, as well as next week's big Champions League tie against reigning European champions Paris Saint-Germain and another La Liga game away to Sevilla.\nThere was worse news for Gavi after the club also confirmed on Monday that he would \"undergo an arthroscopic examination\" on his right knee to attempt to resolve a long-standing problem.\nGavi originally tore the cruciate ligament in the knee in November 2023 but had been back in action since the end of 2024 before the problem flared up again in the opening days of the season, and he has been sidelined for around a month.\nBarca reported on Monday that the decision to operate came after the player, \"underwent intense sporting stress tests after finishing his conservation course of treatment for the radial injury to the internal meniscus in his right knee.\"\nThe club didn't announce how much longer this would sideline Gavi for, merely saying it would release an update \"once the procedure has been carried out.\"\nBarca coach Hansi Flick also has doubts over the fitness of winger Lamine Yamal, who has missed the last two games with a pelvic injury, caused partly by the amount of football he has played in recent months, while midfielder Frenkie de Jong has also struggled with an ankle problem.\n- IANS",
  "word_count": 612,
  "scraped_at": "2026-02-14T02:21:48.752363",
  "_text_extracted": true
}