{
  "article_id": "6100cf204a91",
  "url": "https://www.nytimes.com/athletic/6732846/2025/10/21/bundesliga-briefing-harry-kane-yussuf-poulsen-tifo-leipzig/",
  "title": "Bundesliga Briefing : All - time performance from all - rounder Kane and Leipzig Poulsen tifo",
  "date": "20251021T054500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“So kann man kein Spiel gewinnen” (“You can’t win playing like that”)\nSome bracing honesty to start this weekend’s Bundesliga Briefing. That’s how the Wolfsburg official account on X responded to their 3-0 home defeat by Stuttgart on Saturday. And they were not being unduly harsh. It was an awful result and a terrible way for Christian Eriksen to mark his first start for the club. VfL may enjoy the historic patronage of Volkswagen and an exemption from the 50+1 rule as a consequence, but they are mired in crisis.\nAdvertisement\nElsewhere, Union Berlin trod Borussia Monchengladbach further into the mud, beating them 3-1 on Friday night. Werder Bremen threw away the lead twice to draw 2-2 in Heidenheim, and Hoffenheim dismantled St Pauli 3-0 at the Millerntor. FCSP have quietly lost four games in a row now, with their good start now a memory.\nBayer Leverkusen prepared for Paris Saint-Germain in the Champions League with a 4-3 win in Mainz. Christian Kofane scored arguably the goal of the weekend, finishing a gorgeous team move in the first half. Then, late in the second, with Mainz threatening an equaliser at 2-3, Martin Terrier celebrated his return from the Achilles tendon rupture he suffered in January, by coming on as a substitute and scoring the clinching goal.\nTerrier was one of Leverkusen’s big additions in the summer of 2024, joining for €20million (£17.4m, $23.3m) from Stade Rennais. Ultimately, he suffered terrible luck, sustaining a broken arm in the autumn and then that devastating Achilles injury after the winter break, only starting seven league games in the final season before Xabi Alonso’s double-winning side was broken up and sold off.\nStill, he’s part of a new team now and Leverkusen are so far unbeaten in the seven games since Kasper Hjulmand took over from Erik ten Hag.\nKane the midfield general\nBut this weekend was focused on the Allianz Arena and Bayern Munich’s 2-1 win over Borussia Dortmund, which maintained their perfect start to the season and extended their lead at the top of the Bundesliga five points.\nBayern continue to be mightily impressive.\nWhen the teams were announced, it was feared that Serge Gnabry’s absence (due to injury) would inhibit Vincent Kompany’s attack. Not without reason. Gnabry, Michael Olise, Luis Diaz and Harry Kane had started five of the six league games prior to this weekend together, helping them to build their formidable chemistry in double-quick time.\nAs it was, Nicolas Jackson replaced Gnabry and while the Chelsea loanee only had a limited effect on the game, he did nothing to blunt Bayern. Kane gave — no hyperbole — one of the great all-round performances of his career, and Diaz and Olise each had chances in the first half to put the game well beyond Dortmund.\nAdvertisement\nAn interesting Kane anecdote. Each weekend, Kicker select their team of the weekend — their Elf des Tages. It’s not like the British equivalent, which is just a jumble of goalscorers, but something taken seriously and with thought behind it. Anyway, Kane has now been selected after five of the seven matchdays so far this season, but this was the first time the Kicker scribes selected him in midfield, describing not only how broad his role currently is, but how the perception of him in Germany is changing.\nThe “Aushaengeschild der Bundesliga” — the Bundesliga’s flagship player — is how they referred to them. Player, not forward. That’s entirely fair, too, because Kane was a tremendous defensive asset on Saturday, and an influence on every aspect of the game.\nHe has not always enjoyed an easy ride in Germany. For a long time, the commentary surrounding him was merciless and there was an appetite to find fault wherever possible. Some of that negativity was justified, some of it was rather contrived. The mood has certainly changed now, though, with Kane ascending to a different plane in German footballing terms, and each week bringing a new flood of praise.\nHis quality is one reason for it. His application is another. Kane has actually run 72.9km in the Bundesliga this season, which is the 25th-furthest in the division. To contextualise that, it’s actually further than Joshua Kimmich, Rocco Reitz and Angelo Stiller, who are all central midfielders, and Konrad Laimer, currently being used as a full-back. Jonathan Tah is the only Bayern player to have run further this season.\nOn to Dortmund and head coach Niko Kovac, who has caught some flak since that defeat.\nHe has been criticised for being too negative with his selection, in particular the decision not to start Julian Brandt. Dortmund lined up on Saturday with Marcel Sabitzer, Felix Nmecha and Pascal Gross in midfield, with only Karim Adeyemi and Serhou Guirassy in attack. Dortmund usually employ a 3-4-2-1, so it was easy to view that as containment strategy, particularly after BVB failed to register a shot in the first half.\nAdvertisement\nBut while this was not a success, accusations of negativity ignore that this season’s Bayern are among the best counter-attacking teams in European football and have become ruthlessly adept at punishing anyone who overcommits against them. The 25 goals they scored in the six games prior made a compelling case for caution, too, and so it’s easy to justify the game plan, even if it did not work.\nTheoretically, the extra midfielder — selected in place of Brandt or Maximilian Beier — could be seen as an attempt to contain Kane’s roaming; no team has an answer for that yet and coaches all over the league are experimenting with different dynamics. Kovac was the latest to try and he was not successful, but the working is easy to understand.\nIn fact, the simpler explanation for what happened on Saturday might be that Dortmund just ran into an opponent currently playing at a far superior level, with players who are both better and, crucially, more dependable in big games. Dortmund have individuals capable of redressing some of the inequities, among them Guirassy, Adeyemi, Nmecha, Sabitzer and Sule, but all of them had difficult evenings on Saturday, failing to execute at the right moments. Guirassy might have scored twice early in the second half when it was still 1-0. Later, Adeyemi should certainly have equalised, but kicked his own feet with the goal at his mercy.\nMaybe there were questions to answer about the approach, but Dortmund still had the opportunities to take something from this game. In those moments, in a theme which has recurred consistently in recent years, it was their inefficiency that cost them and that’s really more about the current playing squad.\nPoulsen’s warm welcome\nRB Leipzig welcomed Yussuf Poulsen back on Saturday. Poulsen joined Leipzig in 2013, when they were still in the 3.Liga, and by the time he left to join Hamburg this summer, he had made a record 425 appearances for the club.\nLeipzig beat Hamburg 2-1 on Saturday and before the game, this is how the home fans celebrated Poulsen’s return.\nEinfach genießen 👏 pic.twitter.com/VSgboTNxxt\n— RB Leipzig (@RBLeipzig) October 19, 2025\nBeyond his appearance record, he was also among the first Leipzig players to win a major trophy, when he was part of the Domenico Tedesco side that won the DFB-Pokal in 2022.\nAdvertisement\nAnd there’s an Easter egg in the RB Arena commemorating that achievement. The stadium is built in the footprint of the old Zentralstadion and on one of the old subterranean walls there’s a growing mural, designed by local artists, which celebrates significant players in the club’s short history.\nPoulsen was the first player painted onto the wall and Emil Forsberg and Timo Werner have since been added.\nI interviewed Poulsen back in January 2022. He’s excellent company and it was easy to see why he was so popular in Leipzig, with fans, team-mates, and everyone with whom he came into contact. During the interview, he also recalled the first conversation he ever had with Ralf Rangnick. He was a teenager playing in the Danish second division, and — trying to sign him — Rangnick, then RB’s director of football, made all sorts of outlandish promises about the future.\n“I thought he was quite crazy,” Poulsen told The Athletic. “He said they’d be going up to the second league at the first try, that they’d then spend two years in that division, and then go up into the Bundesliga. After that, he said, ‘We’ll be going into the Champions League’.”\nLeipzig are Leipzig. The club had many, many advantages while making that journey, but Poulsen is still an unlikely story, who survived the promotions, the new signings and all the coaching changes that were made during his twelve years. Given the escalation in budget and status that occurred during that period, that’s a remarkable achievement and reward for a player who is, universally, described as a model professional and who obviously got the very most from his potential.\nNot bad for someone who almost became an accountant instead.",
  "word_count": 1499,
  "scraped_at": "2026-02-14T01:52:49.021362",
  "_text_extracted": true
}