{
  "article_id": "6117f3307bc9",
  "url": "http://thepeninsulaqatar.com/editorial/27/06/2024/making-great-strides-1",
  "title": "Making great strides | The Peninsula Qatar",
  "date": "20240627T080000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nQatar is set to continue the FIFA World Cup 2022 legacy by bringing major sports events particularly football tournaments home for many years to come. But it’s not just about hosting the competitions; Qatar is also bracing to make great strides in its domestic football with the national team also coming closer to making history in international football.\nThe country has become an ideal destination for the mega events particularly after it hosted the best-ever edition of the FIFA showpiece, winning hosting rights for many events slated to be held in the coming years. Among these events are the five consecutive editions of the FIFA U-17 World Cup, which will take place at country’s world class venues from 2025 to 2029. These events are also expected to play major role in finding budding players of the country.\nAfter a highly successful inaugural edition in 2021, the FIFA Arab Cup will also return to Qatar, which will be home to three tournaments in 2025, 2029 and 2033 bringing together the elite sides of the region. Besides maintaining its status as the hub of football competitions, Qatar is also hoping to take a step forward in international football as Al Annabi are looking to make history by qualifying for the World Cup for the first time after making its debut in the tournament as the hosts two years ago.\nQatar, who were almost perfect in the second round of the Qualifiers, will appear in third and final round of World Cup 2026 Asia Qualifiers, eyeing a top-two finish in the group of six to achieve the feat. The two-time Asia Cup champions, owing to their fine performance this year, have risen to 35th in the world rankings, and appear set to accomplish the mission under coach Marquez Lopez.\nExciting contests are also on the cards in the 2024-2025 domestic football season with teams building up for the top flight Qatar Stars League, which will be played officially as the ‘Ooredoo Stars League’ following the sponsorship signing with the telecommunications company on Tuesday. The competing teams will go in the preparatory mode soon mostly setting up their pre-season training camps in the European countries.\nThe new season scheduled to begin in early August is expected to see some big names arriving to represent their respective clubs raising the level of competitions. Qatar giants Al Sadd and Al Rayyan will also compete in the main rounds of AFC Champions League Elite (ACL Elite) targeting the prestigious title with Al Gharafa set to vie for the berth in the main round.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 494,
  "scraped_at": "2026-02-14T02:13:55.811009",
  "_text_extracted": true
}