{
  "article_id": "6121924dcd47",
  "url": "https://destinationksa.com/en/kingsley-conman-has-joined-al-nassr/",
  "title": "Kingsley Conman has joined Al Nassr 2025 - Destination KSA",
  "date": "20250817T140000Z",
  "domain": "destinationksa.com",
  "source_country": "Saudi Arabia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Al Nassr will rock you.\nKingsley Conman is making his Saudi Pro League debut.\nBeloved Saudi club Al Nassr has been dominating headlines right before the kick-off of the Roshn Pro League 2025-2026.\nAfter signing Iñigo Martínez on Sunday, August 10, the Knights of Najd are back with a brand-new player. France’s Kingsley Conman has joined Al Nassr.\nFormerly seen in Bayern Munich’s colors, Conman has joined the Saudi Pro League team as a winger.\nAfter finishing third in the Roshn Pro League last season, Ronaldo and his playing 11 are looking to dominate this year. The championship will kick-off from Thursday, August 28.\nKingsley Conman has joined Al Nassr\nKingsley Coman is set to dazzle fans at Al-Nassr while still flying the flag for France’s national team. A product of PSG’s academy, he kicked off his professional journey with Juventus in 2014, instantly picking up silverware in Italy before making a career-defining move to Bayern Munich. There, he racked up trophies galore, Bundesliga titles, domestic cups, and even the 2020 Champions League, where his goal in the final sank his old club PSG.\nFor more than a decade, he managed the rare feat of winning a league title every single season until 2024.\nOn the international stage, Coman has been just as electric. After tearing through France’s youth levels, he made his senior debut in 2015 and hasn’t looked back since.\nHe’s featured at the biggest tournament, Euro 2016, Euro 2020, the 2022 World Cup, and Euro 2024, helping France reach two major finals along the way.\nKnown for his blistering pace and game-changing flair, Coman continues to be one of the most exciting wingers to watch in world football.\nKingsley Conman has joined Al Nassr location\nThe 29-year old was signed by the Riyadh-based club and was immediately seen in Hong Kong, training with his new brothers.\nKingsley Conman has joined Al Nassr signing date\nAl Nassr signed Conman on Friday, August 15.\nKingsley Conman has joined Al Nassr contract duration\nThe frenchman will be playing with his former Bayern Munich teammate Sadio Mane at the KAFD-backed team until 2028.\nSaudi football\nFootball is a huge part of the Kingdom’s culture, with Riyadh Season hosting the Italian Super Cup in January 2025. The Saudi World Cup bid managed to achieve the highest-ever score and was announced as the official FIFA World Cup host for 2034. The Kingdom is also set to host the Asian leg of the FIFA World Cup 2026 qualifiers. Al Kholood has also made history as the first-ever foreign-owned SPL team in the league. Al Hilal has also joined silly season with their signing of Darwin Núñez earlier this month.\nUntil 2028, @alnassrfc_en.",
  "word_count": 448,
  "scraped_at": "2026-02-14T01:52:36.773132",
  "_text_extracted": true
}