{
  "article_id": "6144a0649cd4",
  "url": "https://www.managingmadrid.com/2025/5/4/24423266/watchin-the-waves-4-may-2025",
  "title": "Watchin the Waves .. : 4 May 2025",
  "date": "20250504T113000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to d all things football. Do not be alarmed by the overt RMCF bias. It’s in the name! Shoutout to the mods who do a fantastic job, Valyrian Steel, Felipejack, Juninho, NeRObutBlanco and yours truly, Kung_Fu_Zizou\nWatchin the Waves.. : 4 May 2025\nMay the 4th Be With You\nIt’s Matchday\nReal Madrid are currently 7 points adrift of Flick’s men. While 7 points may seem like a significant gap we must remember that Barcelona play a high line which will be their undoing. It hasn’t stopped them winning the supercopa and Copa del Rey, topping La Liga and reaching the SF of the Champions League.\nIt’s May now and there are only a few games left in La Liga.\nBarcelona have not lost to Atlético or Real Madrid this season but they will be fatigued and exhausted just in time for us to win our remaining games and retain La Liga.\nDo not worry Madridistas. La Liga is far from over.\nUP NEXT.. Celta Vigo at the Bernabeu\nAncelotti will be forced into changed against Celta Vigo. None of the preferred back 4 are available for selection. All 4 are our with injuries. All at the same time. Jesus Vallejo has been little more than a wall flower in Ancelotti’s dressing room this season. It’s almost certain he will not play.\nRodrygo is kept out of the fixture with a bout of sickness forcing a change in Ancelotti’s preferred attack. In midfield, the absence of Camavinga through injury does not really move the needle as Carlo has him in and out of the side when he’s healthy.\nCarlo has waxed lyrical about Arda Guler in recent weeks. Heaping praise on the Turkish youngster with reckless abandon. The key word in all of it is “future”.. The youngster possesses the quality now and will be important in the future. We will see if Arda Guler is given another start or if the future is still a long way off.\nSilly Season & The Inevitable Xabi Alonso\nThe story so far in anticipation of next season is one Xabier Alonso Olano. A favourite of the Bernabeu faithful. While he is loved in the Basque Country, Merseyside and Bavaria.. He’s perhaps loved even more at the Bernabeu. His 5 years in Madrid marked some of the most iconic and historic moments of the club in the 21st century.\nXabi Alonso will be provided with some much needed support from the board. After such a poor season the club cannot be seen to be ignoring deficiencies and throwing a new manager under the bus. Not much is known about how much control Xabi insists upon given the trust shown to him at Leverkusen and the success that has followed.\nRodrygo has been firmly placed in the shop window. Florentino is known to be fond of Rodrygo and it is difficult to see the him pushing Rodrygo out. However, where there is smoke.. There’s heat. It has been my impression that while Rodrygo may be considering a new adventure, Xabi Alonso will be making the final call if it comes down to management.\nWith silly season around the corner.. The rumours continue to flow freely like sewage in the street.\nIt is worth noting that the defence is the oldest part of the squad. The youngest player being Raul Asencio at 23 while the much older Rudiger, Alaba, Carvajal and Lucas Vazquez are all comfortably over 30 and all injured.\nThe club is forced to reckon with the availability of defenders and how to restructure the composition of defenders is the squad.\nThe likes of William Saliba, Dean Huijsen and Jonathan Tah or Hincapie, ranging from very expensive to free agent tell of a desperation to resolve the issues at CB.\nAt fullback the club’s realisation that the two LBs in the squad are not at the level despite extending Ferland Mendy’s stay last season in what must have been an absent-minded act of self-sabotage.. Alvaro Carreras and Milos Kerkez are the expensive options being linked with a move to Madrid.\nMidfield is probably the richest area of the squad and yet the club will be looking as always for ways to improve.\nCarlo Ancelotti’s complaints about efficiency in attack while strange may be tied to a desire to add some depth to the attacking options. This would require a player signing on with the knowledge that the cannot be a starter.\nReal Madrid are turning the page. From one period to the next, the only remedy for failure is the next success.\nThe Daily Poll\nPoll 1\nPoll 2",
  "word_count": 777,
  "scraped_at": "2026-02-14T02:02:47.558657",
  "_text_extracted": true
}