{
  "article_id": "617f107b34ce",
  "url": "https://www.nytimes.com/athletic/5704950/2024/08/17/barcelona-real-madrid-la-liga-new-season/",
  "title": "Are Real Madrid untouchable ? Can Barcelona compete ? Spain big two and a summer of change",
  "date": "20240817T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The new La Liga season kicked off with two matches on Thursday — but now the Spanish league’s traditional big two, Barcelona and Real Madrid, are about to join the party.\nBarcelona begin at Valencia this evening (Saturday), while defending champions Madrid also start away from home — they play Mallorca tomorrow night.\nAdvertisement\nIt’s fair to say there are contrasting moods around the two clubs right now. Barca are looking to make positive progress under new coach Hansi Flick — but their struggles to meet La Liga’s salary limit continue and €60million (£51.2m; $65.5m) new signing Dani Olmo has not actually been registered yet.\nMadrid, who also won the Champions League last season, will be without Toni Kroos in midfield for the first time in a decade following his retirement but they have significantly strengthened in attack — France captain Kylian Mbappe scored his first goal for the club since a summer free-agent move from Paris Saint-Germain in the UEFA Super Cup victory against Atalanta on Wednesday.\nHere, The Athletic Barcelona correspondent Laia Cervello Herrero and her Real Madrid counterpart Mario Cortegana take a look at the season ahead.\nThis Madrid squad looks scarily good. Are they untouchable now?\nMario: Football is not mathematics. There is always room for surprise. But it would be strange to think anyone but Madrid will win La Liga 2024-25.\nAfter an unforgettable season that finished with three trophies (Madrid also lifted the Supercopa de Espana — Spain’s four-team mid-season version of the Community Shield in England), they have added Mbappe and also young Brazil star Endrick. Even with the departures of veterans Nacho and Kroos, the level of the squad is the same or even higher than last term. But Carlo Ancelotti’s squad are short a centre-back — another option there would be useful, with David Alaba yet to return from the serious knee injury he suffered in December.\nAncelotti expects Madrid to concede more goals this season — but the plan is for that to be compensated by a higher offensive output.\nLaia: I don’t see Madrid having any serious competition this year in Spain. Barcelona have other objectives that don’t necessarily involve winning La Liga, realistically speaking. For them, this season is more about building for the future.\nAdvertisement\nThis Madrid side, with Mbappe, Jude Bellingham and Vinicius Junior, remind you of their old galacticos teams. By contrast, ‘Baby Barca’ should be a longer-term project and in the short term I see Ancelotti’s side winning La Liga again. The Copa del Rey gives rise to more surprises as a knockout competition, but there too, and in Europe, you always have to take Madrid into account — even more so this year.\nIt’s hard for me to see another team standing up to a squad like this.\nWhat have been the biggest changes at Barca and Madrid?\nLaia: The most far-reaching one is the swap of Xavi for Flick. Barca sacked the Catalan coach at the end of May and the German has arrived with his own technical staff. Just the goalkeeping coach from last season remains. Also noteworthy is the departure of Sergi Roberto, the club captain, although he had only a secondary role at a playing level by the end.\nIt is another set of coaches and another direction, but the squad has not been drastically improved, apart from the addition of Olmo from RB Leipzig in Germany.\nHe is Barca’s big signing of the summer, but one they turned to after efforts to land his team-mate in Spain’s Euro 2024-winning side Nico Williams of Athletic Bilbao came to nothing. As mentioned, Olmo has not been registered with La Liga yet, as the club’s financial struggles continue.\nGO DEEPER\nBarcelona’s latest plan to fix their finances - the one where caterers help sell the metaverse\nMario: Unlike Barcelona, Madrid has been characterised by stability for several seasons now, with no changes in the management or the bench. However, there have been notable changes in the squad over recent months.\nImportant players have left, both in sporting and symbolic terms, such as Nacho (a 34-year-old defender who spent his entire career at the club, joining them at age 11) and Kroos (who had been there for a decade). There have also been some slightly less significant departures, such as Joselu (the club exercised their option to buy him after last season’s successful loan, before helping his move to Qatar’s Al Gharafa) and Kepa Arrizabalaga (who is now back at Chelsea with his future uncertain after his own loan last season).\nAdvertisement\nMbappe obviously stands out among the arrivals — he signed as a free agent after seven years of soap opera over his on-off signing. But 18-year-old Endrick, a forward who was signed for an initial €35million (£29.8m/$38.5m) plus €25m in potential add-ons, has also raised a lot of hype for his growth at Palmeiras and sparks of quality with Brazil’s senior team.\nWhat do their strongest line-ups look like?\nHere are our writers’ choices — based on everyone in each squad being fit and available.\nWhat would be a success for Barca?\nLaia: At Barcelona, success is always about winning trophies, but realistically — with the squad available to Flick and the club’s wider situation — that feels improbable this season.\nTheir objectives instead should be to compete as best they can with Real Madrid, and to be in the fight for the title until the end of the season, to perform well in the Supercopa de Espana in January and, as they did in 2023-24, reach the quarter-finals of the Champions League. Maybe the Copa del Rey will be their best hope of silverware in what otherwise looks like being a campaign of consolidation.\nWhat would be a success for Madrid?\nMario: I don’t think it’s crazy to say the minimum they have to win is four titles.\nThe first, the UEFA Super Cup, has already been won. Then there’s La Liga, the Champions League, the Copa del Rey and the Supercopa, plus FIFA’s new 32-team Club World Cup — currently scheduled for June and July 2025 in the United States — as well as the inaugural FIFA Intercontinental Cup (the renamed old version of the Club World Cup, involving six teams), scheduled for December.\nMadrid can mathematically win seven trophies this season — so actually winning four would seem a reasonable target. Anything over that would be a milestone.\nWhat about Atletico Madrid? Can they pose a challenge?\nLaia: After this transfer window, they have to go for it. But, without wishing to sound defeatist, I still think they can’t be compared to neighbours Real. The squad the champions have is difficult to beat, so I think Atletico will instead fight with Barca for second place, although the Catalan club have had the better of their recent meetings.\nAdvertisement\nWith the money Atletico have spent, including the €95million signing of Argentina forward Julian Alvarez from Manchester City, they should be contenders for the Copa del Rey at the very least and ought to do well in Europe, having also qualified for the Champions League.\nGO DEEPER\nAlvarez, Gallagher, Guerra and the rest: Can Atletico Madrid afford a €200m summer spend?\nMario: Atletico have strengthened very well, with large and intelligent investment. This, together with more stability than Barcelona and the competitive spirit that coach Diego Simeone is normally capable of transmitting to his sides, puts them closer to or even above Flick’s team as the second candidates for the title.\nMy biggest question is how Simeone will manage to fit all the pieces together and how long it will take to settle on his best team, because these processes are not always easy and there are cases in the past where new signings needed time to settle under the Argentinian.\nWhat is Barca’s biggest problem to fix?\nLaia: The economic issue. Barcelona are still facing a very big financial crisis that is affecting them in many ways. It has prevented them signing as many players as they would have liked to this summer, so they will once again have a small squad full of young players. Until the whole club is on a surer footing, the wise thing would be to solidify this project and give it time and space to grow. That could lead to years of austerity in terms of titles, but Barca must be patient and understand the situation.\nOn a more immediate, sporting, level, there will be problems in the team’s pressing this season if Robert Lewandowski, who turns 36 next week, and Ilkay Gundogan, 34 in October, are on the pitch together. Neither presses hard when the team lose the ball and that could be a problem for Flick, a coach who asks that of his players.\nWhat is Madrid’s biggest problem to fix?\nMario: With Nacho gone and Alaba out until at least November, the biggest threat is what Madrid may suffer in defence. They only have two elite centre-backs available — Eder Militao and Antonio Rudiger. For now, their No 3 centre-back will be Aurelien Tchouameni, a midfielder.\nAny further injury would greatly complicate the planning in this area, which is a big risk even with the best goalkeeper in the world behind them in Thibaut Courtois. After his return at the end of last season, following two knee surgeries, the Belgian kept six clean sheets in as many games.\nAdvertisement\nWhat’s the most exciting thing about Madrid right now?\nMario: Nobody will be surprised by my answer: Mbappe. After such a long wait, there is a lot of curiosity and excitement to see how the Frenchman performs for Madrid. His debut was promising, with a goal in the UEFA Super Cup win.\n☝️ ¡El primer gol con el @RealMadrid nunca se olvida!@KMbappe | #6SuperCups pic.twitter.com/WZxRGjH5EA\n— Real Madrid C.F. (@realmadrid) August 14, 2024\nThere is also a lot of interest in Endrick, the latest young talent in the club’s successful recruitment policy.\nAnd, along those lines, the growth of Arda Guler will be one to keep an eye on. Weighed down by injuries and, to a lesser extent, by a lack of daring on the part of Ancelotti, who is nevertheless taking good care of him, his first season in Madrid wasn’t easy. But the 19-year-old was able to show his potential in the last month of club competition and then at Euro 2024, excelling for Turkey.\nWhat’s the most exciting thing about Barcelona?\nLaia: The ‘Baby Barca’. And that includes the continuing development of 17-year-old Lamine Yamal, a player destined to mark an era as long as injuries respect him. Barcelona have a very good generation of young players coming through and their greatest hopes must be built around them.\nBeyond Yamal, it will be interesting to see whether in Marc Bernal or Marc Casado there is a Sergio Busquets replacement, and to see how Pau Cubarsi and Hector Fort evolve.\nHow do their squads compare?\nAn explainer on the graphics below:\nTwenty First Group is a sports intelligence firm that advises clubs, leagues and investors, and its player model generates ratings for over 145,000 players worldwide across 250 competitions. These ratings are calculated based on factors such as the strength of a player’s team, their position, their playing time, and their contribution towards their team’s attack or defence.\nAnalysing the distribution of these ratings weighted across the past nine months, we can compare Real Madrid and Barcelona. The boxplot graphics below show the spread of ratings, with the white line reflecting the average player rating in the squad, with most of its members falling within the middle 50 per cent of the group (shown by the box).\nWhat’s the likelihood of Real Madrid success?\nThe table below reflects the findings of data provider Opta’s ‘super computer’ and its probability model based on 10,000 simulations of how the 2024-25 La Liga season will pan out. (Users on the app or on a mobile device may need to swipe across to see the full table).\n(Top photos: Getty Images)",
  "word_count": 2009,
  "scraped_at": "2026-02-14T01:51:48.875502",
  "_text_extracted": true
}