{
  "article_id": "619c7447b901",
  "url": "https://www.fourfourtwo.com/competition/is-leeds-vs-chelsea-on-tv-live-streams-watch-online-as-elland-road-welcomes-a-favourite-old-foe-in-the-premier-league",
  "title": "How to watch Leeds United vs Chelsea : Live streams , TV details",
  "date": "20251203T194500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nWatch Leeds United vs Chelsea today as Leeds lean on the twelfth man in the quest for three points. FourFourTwo brings you all the details on live streams and TV channels, wherever you are in the world.\n• Date: Wednesday, 3 December 2025\n• Kick-off time: 8:15pm GMT / 3:15pm ET\n• Venue: Elland Road, Leeds\n• TV & Streaming: Sky Sports (UK), Peacock (US), Stan Sport (Australia)\n• Watch from anywhere: Get NordVPN's Cyber Monday deal\nIt's rarely dull when Leeds United and Chelsea lock horns, and this famous old rivalry between north and south resumes at Elland Road.\nWith Brighton & Hove Albion and Aston Villa meeting elsewhere, Chelsea could find themselves needing at least a point to hold on to third place.\nRead on as FourFourTwo brings you all the information on how to watch Leeds vs Chelsea online, on TV, and from anywhere.\nIs Leeds United vs Chelsea on TV in the UK?\nLeeds United vs Chelsea will be shown live in the UK as part of a packed-out midweek programme on Sky Sports.\nThe Blues' visit to West Yorkshire will be broadcast live on Sky Sports Premier League as well as via Sky Go and the Sky Sports+ app.\nIf you're outside the UK when the game is on, you can use NordVPN to access your usual coverage.\nWatch the Premier League on Sky Sports\nWith more games than ever this season (215 in the Premier League and heaps more in the EFL), Sky Sports has a strong offering for football fans in the UK. It's yours for £35 a month on a two-year plan that will include their new multi-view streaming and a Netflix sub. For those not wanting to commit long-term, NowTV offers Sky Sports channels on daily or monthly passes.\nWatch Leeds United vs Chelsea in the US\nLeeds United vs Chelsea is one of this week's games available to stream live in the United States on Peacock.\nWatch the Premier League on Peacock\nPeacock has had a price rise ahead of the new season, but with half of all Premier League games streaming live, it's still a decent investment for soccer fans, with plenty of content beyond that, too. $10.99 is the new monthly starting price.\nHow to watch Leeds United vs Chelsea in Australia\nPremier League fans in Australia can watch Leeds United vs Chelsea through Stan Sport.\nWatch the Premier League on Stan Sport\nWant every single Premier League live stream in one place, plus the Champions League? At AU$32 per month, Stan Sport is a steal for football fans down under. Just add the Stan Sport package to the base Stan plan and you'll be streaming the action within minutes.\nIs there a Leeds United vs Chelsea free live stream?\nThere are no dedicated free-to-air broadcasters showing the game but you may be able to watch Leeds United vs Chelsea by signing up for a free trial.\nAmazon Prime Video is currently offering a seven-day free trial of Peacock Premium Plus for users in the US. You can sign up, watch the game, and cancel if you don't think you'll get any lasting value from the offering.\nWatch Leeds United vs Chelsea from anywhere\nAway from home right now? You don't have to miss the game. The solution to your geo-restriction nightmares is a Virtual Private Network (VPN), a piece of software that can set your devices to appear to be in any country in the world.\nYou can use a VPN to unblock your usual streaming services while abroad, allowing you to connect and watch as if you were back home. You'll also get better playback quality and it will do wonders for your internet security – result!\nFourFourTwo’s tech-obsessed office-mates over at Tom's Guide know everything there is to know about VPNs, and they rate NordVPN as the best VPN you can buy. And there's a Cyber Monday deal too!\n🥇 World's best VPN service\n✅ Fast, secure, huge location list\n➕ 3 months extra FREE\nSee also ► Premier League TV guide\nLeeds United vs Chelsea: Premier League preview\nLeeds have lost their last four league fixtures and are now in the relegation zone after 13 games. They started the season in better shape than the last six promoted teams, if nothing else, but they need to dig out a result somewhere and soon.\nThey very nearly did it at Manchester City on Saturday. Goals from Dominic Calvert-Lewin and Lukas Nmecha saw them come back from two goals down only to concede a Phil Foden winner in stoppage time.\nBut Daniel Farke won't be saved by nearly. Buoyed by Leeds' resilience at the Etihad Stadium, he will believe they can get something at home against Chelsea.\nThey've won just one of their last nine league meetings with the Blues but a victory this week would balance the historic record between the two.\nChelsea will be without midfielder Moises Caicedo against Leeds. He is serving a suspension after his sending off against Arsenal on Sunday but the absentee list is rather short by Chelsea's standards this season.\nAs Enzo Maresca's team have returned to something approaching full strength, long-term injuries aside, they have put together a decent run of form to climb the table in the Premier League and keep themselves in the all-important top eight in the Champions League.\nTheir last defeat in any competition was against Sunderland at the end of October, since which they've won five out of seven games.\nAn impressive performance with ten men against Arsenal should be all the encouragement they need to determinedly keep that run alive.\nSee also ► These are the cheapest ways to watch the Premier League this season\nLeeds United vs Chelsea: Expected line-ups\nFourFourTwo's prediction\nLeeds United 1-3 Chelsea\nFourFourTwo predicts that Chelsea will have a clinical edge that Leeds do not, but the game might feel closer than the scoreline suggests.\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1242,
  "scraped_at": "2026-02-14T02:28:55.394870",
  "_text_extracted": true
}