{
  "article_id": "61af0aba9c22",
  "url": "https://www.themag.co.uk/2024/12/they-have-already-got-a-carabao-cup-final-between-arsenal-and-liverpool-pencilled-in-newcastle-united/",
  "title": "They have already got a Carabao Cup Final between Arsenal and Liverpool pencilled in",
  "date": "20241220T114500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "They have already got a Carabao Cup Final between Arsenal and Liverpool pencilled in\nThe Carabao Cup semi-final draw was slightly delayed yet again and so I decided to pour myself another single malt in anticipation.\nI wasn’t bothered who Newcastle were drawn against in the semi finals.\nI’d even went as far as to suggest that I would have embraced a two-legged tie against Premier League leaders Liverpool.\nEarlier in the evening, Ange Postecoglou’s Spurs had almost conspired to throw a 3-0 lead away at home to a mediocre Manchester United team.\nThey eventually prevailed 4-3 after some calamitous goalkeeping at both ends.\nThe numbers of the balls for the semi final draws were;\n1. Arsenal\n2. Liverpool\n3. Newcastle United\n4. Spurs\nThe two Jamies, Carragher and Redknapp, were doing the draw, and I generally have no time whatsoever for either of these two.\nCarragher was to draw the home teams for the first legs and straight away I got a decent feeling when he pulled out ball number 1, Arsenal.\nC’mon I was thinking, make it us. I took a sip of my dram and waited as Redknapp plunged his mitt into the bowl and juggled the remaining three balls about.\nEventually out it came, number 3, Newcastle United.\nGet in you beauty. I had so wanted to play the first leg away and have home advantage at St James’ Park for the deciding second leg.\nTottenham were then drawn at home for the first leg of their semi against Liverpool.\nI bet the organisers of the competition were delighted that Arsenal and the Red Scousers had avoided one another.\nI received a message in the early hours from one of my mates who is living abroad.\nJohn is Newcastle United daft and it really gets his goat up the way the international media drum up the likes of Arsenal and Liverpool.\nAccording to him, some of the outlets he listens to have already got a Carabao Cup Final between Arsenal and Liverpool pencilled in.\nWell that suits me fine and will also sit well with Eddie and the boys in their quest for a return to Wembley.\nArsenal and Liverpool are two of the fancied teams in the EPL title race and the Champions League, those are their main priorities.\nThese competitions running alongside their respective two legged semi-finals against us and Spurs.\nAnyhow, back to us drawing Arteta’s Arsenal. Are they really as good as some of the media and pundits would have us believe?\nI personally don’t think they are, not if you look carefully at some of their results this season.\nThey have some excellent and exciting players in the likes of Odegaard and Saka, however, they don’t have a reliable striker who regularly delivers the goods.\nThey’ve been trying to unsettle our own Rolls Royce of a front man Alexander Isak for what is approaching a year now.\nArsenal’s manager Mikel Arteta is the biggest sulk and whiner in the EPL. This is one of the main reasons Newcastle fans dislike the Gunners, now more than at any other time in the past (nobody will quickly forget last seasons pathetic shenanigans after Newcastle’s 1-0 victory over Arsenal at Gallowgate).\nOf course, there is also the self entitlement of their fanbase. It’s really irked them that they have lost out in the title race to Manchester City for the last two seasons.\nI think it comes from the days of Arsene Wenger’s Invincibles, that Arsenal fans think they have a divine right to be Champions.\nThe same Monsieur Wenger who the spoilt fans hounded out of their football club after two decades of unprecedented success.\nAs the only ‘non-septic’ team left in the Carabao Cup, Newcastle should be able to approach the remainder of our games in this season’s competition confidently and under less pressure than the others.\nIt would be a much bigger surprise if Spurs overcome Liverpool in the other semi final than us turning over Arteta’s Gunners.\nRoll on Arsenal at the Emirates and in the meantime, it will be great if the Toon can chalk up some valuable wins in the league.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 707,
  "scraped_at": "2026-02-14T02:08:26.308851",
  "_text_extracted": true
}