{
  "article_id": "61c0bc3c9ec2",
  "url": "https://www.fourfourtwo.com/person/player/the-2007-champions-league-final-was-a-missed-opportunity-for-liverpool-that-milan-defeat-still-hurts-me-today-bolo-zenden-on-his-huge-anfield-regret",
  "title": "  The 2007 Champions League Final was a missed opportunity for Liverpool . That Milan defeat still hurts me today  Bolo Zenden on his huge Anfield regret",
  "date": "20260207T151500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘The 2007 Champions League Final was a missed opportunity for Liverpool. That Milan defeat still hurts me today’ Bolo Zenden on his huge Anfield regret\nLiverpool came up short against Milan in the 2007 Champions League final, two years after the Miracle of Istanbul\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nBolo Zenden enjoyed an 18-year top-flight career which saw him play at the highest level in the Netherlands, Spain, France and England.\nThe talented midfielder earned league titles with PSV and Barcelona before his 2001 move to the Premier League, where he enjoyed stints with Chelsea, Middlesbrough and Liverpool.\nHis time in England, however, was often a tale of injuries and near misses.\nBolo Zenden on his Chelsea and Liverpool regrets\nZenden was signed by Chelsea for £7.5million in the summer of 2001 and would score his first goal for the Blues just nine minutes into his debut against Newcastle United.\nBut he soon picked up his fair share of injuries, meaning his two-season stay at Stamford Bridge was often a stop-start affair.\nGet VIP Liverpool tickets HERE with Seat Unique!\nSeat Unique tickets at Anfield offer a fantastic matchday. You get premium padded seats in the new Anfield Road stand (Block AM5, front rows) and access to the Brodies Lounge for three hours pre-match. Enjoy street food, a complimentary half-time drink, a matchday programme, and entertainment, including a Liverpool legend appearance, making it a truly elevated experience.\n“I suffered a nasty thigh laceration, which is pretty rare, in a League Cup tie with Spurs – a tackle from Teddy Sheringham – and was out for four months,” the Dutchman recalls to FourFourTwo.\nZenden would spend the 2003/04 season on loan at Middlesbrough, where he would score the winner in Boro’s League Cup success over Bolton, before joining the team on a free transfer in 2004.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nA year later, he would join Liverpool on a free, only to suffer more bad injury luck.\n“Then in my first season at Liverpool [2005/06], I damaged my cruciate knee ligaments in a Champions League game against Real Betis,” he continues. “The day the squad flew to Japan for the Club World Cup, I was heading to the US to get my ACL done.”\nHis Reds team-mates were at the Club World Cup following the Miracle of Istanbul win over Milan, which came shortly before Zenden’s arrival.\nThe 54-time Netherlands international was then part of the side that faced Milan in a Champions League final rematch two years later, only for the Reds to come up short, handing Zenden another of his toughest career moments.\n“Everyone recalls the win over them in Istanbul two years earlier, but this was the one I remember for all the wrong reasons,” he admits.\n“People say semi-finals are the toughest losses to take, but I disagree – losing finals are the real sickeners because you’re really, really close. The greatest prizes of all are the World Cup, the Euros and the Champions League. All the top players set their sights on winning at least one and I came closest in the latter.\n“I’m proud to have reached a final, but do you know something? That Milan defeat still hurts me today. It was a missed opportunity.”\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 788,
  "scraped_at": "2026-02-14T01:59:36.841973",
  "_text_extracted": true
}