{
  "article_id": "621b989767ee",
  "url": "https://www.teamtalk.com/manchester-city/record-breaking-lenghts-keep-erling-haaland-man-city-two-clubs-kylian-mbappe-plan",
  "title": "Man City go to record - breaking lengths to keep Erling Haaland from two Euro giants after Kylian Mbappe plan emerges",
  "date": "20230326T143000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City go to record-breaking lengths to keep Erling Haaland from two Euro giants after Kylian Mbappe plan emerges\nManchester City are preparing to offer Erling Haaland an astronomical amount of money as part of a new contract to prevent him from joining one of two European heavyweights, according to a report.\nHaaland joined City from Borussia Dortmund in a £51million deal last summer. City fans were expecting a lot from the striker after he bagged 86 goals in 89 appearances for the German outfit.\nHaaland has more than lived up to his reputation, scoring an incredible 42 goals in just 37 matches for City so far. He has broken a plethora of records, including the most league goals scored by a City player in a single season (previously held by Sergio Aguero), the fastest player to reach 10 Prem goals (six games) and the youngest player to reach 30 Champions League goals (beating Kylian Mbappe’s feat by 116 days).\nHaaland will be hoping to beat the record for most amount of goals in a 38-match Prem season, which is currently held by Mo Salah (32). Haaland is on 28 goals so far and has 11 games left to surpass Salah’s achievement.\nIt seems the only thing that can stop the Norwegian right now is injury. He has had to pull out from international duty after sustaining a groin problem. His father Alfie admits it is ‘touch and go’ whether he will be fit to play Liverpool on Saturday April 1.\nCitizens supporters, along with manager Pep Guardiola, will be hoping it is a minor problem and that Haaland will return to the starting lineup soon. Liverpool, of course, would rather face City without their main attacker.\nInjury is not the only issue surrounding Haaland that City are having to deal with at the moment. Both Real Madrid and Paris Saint-Germain have been tipped to make big-money moves for him.\nThe 22-year-old has a €200m (£176m) release clause that activates in summer 2024. There have been suggestions that Real could sign both Haaland and Mbappe to create the deadliest attack in world football.\nMan City aim to ‘kill off’ Erling Haaland exit talk\nBut according to The Sun, City have no intention of letting their star man go anytime soon. Club chiefs are hoping to ‘kill off’ any talk Haaland could leave the Etihad by giving him a huge pay rise.\nHaaland’s current contract is worth £375,000 a week and runs until June 2027. He is the Premier League’s joint-highest earner alongside City team-mate Kevin de Bruyne and Manchester United goalkeeper David de Gea.\nBut City are preparing to offer him a one-year extension on that deal, as well as a new salary worth an eye-watering £500,000 per week.\nThis would make Haaland the best-paid player in City history, as well as the highest earner in English football.\nThe Sun reveal that Haaland is very happy at City and has no plans to push for a transfer. Nevertheless, the reigning English champions are eager to send a ‘hands off’ message to Real and PSG.\nCity believe Haaland will follow Julian Alvarez’s lead by quickly agreeing fresh terms. Earlier this month, Alvarez signed a new City deal which should keep him at the club until June 2028.\nMeanwhile, Sunday’s Transfer Gossip claims Leeds United are interested in landing a City outcast.",
  "word_count": 566,
  "scraped_at": "2026-02-14T01:48:06.474104",
  "_text_extracted": true
}