{
  "article_id": "623572e331c6",
  "url": "https://www.teamtalk.com/newcastle-united/eddie-howe-sack-newcastle-boss-in-precarious-position-three-game-warning-arrives-pif-jose-mourinho",
  "title": "Eddie Howe sack : Newcastle boss in  precarious position  as three - game warning arrives amid new Mourinho links",
  "date": "20231228T130000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United\nPremier League • England\nEddie Howe sack: Newcastle boss in ‘precarious position’ as three-game warning arrives amid new Mourinho links\nPressure is seriously starting to build on Eddie Howe amid growing speculation he is in danger of the Newcastle sack and after it was claimed their run of form had left him in a precarious position at St James’ Park and amid fresh Jose Mourinho rumours.\nThe appointment of the 46-year-old back in November 2021 has proved a masterstroke by PIF and one of their best pieces of business since their ownership of the Black and Whites began. Under Howe, Newcastle have been transformed from a club staring relegation in the face, to one competing in the Champions League in just over 18 months.\nUnfortunately, their UCL campaign ended in bitter disappointment as the club suffered three defeats in their six matches to finish bottom of what was branded this season’s Champions League Group of Death. And being left without any European football of any form was certainly a tough pill for Newcastle and their ambitious owners to swallow.\nBut it’s not just in the Champions League where Newcastle have struggled and eight defeats in their last 12 games in all competitions has seen the Magpies slip to eighth in the Premier League.\nOf course, there are mitigating circumstances for their struggles with their squad utterly ravaged by a string of injuries that would challenge the biggest and best squads in the world game.\nBut with their big summer signing Sandro Tonali also having to serve a lengthy suspension for breaches of betting regulations from his time in Serie A, it’s really underlined what has proved a hugely difficult for season for Howe.\nUnfortunately, however, sympathy only goes so far in football and speculation is beginning to mount that Howe may soon be facing the sack.\nREAD MORE: Eddie Howe sack incoming after Newcastle slump to embarrassing defeat with Liverpool, City waiting\nEddie Howe sack talk grows as Newcastle boss is ‘given three games’\nWith the screw now being firmly turned, Howe is currently the third favourite Premier League manager to be next to lose their job. But while that might not sound too great an immediate threat – Erik ten Hag and Roy Hodgson are ahead of him – pressure is, most certainly, beginning to build.\nAnd in an article in The Guardian on Thursday morning, they claim the recent slump ‘leaves Howe in a precarious position’.\nExplaining why being below another ‘crisis club’ Manchester United in the Premier League ‘cannot be a good sign’ the article reflects on the small smattering of boos that rang out at St James’ Park following the shock 3-1 home defeat to Nottingham Forest on Boxing Day.\nStating that while it is ‘not quite a crisis yet, there is definitely potential crisis in the air’.\nThey also claim that the next three games could be pivotal in deciding on Howe’s future.\nBut the fixtures do not get any easier for a manager who has done his best to deflect attention away from his future, with a trip to Liverpool coming in New Year’s Day and Manchester City at St James’ Park in the Premier League sandwiching a crunch FA Cup third-round trip to energised neighbours and arch-rivals Sunderland.\nDefeat in all three games – not a totally impossible scenario given their current struggles – would leave Howe in serious jeopardy.\nAnd as The Guardian puts it, a loss at the Stadium of Light would ‘echo through the generations’.\nConversely, the article notes that Howe is not coming under fan pressure yet, while their Saudi owners PIF have been surprisingly sensible and conservative in their decision-making so far.\nJose Mourinho to replace Eddie Howe at Newcastle?\nNonetheless, they also note that defeat in the next three games could well change the tone and a run of 11 losses in 15 would not look good on anyone’s CV.\nWith Newcastle chairman Yasir Al-Rumayyan having ambitious plans of turning Newcastle into one of the Premier League and European elite, his ownership has hit its first bump in the road and a decision over Howe set to test his loyalty to the 46-year-old, who still boasts an impressive 48.04% win percentage rate since taking charge.\nHowever, speculation that Mourinho – currently nearing the final six months of his Roma deal – is next in line refuse to go away.\nIndeed, they have near enough dogged Howe since the moment he took charge at St James’ Park.\nAmid that speculation, Mourinho recently spoke out on his Roma future, though was keen to play down claims he could be tempted by a move away and in particular the Newcastle job.\n“I will tell you something I have not yet said, because I did not want to say it. I want to continue at Roma. I want to continue here. If I continue at Roma, we need to really think about what we can do with the FFP limitations,” he stated, before going into the complexities of why life at the club can be difficult.\nIn reality though, Mourinho and Newcastle appears like a match made in heaven; the big-name manager PIF crave to help take the club to the next level.\nThe final word should perhaps go to The Guardian who claims that if these next three games go badly, PIF will be asking whether Howe is really the manager to turn their investment into trophies.\nDON’T MISS: Newcastle identify Barcelona star for January swoop as Eddie Howe seeks defensive reinforcements",
  "word_count": 924,
  "scraped_at": "2026-02-14T02:13:24.767353",
  "_text_extracted": true
}