{
  "article_id": "623fb475a2a2",
  "url": "https://thepeoplesperson.com/2025/04/12/manchester-uniteds-best-starting-xi-without-injuries-opinion-292842/",
  "title": "Manchester United best starting XI without injuries - opinion - Man United News And Transfer News",
  "date": "20250412T213000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bilbao or bust.\nManchester United’s last chance of salvaging success in an otherwise abysmal season for the club lies in the Europa League with the competition’s final set to take place at Athletic Club’s Estadio de San Mamés in Bilbao.\nVictory in Spain would add another trophy to Old Trafford’s glittering cabinet but, more importantly, it would grant first-seed qualification into next season’s Champions League and the array of financial benefits Europe’s elite tournament provides.\nUnited are braced for a comprehensive overhaul of Ruben Amorim’s first-team squad this summer as the club’s executive branch seeks to help the Portuguese coach mould his new team into his trademark 3-4-2-1 system.\nAt a minimum, reinforcements are needed in the number nine and ten positions with the Red Devils on track, by a considerable margin, to register their lowest scoring season in Premier League history. Neither of these roles will be cheap to provide upgrades in.\nAdditional recruits are also likely to be wanted by Amorim in central midfield and the wing-back positions, while the long-term injury to Lisandro Martinez may make another left-side centre-back an unexpected priority.\nBut with the club’s finances severely constrained by the acute pressure of Premier League’s profits and sustainability rules (PSR), United’s ability to provide the funds for this array of signings will be limited. This would be significantly altered by qualification for the Champions League next season, however.\nThe huge economic boost victory in Bilbao would provide off the pitch is almost, therefore, invaluable to the club’s fortunes on it next season.\nThe Road to the Final\nBefore the Europa League final can be considered, however, United must still progress through the quarter-final and semi-final stages.\nThe first-leg of the quarter-final took place on Thursday at the Groupama Stadium against Lyon. A tense match finished 2-2 with a last-minute equaliser for the French side, courtesy of an Andre Onana mistake.\nEarlier in the game, the Cameroonian goalkeeper had made an even bigger howler to put Lyon 1-0 up, mirroring his dreadful performances in Europe last season.\nUnited had clawed their way back into the game with subsitute Joshua Zirkzee scoring in the 88th minute to put the Reds 2-1 up, only for the inept hand of Onana to intervene at the death.\nThe reverse fixture will take place next week in Manchester with the teams on level terms. Should United emerge victorious at Old Trafford, it would set up a semi-final clash with either Athletic Club or Rangers, who drew their quarter-final first-leg 0-0 at Ibrox.\nThe other side of the draw contains Lazio and Bodo/Glimt – the Norwegian side being 2-0 up going into the second-leg – and Tottenham Hotspur and Eintracht Frankfurt, who also drew their first-leg.\nSpurs feel the most likely side to make the final in Bilbao from this selection but the London club’s innate propensity for self-sabotage means nothing can be ruled out.\nUnited should feel confident facing off against any of these sides in the final, however, if Amorim settles on his best starting eleven now that his squad is now (or soon to be) largely free of injury.\nThe Best XI to Win in Bilbao\nInjuries have meant United’s head coach has largely been unable to rely on the full breadth of his dressing room since arriving from Sporting CP in November.\nInjured Returnees:\nLong-term absentees Mason Mount and Luke Shaw, who have now both returned, are likely to feature prominently in Amorim’s mind given their suitability to his system, having both previously thrived in a three-at-the-back system for Chelsea and England respectively.\nShaw would provide a significant improvement at left wing-back over Patrick Dorgu, who is still finding his feet since arriving from Lecce in January.\nThe 29-year-old defender’s body would undoubtedly be able to handle the rigours of the physically demanding position across an entire season but, given United’s sole focus is Europe with the Premier League campaign a write off, Shaw would only have to play four games at LWB to help his side to victory in Bilbao.\nSimilarly, Mount would offer a much better option in the attacking midfield position than the current options Amorim has been forced to rely upon, with the Englishman’s best season in a Chelsea shirt coming in the exact same system under Thomas Tuchel.\nOn the right-hand side, Ivorian winger Amad has been a rare bright spot for United fans with his potent pairing of industry and skill standing him in direct contrast to many of his teammates this season (looking at you Marcus).\nBut a serious ankle injury in early February had looked to have ruled Amad out for the remainder of the campaign after the 22-year-old required surgery for the issue. However, an unexpectedly fast recovery has put the winger on course for a return to action by the beginning of May – around the exact date of the first-leg of the Europa League semi-final.\nAmad would offer a massive improvement to United at right wing-back where neither Diogo Dalot or Noussair Mazraoui have been able to provide the attacking threat of their younger teammate. With Shaw and Mount stationed on the left, and Amad backing up a player like Garnacho on the right, United’s attack would radically improve without sacrificing much defensive stability.\nAll three players, if they can stay/get fit, walk straight into United’s starting XI, given the obvious technical upgrades they offer. But Amorim must not simply rely on obvious decisions; the Portuguese coach will also have to employ a ruthless streak and remove certain players who are hindering the team, even if they are popular in the dressing room.\nDropping Underperforming Stars:\nOnana single-handedly (with the help of his foot) snatched a draw from the jaws of victory against Lyon. It’s not the first time the erratic shot stopper has done this and it will not be the last. His goalkeeping fundamentals are poor and lend themselves to the type of mistakes he made on Thursday evening.\nA sense of nervousness spreads through a defence like an infection when the unit cannot rely on the player behind them. Onana is patient zero for this defensive fragility and quarantine is the only antidote. Objectively, the 29-year-old should be sold in the summer, but the financial realities at Old Trafford make this difficult.\nSir Alex Ferguson once remarked about a goalkeeper when deciding whether to drop his underperforming number one, Jim Leighton, for a cup final: “When there’s doubt, there’s no doubt.”\nThere is serious doubt over Onana’s performances in goal meaning the legendary Scot would be in no doubt he needs to be replaced. Amorim must recognise this and opt for Turkish international Altay Bayindir in his stead.\nSimilarly, the performances of Rasmus Hojlund have reached such a painful nadir that his coach must simply remove him from the firing line, for his own good as well as the team. The 22-year-old Dane’s profile as a striker is closer to what Amorim wants up front than teammate Joshua Zirkzee – a direct number nine who looks to constantly get in behind the defence – but the Dutch international has to start in place of Hojlund.\nZirkzee’s strengths lend themself more to a number ten than a number nine, as recognised by Amorim earlier in the season, but the 23-year-old still offers a dramatic improvement over Hojlund in terms of link-up play and presence up front. The effect on United’s performance against Lyon when the two strikers swapped in the second-half was stark.\nAmorim must compromise on his ideal profile of striker to reach the final in Bilbao in order to secure the financial means to then target that new forward in the summer. Zirkzee is the only means to achieve this, not Hojlund.\nElsewhere, the only other alteration the Portuguese coach must make is to revert to deploying Bruno Fernandes as a central midfielder, with Mount taking his place in the front three.\nUnited’s captain has been talismanic since Amorim arrived at Old Trafford but he is best positioned at the heart of the 3-4-2-1 system, rather than further forward where his lack of speed and agility hinders his performances, and the team suffers without his progressive abilities from deep.\nThis would mean dropping either Casemiro or Manuel Ugarte – the starting pivot against Lyon – despite the improved performances of the former Real Madrid man in recent months.\nUgarte, 23, offers a much higher level of work-rate and physicality than his Brazilian elder, despite being more limited on the ball. But the inclusion of Fernandes in the midfield would balance this out and enable Ugarte to solely focus on the defensive side, harassing the opposition midfield like a heat-seeking missile for the ball.\nIn conclusion, the combination of welcoming back injured players and dropping underperforming ones, means United’s best starting eleven – the one most likely to win the Europa League – is as followed:\nBayindir\nMazraoui De Ligt Yoro\nAmad Ugarte Fernandes Shaw\nGarnacho Mount\nZirkzee\nWith Amad still a few weeks away from a return to the first-team, Diogo Dalot can take the Ivorian’s place at RWB on Thursday in the second-leg against Lyon.\nBut should United emerge victorious from the quarter-final decider, this starting eleven must be the one Amorim aims for in the semi-final first-leg on May 1. The path to Bilbao, and Champions League football, relies upon it.\nFeatured image Michael Regan via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 1571,
  "scraped_at": "2026-02-14T02:02:35.581550",
  "_text_extracted": true
}