{
  "article_id": "6247f4c922d0",
  "url": "https://www.justarsenal.com/who-agrees-that-trossard-has-been-the-key-for-arsenal-in-our-super-run-since-the-new-year/360533",
  "title": "Who agrees that Trossard has been the key for Arsenal in our super run since the New Year ? ",
  "date": "20240220T210000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Micah Richards calls Leandro Trossard “Outstanding”\nEx Manchester City defender Micah Richards has recently come out in all applause for Arsenal’s Leandro Trossard after his recent performances in the red and the white. Since joining Arsenal Trossard has made a huge impact on and off the pitch and just seems to be getting better and better under the leadership of Mikel Arteta and his staff.\nRichards was recently speaking on ‘The Rest Is Football’ podcast shortly after Arsenal’s win against Burnley on the weekend and said this about Arsenal’s Belgian winger/striker “You know who has been key for them with important goals? Trossard”.\n“He probably doesn’t get in everyone’s starting 11 when everyone is fit, and Jesus is playing well and Martinelli and Saka are playing as they are now, but he just brings something different to that team with his runs in behind. Coming to the ball to link up. And then in front of goal he is clinical”.\n“I knew he was a good player at Brighton but he has really come to Arsenal and fitted in straight away. To have that from the bench has been outstanding for him and when he starts, he’s been brilliant”.\nAnd for me, I can’t agree more, Trossard has be unreal since joining Arsenal from Brighton and although I personally think we should have been playing a bit more, when he has played he’s constantly been a stand out player.\nNot only does he get on the score sheet and create assists and chances, he brings so much energy to the squad and with Gabriel Jesus being out injured recently, he’s really stepped up for the team and has made the squad click a lot better.\nTrossard has not only been great in the league but also has looked on form in The Champions League, scoring 2 goals and an assist and also scoring a massive 7 goals and assist in the Premier League. He brings so much more to the team than goals though and has looked to have settled in perfectly with the Gunners and could be a massive part of the future of this team.\nArteta clearly trust him and can see that quality he brings to the side and although he’s only been starting recently because Jesus has been injured, I think that could change quickly as we look like a more complete team when he’s playing. He’s versatile and can play in multiple positions giving us mor options when and if we need them.\nWhat’s your thoughts Gooners?\nDaisy Mae\nWhat is your TOP TEN Arsenal players of the Decade? – Watch the latest COUCH COACH PODCAST with Bjorn &Dean and listen to their choices\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 473,
  "scraped_at": "2026-02-14T01:51:19.054167",
  "_text_extracted": true
}