{
  "article_id": "625ee4fa7578",
  "url": "https://dailypost.ng/2023/10/06/england-manager-gareth-southgate-makes-promise-over-arsenals-saka/",
  "title": "England manager , Gareth Southgate makes promise over Arsenal Saka",
  "date": "20231006T101500Z",
  "domain": "dailypost.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nEngland manager, Gareth Southgate makes promise over Arsenal’s Saka\nEngland manager, Gareth Southgate has promised he will take no risks with Arsenal star Bukayo Saka’s fitness during the upcoming international break.\nSaka is a doubt for Arsenal’s Premier League clash against Manchester City this weekend at Emirates.\nThe 22-year-old was forced off in the first half of Arsenal’s 2-1 defeat to Lens in the Champions League on Tuesday night.\nSaka has been hampered by an Achilles injury since the end of last season, while Arsenal manager Mikel Arteta has been accused of overplaying the winger after he was substituted late on in the 4-0 win against Bournemouth last weekend.\nThe forward has been included in England’s squad for their friendly against Australia and the Euro 2024 qualifier against Italy later this month, but Southgate is adamant that he will take no chances with Saka’s injury concerns.\n“I can only go via what Mikel has said about the last few games,” Southgate said as quoted by Football London.\n“He is in contention for the weekend, so we’ve obviously got a very important qualifier. We look after the players as well as any country.\n“We only have 10 matches a year. And there’s been times when… Bukayo, for example, we haven’t always played. But there are certain key games where, if it is possible to have your best players, then you do want to have them.\n“So we’ve got that responsibility of qualifying for the country but, I have been a player. I have never ever taken a risk on a player’s physical wellbeing. And nor would I.”",
  "word_count": 267,
  "scraped_at": "2026-02-14T02:00:57.112476",
  "_text_extracted": true
}