{
  "article_id": "62933a8bd6fe",
  "url": "https://www.bbc.com/sport/football/articles/c2lnkd7r2y1o",
  "title": "Man Utd v Twente : Ten Hag criticises mentality - but is there improvement at Old Trafford ? ",
  "date": "20240926T051500Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Twente wanted it more' - so are Man Utd showing any improvement?\n- Published\nIs it one step forward and two back for Erik ten Hag and Manchester United?\nAfter bouncing into the summer on the back of an FA Cup final victory, a show of support for the manager and more money spent on new signings, there was a distinct air of optimism around Old Trafford when the new campaign began.\nYet just seven games in, familiar noises are starting to come out of Old Trafford to explain away below-par results.\nA smattering of boos at the final whistle of the Europa League draw with Dutch side Twente does not suggest a mutinous mood in the stands exists just yet.\nBut to hear manager Ten Hag agreeing with Christian Eriksen’s post-match assessment of the 1-1 outcome - that Twente \"wanted it more\" - does not bode well.\n\"It was far from good enough,\" said Eriksen. \"They looked like they wanted it more – that can't be right.\n\"We didn't lose but it feels like a loss.\"\nIncluding their penalty shootout defeat to Manchester City in the Community Shield, Ten Hag's men have won just three of their first eight games of the campaign - fewer at this stage than in either of the manager's two previous seasons.\nThey have drawn twice and lost three games, yet they have at times showed more defensive solidity. So are United showing any improvement under the Dutchman?\nA plane crash, fireworks disaster & car tragedy - how Twente shaped Ten Hag\n- Published25 September 2024\nPeople have to trust me over Rashford - Ten Hag\n- Published24 September 2024\n'Ninety-nine per cent is not good enough'\nOne of United's three wins came against League One Barnsley in the EFL Cup.\nThat and the Premier League victory at Southampton – who have so far accumulated a single point – are the only times this season when United have scored more than one goal in a game.\nNo United player has scored more than one goal in the Premier League. Alejandro Garnacho – a substitute against Twente – is the overall top scorer with four, two of which came in the 7-0 Barnsley victory.\nTen Hag is not averse to quoting expected goals (xG) figures in his news conferences.\nHe will know therefore that United have underperformed their xG in five of those seven competitive games - setting aside the Community Shield for now. Their chance conversion rate is seven per cent.\nAll of their major attacking players have scored fewer goals than their xG in the Premier League so far this season.\nTwente gobbled up their chance in Wednesday's game when it came their way, and Ten Hag accepted the opposition went the extra yard.\n\"It was the game of their life,\" said Ten Hag. \"They fought for every yard and we didn't. Ninety-nine per cent is not enough.\n\"Often I think the mentality from this team is very good. Today I have some criticisms. It is not only the team that has to look in the mirror; I am part of it. You know we have some problems scoring goals, but we have to kill the game.\"\n'They should score more'\nThe new eight-game single league first-stage format for the 36-team Europa League means that even if they finish 24th, United would qualify for a play-off in February.\nHowever, external criticism is bound to mount if the current form does not improve quickly.\n\"For all the firepower Man United had, even though they had 19 shots, it didn't feel like it was good enough,\" said former United and England midfielder Owen Hargreaves.\n\"Ruthlessness comes from the matchwinners. Man United have always had those players – the best of the best. Think of the firepower they had. Someone needs to step up with a goal when they need one. They should be creating more and scoring more.\"\nCaptain Bruno Fernandes and £36.5m new arrival Joshua Zirkzee came closest to snatching victory for the home side. But United failed to smother their opponents in the manner of successful teams in the past.\nSir Alex Ferguson's presence on the pitch before the game to present a plate to his Treble-winning assistant – and Twente's former title-winning manager – Steve McClaren was a reminder of what United used to be.\nHargreaves, it should be remembered, was part of the last United side to win the Champions League in 2008.\n\"At a club like this you need to win,\" Hargreaves said. \"The fixtures coming up are incredibly difficult. They need to rise to the occasion now and find some solutions.\"\nDefensive improvement but tough test ahead\nTottenham's visit to Old Trafford on Sunday at least presents opposition who have endured a similarly underwhelming start to the season, while next Thursday's trip to Porto pits United against a side who surprisingly lost their Europa League opener to Norwegian outfit Bodo/Glimt.\nAfter that is a very difficult trip to Aston Villa when United must look to avoid entering a second international break in a row with mutterings around Ten Hag and his management.\nOn the plus side, United's defence, which looked so shaky last season, has improved. Their goals-per-game conceded rate is below one, which is better than in either of their two previous seasons under Ten Hag, and that is despite conceding three in that home defeat by Liverpool on 1 September.\nTen Hag continues to state his team are improving and any issues are short-term concerns. But while he doesn't tend to talk about it, last season's eighth place has not been forgotten.\nHe still has time on his side but time, as with any manager, can soon start to drift away if results and consistency remain elusive.\n\"We are very ambitious and when you have ambition, you have to perform,\" Ten Hag said. \"Especially today, in the second half, we were too complacent. We didn't bring it over the line and as a team, you have to do this.\"\nRelated topics\n- Published26 July 2022",
  "word_count": 1008,
  "scraped_at": "2026-02-14T02:20:44.347598",
  "_text_extracted": true
}