{
  "article_id": "62b1745b3224",
  "url": "https://www.dailymail.co.uk/news/article-14884621/Costa-del-Sol-gangster-pub-guide-crime-mobs.html",
  "title": "The Costa del Sol gangster pub guide",
  "date": "20250712T104500Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Costa del Sol gangster pub guide: Executions, punishment shootings - the favoured hangouts that have seen it all\n- Do YOU have a story? Email chris.matthews@mailonline.co.uk\nIf you're a gangster on the hunt for cash, concubines and cartel connections, you probably only have one destination in mind: the Costa del Sol.\nIt is here in the bars of southern Spain that some of the world's most deadly mafiosos gather to discuss drug deals and order gangland hits.\nOf course, there is a deadly risk to showing your face in these bars. Just a little over a month ago, Scottish gang bosses Eddie Lyons Jr, 46, and Ross Monaghan, 43, were gunned down in a Costa del Sol bar in Fuengirola that Monaghan owned.\nBut, despite the dangers, mobsters continue to flock to these gangster haunts to find criminal connections and make millions from international drug deals.\nThese mobsters know the risks, but they just love the lifestyle too much.\nLast week, a British gangster in the region told MailOnline: 'It's a good place to meet people. It's like a permanent convention for guys in the game.\n'You go to a pub or a bar and you never know what sort of gig could fall in your lap.\n'As long as you know when to keep your mouth shut, it's a fun place to be. It's the gangster life - get a tan, find a girl, make some money.'\nHe added: 'You'll find loads of gangs in Marbella. Obviously there was the Fuengirola shooting not far away as well.\n'Even so, the ladies love it too. You just have to make sure you're not caught out, like if your missus is staying when certain women are about.'\nThe Costa del Sol plays host to some of the world's most dangerous gangsters\nJose Manuel Caamano, a distinguished former chief of police in Spain's Policia Nacional, met with MailOnline in his home town of Fuengirola – just a couple-hundred metres up from the infamous pub Monaghans, where Monaghan and Lyons met their fate.\nThe 70-year old, originally born in Tangier, Morocco, spent seven years working undercover with the first Spanish cocaine importers based out of the northern region of Galicia.\nAfter 46 years in the Spanish police, dedicating himself to combating drug trafficking and rising to the highest rank of comisario, Mr Caamano retired in the Costa del Sol in 2019.\nHe said: 'Most of the British gangster figures, they come to the Costa del Sol to relax. They want to retire, enjoy the good life that we have here, with the sun and the beaches and the food.\n'But they never completely retire. First of all, they like to integrate themselves into the local society by setting up a new business. Usually a bar or a restaurant, sometimes a gym.\n'Even if they're supposed to be laying low and staying safe in the confines of their villas, they usually can't resist getting back into public life.\nEverywhere you look, there is a fancy car parked beside the sparkling Mediterranean Sea\nThe Costa del Sol is popular with wealthy tourists, and the harbour is full of expensive yachts\n'And they find it here. The Costa del Sol has transformed completely in the last 50 years. None of this existed when I started out, Fuengirola was just a sleepy fishing village.\n'Today, with the tourism explosion and the waves of foreigners coming to live here – I'm talking English, Irish, Dutch, German, Danish, there are even 20,000 Finnish living around here – it's easy for these guys to blend in. But it's also very tempting for them to go out and involve themselves in social activities.\n'And here we are so close to Morocco and the Port of Algeciras, where so much of the drugs enter Europe, and that too is also tempting for them.'\nHowever, he added: 'British gangsters in the Costa del Sol never see the drugs or go anywhere near them - maybe their lieutenants do, but not the top capos.'\nInstead, they spend their time in the host of bars and clubs with ties to the gangs, which MailOnline can reveal below...\nThe Irish Rover\nA little more than a month ago, The Irish Rover (then-called Monaghans) was the scene of a double gangland murder.\nAt 11.30pm on Saturday, May 31, tourists were packed into Monaghans bar in Fuengirola to watch the Champions League final on the television.\nOutside, a car pulled up and a man stepped out, dressed in a black jacket and shorts with a white T-shirt wrapped around his face and a baseball cap pulled over his eyes.\nHe wasn't there for the football. He was there to carry out a cold, calculated mafia-style execution of two senior Lyons gangsters: Eddie Lyons Jr and Ross Monaghan - who also owned the bar.\nHe stepped on to the terrace outside and shot Lyons dead, who was a gangster but only there for a 'lads golfing holiday' with more than a dozen friends.\nHis killer did not care. He stepped inside the bar, locked eyes on Monaghan, and shot him in the abdomen. Monaghan collapsed. The shooter adjusted his aim and squeezed the trigger again - but there was no sound. The gun had jammed.\nThe Irish Rover is the new name of Monaghans, a bar owned by Glasgow-based Lyons mob boss Ross Monaghan before his death\nThe pub was rebranded after Lyons gangsters Eddie Lyons Jnr (left) and Ross Monaghan (right) were shot dead in May by a masked gunman while they were in Monaghans Irish pub in Fuengirola, Spain\nWhen MailOnline visited Monaghans bar in June, the bar remained closed, its glass doors locked, lights off and chairs neatly tucked under tables\nWeeks later, the bar has been rebranded as The Irish Rover, although MailOnline can reveal the new manager is actually the old manager's husband\nWith a deathly red stain seeping across his otherwise pristine white T-shirt, CCTV footage released last month by Spanish police showed the haunting moment a desperate Monaghan tried to crawl away to safety. But despite his assailant's gun malfunctioning, the flame-haired Monaghan must have known the game was up.\nAnd duly, it was. A volley of four more shots and he crumpled to the floor. The assassin turned on his heels and fled around the corner to a waiting car, which sped up the winding dual carriageway eastward towards neighbouring Benalmadena, purposefully avoiding toll booths on the parallel highway.\nBack in the bar, a British nurse rushed bravely inside where she found a truly horrifying scene. In her haunting testimony, she said: '[Monaghan] was lying on the floor and was still alive but his breathing was laboured.\n'There was nothing I could do, he wasn't bleeding from his mouth so I just held his hand, stroked his hair and waited for the emergency services.'\nThe shooting took place in front of terrified locals and tourists at the popular Costa del Sol bar. Pictured: A sheet covers the body of Lyons outside the bar on May 31\nLyons was gunned down in the Irish Rover's terrace, near the zebra crossing\nWhen they did arrive, Monaghan and Lyons were both pronounced dead, their bodies covered and eventually taken away in an ambulance along the same road down which their killer had fled not long ago.\nSpanish police said the suspected killer was a member of the Daniels clan.\nEnglishman Michael Riley, 44, from Liverpool, was arrested in connection with the shooting, just before he was allegedly about to flee to a 'paradise island tax haven.'\nThe bar has long been frequented by British mobsters - particularly members of the hardened Lyons gang.\nAlthough the bar has been renamed the Irish Rover and is under new management, that new boss is actually just the old manager's husband, MailOnline can reveal.\nBreathe (Air Bar)\nBreathe restaurant's Air Bar in Marbella has held events in partnership with Nero Vodka, which just so happens to be a known front for the Kinahan Cartel, one of the most infamous gangs in the world.\nWhile Breathe itself may not be connected with gangs, its bar has hosted mobsters from the Kinahans.\nThat is because Nero Vodka's boss is Nicola Morrissey, 49, the moll of 'Johnny Cash' Morrissey.\nJohnny Cash, so called because of his propensity to carry large wads of banknotes with him, is a mobster from the Kinahan cartel.\nJohnny and his wife share a property empire while enjoying their Nero premium vodka business in the Costa del Sol.\nConservative MP and former crime journalist Russell Findlay, who was targeted in an acid attack by the gangs, told the Scottish Parliament in 2022: 'One Kinahan gang member who has been sanctioned [by US authorities in 2022] is John Morrissey, along with his Glasgow-based vodka company, Nero Drinks.\n'The Kinahans are not interested in flogging vodka - their real business is cocaine and heroin.\nAir Bar, run by Marbella firm Breathe, has previously partnered with Nero Vodka - a known front for the Kinahan Cartel\nThe luxury bar is likely to have hosted some of the world's most notorious gangsters owing to its association with Nero Vodka\nNero Vodka's boss is Nicola Morrissey, the wife of Kinahan Cartel associate 'Johnny Cash' Morrissey, who was arrested in 2022 on suspicion of money laundering\n'Johnny Cash', so called because of his propensity to carry large wads of banknotes with him, is a Kinahan mobster and thought to have laundered money for the infamous Irish mafia gang\nNicola was also arrested and bailed as part of the same probe\n'It is widely known that the cartel is in partnership with Scotland's Lyons gang, making vast profits from killing Scots.'\nThe US Treasury Department said Nero Drinks has been on its radar.\nA spokesman said: 'John Morrissey controls and operates Nero Drinks through his wife, the primary shareholder, who is used as a frontperson for his interests.'\nThe father-of-two was arrested in 2022 on suspicion of money laundering, with Nicola also arrested and bailed as part of the same probe.\nA raid of their home revealed luxury paintings and wads of cash, while Nicola's interview with Marbella magazine Exclusive Life revealed the true extent of their wealth.\nThe glamorous Nicola showed off her pearly whites as she posed beside a £350,000 Rolls-Royce Dawn in a long scarlet dress.\nIn another photo she seemed to be wearing a diamond necklace as she stood in a plunging black dress next to a bottle of vodka and a plush dinner table beneath a chandelier.\nSinatra Bar\nSinatra Bar has long been rumoured to play host to some of Marbella's most hardened criminals, particularly Britons.\nThe venue has been running since the 1970s and is strictly cash only, with staff said to become aggressive when customers are unable to pay.\nThe bar holds a prime location on the first corner beside the entrance to the port, and is packed most days with well-weathered, high-earning customers, mostly aged 50 and above - and many adorned with tattoos.\nIts well-positioned terrace allows guests to watch on as Lamborghinis, Ferraris and Rolls-Royces do laps of the port.\nWhen MailOnline visited notorious gang haunt Sinatra Bar in Marbella, two luxury cars were parked outside\nWhile it is not suggested that any of the people sitting in the bar that night were gangsters, it is a known hotspot for criminals\nThe view from within the infamous bar. It is unclear who owns Sinatra Bar, which is in Marbella's Puerto Banus area\nBarmen only accept payments for drinks in cash, which has raised eyebrows\nThe Kinahan Cartel are known to have at least one villa in Marbella and other gangsters are close by.\nSinatra Bar is in the heart of Puerto Banus, Marbella's main strip of pubs and clubs.\nThe reason the Costa del Sol became a gang hub is because an extradition agreement between the UK and Spain expired in 1978, meaning there was less chance of British crime bosses being sent home to face trial.\nBy the time the deal was struck up again in 1985, gangsters had already taken hold along the coast.\nThese days, although there is a functioning extradition agreement, the Costa del Sol has simply become synonymous with gangsters from all corners of the UK - as well as the rest of the world.\nThe Irish Times\nThe Irish Times in Calahonda, Mijas, is said to be a popular haunt for some of the many Liverpudlian gangsters who live in the area.\nThe small bar is just a 15-minute walk from where a British man, believed to be from Liverpool, was gunned down as he walked home from a football match on April 21.\nThe victim, said to be linked to organised crime, was shot dead at around 8.15pm and his killers (there are thought to have been two) remain at large.\nGangsters from Liverpool are said to frequent The Irish Times, a pub in Calahonda, Mijas\nThe small bar is just a 15-minute walk from where a British man, believed to be from Liverpool, was gunned down as he walked home from a football match played on this pitch on April 21\nAfter the brutal shooting of a man thought to be connected to organised crime, this car was set on fire\nOne British expat who lives in the area told MailOnline: 'I see more violence every day around Calahonda as the tourist season gets underway.\n'The Irish Times on the strip in Calahonda is part of it. Drug dealers frequent the area and the bar is full of yobs.\n'Some guys beat up my friend there recently, they all had Liverpool accents.'\nSisu Boutique Hotel\nOnce the place to be for partying tourists from the UK and Ireland, the Sisu Boutique Hotel in Marbella now stands in ruins after it was set ablaze in August 2020.\nThe inferno, declared an arson attack by Spanish police, is suspected of being ordered by the powerful Mocro Maffia.\nThe Mocro Maffia refers to a network of highly organised crime gangs, primarily made up of Dutch-Moroccans, and which are run out of the Netherlands and Belgium.\nThey specialise in drug trafficking (particularly cocaine), money laundering and assassinations - and are known for their violent turf wars.\nThe hotel, which was set ablaze in August 2020, is now boarded up but still has CCTV outside\nThe inferno, declared an arson attack by Spanish police, is suspected of being ordered by the powerful Mocro Maffia\nNearby to the Sisu Hotel, supercars adorn the streets\nWhen MailOnline visited Marbella, Lamborghini were holding an event in the Puerto Banus\nA local Brit who has lived in the area for decades and who has rubbed shoulders with mobsters, told MailOnline how the Sisu was long rumoured to be a meeting point for British and Irish criminals.\nGang members were able to hold discreet meetings at the venue thanks to their ability to blend in with the hundreds of revellers from their home countries, he said.\nThe hotel's devastating fire had three different starting points, and began shortly after three French nationals were seen filling up canisters with petrol nearby.\n'Since then, the English and Irish have been more based in Mijas, La Cala de Mijas and Calahonda,' the source added, 'while the Mocro Maffia have gained ground in Nueva Andalucia, Puerto Banus and Marbella, which have coincidentally seen a surge in Moroccan barbers and shisha bars.'\nThe Real Club Padel\nThe Real Club Padel in Marbella, which sits directly behind the Sisu, has seen its own fair share of violence over the past few years.\nIts state-of-the-art gym attracts henchmen, nightclub bouncers and mafia enforcers, and is a known meeting place for members of the coast's criminal underbelly - as well as their glamorous wives and girlfriends.\nThere have been multiple raids and arrests carried out at the venue - which also has a bar and restaurant - since 2021.\nThe Real Club Padel in Marbella, which sits directly behind the Sisu, has seen its own fair share of violence over the past few years\nOn January 2, former Hells Angels member and ex-MMA fighter Saman Baghi, 34 (pictured in The Real Gym Padel Club) was shot in the anus and testicles as he left the building, although he survived the attack\nIn February, Spanish police raided the club, which is said to be popular with gangsters in Marbella\nOn January 2, former Hells Angels member and ex-MMA fighter Saman Baghi, 34, was shot in the anus and testicles as he left the building.\nThe German man of Arabic origin reportedly became a target after owing money to a series of suspected gangsters.\nAnd in March, the venue was raided by multiple units from Spain's armed national police, with footage shared online showing four riot vans parked outside.\nIt followed the dramatic arrest of three people at the venue in May 2024, which involved a helicopter circling above.\nPolice later said it was a 'routine raid', and that the suspects were cuffed 'for minor or administrative reasons'.\nLa Sala\nLa Sala in Marbella is one of the most successful restaurant chains on the Costa del Sol.\nAfter decades in the business, it has become somewhat of a household name among the British and Irish expats who live there.\nIt is filled to the rafters most nights, typically with well-heeled tourists and a who's-who of the expat community.\nIts owner, businessman Ian Radford, is married to Big Brother star Claire Strutton.\nYet the La Sala flagship venue in Puerto Banus is known to have played host to English and Irish gangsters.\nThat became crystal clear last year when it became the target of a drive-by shooting.\nPuerto Banus is known as Marbella's main hub, with clubs and bars next to fancy designer shops\nLa Sala in Puerto Banus, Marbella, was the target of a drive-by shooting last year\nA Briton and an Irishman, later named by police as Darren H and Gerrard S, arrived on a Honda motorbike just before opening hours on March 11, 2024, and opened fire on the venue\nA Briton and an Irishman, later named by police as Darren H and Gerrard S, arrived on a Honda motorbike just before opening hours on March 11, last year, and opened fire.\nThey sprayed at least 15 bullets at the venue, shattering glass and hitting chairs, while staff were inside preparing for the lunch service.\nSources claimed to MailOnline this week that the shooting came hours after an English gangster was asked to leave the venue due to his rowdy and aggressive behaviour.\nUpon being turfed out, he allegedly threatened staff that he would 'come back and shoot them up'.\nAngels Place\nThis tiny bar makes no secret about being the hangout spot for the Marbella Hells Angels.\nHells Angels have a history of links to organised crime. Their Marbella faction regularly shares pictures on Instagram of its balaclava-clad members at the venue and of visits from 'our brothers in Germany'.\nIn some group photos, the faces of members have been covered to protect their identity.\nHells Angels has long been associated with organised crime - and the group has a faction in Marbella\nImages have been shared on social media of tattooed bikers - with some of their faces covered to protect their identity\nHells Angels Marbella even promotes its own branded balaclavas for members\nThe Hells Angels Marbella headquarters in the eastern part of the seedy town\nAccording to a report by Spanish newspaper ABC, the National Police 'associate this small group with drug trafficking, prostitution, homicide, arms trafficking, extortion, and bodily harm'.\nA British member of the Marbella bracket was expelled from Spain in February of this year after he was found to be living in the area despite being banned from entering the Schengen Area - which Spain is a part of.\nThe bar is also just metres away from a police station and behind the Playa Padre beach club, which often hosts celebrity parties.",
  "word_count": 3337,
  "scraped_at": "2026-02-14T01:49:44.681331",
  "_text_extracted": true
}