{
  "article_id": "62ce618639db",
  "url": "https://www.kompas.id/baca/english/2023/08/01/en-liga-inggris-bakal-berdurasi-100-menit",
  "title": "The Premier League Will Be 100 Minutes Long",
  "date": "20230802T001500Z",
  "domain": "kompas.id",
  "source_country": "Indonesia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article has been translated using AI. See original.\nBy MUHAMMAD IKHSAN MAHAR\n02 Agt 2023 19:13 WIB · English\nThe following article was translated using both Microsoft Azure Open AI and Google Translation AI.\nLONDON, TUESDAY — The English Premier League will become the first top-tier world competition to adopt the FIFA regulations regarding additional time introduced at the 2022 Qatar World Cup. Starting from the 2023-2024 season, matches in the world's best league will typically last more than 100 minutes.\nThe English Football Association (FA) seeks to increase the effective duration of play (ball in play) in professional competition in England by implementing an additional time of more than 5 minutes per half. This step was also taken to reduce the chance for a team or player to take \"dirty\" actions to buy time, especially when they are leading at the end of a match.\n\"Starting from the new season, it will be very rare for games in the top caste competition (English Premier League) to be played for less than 100 minutes,\" said a Premier League match official to Sky Sports, Monday (31/7/2023) .\nBased on Opta data, each Premier League match for the 2022-2023 season lasts an average of 98 minutes and 14 seconds. From that time on, effective ball play in the most prestigious competition in the world only reached 54 minutes and 46 seconds or 55.8 percent of the accumulated match duration.\nThe percentage figure puts the English Premier League below Ligue 1 (58.1 percent), followed by Serie A and the Bundesliga, both of which recorded an effective playing time of 56 percent of the average accumulated game time.\nOn the other hand, only nine English Premier League teams recorded an average effective playing time above the league's average game duration last season. The nine teams are Manchester City, Liverpool, West Ham United, Tottenham Hotspur, Leicester City, Manchester United, Brighton & Hove Albion, Bournemouth, and Chelsea. City, the champion, had the highest effective playing time duration with 60 minutes and 19 seconds.\nMeanwhile, 11 teams collected an average game duration below the league average. The lowest effective game duration was recorded by Newcastle United, which ranked fourth, with 51 minutes and 5 seconds.\nThe effective game duration in the English Premier League is significantly longer compared to the average of 62 matches in Qatar 2022 which last for 58 minutes and 4 seconds. With the new additional time regulations, any stoppage in play in Qatar, such as for penalties, video assistant referee (VAR) incidents review, and throw-ins, is accumulated to become additional time duration in each half.\nAlso read: Football and Economics Lessons from Argentina\nStarting from the new season, it will be very rare for players to play less than 100 minutes in top-tier competition matches (English Premier League).\nLast season in the English Premier League, penalties were the biggest reason for game interruptions, requiring an average of 112 seconds to resume the match. Furthermore, VAR reviews and kick-offs after goals caused interruptions of 79 seconds and 72 seconds respectively.\nNot only that, each throw-in also causes an average of a 16-second pause in the game. Referring to average data of around 40 throw-ins per match in the English Premier League, from throw-in situations alone, the game can be stopped for up to 10 minutes.\nExecutive Chairman of the FA, Mark Bullingham, said that FIFA's regulations implemented since the Qatar World Cup have brought fundamental changes to the attitude of players on the field. In particular, Bullingham said that players have become aware that their decisions to take breaks for injury treatment or to let the ball leave the field do not provide any benefits for their team.\n“With the FIFA rules, the effective duration of the game becomes very diverse and can even reach 25 minutes. It is necessary to ensure that there are incentives to stall for time,” Bullingham said as reported by The Times.\nAlso read: England Club Hunts for Best Midfielder\nIn addition to the highest caste managed by the Premier League and FA Cup, the English football authority also ensures that the implementation of FIFA's additional time rules is applied in four competitions held by the English Football League (EFL).\nThe four competitions are the Championship Division, League One, League Two, and the English League Cup. In the 2022-2023 season, the Championship Division recorded an average effective playing time of 52 minutes, then 50 minutes in League One, and 48 minutes in League Two.\nIn the long term, the FA hopes that the effective game duration of the English Premier League can approach 60 minutes with the additional time rule. For implementation in the first season, the FA targets an average effective time in the best English competition to exceed 55 minutes.\nIf we reflect on FIFA's experience, the added time rule can provide a significant increase in the effective playing duration. The 2018 World Cup in Russia recorded an average effective duration of 55 minutes and 41 seconds, resulting in an increase of over 2 minutes in Qatar 2022.\nAlso read: Saudi Arabian League Determined To Copy Premier League Success\nThe extra time in Qatar 2022 is 6.5 minutes longer than the tournament in Russia, four years earlier. The average extra time given by the referee at the 2022 World Cup is 10 minutes and 11 seconds. The match that recorded the most extra time was the match between England and Iran with 27 minutes.\nIn total, 43 matches out of 62 in Qatar lasted more than 100 minutes. The average match duration in Qatar excluding extra time in knockout stages was 100 minutes and 23 seconds. This figure is 4 minutes longer compared to the 2018 World Cup and 5 minutes longer than the 2020 European Championship.\nChairman of the FIFA Referees Committee Pierluigi Collina said, at the beginning of implementation, a very long extra time was likely to occur because players were still adapting to the new rules.\n“It has been proven that the extra time in Qatar is getting shorter when the tournament has entered a crucial period. It helps matches become more important and effective because players stop wasting time,” said Collina as reported by The Athletic.\nWriter:\nMUHAMMAD IKHSAN MAHAR |\nEditor:\nEMILIUS CAESAR ALEXEY",
  "word_count": 1043,
  "scraped_at": "2026-02-14T02:07:08.855420",
  "_text_extracted": true
}