{
  "article_id": "631f1bf867f6",
  "url": "https://theathletic.com/4544231/2023/05/30/arsenal-season-review/",
  "title": "Arsenal season review : Second - best , but a great team was forged",
  "date": "20230530T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Once upon a time, second might as well have been last at Arsenal. Nineteen seasons without the league title and five years without qualifying for the Champions League changes things, though. That narrow understanding of success has had to broaden, while the modern Premier League has conditioned fans to have patience as a project builds, or collapses.\nBut Arsenal ripped up the script this season and, with it, all expectations.\nAdvertisement\nThey recorded their best-ever start to a Premier League campaign with 50 points from the first 19 games and were leading a title race they weren’t even supposed to be in. They produced some magical football and players came of age in front of the fans’ eyes. Late winners became so common it felt like this was Arsenal’s time.\nGO DEEPER\nRamsdale: The keys to Arsenal No 1's shot-stopping ability\nGiven they were five points clear of Manchester City in March and led the league for 248 days, for City to retain the title with two games to spare shows just how drastically Arsenal faded as they dropped 15 points over their final nine games.\nThey came up short in the end, but the glowing reception manager Mikel Arteta and his team received after the final-day win over Wolves on Sunday showed that this season achieved something tangible: it reconnected a club that had become dislocated from its sense of purpose, and made the Emirates Stadium feel like home, finally.\nSometimes, second isn’t last. It’s just the start. That’s what Arteta’s young side now need to prove in the coming years, but this season still served a plethora of euphoric moments that, over time, will be reflected on warmly.\nThe high point\nBeating Bournemouth 3-2 on March 4. From disaster and despair with half an hour remaining, this was the moment that faint dare-not-speak-about-it-yet hope transformed into tangible belief. This was going to be Arsenal’s year. Magical turnarounds like this don’t happen unless it’s leading to something bigger. They just don’t.\nReiss Nelson’s 97th-minute winner completed an astonishing comeback from two down and put Arsenal five points clear of Manchester City with just a dozen league games to go.\nIt was a truly incredible shared experience. There were bodies scattered everywhere across the pitch in disbelief, on both sides. The videos of the celebrations came rolling into social-media from every conceivable angle in what some felt was the most iconic moment in the stadium’s 17-year existence.\nIt proved to be a false dawn, but you can’t erase those memories.\nReiss Nelson’s late winner against Bournemouth will never ever be forgotten\n— Gunners (@Gunnersc0m) May 26, 2023\nThe low point\nIt could have been the Southampton game the week before, when what looked like a gimme against a relegation-destined side turned into a horror show. A howler from Aaron Ramsdale early on set the tone but the late rally to score two goals and rescue a point still kept Arsenal in the race and showed there was still some fight left in the tank.\nAdvertisement\nBut the trip to the Etihad on April 26 completely ended any pretence there was any jeopardy left for the defending champions. What was most damaging for morale was the sheer brutal nature with which City dispatched Arsenal, 4-1. It could easily have been an embarrassing scoreline as Arsenal were unable to compete in any aspect of the game.\nA tough reality check and a reminder there is still a sizeable gap between the two teams.\nGoal of the season\nThomas Partey’s brilliant side-footed finish against Spurs in October was a contender, but the goal Gabriel Martinelli scored in the 3-0 win at Fulham in March was Arteta’s Arsenal at their very best.\nThey led the race for so long because they bought into the collective and it feels right that this team goal is recognised as the one that symbolised the verve and imagination they played with for most of the season.\nMarco Silva’s players tried to get pressure on the ball but Arsenal were so composed and so sharp they couldn’t disrupt their rhythm. Twenty-three passes later, Arsenal had broken their press, burst into the final third and capped off the move, even if the finish could have done with being a little more aesthetically pleasing for such a beautifully-constructed goal.\nA free-flowing flourish finished off by Gabriel Martinelli 😍 pic.twitter.com/BkIqzywgZZ\n— Arsenal (@Arsenal) March 13, 2023\nBiggest issue to fix for next season\nInsufficient squad depth is the one thing that prevented Arsenal taking the title to the wire. They are ahead of schedule, so it is a weakness they will hope to naturally eliminate through a good summer transfer window, but there are clear parts of the squad that were found wanting.\nThe injuries to William Saliba and Takehiro Tomiyasu in the same mid-March game against Sporting Lisbon were unfortunate and left them exposed on the right side of the defence, but the lack of depth at centre-back, some weaknesses in Partey’s game coming to the fore in a key position, and their lack of like-for-like options to rotate the two wingers or offer a different dimension in attack took a toll.\nAdvertisement\nIf Arsenal can strengthen their spine and buy versatile players, they should have the resources to adapt and switch formation to cover for any shortages in a way they couldn’t this season.\nFunniest moment\n“Leandro Trossard has more Premier League assists since he arrived at your club than 10 Premier League teams. In your wildest dreams could you have imagined him having such an impact?” asked the reporter, following the 4-1 win over Leeds at the start of April.\nArteta paused for a second.\n“I have very wild dreams,” he replied, sending the whole press room into laughter.\nIt’s not often Arteta breaks character in front of the camera, so when he produces a sharp quip like that it is best to be enjoyed!\nWeirdest thing the manager said or did\nLess weird and more a bit Ted Lasso, but it will have to do.\nIt’s no secret Arteta is big into his imagery and motivational tools. Think of having You’ll Never Walk Alone blaring out at training before a trip to Anfield last season, the clock at Craven Cottage or the stickers they’ve been bringing to away grounds to make it feel like their own patch.\nHe always finds new ways to eke a little more out of his players, but his most recent explanation for introducing a dog around the training ground and naming it ‘Win’ felt a little twee even for the Spaniard — especially given they had just lost to Nottingham Forest to confirm Manchester City as champions.\nMaybe in a year’s time it will be looked upon as a masterstroke…\nPlayer the fans will happily never see again\nFabio Vieira has had a disappointing debut season and looked desperately short in confidence towards the end of it, but he could just need more time to adjust to English football, so it has to be Rob Holding.\nIt is cruel to pick him as even when Ramsdale, Gabriel Magalhaes, Oleksandr Zinchenko, Partey and others made direct mistakes for goals, he tended to be scapegoated. However, Holding has been at the club for a long time now and it is time for Arsenal to improve their options at centre-back so they have a player in reserve with similar attributes to the first-choice pairing.\nAdvertisement\nWhen he came into the team, Holding showed the difference a simple change of profile can make. He committed some rash challenges but often it was just individual tendencies that had a knock-on effect, like dropping off instead of being uber-aggressive in holding the high line.\nStats that sums them up\nIt cannot be said for certain, but Saliba’s injury has proved to be catastrophic. What was hoped to be a minor injury turned out to be a season-ender and with that, Arsenal’s hopes of keeping up their pace at the top of the table vanished.\nWith the France international defender in the team, starting every game next to Gabriel, they picked up 66 points from a possible 81 and were on track to finish with 93.\nHolding came in to replace him before Jakub Kiwior was introduced but the whole team looked like it had been knocked off kilter as they lost leads at Liverpool and West Ham before having to scramble a draw against bottom-side Southampton. Without Saliba they took 18 points of the final 33 available (a per-game rate which over a full season would get you 62), showing how detrimental his absence has been.\nWhat a goal from William Saliba 🚀\nArsenal fans have been singing his name for the majority of the game and now Saliba has responded with a brilliant goal into the top corner.\n🎥 @SkySportsPL #BOUARSpic.twitter.com/uLlfnXVrjQ\n— The Athletic | Football (@TheAthleticFC) August 20, 2022\nReason to be optimistic for next season\nArteta has built the youngest team in the league. While that doesn’t win you a trophy, the fact Arsenal produced such a powerful breakthrough season gives them a platform to build on.\nThey have tied down Ramsdale, Gabriel, Martinelli and Saka to new long-term contracts already in a bid to secure the base of this team for future years. If they can grow together and supplement that core of potential with a few injections of top quality, who is to say they can’t reel City in with greater experience?\nPredicted finish for next season\nIt is difficult to see past Manchester City until Pep Guardiola moves on. Consolidating themselves as a Champions League side again is fundamental to Arsenal’s finances and ability to invest in the squad, so that is the immediate aim, but they should be hoping to be involved in a title race again.\nLiverpool could come back strongly so will be a force to watch out for and Newcastle should strengthen again, too, but Arsenal ought to fancy themselves to again be the best of the rest.\n(Top photo: Catherine Ivill via Getty Images)",
  "word_count": 1676,
  "scraped_at": "2026-02-14T02:00:19.989477",
  "_text_extracted": true
}