{
  "article_id": "6323b6c97d74",
  "url": "https://www.rnz.co.nz/news/sport/522041/the-chase-s-shaun-wallace-how-the-dark-destroyer-became-a-lifelong-all-blacks-fan",
  "title": "The Chase Shaun Wallace : How the  Dark Destroyer  became a lifelong All Blacks fan",
  "date": "20240712T231500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Chase star Shaun Wallace has revealed who it was that made him a lifelong fan of the All Blacks.\nThe celebrity quizzer, currently touring New Zealand to raise money for mental health charity I Am Hope, told RNZ's Saturday Morning it was the \"late scrum-half Sid Going\" that caught his eye.\n\"I remember watching the Lions tour of 1971, and although [Lions captain] John Dawes' team was victorious, he was absolutely fantastic. We used to have a sports programme called Grandstand, and when they used to show the New Zealand rugby union team, Sid Going was fantastic. So he was always one of my heroes.\"\nThe closest modern-day player to Going, Wallace said, was South Africa's \"brilliant\" Faf de Klerk.\n\"I like, sort of, you know, aggressive, tenacious scrum-halves, irrespective of your sort of size. And you wouldn't describe those men as you know, big scrum-halves. But they were brave, tenacious, and they were just brilliant scrum-halves.\"\nWallace, known as the 'Dark Destroyer' in his role as a chaser on hit UK game show The Chase, had his big break in 2004 - becoming the first Black person to win Mastermind in the show's then 32-year history.\nBefore that, he found success on a short-lived show called Greed, hosted by Jerry Springer, which aired in 2001. Like the late Springer, Wallace is a qualified lawyer.\n\"It only lasted one series, cause it was a show which came over from America. So we were the last ever show to do it. It's too complicated to go through the rules. But suffice it to say that we, I managed to captain a team and we won a quarter of a million pounds.\"\nAn honour to meet #NewZealand Coach, Scott “Razor” Robertson, Sam Cane , the 2023 World Cup Captain & Will Jordan, Top Try Scorer at the #Rugby Union World Cup 2023\n— Shaun Wallace - The Dark Destroyer - the Chase (@TheShaunWallace) July 7, 2024\nThen, to be presented with an @allblacks jersey whilst in New Zealand…just another day at the office for me pic.twitter.com/B33wqTIwiC\nBut even the best quizzers have gaps in their knowledge - Wallace was unaware his hero Going had recently died, aged 80, until his arrival in New Zealand earlier this month.\n\"May that great man rest in eternal peace in the rugby sky.\"\nAt his charity appearances across New Zealand this week, Wallace has been showing off his long-running dedication to the All Blacks - including photographs and video clips from decades before he even set foot in the country, showing him wearing All Blacks jerseys.\n\"So I've always followed New Zealand rugby 'cause I've always thought they are and still are - even though they've not won the most World Cups - they are the blueprint, the standard of how rugby should be played.\"\nBut despite his imposing 1.91m frame, Wallace never took to the sport himself.\n\"I wasn't really a rugby player. Although, strangely enough when I was a captain of my House sports team back in school from the ages of 12 to 15, we had to play rugby, so I was the captain of the centre of our rugby team.\n\"We weren't very good, but my crowning moment was when we got a penalty… I was playing centre at the time and I converted it. And that's still one of my sort of greatest sporting achievements - at the age of 13. But that was the last time I played rugby.\"\nWallace is also a big fan of football, having lived on the same street near Wembley Stadium in London for basically his entire life. His Mastermind specialty subjects were UEFA Champions League finals since 1970, England at the UEFA European Championship and FA Cup Finals since 1970.\nEngland face Spain in the Euro final on Monday (NZ time).\n\"I'll give you some interesting facts,\" Wallace said. \"This is the fourth time that Spain have met England at the Euros. In Euro '68, England beat Spain in a two-legged quarter-final tie. In Euro '80 which was in Italy, England beat Spain in the final group stage 2-1.\n\"There was that famous match in 1996 when Stuart Pearce redeemed himself by scoring a penalty and a penalty shootout, and David Seaman… saved two penalties. So Spain have never beaten England [at the Euros].\n\"In saying that, on the other side, Spain will become the first team - if they win on Sunday - to win seven successive matches in a major men's football tournament. It's never been done before.\"\nHis hope is that England play aggressively, against type.\n\"I remember in Euro 2020 when the finals at Wembley against Italy, Italy had an ageing defence and the one thing I hate when England score, they score too early, because sometimes they retreat into a shell. And if they do that against the Spanish team - who are gonna have the possession of the ball - that will tire them out, and eventually they'll breach that wall.\n\"But I think [coach] Gareth Southgate has shown bravery in terms of his tactics, especially in the last game when he took off Harry Kane - who clearly is not fit. I don't even think that Jude Bellingham's fit because Jude Bellingham's got a shoulder injury, which he's carrying, so you know, that's why I don't think he's fully fit, myself.\"\nWe are through to the final on Sunday!!#England pic.twitter.com/oKLlelGb7f\n— Shaun Wallace - The Dark Destroyer - the Chase (@TheShaunWallace) July 12, 2024\nWhatever the result, he hopes it is decided in regulation time - he is flying out that same morning.\n\"My brilliant tour manager Brendan is gonna sadly have to get up at five o'clock in the morning so I can get through airport security in time for the game. So I'm hoping the game's settled in 90 minutes.\n\"If it's not, if it goes to penalty shootout, then I'm gonna miss the ending.\"\nBut he will not be missing the end of the All Blacks' match against England on Saturday evening at Eden Park.\n\"I'll be going to the game, so I'm really looking forward [to it].\"",
  "word_count": 1025,
  "scraped_at": "2026-02-14T01:54:45.418730",
  "_text_extracted": true
}