{
  "article_id": "632c8c8eb4c0",
  "url": "https://www.geo.tv/latest/476510-how-many-teams-will-feature-in-fifa-world-cup-2026",
  "title": "How many teams will feature in FIFA World Cup 2026 ? ",
  "date": "20230315T183000Z",
  "domain": "geo.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "March 15, 2023\nKIGALI: The expanded 2026 men’s World Cup in North America will start with 12 groups of four teams in a change from the originally planned format of 16 groups of three, football’s world governing body FIFA announced on Tuesday.\nThe next World Cup in the United States, Canada, and Mexico will be the first to feature 48 teams, a sharp increase from the 32 sides at last year's tournament in Qatar.\n\"The revised format mitigates the risk of collusion and ensures that all the teams play a minimum of three matches while providing balanced rest time between competing teams,\" FIFA said.\nIt means that there will be 104 matches, a huge rise compared to the 64 games played in the 2022 tournament, and an increase even on the original plan that the 2026 World Cup would feature 80 matches.\nFIFA’s initial plan for 2026 was for 16 groups of three teams, from which the top two countries would advance to the last 32.\nThe new format means the top two in each group will go through to the knockout round along with the eight best third-placed sides.\nAs a result, the finalists, and the teams finishing third and fourth, will play a total of eight games instead of the current seven.\nThe decision comes after a dramatic and entertaining group stage at the tournament in Qatar convinced FIFA that a rethink to its original 2026 blueprint was needed.\n\"The groups of four have been absolutely incredible until the last minute of the last match,\" FIFA president Gianni Infantino said in December.\nTuesday’s decision was announced following a FIFA Council meeting in the Rwandan capital Kigali, at which it confirmed the next men’s World Cup final will be played on Sunday, July 19, 2026.\nFIFA said that the total number of days between when clubs must stop playing and release players for international duty, and the final, would be 56, identical to the previous three tournaments.\nNevertheless, the World Cup itself may be played over a longer period, after Qatar 2022 was held over just 29 days.\nInfantino is expected to be waved in for a new four-year term as president as he stands unopposed for re-election at Thursday’s FIFA Congress.\nExpanding the World Cup had been a priority for Infantino following his election in 2016, when he took over from the disgraced Sepp Blatter at the head of world football.\nThe last World Cup in North America, in the United States in 1994, featured just 24 teams before it grew to feature 32 teams in France four years later.\nThe number of venues for the 2026 finals will double, from eight stadiums in Qatar last year to 16.\nEleven venues will be in the USA, with three in Mexico and two in Canada.\nFIFA has projected a huge increase in revenues in the four-year cycle leading up to 2026, up to $11 billion from $7.5 billion in the four years up to 2022.\nThe body is also hoping that a new, expanded 32-team Club World Cup will boost revenues too.\nFIFA said Tuesday the competition will start in June 2025 and will be held every four years with club rankings determining qualifiers.\nHowever, an annual competition will also be held, similar to the existing seven-team Club World Cup which is to be discontinued after the 2023 edition.\nThe yearly competition will involve the six continental club champions and conclude with a final at a neutral venue between the winner of the UEFA Champions League and the winner of the play-offs between the other teams.\nThe annual tournament was approved \"given the need expressed by the confederations for the champions of their premier club competitions to play each other annually to stimulate competitiveness\", FIFA said.",
  "word_count": 627,
  "scraped_at": "2026-02-14T02:16:40.073448",
  "_text_extracted": true
}