{
  "article_id": "63537f1c4bb2",
  "url": "https://www.caughtoffside.com/2024/06/17/aston-villa-finding-it-difficult-to-offload-coutinho/",
  "title": "Aston Villa finding it difficult to offload Coutinho due to his crazy demand",
  "date": "20240617T173000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa’s efforts to offload Philippe Coutinho is proving to be more challenging than expected.\nThe former Liverpool star was initially set to join Brazilian club Vasco da Gama on a year-long loan, with the deal becoming permanent next year. However, the transfer has hit several roadblocks.\nInitially, the deal seemed straightforward, but complications have since emerged leading to suggestions that the club would terminate Coutinho’s contract, allowing him to leave on a free transfer.\nWhile it was thought that financial issues were at the heart of the delay, the latest reports from Brazilian outlet O Dia, as reported by Sport Witness, indicate otherwise.\nThe primary issue, as reported, is Coutinho’s demand that Vasco da Gama sign two of his friends as part of the deal. The players in question are Josef de Souza, a midfielder currently with Basaksehir, and Alex Teixeira, a free-agent striker. This unusual request has reportedly not been well-received by the Brazilian club.\nDespite the bizarre demands, the report suggests that the deal might still go through. Vasco da Gama are considering their options, even though they are not entirely happy with Coutinho’s conditions.\nCoutinho’s incredible decline\nCoutinho’s career trajectory has been one of the most dramatic declines in recent football history.\nOnce considered one of the best midfielders in the world during his time at Liverpool, Coutinho’s forced move to Barcelona in January 2018 marked a turning point.\nDespite a high-profile transfer, he failed to make a significant impact at Camp Nou and was loaned out to Bayern Munich for the 2019/2020 season.\nWhile Coutinho won the Champions League with Bayern Munich, his individual performances were inconsistent, leading the German club to opt against making the move permanent.\nUpon his return to Barcelona, his fortunes did not improve, resulting in another loan spell, this time with Aston Villa.\nCoutinho’s initial impressive performances for Aston Villa led to a permanent deal in 2022. However, he struggled with consistency once again and eventually fell out of favour under manager Unai Emery. This resulted in a loan move to Qatari side Al-Duhail in 2023 for the remainder of the season.\nAs Aston Villa look to offload Coutinho, the situation remains fluid. The club is keen to resolve the matter swiftly, but Coutinho’s demands are complicating negotiations.\nVilla might prefer to just have his contract terminated so they do not have to be involved in the drama.",
  "word_count": 398,
  "scraped_at": "2026-02-14T01:57:18.894907",
  "_text_extracted": true
}