{
  "article_id": "636d3d78a6de",
  "url": "https://www.derbytelegraph.co.uk/news/taylor-swift-fans-enjoying-derby-9359131",
  "title": "Taylor Swift fans will be enjoying Derby doughnuts at her Wembley concerts",
  "date": "20240621T134500Z",
  "domain": "derbytelegraph.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Taylor Swift fans will be enjoying Derby doughnuts at her Wembley concerts\nCity company Project D has won the contract to supply the sweet treats at nine concert nights now and in August\nTaylor Swift fans are expected to go do(nuts) for a limited-edition range of specially made Swiftie sweet treats, which will be on sale in Wembley at all of her sold-out shows. Derby bakery Project D has been granted licensing permission to produce the Taylor-made doughnuts which will be available at eight concession stands within the stadium.\nThe American megastar will be performing at Wembley today (Fri), tomorrow (Sat) and Sunday and again between August 15 and 20 as part of her worldwide Eras Tour.\nThe artisan bakery, based at Spondon, will be selling the Lover doughnut which is dipped in pink coloured, white chocolate and drizzled with ice blue white chocolate to replicate the album cover of the same name. While the Gorgeous is dipped in silver white chocolate icing, sprinkled with pearl crunch and freeze-dried raspberries.\nThe sequinned superstar is due to play to almost 750,000 fans during the nine nights at Wembley and according to Barclays, Swifties will spend an average of £848 each on the event.\nJoin us on WhatsApp to get the latest news straight to your phone\nProject D sells handcrafted, brightly coloured and Instagram-friendly doughnuts across the UK and has won a contract to sell within Wembley stadium and all of its events.\nMost recently the company attended the UEFA Champions League final where its specially-designed blue doughnut with silver stars – replicating the UEFA logo – was a huge hit with football fans.\nMarketing director Max Poynton said: “Taylor Swift’s Wembley gigs are probably the biggest concerts in the UK this year, so we are really thrilled to be a part of it. “Our contract with Wembley is very exciting – we have attended some really major events including NFL matches and the Champions League Final and we know our doughnuts are popular at these sorts of events.\n“We think every Swiftie will be keen to enjoy one of our specially designed doughnuts. But before anyone else volunteers to help on the day – we are fully staffed on all our concession stands. We’ve never had so many volunteers.\"\nWe send out the biggest stories in an email every day. Sign up for the main Derbyshire Live newsletter here.",
  "word_count": 399,
  "scraped_at": "2026-02-14T02:13:55.818564",
  "_text_extracted": true
}