{
  "article_id": "638d378bc8bb",
  "url": "https://www.90min.com/posts/man-utd-arsenal-chelsea-newcastle-target-open-january-move",
  "title": "Man Utd , Arsenal , Chelsea & Newcastle target open to January move",
  "date": "20231222T123000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd, Arsenal, Chelsea & Newcastle target open to January move\n- Benjamin Sesko playing second fiddle to Lois Openda at RB Leipzig\n- Towering 20-year-old striker interested in Premier League move in January\n- Man Utd, Chelsea and Arsenal among long-term admirers\nBenjamin Sesko, a long-term target for Manchester United, Arsenal, Chelsea and Newcastle United, is open to a Premier League move in January, 90min understands.\nThe 20-year-old joined RB Leipzig from sister club Salzburg last summer, but has played second fiddle to the outstanding Lois Openda during the first few months of the 2023/24 season.\nSesko has started just three Bundesliga matches from a possible 16, with the majority of his appearances coming in short cameos from the substitutes' bench, and got the nod in just two of Leipzig's six Champions League group games.\n90min has reported extensively on the interest from Premier League sides in Sesko, most notably from United, Arsenal and Chelsea, while Newcastle have also kept a close eye on the Slovenian's development.\nIntermediaries had previously made it known that Sesko could be available to move in January, with more playing time firmly on the agenda as he prepares to lead the Slovenia line at Euro 2024.\n90min understands that nothing has changed in that regard, and all interested Premier League clubs have again been informed of the potential of agreeing a deal. A loan with an obligation to buy, should certain criteria be met, has been suggested, and Sesko's game is one many top scouts feel is suited to top-level English football.\nLeipzig paid just £20m for Sesko last summer and would rather keep him at the club as they bid to join Bayer Leverkusen in attempting to dethrone Bayern Munich. But the opportunity to cash in on Sesko and potentially double their money is something that would not be dismissed out of hand.\nManchester United signed Rasmus Hojlund in a deal potentially worth £72m in the summer, but he could be the club's only recognised striker next summer should Anthony Martial leave on a free transfer as expected.\nArsenal's first-choice striker Gabriel Jesus has struggled with injury problems, leading Mikel Arteta to consider alternative options, while Chelsea are yet to provide Mauricio Pochettino with the out and out number nine he desperately needs at Stamford Bridge.\nNewcastle would appear to be in the healthiest position, with Alexander Isak and Callum Wilson their options, but they too have struggled to stay fit during an injury-ravaged season on Tyneside.",
  "word_count": 414,
  "scraped_at": "2026-02-14T01:56:38.143564",
  "_text_extracted": true
}