{
  "article_id": "63a222301703",
  "url": "https://www.90min.com/features/10-best-players-champions-league-quarter-finals-ranked-2023-24",
  "title": "The 10 best players from the Champions League quarter - finals",
  "date": "20240418T150000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 10 best players from the Champions League quarter-finals - ranked\n- Real Madrid, Paris Saint-Germain, Bayern Munich and Borussia Dortmund into semi-finals\n- Ousmane Dembele, Antonio Rudiger and Joshua Kimmich among standout performers\n- Reigning champions Manchester City eliminated on penalties\nThe quarter-finals of the 2023/24 Champions League are in the history books and boy did we enjoy a feast of unbelievable football.\nFour teams are left standing after eight enthralling games of football, highlighted by Paris Saint-Germain's tremendous comeback against Barcelona and Real Madrid's dethroning of reigning champions Manchester City.\nBorussia Dortmund are also in the mix after dispatching Diego Simeone's dogged Atletico Madrid, joining Bundesliga rivals Bayern Munich - the conquerors of Arsenal, who were made to pay for their inability to capitalise on home advantage in the first leg.\nThere were a number of outstanding individual displays, as you might expect, with the following ten players the ones to really stand out on the biggest stage in European football.\n10. Federico Valverde (Real Madrid)\nValverde's sensational volley ensured Real Madrid took away a share of the spoils with Manchester City at the Bernabeu - the sixth goal of a truly absorbing contest.\nThe Uruguayan then reinforced his ability to do absolutely everything by providing Dani Carvajal with a superb shield during the return leg, and genuinely did not stop running.\n9. Joshua Kimmich (Bayern Munich)\nBayern Munich may have surrendered their Bundesliga crown to Bayer Leverkusen, but did people really think they were going to roll over against Arsenal?\nThe consensus was that Mikel Arteta's side would prove to be far too strong over two legs, but Joshua Kimmich had other ideas as Arsenal attempted to win away at Bayern for only the second time in their history.\nHe scored the winning goal in the second half, sending the Bavarian giants through to a mouthwatering semi against Real Madrid.\n8. Andriy Lunin (Real Madrid)\nWith Thibaut Courtois out injured and Kepa, well, Kepa, it was down to Andriy Lunin to deliver the goods between the sticks for Real Madrid.\nThe 25-year-old clearly understood the brief, making a number of smart saves across the 120 minutes of action before denying Bernardo Silva and Mateo Kovacic in the penalty shootout. Unsurprisingly, Lunin was Madrid's player of the match.\n7. Leon Goretzka (Bayern Munich)\nMost people associate Leon Goretzka with one of the greatest physical transformations of modern times.\nNow they'll be associating the German with a superbly efficient performance in Bayern's midfield - one that dominated Arsenal's tiring midfield to end their European adventure. Still, a Champions League journey to be proud of, right?\n6. Raphinha (Barcelona)\nBarcelona may have succumbed to Paris Saint-Germain to complete La Remontada 2.0, but it wasn't for the want of trying on Raphinha's part.\nThe Brazilian winger dazzled in the first leg in Paris, scoring a brace, and it was his goal that extended Barcelona's aggregate advantage to 4-2. Sadly, teammate Ronald Araujo hadn't read the script on how to defend one-on-one - much to Ilkay Gundogan's dismay - and his red card led to Barca's unfortunate, but also funny, collapse.\n5. Kylian Mbappe (PSG)\nKylian Mbappe's going to win the Champions League in his final season with Paris Saint-Germain, isn't he?\nHe's then going to pack his bags to Real Madrid, making everybody involved a winner. Happy days.\n4. Julian Brandt (Borussia Dortmund)\nIf anybody tells you they had Borussia Dortmund down to make the last four of the Champions League, they're lying.\nIt's not a lie, however, to say that Julian Brandt was absolutely brilliant against Atletico Madrid - the 27-year-old's goal getting the party started in a six-goal thriller at Signal Iduna Park.\n3. Ousmane Dembele (PSG)\n9,144 injuries plagued Ousmane Dembele's six-year tenure at Barcelona, leading many to conclude that the Frenchman's stay made him one of the worst transfers of all time.\nThe 26-year-old sought a fresh start in the summer, returning to France to join PSG, and decided the hilarious thing to do would be to haunt his former club by scoring in both legs of their quarter-final tie.\nDembele's all-around play was outstanding too, reminding many of his undeniable talent.\n2. Antonio Rudiger (Real Madrid)\nStopping the Erling Haaland goal juggernaut isn't a job many defenders have completed successfully, particularly in the Champions League.\nBut Antonio Rudiger isn't any old central defender, rather it appears he's one of the world's very best. Sure, his mistake led to Kevin De Bruyne's equalising goal at the Etihad, but his complete nullification of Haaland in both legs was a sight to behold.\n1. Vitinha (PSG)\nThe undisputed player of the round was Paris Saint-Germain's Vitinha, whose menacing, penetrating runs were far too much for Barcelona, even when they had 11 players on the field, to handle.\nThe Portuguese maestro rocketed a tremendous low drive into Marc-Andre ter Stegen's bottom right corner to hand PSG the advantage on aggregate, and his relentless energy and drive was key to Luis Enrique's side ensuring they retained the upper hand.",
  "word_count": 838,
  "scraped_at": "2026-02-14T01:51:24.797519",
  "_text_extracted": true
}