{
  "article_id": "63ab97d630f9",
  "url": "https://metro.co.uk/2025/11/26/estevaos-agent-reveals-close-teenage-sensation-came-joining-barcelona-24848707/",
  "title": "Estevao agent reveals how close Chelsea wonderkid came to joining Barcelona",
  "date": "20251126T193000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Estevao’s agent says Barcelona were offered the chance to sign the forward before he joined Chelsea – but had to pull out of a proposed deal due to their precarious financial situation.\nThe 18-year-old attacker is widely considered to be among the most exciting young talents in world football and continues to go from strength to strength across a phenomenal debut season with Chelsea.\nOn Tuesday night, Estevao showed Barca exactly what they let slip through their grasp with a scintillating individual display as the two sides met in the group stage of the Champions League.\nThe Brazilian’s sublime solo effort to double Chelsea’s lead sent the Stamford Bridge faithful into raptures, while chants of ‘You’re just a s*** Estevao!’ were directed at Lamine Yamal from the stands.\nOnly Kylian Mbappe and Erling Haaland had managed to find the net in each of their first three starts in the competition before Estevao’s sumptuous 55th-minute strike past Joan Garcia in west London.\nAfter Liam Delap added a third to put the game to bed, a beaming Estevao described his incredible goal as the most ‘special’ of his career on what was a ‘perfect night’ for him personally.\nHe will no doubt be looking to pick up where he left off when the Blues return to Premier League action away to top-of-the-table Arsenal this weekend.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpeaking to Cadena SER in the wake Chelsea’s 3-0 win, Estevao’s representative, Andre Cury lifted the lid on Barcelona’s long-held interest in his the youngster, stretching back to 2019.\n‘In 2018 I started doing reports on Estevao,’ he explained.\n‘In 2019, I took Eric Abidal (Barcelona’s former sporting director) to Brazil to watch one of his matches and you could already see when he was 11 years old that he was different and that he wanted to be a Ballon d’Or winner.’\nCury continued: ‘I’ve always talked about him and now what I said is starting to come true.\n‘I spoke with Barcelona about Estevao in 2021, 2022, 2023, and 2024. We went to their offices to offer the player because I believed he had a great future in world football.\n‘However, Barca aren’t in a good financial position and sometimes a deal can’t be made. It’s a shame.’\nMetro at the Match: Chelsea 3-0 Barcelona\nMetro's Ben Fleming breaks down the action with the winners and losers from Stamford Bridge:\nNeto impresses in new role\nGiven the start as the central striker with Joao Pedro and Liam Delap benched, Pedro Neto was a livewire up in attack. A lack of composure let him down at points, but deploying him centrally could be a great option to provide Estevao with more minutes from the start.\nEstevao outshines Yamal\nOnly 18, but Estevao already looks like a man for the big occasion. A winner against Liverpool last month and now a sublime goal to virtually put this game to bed. The Brazilian easily won the battle of the teenage sensations.\nCucurella the cult hero\nA faultless display from Cucurella at left-back. Provided plenty of support to Garnacho in the final third, and kept his fellow countryman Lamine Yamal quiet for virtually the entire 90 minutes. Revered by the fans who sang his name all night long.\nFull Chelsea ratings: Sanchez 7, Gusto 6, Fofana 7, Chalobah 7, Cucurella 8.5, James 6, Caicedo 7, Estevao 9, Fernandez 6, Garnacho 6, Neto 7. Subs: Santos 7, Delap 6, Gittens N/A, Acheampong N/A, George N/A.\nYamal kept quiet\nLost his battle up against Cucurella and struggled to have any real impact on the game. Not helped by his side going down to ten men, but a visit to London to forget for the supremely talented teen, who made way to jeers from all four sides of Stamford Bridge.\nAwful Araujo\nThe rank opposite of a captain's display from Ronald Araujo. Picked up his first yellow for dissent and sent for an early bath before the half-time whistle for a clumsy challenge on Cucurella. Cost his team.\nFull Barcelona ratings: Joan García 5, Kounde 6, Cubarsi 5, Araujo 3, Balde 5; Eric García 5, De Jong 6, Fermin 6, Yamal 5, Lewandowski 5, Ferran Torres 5. Subs: Rashford 5, Raphinha 5, Christensen 5, Martin N/A, Olmo N/A.\nCury claims to have spoken directly with Barcelona sporting director Deco on more than one occasion, but the ‘atmosphere’ was never right for the club to sign Estevao.\n‘The technical staff always approved of Estevao’s signing and we met with Deco more than once,’ he added.\n‘But Deco is tied to the club and the club’s finances don’t allow for a signing for the future.\n‘For example, with Vitor Roque, the club rushed into a mistake. A player can’t be signed and then, after four months, no longer be useful.\n‘With what happened to Vitor, the atmosphere wasn’t right to sign Estevao.’\nAccording to Cury, Estevao has a ‘special affection’ for Barcelona and would be capable of playing alongside Yamal in the same team.\nMore Trending\nHowever, he insists the Brazil international is ‘enjoying himself’ at Chelsea and there are no plans regarding a move to the Camp Nou at this stage.\n‘Think of the Neymar-Messi duo… it’s better than just having Messi or just having Neymar,’ he said.\n‘Estevao has five years left on his contract and is enjoying himself at Chelsea.\n‘He has a special affection for Barca.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Enzo Fernandez reveals the fatal mistake Hansi Flick made against Chelsea\nMORE: Manchester United’s £36.5m signing agrees January transfer with new club\nMORE: Scott McTominay compared to Arsenal star and tipped for Premier League return",
  "word_count": 1006,
  "scraped_at": "2026-02-14T02:06:26.678285",
  "_text_extracted": true
}