{
  "article_id": "63daf376254b",
  "url": "https://www.aol.co.uk/barcelona-gambled-marcus-rashford-must-053000529.html",
  "title": "Barcelona have gambled on Marcus Rashford – he must prove he is worth it",
  "date": "20250720T064500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona have gambled on Marcus Rashford – he must prove he is worth it\nMarcus Rashford would not have been a consideration for Barcelona even four weeks earlier when a club racked by debt, but addicted to spending, were stopped in their tracks from signing the Spain international Nico Williams by Athletic Bilbao.\nSo much so that Athletic issued a statement outlining a meeting with La Liga president Javier Tebas – an act of self-defence from a sustainable Basque club that simply had enough of Barcelona’s transfer-window posturing. Athletic sought clarification that Barcelona, with about €3 billion (£2.6 billion) of total debt, and having failed La Liga’s financial controls last season, could not sign Williams. Tebas was only too happy to confirm that was the case.\nDeco, the former Portugal international, now Barcelona sporting director, had been explicit about the club’s interest in Williams, valued at around €60 million. The player was naturally unsettled. But under La Liga’s rules that link spending to revenue, Barcelona were not in a position to register new players under the ‘one in, one out’ limitations placed upon them. It had been Athletic who first noticed the case of the phantom €100 million missing from Barcelona’s accounts, which had originally been used to justify the budget for last summer’s signing, Dani Olmo.\nWilliams duly signed a new 10-year contract at Athletic. Barcelona remain unable to explain how the hole left by that projected €100 million revenue from VIP seats as yet unsold, in a new stadium as yet unbuilt, will be filled. Into this comes Rashford, a 27-year-old who has fallen out with his second Manchester United manager, and needs a new club. By the end of next season, he will have spent 18 months on loan, although whether he will be in a position to make a move permanent will be determined by his performances.\nBarcelona are the champions of Spain but they are not the transfer market powerhouse of old. The only transfer fee signing this summer, €25 million for the Espanyol goalkeeper Joan García, has not yet been officially registered with La Liga. This is becoming an annual problem for Barcelona. Unless space is made in the squad’s wage bill, new players cannot be registered.\nOften Barcelona have to wait for an injury in order to convince La Liga they can switch out a player. In the case of García, the club are keen for captain Marc-André ter Stegen to leave. It is rarely straightforward. The third-choice goalkeeper may yet need surgery.\nIt may well be the same for Rashford once the deal is completed. Barcelona have pulled every lever they can to generate revenue, but it no longer stretches to big transfer fees. The €80 million valuation on Liverpool’s Luis Díaz was out of Barcelona’s reach.\nFor them, Rashford is worth the gamble, especially with United eager to do a deal. A big name in the European game, Rashford is easier to sell to fans. He was even one of the stars of England’s famous win over Spain in Seville in 2021. The player himself has worked hard to position himself as a Barca-enthusiast in interviews to local media. The big question will be what proportion of those £325,000-a-week wages Barcelona will have to pay. Either way, all three parties find themselves in a corner.\nUnited will always regret the five-year contract they gave Rashford in the summer of 2023 after his best season at the club. As for Rashford, the test will be whether Barcelona still want him at the end of the season. Barcelona is one of the great names in European football although one could say the same about United. The move represents a chance for Rashford, although much relies on him now. Like Raheem Sterling, who scored twice that night in Seville, he has the contract he would have hoped for in his prime years – but not the career.\nForward suits Spanish giants’ style of play\nBarcelona have sold much of the future to finance the present, including, in 2022, 25 per cent of Liga television rights for the next 25 years to pay for some of the key men in the current title-winning team. They have announced a delay in moving into their new stadium – now September at the earliest, placing in grave doubt whether those €100 million of VIP seats can be declared as income again this season. What they have never ceased to do is produce brilliant young talent from their academy.\nLamine Yamal, Gavi, Pau Cubarsi, and, to a lesser extent, Pedri and Ronald Araújo have all come through the academy. This cohort has sustained the team, and as yet no rival have been able to use Barcelona’s financial situation to sign one of them. As for, Rashford, himself once the poster boy of the United academy, he finds himself at a club where there is no guaranteed starting place in the front three and where home-grown talent is given a chance. There will be competition.\nNevertheless, there is no better chance for Rashford than this one – playing in the Champions League for a second consecutive year, while United are out of the competition again. He could hardly have talked up his wish to play for Barcelona any more than he has, so one can only suppose that he regards this as the best chance. Certainly there are few more glamorous clubs with whom to make one’s comeback. He also suits their style of play.\nIn a different era, under different circumstances, Rashford might have been Barcelona’s marquee signing of the summer – prised away from Old Trafford by a combination of a huge fee and the player’s desire to taste something different. This loan move is borne of very different circumstances, for both the clubs and the player himself. Of all three it feels like Rashford comes out of it the winner, although as he knows, football can change very quickly.",
  "word_count": 992,
  "scraped_at": "2026-02-14T02:02:51.948405",
  "_text_extracted": true
}