{
  "article_id": "64202e0ae914",
  "url": "https://metro.co.uk/2025/05/24/arsenal-stun-barcelona-win-womens-champions-league-final-23239022/",
  "title": "Arsenal stun Barcelona to win Women Champions League final",
  "date": "20250524T191500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal pulled off a major upset with a 1-0 win against Barcelona in the Women’s Champions League final on Saturday.\nSwedish striker Stina Blackstenius, on as a second-half substitute, scored the winner in the 75th minute as she was picked out with an excellent pass from Beth Mead before she finished low past Barcelona goalkeeper Catalina Coll.\nThe Gunners were required to defend for large parts of the game against a Barcelona team who were heavy favourites to win the Champions League for the third year running after they hammered Chelsea, who won the domestic treble this season, with an 8-2 aggregate victory in the semi-final.\nArsenal won the Women’s Champions League in 2007 and remain the only English club to have lifted the trophy.\nBut Arsenal’s achievement in Europe this season is even more remarkable given their rocky start to the campaign which saw them win just one of their opening four Women’s Super League games and suffer a heavy 5-2 defeat to Bayern Munich in the Champions League.\nJonas Eidevall resigned as manager in October and Renee Slegers was appointed as an interim replacement, however, an upturn in form led to the 36-year-old getting the job on a permanent basis in January.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut despite getting their WSL season back on track, a deep run in the Champions League looked unlikely for Arsenal after a 2-0 defeat away to Real Madrid in the quarter-final.\nSlegers’ side staged an impressive comeback in the return leg at the Emirates Stadium with a 3-0 victory to progress to the semi-final.\nArsenal were forced to come from behind once again after a 2-1 defeat at home to eight-time winners Lyon in the first leg of semi-final, and a 4-1 victory in the return leg in France booked their place in the final against Barcelona.\nThe Catalan club dominated for large parts of Saturday’s final and had 20 shots on goal, but a resilient Arsenal display limited their clear-cut chances inside the box.\nLeah Williamson, who was a mascot in Arsenal’s win in the 2007 final, delivered a brilliant performance at the heart of the Gunners’ back line against Polish striker Ewa Pajor, who has scored 41 goals in her debut season for Barcelona.\n‘A lot of this team have been together for a long time and to be able to do it on the biggest day. Some people had the game of their lives. I am so happy,’ Williamson said after Arsenal’s win.\n‘We changed the gameplan a bit in the week because we wanted to feel more confident and that paid off.\n‘In the first half we had chances and I don’t think people believed how good they were. We said ‘second half we just need one chance’ and Stina took it.’\nArsenal thought they had taken the lead in the first half when Frida Maanum delivered a low cross and the ball was turned into her own net by Irene Paredes.\nHowever, a VAR check revealed that Maanum had gone too early and was offside.\nArsenal were forced to defend deep after the break and capitalised with a quick move which was finished superbly by Blackstenius.\n‘We knew it was going to be a game where momentum shifts because we respect Barcelona, who they are, and how good they are on the ball. But we also know how good we are,’ Sleger’s said after her side’s triumph.\n‘We knew momentum was going to shift. Maybe other people were thinking something else but that’s what we believed.\n‘We spoke about getting through the first 10-20 minutes and managing the game because they normally come out fast. They came here confident and with all respect, we had to manage that phase of the game.\nMore Trending\n‘In all the phases that happened we showed the mentality, the resilience, the effectiveness in all our actions and the belief was incredible.\n‘There is so much strength in this team. They are such good footballers, otherwise you don’t get to a European final.\n‘The biggest shift they have made and what they have shown is the mentality, the willingness to work, to engage, to solve problems, and not only in game but every single training day.\n‘It means so much to the club. They have been world leading in so many things in women’s football that they deserve it. Not only this year but many years before so it’s fantastic.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Sunderland stun Sheffield United in play-offs to secure Premier League promotion\nMORE: Ruben Amorim tells Manchester United star to ‘find a new club’ after Europa League final\nMORE: Hansi Flick sends message to ‘fantastic’ Marcus Rashford over Barcelona transfer",
  "word_count": 849,
  "scraped_at": "2026-02-14T02:09:11.449857",
  "_text_extracted": true
}