{
  "article_id": "6422bd21e06f",
  "url": "https://www.nytimes.com/athletic/6512697/2025/07/31/arsenal-fans-across-continents-3am-kick-offs-church-services-and-bergkamp-dvds/",
  "title": "Arsenal fans across continents : 3am kick - offs , church services , and Bergkamp DVDs",
  "date": "20250731T060000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For UK-based fans, pre-season is when they get a taste of what it’s like to be an international fan.\nThis summer’s tour to Singapore and Hong Kong has given British fans early afternoon kick-offs during the working week. Recent tours to the U.S. have been trickier, leaving them with the dilemma of whether sleep is really that important as kick-off times stretch into the early hours.\nAdvertisement\nFor Arsenal fans across the world, these considerations are weekly rather than annual. While the 60,000 who rock up to the Emirates Stadium every other week may be a visible example of fandom, Arsenal’s impact goes way beyond that small pocket of north London.\nThe club celebrate that with stadium artwork, including a collage of more than 150 international supporter clubs.\nBut what is it like to be an international fan? The Athletic has spoken to five people, across five continents, to find out.\nOceania\nThere’s probably no better place to start than time zones.\nArsenal’s most common kick-off time since 2020 has been at 4.30pm UK time on Sundays. That is Sky Sports’ prime spot on ‘Super Sunday’.\nNathan Asi grew up in Auckland, New Zealand. They are 11 hours ahead of London in the winter and 12 in the summer.\n“If you see a 10.30 kick-off time, you’re blessed,” he tells The Athletic. “Kick-offs are usually around 1.30-3am, so you just stay up the entire night. I either watch by myself or we go to a friend’s house.\n“When I’m hanging out with my friends, we all support different teams and wear our own kits.”\nEveryone has their own story on how they became a football fan, even if some are similar. Asi’s friend group in Auckland is made up of a Manchester City fan who followed his dad’s path, a West Ham fan whose favourite player was Mark Noble, and a Brighton & Hove Albion fan who wanted to root for an underdog.\nWithout the geographic connection, the spark for Asi’s support of Arsenal may be familiar for those who grew up in the late 1990s and early noughties.\n“My dad is a big Ajax supporter and his favourite player growing up was Dennis Bergkamp,” he adds. “When Bergkamp moved to Arsenal, he began following them, too. He had this DVD of all of Bergkamp’s goals for Arsenal, so I grew up watching Bergkamp highlights over and over again from the age of four or five.”\nAdvertisement\nElsewhere in the region, Arsenal Women have a strong Australian contingent, with Caitlin Foord, Steph Catley, and Kyra Cooney-Cross. In fact, an Australian flag was in view from a local apartment when Arsenal Women had their Champions League-winning celebrations at the Emirates Stadium.\nSome love being shown for Australia from a nearby apartment pic.twitter.com/iZxJizGB9a\n— Art de Roché (@ArtdeRoche) May 26, 2025\nWhen it was pointed out to Catley, she stopped the interview to take a picture of it, before saying: “This time last year, we were playing in Melbourne and there were almost more Arsenal shirts in the crowd than for the Aussies. It’s overwhelming and very special to be a part of.”\nNorth America\nArsenal’s ability to connect people in unexpected ways is just as strong on the opposite side of the globe.\nSupporter clubs under the umbrella of Arsenal America, founded in 2001, have helped build Arsenal’s footprint Stateside. They have over 70 branches.\nLaurie Laker, Arsenal America’s head of communications, was born in Taunton, Somerset. Arsenal runs through generations of the Laker family, with Laurie’s uncle playing for the reserve teams in the 1960s and his grandfather collecting autographs from Herbert Chapman’s teams from the 1930s.\nHe moved to the U.S. aged 11 in 2001, but football fell by the wayside. “I kept in touch with it over chatrooms, but didn’t get introduced to Arsenal America until I was in graduate school in New Hampshire in around 2013,” he tells The Athletic.\n“I walked into the Boston Arsenal America pub and was confronted by about 70 people singing the same songs I’d known since I was a kid. I wondered ‘Where’s this been for the last 10 years?’. Since then, it’s been one of the most important parts of my life.”\nAlso a supporters club branch manager for Twin Cities Gooners (Minneapolis-St. Paul), part of Laker’s role is to help organise matchday gatherings in Minneapolis.\nAdvertisement\nThat will involve finding a reliable pub to show matches that can be open an hour or so ahead of kick-off. They average around 250-300 supporters in attendance for big matches, but that figure can drop for midweek matches when people are at work.\nArsenal’s earliest kick-off times (12.30pm UK time) could range from 5.30am to 7.30am depending on what coast you live on in the States. That’s why Laker says: “It’s not about replicating the matchday experience that people get at the Emirates.\n“The social element is really important in motivating you to get out of bed and essentially commute to a pub that could either be around the corner or half an hour away. It’s about being in a space with people who are part of your community, but who you may not have met without that space. Sometimes they become lifelong friends.”\nAfrica\nThat community aspect can manifest itself in many ways.\nArsenal Kenya were founded in 2010 by Deno Alves and officially recognised by Arsenal in 2012. Their banners incorporate the Swahili phrase ‘Hakuna Matata’, which means ‘No worries’ in English and was popularised by the 1994 film The Lion King.\nThey have 2o branches across the country’s 47 counties, and some may be familiar with videos of the Nairobi group’s church services where almost everyone attends in Arsenal gear.\nRather than being church services specifically about Arsenal, they are normal Sunday services that may fall on the day of a game. Churches will be informed about the incoming sea of red shirts, but will also have their regular attendees.\n“There are so many Arsenal fans it’s like a takeover,” Alves tells The Athletic. “Almost three-quarters of attendees will then be wearing Arsenal jerseys. That understandably makes headlines.”\nWhile Nairobi is mostly Christian, other cities such as Mombasa have a Muslim majority, so some areas will have interdenominational services that incorporate multiple religions.\nAdvertisement\nThe communities also help on a more personal level. Since its formation, Arsenal Kenya has built an emergency kitty for registered members who may be in need. That could help people who have accidents, need burials, or in more long-term ways.\nhttps://t.co/ZJ3QKLURnC pic.twitter.com/dTK8uSFaOE\n— Arsenal Kenya Supporters’ Club (@ArsenalKenya_AK) February 13, 2025\n“An actual example is a lady called Rose,” Alves says. “In 2011, she used to come to our events and we noticed she appeared alone. She was an orphan, but was also having a baby of her own and was very sick.\n“She passed away a few months later, leaving behind a newborn baby. We educated that child, took care of her bills, and now she’s in high school. She’s called Blessing and we had a charity tournament last August in her name. When she gets through university, it will go to another cause.”\nSouth America\nAs was the case with Asi in New Zealand, players are still the ones who can transcend a club beyond their own borders. The influx of top African talents such as Kanu, Kolo Toure, Lauren and Emmanuel Adebayor helped Arsenal’s presence grow on that particular continent around the turn of the century.\nIn South America, the appreciation of players works slightly differently.\nColleen Cheyenne Wilson is from east London. She regularly attended matches growing up, but has lived in Colombia for the past two years and works as a teacher. She tells The Athletic: “This area loves Real Madrid. Even if I thought Arsenal would have a good chance against them in the Champions League, that wasn’t the perception here.\n“To not just beat them, but do it twice with the phenomenal performances of Declan Rice really changed the perception of Arsenal.\n“Bukayo Saka was the first player on people’s lips when talking about modern Arsenal. I’ve not heard the word ‘Rice’ said so much since those games. I got so many texts saying ‘Wow, Rice. What a player. I had no idea!’. That was culturally significant not just in Arsenal’s history, but all over South America, and he probably doesn’t even know it.”\nChampions League games are often the hardest to catch in South America. They take place during the working day, but luckily, a public holiday fell on the days when Arsenal faced Madrid.\nAdvertisement\nThat did not mean Wilson felt more support for the club as the semi-final clashes with Paris Saint-Germain approached, however.\n“They get really into the tribalism,” she says of her students. “There are videos of me in my Arsenal shirt going around to terrorise all of them because they’re huge Real Madrid fans. When it came to the PSG games, every day I came in they’d chant ‘PSG! PSG!’. They even stuck PSG shirts all over the school.\n“Tribalism is rooted here because football is life. Even off-licenses and malls have TVs only with football matches on.”\nThat tribalism also works differently in Colombia compared with England. While members of supporters groups are die-hard, more casual fans will support their own Colombian team and maybe two European teams, such as Real Madrid and Manchester City.\nWith that the case in Wilson’s class, she had the perfect chance to get back at them when Arsenal thrashed City 5-1 in February.\n“We’d been bantering throughout the year, so it was a bubbling pot,” she says. “I thought, ‘They’re not going to want to see me if Arsenal win’. So I had a photo of Myles Lewis-Skelly doing the Haaland celebration hidden, and as soon as I turned on the projector, they all started screaming.”\nMy students support City and today was the first day back… pic.twitter.com/U9VGXXtgCI\n— colleenchey (@colleenchey) February 4, 2025\nAsia\nIn some places, it is not always easy to find somewhere showing the game. The Athletic had first-hand experience of this out in Tokyo, Japan, back in November 2023.\nPubs in the city centre, Shibuya, were showing Manchester City versus Liverpool, but not Brentford versus Arsenal immediately after. It was understandable. Arsenal were kicking off at 2am, so it was time to embark on an hour-long post-midnight walk to find Highbury — The Home of Beer in Shinjuku, where you were greeted with a simple question: What do you think of Tottenham?\nAround 10-15 people were inside at kick-off, when the pub transformed into more of a cinema. The shutters outside came down, the lights were turned off, and the TV volume shot up.\nAdvertisement\nThe locals watching spoke Japanese between themselves for the majority of the game, other than the occasional ‘Shoot!’ or ‘Go!’ in English. Well, that was until about 4am.\nThe game was goalless until the 89th minute, when Bukayo Saka picked out Kai Havertz at the back post to win the game in the last minute. It was Havertz’s second goal for Arsenal, and his first since a new chant had begun for him. The locals went straight into full English: “Sixty million down the drain, Kai Havertz scores again!”\nIt was 6am by the time The Athletic hit the pillows in Yokohama, but this is the experience of many international fans, not just of Arsenal.\n“I tread both lines,” Laker says. “You might never get to see this team play in the flesh, so you will pour everything into watching them at 5am with your mates at the pub. That becomes your Emirates Stadium. The idea that international fans are not proper fans is b*******.\n“These are people just like me, they just happen to be born somewhere else. Being an international fan takes a hell of a lot of commitment, time, money and a lack of sleep.\n“It’s a very different experience but no less important.”",
  "word_count": 1993,
  "scraped_at": "2026-02-14T02:09:18.620709",
  "_text_extracted": true
}