{
  "article_id": "64436a9f75d5",
  "url": "https://metro.co.uk/2025/03/03/alan-shearer-names-surprise-favourite-win-fa-cup-22661928/",
  "title": "Alan Shearer names his surprise  favourite  to win the FA Cup",
  "date": "20250303T230000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alan Shearer has named his surprise ‘favourite’ to win the FA Cup ahead of Premier League champions Manchester City.\nEight teams remain in football’s oldest cup competition following an intriguing and entertaining round of fixtures in the fifth round.\nMan City ended Plymouth Argyle’s dream FA Cup run which included a famous victory over current Premier League leaders Liverpool.\nPep Guardiola’s side, already out of the title race and the Champions League following a surprising poor run, will face high-flying Bournemouth for a place in the semi-finals.\nBournemouth have emerged as surprise top-four contenders this season and beat Wolves on penalties to set up a quarter-final tie against Manchester City.\nOne London club will be in the hat for the semi-finals as Fulham prepare to host Crystal Palace in the quarters, with the former knocking out Manchester United and the latter overcoming Championship side Millwall.\nChampions League club Aston Villa travel to Championship outfit Preston, who thumped Lancashire rivals Burnley 3-0 to continue a memorable FA Cup run.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe final quarter-final tie sees Brighton take on Nottingham Forest, who beat Ipswich Town on penalties in the last fifth-round clash.\nWith the likes of Liverpool, Arsenal and Chelsea out, seven-time winners Manchester City have a superb chance to finish a difficult season with another FA Cup trophy, but Shearer believes Aston Villa are in fact ‘favourites’ to win the competition.\nSpeaking on The Rest is Football podcast, the ex-England striker said: ‘Aston Villa have got really good attacking options, Unai Emery can swap them around like he has done.\nFA Cup quarter-final draw\nFulham vs Crystal Palace\nPreston vs Aston Villa\nBournemouth vs Manchester City\nBrighton vs Nottingham Forest\n‘I would perhaps have Aston Villa as favourites for this competition now. If they can get one or two defenders back from the treatment room then they will be hard to beat.\n‘I know it’s away from home but their draw against Preston, they can’t really complain about that. I quite fancy Aston Villa. They could have an unbelievable season, one to really remember.\n‘They’re going well in the Champions League and are close to that top-four in the Premier League. If they can just get one or two players back it could be a great finish to the season because those January signings have served them well and will do for the rest of the season.’\nResponding to Shearer’s surprising FA Cup claim, former Premier League defender Micah Richards added: ‘I totally agree.\n‘I think Unai Emery is a genius. Tactically he knows exactly what he wants. It was a masterstroke getting in that calibre of players in January.\n‘They’ve got quality all over. He’s doing a brilliant job, it could be a remarkable season for Aston Villa.\nMore Trending\n‘I will still go with Man City just because of their experience. In a one-off game they can still produce something special so I will go with Man City, just.’\nGary Lineker, meanwhile, is backing Bournemouth to produce a stunning FA Cup win following their progress under the impressive Andoni Iraola.\n‘I think Man City are most likely but I’m going to pluck out Bournemouth,’ Lineker said.\n‘There’s one for you! I like Areola, I think he’s got something, and they’ve already beaten Man City this season. We shall see.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Petr Cech defends Arsenal’s decision to sell world-class player\nMORE: Andy Cole reveals the ‘worst player’ in Manchester United training\nMORE: Were Man Utd right? Enzo Maresca told Chelsea star will ‘never be consistent’",
  "word_count": 659,
  "scraped_at": "2026-02-14T02:08:52.945265",
  "_text_extracted": true
}