{
  "article_id": "645f46555a22",
  "url": "https://www.caughtoffside.com/2024/08/24/sources-update-tottenham-chase/",
  "title": "Tottenham transfer news : Eberechi Eze unlikely to sign",
  "date": "20240824T100000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "With a week to go until the closure of the summer transfer window, it would appear that Tottenham Hotspur still want to get some business done.\nThe North Londoners landed Dominic Solanke from Bournemouth, as well as Archie Gray, Lucas Bergvall and Wilson Odobert, with a handful of players being allowed to leave.\nIn order to remain competitive at the top of the Premier League, however, Spurs ideally need to land one or two more established names.\nTottenham turn away from potential Eze capture\nIt’s thought that the club had a long-standing interest in Crystal Palace ace, Eberechi Eze, however, it appears as though that pursuit could well be dead in the water.\nAccording to Football Insider sources, the Lilywhites are now unlikely to pursue a deal for the England international, and will instead concentrate on bringing in a new centre-back and central midfielder.\nClearly, Ange Postecoglou believes that the spine of his team needs attention as the Australian seeks to find the formula to ensure that the squad are up at the top of the Premier League table and at the very least, challenging for a finish in the Champions League places.\nThat, perhaps, will also require a change in the mentality at the club.\nPostecoglou appeared genuinely aghast towards the back end of the 2023/24 campaign at the attitude being display by certain members of club staff as well as supporters.\nIt was as if stopping Arsenal winning the league was more important that Tottenham ending the campaign in the top four.\nOf course, the Lilywhites did lose to Man City in the run in, a result which no doubt helped Aston Villa to pip them to the post at the death.\nHad Spurs beaten the champions, it would’ve been they and not Unai Emery’s side that would’ve been looking forward to a Champions League campaign this season.",
  "word_count": 310,
  "scraped_at": "2026-02-14T01:57:35.673293",
  "_text_extracted": true
}