{
  "article_id": "647e60473567",
  "url": "https://www.caughtoffside.com/2024/06/04/spurs-draw-up-five-man-striker-shortlist/",
  "title": "Tottenham draw up five man shortlist as they look to sign a new striker",
  "date": "20240604T211500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham are looking to sign a new centre forward this summer and have drawn up a five man shortlist according to reports.\nAnge Postecoglou arrived from Celtic last summer and guided Spurs to a fifth placed finish and Europa League football in his first season in charge.\nSpurs lost Harry Kane last summer, and didn’t replace the England captain, and instead deployed Heung-Min Son down the middle with Richarlison used as an alternative.\nTottenham have five man striker shortlist\nSon did well last season and scored 17 goals and provided ten assists from 35 appearances in the Premier League, but if Spurs are going to get back into the Champions League they need will need to add more firepower.\nSpurs have already extended Timo Werner’s loan from RB Leipzig for another season, but still need to try and replace Kane.\nRicharlison had his season disrupted by injury, and despite scoring 11 Premier League goals last season, he’s largely failed to live up to expectations following his £60m move from Everton in 2022.\nGIVEMESPORT report the names on the Spurs shortlist are PSV Eindhoven’s Santiago Gimenez , Brentford’s Ivan Toney, Stuttgart’s Serhou Guirassy, Lois Openda of RB Leipzig and Sporting Lisbon star Viktor Gyokeres.\nToney is the only striker on the list with Premier League experience, whilst Guirassy represents the best value for money with a release clause of just £15m.\nGyokeres would command a big transfer fee and has a release clause of around £85m, whilst Openda and Gimenez are regarded as two of the best young strikers in Europe.\nSpurs do have some great attacking options in their squad with the likes of Son, Werner, Brennan Johnson, Dejan Kulusevski and Richarlison.\nIf Postecoglou is backed by Daniel Levy and they bring the right name in Spurs could cause problems next season, and they would have every chance of getting back in the Champions League and challenging for trophies.",
  "word_count": 319,
  "scraped_at": "2026-02-14T02:01:16.444505",
  "_text_extracted": true
}