{
  "article_id": "6486756fb375",
  "url": "https://www.newkerala.com/news/o/arsenals-gabriel-ruled-out-thigh-injury-brazil-duty-811",
  "title": "Arsenal Defender Gabriel Injured on Brazil Duty Ruled Out",
  "date": "20251116T200000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "London, Nov 16\nArsenal defender Gabriel has been ruled out of action after sustaining a muscle injury in his right thigh, the Brazilian Football Confederation (CBF) confirmed on Sunday. The setback occurred during Brazil’s friendly match against Senegal, played at Arsenal’s home ground in North London, where the centre-back was forced off the pitch after experiencing discomfort.\nThe 27-year-old has been a central figure in Arsenal’s defensive setup this season, featuring in every Premier League game as the Gunners sit four points clear at the top of the table. However, his latest injury means he will not join the national squad for their next international friendly against Tunisia in Lille on Tuesday. The CBF, while confirming his withdrawal, did not specify the duration of his potential absence, leaving both club and country awaiting further medical evaluation.\nThis is not the first time Gabriel has battled fitness issues this year. A hamstring injury in April kept him sidelined for more than three months, and Arsenal will be wary of rushing him back given the demanding run of fixtures ahead. The Gunners face crucial Premier League clashes against Tottenham Hotspur and Chelsea later this month, followed by a significant Champions League encounter at home against Bayern Munich on November 26. His absence presents a major concern for manager Mikel Arteta, especially with the squad already dealing with multiple injuries.\nGabriel’s setback adds to Arsenal’s growing list of unavailable defenders. Italian international Riccardo Calafiori also picked up an injury while on national duty, as confirmed by Italy coach Gennaro Gattuso. Meanwhile, the club continues to cope with injuries to attackers Kai Havertz, Viktor Gyokeres, Noni Madueke, Gabriel Martinelli, and captain Martin Odegaard.\nThere is some positive news at the club, though, with forward Gabriel Jesus returning to training after recovering from a cruciate ligament injury suffered in January, though he has yet to make a competitive appearance.\n- IANS",
  "word_count": 316,
  "scraped_at": "2026-02-14T02:03:26.529219",
  "_text_extracted": true
}