{
  "article_id": "649413fd4f9e",
  "url": "https://english.aawsat.com/sports/5031040-best-way-england-approach-euro-2024-all-out-attack",
  "title": "The Best Way for England to Approach Euro 2024 ? All - out Attack",
  "date": "20240615T063000Z",
  "domain": "english.aawsat.com",
  "source_country": "Syria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "All-out attack could be the way to go for England at the Euros considering the array of talent at Gareth Southgate’s disposal and the defensive uncertainty.\nHarry Kane, Phil Foden, Bukayo Saka and Jude Bellingham, to name a few, have all had incredible seasons at club level and if they can translate that to the international scene, it could make England one of the most feared sides in the competition. However, getting the balance right will not be easy.\nSouthgate’s success with England has been built on strong foundations. He is a defensively minded manager and he cannot be criticized for that because it has taken England to a European Championship final and World Cup semi‑final but never before has he had such an exciting group of forwards to choose from. It is easier said than done when coming up against the continent’s best but it would make sense to change old habits and go for it. He may see it as a risk but it would be a calculated one.\nEveryone witnessed how Foden embraced the responsibilities that are involved with being a No 10 for a top club and I would love to see him play more centrally for his country where he can do the most damage. England need to harness the form Foden has shown in the Premier League and give him the freedom to hurt opponents.\nHe was at the centre of everything within a fantastic Manchester City side, leading to a fourth consecutive title. Even if you had not seen what he had done all season, he managed to sum up his qualities on the final day as they won the title. These are pressure games and in the opening three minutes he had created a chance from nothing and thrashed a shot into the top corner to take City one step closer to the title. If he can have the same influence for England, it could be seismic.\nKane is a guaranteed starter and is another peaking with 44 goals in all competitions in his first season at Bayern Munich. Moving to Germany has not derailed his prolific scoring record and a year at a club like Bayern can only help his growth. He will be excited by the players behind him creating chances. Saka had nine goal assists in the Premier League this season and scored 16 as he continues to flourish.\nThis is the most exciting and attacking England squad we have ever seen. Bellingham has just won La Liga with Real Madrid. A lot of the season under Carlo Ancelotti he has been playing as a No 10 but also as a false 9 at times and is another attack-minded player in the mix. For all of his qualities going forward, Bellingham is not the best off the ball defensively but that is never going to be his strength, so trying to make him sit will not work. He has become one of the best in Europe thanks to his late runs that have brought him 19 La Liga goals this past season.\nAny team with Kane, Saka, Foden and Bellingham would be exciting to watch. I would personally like to see Cole Palmer start because he, too, has been incredible this season after moving to Chelsea from Manchester City, enjoying 33 goal involvements in 34 Premier League appearances (22 goals and 11 assists). That would be with Bellingham dropping back to play with Declan Rice in a 4-2-3-1 but this might be too adventurous for Southgate. However I think when you have a group like this, playing those in the best form can make the difference. That front four exudes confidence.\nSouthgate, however, often prefers putting out an experienced team in major tournaments, knowing that those who have accumulated a large number of caps can cope with the occasion.\nThis will be a top-heavy team in terms of attacking players. That is where the highest quality is, leaving Southgate wondering how he can bring balance. He will need to be tactically astute to get the right answers and that is not straightforward when the squad is together for such a short period. The players are used to working in complex systems under Guardiola, Mikel Arteta and Thomas Tuchel, for example, but they will need to pick up their various responsibilities quickly.\nThe potential issues in defense add to the complexity of what Southgate has to navigate. He will need to decide whether to be more gung-ho to counteract being susceptible at the back or to offer extra protection. Without a natural second defensive midfielder, there will be a lot of onus on Rice to provide the protection the defense needs, especially one that will begin without a recognized left-back and with a centre-back pairing who have not played together regularly.\nSouthgate will need to be clever to ensure the liberation of his attackers does not make England excessively open at the back. One solution would be to play Trent Alexander-Arnold at right-back, although this would be a difficult choice to make because it would be tough to leave out Kyle Walker, or Stones at centre-back from where they can move into midfield next to Rice, giving Bellingham greater opportunity to push forward.\nThere are difficult choices to make for the back-up on the bench too – an indication of how good English players have been this season. Ollie Watkins would be my choice as Kane’s understudy. He scored 19 for Aston Villa and assisted a further 13, the highest in the Premier League, to help secure Champions League football for his club. Watkins is likely to be one of a group of forward-thinkers desperate to make an impact off the bench. We will potentially see Anthony Gordon, Eberechi Eze and Palmer in that role. They can all be gamechangers.\nEvery fan would love to see the England men’s team just go for it at a major tournament for the first time in a long time. It might make Southgate a little uncomfortable because it goes against what he has built in the past for England but it could offer the extra edge needed at major tournaments.\nKaren Carney",
  "word_count": 1029,
  "scraped_at": "2026-02-14T01:51:32.432357",
  "_text_extracted": true
}