{
  "article_id": "64a9a65dab42",
  "url": "https://www.fourfourtwo.com/news/liverpool-have-a-realistic-chance-of-winning-the-champions-league-jamie-carragher-offers-ambitious-prediction-for-202425",
  "title": "  Liverpool have a realistic chance of winning the Champions League : Jamie Carragher offers ambitious prediction for 2024 / 25",
  "date": "20240815T210000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "‘Liverpool have a realistic chance of winning the Champions League’: Jamie Carragher offers ambitious prediction for 2024/25\nLiverpool won the Carabao Cup in Jurgen Klopp's final season in charge but Jamie Carragher is predicting more silverware under Arne Slot\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nLiverpool are preparing for life under a new era as Arne Slot prepares to take charge of his first competitive game as manager.\nSlot replaced the ever-popular Jurgen Klopp on Merseyside this summer, with the 57-year-old having enjoyed nine successful years at Anfield. The Reds are set to compete on four different fronts once again this campaign, with Champions League football to come after a third-place finish in the Premier League.\nSlot has only ever taken charge of six games in Europe's elite club competition beforehand during Feyenoord's 2023/24 group-stage endeavours. Former Liverpool defender Jamie Carragher has, however, despite Slot's seeming inexperience in the competition, issued a bold claim regarding his chances with Liverpool this year.\nWATCH | Why Liverpool Want Arne Slot So Badly\n“We’re in a position where we’re all surprised and pleased that Liverpool had such a good season last year, off the back of a poor one, but with Liverpool we’ve got\nsome of the best players in Europe,\" Carragher began, speaking via a special Sky Sports feature looking at the hopes of all 92 clubs in the EFL.\n\"We’re bringing a good manager in, and I’m sure we’ll bring one or two players in, and we have a big squad.“The idea of Liverpool having a year off and letting the manager settle in is something I don’t agree with. We did that when I played, whenever a manager came in it was a five-year plan.\n\"For me, this doesn’t happen at other clubs who have had success like Chelsea, Manchester United, or Manchester City – you’ve got a new manager and of course you have to give him time to adapt, but I want us to challenge on all fronts, we’re Liverpool.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"We have a realistic chance of winning the Champions League, and that’s the pressure of managing Liverpool.“I’m sure the manager will be thinking that he needs to get top four, and it would be lovely to win a trophy – that would be a great season. I just want us to make sure that we compete for everything. We didn’t win everything under Jürgen Klopp, but we competed.”\nJamie Carragher was speaking on behalf of Sky Sports as part of its start of season football campaign which brings together 92 passionate football fans from each team across the Premier League & EFL to share their hopes for the 2024/25 season.\nMore Liverpool stories\nLiverpool are braced for a huge £100m bid for a key first-teamer, while the Reds still retain interest in one Premier League attacker. Maxence Lacroix has been touted to replace Joel Matip, while the Merseysiders are poised to sign a superstar Alisson replacement on bargain deal.\nMeanwhile, Jamie Carragher has exclusively told FourFourTwo that his former side overperformed last season – and that no one expects the Premier League title in Arne Slot’s first campaign.\nMatthew Holt writes freelance for FourFourTwo, amongst others, and boasts previous experience at GOAL and SPORTBible. He now works with us alongside his time at Manchester United and Reach PLC, aiding with online content for the website. Career highs include working at the FA Cup final, as well as scoring at Old Trafford in front of the Stretford End. A long-term sufferer of his beloved Scunthorpe United, he is often seen on the padel court, as well as occasionally as a six-a-side call-up.",
  "word_count": 721,
  "scraped_at": "2026-02-14T02:10:58.957374",
  "_text_extracted": true
}