{
  "article_id": "64b7166f2d25",
  "url": "https://www.nytimes.com/athletic/6884298/2025/12/15/brazil-carlo-ancelotti-contract-talks/",
  "title": "Brazil and Carlo Ancelotti in advanced talks to extend contract beyond 2026 World Cup",
  "date": "20251215T111500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Brazilian Football Confederation (CBF) is in advanced talks with men’s head coach Carlo Ancelotti over extending his contract through to 2030.\nAncelotti, 66, was appointed to the role in May on an initial one-year deal which runs until the end of the 2026 World Cup.\nThe Italian, Brazil’s first foreign head coach, departed Real Madrid at the end of the 2024-25 season to replace Dorival Junior at Brazil, who was dismissed in March after 14 months in charge.\nAdvertisement\nAncelotti took charge of the remaining four matches of Brazil’s 2026 World Cup qualifying campaign. He oversaw two wins, one draw and one loss to finish fifth in South America’s round-robin qualifying format, ensuring that the nation’s record of qualifying for every edition of the tournament remained intact.\nDuring October’s international break, Brazil beat South Korea and were defeated by Japan in international friendlies, before beating Senegal and drawing with Tunisia in November.\nCBF president Samir Xaud expressed his interest in extending Ancelotti’s deal in November.\n“I see this conversation in a positive light,” he said when asked about the possibility.\n“He already said in an interview that it depends on both sides. I always believe in building a working relationship. Everything is there for it to succeed.”\nOne of the most successful coaches in history, Ancelotti is a five-time Champions League winner and has won six league titles across spells with Milan, Chelsea, Paris Saint-Germain, Bayern Munich and Madrid.\nThe 2026 World Cup will mark the first time Ancelotti has led a national side at the tournament, having served as Arrigo Sacchi’s assistant as Italy reached the final in 1994.\nBrazil are seeking a first World Cup triumph since 2002, having exited at the quarter-final stage at the two most recent tournaments.\nAll three of their group stage games next summer will take place in the United States — they will play Morocco at MetLife Stadium in East Rutherford, New Jersey, Haiti at Lincoln Financial Field in Philadelphia, Pennsylvania and Scotland at Hard Rock Stadium in Miami, Florida.",
  "word_count": 339,
  "scraped_at": "2026-02-14T02:12:17.563256",
  "_text_extracted": true
}