{
  "article_id": "64bc254a6d66",
  "url": "https://www.bbc.co.uk/sport/football/67747317",
  "title": "Champions League last - 16 draw : Man City to face Copenhagen , Arsenal play Porto",
  "date": "20231218T164500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League last-16 draw: Man City to face Copenhagen, Arsenal play Porto\n- Published\n- comments\nManchester City will play Copenhagen in the last 16 of the Champions League, while Arsenal face Porto.\nDanish champions Copenhagen, who finished above Manchester United in their group, reached the knockout stage for the first time since 2011.\nHolders City will play the first leg in Denmark on 13 February, with the return at Etihad Stadium on 6 March.\nArsenal face Porto in Portugal on 21 February, with the return at Emirates Stadium on 12 March.\nRecord 14-time winners Real Madrid meet RB Leipzig, while Inter Milan - runners-up last season - take on Atletico Madrid, and Bayern Munich face Lazio.\nThe final takes place at Wembley on 1 June.\nLast-16 draw\nPorto v Arsenal\nNapoli v Barcelona\nParis St-Germain v Real Sociedad\nInter Milan v Atletico Madrid\nPSV Eindhoven v Borussia Dortmund\nLazio v Bayern Munich\nCopenhagen v Manchester City\nRB Leipzig v Real Madrid\nPremier League leaders Arsenal, who topped Group B but have never won the Champion League, beat Porto 5-0, external at Emirates Stadium the last time they met in 2010.\nRunners-up in Portugal's Primeira Liga last season, Porto won four of their six Group H games to finish level on points with Group H winners Barcelona.\nCity won Group G with a 100% record, while Copenhagen, who lost 1-0 at United before beating them 4-3 at home, were runners-up to Bayern in Group A.\nCity have progressed from the last 16 in the past six seasons.\nAnalysis\nIan Dennis, BBC Radio 5 Live senior football reporter\nThe draw has been very kind to the two English teams and both should be very happy.\nArsenal have won all three previous encounters against Porto, although they have never won at the Estadio do Dragao.\nCity played Danish champions Copenhagen in the group stage last season, drawing 0-0 in Denmark but winning handsomely 5-0 at home.\nEuropa League play-off draw\nThe Europa League knockout round play-off draw also took place on Monday.\nThere was no British interest, with West Ham, Brighton, Rangers and Liverpool among the eight group winners automatically advancing to the last-16 stage, which will be played on 7 and 14 March.\nThey will be joined by the winners of the play-offs, contested by eight runners-up from the Europa League group stage and eight third-placed teams from the Champions League group stage.\nThese ties will be played on 15 and 22 February.\nFeyenoord v Roma\nLens v Freiburg\nBenfica v Toulouse\nGalatasaray v Sparta Prague\nAC Milan v Rennes\nYoung Boys v Sorting Lisbon\nSporting Braga v Qarabag\nShakhtar Donetsk v Marseille\nEuropa Conference League play-off draw\nEight teams are safely through to the last 16 of the Europa Conference League, including Aston Villa.\nThey will be joined by the winners of the knockout round play-offs, contested between eight runners-up from the Europa Conference League group stage and eight third-placed teams from the Europa League group stage.\nThese ties will also be played on 15 and 22 February.\nSturm Graz v Slovan Bratislava\nServette v Ludogorets\nUnion Saint-Gilloise v Eintracht Frankfurt\nReal Betis v Dinamo Zagreb\nOlympiakos v Ferencvarosi\nAjax v Bodo/Glimt\nMolde v Legia Warsaw\nMaccabi Haifa v Gent\nTwelve things you might not know about Disney: How did the media giant go from a young animator’s dream to a cultural kingdom?\n'A new generation of remarkable people': Sir David Attenborough introduces conservation heroes fighting to save the world's wildlife",
  "word_count": 581,
  "scraped_at": "2026-02-14T02:10:33.596741",
  "_text_extracted": true
}