{
  "article_id": "64d940a2447d",
  "url": "https://www.teamtalk.com/tottenham-hotspur/already-considering-kolo-muani-replacement-114-goal-striker-target-ticks-every-box",
  "title": "Tottenham news : Spurs already considering Kolo Muani replacement - 114 - goal striker target ticks EVERY box",
  "date": "20251015T004500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nTottenham already considering Randal Kolo Muani replacement and 114-goal striker target ticks EVERY box\nIt’s being reported that Tottenham Hotspur are already considering moving on from Randal Kolo Muani, with feelers already put out over a deal for a 114-goal striker ahead of the January transfer window.\nBar a couple of blips, Spurs have started the new campaign strongly under Thomas Frank as they sit third in the Premier League table and have taken four points from their opening two Champions League outings.\nHowever, the No.9 position has been a problem in the early part of the season, with the notoriously injury-prone Richarlison having been the only fit central striker for a number of weeks.\nThat has led to Frank having to use Mathys Tel as the alternative to the Brazilian, and that has given Tottenham a lack of a focal point at some junctures in games.\nThe absence of loan signing Kolo Muani has been a particular blow, with big things expected of the France international after his deadline day switch from PSG.\nIndeed, Kolo Muani has only made one cameo appearance from the bench so far, having suffered a dead leg in training, although he could be back this weekend against Aston Villa.\nDespite that, a report from Spain claims that Juventus and Serbia frontman Dusan Vlahovic could be on his way to north London in the new year.\nSpanish daily Quotidiano Sportivo claims that Vlahovic’s representatives have previously offered the striker to Tottenham, with a fresh update revealing how the north London club are ready to act on that approach.\nDespite scoring four times for Juve so far this season, Vlahovic’s future remains up in the air, with the 25-year-old no closer to signing a new contract in Turin as his current deal ticks down to the summer.\nThat has led to his agent pushing hard to try and find a new home for his client, with Tottenham and London rivals Chelsea both firmly in the mix for his signature.\nDON’T MISS ➡️ Premier League signings of the season power ranking: New top two as Liverpool, Chelsea stars fall\nKolo Muani still keen on Juventus return\nQuotidiano Sportivo adds that Vlahovic is now being lined up as a potential replacement for Kolo Muani, especially as there is no option or obligation to buy when it comes to the agreement with PSG.\nIndeed, Kolo Muani remains interested in a return to Juventus, where he impressed during a temporary stint in the second half of last season.\nAs for Vlahovic, his wage demands, when it comes to a new deal in Turin, are currently proving too high – although that is not expected to be a problem in north London.\nIndeed, Spurs are actively moving towards handing out more lucrative deals to their top players and potential new signings, especially after the £100million injection of capital from majority owners Enic.\nAs for whether or not Vlahovic would be an upgrade on Kolo Muani, it’s very hard to tell given that neither player has spent time in English football – bar the latter’s 13-minute cameo for Spurs, and even that was in the Champions League.\nVlahovic is arguably the bigger goal threat of the two, however, and has been earmarked as a player whose game suits the Premier League for a number of years.\nLatest Tottenham news: Huge Real Madrid raid; midfield signing exclusive\nFirst up, Tottenham are reportedly ready to do ‘whatever it takes’ to sign an incredible LaLiga talent in the January window, with TEAMtalk analysing how that could be potential bad news for summer signing Xavi Simons.\nElsewhere, Spurs are the latest club to express interest in signing Rangers and Belgium ace Nico Raskin, sources have revealed to TEAMtalk, and with the cost of a potential move likely to set a new transfer record at Ibrox.\nAnd finally, Tottenham want to make a signing in a surprise position in 2026 and TEAMtalk can shed light on what this means for the star who’ll potentially be replaced.\nHAVE YOU JOINED?💫 Get the inside story first by joining the TEAMtalk Facebook channel to receive the latest breaking and exclusive news straight into your Messenger inbox.",
  "word_count": 702,
  "scraped_at": "2026-02-14T01:52:49.025959",
  "_text_extracted": true
}