{
  "article_id": "64de72cd9ddf",
  "url": "https://www.caughtoffside.com/2025/10/17/tottenham-aston-villa-make-enquiry-rayan-newcastle/",
  "title": "Tottenham , Newcastle and Aston Villa interested in Rayan",
  "date": "20251017T221500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vasco da Gama attacker Rayan has been linked with a move away from the club in recent weeks, and multiple Premier League clubs are keen on him.\nAccording to a report from NT Vascainos, Tottenham and Aston Villa have made enquiries for the highly talented attacker, and it will be interesting to see if they follow up on their interest with an official proposal to sign him.\nChelsea have been linked with Rayan as well. The attacker has 15 goals in 45 games for Vasco da Gama.\nNewcastle keen on Rayan\nMeanwhile, Yasir Al-Rumayyan wants to sign the player for Newcastle United. It will be interesting to see where he ends up. The South American is highly rated, and he could prove to be a solid long-term acquisition for all three English clubs. The opportunity to move to the Premier League will be quite exciting for him.\nThe 19-year-old has shown his quality in Brazil, and he will look to test himself in the Premier League. Regular football in England could bring out the best in him and help him develop further. It could accelerate his development.\nRayan could improve further in England\nTottenham, Newcastle and Aston Villa have quality managers at their disposal who could nurture him into a future star. The Brazilian will certainly hope to complete and move to the Premier League in the coming months.\nThe three Premier League clubs have the financial muscle to pay a reasonable fee for the attacker as well. It remains to be seen whether Vasco da Gama are prepared to sanction his departure.\nThe young attacker will want to compete at the highest level, and the likes of Tottenham and Newcastle will be able to provide him with Champions League football. It remains to be seen where he ends up eventually. All three clubs could use more depth in the attacking unit, and the Brazilian would be a long-term investment.",
  "word_count": 320,
  "scraped_at": "2026-02-14T01:52:49.023787",
  "_text_extracted": true
}