{
  "article_id": "65090f3cd6e9",
  "url": "https://www.justarsenal.com/top-ten-african-gunners-number-4/406093",
  "title": "Top Ten African Gunners – Number 4 - Just Arsenal News",
  "date": "20251216T134500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pierre-Emerick Aubameyang’s departure from the Emirates continues to divide the Arsenal fanbase to this day. For some supporters, his exit helped Mikel Arteta establish authority and set a clear example for the rest of the squad. For others, it represented poor man management that ultimately cost Arsenal a place in the top four that season. The team was left relying on Eddie Nketiah to push for Champions League qualification, while their former captain was scoring goals in Spain. There is a feeling among some fans that the Kroenke family should have insisted that the manager’s remit included getting the best out of the resources he inherited, rather than normalising the practice of discarding talent and terminating contracts.\nA proven goalscorer at a crucial time\nIt can be argued that Arsenal have not had a truly consistent goalscorer since Robin van Persie, and have continued to lack one since. In Aubameyang’s first full season in English football, he shared the Golden Boot, underlining his value in front of goal. Like many forwards of his generation, he idolised Thierry Henry and enjoyed drifting wide before cutting inside, a trait that suited Arsenal’s attacking style at the time.\nArsenal have lifted 14 FA Cups in their history, and Aubameyang scored both goals in the most recent final the club won. That achievement is permanent and cannot be taken away from him. At that moment, it appeared he was on course to at least attempt to cement legendary status in north London. Few would have realised at Wembley that day that it marked the beginning of the end of his Arsenal career.\nTalent, personality, and professionalism\nAubameyang’s legacy may ultimately be shaped by the balance between his love for football and his wider interests. He is passionate about the game, but he also openly enjoys superheroes, WWE, and fast cars. That made him relatable to supporters, a player living his dream while staying true to himself, yet it also raised questions about reliability in a professional environment. Timekeeping had previously been an issue in Germany, so this was not an unknown risk.\nBy contrast, figures such as Cristiano Ronaldo often speak about sacrificing every aspect of their lifestyle to maximise performance. It is debatable whether Aubameyang operated with the same mindset. Still scoring regularly for Marseille, some would argue that he remains a more natural finisher than Arsenal currently possesses.\nDan Smith\n______________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 473,
  "scraped_at": "2026-02-14T01:52:59.293499",
  "_text_extracted": true
}