{
  "article_id": "651bec5976c6",
  "url": "https://menafn.com/1107574286/Napoli-Hope-For-Home-Comforts-In-Braga-Decider",
  "title": "Napoli Hope For Home Comforts In Braga Decider",
  "date": "20231211T204500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Napoli Hope For Home Comforts In Braga Decider\nWalter Mazzarri said on Monday that he wants Napoli to end their home hoodoo by beating Braga and confirming a spot in the last 16 of the Champions League.\nNapoli haven't won in Naples since late September, with four defeats and two draws from their most recent six matches at the Stadio Diego Armando Maradona.\nA single-goal defeat on Tuesday would still allow the ailing Italian champions, who are second in Group C and three points ahead of Braga, passage on goal difference but Mazzarri wants to invert a worrying trend on home turf.\n\"I'm not thinking about anything other than that we have a match at home against a team worthy of respect, we need to win it,\" Mazzarri told reporters.\n\"And tomorrow we need to not give them anything, because that will help us continue in a similar vein between now and the end of the season.\"\nMazzarri has had a rough start to his second spell as Napoli coach, losing three of his first four matches after taking over from the sacked Rudi Garcia last month.\nAfter winning at Atalanta on his second debut the 62-year-old had to take on Real Madrid and Juventus away, while the only home match he has faced so far was against Serie A leaders Inter Milan, who have been Italy's best team since the start of the season and earned a convincing 3-0 win.\nNapoli played some bright football in those defeats, in particular in Madrid where they went toe-to-toe for long period with the Spanish giants.\nThat has been cause for limited optimism despite falling 14 points behind Inter and effectively surrendering their league title before the end of the calendar year.\n\"I think the team has shown that it knows how to play football. But we need to rediscover the balance that they had last season, that's my main aim,\" added Mazzarri.\n\"We've been lacking, results wise... But what really interests me is getting out of the group while also showing that we're a solid team again, that we don't gift anything to the opposition.\"\nBefore the pre-match press conference Mazzarri told Sky that Victor Osimhen might not start Tuesday's match as he travelled on Monday to Marrakesh, where he could be crowned African Footballer of the Year.\nOsimhen, who is yet to score in this season's Champions League, is up against Mohamed Salah and Achraf Hakimi for the continental gong and Mazzarri said \"I'll talk to him tomorrow and see if he can start\".\nNapoli are set to lose the Nigeria forward for the Africa Cup on Nations, which starts in the Ivory Coast on January 13, after being without their star striker for weeks with a hamstring injury.\nKhvicha Kvaratskhelia is struggling with a heavy cold but should start as he tries to overcome underwhelming form after dazzling Europe last term.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 538,
  "scraped_at": "2026-02-14T02:25:08.294977",
  "_text_extracted": true
}