{
  "article_id": "654779ee6925",
  "url": "https://www.france24.com/en/europe/20240614-germany-aim-regain-past-lustre-under-new-coach-julian-nagelsmann-euro-2024",
  "title": "Germany aim to regain past lustre under new coach Julian Nagelsmann for Euro 2024",
  "date": "20240614T060000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Germany aim to regain past lustre under new coach Julian Nagelsmann for Euro 2024\nHaving fallen into a slump since winning the World Cup in 2014, Germany’s national team, the Mannschaft, has rediscovered its dynamism and ambition since Julian Nagelsmann was appointed head coach in September. Hosts Germany are among the favourites to win Euro 2024, with fans nostalgic for the upbeat mood when the Germans organised the World Cup in 2006, remembered as a “summer fairytale”.\n“I have the feeling that we can win. And most of the time, my intuition is not too bad,” says Julian Nagelsmann, the Germany coach, who publicly displays great confidence ahead of the start of Euro 2024, which kicks off on Friday, June 14.\nGiven its stellar track record in major competitions, the calibre of players selected and the advantage of hosting the competition, Germany are logically among the favourites alongside France and England.\nBut even if it has won four World Cups and three European Championships, the Mannschaft has been unable to win the Euro since 1996 – an eternity for this giant of football.\nGermany stopped winning\nSince winning the World Cup in Brazil in 2014, the Germans have been in the doldrums, woefully eliminated in the group stages of the last two World Cups (2018, 2022), and knocked out by England in the round of 16 of the previous Euro, in 2021.\nSo German fans are eagerly anticipating this European Championship on home ground, especially given a group stage that looks quite manageable: Scotland in the opening match, followed by Hungary and Switzerland.\nNagelsmann, 36, who replaced Hansi Flick last fall at the head of a Mannschaft in crisis, has reason to be confident. He has shown that his players are capable of the very best, beating such high profile opponents as France (2-0) and the Netherlands (2-1) in two friendlies in March.\nA former Bayern Munich coach, Nagelsmann is known for his powers of persuasion: he succeeded in coaxing Toni Kroos, a six-time Champions League winner with Real Madrid and arguably the best German player of the last decade, out of international retirement for Euro 2024.\nHe has also shown he is willing to make difficult choices, such as when he dropped several key players from his Euro squad, including Mats Hummels, Borussia Dortmund’s solid central defender and 2014 world champion.\nTo display this content from X (Twitter), you must enable advertisement tracking and audience measurement.\nWirtz and Musiala, two rising stars\nFor this Euro, the Mannschaft coach has relied heavily on the group of players who impressed against Les Bleus in March. “We’ve changed the squad very little, because it was good,” said Nagelsmann when he unveiled his team for the tournament on May 16.\nWhile he will be relying on key players like captain Ilkay Gündogan and goalkeeper Manuel Neuer, who has not played for his country since 2022 because of injury, the coach will be entrusting the team’s attack to two very young players who have been lighting up the Bundesliga this season: Jamal Musiala and Florian Wirtz, both 21.\nMusiala, who already featured at the 2022 World Cup, is improving with every game he plays for Bayern Munich.\nTo display this content from X (Twitter), you must enable advertisement tracking and audience measurement.\nNewly-crowned Bundesliga champion Florian Wirtz has shown astonishing efficiency in front of the goal with Bayer Leverkusen and is the main architect of their title-winning season, scoring 11 goals and delivering 11 assists in 32 matches.\nHoping for another Sommermärchen\nIn preparation for Euro 2024, Germany first faced Ukraine on June 4, a match that allowed for a wide-ranging review of the squad and ended in a 0-0 draw, despite 26 German shots.\nThe Mannschaft botched their final warm-up match three days later against Greece, despite eventually prevailing 2-1 thanks to an 89th-minute goal.\nThat lacklustre performance served as a timely wake-up call for the team, and for goalkeeper Neuer, whose blunder allowed the Greek goal, and who looked shaky and uninspired.\nThe team will have to put on a more convincing performance against Scotland in the opener in Munich on Friday if they are to get the tournament off to a good start and get the home fans behind them, as they did in 2006 when the World Cup was held on home soil.\nGermany made it all the way to the semi-finals in the 2006 competition before falling to Italy. But the tournament was considered a great success and a wave of national pride swept the country as it experienced what is still regarded as “a summer fairytale”, Sommermärchen.\nThe ambitious Nagelsmann, whose initial contract ran until Euro 2024 but has now been extended to the 2026 World Cup, has said that he believes his players can do better than a place in the last four.\nThat remains to be seen on the day of the final, July 14.\nThis article is a translation of the original in French.",
  "word_count": 829,
  "scraped_at": "2026-02-14T01:51:32.433533",
  "_text_extracted": true
}