{
  "article_id": "65634c298eee",
  "url": "https://www.gdnonline.com:443/Details/1369581/Arsenal-beat-Bayern-to-stay-perfect",
  "title": "Football : Arsenal beat Bayern to stay perfect",
  "date": "20251127T000000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – Arsenal beat Bayern Munich for the first time in a decade to maintain their 100 per cent record in this season’s Champions League with a 3-1 victory sending them top of the group last night.\nJurrien Timber headed Mikel Arteta’s side in front from a corner after 22 minutes only for Bayern teenager Lennart Karl to equalise in style before halftime.\nArsenal dominated the second half though and showed their immense squad depth as substitutes Noni Madueke and Gabriel Martinelli scored the goals to make it five wins from five.\nMeanwhile, Liverpool’s miserable season hit another low when they slumped to a 4-1 defeat to PSV Eindhoven, their first loss in their last 14 games at Anfield in the group stage of Europe’s elite competition.\nCouhaib Driouech bagged a double, while Ivan Perisic – from the penalty spot –and Guus Til also scored as PSV climbed to 14th in the Champions League table with eight points.\nLiverpool, who have lost nine of their last 12 games across all competitions, dropped to 12th on nine points.\nHolders Paris St Germain showed a never-say-die attitude as they twice came from behind to beat Tottenham Hotspur 5-3, with two moments of brilliance from Vitinha steering Luis Enrique’s side to victory.\nPSG looked fragile at the back, conceding twice from defensive lapses and showing some of the same issues that contributed to their 2-1 defeat by Bayern Munich in the previous round, but they responded with greater control and efficiency to turn the match around at the Parc des Princes.",
  "word_count": 258,
  "scraped_at": "2026-02-14T02:12:17.572513",
  "_text_extracted": true
}