{
  "article_id": "659745d47e81",
  "url": "https://metro.co.uk/2023/10/06/aston-villa-unai-emery-hails-ollie-watkins-as-he-signs-new-long-term-contract-19621083/",
  "title": "Aston Villa : Unai Emery hails Ollie Watkins as he signs new long - term contract | Football",
  "date": "20231006T174500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "England forward Ollie Watkins has signed a new long-term contract with Aston Villa, the club have announced.\nThe new deal will keep him at Villa Park until 2028 and caps off a memorable week for the player, who scored a brilliant hat-trick against Brighton last Saturday and was recalled by his national team on Thursday.\nIt was reported two weeks ago that Watkins was close to agreeing new terms, with Unai Emery keen to tie down his talisman amid interest from Premier League rivals.\nManchester United were interested in the 27-year-old over the summer, while Arsenal and Chelsea were recently linked with the prolific star.\nWatkins joined Villa from Brentford in 2020 for a then club-record £28million, and has since scored 50 goals and made 16 assists in 128 appearances.\nHis game has gone to new heights under Emery who has transformed the side from relegation battlers to European contenders in less than a year.\n‘Ollie Watkins is always ready to work and to give the team what they need,’ the manager said in his press conference on Friday ahead of the Villans’ clash at rivals Wolves.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Individually as well, when he is doing his work, scoring goals, defensively the first press, it’s very important for us. When he is not scoring, when he is not being brilliant, he is doing his work.\n‘For me and his teammates it’s always positive. Always, he is very demanding to learn and to improve. He is doing that here.\n‘I have worked with him for more or less one year. The first day when he was working with us and when I arrived, it is the same like today when I met him this morning in the training ground.’\n‘It’s definitely been a memorable week for me and one that I’ll never forget,’ Watkins said after penning his new contract.\n‘I’m really happy. I feel like this is the best place for me to play my football; I’ve still got a lot to achieve here.\n‘I feel like I’ve had a really good connection with the fans since I’ve come here. From day one they’ve been really good with me; we’ve had highs and lows but that’s football.\nMore Trending\n‘You can see the direction of the club, and I want to be a part of that. We’re only getting started. The boss has been here for a year and you’ve seen the form and progression of players.\n‘There are other levels we can get to. Hopefully we can push on and get to the Champions League spots – that’s the aim.’\nMORE: Emile Heskey praises ‘positive’ Ryan Gravenberch and makes Liverpool vs Brighton prediction\nMORE: Prince William visited Aston Villa dressing room after Europa Conference League win\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 530,
  "scraped_at": "2026-02-14T02:25:00.753734",
  "_text_extracted": true
}