{
  "article_id": "659baf4727fb",
  "url": "https://www.espn.com/espn/story/_/id/46625584/mamelodi-sundowns-remo-stars-seek-redemption-champions-league-clash",
  "title": "Mamelodi Sundowns , Remo Stars seek redemption in Champions League clash",
  "date": "20251017T143000Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After less than ideal starts to the 2025-26 season, Nigerian champions Remo Stars and South African champions Mamelodi Sundowns will each be looking to bounce back in the first leg of their CAF Champions League second preliminary round tie in Abeokuta.\nIn all fairness, Sundowns have fared far better than Remo Stars, and sit top of the Betway Premiership. However, they are the only team to have played 10 games -- and those have not gone entirely according to plan with six wins, three draws and a defeat.\nSecond-placed Sekhukhune United are one point behind Sundowns in the Premiership with a game in hand. Third-placed Orlando Pirates are six points behind with three games in hand. If those teams win all their games in hand, they will leapfrog Sundowns at the top of the table.\nFurthermore, Sundowns are out of the Carling Knockout Cup after their last 16 penalty shootout defeat to Marumo Gallants and also lost to Orlando Pirates in the MTN8 semi-finals.\nRemo Stars are 13th in the Nigeria Premier Football League (NPFL) this season after winning their first ever title last season. In terms of results, their struggles are not in the same ballpark as those of Mamelodi Sundowns.\nHowever, standards are sky-high at the Pretoria-based club, while Remo Stars have spent years building towards the success they have eventually managed to accomplish, but do not have quite the same expectations just yet.\nWith Remo Stars having built their squad on a foundation of exceptional young talent, this is a superb opportunity to test themselves against last season's runners-up.\nSundowns are scheduled to host the second leg at Loftus Versfeld on October 26. Away goals will be the primary tiebreaker in determining which side advances to the group stage if the tie is still level after 180 minutes. If still not settled, it will go straight to penalties.\nKey details\nDate: Sunday, October 19 at 17:00 CAT (15:00 GMT)\nVenue: M.K.O. Abiola International Stadium, Abeokuta, Nigeria\nHow to watch: The match will be available on SuperSport (channel 209 on DSTV).\nTeam news\nWinger/fullback Thapelo Morena went off injured in the 35th minute of Bafana Bafana's crucial 3-0 FIFA World Cup qualifying win over Rwanda. Meanwhile, striker Iqraam Rayners withdrew from the squad for medical reasons. It remains to be seen what part they play in the game, while residual fatigue may be a problem for other players after a busy international break.\nThemba Zwane remains sidelined by a long-term injury, but although they have missed his creative spark, Sundowns at least possess depth in abundance.\nExpected lineups\nRemo Stars\nGK Serge Obassa\nLB Chigozie Chilekwu | CB Leonard Ngenge | CB Ebuka Anthony | RB Ibrahim Abubakar\nCM Olamilekan Adedayo | CM Chaka Coulibaly | CM Sodiq Oshidero\nAM Alex Oyowah\nST Joseph Abah | ST Adama Goita\nMamelodi Sundowns\nGK Ronwen Williams\nLB Aubrey Modiba | CB Keanu Cupido | CB Malibongwe Khoza | RB Khuliso Mudau\nCM Marcelo Allende | CM Teboho Mokoena\nLW Kutlwano Letlhaku | AM Jayden Adams | RW Arthur Sales\nST Peter Shalulile\nStats\nNigeria and South Africa each have two CAF Champions League titles to their name. Enyimba have won the tournament twice (2003 and 2004), while Orlando Pirates (1995) and Sundowns (2016) have each won once.\nMamelodi Sundowns had five starters in the Bafana Bafana side that beat Rwanda 3-0 to qualify for the FIFA World Cup: Ronwen Williams, Khuliso Mudau, Aubrey Modiba, Thapelo Morena and Teboho Mokoena.\nRonwen Williams (1170 minutes), Marcelo Allende (1148 minutes) and Teboho Mokoena (1080 minutes) were the three players who racked up the most minutes in Sundowns' run to the 2024-25 CAF Champions League final, where they lost 2-1 to Egypt's Pyramids FC.",
  "word_count": 620,
  "scraped_at": "2026-02-14T02:09:24.908042",
  "_text_extracted": true
}