{
  "article_id": "65b4e2ad39a2",
  "url": "https://thepeoplesperson.com/2023/01/05/daley-blind-to-sign-for-german-giants-bayern-munich-257499/",
  "title": "Daley Blind to sign for German giants Bayern Munich",
  "date": "20230105T163000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Daley Blind is close to finalising a surprise move to Bayern Munich after his recent departure from Ajax.\nTransfer guru Fabrizio Romano confirmed the signing on his Twitter page this morning.\nDaley Blind set to join Bayern Munich, as @telegraaf called first. The 32yo Dutchmen is on his way to Germany right now, medical today – confirmed. He is a free agent and will sign a contract until summer with 1 year option. @kerry_hau @SPORT1 🔴⚪️ pic.twitter.com/plDObLrCPr\n— Patrick Berger (@berger_pj) January 5, 2023\nPending a medical, Blind will join Bayern on a contract until the summer with an option to extend for another year.\nIt looks like a fantastic move for the former United player, with Bayern on course for another Bundesliga tite and one of the front runners for this year’s Champions League.\nBlind joined United in the summer of 2014 as part of a raft of signings by then manager, Louis van Gaal.\nThe versatile Blind played 141 times for the club, scoring six goals during his four season stay at Old Trafford.\nHis classy attitude on and off the pitch has left fond memories for United fans, one of only a few signings who can say that over the last decade.\nBlind formed a solid partnership with Chris Smalling at the heart of Van Gaal’s defence, a partnership which led united to FA Cup glory in 2016 after beating Crystal Palace in the final at Wembley.\nDespite the FA Cup success, Van Gaal was relieved of his duties that summer, with Jose Mourinho replacing the Dutchman as manager of the club.\nMourinho’s style of play didn’t quite align with Blind’s qualities, which led to him leaving Manchester to return to Ajax in 2018.\nAt the end of 2019, Blind was diagnosed with myocarditis and revealed he had been fitted with an implantable cardioverter-defibrillator.\nFour years on, it’s a testament to Blind’s professionalism and desire that he is still playing football at the top level.\nAll United fans will wish the Dutchman all the best in the next chapter of his career.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 439,
  "scraped_at": "2026-02-14T01:53:21.844448",
  "_text_extracted": true
}