{
  "article_id": "65e8c5870e8f",
  "url": "http://www.chinaview.cn/20230505/46e60f144fc84582af1af2f0d63a808f/c.html",
  "title": "Analysis : Has Messi PSG career come to end ?- Xinhua",
  "date": "20230505T050000Z",
  "domain": "chinaview.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By sportswriter Xiao Yazhuo\nPARIS, May 4 (Xinhua) -- Where will Lionel Messi play football after this summer? Barcelona, Saudi Arabia, or the United States? Nobody can tell now, but one thing seems to be for sure: the seven-time Ballon d'Or winner's future will not be in Paris.\nThe Argentine international's current contract with the Ligue 1 giants expires after this season, with an \"agreement in principle\" to extend his stay for another year. However, neither club nor player now want to activate the option.\nMessi's recent unauthorized trip to Saudi Arabia for a private issue, followed by a two-week suspension from the club, was the last straw that damaged the relationship between the two sides.\nThe World Cup winner, who had played in PSG's 3-1 home defeat to Lorient in Ligue 1 on Sunday, wasn't present at the team's training session the following day as he traveled to Saudi Arabia to attend a commercial activity as a tourism ambassador.\nAccording to French media RMC and L'Equipe, the Qatari-owned club was annoyed by Messi's behavior and decided to set the punishment on him as an example to renovate the internal management and strengthen the discipline requirements of those superstars in the team.\nBut no one from both sides publicly explained what had happened behind the scene, as all the information was revealed by media from their \"sources.\" However, neither club nor player denied the report yet, which made everyone believe that divorce is inevitable.\nThe 35-year-old arrived in the French capital in the summer of 2021 with a grand welcoming ceremony, which saw thousands of PSG supporters gathered in front of the Parc des Princes to greet one of the greatest footballers of all time.\nBut the honeymoon period came to an end just several months later after PSG's humiliating exit from the French Cup in the round of 16, followed by a two-leg defeat to Real Madrid in the same stage at the Champions League.\nMessi's relationship with PSG supporters collapsed since that moment, as he was now and then jeered in home matches.\nThe same story repeated this season, with PSG being eliminated again in the round of 16, both in the French Cup and Champions League. Worse still, their worrying form has cost their lead in the French league, with only five points ahead of second-placed Marseille after losing six matches since the start of 2023.\nMessi has scored 31 goals and registered 34 assists in 71 games in all competitions for PSG and won the Ligue 1 title last season.\nA two-week suspension means that Messi will miss his team's away match against Troyes and the home clash with Ajaccio. There is even doubt whether he will return to the club after the suspension to participate in the remaining three league matches.\nWhat's the next stop for Messi?\nBarcelona is trying to re-sign their former legend, but it is unclear whether the Catalonian club can make it within the framework of La Liga's financial fair play rules. Major League Soccer club Inter Miami is also pushing for him, and Saudi Arabian club Al Hilal has reportedly offered a lucrative one-year contract worth 400 million euros.\nThe all-time top scorer for Barcelona is in the pole position to win a record eighth Ballon d'Or this year, after winning the World Cup with Argentina last December in Qatar. ■",
  "word_count": 561,
  "scraped_at": "2026-02-14T01:48:17.255312",
  "_text_extracted": true
}