{
  "article_id": "65eddd3ab033",
  "url": "https://www.bbc.com/sport/football/articles/cp3wlwdkj41o",
  "title": "Rodri : Manchester City midfielder ruled out for season after ACL surgery",
  "date": "20240927T180000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City's Rodri out for season with ACL injury\n- Published\nManchester City midfielder Rodri will miss the rest of the season after rupturing his anterior cruciate ligament.\nThe 28-year-old limped out of Sunday's 2-2 draw against Arsenal in the Premier League on Sunday following a collision with Thomas Partey.\nManchester City boss Pep Guardiola says Rodri has now had surgery on his knee and will miss the rest of the campaign.\n\"He had surgery this morning - ACL and some meniscus,\" Guardiola said on Friday.\n\"So, next season he will be here. This season is over [for him].\"\nGuardiola said Rodri was \"irreplaceable\" during last season's title run-in, in which City pipped Arsenal to win their fourth consecutive league title.\nRodri missed five games last season and City lost four of them.\n\"Unfortunately we got the worst (news) but these things happen,\" added Guardiola. \"We will be there to support him in his recovery step-by-step.\n\"What he gives us, we don’t have a similar player.\n\"But the others can all together replace what Rodri has given since his arrival to us. We will have to do it as a team and find a way to play a lot of matches without an important player for us.\"\nGuardiola said the club will assess the \"potential problems\" caused by Rodri's absence before deciding whether to sign a new midfielder in the January transfer window.\nWho could Man City sign to replace injured Rodri?\n- Published27 September 2024\nHow injured Rodri's absence could hurt Man City's trophy quest\n- Published27 September 2024\nMeanwhile, City are set to be without Belgium midfielder Kevin de Bruyne for their Premier League trip to Newcastle United on Saturday (12:30 BST).\nDe Bruyne missed the draw with Arsenal and may not return to action until after the international break in October.\nCity also face Slovan Bratislava in the Champions League and Fulham in the Premier League before the mid-October internationals.\nSince joining from Atletico Madrid in 2019, City have lost just 11% of the matches in which Rodri has featured, compared with 24% without the Spaniard.\nRodri was making his first start of the Premier League season against Arsenal, having sustained a hamstring injury during Spain's 2-1 win against England in the Euro 2024 final in July that kept him out for six weeks.\nThe midfielder was voted player of the tournament as Spain won the trophy for a fourth time and is one of the favourites to win the Ballon d'Or next month - given to the world's best player.\nEarlier this month the former Atletico Madrid player, who played 63 times for City and Spain last season, claimed players are \"close to\" striking over an increase in the number of games in the calendar, including an expanded Champions League and Club World Cup.\nAnalysis - who could replace Rodri?\nBBC Sport's chief football news reporter Simon Stone\nGuardiola has never made any secret of his belief Rodri is irreplaceable as a single midfield anchor in his Manchester City side.\nKalvin Phillips is the nearest thing to a sitting midfielder in the City squad but Guardiola has long since decided the former Leeds man is not good enough and he is currently on loan at Ipswich and unable to be recalled until January.\nThat means Guardiola is likely to tinker with his formation and play with two holding midfielders.\nFormer Chelsea star Mateo Kovacic can fill that role but he is not the only option.\nCentre-back John Stones has rarely played as a lone defensive midfielder, but has been inverted into the deep-lying role at times from central defence and right-back.\nThe recently returned Ilkay Gundogan was used in that position on numerous occasions before he left for Barcelona in 2023. Bernardo Silva has also played there, as has the currently sidelined Kevin de Bruyne.\nAnd then there is 19-year-old Rico Lewis, who Guardiola said only last week could fill a number of positions, such is his flexibility.\nRelated topics\n- Published26 July 2022",
  "word_count": 668,
  "scraped_at": "2026-02-14T02:01:51.728007",
  "_text_extracted": true
}