{
  "article_id": "661ae9632b27",
  "url": "https://theathletic.com/5330657/2024/03/11/best-premier-league-title-race/",
  "title": "The Briefing : Best Premier League title race ever ? Klopp v Guardiola – a remarkable rivalry",
  "date": "20240311T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to The Briefing, where every Monday during this season The Athletic will discuss three of the biggest questions to arise from the weekend’s football.\nThis was the weekend when Arsenal dug Aaron Ramsdale out of a hole after his mistake, the bottom three all collected points, Manchester United managed a win with two penalties and Danny Ings reminded the world who he is with a late equaliser for West Ham.\nAdvertisement\nHere we will ask if this three-way title race is the best one the Premier League has ever seen, whether the Klopp-Guardiola rivalry loses anything because the two men are fairly friendly with each other, and if Tottenham are now favourites to complete the final top four.\nIs this the best Premier League title race ever?\nFrom a neutral perspective, that was pretty much the perfect weekend.\nArsenal’s win against Brentford on Saturday put them top of the Premier League, but the draw at Anfield between Liverpool and Manchester City the following afternoon means it’s only on goal difference from the Anfield side, with champions City one point behind them both.\nOne point separates the top three. One.\nThis is the first time in Premier League history (which, OK, only goes back 31 years) that three teams chasing the championship have been separated by a single point at this stage of the season. The previous closest is three points, which has happened a couple of times, as you can see from the chart below. It’s a slightly arbitrary cut-off point, and it’s a little inexact because it’s not often that all three top teams have played 28 of their 38 league games at the exact same time, but it’s just a way of indicating — if you don’t know already — how close this season’s title race is.\nIt’s extraordinary stuff and hopefully sets us up for a couple of months that will be unbearable for those involved but exhilarating for the rest of us.\nThe really good thing is that the teams involved are all brilliant in their own way, but also have flaws that the others can exploit.\nSo we’re unlikely to get a three-way relentless procession, where they all pulverise the rest of the league and it becomes a heavyweight stomp to the finish line: more points will be dropped, the lead will change hands, it will get chaotic before the music stops with the final round of matches on Sunday, May 19.\nWe’ve had great title races before, but they have almost always involved just between two teams: Manchester United and Blackburn in 1995. United and Arsenal in any number of seasons in the late 1990s and early 2000s. City and United in 2012. City and Liverpool in 2014 and then again for most of the past five seasons, with the astonishing last few months of 2018-19 arguably being the highest quality.\nBut you were always left with the sense one would fall away, and things would be wrapped up long before the end. That doesn’t seem likely this time. If one of the three do slip, we’ve got another to keep up the race.\nAdvertisement\nThe only very slight shame is there’s only one more game between the three, when Arsenal visit City on Sunday, March 31. We’re getting greedy here, but it would be especially amazing if two of them happened to be facing each other on that final day of the league season in May.\nAs it stands, all three have, theoretically, straightforward home games then against Everton (Arsenal), Wolves (Liverpool) and West Ham (City): what an extraordinary thing it would be if they were all level going into that, and it became a hell for leather shootout to see who can score the most goals.\nThis could be the greatest title Premier League title race ever.\nWatch it. Drink it in.\nWill we see a rivalry like Klopp vs Guardiola again?\nAt the final whistle yesterday, Jurgen Klopp and Pep Guardiola embraced, lingering for a little longer than usual, their two puffer coats briefly becoming one.\nIt might be for the last time. Barring a pretty remarkable U-turn by Klopp, it was the last time in the Premier League. Both clubs are in next weekend’s FA Cup quarter-finals, so they could meet again at Wembley in April’s semis or the final on Saturday, May 25. Beyond that, who knows?\nThe smart money is on Klopp’s next job in management being with the Germany national team, so by the time he returns to the club game (if he ever does), who knows what Guardiola will be doing.\nThey are two of the best managers the Premier League has ever seen, and they happen to have been in charge of two sensational sets of players at the same time, gifting us years of thrilling, high-quality games.\n8 – The aggregate stats from the eight Premier League games between Jürgen Klopp (W4) and Pep Guardiola (W1) at Anfield (D3):\nGoals: Liverpool 13 – 11 Man City\nShots: Liverpool 86 – 90 Man City\nSOT: Liverpool 30 – 31 Man City\nPossession: Liverpool 46% – 54% Man CityContest. pic.twitter.com/3IBMaKifhx\n— OptaJoe (@OptaJoe) March 10, 2024\nHowever, you do half-wonder how much we will talk, in a few years, about this as a rivalry between two great managers, or just an era of two dominant clubs slugging it out. Because it’s been a managerial rivalry remarkably free of animus, of needle, spite. Guardiola and Klopp are two very different men who nevertheless clearly get on quite well, which is unusual in the history of such things in the Premier League.\nAdvertisement\nTypically, such rivalries have been between managers who hate each other, or at least offer some form of public personal conflict to add an extra frisson. Sir Alex Ferguson went through a fair few bitter head-to-heads. Kenny Dalglish. Kevin Keegan. Arsene Wenger. Rafa Benitez. Roberto Mancini, to a point. Jose Mourinho picked a fight with whoever was in the other dugout, apart from Ferguson. Antonio Conte never looked like he cared who he annoyed.\nFor the final time as @LFC manager against Pep Guardiola's @ManCity 🔴 🔵\nOne of the most evenly contested Premier League rivalries comes to an end 🤝#LIVMCI pic.twitter.com/ByTvxbNy3F\n— Premier League (@premierleague) March 10, 2024\nBut this has been friendly, full of mutual respect, which is fairly remarkable given how tight and high-octane the games between City and Liverpool have been. Plus, there’s the fact they faced each other in Germany’s Bundesliga with Bayern Munich (Guardiola) and Borussia Dortmund (Klopp) before they both came to England.\nGO DEEPER\nLiverpool 1 City 1: De Bruyne's clever corner, Reds fightback, Doku penalty debate\nPerhaps this is a high-profile example of how different football is today, with people less keen to trade insults in public. Does it diminish the rivalry? Possibly, because a little aggro is always more entertaining. Is this just because many of us grew up in a generation dominated by Ferguson, so we’ve been conditioned to expect it? Again, possibly.\nBut if the trade-off is that, rather than arguments, we have got all these years of incredible football and astonishing matches at least twice a season, it’s probably one worth making.\nWe’ll miss it when it’s gone.\nWas that Spurs’ most complete performance under Postecoglou?\nIt feels a bit strange to look at the Premier League table, see fifth-placed Tottenham two points and one spot behind Aston Villa and conclude that the north Londoners are the favourites to finish in the top four. But they are, and anyone who watched how the 90 minutes between the two at Villa Park on Sunday panned out, it’s clear to see why.\nYou could make a decent argument to say that was Tottenham’s best performance of this first season under head coach Ange Postecoglou, in the second half particularly. There was all the aggression and attacking pace that has been there since the summer, but it felt refined too. This was Postecoglou football, without any of the recklessness that can sometimes come with it.\n6 – Since the start of 2022, all six instances of a Spurs player being directly involved in 3+ goals in a Premier League game have been by Son Heung-Min (one goal and two assists today). Lethal. pic.twitter.com/iudMaZaI1M\n— OptaJoe (@OptaJoe) March 10, 2024\nWhile all the late goals are thrilling and have provided some moments their fans will never forget, it’s performances like this that are the important ones. Spurs dominated, controlled the midfield and used the ball brilliantly in attack — not just in terms of creating a large number of opportunities, but in tiring Villa out too, particularly in the last 15 minutes or so.\nAdvertisement\nThat was especially useful in this game, against a team riven with injuries, and of course down to 10 men for much of the second half. Postecoglou was right when he said that John McGinn getting sent off wasn’t actually that crucial in how the game panned out: Villa were poor generally, and Tottenham were 2-0 up at that point anyway, and the two late goals they added made the scoreline reflect the balance of play a little more accurately.\nThat red-card decision was a heartening one, because referee Chris Kavanagh might have got away with just giving a yellow when McGinn launched into Destiny Udogie, but it was exactly the sort of challenge that should be punished with a dismissal: violent, reckless, no attempt to play the ball and really nothing to do with football.\nThe three-match suspension that will follow for the Villa captain is another reason why Spurs should be confident of overhauling them; this is already a team without midfielders Boubacar Kamara, Jacob Ramsey and Emiliano Buendia through injury, and now there is no McGinn for games against West Ham, Wolves and Manchester City, the first and last of them away fixtures.\nThey’ll need either a formation change, someone playing out of position or a big stint from Tim Iroegbunam, a 20-year-old who has made one Premier League start, to get them through this spell.\nComing up…\n- Is this week’s Monday night selection the most expensive mid-table game ever? The team owned by the Saudi Public Investment Fund versus the team owned by financially incontinent investors. The money that Chelsea and Newcastle have shelled out does suggest they should both be higher up the table than 11th and 10th respectively, but here we are.\n- Speaking of big-money encounters, let’s have some more Champions League: last week’s second-leg games were a bit damp-squibby, but these final four should be rather better. On Tuesday, Arsenal host Porto as they try to overturn a 1-0 deficit, while Barcelona vs Napoli is also very nicely poised after a 1-1 in Italy.\n- Then on Wednesday, Inter Milan travel to Atletico Madrid with a 1-0 advantage in their back pocket, while it’s all square at 1-1 between PSV Eindhoven and Borussia Dortmund for their second leg in Germany. Nice, nice, nice.\n- There’s also a little slice of Premier League on Wednesday, as Bournemouth host Luton in the game that was abandoned in December following Tom Lockyer’s cardiac arrest on the pitch.\n- Back to Europe on Thursday: the Europa League last-16 ties involving Brighton and Liverpool are probably all done (in bad and good ways for them respectively), but while West Ham host Freiberg a goal down from the game in Germany, they are at least in with a shout at a comeback.\n- On the same day at the same stage of the Conference League, a rather bedraggled Villa are at home against Ajax with the tie still goalless, while the pick of the other seven games is probably Fiorentina vs Maccabi Haifa of Israel, after a madcap first leg which ended 4-3 to the Italians.\n- There’s some bonus Women’s Super League for you on Friday, and a big bonus at that, as league leaders Chelsea host third-placed Arsenal, who trail them by three points, at Stamford Bridge.\n- Finally, one to mark your card for at some point on Thursday as Euro 2024 this summer looms: Gareth Southgate names an England squad for Wembley friendlies against Brazil a week on Saturday and Belgium three days later.\n(Top photos: Getty Images)",
  "word_count": 2045,
  "scraped_at": "2026-02-14T02:20:27.926036",
  "_text_extracted": true
}