{
  "article_id": "661d3011359e",
  "url": "https://www.soundersfc.com/news/stefan-frei-poised-to-make-history-in-mls-cup-playoffs",
  "title": "Stefan Frei poised to make history in MLS Cup Playoffs",
  "date": "20241101T014500Z",
  "domain": "soundersfc.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "For back-to-back seasons, the Seattle Sounders have been one of the top teams defensively in Major League Soccer.\n“It's been the same back for the last two years,” said center back Jackson Ragen. “The defense as a unit has been so good.”\nGoalkeeper Stefan Frei, specifically, has been a major contributor to the club’s dominance on defense.\nFrei was a brick wall in goal last year, closing out the regular season with a career high, club record of 14 clean sheets. He has carried over that success into this season as well, spearheading the defense that led the league with 13 shutouts and fewest goals against (35).\n“I'm shocked that he's not in the goalkeeper of the year conversation,” added Ragen.\nWhile the veteran keeper sits in second-place all-time for shutouts in the regular season (118), he has the opportunity to tie Kevin Hartman for first in postseason play on Saturday in the team’s second match of the Round One, Best-Of-3 series against the Houston Dynamo.\n“He's only one away from Hartman, who's got 15 clean sheets,” said Head Coach Brian Schmetzer. “That's a goal that he can reach, and he can attain.”\nFrei started off the 2024 postseason on strong footing, recording a clean sheet in Match One of the series on Monday night. It was his presence in the penalty shootout following the 90 minutes, however, where he ultimately pushed the team to victory.\n“Stef did his job,” said Schmetzer. “He forced [Erik Sviatchenko] to go wide, he guessed three out of the five [shots] and he went the right way.”\nFrei believes his performance in the shootout was a testament to his teammates who rose to the challenge in the high-pressure moment.\n“If we have guys who step up confidently, then it's good to see and it gives me confidence too,” said Frei. “If we go into it again, I think I go into it maybe half an inch taller knowing that all the guys will deliver again.”\nFrei has been an impactful player for the club since his arrival in 2014. Along with his monstrous clean sheet record, the stalwart shot-stopper has been a benefactor in several of the club’s achievements over the last decade. Not only did Frei propel the team to two MLS Cup titles (2016, ‘19), he also played an important role in Seattle’s lone Supporters’ Shield (2014), a U.S. Open Cup trophy (2014) and won Goalkeeper of the Tournament during the club’s first-ever Concacaf Champions League title (2022).\nThe Sounders’ long-time keeper is looking to bring another trophy to Seattle as the team navigates the Audi 2024 MLS Cup Playoffs.\n“We have an opportunity to achieve something,” said Frei. “We're striving to have a high standard and play for trophies.”\nThe first step in doing so is to close out Round One this weekend with a win over Houston at Shell Energy Stadium.\n“I think we're playing good football as you need to, to be able to get past good teams at this stage,” said Frei. “We'll try to be clinical and go to Houston and have a game plan and hopefully get a result.”",
  "word_count": 523,
  "scraped_at": "2026-02-14T01:51:57.629640",
  "_text_extracted": true
}