{
  "article_id": "662b162ed524",
  "url": "https://allafrica.com/stories/202507170014.html",
  "title": "Africa : Wafcon - 3 Signs That African Women Football Is Finally Starting to Thrive",
  "date": "20250717T060000Z",
  "domain": "allafrica.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Women's football in Africa has been through radical changes over the past few years. From small beginnings in the late 1990s, it has grown to the point that its biggest competition is receiving considerable global attention.\nThe 2024 Women's Africa Cup of Nations (Wafcon) is heading into its quarter final matches, with eight countries still in competition. So far, the tournament, held every two years, has delivered the promised competitiveness. The days of wide gulfs between competing teams appear to have receded, the prize money has increased, and the tournament is finding willing audiences globally.\nRead more: Women football players in Africa have overcome enormous barriers - new book tells the story\nKeep up with the latest headlines on WhatsApp | LinkedIn\nAs a scholar of sports communication and of women's football, I suggest that what is left is for the Confederation for African Football (Caf) to consider increasing the number of teams participating in the final tournament. There are currently 12 but this could easily increase to 16 without losing quality.\nThere are sceptics, especially after the hosts - Morocco and Caf - moved the tournament from 2024 to 2025 to avoid a scheduling conflict with the Paris Olympics. This also provided time for Morocco to complete stadium renovations. Despite the sceptics, the tournament remains on solid ground. There are clear signs it's set to thrive.\n1. Gaps between teams are closing\nGoal margins are narrowing. The widest goal difference at this year's tournament has been 4-0 wins recorded in two games. One was by defending champions South Africa over Mali and the other by Senegal over Democratic Republic of Congo (DRC).\nHowever, neither Mali nor the DRC proved to be pushovers. They simply had off nights in their respective 0-4 losses. In fact, while the DRC lost all its games, the team proved competitive against the host - one of this year's favourites, Morocco - and lost by an odd goal to Zambia, a team that finished third ahead of perennial champions Nigeria just three years ago. Mali, with four points, qualified for the quarter final as a third-place team.\nOf course, the usual powerhouses have reached the knockout stages. No one was surprised that Morocco and South Africa are joined at the knockout stage by Nigeria, Zambia, Ghana and Senegal. Algeria, runners-up in their group, have reached the knockout stage for the first time. They did so after deservedly holding Nigeria to a goalless tie. Algeria's emergence demonstrates a continuing turnaround for north African women's teams that were also-rans in women's football competitions in the continent.\nRead more: Morocco vs South Africa as women's football enters a new era\nThese developments have come from hard work. Morocco invested significantly and saw its women's national teams and clubs catapult to the top tier of women's football. Algeria is on the verge of a similar rise. Their performance at this competition has been engineered by significant recruitment of players of Algerian parentage who live outside the country by manager Farid Benstiti, who previously managed the Paris Saint-Germain women's team. Algeria has also recruited several players based outside the country.\nThe increasing parity among the teams at Wafcon is also highlighted by the fact that Côte d'Ivoire, Equatorial Guinea and Cameroon didn't even reach the final eight.\nEquatorial Guinea has won the trophy multiple times, the only country besides Nigeria to do so. Cameroon is a perennial powerhouse that has represented the continent multiple times at the Women's Football World Cup. Tanzania surprisingly eliminated Côte d'Ivoire in the qualifying stages, Kenya beat Cameroon, and DRC beat Equatorial Guinea. These results signify, more than anything, the evening of quality among women football teams in the continent.\nHowever, some challenges remain. These include: women national teams not receiving funding support year round beyond playing competitive games; sexism; and religious barriers in certain parts of the continent.\n2. Increased prize money\nCaf is increasingly supporting Wafcon. This year the prize money for the trophy winners went up by 100% to US$1 million.\nThe total prize money is US$3.75 million. Runners up receive US$500,000, third place US$350,000 and fourth place US$300,000, with others also receiving lesser payouts. This increased support is also reflected in the US$600,000 awarded to the winner of Caf's Women's Champions League tournament.\nThis may not be anywhere near on a par with the prize money awarded at the Uefa Women's Euro 2025 competition (US$47.8 million), but it reflects Wafcon's steady progress in closing the gap as the women's game attracts more interest from sponsors.\nAnd the gap between men and women in terms of prize money still looms large. However, this is a global phenomenon.\n3. Growing media interest\nAlthough Wafcon attendance at venues has been disappointing, partly because three smaller stadiums are being used for matches while Morocco's biggest stadiums are still being renovated ahead of the country co-hosting the 2026 Men's Football World Cup, the media coverage has been impressive.\nRead more: Morocco will co-host the 2030 World Cup - Palestine and Western Sahara will be burning issues\nCaf reported that more than 120 territories watched the opening match between Morocco and Zambia on television. Major broadcasters including beIN Sport, CANAL+, SuperSport, and SportTV are covering the event.\nAccording to a Caf media release:\nFans around the world will be able to follow the matches from the United States, Brazil, Canada, Australia, France, Belgium, Germany, Qatar, the Netherlands and Singapore.\nIncrease the field\nWith the progress made by the competition over the years, it may be time to increase the number of teams in the final tournament from 12 to 16. This, of course, will require additional prize money to ensure that each team receives equal or more money than is doled out at this year's competition.\nHowever, this year's tournament has made it clear that there would be more space for capable competitors at the finals, without loss in quality.\nWafcon has come a long way from its birth at the turn of the century. It has grown from eight teams to 12, with room for more. The prize money has doubled for the winning team and television coverage has spread across the globe. This, clearly, is a competition on the rise.\nChuka Onwumechili, Professor of Communications, Howard University",
  "word_count": 1042,
  "scraped_at": "2026-02-14T02:18:43.324434",
  "_text_extracted": true
}