{
  "article_id": "665d2961e498",
  "url": "https://www.caughtoffside.com/2024/07/31/chelsea-legend-on-mauricio-pochettino-enzo-maresca-michael-essien/",
  "title": "Chelsea legend says it  unfortunate  Pochettino was sacked , gives Maresca prediction",
  "date": "20240731T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Former Chelsea midfielder Michael Essien believes it was ‘unfortunate’ Mauricio Pochettino wasn’t given more time at the club.\nPochettino lasted less than a year at Stamford Bridge, overseeing 51 matches with a 50.98% win rate, helping the club reach the EFL Cup final and FA Cup semi-finals.\nHowever, it was the Blues’ league form that cost him dearly, languishing in mid-table until a run of just one defeat in their last 15 matches — including five straight wins to close out the season — propelled them to sixth place, qualifying for the UEFA Conference League.\nThat late-season turnaround prompted many to blast Chelsea’s decision to part ways with Pochettino as harsh, with the Argentine perhaps earning more time to prove he could be a success at Stamford Bridge.\nIndeed, Essien believes it was an ‘unfortunate’ decision, but has backed new boss Enzo Maresca to guide the club forward.\n“Chelsea is a tough place, not only for players, but for managers as well,” Essien — who played 256 times for Chelsea between 2005 and 2013, winning two Premier League titles and a Champions League — told talkSPORT.\n“I think the team was gelling together well and playing good football towards the end of last season.\n“It’s unfortunate they got Pochettino out of the way but I think their new boss will take them to where they want to be.”\nChelsea has long been a club famous for its ruthless approach to managers and even during Essien’s time at the club, they cycled through numerous faces in the dugout; including Jose Mourinho, Carlo Ancelotti, Guus Hiddink and Roberto Di Matteo.\nBack then, however, the Blues consistently lifted major honours and Essien believes a period of stability is required to get Chelsea back on track.\n“I was there for nine years and I had eight managers. So you can see it’s a tough place,” the 41-year-old Ghanaian added.\n“Our time was different, we had great success, this is a new generation and they need to give them chances to get where the club deserves.”",
  "word_count": 341,
  "scraped_at": "2026-02-14T02:08:01.871156",
  "_text_extracted": true
}