{
  "article_id": "6674f0ef036c",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-urged-ruin-arsenal-plans-win-race-80m-star-definitely-help-ten-hag-signing-formation-change-claim",
  "title": "Man Utd urged to ruin Arsenal plans by winning race for £80m star who can  definitely help  Ten Hag signing",
  "date": "20240229T083000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd urged to ruin Arsenal plans by winning race for £80m star who can ‘definitely help’ Ten Hag signing\nManchester United have been advised to make a push to sign Brentford striker Ivan Toney this summer, with a legendary former star and Treble winner advising why the player can help bring out the best in one of Erik ten Hag’s more-successful signings.\nThe Red Devils have struggled for consistency this season and, having crashed out of the Champions League at the very first hurdle and having already lost 10 times in the Premier League so far, speculation has mounted over Ten Hag’s position. Indeed, with Manchester United suffering their worst start to a season since 1930/31, it’s easy to see why many observers feel the Dutchman is a dead man walking.\nWith United reportedly weighing up a number of contenders to step into the hotseat if the axe were to fall on the Dutchman, the decision on any next appointment will likely be a joint decision made by new minority shareholder Sir Jim Ratcliffe, alongside the club’s likely new sporting director, Dan Ashworth.\nIN DEPTH ~ Next Man Utd boss: Seven contenders to replace Ten Hag in review should Ratcliffe wield the axe\nWith the two men deliberating the best way forward for United, Ten Hag knows he will need to win the FA Cup and/or secure a top-four finish in the Premier League to keep the wolves from his door. With regards that push for the Champions League, United have little margin for error given Saturday’s home loss to Fulham saw them slip eight points behind Aston Villa in the race fore the top four.\nRatcliffe and Ashworth are also drawing up plans for the summer transfer window too, with the British billionaire likely to put forward funds to help another big summer of recruitment.\nRatcliffe told Ivan Toney is the perfect striker for Man Utd\nBy widespead accounts, Ratcliffe wants to strengthen United’s spine with a new defender, midfielder and striker in his sights.\nSpeculation has already began swirling over the identity of these players, with a potential striker recruit drawing lots of theories over which player would suit United best.\nAnd while the likes of emerging young talents Mathys Tel and Joshua Zirkzee have both been touted as options, Ten Hag is also reportedly an admirer of Brentford striker Toney, who is being tipped to leave the Gtech Community Stadium this summer.\nAnd while Arsenal and Chelsea are also being linked with an £80m swoop, former United striker Andy Cole claims Ratcliffe and Co could do far worse than target a move themselves for the once-capped England frontman.\nDON’T MISS ~ Ivan Toney next club: The six strikers at risk of being dumped as Arsenal, Chelsea, Man Utd transfer chances ranked\n“I like Ivan and if he came to Manchester United, would he do a job? Absolutely he would,” Cole told Betfred. “It all depends on what direction the club wants to go in.\n“Rasmus Hojlund is still a young man, so it’s all down to whether the club is prepared to bring in an older striker that can help him out at this stage. Manchester United’s signings of experienced forwards in recent times hasn’t exactly worked out.”\nCole claims Toney signing can lead to Man Utd formation change\nCole reckons Brentford could ask for big money for their star striker come the summer, though has urged United to consider his signing if he feels the price is right.\nHe continued: “It all depends on what the transfer fee will be but for me personally, I believe Ivan would be a good signing for Manchester United if they make a move for him and he will definitely help Hojlund.”\nCole also reckons United could benefit from an old-fashioned 4-4-2 formation if they were to land on the 27-year-old Bees frontman.\n“If you look at football now, and I’m not just talking about the Premier League because I watch my son [Devante] play in League One [Barnsley] regularly, every team tries to play exactly the same way. It’s unbelievable. Everybody’s trying to play like Manchester City, but I don’t understand it because most teams don’t have the personnel to play like Manchester City.\n“At some stage it’s possible that teams revert to a 4-4-2 because for me at the moment, football’s very predictable because you know that everybody plays the same way. Is anybody prepared to think outside the box?\n“Could Toney and Højlund play together? You never know because at the moment it’s just speculation and we don’t know how strong Manchester United’s interest in Ivan is at present.\n“He’s going to have options because he’s a good player and Arsenal and Chelsea are crying out for a centre-forward at the moment.”\nToney is currently contracted to Brenford until summer 2025 and he’s scored 72 goals in 131 appearances for the club, a tally that includes an impressive 36 strikes in 73 Premier League appearances.",
  "word_count": 835,
  "scraped_at": "2026-02-14T01:56:44.615634",
  "_text_extracted": true
}