{
  "article_id": "668388795301",
  "url": "https://www.teamtalk.com/manchester-city/major-pep-guardiola-future-update-txiki-begiristain-replacement-decided",
  "title": "Man City news : Cityzens close to learning Pep Guardiola fate as they close on brilliant Txiki Begiristain replacement",
  "date": "20241012T111500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City close to learning Pep Guardiola fate as Cityzens near brilliant Txiki Begiristain replacement\nManchester City have been given a boost by recent reports that they have struck a deal to land their primary choice to replace the departing Txiki Begiristain, while there is optimism that manager Pep Guardiola will remain with the club beyond the current season.\nThe Catalan tactician’s contract at the Etihad is set to expire next summer, and there has been uncertainty around whether the former Barcelona boss will extend his stay with Manchester City into a 10th season.\nBut according to fresh reports, there is a ‘growing sense of hope’ that Guardiola will commit his future to the Premier League champions, with Givemesport now reporting that there is a renewed belief they can persuade the 53-year-old to commit to a new deal.\nCity fans were rocked recently by the news that Bigiristain, the club’s influential director of football who has worked alongside Guardiola since their Barcelona days, will depart at the end of the 2024/25 campaign.\nOn Friday, multiple reports emerged confirming City have moved quickly to replace Begiristain. The man they have turned to is Hugo Viana, the former Newcastle United midfielder who has been occupying the same position at Sporting CP since 2018.\nThe 41-year-old former Portugal international began his post-playing career with a stint as director of football with Belenenses in 2017.\nHe joined Sporting the following year and has since overseen the high-profile signings of the likes of Bruno Fernandes, Manuel Ugarte and Viktor Gyokeres, as well as manager Bruno Amorim, helping the club win two Primeira Liga tiles during his tenure.\nViana will be stepping into the shoes of the most successful director of football in Premier League history. Regarded as one of the main architects of City’s recent dominance, Begiristain joined City in 2012 and was a key figure in attracting Guardiola to the club after the vaunted coach left Bayern Munich in 2016.\nThe 60-year-old former winger has helped lay the foundations for seven Premier League titles and one Champions League.\nHAVE YOU SEEN?: City eye long-term Man Utd target to replace Ederson in blockbuster 2025 transfer\nWhat does this mean for City?\nThe uncertainty surrounding Guardiola’s contractual situation has led to widespread speculation that the 53-year-old is planning to step down at City next summer.\nAnd the news that Begiristain is planning to depart has only further fuelled thoughts that the six-time Premier League-winning manager will also leave when his current deal runs out, with the two former Barcelona team-mates close allies at the Etihad.\nEarlier this month, there were reports that Guardiola was ready to accept an offer from the FA to become Gareth Southgate’s permanent successor as England manager.\nBut, more recently, there has been encouragement that Guardiola will choose to remain at City and pen fresh terms with the club.\nAccording to TBR, City chiefs have made clear their desperation for Guardiola to stay, putting forward an ‘open’ offer for him to do so while being careful not to put too much pressure on the manager.\nIt has also been suggested that the club are willing to offer him a rolling one-year deal that will allow him to take full control over his short- and long-term future.\nAnd last week Guardiola claimed the Premier League have rejected a request to postpone the first two games of next season to allow players who played Club World Cup – in which City will feature – to fully recover.\n“The Premier League has not allowed us to postpone the first two games for our recovery,” he said. “Thank you so much.”\nThe fact Guardiola has highlighted this issue has been interpreted by some as a sign he still intends to be in charge at the Etihad next season.\nLatest Man City transfer news\nCity have reportedly reached an agreement with Borussia Dortmund on the £25.1million (€30m/US$32.8m) sale of a highly rated young defender.\nYan Couto, a 22-year-old Brazil international right-back, has been a City player since 2020 after joining the club for Coritiba, but he has never made a first-team appearance for Guardiola’s side.\nInstead, Couto has been loaned out to further his development, spending three of the last four seasons with sister club Girona before a loan to Dortmund this term.\nAnd according to transfer guru Fabrizio Romano, BVB have already seen enough from Couto to commit to a big-money permanent move.\n“Borussia Dortmund’s obligation to buy clause for Yan Couto deal from Man City has been triggered,” wrote Romano on X.\n“Couto formally leaves Man City on a permanent deal now as Dortmund pay up to €30m package for Brazilian right-back.”\nCity have been deal a blow, however, in their pursuit of a replacement for the injured Rodri.\nThe reigning Premier League champions had been linked with a January swoop for Martin Zubimendi. The 25-year-old playmaker was a top target this past summer for Liverpool, with the Reds triggering his £50.1m (€60m, $66.7m) release clause only for the player to reject the move.\nAnd now Zubimendi has made comments suggesting he’d rebuff City’s interest, too.\n“There are always rumours but so far I’ve always thought that the best solution for me is staying at Real Sociedad,” he said. “I’ve still a lot of things to give to this club, I still want to grow and develop here.”\nCIty could have more joy in their efforts to secure a long-term heir to goalkeeper Ederson, though.\nAccording to CaughtOffside, they have identified Porto’s Diogo Costa as their top pick to eventually replace the Brazilian between the sticks at the Etihad, and the 25-year-old Portuguese shot-stopper has made clear his desire to play in the Premier League.\nIt is claimed that while Porto value the Portugal No 1 at £62.9million (€75m / US$82.2m), City only want to pay up to £41.9m (€50m/US$54.8m) for him.\nGuardiola’s incredible Man City trophy record\nIt’s easy to see why City are so desperate to retain Guardiola’s services. The influential former Barca and Bayern boss is one of the most successful manager in football history, boasting an outstanding 72 per cent win rate in addition to a staggering haul of 36 trophies.\nThe Catalan coach has led City to unprecedented success since joining the club in 2016, highlighted by the Treble he led them to in 2023 and last season’s record fourth successive Premier League title.\nDON’T MISS – Raking every Premier League club by net spend in 2024",
  "word_count": 1083,
  "scraped_at": "2026-02-14T01:57:46.249248",
  "_text_extracted": true
}