{
  "article_id": "668c0be15c1c",
  "url": "https://timesofindia.indiatimes.com/city/goa/silent-protest-loud-message/articleshow/126165497.cms",
  "title": "Silent protest , loud message | Goa News - The Times of India",
  "date": "20251224T194500Z",
  "domain": "timesofindia.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Trending\nMargao: For a few seconds after the referee blew his whistle, signalling start of play, there was no action at the Nehru Stadium in Fatorda on Wednesday. FC Goa captain Iker Guarrotxena, entrusted with the responsibility of kickstarting the game, squatted. His teammates on the field followed.Istiklol FC didn’t know what was happening in this concluding AFC Champions League Two group-stage clash. They simply stood, waited. To the thousand-odd spectators in the stands, and those watching on television, it was clear that Goa paused active play for the opening seconds as a symbolic gesture to highlight the uncertainty currently affecting Indian football. “This action was solely intended to draw attention to the broader challenges facing the domestic football ecosystem,” the club later said in a statement. “It was not directed at our opponents FC Istiklol, the AFC, or the AFC Champions League Two, all of whom we respect greatly. The gesture carried no element of protest against the competition or its stakeholders and was made in good faith, without any intent to cause offence or disruption.”Once the match kicked off, Goa took control. Within seven minutes, the hosts were ahead, Dejan Drazic scoring his first and the team’s second goal in the competition.\nGet an chance to win ₹5000 Amazon Voucher by taking part in India's Biggest Habit Index! Take the survey here\nGet the latest lifestyle updates on Times of India, along with Merry Christmas wishes, messages and quotes !\nEnd of Article\nFollow Us On Social Media",
  "word_count": 250,
  "scraped_at": "2026-02-14T02:12:17.553886",
  "_text_extracted": true
}