{
  "article_id": "66d388e63f88",
  "url": "https://www.premierleague.com/news/3660353",
  "title": "How perseverence and positive thinking paid off for Kudus",
  "date": "20230830T214500Z",
  "domain": "premierleague.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dutch football expert Arthur Renard chronicles the journey and development of West Ham United's new attacking midfielder.\nPlayer analysis - Mohammed Kudus\nLast year Kudus could have already been in the Premier League, having been heavily linked with a move to Everton. The attacking midfielder stayed at Ajax and after a highly productive season, he will feel equipped for the Premier League now his transfer to West Ham has been confirmed.\nTV Info - Broadcasters\nSee: West Ham sign Kudus from Ajax\nKudus showed a lot of consistency at club and country level last season.\nWith Ghana, he made a name for himself at the FIFA World Cup 2022, where he scored a brace in a 3-2 victory over South Korea. At Ajax, he scored 18 goals in all competitions, four of which came in the UEFA Champions League.\n“He had a fantastic season last term,” says former Ajax assistant coach Michael Reiziger, who worked with Kudus for three years. “As a team we weren’t playing well, but he still hit a high level.”\nReiziger, a former Dutch international, says Kudus’s season was impressive, especially as it came on the back of a two-year period where injuries had kept the player sidelined for considerable spells.\n“He had serious setbacks, but the way he came back shows how strong he is mentally,” Reiziger says.\nHis step to the Premier League feels like a great reward for a long trajectory that required a lot of perseverance.\nBorn in Nima, a residential town in Ghana’s capital Accra, Kudus played for a local team, before joining the Right to Dream academy, a local football school which offers its players education off the pitch, too. Kudus developed well and, not long after impressing at a youth tournament in Northern Ireland, he joined Danish club Nordsjaelland, who have a collaboration with Right to Dream.\nIn Denmark, Kudus made his professional debut three days after his 18th birthday and enjoyed two good seasons, before earning a move to Ajax. Reiziger, who is now the coach of the Netherlands Under-21 team, remembers Kudus’s arrival at the club.\n“He was a quiet guy, but very eager to learn, he wanted to know what was expected of him on the pitch,” says Reiziger, who could see the midfielder’s ability from the first moment.\n“He has special qualities. You won’t get him off the ball. He is incredibly strong and technically very good. You could notice that straightaway when we played in small training games; at times he was unstoppable.”\nAttacking versatility\nOne of the big advantages of the attacking midfielder is that he can be deployed in several other positions as well.\n“In the beginning he even played at No 6 a few times, as a defensive midfielder, who would then move up to No 10,” remembers Reiziger. “We used him as a striker as well, but also as a 'false 9' who plays a bit deeper, like dropping back to the No 10 position. He can also play in an attacking role on the right.”\nIn his first few matches at Ajax, Kudus excelled. Reiziger recalls his second match against Vitesse, which ended in a 2-1 victory, with Kudus providing the assist for the winner.\n“We won the match thanks to him. We played the second half of the game with 10 men, but he took the initiative.”\nKudus’s contribution was vital in his next match, too, netting a goal and producing two assists in a 5-0 victory over Heerenveen.\nUnfortunately he couldn’t follow up on his impressive start as he injured a knee against Liverpool in the UEFA Champions League a few days later.\n“It was very harsh, as he was playing well at the time and then he got that injury,” says Reiziger. “It took a while before he was recovered, and that was tough to take as he had high expectations when he arrived.\nPositive attitude\n“Mo has a strong character and he won’t be put off easily. He stood firm during his rehab. Still, when he came back in early 2021, he sustained another small injury and when back on the pitch it took time to get back in the swing of things.\"\nWhen looking back to his first year afterwards, Kudus could see how he had become stronger mentally as it had given him new insights on a personal level.\n“Last season I was mentally tested and it happened the way it was meant to,” Kudus told Dutch weekly Voetbal international. “It might sound odd because a football player has to play, but the injury was good for my development – as a sportsman and as a person. I had never been injured in my life and I took things for granted. If I saw a ball, I could run after it and give it my all, without feeling pain anywhere.\"\nKudus started the new season fresh and impressed again, but was hit by another injury setback, this time to an ankle. And it was during all those moments that he became a more complete player.\n“He has made huge strides in his awareness of defensive duties” says Reiziger. “And he has become physically even stronger. At some point things looked so easy for him that you could throw five men at him in training, but that he would still come out on top.\n“He has a very good technique. He can dribble past players that you think, 'You won’t get past here, the ball will go out.' But then he flips it over his opponent’s leg. He is a player with very specific qualities.”\nThe 23-year-old’s versatility will offer West Ham many options on the pitch.\nReiziger, who played for Ajax, Barcelona and Middlesbrough, concedes the Premier League will provide another physical test for Kudus. He is confident, however, that the Ghanaian will cope.\n“Of course it will be a challenge, like intense games which follow each other in quick succession, but I just feel he is ready for it,\" adds Reiziger. \"He could have made the move to England last season, so he is eager to show what he is capable of in the Premier League. He is fresh, as he has started this season very well at Ajax.”\nAfter prospering on the global stage with club and country in the last 12 months, Reiziger feels Kudus’s move to England comes at the right time.\n“With Ghana he played a good World Cup. So he has only improved. The Premier League is a nice next step for him.”\nArthur Renard is a Dutch journalist specialising in European football. https://arthurrenard.com/",
  "word_count": 1097,
  "scraped_at": "2026-02-14T01:50:52.140428",
  "_text_extracted": true
}