{
  "article_id": "66de3715175b",
  "url": "https://punchng.com/man-city-sign-chelsea-midfielder-kovacic/",
  "title": "Man City sign Chelsea midfielder , Kovacic",
  "date": "20230627T193000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City on Tuesday announced they had completed the signing of Croatia midfielder Mateo Kovacic from Chelsea following the loss of captain Ilkay Gundogan.\nThe treble winners said the 29-year-old had signed a four-year contract after the clubs reportedly agreed an initial fee of £25 million ($32 million), with a potential £5 million in add-ons.\nKovacic joins Pep Guardiola’s side after five years at Chelsea, where he won the Champions League and Europa League and made 221 appearances.\nHe is City’s first signing of the transfer window and his arrival compensates for the departure of Gundogan, who joined Barcelona on a free transfer on Monday after seven years at the club.\n“This is a brilliant move for me and I cannot wait to get started with City,” said Kovacic.\n“Anyone who has watched this team under Pep knows how good they are. For me, they are the best in the world.\n“The trophies they have won are clear for all to see, but they are also the best footballing side out there.”\nKovacic is a four-time Champions League winner having also enjoyed success in Europe’s elite competition three times with Real Madrid before joining the Blues.\nThe midfielder, who began his career with Dinamo Zagreb before a spell at Inter Milan, has earned 95 caps for his country.\nCity director of football Txiki Begiristain said Kovacic was a versatile player.\n“He can play as a ‘six’ or an ‘eight’, has plenty of experience at top-level clubs and he understands the Premier League.\n“It was a very simple decision to bring him to City because he has the tactical and technical qualities we are looking for in a midfielder.”\nAFP",
  "word_count": 279,
  "scraped_at": "2026-02-14T01:56:02.409165",
  "_text_extracted": true
}