{
  "article_id": "670308623e58",
  "url": "https://theathletic.com/5288035/2024/02/20/usmnt-tracker-psv-richards-aaronson/",
  "title": "USMNT Player Tracker : PSV trio make history , Richards stands tall and goalscorer Aaronson",
  "date": "20240220T233000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "History made, aerial battles and broken droughts all feature in this instalment of the USMNT Player Tracker.\nEach week, we will be bringing you updates on how the USMNT players and aspirants plying their trade in various leagues around Europe are faring.\nWith the Copa America this year, and a home-soil World Cup looming ever larger on the horizon, we’re keeping tabs on how they are performing.\nAdvertisement\nMain story of the week\nPSV Eindhoven’s American trio made history on Tuesday night, as they helped their team to a draw with Borussia Dortmund in their last-16 Champions League tie.\nWhen Ricardo Pepi came on as a 75th-minute substitute at the Philips Stadion, it marked the first time that three U.S. internationals have featured in the same Champions League knockout-stage game.\nEach played their part in a strong performance from Peter Bosz’s formidable team, who are unbeaten in the league, and now head to Germany for the second leg of this finely balanced tie.\nMalik Tillman was making his fourth start in European football’s elite cup competition this season and had an impressive game. Tillman could have pulled his side level in the first half when he dragged a right-footed shot wide that should at least have tested Alexander Meyer in Dortmund’s goal.\nBut he atoned for that when he won the penalty, via Mats Hummels’ sliding challenge, that allowed PSV captain Luuk de Jong to fire the hosts back into the game in the second half.\nFor full-back Sergino Dest, it was a strong performance, albeit one that was punctuated with misfortune. Donyell Malen’s opening goal for the hosts deflected in at the near post off his boot as he attempted to block it.\nLater in the second half, the 23-year-old might have scored a scintillating goal when his slick footwork saw him glide past Julian Ryerson, but he fired his effort straight at Meyer.\nPepi, who scored the stoppage-time header against Sevilla in the group stages that secured PSV’s place in this tie, struggled to make his typical impact as a substitute in the closing stages, but he will have been encouraged by the show of faith from Bosz.\nAll eyes will now turn to March 13, when the USMNT trio will hope for a result in Dortmund that sees their remarkable season continue.\nGO DEEPER\nDest, Tillman, Pepi interview: The quest to become 'invincible' at PSV and hopes for World Cup\nGraphic of the week\nPlayer of the gameweek\nIt has been a challenging time for the Crystal Palace players who witnessed manager Roy Hodgson collapse in training last week and the ensuing uncertainty around his position until the announcement, delivered on Monday afternoon, that he had stepped down.\nAdvertisement\nBut the south London club’s players rallied to deliver a defiant performance in their Premier League showdown with Everton on Monday night, fortified from the back by Chris Richards.\nThe USMNT man had spent more time operating as an auxiliary defensive midfielder this season due to a long-term Achilles tendon injury suffered by Cheick Doucoure in November. But, in the absence of Marc Guehi, the 23-year-old returned to the defence for the previous loss to Chelsea and stayed there in a revamped back five at Goodison Park.\nFacing Sean Dyche’s team is a stern test for any defensive unit — such is their power and threat from set-pieces — but, on the whole, Richards stood up well. He often had significant ground to cover with wing-back Tyrick Mitchell pushing forward but, generally, he and Palace more than held their own.\nRichards still has room for improvement in the Premier League; one lapse in concentration from a corner allowed Everton’s Amadou Onana to escape him and head in the hosts’ equaliser, and Dominic Calvert-Lewin out-jumped him on another occasion. Those two moments aside, he impressively dealt with the Merseysiders’ late rally.\nThe former Bayern Munich prospect will have to build more consistency into his game to thrive under new Palace manager Oliver Glasner, but his athleticism could appeal to a manager schooled in the Red Bull system which requires high-intensity pressing. Similarly, Glasner’s desire to play three at the back bodes well even once Guehi returns to full fitness.\nGO DEEPER\nHow Palace hired Glasner - and how will he do the job?\nQuote of the weekend\nIt has been a long time coming — almost 18 months, in fact — but Brenden Aaronson was back on the scoresheet on Saturday.\nThe USMNT midfielder had not scored for his club since August 2022 — back when he was at Leeds United in the Premier League. But on Saturday, he finally broke his drought with the only goal of the game to clinch a win for loan club Union Berlin against Hoffenheim.\nAdvertisement\nAaronson, 23, has had a challenging campaign given Union’s fluctuating form and his own infrequent starts in the first half of the Bundesliga season.\nHe was on the bench again at the weekend but responded in the best way possible with his game-changing appearance.\n“I had to be patient,” Aaronson told Bild afterwards. “My time hadn’t really come yet. But I kept working, went to the gym and practised shooting after every training session. I wanted to be ready to take advantage of my chance when it came.”\nHis coach Nenad Bjelica was impressed, adding: “Aaronson’s finish was excellent.”\nHow did other U.S. players get on?\nName: Griffin Yow\nClub: Westerlo\nPosition: Left-wing\nAppearances: 16\nGoals: Six\nThe Virginian is having a superb season in the Belgian Jupiler Pro league, where he has now contributed six goals and two assists in 16 league games.\nIn Friday’s impressive 2-1 win over Standard Liege, he helped create his team’s opener and then clinched all three points with the game’s winning goal, a right-footed effort just after the hour-mark.\nHis numbers are all the more impressive given the 21-year-old missed the opening 10 games of the season due to a knee injury.\nName: Josh Sargent\nClub: Norwich City\nPosition: Striker\nAppearances: 15\nGoals: 10\nSargent is making up for lost time this season with more goals. This time a brace in Norwich’s 4-1 win against Cardiff City on Saturday. He has chalked up double figures for the season — that’s actually 10 Championship goals in 11 starts since recovering from a serious ankle injury.\nIt was far from a happy afternoon for everyone associated with the United States at Carrow Road on Saturday, though.\nConceding four goals for Cardiff was USMNT goalkeeper Ethan Horvath, who joined the Welsh club earlier this month from Nottingham Forest. It was his second appearance for the Bluebirds and meant back-to-back losses for his new side, having lost 2-0 to West Bromwich Albion the Tuesday before.\nAdvertisement\nSargent went close to a hat-trick, too, with an effort blocked on the line by Cardiff defender Nat Phillips after Horvath had been caught out of position.\nName: Taylor Booth\nClub: Utrecht\nPosition: Right-wing\nAppearances: 13\nGoals: Five\nThe 22-year-old has been enjoying a fine time in the Netherlands, with five goals in his last three games — but had a worrying downturn in Utrecht’s 1-0 win over Twente on Sunday.\nBooth had to be helped off the pitch after 22 minutes and was later photographed leaving the stadium on crutches.\nName: Kik Pierie\nClub: Excelsior\nPosition: Centre-back\nAppearances: Five\nGoals: One\nThe 23-year-old defender has missed most of the Eredivisie season for his club with an ankle injury but returned to fitness in January and has won his starting place back this month. On Saturday, he scored in Excelsior’s 4-2 defeat by Sparta Rotterdam.\nPierie’s Dutch academic parents were working at Harvard in Boston when he was born. Although eligible for the USMNT if he chooses to, Pierie has so far chosen to represent the Dutch international youth sides.\nWhat’s coming up?\n(All times Eastern)\nSee if Real Betis’ Johnny Cardoso can continue his impressive form as his Spanish club are in Europa Conference action against Dinamo Zagreb on Thursday (12:45pm, Paramount +).\nOn Saturday, Joe Scally and his Borussia Monchengladbach side face VfL Bochum in the Bundesliga (9:30am, ESPN+).\nAnd back in England, we will see if Sargent can continue his red-hot goalscoring form as Norwich City travel to Blackburn (10am). Also on Saturday, Tim Ream and Antonee Robinson’s Fulham face Manchester United (10am, Peacock Premium).\nGO DEEPER\nJoe Scally exclusive interview: On USMNT ambitions, learning from Vieira, and downtime with Reyna\n(Photos in top image: Getty Images)",
  "word_count": 1412,
  "scraped_at": "2026-02-14T01:51:19.053473",
  "_text_extracted": true
}