{
  "article_id": "67036e69b890",
  "url": "https://www.caughtoffside.com/2023/11/29/arsenal-always-finds-a-way-to-win-says-mikel-arteta-as-gunners-boss-praises-squads-mentality/",
  "title": "Arsenal current squad  always finds a way to win  says Mikel Arteta",
  "date": "20231129T141500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Last Saturday may turn out to be a huge day in the Premier League title race as Man City and Liverpool drew in the early kick-off before Arsenal would go top of the standings later in the day with a win over Brentford.\nMikel Arteta’s side were not at their best in the London derby and a draw would have probably been a fair result. However, substitute Kai Havertz grabbed an 89th-minute winner to spark jubilant scenes in the away end.\nThis wasn’t the first time Arsenal had not shown up and came away with all three points this season in the league and Arteta addressed his team’s mentality during his press conference on Tuesday ahead of the Gunners’ match with RC Lens in the Champions League.\n“In the end, it is the capacity and amount of resources you have to win a football game, how many ways can you find to win a football game,” the Spanish coach said.\n“Sometimes it won’t be there, sometimes there will be fatigue because you played three days before, sometimes it is the opponent, sometimes you are not at your best but the team always finds a way to win it. That comes with mentality, in my opinion, and having that will to win, regardless of what is happening [on the pitch].”\nArsenal came very close to winning the Premier League last season but fell at the closing stages, which allowed Man City to pass them out.\nArteta’s side will have learned from that and although they have not been performing as well as last season so far, the Gunners have a will to win and that will keep them going until their performances pick up as the campaign progresses.",
  "word_count": 287,
  "scraped_at": "2026-02-14T02:25:08.298695",
  "_text_extracted": true
}