{
  "article_id": "67125563d32c",
  "url": "https://www.themag.co.uk/2024/05/great-news-that-newcastle-united-havent-qualified-for-europe-february-revisited/",
  "title": "Great news that Newcastle United havent qualified for Europe - February revisited",
  "date": "20240526T090000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Great news that Newcastle United haven’t qualified for Europe – February revisited\nSo, this Newcastle United season had one very final twist, in an entire nine and a half months season of so many twists and turns.\nManchester City decided to put in one of their very worst performances of the season and minnow Manchester United pulled off a massive shock.\nThis then set in motion a number of changes in terms of qualifying for Europe.\nManchester United went from no Europe to Europa League.\nChelsea went from Europa League to Europa Conference League.\nNewcastle United went from Europa Conference League to… no Europe at all.\nFor me, this is great news.\nI know many of you may disagree, but, let me explain.\nI wrote exactly the same, back at the start of February (see below), almost four months ago, plus, I wasn’t even talking about the Europa Conference League back then, I was actually saying it was very much for the best as a one-off view, if Newcastle United missed out on the Europa League!\nHave a look anyway and see if there is anything will make you change your mind…\nSo if say Chelsea got to the semi-finals of the Europa Conference League next season, they will be playing in that competition…\nAugust 2024 – Two matches\nOctober 2024 – Two matches\nNovember 2024 – Two matches\nDecember 2024 – Two matches\nFebruary 2025 – Two matches (if in the play-offs)\nMarch 2025 – Two matches\nApril 2025 – Two matches\nMay 2025 – Two matches (Three if getting to the final!)\nThe team that qualifies from England, in this case Chelsea, has to play in the final qualifying stage (before the league), so when the Premier League season kicks off on the weekend of Saturday 17 August, Chelsea then have the first leg of their Euro Conference play-off on the Thursday (22 August), then this is repeated the following week amongst their Premier League fixtures, playing the second Euro leg on Thursday 29 August.\nYou then add in the fact that as usual there are international football ‘breaks’ in September, October, November 2024 and March 2025, where loads of Chelsea’s better players will be flying off around the globe.\nPlus, you then of course have the fact that the very heart of this Europa Conference League competition was to allow more and more clubs from the lesser leagues to be able to play European football. That UEFA initiative means that the opponents you draw are far far more likely to be in far far off places that are far far more difficult to get to.\nIn short, I just think Newcastle United far far better off having finished seventh but NOT ended up in the third tier of European football. Not a case of being arrogant and think it is beneath NUFC, simply a case of thinking Newcastle United could have a serious go in the domestic cup competitions and especially the Premier League. Getting back into the Champions League on a regular basis is what it is all about (as well as trying to win things) and I just think competing in the Europa Conference League would have made that so so so much more difficult.\nSo get your chins up and look forward to what could be a massive season for Newcastle United.\nMy article on The Mag back on 6 February 2024:\n‘The question I am pondering today… Should Newcastle United fans really want NUFC to qualify and play in Europe next season?\nNewcastle United in Europe?\nSurely a no-brainer?\nI would agree, usually.\nHowever, I think next season could present Newcastle United with a massive opportunity. In some ways, a unique opportunity. if NOT finishing in a qualifying for Europe spot this time.\nNow no doubt some people are already calling me a Mackem, as is the way these days, when trying to think outside the box.\nAnyway, let me explain.\nTHEN you can call me a Mackem for not wanting Newcastle United to end up in a European qualifying place for next season.\nClearing the treatment room\nAs you might have heard, Eddie Howe has occasionally been missing a few players this season.\nCome the start of next season though, I expect / hope that we will have all of the following available to kick off the 2024/25 Premier League campaign:\nPope, Trippier, Schar, Botman, Livramento, Joelinton (after signing a new contract), Willock, Anderson, Lewis Miley, Barnes, Gordon, Bruno, Wilson, Isak\nEddie Howe will also have a number of these still in the squad Almiron, Longstaff, Lascelles, Burn, Hall (after making his loan permanent), Targett, Dubravka, Krafth, Murphy. Minteh as well potentially, if not sent on another loan.\nEnd of the gamble\nSandro Tonali will see his gambling ban come to an end and become available again at the end of August 2024.\n2024 European Championships\nFair to say that Newcastle United will have players in the current squad playing far less combined minutes out in Germany this summer, than any of the other Premier League clubs hoping to be competing towards the top end.\nSummer 2024 trading\nI have no doubt that we will see serious business by Newcastle United this summer.\nThey will have far more ability / flexibility to bring in quality new signings and that will be enhanced by a number of current first team squad players moving on. Some of them for quite significant amounts of cash compared to what could be banked in transfer fees in recent transfer windows, plus obviously just as (more?) importantly that increased FFP / PSR reach, over and above what comes in via transfer fees. Ever increasing revenues also playing a key role of course in this.\nThen we have the European competitions next season…\nAn awful lot has been talked about stuff like a possible fifth place in the Champions League next season for a Premier League club that finishes fifth, if English clubs collectively do best or second best compared to the other countries competing this season in te three competitions.\nHowever, I have seen little / nothing regarding just how full on this will be.\nWhat is the new Champions League format?\nThe biggest change is to the group stage, which will become a single 36-team League stage. Each side faces eight different teams (four at home, four away). The top eight overall advance directly to the round of 16; sides finishing from ninth to 24th will contest the knockout round play-offs, with the victors going through to the last 16. From then on it is a straight knockout.\nWhen are the 2024/25 Champions League League stage matches?\nMatchday 1: 17–19 September 2024\nMatchday 2: 1/2 October 2024\nMatchday 3: 22/23 October 2024\nMatchday 4: 5/6 November 2024\nMatchday 5: 26/27 November 2024\nMatchday 6: 10/11 December 2024\nMatchday 7: 21/22 January 2025\nMatchday 8: 29 January 2025\nWhen is the 2024/25 Champions League knockout stage?\nKnockout round play-offs: 11/12 & 18/19 February 2025\nRound of 16: 4/5 & 11/12 March 2025\nQuarter-finals: 8/9 & 15/16 April 2025\nSemi-finals: 29/30 April & 6/7 May 2025\nFinal: 31 May 2025\nEuropa League 2024/25 format\nIt is exactly the same as the Champions League with eight games against eight different teams, with top eight in the ‘league’ going through automatically into the last 16 and the next 16 in the ‘league’ having play-offs.\nWhen are the 2024/25 Europa League League stage matches?\nMatchday 1: 25/26 September 2024\nMatchday 2: 3 October 2024\nMatchday 3: 24 October 2024\nMatchday 4: 7 November 2024\nMatchday 5: 28 November 2024\nMatchday 6: 12 December 2024\nMatchday 7: 23 January 2025\nMatchday 8: 30 January 2025\nWhen is the 2024/25 Europa League knockout stage?\nKnockout round play-offs: 13 & 20 February 2025\nRound of 16: 6 & 13 March 2025\nQuarter-finals: 10 & 17 April 2025\nSemi-finals: 1 & 8 May 2025\nFinal: 21 May 2025\nSo coming back to my question of whether Newcastle United fans should want to qualify this season for European competition in 2024/25, I hope you are beginning to see just how big a change it is going to be next season, how full on, when it comes to the number of European games.\nIf we are to qualify this season, then I think fair to say Europa League and not Champions League.\nHowever, there are just as many games.\nSo if say Newcastle United got to the semi-finals of the Europa League next season, we would be playing in that competition…\nSeptember 2024 – One match\nOctober 2024 – Two matches\nNovember 2024 – Two matches\nDecember 2024 – One match\nJanuary 2025 – Two matches\nFebruary 2025 – Two matches (if in the play-offs)\nMarch 2025 – Two matches\nApril 2025 – Two matches\nMay 2025 – Two matches (Three if getting to the final!)\nI honestly think that this season it is worth taking one step back (and not qualifying for Europe) and then potentially taking many massive steps forward next season.\nI think we could have a massive go at the Premier League and certainly be very competitive in terms of aiming for a Champions League place for the 2025/26 competition and whisper it softly, but with how full on the Champions League is going to be next season, if Eddie Howe can get everybody back available AND add serious signings this summer, who is to say we couldn’t be competing at the very top end…?\nYou can also add in the domestic cups next season, as those in Europe even have matches to play in January 2025 as well.\nI am happy for you to call me a Mackem BUT that doesn’t mean I am wrong!’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1636,
  "scraped_at": "2026-02-14T02:17:35.173185",
  "_text_extracted": true
}