{
  "article_id": "671b79d62503",
  "url": "https://menafn.com/1105951657/Aleksander-Ceferin-Re-Elected-Uefa-President-Until-2027",
  "title": "Aleksander Ceferin Re - Elected Uefa President Until 2027",
  "date": "20230405T193000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "(MENAFN- Khaleej Times) Published: Wed 5 Apr 2023, 3:28 PM Last updated: Wed 5 Apr 2023, 3:31 PM\nAleksander Ceferin was re-elected unopposed for a third term of four years as president of Uefa at a meeting of European football's governing body in Lisbon on Wednesday.\nThe 55-year-old Slovenian lawyer, first elected in 2016 following the downfall of Frenchman Michel Platini, will now remain in the role until 2027.\n\"I would like to thak you from the bottom of my heart for your unanimous support. It really means a lot to me,\" Ceferin told delegates at the Uefa Congress in the Portuguese capital.\n\"It is a great honour but mainly it is a great, great responsibility, towards you and towards football.\"\nThe Uefa Congress came just a few weeks after Gianni Infantino was re-elected as president of the sport's world governing body Fifa, also unopposed.\nCeferin recently successfully opposed proposals by Infantino to hold the World Cup every two years, and his re-election by acclamation comes after he also fought off the breakaway European Super League project during his second term.\nHe will now oversee the introduction of a new format for the Champions League starting next year.\nHowever, the Super League is not dead yet, with Real Madrid, Barcelona and Juventus continuing to pursue the project.\nA lawsuit has been launched against Uefa and Fifa at the European Court of Justice, accusing the governing bodies of abusing their power by threatening to expel clubs and players interested in joining a breakaway league.\nA final ruling is expected in the coming weeks, although the court's advocate general, whose opinions are often followed by judges, provided a first ruling favourable to UEFA in December.\n\"Those who promote this project are now claiming that they want to save football,\" Ceferin said.\n\"Is anybody fooled? Here we have two opposing world views, cynicism over morality, selfishness over solidarity, greed over benevolence, shameful lies over the truth, cartel over meritocracy and democracy, the quest for profit over the quest for trophies.\n\"Domestic leagues must remain the foundation of football,\" he added.\nThe new Champions League format will be introduced from the 2024/25 season, with the number of clubs involved in the group stage increasing from 32 to 36 teams all playing in one pool using what is known as the Swiss system.\nThe new format will see all participants play eight matches against eight different opponents.\nCurrently the group stage is divided into eight sections of four teams playing each other home and away.\nWhile he seeks to calm tensions with Infantino, who also addressed the meeting in Lisbon, Ceferin will in addition be able to focus on pursuing the planned introduction of new Financial Fair Play rules.\nClubs will be forced to limit spending on player and staff wages, transfers and agents fees to 70 percent of total revenues by 2025/26.\nCeferin has also raised the possibility of relaxing rules that currently prevent clubs with the same owners facing each other in European competitions.\nALSO READ:\nlionel messi offered €400 million to play for saudi club al hilal: journalist\nwatch: cristiano ronaldo scores al nassr brace, wonderstruck fans call him 'real legend'\nipl 2023: kolkata signs england batsman jason roy",
  "word_count": 537,
  "scraped_at": "2026-02-14T02:09:52.182057",
  "_text_extracted": true
}