{
  "article_id": "6736c8e83b47",
  "url": "https://liverpooloffside.sbnation.com/liverpool-fc-news-coverage/2024/10/2/24260155/virgil-van-dijk-reacts-first-champions-league-home-game-bologna-anfield-we-missed-this-competition",
  "title": "Virgil van Dijk On Champions League Nights :  We Missed This Competition  ",
  "date": "20241002T173000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League nights under the lights at Anfield are amongst the most emblematic aspects of Liverpool Football Club and the most deeply cherished by fans. After a year out of the competition, Bologna visit on Wednesday for the first Anfield Night of the 2024-25 season.\nVirgil van Dijk On Champions League Nights: “We Missed This Competition”\nLiverpool play their second league phase Champions League game of the season—and first at Anfield—against Bologna on Wednesday evening.\n“We missed this competition last season, for sure,” said club captain Virgil van Dijk in his pre-game notes. “The Europa League was good for us, and of course we were disappointed that we didn’t go all the way, but there is just something special about the Champions League.\n“It is the competition that everyone wants to be playing in and, of course, you don’t need me to tell you about this club’s incredible history in it. Some of the best memories of my career were made on nights such as these, but that only makes me hungrier to create even more.”\nThe new look league phase of the Champions League means at least two more league phase games early in 2025, and it isn’t yet clear what will be needed to finish in the first tier of the current round of play in order to get a bye and avoid another two extra knockout round games.\nThree points in the openber against AC Milan was a good start, though, and after Bologna the Reds play RB Leipzig October 23rd, host Leverkusen November 5th and Real Madrid on the 27th, travel to Girona December 10th, host Lille January 21st, and finish at PSV on January 29th.",
  "word_count": 280,
  "scraped_at": "2026-02-14T02:17:48.911886",
  "_text_extracted": true
}