{
  "article_id": "675f871e9264",
  "url": "https://www.fourfourtwo.com/features/ranked-the-20-best-premier-league-wingers-ever",
  "title": "Ranked ! The 20 best Premier League wingers ever",
  "date": "20240819T110000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 20 best Premier League wingers ever\nThe best Premier League wingers ever: from the playmakers to the pace merchants and everyone in between\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSo who are the best Premier League wingers ever?\nYou probably have a few ideas in your head. Over time, these players have become the stars of the division.\nThey began as humble wide midfielders in 4-4-2s, supplying for the ever-more exciting forwards. But wingers have evolved in the Premier League to become goalscorers and headline-grabbers in their own right.\nSo we thought we'd work out who was the best ever. Note: we're looking at players who primarily played out wide over the course of their Premier League career, whether in a 4-4-2, 4-3-3 or any other formation. For us, a winger is simply a player who plays on the wing – whether you consider them an inside forward or a more traditional up-and-down touchline crosser.\nAt FourFourTwo, we poured over 32 years of this magnificent leagues to come up with lists of the best goalkeepers in the history of the Premier League, the best defenders, the best midfielders and the best strikers. For each, we assessed the overall impact, of course, as well as the legacy – but also how damn brilliant they were to play against.\nAnd this is what we came up with…\nVIDEO Why Savio Means Man City WON'T Miss Julian Alvarez\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe 20 best Premier League wingers ever: 20. Leroy Sane (Manchester City)\nWhile the likes of Sergio Aguero and Kevin De Bruyne could write epics of their time on Eastlands, Leroy Sane's time at Manchester City was a mere chapter – but one in which he was an undisputed superstar.\nA key figure in the Centurions side of 2017/18, Sane was one of Pep Guardiola's first signings in the Premier League. He repopularised the idea of a left-footed left-winger thriving in English football and for the 90 appearances he made in the Premier League, no one got close to him from a standing start.\n19. Harry Kewell (Leeds United, Liverpool)\nLeeds United fans' affection for Harry Kewell may have waned following later career decisions but the Aussie was one of the league's posterboys during their early-2000s pomp. Then he went to Liverpool and won the Champions League for good measure.\nKewell was a superb talent, able to drift, create and finish with aplomb. He remains one of the league's lasting ‘what if?’ players, however, in a box with Ledley King: injuries prevented him from truly delivering what he promised in those early seasons at Elland Road.\n18. Phil Foden (Manchester City)\nDebate will likely rage as to what his best position truly is – but should the Stockport Iniesta retire tomorrow, he'd already go down in Premier League history.\nIf only for his Premier League Player of the Season campaign last year, where he did start out wide before moving inside, thanks to an overlapping full-back. Phil Foden has been one of Manchester City's most fascinating superstars under Guardiola, however, with the Catalan deploying him in varying roles to gel the side. City's greatest-ever academy product?\n17. Marc Overmars (Arsenal)\nA man who really changed the game for wingers in the 90s. Marc Overmars was two-footed, able to cross and cut in equally, and was pacy to boot.\nIn that burgeoning turf war between Ferguson and Wenger, Overmars was on the frontline for the Frenchman, forming a frightening attack with the likes of Dennis Bergkamp and Nicolas Anelka. It was no real surprise when Barcelona came calling.\n16. Steve McManaman (Liverpool, Manchester City)\nTNT Sports' resident playing-out-from-the-back sceptic in the commentary booth could move on the pitch. Long before signing up for the Galactico programme, Steve McManaman dazzled for Liverpool as one of a number of the club's homegrown heroes.\nThat Macca was always criticised for never replicating such brilliance for England shows just how much he was admired for the Reds. Intelligent and intense in equal part, he was one of the first real high-profile free transfers of his era, too.\n15. Alexis Sanchez (Arsenal, Manchester United)\nHalf of arguably the worst swap deal that football has ever seen (so bad, in fact, that both sides felt short-changed) – but boy was Alexis Sanchez good before he swapped Arsenal for Manchester United.\nThe childlike Chilean was endlessly likeable, putting in the hard graft off the ball and providing box office moments on the biggest of stages. Sanchez had poise and power, linking up with Mesut Ozil in a duo that would rival any on Earth on their day: if Arsene Wenger had just two more players of Sanchez's calibre at this time, there's no question the Gunners would have won so much more.\n14. John Barnes (Liverpool, Newcastle United, Charlton Athletic)\nHis starring role in World In Motion suggests a peak passed by before the Premier League rebrand. Yet John Barnes was one of the lead characters of the league in the early 90s, with his unmistakable style still strong.\nBarnes played all over in the Premier League, featuring as a holding midfielder for Liverpool and Alan Shearer's backup for Newcastle. Such was his technical ability on the ball that even when he lost his pace to injuries, he could still provide the difference in his trademark left-wing role – and he's still regarded as one of England's greatest-ever in that position.\n13. Freddie Ljungberg (Arsenal, West Ham United)\nArsenal fans of a certain age will remember Freddie Ljungberg for seemingly always getting a goal in the biggest matches. Arsenal fans' parents of a certain age will remember having to buy red hair spray for their kids to copy Ljungberg's trademark mohican.\nThe Swede typified what made Arsenal so competitive around this time. He was sharper than anyone else off the ball but played with an aggression and a will to track back and help his team-mates. Left or right, he often stole the spotlight.\n12. David Ginola (Newcastle United, Tottenham Hotspur, Aston Villa, Everton)\nA raft of continental geniuses flooded to the Premier League in the 1990s, with Eric Cantona paving the way for Bergkamp, Juninho and even Paulo Futre (once he'd been given the No.10 shirt and not a minute before). David Ginola was one of the most beloved of the lot.\nThe effortlessly suave Frenchman was able to dribble through defenders like traffic cones, often directing games as if he knew all eyes were on him. He even won the Player of the Year Award – while at Tottenham – during Manchester United's Treble-winning season. Because he was worth it.\n11. Raheem Sterling (Liverpool, Manchester City, Chelsea)\nRaheem Sterling rose to prominence as the cultured attacking midfielder between Daniel Sturridge and Luis Suarez, in Brendan Rodgers' glistening diamond setup. It was under Pep Guardiola that he truly found his best.\nSterling is a testament to the art of always being in the right place at the right time. His timing of knowing when to swoop in and finish a move has always been majestic, as he refined his game to do exactly what Pep needed at any given moment.\n- 1\n- 2\nCurrent page: The best Premier League wingers ever: 20-11\nNext Page The best Premier League wingers ever: 10-1Mark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 1398,
  "scraped_at": "2026-02-14T01:51:48.873905",
  "_text_extracted": true
}