{
  "article_id": "678359ad3dcb",
  "url": "https://thepeoplesperson.com/2023/05/24/erik-ten-hag-says-marcus-rashford-will-play-against-chelsea-264442/",
  "title": "Erik ten Hag says Marcus Rashford will play against Chelsea",
  "date": "20230524T121500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United manager Erik ten Hag says Marcus Rashford should be OK to play in his side’s Premier League home match with Chelsea tomorrow.\nSpeaking at the pre-match press conference ahead of the game (via manutd.com), Ten Hag confirmed:\n“It looks like (he´ll play]. Yesterday, he returned to training, he looks quite fit but we have to see today what is the outcome of the training, how did we recover and then we will make our choices.”\nTen Hag then responded to questions about Anthony Martial’s form.\n“If you are not available, you can’t score,” he said.\n“When he was available we played better, the team is winning games, he’s also scoring goals but he has to be available.”\nWith United still needing a point to guarantee Champions League football next season, the Dutchman said that focus on tomorrow’s game is crucial.\n“First, we have to win the game tomorrow and get the job done. Then it’s about judgement from others if it’s a good, bad or normal performance,” he said.\n“We want to compete with the best, then you have to be in the Champions League.\n“In the Premier League, you have to be one of the first four, that’s not easy, many are competing for it, many think they should be in and we are one of them.\n“We are in a project, we want to go back and win trophies, we win one trophy but we want more trophies, compete with the best, we are still in a journey but we think we are in the right direction but it can always be better. Because good is not good enough.”\nThe boss was also asked if there was any truth to the rumours linking United with a move for PSG forward Neymar.\n“When we have news we will tell you,” he replied.\nImagine an FA Cup Final programme, but 100% online!\nWith just a couple of clicks you could be reading the FA Cup final special edition of United Matchday Magazine, right here on your device. All the latest news, meet the teams, tactical preview, opinion, debate, transfer news, quiz and much more! Get yours now for just £3/$3.75 and\nbe in the know about everything in red!",
  "word_count": 371,
  "scraped_at": "2026-02-14T02:24:42.734014",
  "_text_extracted": true
}