{
  "article_id": "678cc0016763",
  "url": "https://www.espn.com/soccer/uefa-champions-league/story/4884537/manchester-city-struggle-at-rb-leipzig-in-champions-league-first-leg-draw",
  "title": "Manchester City struggle in second half in draw at Leipzig",
  "date": "20230223T133000Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LEIPZIG, Germany -- Manchester City were held to a 1-1 draw by RB Leipzig in their Champions League last-16 first leg tie at Red Bull Arena.\nRiyad Mahrez scored his 12th goal in his last 20 games as City dominated the first half but the game was turned on its head in the second half, with the Bundesliga side unfortunate that they only had Josko Gvardiol's equaliser to show for an impressive performance after half-time.\nCity will remain favourites ahead of the second leg in Manchester in two weeks' time but Leipzig will now fancy their chances of causing a shock.\nRapid reaction\n1. Man City relieved with a draw after dismal second half\nThe RB Leipzig fans behind one of the goals unfurled a banner during the first half which read \"We're on our way to Istanbul.\" By halftime it had been packed away, with those same supporters perhaps realising that, after a dominant first half from City, their journey to the Champions League final was likely to end when these two teams meet again at the Etihad Stadium on Mar. 14.\nBut after a much improved second-half during which Leipzig were the better team and had the better chances, their fans will feel emboldened to pack the banner for the trip to Manchester. Any optimistic Leipzig supporters won't be cancelling flights to Turkey just yet.\n- Stream on ESPN+: LaLiga, Bundesliga & more (U.S.)\n- Read on ESPN+: Is your fave player in the wrong position?\nGuardiola painted a frustrated figure during the second half and immediately after the full-time whistle gathered his players together in the centre of the pitch for a debrief before sending them off to clap the travelling fans in the corner of the Red Bull Arena. Erling Haaland was especially quiet with the Norwegian having just one clear chance which he skewed wide.\nCity had a seemingly justifiable shout for a penalty late when it appeared that Henrichs palmed Rodri's header but in the end the visitors were happy to escape Leipzig with a draw.\n2. Leipzig take advantage of City's defensive lapses\nCity will still be favourites to progress to the quarterfinals for the sixth year in a row but their shaky second half is evidence that the vulnerability they've occasionally shown in the Premier League this season is still there.\nGuardiola's team were in complete control in the first half but with Leipzig more adventurous after halftime thanks, in part, to Benjamin Heinrichs' introduction at the break, Gvardiol's equaliser was more than deserved when it came. Both Heinrichs and Andre Silva had good opportunities with the score at 1-0 and on a different night, the German side could have been heading to the Etihad Stadium with a lead.\nFor all the talk of his silky attacking football, Guardiola hates conceding chances and he will be concerned that City have kept just four clean sheets in 15 games since the World Cup. Gvardiol's goal was also the fifth City have conceded from corners this season and the third in this season's Champions League alone.\nWith Erling Haaland in the team and Mahrez back in form, they are always going to be capable of scoring goals but their defence can sometimes creak and Leipzig are just the latest team to take advantage.\n3. Players stripped away doesn't help Leipzig ambitions\nRB Leipzig have ambitions to continually get results like this in the Champions League knockout rounds but they face an almost impossible task with their best players routinely picked off by bigger clubs.\nStriker Christopher Nkunku, only a substitute against City as he continues his recovery from injury, will join Chelsea in the summer and it's likely 21-year-old centre-back Gvardiol, a star for Croatia at the World Cup, will also head for the exit. Timo Werner is already back after spending two years at Chelsea following a big money move in 2020.\nLeipzig have regenerated before having lost Dayot Upamecano and Marcel Sabitzer -- both in the team which reached the Champions League semifinals in 2020 -- to Bundesliga rivals Bayern Munich but it's fanciful to suggest a club can do it time and time again. Sabitzer's career path sums up RB Leipzig's situation well. Plucked by Bayern in August 2021, he struggled to cement his place in the team and joined Manchester United on loan in January.\nIt's likely Sabitzer will leave permanently in the summer and guess where Bayern went looking for a replacement? That's right, Leipzig's Konrad Laimer -- who is set to join Bayern at the end of the season.\nBest and worst performers\nBEST: Josko Gvardiol, DF, RB Leipzig\nHe kept Haaland very quiet and popped up with Leipzig's equaliser at the other end.\nBEST: Jack Grealish, FW, Man City\nWon the ball back in the build up to Mahrez's goal and looked good in the first half.\nBEST: Benjamin Henrichs, FW, RB Leipzig\nMade Leipzig look far more of a threat after coming on at half-time.\nWORST: Erling Haaland, ST, Man City\nHis night was summed up when he was sent through just before Leipzig's equaliser but dragged a tame shot wide.\nWORST: Xaver Schlager, MF, RB Leipzig\nMade a horrible mistake to gift the ball to Grealish in the build-up to Mahrez's goal.\nWORST: Manuel Akanji, DF, Man City\nLooked uncomfortable, particularly in the second half, and was turned inside out by Andre Silva for one chance.\nHighlights and notable moments\nA deserved second-half goal for Leipzig thanks to their star defender Josko Gvardiol, who looks to also have some serious ups.\nJoško Gvardiol catches Ederson dancing on his line and Leipzig are back in this one. 🌶 pic.twitter.com/D1uWIRZ76p\n— CBS Sports Golazo ⚽️ (@CBSSportsGolazo) February 22, 2023\nAfter the match: What the managers and players said\nRB Leipzig coach Marco Rose, on the result: \"Two different halves ... We were too passive in the first and just ran after them. The second was different, exactly how we had imagined it and we put them under pressure.\"\nManchester City coach Pep Guardiola, on the result: \"Hopefully in three weeks we arrive in a good condition. We can do better. We have to adjust some things and to find a way to go through.\"\nGuardiola on what he said in the post-match huddle: \"I said 'why you have your heads down? Heads up, it was good.'\"\nGuardiola on if there should have been a late penalty: \"I didn't see the image ... I saw my players but not the image. It was checked [by VAR]. We didn't talk about the refereeing decisions, the referee decided no.\"\nKey stats (provided by ESPN Stats & Information research)\n- Riyad Mahrez scores his seventh Champions League knockout stage goal for Manchester City, tying Gabriel Jesus, Bernardo Silva and Raheem Sterling for the third most in club history (Sergio Agüero and Kevin De Bruyne have 9 each).\n- Josko Gvardiol doesn't score often but when he does, it's against big sides. Wednesday's equaliser was his first club goal since Oct. 25, 2022, when he scored against Real Madrid in the group stages.\n- Erling Haaland was limited to a single touch in the attacking third in that first half. He had 22 total for the game but ultimately just one shot that wasn't on target.\n- Set piece struggles for Pep Guardiola's side -- it was their fifth goal allowed from corner kicks this season in all competitions (third in Champions League). City hadn't allowed five goals from corner kicks in a single season since 2019-20 (also five).\nUp next\nRB Leipzig: Before heading to the Etihad for the second leg on March 14, a slate of Bundesliga matches as they try to keep pace in the standings -- they first welcome Eintracht Frankfurt on Feb. 25 and then Borussia Dortmund on March 3, and then a trip to Borussia Mochengladbach on March 11.\nManchester City: Back into league action with a trip to AFC Bournemouth on Saturday, then yet another road match on Feb. 28 at Bristol City in FA Cup fifth round action. Two more Premier League matches (vs. Newcastle United on March 4, at Crystal Palace on March 11) before Leipzig come to the Etihad on March 14 for the second leg tilt.",
  "word_count": 1375,
  "scraped_at": "2026-02-14T01:46:30.524413",
  "_text_extracted": true
}