{
  "article_id": "67a4d2178c06",
  "url": "https://www.90min.com/every-chelsea-ballon-dor-winner-ever",
  "title": "Every Chelsea Ballon dOr winner ever",
  "date": "20241028T034500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Every Chelsea Ballon d'Or winner ever\n- Chelsea have boasted some of modern football's greatest superstars\n- Blues are five-time Premier League champions and two-time Champions League winners\n- Ballon d'Or has been awarded to best male footballer since 1956\nRoman Abramovich's arrival at Stamford Bridge in 2003 brought with it legions of superstars for the following two decades.\nThe Blues had won just one first division title and three FA Cup crowns prior to the Russian oligarch's takeover but swift investment in the playing squad and staff drastically changed Chelsea's fortunes.\nA wave of world-class talent ended up residing in west London and the trophy cabinet was filled with each passing year, propelling the Blues into the same stratosphere as their English and European rivals. However, Chelsea's rapid ascent since the early 2000s hasn't always translated to individual honours.\nThe Ballon d'Or - handed out to the best male footballer every year since 1956 - has frequently eluded Chelsea's best and brightest, an issue only exacerbated by the dominance of Lionel Messi and Cristiano Ronaldo in recent times.\nHere is every Chelsea player to have won the Ballon d'Or during their time at Stamford Bridge.\nEvery player who has won the Ballon d'Or with Chelsea\nThe hard truth is that no player has ever won the Ballon d'Or while playing for Chelsea. Despite the club boasting an array of superstars over the year - before and after the turn of the century - no individual has ever won the award during their time at Stamford Bridge.\nThree former Chelsea players have won football's greatest individual prize, although they all did so during their time in Italy with AC Milan.\nRuud Gullit claimed the award in 1987 as one of Milan's Dutch superstars, with the former Chelsea player-manager not moving to England until 1995. In the same year that Gullit moved to Chelsea, George Weah was lifting the Ballon d'Or himself.\nWeah became the first non-European to win the award after the Ballon d'Or was opened up to players worldwide in 1995, while he remains the only African to claim the prize. His time at Chelsea was short as he joined the Blues on loan from Milan in 2000.\nAndriy Shevchenko then picked up the award in 2004, shortly before his disappointing move to the English capital less than two years later. The Milan and Ukraine sharpshooter beat Barcelona duo Deco - who also went on to play for Chelsea - and Ronaldinho to the accolade.\nChelsea players who have finished in the Ballon d'Or top three\nThere have been several close calls when it comes to Chelsea players and the Ballon d'Or, with club legend Frank Lampard coming closest to being named the world's best in 2005. Having enjoyed a sensational year in which Chelsea won a first Premier League title under Jose Mourinho, the English midfielder had to settle for second place.\nLampard finished ahead of his international colleague Steven Gerrard who came third but neither could topple the insatiable Brazilian trickster Ronaldinho. The Barcelona man was a comfortable winner come the final vote with 77 more points than Lampard.\nJorginho was a surprise top-three finisher in the 2021 Ballon d'Or vote. The Italian's presence on the podium was largely down to team achievements, although the midfielder was impressive in a Champions League triumph with Chelsea and Euro 2020 victory with Italy. He was beaten to the prize by Messi, who earned the seventh of eight crowns that year.\nIn the Ballon d'Or Femenin - the equivalent of the Ballon d'Or in women's football - Chelsea and Australia forward Sam Kerr has finished in the top three on three separate occasions. Third-placed finishes in 2021 and 2022 were followed by silver in 2023.",
  "word_count": 625,
  "scraped_at": "2026-02-14T02:14:47.094652",
  "_text_extracted": true
}