{
  "article_id": "67a5bd945080",
  "url": "https://www.theguardian.com/world/2024/nov/14/first-edition-nhs-league-tables-wes-streeting",
  "title": "Thursday briefing : Can Labour plan for league tables cure the ailing NHS ? |",
  "date": "20241114T090000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning.\nLeague tables can be a valuable way to measure success – there’s a reason they are such a popular tool in the worlds of sport, academia and business.\nAnd Wes Streeting has decided it’s time to bring that competitive edge to the NHS. Yesterday, the health secretary delivered a “bullish” and contentious speech confirming the government will publish a league table ranking hospitals in England, after a “no-holds-barred, sweeping review” of NHS performance. Those at the top will be rewarded with more funding and autonomy, while those at the bottom can expect “turnaround teams” and sackings. Streeting’s statements follow an independent review of the NHS that found hospital productivity has sharply declined in the past five years.\nThe proposal has provoked a furious backlash from NHS leaders and staff, who believe naming and shaming struggling trusts obscures the underlying problems and does little to change the situation on the ground. Instead, they say, it will simply further demoralise staff and degrade patient confidence.\nStreeting, however, remains undeterred. In his view, the NHS faces an existential crisis; the service is living on “borrowed time”, he has warned, adding that “if a Labour government can’t improve the NHS, then it simply won’t survive”.\nFor today’s newsletter, I spoke with health policy editor Denis Campbell to unpack what we know so far about this strategy. That’s right after the headlines.\nFive big stories\n-\nUnited States | Republicans have secured a majority in the US House of Representatives, extending their hold on the lower chamber and delivering a governing trifecta in Washington that could give Donald Trump sweeping power to enact his legislative agenda.\n-\nMiddle East | Israel is using evacuation orders to pursue the “deliberate and massive forced displacement” of Palestinian civilians in Gaza, according to a report by Human Rights Watch, which says the policy amounts to crimes against humanity.\n-\nLabour | Rachel Reeves will announce plans to merge local government retirement schemes into “megafunds” as she tries to revive long-running efforts to overhaul the UK’s public pension system.\n-\nSpain | Authorities in eastern and southern Spain have closed schools and begun evacuating some residents as the country is pounded by further torrential rain two weeks after catastrophic floods that killed at least 215 people and unleashed a bitter political blame game.\n-\nEnvironment | World leaders have promised to try to stop the planet heating by more than 1.5C but current policies put the temperature rise on track for 2.7C, a report has found. “Minimal progress” has been made this year, according to the Climate Action Tracker project. The consortium’s estimate has not shifted since the Cop26 climate summit in Glasgow three years ago.\nIn depth: ‘The rationale isn’t clear – and I’m not sure there’s a solid evidence base’\nStreeting’s stance on the NHS – a shift from “zero consequences for failure to zero tolerance” and a promise to root out the “rotten apple” senior managers he calls the NHS’s “guilty secret” – has been met with scepticism, fear and anger by many who work in the health service. After a decade of severe underfunding and institutional crises, many question whether measures like league tables are anything more than a sop to those seeking tough action from a newly elected government. But despite institutional resistance, the health secretary is determined to push on.\nStreeting is drawing inspiration from New Labour in its first term: it also inherited a struggling NHS and turned performance around by the time it left office 13 years later. “He’s going back to the future with this,” says Denis. Streeting has even appointed Alan Milburn, a former Labour health secretary, as a senior health adviser, seeking to apply lessons from past successes to today’s challenges.\nWhat would change?\nThe government argues that the carrot-and-stick approach of a league table will drive faster progress in the NHS. Hospital trusts that perform well will be able to reinvest their budget surpluses into modernising buildings, equipment and technology. On the flip side, struggling hospitals can expect tighter monitoring and tougher measures.\nThe government has also introduced a new pay framework for senior managers, designed to “clamp down on poor performance”. Under this plan, those overseeing trusts with major deficits or poor patient services will not be eligible for pay rises.\nHospital bosses have described the new plans to Denis as a “crude” approach to measuring performance, warning that it risks further lowering already fragile morale. The NHS has long struggled with a chronic recruitment and retention crisis, and Dr Adrian Boyle, president of the Royal College of Emergency Medicine, cautioned in a BBC interview that this policy could make the problem even worse. And it’s not just the staff who would be affected – patients may also feel pressured to seek treatment in higher performing hospitals elsewhere, which could be extremely far from where they live. “There are so many practical issues,” Denis says.\nWhy a league table?\nThe government claims that a league table offers a practical way to assess and measure NHS performance across the board. “The rationale for this isn’t clear,” says Denis, “and I’m not sure there’s a solid evidence base for it.”\nAnd the idea of a league table is not new. Over two decades ago, a Labour government tried to introduce it but ultimately abandoned the idea after a few years.\n“It’s easy to see why many in the NHS feel this approach is unnecessary and a bit punitive,” Denis adds. The NHS is already one of the most monitored, regulated and scrutinised health systems in the world. “There are already multiple regulators and an overwhelming amount of data on NHS performance – so as patients, taxpayers and voters, the public isn’t exactly lacking information to judge how different parts of the NHS are doing,” Denis points out.\nThe metrics\nThe Department of Health and Social Care has indicated that the league table will be based on a number of key metrics including patient access to care, waiting times, financial performance (most hospital trusts in England are now significantly over budget) and the quality of leadership. However, it remains unclear whether these disparate data points will be combined into a single ranking.\n“NHS leaders have also expressed concerns about how this will account for factors beyond hospitals’ control,” Denis says. A hospital’s ability to meet performance targets, for example, is heavily influenced by the availability of local GP services. With many people unable to secure GP appointments, more patients are forced to seek care in A&E, creating additional strain on hospitals.\nHospitals where the local population has more health needs than the national average – usually poorer areas – face higher demand compared with more affluent areas with generally healthier populations. If the league table does not account for these factors, hospitals serving low-income areas will fare worse, and be penalised, due to challenges outside their control.\nTough on NHS failings, tough on the causes of NHS failings\nThere is also a clear element of political theatre in play. “A big part of Streeting’s speech is about showing the treasury and the rest of government that he’s being tough on the NHS,” says Denis, “that he’s not just accepting the £22.6bn increase in day-to-day NHS funding without ensuring the government gets value for its money.\n“I think we will see more of this tone from Streeting during his tenure as health secretary, where he will be seen to be giving the NHS a bit of a kicking and treating it as if it’s on the naughty steps to justify the money.”\nWhat else we’ve been reading\n-\nRising food bills, exacerbated by extreme weather, were a contributing factor to Donald Trump’s win last week. The problem will only get worse unless our leaders get a grip on the climate crisis, James Meadway writes. Charlie Lindlar, acting deputy editor, newsletters\n-\nMichael Billington wrote a lovely tribute to Timothy West after news of the actor’s death. The man could play Churchill, Stalin and a bumbling Private Godfrey in three remade Dad’s Army episodes with equal aplomb, but is perhaps best remembered by me turning terrifyingly into a bee in the TV adaptation of Roald Dahl’s Royal Jelly. Toby Moses, head of newsletters\n-\nStrongest endorsement possible for Arwa Mahdawi’s call for an end to the celebrity children’s author. Not only do they take work from genuinely talented writers in an already perilous industry, Arwa warns “you could also find yourself embroiled in an international PR disaster” like Jamie Oliver. Charlie\n-\nAnywhere but Washington draws to a close with Oliver Laughland looking back at his travels across America, lamenting the Democrats’ lost opportunity to defeat Donald Trump. Toby\n-\nRead at your peril: Sarah Phillips hears from pest controllers on how to protect your home from mice, moths and more. “Cats don’t always help” will come as no surprise to any cat owner. Charlie\nSport\nFootball | Chelsea recovered from conceding a 22nd-minute goal to Murphy Agnew to defeat Celtic 2-1 and maintain their winning start in the Women’s Champions League.\nTennis | Carlos Alcaraz made light of feeling under the weather as he dispatched Andrey Rublev in impressive fashion to revive his hopes at the ATP Finals in Turin on Wednesday. The Spaniard has been suffering with respiratory issues and wore pink nasal tape for his match against Rublev, but enjoyed a resounding 6-3, 7-6 (8) victory.\nFootball | Harry Kane has delivered a slapdown to England’s long list of absentees, saying that club should never come before country and suggesting that certain players have used the packed calendar as an excuse to withdraw from Lee Carsley’s final camp in charge.\nThe front pages\n“Israel ‘committing crimes against humanity’ in Gaza, warns report” – the front-page lead of the Guardian this morning. The Mirror reports on an ITV investigation: “Wild west of cosmetic surgery in Britain”. “Business backlash over budget” – that’s the Times while the Daily Mail has “Now council tax to rise by £110”. “Yes, I am fully responsible … she died because of me” – the Express covers the Sara Sharif murder trial. “Police in ‘appalling’ attack on free speech” says the Telegraph about an investigation of one of its journalists. “Labour will miss its new homes pledge … says official leading plan” – that’s the i while the Financial Times splashes on “Reeves will force council pensions to merge into eight £50bn ‘megafunds”. And finally the Metro: “Trump’s defence chief is TV host”.\nToday in Focus\nThe fall of Justin Welby\nAfter the publication of a damning report into a decades-long child abuse scandal, Justin Welby has bowed to pressure to resign as archbishop of Canterbury. Harriet Sherwood reports\nCartoon of the day | Nicola Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nTetris could not be simpler. Just think of the title and you will recall the game’s simple premise, and perhaps that singular theme. But what if the history of this very basic game was more complicated, and more fascinating, than you knew?\nIn this piece, video games editor Keza MacDonald delves into Tetris Forever, an interactive documentary that dives deep into the making of the game in 1980s Soviet Russia, and its incalculable cultural impact.\n“Tetris has come to feel eternal, and there’s something almost spiritual about playing a recreation of its first version,” she writes. “Playing it, I feel a small echo of what I feel when I look at the Rosetta Stone. It is an amazing thing, a rare example of a perfect game that despite all the drama outlined in this documentary and all the various version over the years, is still pretty much unchanged after 40 years.”\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 1994,
  "scraped_at": "2026-02-14T01:49:13.382550",
  "_text_extracted": true
}