{
  "article_id": "67aad0e29ce5",
  "url": "https://www.techradar.com/streaming/entertainment/barcelona-vs-borussia-dortmund-how-to-watch-team-news-lineups-betting",
  "title": "Where to watch Barcelona vs Borussia Dortmund live stream : How to watch today Champions League match online , team news , lineups , betting",
  "date": "20250409T180000Z",
  "domain": "techradar.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Where to watch Barcelona vs Borussia Dortmund live stream: How to watch today's Champions League match online, team news, lineups, betting\nBorussia Dortmund take on Hansi Flick's Barcelona at Olympic Stadium\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nYou are now subscribed\nYour newsletter sign-up was successful\nTonight, the Olympic Stadium buzzes with anticipation as Barcelona clashes with Borussia Dortmund in a pivotal UEFA Champions League quarter-final first leg encounter.\nThe high-stakes clash has already ignited debate over the Barcelona starting lineup and Champions League predictions, but one thing is for sure: it presents a fascinating tactical battle.\nBarcelona, under Hansi Flick's guidance, have displayed a potent attacking force, particularly at home and their recent LaLiga form showcases their ability to dominate possession.\nKey players like Robert Lewandowski remain a constant threat, and the youthful exuberance of Lamine Yamal adds a dynamic edge to their attack. The midfield, anchored by Frenkie de Jong and Pedri, will be crucial in controlling the tempo of the game.\nHowever, Barcelona's defensive vulnerabilities, particularly with some injuries in the back line, namely Dani Olmo, could be exploited by Dortmund's quick and incisive attacking players.\nBorussia Dortmund, captained by Emre Can, arrive with a reputation for counter-attacking. Serhou Guirassy's goal-scoring prowess is a major concern for Barcelona's defense, while midfielder Julian Brandt can unlock any defense.\nDortmund's recent Bundesliga form indicates they are capable of producing high scoring outputs. Though they are having to deal with some key injuries – Marcel Sabitzer and defender Nico Schlotterbeck are both out.\nTo watch Barcelona vs Dortmund live, read on as we reveal your streaming options and TV broadcasters, plus pre-match build-up and analysis ahead of this electrifying Champions League showdown.\nWhere to watch Barcelona vs Borussia Dortmund live: streaming link, start time\n- Kick off time: 3pm ET / 8pm BST\n- TV/streaming: Paramount+ (US)\n- Free stream: VM Play in Ireland\nBarcelona vs Borussia Dortmund team news, predicted line up\nBARCELONA TEAM LINEUP (predicted): Szczesny; Kounde, Cubarsi, Martinez, Balde; de Jong, Pedri; Yamal, Gavi, Raphinha; Lewandowski\nOUT: Marc-Andre ter Stegen (knee), Dani Olmo (muscular), Marc Bernal (ACL), Marc Casado (ligament)\nDORTMUND TEAM LINEUP (predicted): Kobel; Ryerson, Can, Anton, Bensebaini; Nmecha, Chukwuemeka; Adeyemi, Brandt, Beier; Guirassy\nOUT: Marcel Sabitzer (MCL), Niklas Sule (leg) | QUESIONABLE: Cole Campbell (knock)\nWhere to watch Barcelona vs Borussia Dortmund in the US\nBarcelona vs Borussia Dortmund kicks off at 3pm ET on Paramount Plus in the US for the quarter-final first leg. Subscriptions start at at $7.99/month, rising to $12.99 to remove ads. Fans with cable TV packages can watch the game live on CBS.\nWhere to watch Barcelona vs Borussia Dortmund in the UK\nTonight's UEFA Champions League quarter-final match will be live on Discovery Plus Premium in the UK. Subscriptions costs £30.99 for Premium, which includes TNT Sports. TNT Sports has the rights to more than 185 matches this season. You also have the option to add the sports package to your EE, BT or Sky broadband deal from £16 per month.\nWhere to watch Barcelona vs Borussia Dortmund in Australia\nBarcelona vs Borussia Dortmund will be screened live on Stan Sport in Australia. Stan Sport has the rights to the Champions League 2024/25 there. Subscriptions start from $15 per month on top of a regular $10 Stan plan. The platform claims to be \"the home of UEFA\" soccer in Australia.\nWhere to watch Barcelona vs Borussia Dortmund from anywhere\nA VPN does more than just help you get around geo-blocks; it also encrypts your connection, keeping your data and personal information safe from hackers and anyone trying to spy while you stream. It's swiftly becoming an essential for modern tech fans. We use NordVPN – not only is it the best VPN, it's also affordable.\n- Sign up for a trusted VPN\n- Install it on your device\n- Set your location to your chosen location\n- Watch your usual live streaming service!\nNordVPN – Save 72% and get a 30-day trial\nNordVPN is the ultimate cycbersecurity tool, protecting you as you stream and unblocking geo-restricted streaming platforms around the world. It's our current best VPN and you can explore it fully in our NordVPN review.\nWhat time is Barcelona vs Borussia Dortmund?\nThe Barcelona vs Borussia Dortmund kicks off on Wednesday, April 9 at 3pm ET / 8pm BST. You can watch live TV coverage of the build up from 2.15pm ET / 7.15pm BST.\nWhat has Hans Flick of Barcelona said about today's 1st leg against Dortmund?\n“Dortmund are a very stable team and they play very attacking football. But we have been playing well at home and away in the Champions League. Niko [Kovac] will be able to field a good lineup [regardless of their injury situation]. They are strong defensively and I wish all the best to their injured players. They have very good players, and it is a shame [about their injuries], but they have enough players to cover their absences.”\nWhat has Niko Kovač of Dortmund said about today's 1st leg against Barcelona?\n“[Flick and I] know each other well and appreciate each other as people. We also know how we view each other’s football. We’re aware of the quality of Barcelona’s forwards, and we’ll have to defend well. We want to take advantage of their weaknesses, and we come here to try to win the game. I think Barca are favourites tomorrow, but Dortmund played in last season’s final. Anything is possible here. We’re a bit of an underdog, but that doesn’t necessarily work in Barcelona’s favour.”\nWhat are the latest Barcelona vs Borussia Dortmund odds?\nBetting experts tip Barcelona vs Borussia Dortmund to be a \"one-sided affair\", with the latest betting odds (2 hours before the game) placing Barcelona at -138 to overcome a -1.5 handicap and win the first leg outright.\nWhen is the second leg?\nThe second leg of Barcelona vs Borussia Dortmund will take place on Weds, April 15. You can keep to date with 2024/25 Champions League fixtures and goals on TikTok (@ChampionsLeague) and UEFA's YouTube (@UEFA).\nWe test and review VPN services in the context of legal recreational uses. For example: 1. Accessing a service from another country (subject to the terms and conditions of that service). 2. Protecting your online security and strengthening your online privacy when abroad. We do not support or condone the illegal or malicious use of VPN services. Consuming pirated content that is paid-for is neither endorsed nor approved by Future Publishing.\nSign up for breaking news, reviews, opinion, top tech deals, and more.\nTom is a journalist, copywriter and content designer based in the UK. He has written articles for What Hi-Fi?, T3, ShortList, The Sun, The Mail on Sunday, The Daily Telegraph, Elle Deco, The Sunday Times, Men's Health and many more. His specialities include the streaming services, mobile technology and electric vehicles.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 1175,
  "scraped_at": "2026-02-14T02:05:46.993592",
  "_text_extracted": true
}