{
  "article_id": "67b2f2f945aa",
  "url": "https://www.the42.ie/ireland-turkiye-nations-league-preview-6718202-May2025/",
  "title": "Ireland eye Turkish delight as Nations League business end begins",
  "date": "20250530T060000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TO ISTANBUL, WHERE Ireland hit the business end of their Uefa Women’s Nations League campaign.\nCarla Ward’s side face Türkiye in their penultimate group game, a must-win if they are to stay in the race for automatic promotion to League A.\nGroup B2 finishes as it started for Ireland: against Türkiye and Slovenia, the latter fixture a potential Páirc Uí Chaoimh shootout next Tuesday evening.\nSlovenia have been in the driving seat since stunning the top seeds 4-0 in Koper in February. They face Greece this evening, with Ireland hoping for a slip-up while focusing on their own task.\n“First and foremost, we have to go and win this game,” said Ward.\n“Hopefully, Greece can get something from Slovenia. If they don’t, the first bite of the cherry would be to try and beat Slovenia by five because it goes on head-to-head.\n“If we don’t and we finish second, then we’ve got to second bite it with the play-offs in October. That’s huge, and it’s an understanding that if we finish second, that’s okay. We have to then make sure that we get the job done in October.”\nThe aim, while a tall order, will be to finish it over the coming days.\nAside from the excitement around Katie McCabe’s Champions League success with Arsenal, the build-up has been relatively low-key. No harm, with off-field drama often overshadowing the football of late.\nThe Irish squad linked up in Istanbul on Sunday, with most players in their club off-season. While the weather has been mixed, the vibes appear good.\nMcCabe and US-based duo Denise O’Sullivan and Kyra Carusa reported late, with yesterday’s pre-match tune-up at Esenler Erokspor Stadium the first time all 24 players trained. Indeed, it was just the fourth time Ward has had her full complement on the training pitch since her first camp in charge in February.\nIt all began with a scrappy, unconvincing 1-0 win over Türkiye. Carusa scored the winner for a much-changed Irish team on a cut-up pitch at Tallaght Stadium, but the gritty Turks — ranked 32 places inferior, 58th in the world — almost levelled matters late on.\nThe Slovenia shocker followed in the same window, before Ireland got back on track with 4-0 and 2-1 wins over Greece. It has not quite been the same stroll as the inaugural Nations League B campaign in 2023 (100% record, 20 goals scored, two conceded), but the overriding message is that progress is being made.\n“I think this will be a better camp than the first camp against the same opponents,” said Marissa Sheva this week.\n“There was almost an overhaul of tactics from how we were previously playing. We’re being encouraged to build out from the back more, be a little bit more aggressive from the get-go, trying to utilise our midfield more, and you can’t change that overnight.\n“I think we’re in a much better position to give Türkiye a game and hopefully beat them by more than a goal.”\nWard immediately moved away from the back three/five Ireland have played through the years, deploying a variation of 4-3-3 / 4-1-4-1. Five players have started every game of the new era: Courtney Brosnan, Anna Patten, Aoife Mannion, Denise O’Sullivan and Lucy Quinn, with Brosnan, Patten, Mannion and O’Sullivan playing every minute.\nMcCabe played just one half of the Greece double-header due to injury and suspension, and while the captain is available for selection this evening, she could again be held in reserve as an ongoing calf issue and fatigue are managed.\nLong-throw specialist Megan Campbell has been deputising at left-back, with Mannion also experimented, but the Manchester United player is making the right-back berth her own. Patten and Jessie Stapleton appear to be the favoured centre-half pairing, but Campbell and Megan Connolly have also featured there. Caitlin Hayes has fallen down the pecking order, while the retiring Louise Quinn is back in the fold for her swansong.\nRuesha Littlejohn appears to be Ward’s preferred number six. Connolly and Tyler Toland are other options, while Sheva has been combining well with the ever-present O’Sullivan, but the midfield could take any shape.\nThe same applies further forward: A debut is possible for new call-up Erin Healy, but Carusa and Amber Barrett have both scored two goals apiece, and Ward has been impressed by the returning Saoirse Noonan. With Heather Payne and Leanne Kiernan out injured, Ireland are lacking in wide players: recent selections suggest Lucy Quinn will get the nod again, but Abbie Larkin or Emily Murphy could also be handed opportunities.\nShelbourne midfielder Aoibheann Clancy and Bristol City defender Chloe Mustaki are among those on the fringes targeting minutes.\nDifferent oppositions require different players and approaches, but Ireland must be more purposeful in possession and test Türkiye. Goals are needed over these games, which has often proved challenging, and patience is required to break down low blocks.\nThe Turks sat deep in a 4-4-2 last time, aggressively zonal marking early on but also carrying a threat, with German-born Melike Pekel and Galatasaray’s Ebru Topçu leading the charge for Necla Güngör Kırağası’s improving side.\nThey again will look to frustrate and counter, as day turns to night in Istanbul. (Temperatures should cool to 18 degrees for kick-off at 8pm local time.)\nBut Ireland will focus on themselves, rather than Türkiye — or indeed Slovenia.\nYes, they have a few bites at the cherry, but Carla Ward and co. will want to get the job done sooner rather than later.\nTurkish Delight would be the perfect start to the business end.\n- Uefa Women’s Nations League, League B, Group 2: Türkiye v Ireland, KO 6pm Irish time — live on RTÉ Two.",
  "word_count": 946,
  "scraped_at": "2026-02-14T02:02:47.539884",
  "_text_extracted": true
}