{
  "article_id": "68054e369c43",
  "url": "https://www.namibian.com.na/fuellkrug-outshines-mbappe-to-hand-dortmund-champions-league-advantage-over-psg/",
  "title": "Fuellkrug outshines Mbappe to hand Dortmund Champions League advantage over PSG",
  "date": "20240502T014500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Niclas Fuellkrug gave Borussia Dortmund a 1-0 win over Paris Saint-Germain in their Champions League semi-final first leg on Wednesday as the journeyman striker outshone superstar Kylian Mbappe on the night.\nSeeking a return to the final for the first time since 2013, the 1997 winners were dogged and determined, outmuscling their heavily favoured opponents in front of more than 80,000 fans.\nFuellkrug, playing in his first Champions League season at the age of 31, collected a lofted pass from centre-back Nico Schlotterbeck in the 36th minute and blasted a low shot into the left corner of the net.\nPSG, led by Kylian Mbappe, hit the post twice in quick succession early in the second-half but could not break through.\n“I think we today showed a classic team performance. Each helped the other to win the game. We needed a bit of luck a couple of times, but we can be very satisfied with our performance,” said long-serving centre-back Mats Hummels.\n“It was a very satisfying, very grown-up performance from us.”\nDortmund, who had already lost and drawn against PSG this season in the group stage, can continue to dream of a return to Wembley 11 years after their last Champions League final.\nDespite the setback, however, PSG will remain confident of overturning the deficit at home next week against a side they thoroughly outclassed at their home venue in September.\n“The Parc (PSG’s stadium) and our supporters are giving us hope for the second leg, and we know we can do much better,” PSG captain Marquinhos told Canal+.\nDortmund manager Edin Terzic said pre-match PSG were “built to win the Champions League” since the Qatari takeover a decade ago.\nNowhere was the contrast between the two clubs greater than PSG’s global superstar Mbappe, playing in his last season for his hometown club, and journeyman Dortmund striker Fuellkrug, who was playing second-division football this time two years ago.\nPSG hit post twice\nSpurred on by a passionate home crowd who booed and whistled every Mbappe touch, Dortmund had the best of the opening stages, Jadon Sancho shining down the right flank.\nMarcel Sabitzer had Dortmund’s best chance of an opener after 14 minutes, blasting straight at Gianluigi Donnarumma from a tight angle.\nThe opener came after 36 minutes thanks to some superb old-school forward play from Fuellkrug.\nCentre-back Schlotterbeck had the ball well in his own half and thought about a safe pass back to the ‘keeper but instead punted it forward, with only Fuellkrug aware of the idea.\nThe striker controlled the ball with one touch and drilled a low shot past a helpless Donnarumma.\nFresh from wrapping up the Ligue 1 title at the weekend, PSG had few chances despite their attacking riches in the opening half, registering zero shots on target.\nThe visitors however sprung to life after half-time, Mbappe rattling the inside of one post seconds before former Dortmund wing-back Achraf Hakimi rattled the inside of the other.\nPSG should have equalised after 56 minutes, Marquinhos curled a beautiful pass through a crowded Dortmund box but Fabian Ruiz’s diving header went wide.\nAnother former Dortmund player Ousmane Dembele blasted over right in front of goal with 10 minutes remaining.\nThe impressive Sancho laid on an excellent pass for Julian Brandt with moments left but Dortmund’s hopes of a second were snuffed out by some desperate PSG defending.\nThe victory, along with Tuesday’s 2-2 draw between Bayern Munich and Real Madrid in the other semi-final, guarantees Germany rather than England or France an extra Champions League place for next season.\nThat has already secured Dortmund’s place in the competition next season.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 708,
  "scraped_at": "2026-02-14T01:51:24.783676",
  "_text_extracted": true
}