{
  "article_id": "68154d439fd9",
  "url": "https://theathletic.com/4652018/2023/07/15/declan-rice-arsenal-arteta-deal/",
  "title": "Inside Declan Rice move to Arsenal : Arteta influence , long - term plan , no transfer request",
  "date": "20230715T123000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This time, it truly was all or nothing for Arsenal. No Plan B, no capacity for frugal switches to alternative targets and, therefore, no room for error.\nIt was Declan Rice or bust.\nThe West Ham United captain was everything to Mikel Arteta this summer. Those inside the club had repeated for months that it could not be overstated how central he was to the Arsenal manager’s vision.\nAdvertisement\nWithout him, Arteta’s plan to take his team to the next level in the fourth year of his reign simply did not add up. Every other transfer target was inextricably linked to Rice as the centrepiece, the nucleus that would make everything else make sense.\nThis was the message hammered home to Rice in Arsenal’s subtle courting of the West Ham captain.\nAlthough patience was required in the final weeks of negotiations after two rejected bids preceded Manchester City muscling in at the eleventh hour, Arsenal eventually got their man and the deal with West Ham was finally signed at 5pm UK time on Friday, with Rice agreeing a five-year contract with the option to extend for a further year.\nThe fee of £100million ($130.9m) plus £5m in potential add-ons is more than they had banked on spending — they had begun the pursuit feeling the final price would be in the £70m to £80m bracket but ended up breaking the Premier League record for a British player, set in the summer of 2021, when Manchester City signed Jack Grealish from Aston Villa. It was a deal they had ideally wanted to do six months earlier, but Arsenal will care little.\nGO DEEPER\nDeclan Rice, dissected\nThey believe they have bought a talent who is incomparable in his position.\nAnd if Rice is as transformative as Arsenal believe he can be, similar to how the marquee additions of Virgil van Dijk and Alisson elevated Jurgen Klopp’s growing Liverpool team in year four of his tenure, the prize money will make back the additional funds committed to this deal — and then some.\nArsenal had long identified Rice as the crucial missing piece of the jigsaw, but the pursuit began in earnest in January of this year.\nHaving consulted Arsenal’s England contingent of Bukayo Saka and Aaron Ramsdale for insight into his personality and leadership qualities, it only strengthened Arteta’s desire to make sure Rice would soon be playing his football in the borough of Islington, six miles west of West Ham’s London Stadium.\nAdvertisement\nHe wanted to make that happen in January, after they made him their top target for the winter window. Arsenal seriously investigated a possible deal that month but it became apparent it was never likely to happen, both financially and because West Ham’s lowly position in the Premier League made Rice even more indispensable.\nWest Ham chairman David Sullivan did not want to lose the club’s talisman during a relegation battle.\nLittle did he know Rice would go on to lead David Moyes’ side not just to safety but to the Europa Conference League title in May. While Rice always remained the primary target, Arsenal – sensing a January deal was not possible – also turned their attention to Brighton midfielder Moises Caicedo.\nAfter having a £60million bid for Caicedo swiftly rejected and informed that he wasn’t for sale, Arsenal did not take no for an answer. They returned on the penultimate day of the winter window with a £70m offer for the Ecuadorian, who had taken to social media to plead with Brighton to sanction the transfer.\nBrighton stood firm and offered Caicedo a bumper new contract under the mutual understanding that a summer move somewhere, potentially to Arsenal, was all but inevitable.\nSo Arsenal pivoted again, this time to a different type of deep midfielder. While Rice and Caicedo are known for their power and all-rounder attributes, Chelsea’s Italy international Jorginho is a cerebral player who makes up for his lack of mobility in how he dictates the play.\nSigning a player who turned 31 in December was a short-term option, as Arteta believed he required something extra in midfield if Arsenal were to have the depth to last the pace in the title race.\nIn the weeks that followed the January window, Arsenal resumed the pursuit of their primary target — Rice.\nAnd The Athletic can reveal it was a recent face-to-face meeting between Arteta, Arsenal’s sporting director Edu Gaspar and Rice that convinced the England midfielder just how intent they were on securing his signature.\nAdvertisement\nAs is now customary in almost all deals, Arteta and Edu made a granularly detailed presentation to Rice explaining the project, the role he had to play in it and the footage of him which had convinced them he was the man they needed.\nThey ended their overture by putting the ball in Rice’s court: the train was leaving — was he getting on board?\nRice’s representatives had meetings with several big clubs but none were in the same arena as Arsenal when it came to the detail and personalisation of their pitch. The 24-year-old was ranked so highly on so many different aspects of Arsenal’s recruitment grading system that Arteta almost had a book full of reports on him. It’s why he was so passionate about this signing, and that came across to Rice when he was explaining what his No 6 role would entail.\nArsenal were confident coming into the summer window that they had established a good working rapport with their West Ham counterparts.\nLast summer, West Ham had sent legal letters to warn other teams against approaches and threatened action if they had proof of tapping up, but this summer there was an acceptance it was time for Rice to move on to play at the top level of club football.\nPersonal terms were widely understood not to be a problem, largely thanks to the huge amount of groundwork Edu and director of football operations Richard Garlick did with the player and his family. Rice’s affairs are looked after by his father and brother, with the support of a commercial advisor, but this was always going to be a huge deal to navigate.\nThere was no desire at Arsenal to waste anybody’s time and Arteta was also firm in his desire to strengthen the squad before they headed to the United States on their pre-season tour tomorrow (July 16).\nGO DEEPER\nHow can Arsenal afford possible Rice, Havertz and Timber transfers under FFP?\nArsenal duly waited until West Ham had enjoyed their celebrations after returning home as 2022-23 Europa Conference League champions, and until Rice had left the England camp following the European Championship qualifying double-header last month against Malta and North Macedonia.\nAdvertisement\nBut then the situation was felt to be in a healthy enough position to make the first move which, as exclusively revealed by The Athletic, came on June 14, when Arsenal placed an opening offer worth £65million plus £15m of add-ons.\nThat was rejected but they remained in dialogue with their London neighbours and the discussions were aided by talks that had taken place between Arsenal executive Tim Lewis and West Ham counterpart Karren Brady at the Premier League AGM in Hampshire earlier that day.\nLewis was heavily involved in club-to-club discussions over fees and payment structures and acted as a go-between to Arsenal’s owners when seeking to push up the next bid. However, Edu and Garlick led the process at Arsenal’s end with the latter heavily involved in player negotiations.\nArsenal took time to weigh up what number they should propose next and six days later lodged a club-record offer of £75million plus £15m the following Tuesday (June 20).\nAs anticipated, this was also turned down, but there was an acceptance that Arsenal were getting closer to an overall figure that West Ham would find acceptable.\nIt felt like a one-horse race at this point, despite Rice’s talent having won admirers for several years.\nManchester United were credited with an interest in him last summer but they were preoccupied with signing Real Madrid’s Casemiro and Barcelona’s Frenkie de Jong, the latter of whom opted to stay in Spain, for their midfield.\nThis summer there was weight to reports that United could offer cash plus players for Rice, with Scott McTominay, Harry Maguire and Anthony Elanga among those who could have been interesting to Moyes as makeweights.\nLiverpool chose to steer clear of even meeting the Rices. They were never truly in the running and a source said that was also with Jude Bellingham in mind, as they were in the mix for his signature at the time and didn’t want his camp to be irked. Rice’s fellow England midfielder Bellingham went on to sign for Real Madrid.\nGO DEEPER\nInside the Lionel Messi to Inter Miami deal — seeing off Saudis, equity offers and Beckham and Co.'s secret trip\nMeanwhile, Bayern Munich’s former Chelsea coach Thomas Tuchel was a fan of Rice and was keen on bringing him to Germany but they were aware of how Arsenal had stolen a march on everyone.\nAdvertisement\nThe plan had worked in that sense. Arsenal had aimed to get a head start on any potential suitors and negate a public auction. But then on June 25, a Sunday, they lurched into the world of uncertainty they had tried to avoid.\nNewly-crowned treble winners Manchester City made sure there was to be no stress-free procession by submitting an offer of £80million plus £10m of add-ons, which represented a larger guaranteed sum for West Ham.\nPep Guardiola’s side, who had so brutally ended Arsenal’s title bid in April and May, had tried to gazump their London rivals. To compound matters, Arsenal were so far down the road with their Rice plan by this point there was no option to reverse course.\nA £65million deal for Chelsea’s Kai Havertz was all but complete, and the entire tactical remodelling of Arteta’s midfield had been predicated on the German playing alongside Rice.\nGO DEEPER\nHavertz to Arsenal: Reasons Arteta is banking on switch from Chelsea No 9 to 'left 8'\nHavertz has been earmarked to replace Granit Xhaka in the left No 8 role but he has played most of his football at Bayer Leverkusen and Chelsea as a No 10 or in a withdrawn striker role. It is a bold move but it was considered feasible because Arteta sees Rice as having the athleticism and ball-winning ability needed to complement Havertz and Martin Odegaard either side of him.\nThere was also the further complication that Caicedo was viewed to be irretrievable as a backup option by this point.\nArsenal burned some bridges with the Brighton hierarchy in January with their persistence and there was a feeling Chelsea had done so much groundwork ahead of this window that the South American was virtually wrapped up in blue ribbons.\nBut Arsenal did check in with Caicedo’s camp when progress appeared to be slow with West Ham over a fee for Rice.\nThat in itself tells you how nervous Arsenal became over those two days as they deemed the two players to be in a league of their own when it came to the type of midfielder they were looking for.\nGO DEEPER\nWhy Declan Rice is vital for Arteta's Arsenal\nAny other alternatives would have represented a significant drop from the elite level required for their return to Champions League football this September for the first time in seven seasons.\nAdvertisement\nSo when City officially entered the race for Rice, Arsenal were dismayed. In their eyes, the player had signalled the Emirates Stadium was his desired destination for some time. Would his head be turned by the lure of the domestic and European champions, replacing outgoing captain Ilkay Gundogan at the Etihad Stadium and playing under Guardiola?\nIt would certainly have given him food for thought, and Arsenal wanted Rice to reiterate his commitment to them.\nFor that to happen, though, Arsenal now knew they had to get close to West Ham’s valuation.\nArsenal’s decision-making process is more bureaucratic than at some other clubs, as names and figures have to go up the chain of command from the scouting system, Arteta, Edu, Garlick and then on to the majority owners, the Kroenke family in the United States, before any official move can be signed off.\nAfter that, it is then communicated back down through the hierarchy in what is designed to be a model with checks and balances but to the outside can be perceived as too leaden a process to react swiftly in the fast-paced environment of a transfer window.\nThey had certainly started to feel the heat when West Ham quickly turned down both offers, which were deemed to be significantly below their valuation and also too staggered in terms of the payment plan.\nDespite the creeping doubts, however, there was a confidence Arsenal were still the frontrunners.\nAnd so it proved as they came back in on June 27 with an offer that knocked City out of the running. A package of £105million was enough for the conversation to be moved to the final stage of talks on payment terms.\nIf City were looking for encouragement to match Arsenal and tempt Rice they didn’t receive it, so pulled out of the race.\nArsenal had been forced to go considerably higher to get the deal over the line. Is there a risk associated with buying a young player, with no Champions League experience, for more than £100million? Of course. But to elevate the squad to the next level, it is a calculated one — and also a coup that a player of Rice’s quality saw them as his natural next step.\nAdvertisement\nCity may well be the dominant team having won the treble but there were plenty of reasons why a transfer to Arsenal made sense to Rice.\nWhile City are seemingly already the finished article as a side, an Arsenal move was about the possibility of becoming successful and going on the journey to eventual silverware. Rice would be joining one of the youngest squads in the major leagues of Europe, a team on an upward trajectory and he would be handed a key role in leading the transition from challengers to champions.\nAs only the third West Ham captain to lift a trophy in the club’s 123-year history, having taken the armband in 2022 at the age of just 23, he is a character who craves responsibility.\nThere is a reason his West Ham team-mates kept singing the “10 more years, 10 more years Declan Rice…” chant after the win away to Bournemouth in April, a match in which he delivered another man of the match performance.\nHe had given them his word that he would never hand in a transfer request to force a move, as he wanted his exit to be handled in a classy way. Even though the staff were aware this was going to be his last season at West Ham, they didn’t detect a change in his commitment levels.\nGO DEEPER\n'Handing in a transfer request? That’s just embarrassing' - how players really force their way out\nInstead, after two players’ meetings following the loss away to London rivals Tottenham Hotspur in February which put West Ham in the relegation zone with 15 games to go, they saw Rice change his leadership style to try to galvanize the group.\nHe took it upon himself to lead from the front and he became a lot more vocal around the training ground. He would challenge players if they weren’t training hard enough as he tried to revive the team spirit that had led them to a seventh-place finish and the Europa League semi-finals the season before.\nRice did not want to be part of a relegation, even if West Ham going down to the Championship would have made his exit easier. He is someone who could have stayed at the club for the rest of his career, such is his affection for it — but his talent and ambition meant this was never going to happen and so he wanted to leave on a high.\nAdvertisement\nHe went on a superb run of form in the final three months of the season, with his trademark driving runs and switches of play giving West Ham a better grip on games. It eventually led them to glory that night in Prague against Italian side Fiorentina and to right-back colleague Vladimir Coufal claiming Rice’s intervention “saved our season”.\nThere were delays to his Arsenal unveiling due to further discussions over the payment structure of the deal, West Ham confirmed his departure this morning – although their statement failed to mention he was joining Arsenal – with Rice also publishing a farewell letter to the fans. Arsenal then confirmed the signing a few hours later.\nArsenal have prevented a summer-long saga by announcing the switch just before they fly to the U.S. for a three-game pre-season tour, and Rice will board the plane bound for Washington D.C. with his new team-mates tomorrow.\nThe question Arsenal put to Rice at the start of this transfer was whether he was on board. He is now and they hope that with the 24-year-old at the wheel in their midfield, the destination is the club’s first Premier League title since 2004.\nAdditional reporting: James McNicholas, Laurie Whitwell, Andy Naylor, David Ornstein\n(Top photo: Getty Images; graphic: Sam Richardson)",
  "word_count": 2910,
  "scraped_at": "2026-02-14T02:07:08.866145",
  "_text_extracted": true
}