{
  "article_id": "681a056bae3f",
  "url": "https://metro.co.uk/2024/06/13/man-utd-agree-personal-terms-70m-everton-star-jarrad-branthwaite-21031555/",
  "title": "Man Utd agree personal terms with £70m Everton star Jarrad Branthwaite",
  "date": "20240613T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have agreed personal terms with Everton centre-back Jarrad Branthwaite ahead of a possible summer move, according to reports.\nThe Red Devils must now agree a price with Everton and the Toffees want £70m to part ways with the 21-year-old England international, The Times have reported.\nIt would be a major signing for United after Sir Jim Ratcliffe made Branthwaite his No.1 choice for a new central defender in the summer transfer window.\nBranthwaite has massively impressed at Everton since breaking into the first-team XI with the Englishman having made 54 appearances to date.\nJason Wilcox, United’s new technical director, may have played a role in getting personal terms agreed due to his close relationship with Branthwaite’s agent David Reeves.\nEverton star Ashley Young feels Branthwaite has everything in his locker and can make the ‘step up’ should United get the deal done.\nAsked if a move to United would represent too big a step for Branthwaite at this stage of his career, ex-United winger Young told talkSPORT: ‘I wouldn’t say so, no. Not at all.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I think he’s ready for the step up. Obviously there’s interest from other clubs that are finishing in the top half of the table.\n‘Rightly so because I know what kind of player he is, where he can get to. I can see him, if it’s not with us at Everton, taking us further, then with a team that’s maybe offering him Champions League football.\n‘He’s definitely a player that can go and play in the Champions League and play in the big tournaments.’\nNot everyone is happy with United’s plan to get a deal done for Branthwaite with former Red Devil Jonathan Spector feeling the club should be aiming higher.\n‘I haven’t seen a lot of Jarrad, but in the games I’ve seen him play, he’s done well,’ Spector said, speaking exclusively to Metro.co.uk via BetUS, the home of American odds.\nMore Trending\n‘There is perhaps a level of comfort with a player that you see week-in week-out in the Premier League and knowing what he’s about, however I would say maybe United can aim a little higher in terms of the players that they are looking to bring in.’\nMeanwhile, Jamie Carragher believes Gareth Southgate has made a mistake by not picking Branthwaite for England’s Euro 2024 squad.\nBranthwaite featured in the provisional 33-man squad but did not make the final cut when it reduced down to 26.\n‘Lots of bigger names than Jarrad Branthwaite have missed out on the England squad, but he should’ve been picked to go to Euro 2024,’ Carragher said. ‘He’s England’s present [and] future.’\nMORE: Three reasons why Man Utd want to sign Bologna striker Joshua Zirkzee\nMORE: Erik ten Hag eyes another former Ajax star to solve huge Man Utd issue\nMORE: Chelsea make contact to sign Michael Olise but face release clause problem",
  "word_count": 533,
  "scraped_at": "2026-02-14T01:57:18.899694",
  "_text_extracted": true
}