{
  "article_id": "6822a37f52e2",
  "url": "https://liverpooloffside.sbnation.com/2025/3/5/24378782/digging-deeper-liverpool-1-0-smash-grab-psg-paris-saint-germain-ucl-2024-25-darwin-elliott-alisson",
  "title": "Digging Deeper into Liverpool 1 - 0 Smash and Grab Win over PSG",
  "date": "20250306T000000Z",
  "domain": "liverpooloffside.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Meek. That is the best way to describe Liverpool’s performance for 87 minutes in Paris tonight. It is difficult to avoid the descriptor in a match where the Reds were outshot 27-2, outpossessed 70.5% to 29.5%, generated a 74.6% pass success rate, and were tackled at an 83% clip.\nDigging Deeper into Liverpool’s 1-0 Smash and Grab Win over PSG\nAfter the Reds take a hilarious one-goal lead back to the Anfield second leg, we take a look at some of the winners and losers on the night.\nThe visitors seemed to come into the game with a notion to sit back and try to hit PSG in transition, but to do that, one must tackle dribblers and win the ball, find accurate passes into available team mates and win duels and second balls, and the Reds were utterly incapable of any of that for the majority of the match.\nA hatful of big chances, a narrowly disallowed goal, and a monster night from an Alisson Becker who has had an otherwise unspectacular season were all part of a first half that had Liverpool players and fans alike sweating bullets, but while the Reds failed to ever get much of a foothold in possession, things settled down somewhat as the second half wore on, and the hosts were relegated largely to speculative efforts from range.\nThere was little indication an away win was on the cards, though, until a pair of substitutes made a single telling contribution against the run of play, handing the Reds an advantage as they head into an Anfield return leg that will nevertheless demand a much better performance if quarter final participation is to be secured.\nBelow then, a quick discussion of some winners and losers on the night.\nWinners\nThe Replacements: A topic of much discussion this season among fans who look past the points total, has been the distribution of minutes among the players not in Arne Slot’s favoured starting XI. Darwin Núñez has started only seven Premier League games this season, while Harvey Elliott, who featured 34 times in the league last year, has only played 83 minutes of PL football so far this campaign.\nSlot can thank those two for the 1-0 aggregate lead, as Darwin came on and gave Marquinhos a challenge he had not seen the rest of the night, beating the Brazilian in the air before bringing the ball down and displaying uncommon composure, as he deftly set up Elliott for the winner into the far post.\nWataru Endo, who has yet to start a Premier League match this season but has proven himself a capable closer was also stellar after coming on, blocking the second most passes of any Liverpool player on the pitch, despite only featuring for 11 minutes plus injury time.\nWhether this will impact Slot’s team selection in the immediate future is unclear, but it does feel like using the breadth of the squad could be a good idea when competing on so many fronts at once.\nCan a Goalkeeper Win the Ballon d’Or: Ali. Goodness gracious, man. Probably the best performance Alisson Becker has put on tape for the Reds, partly down to the fact that he’s never faced that many shots as a Liverpool player in the nearly seven years he’s spent at the club. Nine saves in total is a record for the Brazilian, while his four clearances matches his highest ever tally for the Merseysiders.\nThey haven’t had to rely on him much this season, but when they did, Alisson stepped up to the plate, and while it is always nice to have confirmation that your goalkeeper is the best on the planet, we would all prefer if he could have a more anonymous part to play in the return leg.\nLosers\nGame Plan vs Execution: It is always difficult to know which of the two is the major factor in whatever performance a team ends up putting on, but questions need to be asked about both after tonight, despite the end result being such a huge one.\nThe refusal — or inability — to hold onto the ball for any length of time was remarkable, and felt like a tactical decision, as the Reds consistently attempted to go over the top and simply handing possession back to their hosts instead of working a bit of possession and making their opponents chase them, while midfielders failing to compete physically with the lead-footed Adrian Ruiz or the diminutive João Neves and Vitinha — either by being too far away to get to the challenge on time or being too weak to win it when contact was made — served as something of an indictment of the current mental focus and/or physical condition of the players.\nIt is, again, difficult to tell exactly what is the cause of this recent trend of getting outmatched physically — although the aforementioned lack of squad rotation feels like a relevant topic once more — but one must hope that it’s something that can be worked out before the end of the season, and not something that will require a whole summer to fix, if the Reds are to make good on their Champions League aspirations.\nWhat Happens Next\nThe Reds host bottom dwellers Southampton on Saturday, as they have a chance to further extend their lead at the top of the Premier League table, before the return leg against PSG takes place at Anfield next Tuesday.",
  "word_count": 911,
  "scraped_at": "2026-02-14T02:02:35.611238",
  "_text_extracted": true
}