{
  "article_id": "6830e77dbd99",
  "url": "https://theathletic.com/4719407/2023/07/26/liverpool-jordan-henderson-transfer-captain/",
  "title": "Liverpool can replace Jordan Henderson the player . It everything else theyll miss",
  "date": "20230726T181500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Twelve years, 492 appearances and a place secured in Anfield’s pantheon of greats.\nJordan Henderson’s name sits alongside Emlyn Hughes, Phil Thompson, Graeme Souness and Steven Gerrard as one of Liverpool’s iconic European Cup-winning captains.\nThe Sunderland-born midfielder will forever be remembered as the man with the trademark shuffle who lifted the Premier League, marking the end of that 30-year title drought.\nAdvertisement\nOnly 14 players in the 131-year history of Liverpool Football Club have represented it more often. Just four (Donald McKinlay, Hughes, Ron Yeats and Gerrard) have worn the armband on more occasions than Henderson’s tally of 268.\nSuch glory and service. It shouldn’t have ended like this.\nThe timing of his exit and his destination of choice leave a sour taste. After having his head turned by the riches on offer from Al Ettifaq in Saudi Arabia, he’s relinquished the emotional Anfield goodbye he would have been guaranteed.\nView this post on Instagram\nAccusations of hypocrisy and betrayal will be difficult to shake off given his vow to “stand shoulder to shoulder” with the LGBTQI+ community. It’s ironic that someone who made a habit of silencing critics throughout his Liverpool career departs having left a stick for people to beat him with.\nGO DEEPER\nJordan Henderson had the trust of my community. Then he broke it\nTo assess what Liverpool are losing, you need to separate Henderson the player from Henderson the captain and you need to focus on the present rather than the past.\nThe reality is that at the age of 33, Henderson wouldn’t have commanded a starting spot in Jurgen Klopp’s strongest line-up following the signings of Alexis Mac Allister and Dominik Szoboszlai.\nHis role had evolved, with Klopp managing his game time. Having started 76 per cent of Premier League matches in 2021-22, that figure dropped to 61 per cent in 2022-23 as he was increasingly used off the bench.\nHenderson was part of a misfiring midfield department which was repeatedly found wanting during last season’s struggles. Yes, the England international still had the ability to stamp his authority — he played his part during the run-in when Liverpool went 11 games unbeaten — but his influence was waning.\nIf he had stayed put, his transition from leading light to experienced backup option would have continued. That, as well as the eye-watering financial package and the opportunity to be reunited with Gerrard at Al Ettifaq, influenced his decision to move on.\nFor much of his Liverpool career, Henderson didn’t get the wider credit he deserved for his qualities as an elite midfielder. He set the tone with his energy, physicality and passing range.\nAdvertisement\nIt proved to be some transformation after a difficult first season at Anfield under Sir Kenny Dalglish following his arrival from Sunderland in 2011 for an initial fee of £16million ($20.6m).\nBrendan Rodgers went from trying to sell him to Fulham to giving him the captaincy when Gerrard departed in 2015. In between, Henderson starred in the thrilling title challenge of 2013-14. His late red card against Manchester City and subsequent ban cost Liverpool dear.\nIn the early days of Klopp’s reign, Henderson was dogged by a debilitating heel condition and forced to watch from afar. Being written off made him more determined to prove the doubters wrong.\nKlopp once described the challenge of following in Gerrard’s footsteps as “the hardest job in world football”, but Henderson emerged from his former team-mate’s shadow.\nHe was immense in the historic Champions League semi-final fightback against Barcelona in May 2019, collapsing to the turf at the final whistle having run himself into the ground. He had required a pain-killing injection in his knee at half-time to get through it.\nLifting Liverpool’s sixth European Cup in Madrid meant so much to him that he got the trophy tattooed on his thigh. How the tears flowed when he hugged his proud dad, Brian, on the touchline following that final victory over Tottenham.\nHis rise culminated in him being crowned Football Writers’ Footballer of the Year in 2020 following Liverpool’s Premier League title triumph. “One of the big questions in football is what makes a proper player? And what is more important — is it talent or is it attitude?” Klopp said in a video message to him.\n“The easy answer is without talent you are nothing and without attitude you will stay a talent forever. So you are the perfect example that a mix makes the difference. Who would have thought that a young fella from Sunderland to Liverpool with a big dream would be one day the best player of the Premier League? Everybody saw what a great player you are.”\nThe manager had wanted to retain that wealth of experience. It was Klopp who had convinced the owners to give Henderson a new four-year contract in the summer of 2021 when then sporting director Michael Edwards wasn’t sure it made financial sense. Talks had stalled before Klopp stepped in. If Henderson hadn’t signed that deal, he would have been a free agent this summer.\nInstead, Liverpool will bank a fee of £12million, but it’s an upheaval they could do without.\nAdvertisement\nIf Fabinho follows Henderson out of the exit door, Liverpool will have lost five senior midfielders in the same summer following the departures of James Milner, Naby Keita and Alex Oxlade-Chamberlain as free agents. That quintet made 1,318 appearances between them.\nSuddenly, the evolution of Klopp’s midfield has turned into a revolution. Changes had to be made but no one expected this scale.\nReplacing Henderson the player, given he was in the twilight of his career, will be easier than filling the leadership void.\nKlopp’s sense of admiration and loyalty to Henderson was well earned — from setting the standard each day on the training field to helping create and maintain a close-knit spirit and unity in the dressing room. He commanded respect.\nHumble and selfless, he was the model professional whose mentality rubbed off on those around him. He always went above and beyond to ensure new faces felt welcome. He kept feet on the ground when things were going well and lifted chins off the floor when they weren’t.\nHis double act with Milner worked a treat. Milner described it as “good cop, bad cop”, with their roles reversed on and off the pitch.\nOn the field, it was Henderson barking orders and giving team-mates an earful when required. Off it, Milner issued fines and dished out reprimands when he sensed standards were slipping, while Henderson put an arm around a shoulder and sought to find compromise.\nKlopp had wanted to keep Milner for another year but no contract offer was forthcoming as the club decided to channel their resources elsewhere. The 37-year-old joined Brighton & Hove Albion instead.\nGO DEEPER\nFarewell James Milner, Liverpool's Mr Everything\nNow Liverpool find themselves in a position where they have lost their captain and vice-captain in quick succession. Virgil van Dijk is the clear front-runner to be given the armband given his seniority in the squad and the fact he does the job for the Netherlands.\nAdvertisement\nIt’s a role Trent Alexander-Arnold has long since coveted and he’s become an increasingly vocal presence in the dressing room. Andy Robertson, who wears the armband for Scotland, and Alisson are the other remaining members of the depleted leadership group. Mohamed Salah and Szoboszlai captain Egypt and Hungary.\nThere’s a vacuum and it’s now down to others to step up and take on greater responsibility.\nHenderson’s eight-year spell as captain saw him lift every major honour Liverpool competed for bar the Europa League. Yes, he was blessed to have top talent around him, but he was the spearhead who drove Klopp’s men on.\nHis giant mural on Sybil Road close to Anfield bears the words: “Anything is possible”. Certainly, no one envisaged such a stellar Liverpool career ending like this with a move to Saudi Arabia and talk of a tarnished legacy.\n(Top photo: Glyn Kirk/AFP via Getty Images)",
  "word_count": 1335,
  "scraped_at": "2026-02-14T02:07:08.856352",
  "_text_extracted": true
}