{
  "article_id": "684b361755de",
  "url": "https://www.teamtalk.com/manchester-united/criminal-man-utd-torn-apart-ferdinand-biggest-problem-dreadful-records-set",
  "title": "  Criminal  Man Utd torn apart as Ferdinand picks out biggest problem , with dreadful new records set",
  "date": "20231213T024500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\n‘Criminal’ Man Utd torn apart as Ferdinand picks out biggest problem, with dreadful new records set\nRio Ferdinand and Paul Scholes have criticised the underwhelming performance from Manchester United as they finished bottom of their Champions League group following a 1-0 home defeat to Bayern Munich.\nMan Utd needed to beat Bayern and hope Galatasaray picked up a result against Copenhagen in order to reach the knockout rounds of the competition. However, they put in a flat performance at Old Trafford and create few clear-cut chances.\nOne of their best opportunities fell to captain Bruno Fernandes, who sent his shot way over the bar from the edge of the box when he really should have tested goalkeeper Manuel Neuer.\nAnd Man Utd were left to rue that miss when Bayern took the lead in the 71st minute through Kingsley Coman. The winger started the move off and was helped by a brilliant Harry Kane pass, which gave him a fairly simple one-v-one against Andre Onana to dispatch.\nMan Utd offered little in the way of a response, despite manager Erik ten Hag throwing on youngsters Facundo Pellistri, Hannibal Mejbri and Kobbie Mainoo to provide more energy.\nAnd the match ended 1-0, with Man Utd finishing bottom of Group A with just four points. Copenhagen beat Galatasaray 1-0 to surprisingly finish in second behind Bayern and qualify for the next round of the competition, while Galatasaray will drop down to the Europa League.\nREAD MORE: Man Utd encouraged to go after thriving Prem striker who ‘will get big move’ after Salah mentoring\nMore misery was piled on Ten Hag by injuries to important defenders Harry Maguire and Luke Shaw, who were replaced by Jonny Evans and Aaron Wan-Bissaka respectively.\nMan Utd have also set two new unwanted records following the loss to Bayern. They are the first English side to concede 15 goals in a Champions League group stage. They have also lost four of their six matches in a Champions League group campaign, which is a first for the club.\nRio Ferdinand bemoans Man Utd results and performances\nDuring an appearance on TNT Sports, formerly known as BT Sport, ex-Man Utd defender Ferdinand called their European record ‘criminal’ and named the leaky defence as their biggest issue.\n“Very disappointing, to say the least,” he said (12/12, at 22:04). “When that group came out, you would have expected Man Utd to go through. To score three goals in each of their away games and come away with the points that they did is criminal really.\n“When you score that many goals in the group stage – scored 12 and conceded 15 – there lies your problem. It’s kamikaze football, basketball football. You attack, we attack, and see who comes out on top.\n“You get what you deserve. If you’re not clinical, you can’t close matches out, you don’t deserve to progress to the knockout stages.”\nFellow Man Utd hero Scholes was also on TNT Sports’ coverage of the match, and he added: “I agree with that, it’s been a really poor campaign. It started with the Galatasaray game at home, as soon as you lose a home game in the group stages you’re struggling, you’re really up against it.\n“But after that, in some games they looked very good. They were getting leads in games, two-goal leads, but just couldn’t manage to see games out.\n“Tonight was probably the most disciplined performance of all of them. I don’t know how intense Bayern were, it’s difficult to say. But you never really felt tonight that Man Utd were going to score goals.”\nTen Hag will be desperate for Man Utd to arrest their poor form in their next outing. However, this will not be easy as they face high-flying rivals Liverpool at Anfield on Sunday.",
  "word_count": 639,
  "scraped_at": "2026-02-14T02:10:33.607478",
  "_text_extracted": true
}