{
  "article_id": "68777dc5a6bc",
  "url": "https://news.yahoo.com/return-luis-diaz-highlights-every-175457423.html",
  "title": "Return of Luis Diaz highlights every area Liverpool Champions League bid is falling short",
  "date": "20230430T184500Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Return of Luis Diaz highlights every area Liverpool’s Champions League bid is falling short\nFor the first time in 203 days, Luis Diaz was in the Liverpool starting lineup. For the first time in 203 days, Luis Diaz produced a goalscoring impact.\nBack in early October, the Colombian assisted a goal before going off injured against Arsenal, a knee problem requiring two separate spells on the sidelines either side of a brief, non-playing return to training just as the World Cup wrapped up.\nFast forward to Sunday, it was the other half of north London who suffered at his hands, or rather his right boot - he smacked in the second of the day against Tottenham, quickly putting the Reds two goals up on their way to an eventual, mad-cap 4-3 victory.\nDespite the length of time he has been out, Diaz’s fifth goal of the season in all competitions means only four Liverpool players have scored more than him this term; his quality has been a clear miss as the Anfield club’s season floundered, but most certainly not just because of his ability in front of goal.\nIndeed, it took only ten minutes or so for Diaz to highlight a number of ways Liverpool have been lacking for so much of the campaign, and why he has such a role to play not just in providing those traits, but in reminding others at the club that they are needed.\nFor starters, there’s the physical aspect.\nEven before his fifth-minute goal, Diaz was on show dribbling through a succession of Spurs defenders, part technical brilliance but also part relentless, bustling tenacity too. One dribble saw him clearly fouled yet not win a free-kick; infuriated, he drove back at Spurs and won back the ball with a sprint, a fierce tackle, a quick layoff.\nThey seem extremely simple traits. They seem exceptionally standard things for hard-working attackers to do. They seem normal characteristics for players in trophy-challenging teams to have - and yet for so long this year, Liverpool have been without all of them, not just in the forward line but right throughout the team.\nFrom a high-pressing outfit, to one incapable of any energetic defensive work high upfield. From an industrious midfield who could overpower anyone, to a centre of the park which everybody strode through at will. And from mentality monsters to a team which lost with a whimper to the likes of Nottingham Forest, Bournemouth and Leeds United without any real conviction to go at these supposed-lesser outfits.\nThe absence of these characteristics, rather than the absence of any one individual, is what has likely cost Liverpool their place in the Champions League for next season.\nIt would be far too much of a cop-out for anyone at Anfield to pin the blame for the campaign as a whole on Diaz’s long-term injury, even paired with that of Diogo Jota, the eventual matchwinner against Spurs.\nThat said, Diaz absolutely serves as a reminder of what must be rediscovered by Jurgen Klopp and Liverpool’s eventual recruitment team - whenever it is that they put in place a new director of football. Importantly, there have been signs that some of those lost attributes can be shuffled back into the side through players already in place, rather than all having to come in the transfer market.\nCurtis Jones’ resurgence and tactical fit is an impressive one, and he dovetailed nicely with Diaz down the left. Trent Alexander-Arnold, for all the criticism of his defensive performances, has actually added a significant amount of bite in central midfield areas, though it has also given Klopp another conundrum to solve in terms of who successfully fills in at right-back against transitions and direct balls.\nBut more speed, more power to press, more guile in the final third and more ability to dominate games consistently are still all required if Liverpool want to get back into the top four, and into title races.\nIt’s notable that the second-half collapse against Spurs largely came after the hour mark, after Diaz’s race was run, when perhaps a few too many who have had well below-par seasons were again grouped together on the pitch.\nBetween now and the end of the campaign he’ll doubtless serve up a few more reminders of what Liverpool have missed for too much of this season. It now looks as though fifth is the glass ceiling they will be unable to smash through, having taken that spot at the expense of Spurs here.\nThe importance of it, though, comes not just in seeing Diaz play as though every match and every moment is on the line, but in everybody else at the club being reminded that was a team-wide trait when they were consistently at the top.",
  "word_count": 795,
  "scraped_at": "2026-02-14T01:55:54.920720",
  "_text_extracted": true
}