{
  "article_id": "68929dabff22",
  "url": "https://theathletic.com/5158561/2023/12/26/daniel-agger-liverpool-klopp/",
  "title": "Daniel Agger :  Im a little bit jealous – I would have loved to play for Klopp  ",
  "date": "20231226T070000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The walk along Anfield Road is punctuated by a succession of photo requests.\nDaniel Agger is back on Merseyside with the youngest of his three sons, five-year-old Billy. The welcome for the former Liverpool defender couldn’t be warmer.\n“When you meet people in the streets, they’re so happy,” he says. “I never had any bulls*** during all my time here. It’s the best feeling when kids come running up to you. The respect from the people means a lot and that respect goes both ways.”\nAdvertisement\nAgger’s bond with the club he represented 232 times between 2006 and 2014 remains strong. He has YNWA — the initials from Liverpool’s iconic anthem — tattooed on the knuckles of his right hand.\nGiven his qualities as an elegant centre-back and the talent he was surrounded by, it’s a travesty that he only had a League Cup winners’ medal to show for his Anfield career. However, the 39-year-old has taken immense satisfaction from afar watching Jurgen Klopp lift Liverpool to much greater heights.\n“It’s been amazing to follow,” he says.\n“I’m a little bit jealous because I wanted to be part of something like that at Liverpool. Klopp is the type of manager I would have loved to play for. What you see is what you get. No bulls***. I always preferred it that way.\n“I always worked better when I got criticised rather than had positive feedback. If I got criticised, my attitude was ‘I’m going to ****ing show you that you’re wrong.’ If something is positive what am I supposed to do with that?\n“This club is back where it should be — competing for the title.”\nAgger has time on his hands after leaving his first managerial role at HB Koge in the second tier of Danish football in June.\nWe last met two years ago. He was a few months into the job and talking bullishly about HB Koge’s three-year plan to win promotion to the Danish Superliga.\nIt didn’t work out. With money tight, he led them to seventh place in 2021-22 and they finished eighth out of 12 teams last season. With his contract expiring, he decided to walk away.\n“The ambition of the club had been taken right down,” he explains. “From trying to win promotion to avoiding relegation. Two years there was enough for me. It was tough because the budget kept being cut by the owner.\n“But it was a good experience. The learning for me was unbelievable in terms of what did and what didn’t work. I learned more about football in two years there than in my whole playing career.\nAdvertisement\n“As a manager, you have to get into players’ minds. The Danish First Division is miles off the level I played at. I had to take the ideas I had and start all over.\n“It’s the football I like — being out on the pitch, helping improve players — but you have to deal with so many other things as a manager, like the politics.\n“When I played, I could get away from the game much quicker. You’d think about it on the night or the day after and then just forget it. You can’t do that as a manager.”\nAgger, who is based in Copenhagen with wife Sofie and sons Jamie, Mason and Bobby, is kept busy by his various business ventures.\nThere’s the sewerage and drainage company KloAgger, which he set up with his brother Marco a decade ago, and the world’s biggest online tattoo booking platform, Tattoodo, which has millions of users each month. He also has a building firm in Spain and helps transform the lives of children in need through the charitable work of the Agger Foundation.\nYet he’s keen to get back into management and is waiting for an enticing opportunity to come along.\n“It’s about finding the right fit,” he says. “It’s difficult in my position with young kids as we’ve moved around a lot and now we’ve finally found some stability. I don’t want to damage that.\n“I hope to manage in Denmark again. I feel like I can go up a level there and still get something out of it. I’ve got a lot of experience to pass on.\n“Steven Gerrard told me a few years ago it was even better winning as a manager than as a player. I didn’t believe him at the time but it’s up there. Lots of footballers say it’s the dressing room they miss the most but, for me, it was the three points. Having that winning feeling was my drug. Doing well in business doesn’t provide the same buzz.”\nAgger had intended to walk away from football for good when he retired at the age of just 31 in 2016 after a second spell with boyhood club Brondby.\nAdvertisement\nInjuries had taken their toll — a prolapsed disc in his back caused countless other issues — with his over-reliance on anti-inflammatory drugs to ease the pain leading to blackouts.\nHe relocated with his family to the plush villa his wife Sofie had designed in the foothills of the Ronda Mountains near Marbella, Spain. Life was idyllic but over time he realised there was a void that had to be filled.\n“I needed to get away from the whole circus that surrounds football. I’d had enough and needed to recharge,” he says.\n“I didn’t expect to get back into it. I was really disappointed with the end of my career. I felt I could have achieved more. For many years after I retired, I almost punished myself for stopping so early.\n“Then I felt that something was missing. I felt that I had something to give. That was the biggest reason for getting back in.”\nAgger made his senior breakthrough at Brondby as a teenager under Denmark legend Michael Laudrup and helped them win a league and cup double before joining Liverpool at the age of 21. Everton had also shown interest, with their manager David Moyes flying to Copenhagen to watch him play.\n“Brondby told me that David Moyes was in the stadium and wanted to speak to me after,” he recalls.\n“I thought I played a decent game but he disappeared! A club director told me that he had said he didn’t think I was prepared for the Premier League. Six months later, I was at Liverpool.\n“Lars Jacobsen, a good friend of mine, who played for Everton, told me that Moyes later admitted in the canteen when one of our games was on TV: ‘I missed one there’.”\nIn his first full season under Rafael Benitez, Agger was influential in Liverpool’s march to the 2007 Champions League final as he shone alongside Jamie Carragher. He ranks the defeat to AC Milan in Athens as the “worst night” of his career: “It would have been easier to take if they were better than us and won 4-0, but that wasn’t the case. We should have won that final.”\nAgger earned 75 caps for Denmark, led his country as captain and was twice named Danish Footballer of the Year.\nAdvertisement\nHe lifted the League Cup during Sir Kenny Dalglish’s Anfield reign and showed remarkable loyalty to Liverpool when Barcelona and Manchester City tried to sign him.\nIf he had known he was going to fall out of favour with Brendan Rodgers in the 2013-14 season, he would have accepted the opportunity to move to the Nou Camp the previous summer.\nInstead, in August 2014, he returned to Brondby. From the outside, it looked like a strange decision given he was just 29 and there was interest from bigger clubs across Europe.\n“I only did it because I was p**** (off),” he says. “I’d gone from being made vice-captain to being fourth or fifth choice centre-back at times.\n“I can see now I should have been calmer. I wish I had stayed here for another six months and maybe things would have changed. But at the time, I felt like I had reached my edge and took my career into my own hands.\n“I always wanted to finish at Brondby because the fans are unbelievable, but the timing was all wrong. The year before, they had nearly been relegated and almost went bankrupt. I went there at a bad time.\n“After I finished my two-year contract there, I didn’t feel like I could stay but I didn’t feel like I could go back out again either so I retired.”\nIn the years that followed, Agger couldn’t escape the nagging sense of what might have been. Damaging his back during a pre-season friendly in Singapore in 2009 had serious consequences as it was linked to so many of the other fitness problems that followed.\n“I played with jabs all the time. When you’re out on the pitch, everyone looks at you and presumes you are injury-free, but they don’t know what’s going on in your head or your body. Players are never 100 per cent but when you’re only 60 to 70 per cent it affects your mobility. It was hard to balance always wanting to help the team with ensuring I wasn’t too low a percentage to play.”\nAdvertisement\nOver time, his mindset has shifted. Now he’s better able to appreciate what he did achieve rather than dwell on the negatives.\n“Part of me still says I should have done more, but I’m getting better at not being so hard on myself,” he adds.\n“Only now I start to feel, ‘Maybe it was OK’. I do have a lot of good memories. I captained my country, I captained Liverpool. I won the league with Brondby and I played in front of the Kop. That’s a lot.”\n(Photo: Nick Taylor/Liverpool FC/Liverpool FC via Getty Images)",
  "word_count": 1628,
  "scraped_at": "2026-02-14T02:13:24.770844",
  "_text_extracted": true
}