{
  "article_id": "689a758b6b08",
  "url": "https://www.bbc.co.uk/sport/football/65839378",
  "title": "The 1999 Treble : Five games that helped Man Utd win Premier League , FA Cup & Champions League",
  "date": "20230609T123000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 1999 Treble: Five games that helped Man Utd win Premier League, FA Cup & Champions League\n- Published\nHaving already clinched the Premier League and FA Cup, Manchester City are one game away from winning the Champions League and securing the Treble.\nOnly one English team has ever completed the feat before - cross-city rivals Manchester United in the 1998-99 season., external\nWith City boss Pep Guardiola hoping to emulate United manager Sir Alex Ferguson 24 years on, BBC Sport looks at five matches that helped United earn English football's first Treble triumph.\nArsenal 1-2 Man Utd (FA Cup semi-final replay)\nWednesday, 14 April 1999\nManchester United winger Ryan Giggs produced a moment of magic in extra time to put the Red Devils into the FA Cup final, external at the expense of title rivals Arsenal.\nAfter drawing their first semi-final 0-0, both sides were back at Villa Park for a midweek replay full of tension.\nUnited took the lead through David Beckham before Dennis Bergkamp levelled in the second half.\nAny hopes of a Treble quickly began to unravel for United with skipper Roy Keane sent off in the 74th minute and Phil Neville conceding a penalty right at the end of normal time.\nBut Arsenal's own Double hopes were soon extinguished as Bergkamp's penalty was saved by Peter Schmeichel, before Giggs' 109th-minute winner following an incredible mazy run.\nThe Gunners were silenced. The Treble was on.\nJuventus 2-3 Man Utd (Agg: 3-4, Champions League semi-final second leg)\nWednesday, 21 April 1999\nA week later United set up their second final in equally thrilling fashion.\nFerguson's side were held 1-1 by Juventus in the first leg of their Champions League semi-final at Old Trafford, and quickly found themselves 2-0 down in Turin after two Filippo Inzaghi goals in the first 11 minutes.\nUp stepped captain Keane, who produced one of the greatest individual performances in United's history.\nThe Irishman headed home a David Beckham corner in the 24th minute to inspire a comeback.\nDwight Yorke levelled the tie 10 minutes later and, with United already heading through on away goals, Andy Cole scored a third in the closing stages, external.\nThe only blot on United's record were yellow cards for Keane and Paul Scholes, meaning both would miss the final in Barcelona a month later. The march continued.\nMan Utd 2-1 Tottenham (Premier League final day)\nSunday, 16 May 1999\nManchester United secured their fifth Premier League title in seven years with victory over Tottenham at Old Trafford, external on a nerve-shredding final day of the season.\nUnited were a point above second-placed Arsenal, knowing a win at home to mid-table Spurs would be enough to be crowned champions.\nThe visitors took a shock lead through Les Ferdinand in the 24th minute, but the Red Devils levelled just before half-time with a curling effort from Beckham.\nCole scored the winner two minutes after the restart, lobbing goalkeeper Ian Walker with a sublime finish.\nUnited held on to claim their first title on home soil since the days of Sir Matt Busby. Trophy number one of three had been secured.\nMan Utd 2-0 Newcastle (FA Cup final)\nSaturday, 22 May 1999\nThe following weekend Manchester United dominated Newcastle United in the FA Cup final to secure their third league and cup double of the 1990s, external.\nFour days before the Champions League final Ferguson's side strolled to their 10th FA Cup crown thanks to goals from substitute Teddy Sheringham and Scholes at Wembley.\nSheringham replaced the injured Keane in the first half and put United in front after 11 minutes following a delightful one-two with Scholes.\nThe England midfielder settled the final seven minutes into the second half with a tidy, drilled finish.\nNewcastle did not offer much in reply and, after winning trophy number two, United quickly turned their attention to Barcelona, external.\nMan Utd 2-1 Bayern Munich (Champions League final)\nWednesday, 26 May 1999\nLate in May 1999 Manchester United reached the promised land.\nWith the Premier League and FA Cup already secured, United completed their unprecedented Treble, external with a scarcely believable win over German giants Bayern Munich in the Champions League final at the Nou Camp.\nMissing the suspended Keane and Scholes, United fell behind in the sixth minute to Mario Basler's free-kick.\nBayern, Treble-chasers themselves, were the better side on the night, hitting the crossbar and the post in the second half but they were unable to finish off United.\nAnd it was two substitutes who punished them late on as Sheringham helped on Giggs' scuffed shot to equalise in the 91st minute.\nTwo minutes later Ole Gunnar Solskjaer poked home a second to give manager Ferguson his first Champions League trophy - in 'Fergie time'.\nTense and terrific until the very last moment, it is now City's turn to attempt to match the greatest achievement of their fiercest rivals.\nOur coverage of Manchester United is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 843,
  "scraped_at": "2026-02-14T02:07:02.900311",
  "_text_extracted": true
}