{
  "article_id": "68a213dfef32",
  "url": "https://www.rnz.co.nz/news/sport/499456/champions-league-wins-for-newcastle-utd-man-city",
  "title": "Champions League wins for Newcastle Utd ; Man City",
  "date": "20231004T224500Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A rampant Newcastle United put in a stellar showing to secure a superb 4-1 victory over French champions Paris St Germain in their first Champions League home match in 20 years on Thursday.\nIn a red-hot atmosphere in the north east, PSG had no answer to the relentless hosts who raced into a 17th-minute lead through Miguel Almiron, before Dan Burn powered home a header six minutes before the break to double Newcastle's advantage.\nThe crowd ensured there was no let-up after the break, with Sean Longstaff drilling a third under the arm of Gianluigi Donnarumma in the PSG goal five minutes into the second half to send the Newcastle fans into dreamland.\nA goal out of nowhere from Lucas Hernandez got the visitors back in it, before a stoppage-time fourth from defender Fabian Schar capped a stunning victory that moved Newcastle top of Group F on four points, one clear of PSG in second.\nPSG suffered their heaviest group-stage defeat in the Champions League since losing 3-0 against Chelsea in September 2004, and conceded four in a single group game in the competition for the first time since a 3-4 defeat to Deportivo La Coruna in March 2001.\n\"So pleased for the players for what they have given me and the football club,\" Newcastle coach Eddie Howe said.\n\"It is such a good feeling for everyone here.\n\"Tactically it was two very good teams going up against each other. We had to try and unsettle them and the crowd helped us do that. To score four goals was not something we expected to do.\"\nLuis Enrique's side travelled to Newcastle having struggled to get going domestically in Ligue 1 this term while boasting a disappointing record of five defeats in their previous seven clashes with English teams in the Champions League.\nThat run always looked like extending as the French champions were second best from the off, unable to muster a single shot on target in the opening period -- the first time they had done so in the first half of a Champions League group-stage match since November 2013.\nWith the crowd cheering every tackle in the sodden conditions, and some players following suit, Newcastle slowly grew into the game, with Almiron becoming their first goalscorer in the competition since Premier League all-time top goalscorer Alan Shearer to lift the roof off St James' Park.\nDonnarumma was forced into several fine stops before he could do nothing to keep out Burn's bullet header, a goal awarded after a lengthy VAR review.\nLongstaff's strike, one that Donnarumma should really have kept out having got down, took Newcastle to within sight of a famous win, before Hernandez glanced Warren Zaire-Emery's cross home to threaten a PSG comeback.\nOther than a Nick Pope save to beat out a Ousmane Dembele strike, PSG rarely troubled the Newcastle goal, with Schar's superb strike from distance the icing on the cake for the jubilant hosts.\n\"I am responsible for what happened his evening,\" Luis Enrique said.\n\"My team's attitude was very good throughout. The outcome of the game was fair, my players struggled with their pressing game. We made some careless mistakes which at this level you cannot afford to do.\"\nManchester City win again\nHolders Manchester City struck twice in the final minutes through Julian Alvarez and Jeremy Doku to beat hosts RB Leipzig 3-1 and rebound from successive domestic defeats to take control of Champions League Group G with maximum points.\nAlvarez curled his shot from the edge of the box into the top corner in the 84th minute and then set up Doku in stoppage time for their third goal as City, who had lost to Newcastle United in the EFL Cup before their league loss to Wolverhampton Wanderers on Saturday, moved up to six points from two games in top spot.\nCity have now equalled the longest European unbeaten run by an English club with 16 matches.\n\"We played a fantastic game in all departments,\" City coach Pep Guardiola said.\n\"After five minutes, we took the game with a lot of passes and when a team is able to do this very nice things are going to happen in your game.\n\"Everyone was perfect. We are really pleased,\" said the Spaniard. \"The substitutes all came off the bench with smiles on their faces, not complaining because they did not start.\n\"I will not judge my team on results. Both games (defeats in previous matches) were not the best results. It happens. There are many games.\"\nCity enjoyed a strong start and had a double chance in the 14th minute with Rico Lewis's fine turn and shot blocked and Phil Foden's rebound sailing just wide of the post with Bernardo Silva failing to connect.\nFoden did better when he opened the scoring with a first-time finish in the 25th minute to beat keeper Janis Blaswich with a bouncing shot.\nWith Guardiola's team enjoying 73% possession in the first half and Leipzig unable to counter City's slick passing game and possession, City went close to doubling their lead through Erling Haaland in the 31st but the Norwegian's shot sailed wide.\nLeipzig struck three minutes after the restart with their first chance of the game as Lois Openda latched on to well-timed Yussuf Poulsen pass and held off a challenge by Manuel Akanji to slot in off the post.\nThe visitors, however, refused to settle for a point, moving further up the pitch in search of a winner, and Foden hit the crossbar in the 63rd with curling free kick.\nWith Haaland, who had scored five goals in last year's 7-0 demolition of Leipzig, largely shut out, it was Alvarez who decided the game when he curled a superb shot past Blaswich and into the top corner.\nThe Germans opened up in search of a late equaliser and City struck again on the break with Alvarez sending Doku through to slot in deep in stoppage time and seal the three points.\n- Reuters",
  "word_count": 1000,
  "scraped_at": "2026-02-14T02:10:28.715333",
  "_text_extracted": true
}