{
  "article_id": "68b0f07e64fb",
  "url": "https://www.aol.co.uk/articles/liverpool-hit-qarabag-six-arne-222134628.html",
  "title": "Liverpool hit Qarabag for six as Arne Slot uses Champions League triumph to drown out noise",
  "date": "20260129T014500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool hit Qarabag for six as Arne Slot uses Champions League triumph to drown out noise\nArne Slot said before the game it is going to be really difficult to shut down the noise around Liverpool given their struggles so far this season.\nYet this was a performance which surely turns down the volume a little even if it will still be far from silencing the critics.\nIn Europe, the Reds are certainly setting a different tone to the one in the Premier League.\nThis was a six-goal rout of a side in Qarabag who are far from European royalty but are still competitive enough that their journey in the competition was not ended by this thrashing.\nWhile Liverpool secured a Champions League last 16 spot to ease some of the pressure around head coach Slot, the Azerbaijan outfit will head to the play-off round as one of the top 24 teams.\nSo while there won’t be any notion that Liverpool’s ills are suddenly fixed by one display and negative appraisals totally muted, it still has to be counted as an impressive showing which gives hope there’s still plenty for the Reds to play for this season.\nTwo goals from Alexis Mac Allister and one each from Florian Wirtz, Mo Salah – with his first for the Reds since November – Hugo Ekitike and Federico Chiesa delivered what was the widest margin of victory for the Reds under Slot. It muffles the din which the Dutchman spoke about on the eve of the match. At least, temporarily.\n“I didn't mention the noise,” said Slot. “People asked me about the noise and then I reacted on the noise, which is completely normal that there should be noise if you are sixth in the league with Liverpool. Because that's not what we aim for when the season starts.\n“There are also reasons why we struggle. That's not even interesting because we should do better. So I think it's fair for everyone to have an opinion.\n“Probably, I agree with most of those opinions. But today has shown again that sometimes things are maybe a bit more complicated than people think.”\nThe main racket obviously comes from social media but it would be wrong to say that there is not growing frustration around Anfield towards Slot and his Reds, whose form has been rickety in the Premier League. They’ve all-but surrendered their crown as the kings of England and face a battle to even make sure they are back in this competition next season.\nEven winning the title in his first season has not spared Slot from questions or the team from boos. That’s how bad some of their performances have been.\nBefore kick-off, there were no signs of dissent. The only jeers were for the Champions League anthem. That was soon drowned out by cries of “Liverpool, Liverpool”.\nThe last time they had heard that music here at Anfield followed a 4-1 thrashing by PSV Eindhoven. A repeat was unthinkable and would have sparked unrest. Liverpool could not guarantee this would be a coast to the last-16 but they turned it into one.\nThe sight of Jeremie Frimpong pulling up brought groans from around Anfield and more injury pain for Arne Slot. He pulled his headband down over his eyes, then tilted his head back to face up to the sky and shouted an expletive. It was his third injury this season, the previous two hamstring injuries and this looked like another muscle one.\nWith just one fit centre back meaning Ryan Gravenberch was starting alongside Virgil van Dijk in defence, the last thing Slot needed was his only available right back out. It meant Wataru Endo had to come on to play in the position but Liverpool were troubled at the back so rarely it didn’t really matter who played there in this game.\nThe first big roar of the night came in the 15th minute. Dominik Szoboszlai’s corner was flicked on by Ekitike, headed into the ground by Van Dijk and put over the line by Mac Allister.\nWhen Wirtz got the second in the 21st minute with a low strike, it felt like Liverpool had found their rhythm. That’s five goals now since 27 December for the £116m signing. The German star is improving his return, even if many will want to see more from such an expensive acquisition.\nSlot said beforehand Liverpool needed to be better in both boxes if they were to make a success of this season. They certainly showed improvement at one end and were not tested at the other.\nSzoboszlai teed Salah up from a free-kick the Egyptian had won on the edge of the area early in the second half.\nSalah wrapped his left boot around it to find the corner for his 49th goal in the Champions League. When he put out his arms in front of the Kop to take the acclaim of the fans, it brought arguably the cheer of the night. Soon his song followed.\nLiverpool fans were certainly in tune with the team for the first time in a while.\nSlot was beaming when Ekitike made it four soon after. He pounced on a hesitant Bahlul Mustafazade to nick the ball away, then played it past Kevin Medina before a fine finish.\nLiverpool fans were soon singing about conquering all of Europe in the past. The win means they finish third in the table of this stage of the Champions League. It was not one of the great atmospheres here but the mood was certainly improved from recent weeks.\nMac Allister got his second when he found the net after Matheus Silva had made a mess of trying to clear the ball in the 61st minute before Chiesa slotted in the sixth in the 90th minute.\nSlot said something “special” is still possible this season.\nGiven this was just their third win of 2026 – the others being Marseille last week and Barnsley in the FA Cup – they may not be high up on many people’s list of favourites for this competition but knockout football doesn’t always go by the form book. The Reds secured a shorter path and will face one of Atletico Madrid, Club Brugge, Galatasaray or Juventus in March.\n“I’m happy to be going straight into the last 16, especially as only two years ago we were playing in the Europa League and went out to Atalanta,” said Slot. “Now we are two seasons running in the top eight of the Champions League and we are hungry for more.”\nThe only thing ringing in the ears of Slot was the cheers of a happy Anfield.\nYet the Liverpool boss will still be well aware that if they were to suffer an eighth Premier League defeat of the campaign when Newcastle visit here on Saturday night, that negative noise he spoke about pre-match will be back at full blast.",
  "word_count": 1154,
  "scraped_at": "2026-02-14T02:19:21.164928",
  "_text_extracted": true
}