{
  "article_id": "690d5e720566",
  "url": "https://www.teamtalk.com/news/usmnt-ready-rival-england-battle-brews-for-elite-former-premier-league-boss",
  "title": "USMNT to rival England as shock battle brews for elite former Premier League boss",
  "date": "20240717T020000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "USMNT to rival England as shock battle brews for elite former Premier League boss\nThe US national team are reportedly ready to rival England as both nations look to appoint a new coach after the departures of Gregg Berhalter and Gareth Southgate respectively.\nThe USMNT position has been vacant since Berhalter was dismissed last week in the wake of the team’s stunning group-stage exit on home soil at the Copa America.\nSouthgate, meanwhile, walked away from his lengthy tenure with the Three Lions after they lost their second successive European Championship final, this time to Spain in Berlin.\nThat exit has led to the likes of Eddie Howe, Graham Potter and even Jurgen Klopp being tipped as successors, but another name has cropped up for both the England and US roles in the form of Mauricio Pochettino.\nDON’T MISS: The 10 most expensive signings in MLS history, with top three spots belonging to one club\nThe Argentine left Chelsea by mutual content in May, following just one season in charge at Stamford Bridge.\nHis departure was somewhat surprising despite a difficult campaign, as the Blues put together a late-season surge that saw them finish sixth and promise much for the upcoming campaign.\nInstead, the 52-year-old is back on the market again and could be interested in a first foray into the international game after a successful run as a club manager.\nPochettino began his coaching career in Spain with Espanyol before moving to England and taking over Southampton and then Tottenham, where he secured a second-placed Premier League finish and also reached the final of the Champions League.\nPochettino remains a man in demand\nAlthough his stints at PSG and Chelsea were shortlived, Pochettino remains one of the most highly regarded coaches in European football, and wider it would appear.\nIndeed, a report from Ole states that is a candidate for the USMNT head coaching position, a move that could the US could head-to-head with England for his services.\nIf he is genuinely in the running for the US job, it would represent one of the most high-profile options for the USMNT, given that the other targets are MLS coaches like Columbus Crew’s Wilfried Nancy and LAFC boss Steve Cherundolo.\nOther, more fanciful targets, include Spain’s Euro 2024 winner Luis de la Fuente as well as Southgate himself, although it’s though the former Three Lions boss is pushing for a return to club management.\nHe could also switch to punditry, following suggestions that English broadcaster ITV are keen to make him part of their set-up going forward.",
  "word_count": 427,
  "scraped_at": "2026-02-14T02:10:58.965465",
  "_text_extracted": true
}