{
  "article_id": "6935800ed8f9",
  "url": "https://www.newcastleherald.com.au/story/9048521/jets-soar-to-australian-cup-semi-finals-with-3-0-win/",
  "title": "Jets soar to Australian Cup semi - finals with 3 - 0 win | Newcastle Herald",
  "date": "20250824T083000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "NEWCASTLE wonderkid Will Dobson was not even five months old when the Jets collected their only piece of silverware - the 2008 A-League championship.\nSubscribe now for unlimited access.\nor signup to continue reading\nAnd when Jets coach Mark Milligan reminded the players on Sunday that the club had never made the semi-finals of the Australia Cup, it \"lit a fire\" in the 17-year-old midfielder.\nWith the Jets ahead 1-0 but the quarter-final against Macarthur at Maitland on Sunday still very much in the balance, Dobson was introduced off the bench in the 71st minute.\nDobson, almost with his first touch, scored to break the spirit of the Bulls.\nTwo minutes later, the attacking midfielder set up a goal for Kota Mizunuma. Game over.\n\"When Mark made the point in the sheds that we hadn't made the semis of the Australia Cup, that lit a fire in me,\" Dobson said. \"I wanted to take this opportunity and take us through to the semis.\"\nDobson's first senior goal was far from a tap-in. He ran on to an Eli Adams through ball, took a touch away from his defender before sliding a shot past keeper Filip Kurto at the near post.\n\"Eli and I have a really good connection on the pitch,\" Dobson said. \"As soon as it went into him, I knew I had to get to the next line, and he would find me.\n\"When he bounced it into me, I didn't have any other thoughts than to touch and shoot.\"\nThe Jets will meet newly crowned Victorian NPL premiers Avondale in the semi-final at Avenger Park, Melbourne on Sunday at 3pm.\nAuckland City tackle Victorian NPL giant killers Heidelberg in the other semi in Melbourne on Saturday night.\nThe winner of the Australia Cup earns a place in the AFC Champions League Two.\nHowever, New Zealand is a member of the Oceana confederation, meaning Auckland are ineligible to compete in Asia.\nIf they win the Cup, the other finalist would take their place in Asia and pocket $462,000 for competing in the group stage.\nTeams that make it out of the group stage receive a further $123,000. Prize money increases with every knockout stage. The winner collects $3.8 million.\n\"It is not a different game for us in terms of our mentality,\" Milligan said ahead of the clash with the semi-professional Avondale.\n\"We showed that against [NNSW NPL club] Cooks Hill, with the attitude we took into the game.\n\"It will be no different next week. Avondale have done fantastic in the Cup and have just won their league as well.\n\"It will be a challenge for us. It is the first time a few of our boys have travelled [interstate]. There are a few things there.\n\"We want to be a team where the occasion doesn't affect the way we go about our work.\"\nDobson is among a host of young players Milligan has used in the Cup run.\nCentre back Max Cooper has played every minute, while Christian Bracco (right back) and Xavier Bertincello (left wing) have started in the past two games.\nOscar Fyer, Alex Nunes, Ethan Debono and Lucas Scicluna have also been given game time.\n\"Mark has instilled confidence in every player,\" Dobson said. \"He has put faith in the young boys. A few of us have been starting. Max Cooper has come in and been unbelievable.\n\"My confidence is growing. I am feeling better and better every day.\"\nMilligan has been impressed with Dobson and all the young players in the squad.\n\"Dobbo is an attacking midfielder, we want our attacking midfielders to be brave,\" he said. \"We want them to get in goal-scoring positions and positions to assist. That is what they love doing. That is why Dobbo is the player he is. He has done that all his life.\n\"It is up to us to help him grow in that department. Allow him to be himself while fitting into the structure of the team.\n\"Like most of the young ones. He has a great attitude and a real desire to be a part of what we are doing. That is the biggest thing for me.\n\"He really threw himself into the way we train and the information that we give him. It's not just him, there are a lot of them.\"\nAfter helping the Jets seal a place in the top four, striker Ben Gibson has received his first national-team call-up.\nThe 22-year-old is in a 24-man Olyroos squad to contest qualifiers for the under-23 Asian Cup in China next month.\nNew-look Jets stun Bulls to create slice of history\nMark Milligan take a bow.\nThe rookie coach vowed to introduce a new game at the Newcastle Jets.\nHe has already delivered a piece of history.\nThe Jets out-hustled, out-ran and out-played Macarthur 3-0 at Maitland Sportsground on Sunday to book a place in the Australian Cup semi-finals for the first time.\nMax Burges put the Jets up after 18 minutes, before two goals in three minutes to replacement Will Dobson (78th) and Japanese winger Kota Mizunuma (80th) sealed the result.\nThe Jets will now meet Victorian NPL club Avondale in Melbourne next month. Auckland FC battle giant killer Heidelberg United in the other semi.\nIt was only the second time the Jets had progressed to the final eight since the inception of the national knockout in 2014.\nThey have now won three straight, having beaten Adelaide 2-1 at Maitland Sportsground and Cooks Hill 5-0 at No.2 Sportsground.\nAnd the way they are playing, they will nearly be favourites to win the whole thing and secure a berth in the AFC Champions League Two next year.\nThe Jets dominated, bar a 15-minute spell in the second half.\nThey moved the ball with speed, played neat one-touch football and got in behind constantly.\nDefensively, they were compact and connected.\nThe Jets were on the front foot from the get-go.\nDaniel Wilmering had a stinging shot deflect just wide in the 12th minute.\nMost of the Jets' attack in the opening 15 minutes was directed down the left side through Wilmering, Burgess and Xavier Bertoncello.\nIt paid dividends in the 18th minute. Alex Badolato released Wilmering, who drove towards the byline and cut a pass across goal.\nBurgess timed his run perfectly and slotted a left-foot shot into the right corner.\nThe Jets' ball movement was mesmerising at times as they constantly picked open the Bulls defence.\nHowever, they were unable to find a killer blow.\nThe visitors started to get a foothold in the game midway through the half.\nHarry Pollitidis caused problems down the left and Harry Sawyer was a handful up front with his size.\nTom Uskok had a header fizz over the crossbar and Liam Rose had a shot flash past the right post.\nThe Jets made a change at the break, with Grozos replacing Lachie Bayliss, who picked up a leg injury.\nThe Bulls made a brighter start to the second half.\nThey started to win duels and find pockets of space.\nThe Bulls had keeper Filip Kurto to thank for staying in the match.\nBadolato threaded a ball in behind for Ben Gibson. The striker burned past his defender and unleashed a fierce shot, but couldn't beat the right mitt of the keeper.\nThere was little Kurto could do a minute later.\nAgain Badolato was involved, playing replacement Eli Adams into space. He played in Dobson, who took a touch away from the defender and slid a shot inside the right post.\nDobson turned provider two minutes later. Again, the jets exploded on the counterattack and the teenager crossed to Kota Mizunuma. The Japanese wing did the rest, firing into the top left corner.",
  "word_count": 1288,
  "scraped_at": "2026-02-14T02:09:18.615395",
  "_text_extracted": true
}