{
  "article_id": "69479bca9583",
  "url": "https://metro.co.uk/2026/01/30/mikel-arteta-told-64m-signing-not-good-enough-arsenal-26615356/",
  "title": "Mikel Arteta told £64m signing is  not good enough  for Arsenal",
  "date": "20260130T221500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has been warned his £64m summer signing Viktor Gyokeres is ‘not good enough’ to lead the line for Arsenal or ‘take them to the Premier League title’.\nGyokeres has scored 10 goals in 29 appearances for the Gunners, just five of which have come in the Premier League.\nThe 27-year-old Sweden international boasted an incredible goalscoring record in Portugal with 97 in 102 games but has failed to hit those heights since arriving at the Emirates Stadium.\nGyokeres was benched for Arsenal’s Premier League defeat to Manchester United last weekend, with Gabriel Jesus favoured by Arteta following his long injury lay-off.\nThe return of the also previously injured Kai Havertz will only increase the level of competition in the Arsenal squad.\nArteta has repeatedly defended Gyokeres, insisting much of his contribution goes unnoticed, but Dietmar Hamann has already come to the conclusion that he is not at Arsenal’s level.\n‘I always said Arsenal needed a centre-forward,’ the former Liverpool, Manchester City and Bayern Munich midfielder told CasinoBeats.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Somebody who knows, when you go down to the last 10 minutes, you can mix it up, you put somebody put top, you’ve got an aerial threat, and you occupy defenders because with a bit of a physical presence you will create space for the wingers like Bukayo Saka and Gabriel Martinelli.\n‘If you give those wingers a bit of space, they’re almost unstoppable. I still feel Arsenal need somebody.\n‘I feel at the moment, even though Viktor Gyokeres didn’t start at the weekend, I don’t think he’s one of the top strikers in Europe.\n‘I think he’s a goal scorer but then again I don’t think a goal scorer against the best teams is enough because I don’t think he will get into positions where he can score.\n‘They brought Gyokeres in as the centre-forward but I don’t think he’s good enough. Whether that will be the deciding factor in the end I don’t know but at the moment, it certainly didn’t help Arsenal.\n‘We saw Gyokeres at a few clubs before Sporting and I’m just not sure whether he’s got the ability to play against the best defenders in Europe and in the Premier League.\n‘It takes something more to even get into positions where you can finish against players like this, and obviously you have to finish chances too. It’s a very physical game and sometimes it can wear you out.\n‘If you do get a chance after 70 or 75 minutes, maybe you lack that bit of energy and concentration and you miss it.\n‘In Portugal he didn’t have to do too much work going backwards and maybe that could have saved him. Not every challenge was a full-on challenge.\nMore Trending\n‘Sometimes we have to give players a bit of time because it’s a difficult game but I’m not sure he’s got what it takes to lead the line for a club like Arsenal and take them to the title in all honesty.’\nGyokeres got on the scoresheet in Arsenal’s Champions League win over Kairat on Wednesday night as the Gunners clinched top-four in the group phase.\nFollowing three league games without a win, Arteta will be desperate for Arsenal to get back to winning ways in the Premier League on Saturday when his side visit Leeds United.\nLeeds endured a difficult start to life back in the top-flight but have lost just once in their last 11 games since the start of December to pull six points clear of the relegation zone.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Gary Neville and Ian Wright disagree over prediction for Man Utd vs Fulham\nMORE: Bruno Guimaraes injury update ahead of Liverpool vs Newcastle United\nMORE: Patrick Dorgu injury latest ahead of Manchester United vs Fulham",
  "word_count": 698,
  "scraped_at": "2026-02-14T01:59:36.853002",
  "_text_extracted": true
}