{
  "article_id": "697e8ccaf46b",
  "url": "https://www.france24.com/en/live-news/20231006-leverkusen-face-derby-rivals-cologne-with-alonso-revolution-in-full-swing",
  "title": "Leverkusen face derby rivals Cologne with Alonso revolution in full swing",
  "date": "20231006T060000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leverkusen face derby rivals Cologne with Alonso revolution in full swing\nBerlin (AFP) – Xabi Alonso's Bayer Leverkusen are dreaming of a Bundesliga title challenge, just a year since the Spaniard took over as coach with the club languishing near the relegation zone.\nIssued on:\nAlonso joined Leverkusen on October 5, 2022, with the club having won just one of their opening eight league fixtures and having been dumped out of the German Cup.\nLeverkusen, who have never won the Bundesliga, sit top of the table 12 months on, having won five of their first six games, only dropping points in a pulsating 2-2 draw at champions Bayern Munich.\nAlonso won three Bundesliga titles, one La Liga title, two Champions League crowns, the World Cup and two European Championships as a player.\nHopes are high that he will help Leverkusen, who lost in the Europa League semi-finals last season, shake their 'Neverkusen' moniker.\nDespite strong financial backing and a scouting network which has repeatedly unearthed some of the best German and global talents, Leverkusen's trophy cabinet remains sparse, with just one German Cup and one UEFA Cup title.\nThe club's nadir came in 2002, when Leverkusen found themselves in Champions League and German Cup finals, as well as atop the Bundesliga table with two matches remaining, before finishing runners-up in all three competitions.\n\"A lot has happened this year, mostly good things,\" Alonso said on Wednesday.\n\"It's been a very, very good experience so far, but I don't want to look back, I want to look forward.\"\nLeverkusen's Rhine Derby opponents on Sunday, Cologne, have endured a horror start to the season, losing five and drawing one despite some typically dogged performances under firebrand coach Steffen Baumgart.\nOne of several fiery rivalries in Germany's Ruhr region, things boiled over between Leverkusen and Cologne after the former signed then-youth team prodigy Florian Wirtz from the latter.\nWirtz has since developed into one of European football's brightest stars but Cologne fans have not forgotten, booing the then teenager whenever he touched the ball in Germany's 3-2 loss to Belgium in Cologne in a March friendly.\nBaumgart described his side's plight on Sunday as a \"shitty situation\" but promised to \"lift our butts up, fight for every inch and get the necessary points\".\nOne to watch: Thomas Mueller (Bayern Munich)\nBayern Munich veteran Thomas Mueller may start from the bench more often these days, but the forward's ability to impact a game remains intact.\nMueller took it upon himself to drag Bayern to victory in the Champions League at FC Copenhagen on Tuesday, collecting a difficult pass surrounded by defenders before setting up Mathys Tel to score the winner.\nMueller, 34, is enjoying a late-career renaissance under Thomas Tuchel, consistently reminding Bayern of his importance despite a wealth of attacking options.\n\"He is an integral part of our team and someone we can absolutely count on,\" Tuchel said after the match, Bayern's 36th straight Champions League group stage game without defeat.\n\"You can see the energy he has at the moment and the charisma.\"\nKey stats\n10: Serhou Guirassy has 10 goals in six league games this term -- one shy of the 11 Bundesliga goals he scored in the whole of last season.\nSeven: Wolfsburg striker Jonas Wind has scored seven of his side's nine goals this season. Guirassy's Stuttgart host Wind's Wolfsburg on Saturday.\nFour: Eintracht Frankfurt have scored just four goals from six league games this season -- the equal lowest. The 2022 Europa League winners are missing the departed Randal Kolo Muani, who last year scored 15 and assisted 14 more in the league.\nFixtures (1330 GMT unless stated)\nFriday\nBorussia Moenchengladbach v Mainz (1830)\nSaturday\nRB Leipzig v Bochum, Stuttgart v Wolfsburg, Borussia Dortmund v Union Berlin, Augsburg v Darmstadt, Werder Bremen v Hoffenheim (1630)\nSunday\nBayer Leverkusen v Cologne, Bayern Munich v Freiburg (1530), Eintracht Frankfurt v Heidenheim (1730)\n© 2023 AFP",
  "word_count": 655,
  "scraped_at": "2026-02-14T02:10:28.712892",
  "_text_extracted": true
}