{
  "article_id": "697f1a99dcd9",
  "url": "https://news.yahoo.com/emma-hayes-says-chelsea-ready-193717475.html",
  "title": "Emma Hayes says Chelsea are ready for challenge of toppling Barcelona",
  "date": "20230426T203000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emma Hayes says Chelsea are ready for challenge of toppling Barcelona\nEmma Hayes insists her Chelsea side are as ready as they can be to spring a Women’s Champions League surprise over Barcelona.\nThe Catalan club are enjoying a perfect Liga F campaign, winning all 25 of their games, and hold a narrow 1-0 lead in their semi-final tie with Chelsea after victory at Stamford Bridge on Saturday.\nRegarded as one of the best women’s teams in Europe, Barcelona will be favourites to finish the job in front of a crowd of over 65,000 at the Nou Camp, with either Arsenal or Wolfsburg to come in the final.\nHayes, though, has backed her side to give their all against an opponent who beat Chelsea 4-0 in the Champions League final two years ago.\n“Nobody denies they are a fabulous team with an amazing history, particularly here,” the Chelsea boss told reporters in Spain on the eve of the clash.\n“We have to accept that we will suffer more against Barcelona than anyone else. But we showed in the previous game we can defend.\n“We will have to do that at an even higher level and the execution from us with the football has to be better. It’s a football match. The game is 1-0. We have a fair and equal chance.\nWe have a dressing room of players that want to be in this position. We will give it everything we have got\nEmma Hayes\n“This is a strength of our team. We are built to cope with the challenges. We like to suffer. We’re as prepared as we possibly can be.\n“I have said it time and time again, we have a dressing room of players that want to be in this position. We will give it everything we have got.\n“We’re looking forward to playing at this magnificent stadium. At 1-0 there is no doubt, with their history here, we have to be at our very best.”\nEngland forward Fran Kirby has travelled with the squad despite being out with a knee injury that could yet see her miss the World Cup.\n“Fran wanted to come with the team,” added Hayes.\n“She’s part of the team. (It is) great to have her with us. At this moment in time I don’t have any more updates.\n“She has been on the grass a little bit but we are having to manage day by day what that looks like and I don’t have a timeline for her return.”",
  "word_count": 418,
  "scraped_at": "2026-02-14T01:59:46.859765",
  "_text_extracted": true
}