{
  "article_id": "698095a38bbe",
  "url": "https://www.nytimes.com/athletic/5942792/2024/11/24/tottenham-manchester-city-maddison-postecoglou-stunned/",
  "title": "How Tottenham stunned Manchester City",
  "date": "20241124T090000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "At the end of a strange fortnight for Tottenham Hotspur, the defining image will be Ange Postecoglou triumphantly raising his fist into the air on the touchline at the Etihad Stadium.\nSpurs lost at home against Ipswich Town in their previous fixture just before the international break (the promoted visitors’ first league win of the season at the 11th attempt), announced a bizarrely timed redesign of the club’s badge and drew criticism for appealing Rodrigo Bentancur’s seven-match ban from the Football Association for making racist comments about his team-mate and captain Son Heung-min. The pressure was on before this trip up north to avoid a sixth defeat in 12 games.\nThis was supposed to be a special evening for Manchester City.\nAdvertisement\nThere was a presentation for Rodri before kick-off to celebrate the midfielder winning the 2024 Ballon d’Or award as the best footballer in the world over the previous year, and this was also the first game since Pep Guardiola signed a two-year extension to a contract that was due to expire next summer.\nWhat nobody anticipated was Tottenham thrashing City 4-0.\nThis is how they beat the champions for the second time in four weeks.\nThe roots of Tottenham’s stunning victory can be traced back to Postecoglou’s press conference after that 2-1 defeat at home to Ipswich. The Australian took responsibility for their underwhelming performance and admitted he would consider tweaking his approach. The two-week break international break that followed gave him time to think, and the biggest beneficiary of that was James Maddison.\nMost of the club’s first-team squad were away on international duty, but Maddison was left out of England’s plans for the games against Greece and the Republic of Ireland. Maddison’s form has been inconsistent this season, and he has been named on the bench for Spurs’ two Premier League fixtures before last night. It felt like a big call starting him against City in a match where when a lot of defensive work would be required.\n“He was really good for us earlier in the season and he had a couple of flat games, but the whole team has,” Postecoglou said. “I also believe there’s more in Madders and that’s on me. I always say that’s my role as a manager. If I’m not getting the maximum amount out of the players, the team against Ipswich, or individuals, then it’s about some self-reflection of, ‘Can I do something different with them?’.\n“The thing about Madders was he obviously didn’t go away on international duty. He had two weeks with us and the coaches worked really hard with him and he was working really hard at training. I could see, and said, he was ready for a big game.”\nAdvertisement\nMaddison’s two goals to put Tottenham 2-0 up after 20 minutes last night will grab the headlines, but his all-round performance was phenomenal. He intercepted a through ball from Phil Foden, snapped into a challenge on Bernardo Silva and knew how to take care of possession.\nHe drew City’s forwards in before fizzing balls past them to launch attacks. It was the perfect way to celebrate yesterday being 28th birthday.\n“I came out of the team for a couple of games and when you come out of the team and you’re a bigger name or a leader of the group, people start to question and point fingers, but I feel really good,” Maddison told BBC’s Match of the Day highlights show. “I never have any doubt in myself. Sometimes you go through tough times, I had a couple of bad games, but I have the self-belief to know I am going to come through that and be there for my team and I was today.”\nMaddison has been overshadowed by Spurs team-mate Dejan Kulusevski this season. The Sweden international’s permanent move to a central attacking midfield role has turned him into one of the best and most exciting players in the division. Kulusevski returned to his previous position on the right wing against City, though, and wreaked havoc. The 24-year-old told reporters afterwards that this game “suited us perfectly”.\nGO DEEPER\n“Kulusevski? What a player!” - how he became Tottenham's best\n“City have a lot of the ball, so sometimes we can rest when we defend,” Kulusevski said. “There’s also so much space up there, we play one against one and then it’s always dangerous because we have a lot of quality. It’s always great to play great teams because they always want to play football. When you play lower teams, sometimes it’s not. There’s not much football played because there are a lot of fouls, a lot of injuries and it’s slow going.”\nKulusevski was talking about their opponents’ man-marking approach. City tried to win the ball high up the pitch, but if Tottenham bypassed their press, Dominic Solanke, Son and Kulusevski would often find themselves in dangerous counter-attacking situations. Pedro Porro’s goal to make it 3-0 early in the second half is a prime example. Kulusevski nutmegged Ilkay Gundogan in the middle of the pitch and Spurs took advantage of the cavernous gaps that opened up.\n“We knew we were going to have to defend at different times and with (Kulusevski) and Sonny out there, I thought if we could get the ball to them really early, City are pretty aggressive with their approach,” said Postecoglou. “They (City) like to defend almost man on man because they’ve got outstanding defenders who like to defend, but with Dom there as well, we like that sort of setup where we can get the ball to them earlier.\nAdvertisement\n“That’s the theory. The practice isn’t always that easy because they put pressure on you, and I thought our build-up play today, at times we got a little bit stuck, especially in the second half, but we just persisted in trying to hit those areas that we needed to.”\nThis result is even more remarkable because Tottenham pulled it off without both their first-choice centre-backs — Micky van de Ven and Cristian Romero — due to injury. Ben Davies, usually a full-back, started for the first time in the league this season and was partnered in central defence by Radu Dragusin.\nRomania international Dragusin had a horrible evening against Victor Osimhen in the defeat to Galatasaray last month and Ipswich striker Liam Delap caused him problems, too. He was caught out by Savinho’s tricks on a couple of occasions last night, yet he constantly pressured Erling Haaland and hit a clever long ball that directly led to Maddison scoring the opening goal. The 22-year-old has looked shaky in possession since he joined Spurs from Genoa in January for £25million ($31.4m). This was only his eighth start in the top flight and Postecoglou clearly trusts him to improve.\n“You have to be (great) against City because obviously they’ve got big Erling up there, but the way they deliver the ball, the areas they consistently probe, you’ve got to be focused the whole time and I thought Ben and Radu were really focused,” Postecoglou said. “(Goalkeeper Guglielmo) Vicario behind them was really positive as well with his positioning and the way they communicated. I thought Biss (midfielder Yves Bissouma, despite being booked 18 seconds into the match) was important to that.\n“The key for us was we had to do it as a collective. When you play City, you can’t rely on individuals to find solutions out there and, collectively, I thought we defended really well, but credit to those two guys and not just defensively, we had to play out from the back. It was the only way we were going to deliver balls to the areas we wanted to and Ben and Radu didn’t shy away from that. It wasn’t always easy, but they were consistently looking for the ball and for us to play out from the back.”\nTottenham failed to beat any of the other members of the ‘Big Six’ away from home last season. In comparison, they have taken six points from their two trips to Manchester in this one, scoring seven goals and keeping two clean sheets.\nIf beating United at Old Trafford in late September was impressive, last night’s achievement is on another level. This is the joint-biggest defeat in Pep Guardiola’s managerial career. The last time he lost 4-0 at home was in April 2014, when Real Madrid thrashed Bayern Munich in the second leg of a Champions League semi-final.\nIt is baffling how Spurs seem to veer from one extreme to the other, but they should revel in this moment. They just have to make sure it is not another false dawn, like others this season.\n(Top photo: MI News/NurPhoto via Getty Images)",
  "word_count": 1453,
  "scraped_at": "2026-02-14T02:02:07.191879",
  "_text_extracted": true
}