{
  "article_id": "6989b9fdf891",
  "url": "https://www.justarsenal.com/19-year-old-netherlands-international-esmee-brugts-could-be-of-interest-to-arsenal/342309",
  "title": "19 year old Netherlands international Esmee Brugts could be of interest to Arsenal",
  "date": "20230622T121500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "19 year old Netherlands international Esmee Brugts could be of interest to Arsenal by Michelle\nEsmee Brugts is a 19 year old Dutch professional football player who is an attacking midfielder for PSV Eindhoven and the Netherlands Women’s national team, alongside Arsenal’s Viv Miedema and Victoria Pelova.\nPlaying football from the age of 5, Brugts spent several years at FC Binnenmaas Academy furthering her development, before she signed her first professional contract with PSV Vrouwen in 2020 at just 16 years old.\n“I was 16 when I first arrived in Eindhoven. I was young, but I felt very welcomed. We had some foreign players, so it was good for my English, and to learn about how they live. I used to hang out with them a lot, so I learned how to slowly become myself. Of course, it’s a development every day, but I’d say this club really feels like a family, which is the best way to feel good. And when you feel good, you start playing better,” she said in an interview with 90min.\nBrugts’ received several call ups to the Netherlands Women’s national team before making her debut in 2022 against Brazil during the Tournoi de France. Brugts best moment with her national team was on 6th September 2022, against Iceland in the UEFA World Cup qualifier. Brugts was substituted on in the 66th minute and scored the winning goal in the third minute of added time, earning the Netherlands Women’s team a direct ticket to the FIFA Women’s World Cup 2023!\n“My favorite moment on the field was when we qualified for the World Cup. My cross ended up in the net, and the whole stadium exploded. Everyone was so happy, and of course relieved because we deserved it so much. That has been one of my best moments so far playing this sport, I enjoyed it the most.” said Brugts\n“I hope to make an impact for the team, and enjoy the full experience. It’s in Australia and New Zealand, it’s so far away from home. But I still feel at home with the Dutch fans traveling there. This is such a big tournament for the women’s game, every tournament is getting bigger and bigger, with more attention. And I just want to take it all in and enjoy it. And of course, play good football”\nBrugts is also a BIG Arsenal fan! She actually scored against Arsenal Women in 2021, at the age of 17 – she scored the only PSV goal and Arsenal went on to win the game 3-1 taking them through to Round 2 in the UEFA Women’s Champions League. There’s a nice description of her goal below..\nGoal PSV pull a goal back as a long ball is played through the Arsenal defence, Simone Boye Sorensen will be disappointed with that as Esmee Brugts beat her to the ball before flicking the ball beyond Zinsberger and into the bottom corner to make it 2-1 #UWCL\n— Josh Bunting (@Buntingfootball) August 21, 2021\nDo you think Arsenal have an eye on this huge young talent? When Victoria Pelova moved to London in the January transfer window she stayed with Viv for a while, helping her to settle in. Esmee Brugts would have 2 fellow Netherlands teammates to help settle her in..\nYour thoughts on this exceptionally talented young lady would be most welcome. I for one will be watching her closely throughout the Women’s World Cup this summer!\nCOYGW!!\nMichelle Maxwell\nFollow Michelle on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 609,
  "scraped_at": "2026-02-14T01:50:37.793103",
  "_text_extracted": true
}