{
  "article_id": "698e2f287d4c",
  "url": "http://www.bignewsnetwork.com/news/278785383/chelsea-head-coach-enzo-maresca-part-ways",
  "title": "Chelsea , head coach Enzo Maresca part ways",
  "date": "20260101T161500Z",
  "domain": "bignewsnetwork.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea, head coach Enzo Maresca part ways\nLondon [UK], January 1 (ANI): Chelsea announced parting ways with their head coach Enzo Maresca on Thursday.\nA statement from the club said, 'Chelsea Football Club and Head Coach Enzo Maresca have parted company.'\nThis comes as The Blues are placed fifth in the Premier League table, with eight wins, six draws and five losses, giving them 30 points, 15 less from table-toppers Arsenal. In their previous five matches, they have drawn three, won one and lost one.\n'During his time at the Club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup. Those achievements will remain an important part of the Club's recent history, and we thank him for his contributions to the Club.'\n'With key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the Club believe a change gives the team the best chance of getting the season back on track. We wish Enzo well for the future,' the statement concluded.\nEnzo guided Chelsea to the 2024-25 UEFA Conference League and the 2025 FIFA Club WC titles, and guided them to the UEFA Champions League as well, and they are currently 13th in the standings, with three wins, a draw and two losses, with 10 points.\nThe 45-year-old had earlier claimed lack of support from certain sections of the club after a recent win over Everton earlier in December, saying, as quoted by GOAL.com, 'This is the reason why I praise the players because with so many problems they are doing very well after a complicated week. The last 48 hours has been the worst 48 hours since I joined the club because many people did not support us.'\nHis final game for Chelsea was a 2-2 draw against Bournemouth. Now, the multi-time Premier League champions will take on Manchester City on Sunday. (ANI)",
  "word_count": 319,
  "scraped_at": "2026-02-14T02:15:58.636390",
  "_text_extracted": true
}