{
  "article_id": "69948847f3ce",
  "url": "https://www.teamtalk.com/news/three-way-battle-ignites-for-man-utd-hero-marcus-rashford-arsenal-get-huge-alexander-isak-boost-chelsea-to-sanction-double-exit",
  "title": "Three - way battle ignites for Man Utd hero Marcus Rashford , Arsenal get huge Alexander Isak boost , Chelsea to sanction double exit",
  "date": "20241025T164500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Three-way battle ignites for Man Utd hero Marcus Rashford, Arsenal get huge Alexander Isak boost, Chelsea to sanction double exit\nThree top European sides want to sign Manchester United star Marcus Rashford, Arsenal have received a major boost in their pursuit of Alexander Isak, whilst Chelsea are ready to offload two out of favour players in January – all in this week’s round-up of our exclusive transfer news.\nMARCUS RASHFORD BATTLE IGNITES\nBayern Munich and Marseille have joined Paris Saint-Germain in keeping tabs on Rashford, although Man Utd’s preference would be to keep him, as we revealed on Monday.\nRashford is one of Man Utd’s poster boys having risen through the ranks of the club to become one of their most important players, but his form has dipped drastically in the last two seasons.\nThere has been speculation surrounding Rashford’s future for some time and with just two years remaining on his contract a number of clubs are keeping tabs on him.\nOn October 15, TEAMtalk revealed that PSG have reignited their interest in the winger. The Ligue 1 giants hold long-term interest in Rashford and have made two previous efforts to try and get him to play in France.\nTEAMtalk can now provide the latest on the future of the England international. Sources state that Rashford leaving Old Trafford is not impossible as the January transfer window approaches, but it won’t be straightforward.\nBayern and Marseille are also admirers of Rashford and they would be keen to explore a possible move if Man Utd greenlight his exit – which they are yet to do. But it is unlikely that Marseille would be able to muster the finances needed to pull off such a coup.\nLATEST GOSSIP: Man Utd stunned after Marcus Rashford requests exit, with incredible January move to Prem rival on\nMan Utd’s chiefs view Rashford as a vital player for their project and would make his exit extremely difficult. It is not impossible that the forward leaves in January should he push for a move, but his suitors would have to cough up a huge transfer fee to have any chance of landing him.\nThe Red would also like to extend his current terms beyond the summer of 2027.\nPart-owner Sir Jim Ratcliffe hopes to see the forward get back to his best and re-emerge as the poster boy of the club as they push to get back to the top of the Premier League.\nALEXANDER ISAK TO ARSENAL\nArsenal want to bring in a world-class striker to compete with Manchester City’s Erling Haaland. As we exclusively revealed on Friday, their top target is Newcastle star Alexander Isak.\nIsak has scored just one Premier League goal so far this season but the 25-year-old is still considered one of the best young forwards in Europe.\nSources have informed TEAMtalk that Arsenal would jump at the opportunity to sign Isak next summer, although they are aware it would take over £100m to lure him away from St James’ Park.\nNewcastle are keen to tie Isak, who is currently under contract until 2028, down to a new long-term deal in order to stave off the interest in his signature.\nHowever, we understand that the striker is reluctant to put pen to paper as his priority is playing regular Champions League football – something he feels is unlikely with the Magpies, as things stand.\nAs a result, sources close to the situation say the chances of him leaving Newcastle next summer are ‘very high’, while Arsenal or other clubs could even make an attempt for him in January.\nJuventus’ Dusan Vlahovic is another option for Arsenal and would be cheaper than Isak, but sources have made it clear that they would prefer to sign the Newcastle man.\nCHELSEA TO AXE TWO STARS IN JANUARY\nChelsea are not expecting a busy January transfer window in terms of incomings, as Enzo Maresca is happy with his squad as it stands. A new striker could be signed if the right opportunity presents itself, but the Blues are not in a rush to bring on in.\nHowever, a number of Chelsea stars could be sold as Maresca looks to trim his large squad of players who aren’t in his long-term plans.\nAs we reported on Tuesday, Ben Chilwell is almost certain to leave Chelsea in January. He has made just one appearance so far this season – a League Cup game against Barrow – and hasn’t been named in the Blues’ Europa Conference League squad.\nTEAMtalk sources say that Borussia Dortmund are considering a swoop for Chilwell as they look to bring in a new left-back, while Bournemouth’s Milos Kerkez is another target for them.\nChilwell could be followed out the exit door by young midfielder Carney Chukwuemeka, who is considered a top prospect but has struggled for playing time under Maresca.\nThe 21-year-old has played just 27 minutes of competitive football so far this season and finds himself behind the likes of Romeo Lavia, Enzo Fernandez and Moises Caicedo in the pecking order.\nWe understand that Barcelona have identified Chukwuemeka as a target for the January transfer window as they view him as someone who could develop into a world-class player in the future.\nSources have informed TEAMtalk that a £30m bid could be enough to convince Chelsea to sell Chukwuemeka this winter.\nMAN UTD EXODUS / CRYSTAL PALACE KEEN ON SOUTHGATE…\n➡️ Harry Maguire, Altay Bayindir, Antony, Casemiro and Victor Lindelof are all at risk of being sold by Man Utd.\n➡️ Thomas Frank, Graham Potter, Eddie Howe, Lucien Favre, Massimiliano Allegri and Edin Terzic are all managerial targets for Man Utd. Frank is open to taking the job.\n➡️ Manchester City are interested in in-form Barcelona winger Raphinha, who Barcelona are willing to sell for a big fee due to their financial issues.\n➡️ The Friedkin Group are expected to complete their takeover of Everton by the end of the year and have no plans to sack Sean Dyche, as things stand.\n➡️ Everton have no interest in loaning Dominic Calvert-Lewin in January amid reports that Besiktas are confident of agreeing one with the Toffees. Newcastle, meanwhile, remain interested in the England international.\n➡️ Liverpool are interested in Napoli winger Khvicha Kvaratskhelia but he isn’t their priority, with Takefusa Kubo, Leroy Sane and Karim Adeyemi their top attacking targets.\n➡️ Crystal Palace have identified Graham Potter and Gareth Southgate as managerial targets in case they are forced to sack Oliver Glasner.\n➡️ Al-Nassr are considering offering a lucrative contract to Paul Pogba and reuniting him with his former Man Utd teammate Cristiano Ronaldo.\n➡️ Federico Chiesa is not expected to leave Liverpool in January amid reports claiming he could be loaned back to the Serie A.",
  "word_count": 1124,
  "scraped_at": "2026-02-14T01:51:57.639222",
  "_text_extracted": true
}