{
  "article_id": "699929f5e767",
  "url": "https://thepeoplesperson.com/2023/02/06/man-united-scouts-back-at-fc-porto-but-who-are-they-scouting-259373/",
  "title": "Man United scouts back at FC Porto , but who are they scouting ? ",
  "date": "20230206T153000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s not unusual for top football clubs like Manchester United to send scouts around Europe, if not the world, but reports of United “spies” attending FC porto matches are becoming almost a weekly occurrence of late.\nAccording to Sport Witness, who picked up the story from O Jogo, it is unclear who United are studying.\nThe outlet thinks it might be right winger Pepê (not to be confused with veteran defender, Pepe) or centre forward Mehdi Taremi.\nNeither seems particularly likely. With Marcus Rashford, Jadon Sancho, Alejandro Garnacho, Anthony Elanga and potentially even Anthony Martial, the Red Devils are very well blessed in Pepê’s favoured left wing position.\nAs for Taremi, whilst a clinical and powerful finisher, it would be a huge call to take the step up to one of Europe’s major leagues having passed the age of 30 already.\nUnited have been consistently reported to have Porto’s goalkeeper Diogo Costa at the top of their shortlist to replace David de Gea, and he is more likely to be the reason for the red presence in the stands.\nHowever, as the outlet notes, an easy home tie against Vizela was never going to offer much opportunity to see Costa in action.\nUnited have also been linked with Brazilian forward Evanilson, who has scored six goals in 15 games for the Dragons this term.\nThere were reports in the summer that United had lodged a bid for the star. However, at 23 he remains a good prospect but has failed this season to live up to the promise he showed in the 2021/22 campaign.\nAnother Porto player who has been linked in the past to a United switch is centre back David Carmo, who holds the record as the most expensive transfer between two Portuguese clubs when he joined Porto from Braga last summer for €20 million amidst rumours of bids from both Liverpool and United.\nHowever, he was not in the squad either for the Vizela match and indeed was mysteriously dropped by Porto manager Sergio Conceição over three months ago, never to have been seen since.\nA normally flourishing hunting ground for young talent, the Dragão Stadium is struggling at the moment to keep up with its Lisbon counterpart, the Stadium of Light, where Benfica’s current crop are taking the league by storm and hoping to continue their excellent run in the Champions League.\nThe reason, then, for the numerous scouting trips this season remains unclear.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £2 for the Leeds extended issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 505,
  "scraped_at": "2026-02-14T01:53:21.835747",
  "_text_extracted": true
}