{
  "article_id": "69a3d997017d",
  "url": "https://www.90min.com/fa-cup-scrap-replays-schedule-change",
  "title": "FA Cup to scrap replays as part of significant schedule change",
  "date": "20240418T150000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FA Cup to scrap replays as part of significant schedule change\n- The FA Cup will no longer feature replays from the first round onwards\n- All fixtures will now take place on weekends, rather than in midweek\n- Expanded UEFA competition format led to changes in domestic cup\nBy Tom Gott\nThe FA have confirmed there will no longer be replays from the first round of the FA Cup onwards.\nThe expansion of UEFA competitions like the Champions League has forced the FA to explore changes to its own calendar to both protect players and avoid any drop-off in quality in their domestic cups.\nStarting next season will be a format which will stick around for at least six years, with one of the main highlights being the removal of replays from the first round.\nAll fixtures will be played on weekends, rather than during the week, and the fourth and fifth rounds will both be played exclusive of Premier League fixtures to avoid any games in hand or the pile up of fixtures further down the line.\nThe Premier League have also increased their funding to the football pyramid by £33m annually to help clubs in both the men's and women's system to develop.\nFA chief executive Mark Bullingham said: \"The Emirates FA Cup is our biggest asset and generates over 60% of our revenue to invest into the game, so it is critical to secure a strong format for the future.\n\"This new agreement between the FA and the Premier League strengthens the Emirates FA Cup and gives this very special tournament exclusive weekends in an increasingly busy calendar.\n\"The new schedule ensures the magic of the Cup is protected and enhanced, while working for the whole of the English game. The longer summer period also allows a much-needed player break before the start of the next season.\n\"We have also agreed new funding for the grassroots game, disability football and the women’s and girls’ game. All football begins at the grassroots, and this is recognised by the Premier League with very welcome additional financial support.\"",
  "word_count": 349,
  "scraped_at": "2026-02-14T01:56:51.552052",
  "_text_extracted": true
}