{
  "article_id": "69d094e41cbb",
  "url": "https://www.caughtoffside.com/2025/03/09/man-united-told-pay-monster-midfielder/",
  "title": "Man United have been told the price tag of midfielder Eduardo Camavinga",
  "date": "20250309T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have learned the transfer fee of one of their transfer targets as Ruben Amorim plans to strengthen the squad.\nThe Red Devils are expected to be active in the summer transfer window after a poor season.\nThey are currently in the bottom half of the Premier League, their worst position in decades.\nThe only competition they can win this season is the Europa League after their recent elimination from the FA Cup.\nWith both Casemiro and Christian Eriksen expected to leave the club at the end of the season, signing a new midfielder would be the club’s priority.\nKobbie Mainoo considering his future at Old Trafford has made it more obvious that a new midfielder will be signed in the summer transfer window.\nA player that has been linked with United for a long time is French midfielder Eduardo Camavinga.\nThe Real Madrid midfielder has won two La Liga and Champions League titles with Los Blancos but they are now ready to cash in on him.\nAccording to Fichajes, Real Madrid are willing to sell Camavinga for €70million (£59m, $75.8m) in the summer transfer window.\nEduardo Camavinga to Man United?\nThe player, who can play in the midfield as well as in the left-back position, has endured a difficult season at the club due to injury issues.\nCarlo Ancelotti’s side have lost patience with him and if they receive a good offer for him, they would allow the midfielder to leave the club.\nIt comes as a major boost to Man United that Real Madrid are looking to ofload the midfielder but they would have to fight competition against Manchester City and Paris Saint-Germain in order to sign the Frenchman.\nWith Casemiro and Eriksen set to leave and Mainoo not willing to sign a new contract, United need to spend money on a new midfielder.\nFormer French football Hatem Ben Arfa described Camavinga as a “monster” and praised his technical ability.\nLiverpool, Man United learn asking price for wide player with 10 assists this season",
  "word_count": 337,
  "scraped_at": "2026-02-14T02:02:35.609320",
  "_text_extracted": true
}