{
  "article_id": "6a0e3d701a4a",
  "url": "https://www.teamtalk.com/news/man-city-name-price-club-icon-saudi-prepare-jaw-dropping-contract-offer",
  "title": "Man City name their price , as Saudi clubs line up  jaw - dropping  offer for club icon",
  "date": "20231031T173000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City name their price, as Saudi clubs line up ‘jaw-dropping’ offer for club icon\nA report has revealed the fee Manchester City will demand for Kevin de Bruyne, who continues to be linked with a move to Saudi Arabia.\nThe iconic midfielder has arguably been the Cityzen’s most important player since joining them from Wolfsburg for a then-club record fee of £54m back in 2015.\nDe Bruyne has made 358 appearances for Man City overall, scoring 96 goals and making 156 assists. In the process, he has helped his team to win 14 major trophies, including five Premier League titles and a Champions League.\nThe 32-year-old is still considered to be one of the best midfielders in the world but has struggled with injuries over the last couple of years.\nDe Bruyne suffered a hamstring injury in Man City’s season opener against Burnley and isn’t expected to return to full fitness for another couple of months.\nAs reported by TEAMtalk, Saudi officials are determined to make De Bruyne their next big-name transfer.\nIt has been claimed that Saudi clubs will try and lure the midfielder to the Gulf state with a massive contract offer. There will be ‘jaw-dropping’ finances on offer, it is claimed.\nREAD MORE: Man Utd, Chelsea stunned as Pep Guardiola orders Man City to sign €60m Serie A star\nMan City want more than £50m for De Bruyne\nNow, according to Football Insider, De Bruyne is indeed regarded as a ‘serious target’ for Saudi clubs and they ‘intend to step up their pursuit in the near future.’\nThe report adds that the Belgian is happy at Man City, but could be persuaded to leave the club if the finances offered by Saudi clubs are considered ‘too good to turn down.’\nDespite this, the Cityzens have ‘no intention’ of letting De Bruyne go in January, but would reportedly entertain offers in the region of £50m at the end of the season. He is currently under contract until 2025.\nSaudi clubs are certainly no strangers to splashing the cash. Al Ittihad, for example, put a whopping £150m on the table for Mohamed Salah during the summer window, which was rejected by Liverpool.\nSaudi clubs are unlikely to be put off by Man City’s £50m demand for De Bruyne if they really do ‘dream’ of signing him.\nTherefore, everything points towards the superb centre-mid becoming the next big star to make the switch to Saudi. As mentioned, though, it is likely that he will only move there at the end of the season.\nDON’T MISS: Man City, Arsenal and Chelsea eyeing exciting Irish talent tracked by Real Madrid",
  "word_count": 439,
  "scraped_at": "2026-02-14T01:56:32.766256",
  "_text_extracted": true
}