{
  "article_id": "6a0ec387f3b1",
  "url": "https://theathletic.com/5133837/2023/12/15/pitso-mosimane-interview-afcon/",
  "title": "Former South Africa boss Pitso Mosimane on his hopes for the future of African coaching",
  "date": "20231215T074500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pitso Mosimane is often described as one of the most successful coaches in African football.\nWhen he became SuperSport United’s interim head coach in 2001, they were fighting to avoid relegation from the South African top flight. Mosimane stabilised the team and guided them to a second-place finish.\nAdvertisement\nHe was part of South Africa’s backroom staff at the 2010 World Cup and then became head coach for two years. Since then, he has lifted domestic trophies in Egypt, South Africa and Saudi Arabia and has won the CAF Champions League three times. In 2016, the Confederation of African Football (CAF) honoured him with their Coach of the Year award.\nThe 59-year-old has tasted success in two different continents and, after a short stint with Al Wahda in the United Arab Emirates, is ready for a new challenge to prove he is one of the best coaches in the world.\nIn an exclusive interview with The Athletic, Mosimane discusses:\n- How he “accidentally” became a coach\n- Being “afraid” in his first senior role\n- The “emotion” of being sacked as South Africa’s head coach\n- Ambitions to win AFCON and the World Cup\n- Being “realistic” about his chances of working for a top European club\n- Being offered less money than European coaches doing the same job\n- Having a “responsibility” to succeed and represent African coaches\nMosimane was born in Kagiso in South Africa in 1964 but grew up in Soweto, which is the biggest township in the country, during apartheid. He lived in a ‘matchbox house’ with his family and his father was a businessman who owned a local shop. He started playing football at school and was discovered by Jomo Sono, who had played professionally in Canada and the United States.\nMosimane spent the bulk of his playing career in South Africa, where he represented Jomo Cosmos, Orlando Pirates and Mamelodi Sundowns, while was capped four times by his country too. During a six-year stay with Greek top-flight side Ionikos, he started to think about retirement plans.\n“I accidentally became a coach,” Mosimane tells The Athletic from his home in Johannesburg. “I wanted to be a strength and conditioning coach. I was never in top condition as a player. I always wanted to run more, but I didn’t know what to do. We didn’t have people who understood specific football training drills, we just used coaches from athletics.\n“We used to do 12-kilometre endurance runs in the woods and mountains, which I hated. Footballers cover that distance on the pitch but it features stops, starts, jumps, twists and moving sideways. I preferred training sessions which incorporated that and it made me think, ‘Why can’t we do things with the ball?’. So I decided I wanted to be a coach that focuses on football training.”\nAdvertisement\nMosimane moved to the now-defunct Belgian side KFC Rita Berlaar in 1995 and in his spare time got his first official coaching role helping out with their under-11s. He finished his playing career in Qatar with Al Sadd before he returned to South Africa and started coaching school children from local villages.\nA former team-mate put him in contact with SuperSport and he started working for them as a scout. This led to opportunities in the Netherlands with Heerenveen head coach Foppe de Haan and under Albert Stuivenberg, who is now an assistant coach at Arsenal, in Feyenoord’s academy. Later on in his career, Mosimane completed a coaching qualification with the German Football Association (DFB) and received his CAF Pro Licence from the Royal Moroccan Football Federation (FMRF).\nHe climbed through the ranks at SuperSport to become assistant coach to former Liverpool goalkeeper Bruce Grobbelaar. When Grobbelaar was fired, Mosimane was put in caretaker charge for a few months until he was given the job permanently.\n“I didn’t know what I was doing when I came in,” Mosimane says. “When they sacked the coach, they were near the bottom (of the table) and we ended up finishing second. I was shocked.\n“When they asked me to continue, I thought, ‘Is my luck going to run out now? I’m not sure if I’m the right guy’. I was afraid. The next season we finished second again and this time qualified for the Champions League group stages.”\nMosimane spent six years with SuperSport and won two cup competitions before he became an assistant to South Africa’s head coach Carlos Alberto Parreira. They worked together at the 2010 World Cup, but South Africa became the first host country in history to fail to reach the knockout stage. However, Mosimane loved his time working with Parreira — who managed Brazil when they won the tournament in 1994.\nAdvertisement\n“I was like a sponge — absorbing everything that he did. I learned a lot from him about movement, tactics and how to organise your team.”\nMosimane was the natural choice to succeed Parreira — and did — but his time in charge of South Africa turned out to be “the lowest point” of his career. They failed to qualify for the 2012 edition of the Africa Cup of Nations after mistakenly thinking they only needed a draw in their final qualifying game against Sierra Leone. That result was part of a seven-match winless streak which included friendlies against Zimbabwe and the Ivory Coast. Mosimane was sacked following a 0-0 draw with Senegal.\n“Back then, Africa had five World Cup spots, so I played friendlies against the best teams because my squad becomes stronger,” he tells The Athletic. “One of the (South Africa Football Association) executive members advised me not to play those games as I would put myself under pressure. But if you study tough questions then the exam should be easier, if you study easy questions you will struggle.\n“I wanted to transform the team, but they let me go. I told them, ‘Please don’t sack me, I have more to give’. I got emotional and I said that ‘I’m going to be one of the best coaches on the continent — watch this space’.\n“The media killed me for that. They said I had never won the league. I regretted saying it. Talk to me now, though: who is the top coach on the continent?”\nOver a decade has passed since then and Mosimane’s reputation has soared. He rebuilt it with Mamelodi Sundowns where he won 11 trophies in eight years.\n“The first six months was about assessing the squad,” Mosimane says. “If you’re a coach who just wants to arrest the slide you can do that, but that doesn’t mean that’s what you want long-term. I changed the whole team and recruited different players with the right mentality. We won the league in my first full year.\nAdvertisement\n“I like my teams to build from the back, we need to keep the ball and dominate our opponents. When we don’t have possession, we need to recover the ball as soon as possible. I’m a big fan of Manchester City, Brighton, Arsenal and (Carlo) Ancelotti at Real Madrid.”\n“Sometimes you copy things as a coach. I like how (Jurgen) Klopp plays with his counter-pressing. I like teams that are really principled in terms of defending too. So I take all those good things together.”\nMosimane’s success with Sundowns led to an opportunity with Egypt’s Al Ahly, where he excelled. He is vastly more experienced now than when he first took charge of Bafana Bafana, so would he ever be tempted to return?\n“It’s a big responsibility — you are like the president of the country,” he tells The Athletic. “Never say never. It has to be the right time. We need to have a vision of where we are and who we are. What do we want to achieve?\n“I don’t believe, at this point in time, my country wants to work like that. If you win you are great, if you draw everybody says, ‘What is happening?’ and if you lose, ‘I think we have a problem’. Are they ready to build up?”\nA lack of patience was a problem Mosimane also encountered in his most recent job with Al Wahda. He joined them in June but left five months later, after only 10 games. During that period of time, he was taken to hospital after suffering from shortness of breath. He made a full recovery only to realise the role was not right for him anymore.\n“It doesn’t sit well in my soul because we were only five points behind the leaders,” Mosimane says. “We set up short-term and long-term plans with the club but during the process our visions became different. When you are working towards a vision, don’t ever think the process will be smooth.\n“I’ve been a coach for over 20 years and won 19 trophies using this recipe and then you tell me to use a different one. I believe in my recipe and I can’t change it or compromise it. So we were not aligned and parted ways amicably.”\nAdvertisement\nA few days before The Athletic speak to Mosimane, he was interviewed by the South African Football Journalists Association (SAFJA) and his future was at the top of the agenda. He told SAFJA that any new job “must be a big emergency for me to cancel my holiday and spend Christmas away from home”. So what role would tempt him to change his plans?\n“A big national team maybe,” he says. “I would like to explore. I’m driven by winning things in different countries or continents.\n“I want to win the Africa Cup of Nations (AFCON) and the World Cup. What my good friend Walid Regragui has done with Morocco has brought something out in me. But I’m not closing down club football.”\nMosimane has tasted success in Africa and Asia, so is a move to Europe or the United States the next step?\n“Let’s face the facts and realities,” he says. “If Patrick Vieira could not survive with a big name in Europe, what are my chances? I don’t live in a wonderland.\n“There were teams in Eastern Europe interested in me, but they want to pay you as an African coach. No. Pay me the same as the other guy who was just here. Let’s have some respect. Don’t look at where I come from, look at my C.V. and experiences. You can’t employ a doctor in a hospital and underpay him because he’s an African doctor. He studied the same body of a human being as another doctor who comes from Sweden. So Europe is not ready, but maybe I will get a chance in MLS.”\nMosimane has broken down barriers before. He was the first sub-Saharan coach to take charge of Al Ahly and he won the 2020 CAF Champions League with them when they beat their fiercest rivals Zamalek 1-0 in the final. Al Ahly qualified for the Club World Cup where they lost 2-0 to Bayern Munich in the semi-finals but beat Brazilian side Palmeiras to finish third. In 2021, Mosimane’s Al Ahly defended their African title with an emphatic win over South Africa’s Kaizer Chiefs.\nIn September 2022, he took over Al Ahli, who had just been relegated from the Saudi Pro League. He won the second division title with them but left in June and alleges he and his coaching staff were never paid. Weeks later, Al Ahli were taken over by the Public Investment Fund (PIF) and went on a shopping spree which included signing Franck Kessie from Barcelona and former Liverpool striker Roberto Firmino. Mosimane’s time at Al Wahda might not have worked out as planned, but he has constantly shown a desire to try new experiences.\nAdvertisement\n“I have a responsibility to do well,” he says. “It’s about representing the continent and the coaches of Africa. I wish my brothers could get opportunities entrusted to them.\n“Aliou Cisse (Senegal’s head coach) sat behind me when we studied for our Pro Licence. We would talk and say, ‘How can we have players from Africa winning the Champions League in Europe but there’s nobody who can coach a team? How is the world like that?’. The world takes time to evolve and maybe other coaches will benefit.”\nWhatever club Mosimane ends up at, they will be hiring a coach with a unique approach to getting the best out of his squad.\n“I meet my players’ parents when I see that they need advice and support,” he says. “Every club I go to they say, ‘We have never had someone who wants to see parents. What are you doing? They are adults’. But to their parents they will always be children. I always find it helps me a lot to become closer with players.\n“You must coach the human being first. Care about each other, show them that you are honest and want the best for them. Show them they have potential and can do better. Show them how to be successful and the discipline behind it and they will buy into your vision.”\nIn the past, he has even invited players over for dinner on Christmas. This year, however, he is intent on relaxing with just his family before jumping back into the world of management.\n(Top photo: Angel Martinez – FIFA/FIFA via Getty Images)",
  "word_count": 2218,
  "scraped_at": "2026-02-14T02:07:27.049976",
  "_text_extracted": true
}