{
  "article_id": "6a1190edd073",
  "url": "https://jamaica-gleaner.com/article/news/20251216/court-rules-psg-must-pay-more-us70m-mbappe-dispute-over-unpaid-wages",
  "title": "Court rules PSG must pay more than US$70M to Mbappé in dispute over unpaid wages",
  "date": "20251216T134500Z",
  "domain": "jamaica-gleaner.com",
  "source_country": "Jamaica",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Court rules PSG must pay more than US$70M to Mbappé in dispute over unpaid wages\nLoading article...\nA labour court in France has ruled Paris Saint-Germain must pay more than 60 million euros (US$70 million) to footballer Kylian Mbappé in a dispute over unpaid wages and bonuses. The case is linked to the end of his contract before his 2024 move to Real Madrid.\nLawyers argued last month before the Conseil de prud’hommes de Paris in a judicial saga involving colossal sums. The court on Tuesday sided with the player amid accusations of betrayal and harassment surrounding the breakdown of his relationship with PSG, a French club.\nMbappé’s lawyers claimed PSG owed him more than 260 million euros ($305 million), and PSG was seeking 440 million euros from Mbappé, citing damages and a “loss of opportunity” after he left on a free transfer.\nThe court's ruling can be appealed and is unlikely to end the dispute.\nMbappé's representatives said the ruling “confirms that commitments must be honored. It restores a simple truth: Even in the professional football industry labour law applies to everyone.”\nThere was no immediate reaction from PSG.\nThe relationship between the 2018 World Cup winner and the reigning European champion turned bitter when Mbappé decided in 2023 not to extend his contract, which was set to expire in summer 2024.\nThis deprived the club of a juicy transfer fee despite having offered him the most lucrative contract in club history when he signed a new deal in 2022.\nHe was sidelined from a preseason tour and forced to train with fringe players. He missed the opening league game but returned to the lineup for a final season after discussions with the club — talks that are central to the dispute.\nThe club accused Mbappé of backing out of an August 2023 agreement that allegedly included a pay reduction should he leave on a free transfer, an arrangement PSG said was meant to protect its financial stability.\nPSG claimed that Mbappé hid his decision not to extend his contract for nearly 11 months, from July 2022 to June 2023, preventing the club from arranging a transfer and causing major financial harm. It accused him of violating contractual obligations and the principles of good faith and loyalty.\nMbappé’s camp insisted PSG has never produced evidence that the striker agreed to forego any payment. His lawyers claimed the club failed to pay wages and bonuses for April, May, and June 2024.\n“Mbappé scrupulously fulfilled his sporting and contractual obligations for seven years and right up to the final day,” his advisers said on Tuesday. “He did everything possible to avoid litigation, even going so far as to withdraw a harassment complaint in a spirit of conciliation. In total, he had been seeking payment of his salaries and bonuses for more than 18 months.”\nPSG rejected all accusations of harassment, highlighting that Mbappé took part in over 94% of matches in 2023–24 and always worked under conditions compliant with the Professional Football Charter.\nPSG was seeking a total of 440 million euros in damages, including 180 million euros for the lost opportunity to transfer Mbappé because he left as a free agent after declining a 300 million euros offer from Saudi club Al-Hilal in July 2023.\nMbappé joined Real Madrid in the summer of 2024 on a free transfer after scoring a club-record 256 goals in seven years at PSG, which won the Champions League this year without him.\nFollow The Gleaner on X, formerly Twitter, and Instagram @JamaicaGleaner and on Facebook @GleanerJamaica. Send us a message on WhatsApp at 1-876-499-0169 or email us at onlinefeedback@gleanerjm.com or editors@gleanerjm.com.",
  "word_count": 607,
  "scraped_at": "2026-02-14T01:59:31.524111",
  "_text_extracted": true
}