{
  "article_id": "6a1c5e888680",
  "url": "https://metro.co.uk/2025/07/24/aston-villa-respond-manchester-united-approach-ollie-watkins-23741889/",
  "title": "Aston Villa respond to Man Utd approach for Ollie Watkins",
  "date": "20250724T131500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have made an approach to sign Aston Villa striker Ollie Watkins, according to reports.\nRuben Amorim is keen for United to add a new striker to his squad ahead of the new Premier League season.\nDeals for Matheus Cunha and Bryan Mbuemo have already been completed to bolster United’s attacking options this summer, but Amorim wants another experienced central striker to ease the burden on Rasmus Hojlund, who scored just four goals in the Premier League last season.\nSo far this summer, United have been rejected by Liam Delap, who went on to join Chelsea in a £30m deal from Ipswich Town, while Hugo Ekitike turned down an approach from Amorim’s side and opted to move to Liverpool instead.\nAccording to The Telegraph, United have now turned to Watkins and an approach has been made to Villa over the 29-year-old’s availability.\nHowever, Villa are said to have told United that they are not willing to entertain offers for their striker.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWatkins was the subject of a £40 million bid from Arsenal in the January transfer window but Villa turned down the offer from Mikel Arteta’s side.\nThe striker was also unhappy with Unai Emery after he was benched for both of Villa’s Champions League quarter-final legs against Paris Saint-Germain in April.\n‘We’ve put in a lot of hard graft the last few years to get to that position. And obviously I played 20 minutes against PSG in both games,’ Watkins said.\n‘I’m not going to lie. I was fuming I wasn’t playing and I let him know that.\n‘But he’s the manager at the end of the day and you’ve got to respect his decision, but I’m not one of those players that’s happy to sit on the bench.’\nWatkins, who joined Villa in a £33m deal from Brentford in 2020, finished last season with 17 goals in all competitions.\nUnited, meanwhile, have also failed with an offer to sign goalkeeper Emiliano Martinez on loan from Villa.\nMore Trending\nThe Argentina international, who was in tears as he waved goodbye to Villa fans in the final home game of last season, is understood to be keen on a move to Old Trafford.\nVilla have set a £40m asking price for Martinez, who is currently with the squad for their pre-season tour in the United States.\nUnited are in the market for a new goalkeeper due to Andre Onana’s inconsistent performances in his two seasons at the club. The Cameroon international will also miss the majority of United’s pre-season campaign due to a hamstring injury.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Declan Rice makes ‘shock’ prediction for new Arsenal teammate Noni Madueke\nMORE: Alexander Isak drops transfer bombshell with Liverpool keen on £150m Newcastle star\nMORE: Harvey Elliott raises doubt over Liverpool future after West Ham transfer approach",
  "word_count": 539,
  "scraped_at": "2026-02-14T02:02:51.947614",
  "_text_extracted": true
}