{
  "article_id": "6a31b1234f03",
  "url": "https://www.empireofthekop.com/2024/12/10/salah-50-european-goals-liverpool/",
  "title": "Mo Salah becomes first player to reach 50 goals for Liverpool in Europe",
  "date": "20241210T221500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mo Salah is no stranger to making history at Liverpool, and he reached yet another landmark in this evening’s win over Girona.\nThe Reds preserved their 100% record in the new-look Champions League with a narrow 1-0 victory in Spain, and unsurprisingly it was the Egyptian King who made the difference as he converted a second-half penalty to make it 16 goals for the season already.\nIt was his 227th for the club in total, taking him to within one of drawing level with Billy Liddell in fourth place in the all-time scoring charts at Anfield (lfchistory.net).\nSalah makes more Liverpool history\nIn lashing the ball past Paulo Gazzaniga from the penalty spot tonight, Salah also accomplished one unprecedented milestone in Liverpool’s 132-year history.\nAs noted by TNT Sports, it was his 50th goal in European competition for the Reds, a landmark that no other player has reached for the club.\nMo Salah is the first player in Liverpool's history to score 5️⃣0️⃣ goals in European competitions 👑 pic.twitter.com/2jrTA7GcdE\n— Football on TNT Sports (@footballontnt) December 10, 2024\nSalah is truly something special\nWe’re fast running out of original ways in which to commend Salah’s enormous contribution to Liverpool, although that statistic speaks volumes.\nEven allowing for the bloated modern-day Champions League containing far more fixtures than the old European Cup (and being far easier to enter for English clubs), for the Egyptian to become the first player to score 50 continental goals for a team who’ve won numerous trophies at that level is special.\nThe Reds have had lots of great goalscorers over the years, and our current number 11 can rightly be mentioned in the same breath as the very best of them.\nThe manner in which he emphatically lashed the ball past Gazzaniga tonight was that of a player who was determined to atone for his penalty miss against Real Madrid a fortnight ago, and it was just what his team needed in a match where Girona were the better side for large spells.\nThat’s now 50 Liverpool goals and counting in Europe for Salah…imagine what he could get to if, as seems increasingly probable, he signs a contract extension in the coming weeks!",
  "word_count": 367,
  "scraped_at": "2026-02-14T01:52:10.160795",
  "_text_extracted": true
}