{
  "article_id": "6a602c353686",
  "url": "https://thepeoplesperson.com/2025/02/20/man-united-ready-to-pay-for-victor-osimhen-amid-bidding-war-on-wages-291097/",
  "title": "Man United  ready to pay  for Victor Osimhen amid bidding war on wages - Man United News And Transfer News",
  "date": "20250220T151500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are “ready to pay” for Victor Osimhen but will face an uphill battle to convince the 26-year-old striker to accept their offer as a bidding war on wages could rule out a move, according to a report.\nOsimhen’s Release Clause\nItalian journalist Emanuele Cammaroto (as relayed by Sports Witness) reveals Old Trafford officials are willing to meet Napoli’s €75 million release clause for Osimhen as they hunt for a new number nine to buttress Ruben Amorim’s attack.\nCammaroto also reveals Paris Saint-Germain and Chelsea are vying for the Nigerian international, while Juventus are believed to be interested in their rivals’ star. However, the favourable release clause, which is activated this summer, exists only for clubs outside of Italy.\nThe price Juventus would be quoted by Napoli would likely be far higher than the one their continental competitors will pay: “…the Naples club aren’t willing to sell [Osimhen] to Juve and if the latter still insist, Napoli could demand €100m.”\nCammorato concludes there is a “5% chance” Osimhen remains in Naples beyond the summer,\nThe transfer budget at Old Trafford is likely to be somewhat constrained due to the continued pressure of the Premier League’s profits and sustainability rules (PSR). But the club’s cautious approach in the January window should free up space for a much more active summer.\nA fee in the region of €75 million (£62m) will be achievable for United, especially if it delivers a proven goal-scorer with the potent pairing of pace and physicality Osimhen provides.\nHowever, the Nigerian’s wage demands – along with other clubs willingness to meet them – could deliver a decisive blow to the Reds’ hopes of winning the race for his signature.\nA Wage War\nThe report states United could face a “wage battle” with Chelsea, though the London club are said to be unwilling to offer more than a €8 million-a-year salary (£6.62 million).\nThis would equate to a weekly wage of around £127,000 – a wholly unrealistic one for both Chelsea and Osimhen to be considering – meaning the figure quoted amounts to what Osimhen would take home after tax.\nFootballers are subject to an effective tax rate of “48.25% for the majority of their salaries” in the UK. With this calculation in mind, Chelsea’s offer is likely to be worth in excess of £250,000 a week – a figure United may have been willing to meet in the past, but Ineos have demonstrated a desire to drive down the wage bill at Old Trafford over the past twelve months, particularly for older players.\nThere is also long-standing interest in Osimhen from the Middle East with the 26-year-old almost joining the Saudi Pro League in the summer. Al-Hilal are reported to be willing to offer the striker an annual salary of nearly £25 million to join their ranks, which no club in Europe would dream of competing with.\nThe fact United are exceedingly unlikely to be able to offer Osimhen the prospect of Champions League football next season – while PSG and Chelsea likely will – could prove another hurdle in agreeing personal terms with the 26-year-old.\nTherefore, while the Red Devils should face no problems striking a deal with Napoli to sign Osimhen, given the favourable release clause, convincing the striker to choose Old Trafford ahead of more lucrative offers elsewhere may rule the Mancunian side out of the red-hot race.\nFeature image Ahmad Mora via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 576,
  "scraped_at": "2026-02-14T01:58:05.341883",
  "_text_extracted": true
}