{
  "article_id": "6a65bba529ee",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-decision-jadon-sancho-wanted-within-48-hours-swap-talk",
  "title": "Jadon Sancho : Man Utd decision wanted  within 48 hour as swap talk ramps up",
  "date": "20250706T223000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd decision on Jadon Sancho wanted ‘within 48 hours’ as swap talk ramps up\nManchester United are being pressed for a final decision on sending Jadon Sancho to a European giant, with their asking price being confirmed but the chances of a swap deal being talked up.\nSancho’s future is a dilemma for Man Utd once again after Chelsea avoided signing him on a permanent basis by paying a penalty fee after his loan spell. The chances of the winger being reintegrated by Ruben Amorim are close to zero.\nIn terms of an exit, Juventus have come forward with interest recently. Early talks have generated some optimism that a deal could be done, but there’s still a lot of work ahead.\nThings are heating up, though, with Dean Jones now reporting for Tribal Football that Juventus ‘hope to know within 48 hours’ if the signing of Sancho is ‘realistic’.\nWhile Sancho is said to be open to moving to Serie A, the key sticking point is his wages, which are currently outside of the Old Lady’s budget. The maximum they’d be willing to offer, Jones claims, is £160,000 per week; Sancho is on £250,000 per week in Manchester.\nIf successful, they could either meet the £25m asking price United have set, negotiate a deal down to somewhere between £15m and £20m, or look into a swap deal.\nIn that regard, Douglas Luiz is the player to keep an eye on. The former Aston Villa star is already surplus to requirements in Turin, just a year after moving there.\nAccording to the latest from TBR Football, Luiz is enthusiastic about returning to the Premier League – but United wouldn’t be his only option.\nTottenham Hotspur have also been linked with the Brazil international, also in a potential player exchange given Juventus’ interest in Yves Bissouma – which could lead to more of a like-for-like swap.\nAdditionally, the report by Graeme Bailey lists Everton, Fulham, Nottingham Forest and West Ham United as clubs that have reached out about bringing Luiz back to English football.\nHis former club Aston Villa are not currently prioritising a return.\nMan Utd transfer news: Latest headlines\n📌 Man Utd plot ‘lucrative’ offer with Amorim approval for striker who may only be FOURTH choice\n📌 Rashford dream coming true with Barcelona to put bid into Man Utd\n📌 Man Utd told to pay £35m for French striker on Ruben Amorim’s ‘shortlist’\nSancho at Man Utd: The troubled timeline\nJuly 1, 2021: Manchester United announce they have reached an agreement with Borussia Dortmund to sign Sancho after Euro 2020.\nAugust 14, 2021: Sancho makes his Man Utd debut in a Premier League win over Leeds United.\nNovember 23, 2021: Sancho scores his first Man Utd goal in a Champions League game against Villarreal.\nNovember 28, 2021: Sancho adds his first Premier League goal against Chelsea.\nApril 23, 2021: Sancho makes the final appearance of his debut season, which thus ends with five goals from 38 games for Man Utd.\nAugust 22, 2022: Sancho scores his first goal of the new season with the opener in a win over Liverpool.\nDecember 13, 2022: Erik ten Hag says Sancho has been absent due to ‘physical and mental’ factors – with it later emerging that the club were not cleared to go public with his mental health struggles.\nFebruary 1, 2023: Sancho returns to action for the first time since October and helps Man Utd reach the EFL Cup final.\nFebruary 26, 2023: Man Utd win the EFL Cup, with Sancho appearing as a substitute for the last seven minutes.\nJune 3, 2023: Sancho starts the FA Cup final, but Man Utd lose to Man City. His season ends with seven goals from 41 games.\nSeptember 3, 2023: Ten Hag leaves Sancho out of his squad against Arsenal and blames ‘his performances in training’.\nSeptember 14, 2023: Man Utd announce that Sancho will be made to train separately due to a discipline issue.\nJanuary 11, 2024: After not playing since August, Sancho re-joins Borussia Dortmund on loan for the rest of the season.\nJanuary 13, 2024: Sancho provides an assist on his second debut for Dortmund.\nApril 28, 2024: Sancho becomes the highest-scoring English player in the history of the Bundesliga – an honour he would hold for just five months – with a goal against RB Leipzig.\nJune 1, 2024: Sancho starts the Champions League final at Wembley as Borussia Dortmund lose to Real Madrid.\nAugust 10, 2024: Having held peacemaking talks with Ten Hag, Sancho plays for Man Utd in the Community Shield against Man City, but misses a penalty in the shootout.\nAugust 31, 2024: Chelsea sign Sancho on loan with an obligation to buy if they finish in the top 14 of the Premier League.\nSeptember 14, 2024: Sancho makes his debut for Chelsea as a substitute against Bournemouth and earns the man of the match award after making an assist.\nDecember 4, 2024: Sancho scores his first goal for Chelsea in a win over Southampton.\nMarch 11, 2025: Reports begin to emerge that Chelsea can pay a penalty fee to avoid signing Sancho permanently.\nApril 20, 2025: A win over Fulham triggers Chelsea’s obligation to buy Sancho due to not being able to finish lower than 14th, although reports persist about their option to cancel the deal.\nMay 28, 2025: Sancho wins the Conference League with Chelsea, who beat Real Betis in the final.\nJune 11, 2025: Chelsea confirm they are sending Sancho back to Man Utd after his loan spell.",
  "word_count": 931,
  "scraped_at": "2026-02-14T01:49:44.684149",
  "_text_extracted": true
}