{
  "article_id": "6acca91d0047",
  "url": "https://metro.co.uk/2026/01/25/chelsea-make-cole-palmer-transfer-decision-man-utd-man-city-links-26505282/",
  "title": "Chelsea make Cole Palmer transfer decision after Man Utd and Man City links",
  "date": "20260125T091500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea view Cole Palmer and at least two of his Stamford Bridge teammates as ‘untouchable’ ahead of the summer transfer window, according to reports.\nPalmer quickly established himself as one of Chelsea’s most important players following his £40m move from Manchester City in 2023.\nThe playmaker finished his first season at Chelsea with 27 goals and 15 assists – the most goal involvements of any player in the Premier League.\nWhile the 23-year-old’s contributions have declined since then, not helped by reoccurring injury issues, Palmer remains one of Chelsea’s best players and will likely be a key player for England at this summer’s World Cup.\nPalmer’s recent dip has led to speculation he could leave Stamford Bridge, with rivals Man City and Manchester United even tentatively linked with summer moves.\nThe Sun claimed Palmer was slightly unsettled at Chelsea and was missing Manchester, where he was born and raised.\nThose feelings have never been vocalised by the player, however, and The Telegraph have dismissed Chelsea’s stances of selling Palmer.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt is claimed Palmer is seen as ‘untouchable’ by the Stamford Bridge hierarchy alongside captain Reece James, influential midfielder Moises Caicedo and others.\nEarlier this week Paul Merson suggested Chelsea, who he supports, would be willing to sell Palmer if they received an offer of around £120m.\n‘Liam Rosenior is looking after Cole Palmer quite well. But when Palmer scored the penalty against Brentford last week, I thought his celebration was a bit strange,’ Merson wrote for Sportskeeda.\n‘Call me a cynic, but I noticed how he didn’t celebrate with his teammates or the fans. That was strange for me.\nChelsea must keep Palmer happy. But I’ve always said it, if some other club offers £120 million for Palmer, Chelsea will sell him. That is what Chelsea always do in the transfer market.\n‘I’m also not happy about Chelsea playing Palmer on the right. He needs to play as a no.10 with Moises Caicedo and Enzo Fernandez or Reece James behind him. Just give him a free role.\n‘When Palmer plays on the right, he’s too easy to pick up. We saw that when he went up against Antonee Robinson during the Fulham game. So why put him there?\n‘It will be interesting to see what happens with Palmer in the future amid rumours of a move away from Chelsea.’\nAfter Palmer was linked with a shock exit from Chelsea, ex-Blues captain Marcel Desailly said he feared he would hand in a transfer request.\n‘If Cole Palmer decides to move away from Chelsea then that’s his business, but I just want him to respect the club, because they are the ones who have given him the tools to become the player he is now,’ he said.\n‘I would love him to stay at Stamford Bridge because he’s got a key role in the team, even if Enzo Maresca used him in various positions.\n‘I believe Palmer wants more stability and a system that’s built for him, but he still needs to fully recover from his groin injury and get back to full fitness.\n‘His recent performances speak for themselves, so he needs to stay humble and come back into the team to help the club, regardless of whether he stays or goes.\nMore Trending\n‘The question is whether he feel like Chelsea are going to win the Premier League in the next two seasons. If he doesn’t, I’m sure he will ask for a transfer request to a club that will build a system around him.\n‘For now, however, he needs to hit his previous levels for Chelsea to help them and their new manager through this period.’\nPalmer has scored five goals in 13 appearances so far this season and is still waiting to register his first assist of the campaign.\nHe missed Chelsea’s narrow Champions League win over Pafos on Wednesday night with a niggle but is expected to return in Sunday’s Premier League clash against Crystal Palace.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arsenal 2-3 Man Utd: Dorgu and Cunha screamers harm Gunners title charge\nMORE: Why Cole Palmer misses Chelsea’s Premier League trip to Crystal Palace\nMORE: Next Liverpool manager odds as pressure mounts on Arne Slot",
  "word_count": 770,
  "scraped_at": "2026-02-14T01:53:15.582583",
  "_text_extracted": true
}