{
  "article_id": "6ad3970dd51a",
  "url": "https://www.90min.com/gareth-southgate-warning-jude-bellingham-champions-league-win",
  "title": "Gareth Southgate sends warning to Jude Bellingham after Champions League win",
  "date": "20240603T131500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gareth Southgate sends warning to Jude Bellingham after Champions League win\n- England to face Bosnia and Herzegovina in friendly on Monday without Jude Bellingham\n- Midfielder granted additional time away following Real Madrid's Champions League win\n- Gareth Southgate sends message to Bellingham ahead of Euro 2024\nBy Sean Walsh\nEngland boss Gareth Southgate has told Jude Bellingham that 'switching off and recovering' should be his priority ahead of Euro 2024.\nBellingham played a starring role in Real Madrid's Champions League triumph this season, which culminated in a 2-0 win against former side Borussia Dortmund in the final at Wembley on Saturday night.\nThe 20-year-old is now facing a quick turnaround to feature for England at this summer's European Championships - while the rest of his Three Lions teammates reconvened at their St George's Park training base last week.\nBut head coach Southgate has insisted Bellingham does not need to join up with the squad just yet and instead must focus on refreshing himself physically and mentally.\n\"It's not the most important thing [to be with the group],\" Southgate said at a press conference. \"The most important thing is rest and recovery and we will benefit from that.\n\"That is the constraint of international football. You have to work out the most important thing and for Jude, and therefore the team, it is psychologically switching off and recovering.\"\nBellingham played 42 games for Madrid during his debut season in the Spanish capital, scoring 23 goals and adding 13 assists over the course of a remarkable campaign.\nEngland take on Bosnia and Herzegovina in their first of two pre-tournament friendlies on Monday night at St James' Park.\nThey will then head down to Wembley to take on Iceland on Friday evening before Southgate trims his provisional squad of 33 players down to 26. Bellingham may not feature in either friendly but is a shoo-in to make the final cut regardless.\nEngland's first fixture of Euro 2024 comes on June 16 against Serbia in Gelsenkirchen. The Three Lions will also face Denmark on June 20 and Slovenia on June 25 to complete their group stage fixtures.",
  "word_count": 355,
  "scraped_at": "2026-02-14T02:10:54.436240",
  "_text_extracted": true
}