{
  "article_id": "6ad78689fd41",
  "url": "https://celtsarehere.com/celtic-duo-injury-latest-as-rodgers-speaks-out/",
  "title": "Celtic Duo Injury Latest As Rodgers Speaks Out",
  "date": "20250823T201500Z",
  "domain": "celtsarehere.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brendan Rodgers has said that both Auston Trusty and Adam Idah are still doubts for Tuesday night’s Champions League qualifier against Kairat in Kazakhstan.\nCeltic are due to fly out from Glasgow on Sunday morning at 10am, with Rodgers hoping for more clarity on both players before the flight. With the tie still 0-0 after the first leg, any missing players could make a tough away game even harder.\nTrusty has been a regular in defence in recent games, while Idah remains the team’s main striker. Both were absent at the weekend as Rodgers made changes to his line-up. Their return would be a big boost as Celtic try to reach the Champions League group stage for a fourth year in a row.\nAfter the match against Livingston, Rodgers gave a short but clear update on the fitness of the two players.\nHe said: (Celtic FC YouTube), “I’m not sure if Auston Trusty will make it.\n“Adam Idah, we’ll wait and see. But hopefully he’ll be available for the squad.”\nRodgers’ update shows the situation is still unclear with under two days to go before kick-off. Idah’s return would be a big boost, giving Celtic a proper target through the middle, something they lacked in the first leg when they struggled to create clear chances.\nThe Irishman will want to bring his strongest squad possible to Kazakhstan, especially with the long travel and the importance of the match. Having more options in defence and attack could be key to getting the result.\nCeltic looked sharper against Livingston, but Rodgers knows playing in Europe is a different challenge. Whether Trusty and Idah make it or not, Celtic will need a strong team performance to get through.\nThe squad is expected to be finalised early on Sunday before they fly east. For now, Rodgers and his coaches will keep checking on both players, hoping they can be fit in time to make the trip.",
  "word_count": 322,
  "scraped_at": "2026-02-14T02:11:49.085051",
  "_text_extracted": true
}