{
  "article_id": "6b08903012ae",
  "url": "https://www.90min.com/features/power-rankings-best-teams-in-europe-week-30-2023-24",
  "title": "Power Rankings : The best teams in Europe",
  "date": "20240525T053000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Power Rankings: The best teams in Europe - Week 30\n- Manchester City wrapped up the Premier League title for record fourth season in a row\n- Atalanta ended Bayer Leverkusen's unbeaten run with victory in Europa League final\n- The 10 best teams in Europe right now - ranked\nWith the Premier League and Ligue 1 wrapping up proceedings this past week, we're just one weekend shy of the 2023/24 season's final curtain.\nIn the second-to-last weekend of European football action of the season:\n- Man City won the Premier League.\n- Fenerbache stopped Galatasaray from winning the Turkish Super Lig.\n- Atalanta won the Europa League.\nAnd, after all of that fun, here's the 10 best football teams in Europe right now.\n10. Fenerbahce (new entry)\nIf you've been reading the Power Rankings in recent weeks, you'll know just how enamoured we had been with Galatasaray's frankly astonishing Super Lig form.\nAfter 17 wins in a row and accumulating 99 points however, their run finally came to an end at the hands of their arch rivals Fenerbahce.\nFener's win - secured by a 71st minute goal from Caglar Soyuncu - as well as ending Galatasaray's hot streak, also meant that they go into the final day of the season with a slither of hope of winning the Super Lig title.\n9. Brest (new entry)\nBrest will play UEFA Champions League football next season.\nThat is a sentence that no Ligue 1 aficionado would have ever thought they'd read.\nThe club who finished 14th in 2022/23 managed to secure third spot and a place in Europe's elite competition thanks to a combination of their 3-0 win over Toulouse and LOSC Lille's 2-2 draw with OGC Nice on the final day of the season.\n8. Chelsea (re-entry)\nThere was a brief moment at the start of the week when Chelsea fans looked at their form at the end of the 2023/24 season (five wins on the bounce), looked at the average of their squad, and thought: 'things are looking up'.\nThen the Blues decided to part ways with manager Mauricio Pochettino, and now they're back to square one again. Nice one Todd Boehly.\n7. Bayer Leverkusen (down 3)\nIt happened.\nIn their 52nd game of the season, it finally happened.\nBayer Leverkusen's hopes of completing a remarkable unbeaten treble-winning season were dashed in the Europa League final at the Aviva Stadium, with Atalanta trouncing Xabi Alonso's side 3-0 thanks to an Ademola Lookman hat-trick.\nThe defeat shouldn't put too much of a dampener on the season for Leverkusen fans though.\n6. Crystal Palace (new entry)\nWhen Eberechi Eze and Michael Olise are fit and firing, Crystal Palace are genuinely one of the best teams in the Premier League.\nIf you didn't watch their 5-0 thumping of Aston Villa on the final day of the season, that sounds hyperbolic.\nIf you did, it makes perfect sense.\n5. Bologna (-)\nBologna unfortunately won't be going into their first UEFA Champions League campaign in a lifetime with Thiago Motta at the helm, with the manager set to join Juventus.\nHowever, the fact that they've qualified for the UEFA Champions League at all is beyond remarkable.\nAn incredible achievement.\n4. Arsenal (down 1)\nIt didn't quite happen for Arsenal in the end up thanks to Manchester City's win over West Ham United on the final day, but unlike last season at least the 'bottlejob' tag won't be thrown around.\nThe Gunners did everything they possibly could win the title, it simply wasn't enough.\n3. Real Madrid (down 2)\nHaving secured the La Liga title a few weeks ago, Real Madrid have absolutely nothing to play for at the moment in Spain and it shows.\nCarlo Ancelotti's defence actually didn't even bother showing up for their most recent game, conceding four away to Villarreal as a result.\nYou can guarantee they will for the Champions League, though.\n2. Atalanta (re-entry)\nFor the first time in their history, the tiny town of Bergamo has possession of a European trophy.\nAtalanta, against all odds, managed to end Leverkusen's unbeaten run in emphatic fashion in the Europa League final, relying on a wonderful gameplan from Gian Piero Gasperini and an all-time great final performance from Lookman to do so.\n1. Man City (up 1)\nFor a record breaking fourth consecutive time, Manchester City are Premier League champions.\nThe Cityzens needed to win their remaining eight games of the season in order to do it, and inevitably, they did exactly that.\nThey now head into the FA Cup final on Saturday as heavy favourites to win a domestic double.",
  "word_count": 770,
  "scraped_at": "2026-02-14T02:05:12.744752",
  "_text_extracted": true
}