{
  "article_id": "6b1fd0f08f34",
  "url": "https://www.90min.com/features/man-city-4-0-newcastle-match-report-4-talking-points-cityzens-ease-past-magpies",
  "title": "Man City 4 - 0 Newcastle : Match report & 4 talking points as Cityzens ease past Magpies",
  "date": "20250215T211500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City 4-0 Newcastle: Match report & 4 talking points as Cityzens ease past Magpies\n- Man City beat Newcastle 4-0 at the Etihad on Saturday\n- Omar Marmoush treble inspired Cityzens to victory\n- Reigning champions rise to fourth in the standings\nOmar Marmoush produced a first-half hat-trick as Manchester City moved into the top four of the Premier League following their 4-0 win over Newcastle United on Saturday afternoon.\nThe £59m winter signing dazzled the Etihad Stadium with his 14-minute triple before the break, three clinical finishes downing the out-of-sorts Magpies. Pep Guardiola would not have expected such a comfortable opening period following his side's recent struggles, but Newcastle laid down the red carpet for the reigning Premier League champions.\nA late injury to Erling Haaland somewhat marred an impressive triumph for the Cityzens, who netted their fourth in the closing stages as James McAtee wrapped up a straightforward second half for the Manchester club.\nHow the game unfolded\nFollowing Chelsea's Friday night defeat on the south coast, Saturday's victor knew they would leapfrog the Blues and finish the weekend perched inside the Champions League qualification spots. Such a prize evidently spurred City on during the early stages as they dominated possession - even if it was a direct approach that forged the opener.\nEderson justifiably received criticism for his error against Real Madrid during the week but the Brazilian showcased his greatest strength in the 19th minute. An excellent floated through-ball over the top of the Newcastle defence was misjudged by Kieran Trippier, allowing Marmoush to race clean through and lift over the helpless Martin Dubravka.\nThe visitors had looked surprisingly apathetic by the midway point of the first half and City quickly doubled their lead to take full advantage. Some uncharacteristically half-hearted defending allowed Ilkay Gundogan to stride into the final third and release Marmoush, who cut inside before beating Dubravka at his near post.\nAn excellent last-ditch challenge from Dan Burn denied the hosts from pulling further clear but Newcastle's respite lasted just four minutes. Marmoush completed his hat-trick just after the half-hour mark as City tore their visitors apart, the Egyptian rifling Savinho's accurate delivery home from close range.\nNewcastle turned to their bench at the start of the second half but the introduction of Lewis Miley and Tino Livramento did little to turn the tide. As we have grown accustomed to witnessing in recent seasons, City were masters at taking the sting out of proceedings to protect their cushion.\nJust to ensure there would be no late nerves, City netted a fourth in the 84th minute to put the icing on the cake. Haaland, who later left the field following a concerning knee injury, set up McAtee with his near-post flick as City eased to an impressive victory.\nPlayer ratings\nCheck out the player ratings for Man City vs Newcastle here.\nMan City make light work of tough opposition\nThere were justifiable expectations that City would struggle this weekend, especially with their Champions League play-off second leg on the horizon. But they showed no signs of floundering at the Etihad against a side who had just beaten Arsenal 4-0 across two matches in the Carabao Cup semi-finals.\nNewcastle made life easy for their gracious hosts but there were glimpses of the devastating City of old as they overpowered Eddie Howe's side with their intensity and ruthlessness in the final third. Few sides make a mockery of the Magpies, but the Cityzens did exactly that during the first half.\nThe second half was City at their best in many ways, strangling the life out of the encounter with passing triangles and slowing the tempo within an inch of its life. It wasn't a great spectacle but it was the kind of game-management that has made them England's best for so many years.\nOmar Marmoush announces himself to the Etihad\nThere were question marks over the necessity of recruiting Marmoush from Eintracht Frankfurt for big money during January. The 26-year-old enjoyed a sensational first half of the campaign in Germany, but was such form sustainable? Or even transferrable to English football?\nWell, the winger-cum-striker's first-half display answered those questions emphatically.\nCity made a lightning quick start at the Etihad and were buoyed by the energy and speed of their two wide players. Both Marmoush and Savinho provided the thrust that has often been lacking this season, with the former stealing the show after three impressive strikes - all from an xG total of just 0.59.\nThe first showcased his composure as he lobbed over Dubravka before powerful lashes beyond the Slovakian offered City supporters a glimpse of the Egyptian's technique and ball-striking capabilities. The home crowd will have been enamoured by what they witnessed from their new acquisition, who hasn't taken long to discover his mojo in Manchester.\nErling Haaland's injury concern\nJust as City looked to be seeing out the perfect afternoon in second gear, the Etihad fell silent as Haaland hit the deck. While chasing down Newcastle's backline, the Norwegian unceremoniously buckled under his own weight, seemingly twisting his knee in the process.\nOf course, the severity of the injury remains unknown for now, but Haaland was at least able to wander off the pitch without medical support. That's a positive sign, one would imagine, but Guardiola's frantic pacing of the touchline told its own story.\nWhile Haaland is never the most involved City player in any given match, he's still the difference-maker. That was evident last Tuesday as he bagged a brace against Madrid in the Champions League.\nGuardiola and all those inside the Etihad will now be left sweating over his fitness, hoping that there is no lengthy layoff to come for their pivotal sharpshooter.\nNewcastle's Premier League struggles continue\nHaving been racing towards a top-four berth after an upturn in results, Newcastle have come crashing back down to earth in recent Premier League outings. They have enjoyed themselves in the cup competitions, but their defeat at the Etihad marks three league losses in four.\nThere is no shame in losing to City - especially on the road - but it makes for concerning viewing when added to underwhelming home defeats to Bournemouth and Fulham. Has Newcastle's Carabao Cup push perhaps sucked the life out of their bid for Champions League qualification?\nOnly time will truly tell but meetings with Nottingham Forest and Liverpool in their next two promise to test their credentials. Should the Magpies fail to win either duel, a return to Europe's premier competition would look increasingly improbable.",
  "word_count": 1090,
  "scraped_at": "2026-02-14T02:08:52.953300",
  "_text_extracted": true
}