{
  "article_id": "6b2ad7f4fbb9",
  "url": "https://www.90min.com/sir-jim-ratcliffe-what-man-utd-must-copy-real-madrid-success",
  "title": "Sir Jim Ratcliffe reveals what Man Utd must copy from Real Madrid for success",
  "date": "20240621T140000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sir Jim Ratcliffe reveals what Man Utd must copy from Real Madrid for success\n- Ratcliffe completed investment into Man Utd during the 2023/24 season\n- Red Devils won FA Cup but won't play in the Champions League in 2024/25\n- Co-owner reveals how United can start competing with Madrid at the top of European football\nManchester United co-owner Sir Jim Ratcliffe says the club must take inspiration from Real Madrid's approach in the transfer market as he plots to re-establish them as one of the best teams in Europe.\nThe INEOS founder completed his investment at Old Trafford during the 2023/24 campaign and led a post-season review which eventually confirmed Erik ten Hag's position as manager following the Red Devils' FA Cup triumph.\nHowever, United are without Champions League football despite picking up a second piece of silverware under the Dutchman and Ratcliffe admitted he is looking to raise standards to the point where they are rubbing shoulders with current European champions Madrid on a regular basis.\nSpeaking to Bloomberg, he said: \"There's room for improvement everywhere we look at Manchester United, and we will improve everything.\n\"We want to be competing for the Premiership every year and the Champions League every year. That's where we need to be, where Real Madrid is today, but it'll take time.\n\"I think Real Madrid have done a fabulous job. There's an interesting statistic. If you look at the 10 seasons since Sir Alex Ferguson and David Gill left. Manchester United's net spend on players is £1.1bn. United have not been mean with the chequebook. Real Madrid's over the same time is £200m, which is surprising when you hear that, because today they have a squad where six or seven players are valued at more than €100m and Manchester United don't have any.\n\"And Real Madrid have probably built the finest football stadium in the world using the same chequebook.\"\nLos Blancos have still made some big splashes in the transfer market despite their inferior net spend to United, with Jude Bellingham arriving last summer for an initial £88.5m. Their investments in Brazilian stars Vinicius Junior have paid off hugely, while Federico Valverde joined as a teenager in 2016 and is now one of the best central midfielders in the world.\nMadrid also sold Casemiro and Raphael Varane to United for significant fees, opening up the pathway for their younger stars to establish themselves in the first team.\nFrance captain Kylian Mbappe and Brazil prodigy Endrick will sign for the Bernabeu club this summer, strengthening an already-glistening squad after Carlo Ancelotti's side completed a La Liga and Champions League double.",
  "word_count": 438,
  "scraped_at": "2026-02-14T01:57:18.887738",
  "_text_extracted": true
}