{
  "article_id": "6b35e1e24209",
  "url": "https://www.justarsenal.com/bernardo-silva-says-man-citys-win-at-the-emirates-was-the-pivotal-game-in-in-treble-chase/341798",
  "title": "Bernardo Silva says Man City win at the Emirates was the pivotal game in Treble chase",
  "date": "20230610T120000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City is a game away from winning the famous Treble that only Manchester United, in English football, has managed to lift; they did so in 1999.\nAs a Gooner, I doubt you are eager to see Guardiola and his team enjoy that success. Even so, much has been said about how City found themselves where they are; a game away from completing the treble, but the big question is who had the best shot of stopping them.\nManchester United and Arsenal had the chance to deny the Citizens the chance to lift the treble. Still, of the two, not disrespecting United’s progress last season, only Arsenal had what it took to stop City’s dream. Man United’s way of stopping their City rivals was by beating them in the FA Cup final. But is there anyone who expected United, whom City had beaten 6-3 in the league, to beat Man City in their top form?\nArsenal, on the other hand, if they didn’t lose concentration towards the end of the season, had the best shot of denying City lifting the league title. You and I would agree that Arteta and his boys were the better side last season, and if only they hadn’t lost their momentum, they’d have won the league easily.\nBernardo Silva pinpoints Man City’s win over Arsenal, beating the Gunners by 3 goals to 1 at the Emirates back in February, as the birth of their desire to win the treble. He admitted as quoted by MEN, “And I think, especially after the World Cup, there was a moment of reflection, and even after coming back at first, those first games weren’t easy, but the away win over Arsenal was very important.\n“It made us believe again that we can win important matches,” he said of the Emirates win. “And in the moment that we won over Arsenal at home, it was approximately at the same time when we knocked out Bayern Munich from the Champions League; it ended up being a very important moment.\n“Because we got first place in the Premier League and got to the semi-finals by eliminating one of the best teams in the world. And so we got to the last month of the season, knowing it would be very difficult, but we thought, ‘We’re fighting for all of these trophies, except for the League Cup; let’s go for it and give it our best. Whatever happens, happens.”\nOnly Inter Milan now has the chance to stop the treble going to the Etihad, but can anyone stop Man City’s Treble charge’\nDaniel O\nJust Arsenal Show – Alfie and Rob are back for the summer! Here they predict every single Arsenal incoming and outgoing this summer, including fees and potential destinations for outgoings.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 485,
  "scraped_at": "2026-02-14T02:07:02.897996",
  "_text_extracted": true
}