{
  "article_id": "6b350f910294",
  "url": "https://www.caughtoffside.com/2024/04/21/chelsea-mauricio-pochettino/",
  "title": "  The potential and quality is there  – Chelsea manager optimistic for future",
  "date": "20240421T233000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Following a gut-wrenching defeat in the FA Cup semi-final against Manchester City on Saturday, Chelsea manager Mauricio Pochettino is rallying his troops to respond with resilience and determination.\nDespite a valiant effort in the semi final against last season’s treble winners Manchester City, Chelsea fell short, with missed opportunities haunting them in the aftermath of their Wembley clash.\nPochettino draws inspiration from their semi-final opponents, Manchester City, who faced their own setback after a grueling Champions League exit to Real Madrid.\nDespite the disappointment, Pochettino acknowledges the need to swiftly move on, echoing the resilient spirit demonstrated by City. “In football, you cannot stop to start to suffer or to think of negative things,” he emphasised, highlighting the importance of bouncing back swiftly in the face of adversity.\nMauricio Pochettino issues frustration over Chelsea’s inconsistency\nThe Argentine tactician reflects on Chelsea’s rollercoaster season, where they have displayed flashes of brilliance against top-tier teams but faltered against supposedly lesser opponents. This inconsistency has been a source of frustration, prompting Pochettino to stress the importance of maturity and consistency within the squad.\nHe acknowledges the quality and potential within his team but emphasises the need for sustained performance throughout the season.\nPochettino stated in his press conference after the City game: “The potential and the quality is there. We need to see in the way they evolve and the level we can get to. At the moment, we showed we are ready to compete but we need to be more consistent in the whole season. That is the most important thing.”\nLooking ahead, Pochettino remains optimistic about Chelsea’s prospects, with an upcoming fixture against Arsenal providing an opportunity for redemption. The manager hopes that his players will channel their disappointment into motivation against their rivals.",
  "word_count": 293,
  "scraped_at": "2026-02-14T02:07:51.322026",
  "_text_extracted": true
}