{
  "article_id": "6b49a6e17f55",
  "url": "https://www.teamtalk.com/news/tottenham-urged-complete-unbelievable-hijack-arsenal-signing-turn-north-london-rivalry-around",
  "title": "Tottenham urged to complete unbelievable hijack of priority Arsenal signing to turn North London rivalry on its head",
  "date": "20230430T214500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham urged to complete unbelievable hijack of priority Arsenal signing to turn North London rivalry on its head\nTottenham have been told to stun Arsenal by signing one of Mikel Arteta’s main summer transfer targets, in a move which would help Daniel Levy’s side close the gap on their rivals and potentially get the better of them.\nTottenham were involved in an incredible seven-goal thriller on Sunday afternoon as they lost 4-3 to Liverpool at Anfield. They did exceptionally well to pull the game back to 3-3 after conceding three times in the first 15 minutes.\nRicharlison chose the perfect time to score his first Premier League goal for Tottenham by heading past Alisson in second-half stoppage time to make it 3-3.\nIncredibly though, Spurs still managed to throw the point away as Lucas Moura accidentally set up Diogo Jota for Liverpool’s winner.\nIt was another big twist in Spurs’ eventful season. They have already parted company with Antonio Conte after he slammed pretty much everyone involved with the club, while also sacking his interim replacement Cristian Stellini after just four matches.\nRyan Mason has been placed in caretaker charge for the second time, having previously done so following Jose Mourinho’s exit in 2021.\nWhen analysing Spurs’ dramatic loss to Liverpool, Jamie Redknapp named the one player the team needs to reach the next level – Arsenal target Declan Rice.\n“Declan Rice is available, Arsenal are in the mix. Why can’t Spurs be in the mix? That’s the sort of level of player they need to be trying to acquire. That’s what they should be doing right now, but I just don’t think that’ll happen,” the pundit said on Sky Sports (30/04 at 19:20).\nCould Tottenham get to Declan Rice before Arsenal?\nRice has been heavily linked with Arsenal in recent months. The midfielder has refused to pen a new West Ham contract, and with his current deal expiring in 2024, the Hammers may be forced into selling him this summer.\nArsenal have been alerted to the situation and various sources have put them at the front of the queue to sign Rice. Although, a recent report in The Sun has suggested Arsenal might prioritise a cheaper midfield arrival so they can improve the defence.\nIt would be a big shock if Spurs managed to land Rice ahead of Arsenal. The England international wants to play Champions League football when leaving West Ham, and Arsenal are far more likely to be able to offer him this than Spurs.\nNevertheless, Redknapp is correct. That is the kind of calibre of player Spurs chairman Daniel Levy should be targeting if the club is to end its trophy drought.\nRedknapp went on to discuss the search for a new head coach, urging Mason to find another club rather than push for the job on a permanent basis.\n“In terms of management, I think they’ve had 14 different managers in 22 years under Daniel Levy. That’s too many. Too much of a turnover, you get a chance, things go wrong then you get fired,” Redknapp added.\n“Ryan Mason’s had two goes. I think he needs to cut his teeth at a lower level. There’s no reason he can’t become a top manager but he’s not right [for Spurs]. Nagelsmann’s an option, Brendan Rodgers has had a mention.”\nSpurs hero tells Levy to re-appoint coach\nFormer Spurs striker Robbie Keane was sat alongside Redknapp on Sky Sports’ coverage of the game. When asked about Spurs potentially re-appointing Mauricio Pochettino, Keane said: “The Spurs fans absolutely love him, the way he played football, they got to a Champions League final.\n“I think Brendan Rodgers could bring stability to the club, the way he plays the game.”\nOn whether the new boss should change the team’s style, Keane continued: “I don’t like the five at the back, three at the back, whatever you want to call it. I like 4-3-3 or 4-4-2. I think that’s the Tottenham we’ve seen over the years.\n“Ryan has to play this system [three at the back] because of the personnel that they have. Graeme [Souness] said earlier on about Liverpool getting a midfield player, the question is who do Tottenham need? A midfielder, centre-backs, if Harry [Kane] goes in the summer then they have to get a new striker.\n“Graeme is right, it’s the recruitment. This summer is a big, big summer for them.”\nRedknapp responded: “You’ve got to have a manager though first. It’s the manager, you’ve got to get someone in place.”",
  "word_count": 753,
  "scraped_at": "2026-02-14T01:50:29.458611",
  "_text_extracted": true
}