{
  "article_id": "6b55e36c1f48",
  "url": "https://www.nytimes.com/athletic/5701869/2024/08/16/manchester-city-premier-league-charges-season/",
  "title": "Manchester City , the Premier League and the season everything might change",
  "date": "20240817T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to the season when everything might change, or nothing might change, for the most popular football league on the planet. In the coming months, the hearing against Manchester City for their 115 alleged breaches of Premier League regulations will begin and a verdict is expected before the end of the campaign.\nAdvertisement\nOn Tuesday, in a season-opening interview with journalists, the Premier League’s chief executive, Richard Masters, insisted the competition organisers “actually have a pretty good working, operating relationship” with Manchester City. Yet that is a polite veil over an increasingly peculiar and toxic landscape for English football in which City, who have won four Premier League titles in a row, were “surprised” to find themselves accused by the Premier League of having cheated their way to the summit.\nThis summer, during numerous conversations with owners and executives who work or have worked within the Premier League, many speaking anonymously to protect relationships, the divergence of opinions and expectations has been revealing. The matter has been discussed informally between ownership groups within the Premier League and it is the subject of gossip in matchday boardrooms. Naturally, they speculate.\nSome are so worn down by the decade-long pursuit of City that they fear Manchester City’s case may result in a financial settlement rather than a sporting penalty. Then some rival executives consider this outcome to be impossible and utterly outrageous, and say it would cast the death knell for financial sustainability not only within the English game but across European football.\nAs one Premier League club executive says: “The collective view I’ve heard is that an appropriate sanction would have to be a points deduction so substantial — we are talking here between 70 and 80 points — that it guarantees City a season in the Championship.”\nAnother of the sport’s leading figures suggests the punishment ought to be more creative, that many points could be deducted from City in each of the next three seasons, meaning the club’s chance of Champions League qualification would be severely restricted. Another compares the City case to that of the English rugby union side Saracens who, when Premiership champions in 2019, were deducted 35 points, hit with a £5.36million ($6.9m at current rates) fine and relegated to the second division owing to non-compliance with the league’s salary-cap rules.\nAdvertisement\nA coach who came up against City has simply made his mind up about their guilt and argues they have not achieved their success with the same level of discipline as their rivals, but suspects it is too late now to truly remedy the matter. At the same time, there are fears that a failure to convict and punish City poses major questions about the Premier League’s ability to run itself, particularly with the prospect of an independent regulator still looming next year. Numerous club executives say their incentives to follow the rules would be greatly diminished if the Premier League proves toothless on City.\nAt this point, we should remember that Manchester City are contesting the charges. Upon learning of their alleged breaches in February 2023, City said they were “surprised” by the development. They also said they have a “comprehensive body of irrefutable evidence in support of its position” and added that they “looked forward to the matter being put to rest once and for all”. The alleged breaches are extensive and serious, relating to a period between 2009 and 2018 in which City won three Premier League titles and emerged as one of Europe’s strongest teams, as well as hiring Pep Guardiola, the most in-demand coach in world football, to lead the club from 2016.\nCity stand accused of failing to provide accurate financial information, “in particular with respect to its revenue (including sponsorship revenue)”; failing to disclose managerial payments during the Italian coach Roberto Mancini’s time at the club between 2009 and 2013; and breaching Premier League rules on profit and sustainability (PSR) between 2015 and 2018. The Premier League also argued City did not comply with UEFA — European football’s governing body — regulations around financial fair play in 2013-14 and between 2014-15 and 2017-18. The Premier League also claimed City did not cooperate fully with investigations in “the utmost good faith”.\nCity have been down this road before. They were banned from European competitions for two years by UEFA for alleged breaches of financial regulations in February 2020. Yet the sanction was overturned by the Court of Arbitration for Sport (CAS) in July of the same year when the court ruled “most of the alleged breaches were either not established or time-barred (outside of the organisation’s five-year statute of limitations)”. City were fined €10million (£8.6m; $11m) for not cooperating with the investigation.\nIn English football, nobody is prepared to put their name to quotes about the City case. That is not the same for La Liga president Javier Tebas, who has been a longstanding critic of the impact of clubs linked to nation-states. City always insist they are not owned by the state of the United Arab Emirates (UAE), but Sheikh Mansour bin Zayed Al Nahyan is the deputy prime minister of the UAE and the minister of presidential affairs. He is the majority shareholder in City via Newton Investment and Development, a company he wholly owns and which is registered in Abu Dhabi.\nAdvertisement\nTebas tells The Athletic: “It is difficult for me to say what is proportionate in England because I don’t know so well the English rules and law. But I can refer to what happened at UEFA… then what happened at CAS — in a resolution I would describe as a joke — is they took the sanction away. It was a very controversial decision to take away that sanction. Now, let’s see, I won’t dare to predict, but I am aware that there is a lot of concern among many clubs in the Premier League about what happens with City. What happens with Man City is a before and after moment for the Premier League itself.”\nThe important thing to remember here is that the view of Tebas, or the many clubs in the Premier League to which he refers, will not be a factor in the final verdict. The Premier League has accused City of 115 alleged breaches, but the matter is now referred to a three-person independent commission for assessment. They are not known to the public but have been chosen by Murray Rosen KC, the barrister who is the head of the Premier League’s independent judicial panel.\nA seasoned Premier League executive explains: “It is not the clubs that are prosecuting Manchester City. Unlike the American system, the clubs do not sit around in judgment of each other. They don’t decide whether to approve a new owner or not, like some American leagues. If you’ve got a case to answer, you’re going to have your day in front of an independent commission.”\nWhile clubs will not have an input on the independent commission, The Athletic has previously reported how, in the years leading up to City being charged, rival clubs at both ownership and chief executive level would seek to impress onto the Premier League the need for progress on that matter. Sometimes it would be informal phone conversations, while legal letters and requests for information would also be sent. Very occasionally, clubs would seek an update within shareholders’ meetings, but for the most part, this became a topic executives pretended did not exist when sat together around the boardroom table.\nWhenever they did ask for updates, clubs would be told by the Premier League that the case remained under investigation and nothing further could be said. Journalists have received the same answer. From a governance perspective, therefore, City’s rivals are powerless on this matter, reduced merely to lobbying around the edges. The pressure came more often from the top of the Premier League table, where bigger clubs argued to the Premier League hierarchy that they would have won more trophies if City had acted differently.\nYet over time, that anger has filtered across the division. When City sought to appeal against their UEFA ban from the Champions League at CAS, nine Premier League clubs wrote to express their objection to City’s sanction being suspended while they appealed. Some clubs then placed in the top half of the table opportunistically spied a place in European competition if City were out of the picture.\nGO DEEPER\nMan City charges: What do rival clubs make of the Premier League's accusations?\nOthers across the Premier League do appear to genuinely believe the sport will be healthier if a firm deterrent is in place for financial regulations, while some clubs believe it is implausible, not least in terms of the optics for the Premier League, that City could evade punishment after Nottingham Forest and Everton received points deductions for financial breaches during the previous season.\nGO DEEPER\nMan City charges explained: The accusations, possible punishments and what happens next\n“There is no happy alternative to enforcing the rules, which everyone has agreed at the beginning of each season,” Masters told Sky Sports News this week. “They have looked each other in the eye and shaken each other’s hand and said ‘We will abide by these rules’. So the Premier League has to enforce rules.”\nAdvertisement\nThere is also the question as to whether any political attempts have been made to exert pressure on the Premier League. Last year, the UK government admitted its embassy in Abu Dhabi and the Foreign Commonwealth & Development Office (FCDO) in London have discussed the charges levelled at Manchester City by the Premier League, but refused to disclose the correspondence. In response to a Freedom of Information request made by The Athletic, the government said it would risk the UK’s relationship with the UAE to do so. Manchester City did not comment when told about the existence of the correspondence and the Premier League declined to say whether it has received any correspondence from the UK government in relation to the matter.\nThe Athletic has previously detailed extensive official correspondence demonstrating a desire to impress the interests of the UK government on the Premier League, which has always denied it has been influenced in any way. There is no evidence to say the UAE government has made representations. Asked this week if the Premier League has ever felt pressure from foreign governments, Masters said: “Never, of any flavour or description. It just doesn’t happen.”\nFor the independent commission, there are reams of material to sort through. This all began when emails and documents emerged from Football Leaks and were published by German newspaper Der Spiegel in 2018. Those prosecuting City would claim the documents appeared to show City bypassing financial rules within football by disguising state investment as sponsorship revenues. City have always refused to comment on any of the German newspaper’s revelations because they say the leaks were “criminally obtained”.\nDuring the hearing, both sides will be able to request the presence of any participants from the club or Premier League during the period in question. This may even extend to the Premier League calling upon Sheikh Mansour himself, but nobody can be compelled to attend the hearing. It would be a surprise if Mansour, as the deputy prime minister of the UAE, was to put himself in that position.\nThe same may be true of City chairman Khaldoon Al Mubarak. He is also the CEO of the $300billion Abu Dhabi Mubadala wealth fund — which owns some of City’s sponsors — as well as the chairman of the Abu Dhabi Executive Affairs Authority, which is described as a specialised government agency mandated to provide strategic policy advice to the Crown Prince Sheikh Mohamed. As such, several sources close to the Premier League suggested it would be unlikely that any figure directly linked to the state in the UAE would place their reputation on the line at a Premier League commission.\nThe more likely scenario is that figures who have worked solely for City would attend the autumn hearing. Both sides have started preparing for cross-examination of witnesses, as to be expected with such an important hearing drawing near. One witness who had already been spoken to by City’s lawyers described the process as “hardcore”, “aggressive”, and “no-holds-barred”.\nWhen it comes to making a decision, executives spoken to by The Athletic expect the commission to consider the offences in two parts. It will focus on the material alleged breaches, which could bring the most substantive penalties if City are found guilty, but then also the matter of alleged non-cooperation. Every person spoken to by The Athletic for this article said they expect City will face punishment for failing to cooperate, having previously received a fine for this from UEFA. The question is whether the commission judges non-cooperation to be worthy of a sporting penalty or merely a slap on the wrist.\nAdvertisement\nThese executives point out the contradiction in City’s public statement, where they said they welcomed the chance to present their irrefutable evidence but, at the same time, the Premier League charges include allegations that the club obstructed the investigation. City, for example, headed to court to question the league’s jurisdiction to investigate it and then once more, this time with the Premier League, to prevent any details from becoming public.\nLord Justice Stephen Males, a High Court judge who heard the latter case, wrote in his 2021 judgment: “This is an investigation which commenced in December 2018. It is surprising, and a matter of legitimate public concern, that so little progress has been made after two-and-a-half years — during which, it may be noted, the club has twice been crowned as Premier League champions.” Twice has now become five.\nThis is where the suggestion of a settlement between the Premier League and City appears to become less likely. “There’s been plenty of opportunity for settlements in the past, which hasn’t happened,” says one executive familiar with the case. “Either party can at any time effectively take it out of the court and have a conversation without prejudice to say we’ll have a settlement. But the further you go, the less likely that is.\n“But the scale of this is so large that it’s really difficult to have a negotiated settlement. What are you going to settle on? A fine? A small number of points? Look at Forest and Everton. You can’t do that. This is of a scale both in terms of time, depth and severity of charges that is completely off the scale of the others.”\nThe desire for a settlement would need to come from City, too, and the biggest clue towards their approach came within one of City’s most infamous leaked emails when a leading City lawyer wrote that Al Mubarak, the club chairman, had said that “he would rather spend 30million on the 50 best lawyers in the world to sue them for the next 10 years” than agree to any financial settlement or penalty from UEFA amid the previous case.\nOne Premier League executive says there is a feeling within the league’s HQ that City have simply “taken the p***” since receiving their first letter from the Premier League on the matter in 2018. This person argues that if City accepted some fault from the outset, they may have taken a substantially smaller punishment than the one which could now be imposed. “They wouldn’t have been relegated, but they have now dug themselves into the massive hole. And it’s either a massive leap that gets them out scot-free or a massive sanction. It is a Hail Mary.”\nThe implications of the City case reach far and wide. The Premier League is a phenomenal global success that now drives more in international television revenue than it does from its domestic deal. In the United States, the Premier League’s $450million-per-season deal with NBC dwarfs that of La Liga’s $175m package with ESPN, or Bundesliga’s $30m deal with ESPN. During an interview earlier this summer, The Athletic asked Jon Miller, NBC’s President, Acquisitions and Partnerships, whether the investigations not only into City but also Everton, Nottingham Forest and Chelsea in any way impacted the value of the Premier League.\nAdvertisement\nMiller said: “It doesn’t question the value at all. What it says to me is that the people who are leading the Premier League very much are hands-on and they’re going to enforce their rules. It’s important that the league has got their hands around this and they’re not afraid to impose discipline where they think it’s needed.\n“I actually applaud them for the stance they’re taking, even if it might move a team into a relegation zone or out of a Champions League or Europa League place. I would rather make sure the league is run on a fair basis, that everybody plays by the same rules.”\nThe challenge for the Premier League now is not only with regards to their own case against City but also that City have launched their own legal action against the Premier League, seeking to obliterate the rules, strengthened in 2021, that insist sponsorship deals must be independently assessed to be of fair market value within the competition. The aim was to prevent clubs from being able to receive funds through artificially inflated sponsorship deals linked to a club’s ownership or inflated deals between teams in a multi-club ownership group.\nThe Times reported in June that City claimed they were the victims of “discrimination” within a 165-page legal document, stating that a “tyranny of the majority” of teams across the league had ganged up on them to implement rules aimed at preventing their success. A verdict on this matter is expected within the next month and, should City have success, it may also undermine a central plank of the Premier League’s broader case against the club because allegedly inflated sponsorship deals linked to Abu Dhabi are among the alleged breaches.\nThe Premier League and City have indicated they intend to appeal against the decision if it goes against them in relation to these associated party transactions, according to people close to both parties.\nAn experienced football arbitrator sees it like this: “What’s really going on here is that (City) have invoked the dispute resolution proceedings in the covenant with the Premier League. In invoking the dispute resolution proceedings, it gets them into a room with the Premier League on their terms before the November hearing, which is the substantive hearing to determine whether they’re in breach of the 115 charges.\n“So it’s a mechanism by which their KCs can eyeball Premier League KCs and effectively say to the Premier League, ‘We are prepared to take you down if you go forward with what you’re planning to do, then we’re going to have a damages claim against you of hundreds of millions, which you can’t afford. We’ll tie you up in litigation for the next five or 10 years and we will take you down’.\nAdvertisement\n“It’s an aggressive litigation tactic and they’ve done it for a reason. Their owners will have needed to sign off on this. It’s not lawyers — the lawyers are merely only ever a conduit. They’re an agent for their client and so it is fascinating — I think they’re trying to provoke a rupture in the English game.”\nCity, it should be said, are not alone in having concerns about the policing of associated party transactions. When the Premier League voted to toughen up the regulations in February, six clubs voted against the move and two abstained, meaning the vote could be passed via the narrowest of margins with a two-third majority secured by 12 votes in favour.\nCity’s rivals, whether rationally or otherwise, fear that legal success for City would only be the start of attempts to destabilise the competitive balance of the English game. “They worry that it will lead to City and Newcastle (owned by the Saudi Public Investment Fund) dumping a billion every summer; that’s the fear, that it blows the house down on financial sustainability across the whole of Europe,” says one European football executive.\nAs the Premier League pursues City and City sue the Premier League, another subplot emerged this week. The Times reported that some of City’s rivals are considering compensation claims for loss of earnings — whether by not winning titles or failing to qualify for European competition — as a result of City’s dominance over the past decade. A source familiar with the hierarchy of multiple Premier League clubs argued it is unrealistic to expect legal success in this area because even teams with lower wage bills and inferior players can sometimes achieve more than may be expected. “It’s not like it is match-fixing where they have paid the referee or something. It’s too remotely related to the outcome of the match,” they said.\nClubs will largely be left hoping that the Premier League’s independent commission serves up satisfactory justice. The Premier League handbook allows for any kind of punishment, ranging from reprimands to fines, points deductions or even expulsion from the Premier League.\nCity are already facing uncertainty ahead of next summer, when manager Guardiola’s contract is due to expire. He is said to be torn over his future at this stage, regardless of the charges. He has often spoken in support of his club’s defence.\nIn May 2022, Guardiola said: “Why did I defend the club and the people? It’s because I work with them. When they are accused of something I ask them: ‘Tell me about that.’ They explain and I believe them. I said to them: ‘If you lie to me, the day after I am not here. I will be out and I will not be your friend any more. I put my faith in you because I believe you 100 per cent from day one and I defend the club because of that.’\nAdvertisement\nTebas, La Liga’s president, concludes: “The path the Premier League is taking now is important, after many years in which we have not seen proceedings against their own clubs for financial fair play issues. The path they are trying to take is very important for all of European football.\n“The Premier League’s economic sustainability is very important so that there is no inflation in salaries in the rest of Europe due to inflationary policies with money from outside of football (via state money). The result of Manchester City is important. I insist, there is a lot of concern within the Premier League teams. Without knowing the ins and outs of the charges, I do know something, which is that many clubs expect a sanction to be imposed.”\nAdditional reporting: Jacob Whitehead\n(Top photo: Getty; Sebastian Frej/MB Media, Naomi Baker, Robbie Jay Barratt – AMA; design: Dan Goldfarb)",
  "word_count": 3804,
  "scraped_at": "2026-02-14T02:10:58.957006",
  "_text_extracted": true
}