{
  "article_id": "6b622df7888c",
  "url": "https://www.themag.co.uk/2023/06/manchester-city-had-the-stars-aligned-well-done-to-them-i-say-newcastle-united/",
  "title": "Manchester City had the stars aligned - Well done to them I say",
  "date": "20230611T064500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City had the stars aligned – Well done to them I say\nWell, Pep Guardiola and his all conquering Manchester City team did it.\nA Premier League, FA Cup and European Champions League treble.\nInternazionale proved a tougher nut to crack than most people thought last night, but I believe that the stars were aligned, Manchester City weren’t to be denied.\nWell done to them I say.\nA well known Youtuber and occasional radio talkshow host from Nottingham, let himself down in the immediate aftermath of the Manchester City victory.\nObviously rankled by his ‘Salfords’ 1999 achievement being emulated, he decided to p.., on City’s parade.\n“What’s Grealish crying for.”\n“Why is Rodri on his hands and knees.”\n“They haven’t won it with Villa or some team in Spain.”\n“They have won it with a club that has literally bought it.”\nHe reiterated that it was all bought by Manchester City, deeming it worthless, before closing down his livestream in the huff.\nI would argue that Manchester City treble is actually more impressive than Manchester United’s back in the day.\nMan Utd got extremely lucky back in 1999.\nIn the FA Cup semi-final against Arsenal, the Gunners were awarded a late penalty.\nDennis ‘Beavis’ Bergkamp, who never was very good at penalties, fluffed his lines again and Schmeichel saved.\nMan Utd went on to win in extra-time with that Ryan Giggs ‘wonder’ goal, where the ball kept bobbling over every Arsenal defender’s outstretched legs.\nMan Utd then met an uninspired Newcastle United under Ruud Gullit in the final, they really only had to turn up.\nIn the Champions League a few days later, Man Utd were second best for 90 minutes against Bayern Munich.\nWith them trailing 1-0 the game went into added-time (Fergie time), and Teddy Sheringham squeezed in an equaliser after a scramble in the box.\nWe all thought that was it and that extra-time was looming, but the world’s finest referee, Pierluigi Collina inexplicably added on an extra minute and we all know what then happened.\nFair enough, everyone would love a bit of luck like Man Utd always seem to get, but there has been nothing lucky about Manchester City’s treble this season.\nThey even beat their neighbours in the first all-Manchester FA Cup final to do it with extra aplomb.\nThe money argument that many Salfords fans point to, with regards to City’s success, also doesn’t stand up to scrutiny.\nManchester United’s net spend in the last decade outweighs Manchester City’s.\nMan Utd have always been a big spending / money club down the years.\nIn the late 1970s / early 80s they spent about £5 Million combined on Gordon McQueen, Ray Wilkins, Garry Birtles, Frank Stapleton and Bryan Robson.\nThat was huge money back then.\nIn the mid 1980s and still trying to catch up to Liverpool they went out and signed Alan Brazil, Peter Davenport and Terry Gibson to stop anyone else getting them.\nThey already had Stapleton, Norman Whiteside and Mark Hughes on their books.\nThe massive spending continued through the Fergie years, and has continued since he left.\nSo lets have none of this sour grapes about what Manchester City have achieved from these self-entitled and glory hunting reds.\nIt wasn’t only on Youtube that sheer hypocrisy was in evidence.\nYes, the Salfords had a few allies on the mackems RTG forum.\nAccording to some, it would apparently be bad for English football if Manchester City won last night’s final because UEFA may then free up a fifth Champions League place, making it easier for the Mags to get back into the Champions League again you see.\nDon’t laugh.\nAs if Sunderland fans would have any idea about how ‘easy’ it is to qualify for Europe or the Champions League.\nThere was also one nugget who got carried away with the notion that Qatar may still acquire Manchester United and that “it will put all of the Geordies back in their box.”\nSo there is nothing wrong with state ownership and oil money, as long as it goes to anyone else but Newcastle United.\nEnjoy the glory and all of the plaudits coming your way Manchester City fans.\nIt is going to be a lot harder for Newcastle United to get this kind of success, but if anyone is going to give it their best shot in the coming years, it will be us.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 748,
  "scraped_at": "2026-02-14T02:07:02.896679",
  "_text_extracted": true
}