{
  "article_id": "6b823f314012",
  "url": "https://www.lbc.co.uk/news/manchester-city-rodri-wins-ballon-dor-real-madrid-boycott-ceremony/",
  "title": "Manchester City Rodri wins Ballon dOr as Real Madrid boycott ceremony after Vinicius ... ",
  "date": "20241028T230000Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City's Rodri wins Ballon d'Or as Real Madrid boycott ceremony after Vinicius Jr is snubbed for award\nManchester City's Rodri Hernandez has won the Ballon d'Or, becoming the first Premier League player to be named the world's best footballer in 16 years.\nListen to this article\nThe 28-year-old midfielder earlier this year helped Spain win the European Championship and lifted the Premier League trophy for a fourth consecutive season with City.\nHe was helped onto the stage at the Paris ceremony after arriving on crutches, having been ruled out for the rest of the season with a knee injury during City's clash with Arsenal.\nCristiano Ronaldo was the last Premier League player to win world football's top individual award when he played for Manchester United in 2008.\nReal Madrid were named the men's club of the year but there was no one to collect the trophy after the side boycotted the ceremony when news leaked that their winger Vinicius Jr was lost out on the top prize.\nThe Spanish giants chose to snub the prestigious ceremony in Paris claiming they had been disrespected.\nReal Madrid player Kylian Mbappe also missed the chance to pick up the Gerd Muller trophy he won jointly with Harry Kane after both players finished last season with 52 goals.\nIn a statement reported by Spanish newspaper AS, the club said: “If the award criteria doesn’t give it to Vinicius as the winner, then those same criteria should point to (Dani) Carvajal as the winner.\n“As this was not the case, it is clear that Ballon d’Or does not respect Real Madrid. Real Madrid does not go where it is not respected.”\nAfter helping Real to a Champions League-LaLiga double, Vinicious, 24, had been a heavy favourite to win the award ahead of his team-mate Jude Bellingham and Manchester City’s Rodri.\nCollecting the Gerd Muller trophy earlier in the evening, Kane said: “Thank you to my club Bayern Munich, all my staff, team-mates, for helping me score all the goals I scored.\n\"It’s an honour to take this award from a club legend (Karl-Heinz Rummenigge), thank you very much.”\nThere was little surprise when the Kopa Trophy – awarded to the best male player under the age of 21 – went to Barcelona’s teenage star Yamine Lamal.\nThe forward became the youngest goalscorer in the history of the European Championships when, four days shy of his 17th birthday, he scored for Spain in their 2-1 semi-final win over France, before going on to lift the trophy.\nEarlier in the evening Aitana Bonmati won the women’s Ballon d’Or award for a second year running.\nThe 26-year-old Barcelona playmaker had been the clear favourite for the award after starring in both La Liga F and the women’s Champions League, in which Barcelona lifted the trophy for the third time in four years last season.\nLionesses Lucy Bronze, Lauren James and Lauren Hemp were all on the shortlist, with James finishing highest amongst them in 13th place.\nBarcelona won the women’s club of the year after beating Lyon in last season’s Women’s Champions League final for their third European title in four years.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:08:12.407990",
  "_text_extracted": true
}