{
  "article_id": "6b8a69418267",
  "url": "https://metro.co.uk/2025/08/10/nicolas-jackson-asks-join-premier-league-club-faces-chelsea-transfer-battle-23879891/",
  "title": "Nicolas Jackson asks to join Premier League club but faces Chelsea transfer battle | Football",
  "date": "20250811T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nicolas Jackson favours a move to Newcastle United should he leave Chelsea but faces a battle to be allowed to move on.\nJackson is aware his game-time will be reduced this season after Chelsea spent £90m to sign fellow attackers Joao Pedro and Liam Delap.\nThe Senegal international initially indicated he would be staying at Stamford Bridge and was intent on fighting for his place in the team.\nBut it was reported earlier in the weekend that Jackson had informed Chelsea of his desire to move on amid interest from several clubs, both in the Premier League and abroad.\nIt has been clear in pre-season that Jackson has slipped down Enzo Maresca’s pecking order and he missed the friendlies against Bayer Leverkusen and AC Milan.\nFormer Brighton star Pedro scored in both of those games, while ex-Ipswich Town ace Delap bagged a brace in the 4-1 win over Milan.\nThe Telegraph say Jackson is keen to move to St James’ Park and join a Newcastle team who won the Carabao Cup last season and will be playing Champions League football this term.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut Jackson faces two issues to secure his favoured move, with Newcastle only interested if they are forced to sell Alexander Isak and Chelsea ready to block his transfer unless their demands are met.\nNewcastle added Jackson and Benjamin Sesko to their list of striker targets after being informed by Isak that he wanted to leave and join Premier League champions Liverpool.\nSt James’ Park bosses rejected Liverpool’s opening £110m bid and have told Isak he will not be sold despite the Reds preparing an improved offer.\nBut players often get their wish and Isak could yet make the situation messy by handing in a public transfer request or simply refusing to play.\nNicolas Jackson on his future at Chelsea\n‘I’m a Chelsea player,’ Nicolas Jackson told DSports TV last month.\n‘The future belongs to God. If there are any changes, you’ll know. For now, I’m focused on my preparation.’\nAsked whether he feared for his future at Chelsea given the ‘serious competition’ he will face, if he stays put, following the arrivals of Pedro and Delap, Jackson said: ‘Competition? I have no competition.\n‘We’re all here to help the club. Everyone has their role to play. I’m on a mission. It’s up to the coach to make his choices. I focus solely on my work.’\nIf they are pushed into a corner, Newcastle will look to raise £150m from the sale of Isak, one of the best strikers in the world.\nAnd Isak’s potential departure could see them return to Jackson, especially as their other target Benjamin Sesko has already completed a move to the Premier League, joining Manchester United from RB Leipzig.\nChelsea are open to selling Jackson, who is currently training on his own, and have held talks with numerous clubs across Europe about a deal.\nBut Chelsea do not view Jackson’s sale as a must and are prepared to block his departure unless the terms are right.\nChelsea paid £32m for Jackson two years ago and want to double that given he is contracted to Stamford Bridge until 2033.\nJackson has reached double figures in both seasons at Chelsea but has also received criticism for his finishing and been sent off in two of his last six appearances for the club.\nManchester United and Tottenham were linked with moves for Jackson earlier in the summer but have since priorities other targets.\nSpeaking ahead of Chelsea’s pre-season friendly against Bayer Leverkusen on Friday, ex-Blues striker Jimmy Floyd Hasselbaink urged Jackson to stay put.\nMore Trending\n‘I’ve always said that I really like him [Jackson], he brings something different,’ the former Dutch international told Channel 5.\n‘Yes, they’ve bought in two strikers. But I think a big club like Chelsea needs several strikers on the books. He’s not going to play as much as last year, but I still think that you can use him.\n‘But obviously his value has gone up since they have bought it because he’s done extremely well. So if it makes sense for the club to sell them, they will.’\nWith their pre-season schedule completed, Chelsea’s attentions will now turn to their Premier League opener against Crystal Palace next weekend.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Virgil van Dijk names the signing Liverpool need to make before transfer deadline\nMORE: Manchester United star agrees to leave but Ruben Amorim told to block transfer",
  "word_count": 812,
  "scraped_at": "2026-02-14T01:52:36.779700",
  "_text_extracted": true
}