{
  "article_id": "6ba1af3adc2e",
  "url": "https://www.france24.com/en/live-news/20230426-barca-confident-of-ousting-chelsea-to-make-third-consecutive-final",
  "title": "Barca confident of ousting Chelsea to make third consecutive final",
  "date": "20230426T054500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barca confident of ousting Chelsea to make third consecutive final\nBarcelona (AFP) – Barcelona are confident of achieving their goal of reaching a third consecutive Champions League final when they host Chelsea on Thursday, boasting a 1-0 advantage from the semi-final first leg.\nIssued on:\nThe Catalans, who lifted the trophy as part of a treble in 2021 with a 4-0 romp over the Blues, have reached three finals in the last four seasons.\nWith Olympique Lyon eliminated by Chelsea -- the French side beat Barcelona in the other two finals -- Jonatan Giraldez's team are favourites to lift the trophy again.\nCaroline Graham Hansen struck early at Stamford Bridge last weekend to give her side the lead in the tie and although Chelsea clung on to give themselves a lifeline, Barcelona will relish their chances playing at Camp Nou.\nGiraldez's side have scored 23 goals in just four games at home in the Champions League this season, conceding just once, when they crushed Roma 5-1 in the quarter-finals.\n\"I think we had control, we got the goal and could have scored a couple more, but, in the end, it was a really good game,\" Graham Hansen told reporters Tuesday.\n\"If you see our statistics in recent years, we have lost away from home (in Europe). We have still gone through, but the away games have been tough.\n\"Now we have a great chance to reach another final here at home in front of our fans.\"\nThe Norwegian forward says that triumphing in Europe is the club's main goal once again -- they are poised to lift Liga F on Sunday, a competition in which they have 60 consecutive victories.\n\"Our big objective this season is to win the Champions League and if we get to the final we are one step closer to that,\" added the winger.\n\"I promise I will do everything in my power to achieve it.\"\n'Incredible feeling'\nEmma Hayes' Chelsea side worked hard in the first leg and stopped Barcelona racking up a bigger scoreline despite dominating the game.\nHowever Barcelona midfielder Ingred Engen thinks that the advantage is good enough to give her side a solid platform for the second leg.\n\"I think it's a strong result for us -- it's not like we need to have a 3-0 lead to feel good,\" said the Norwegian on Tuesday.\n\"Now we know we are playing at Camp Nou with our fans, which gives us an incredible feeling, so for us it's a good result for the second leg.\"\nBarcelona set two world record attendances for women's football last season in the Champions League, with over 90,000 attending their quarter-final against Real Madrid and semi-final against Wolfsburg, 5-2 and 5-1 wins respectively.\nChelsea coach Hayes was happy her team did not crumble after Barcelona's early strike in the first leg, as they did in the 2021 final in Gothenburg, conceding four within the first 36 minutes.\nAlexia Putellas shone for Barcelona that night and may return to the bench after missing the entire season to date with an ACL injury, while Lucy Bronze remains a doubt after a knee injury in the first leg.\n\"I wanted to be in the tie and we're in the tie,\" said Hayes.\n\"We have to prepare again for another game. Now players have experienced that (2021 defeat) and it's important we learn and stay in the tie. That was my big message -- stay in the tie.\"\nChelsea dug deep despite injuries to see off Lyon on penalties in the quarter-finals and it will give them hope of an unlikely result at Camp Nou.\n\"We limited them to as few chances as we possibly could and I'll take that going into the next game,\" added Hayes.\n\"I was disappointed with our forward play but we'll work on it.\"\n© 2023 AFP",
  "word_count": 641,
  "scraped_at": "2026-02-14T02:06:54.997281",
  "_text_extracted": true
}