{
  "article_id": "6ba26632d5ae",
  "url": "https://thepeoplesperson.com/2025/06/13/jadon-sancho-could-see-his-contract-get-extended-before-another-loan-exit-is-sanctioned-295334/",
  "title": "Jadon Sancho could see his contract get extended before another loan exit is sanctioned - Man United News And Transfer News",
  "date": "20250613T230000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have struggled to offload players so far this summer window, with Jadon Sancho being a prime example.\nIt was believed the Red Devils had solved the problem when they sanctioned his loan to Chelsea last season, with the Blues obligated to buy him for £25 million should they finish in the top 14 of the Premier League.\nThe Blues finished in the Champions League places, but still chose not to trigger the buy option, opting to pay a penalty to the 20-time English league champions instead and send the forward back to Old Trafford.\nEnzo Maresca was far from pleased with his inconsistency, while the Stamford Bridge outfit also failed to agree a new wage packet with the Englishman, which meant no deal materialised in the end.\nWhere will Jadon Sancho land up?\nINEOS tried to move him on to West Ham, both via a direct deal as well as part of a swap deal proposal, but both were turned down by Graham Potter.\nThe England international’s former club Borussia Dortmund are likely to steer clear, while the player has no interest of moving to Juventus, and Fenerbahce as he hopes to remain in England.\nThe problem is the likes of Brentford, Newcastle, Tottenham Hotspur are unlikely to be able to match his current wages, and he has to take a pay cut, which the 25-year-old has no intention of agreeing at the moment.\nThis has left the United co-owners in quite the quandary, with player sales needed in order to back Ruben Amorim in the market.\nSaudi teams are also lurking, and they can pay over the odds for him but whether Jadon Sancho agrees to move to the Saudi Pro League at this stage of his career remains to be seen.\nIn the end, INEOS could be forced to sanction yet another loan exit, but with the ex-Manchester City academy graduate’s current deal valid until 2026, United could be forced to trigger the one-year extension option in his contract.\nFootball Insider have claimed that after the three-time European winners do that, they will try and agree yet another loan deal with an obligation to buy.\n“Man United could trigger Jadon Sancho’s contract extension if they are to loan him out again this summer, sources have told Football Insider.\nContract extension to be triggered\n“The 25-year-old had a mixed loan spell with the Blues and is unlikely to garner much interest for a permanent transfer this summer. Another loan could be a solution for Sancho – who will not be reintegrated into the squad at Man United under Ruben Amorim.\n“The England international is only under contract until June 2026 – but United have the option to extend by 12 months.\n“They could trigger that option and agree a loan deal with an obligation to buy in an attempt to claw back much-needed transfer funds.”\nWhether the ploy works this time around remains to be seen. But more teams are likely to come forward if it is a loan agreement and not an immediate sale.\nBut as things stand, this saga is unlikely to be resolved quickly and the player might end up departing late on in the window.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 537,
  "scraped_at": "2026-02-14T01:58:41.942433",
  "_text_extracted": true
}