{
  "article_id": "6bbd2f9d3f56",
  "url": "https://www.geosuper.tv/latest/25640-manchester-city-sign-mateo-kovacic-from-chelsea",
  "title": "Manchester City sign Mateo Kovacic from Chelsea",
  "date": "20230627T231500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nJune 27, 2023\nManchester City have signed the Chelsea midfielder Mateo Kovacic on a four-year deal for a fee of £25 million + add-ons, the club announced on Tuesday.\nCity’s head coach Pep Guardiola had been an admirer of the Croatian since the time he was at Real Madrid and now will finally be able to manage him.\nThe 29-year-old, who has won the UEFA Champions League (UCL) title four times, made 221 appearances for the Blues where he also won the club’s Player of the Year award in 2019/20.\n“This is a brilliant move for me, and I cannot wait to get started with City,” Kovacic said after joining the treble winners.\n“Anyone who has watched this team under Pep knows how good they are – for me, they are the best in the world. The trophies they have won are clear for all to see, but they are also the best footballing side out there.”\nMan City’s board was keen to refill the gap that was left wide open after the club’s captain Ilkay Gundogan joined FC Barcelona a few days ago.\n\"Mateo is an excellent footballer,\" City director of football Txiki Begiristain said. \"He can play as a 6 or an 8, has plenty of experience at top level clubs and he understands the Premier League.\n\"It was a very simple decision to bring him to City because he has the tactical and technical qualities we are looking for in a midfielder.\n\"He is someone we have monitored for a very long time and always we were impressed whenever we watched him.\"\nKovacic spent three years with Real Madrid before joining Chelsea where he won the UCL three successive times and also won the league title in 2017.\nThe 29-year-old footballer was also a key part of the Croatian squad that reached the 2018 Fifa World Cup final in Russia and finished third at last year’s tournament in Qatar.\nCity, who won the historic treble last season for the first time in the club’s history, will be looking forward to causing all the havoc in the football world with the Croatian at the heart of their midfield.",
  "word_count": 363,
  "scraped_at": "2026-02-14T02:12:52.291072",
  "_text_extracted": true
}