{
  "article_id": "6bc867d3b00b",
  "url": "https://metro.co.uk/2025/04/23/manchester-united-ready-sell-four-attackers-fund-92-5m-double-deal-22959135/",
  "title": "Man Utd ready to sell four attackers to fund £92 . 5m double deal | Football",
  "date": "20250423T163000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are ready to sell four attacking players to fund a £92.5m double deal for Matheus Cunha and Liam Delap.\nRuben Amorim is desperate to bolster his squad at Old Trafford following a demoralising start to his time in charge of the Premier League club.\nUnited are just 14th in the English top-flight – the same position they were in when Amorim replaced Erik ten Hag back in November – and will need to win the Europa League to save the season.\nWhile Amorim is keen to strengthen his squad this summer, he will first be asked to sanction several sales to raise funds for United’s transfer kitty.\nThe former Sporting Lisbon boss wants to sign a new striker, forward and goalkeeper to compete with and potentially replace the likes Rasmus Hojlund and Andre Onana.\nIpswich Town striker Delap as emerged as Amorim’s top target for the striker position following his breakout season in the Premier League.\nDelap, 22, has hit double figures for an Ipswich side that have won just four games all season and are set to be relegated to the Championship.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nManchester United are not the only Premier League club interested in signing Delap, however, with Chelsea and Arsenal also linked with moves for a player who can be signed for just £30m at the end of the season.\nUnited are also working on a deal to bring Brazilian playmaker Cunha to Old Trafford.\nCunha signed a new contract with Wolves in January but did so in the knowledge he would be sold this summer if his £62.5m buy-out clause was met.\nManchester United appear willing to do just that but a double deal for Delap and Cunha worth almost £100m will require departures from the Theatre of Dreams.\nThe club are planning to sell Marcus Rashford, Jadon Sancho and Antony – all currently out on loan – and are also ready to cash in on Alejandro Garnacho, according to talkSPORT.\nRashford knows he does not have a future at United while Amorim is in charge and is keen to keep on playing Champions League football next season following his loan spell at Aston Villa.\nVilla have an option to sign Rashford permanently for £40m and if they decide against a deal, a number of European clubs are keen to secure the England forward’s signature.\nDespite an inconsistent season at Stamford Bridge, Sancho looks set to earn a permanent transfer to Chelsea, having been frozen out by Amorim’s predecessor Ten Hag.\nAntony will also be moved on in the summer and Real Betis are hoping to keep him at the club following his upturn in form in Spain.\nPaul Scholes expects Garnacho, Mainoo to be sold\n‘I get the impression, and I could be wrong, but I think they might sell the two young players. I think they might sell Mainoo and Garnacho.\n‘Maybe they sell them this summer. The Mainoo one would hurt. They both would. Garnacho came later but Mainoo has been at the club since he was a kid.\n‘He had a brilliant season last year and it makes the academy system look bad if a player like him can’t make it and they have to sell him.\n‘I hope I’m wrong, I hope they don’t do that, but the noises I hear, it is a big concern.’\nSpeaking on Premier League Productions\nGarnacho, meanwhile, has cut a frustrated figure for much of this season and was linked with a move away from Manchester United in January.\nIt is claimed United are once again ‘open to offers’ for Garnacho, who himself is resigned to the idea that a move could in fact be beneficial to all parties.\nChelsea expressed interest in a surprise deal for Garnacho earlier this year, while Atletico Madrid and Napoli are said to be monitoring his situation ahead of the summer.\nMore Trending\nRio Ferdinand, the Manchester United legend, would be disappointed to see Argentina international Garnacho leave the club.\n‘When there’s space to run into, Alejandro Garnacho can be a real devastating threat,’ he recently told TNT Sports.\n‘Yes, he needs to work on that end product but he’s still a young and improving player so that will come. Stick with him. I believe Manchester United should stick with him.’\nAs well as bolstering his attacking options, Amorim is also keen to welcome a new goalkeeper to Old Trafford and admires his compatriot Diogo Costa.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: ‘It’s not fair’ – Ashley Cole tells fans to ‘relax’ over Arsenal youngster\nMORE: Roman Abramovich set to break silence on £2.5 billion sale of Chelsea\nMORE: Dean Huijsen ‘seriously considering’ one offer amid Chelsea, Arsenal and Liverpool interest",
  "word_count": 852,
  "scraped_at": "2026-02-14T01:58:31.708672",
  "_text_extracted": true
}