{
  "article_id": "6bf1b41df8ed",
  "url": "https://www.geosuper.tv/latest/27203-bernardo-silva-signs-contract-extension-with-manchester-city",
  "title": "Bernardo Silva signs contract extension with Manchester City",
  "date": "20230823T220000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After joining the club from AS Monaco in 2017, Silva quickly adapted to Pep Guardiola's playing style and became one of the most important players of his side.\nHe has won 14 trophies during his side with City, including the historic treble last season.\nThe 29-year-old also scored the opening goal of City's historic 4-0 win over Real Madrid during last season's UEFA Champions League's (UCL) semi-final.\nSilva talked about his extension with City saying that he is delighted to sign the contract.\n“I’ve had six incredible years at Manchester City and I’m delighted to extend my time here,” Bernardo said.\n“Winning the Treble last season was extremely special and it’s exciting to be part of a squad where there is such a hunger and passion.\n“Success makes you want even more, and this Club gives me that opportunity to keep on winning.\n\"I love the manager, my team-mates and the fans and hope we can share even more great memories in the coming years.”\nMan City's Director of Football Txiki Begiristain also talked about the Portuguese's extension.\n“Bernardo has been exceptional during his time at the Etihad, so we’re delighted that he has signed a contract extension with the Club.\n“His quality and technical ability is fantastic - and alongside his hard work and professionalism, he has become one of the best players in the world.\n“Bernardo was so important in our Treble-winning season and we are sure he can help deliver even more trophies in the next few years.”\nNo one would be happier than Guardiola as he wanted to keep the player after losing two of his most experienced players, Ilkay Gundogan and Riyad Mahrez to FC Barcelona and Al-Ahli respectively.",
  "word_count": 284,
  "scraped_at": "2026-02-14T01:50:52.171212",
  "_text_extracted": true
}