{
  "article_id": "6c0af53aa02d",
  "url": "https://www.geosuper.tv/latest/53352-tottenham-is-not-a-big-club-says-former-manager-ange-postecoglou",
  "title": "  Tottenham is not a big club , says former manager Ange Postecoglou - Football Leagues",
  "date": "20260212T183000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nFebruary 12, 2026\nAnge Postecoglou has claimed that Tottenham Hotspur is \"not a big club\" because of their policy in the transfer market.\nTottenham have sacked head coach Thomas Frank on Wednesday after a poor run of results in the Premier League.\nFrank was appointed Spurs boss following Postecoglou's departure. The Australian was sacked despite winning the Europa League last season, but struggled in the Premier League, leaving his side in 17th position, five points above the relegation zone.\n\"When you look at their expenditure and particularly their wages structure, they're not a big club,\" Postecoglou told The Overlap's Stick to Football podcast.\n\"I saw that because, when we were trying to sign players, we weren't in the market for those players.\"\nPostecoglou helped Tottenham to finish fifth in his first season in charge, but they failed to build on that and ended the campaign in 17th in his second season, despite winning the Europa League to end a 17-year wait for silverware.\nThe Australian coach added that the club's reluctance to compete with the big Premier League sides in the transfer market was holding it back.\n\"I think they didn't realise that, to actually win, you've got to take some risks,\" he said.\n\"I felt like Tottenham as a club were saying, 'we're one of the big boys', and the reality is I don't think they are.\"\nFollowing the sacking of Mauricio Pochettino in 2019, who led them to the Champions League final, Frank was Tottenham's fifth full-time manager.\nOne of the major concerns of the club's fan base is that they fail to land their transfer targets.\nFrank wanted to sign Nottingham Forest's Morgan Gibbs-White last summer, but he stayed at his club while Arsenal hijacked Tottenham's signing of Eberechi Eze.\nPostecoglou, who was sacked by Nottingham Forest after 39 days in charge earlier this season, suggested that Frank did not realise the type of structure he was walking into.\n\"There's no guarantee whichever manager you bring in. They've had world-class managers there and they haven't had success. And for what reason?\" Ange said.\n\"Thomas is walking in and what's his objective? What's the club's objective? Did Thomas know he was walking into that? I don't know.\"",
  "word_count": 372,
  "scraped_at": "2026-02-14T01:59:36.828484",
  "_text_extracted": true
}