{
  "article_id": "6c0e842ea863",
  "url": "https://www.justarsenal.com/underwhelming-arsenal-drop-two-points-against-tottenham/349560",
  "title": "Underwhelming Arsenal drop two points against Tottenham",
  "date": "20230924T204500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal started the North London Derby with gusto, led by Gabriel Jesus and Eddie Nketiah, who posed a significant threat to Spurs in the initial moments. Their efforts bore fruit when Cristian Romero inadvertently netted an own goal, granting Arsenal an early lead.\nNonetheless, Tottenham, displaying fine football, managed to equalise through Son Heung-min, matching Arsenal’s momentum. With the score levelled at one-all, the match hung in the balance, with Arsenal exerting relentless pressure, seeking to replicate their outstanding performance against PSV earlier in the week.\nTottenham, however, demonstrated resilience, withstanding Arsenal’s attacks and remaining competitive. Arsenal’s supporters in the stands had high expectations, even though Spurs had started the season well. Unfortunately, Arsenal struggled to fulfil their early promise in the game.\nTheir path to regain the lead involved a penalty converted by Bukayo Saka, but this advantage lasted for just a minute, as Son promptly equalised for Spurs once more following an error from Jorginho. Mikel Arteta had to make do without Declan Rice in the second half, as the high-profile signing appeared to have suffered an injury, leaving a noticeable void in the Gunners’ lineup.\nIn the end, Tottenham earned a well-deserved point, as Arteta’s team selection and tactical adjustments failed to yield the desired impact. The responsibility for the outcome ultimately rested with Arteta himself.\nJust Arsenal Opinion\nThat was rather underwhelming and a huge disappointment, so many players failed to show up and Arteta has some questions to answer, he got it wrong when it mattered.\nThere are still players within this team that should not be there, no point in picking on any one individual or making a scapegoat of anyone but if this is what our title challenge is going to be like then forget it.\nThe worst thing was that Tottenham left the Emirates on a high and that should never ever ever happen.",
  "word_count": 312,
  "scraped_at": "2026-02-14T01:54:03.038731",
  "_text_extracted": true
}