{
  "article_id": "6c152317e7ba",
  "url": "https://www.caughtoffside.com/2024/02/25/chelsea-would-be-happy-to-pay-around-250k-a-week-for-25-year-old-star/",
  "title": "Chelsea would be happy to pay around £250k - a - week for 25 - year - old star",
  "date": "20240225T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea are keen on signing the Napoli striker Victor Osimhen at the end of the season.\nThe Nigerian international is one of the best strikers around and he has proven himself with Napoli in recent seasons. The 25-year-old helped the Italian club win the league title last season.\nThe Blues will face competition from London rivals Arsenal as well. Meanwhile, Ben Jacobs has now revealed to Give Me Sport that the Blues are ready to offer him lucrative wages in order to lure him to Stamford Bridge.\nChelsea would be willing to offer £250,000-a-week for the Napoli star.\n“I’m still told by sources that Osimhen’s priority is the Premier League, which is encouraging for Chelsea and Arsenal. He would be looking for about £250,000 per week, which Arsenal, Chelsea and PSG would all be happy to pay.”\nIt will be interesting to see if they can agree on a fee with the Italian club during the summer transfer window. Osimhen has a €130 million release clause in his contract and it remains to be seen whether Napoli are prepared to sell him for less.\nWhile there is no doubt that Osimhen is a world class striker, paying a club record fee for him might not be appealing for the Blues. In addition to that, Chelsea are set to miss out on Champions League football next season. It will be a damaging blow to their revenues.\nOsimhen will also want to compete at the highest level. Joining a club without Champions League football might not be ideal for him. It remains to be seen how the situation develops.\nWith PSG and Arsenal in the race, signing the Nigerian could be an uphill challenge for the Blues.",
  "word_count": 285,
  "scraped_at": "2026-02-14T01:56:44.619093",
  "_text_extracted": true
}