{
  "article_id": "6c3a77116dbd",
  "url": "https://www.dailymail.co.uk/news/article-14943833/Golden-Girls-Leading-Lionesses-paid-little-20-000-time-England-reached-Euros-final-modelling-deals-bring-earnings-2mn-use-2-40-physios-tape-hold-hair.html",
  "title": "Golden Girls : Leading Lionesses were paid as little as £20 , 000 last time England reached a Euros final . Now , modelling deals bring them earnings of up to £2mn ... but they still use £2 . 40 physio tape to hold back their hair",
  "date": "20250727T003000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Golden Girls: Leading Lionesses were paid as little as £20,000 last time England reached a Euros final. Now, modelling deals bring them earnings of up to £2mn... but they still use £2.40 physio's tape to hold back their hair\nBefore England won the Euros in 2022, even leading female players were paid as little as £20,000 a year. Now they earn handsome sums – and more from commercial giants desperate to be associated with their game.\nCaptain Leah Williamson, 28, has modelled for Calvin Klein, is a brand ambassador for Gucci, enjoys a lucrative deal with Nike and has collaborated with global brands including Aston Martin, Pepsi, Walkers and Mastercard. She even has a range of children’s books called The Wonder Team.\nElla Toone, 25, has set up her own brand, ET7, which includes a football academy for young girls, and she has set up a creative agency to help female athletes maximise commercial opportunities. Her sponsors include make-up brand Charlotte Tilbury, orthodontic firm Invisalign and McDonald’s. She and best friend Alessia Russo have a podcast.\nRusso is now on £500,000 a year just for playing football – but off-the-field deals are understood to bring in much more. Forbes put her earnings in just 2023 at £2 million. She has deals with Gucci, Adidas, PlayStation, Beats by Doctor Dre, and last month was gifted an MG5 EV car.\nForward Lauren Hemp, 24, has boosted her £400,000 salary with a sponsorship deal with Lego. Playing with the plastic bricks helps her relax. She has even made a Mona Lisa out of Lego. Her other sponsors include Nike and Sports Direct.\nInspired by art\nThe Lionesses are finding some inspiration for self-expression from the high-end art on display at their five-star hill-top hotel team base, the Dolder Grand.\nThere’s a sculpture of a woman reclining in a champagne flute outside their meeting room. And there is what seems to be a vagrant lying asleep in reception. It’s a sculpture ‘Traveller’ by the American hyper-\nrealist Duane Hanson. The Dolder was the location for the film version of The Girl With The Dragon Tattoo.\nCaptain Leah Williamson, 28, has modelled for Calvin Klein, is a brand ambassador for Gucci, enjoys a lucrative deal with Nike and has collaborated with global brands including Aston Martin, Pepsi, Walkers and Mastercard\nChloe Kelly of England celebrates scoring her team's second goal from a rebound following a saved penalty in extra-time during the UEFA Women's EURO 2025 Semi-Final match between England and Italy\nMichelle Agyemang (pictured), 19, did it again in England’s dramatic semi-final win against Italy, climbing from the bench to spark a stunning late comeback, just as she had done against Sweden in the quarter-finals\nThe new star\nMichelle Agyemang, 19, did it again in England’s dramatic semi-final win against Italy, climbing from the bench to spark a stunning late comeback, just as she had done against Sweden in the quarter-finals.\nAll this a few months after first being called up – and scoring within 41 SECONDS – and just four years after she was a Lionesses’ ball girl at Wembley. She was brought up on gospel and loves her piano.\nSo much so, in fact, she had it brought over in a van. ‘It’s calm and relaxing,’ she explained.\nIn the stands\nAmong partners, family and friends cheering on the Lionesses tonight will be former Miss USA Elle Smith. She is close friends with captain Leah Williamson.\nThe pair spent a week together in Majorca before the tournament soaking up the sun.\nMs Smith, 27, posted a snap celebrating Arsenal’s Champions League victory with Williamson’s winner’s medal around her neck.\nAnd Netherlands forward Vivianne Miedema has stayed in Switzerland to support her partner Beth Mead.\nThe pair – who have been in a relationship since 2022 – faced off in the group stages of the tournament.\nThe Lionesses beat the Netherlands 4-0 to kick-start their campaign, but there’s clearly no hard feelings from Ms Miedema.\nAluminium sculpture at the Lionesses 5-star hotel, The Dolder Grand\nTrendsetting tape\nLast time round, the hair fixation was on ponytails: every player seemed to have one. Now, the focus is on a £2.40 roll of pre-wrap, the physio’s best friend.\nThe tape, which protects cuts, has been re-purposed as a headband. Chloe Kelly, shirtless goal hero in Euro 2022, favoured blue in the semi-final victory over Italy. Lucy Bronze opts for white.\nForward Lauren Hemp, meanwhile, has been unmasked as the squad’s resident hairdresser, taking up physiotherapist scissors to give teammate Esme Morgan a trim.\nMs Hemp said central defender Morgan ‘didn’t want to pay for a hairdresser and I think she’s seen a talent in me that I’d not recognised.’\nArise Dame Sarina!\nVictory tonight and it won’t just be garlands and accolades for the players. Manager Sarina Wiegman – the 55-year-old Dutchwoman who has transformed the Lionesses since taking over four years ago – may get a damehood.\nAnd what about us?\nSir Keir Starmer was pretty vocal in demanding a Bank Holiday when the Lionesses won in 2022.\nThis time? The killjoys in Downing Street have said there are ‘no plans’ in giving the nation a day off to celebrate.",
  "word_count": 865,
  "scraped_at": "2026-02-14T02:09:18.635457",
  "_text_extracted": true
}