{
  "article_id": "6c5db96b58af",
  "url": "https://www.teamtalk.com/chelsea/exclusive-no-doubt-graham-potter-sack-decision-major-change-coming-chelsea-intentions-todd-boehly-thinking-come-to-light",
  "title": "Exclusive :  No doubt  on Graham Potter sack decision with major Chelsea change coming , as true Todd Boehly thinking comes to light",
  "date": "20230225T131500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea\nPremier League • England\nExclusive: ‘No doubt’ on Graham Potter sack decision with major Chelsea change coming, as true Todd Boehly thinking comes to light\nIn an exclusive interview with TEAMtalk, Ben Jacobs has revealed whether Chelsea will sack Graham Potter, as well as highlighting a looming major change that could reverse the club’s on-field fortunes.\nIt’s fair comment to say Potter’s stint with the Blues has been nothing short of disastrous so far. The ex-Brighton man has returned a paltry winning percentage of 36. By contrast, ousted former boss Thomas Tuchel left with a round 60 percent.\nChelsea have exited both domestic cups on Potter’s watch. They sit a lowly 10th in the Premier League and are a goal down at the half-way mark of their Champions League Round of 16 tie with Borussia Dortmund.\nAll that has come despite Potter presiding over one of the most expensively-assembled squads of all time.\nHowever, speaking exclusively to TEAMtalk, trusted reporter, Ben Jacobs, has revealed why Potter’s position is safe. That’s despite Jacobs noting there’d have been “no doubt” he’d have already been axed under former owner Roman Abramovich.\nJacobs detailed Chelsea’s thinking behind backing the ex-Brighton man despite woeful on-field results. The reporter also detailed one reason the club’s hierarchy are pointing to to explain why the Blues are struggling, other than Potter’s management, of course.\n“With regards to Graham Potter there’s a big game against Tottenham [on Sunday],” said Jacobs. “And, of course he’s under pressure.\n“But the board at Chelsea intends to judge Potter in the long term because they believe that he’s a football fit, personality fit and strategic fit. As a consequence, he is going to be afforded a whole lot more time.\n“There’s no doubt if Roman Abramovich was still in charge that with the run of form that Chelsea or on Potter would have already been sacked. But that’s the difference in approach of ownership.\n“They don’t want to make a cutthroat or knee jerk change at this point. So even though football is a results-driven business, Potter won’t be judged on getting Champions League football or any short term poor form, providing – and this is the important thing – he shows progress.\n“So it’s not between now and the end of the season about a certain amount of results. Although, Chelsea obviously do expect to win every game if their history is to be judged by, but it’s not just about the results.\n“It’s about the manner of performance, and the ownership group feel like Potter’s been hamstrung because of a growing number of injuries when he arrived and wholesale changes at the club, a January window with a bunch of new and exciting signings but no time to bed in.\n“As a result, the blame for Chelsea’s current run and lack of goalscoring is not being placed firmly on Potter’s door at this stage. He’s got strong support in particular from the majority owner and the chairman Todd Boehly.”\nEXCLUSIVE: Chelsea to field devastating midfield pairing after U-turn tees up critical Potter coup\nPotter poised to make “ruthless” team selections\nAn issue that has plagued Potter’s reign is unquestionably Chelsea’s lengthy injury list.\nTwo of the Blues’ brightest performers are unquestionably Reece James and N’Golo Kante. However, James has featured just three times in the league since mid-October. Kante’s only two league appearances came in August.\nA potentially devastating midfield pairing of Enzo Fernandez and N’Golo Kante has therefore been unavailable to Potter thus far.\nThat may soon change with Kante recently returning to training after hamstring surgery. With first-choice full-backs James and Ben Chilwell both back too, Jacobs expects Potter to zero in on his strongest eleven and in a major change, leave the chopping and changing in team selection behind.\n“During the World Cup break, Potter and Boehly spoke in detail,” continued Jacobs.\n“In the last week or so, Chelsea have held a sort of strategic meeting with the club’s senior hierarchy to again, underline the same thing, what direction they’re traveling, what their long term plan is, and what the expectations are between now and the end of the season.\n“Those expectations on Potter are to turn the form around and stay in the Champions League, but also to create an identity and to man-manage the young players and help them settle in.\n“And also, to ensure that there’s a more consistent starting eleven which has possibly been, along with managing a big dressing room, the biggest challenge for Graham Potter because he’s had so much change. New faces and injured players have meant that he’s barely picked the same starting eleven.\n“Reece James and Ben Chilwell are back now and N’Golo Kante is returning to training… the new signings have all had somewhere around a month.\n“So I think the expectation now is that Graham Potter will start to be a bit more authoritative and ruthless in his squad selection, rather than tinkering.”\nJacobs went on the conclude Potter continues to be viewed as a “long-term project” and as such, any Blues fans hoping to see him ousted are set to be disappointed.",
  "word_count": 857,
  "scraped_at": "2026-02-14T01:59:41.700334",
  "_text_extracted": true
}