{
  "article_id": "6c66c4e4e78b",
  "url": "https://www.justarsenal.com/arsene-wenger-wore-his-magic-hat-at-arsenal-for-22-years/400565",
  "title": "Arsène Wenger wore his magic hat at Arsenal for 22 years",
  "date": "20250922T220000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsène Wenger wore his magic hat at Arsenal for 22 years, although his success petered off towards the end.\nWhen many thought that legendary Ajax player Johan Cruyff was about to become the club’s new manager in 1996, Wenger signed instead, originally causing disappointment at first. Many said “Arsène who?” No one had heard of the Frenchman who had just signed from Japanese side Nagoya Grampus, however he was about to transform the Gunners’ fortunes at the turn of the 21st century.\nThe former AS Monaco manager, who led them to the Division 1 title in 1988, brought brand new landmark ideas to English football. He turned Arsenal around, tackling a drinking culture, improving players’ diets and fitness, increasing skill level, attacking play and introducing a new style of scouting not seen before his time. He managed to buy overseas players cheaply who turned out to be legends, including Thierry Henry, Patrick Vieira, Emmanuel Petit and many more. Wenger also brought in sporting specialists at the club such as osteopaths, and ensured that players endured more intense and varied training sessions, focusing on stretching which had only previously been done at the start and end of workouts.\nHis first game in charge of Arsenal was on October 12, 1996, away at Ewood Park, which he won 2-0 thanks to Ian Wright finding the back of the net twice. Life at Highbury was looking good for fans. By the end of his first Premier League campaign, the Gunners finished an improved third, meaning qualification to the UEFA Cup / Champions League, which he would successfully achieve for the next 18 seasons.\nEarly doubles and a revolution\nIn only his second season Wenger clinched Arsenal’s second double in history after winning the 1998 Premier League title, which saw them jump over a 12-point Manchester United hurdle. This was the first time a non-British manager had won the English top flight. Days later the FA Cup followed after a 2-0 win over Newcastle United with goals from Marc Overmars and Nicolas Anelka.\nAfter a four-year silverware drought Wenger repeated history, crowning Arsenal with another double for the third and final time. The Premiership was wrapped up at Old Trafford thanks to a Sylvain Wiltord strike in a 1-0 win over Sir Alex Ferguson’s Manchester United. Not long afterwards Chelsea, including former Gunner Emmanuel Petit, were beaten 2-0 with goals from Ray Parlour and Freddie Ljungberg. Wenger ensured revenge in his favourite cup competition after the Gunners slipped up 2-1 to Liverpool in the 2001 final.\nThe following campaign Arsenal returned to Wembley, sealing another FA Cup victory, this time 1-0 against Southampton at the Millennium Stadium. Robert Pires delivered the winning goal.\nAfter Arsenal won the 2002 Premier League title Wenger declared that his side could potentially go a whole season undefeated, something no team had ever done in the competition. Wenger lived up to his words and after going 38 games unbeaten during the 2003/04 season, the Gunners lifted a golden Premier League trophy (their last to date).\nLater years and legacy\nAfter losing the 2004/05 title to Chelsea, Arsenal appeared in the FA Cup final for the fifth time in seven seasons. Manchester United proved a tough side to beat, with the win eventually settled on penalties after a 0-0 stalemate in Cardiff.\nThe next campaign Arsenal reached the Champions League final for the first and only time. Wenger had helped his side reach a European final six years earlier in 2000 versus Galatasaray in the UEFA Cup, bowing out on penalties. Many hoped Arsenal would not falter again, especially with the final in Wenger’s home capital Paris. Sol Campbell gave Arsenal the lead against Barcelona, but Samuel Eto’o and Juliano Belletti secured a 2-1 win for the Spaniards, breaking Gunners’ hearts around the world.\nMonths later Wenger moved Arsenal to the new Emirates Stadium, doubling Highbury’s capacity to just over 60,000 seats. Financing the move themselves forced Arsenal to sell crucial players to fund the new home, also limiting finances in transfer windows. Despite this, Wenger kept Arsenal in the top four until 2017.\nHe guided Arsenal to their first League Cup final under his reign in 2007 against Chelsea, losing 2-1. Two years later, Wenger reached the Champions League semi-finals again, but Manchester United beat the Gunners 4-1 on aggregate.\nThe 2011 League Cup final saw Arsenal beaten 2-1 by Birmingham City. A long trophy drought ended in 2014 with an FA Cup win over Hull City after coming back from 2-0 down to win 3-2 in extra time. More FA Cup glory followed in 2015 with a 4-0 win over Aston Villa, and in 2017 Arsenal beat Chelsea 2-1 with goals from Alexis Sanchez and Aaron Ramsey. This was Wenger’s record seventh FA Cup as a manager.\nWenger also lifted seven Community Shields, including his final one in 2017 when Arsenal beat Chelsea on penalties.\nTowards the end of the 2017/18 season Wenger announced his departure. In May 2018, he received an ovation as Arsenal beat Burnley 5-0 at the Emirates in his final home match.\nSince 2019 Wenger has worked at FIFA as Chief of Global Football Development. His legacy is celebrated at the Emirates, where a bust of him is displayed inside and a statue of him lifting the Premier League trophy was unveiled in 2023.\nLiam Harding\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 967,
  "scraped_at": "2026-02-14T02:09:24.920278",
  "_text_extracted": true
}