{
  "article_id": "6c6bb1f52d0d",
  "url": "https://www.con-telegraph.ie/2023/09/28/can-united-city-or-arsenal-dethrone-champions-chelsea-wsl-talking-points/",
  "title": "Can United , City or Arsenal dethrone champions Chelsea ? – WSL talking points",
  "date": "20230928T113000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Can United, City or Arsenal dethrone champions Chelsea? – WSL talking points\nPhil Medlicott, PA\nThe new Women’s Super League season gets under way with the opening round of fixtures taking place on Sunday.\nHere are some of the talking points heading into the action.\nAfter securing their fourth WSL title in a row last season – and third successive FA Cup – the simple question regarding Chelsea ahead of 2023-24 is can they keep their dominance up? While skipper Magda Eriksson and Pernille Harder were notable departures over the summer, there have been eye-catching signings such as Catarina Macario and Ashley Lawrence joining a Blues squad featuring stars like Sam Kerr, Millie Bright and Lauren James, who shone so brightly at times for England at the World Cup. With Fran Kirby back in the fold after injury as well, Emma Hayes’ side appear as primed as ever to hunt down further success.\nManchester United had a landmark campaign last term, proving Chelsea’s closest rivals in the title race before ending up two points behind in second, as well as runners-up to them in the FA Cup – the best they have fared in both. It will be fascinating to see how the Red Devils get on in their attempts to build upon that in the WSL this season, particularly should they get through their qualifier with Paris St Germain to join Chelsea in the Champions League group stage. Either way, they will be without England striker Alessia Russo after she opted to leave and sign for Arsenal – but goalkeeper Mary Earps, her fellow Lioness, has been retained. Attacking options added to Marc Skinner’s squad include Geyse, Melvine Malard and World Cup Golden Boot winner Hinata Miyazawa.\nTwo teams who definitely will not have Champions League football to contend with this term are Jonas Eidevall’s Arsenal, who crashed out in the first qualifying round earlier this month after coming third in the 2022-23 WSL, and Gareth Taylor’s Manchester City, fourth last season. That could be a significant factor as both aim to be firm contenders for the league title this time around. As well as Russo added to their ranks, plus the likes of Australia midfielder Kyra Cooney-Cross, Arsenal have Beth Mead returning from an ACL injury, with Vivianne Miedema and Leah Williamson to follow. City have the huge threat of Khadija Shaw in their attack, while the signing of former Arsenal player Jill Roord has boosted their midfield.\nOutside the aforementioned ‘big four’, a team that has been drawing considerable attention is Aston Villa, last term’s fifth-placed finishers who opened their campaign by beating City and closed it with victory at Arsenal. England international Rachel Daly, scorer of 22 goals in as many WSL games last season to pip Shaw to the Golden Boot, is the leading light of the team, and Ebony Salmon, Lucy Parker and goalkeeper Daphne van Domselaar are among the summer additions as the midlands outfit, managed by Carla Ward, look to make even more of a splash in 2023-24. They take on United at Villa Park in the first kick-off of Sunday’s curtain-raising games.\nBristol City are back in the top flight after a two-season absence having claimed the Championship title under Lauren Smith. The bid to preserve their status could see them battle with Leicester – their opponents at Ashton Gate on Sunday – and Brighton, who finished 10th and 11th respectively last term, both five points clear of relegated Reading. The Foxes stayed up after bringing in Willie Kirk last November, while Melissa Phillips took charge at Brighton in April, following the departures of Hope Powell and then Jens Scheuer in a troubled campaign for the Seagulls.",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:00:57.122109",
  "_text_extracted": true
}