{
  "article_id": "6cac55961c23",
  "url": "https://metro.co.uk/2025/08/14/wayne-rooney-sends-message-liverpool-alexander-isak-transfer-23907347/",
  "title": "Wayne Rooney sends message to Liverpool over Alexander Isak transfer",
  "date": "20250814T000000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wayne Rooney has told Liverpool that signing Alexander Isak before the transfer deadline would make them ‘unstoppable’.\nLiverpool’s opening bid for Isak, worth £110m, was rejected by Newcastle United, who continue to insist the striker will not be sold.\nBut Newcastle may be forced to soften their stance after Isak threatened to go on strike in order to force through a move to Liverpool.\nIsak is desperate to join the Premier League champions before the summer transfer window closes and is seemingly prepared to at least partly ruin his Newcastle legacy in order to force the move through.\nManchester United and England legend Rooney already rates Liverpool as the ‘favourites’ to win the Premier League this season but says the signing of Isak would make Arne Slot’s side ‘unstoppable’.\n‘I already have Liverpool as the favourites to win the title this year but if Isak comes in, I think they’re going to be unstoppable,’ he said on BBC’s Match of the Day. ‘Look at the quality they’ve got.\n‘I think a big thing for Liverpool this summer was replacing Trent [Alexander-Arnold] because he created a lot of chances and goals down that side. [Jeremie] Frimpong has got the attributes to do that.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘So yeah, Liverpool look strong.’\nLiverpool have already spent around £250m on new signings this summer, bringing in the likes of Florian Wirtz, Hugo Ekitike and Frimpong.\nSlot’s side finished ten points clear of second-placed Arsenal last season and begin their title defence on Friday night against Bournemouth.\nWhile the temptation to join Liverpool is clear to see, Isak has handled his transfer situation ‘so badly’, according to ex-Newcastle boss Alan Pardew.\n‘The problem is, he’s handled it so badly. He couldn’t have handled it any worse,’ Pardew told talkSPORT.\n‘His agents and advisors have said to him to throw down the tools after serving that great football club, and he’s doing really bad things to hold them to ransom and more or less force a way out.’\nIsak has scored 62 goals in 109 appearances for Newcastle since his £62m move from Real Sociedad in 2022.\nThe 25-year-old was one of the stand-out players in the Premier League last season, helping Eddie Howe’s side qualify for the Champions League and win the Carabao Cup.\nMore Trending\nAsked about Isak’s future at St James’ Park last week, Howe said: ‘I think everything is in play.\n‘I’ve said many times he is contracted to us. He is our player. The club make the decision on his future.\n‘I don’t know what that will be. Of course I have a preferred outcome. I want the best and the strongest squad possible, but I also want players that really want to play for this football club.’\nWith or without Isak, Newcastle kick-start their Premier League campaign on Saturday with a trip to Aston Villa.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd star branded the ‘worst signing in the club’s history’ ahead of Arsenal clash\nMORE: Chelsea hit stumbling block in bid to sign Alejandro Garnacho from Manchester United\nMORE: Glenn Hoddle names ‘team to beat’ in Champions League and snubs PSG",
  "word_count": 591,
  "scraped_at": "2026-02-14T01:52:36.776174",
  "_text_extracted": true
}