{
  "article_id": "6ccf93d73434",
  "url": "https://en.trend.az/azerbaijan/society/3896825.html",
  "title": "UEFA Champions League semi - final return matches kick - off",
  "date": "20240508T110000Z",
  "domain": "en.trend.az",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "BAKU, Azerbaijan, May 8. The return matches of the UEFA Champions League semifinals have started, Trend reports via Idman.biz.\nIFFHS (International Federation of Football History and Statistics) has prepared a statistical report on the match between PSG and Borussia Dortmund, which took place on the first match day of the Champions League semi-final stage.\nMats Hummels became the oldest German to score a goal in the Champions League playoffs (35 years and 143 days).\nHummels is the third-oldest player to score in a Champions League semi-final. Ryan Giggs was 37 years and 148 days old, and Edin Dzeko was 37 years and 54 days old when they scored against their opponents.\nMats Hummels is the second old man to score a Champions League goal for Borussia Dortmund. Łukasz Piszczek achieved this at the age of 35 years and 188 days.\n\"PSG\" is the youngest team to play in the semifinals of the Champions League in the last 15 years (the average age of the squad is 24 years and 157 days). Arsenal played against Manchester United in May 2009 with a starting lineup of 24 years and 26 days.\nPSG produced 31 shots. It is only the 3rd case in UCL in the XXI\ncentury that a team with 30+ shots fails to score. Other cases:\nMilan, 31 shots vs. Club Brugge (0-1 in 2003),\nBraga, 35 shots vs. Cluj (0-2 in 2012).\nPSG became the first team with 4 shots on the woodwork (2 posts, 2 crossbars) in the same Champions League match since Benfica did it against Besiktas (3-3) on November 23, 2016.\nPSG became the first team in UCL history to hit the woodwork four times in a knockout game and six times in a two-legged tie.\nThey also established the new UCL record for a team hitting the woodwork most often (14 times) within a single edition.\nTo note, the German club, as in the first match, won with a score of 1:0.\nStay up-to-date with more news on Trend News Agency's WhatsApp channel",
  "word_count": 338,
  "scraped_at": "2026-02-14T01:48:52.526877",
  "_text_extracted": true
}