{
  "article_id": "6ce82d2d4e87",
  "url": "https://mufclatest.com/predicted-xi-4-2-3-1-hojlund-fernandes-garnacho-to-start-amad-to-get-a-change-to-thrive-in-this-team-ten-hag-needs-to-win/",
  "title": "Predicted XI : [ 4 - 2 - 3 - 1 ] Hojlund , Fernandes & Garnacho to start ? Amad to get a chance to thrive in this team ? Ten Hag needs to win ! ",
  "date": "20240426T014500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are back in Premier League action on Saturday afternoon as they welcome Burnley to the Theatre of Dreams. Erik ten Hag will be happy that his side was able to battle from 2-1 down to overcome Sheffield United 4-2 on Wednesday evening at Old Trafford.\nUnited need to break into the top four of the Premier League this season in order to qualify for the UEFA Champions League, which does look unlikely. United sit in sixth place in the league at this stage 13 points adrift of fourth placed Aston Villa – with a game in hand over them.\nBurnley are relegation challengers this season, sitting in 19th place in the league with 23 points, just three points from safety with Nottingham Forest sitting above the relegation zone. It seems unlikely that United will reach the Champions League next season but must end the season strongly.\nPredicted Manchester United Starting XI – 4-2-3-1\nOnana;\nWan-Bissaka, Casemiro, Maguire, Dalot;\nMcTominay, Mainoo;\nAmad, Fernandes, Garnacho;\nHojlund\nGoalkeeper: Onana\nAndre Onana has conceded 74 goals for United this season which is a shambolic number of goals to concede. However, United’s injury crisis has been terrible this season. Something needs to be done about the number if injuries the club has suffered this season – it has been too many.\nGranted, Onana has made many errors which have resulted in conceding goals but if he had a strong defence in front of him, it could have been very different. United have done well this season, especially with few rotational players with experience of first team football.\nOnana could be better for United next season. If you look at his stats in the Premier League – he has eight clean sheets, just six short of the best goalkeeper in the league. It is not all bad. His rival, Altay Bayindir has played one match for United this season and it seems that will be his only appearance.\nDefenders: Wan-Bissaka, Casemiro, Maguire, Dalot\nUnited’s defence is a work in progress. It seems likely that United will have one experienced central defender fit for the Burnley game which will be Harry Maguire, who has done well in the last few matches for the club. Casemiro will likely fill in alongside him in the centre of the defence.\nIn the fullback positions, Aaron Wan-Bissaka (right-back) and Diogo Dalot (left-back) will keep their places with both Luke Shaw and Tyrell Malacia still out of action through injury. United have Harry Amass and Habeeb Ogunneye in the fullback roles to fall back on should they be required.\nIn the centre of the defence, United have little in reserve because of injury, unless a player or two is ready to return to action, which seems unlikely. In which case, youth will be called upon again with Louis Jackson drafted into the first team once again with a possible debut looming for him.\nMidfield: McTominay, Mainoo\nUnited’s midfield requires some work in the summer with Casemiro slowing, despite filling in as a central defender at this time and Christian Eriksen seeing his better days in the past. Kobbie Mainoo is the future for United and a combative midfielder alongside him will benefit the club massively.\nScott McTominay could be back in action from the start of the match against Burnley on Saturday, playing alongside Mainoo. McTominay has 13 goal contributions this season – ten goals and three assists. Mainoo has four – three goals and one assist. It has been a positive season for him.\nUnited could also utilise Eriksen and Sofyan Amrabat, who will be returned to Fiorentina in the summer after his loan spell at the club has not worked as well as it should have. United will need to get the work done to their midfield in early summer to benefit from pre-season.\nAttacking Midfield: Amad, Fernandes, Garnacho\nUnited’s attacking midfield is a key part of the squad in terms of goals, assists and creation. It has not been great for the majority of the season but United know what they need to do this season to find achievement and pushing in the league and winning the FA Cup are just that.\nBruno Fernandes has 26 goal contributions this season, scoring 15 times and assisting 11. He rose to the challenge against Sheffield on Wednesday and needs to be doing the same against Burnley. Alejandro Garnacho has 14 goal contributions this season – nine goals and five assists.\nStaring both Fernandes and Garnacho, him playing on the left-wing is a positive. Ten Hag will need to make the right wing work for him and Antony is not performing as he perhaps should. Amad Diallo has both the talent and hunger to succeed and he needs to be given chances to perform.\nForward: Hojlund\nRasmus Hojlund scored his 14th goal of the season in the 4-2 victory over Sheffield at Old Trafford on Wednesday. There is no reason why he cannot seek to score at least three more goals during the remainder of the season with United playing five Premier League matches and the FA Cup final.\nThe Danish striker has had a good season at United, seemingly only able to score in the Champions League at the start of the season but eventually getting his first Premier League goal. He has had some injuries to contend with but has recovered and is now scoring goals again.\nUnited will need to find a solution for the club in the summer with at least one more striker required, preferably with experience to help the Dane out but it could also be a player who carries different attributes as a striker, which would benefit the club more than having Anthony Martial.\nSubstitutes: Bayindir; Amass, Ogunneye, Jackson; Amrabat, Eriksen, Forson; Antony, Wheatley\nUnited have nine substitutes on the bench in the Premier League – five can be used during the match. The substitute goalkeeper will once again be Altay Bayindir who has played just once for United this season – and that could be it until pre-season for him.\nIn defence, United look set to have youth players against with Harry Amass, Habeeb Ogunneye and Louis Jackson with no experienced defender fir enough to play a part – which is the most likely scenario. Sofyan Amrabat, Christian Eriksen and Omari Forson could be the only midfielders.\nIn attack, United are much weaker with injury playing a part but they could have Antony and Ethan Wheatley on the bench, which would be a positive. Wheatley made his United debut against Sheffield on Wednesday and looks set for more match time in the first team this season.\nWritten by Paul\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 1124,
  "scraped_at": "2026-02-14T01:51:24.790786",
  "_text_extracted": true
}