{
  "article_id": "6cf7c1600314",
  "url": "https://theathletic.com/4809492/2023/08/28/granit-xhaka-euro-watch/",
  "title": "Granit Xhaka attempts to escape his past as the heart of Alonso Leverkusen – Euro Watch",
  "date": "20230828T043000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The next chapter of Granit Xhaka’s career is under way. He has left the Premier League, the page has turned, and he now finds himself back in the Bundesliga, as the heart and mind of one of its most compelling sides. On the evidence of Saturday evening’s accomplished 3-0 win over Borussia Monchengladbach, he and Xabi Alonso’s Bayer Leverkusen look a perfect union.\nAdvertisement\nThe club know what they want from him. At the end of last season, Leverkusen identified a need to alter their dressing-room chemistry and to surround their nucleus of young and precocious players with tougher material. They want personality and leadership. Jonas Hofmann, a 31-year-old German international was signed, so too was Xhaka, and Leverkusen look sturdier — and better — for it.\nSaturday was a homecoming for both. Hofmann was signed directly from Gladbach, while Xhaka spent his formative years there, between 2012 and 2016. And he had wonderful moments at Borussia Park. He and Gladbach played in the Champions League together. In 2015, they even finished as high as third in the Bundesliga. That was also the season that he headed a 91st-minute winner against Cologne, the club’s biggest rival, and then ran the entire length of the pitch to jump into Yann Sommer’s arms and celebrate in front of the ultras in the Nordkurve.\nBut he had bad moments also. When he arrived, he was a 20-year-old puffed up with the hubris that came from winning back-to-back Swiss titles and being voted the country’s young player of the year. He could be brilliant, but he could also be petulant and volatile and for some in Germany that remains his enduring identity, as if everything that has happened since — the good and bad of Arsenal — occurred out of sight and with no effect on his personality at all.\nBefore the game on Saturday evening, that was the character under the lens. As Alonso joined the Sky Deutschland punditry team pitchside to talk about his new signing and extol his leadership virtues, a reel of Xhaka’s spikiest Bundesliga moments played to the viewer. There were the trips, the bad tackles and the snarls at referees. As his new coach described what a good influence he could be, decade-old yellow and red cards were shown in the background.\nIt was a strange moment. Xhaka has spent a long time attempting to get out from under that reputation. The same was true in England, where the memory of who he once was on the pitch often seemed to influence the way he was refereed and written about.\nAdvertisement\nNevertheless, on Saturday night he responded with a maestro’s performance at the base of midfield. That is not the easiest position to play at Leverkusen. Both of Alonso’s wing-backs (Jeremie Frimpong and Alex Grimaldo) play really as wingers and two of his three centre-backs (Edmond Tapsoba and Odilon Kossounou) are adventurous ball-players who like to roam up the pitch. The result is a lot of space to cover, a lot of potential danger from turnovers and — consequently — a great onus on the No 6.\nIt was a burden Xhaka shouldered and, at this stage of his career, he is able to be the wise old head that Leverkusen need. Tellingly, his finest moments in Saturday’s game also came when it was still competitive. Gladbach are a team in transition — there are still no signs that they are on their way back — but in front of their home crowd for the first time this season, they produced a surge of effort that seemed to unsettle a few of the visiting players.\nInvariably though, Xhaka was where he needed to be to protect his team’s self-belief in those opening minutes. He was there to chest down a high ball in midfield as the challenges pincered in during the opening seconds. He was on the penalty spot to win a big header from the first corner of the game, with Gladbach’s centre-backs sensing a cheap goal.\nMy ball. Mine.\nHe also changed the game for good. He gave a performance full of cutting, piercing balls that diced the Gladbach midfield and that vision would create the first goal. At the end of a thousand-pass move that Xhaka himself had begun with an interception deep in his own half, he flighted a chip to the back-post that Grimaldo headed back and Victor Boniface turned home. Half an hour later, he did it again — to the other side of the box. His disguised, chopped ball dropped behind the defence for Hofmann, who found Jonathan Tah, and Leverkusen had their points.\nAdvertisement\nSo far, so familiar; that was a version of Xhaka that the locals will have recognised. But the evolution was clear, too. There was a seam of maturity that ran through his performance. If anything, it was just as valuable.\nA team, after all, is highly sensitive. We know that through the many arbitrary factors that can damage it throughout a season. A bad press conference, an inconvenient headline, an unwelcome transfer rumour. When it comprises so many young players (10 of the 16 players Leverkusen used on Saturday were 24 or under), it can be particularly delicate and that fragile talent is what Xhaka is there to help protect.\nTo him, German football is more of a collective enterprise. In pre-season, he spoke of how Premier League players tended to go their separate ways after training, whereas in the Bundesliga there was more community. “The German mentality is a bit tighter and more binding”, he said. “That suits my character.”\nHe speaks eloquently about the dynamics within a team and the impact that coaches and senior teammates can have. When The Athletic spoke to him in late July, he was also clear about what his role would be within Leverkusen’s social dynamic. He had no intention of infringing upon Lukas Hradecky’s captaincy, he insisted, but his job was to challenge the younger players. At times, when necessary, he wanted to help those players find out where their limits were.\nWhen you spend time with Xhaka, you soon realise how passionate he is about his profession. That shows in the matchday intensity he carries into every training session, but also how he discusses his reason for being back in the Bundesliga and what he still wants to achieve. He is forthright in a way that suggests that the discovery of those limits this season also might not always be the easiest process. But he is a classic catalysing element; that has such obvious worth at Leverkusen.\nThat role — the character he was signed to play — is also extremely important. One of the hazards of the club’s approach to recruitment is the muddle of agendas that can breed. While every player has one eye on the team, many of them — quite naturally — have the other on their own future. Binding that group and keeping them trained on the present and the collective is a job that goes well beyond a head coach.\nOn the evidence of Saturday night, though, Xhaka is well-suited to it. On what might have been a combustible occasion, his was most often the steadiest pulse. It was when Tapsoba horribly miskicked in the opening minutes and betrayed some obvious nerves. It was again later in the first half when Florian Wirtz was physically challenged by Alassane Plea on the far touchline and a scuffle threatened to break out. The Gladbach fans began to roar and their players were suddenly bright-eyed and alive. But Xhaka was quickly there with a palm in Plea’s chest and an expression that said: no, that will not be your way back into the game.\nAdvertisement\nOn they go, then. Two games, two wins. All paths in Germany eventually lead to Bayern Munich and it remains difficult to see anybody disrupting their dominance. But Leverkusen have as good a chance as anybody else. More so for having Granit Xhaka at and in their side.\n(Top photo: Stefan Brauer/DeFodi Images via Getty Images)",
  "word_count": 1347,
  "scraped_at": "2026-02-14T01:50:52.141551",
  "_text_extracted": true
}