{
  "article_id": "6cf9e7ccb7a5",
  "url": "https://www.nytimes.com/athletic/6922943/2026/01/01/barcelona-champions-league-la-liga-real-madrid/",
  "title": "Barcelona in 2026 : Are they good enough to win the Champions League ? ",
  "date": "20260101T063000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona won all three of Spain’s domestic titles in 2025 — and they’re looking good at about the halfway point this season. So, what are their goals for 2026?\nHere, our Barca correspondents Pol Ballús and Laia Cervelló Herrero discuss what they should be aiming for, which players could have a breakthrough year and where Hansi Flick’s team needs to improve right now.\nAdvertisement\nWhat are Barcelona aiming for in 2026?\nLaia: The Champions League is the one Barcelona want. Last season, they reached the semi-finals and fans started to believe another European treble was on the way. Since the trebles of 2008-09 and 2014-15 (under Pep Guardiola and Luis Enrique, respectively) some supporters have almost expected the team to be reaching those heights.\nSome of Flick’s squad might be too young to even remember the first of those, but you definitely get a sense that they have their sights set on European glory especially.\nAway from the pitch, the big ask will be for Barca to finally bring themselves fully in line with La Liga’s salary rules. They really need to start operating normally in that regard, because their next big concern will be signing a centre-forward to replace Robert Lewandowski, as well as a left-sided centre-back, and stopgap solutions should be avoided.\nPol: Winning titles, and obviously what the fans want is the Champions League. The important thing, what sets the tone and in a way tells you how strong or weak you are, is La Liga. You play there every week and that’s where you see if you’re in good shape or not.\nBut there’s still an unresolved trauma associated with the Champions League, and what really excites supporters is the idea of returning to that summit, without leaving the league and Copa del Rey behind, of course.\nCan they achieve it?\nPol: If you were to ask the Barca squad right now, they’d of course say it’s achievable. But after this first half of the Spanish season, it’s clear to me that Barca haven’t been one of the best four teams in Europe so far this term.\nWithin the squad, there’s a feeling that there’s still a long way to go, and that there’s also room for other teams’ form to dip. It’s true that Barca have been improving but, objectively, I find it difficult to see Barca winning the Champions League right now, looking at their squad.\nAdvertisement\nI love Gerard Martin, he’s a guy I’d have in the Barça squad, but when you stop and think about it, he and Pau Cubarsi are the two starting centre-backs and I don’t see that changing any time soon. I think it will be difficult to compete with that pair at the back, and with the lack of defensive depth Barca have, go full throttle against the best teams in the world.\nI see it as difficult, but not impossible — and the dressing room sees it as more achievable than me.\nLaia: I totally agree. I think Barca should focus on continuing to excite with attractive football, achieving domestic goals and going as far as possible in the Champions League, but without getting caught up in the pressure that, if they don’t achieve it, it’s a failure. The team isn’t at the point where we should expect that title from them yet.\nWhat they should be aiming for is to try to consolidate a style of play that works for them, for that high defensive line to regain the efficiency of last season, for the team to find the focus that makes the system work as it did last year.\nAnd, of course, to try and win the domestic titles over a Real Madrid that seems to be in a very low period.\nPol: As for stabilising their financial situation, I see that as being difficult, too. It’s true that there will be some big wages coming out — with Marcus Rashford’s loan coming to an end, and Andreas Christensen and Lewandowski both likely to leave — but that won’t mean Barca can suddenly operate like Chelsea, Manchester City or Paris Saint-Germain.\nBarca are still able to attract top players, but in the transfer market I think it will be a question of balancing what you want and what you can afford.\nWho will be this year’s breakthrough player?\nPol: The obvious answer for me is Eric Garcia — although he may have made his breakthrough already.\nAdvertisement\nAt the start of the season, it might have seemed more like he was just in a good run of form, but right now I find it hard to imagine a Barca XI without him — and he has impressed at centre-back, right-back and defensive midfield.\nThen there is Martin, who has done really well and will likely keep his place at left centre-back, especially with Ronald Araujo’s period of absence. We don’t know when the Uruguayan will be back, but he will also need time to get back up to speed in training, too.\nLooking further down at the academy players whose break is yet to come, there’s a bit of a problem for me. I don’t think it will be as easy for this next generation because of the young age of the current team.\nEven so, if I have to name one, it’s Dro Fernandez. The dressing room has been raving about him ever since pre-season. But I would like to think Marc Bernal will get his chance as well.\nLaia: To say something different, because I had also thought of those same names, I would suggest Jofre Torrents. The 18-year-old left-back could end up getting a chance this season because full-back is a position where Barca lack depth.\nRight now, you have Jules Kounde, who is a centre-back, playing at right-back with no competition. And on the left, everyone is praying that Alejandro Balde doesn’t catch a cold.\nMartin could fill in at left-back, but there is also a shortage of centre-backs, which is why Flick is using him there. Torrents has been promoted to the first team and I know he is one of the club’s next projects.\nHe is very popular and a player I would keep an eye on — even if his breakthrough might not come this term.",
  "word_count": 1048,
  "scraped_at": "2026-02-14T01:59:31.503784",
  "_text_extracted": true
}