{
  "article_id": "6cfe3a2d6807",
  "url": "https://www.90min.com/real-madrid-consider-surprise-u-turn-kepa-arrizabalaga-transfer-report",
  "title": "Real Madrid consider surprise U - turn on Kepa Arrizabalaga transfer",
  "date": "20240619T193000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid consider surprise U-turn on Kepa Arrizabalaga transfer - report\n- Real Madrid interested in re-signing Kepa Arrizabalaga\n- Goalkeeper spent last season on loan at Los Blancos from Chelsea\n- European champions initially decided against keeping Kepa\nBy Sean Walsh\nReal Madrid are weighing up a fresh move to sign Kepa Arrizabalaga from Chelsea, a report in Spain claims.\nKepa spent the 2023/24 season on loan at Los Blancos, having fallen down the pecking order at Stamford Bridge, with summer signings Robert Sanchez and Djordje Petrovic both preferred by head coach Mauricio Pochettino.\nThough Pochettino has been replaced by Enzo Maresca in the Blues dugout and the Italian is noted for wanting his goalkeepers to play from the back - a skill neither Sanchez nor Petrovic particularly excels in - it remains a distinct possibility that Kepa will leave Chelsea again.\nMadrid initially decided against re-signing Kepa after he also tumbled behind Andriy Lunin on Carlo Ancelotti's list of goalkeepers during his year-long loan.\nHowever, Relevo report that the newly-crowned European champions are considering Kepa again as Lunin, who has returned to a back-up role behind fit-again Thibaut Courtois, may be sold.\nKepa began life at Madrid as a starter after Courtois tore his ACL, but after picking up an injury of his own and putting in a string of subpar performances, he in turn lost his place to Lunin, who received widespread praise for his displays.\nThis has led to Lunin being heavily linked with a move away from Madrid in search of first-team football following Courtois' return to fitness, with the Belgian notably coming back in for the Champions League final against Borussia Dortmund when the Ukrainian was ill.\nMadrid were impressed by Kepa's conduct off the pitch during his loan spell and he was well-liked by teammates, while he was credited with helping Lunin in their penalty shootout win at Manchester City in the quarter-finals of the Champions League.\nTherefore, Madrid see the 'sensible' side of signing Kepa on a fresh loan so they can use transfer funds on other positions.\nKepa's Chelsea contract expires in 2025 but the club do not intend to keep him in the long-term, and so another loan until the end of his deal has not been ruled out.",
  "word_count": 379,
  "scraped_at": "2026-02-14T01:57:18.890491",
  "_text_extracted": true
}