{
  "article_id": "6d04b8f74dbb",
  "url": "https://www.citizen.co.za/news/daily-news-update-18/",
  "title": "Daily news update : Ramaphosa , Malema , Mbeki , Zuma and football",
  "date": "20240526T071500Z",
  "domain": "citizen.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Here’s your morning news update: An easy-to-read selection of our top stories. Stay up to date with The Citizen – More News, Your Way.\nHere’s your morning news update: An easy-to-read selection of our top stories. Stay up to date with The Citizen – More News, Your Way.\nDaily news update – 26 May\nWATCH: Ramaphosa tells ANC supporters to vote for ‘handsome guy like me\nPresident Cyril Ramaphosa has told supporters to vote for the African National Congress (ANC) and to look for a “handsome man” like him on the ballot when voting.\nRamaphosa addressed scores of ANC supporters in what sounded more like a state of the nation address than a stump speech at the party’s Siyanqoba rally at the FNB stadium in Soweto on Saturday.\nRamaphosa said people will decide if the country “moves forward with the ANC, or backwards to a terrible past.”\nRamaphosa told supporters to vote for the ANC on all three ballot papers on election day.\n“When you get there, look for a handsome face and vote for him, not the ugly ones. Look out for a handsome guy like me. Let’s go out there and make sure that there is one bull in the kraal. There are many who don’t want us to come back but we will show them on Wednesday.”\nWATCH: Mbeki unable to attend ANC Siyanqoba rally due to hospitalisation\nIn other election news, former president Thabo Mbeki was unable to attend the African National Congress’ (ANC) Siyanqoba rally due to being hospitalised.\nThe ANC’s almost three-month election campaign period will culminate in its Siyanqoba rally at the FNB stadium outside Soweto in Johannesburg on Saturday.\nIn a video message Mbeki said he had been hospitalised for flu.\n“Unfortunately due to bout of flu, I’m unable to be with you in person this morning. This is why you have not seen me on the campaign trail for a week. This is because I have been hospitalised.”\nWATCH: Malema vows to ‘raid Phala Phala’ when EFF takes over SA\nEconomic Freedom Fighters (EFF) leader Julius Malema said the party will reopen the Phala Phala game farm matter when it takes over South Africa.\nWith just a few days left for the national and provincial elections, the red berets concluded their campaign at Peter Mokaba Stadium in Polokwane, Limpopo on Saturday.\nSouth Africans will go to the polls on 29 May in what is expected to be the mostly hotly contested elections since the dawn of democracy 30 years ago.\nDuring his address, Malema took a swipe at ANC president Cyril Ramaphosa, saying should the EFF come into power, it will raid the president’s Phala Phala game farm in Polokwane.\n“When we take over South Africa, we are going open Phala Phala and we are going to raid Phala Phala because we suspect there are more Dollars left at Phala Phala.”\nWATCH: MK party claims sabotage amid another Zuma no show at rally\nWith just three days left before South Africans got the polls, the uMkhonto weSizwe (MK) party claims it is being sabotaged.\nSeveral political parties wrapped up their election campaigns on Saturday ahead of the elections on 29 May.\nMK party secretary general Sihle Ngubane claims people don’t want the party to succeed in the elections.\n“A child which is six-months-old, when it teats out, it gives all sorts of problems. President Zuma is giving birth to a new child. It’s getting sabotaged left, right and centre by the other organisations of the yellow shirts.\n“They are sending all their spooks left, right and centre to make sure that they sabotage our work, that we mustn’t succeed. But they will be disappointed because our people are tireless in supporting MK. They come out all in numbers, you’ve seen the Orlando Stadium, how they came out in numbers,” Ngubane said.\nWiFi caper gone wrong: School security guard opens fire on pupils, kills one, wounds another\nIn crime news, a security guard was arrested on Thursday evening, following the fatal shooting of a 13-year-old boy and the injury to his friend at the Matafeni Junior Secondary School in Lusikisiki, Eastern Cape.\nThe 62-year-old man faces charges of murder, attempted murder, possession of a prohibited firearm due to obliterated serial number, and illegal possession of ammunition.\nHe is set to appear before the Lusikisiki Magistrate’s Court on Monday.\nUnclear whether Guptas arrested for builder’s suicide are connected to State Capture brothers\nJustice Minister Ronald Lamola said it is “unclear” at this stage whether the two Guptas who were arrested on Friday for their alleged involvement in the death of a Dehradun builder in India, are related to the State Capture-accused brothers.\nIn a news report from The New Indian Express, the publication alleges that the incident is connected to Ajay Gupta – one of the controversial Gupta brothers – and his brother-in-law Anil Gupta.\nAjay and Anil were taken into custody by police on Friday at their home in the Dalanwala area of Dehradun for reportedly abetting the suicide of the 52-year-old Satyendra Singh Sahni.\nPirates qualify for Champions League after draw with SuperSport\nIn football news, Orlando Pirates qualified for next season’s Caf Champions League following a 1-1 draw with SuperSport United in a DStv Premiership match played at the Orlando Stadium on Saturday afternoon.\nAs expected, the game started at a frantic pace with both teams throwing men forward in search of an early goal, but there were no clear-cut chances earlier on.\nDeon Hotto came close to opening the lead for the Buccaneers in the 21st minute, but his shot down the left flank was saved by Ricardo Goss.\nGoss was called into action again three minutes later when Thabiso Sesane tried his luck from long range, but he found the goalkeeper well positioned and Goss made a routine save.\nMan United stun Man City in FA Cup final to give Ten Hag hope of avoiding the sack\nIn FA Cup news, Erik ten Hag made a convincing case to be spared the sack as Manchester United upset Manchester City to win the FA Cup with a shock 2-1 victory in Saturday’s final.\nTen Hag was reportedly set to be dismissed regardless of the result at Wembley after a troubled campaign that even the United manager described as “terrible” this week.\nBut United’s hierarchy might be having second thoughts after Ten Hag’s tactical masterclass ruined City’s history bid.\nCity were hot favourites to win a second successive Premier League and FA Cup double.\nSupport Local Journalism\nAdd The Citizen as a Preferred Source on Google and follow us on Google News to see more of our trusted reporting in Google News and Top Stories.",
  "word_count": 1115,
  "scraped_at": "2026-02-14T01:48:52.520880",
  "_text_extracted": true
}