{
  "article_id": "6d2b5d9451fc",
  "url": "https://www.uefa.com/insideuefa/news/0282-185d513bd18e-32f59d9c7dea-1000--lisbon-to-host-2025-uefa-women-s-champions-league-final/",
  "title": "Lisbon to host UEFA Women Champions League final in 2025 | Inside UEFA",
  "date": "20230629T130000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lisbon to host UEFA Women's Champions League final in 2025\nWednesday, June 28, 2023\nArticle summary\nAthens and Wrocław will stage the next two finals of the UEFA Europa Conference League.\nArticle top media content\nArticle body\nThe UEFA Executive Committee met today at the House of European Football in Nyon, Switzerland and took a series of decisions as follows:\nLisbon to host UEFA Women's Champions League Final 2025\nThe Estádio José Alvalade (home to Sporting Clube de Portugal) in Lisbon was appointed to host the UEFA Women's Champions League Final in 2025.\nAthens and Wrocław to stage the UEFA Europa Conference League Final in 2024 and 2025\nThe Executive Committee appointed the Agia Sofia Stadium in Athens (AEK Athens FC) and Stadion Wrocław (WKS Śląsk Wrocław) for the UEFA Europa Conference League finals in 2024 and 2025, respectively.\nRegarding the Athens venue, as the stadium is new and has not yet hosted international club football, UEFA will provide expertise and an observation period until November 2023 at matches played by AEK Athens in the UEFA club competition for which they will qualify, and by the Greek national team in EURO 2024 qualifiers. This has been added as a condition for the confirmation of the appointment, which would happen in December.\nPoland to host 2025 UEFA European Women's Under-19 Championship\nThe Executive Committee appointed Poland as the hosts of the UEFA European Women's Under-19 Championship in 2025.\nFormat of European Qualifiers for the 2026 FIFA World Cup\nUEFA will recommend to FIFA to use the following format for qualification of the 16 European teams to the 2026 FIFA World Cup.\nThe European qualification path to the World Cup to be split into two stages: group stage and play-offs.\nThe group stage consists of the traditional league format of home and away matches and is played in 12 groups of 4 or 5 teams between March and November 2025. The 12 group winners qualify directly for the 2026 FIFA World Cup. The 12 group runners-up shall participate in the play-offs which will be played in March 2026. In addition to those 12 sides, the best-ranked four group winners of the 2024/25 UEFA Nations League that have not finished their European Qualifiers group stage in first or second place will make up the 16-team play-offs.\nThe play-off matches will be played in single-leg semi-finals followed by single-leg finals within the same international match window. The 16 teams entering the play-offs will be drawn into four play-off paths of four teams each.\nUEFA EURO 2024 draws\nThe procedures for the play-off draw and the final draw of UEFA EURO 2024 were approved.\nNew UEFA Club Licensing and Financial Sustainability Regulations – Edition 2023\nThe UEFA Executive Committee endorsed a few important amendments to the UEFA Club Licensing and Financial Sustainability Regulations which will come into force on 1 July 2023.\nThe new regulations define the accounting treatment to be followed on the amortisation of player's registration and in case of player exchange transactions (so called \"swaps\").\nThe amortisation of the player's registration will be limited to five years in order to ensure equal treatment of all clubs and improve financial sustainability. In case of contract extension, the amortisation can be spread over the extended contract period but up to a maximum of five years from the date of the extension. Such a change will not restrict the way in which clubs operate (i.e. clubs that are allowed by their national governing bodies to conclude player contracts for a period exceeding five years can continue to do so) and will not apply retroactively to transfer operations that have already taken place.\nWith regard to the player exchange transactions, the regulation specifies that it is the responsibility of the clubs to assess whether a transfer operation should be qualified as a swap, in which case it shall be accounted for in line with the international accounting standards. This approach aims at dissuading that transfer operations take place with the sole intent to artificially inflate transfer profits rather than for sporting purposes.\nIt is now required that clubs' auditors confirm the correct application of the described accounting requirements and report any discrepancy should this not be the case.\nUEFA Europa Conference League renamed to UEFA Conference League\nIntroduced under the 'Europa' umbrella at the start of the 2021-24 commercial cycle, the new competition has quickly established itself within a broad audience after two successful seasons.\nResearch among fans as well as commercial partners has found that removing 'Europa' from the name of the competition will enable further development as a standalone competition and this proposed change was approved by the UEFA Executive Committee. It will be effective in the new cycle, as of the 2024/25 season.\nTogether with the UEFA Europa League, the UEFA Conference League will continue to deliver 'Thursday Night Football' to fans across Europe and beyond. A strong link between the competitions will remain in place as both brand identities will remain very close, and both competitions will continue to be sold to broadcast partners and sponsors together.\nMinimum Standards Framework for Women's National Teams adopted\nFollowing comprehensive independent research and extensive consultation with national associations, national team captains, and FIFPRO Europe representatives, the UEFA Executive Committee has approved the UEFA Minimum Standards Framework for Women's National Teams.\nThis innovative new initiative ensures that the same minimum standards and conditions are available for all senior women's national team players across the 55 national associations.\nThe framework, which includes sporting/technical provisions and good governance provisions, will be incentivised by the UEFA HatTrick Programme and will play a significant role in strengthening the relationship between national associations and players.\nThe details of the framework will be made available in due course.\nStanding Facilities Observers' Programme extended\nThe UEFA Executive Committee approved the extension of the Standing Facilities Observers' Programme which included three of the top five UEFA ranked national associations where standing facilities are permitted at domestic level (i.e. England, Germany & France) for the 2023/24 season under the same conditions to allow the UEFA administration time to conduct further study and draw up guidelines.\nNew format for the UEFA Youth League\nThe competition will adapt to the format change of the senior UEFA club competitions and include the 36 youth teams of the clubs which qualify for the league phase of the 2024/25 UEFA Champions League (Champions League path). The Domestic Champions path will be restructured to include the domestic youth champions of all UEFA member associations (currently participation is limited to the top 32 associations of the ranking list).\nIf a club qualifies for both the Champions League path and the Domestic Champions path, it automatically participates in the Champions League path and the vacancy in the domestic path is filled by the runner-up of the same association.\nThe UEFA Youth League titleholder automatically qualifies for the Domestic Champions' path unless the club has qualified for the Champions League path.\nThe league stage will mirror the UEFA Champions League 'leagues stage' but limited to the first six matchdays, with the same matches played in both competitions (three at home and three away).\nThe Domestic Champions path will consist of three rounds played under the cup (knockout) system with two-legged ties (home and away matches). The clubs of the top-ranked associations will enter in the second round.\nAt the end of these initial phases a single knockout phase will be played with one-leg ties starting with the round of 32. The clubs ranked 1 to 6 (Champions League path) will qualify for the round of 32 and play against the clubs ranked 17 to 22. The clubs ranked 7 to 16 will face the 10 clubs that qualify via the Domestic Champions path in the round of 32.\nThe clubs ranked 23 and lower in the Champions League path are eliminated from the competition, as well as those losing the knockout rounds of the Domestic Champions path. The tournament will conclude with a final four (semi-finals and final) played at a neutral venue.\nFor the round of 16, the quarter-finals and semi-finals, the pairings will be determined by means of a draw.\nNext meeting of the UEFA Executive Committee\nThe next meeting of the UEFA Executive Committee is scheduled for 26 September 2023 in Limassol, Cyprus.",
  "word_count": 1382,
  "scraped_at": "2026-02-14T01:48:17.230205",
  "_text_extracted": true
}