{
  "article_id": "6d459b5ce21d",
  "url": "https://www.anglocelt.ie/2025/10/20/harry-maguire-anfield-win-a-benchmark-but-man-utd-must-find-consistency/",
  "title": "Harry Maguire : Anfield win  a benchmark  but Man Utd must find consistency",
  "date": "20251020T071500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harry Maguire: Anfield win ‘a benchmark’ but Man Utd must find consistency\nBy Simon Peach, PA Chief Football Writer\nHarry Maguire was delighted to end Manchester United’s “embarrassing” wait for back-to-back Premier League victories and targeted further success after Sunday’s win at rivals Liverpool.\nThe Red Devils celebrated a first victory at Anfield since January 2016 as the towering defender powered home shortly after Cody Gakpo had cancelled out Bryan Mbeumo’s early opener.\nMaguire’s late header secured a memorable 2-1 win that gave boss Ruben Amorim successive league victories for the first time since taking charge last November.\nUnited last won back-to-back league games in the same season at the end of the 2023/24 campaign and Maguire told the BBC: “It’s embarrassing really.\n“It’s not a stat that we should even be speaking about, because it is an embarrassing stat to have.\n“Now that’s out of the way, let’s try and make it three on Saturday against Brighton, because we have to start putting a bit more consistency together.\n“The last three or four years we’d put in a performance like this and the following game we come down again.\n“We have set a benchmark. There are a lot of areas we can do more, we were hanging on there and defending for the last 30 minutes or so.\n“We’ll analyse it. The manager strives for perfection, so I’m sure he will want us to play better than we did in the second half. Great fight, big spirit, big win, but we have to go again.”\nIt's not a stat that we should even be speaking about, because it is an embarrassing stat to haveHarry Maguire on ending wait for successive league wins\nAmorim echoed those sentiments as United turn their attention to Brighton’s visit.\n“Of course it is really important – I don’t have many wins in Manchester,” the Portuguese said.\n“It is really important that it is back to back, that it is at Anfield.\n“Every detail of this game it is something I’ve been speaking about for a while – the spirit when we suffer a bad moment or a goal, maintain the composure.\n“Today all the small things today were perfect. Let’s try to do that next week. That is really important.”\nSunday’s result dealt another gut punch to Liverpool as the champions suffered a fourth straight defeat in all competitions.\n“I think as a manager you constantly face challenges,” boss Arne Slot said ahead of Wednesday’s return to action in the Champions League at Eintracht Frankfurt.\n“Now we have lost four times in a row and that’s also a challenge, so the life of a football manager is an ongoing challenge.\n“If you win games, you want to keep winning. If you lose games, you want to start winning again.\n“Do we lose confidence? I cannot see it yet, because every single game we’ve lost we were able to create in the second half an unbelievable amount of chances.\n“If you look at the three games we lost in the Premier League, if you put all the highlights behind each other you would say it is hardly possible that they lose this game.\n“So, if we can keep producing what we are doing and do a few things a little bit better, then there is every reason to expect that we start to win football games again.”\nSlot said Ryan Gravenberch suffered a twisted ankle and fellow midfielder Alexis Mac Allister needed four stitches after being caught by Virgil van Dijk.\nMbeumo scored after play continued despite Mac Allister’s head injury and Slot said: “The main thing I should do now is not complain, blame or do these kind of things.\n“We could have done much better after Macca was on the floor, we should have done better, but the health care of the players is something that is important and, if a player needs four stitches, you would hope everyone understands he needs immediate treatment.\n“It didn’t happen, but again we could have done better, so that is not the reason we lost today. The reason is we missed far too many chances to win a game of football.”",
  "word_count": 695,
  "scraped_at": "2026-02-14T01:52:49.022409",
  "_text_extracted": true
}