{
  "article_id": "6d4fdb63486c",
  "url": "https://thepeoplesperson.com/2025/05/03/newcastle-looking-to-hijack-manchester-uniteds-deal-for-matheus-cunha-in-case-of-europa-league-failure-293594/",
  "title": "Newcastle looking to hijack Manchester United deal for Matheus Cunha in case of Europa League failure - Man United News And Transfer News",
  "date": "20250503T230000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are expected to improve their team’s attack in the summer to address Rasmus Hojlund’s dire form and the lack of service he has received.\nAnd INEOS have started their work pretty early going by reports that the Red Devils are on course to complete the signing of Matheus Cunha from Wolverhampton Wanderers.\nPersonal terms have been verbally agreed while Wolves are reportedly open to receiving the Brazilian’s release clause in instalments.\nThe former Atletico Madrid star has 17 goals and six assists this season and he has already impressed Ruben Amorim with his creativity and eye for a pass.\nCunha is the perfect fit for Amorim\nHis versatility is also a huge draw, given he can play up front, as a withdrawn forward, out wide and even as an attacking midfielder.\nPlenty of suitors were after the Brazil international including Newcastle but United’s offer was supposed to signal the end of their pursuit.\nBut not as per The Daily Mail, where journalist Craig Hopes writes that should Amorim’s side fail to clinch the Europa League, the Magpies could pounce and win the race by offering Champions League football to the 25-year-old.\n“What about Matheus Cunha? I think this is slightly different in that the versatility Newcastle identified in the Wolves forward would have made it feel like two signings for the price of one (even if that was £62.5m).\nNewcastle still eyeing Cunha\n“Eddie Howe, and others, believe Cunha can play as a 7, 8, 9 & 11. Sadly, for Newcastle, it looks like Manchester United have offered a salary package way beyond where Newcastle can currently go.\n“However, if Man United fail to make the Champions League and Newcastle do, there may still be a twist or two in that one.”\nAs per reports, Cunha is open to a move to Old Trafford even without the prospect of Champions League football on offer so it seems Hope’s argument holds no water.\nAlso, as things stands, United seem favourites to make the Europa League final. And hopefully, even that doubt can be erased from the equation.\nEven Arsenal were planning a hijack but even they have since admitted defeat. It seems only a matter of time before the 20-time English league champions get their man.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 382,
  "scraped_at": "2026-02-14T02:15:07.783571",
  "_text_extracted": true
}