{
  "article_id": "6d819e80a300",
  "url": "https://www.teamtalk.com/manchester-united/bruno-fernandes-wish-comes-true-man-utd-make-new-plan-50m-transfer-raid-wolves",
  "title": "Bruno Fernandes wish comes true as Man Utd make new plan for £50m transfer raid on Wolves",
  "date": "20230418T083000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nBruno Fernandes wish comes true as Man Utd make new plan for £50m transfer raid on Wolves\nMan Utd have joined the race to sign Matheus Nunes from Wolves this summer, which will be much to the approval of Bruno Fernandes, according to reports.\nNunes has settled in well during his debut season in the Premier League after joining Wolves from Sporting CP in the summer. The club-record transfer has reaped rewards for Wolves, who will likely be able to sell the 24-year-old for a profit when the time comes.\nAfter his arrival into English football, it didn’t take long for Nunes to appear on Liverpool’s radar. Links with Jurgen Klopp’s team have persisted, but an update from Football Insider has confirmed Man Utd are now in contention to sign him as well.\nAccording to the website, Nunes is one of the names on Man Utd’s shortlist to strengthen their midfield. He could be brought in at Old Trafford as a replacement for the exit-linked Scott McTominay or Marcel Sabitzer, depending on the latter’s future beyond his loan spell from Bayern Munich.\nThe report claims Wolves could accept an offer in the region of £50m for Nunes, despite having him under contract until 2027 with the option for a further year.\nIn addition to Liverpool, Man Utd would have to see off competition from Barcelona and Newcastle United for Nunes’ signature.\nIf they can win the race to sign him, though, it would be warmly received by current Man Utd midfielder Fernandes. Back in August, Nunes’ Portugal teammate told Eleven Sports: “I’ve already talked to him. I’ve already told him that he should have come here and not there. I’m very happy for him.”\nMatheus Nunes making quick impression in English football\nDuring his first season in a Wolves shirt, Nunes has played 32 times in all competitions, getting one goal and an assist from his 27 Premier League appearances.\nCapable of playing in a variety of midfield roles, either centrally or off to the left-hand side, Nunes could make himself useful in several ways to whoever takes him next.\nMan Utd will be hoping to win the race, since Ten Hag wants to add another creative midfielder to his squad. Although Nunes hasn’t contributed to many goals this season, he has shown the ability to earlier in his career.\nHis feelings on whether it is the right time to leave Wolves or not remain to be seen. But it will surely be pleasing for him to see his name linked with some high-calibre clubs.\nAs someone who has played in the Champions League and Europa League before for Sporting, Nunes should feel worthy of earning opportunities at a higher-ranking team, but he will have to judge how much gametime he would get at any destination compared to what Julen Lopetegui currently gives him for Wolves.\nREAD MORE: Deja vu for faltering Man Utd star as former club line up summer swoop with Ten Hag warming to exit",
  "word_count": 504,
  "scraped_at": "2026-02-14T01:55:54.956851",
  "_text_extracted": true
}