{
  "article_id": "6dba5e507546",
  "url": "https://www.dundalkdemocrat.ie/news/home/1236672/joe-carroll-stephen-kenny-can-take-inspiration-from-mick.html",
  "title": "Joe Carroll : Stephen Kenny can take inspiration from Mick",
  "date": "20230701T143000Z",
  "domain": "dundalkdemocrat.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ireland manager Stephen Kenny. (Pic: Sportsfile)\nWhen you’re on the ropes, there’s only one thing to do and that’s keep fighting. Either that or get your secondary to throw in the towel.\nStephen Kenny has taken a pounding since succeeding Mick McCarthy as the Republic of Ireland manager, three years ago.\nNot from supporters, but the media. Those who populate the stands and terraces retain faith in him, judged by the near capacity crowd at The Aviva yesterday week after a very poor performance three days earlier.\nThere’s no doubt the former Dundalk boss has been getting it rough almost from the very start of his stint with the green jersey. He got an easy ride when he was at Oriel, and why shouldn’t he? The success he brought there was unprecedented, and he was never likely to have awkward questions to answer.\nIt earned him the job with the country’s under-21s before his graduation to the senior side. Like the rest of us, he could have done with Covid staying away, but it didn’t, and as he was getting his feet under the table, he had to deal with more than just the lack of vocal support for his side.\nThe pandemic wasn’t making any distinction between sportspeople and ordinary folk. In some of his early games, the new manager wasn’t able to field his preferred side. In the time since, results haven’t been good. And because of this, there’s been no send-off to any of the major international tournaments.\nIt’s odds-on it will be the same as Euro 24 gathers momentum. Kenny’s side have so far gathered just three points from as many outings, and with games against the Group B top teams to come, finding a place in the line-up for the finals in Germany next year won’t be easy.\nThe Republic were probably at their worst in the away match with Greece last Friday week, losing 2-1, and, in the words of those reporting and commenting on the team’s affairs, defeat all but ruled out qualification. Much appeared in print and in commentary, and central to criticism was the manager.\nHow much those with the pens, computers, laptops and mics in front of them were impressed when on the following Monday night Ireland beat Gibraltar 3-0 at home, can usually be gauged by how they view the interview with Kenny afterwards.\nThis has often exercised your writer’s mind. As a game – in any sport – heads up the home straight, what does the manager of the losing side be thinking: is it, how do I explain this to the media afterwards?\nIf Stephen Kenny was forced into a corner by the hacks in Athens and found it difficult to find a way out, he wasn’t going to let the same happen in Dublin.\nOkay, so he had a rare victory to his credit, but having beaten a team ranked 201st in the world rankings, scoring nothing in the opening half, the critics were never likely to be silent.\nAnd neither were they for the first three or four minutes of an interview that would last almost 11. But after answering questions, some of them in the mundane category, Kenny bared his teeth, first of all telling his Second to go blow his nose with the towel. He then put his record in full view. Reporters are said to have been “wide-eyed” as he spoke, none of them choosing to interrupt.\nKenny listed his achievements as a manager, and it made impressive reading. What he said:\n“I’ve been in 16 cup finals; I have been in eight FAI Cup finals; I won six League Cups. I won more trophies than anyone in modern history. I won five league titles; (coached) 46 Champions League and Europa League games; I beat Maccabi Tel Aviv, BATE Borisov, Gothenburg (home and away), Hajduk Split and others, drew with Paris Saint Germain, drew with Legia Warsaw.\n“That’s why I got the (Republic of Ireland) job, because I am the most successful Irish manager at this time.”\nKenny went on to explain the strategy he has adopted since taking the Senior gig, one which has given senior debuts to several he had under his charge when manager of the under-21 side.\nAs many as 18 players have been given senior caps since he took over from McCarthy. He praised his backroom staff, three former Internationals among them, Keith Andrews, John O’Shea and Dean Kiely.\nThen in response to having been told at a press gathering the Sunday after the Greece defeat that his record as manager was “shambolic” – leaving him to ask for “some respect” – the manager answered that he was strong and very resilient, “and I don’t really care (about what’s being said).”\n“I don’t need to listen to anyone’s opinions to know what I want and what I am.” He added: “I’ve made brave decisions (as Republic manager) in the best interest of Irish football.”\nEver see the spoof soccer film, Mike Bassett: England Manager? Mike, played by the excellent Ricky Tomlinson, has his team in Brazil for the World Cup, with Dave Dodds (Bradley Walsh) one of his assistants. If you’re offended by bad language, don’t look it up.\nBad enough that results aren’t good, but on the eve of the game that gave England their last chance of advancing in the competition, Mike gets stoned along with one of his players, and was caught.\nHe wasn’t sacked, but was expected to announce his resignation at the following day’s press conference. It began in a fashion that stunned those in the room, Mike quoting all six verses of Kipling’s “If”.\n“If you can keep your head when all about you are losing theirs....” down to the last line, “And – which is more – you’ll be a man, my son.”\nThere was silence until Mike leaned closer to the mic and said, in his loudest voice, that he’d be staying on, “and we’ll be playing 4, 4 (beep) 2.”\nEngland got a result before being eliminated at the semi-final stage. Bassett returned to England a hero.\nThat’s fantasy; for Stephen Kenny it’s all very real. But there’s no chance the Dubliner will ever go on the sauce, or quote Kipling, or disclose what system his team is going to play. But as he showed at The Aviva, he is not going to be deflected as he goes about doing the biggest job of his managerial career.\nWhat he badly wants is some good results in the five games yet to be played. The first of them – against France in Paris – is coming up in on September 6th.\nIf they’re to have any chance of making next year’ tournament, Kenny’s side will have to take something from this game, ‘something’ being all three points.\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nADVERTISEMENT - CONTINUE READING BELOW\nSubscribe or register today to discover more from DonegalLive.ie\nBuy the e-paper of the Donegal Democrat, Donegal People's Press, Donegal Post and Inish Times here for instant access to Donegal's premier news titles.\nKeep up with the latest news from Donegal with our daily newsletter featuring the most important stories of the day delivered to your inbox every evening at 5pm.",
  "word_count": 1254,
  "scraped_at": "2026-02-14T02:07:02.883127",
  "_text_extracted": true
}