{
  "article_id": "6de786e84664",
  "url": "https://www.caughtoffside.com/2025/05/31/club-world-cup-chelsea-man-city/",
  "title": "When is the Club World Cup as Chelsea , Man City prepare",
  "date": "20250531T140000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This summer will see the first edition of the new-look Club World Cup tournament, as the likes of Chelsea, Manchester City and Real Madrid prepare to compete for the prestigious trophy.\nThis new competition is really an expanded version of the Club World Cup we’ve seen before, but which previously featured fewer teams.\nChelsea and Man City have actually won the trophy before, as have Manchester United and Liverpool, but Premier League clubs previously had to qualify by winning the Champions League, and even then would only take part in a semi-final and final.\nSo, how does the new-look Club World Cup look and when is it on this summer? We’ve got all the info for you below…\nWhen is the Club World Cup?\nNot long after the traditional end of the club season, fans can look forward to even more football as the Club World Cup kicks off on the 15th of June.\nThe tournament will then run for almost a month, with the final set to take place on the 13th of July.\nHere’s the full Club World Cup schedule:\nGroup stage\nSunday June 15\nGroup A: Al Ahly vs Inter Miami – Hard Rock Stadium, Miami; kick off 1am\nGroup C: Bayern Munich vs Auckland City – TQL Stadium, Cincinnati; kick off 5pm\nGroup B: PSG vs Atletico Madrid – Rose Bowl Stadium, Los Angeles; kick off 8pm\nGroup A: Palmeiras vs Porto – MetLife Stadium, New York New Jersey; kick off 11pm\nMonday June 16\nGroup B: Botafogo vs Seattle Sounders – Lumen Field, Seattle; kick off 3am\nGroup D: Chelsea vs TBC – Mercedes-Benz Stadium, Atlanta; kick off 8pm\nGroup C: Boca Juniors vs Benfica – Hard Rock Stadium, Miami; kick off 11pm\nTuesday June 17\nGroup D: Flamengo vs Esperance de Tunis – Lincoln Financial Field, Philadelphia; kick off 2am\nGroup F: Fluminense vs Borussia Dortmund – MetLife Stadium, New York New Jersey; kick off 5pm\nGroup E: River Plate vs Urawa Red Diamonds – Lumen Field, Seattle; kick off 8pm\nGroup F: Ulsan HD vs Mamelodi Sundowns – Inter&Co Stadium, Orlando; kick off 11pm\nWednesday June 18\nGroup E: Monterrey vs Inter Milan – Rose Bowl Stadium, Los Angeles; kick off 2am\nGroup G: Man City vs Wydad AC – Lincoln Financial Field, Philadelphia; kick off 5pm\nGroup H: Real Madrid vs Al Hilal – Hard Rock Stadium, Miami; kick off 8pm\nGroup H: CF Pachuca vs FC Salzburg – TQL Stadium, Cincinnati; kick off 11pm\nThursday June 19\nGroup G: Al Ain vs Juventus – Audi Field, Washington, D.C; kick off 2am\nGroup A: Palmeiras vs Al Ahly – MetLife Stadium, New York New Jersey; kick off 5pm\nGroup A: Inter Miami vs Porto – Mercedes-Benz Stadium, Atlanta; kick off 8pm\nGroup B: Seattle Sounders vs Atletico Madrid – Lumen Field, Seattle; kick off 8pm\nGroup B: PSG vs Botafogo – Rose Bowl Stadium, Los Angeles; kick off 11pm\nFriday June 20\nGroup C: Benfica vs Auckland City – Inter&Co Stadium, Orlando; kick off 5pm\nGroup D: Flamengo vs Chelsea – Lincoln Financial Field, Philadelphia; kick off 7pm\nGroup D: TBC vs Esperance de Tunis – GEODIS Park, Nashville; kick off 10pm\nSaturday June 21\nGroup C: Bayern Munich vs Boca Juniors – Hard Rock Stadium, Miami; kick off 2am\nGroup F: Mamelodi Sundowns vs Bosurissa Dortmund – TQL Stadium, Cincinnati; kick off 5pm\nGroup E: Inter Milan vs Urawa Red Diamonds – Lumen Field, Seattle; kick off 5pm\nGroup F: Fluminense vs Ulsan HD – MetLife Stadium, New York New Jersey; kick off 11pm\nGroup E: River Plate vs Monterrey – Rose Bowl Stadium, Los Angeles; kick off 11pm\nSunday, 22 June\nGroup G: Juventus vs Wydad AC – Lincoln Financial Field, Philadelphia; kick off 5pm\nGroup H: Real Madrid vs CF Pachuca – Bank of America Stadium, Charlotte; kick off 8pm\nGroup H: FC Salzburg vs Al Hilal – Audi Field, Washington, D.C; kick off 11pm\nMonday, 23 June\nGroup G: Man City vs Al Ain – Mercedes-Benz Stadium, Atlanta; kick off 2am\nGroup B: Seattle Sounders vs PSG – Lumen Field, Seattle; kick off 5pm\nGroup B: Atletico Madrid vs Botafogo – Rose Bowl Stadium, Los Angeles; kick off 5pm\nTuesday, 24 June\nGroup A: Inter Miami vs Palmeiras – Hard Rock Stadium, Miami; kick off 2am\nGroup A: Porto vs Al Ahly – MetLife Stadium, New York New Jersey; kick off 2am\nGroup C: Auckland City vs Boca Juniors – GEODIS Park, Nashville; kick off 7pm\nGroup C: Benfica vs Bayern Munich – Bank of America Stadium, Charlotte; kick off 8pm\nWednesday, 25 June\nGroup D: TBC vs Flamengo – Camping World Stadium, Orlando; kick off 2am\nGroup D: Esperance de Tunis vs Chelsea – Lincoln Financial Field, Philadelphia; kick off 2am\nGroup F: Borussia Dortmund vs Ulsan HD – TQL Stadium, Cincinnati; kick off 8pm\nGroup F: Mamelodi Sundowns vs Fluminense – Hard Rock Stadium, Miami; kick off 8pm\nGroup E: Inter Milan vs River Plate – Lumen Field, Seattle; kick off 11pm\nGroup E: Urawa Red Diamonds vs Monterrey – Rose Bowl Stadium, Los Angeles; kick off 11pm\nThursday, 26 June\nGroup G: Juventus vs Man City – Camping World Stadium, Orlando; kick off 8pm\nGroup G: Wydad AC vs Al Ain – Audi Field, Washington, D.C; kick off 8pm\nGroup H: Al Hilal vs CF Pachuca – GEODIS Park, Nashville; kick off 1am\nFriday, 17 June\nGroup H: FC Salzburg vs Real Madrid – Lincoln Financial Field, Philadelphia; kick off 2am\nKnockout stage – round of 16\nSaturday, 28 June\nMatch 49: Group A winners vs Group B runners-up – Lincoln Financial Field, Philadelphia; kick off 5pm\nMatch 50: Group C winners vs Group D runners-up – Bank of America Stadium, Charlotte; kick off 9pm\nSunday, 29 June\nMatch 51: Group B winners vs Group A runners-up – Mercedes-Benz Stadium, Atlanta; kick off 5pm\nMatch 52: Group D winners vs Group C runners-up – Hard Rock Stadium, Miami; kick off 9pm\nMonday, 30 June\nMatch 53: Group E winners vs Group F runners-up – Bank of America Stadium, Charlotte; kick off 8pm\nTuesday, 31 June\nMatch 54: Group G winners vs Group H runners-up – Camping World Stadium, Orlando; kick off 2am\nTuesday, 1 July\nMatch 55: Group H winners vs Group G runners-up – Hard Rock Stadium, Miami; kick off 8pm\nWednesday, 2 July\nMatch 56: Group F winners vs Group E runners-up – Mercedes-Benz Stadium, Atlanta; kick off 2am\nQuarter-final fixtures\nFriday, 4 July\nMatch 57: Winner match 53 vs Winner match 54 – Camping World Stadium, Orlando; kick off 8pm\nSaturday, 5 July\nMatch 58: Winner match 49 vs Winner match 50 – Lincoln Financial Field, Philadelphia; kick off 2am\nMatch 59: Winner match 51 vs Winner match 52 – Mercedes-Benz Stadium, Atlanta; kick off 5pm\nMatch 60: Winner match 55 vs Winner match 56 – MetLife Stadium, New York New Jersey; kick off 9pm\nSemi-final fixtures\nTuesday, 8 July\nMatch 61: Winner match 57 vs Winner match 58 – MetLife Stadium, New York New Jersey; kick off 8pm\nWednesday, 9 July\nMatch 62: Winner match 59 vs Winner match 60 – MetLife Stadium, New York New Jersey; kick off 8pm\nFIFA Club World Cup Final\nSunday, 13 July\nMatch 63: Winner match 61 vs Winner match 62 – MetLife Stadium, New York New Jersey; kick off 8pm\nWhich teams are in the Club World Cup?\nThe biggest names from England Europe to watch out for are Chelsea, Manchester City, Real Madrid, Atletico Madrid, Bayern Munich, Borussia Dortmund, Paris Saint-Germain, Inter Milan and Juventus.\nFrom elsewhere, we could see some big-name players in action for Saudi and MLS clubs.\nLionel Messi’s Inter Miami will undoubtedly be one star attraction, while Al Hilal also boast big names like Ruben Neves, Kalidou Koulibaly and Joao Cancelo on their books.\nAnd of course, there are so often some underrated gems to watch out for from South America, so keep an eye on Brazilian sides Palmeiras and Fluminense, as well as Argentinian giants Boca Juniors and River Plate.\nWhat’s the prize money for winning the competition?\nThere’s a huge amount up for grabs for the winners of the 2025 Club World cup – £97m ($125m).\nIt may be a new tournament, at least in this format, but it’s no wonder clubs have been so keen to take part in it even after such long and gruelling seasons.\nFor comparison, you can win £176m for winning the Premier League, £135m for winning the Champions League, and just £3.9m for the FA Cup.\nHow does it impact the summer transfer window?\nIn another unusual twist for this summer, there will be a mini transfer window running from June 1st until June 10th before a longer one later on.\nThis allows clubs competing in the Club World Cup to bring in new players early so they can compete in the tournament.\nPlayer contracts tend to run from July 1st until June 30th, so it also means we’re seeing things like Trent Alexander-Arnold moving to Real Madrid for a €10m fee, rather than waiting to join as a free agent later.\nIf Real had waited to sign Alexander-Arnold at the end of his contract, he’d have been free, but wouldn’t have been able to play for them in the Club World Cup, so Madrid will feel it was worth paying a small amount to get him in earlier.\nWhen you look at the prize money on offer, with Los Blancos sure to be one of the tournament favourites, it’s hard to argue against that probably being a smart decision.\nHas the Club World Cup been controversial?\nThere’s no doubt that the introduction of this new tournament has attracted criticism.\nOn the face of it, it’s pretty clear that this is yet another money-spinner by FIFA, and it seems far from ideal for player welfare.\nWe’re already seeing so many injuries due to high work load, with the footballing calendar busier than ever, and with the modern game so fast and intense.\nFans will be glad of more football to watch over the summer, but it will be interesting to see what kind of quality of football we see from what may likely be a lot of tired players.",
  "word_count": 1708,
  "scraped_at": "2026-02-14T02:09:11.439539",
  "_text_extracted": true
}