{
  "article_id": "6dec13bd46d5",
  "url": "https://www.aol.co.uk/manchester-city-sign-porto-midfielder-230302765.html",
  "title": "Manchester City sign Porto midfielder Nico Gonzalez for £50m",
  "date": "20250203T233000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City sign Porto midfielder Nico Gonzalez for £50m\nManchester City have completed the deadline-day signing of Porto midfielder Nico Gonzalez for 60 million euros (£49.9m).\nPep Guardiola’s men have been busier than usual during the winter transfer window as the Premier League champions look to recover from a bumpy first half of the season.\nCity forked out a combined £122.5m to bring in Frankfurt forward Omar Marmoush, Palmeiras defender Vitor Reis and Lens centre-back Abdukodir Khusanov in January.\nThe PA news agency understands that spending increased by £49.9m as Spain Under-21 international Gonzalez joins from Porto, signing a deal until 2029.\nWelcome, Nico! pic.twitter.com/dvHbM9XIXE\n— Manchester City (@ManCity) February 3, 2025\n“This is the perfect opportunity for me at this stage of my career,” he said. “I am 23 and I want to test myself in England. There’s no better club than Manchester City for me to do that.\n“Look at the squad they have here, it’s unbelievable, full of world-class players. There isn’t a footballer in the world who would not want to be part of this setup.\n“I know the reputation Pep has and I cannot wait to work with him. In fact, I am honoured he wants me to play in his team.\n“I am truly excited. I just want to meet my teammates, and the staff here and then I want to play in front of the City fans!”\nCity director of football Txiki Begiristain added: “Nico is a very talented young midfielder. He is an ideal acquisition for Manchester City.\n“It was a difficult transfer to complete because his performances have been outstanding, and he has been such an important part of what FC Porto are doing this season.\n“We are really happy we have managed to get this done before the window closed.\n“He is ready to help us in the second half of the season as we compete in the Premier League, Champions League, FA Cup and Club World Cup.”\nBarcelona academy graduate Gonzalez will help fill the gap left by compatriot by Rodri, who is recovering from an anterior cruciate ligament injury sustained in September.\nThe current Ballon d’Or winner looks unlikely to play again this season.\nCity sit fifth in the Premier League after Sunday’s 5-1 hammering at Arsenal and have a Champions League knockout round play-off to come against Real Madrid this month.",
  "word_count": 394,
  "scraped_at": "2026-02-14T02:18:11.281935",
  "_text_extracted": true
}