{
  "article_id": "6df94e326fae",
  "url": "https://www.geosuper.tv/latest/22911-comeback-kings-madrid-in-their-element-amid-european-chaos",
  "title": "Comeback kings Madrid in their element amid European chaos",
  "date": "20230222T080000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By AFP\nFebruary 22, 2023\nBARCELONA: Real Madrid made their name as the kings of Europe who can never be written off, and they proved it once again at Anfield against a bewildered Liverpool on Tuesday night.\nDespite falling two goals behind in the opening 14 minutes, Carlo Ancelotti´s side came back to thrash the hosts and record a spectacular 5-2 Champions League last 16 first leg victory.\nMadrid won a record 14th European Cup last season by beating Jurgen Klopp´s team 1-0 in the Paris final, but along the way they produced remarkable comebacks in topsy-turvy games against Paris Saint-Germain, Chelsea and Manchester City.\nTheir performance on Merseyside was in this vein, with a sloppy start in defence covered up by an attacking onslaught in a chaotic and unforgettable clash.\nAncelotti´s side sometimes only seem to click into gear after falling behind and the coach said he was not worried, despite Liverpool moving ahead through Darwin Nunez and Mohamed Salah.\n\"I thought about Manchester City and hoped the same thing would happen, and it did, and better still,\" Ancelotti told Movistar, recalling last season´s semi-final first leg, where Madrid fell two goals behind against Pep Guardiola´s side.\n\"We started scoring, creating danger and we improved in defence.\"\nThe second goal was particularly strange, with Thibaut Courtois miscontrolling the ball for Salah to fire home.\nA key driver for Madrid´s comeback was Vinicius Junior, who scored twice to pull the team back on level terms before half-time.\nThe Brazilian winger has struggled to break free of various problems in Spain, including racist abuse from the stands, and overly aggressive defenders, but shone again against Liverpool.\n\"Vinicius right now, in my opinion, is the most decisive player in world football,\" added Ancelotti.\nThe 22-year-old provoked a similar error to Courtois´ from Liverpool goalkeeper Alisson Becker, charging him down and deflecting an attempted clearance into the net.\nBenzema also played a key role for Madrid with a second-half brace too, despite recent injury concerns.\nLos Blancos´ captain missed the trip to face Osasuna at the weekend in order to be fully fit to face Liverpool, and Ancelotti´s gamble paid off as Madrid won both games.\n\"After 15, 20 minutes, then we saw Real Madrid,\" Benzema told Movistar, urging his team not to start as slowly in the future.\nHowever Madrid have made it a habit, and somehow a successful one, dominating the competition over the past decade.\nUnder Ancelotti in 2014, Los Blancos won La Decima — the tenth — by coming from behind to beat rivals Atletico Madrid in the final.\nThey have not looked back since, adding further trophies in 2016, 2017 and 2018, and then again last year, when they came back from the dead on multiple occasions.\nThis victory over Liverpool will go down with the most memorable of them.\nMadrid midfielder Fede Valverde credited Ancelotti´s words at half-time with helping the team romp to victory.\n\"It´s important what he told us at the break, he has few words and (yet he) says a lot to you,\" Valverde told Movistar.\n\"He supported us at the right moments and it boosted our morale to mount the comeback.\"\nEder Militao headed Madrid in front and then Benzema scored twice to seal an emphatic triumph.\nThe Uruguayan said Ancelotti believed his side would complete another historic European turnaround -- only Ajax in 1966 have put five past Liverpool in Europe.\n\"He was calm at the break and told us that we could win, that we had the team to do it,\" added Valverde.",
  "word_count": 592,
  "scraped_at": "2026-02-14T02:06:47.842348",
  "_text_extracted": true
}