{
  "article_id": "6dfbfd83bb90",
  "url": "https://punchng.com/full-list-uefa-champions-league-play-off-draw-unveiled/",
  "title": "FULL LIST : UEFA Champions League play - off draw unveiled",
  "date": "20240805T213000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The stage is set for the final hurdle before the group stages, as the 2024/25 UEFA Champions League play-off round draw took place on Monday, August 5, at the House of European Football in Nyon, Switzerland.\nThe draw, held at 12:00 CET, determined the matchups that will be played on August 20/21 and 27/28, where teams will vie for a coveted spot in the prestigious tournament’s main event.\nPUNCH Online retrieved this from a release obtained from the UCL website on Monday night.\nIt was titled, “UEFA Champions League play-off round draw.”\nHere is the full list of the draws:\nYoung Boys Bern (SUI) vs. Galatasaray (TUR)\nDinamo Zagreb (CRO) vs. Qarabag (AZE) or Ludogorets (BUL)\nMidtjylland (DEN) or Ferencvaros (HUN) vs. Slovan Bratislava (SVK) or APOEL Nicosia (CYP)\nJagiellonia Bialystok (POL) or Bodo/Glimt (NOR) vs. Crvena Zvezda (SRB)\nMalmo (SWE) or PAOK (GRE) vs. Sparta Prague (CZE) or Steaua Bucharest (ROU)\nLille (FRA) or Fenerbahce (TUR) vs Slavia Prague (CZE) or Union Saint-Gilloise (BEL)\nDynamo Kyiv (UKR) or Rangers (SCO) vs. RB Salzburg (AUT) or Twente (NED)\nPUNCH Online reports that the UEFA Champions League play-off round draw follows specific procedures to ensure fairness. Teams play home and away matches in a knockout system.\nAn equal number of seeded and unseeded clubs are paired based on club coefficient rankings. Restrictions prevent certain teams from being drawn against each other.\nIn the Champions Path, 10 teams were split into five seeded and five unseeded categories. In the league path, four teams were divided into two seeded and two unseeded groups.\nThe draw determines matchups and home teams for the first legs, with the schedule and kick-off times managed by UEFA.",
  "word_count": 280,
  "scraped_at": "2026-02-14T02:10:58.960096",
  "_text_extracted": true
}