{
  "article_id": "6e1056db4cc1",
  "url": "https://cityxtra.co.uk/36599/press-conference-part-two-pep-guardiola-reveals-his-first-choice-rodri-back-up-midfielder/",
  "title": "Press Conference , Part Two : Pep Guardiola reveals his first - choice Rodri back - up midfielder",
  "date": "20251102T001500Z",
  "domain": "cityxtra.co.uk",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "News\nPress Conference, Part Two: Pep Guardiola reveals his first-choice Rodri back-up midfielder\nManchester City boss Pep Guardiola has openly named his go-to choice for the deep-lying midfield role should Rodri be unavailable for any upcoming contests.\nThe Etihad Stadium side will be looking to return to winning ways in Premier League football this weekend having fallen to defeat in their last top-flight outing away to Aston Villa in the West Midlands.\nA relatively lacklustre showing from Manchester City was topped off with a well-worked corner-kick routine from Unai Emery’s side, finished off by an impressive Matty Cash goal from distance.\nThere was an immediate response to come from City however, albeit in the fourth round of the Carabao Cup as Guardiola’s squad booked their place in the last-eight of the competition where a home tie against Brentford awaits in December.\nIt was a 1-3 comeback at the Swansea.com Stadium against the Championship outfit as goals from Jeremy Doku, Omar Marmoush, and Rayan Cherki overcame Goncalo Franco’s stunning opener, with City’s France international creator putting in a stellar performance.\nThis weekend provides a very stern test of Manchester City’s cross-competition trophy credentials as they take on Andoni Iraola’s hugely impressive Bournemouth side at the Etihad Stadium on Sunday.\nHere is every single word from part two of Pep Guardiola’s pre-Cherries press conference from the City Football Academy on Friday afternoon!\nOn how the No.6 position is viewed when Rodri is out: “Right now, the first option when Rodri cannot play is absolutely Nico Gonzalez – making steps forwards. And he didn’t play against Aston Villa, unfortunately for us, because he was not perfect.\n“He had an incredible knock in the game before Aston Villa, he had a problem in the feet, that’s why he was not perfect, perfect. But I think for that position he understands more and gives us more there, it’s Nico.”\nOn how the Manchester City team has changed from Fernandinho as the No.6 to present day with Rodri or Nico: “Not much. They have to help us to be in the Premier League, it’s necessary to have this physicality, these types of players for obvious reasons. Everybody knows. It was less, for example, in Barcelona, even in Bayern Munich.\n“But here we need it, you need this type of a little bit more physicality. But being involved in the process to play, always it’s massively important. So the structure, I’ve said many times, with Leroy [Sane] and Kevin [De Bruyne] in his prime, or Leroy and Raheem [Sterling] in their primes, my god, our transitional game was unbelievable; we didn’t have Riyad Mahrez, or Bernardo [Silva] on the sides, or the others ones – we are a less transitional team.\n“But the basics or the fundamentals, people ask, ‘You have to change, you have to change, you have to change’ – I don’t have to change anything. I’m more convinced that what we have done in the past, we can still do it, do it, do it. It’s just apply better, better, better. So this is what we have to do.”\nOn whether sourcing goals from players other than Erling Haaland is something he is actually attacking, and how long can Haaland carry that load: “Well we have an alternative, like [against] Swansea – I would not let him play. And the other ones are going to score the goals because he’s not playing, this is the alternative you have to find. No definitely, we have to, the numbers of the people up front have to be better – they know it.\n“We talked about that. At the end it’s numbers, but I think I have players to have the ability to score goals; Omar [Marmoush] has it, Rayan Cherki I think has this talent too, Phil [Foden] does it. And they’re playing good, but of course what defines the big, big teams, or the big players up front is the impact for assists and goals being provided.\n“And that’s why I’m so optimistic being in that position, still there, in the Champions League we are in a better position than last season, and we have an incredible two chances against [Borussia] Dortmund and [Bayer] Leverkusen at home to be incredibly close to qualifying for the first-eight.\n“I think even the results, yeah we are six points behind Arsenal who look unstoppable right now because they play fantastic, they don’t concede goals, and they are so solid, they can score from many different situations and positions, and many players.\n“But even with that, I think when we make this step a little bit better, I think we will be closer, we will be closer, those games are tighter, we’ll be able to win.”\nOn Erling Haaland thriving on that responsibility: “I think he’s not tired of scoring goals. Yeah maybe when you play a lot of games, maybe then [he will be tired]. But Swansea he didn’t play, he’s fresh. When he will be tired, he will tell me.\n“Before maybe in the beginning we could not do it, Omar [Marmoush] was injured, but I can play with a false-nine with Rayan Cherki, for example. I think in that position Rayan suits perfectly. So like I said, when we have all the team, we can play in different shapes, different ways to play. Sometimes it depends on the opponent.”\nOn Nico Gonzalez’s ceiling: “He will be better; when you are coachable… Not just for me I’m talking for his mates when he listens to his mates, talking, or Rodri talking a lot with him, or Pep [Lijnders] talks to him, or whatever – when you are coachable, you will be a better player.\n“At the end, until the last day you are a football player, always you can improve. When you are open-minded, and there are players that are. And Nico is the perfect example. The other ones, yes but, you’re going to tell me. But it’s one of the personalities, it’s fine.\n“And those players, I speak less, we talk less, and with Nico he’s always open, wants to learn, and doing that, so that’s why it’s nice to be living with these types of players because we are here just tomorrow to be better than today. It’s possible, but to be better you have to be open.\n“If I’m close-minded, ‘No no only what I know, I don’t want to be added absolutely anything’, I’m completely the opposite and the players have to be the same.”\nOn Omar Marmoush & Rayan Ait-Nouri’s AFCON absences: “It is what it is. The schedule, we have these competitions for the countries, so they have to go. We will… Always I try to solve the problems when the problems are in front of me. Right now I don’t think at all.\n“I have to use them from Sunday the best, and next Wednesday, and next Sunday before the international break. And when it’s going to happen that they cannot be here, after we will see what is the situation and we will take the decisions.”\nOn Mateo Kovacic’s availability vs Bournemouth: “We will see.”\n-\nFeatures3 days ago\nTactical trap of Erling Haaland and Omar Marmoush doing more harm than good for Pep Guardiola\n-\nNews2 days ago\n“You don’t need to be blind” – Pep Guardiola dissects Manchester City’s second-half misery of late\n-\nMatch Coverage2 days ago\nMatch Report & Player Ratings: Manchester City 3-0 Fulham (Premier League)\n-\nFeatures2 days ago\nBernardo Silva is showing doubters age is just a number after stellar Anfield performance",
  "word_count": 1260,
  "scraped_at": "2026-02-14T01:52:49.007342",
  "_text_extracted": true
}