{
  "article_id": "6e173bb2894d",
  "url": "https://www.justarsenal.com/what-do-arsenal-players-think-with-one-hand-behind-their-back/387723",
  "title": "What do Arsenal players think with one hand behind their back ? ",
  "date": "20250227T131500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "So, I was watching the Forest game on Tuesday.\nYou know when your TV is on, but it’s just background noise while you’re messaging on your phone, digesting a quick YouTube clip, checking out your betting app, and joining in a group chat about Jamie Carragher’s views on AFCON? This is not normally how I consume the sport.\nNo, it’s not because we will not be champions this season. I consigned myself to that reality when the Kroenke family waved the white flag last month. Plus, it’s been over two decades without a title, so if my viewing habits were dictated by trophies, I would have walked away when I was 16! It’s simply because my belief has been stolen, my faith extinguished, my hope evaporated. I’m awake, not allowed to dream anymore.\nI no longer trust us to score. On Saturday, when West Ham broke the deadlock, I went hot and clammy, a knot grew in my tummy. Out loud, I pondered how we were going to score twice. How has it got to this?\nI grew up with Mr Wenger’s free-flowing football; his sides (even the poor ones) almost guaranteed they would create chances. His ethos has been replaced by sideways passing, leading to one shot on target at the City Ground. His principles demanded lots of possession, but rarely was he left scratching his head wondering how many great saves the opponent’s keeper actually had to make.\nAt half-time, I watched some Gunners walk off and felt sorry for them. Unlike at the weekend, I couldn’t question their effort last night. It’s too easy to say footballers don’t care. Yes, they travel in comfort compared to the Gooners who will be getting back early in the morning, impacting their work schedule. Our disappointment is not comforted by a substantial wage, no matter the result. Yet, you can be rich, famous, and live a glamorous lifestyle but still hurt. These are still humans. They bleed and cry like the rest of us. They still have aspirations that kill when they turn out to be fake.\nWe use this platform to communicate our thoughts. This week in particular, the topic of conversation has been our owners, manager, transfers (or lack of). Social media means that, if you wish, you can access 24-hour content on opinions. Pundits don’t just leave their points of view on television and radio. Some now have their own podcasts.\nMikel Arteta is contractually forced to talk to the press multiple times a week. To be fair to him, what else can he say but be positive and put on a brave face? How, though, do our players feel?\nI’m not a professional athlete, so I’m not qualified to know if your own performance can be limited by the limitations of others. Yet, if journalists could foreshadow that January would cost us everything, if the majority of the fanbase knew a lack of attacking options would catch up with us, if ex-professionals are pointing to our Achilles’ heel, then surely the squad whispers that to each other?\nA midfielder must wonder how he can assist if the tools ahead of him are not sharp enough. That then puts more weight on his shoulders to be creative, and suddenly he too is struggling. So worried about helping others, he then neglects his own problems. They would be too respectful to target or isolate one person, but surely Odegaard gets home and says to his wife that he just wishes his employers had more ambition?\nWhen Rice goes on international duty, does he secretly tell Foden he should have chosen Man City after all, because his chance of a medal is based on whether a player on loan can remember where he left his mojo? Saliba has probably informed his agent not to negotiate a new contract because having trophies on his CV depends on a 17-year-old.\nImagine a world where, at the interval, you are updated that Liverpool is leading and going 13 points ahead of you. Then you have to keep a straight face as the coaching staff, on the whiteboard, illustrate their master plan of how to break down Nuno Santo’s team… Bring on three full-backs!\nIn training, when their boss excitedly challenges those who want to help solve the puzzle of not having a goalscorer, who dares to put up their hand and point out that, since the window closed, there has been a failure to find the net in three of our last four matches?\nAnyone with the gumption to demand to know why?\nWould it be rude to your boss to suggest that’s not a coincidence?\nToo cheeky to ask what else he expected, because elsewhere most are not surprised.\nYou try cooking with mouldy potatoes—how do you think the chips will taste?\nDo you wait for supervision to document how disappointed you are because you really wanted this to be the workplace where you could grow? Or have you already ordered your representatives to research exit strategies to destinations where they are serious about success? More serious than trying to chase down the league leaders with a central midfielder as your forward.\nYou know, like Fabregas and Van Persie did. Young talent who adored the environment but couldn’t fight the truth—that to get the honours their talent deserved, they had to move.\nThese are men who were once kids kicking a ball in the school playground, reenacting celebrations in their back gardens, trying skills in the park using jumpers for goalposts. While letting their imaginations run wild, they were educating themselves on their passion, and understanding how this love works.\nYou can overcomplicate the game. You can get fixated on tactics and obsessed with systems.\nIn reality, since rules were written, from the day the sport was invented, whatever era, whatever country, no matter the level you compete at, the fundamentals have always been the same.\nThe winner is the team that scores the most goals.\nIf you have difficulty putting the ball in the net, the percentage of a winning sequence is not high.\nSo from the Premier League to grassroots, you want to recruit someone who is an expert in finishing. Preferably more than one candidate.\nSo if our options for goals are a teenager, a central midfielder, and someone on loan, how can you not be deflated?\nThousands of pounds a week rightfully dictate maximum effort, but you can’t force people to lie. You’re paying these athletes for their technique with their feet, not for them to be blind.\nIt breaks my heart to see our players yesterday run themselves into the ground, forced to fight with one hand behind their back. You can see in their body language a nervousness about how they are going to be able to cut steak with a spoon.\nThat’s why even Raya is displaying nervous energy, playing the sweeper role so he can help in attack.\nI admire the collective unit’s desire to take responsibility, but I can see it’s on their minds to the point they lack composure. Even at set pieces now, you sense we are trying to force things because a corner is now the most likely way to make chicken salad out of chicken.\nOur players have been let down. They’ve been left with zero support. To be fair to Arteta (like most Gooners), he asked his boss for help. He’s only an employee at the end of the day. He did what anyone would do in a management role at a major company—communicate to the owners when resources are low.\nPlease, he said. We are short in attack and need help. Assistance, because attack is quite important if you want to win leagues or cups.\nOur players reached out to grab the brass ring, only to find it never existed. They tried to catch their dreams, only for our owners to show they were chasing illusions. Our players wanted to run with the baton but have been tripped up by those meant to be helping.\nThese players will get off the ground, dust themselves off, their wounds will heal. Many will eventually still succeed on the grandest stage. If that’s not in North London, then remember January 2025.\nIt will live forever, it will haunt us, and we will never forget—nor should we.\nA draw keeps us eight points ahead of fifth. Fifth might even be enough for qualification for the Champions League. Currently, Newcastle in sixth are ten points off us. With 11 games to go and those below us not consistent, we should have enough to stay in the top four.\nAs we know, that’s all that matters to our owners. if our dressing room didn’t know that before this year, they do now.",
  "word_count": 1460,
  "scraped_at": "2026-02-14T01:55:04.574955",
  "_text_extracted": true
}