{
  "article_id": "6e1f520a2a6c",
  "url": "https://www.gdnonline.com:443/Details/1346473/Al-Nassr-face-Esteghlal-in-Champions-League-clash",
  "title": "Football : Al Nassr face Esteghlal in Champions League clash",
  "date": "20250303T024500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo’s Al Nassr side will look to turn around a run of indifferent form against Iran’s Esteghlal in Tehran tonight as the Asian Champions League Elite moves into the knockout phase.\nRonaldo did not travel with Al Nassr’s squad to Iran, according to media reports.\nThe decision to rest the Portuguese captain was made after consultation between the coaching and medical staff due to muscle fatigue.\nThe Riyadh-based side are one of three Saudi Pro League teams to reach the last 16 of the revamped continental championship, which was dominated throughout the league phase in west Asia by the big-spending trio.\nSaudi champions Al Hilal, who have won the Asian title on four occasions, will take on Uzbekistan’s Pakhtakor in Tashkent tomorrow, when Al Ahli from Jeddah will travel to Doha to face Qatar’s Al Rayyan.\nBoth go into their clashes as favourites to earn a first-leg advantage ahead of the return fixtures in Saudi Arabia next week while Al Nassr are also expected to prevail despite their recent inconsistency.\nStefano Pioli’s side have lost two of their last three matches in the domestic league and drew 0-0 with Esteghlal’s bitter rivals Persepolis in the Asian Champions League Elite, giving hope to the team from Tehran.\nAl Wasl from the UAE will entertain Qatar’s Al Sadd, with the eight clubs sparring for the right to represent the west of the continent in next month’s quarter-finals.\nThe latter stages will be played in a centralised format in Jeddah for the first time, with the four quarter-finalists from west Asia entering into the draw for the next phase on March 17 alongside four clubs from the east.\nTop stories for today:\nSuspect arrested\nUnstable weather alert\nNew iGA centre offers more efficient access to services",
  "word_count": 294,
  "scraped_at": "2026-02-14T02:20:55.372592",
  "_text_extracted": true
}