{
  "article_id": "6e5e643ea9cb",
  "url": "https://www.empireofthekop.com/2025/12/18/marc-guehi-lewis-steele-liverpool/",
  "title": "Journalist hints at Liverpool January move for Guehi",
  "date": "20251218T190000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool’s defensive plans could see a familiar target return to the top of our agenda this January.\nLewis Steele has claimed the Reds still have a real opportunity to sign Marc Guehi, the Crystal Palace centre-back who nearly joined us in the summer.\nSpeaking to Ian Ladyman on Daily Mail Football, he said: “I still think Liverpool have a really good chance of signing Guehi.\n“The only question is whether that’s in January for a fee or in the summer for nothing. I think Liverpool have every chance of getting him in January – if not, then in the summer.”\nWhy Guehi remains a Liverpool target\nThe 25-year-old England international has long been on our radar, and for good reason.\nA durable, experienced defender who captained Palace to FA Cup glory in 2025, Guehi offers the kind of reliability at centre-back every club desires.\nPalace manager Oliver Glasner has made it clear he values Guehi highly, but he also hinted at the delicate balance the Eagles needed to maintain in the summer.\nGlasner has explained he gave advice to the board on Guehi’s potential departure, noting how selling him without proper cover could have left the club short-handed.\nThat intervention is part of why the move fell through initially.\nFabrizio Romano has also updated on Liverpool’s continued pursuit, noting that although the summer deal collapsed, we remain in contention for Guehi and have the option of securing him on a free transfer at the end of the season.\nThis aligns with Steele’s assessment that a move is far from off the table.\nWhat a Guehi signing would mean for Liverpool\nBringing in the Palace captain would strengthen Slot’s defensive options significantly, providing competition and cover.\nGuehi’s leadership and Premier League experience could be pivotal as we aim to maintain momentum while balancing European commitments.\nLiverpool may have to move quickly in January, particularly if other clubs express interest, but the groundwork suggests the Reds are well-positioned to get their man.\nWith the Premier League and Champions League campaigns demanding depth, adding a player of Guehi’s calibre could be exactly the boost we need.\nYou can watch Slot’s post-Brighton press conference via Empire of the Kop on YouTube:\nJoin our channel of readers on WhatsApp to get the day’s top stories straight to your mobile",
  "word_count": 384,
  "scraped_at": "2026-02-14T01:59:31.520833",
  "_text_extracted": true
}