{
  "article_id": "6e6ed049abf6",
  "url": "https://www.dutchnews.nl/2025/01/feyenoord-fans-banned-from-champions-league-match-in-lille/",
  "title": "Feyenoord fans banned from Champions League match in Lille",
  "date": "20250122T123000Z",
  "domain": "dutchnews.nl",
  "source_country": "Netherlands",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Feyenoord fans banned from Champions League match in Lille\nFeyenoord fans have been banned from travelling to Lille for the club’s final Champions League group match on January 29.\nA spokesman for the Rotterdam club described the decision by French authorities as “very disappointing”. “We are looking at whether there is anything more we can do, but the chances are not high,” he said.\nAround 2,000 fans had hoped to make the 225km journey to northern France to watch the match, where Feyenoord will be hoping to clinch a place in the play-off round by finishing in the top 24 clubs.\nThe two clubs held talks on Monday with local law enforcement and European football’s governing body UEFA to try to persuade Lille to allow a limited number of supporters to attend the match.\n“Feyenoord submitted a detailed plan on how 2,000 away supporters could make the journey to Lille responsibly,” the spokesman said. “We explained everything clearly again [on Monday] and hoped that we would get a result at the end of the evening.”\nThree years ago the club was fined €70,000 by UEFA and ordered to play two matches behind closed doors after travelling supporters let off fireworks and caused trouble in Marseille during the away leg of the Conference League semi-final.\nFeyenoord play Bayern Munich in their last home group game on Wednesday evening.\nThank you for donating to DutchNews.nl.\nWe could not provide the Dutch News service, and keep it free of charge, without the generous support of our readers. Your donations allow us to report on issues you tell us matter, and provide you with a summary of the most important Dutch news each day.\nMake a donation",
  "word_count": 283,
  "scraped_at": "2026-02-14T01:49:18.063633",
  "_text_extracted": true
}