{
  "article_id": "6e73993800f0",
  "url": "https://thepeoplesperson.com/2025/06/11/jadon-sancho-set-to-leave-man-united-but-a-borussia-dortmund-return-is-off-the-table-295236/",
  "title": "Jadon Sancho set to leave Man United , but a Borussia Dortmund return is off the table - Man United News And Transfer News",
  "date": "20250611T223000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jadon Sancho is among the players expected to leave Manchester United this summer as the club reshapes its squad.\nThere is no doubt about his talent, but he has struggled to showcase his brilliance in a United shirt.\nSigned as a game-changer, the winger ultimately failed to live up to his £73 million price tag.\nHis fall-out with manager Erik ten Hag only sealed his fate, with his reaction to the dispute causing him to fall out of favour at the club.\nSince then, he has failed to re-establish himself at Old Trafford.\nLoan spells: A bid to revive his career\nSancho spent time on loan at Borussia Dortmund, where he helped them reach the Champions League final, and later at Chelsea, where he played a key role in their Europa Conference League triumph.\nThese moves were meant to help him rediscover his rhythm.\nFor a moment, it seemed like a permanent transfer was on the horizon. Chelsea expressed interest and were prepared to sign him for £20–25 million, but the deal ultimately collapsed.\nThe winger’s hefty wage demands forced the Blues to back out, leaving them to pay a £5 million penalty for opting out of their obligation to buy.\nA Dortmund return? Not quite\nOnce Sancho returned to Manchester, the question became where he would go next.\nBorussia Dortmund reportedly considered bringing him back, viewing him as an ideal number 10 for their 3-4-2-1 system. His entourage was even approached to express that interest.\nAt that point, INEOS might have felt they had a real chance to move him on.\nHowever, just as negotiations seemed likely, Dortmund cast doubt over the possibility of a reunion.\nDortmund’s official stance\nSpeaking at Dortmund’s Brackel training ground as the club prepares for the FIFA Club World Cup, Sporting Director Sebastian Kehl dismissed the rumours.\n“Of course, contact with Jadon is always there, in some way, because we have a very long history,” he said via Get Football.\n“But it’s not an issue for us right now. We have other priorities at the moment, and that’s why the Sancho issue was probably played up more in the media than discussed internally.”\nWhat next for Sancho?\nIt is surprising that Borussia Dortmund have ruled themselves out of the race to sign Sancho.\nHow do they pass up the chance to bring back a player who, in Black and Yellow, not only lit up the Bundesliga but also made waves across Europe?\nNow, INEOS face a growing challenge in finding a suitable exit for him.\nAt this point, another loan move might be the best option.\nOr perhaps Ruben Amorim could take a chance on him. Some believe he would be an ideal fit as a number 10 in his 3-4-2-1 system.\nFeatured image Julian Finney via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 470,
  "scraped_at": "2026-02-14T01:58:41.944759",
  "_text_extracted": true
}