{
  "article_id": "6e7f61d6d7db",
  "url": "https://www.westmeathexaminer.ie/2025/12/29/rte-releases-2026-schedule-with-the-tommy-tiernan-show-and-world-cup-playoffs/",
  "title": "RTÉ releases 2026 schedule with the Tommy Tiernan show and World Cup playoffs",
  "date": "20251229T113000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "RTÉ releases 2026 schedule with the Tommy Tiernan show and World Cup playoffs\nKenneth Fox\nRTÉ brings an exciting range of new programmes to keep audiences entertained and informed as we ease into 2026 and look ahead to spring.\nThey will present distinctively Irish entertainment and brand-new, home-grown drama, alongside nail-biting sporting moments that will bring the nation together through RTÉ’s free-to-air sport.\nThere are new documentaries and live specials across television and radio, with something for everyone from your Public Service Media this New Year.\nOn RTÉ One and RTÉ Player, the inimitable Tommy Tiernan is back with a brand-new series of The Tommy Tiernan Show, running for sixteen Saturday nights from January 3rd.\nNow in its tenth series, Tommy will once again come face-to-face with guests, totally unprepared and without prior knowledge of who is coming on the show. As ever, Tommy delivers masterful and insightful conversations with whoever is in front of him.\nDancing with the Stars kicks off from January 4th for its ninth season, with brand-new Head Judge Oti Mabuse bringing even more glitter and glam.\nThis season features familiar faces, including Niamh Kavanagh, Paudie Moloney and Rose of Tralee Katelyn Cummins among others, all taking to the dancefloor in the hopes of winning the coveted glitterball trophy.\nPresented by Jennifer Zamparelli and new addition Laura Fox, who is filling in for Doireann Garrihy while she is on leave, this year will bring some big surprises with plenty of twists and turns along the way.\nFollowing on from The Late Late New Year’s Eve Special on December 31st, Patrick Kielty returns with The Late Late Show on Friday, January 9th 2026, with the very first Late Late Show Trad Special.\nIn the first-ever full show dedicated to Irish traditional music, viewers can expect a session to end all sessions.\nThe new year sees Room to Improve’s Dermot Bannon take on homes of every scale and condition, helping families looking to downsize, upsize, or find the right size for their next chapter.\nStarting on Sunday, January 4th, Dermot’s signature architectural vision once again goes head-to-head with quantity surveyor Claire Irwin’s pragmatism.\nAny Given Day: Cork University Hospital airs on Wednesday, January 7th at 9:35pm on RTÉ One and RTÉ Player, a powerful new six-part documentary series that goes beyond the headlines and behind the scenes of one of Ireland’s biggest and busiest hospitals.\nAs we move towards spring, prepare to feel the love as the First Dates restaurant reopens for another season on RTÉ2.\nSpring 2026 will also see RTÉ Investigates look at mental health services in Ireland, with a two-part series coming this February.\nAlso coming soon is The Ryanair Story, a two-part series documenting the 40-year history of Ryanair’s ascent from offering one single route, to becoming a giant of world aviation.\nRTÉ continues its commitment to delivering great local drama this year with nine new drama productions for RTÉ filmed in 2025, creating 142 hours of high-quality, homegrown storytelling for Irish audiences, which viewers will continue to enjoy right through 2026.\nNew RTÉ comedy-drama series These Sacred Vows makes its eagerly anticipated debut this spring. Starring Tom Vaughan-Lawlor, Justine Mitchell, and Jason O’Mara, These Sacred Vows opens on the morning after an Irish wedding on a Spanish island, when the body of a priest is found floating face-down in the swimming pool of the young guests’ villa.\nOver the course of six episodes, the action jumps back in time to revisit the events of a wild previous week, each from the perspective of a different character. Filmed in Tenerife, the series is written and directed by award-winning Irish screenwriter John Butler.\nIn terms of sports, things kick off with the Champions League returning on Wednesday nights in January to RTÉ2 and RTÉ Player as Liverpool travel to Marseille on January 21st.\nIn international soccer, the Republic of Ireland will face Czechia in a World Cup play-off semi-final on 26 March, with the winners moving on to the play-off final on 31 March. The semi-final will be live on RTÉ2 and RTÉ Player, with the final also live should Ireland get past Czechia. January also sees the return of the Allianz Leagues in Football and Hurlingwith live coverage across television and radio as 2025 winners Kerry in Football and Cork in Hurling look to defend their respective crowns.\nAll-Ireland Hurling champions Tipperary face Galway in Semple Stadium on Saturday, January 24th. Andy Farrell's Ireland will be aiming to improve on last year's third-place finish when the Six Nationsbegins in February, with live coverage across RTÉ, with Jacqui Hurley at the helm.",
  "word_count": 767,
  "scraped_at": "2026-02-14T02:09:38.445919",
  "_text_extracted": true
}