{
  "article_id": "6e8461b30b29",
  "url": "https://www.themag.co.uk/2024/08/official-announcement-elias-sorensen-signs-for-championship-club-portsmouth-newcastle-united/",
  "title": "Official announcement - Elias Sorensen signs for Championship club",
  "date": "20240803T100000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Official announcement – Elias Sorensen signs for Championship club\nElias Sorensen is now back in English football.\nAn official announcement (see below) from Portsmouth revealing the news,\nBack in 2016, Elias Sorensen arrived as a 16 year old at Newcastle United but despite scoring plenty of goals below first-team level, never made the breakthrough into the NUFC first-team.\nOut on loan from Newcastle, Elias Sorensen also failed to make an impression in the lower leagues.\nMaybe simply a case of needing time to develop with experience but in recent years scoring goals in lower leagues in Holland and Denmark, the now 24-year-old Elias Sorensen has earned this new chance to impress in England.\nPortsmouth promoted as champions of League One last season, so now Elias Sorensen with the chance to show what he can do in the Championship.\nGood luck to him.\nPortsmouth official announcement – 2 August 2024:\n‘Pompey have completed the signing of striker Elias Sørensen from Esbjerg for an undisclosed fee.\nThe 24-year-old former Denmark under-21 international – who will wear the number 18 shirt – has put pen to paper on a three-year deal, with a club option for an additional 12 months.\nBlues boss John Mousinho said: “Elias is an incredibly talented young centre-forward with plenty of potential.\n“He’s already been over in England and so has had a taste of the game over here. He then went back to Denmark and enjoyed a huge amount of success – particularly last season.\n“We’re excited by his energy – he’s a real livewire – and, of course, the assists and goals he has in his arsenal.\n“He’s a threat on the shoulder and also very capable with his back to goal, so we’re delighted to welcome Elias to the club.”\nSørensen began his career with HB Køge in his homeland and became their youngest ever player when making his debut in 2016.\nFollowing a successful trial period, he signed for Newcastle a few months later and spent time on loan with Blackpool, Carlisle and Dutch outfit Almere City.\nSørensen returned to Denmark to join Esbjerg in the summer of 2021 and helped them secure the third tier title last term.\nHe was the division’s leading marksman with 24 goals from his 30 appearances, with a further 12 assists also seeing him collect the Player of the Season award.’\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 406,
  "scraped_at": "2026-02-14T01:51:48.880404",
  "_text_extracted": true
}