{
  "article_id": "6e8ccfcb68d7",
  "url": "https://kawowo.com/2025/09/25/african-stars-captain-ketjijere-ready-to-encounter-vipers-at-kitende-caf-champions-league-preliminary-round/",
  "title": "African Star captain Ketjijere ready to encounter Vipers at Kitende | CAF Champions League",
  "date": "20250925T230000Z",
  "domain": "kawowo.com",
  "source_country": "Uganda",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Overview:\nAfrican Stars is already in Uganda, accommodated at the lavish Hotel Horizon in the heart of Entebbe Town.\nThe team captain of Namibian outfit African Stars Football Club Ronald Ketjijere has expressed readiness for his side for a spirited display against Vipers during the return leg for their CAF Champions League preliminary round duel this Saturday at St Mary’s Stadium, Kitende, Wakiso district.\nAddressing the media on Thursday, Ketjijere, a midfielder boldly confessed; the battle is not yet finished despite having lost 0-1 during the first leg played in Cape Town city, South Africa.\n“We are very ready to face Vipers on Saturday” Ketjijere started in his opening remarks.\nFlanked by the head coach Bob Mafoso, Ketjijere did not mince words as he spoke about their mission at hand in the return leg where they trail 0-1.\n“We are aware that they are playing before a home crowd but we shall make it very difficult for them. We have come here (in Uganda) to get a result. We believe in ourselves and we shall make it” he added.\nVipers won the first leg 0-1 courtesy of a strike from defender Hilary Mukundane.\nAfrican Stars is already in Uganda, accommodated at the lavish Hotel Horizon in the heart of Entebbe Town.\nThey had their first training session at St Mary’s Stadium, Kitende on Thursday ahead of the final drills on Friday, the match eve.\nThe return leg is on Saturday, 27th September 2026, and it will be played under floodlights.",
  "word_count": 250,
  "scraped_at": "2026-02-14T02:26:56.621163",
  "_text_extracted": true
}