{
  "article_id": "6e8f848957ce",
  "url": "https://metro.co.uk/2025/11/02/scott-parker-singles-arsenal-star-praise-burnley-defeat-24592406/",
  "title": "Scott Parker singles out Arsenal star for praise after Burnley defeat",
  "date": "20251102T101500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Burnley manager Scott Parker believes Arsenal have ‘every single ingredient’ to win the Premier League this season.\nMikel Arteta’s side sealed a 2-0 win at Turf Moor on Saturday thanks to first-half goals from Viktor Gyokeres and Declan Rice.\nArsenal’s ninth successive win sent them seven points clear at the top of the Premier League.\nBurnley have now faced all of Arsenal, Liverpool and Manchester City this season and Parker has backed the Gunners to end their 22-year wait for a Premier League trophy.\n‘They’re just a very, very good team,’ Parker said after Saturday’s defeat. ‘They’re a team who I believe have every single ingredient to go and win the league this year.\n‘In every facet of their game, defensively, attacking-wise, set plays, they’re a top, top team. We just fell a little bit short today.’\nParker also paid tribute to Arsenal’s threat from set-pieces and Declan Rice’s delivery.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nRice has developed into a huge offensive asset over the past 12 months as Arsenal’s designated set-piece taker.\n‘If you don’t have those players you probably don’t score as many as Arsenal are scoring,’ the former England midfielder added.\n‘It’s not just down to those two [Gabriel and Saliba]. You’ve got a delivery taker [Rice] and every single time you ask it to be put back post it goes back post.\n‘You ask it to be put front post and the runs are there it gets put there. You’ve also got the timing of the runs, the physicality of the runs and they’re extremely good at it.\n‘Other than the actual natural talent they have and the willingness to attack the ball, sometimes it’s difficult.\n‘There’s many a team who have had their struggles against them. You’re always trying to find ways.\n‘For us it was about trying to get more control than we’ve had against top sides like against Liverpool and Manchester United when we’ve played them. Can we get a certain control while being a threat?’\nArteta was delighted with Arsenal’s routine win over Burnley, who boasted a sensational home record last season and won their previous two games before the weekend.\n‘The first half was exceptional, we scored two goals and gave nothing away, so that was the platform,’ the Gunners boss said.\n‘We had to make a few changes and didn’t have that much control in the second half. Our defending was exceptional again, we didn’t give anything away.\nMore Trending\n‘There is a reason they have lost one game [at home] in 18 months, and that was against Liverpool in the last second of the game.’\nOn Rice’s performance, Arteta added: ‘He stepped up. I don’t know how many balls and tackles he won in total. It is the evolution of a player.’\nArsenal legend Paul Merson said his former club ‘look unbeatable’ after they eased past Burnley.\nThe Gunners return to Premier League action against Sunderland next weekend after a midweek trip to Slavia Prague in the Champions League.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Frank Leboeuf suggests Chelsea dodged a bullet by not signing £52m Tottenham star\nMORE: Alan Shearer savages ‘lazy’ Newcastle after ‘awful’ West Ham loss\nMORE: Trent Alexander-Arnold speaks out on Liverpool return with Real Madrid",
  "word_count": 606,
  "scraped_at": "2026-02-14T01:52:49.006760",
  "_text_extracted": true
}