{
  "article_id": "6ea5e6f79801",
  "url": "https://www.ibtimes.co.in/cristiano-ronaldo-set-receive-special-award-uefa-president-aleksander-ceferin-871595",
  "title": "Cristiano Ronaldo is set to receive a special award from UEFA president Aleksander Ceferin",
  "date": "20240827T163000Z",
  "domain": "ibtimes.co.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristiano Ronaldo, the all-time leading goalscorer in the UEFA Champions League, is set to be honoured with a special award. This recognition, bestowed by UEFA president Aleksander Ceferin, is a testament to Ronaldo's remarkable legacy in the prestigious competition. His journey in the Champions League has spanned over 18 years, during which he has scored an impressive 140 goals in 183 appearances.\nThe award ceremony is scheduled to take place during the inaugural 2024/25 UEFA Champions League 36-team league phase draw ceremony. This event, set to be held at the Grimaldi Forum in Monaco, is expected to draw attention from football fans worldwide. They will join in celebrating the achievements of one of the sport's most iconic figures. Ronaldo's journey in the Champions League began with Sporting Clube de Portugal, followed by stints at Manchester United, Real Madrid, and Juventus. Throughout his career, he has consistently demonstrated an extraordinary ability to find the back of the net, placing him 11 goals clear of Lionel Messi and 46 ahead of third-placed Robert Lewandowski on the scoring charts.\nRonaldo's record-breaking performances have seen him finish seven separate Champions League seasons as the leading scorer – more than any other player. This includes his eight goals in Manchester United's triumphant 2007/08 campaign to his 15-goal haul when Real Madrid claimed their third straight title in 2017/18. He also holds the record for most goals in a single Champions League season, having found the net 17 times in 2013/14, including in the extra-time win against Atletico Madrid in the final. The Portugal forward has won the competition once with Manchester United and four times with Real Madrid – making him the first five-time winner in the competition's history since 1992 – and is the only player to date to have scored in three separate UEFA Champions League finals (2008, 2014, 2017).\nRonaldo's professionalism, work ethic, dedication, and ability to shine on the grandest stage are qualities that football players everywhere should aspire to emulate, added Ceferin. Over more than two decades, he has continuously evolved and refined his game while preserving a youthful passion for scoring and celebrating goals. Ronaldo's achievements have not gone unnoticed by fans, who have reacted with elation to the news of his upcoming honour. Some have even taken a dig at his arch-rival Lionel Messi, highlighting the competitive nature of the sport and the intense rivalry between the two players.\nRonaldo's journey to the top has been a long one, starting with his early years at Andorinha, where his father was a kitman, before joining Nacional. His talent was clear to see, and he was offered a trial at Sporting Lisbon at the age of 12. The Portuguese giants decided to sign him up for their youth system, and the rest is history. In arguably the biggest transfer announcement in recent years, Ronaldo rejoined Man United in 2021. And he returned to scoring goals for the Red Devils instantly, netting a brace on his return to Manchester in a 4-1 win over Newcastle.\nRonaldo's impact on the sport is undeniable, and his legacy will continue to inspire future generations of footballers. His dedication, skill, and relentless pursuit of excellence have set a new standard in the sport, making him a true icon of the game.",
  "word_count": 546,
  "scraped_at": "2026-02-14T01:51:48.868932",
  "_text_extracted": true
}