{
  "article_id": "6eaad1bbccde",
  "url": "https://www.the42.ie/athlone-town-breidablik-uwcl-preview-6798692-Aug2025/",
  "title": "Athlone Town target more history on  special  Champions League journey",
  "date": "20250826T193000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "TO ENSCHEDE IN the Netherlands, where Athlone Town continue their Champions League adventure.\nThe Women’s Premier Division champions face Breiðablik of Iceland in the second qualifying round semi-final at Sportpark Schreurserve, the home of FC Twente, tomorrow afternoon [12pm, live on LOITV].\nAnother mini-tournament awaits, like the one the European debutants won in Athlone earlier this month, overcoming Cardiff City and ŽNK Agram to become the first Irish side since Raheny United in 2014/15 to progress.\nA win over Breiðablik would set up a Saturday final against hosts Twente or FK Crvena Zvezda (AKA Red Star Belgrade) for a place in the third — and last — qualifying round. Defeat would see them contest a third-place play-off.\nThe European dream could remain alive there with Europa Cup qualifier spots up for grabs, but Colin Fortune’s side will have their sights set on the Champions League.\nThey flew to the Netherlands on a high on Monday, having beaten Shelbourne 2-1 in Saturday’s top of the table league clash to return to the summit.\nAthlone made their dominance count with first-half goals from top scorer Kelly Brady and Natalie McNally, and held off a late fightback from 10-woman Shels as Noelle Murray struck in injury time. It was a huge result as they usurped their title rivals and got back to winning ways in the league after three consecutive draws, their unbeaten record still intact.\nAfter a group recovery session on Sunday and tuning up in the Netherlands, a rollercoaster 2025 hits new heights tomorrow.\n“At the start of the season, you want to be playing in all the big matches that really matter,” Athlone star Roisin Molloy recently told The 42.\n“Getting the chance to play in the Champions League as well, even though it adds more matches and pressure, I think it’s something that we all really are thriving on.”\nThe Midlanders certainly embraced the biggest stage on their debut, putting Cardiff (4-0) and Agram (3-0) to the sword across four days in Lissywollen.\nMolloy was the star of the show on opening night with two goals and an assist, while game two belonged to opposite winger Madie Gibson with a pair of Olimpicos. Midfield maestro Hannah Waesch was another standout across the double-header, but these were two exemplary team performances.\n“You don’t really know what the teams are going to be like, obviously because you don’t see them in the league. You can try and watch them, but until you start the game, you don’t know,” Molloy, Player of the Match against Shelbourne on Saturday, recalled.\n“We just really wanted to start with a really high intensity and not give them a minute. That’s what we did, just kept them under pressure. I think everyone was on such a high then, we all just wanted to repeat that.”\nWhile “tougher mentally and physically,” the experience will stand to them as they face another challenging turnaround with three games in a week. Momentum and belief are key ingredients in sport, and Athlone have both in spades.\nWhile Cardiff and Agram were out of season, Breiðablik are also in the thick of it. The Icelandic champions enter the competition at this stage due to their coefficient. They reached the group stages in 2021 – where no Irish side has gone before, now the league phase after a reformat — pitted against the likes of Real Madrid and Paris FC.\nAll bar three of Breiðablik’s players are Icelandic, with Berglind Björg Thorvalsdottir their top goalscorer. (The others are American.) Nik Chamberlain’s side are flying high atop their domestic league, having recently beaten FH Hafnarfjörður in the cup final. Their most recent result was a 5-0 win over UMF Tindastóll last Friday.\nWhile Manchester United are among the other big hitters in this round, and Irish players will feature for Glasgow City (Erin McLaughlin and Emily Whelan), Athlone’s full focus will be on Breiðablik. Saturday’s opponents, Twente or Crvena Zvezda can enter the picture thereafter, both of whom have previous Champions League experience.\nTwente, for example, faced Chelsea and Celtic in the group stages last season and signed Netherlands star Jill Roord from Manchester City this summer.\nFor Athlone to be mixing it with these teams and putting themselves on the European women’s football map is huge. Remarkable really, given the women’s team was only established in 2020.\nNow, like the Shelbourne and Shamrock Rovers men’s teams, they will hope to keep flying the flag in Europe, following in the UWCL footsteps of just Raheny, Peamount and St Francis’.\n“It’s really important that we’re able to show, on a European level, that we’re not just there to make up the numbers, that we really want to be competing at this level,” as Molloy said last week.\n“It would be massive for us, not just for the players, but for the club and the fans and Irish football as a whole, we want to continue to make history. But we know they’re going to be really tough matches. You don’t qualify for this round without quality.\n“It would be really big for Irish women’s football if we could do something. We just want to really keep going on this journey because it’s been so special so far.”\nTomorrow — Uefa Women’s Champions League, second qualifying round: Breiðablik v Athlone Town, LOITV, 12pm.",
  "word_count": 888,
  "scraped_at": "2026-02-14T02:09:18.615095",
  "_text_extracted": true
}