{
  "article_id": "6ebe821f5685",
  "url": "https://www.justarsenal.com/renee-slegers-provides-arsenal-women-team-update-ahead-of-nld-wsl-clash-v-tottenham/380478",
  "title": "Renee Slegers provides Arsenal Women team update , ahead of NLD WSL clash v Tottenham",
  "date": "20241116T130000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The two Women’s Super League sides, Arsenal & Tottenham Women, renew their North London rivalry at Tottenham Hotspur Stadium today.\nFixture Information\nDate: Saturday, November 16, 2024\nKick Off: 1:45pm\nLocation: Tottenham Hotspur Stadium\nBroadcaster: BBC One\nA few weeks ago, Jonas Eidevall resigned from Arsenal after our Gunner women, under his guidance, had a poor start to the season. Renee Slegers has managed to turn things around since taking over from Eidevall as the interim Arsenal manager. Under Slegers guidance, our Gunner women are unbeaten in 5 games—that’s 4 wins and a draw.\nWell, this afternoon, us Gooners are looking forward to the girls painting North London red, and having Arsenal as the only relevant women’s side in north London. From interim manager Renee Sleger’s comments, one must imagine Arsenal will be at their strongest going into this north London derby. Though she hinted there may be some squad rotation due to Champions League football, Slegers revealed that only Victoria Pelova, who’s recovering from an ACL injury, and Amanda Ilestedt, who not long ago welcomed her first child into the world, are the only two players not in contention to make the Match Day squad.\nSlegers said, “There will be changes because of the Champions League squad this week and then the WSL squad, so we’ll only have 20 players in the squad tomorrow. Everyone is fit who has been fit, but Amanda Ilestedt is away because of her baby, and Victoria Pelova is still out.”\nWell, hopefully, as strong as the Arsenal squad is going to be for that game, they rise to the occasion. Renee Slegers has already shown she is calculative with her team selection; the balance between her starters and substitutes is just amazing. Every Gunner has been pleased to play their role; the team is fighting for each other again, which has them on a perfect resurgence.\nExcited for the Derby Gooners?\nCOYGW!\nMichelle M\nFollow JustArsenal’s Gooner Women on Just Gooner Women on Twitter for regular updates on the Arsenal Womens Team!\nDo you want to read more about the Arsenal Women’s Team? Click here….",
  "word_count": 352,
  "scraped_at": "2026-02-14T02:02:07.193780",
  "_text_extracted": true
}