{
  "article_id": "6ec38bcc9000",
  "url": "https://metro.co.uk/2025/05/31/psg-vs-inter-milan-predicted-lineups-teams-champions-league-final-23295105/",
  "title": "PSG vs Inter Milan : Predicted lineups and teams for Champions League final",
  "date": "20250531T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSG and Inter Milan collide in the Champions League final in Munich tonight.\nA mouth-watering final awaits in just a few hours after an unforgettable European campaign this season.\nParis Saint-Germain have never lifted the famous trophy but victory at the Allianz Arena would see them achieve an historic treble after they lifted the Ligue 1 title and the Coupe de France.\nThey notably knocked out Liverpool, Aston Villa and Arsenal to reach Munich and would become only the second French side to win the competition after Olympique Marseille in 1993.\nLuis Enrique has only one minor injury concern to deal with, namely Khvicha Kvaratskhelia who was forced to pull out of last week’s cup final at the last minute.\nIt is said the winger should be fine to start in Munich alongside Ousmane Dembele, who has 33 goals and 13 assists in 48 appearances this season.\nIf Kvaratskhelia is fit, the only question mark will be over who completes the front three, with Bradley Barcola or Desire Doue vying to start on the right-flank.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nWhile Matvey Safonov started the cup final, Gianluigi Donnarumma will be in goal following his heroic performances in the knockout stages, with Enrique expected to stick to his winning 4-3-3 system.\nMeanwhile, Inter are hoping to bounce back after missing out on the Serie A title to Napoli by winning their fourth Champions League and first since Jose Mourinho’s treble-winners in 2010.\nCaptain Lautaro Martinez has not played at all since his side’s epic semi-final win over Barcelona thanks to a hamstring injury.\nThe striker was not even fully fit for that match but is expected to make his comeback in Munich, leading the line alongside Marcus Thuram in Simone Inzaghi’s 3-5-2 formation.\nBenjamin Pavard and Yann Bisseck are hoping to be fit in time after struggling with minor ankle and knee issues, but only one of the centre-backs will start.\nPiotr Zielinski has recovered from a muscle issue while former Arsenal and Manchester United attacking midfielder Henrikh Mkhitaryan should be in the line-up.\nPredicted PSG XI to face Inter Milan in Champions League final\nDonnarumma, Hakimi, Marquinhos, Pacho, Mendes, Neves, Vitinha, Ruiz, Kvaratskhelia, Dembele, Barcola\nPredicted Inter Milan XI to face PSG in Champions League final\nSommer, Pavard, Acerbi, Bastoni, Dumfries, Barella, Calhanoglu, Mkhitaryan, Dimarco, Martinez, Thuram\nWhere to watch PSG vs Inter Milan? Kick-off time and TV channel\nThe 2025 Champions League final will kick-off at 8pm UK time on Saturday, May 31.\nMore Trending\nIn the UK, you can watch the match of TNT Sports 1 or stream the action live on Discovery+, with their coverage getting underway at 6pm.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Inter Milan in mourning hours before Champions League final as former president dies\nMORE: PSG or Inter? Wesley Sneijder makes Champions League final prediction",
  "word_count": 538,
  "scraped_at": "2026-02-14T02:09:11.439001",
  "_text_extracted": true
}