{
  "article_id": "6ee368e74d0f",
  "url": "https://www.90min.com/man-city-step-up-kevin-de-bruyne-replacement-hunt-85m-real-madrid-target",
  "title": "Man City step up Kevin De Bruyne replacement hunt & eye £85m Real Madrid target",
  "date": "20250218T121500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City step up Kevin De Bruyne replacement hunt & eye £85m Real Madrid target\n- Manchester City spent big in January and plan to continue revamping squad\n- Bayer Leverkusen's Florian Wirtz viewed as long-term Kevin De Bruyne replacement\n- Reigning Premier League champions face competition from Real Madrid\nManchester City's recent spending spree could continue with a move for Bayer Leverkusen's Florian Wirtz, a new report has claimed.\nThe 21-year-old has matured into one of world football's best attacking midfielders over the past year, helping to fire Leverkusen to a historic unbeaten Bundesliga season that yielded a first-ever title and ended Bayern Munich's 11-season winning streak.\nWirtz has also become a prominent player for Germany's national team alongside Jamal Musiala, and scored twice at Euro 2024 last summer.\nHis outstanding form has carried over into 2024/25, leading the Daily Mail to suggest that a summer move to Man City could be on the cards. The reigning Premier League champions, who barring a remarkable turnaround will relinquish their crown in May, are on the hunt for potential replacements for 33-year-old Kevin De Bruyne, who is out of contract in the summer.\nDe Bruyne could yet renew his deal at the Etihad Stadium, extending his decade-long stay at the club, but his minutes continue to be managed by Pep Guardiola after a spate of injury problems.\nReal Madrid are also in the mix for Wirtz as they look to strengthen their impressive squad further, while Leverkusen's fierce rivals, Bayern Munich, have publicly declared their interest in poaching another top Bundesliga talent.\nLeverkusen are only likely to entertain a sale if they receive a minimum offer of €102m (£85m), but that's not likely to be a problem given City's spending in the January window. Reports in Germany this week have quoted a dramatically higher figure of £125m, which would be an English transfer record.\nKnowing that missing out on qualification for next season's Champions League is a real possibility, club chiefs sanctioned the signings of Omar Marmoush, Nico Gonzalez, Abdukodir Khusanov and Vitor Reis for combined fees approaching £170m, and further arrivals are expected to help Guardiola usher in a new era at the club.\nTo facilitate further arrivals, City are expected to allow a number of high-profile players to leave. Bernardo Silva has been linked with an exit in recent days, with Jeremy Doku, Jack Grealish and even academy graduate Phil Foden appearing in transfer gossip columns.",
  "word_count": 407,
  "scraped_at": "2026-02-14T01:58:05.345648",
  "_text_extracted": true
}