{
  "article_id": "6ef5fb2289fb",
  "url": "https://www.themag.co.uk/2024/06/aston-villa-owners-threaten-action-against-premier-league-rules-do-not-make-sense-newcastle-united/",
  "title": "Aston Villa owners threaten action against Premier League - Rules do not make sense",
  "date": "20240612T121500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Aston Villa owners threaten action against Premier League – Rules do not make sense\nThe Aston Villa owners believe that the Premier League PSR set-up doesn’t make sense and that the rules aren’t good for football in this country.\nIt is claimed that the PSR is there to prevent certain clubs getting an unfair advantage.\nYet the reality in the eyes of many football fans, is that the true reason for these rules getting brought in, is to ensure the usual half dozen suspects don’t face any long-term challenge by any other club to their cosy arrangement.\nThose with far bigger revenues built up over the years of no restrictions and/or very limited ones, wanting to pull up the drawbridge and make it all but impossible for any other club to close the financial chasm that exists.\nWhat makes it even more of a disgrace, is that these same half dozen Premier League clubs tried to totally ruin both domestic and European football as we know it, as key movers in the shameful European Super League attempt. Plus, instead of getting lengthy Champions League bans, massive fines and potentially other punishments such as transfer embargoes and even relegation (which surely was the fitting punishment), the six of them collectively were only asked to pay a fine equivalenet to less than a week’s wage bill for the half dozen of them collectively.\nThat European Super League attempt had swiftly followed a sly plan where the same six attempted to award themselves extra voting power, greater than the other Premier League clubs, that would have allowed them to dictate all major decisions on the future of the Premier League, especially financial ones.\nTo show just how determined they are to stop any other clubs competing, the usual suspects led opposition to an Aston Villa initiative at the annual Premier League AGM. It would have been a very small help to those clubs trying to compete and yet the established self-appointed elite managed to get it narrowly voted down. It needing 14 of 20 votes to make major changes in the Premier League.\nAston Villa had only been wanting an increase from £105m losses to £135m losses over any three yera period.\nEarlier this year, football finance expert Kieran Maguire reported that the figure of £105m allowed losses was actually brought into play as far back as 2013. He further stated that with ‘football inflation’ taken into account on wages and club revenues these past eleven years, that £105m figure was now the equivalent of £218m+.\nSomething needs to drastically change and good luck to Aston Villa.\nAs that recent lost vote showed, it would only have clubs such as Newcastle United and Aston Villa (and others) in a very small to try and help close the gap, yet even with this, those usual suspects having no intention of allowing anything to change.\nThe Athletic report – 11 June 2024:\nAston Villa owner Nassef Sawiris says he is considering taking legal action against the Premier League’s profit and sustainability rules (PSR).\nIn an interview with the Financial Times, Sawiris — Egypt’s richest man — said the regulations, which place a limit on the amount clubs are able to lose across a three-year period, “do not make sense” and “are not good for football”.\nVilla had a proposal to raise the maximum permitted losses from £105million to £135million rejected at the Premier League’s annual general meeting last week.\nSawiris, who called PSR “anti-competitive”, said he was seeking advice over the prospect of taking legal action against them.\n“Some of the rules have actually resulted in cementing the status quo more than creating upward mobility and fluidity in the sport,” he told the Financial Times in an interview. “The rules do not make sense and are not good for football.”\nHe added: “Managing a sports team has become more like being a treasurer or a bean counter rather than looking at what your team needs.\n“It’s more about creating paper profits, not real profits. It becomes a financial game, not a sporting game.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 692,
  "scraped_at": "2026-02-14T01:57:18.901800",
  "_text_extracted": true
}