{
  "article_id": "6f08ae7bd12d",
  "url": "https://tribune.com.pk/story/2531623/ronaldo-closes-on-asian-champions-league-crown",
  "title": "Ronaldo closes on Asian Champions League crown",
  "date": "20250301T023000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ronaldo closes on Asian Champions League crown\nSaudi sides reign in the tournament with three of them playing last-16 round\nCristiano Ronaldo's Al Nassr travel to Iran in the Asian Champions League next week with his side one of three from Saudi Arabia in the last 16 of the region's top club competition.\nSaudi teams dominated the tournament's West zone league stage, with four-time Asian champions Al Hilal leading Al Ahli and Al Nassr in the top three in the final table.\nSaudi Arabia has shaken up football by spending heavily on stars from Europe, starting with Ronaldo's move in late 2022, and the desert nation will host the World Cup in 2034.\nAl Hilal, the last side from Saudi Arabia to win the Champions League, in 2021, topped the league stage on goal difference from Al Ahli with both unbeaten in eight matches.\nAl Nassr finished five points clear of fourth-placed Al Sadd of Qatar and Ronaldo's side take on Iran's Esteghlal over two legs, the first in Tehran on Monday.\nFormer Real Madrid and Manchester United star Ronaldo scored six goals in the league stage and is still going strong at the age of 40.\nA first Asian crown would add to a bulging trophy haul that already includes five UEFA Champions League titles.\nThe Portuguese has been joined at Al Nassr by Colombian striker Jhon Duran, although the big-money signing from Aston Villa was sent off during a Saudi league game last week.\nThe red card infuriated Ronaldo, who lashed out at the referee and booted the ball into the stands before continuing to remonstrate with the officials.\nCoach Stefano Pioli will need his players to keep their heads against Esteghlal, who Al Nassr beat 1-0 in the league stage thanks to a late goal from former Manchester City defender Aymeric Laporte.\n\"We must try to improve every day as we have not yet reached the level where we can compare ourselves with the first level of world football,\" Pioli said.\nAl Hilal can no longer call on the services of Brazil's Neymar but they will still start as heavy favourites in their last-16 tie against Uzbekistan's Pakhtakor. AFP\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 386,
  "scraped_at": "2026-02-14T02:14:59.445223",
  "_text_extracted": true
}