{
  "article_id": "6f1aab6c865e",
  "url": "https://www.fourfourtwo.com/news/gundogan-is-33-years-old-now-and-he-would-be-a-bit-of-a-gamble-for-any-premier-league-club-let-alone-manchester-city-premier-league-legend-says-pep-guardiola-is-taking-a-risk-by-re-signing-his-former-captain",
  "title": "  Gundogan is 33 years old now and he would be a bit of a gamble for any Premier League club , let alone Manchester City : Premier League legend says Pep Guardiola is taking a risk by re - signing his former captain",
  "date": "20240823T111500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Gundogan is 33 years old now and he would be a bit of a gamble for any Premier League club, let alone Manchester City': Premier League legend says Pep Guardiola is taking a risk by re-signing his former captain\nManchester City could be about to bring their former captain back to the Etihad only a year after letting him go\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nAfter just one season away Ilkay Gundogan is on the verge of re-joining Manchester City.\nThe German midfielder captained City to a historic treble in 2022-23, which included the club's first Champions League, then swiftly departed for Barcelona only weeks later.\nBut financial restrictions at the Catalan giants mean Gundogan is now on his way back to England with City on a free transfer.\nHowever, another Premier League midfield great, Emmanuel Petit formerly of Arsenal and Chelsea believes returning to the Etihad is a risky move for the playmaker.\nVIDEO: Why Arsenal Want Mikel Merino So Badly\nWhy Emmanuel Petit has doubts over Gundogan's City reunion\nGundogan's departure from City was - at the time - a major blow for the champions.\nThe ex-Germany captain, who quit international football after Euro 2024, played a key role in City's treble-winning campaign, making 51 appearances and scoring 11 goals.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nHe was already something of a club legend following his role in the astonishing late comeback against Aston Villa on the final day of 2021-22. Gundogan scoring two late goals that won City the Premier League in dramatic circumstances.\nThe midfielder was offered a new deal, but turned it down in order to move to the Spanish champions.\nAnd according to Petit, that could cause an issue for Gundogan this season, as he aims to win his place back in Pep Guardiola's team.\n\"I wouldn't understand it if Ilkay Gundogan left Barcelona to go back to Manchester City,\" said Petit speaking to Safest Casino Sites.\n\"Even though they're the best team in Europe, Pep Guardiola doesn't take back players who forced exits. Gundogan would be playing with old teammates and would fit in the team fine, but it's not how Guardiola operates.\n\"It would be very unexpected. Gundogan is 33 years old now and he would be a bit of a gamble for any Premier League club, let alone Manchester City.\"\nMore stories\nThe crazy reason that Ilkay Gundogan is re-signing for Manchester City\nRafa Benitez sends 'come and get me' plea to Premier League clubs\nWhy has Jermaine Jenas been sacked by the BBC?\nJack has worked as a sports reporter full-time since 2021. He previously worked as the Chief Women’s Football Writer at the Mirror, covering the England Women’s national team and the Women’s Super League. Jack has reported on a number of major sporting events in recent years including the 2023 FIFA Women’s World Cup on the ground in Australia. When not writing on football, he can often be spotted playing the game somewhere in west London.",
  "word_count": 611,
  "scraped_at": "2026-02-14T01:57:35.674860",
  "_text_extracted": true
}