{
  "article_id": "6f3164a965d0",
  "url": "http://www.theirishworld.com/stephens-day-is-coming-soon/",
  "title": "Stephen Day is coming soon | The Irish World",
  "date": "20240427T124500Z",
  "domain": "theirishworld.com",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New Ireland U21 manager Stephen Kenny tells Damian Dolan why Ireland’s young players are the future\nIt’s been a manic few months for Stephen Kenny – the Republic of Ireland’s new under 21 manager.\nThe appointment of a new under 21 boss doesn’t always attract the levels of interest that accompanied Kenny’s unveiling in November. But then they haven’t previously come with the caveat that Kenny is heir apparent to Mick McCarthy’s throne.\nCome August 2020, Kenny will be in the top job, regardless of how the team performs under McCarthy in the interim.\nNovel or innovative, the FAI’s approach was just reward for a man who started his managerial career with Longford Town before going on to make Dundalk contenders for a Champions League place.\nUnder Kenny, Dundalk won four League of Ireland Premier Division titles in five years, and two domestic league and cup doubles.\nThe FAI effectively handed Kenny 20 months to prepare for the biggest managerial post of his career, and the clock is already ticking.\nIf he’s feeling the heat, you wouldn’t know it, though, as the quietly spoken Dubliner addressed members of the London branch of the Republic of Ireland Supporters Club at the Claddagh Ring in Hendon.\nKenny, 47, is clearly embracing every minute of it, as he happily chatted for well over an hour about his playing days, his 20-year managerial career in the League of Ireland and his plans with Ireland’s under 21s.\nIt was an intriguing insight into the man, upon whom Ireland’s quest to reach a first World Cup since 2002 will rest.\n“It’s a big honour, a big privilege and I’m really, really privileged to have that position, to be coming in as under 21 manager knowing that I’m going to be senior manager in August 2020,” Kenny told the Irish World.\n“It gives me the opportunity to prepare, to go around and look at best practice around the world and Europe and what teams are doing. I’ve already started a bit of that.”\nThe Claddagh is the first stop on a whirlwind few days for Ireland’s senior manager-elect. He’s on yet another scouting mission.\nThe following day he was at Swindon Town vs Crawley Town in League 2 to watch 20-year-old full back Canice Carroll – on loan from Brentford. Then it’s Barnet vs Brentford in the FA Cup on the Monday night. And then on to Crystal Palace vs Charlton in an under 23 game. “Busy but good” is how Kenny describes it.\nIreland open their 2021 Under 21 European Championship qualifying campaign at home to Luxembourg on 24 March at Tallaght Stadium.\nItaly, Sweden, Iceland and Armenia make up Group 1, with only the nine group winners and one runner up to advance to the finals, jointly hosted by Hungary and Slovenia.\nHe’ll have moved into McCarthy’s chair before Ireland bring their campaign to a close in Italy on 13 October 2020.\n“It’s a tough group, but I’d rather be positive and approach it in a positive way. We’re fourth seeds – traditionally fourth seeds never qualify and they never win the group,” said Kenny, adding a note of realism.\nAnd with good reason. Ireland has never before qualified for the finals and it’s hard to imagine that changing with Kenny at pains to point out that just one of the current under 21 age group is playing first-team football on a regular basis – 19-year-old defender Dara O’Shea, who is currently on loan at Exeter City from West Brom.\nA startling statistic and one that suggests Kenny will look to promote players from Ireland’s younger age groups, to the under 21 squad.\n“Ten years ago you’d probably had a good few – most of your team playing regularly in first-teams,” said Kenny, who recently named former Ireland international Keith Andrews amongst his backroom team.\nThere is talent though. Already capped by Ireland at senior level – he came off the bench against Denmark in November – Michael Obafemi (18) is starting to make a name for himself at Southampton.\nBorn in Dublin to Nigerian parents, the striker made his Southampton debut against Tottenham as a 17-year-old in January 2018, after joining from Leyton Orient. He scored his first professional goal in a 3-1 victory at Huddersfield in December.\nTottenham’s Troy Parrott (17) is already being described as one of Ireland’s most exciting prospects for many a year. He celebrated his birthday by signing his first professional contract with Spurs.\nBirthday boy ???????? the best gift I could of asked for, delighted to sign my first professional contract with @SpursOfficial , proud moment for me and my family ???? pic.twitter.com/z7exC2QiiL\n— Troy Parrott (@troyparrott9) February 4, 2019\nThe Dubliner scored three goals in four games at last year’s European Under-17 Championships, before Ireland controversially went out on penalties in the quarter-finals to eventual winners the Netherlands.\nAdam Idah, who turns 18 on 11 February, was also part of the Ireland U17 team. He came through College Corinthians and is now making progress at Norwich City.\n“It’s a sea change; there is a lot of talent, but some of them are young. People talk about Troy Parrott and Adam Idah but they’re 2001 and 2002 birthdays,” said Kenny, offering a note caution.\n“We’ve a lot of young talent, but it’s very young.”\nWhile Declan Rice may be grabbing all the headlines at West Ham, it’s another young Hammer that Kenny’s interested in. London-born 18-year-old midfielder Conor Coventry.\nCoventry, who qualifies for Ireland through his Irish mother, made his Ireland U19 debut against Czech Republic in September 2017. Last year, he helped Ireland secure a place in the UEFA European U19 Championship Elite Round.\n“I like him; he’s a natural play-maker, good passer,” says Kenny, who is measured in everything he says.\nCoventry clearly fits in with the style of football Kenny wants to play. Like Kevin Costner’s ‘I believe’ monologue in Bull Durham, Kenny knows exactly what he wants.\n“I believe in playing within different tempos within the game, establishing control and being able to inject pace into attacks,” he said.\n“I believe in overlapping full backs and good attacking wing play.\n“I love wingers….if I’m a supporter I want to see my team pass the ball.\n“My style against some of the top teams in Europe – I’ve had 46 games in the Champions League and Europa League – has always been to try and dominate possession, and that’s by overloading the midfield.\n“I don’t play with two strikers, or hardly ever do. I’ll only play with one, but I like to overload the midfield and get control of the game.”\nAnd while the Declan Rice saga rumbles on, Kenny says he has no qualms in naming players in his squad, who are also qualified to play for other nations.\n“The main criteria is to be Irish. For various reasons throughout its history, going back to the famine and various recessions, Ireland has had a large degree of emigration,” he said.\n“Just because people move country, doesn’t mean they lose their sense of identity or lose their sense of Irishness. That’s important.\n“If someone does move to England, for example, for work or whatever reason, it doesn’t matter what reason it is, it’s only right that their son or grandson is entitled to play for Ireland. We can’t underestimate that.”\nKenny can also see the parallels with England boss Gareth Southgate, who managed England’s under 21 team for three years before taking over from Roy Hodgson, and guiding the Three Lions to a World Cup semi-final.\n“I think the FAI had a look at that and said it’s something we can’t ignore,” he said.\n“They see me as someone who can take on these players and really nurture and develop them and make them a really exciting team. That’s what I want.\n“The demand from the Irish soccer public, grassroots supporters throughout Ireland, is to see a team really play attacking good football. To see the team pass the ball in a cohesive and ambitious way.”\nSoftly spoken and amiable, yes. But Kenny knows what he wants. It’s taken him 20 years to get here and he’s not about to let the opportunity pass him by.\nYou might also be interested in this article\nhttp://35.176.73.46/euro-2020-vision-sees-fortune-favour-lucky-mick/",
  "word_count": 1380,
  "scraped_at": "2026-02-14T02:07:51.318001",
  "_text_extracted": true
}