{
  "article_id": "6f3ed88fd79a",
  "url": "https://www.90min.com/posts/casemiro-ready-leave-manchester-united-january",
  "title": "Casemiro ready to leave Manchester United in January",
  "date": "20231215T130000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Casemiro ready to leave Manchester United in January\n- The Brazilian midfielder is a transfer target for the cash-rich Saudi Pro League\n- Manchester United's current highest earner accepts it's best to move on\n- Red Devils boss Erik ten Hag under huge pressure to turn recent results around\nCasemiro is ready to leave Manchester United in January after accepting his future lies away from Old Trafford, 90min understands.\nThe 31-year-old arrived to much fanfare in August 2022, signing a four-year contract as United agreed to a deal with Real Madrid worth as much as £60m.\nHis initial performances at Old Trafford were promising, in terms of organising the club's fragile midfield and contributing late winning goals, and led Erik ten Hag to state in January that Casemiro \"is magnificent. In front of the back line, always taking good positions, in and out of position. And he can deal with the ball, he can give the right pass.\"\nCasemiro even scored the opening goal in United's 2-0 win over Newcastle in the Carabao Cup final in February, ending the club's six-year trophy drought.\nBut he'd been sent off three weeks earlier for putting his hands around the neck of Crystal Palace midfielder Will Hughes, resulting in a three-match ban, and was shown a straight red card for a tackle on Southampton's Carlos Alcaraz upon his return - this time earning a four-game suspension.\nThe Brazilian's performance levels have dipped significantly this season, coinciding with a downturn in United's form. The Red Devils have lost 12 games in all competitions already, are out of Europe altogether after finishing bottom of their Champions League group and sixth in the Premier League table.\nCasemiro has been out injured since October, missing 13 games to date, but despite his absence and apparent decline, 90min revealed in November there was significant interest in his services from the cash-rich Saudi Pro League.\nUnited appreciate the opportunity to recoup most, if not all, of the money they paid for Casemiro may not come around again, and there's a growing sense that the club's hierarchy would sanction a transfer in January if an interested party were to bid.\nSources have confirmed to 90min that Casemiro also accepts now may be the right time to leave United, with interest from the Saudi Pro League remaining high. Paris Saint-Germain have also been linked with a move, but concerns around Financial Fair Play compliance means it's unlikely they can compete with an offer from the Middle East.\nAllowing Casemiro to leave would rid United of their highest earner - he pockets around £300,000-per-week - and space on the wage bill may be also be freed up by exits for Jadon Sancho, Donny van de Beek, Raphael Varane and Anthony Martial.\nWho makes the decision to allow Casemiro to leave remains to be seen, with Sir Jim Ratcliffe's INEOS-led 25% investment still yet to be finalised. Once it is, the British billionaire intends to put in place a new football department at Old Trafford, effectively restructuring the club behind the scenes in a bid to smarten up their business dealings.\nUnited's transfer policy has been criticised in particular, with the significant amount of money invested in Casemiro one of many questionable decisions, and there's also doubt over the future of manager Ten Hag.\nThe Dutchman is under increasing pressure in Manchester and former Chelsea boss Graham Potter has been linked with taking charge over the past few days. However, 90min understands that a decision of such magnitude will not be made until Ratcliffe's new regime has been established, potentially buying Ten Hag enough time to turn things around.",
  "word_count": 606,
  "scraped_at": "2026-02-14T01:56:38.156993",
  "_text_extracted": true
}