{
  "article_id": "6fcb5df5dab9",
  "url": "https://www.teamtalk.com/manchester-united/top-red-devils-star-told-faces-life-international-wilderness-because-old-trafford-struggles",
  "title": "Top Man Utd star told he faces life in international wilderness due to Old Trafford struggles",
  "date": "20231025T221500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTop Man Utd star told he faces life in international wilderness due to Old Trafford struggles\nStruggling Manchester United midfielder Mason Mount has been told that he faces a “massive struggle” to get back into the England squad.\nMount has managed only seven appearances for United this season, totalling just 425 minutes of action since his £55million switch from Chelsea over the summer.\nInjury has played a big part in the lack of game time, although Mount was on the bench as an unused substitute as United beat FC Copenhagen 1-0 on Tuesday night to get their Champions League campaign back in track.\nBut in terms of his international career, Mount, who has won 36 caps for his country, has not been included in Gareth Southgate’s last three squads.\nMalta and North Macedonia are next up in November for an England side who have already qualified for Euro 2024 after victory over Italy last time out.\nAnd Mount’s chances of featuring in those two outings are very slim, as he sits behind the likes of Conor Gallagher, James Ward-Prowse and James Maddison in the midfield pecking order – not to mention some of the more established names.\nSpeaking about Mount’s international, former Three Lions frontman Gabby Agbonlahor told Football Insider: “It’s going to be a massive struggle to get back in that England squad for Mount.\n“He’s a favourite of Southgate’s, we’ve all called him Southgate’s son for years – but this is where he has to be left out.\n“Look at the position he plays in – even Ward-Prowse can’t get in with the form he’s in.\n“He’s up against Gallagher, Maddison, Bellingham, Foden – he’s just not going to get in.\n“The only way he can get in is by starting to perform at Man United. At the moment that doesn’t look likely.”\nMount will be hoping to get back on the pitch on Sunday when United face the small matter of a Manchester derby against City at Old Trafford.\nREAD MORE: Ten Hag threatens Postecoglou dream as Man Utd bid to snatch Tottenham target who is ‘ready to move’",
  "word_count": 358,
  "scraped_at": "2026-02-14T02:00:57.108013",
  "_text_extracted": true
}