{
  "article_id": "6fe1acf23c4e",
  "url": "https://www.lbc.co.uk/article/champions-league-manchester-city-win-madrid-5HjdPF6_2/",
  "title": "Manchester City win in Madrid and Arsenal maintain 100 per cent record but Newcastle left frustrated in Champions League",
  "date": "20251211T004500Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City win in Madrid and Arsenal maintain perfect European record in Belgium to ease dip in form\nThe two giants recorded good wins but Newcastle were left frustrated by a draw in Germany\nManchester City recorded an impressive win at Real Madrid during Wednesday evening's Champions League action as pressure ramped up on Los Blancos boss Xabi Alonso.\nListen to this article\nCity impress in Madrid\nFifteen-time winners Madrid were beaten at home 2-1 by City, who had to come from behind to register all three points.\nNico O'Reilly levelled ten minutes before half time with his first European goal, after Rodrygo gave the hosts an early lead at the Estadio Bernabéu.\nErling Haaland then netted his 51st Champions League goal from the penalty spot minutes before half time.\nThe result keeps City in fourth in the group standings, which would assure them passage to the next round without having to contest a play-off match.\nThe result piles the pressure on Madrid boss Xabi Alonso, after just two wins in their last eight matches.\nArsenal dominate in Belgium\nNoni Madueke scored twice to fire Arsenal to a 3-0 victory at Club Brugge and all-but assure their qualification for the knockout stages with two group matches to play.\nGabriel Martinelli extended his side's advantage to three with a brilliant strike to become the first Arsenal player to score in five consecutive Champions League contests.\nThe Gunners follow Manchester United, Leeds, Liverpool and Manchester City in becoming the fifth English team to win all of their first six European Cup matches.\nThe north Londoners need just one point, with matches against Inter Milan on January 20 and Kazakhstan side Kairat at the Emirates a week later, to guarantee knockout European football for a third straight season.\nNewcastle concede late on once more\nAlejandro Grimaldo broke Newcastle’s hearts as he struck late to deny them Champions League victory at Bayer Leverkusen in a 2-2 draw.\nSubstitute Lewis Miley looked to have claimed all three points at the BayArena with a 73rd-minute header after Anthony Gordon’s penalty had cancelled out Bruno Guimaraes’ unfortunate own goal on a night when Malick Thiaw was perhaps fortunate not to be sent off before the break.\nIn the Premier league, no other side have thrown away more points [11] from winning positions this season than Eddie Howe's team.\nFlekken pulled off a stunning save to deny Thiaw and substitute Jacob Murphy late on but although Aaron Ramsdale saved from Tella, he could not keep out Grimaldo’s late strike after he had been played in by Maza.\nEddie Howe's side now sit 12th in the table and look set to secure a play-off position.",
  "word_count": 446,
  "scraped_at": "2026-02-14T02:19:12.275373",
  "_text_extracted": true
}