{
  "article_id": "6ff06badf1f9",
  "url": "https://weaintgotnohistory.sbnation.com/2023/11/24/23974779/mauricio-pochettino-hoping-to-resume-momentum-build-consistency-as-chelsea-begin-important-period",
  "title": "Pochettino hoping to resume momentum , build consistency as Chelsea begin  important period  ",
  "date": "20231125T000000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea went into the international break with a three-match unbeaten run in all competitions, including back-to-back four-goal outputs against Spurs and Manchester City, collecting four points from those two games against the top two teams in the league.\nMauricio Pochettino hoping to resume momentum, build consistency as Chelsea begin ‘important period’\nPre-match thoughts from the boss\nThose results have given a massive boost to the confidence and trust we might have in each other as a team, and the confidence and trust we all might have in this ambitious, grand, bold project of ours. The process seems to be working — perhaps not at everyone’s preferred pace or style, but we’re making progress and that’s the most important thing for this season.\nSo it was unfortunate that the momentum of the win against Spurs and the fantastic 4-4 draw against Manchester City was then so rudely interrupted by yet another international break. Thankfully, it’s the last such break for the calendar year, and the last such break until March, so now we have a nice, long, and quite busy run of fixtures to truly get some momentum going, and truly start building some consistency.\nAt least that’s what Mauricio Pochettino’s hoping for.\n“We are going to try to keep the momentum. It is true we were in a moment [before the break] that we were getting our way to play and the results were in our side. I am a person that believes that we can keep the momentum even with two weeks without no competition.\n“It’s a good time ahead because we love to work and we need to spend time together on and off the pitch. It’s going to be an important period for us to settle our principles and ideas. We were not consistent in the first period of the competition. [...] That is part of the process because we are a young team, started work four months ago and we need to be more mature.\n“[We] need to be more patient we cannot get frustrated so soon when things don’t work, when we don’t create chances or score goals. [It] is about being more mature. We are going to improve with time. More than tactical or physical, it’s being more mature like a team.\n“[And] the most important is we need to be consistent in the way we think. [...] We need to keep in the same way, we cannot change every day. It’s important to assess after a period, when you win the perception is different than when you lose. Most important is we are more confident and tomorrow we have an opportunity to confirm we are in a good way but we must understand we are against team that is strong, building now to compete in Champions League, that is our aim for next season for us. It’s going to be tough and we need to be ready to compete and fight for every single ball.”\nUnfortunately, Christopher Nkunku will not be quite ready to fight for every single ball, but Levi Colwill should be back. Others, like Moisés Caicedo have come back from international duty on the other side of the world, so they need to be assessed. Caicedo (and Enzo Fernández, too) played without being truly fully fit following the last international break, so that always adds extra consideration and complication.\n“Today was the last [player to return], Moisés Caicedo. Now we need to assess. They already know the starting XI for tomorrow but I’m not going to make public. I think all arrive in a normal condition. Already picked the starting XI. I will give to you tomorrow.\n“Colwill yes [will be in the squad]. Lavia and Nkunku still out. It’s difficult [to] say [a timeframe] because we need to assess them day by day. They are in a good condition. Nkunku a little ahead of Lavia. He was doing things with the group last week, still not full recovery to be part of the squad.”\n-Mauricio Pochettino; source: Football.London\nLet’s pick up right where we left off!",
  "word_count": 677,
  "scraped_at": "2026-02-14T02:20:16.283977",
  "_text_extracted": true
}