{
  "article_id": "7001f47082a4",
  "url": "https://dailynews.co.tz/mwinjuma-targets-afcon-progress-beyond-group-stage/",
  "title": "Mwinjuma targets AFCON progress beyond group stage",
  "date": "20241222T084500Z",
  "domain": "dailynews.co.tz",
  "source_country": "Tanzania",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mwinjuma targets AFCON progress beyond group stage\nMOSHI: DEPUTY Minister for Information, Culture, Arts and Sports, Hamis Mwinjuma, has expressed ambition to break Tanzania’s record of consistently exiting in the Africa Cup of Nations (AFCON) at the group stage.\nSpeaking at the opening of the Tanzania Football Federation (TFF) General Assembly in Moshi, Kilimanjaro, Mwinjuma underscored the government’s role in supporting both infrastructure development and team preparation for international tournaments.\nMwinjuma stated that the goernment has two primary responsibilities when it comes to organising AFCON: Improving infrastructure and preparing a competitive team. He further stressed that it would be “shocking” if the national team were to be eliminated early from the competition again.\n“I want to break the record of exiting at the group stage. I like accolades and this is one accolade I truly desire,” Mwinjuma remarked.\nHe also outlined the broader vision for Tanzanian football, which includes qualification for the 2030 FIFA World Cup.\n“After successfully hosting the African Nations Championship (CHAN) and AFCON, we want Tanzania to qualify for the World Cup in 2030 and become a football powerhouse in Africa,” he added.\nMwinjuma lauded the leadership of TFF for its significant achievements in Tanzanian football within a short period and reassured that the government would not be an obstacle in supporting any national team competing internationally.\nALSO READ: TFF approves 56.31bn/- budget for 2025\nFurthermore, Mwinjuma expressed confidence that both Simba and Yanga, two of the country’s top football clubs, will qualify for the quarter-finals in their respective continental competitions.\nYanga is participating in the CAF Champions League, while Simba is competing in the CAF Confederation Cup. “The government is fully behind these teams to ensure they perform well and raise the country’s flag high. We believe they will qualify for the quarter-finals,” Mwinjuma said.\nThe deputy minister further called on all football stakeholders to unite and collaborate effectively with TFF in order to ensure that Tanzania continues to make strides both domestically and on the international stage.",
  "word_count": 332,
  "scraped_at": "2026-02-14T02:11:20.838818",
  "_text_extracted": true
}