{
  "article_id": "7028561c1b38",
  "url": "https://www.fourfourtwo.com/features/arsenals-katie-mccabe-there-was-no-beef-with-chloe-kelly-after-that-moment-we-are-excited-to-be-teammates-again-and-to-build-a-connection-on-the-pitch-most-importantly",
  "title": "Arsenal Katie McCabe explains THAT  beef  with Chloe Kelly",
  "date": "20250215T121500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal's Katie McCabe: 'There was no beef with Chloe Kelly after that moment, we are excited to be teammates again and to build a connection on the pitch most importantly.'\nKatie McCabe speaks exclusively to FourFourTwo on the North London derby, Kelly's arrival and the appointment of Renée Slegers\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nKatie McCabe has generated many iconic moments on a football pitch but one of the most famous was when she bounced a ball off of Chloe Kelly's head in April 2023.\nThe action, in a game between Arsenal and Manchester City, led to a yellow card for the defender and countless memes were created.\nWhen Kelly signed on loan for the Gunners in the 2025 winter transfer window, many supporters wanted the moment to be re-created with McCabe. The social media team already had the idea in motion and the video saw the pair agreeing to a truce.\nMcCabe: \"Kelly has caused me problems as a full-back at times because she has so much quality\"\nTime for a truce? 🤝 pic.twitter.com/m8jKium7U3February 1, 2025\nMcCabe told FourFourTwo of the video: \"I have seen fans call it an iconic moment. I have known Chloe a long time, we have a great relationship and she is a good friend of mine.\n\"There was no beef after that moment at all. I just made sure Chloe was comfortable with doing the announcement that way. We are excited to be teammates again and to build a connection on the pitch most importantly.\"\nMcCabe and Kelly have played alongside one another before. The England international came through the Arsenal academy and McCabe joined the Gunners in 2015.\nThe duo became rivals when Kelly had loan spells Everton in 2016 and 2017 before making a permanent move to the Toffees in 2018. Kelly then moved to Manchester City in 2020 before being loaned to Arsenal in January.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"I am just excited to have her back in.\" McCabe said of Kelly's return.\n\"I know the quality she has and she has caused me problems as a full-back at times because she has so much quality. I was talking to the girls the other day and it feels like she has never really left. She has slotted right back in.\n\"She wasn't able to play [immediately] because of being cup-tied but I am really excited for her being available for Sunday. I am excited to get going with her and playing with her.\"\nKelly is likely to make her second Arsenal debut on Sunday in the North London derby against Tottenham at the Emirates Stadium.\nThe rivalry between the teams is palpable on game-day and McCabe says she cannot wait to be back at the Emirates as \"you can't beat\" playing there.\n\"It is so exciting as a player,\" McCabe said. \"Having 50,000 tickets sold creates that extra bit of atmosphere as well and excitement heading into the weekend.\n\"Having played for Arsenal for so long I've seen the evolution of the derby, playing in front of not many fans to where it is at now and will potentially be on Sunday is so exciting.\n\"Even back in 2019 when we played for the first time at the Tottenham Hotspur Stadium, it was so cool. To see it grow and get bigger and bigger is so exciting. For us, the most important thing is winning those derbies as well.\"\nArsenal fans are always in full voice during matches but the derby adds an extra edge to the fixture. The atmosphere created by supporters does not go unnoticed by the players, McCabe adds.\n\"I think as a football player when you cross the white line, I know it is a cliche, you try and concentrate on what your job is first and foremost. Zoning in on your opposition and teammates.\n\"But as the noise generates and gets louder, the closer you get to goal especially, you feel it.\n\"Whether you go 1-0 down or 1-0 up the energy and atmosphere the fans generate for us as players on the pitch, especially in those massive games, whether it's a North London Derby, a top of the table clash or the Women's Champions League, it's so important for us.\"\nThe derby will be new manager Renée Slegers' second in the WSL after the Gunners beat Spurs 3-0 in November.\nSlegers has had an impressive tenure since taking over as boss after Jonas Eidevall resigned in October.\nHer unbeaten run before Christmas saw her interim appointment made permanent. But what has she brought to the team to spark such form?\nMcCabe says: \"I think having been assistant coach to Jonas, she had such a great relationship to all of us individually and as a team.\n\"What she has brought from the get go is a calmness and a real composure. She is quite a composed person. The pressures of the game, whether that's losing in games or chaos, she brings a real calm aura about her. She always finds solutions for us.\n\"We can really feel that and relate to her. \"Her being an ex-player as well she understands how it is at times in the high pressure moments. It's a nice way of communicating with her as well from that point of view because she understands.\n\"When Jonas had left it was a change for us all and we had trust in Renee and all of the coaching staff to come in and help us.\n\"We did that, we went on a run right up until before Christmas which was really good. We set our objectives as a team in each block and we achieved it together.\n\"Now she is the manager we can kick on even further, it's exciting. The club made a really good decision as well and we are all focused on taking out games to the next level.\"\nMcCabe is always looking to see how she can improve on the pitch and says Whoop helps her immensely. She has been an ambassador for the company for over three years and says the technology aids her in her recovery.\n\"When I came across Whoop it had everything in one for me,\" she said. \"In terms of my recovery, sleep strategies. The data I have built up over the last few years helps me edge those 1 percents.\n\"Even from a recovery point of view, doing ice baths or contrast baths or Normatec boots, massage - seeing how that helps me recover in the best way the next day.\"\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 1245,
  "scraped_at": "2026-02-14T01:52:15.337949",
  "_text_extracted": true
}