{
  "article_id": "703e2f0433f8",
  "url": "https://theathletic.com/live-blogs/manchester-city-leipzig-champions-league-live-scores-updates-results/AZT4IkpmpI1f/",
  "title": "Manchester City vs Leipzig live updates",
  "date": "20230314T163000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Advertisement\nHow Haaland scored five goals to lead Manchester City past RB Leipzig into Champions League quarter-finals\nSummary\nErling Haaland scored five goals as Manchester City blew RB Leipzig away 7-0 in the second leg of their Champions League tie, advancing to the quarter-finals by an aggregate score of 8-1.\nHaaland is the third player to score five times in a single Champions League match, joining Lionel Messi and Luiz Adriano.\nWith 39 goals in all competitions, the 22-year-old has also broken Tommy Johnson's club record for the most goals scored in a single season that had stood since 1929.\nIlkay Gundogan and Kevin De Bruyne also scored for City, who reach the last eight of the Champions League for the sixth straight season.\nPep remembers Julia Roberts spurning Man City\n\"I have three heroes in life, Michael Jordan, Tiger Woods, and Julia Roberts. Julia Roberts came to England a few years ago in the period when Manchester United were not good, we were better, and she came to Manchester United, she didn’t come to see us. Even if I win the Champions League, it cannot make up for Julia Roberts not coming to see us.\"\nRose: 'City more than deserved their win'\nMarco Rose has spoken to the media: \"I know Erling very well, I know his qualities. When Erling is close to the goal, he wants to grab one. He scored four - no, even five tonight.\n\"We never managed to get into the game. That is my responsibility. We conceded the goals in a manner that makes this very bitter. City more than deserved their win.\n\"We were especially bad when it came to defending inside the penalty area. And we did so in a round of 16 game in the Champions League.\n\"They changed a few things in their pressing compared to the second half in Leipzig and this is something we had not expected.\"\nOn Erling Haaland: \"He has a great night. He was so hungry. He scored goals with the foot and head, won second balls, deep runs. It looked really simple. He took the ball from the referee, that tells you it was special night for him. Congratulations to Erling.\"\nForsberg: 'We did not have a chance'\nBenjamin Henrichs and Emil Forsberg spoke to the media after the brutal loss.\nHenrichs: \"I have never before lost 7-0 in my career. It's a brutal and bitter evening for us. Haaland is physically very strong. He has a lot to offer, it is very difficult to defend him.\"\nForsberg: \"It doesn't feel good. I don't want to look for excuses. It hurts. City did well, they have a fantastic team. We have to be honest, we did not have a chance.\"\nPep: 'Erling was amazing'\nPep Guardiola has also spoken to BT Sport: \"It was a really good performance from minute one until the end from everyone.\n\"We play very good with and without the ball. We scored a lot of goals. Erling was amazing but everyone was exceptional.\n\"Five in 60 minutes. Incredible guy, huge talent. Power, mentality, he's a serial winner. Really good.\"\nOn whether they have missed those goals in previous seasons: \"I don't think so. The reason why we concede a lot of goals we give the opponent.\n\"We scored four goals here against Real Madrid, six against Monaco, four against Tottenham. A lot of the time we were out because we conceded a lot. Right now these guys they defend really well. We had with Sergio before, this instinct to score goals.\"\nHaaland: 'My super strength is scoring goals'\nErling Haaland has spoken to BT Sport after his record-setting night: \"It's a big night. Firstly, I'm proud to play in this competition, I love it. Five goals! To win 7-0 is amazing.\"\nOn which of the five goals was his favourite: \"I'm blurry in my head. I remember shooting but not thinking. I was so tired after my celebrations.\n\"My super strength is scoring goals. Should I be honest? A lot of goals today, I didn't think. I was just trying to get it into the back of the net. A lot of it is being quick in the mind and trying to put it where the goalkeeper is not.\"\nOn City's game plan: \"We worked on the pressing yesterday, especially at home we have to run and press. We are so good at getting the ball. In my opinion, we should do this more.\n\"I think we can use (pressing) more. There is more space for the guys in between to play. Compared to last year and now we can play with a striker in behind and that's what I'm trying to bring.\"\nOn being substituted: \"I told (Pep Guardiola) I would love to score a double hat-trick but what can I do?\"\nClassic Champions League night at the Etihad\nUnfortunately for fans of goals, when City makes lot of changes the last 15-20 minutes of a match usually peter out, and that was the case there until Kevin De Bruyne stroked in one of his trademark strikes to send the fans home with even bigger smiles on their faces.\nThis was an evening that promised to be quite tricky for City, and there was not a lot of love for Pep Guardiola’s line-up, but they were excellent, buzzing with energy all evening and getting the goals that their play deserved.\nHaaland’s five goals break all sorts of records - youngest player to reach 30 goals in the Champions League, quickest player to reach 30 goals in the Champions League - and City get the kind of result that it feels like they have needed this season. A classic Champions League night at the Etihad.\nThe only man who can beat Pep is Pep\nManchester City have now won each of their past 10 Champions League home matches against German clubs, scoring at least two goals in each contest.\nThe last German club to win away at Manchester City in this competition?\nBayern Munich in 2013-14, led by none other than Pep Guardiola.\nCity match Arsenal's record\nManchester City are now unbeaten across their past 24 home matches in the Champions League, winning 22 of those games.\nThey have equalled Arsenal’s record for the longest home unbeaten run by an English club in the competition, set between September 2004 and April 2009.\nA record night for City\nThanks to De Bruyne's goal in the 92nd minute, Manchester City equalled their biggest-ever win in the Champions League, matching a 7-0 victory against Schalke in March 2019.\nCity scored so many goals...\nThat the Etihad Stadium announcer couldn't keep track of them!\nSix of last eight confirmed\nWe now know six of the eight teams that will comprise the Champions League quarter-finals:\n- Manchester City\n- Chelsea\n- Inter Milan\n- AC Milan\n- Bayern Munich\n- Benfica\nThe final two sides will be determined tomorrow:\n- Real Madrid host Liverpool after winning 5-2 at Anfield in the first leg\n- Eintracht Frankfurt travel to Napoli, who lead 2-0 from the first leg\nPorto 0-0 Inter Milan\nToday's other Champions League match has just concluded. Porto and Inter Milan have drawn 0-0, meaning the Italian side advance to the quarter-finals by an aggregate score of 1-0.\nPorto had two glorious chances to level the score in second-half stoppage time but could not find the back of the net. Pepe was sent off for the Portuguese side in the 97th minute.\nSix straight quarter-final appearances\nManchester City reach the quarter-finals of the Champions League for the sixth straight season.\nFor Leipzig though, their run to the semi-finals in 2020 remains the only time they have advanced past the round of 16 in this competition.\nFT: Manchester City 7-0 RB Leipzig\nIt's all over. A stunning performance by City, a real statement of intent.\nGOAL! City hit seven!\n90+2' Manchester City 7-0 RB Leipzig\n(City lead 8-1 on aggregate)\nDe Bruyne scores a beautiful curling shot from outside the box. The cherry on top of this glorious sundae for City.\nInjury time\n90+1' Manchester City 6-0 RB Leipzig\n(City lead 7-1 on aggregate)\nTwo minutes are added on here. Realistically we should have more, but the officials must have decided to put Leipzig out of their misery sooner rather than later.\nRaum shaken up\n87' Manchester City 6-0 RB Leipzig\n(City lead 7-1 on aggregate)\nRaum receives treatment after a collision with Ederson but is OK to play on.\nThis game is limping to a quiet finish, as both sides understand the result is long past confirmed.\nVideo of Haaland's fourth and fifth goals - US readers\nUS readers can check out Haaland's second-half goals here:\nVideo of Haaland's fourth and fifth goals - UK readers\nUK readers can check out two of City's second-half goals here:\nTeam Stats\nMCI\nRBL\nGame Details",
  "word_count": 1480,
  "scraped_at": "2026-02-14T01:53:35.637053",
  "_text_extracted": true
}