{
  "article_id": "703f0195dfc3",
  "url": "https://metro.co.uk/2023/10/02/arsenal-squad-stuck-at-luton-airport-on-eve-of-champions-league-clash-19592819/",
  "title": "Arsenal squad stuck at Luton Airport on eve of Champions League clash",
  "date": "20231002T200000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal’s Champions League preparations have been disrupted after their flight from Luton Airport to France was delayed due to bad weather on Monday evening.\nThe Gunners were due to depart late in the afternoon ahead of Tuesday’s group stage clash against Ligue 1 side Lens but they are currently still stuck in London.\nManager Mikel Arteta was scheduled to speak to the press from Lens’ Stade Bollaert-Delelis shortly after touching down at 6pm BST but his conference has now been cancelled – though he did later do a brief phone interview.\nA lightning storm in the area surrounding Luton is the cause of the delay and football.london are reporting that the Arsenal squad may not arrive in France ‘for some time’.\nThe disruption will be a nuisance for Arteta, who plans away days meticulously, and the squad are not expected to arrive at their hotel until late in the evening.\nAlthough the cancellation of Monday’s press conference was out of Arsenal’s hands, it could land them in hot water with UEFA.\nClubs participating in Europe are obliged to hold a press conference featuring both the manager and a player – with William Saliba having been put forward ahead of facing Lens – between noon and 8pm the day before the match.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nArsenal will not be able to hold their press conference during those hours and they will need to provide a reason to UEFA or potentially face punishment – though that is unlikely to happen.\nLens have made a poor start to the new Ligue 1 season and are currently 15th, though they did muster a draw away to Sevilla in their first group game.\nLooking ahead to facing the French side after seeing off Bournemouth 4-0 at the weekend, Arteta said: ‘I am just thinking on that bus, how we can prepare Lens.\nMore Trending\n‘It’s going to be a really tough match away from home on Tuesday to try to win it and Manchester City will be the next step.\n‘But it’s taking a lot of good things and move them for Tuesday and again try to make the right decision with the line-up and squad to maintain the level we are showing.’\nArsenal’s players trained as normal on Monday morning ahead of their delayed flight to Lens, with Bukayo Saka and Thomas Partey both taking part though Gabriel Martinelli was a no-show again.\nMORE: Arsenal captain Martin Odegaard reacts to Manchester City slipping up against Wolves\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 484,
  "scraped_at": "2026-02-14T02:25:00.758390",
  "_text_extracted": true
}