{
  "article_id": "70422e48fabc",
  "url": "https://www.aol.co.uk/articles/why-isnt-pep-guardiola-man-120232725.html",
  "title": "Why isnt Pep Guardiola at Man City press conference today ? Absence explained",
  "date": "20251212T123000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why isn't Pep Guardiola at Man City press conference today? Absence explained\nPep Guardiola has pulled out of conducting a press conference ahead of Manchester City’s Premier League trip to Crystal Palace.\nGuardiola was due to address the media as usual at 12:30pm GMT at the City Football Academy on Friday afternoon, in advance of Sunday’s clash at Selhurst Park that pits fourth against second in a rematch of the FA Cup final from last season.\nHowever, that is no longer the case after City confirmed that Guardiola would miss the press conference due to a “personal matter”.\nFormer City defender Kolo Toure, who was promoted from his role as under-18s boss to assistant first-team coach over the summer, will take the place of the manager on Friday.\nThe club added that Guardiola was still expected to take charge of the team as usual against high-flying Crystal Palace in another key fixture in the title race.\nCity head into the weekend sitting second in the Premier League behind Arsenal, having cut the deficit from five to just two points last weekend as the Gunners’ last-gasp 2-1 loss at Aston Villa was followed by City winning 3-0 at home to surprise package Sunderland.\nThat latter result also saw City quickly take back second place from in-form Villa, who had proved their own title credentials by continuing a remarkable run of consecutive victories that now stands at eight across all competitions after Thursday night’s 2-1 win away at FC Basel in the Europa League.\nCity will be expected to have to beat Palace to trim that gap to Arsenal back down to two points, with the injury-hit Gunners - who responded to the loss at Villa by winning 3-0 at Club Brugge in the Champions League on Wednesday - hosting rock-bottom and still winless Wolves at the Emirates Stadium on Saturday night.\nVilla, a point behind Guardiola’s men in third, are in action at the same time as City on Sunday when they travel to meet struggling West Ham at the London Stadium.\nCity have won four games in a row across all competitions since their shock pair of successive losses to Newcastle and Bayer Leverkusen late last month, coming from behind to win 2-1 against Real Madrid in a heavyweight Champions League clash at the Bernabeu in midweek.\nThey will be out for revenge following last season’s surprise FA Cup final defeat by Palace, who go into the weekend sitting fourth and five points adrift of their opponents after back-to-back away wins in the top-flight against Burnley and Fulham and a 3-0 victory over Shelbourne in a Conference League game in Dublin on Thursday.\nFormer Ballon d’Or winner Rodri is likely to remain sidelined for Sunday’s game, while Mateo Kovacic and John Stones are also out for City.",
  "word_count": 467,
  "scraped_at": "2026-02-14T02:27:05.512269",
  "_text_extracted": true
}