{
  "article_id": "7065f4da96d8",
  "url": "https://metro.co.uk/2025/05/17/crystal-palace-vs-man-city-fa-cup-final-team-news-predicted-lineups-injuries-2-23099763/",
  "title": "Crystal Palace vs Man City : FA Cup final team news and predicted lineups",
  "date": "20250517T071500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace have won the FA Cup for the first time in their history after a heroic victory over Manchester City at Wembley.\nEze Eberechi scored a stunning counter attack goal after 16 minutes, sweeping home a cross from Daniel Munoz after waves of City pressure to give the Eagles a priceless lead.\nThere was major controversy when Palace goalkeeper Dean Henderson escaped punishment after handling the ball outside his box with Erling Haaland bearing down on goal.\nHenderson went onto play a defining role in preserving Palace’s lead at the end of the first-half, guessing right to deny Omar Marmoush’s penalty after Bernardo Silva was brought down by Tyrick Mitchell.\nCity toiled looking for an equaliser that never came with Henderson making more vital saves, also denying Josko Gvardiol and Jeremy Doku.\nClaudio Echeverri, the Argentine starlet brought off the bench for his senior debut, also had his chance to draw his side level late on with Henderson again equal to it.\nWhile dominating possession across the 90 minutes, it counted for very little for City.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPep Guardiola and his side end their season trophyless with Saturday’s final also serving as a goodbye to Kevin de Bruyne, who will leave City after 10 years at the end of the season.\nBut for Palace, the celebrations are just getting started after finally ending their wait for major silverware.\nCity’s season comes to a bleak end… and it could get worse\nAfter winning the last four Premier League titles, City’s crown was taken from them by Liverpool this term.\nAn early Champions League exit in February underlined the growing issues within Guardiola’s side with their place in that competition next season still not assured.\nCity have two league games left against Bournemouth and Fulham, currently sat in sixth with the league’s top five qualifying for Europe’s premier competition.\nEze basks in glory for Palace\nEze’s goal caps a remarkable season for the England international who has developed into perhaps Palace’s best player, filling the void left by Wilfried Zaha and Michael Olise.\nMore Trending\n‘This is special, I don’t even know what to say. Thank God, only God could do this,’ he said post-match.\n‘Facing the team that’s been the best in the world for years, to show that type of spirit and energy… only God.\n‘City keep the ball so well, you have to work so hard to get anything from them. When you get in their box you have to make the chance count.\n‘I’ve come a long way. To be in this position now – it’s hard to use the right words here.’\nMORE: Pep Guardiola called a ‘bald rat’ in brutal taunt following FA Cup final defeat\nMORE: The reason Erling Haaland didn’t take penalty in Man City FA Cup final defeat\nMORE: Pep Guardiola furiously confronts Dean Henderson after FA Cup final controversy",
  "word_count": 531,
  "scraped_at": "2026-02-14T02:26:38.637613",
  "_text_extracted": true
}