{
  "article_id": "7074f3e67baf",
  "url": "https://www.taiwannews.com.tw/en/news/4860881",
  "title": "Focus on coaches as Madrid hosts Chelsea in Champions League | Taiwan News",
  "date": "20230411T231500Z",
  "domain": "taiwannews.com.tw",
  "source_country": "Taiwan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MADRID (AP) — The latest encounter between Real Madrid and Chelsea in the Champions League will put a spotlight on their coaches.\nChelsea will travel for Wednesday's first leg in Madrid with Frank Lampard trying to win for the first time since being named interim coach.\nMadrid will play still surrounded by doubts about Carlo Ancelotti’s future amid rumors of him taking over Brazil’s national team.\nThe outcome could potentially help Lampard reclaim a permanent job with the English club, or influence Ancelotti’s decision on whether to accept the Brazil job.\nChelsea appointed Lampard to replace Graham Potter and lost its first game with him in charge in the Premier League over the weekend. The former midfield great also coached the team from 2019-21. The club enters the match at the Santiago Bernabeu Stadium on a four-match winless run. It has won only two of its last 11 matches in the Premier League, where it sits in 11th place.\n“Games like tomorrow are a great chance to perform and show the personality that makes you a proper leader,” Lampard said Tuesday. “It’s normal in a season when a club like us falls below the levels we want the character gets questioned. It’s one of the first things probably to get questioned in times of defeat. The only thing the players can do is prove it on the pitch where people can see it.”\nAncelotti and Madrid are coming off a 3-2 home loss to Villarreal that all-but-ended the team's hopes of winning the Spanish league, leaving it 13 points behind leader Barcelona with 10 matches remaining. Its focus now is on the Champions League and the Copa del Rey final against Osasuna in May.\nAncelotti has said he wants to remain with Madrid until the end of his contract next year, but acknowledged that he was flattered to know about Brazil’s interest in him. Brazil’s national team has an interim coach since after the World Cup and wants a replacement to be announced soon.\nAncelotti said having two decades of coaching experience more than Lampard won't make much of a difference.\n“He is a fantastic and extraordinary professional,” Ancelotti said. “I don't think that in this case the experience will mean much. He arrived only a week ago and I'm certain that he will do well for as long as he stays with Chelsea.”\nThe last two Champions League winners, Madrid and Chelsea have gotten used to facing each other in the knockout stages of the competition recently.\nMadrid got the best of Chelsea in the quarterfinals last season on its way to a record-extending 14th European title. Chelsea overcame Madrid in the semifinals in the previous year to eventually secure its second Champions League trophy.\nChelsea eliminated Madrid 3-1 on aggregate amid the coronavirus pandemic in 2020-21, while Madrid last year advanced with a 5-4 total score following extra time in a thrilling second leg at the Bernabeu.\n“We suffered a lot last year,” Ancelotti said. ”Chelsea is a top team and in matches like these there is always extra motivation.\"\nMadrid is looking to make it to the semifinals for the 11th time in 13 seasons, while Chelsea has appeared in the last four only once since 2013-14.\n“We are not afraid of Real Madrid,” Chelsea midfielder Enzo Fernández said. \"We have big respect because this is a big football match and we know the quality they have. We will try to keep them at bay with our defenders and I expect a wonderful match.\"\nMadrid has won six of its eight Champions League games this season, with a loss at Leipzig and a draw at Shakhtar Donetsk in the group stage. Chelsea has five victories, one draw and two defeats — to Dinamo Zagreb in the group stage and to Borussia Dortmund in the first leg of the round of 16. The draw came against Salzburg in the group stage.\nAncelotti will have nearly all of his players available for the first leg, with the exception of left back Ferland Mendy.\nMason Mount and N’Golo Kante didn’t play in Chelsea’s last game in the Premier League but returned to training and should be available for the trip to the Spanish capital.\nThe winner of the series will face Manchester City or Bayern Munich in the semifinals.\n___\nTales Azzoni on Twitter: http://twitter.com/tazzoni\n___\nMore AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports",
  "word_count": 732,
  "scraped_at": "2026-02-14T02:09:52.177652",
  "_text_extracted": true
}