{
  "article_id": "709dad419f20",
  "url": "https://www.caughtoffside.com/2023/05/09/transfers-rice-arsenal-pochettino-bellingham-messi/",
  "title": "Transfers : Rice Arsenal , Pochettino , Bellingham , Messi",
  "date": "20230509T223000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Hello and welcome to my weekly CaughtOffside column – click here to subscribe for more exclusive transfer news and a Daily Briefing straight to your inbox!\nDeclan Rice remains top target for Arsenal ahead of ‘aggressive’ summer\nArsenal will be quite busy this summer. In some ways if they fail to win the Premier League it might make them even more aggressive in the market. Mikel Arteta will have a real sense of what he needs to challenge again next season and consolidate Arsenal’s top-four position.\nArsenal are looking for a midfielder and Declan Rice remains one of their top priorities. Rice has spoken glowingly about both Arteta and Arsenal. I am still told he prefers to stay in London, too, which both Arsenal and Chelsea can use to their advantage.\nWest Ham are resigned to losing Rice. But now they are practically safe after beating Manchester United, the Hammers can be a bit more bullish. Relegation would have made it tricky to hold out for a £100m+ price.\nSuitors still feel there’s games taking place. David Moyes has said Rice is worth a British transfer record fee, surpassing the £106m Chelsea paid to Benfica for Enzo Fernandez. But Fernandez had a sky-high release clause. The main thing that helps West Ham is Rice is contracted until summer 2025 and there is a one-year option to extend.\nThere still remains a chance Rice is sold for less than the £100-120m ballpark West Ham are pushing for. It will also depend on the volume of suitors. With Mykhaylo Mudryk, Shakhtar were able to play off Arsenal and Chelsea against each other to get a higher price. West Ham will be hoping for the same. The club won’t stand in Rice’s way, and know he can essentially triple his wages elsewhere. But now their Premier League status is all but mathematically secured, West Ham are in a stronger bargaining position.\nArsenal also haven’t ruled out coming back in for Moises Caicedo and are aware of the Mason Mount situation. Real Sociedad’s Martin Zubimendi is another name linked. Arsenal have sent scouts to watch him, and the interest is genuine, but to my knowledge a deal isn’t quite as advanced as perhaps has been suggested in Spain at this point.\nArsenal may also choose to bolster their defence and Crystal Palace’s Marc Guehi is one target. William Saliba’s injury has shown Arsenal need more centre-back depth. I do think Jakub Kiwior will be an important squad player next season, though.\nWhat Mauricio Pochettino has told Chelsea about his transfer priorities\nThere are no real delays in Chelsea’s pursuit of Mauricio Pochettino. The hiring process has been thorough and very much two-way. Pochettino has had a lot of questions for Chelsea and that’s viewed as positive. Chelsea have to get their next managerial appointment right and Pochettino must understand the vision and how much control he will have.\nThe other factor is Pochettino is agentless so is leading negotiations for both himself and his backroom staff. When Pochettino was approached in September following the sacking of Thomas Tuchel Chelsea’s owners were brand new. He didn’t want to jump back into management quite soon after leaving PSG and with the summer window shut. And Chelsea were still building their recruitment team.\nNow the timing is right, but Pochettino has still been keen to understand existing summer plans, especially around outgoings. He has also reiterated he wants to keep Mason Mount at the club. That’s not a given, but Chelsea aren’t resigned to losing him just yet. Further talks will take place and with Mount sidelined with a pelvic injury he has time to assess his future.\nPochettino will also look at a new goalkeeper, central midfielder and striker. His relationship with co-sporting directors Paul Winstanley and Laurence Stewart is going to be key. Monaco’s Paul Mitchell hasn’t been approached recently, even though Chelsea have considered him in the past. Pochettino loved working with Mitchell at Spurs. But Chelsea are happy with their current recruitment team. Keep an eye on Manchester United for Mitchell, especially if Sir Jim Ratcliffe is named the preferred bidder.\nOn the striker front, there will inevitably be links with Chelsea and Harry Kane. Chelsea haven’t made any approach to date. It’s Manchester United exploring that deal for now. But what Pochettino does want is proven Premier League quality. It’s another thing he has stressed. Kane obviously falls into that category.\nThere’s still the question of just how attainable Kane really is. Daniel Levy remains reluctant to sell. So getting Kane for under £100m will be near-impossible. Chelsea haven’t even tried, but if Pochettino arrives let’s see if there’s any change to that and whether Levy would ever consider selling to a London rival like Chelsea in that hypothetical scenario.\nThe goalkeeper situation is intriguing. Pochettino will want to assess Kepa Arrizabalaga and Edouard Mendy. There is nonetheless a feeling a new No.1 will be signed. Inter’s Andre Onana is one possibility. Chelsea and Spurs have looked at Jordan Pickford, too. If Everton stay up that deal becomes a whole lot harder since he recently extended at Goodison Park.\nPochettino doesn’t really need to look outside of the Premier League for a midfielder. His compatriot Alexis Mac Allister is pushing for a move with Liverpool frontrunners. Nothing has been agreed yet, though.\nChelsea have looked at Mac Allister in the past. His Brighton teammate Moises Caicedo, who Chelsea bid for in January, is still on the radar and Declan Rice and Romeo Lavia are two other options. A Rice move, as referenced above, has its complications, and Chelsea don’t have Champions League football. Lavia is an easier deal to pull off now that Southampton are practically relegated. Clubs will want to force the issue, too, since Manchester City have a buyback clause in 2024.\nBut before setting transfers or outgoings in motion, Chelsea need to lock in Pochettino, then they can really begin their summer planning. The feeling within the club is this week a deal may be officially struck if all goes to plan.\nLionel Messi saga could drag on, despite reports\nWe are seeing a few reports suggesting Lionel Messi has agreed to join Saudi side Al-Hilal, but nothing is done yet. Messi hasn’t decided. His preference has always been to stay in Europe and Barcelona are working out whether they can table an acceptable offer that works for both Messi and will satisfy La Liga. This means things may drag on.\nMessi’s contract at PSG will simply expire, and neither party is currently taking active steps to change that. Messi was forced to apologise for taking an authorised trip to Saudi Arabia instead of turning up to PSG training. He argued he thought he had two days off, and by the time he was told to report to training it was too late to change his plans. PSG maintain the players knew they would only get time off if they beat Lorient and they lost that game 3-1.\nPSG president Nasser Al-Khelaifi wanted to show the club doesn’t tolerate a lack of discipline and so he originally suspended Messi for two weeks. But following the apology video, the ban has been halved and Messi is now back in training.\nMessi is contracted to the Saudi Tourism Authority, and although we constantly hear about an Al-Hilal move, the offer (and funding for it) is being driven by wider government stakeholders. This was the same when Cristiano Ronaldo joined Al-Nassr. The clubs themselves don’t have this kind of money at their disposal without getting major help.\nTalks with Messi’s representatives, led by his father Jorge, have taken place over a deal worth around £320m a year ($400m). This means Messi could earn pretty much double Ronaldo’s salary.\nEx-Manchester City chief executive Garry Cook, who is executive president of the Saudi Pro League, is also involved in any potential deal. In theory Messi could be contracted to any club in the league, which is a unique scenario. Imagine if the Premier League helped facilitate a transfer then decided if the player would go to Liverpool or Manchester United?! It would be unthinkable!\nBut Ronaldo, for example, was originally earmarked for Al-Hilal before a transfer ban stopped it progressing. The feeling is that everyone involved in a potential deal wants a Messi-Ronaldo rivalry in Riyadh, hence why Al-Hilal has always been the intended club. Nothing is done or signed just yet, but those close to the deal are certainly more confident now than a few months ago. And one reason why is because a PSG stay is off the table.\nThose working on a Saudi deal are hoping to lock something in before Barcelona have a chance to table anything. I think it unlikely, though, Messi will rush into a decision before he knows what is possible at the Camp Nou.\nThe Saudi strategy is to try and build their league quite aggressively now and thus go head-to-head with MLS for certain star players. MLS is expected to benefit significantly from the 2026 World Cup. David Beckham’s Inter Miami are also one possible destination for Messi as well. Saudi are expected to bid for the 20230 World Cup, but they don’t want to wait until then to start bringing big names over.\nThe truth about Man City’s Jude Bellingham interest and possible outgoings\nReal Madrid are certainly favourites now to sign Jude Bellingham. They have player buy in. However, they must still negotiate with Dortmund.\nFor over a year Real have been hoping since summer that Bellingham doesn’t sign a new deal and a transfer fee of under £100m is possible. This has always felt pretty ambitious, especially with two Premier League suitors in Liverpool and Manchester City circling for much of this time. Everyone knows Dortmund want more.\nBut Liverpool have since pulled out and it’s not thought finishing in the top four will change that. If Liverpool can somehow qualify for the Champions League, though, they will have a bigger summer budget to work with.\nManchester City have always had a concrete interest in Bellingham, and Jack Grealish and Erling Haaland have told him to join. Haaland used a points-scoring system before he moved to Manchester City. This allowed him to look at the move a bit more dispassionately along with factoring in his gut instinct. Bellingham will use a similar tactic, and City have always felt like they would score highly via this method.\nBut the club haven’t yet made any formal offer, and Real will be hoping they don’t because that’s when the transfer fee could become even further inflated.\nAs I have said many times, Liverpool (prior to focusing on other targets) and Real Madrid are the two teams who did significant legwork. For many months City have been there, monitoring the situation, but without significantly showing their hand. And that’s really still the case.\nBellingham has 13 goals in 41 appearances (including two in Sunday’s 6-0 thrashing of Wolfsburg) and is hoping to lead Dortmund to their first Bundesliga title since 2011/12.\nReal’s aim is to agree a deal as quickly as possible and avoid any kind of summer saga or twist. They stand a real chance of doing this, too, even if Dortmund will obviously be hoping for a bidding war.\nIn terms of outgoings at Manchester City, Ilkay Gundogan’s future remains undecided. He showed his importance with both goals in the 2-1 win over Leeds.\nPep Guardiola wants to keep Gundogan but with his contract up in June, Barcelona still remains an option. Barca have so many moving pieces. Every incoming, even a free transfer, is contingent on so many other players. Barcelona have to reduce their wage bill, especially if they are to make an offer to Lionel Messi that La Liga will accept. Every single thing Barcelona do, in terms of recruitment this summer, will impact either another squad player or target.\nThere have also been suggestions Kalvin Phillips may be sold. It’s premature to talk about an exit for now. Phillips has been told to fight for his place. After all, he’s only been there for a year. Suggestions Liverpool are interested are incorrect to my understanding.\nPhillips has only played eight Premier League games this season and has struggled to displace Rodri. A lot will now depend on Phillips himself. Manchester City are relaxed about the situation and not necessarily planning for his departure as of now. But keep an eye on West Ham. If they sell Rice, they will be looking for a midfielder and have funds to move.",
  "word_count": 2099,
  "scraped_at": "2026-02-14T02:00:20.000864",
  "_text_extracted": true
}