{
  "article_id": "70d124a103fe",
  "url": "https://www.meathchronicle.ie/2023/06/16/im-not-one-for-kissing-badges-or-sucking-up-to-people/",
  "title": "  Im not one for kissing badges or sucking up to people  ",
  "date": "20230616T083000Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'I'm not one for kissing badges or sucking up to people'\nSOCCER Clancy on the uncertainty of management\nNine days before Timmy Clancy was sacked as manager of St Patrick's Athletic the team was sitting second in the League of Ireland Premier Div. After reaching those lofty heights they endured three successive defeats and the Trim man parted company with the Richmond Park club.\nIt was as simple, or as complicated, as that. Not that his parting from the club \"by mutual consent\" in late April as a club statement pointed out, was a total surprise to the Trim man. At this stage nothing surprises him about the game.\nSince he waved goodbye to the Saints he has been out of soccer, on an enforced sabbatical he intends to use wisely. \"I have been linked with a few jobs but I haven't applied for any. I'll watch games, look at training sessions, keep learning and hopefully the right opportunity arises and I'll get back in.\"\nClancy has just turned 39. He has spent most of those years working at professional or semi-professional levels in football. He played with a wide range of clubs including Waymouth, Kilmarnock, Motherwell, Hibernian, St Johnstone, Shamrock Rovers, Sligo Rovers and Bray Wanderers. He turned to management and guided Drogheda Utd to the First Div title before taking over at Richmond Park.\n\"I have been involved in football for 21 years and if you are looking for long term job security and stability don't go into football management because things can change very quickly. That's all I have known since 2002 is football,\" he said from his home in Trim last week.\nIt would be only natural if he wondered how he could have done things differently at St Pat's. \"I'm not one that goes around kissing badges, sucking up to people and maybe that's something you should do and build a better relationship with boards and fans but for four years with Drogheda I had an unbelievable relationship with the board that was there,\" he said from his home .\n\"This is the longest period I've spent out of the game apart from a spell when my contract with St Johnstone ended, that's the nature of it, it's a results-based business and if you don't get results you are going to be in trouble.\"\nClancy, who is a family man, is not in in least disillusioned with his experience with the Saints and he fully intends to get back on the managerial merry-go-round, pointing to the many achievements he did chalk up at Richmond Park during his brief spell at the helm. At the end of his first campaign St Pat's finished fourth and also achieved some notable results in Europe, including a sit-up-and-take notice 1-0 away win over CSKA Sofia.\n\"It hasn't put me off at all, we got to the third qualifying round of the Conference League last June, we beat Mura FC over two legs and the year before they were in the group stages where they beat Tottenham Hotspurs 2-1. We defeated CSKA 1-0 also and they challenged PFC Ludogarets for the Bulgarian title and they have been in the Champions League the last few years. There are good memories as well as the bad ones, big achievements.\n\"This season we went away and beat Bohemians 3-2, the first time St Pat's have gone to the league leaders and won in 17 years or so. After things die down maybe people will realise that we did a good job there,\" he added.\n\"I don't think much went wrong at St Pat's when you can consider how nine days before I was sacked we were second in the league, we weren't a million miles off it.\"\nHe ruefully added that just about every manager gets the sack at one time or another. Even Alex Ferguson got the boot from St Mirren. It's football.\n\"There were discussions (with the Board) and we agreed it would be better if I just left. Those discussion arose out of the nature of results but on the grand scheme of things I think in the 18 months we were at St Pat's we were very successful. There was a bit of noise from outsiders, spectators, and clubs make decisions on that basis.\"\nHe says that one of the best aspects of management is making young players better. He did that at Drogheda especially where he had time to form a relationship with people. \"Young players such as William Hondermarck went from Drogheda to Norwich City, Cillian Phillips to Crystal Palace, Drogheda hadn't sold a player to an English club for 30 years until I was there.\n\"Luke McNally as well went to Burnely and was in a play off with Coventry last week, there are loads of positives of young players joining us and getting better, improving. As a coach that's what I like to do.\"\nThe question now is where next will he get a chance to do his stuff; to bring on a new generation of players to another level. Wherever it is Clancy, no doubt, will be back. Football is in his blood.",
  "word_count": 859,
  "scraped_at": "2026-02-14T02:09:58.121626",
  "_text_extracted": true
}