{
  "article_id": "70f5b6d06b48",
  "url": "https://theathletic.com/4863029/2023/09/18/last-champions-league-group-swiss-model/",
  "title": "Dont mourn the Champions League group stage , even if the Swiss model isnt any better",
  "date": "20230918T161500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Having been a feature of every European campaign since 1992-93, this year’s Champions League group stage will be the last.\nFrom 2024, Europe’s premier continental competition will instead be played as a ‘Swiss system’, an unusual approach where all 36 competing sides will be in one division and sorted according to their results in matches against eight separate opponents (four at home, four away). It’s a bold, complex and almost certainly confusing approach, which might make us yearn for the very simple concept we’ve become accustomed to: eight four-team groups, six matches, no real explanation needed.\nAdvertisement\nBut that would be partially forgetting the sense that the group stage has become a little tired, predictable and increasingly lacking in excitement. Granted, there are routinely one or two upsets a year and a couple of groups that go down to the wire. By and large, though, the Champions League group stage is less thrilling than in its heyday.\nThat can be illustrated neatly by the following graph, which tracks the average points total per season recorded by the sides finishing in 1st, 2nd, 3rd and 4th place in the group stage. (Between 1999-00 and 2002-03 there was a second group stage — this article focuses solely on the first group stage.).\nThere are, from a relatively simple graph, some very interesting stories.\nThe first consideration is that the points tally for the 1st-placed sides has risen steadily, demonstrating the dominance of the continent’s superclubs. Two decades ago, group winners were generally averaging around 11-12 points. Now it’s 13-15. That might seem a relatively minor difference, but with a decent sample size of eight groups a year and with only 18 points on offer, it is significant.\nThat’s only part of the story, however. While the rate has increased to around the 14-point mark in recent years, it was higher than 14 in four of the five first Champions League seasons (when converting the old two-points-for-a-win system used in the first few seasons into three-points-for-a-win). It then dropped significantly in 1997, the point where UEFA decided to expand the competition and introduce sides other than the domestic champions and reigning holders.\nTherefore, this initially made the competition more competitive — the second-placed sides from England, Italy, Germany and Spain were stronger than the champions of smaller European countries. Within half a decade, Europe’s stronger nations were able to enter its best four sides.\nAdvertisement\nYou can observe that effect in the points total recorded by the bottom-placed sides, too. In the formative years of the Champions League, those sides were averaging less than four points — and then, for much of the next decade, the figure was a little higher. Since then, as inequality has increased, the bottom-placed sides are increasingly struggling.\nSides recording zero points in the group stage was almost unheard of in the 20th century — albeit there were fewer groups in those days — but has become more common recently.\nIt’s significant that the biggest grouping of pointless sides occurred just after a change to the qualification system in 2009, which admitted more sides from weaker leagues. This was an admirable move, an attempt to prevent the tournament from being dominated by western European sides. But it had a negative impact in terms of competitiveness and entertainment value.\nIn 2009, Maccabi Haifa became the first club to lose all their matches without scoring. In the same year, Hungarian champions Debrecen at least managed to score five times but also failed to record a point. Partizan Belgrade and MSK Zilina endured the same experience in 2010, while three sides — Dinamo Zagreb, Otelul Galati and Villarreal — did so in 2011. Since then, there’s been a shift towards a greater concentration of sides from stronger leagues.\nReturning to the first graph, the most important figures are the points totals recorded by the second- and third-best sides — that’s the difference between progressing and not progressing to the next stage and ultimately whether there’s significant interest going into the final round of matches.\nAnd, last season, the gap was absolutely huge — second-placed sides averaged 11.4 points, while third-placed sides averaged 5.6. The majority of groups were over startlingly early. Only Group D, featuring Tottenham, Eintracht Frankfurt, Sporting Lisbon and Marseille, had everything to play for going into the final group fixture. Group E was decided on the final day when Milan’s win over Red Bull Salzburg confirmed their second-place finish ahead of the Austrians. Otherwise, it was alarmingly routine and featured points totals including 15-15-6-0, 13-12-6-2 and 14-14-3-3. This is staggeringly uncompetitive for a six-game league.\nAdvertisement\nLast season also featured Bayern recording a maximum of 18 points for the third time in the past four seasons (2019-20, 2021-22 and 2022-23). This is quite striking because it has only been achieved on another eight occasions — Milan in 1992-93, PSG in 1994-95, Spartak Moscow in 1995-96, Barcelona in 2002-03, Real Madrid in 2011-12 and again in 2014-15, and both Ajax and Liverpool in 2021-22. In other words, it was hardest to achieve in the 15 years after non-champions were admitted from 1997 onwards — after the tournament contained lots of minnows but before the superclubs became absurdly dominant.\nPerhaps the interesting thing is that the identity of the 16 qualifiers from the group stage has not necessarily become more predictable. In 2006, when the 16 sides from Pot 1 and Pot 2 qualified for the knockout stage, there was a danger this would become routine. That hasn’t really happened. Only once since then, in 2016, has only one side from the bottom two pots qualified. There’s still a healthy number of Pot 3 sides who qualify, although it’s now much rarer for a Pot 4 side to progress. Back in 2001 and 2003, they comprised their fair share — a quarter — of the 16 qualifying sides, which feels unthinkable today.\n(Top photo: Nicolas Tucat/AFP via Getty Images)",
  "word_count": 989,
  "scraped_at": "2026-02-14T02:16:55.104147",
  "_text_extracted": true
}