{
  "article_id": "710bd3e6ab37",
  "url": "https://www.teamtalk.com/manchester-city/man-city-going-all-out-record-breaking-attacker-signing-give-chelsea-nightmares",
  "title": "Man City going all out for record - breaking attacker signing that will haunt Chelsea",
  "date": "20240419T111500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City going all out for record-breaking attacker signing that will haunt Chelsea\nManchester City have made Bayern Munich ace Jamal Musiala their No 1 transfer target for the summer, and why the move would be calamitous for Chelsea along with Bayern’s stance on a blockbuster sale have all emerged.\nMusiala, 21, has rapidly developed into one of world football’s brightest young attackers. Musiala has already racked up 27 caps for Germany despite his tender age and is a guaranteed starter for Bayern Munich.\nMusiala can operate in a variety of positions in the attacking third. He’s deputised on the left wing of late, though it’s as an attack-minded central midfielder where he’s arguably at his most potent.\nAccording to the Guardian, dethroned Champions League winners Man City have determined they lack fluency and adequate options in attack.\nIt’s claimed there’s a sense Phil Foden’s stellar season has masked the fact City haven’t truly replaced the impetus provided by Ilkay Gundogan and Riyad Mahrez.\nJeremy Doku lacks end product, while Matheus Nunes has been a relative non-factor since his £53m arrival from Wolves. Furthermore, Kevin De Bruyne has begun to struggle with injury.\nAs such, the Guardian state Man City are ‘planning a big push’ to land Bayern ace Musiala whose potential move could require a club-record bid.\nMan City’s most expensive ever buy remains the £100m paid to sign Jack Grealish from Aston Villa.\nVarious reports have indicated Musiala would cost upwards of that figure to prise out of Munich and potentially as much as £120m. Nonetheless, Man City are convinced by Musiala and will make a huge effort to unlock his signing.\nDON’T MISS: Prem-bound Ipswich plot record-breaking Man City raid which would break rival hearts\nBayern could struggle to keep Musiala\nUnderstandably, Bayern are reluctant in the extreme to lose a player who could be the cornerstone of their team for the next decade.\nTaking to X, transfer guru Fabrizio Romano reported: “Bayern remain clear on their plan for Jamal Musiala: no intention to sell their gem this summer.\n“New contract proposal to be submitted soon as it will include important salary increase plus add-ons.\n“Top clubs in England and Spain keep following Jamal; but no talks now.”\nMusiala’s existing contract expires in the summer of 2026. Per the Guardian, Bayern could face an uphill struggle in convincing Musiala to pen fresh terms.\nBayern surrendered their 11-year stranglehold on the Bundesliga to Bayer Leverkusen last weekend. They have advanced to the semi-finals of the Champions League, though haven’t reached the final since 2020.\nAs such, the report concluded Bayern may meet resistance when attempting to convince Musiala over their level of ambition.\nREAD MORE: Five Man City players to sell this summer, including signing Guardiola completely misjudged\nMusiala return will haunt Chelsea\nIn the event Man City were successful in luring Musiala to the Etihad, the German would be yet another in a long line of superstars Chelsea let slip through their fingers.\nMusiala was on Chelsea’s books between 2011-19 before leaving for Bayern amid a lack of opportunities at Stamford Bridge.\nChelsea have been stung by who they’ve let go over the years, most notably with Kevin De Bruyne and Mohamed Salah who went on to become Premier League winners and legends at Man City and Liverpool respectively.\nNew Arsenal talisman Declan Rice was also with Chelsea between 2006-13.\nHAVE YOU SEEN: The ridiculous XI of players Chelsea sold before they hit their prime: Salah, De Bruyne, Ampadu…\nThe last thing Chelsea would wish to see is another former Blue winning titles at a Premier League rival.",
  "word_count": 607,
  "scraped_at": "2026-02-14T01:56:51.551226",
  "_text_extracted": true
}