{
  "article_id": "7156ef3fd01e",
  "url": "https://tribune.com.pk/story/2489670/juve-give-motta-perfect-start",
  "title": "Juve give Motta perfect start",
  "date": "20240820T234500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Juve give Motta perfect start\nThe Old Lady thrashes Como 3-0 at the Allianz Stadium\nJuventus made light work of Como on Monday with a 3-0 win on Thiago Motta's Serie A debut with the Turin giants, while Atalanta brushed aside transfer upheaval with a 4-0 thumping of Lecce.\nImpressive first-half strikes from promising youngster Samuel Mbangula, a surprise starter on the left flank, and Timothy Weah before a thumping Andrea Cambiaso finish in stoppage time gave Juve and Motta a perfect start against promoted Como, who were playing their first top-flight match in over two decades.\n\"Como are a good team and we had the right attitude tonight, when we had the ball we did really well all throughout the match,\" said Motta to DAZN.\nJuve could have easily won by a larger margin at the Allianz Stadium as the hosts created a series of chances against Como who were outclassed on the night.\nDusan Vlahovic had a particularly unlucky evening up front for Juve as he struck the woodwork in each half and had what looked like a perfectly good headed goal ruled out just after half-time.\nThe Serbia striker was baffled as to why his strike was chalked off but Cambiaso had strayed offside earlier in the move, denying him a goal.\nMotta, who arrived in the close season after guiding Bologna to the Champions League, already has Juve playing a brand of football which is easier on the eye than was played under his predecessor Massimiliano Allegri. That is despite Juve being a work in progress as a clutch of Allegri's favourites, including Italy forward Federico Chiesa, have been sidelined in order to make space for players deemed more suited to Motta's style of play.\nCesc Fabregas's Como, an ambitious club backed by tobacco giant Djarum active in the summer transfer window, will get a better indication of their chances of staying in the division in their next two fixtures at Cagliari and Udinese.\n\"Today was a reality check. We need to be better,\" said Fabregas to DAZN.\n\"What I sure was a difference in quality... They were devastating when they took the ball off us and we gave away too many easy balls. That's not tactics, that's down to individual quality.\"\nNew boys Marco Brescianini and Mateo Retegui gave Europa League holders Atalanta a hugely impressive start at Lecce after turbulent summer which has featured long-term injuries and star players agitating for transfers.\nBrescianini, who only arrived from relegated Frosinone on Friday, opened the scoring on the rebound 10 minutes before half-time and confidently rolled home the fourth in the 66th minute. The 24-year old's strikes topped and tailed a near-perfect away performance as Italy striker Retegui netted with a bullet header on the stroke of half-time before winning and then scoring a penalty just before the hour mark.\n\"It's better than even I could have imagined,\" said Brescianini, who is from just outside Bergamo, where Atalanta are based.\n\"I'm really happy to be wearing this jersey and I hope to repay the faith the club and fans have shown in me.\"\nAtalanta have since been hit with serious injuries to both Gianluca Scamacca and star defender Giorgio Scalvini, with a clutch of other players also sidelined.\nMeanwhile coach Gian Piero Gasperini was without Teun Koopmeiners and Europa League final hat-trick hero Ademola Lookman, both dropped as they try to leave before the end of the summer transfer window.\n\"No-one expected to be in this situation,\" Gasperini told Sky Sport.\n\"I have to play it by ear right now... I don't know what's going to happen in the coming 10 days but our job is to build as much as we can.\" However before kick-off Atalanta CEO Luca Percassi left the door open for reconciliation with the want-away pair, with Paris Saint-Germain reportedly interested in signing Nigeria forward Lookman.\n\"Our idea is that for the first time in our history to not let our big players go,\" Percassi told Sky Sport. \"We can't wait for this transfer window to close.\"\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 699,
  "scraped_at": "2026-02-14T01:57:35.679104",
  "_text_extracted": true
}