{
  "article_id": "718357dbe753",
  "url": "https://www.fourfourtwo.com/news/the-10-quickest-players-in-the-premier-league",
  "title": "The 10 quickest players in the Premier League",
  "date": "20240806T054500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nSpeed isn't everything in football, but it can make a big difference.\nWhile some of the greatest players in the Premier League, such as Rodri, Martin Ødegaard and Cole Palmer, aren't renowned for their pace, there's a considerable advantage to being quick off the mark.\nUsing statistics compiled by the Premier League last season, FourFourTwo takes a look at the fastest players in the division ahead of the 2024/25 campaign.\nVIDEO How Gareth Southgate Evolved England (And Why He HAD To Go)\n10. Gabriel Martinelli, Arsenal (36.33km/h)\nThe Brazilian winger struggled to find his best form last season amid competition from Leandro Trossard, who scored twice as many league goals. But Martinelli's pace still caused plenty of problems for defenders as Arsenal again challenged for the title, falling just short of a relentless Manchester City.\n9. Luis Diaz, Liverpool (36.42km/h)\nDiaz had a lot to contend with last season, which understandably affected his focus. His father was traumatically kidnapped in October, but returned safely to celebrate his son's continued success at club and international level. The 27-year-old starred in Colombia's run to the Copa America final, where they lost to Argentina.\n8. Illia Zabarnyi, Bournemouth (36.60km/h)\nThe powerful young centre-back impressed during his first full season in the Premier League, missing just one game under Andoni Iraola. Few strikers were able to get the better of him in the air or on the ground given his height and pace. He recently signed a new five-year contract amid interest from Arsenal.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n7. Amadou Onana, Aston Villa (36.65km/h)\nAfter two years at Goodison Park, Onana agreed a £50million move to Aston Villa. The rangy midfielder, who played every minute for Belgium at the Euros, is a welcome addition to Unai Emery's squad as they prepare for the club's first ever Champions League campaign.\n6. Anthony Gordon, Newcastle United (36.68km/h)\nGordon is keen to build on a breakthrough season that saw him score 11 goals in the Premier League. His electric pace and direct dribbling made the 23-year-old winger a real threat, leading to an England debut and interest from Liverpool. He was given little opportunity to make an impact at the Euros.\n5. Dominik Szoboszlai, Liverpool (36.76km/h)\nThe energetic Hungarian midfielder will be hoping to build on a solid first season at Anfield, with new manager Arne Slot aiming to take the club in a different direction. As Liverpool's style of play evolves, more emphasis will be placed on Szoboszlai's technical ability rather than his sheer running power.\n4. Jakub Moder, Brighton and Hove Albion (36.84km/h)\nModer has been at Brighton for almost four years without fully establishing himself as a first-team regular. A devastating ACL injury saw him miss the whole of the 2022-23 season, but it doesn't seem to have robbed him of any pace. Linked with a move to Leicester City, the Polish international's future remains uncertain.\n3. Pedro Neto, Wolverhampton Wanderers (36.86km/h)\nNeto was almost unstoppable at times last season. The Portuguese winger is quick and tricky, turning defenders inside and out before accelerating away from them at speed. Unfortunately, his explosive pace contributed to a couple of hamstring injuries that curbed Wolves' ambitions.\n2. Anthony Elanga, Nottingham Forest (36.91km/h)\nThe former Manchester United prospect has really hit his stride since moving to the City Ground. He registered five goals and nine assists in his first season as a Forest player, helping the club scramble to safety after a poor start. The Swedish international, who struck up a great understanding with Callum Hudson-Odoi and Morgan Gibbs-White, has already been linked with Newcastle United.\n1. Micky van de Ven, Tottenham Hotspur (37.38km/h)\nVan de Ven made a seamless adjustment to life in England, staking his claim to be one of the best defenders in the Premier League. He was certainly the quickest, breaking Kyle Walker's record from the previous season. The £43million signing from Wolfsburg helped Tottenham to a fifth-place finish under Ange Postecoglou.\nMore Premier League stories\nLiverpool hero moving to champions - to HELP Manchester United: report\nChelsea to repeat Cole Palmer trick as interest in promising star is revealed: report\nNewcastle make £34 million offer for Brazilian wonderkid: report\nFormer Manchester United star 'confident' of sensational Old Trafford return: report\nSean Cole is a freelance journalist. He has written for FourFourTwo, BBC Sport and When Saturday Comes among others. A Birmingham City supporter and staunch Nikola Zigic advocate, he once scored a hat-trick at St. Andrew’s (in a half-time game). He also has far too many football shirts and spends far too much time reading the Wikipedia pages of obscure players.",
  "word_count": 889,
  "scraped_at": "2026-02-14T02:01:23.786620",
  "_text_extracted": true
}