{
  "article_id": "7197fd89137e",
  "url": "https://www.teamtalk.com/news/martin-zubimendi-real-madrid-arsenal-summer-transfer-battle-real-sociedad",
  "title": "Real Madrid transfers : Los Blancos have  extraordinary  ace card to beat Arsenal to the world  second - best player  ",
  "date": "20250228T120000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid have ‘extraordinary’ ace card to beat Arsenal to the world’s ‘second-best player’\nReal Madrid are not giving up on signing Martin Zubimendi, with a Spanish report revealing how Los Blancos plan to beat Arsenal to the signature of the Real Sociedad midfielder as Carlo Ancelotti’s side get a major boost in their quest to sign Joshua Kimmich.\nZubimendi has established himself as one of the best midfielders in the world and has been superb for Sociedad over the years. The 26-year-old is also a regular for Spain and helped his country win Euro 2024. Zubimendi has been so good and important for La Roja that head coach Luis de la Fuente described him as “the second-best player in the world” in October 2024.\nThe Spaniard was close to moving to Liverpool last summer, but he had a late change of heart and decided to stay at Sociedad for the 2024-25 campaign.\nHowever, it is very likely that Zubimendi will leave Sociedad at the end of the season, with TEAMtalk’s transfer correspondent Fraser Fletcher reporting on February 6 that Arsenal are keen on a 2025 summer deal for Zubimendi.\nTEAMtalk’s transfer expert Ben Jacobs reported on February 19 that Arsenal are “cautiously optimistic” of signing Zubimendi, adding that “a broad set of personal terms have been verbally agreed upon in terms of wage and bonus structure”.\nAccording to Estadio Deportivo, while Madrid are aware that Arsenal are in pole position for Zubimendi, the defending Spanish and European champions are not giving up on bringing the Sociedad star to the Santiago Bernabeu in the summer transfer window.\nMadrid believe that the 26-year-old is the perfect replacement for Toni Kroos, with the club’s coaching staff really impressed with him.\nThe report has noted that Madrid can “play the cards of the extraordinary relationship they have with the board of Real Sociedad” for Zubimendi.\nOver the years, the two LaLiga clubs have had players move from one team to the other, and that has made them strong allies.\nZubimendi has a release clause of €60million (£51m, $62m) in his contract at Sociedad, so one suspects that Madrid could try to negotiate a lower fee with La Real.\nWhether Sociedad accept such a deal remains to be seen, especially if Arsenal are ready to pay the release clause in full.\nREAD MORE ➡️ The SIX Real Madrid players out of contract in 2026 along with Ancelotti: Keep or sell?\nJoshua Kimmich boost for Real Madrid\nMadrid are also interested in Kimmich, who is one of the best defensive midfielders in the world and is adept at playing at right-back too.\nThe Germany international is out of contract at Bayern Munich at the end of the season, and the Bundesliga club have been in talks with him over a new deal.\nHowever, according to BILD, Bayern have become frustrated with Kimmich stalling on signing a new contract and have now decided to pull their latest proposal.\nAs things stand, Kimmich will become a free agent this summer, and it would be hugely appealing to Madrid, who have signed the likes of Antonio Rudiger, David Alaba and Kylian Mbappe on free transfers in recent windows.\nLatest Real Madrid news: Liverpool eye Brahim Diaz, Murillo stance\nWith Mohamed Salah out of contract at the end of the season, Liverpool are looking for a potential replacement.\nA Spanish report has revealed that Liverpool are in contact over a possible deal for Madrid winger Brahim Diaz.\nDiaz is not a regular in the Madrid starting line-up, but the Morocco international has done well for Los Blancos when he has played and has contributed with important goals.\nLiverpool are reportedly “willing to make a significant investment” to get a deal done for Diaz.\nMadrid are on the hunt for new centre-backs in the summer transfer window, and the Premier League is their shopping centre.\nNottingham Forest star Murillo is on Madrid’s radar, with the Brazilian youngster’s performance having impressed Los Blancos.\nHowever, it has been revealed in the English media that Murillo is happy at the City Ground and is excited at the direction that Forest are going.\nNuno’s side could end up in the Premier League top four this season and qualify for the Champions League.\nMeanwhile, TEAMtalk’s Italian football correspondent Rudy Galetti has reported that Manchester City are competing with Madrid for Theo Hernandez.\nAC Milan are willing to sell Hernandez for €35m (£29m, $36.7m), and defending Premier League champions Man City are ready to pay it.",
  "word_count": 750,
  "scraped_at": "2026-02-14T01:58:05.315321",
  "_text_extracted": true
}