{
  "article_id": "71b9ceaf0d44",
  "url": "https://www.empireofthekop.com/2024/05/27/pete-orourke-liverpool-sell-salah-now/",
  "title": "Transfer insider adamant that  now is the time  for Liverpool to sell Salah",
  "date": "20240527T141500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have faced some pivotal decisions in recent times, not least the appointment of a successor to Jurgen Klopp, and Mo Salah’s future also falls into that category.\nThe Egyptian is about to enter the final year of his contract at Anfield, by which time he’ll be 33, and has continued to be linked with a potential move to Saudi Arabia following Al-Ittihad’s failed £150m transfer offer last summer.\nSpeaking on Football Insider’s Inside Track podcast, Pete O’Rourke is adamant that the Reds should gladly accept any lucrative bids which may come their way for their prolific number 11.\nFOLLOW Empire of the Kop on Instagram (@empireofthekop) HERE\nThe transfer reporter said: “It’ll be an interesting one to watch. He’s got 12 months left on his contract so, from a business point of view, now is the time to let him go.\n“You’re never going to get £100m for him halfway through the season, in January. If you’re looking at £100m now and you think you can recruit and build the squad with the players you’ve got, and use that money to get a replacement, then this is the time.\n“You’ve got to weigh up what the opportunity is this season. What does a Champions League finish, a title charge or an FA Cup mean to the club financially?\n“Is a Champions League finish and a long run in the Champions League worth more to the club financially than selling Salah now? If they want to get their money for him, he goes now. For him personally, if he waits another 12 months, that £100m goes into his wages.”\nREAD MORE: Liverpool may need to fend off ex-Chelsea manager to land ‘unstoppable’ speedster\nREAD MORE: (Video) Ibrahima Konate presents young fan with a gift to cherish in heartwarming clip\nO’Rourke’s arguments for Liverpool cashing in on Salah ASAP are logical, and we know that Michael Edwards isn’t the kind of operator who lets sentiment cloud a business decision, but it definitely isn’t as simple as merely taking the money for the Egyptian King right now.\nHis age, £350,000-per-week salary and contract situation all present food for thought when it comes to deciding on whether to sell this summer or try to hold out in the hope that he’ll sign a new deal.\nAlthough his form tailed off towards the end of the season, and he hasn’t rediscovered his usual standards ever since his injury at the Africa Cup of Nations, the 31-year-old still ended the campaign with 25 goals, maintaining an incredible consistency and reliability which should never be taken for granted.\nIt’s alright to say ‘sure, let’s take the money now and reinvest it in the squad’, but when Liverpool did that with Luis Suarez 10 years ago, the proceeds from selling him were put to poor use and the team suffered as a result.\nReaping £100m from getting rid of Salah now won’t be much good if it’s not reinvested wisely and if, like in 2014/15, the Reds decline alarmingly and miss out on Champions League football.",
  "word_count": 509,
  "scraped_at": "2026-02-14T02:01:16.455561",
  "_text_extracted": true
}