{
  "article_id": "71be6edbfb86",
  "url": "https://www.justarsenal.com/a-tribute-to-cesc-fabregas-on-his-retirement-always-a-true-gooner/343457",
  "title": "A tribute to Cesc Fabregas on his retirement - Always a true Gooner",
  "date": "20230702T163000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s rare that a player wins two titles with a club and yet when he announces his retirement to leave the sport to reflect on his career, he is firstly and mostly associated with a team where he only lifted one FA Cup, Arsenal.\nBoy, would it have been a travesty if Cesc Fabregas didn’t have a winners medal to show from his time in North London?\nIt feels dirty to say the Spaniard lifted the same number of trophies as a Gunner than the likes of Sanogo and Eddie Nketiah.\nYet to judge his time with us on what he did /didn’t win would be a disservice.\nContext is key ….\nHe was a teenager in 2005 when we beat Man United on penalties, his first full season in the first team squad.\nThe assumption was it would be the first of many pieces of silverware for him in the red and white.\nNo one could have envisaged we wouldn’t lift another prize for another 9 years, at which point he had moved back to Spain.\nThere were near misses.\nHe played in a Champions League Final at 18 with composure that didn’t match his age.\nGiven who our opponents were in Paris, now his media in the homeland had first-hand experience that the reputation he had in La Masia was warranted.\nThat European campaign, easily our best ever in UEFA’s premiere competition, seemed symbolic.\nThere was Viera’s return to Highbury only to lose the midfield battle to his much younger replacement.\nHere we were in our last season at our beloved old stadium, heading into a new direction, led by a man who in many ways became the face of Arsenal as they moved to the Emirates.\nJust maybe not the face he wanted to be.\nFabregas was sold on the vision that he would captain a young Arsenal team to former glories, passing on the principles taught to him by Pires, Ljungberg, Silva, Bergkamp, Henry, etc.\nAs the Invincibles were broken up, the average age of the side was reduced and so was the type of player now being recruited.\nNever shy to give youth a chance if he spotted a talent, Mr Wenger couldn’t wait to rush the 17-year-old into the starting 11.\nThe Frenchman had found a gem and was so convinced he had found someone so special, that even with so little experience, this was who the post Invincibles would be built around.\nFormations were changed to get the best out of Fabregas and the prototype of what Mr Wenger wanted in a player changed.\nSuddenly talent short, maybe not physically imposing, were being scouted. Those shortcomings were accepted because the priority was having close control, being able to move the ball quickly in tight areas with no space.\nSo let me stress, Mr Wenger’s admiration in Fabregas from day one was genuine. He wouldn’t have put so much trust on young shoulders if that wasn’t the case.\nIt’s just …. not the entire truth.\nMr Wenger had to sign youngsters, untested at the highest level and therefore gambles, because he was restricted in the transfer market.\nIt has since been revealed the financial pressure we were under to pay back debt from building a new stadium and how crucial it was we made the top 4 for maximum revenue.\nThat’s what Fabregas became the true face of!\nFor a while he believed ambition existed, but soon noticed nothing was being done to support the playing department.\nDespite his employer being a billionaire!\nYou can’t say at any point during his career with us Arsenal truly did everything in their powers to be competitive.\nIn our two-decade title drought, few players came as close as the midfielder to inspiring us to our 4th Prem.\nIt’s not Fabregas was superior to his teammates. His peers included a young Van Persie, Nasri, Wilshere, Adebayor, etc.\nThere were years when we got to March it generally seemed that Arsenal were going to be Champions.\nThe dressing room was technically good enough, they just needed some help.\nA senior pro, a leader, experience just to demonstrate game management.\nSlowly you saw Fabregas become aware of the situation, not able to hide his frustration.\nI vividly recall a loss to Chelsea in a period where they always bullied us, no matter our possession stats or how many sideway passes we tried to play.\nWhen confronting the referee Fabregas gestured for the official to look at the size of him, now compare that with his opponent.\nHe wasn’t saying it was men vs boys because he was as gifted as anyone on that pitch.\nIt was acknowledgment though of what we had become.\nI truly believe he was proud to be our captain and had the respect of those around him.\nGiven his education, I think he shared Mr Wenger’s ethos. He too wanted to win playing the sport the right way.\nHe had to go to Stamford Bridge to win what he warranted, but I bet secretly he never loved the style of play he was now asked to take part in?\nI believe it was heart vs head for our skipper at the time.\nHe had tried his best to make Arsenal successfu, but why should he give up his dream of playing for Barcelona if his employers were not willing to compete?\nThey had asked him to give them one more year, the armband used as a prop to appease him, being the face of a brand enhancing his image.\nYet, Arsenal were asking him to stay and not be ambitious, yet at the same time couldn’t even afford Mark Schwarzer! Trying to stay top of the table with Almunia in goal!\nEven if he adored his place of work, no matter the respect for the badge, does it matter if that place of work refuses to move forward?\nAre they not essentially pushing you out of the door? They might ask you to stay but their actions told Fabregas he was wasting his time.\nWould you stay in a job with no progress?\nThere may have not been serious reasons to leave but the problem was no one could sell him on what was to there to stay for?\nTo celebrate 4th, qualify for a tournament the Kroenke Family had no desire to win while banking the participation money.\nThat’s why I don’t say ‘well done’ to our owners for doing a job they should have been doing when we had Fabregas.\nThey had serious power on the board at the time, yet sold Fabregas and Nasri in the same summer and kept most of the money for themselves.\nSome Gooners will never forget Spain celebrating winning the World Cup by forcing a Barcelona shirt over his head, disrespectful to the team who gave him the platform to make it to that stage and he was still under contract to.\nSome YouTubers campaigned for his image to be removed from around our ground once he joined Chelsea.\nThese same fan channels ask for forgiveness when they are racially abusive or jailed for kidnap, yet can’t forgive Fabregas for playing for our rivals, only making that decision because Arsenal turned down the chance to resign him.\nFabregas had a buy-back clause in his Barca deal and made it clear his first choice would be to return to English Football with us!\nHe would have lined up with a prime Ozil and Sanchez.\nYet Mr Wenger felt he could trust Ramsey and Wilshire to stay fit!\nSince winding down his playing days, first in France, then the Italian’s lower division, Fabregas has tried to distance himself from our West End rivals.\nOn occasional work as pundit, he very much sells himself as an ex-Arsenal player not Chelsea.\nI don’t think his connection with us is over.\nHe’s already announced he will now coach Como’s B team in Serie B.\nHe spent a few days at our training ground last season observing Mikel Arteta, both academy graduates from the same system, both Guardiola disciples.\nOur boss has helped out Jack Wilshere by keeping him part of the family, by asking him to work with the under 23’s.\nWhen the time is right, I can see Arteta doing the same for this countryman.\nIf Fabregas was unemployed tomorrow, Arsenal would find him a role.\nChelsea wouldn’t.\nThey are soulless and view Fabregas as just another name to come and go.\nAt Arsenal, he’s part of our family, where he grew up, from a child to a man.\nHe deserves to be forgiven for choices made after he left us.\nThat was our fault. We failed him by not being able to match his ambition.\nYou can’t ask a player to go on international duty, play with Pique, Puyol, Cassillas, Iniesta, Xavi, Silva, Alonso, Villa, etc and accept only 4th.\nYou can’t assist the winning goal at a World Cup Final then stagnate.\nCesc Fabregas won a World Cup, 2 European Championships, 2 Prems, 2 FA Cups, a League Cup, La Liga, Copel del Rey, UEFA Super Cup and FIFA Club World Cup.\nHe played 738 games and scored 125 goals and stole our hearts.\nOn behalf of Justarsenal, enjoy your retirement, Cesc Fabregas.\nOnce a Gooner always a Gooner\nDan",
  "word_count": 1550,
  "scraped_at": "2026-02-14T01:50:37.764567",
  "_text_extracted": true
}