{
  "article_id": "71cb35ed50a3",
  "url": "https://www.barcablaugranes.com/2023/11/24/23974433/rayo-vallecano-barcelona-la-liga-team-news-match-preview-lineups-score-prediction",
  "title": "Rayo Vallecano vs Barcelona , La Liga : Team News , Preview , Lineups , Score Prediction",
  "date": "20231124T224500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rayo Vallecano vs Barcelona, La Liga: Team News, Match Preview\nBarça travel to Madrid for a crucial game against their bogey team looking to stay in the title race\nCompetition/Round: 2023-24 La Liga, Matchday 14\nBarcelona Outs & Doubts: Gavi, Sergi Roberto, Marc-André ter Stegen (out)\nRayo Vallecano Outs & Doubts: Darwin Machís (out), Óscar Trejo (doubt)\nDate/Time: Saturday, November 25, 2023, 2pm CET/WAT (Barcelona & Nigeria), 1pm GMT (UK), 8am ET, 5am PT (USA), 6.30pm IST (India)\nVenue: Campo de Fútbol de Vallecas, Madrid, Spain\nReferee: José Luis Munuera Montero\nVAR: Santiago Jaime Latre\nHow to watch on TV: ESPN Deportes (USA), Viaplay Sports 2 (UK), SuperSport (Nigeria), Sports18 (India), Not Available (Spain, Canada), others\nFollowing a costly two-week international break that cost Barcelona one of their best players for the rest of the season, the defending La Liga champions return to action to begin a giant week with a trip to Madrid to face Rayo Vallecano at the Vallecas Stadium on Saturday’s early kickoff.\nBarça fans worldwide are still trying to process the painful and unnecessary loss of Gavi to a serious knee injury that ended a truly sensational season at the individual level for a young man who had established himself as one of the team’s best players to begin this campaign. But the Blaugrana have no choice but to move on, and the return of Frenkie de Jong as well as Pedri getting closer and closer to his top physical shape should help ease some of the burden created by Gavi’s absence.\nXavi Hernández is under pressure after a horrible stretch in October and November that was filled with not only bad results but even worse performances. The team is not playing well enough to compete for the things they want to win this season, and it’s on the coach to find solutions and the players to find a way to get back to the level of football shown in September when Barça looked like a real contender both in Spain and Europe.\nThe next four games will in many ways decide Barça’s season: the last two against Atlético Madrid and Girona will pretty much settle the Catalans’ fate in the title race, and next Tuesday’s Champions League clash against FC Porto could either seal qualification for the knockout stages or put Barça in real danger of going to Europa League for the third straight season.\nBefore those three season-defining games comes a trip to Barça’s bogey team: Rayo Vallecano, who are yet to lose to a Xavi-coached Barça side in three meetings that were largely dominated by the team from Madrid.\nRayo lost their great manager Andoni Iraola to the Premier League and a couple of very important players in the summer, but after a difficult start to the season that included a 7-0 loss to Atlético at home they are beginning to find their footing and are getting back to their high-intensity, quick-passing style that creates a lot of problems for their opponents, especially in Vallecas.\nThis will be a brutal test for Xavi and his troops, and three points are crucial. Normally in games as important as this I wouldn’t care as much about the level of performance, but Barça simply must win AND play well. If they don’t, the concerns will continue to rise.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-3-3): Peña; Cancelo, Kounde, Iñigo, Balde; Pedri, De Jong, Gündogan; Raphinha, Lewandowski, Ferran\nRayo (4-2-3-1): Dimitrievski; Ratiu, Mumin, Lejeune, Espino; Ciss, Valentín; Isi, Nteka, De Frutos; De Tomás\nPREDICTION\nRayo away is always, always, always tough. But Barça really need this one, and they usually win the La Liga games they really need: 2-1 to the good guys.",
  "word_count": 615,
  "scraped_at": "2026-02-14T02:17:09.421837",
  "_text_extracted": true
}