{
  "article_id": "7201c98f2931",
  "url": "https://metro.co.uk/2025/11/11/liverpool-legend-calls-mohamed-salah-axe-the-guy-not-giving-anything-24674140/",
  "title": "Liverpool legend calls for Mohamed Salah axe :  The guy is not giving you anything ! | Football",
  "date": "20251111T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arne Slot should drop Mohamed Salah as he is ‘not giving him anything,’ believes Liverpool legend Steve Nicol.\nThe difficult season for the Reds continued on Sunday as they were beaten 3-0 at Manchester City in another big blow for their Premier League title defence.\nIt was the fifth defeat in just 11 league games and left Liverpool eighth in the table, eight points behind leaders Arsenal.\nLike most of the Reds squad, Salah is not at top form and is not producing nearly as many game-changing performances as he did last season.\nNicol, who won four top flight titles with Liverpool, feels it is time to take the Egyptian out of the team, at least for a brief period as repeatedly starting him is not getting the best out of him.\n‘Yes I would. The second part of the question is, for who?’ Nicol told ESPN FC on whether he would bench Salah.\n‘You have to try and figure a way out to get him back to somewhere near his best. And so far, playing him and playing him and playing him isn’t working.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I got excited when he scored a couple of goals in a couple of games [against Brentford and Aston Villa], but his overall performance hasn’t really changed much other than those two goals.\n‘Now the only other thing you can do is sit him on the bench, Sit down, have a look, maybe a different perspective.\n‘Then play him the next game and let’s see if there’s any sort of reaction because unfortunately he’s reached the stage now where the team can’t carry him anymore. Simple as that.’\nMo Salah Premier League stats this season\nApps: 11\nGoals: 4\nAssists: 2\nIt was suggested to Nicol that with the African Cup of Nations coming up next month, it may be that Slot is using Salah as much as he can now as he won’t be able to during the tournament in Morocco.\n‘Unfortunately there’s an answer to that: What is the point?’ Nicol replied. ‘The guy is not giving you anything!\n‘You could look at it the other way and say: “He’s going to be away for two or three months so we may as well try and figure something out now. Why am I going to wait on a guy who’s giving me nothing? I need to be proactive here. I can’t just sit on my hands and let it happen and hope and pray that all of a sudden somebody waves a magic wand and he becomes the Egyptian King again.”\n‘I absolutely think he needs to do something and my own person opinion, I would sit him.’\nAFCON runs from December 21 till January 18, so unless Salah picks up an injury then he will not be gone for ‘two or three months’ but Egypt are one of the favourites to go deep in the competition.\nSlot did bench Salah in a 5-1 Champions League win at Eintracht Frankfurt last month, with the manager insisting afterwards that he had no concerns about his star player’s form.\n‘The main thing is that he always has scored goals for Liverpool,’ Slot said in a press conference before a 3-2 loss at Brentford.\n‘The last thing I worry about is Mo scoring goals again. He’s done that his entire life and I expect him to do that again in the upcoming weeks and months.’\nRooney hits out at Salah’s lack of defending\nThe 33-year-old has come in for criticism for his lack of defensive work, which comes into sharp focus when he is not scoring goals or providing assists.\nMore Trending\nWayne Rooney pointed out the issue after right-back Conor Bradley had a torrid time against Jeremy Doku on Sunday, with little help from Salah.\n‘Salah is in the team to score goals and create goals. He’s been one of the best players in the Premier League over the last six or seven years. But in big games, you have to double up,’ Rooney said on Match of the Day.\n‘You have to get back and help your teammate. Conor Bradley was having a really tough game today, to be left on his own. Ryan Gravenberch was trying his best to help him and get over there, but then that leaves spaces in other positions. I think Salah has to come back and help his teammate.’\nMORE: Ruben Amorim ‘open’ to keeping £70m Manchester United star on one key condition\nMORE: Lionel Messi speaks out on Barcelona return after secret Camp Nou visit\nMORE: Ruben Amorim asked Man Utd players to vote on ‘bomb squad’ member’s future",
  "word_count": 826,
  "scraped_at": "2026-02-14T02:03:26.533196",
  "_text_extracted": true
}