{
  "article_id": "72087c991e0f",
  "url": "https://www.nytimes.com/athletic/6931530/2026/01/01/manchester-united-transfer-window/",
  "title": "Man Utd fans want a busy transfer window . This is why they may not get it",
  "date": "20260101T103000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic has live coverage of Ruben Amorim’s sacking by Manchester United.\nThe transfer window is open for a month and, following the disappointing draw against Wolves on Tuesday, Manchester United fans might hope for some new signings. Two of the club’s greatest ever players, Patrice Evra and Nemanja Vidic, were acquired in a January transfer window 20 years ago, but a repeat of such a coup is unlikely.\nAdvertisement\nIt might sound like a simplistic assumption, but United want to sign individuals who want to play for them. Summer 2025 recruits Matheus Cunha and Bryan Mbeumo did, and Benjamim Sesko, too. All could have gone to other suitors.\nOf course they’re going to be well paid, but money is not the be-all and end-all. If a player or his agent wants to earn more, they might find it elsewhere. If they want to join a team in the hunt for the Champions League this season, then the reality is that United’s stock has fallen. They are no longer in the position which enabled them to say to Arsenal’s Robin van Persie or Tottenham’s Michael Carrick or Dimitar Berbatov — to name just three examples — “Come and join us and win the league”.\nUnited will hope to return to that level, but for now they must push their virtues: lining up for England’s biggest club in front of the largest crowds, and the chance to be part of a project to restore a club to former glories. Manchester is a booming, well-connected city to live in and anyone who plays for United will have a global profile — for better or worse.\nAlong with four or five other Premier League clubs, United tried to sign Antoine Semenyo from Bournemouth. Talks took place this winter, as they did last summer. United’s view was that Semenyo is a talented footballer, capable of occupying multiple positions. There was a set fee (£65million, $87.5million) which appealed and he wants to move on from Bournemouth now – unlike most other targets. One of those clubs sounding him out wanted him in the summer — the rest, including United, wanted a deal to happen now.\nBut United were not going to pay Semenyo any more than the three outfield players signed in the summer. The club are adamant that there must be a wage structure. Semenyo has now communicated his desire to move to Manchester City.\nAdvertisement\nHad he signed, it would have accelerated the summer plans – yet those are not set in stone. A few months ago, a new central defender was on the target list. Now, the club will see how Ayden Heaven fares for the rest of this season. United will also see which formations are used and whether there’s European football next season — which is the make-or-break aim for the campaign.\nUnited’s chief target is one — or even two, depending on other outgoings — central midfielders in the No 6 role.\nAs previously reported by The Athletic, Nottingham Forest’s Elliot Anderson, who has also been linked with Manchester City, is a focus. Interest in Crystal Palace’s Adam Wharton and Brighton & Hove Albion’s Carlos Baleba remains. There are others of interest in this position playing in Italy and the Premier League. None are being actively pursued since none of their clubs want to sell right now.\nHow United see the transfer situation at the start of January’s window could be different from how they see it at the end of the month. The Africa Cup of Nations, injuries, form and league position will all play a factor, with European qualification crucial.\nAny United incomings in January are likely to be dictated by outgoings. United have no interest in loaning out — unless there’s a commitment to buy after the loan. Their squad is small as it is, so there is no benefit in giving another team fresh blood for no fee.\nWhat happens to midfielders Kobbie Mainoo, Manuel Ugarte and Casemiro is up in the air. Mainoo, who hasn’t started a single game this season and is interesting Napoli, wants to go on loan; United do not want him to.\nCasemiro is 34 in February and out of contract this summer, when he will be going to the World Cup finals with Brazil. There have been no talks about his future. This isn’t bad planning, but simply a realistic acceptance of the situation of someone on a vast wage who is respected and performing well.\nAdvertisement\nWhat’s the alternative? Tell a player that they’ll not be getting a new deal — as has happened in recent seasons — only to see their form nosedive?\nJoshua Zirkzee is of interest to Roma but, again, United don’t want him to go purely on loan. An obligation to buy or a firm sale would be different. And if he moved, that would change the transfer dynamic in January.\nThere’s sympathy with the view that Zirkzee, a popular figure at the club, was brought into play a system under one manager – and that is now not the system being used by the current coach. There’s also a belief that he’d thrive in the tactical systems used by other top clubs.\nCentral defender Harry Maguire, also out of contract in July, can sign a pre-contract agreement with another club now. United have not held substantive talks with him about next year because his situation is still in play. He’s been injured, is 32 and one of the best-paid players at the club, but he’s also still a huge figure in the dressing room. These are all considerations to be weighed up.\nUnited, as we’re seeing right now, don’t have a huge squad, but if anything good can come from the injuries, it’s that fringe and younger players are getting opportunities and others who have endured rough times this season, including Leny Yoro and Patrick Dorgu, have had the chance to reestablish themselves.\nDespite all this, United are sixth in the league. There have been some serious ups and downs, as there are for the team in first, let alone a team in sixth. There will be more.\nIf no players sign in January, decisions on who comes in will be made towards the end of the season. European football would mean more players, money and a bigger squad. United are confident that they’ll be ready for all the possible permutations, but that’s in the future.\nMeanwhile, agents will be talking up their clients and spurious links made with all manner of players. The prospect of new names can excite fans who are understandably frustrated after that Wolves draw, but while the situation can change for the reasons outlined above, don’t expect a lot of activity.",
  "word_count": 1123,
  "scraped_at": "2026-02-14T01:59:31.503087",
  "_text_extracted": true
}