{
  "article_id": "720ebb7a9ff2",
  "url": "https://metro.co.uk/2025/09/02/rio-ferdinand-reveals-thibaut-courtois-message-about-18-2m-manchester-united-signing-senne-lammens-24053094/",
  "title": "Rio Ferdinand reveals Thibaut Courtois message about Man Utd signing Senne Lammens | Football",
  "date": "20250902T081500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thibaut Courtois has endorsed Manchester United’s decision to sign Senne Lammens, according to Rio Ferdinand.\nUnited, who had also held talks to sign Aston Villa goalkeeper Emiliano Martinez, completed their £18.2 million deal to sign Lammens from Belgian side Royal Antwerp on deadline day.\nThe 23-year-old has made only 62 appearances in Belgian football and played just one game in the Champions League before his move to Old Trafford.\nHowever, Lammens is highly rated and Real Madrid goalkeeper Thibaut Courtois believes his countryman is ‘well-suited’ to the Premier League.\n‘Just so you know, that voice note was from Thibaut Courtois. He let me know about Lammens because he’s a Belgian player, and he was just giving me the heads up as to what he’s like,’ Ferdinand said on his YouTube channel.\n‘He said he’s a huge talent, obviously not experienced yet but he thinks his style will be well-suited to the Premier League as well.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘So that’s a recommendation from probably one of the best three goalkeepers in the world, Thibaut Courtois, so I’ll take that.\n‘I keep seeing people talk about the talent and whatnot, but the problem is – can Man United afford to wait for talent to develop at this point in time? That’s the question.’\nDespite United strengthening with Lammens on deadline day, Ferdinand believes his former club should have signed Martinez from Aston Villa.\nMore Trending\n‘What I would say is I was all-in on Emi Martinez,’ Ferdinand said.\n‘I just think his experience, he’s got the personality, the character, plays for Argentina where the pressure is absolutely immense, he’s won a World Cup, he was one of the reasons they won the World Cup, the save in the final, a big moments man,\n‘Man United need as much personality as they need ability coming through that door and I think he fits the bill in that sense completely.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Rasmus Hojlund ‘considers himself better’ than Benjamin Sesko after Man Utd exit\nMORE: Man Utd make appeal decision after Grimsby admit breaking Carabao Cup rules\nMORE: Piero Hincapie reveals why he snubbed Tottenham to join Arsenal",
  "word_count": 426,
  "scraped_at": "2026-02-14T01:52:36.763399",
  "_text_extracted": true
}