{
  "article_id": "722658ed0b60",
  "url": "https://www.nytimes.com/athletic/6329726/2025/05/04/real-madrid-fans-whistles-mbappe-ronaldo/",
  "title": "From Kylian Mbappe to Cristiano Ronaldo , why Real Madrid fans whistle their own players",
  "date": "20250504T053000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When even Kylian Mbappe is whistled by the Bernabeu, you get a sense of just how demanding Real Madrid’s fanbase is.\nMbappe, the 2018 World Cup winner and Madrid’s top scorer this season, was targeted in his team’s 1-0 win against Athletic Club in April, which followed their Champions League quarter-final elimination by Arsenal.\nAdvertisement\nHe is not alone. Other star players including Cristiano Ronaldo, Iker Casillas and Alfredo Di Stefano have all been whistled at some point by the Spanish club’s fans.\nSo what is behind it and what does it tell us about the pressures of playing for Madrid?\nIn England, players are booed; in Spain, they are whistled.\nIt goes beyond football to the world of bullfighting, which has deep roots in Spain. When the performance of the ‘corrida’ (bullfight in Spanish) does not go well, spectators often voice their disapproval in this way.\nNowhere is whistling more common than Madrid, Spain’s capital which, historically, has a more demanding character than other cities. There are examples of it happening in Real Madrid matches since 1920, including with forward Gaspar Rubio.\nThe journalist and historian Alberto Cosin referred to Rubio as a “fickle and fractious character” who was sometimes “booed and whistled” in an article for Spanish outlet La Galerna in 2015. When Rubio took an unauthorised trip to Cuba and Mexico and returned in 1932 to play in a game against Athletic, Cosin writes that “he received huge whistles when he took to the field”.\nBut the first notable cases actually come from Madrid’s first great era of success in the 1950s, when they won the first five European Cups in a row.\nUntil last year, Francisco ‘Paco’ Gento was the only player to win six European Cup/Champions League finals (Dani Carvajal and Luka Modric have since joined him in that feat). But his style of play meant he did not experience an easy start to life at the Bernabeu.\nThe Spanish winger was described by fans at the time as being so quick that he often left the ball behind him, meaning fans despaired when he lost possession. At one point Madrid considered sending him back to Racing Santander, the club they had signed him from, only for the iconic Di Stefano to vouch for him to the club’s president, Santiago Bernabeu.\nAdvertisement\nEven Di Stefano, Madrid’s all-time top scorer with 308 goals until first Raul, Cristiano Ronaldo and Karim Benzema overtook him, knew what it was like to be whistled at the Bernabeu.\nIn December 1962, a newspaper advertising campaign superimposed a woman’s legs with stockings on Di Stefano with the tagline: “If I were my wife, I would wear Berkshire stockings.” The reaction in Spain — a conservative society, still under the rule of the dictator General Franco — was so outraged that Madrid had to pay the company 150,000 pesetas (around €900 in today’s currency) to stop using the image.\nEven so, when Di Stefano next played at the Bernabeu he was greeted with resounding whistles. His response? Two key goals in a 3-2 win against Athletic Club.\nAccording to Jorge Valdano, who represented Madrid as a player, manager and general manager, the media pressure around the club creates high expectations among fans. Now a pundit, he also suffered whistles in the 1980s.\n“It has to do not only with the people but with the atmosphere at Real Madrid, with the media coverage and the weight of the week that someone spends at Real Madrid,” Valdano, now 69, tells The Athletic. “While I was playing for Madrid, sometimes going to Argentina felt like a relief.\n“It’s not that in Argentina I didn’t have any demands because finishing second in a World Cup was already a failure. But the weight of the week wasn’t the same as the one you suffered at Real Madrid, which forces you to be in a permanent state of alert. That’s why I always say that Madrid’s players run in self-defence.\n“I played for four or five months with the whole stadium against me, I had Jose Maria Garcia (a radio journalist known for his tough criticism) against me, but it didn’t change my game. Then I completed the best season of my life by winning the league, UEFA Cup and World Cup (in 1986).”\nAdvertisement\nIn that same decade, another club legend in Michel Gonzalez received the same treatment. The midfielder was part of the famous ‘Quinta del Buitre’ generation, led by striker Emilio Butragueno and consisting of five stars from the club’s academy.\nIn one match against Espanyol in June 1989, Michel decided he could no longer stand the fans’ whistles and left the pitch in protest. Madrid had already won La Liga but had lost their European Cup semi-final against Milan 6-1 on aggregate, with Michel singled out by the fans.\n“When I go to football, I go to enjoy myself,” he told Spanish radio station Cadena Ser in a 1989 interview with Valdano himself. “The day of Espanyol I couldn’t take it any more and I left.\n“I understand that it’s wrong, but I was very disappointed. It was a day of celebration and even on that day they didn’t forgive me. It’s like if your father scolds you every day, and on your wedding day too. I’m a professional, but when I go on the pitch I feel like a Madridista (Madrid fan) and it hurts me that they persecute me like that.”\nMichel said in that interview that he wanted to leave the club — although he only ended up departing in 1996, having made 559 appearances and scored 178 goals.\nBut why do fans express their disapproval by whistling, specifically?\nFor Sara Martinez de Espejo, a psychologist specialising in sport and high performance who works with La Liga side Leganes, it is a result of fans thinking they can impact the match.\n“A mirror effect is generated with idols of the past,” she tells The Athletic. “They create a yardstick and if the current players don’t match the required level of character and quality, the fans get angry.\n“The fans believe that they have an influence. Sometimes they do it consciously or unconsciously as a form of psychological pressure. Players may snap out of it in response to that provocation but it is not always a good strategy.”\nAdvertisement\nIn more recent times, even Ronaldo — Madrid’s all-time top scorer with 450 goals from 2009-2018 — had to put up with it.\nThe Portugal forward was whistled by a section of the Bernabeu stands after miscontrolling a ball in a match against Real Sociedad in 2017. He did not take it well, with Spanish TV footage showing him calling fans “Filhos de p***” (sons of b****es) in Portuguese. Then-captain Sergio Ramos appeared to tell Ronaldo to calm down and he ended up scoring and assisting in a 3-0 win.\nGareth Bale repeatedly experienced the same treatment as his nine-year stay in the Spanish capital gradually turned sour after his world-record move in 2013. In 2022, then-Madrid midfielder Casemiro said fans were “whistling at the history of this club” when they targeted the Welshman.\n“The first time I was a bit like, ‘Oh, what is this?’,” Bale told the Erik Anders Lang podcast in 2020. “You would expect your fans to get behind you and try and make you do better because it will make them happy, but it seems that they do the opposite. They just whistle you, which makes you feel worse.”\nBefore that, the Bernabeu played a part in Jose Mourinho’s fractious tenure as manager from 2010-2013. He was whistled in a match against Athletic Club, only reacting when he heard chants against him from the south end of the ground, where the ultras (Madrid’s most vocal supporters) were located, telling them to be quiet.\n“(Zinedine) Zidane has been whistled here, Ronaldo (Nazario) and Cristiano Ronaldo have been whistled here. Why can’t I be whistled?” he told his post-match press conference. “There is a first time for almost everything and it has happened to me. It’s OK.”\nThe story did not end there. At the end of 2012, during a difficult start to the season, Mourinho told fans to get to the ground early before a match against Atletico Madrid so they could applaud or whistle him as they saw fit.\nAdvertisement\nIt was the Portuguese’s attempt to draw the sting of the situation, having grown weary at what he told reporters had become the “national sport” of criticising him, but when he emerged onto the Bernabeu pitch, the ground was half empty. Despite some whistles, the majority of those present applauded him.\nLegendary homegrown goalkeeper Casillas was also suffering at the time due to his frosty relations with Mourinho — he was benched by the coach amid accusations he was leaking information to the press, something he vehemently denied.\nYet criticism of Casillas continued even after Mourinho left and went into overdrive in what would end up being his final season at the club in 2014-15. During a game against Valencia practically all the fans in the Bernabeu whistled him whenever he touched the ball — especially after Valencia went 2-0 up (Madrid went on to draw 2-2).\n“Whistle whatever you want, for f***’s sake,” was Casillas’ reaction, captured by Spanish TV.\nValdano thinks that the players who come up from Madrid’s academy have it even harder than signings from elsewhere.\n“When in the youth ranks you put on the Madrid shirt and go to play in the neighbourhoods of Madrid you have to put up with the aggressiveness of the people, the aggressiveness that always falls on the big boys,” he says.\n“I remember an 11-year-old kid at a youth tournament talking in an interview and they told him he was going to play in Barcelona, in a very tough environment and the kid said, ‘No problem with that, we’re used to it’. Putting on this shirt puts you under a high level of pressure from day one.”\nThat pressure is just as intense now.\nExpectations in Madrid remain sky-high and there is even more necessity to be successful, given the club’s outlay on a Bernabeu rebuild worth at least €1.76billion (£1.5bn/$2bn) and a cast of galacticos including Mbappe, Vinicius Junior and Jude Bellingham. This season, fans have made their voices heard as Carlo Ancelotti’s team have struggled to match their achievements of winning La Liga and the Champions League last season.\nAfter the 5-2 thrashing in the Supercopa de Espana final against Barcelona, Ancelotti, midfielder Aurelien Tchouameni and right-back Lucas Vazquez were whistled when their names were called out on the Bernabeu loudspeakers in their following game against Celta Vigo in the Copa del Rey. Madrid almost blew a 2-0 lead in that game before winning 5-2 in extra time, with Ancelotti calling the whistles “an acceptable wake-up call.”\nAdvertisement\nVinicius Jr heard whistles in another match against Valencia in which he was replaced with the score at 1-1. Afterwards, against Athletic Club, he scored a goal that was later disallowed, but chose not to celebrate with the fans.\nMbappe has faced whistles on several occasions this season, although it was particularly noticeable after the Champions League exit to Arsenal. The Frenchman was suspended for the following game against Athletic but, when a picture of him was shown on the TV screens in the ground, a significant section of the crowd showed their dissatisfaction.\n“The psychological impact on players exists 100 per cent, but it depends what they are like,” says Martinez de Espejo. “It can provoke anticipatory anxiety, which is the anxiety of failing in fear of the reaction of the crowd. It can also provoke self-doubt, which is when the player doubts his actions and some become emotionally distanced, which is a defence mechanism.”\nThen again, Valdano says that is just the way it goes with supporters who are so used to glory.\n“There is a rush to condemn players,” says Valdano. “But that’s the story: at the Bernabeu, nobody gets off the hook.”\n(Top photo: Kylian Mbappe by Mateo Villalba via Getty Images)",
  "word_count": 2019,
  "scraped_at": "2026-02-14T02:26:38.645706",
  "_text_extracted": true
}