{
  "article_id": "723bb4efd355",
  "url": "https://www.the42.ie/nottingham-forest-sack-ange-postecoglou-after-8-games-in-charge-6848021-Oct2025/",
  "title": "Nottingham Forest sack Ange Postecoglou after 8 games in charge",
  "date": "20251018T164500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Updated at 16.52\nANGE POSTECOGLOU was sacked as Nottingham Forest manager on Saturday, minutes after his side’s 3-0 defeat by Chelsea — a brutal end to a reign that lasted just 40 days.\nForest owner Evangelos Marinakis left his seat during the match at the City Ground in an ominous sign for the Australian, and his fate was confirmed shortly after full-time.\n“Nottingham Forest Football Club can confirm that after a series of disappointing results and performances, Ange Postecoglou has been relieved of his duties as head coach with immediate effect,” the club posted on X.\n“The club will make no further comment at this time.”\nIt is the shortest managerial reign of any permanent Premier League manager to leave a club during the season.\nPostecoglou was only appointed on 9 September but has failed to win a single match in his eight games in charge in all competitions.\nForest collected just one point from his five Premier League matches at the helm.\n- Manager hunt -\nThe club are now on the hunt for a third manager this season after Nuno Espirito Santo was dismissed last month.\nForest finished seventh in the Premier League last season under Nuno, having looked likely for a long spell to seal a Champions League spot.\nFulham manager Marco Silva has been linked with the job at the two-time European champions, while former Burnley and Everton boss Sean Dyche is also reportedly a candidate.\nPostecoglou, sacked by Tottenham in June, was defiant at his pre-match press conference on Friday, saying if he is given time at a club, it always ends “with me and a trophy”.\nLast season, he won the Europa League with Tottenham, in his second season in charge, though a terrible league campaign cost him his job.\nThe Chelsea match was an unhappy final chapter in a miserable reign for Postecoglou, 60.\nForest started brightly but failed to take their chances in the first half.\nTeenager Josh Acheampong headed the visitors ahead early in the second period before Pedro Neto curled home from a free-kick.\nCaptain Reece James made it 3-0 late on to lift Chelsea into fourth spot in the table ahead of the 3pm kick-offs, with Forest just above the relegation zone.\nThat sparked a mass evacuation from the City Ground, leaving Postecoglou pensive on the touchline, with jeers to follow at the final whistle.\nFormer England captain Alan Shearer believes Marinakis must take his share of the blame for Postecoglou’s demise.\n“Ultimately, the results haven’t been good enoug,h and that is on Ange. But the owner has to take some responsibility too. He chose Ange; it was his appointment,” Shearer told BBC Sport.\n“How can you go from a manager in Nuno with one style of play to someone like Ange who everyone knows wants his teams to play in a completely different way?”\nFormer Manchester City defender Micah Richards also highlighted the change in styles from the conservative Nuno to the more expansive Postecoglou.\n“It was inevitable, but I don’t think it’s right,” he said.\n“He was only given eight games, and a contrast of styles was always going to be a factor.\n“Forest went from one of the best counter-attacking managers to one who wanted to be more expansive — it was never going to work straight away.”",
  "word_count": 552,
  "scraped_at": "2026-02-14T02:26:56.611035",
  "_text_extracted": true
}