{
  "article_id": "724ad7171893",
  "url": "https://metro.co.uk/2024/10/14/tony-cascarino-claims-arsenal-star-at-level-a-real-madrid-player-21793516/",
  "title": "Tony Cascarino claims Arsenal star is  at the level of a Real Madrid player  ",
  "date": "20241014T184500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tony Cascarino has warned Arsenal that they must win trophies in order to prevent William Saliba from joining Real Madrid.\nReports in France this month have claimed that Saliba has been identified as one of Madrid’s top targets for the transfer window next summer.\nArsenal, however, are in a strong negotiating position as the French defender signed a contract extension 16 months ago which keeps him tied to the club until 2027.\nCascarino, however, believes Arsenal will need win silverware both domestically and in Europe in order to fend off interest from the Champions League holders.\n‘There are vultures in football hanging over football clubs all the time to try to snatch their best players,’ Cascarino told talkSPORT.\n‘There’s no bigger vulture than Real Madrid. If they’re after you there’s a good chance [of the player moving].\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s not only convincing the player but the agents get involved, the lure of Real Madrid. Winning and being successful is a great way of keeping players, it really is.\n‘Arsenal have to achieve that because Saliba is playing to the level of being a Real Madrid player but he’s got to be convinced that Arsenal are going to be a successful and winning team and challenging to win the Champions League because that’s what Real Madrid do so often.’\nMore Trending\nAsked if Saliba would be irreplaceable at Arsenal, Cascarino replied: ‘I think everyone is replaceable to a degree.\n‘We’re talking about a super-high level, once Real Madrid are interested in you, you know that that’s the team who win the Champions League more often than not. When they’re after you, Arsenal have got a problem.\n‘He just signed a five-year deal a year ago so they’ve got him under contract for a quite a while but they might have to throw another new deal at him to try and keep him even longer.\n‘It’s going to be a problem but that’s great for Arsenal as a football club because it shows they’re being successful because a club like Real Madrid want one of their players.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Paul Pogba responds after Man Utd legend Patrice Evra tells him which club to join\nMORE: Manuel Ugarte makes admission that Erik ten Hag must take note of\nMORE: ‘Wise decision’ – Alan Shearer praises Scott McTominay for leaving Manchester United",
  "word_count": 461,
  "scraped_at": "2026-02-14T01:57:46.248438",
  "_text_extracted": true
}