{
  "article_id": "724c35a33d06",
  "url": "https://www.teamtalk.com/liverpool/liverpool-step-up-transfer-interest-66m-former-slot-favourite-father-hint",
  "title": "Liverpool transfers : Reds step up interest in £66m former Slot favourite after father hint",
  "date": "20241028T190000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nLiverpool step up transfer interest in £66m former Slot favourite after father’s hint\nLiverpool’s interest in Benfica star Orkun Kokcu is reportedly growing after sending scouts to watch the midfielder once again.\nArne Slot’s midfield has looked impressive this season, with Alexis Mac Allister, Dominik Szoboszlai, and Ryan Gravenberch forming an effective partnership for Liverpool.\nHowever, all teams are always on the lookout for exciting talent and that has led to links with Turkey international Kokcu.\nThe 23-year-old is well known to Slot in particular, as the Turk played under the Dutchman at Feyenoord between 2021-23, before joining Benfica nearly 18 months ago.\nNow, Portuguese newspaper Record, via Sport Witness, claims the Reds’ interest in the former Netherlands youth international is increasing after scouting him for two games in a row.\nThey reportedly watched him take on his old side Feyenoord in the Champions League last week and then again against Rio Ave at the weekend.\nHowever, it may be difficult to prise him away from the Portuguese giants as he reportedly has a release clause of €150m (£126mm, US$164.6m), although other reports suggest he may cost €80m (£66.6m, $86.5m).\nA rising star of the game\nKokcu – who predominantly plays as a central midfielder but has also been utilised in attacking midfield, defensive midfield and on the left wing – had a solid season for Benfica in 2023/24.\nIn 43 appearances, he notched seven goals and 11 assists for The Eagles and this term he has bagged four goals and three assists in just 11 games in all competitions.\nThe Turkish ace, whose contract runs until 2028 at the Liga Portugal outfit, has also impressed in the Champions League this season – scoring in the 2-1 win over Red Star Belgrade and the 4-0 thrashing of Atletico Madrid.\nIt would be interesting to see where he would fit in a Liverpool midfield, which also has Curtis Jones and Wataru Endo as backup options. It seems his father, Halis Kokcu, would be open to a move to Anfield, though.\nHe said last week: “Arne is a good friend of ours. He has been through a lot of things with Orkun. Yes, why not? It’s possible.\n“The most important thing now is Orkun’s focus, that he does well with Benfica. But of course, players and trainers don’t have just one station, the staff knows that too. In modern football, clubs think about finances, about making a profit.\n“Orkun is a player who has the potential to make a profit with the next step. The fans and the club are also fine with that, of course. That was also the project. We’ll see where he ends up.”\nLiverpool eye talented defender\nTEAMtalk can reveal that Liverpool are seriously considering a move for Nottingham Forest centre-back Murillo.\nAmid the uncertainty over whether or not captain Virgil van Dijk will sign a new deal, with his contract expiring next summer, the Reds are looking for possible alternatives if he does leave.\nAnd the 22-year-old is very much on the Merseyside outfit’s shortlist, but the Forest ace is also admired by Chelsea.\nElsewhere, a new report claims Liverpool are keeping tabs on Crystal Palace striker Jean-Philippe Mateta.\nThe Frenchman reportedly walked away from contract negotiations with the Eagles after being disappointed with the terms he was offered.\nFinally, Arsenal and Liverpool are said to be vying for Juventus forward Kenan Yildiz – fresh off his two-goal cameo against Inter Milan at the weekend.\nWho is Orkun Kokcu?\nBorn in the northern Netherlands city of Haarlem, Kokcu joined Feyenoord’s youth set-up in 2014, at the age of 13, after spending four years with Groningen.\nAt 17, he scored after coming off the bench to make his senior debut in a KNVB Cup win over VV Gemert in September 2018.\nAn Eredivisie bow arrived the following December against Emmen, with Kokcu this time scoring and registering an assist.\nAfter representing the Netherlands as a youth, Kokcu switched allegiance to Turkey at under-21 level. He made his senior international debut in 2020.\nThen-manager Slot made Kokcu club captain in September 2022 and Feyenoord went on to win the Eredivisie title in the 2022/23 season.\nKokcu finished the title-winning campaign with eight league goals and two assists, earning the Eredivisie Player of the Year award and a €25million (£20.9m, $27.3m) move to Benfica.",
  "word_count": 729,
  "scraped_at": "2026-02-14T01:51:57.636020",
  "_text_extracted": true
}