{
  "article_id": "72574a13bb42",
  "url": "https://www.upr.org/npr-news/2025-06-12/the-fifa-club-world-cup-is-here-heres-what-you-need-to-know",
  "title": "The FIFA Club World Cup is here . Here what you need to know",
  "date": "20250613T061500Z",
  "domain": "upr.org",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Updated June 13, 2025 at 6:02 PM MDT\nThe Club World Cup men's soccer tournament is set to kick off at stadiums across the U.S. on Saturday, with some of the world's top teams competing for a brand new trophy — and a whole lot of cash.\nThe 32-team tournament represents a bold gamble by FIFA to unveil a completely revamped version of a tournament that was previously far smaller. For the U.S., it will be an opportunity to host a major event a year before the country co-stages the World Cup with Canada and Mexico.\nBut the new format has been controversial. Players have complained about adding yet more games to an already congested calendar. Ticket sales have been sluggish, forcing FIFA to slash prices under a dynamic pricing model that it has introduced for the first time.\nThen again, there's the money: a $1 billion pot that will be spread out among all participating teams, with the winner set to take up to $125 million.\nHere are five things to know about the Club World Cup, taking place over the next month.\nSo what is this all about?\nIt's not technically new. The previous versions of the Club World Cup were fairly low key, consisting of the champions of the top regional club competition around the world (mostly six or seven teams in total), and it was held annually.\nThis is the turbo-charged version.\nUnder FIFA President Gianni Infantino, the tournament has been expanded to 32 teams, a mix of regional champions from recent years and others selected based on regional rankings. Even the trophy was given a huge redesign.\nIt will now be held every four years, and it marks FIFA's ambitious attempt to introduce a much more global club tournament.\nThis year's edition will consist of 63 games played across 11 cities around the U.S. They include the opening game at 8 p.m. ET on Saturday between Inter Miami and Al Ahly from Egypt at Hard Rock Stadium in Miami Gardens, Fla. The final will be held at MetLife Stadium in East Rutherford, N.J., on July 13.\nThe streaming platform DAZN has the global rights and will offer all games free. TNT Sports will also co-broadcast 24 games under a special deal with DAZN.\nSo who'll be playing?\nSome of the top and best known teams around the world will be playing, including Real Madrid from Spain, Bayern Munich from Germany, Inter Milan from Italy and River Plate from Argentina. It's an opportunity to watch some of the best players in the world, including Kylian Mbappé at Real Madrid, Ousmane Dembélé at Paris Saint-Germain and Lionel Messi from Inter Miami.\nEuropean clubs will have the most representatives — 12 — but not all top teams are taking part. Some notable absences, for example, include FC Barcelona from Spain and Liverpool FC from England.\nInstead, in a bid to globalize the tournament further, other less well-known clubs are getting a chance to participate, including Urawa Red Diamonds from Japan, Mamelodi Sundowns from South Africa, and Auckland City FC, an amateur club from New Zealand.\nWho are the favorites?\nNo surprise here: European teams are seen as the top contenders.\nA European team has won 16 of the previous 20 versions of the Club World Cup, including the past 11 editions in a row.\nBut South American teams could provide some steep competition. Brazil's Botafogo is the most recent winner of the top South American regional tournament, Copa Libertadores.\nThere will be some high-profile match-ups. Among European sides, PSG — the most recent Champions League winner — is set to face Atlético Madrid from Spain in Pasadena, Calif., on Sunday. And Juventus from Italy will face Manchester City on June 26 in Orlando.\nMeanwhile, Bayern Munich and Argentinian top side Boca Juniors will clash on June 20 in Miami, while Inter Milan will face River Plate on June 25 in Seattle.\nWhy has it been so controversial?\nMainly because of a question many players — and fans — have posed: Is this revamped tournament even necessary?\nFIFA didn't respond to requests for comment. But FIFPRO, the union representing players worldwide, has been very critical of the tournament.\nIts European body teamed up with leagues in Europe and Spain's La Liga to file a complaint against FIFA to the European Commission, arguing the Club World Cup was contributing to an \"oversaturated international football calendar\" that was putting \"player safety and wellbeing\" at risk.\nAcross the soccer world, players usually compete with their clubs on their domestic leagues as well as in separate domestic championships. The top teams also go on to play in regional tournaments like the Champions League or the Copa Libertadores — and then some players have to represent their national squads, as well. It can be a packed calendar.\nAnd the organization has argued the tournament will help grow the sport globally even further, saying it would steer $250 million to soccer clubs around the world.\nSo is it proving to be a big draw for fans?\nNot quite.\nA recent look through the ticket inventory shows plenty of seats remain available across a broad swath of games, including for marquee matches such as PSG versus Atlético Madrid, although some teams like Real Madrid have proven to be bigger draws. Even the final match on July 13 has yet to sell out.\nControversially, FIFA implemented dynamic pricing and initially started selling tickets at prices that were considered too high for many fans — such as $100-$200 for group games. But FIFA has since slashed prices, while introducing promotions to boost sales.\nTake the opening game on Saturday. To avoid having big chunks of empty seats, FIFA dropped prices and collaborated with Miami Dade College to offer up to four complementary tickets for fans who buy a single one for $20, meaning a cost of just $4 per person to see Messi, according to an email seen by NPR.\nFIFA's Infantino has tried to manage expectations, telling media he believes more fans will get interested once play gets underway.\nThat may be FIFA's big hope — because so far, the unveiling of the Club World Cup has been bumpy.\nCopyright 2025 NPR",
  "word_count": 1035,
  "scraped_at": "2026-02-14T02:15:31.420241",
  "_text_extracted": true
}