{
  "article_id": "7262945dab16",
  "url": "https://www.caughtoffside.com/2025/04/24/united-matheus-cunha-transfer/",
  "title": "Man United determined to finalise Matheus Cunha transfer",
  "date": "20250424T160000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are reportedly determined to finalise a transfer deal for Wolves forward Matheus Cunha, with just details needing to be sorted out.\nIt seems the Red Devils are making real progress on signing Cunha, following the Brazil international’s eye-catching form in the Premier League this season.\nSee below for the latest on the deal, with journalist Florian Plettenberg explaining that Man Utd recently made Cunha more of a concrete target, and are now determined to get this signing over the line…\n?? Matheus #Cunha had been on Manchester United’s list for a long time, but only a few weeks ago was he identified as a concrete transfer target. #MUFC\nMan United are determined to finalise the deal for the summer, though details still need to be clarified. The player is ready… pic.twitter.com/6wVTFSMj4n\n— Florian Plettenberg (@Plettigoal) April 24, 2025\nCunha has also been linked strongly with United by Fabrizio Romano.\nPosting earlier on about this deal, Romano made it clear that MUFC were feeling optimistic about bringing in the 25-year-old, as a lack of Champions League football at Old Trafford wouldn’t be an issue for him…\n? Manchester United mantain optimism for Matheus Cunha deal as the club feels he really wants the move.\nUCL football not expected to be a factor with Cunha keen on the move, as Man United would be ready to pay £62.5m clause in installments if Wolves approve.\nTalks continue. ?? pic.twitter.com/LcYrcLkxct\n— Fabrizio Romano (@FabrizioRomano) April 24, 2025\nMatheus Cunha looks set for Man Utd transfer, but could he do better?\nCunha has an impressive record of 16 goals and four assists so far this season, and his all-round ability makes him look like he could be a good fit for a number of top clubs.\nA recent report from talkSPORT claimed that Arsenal had also registered an interest in Cunha, and the Gunners would surely be a better option for the player.\nUnited are a big name, but they’re going through a bit of a crisis at the moment, whereas Arsenal have challenged for the Premier League title for three years in a row and are now in the Champions League semi-finals.\nCunha may well be keen to get out of Wolves and move on to bigger things, but there’s no guarantee he’d really be able to fulfil his ambitions at United.\nRuben Amorim will no doubt hope he can turn things around after a difficult start, but it looks like an incredibly difficult job for the Portuguese tactician.",
  "word_count": 417,
  "scraped_at": "2026-02-14T01:58:31.706508",
  "_text_extracted": true
}