{
  "article_id": "726acff18c7d",
  "url": "https://www.themag.co.uk/2024/05/bigger-clubs-will-have-their-eye-on-him-bruno-guimaraes-newcastle-united/",
  "title": "Bigger clubs will have their eye on him … ",
  "date": "20240505T163000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bigger clubs will have their eye on him…\nWhilst watching on TV our merry men running rampage at Turf Moor yesterday (obviously, er I’m on holiday and haven’t got a hooky box, your Honour), I listened to the two commentators spout their usual bias and slanted mutterings.\nIt is irksome to anyone of our tribe to witness the sheer antipathy towards Newcastle United from the septic six and various media outlets.\nPart of me looks upon it in a positive light, telling myself that its because of the fear factor, that they know we have the financial clout and an outstanding team in the real sense of the word.\nThe other side of me, devil on the shoulder if you like, just gets piqued at the arrogance and indeed ignorance at some of the comments.\nThe commentator in question was talking about Bruno Guimaraes as the camera was on him chewing his gum and focused as always in the zone, and actually said, “They’ll do well to keep him, as bigger clubs will have their eye on him.”\nBigger clubs?\nLike who?\nWhy would he want to leave to go elsewhere when we are on the cusp of great things; enviable ownership, and a great manager who believes in him and the greatest support on the planet who incidentally adore the ground he walks on?\nThis muppet obviously either wasn’t aware of the new contract just signed and Bruno’s own position – which we all take at face value his commitment to United, not to mention his flag salute and general all-round obvious love for our club.\nLeaving that particular individual example aside, there does seem to be an undercurrent of dislike – or maybe it actually is envy towards Newcastle United.\nThe FFP farce that is now going to be changed to accommodate the ‘haves’ and widen the gap of the ‘have nots’ is a case in point.\nMust not upset the so called ‘big’ six.\nThe other annoyance is lazy journalism which has repeatedly blamed Champions league football and our supposed lack of depth in our squad in our falling out of the top four.\nI’m only permitted to say politely, what a load of rubbish.\nDoes anyone really think that if Man City lost De Bruyne, Haaland, and Foden from their squad and maybe Kyle Walker for most of the season, would they be at their best?\nHow would their squad cover those cracks?\nVan Dijk, Salah and Nunez at Liverpool the same?\nRashford, Maguire? Well, yes I’ll give you that, they probably might be better, but you get my drift.\nThis season has proved one thing, we are United as one and the injury crisis (‘unprecedented’ is a word that has been used often, and it is most apt, as never before has a squad been so ravaged by medical ailments to our players, some have been bizarre and freakish in nature), has galvanised the bond in the dressing room.\nThe positive outcome out of all of this is we will be stronger than ever and with the return to our ranks of the recovered troops and the prospect of Tonali returning to the fore next season, the future looks exciting.\nI truly believe, wait for it, if we had our full squad with ‘normal’ injuries this season, we would have been challenging not just for Champions League qualification, but for the league itself.\nThere, I’ve said it, and I mean it.\nHome and away we hammered Villa who sit above us, we beat Lego man as his team sit at the top of the league as I write, and we beat Man City, albeit in the League Cup, and gave them a good run for their money even with a depleted team in the league, and we played Klippety Klopp’s team off the park only for two breakaway goals to give them a thoroughly undeserved victory.\nBy the way, I haven’t forgotten about Lego man’s pathetic protestations when we beat them fair and square, and the subsequent vomit inducing let off when he claimed that when he said the decisions were a ‘disgrace’, it meant something different in Spanish.\nIt would be funny if it wasn’t so annoying, the blatant one-sidedness from the FA, as we are not in Spain, he was speaking English and not Spanish, and everybody knows fine well what he meant and what he should have been punished for.\nIf ever Eddie needed ammunition to rile the lads before each and every game, this siege mentality has reasonable justification, they really don’t want us to succeed, that much is obvious to all.\nEuropean qualification looms on the horizon, an outstanding prospect considering the aforementioned injuries to our personnel in a torrid season, and a tribute to all of the coaching staff, the many players who played through the pain whilst clearly not fully fit, and to our magnificent and unequalled support who dragged the battered and fatigued to the final whistle at each and every turn.\nThere’s only one United and they play in black n white.\nHTL\nStats via BBC Sport:\nBurnley 1 Newcastle 4 – Saturday 4 May 3pm\nGoals:\nNewcastle United:\nWilson 19, Longstaff 35, Bruno 40, Isak 55\nBurnley:\nO’Shea 86\n(Half-time stats in brackets)\nPossession was Burnley 46% (52%) Newcastle 54% (48%)\nTotal shots were Burnley 17 (8) Newcastle 23 (15)\nShots on target were Burnley 5 (3) Newcastle 11 (6)\nCorners were Burnley 4 (3) Newcastle 11 (5)\nReferee: Anthony Taylor\nNewcastle team v Burnley:\nDubravka, Livramento, Krafth, Burn, Hall, Longstaff (Joelinton 77), Bruno, J Murphy (Anderson 69), Gordon (Ritchie 85), Isak (Almiron 77), Wilson (Barnes 69)\nUnused subs:\nPope, Dummett, White, A Murphy\n(Match Report – An early train over to Burnley and a confession… Read HERE)\n(Embarrassing – BBC Sport pundit comments before AND then on the Burnley 1 Newcastle 4 reality – Read HERE)\n(This is excellent from Vincent Kompany after Burnley 1 Newcastle 4 thrashing – Read HERE)\n(Burnley 1 Newcastle 4 – Instant Newcastle fan / writer reaction – Read HERE)\n(Newcastle United class blows the Clarets away – Burnley 1 Newcastle 4 – Read HERE)\nNewcastle United matches now confirmed for rest of the season:\nSaturday 11 May 2024 – Newcastle v Brighton (3pm)\nWednesday 15 May 2024 – Man U v Newcastle (8pm) Sky Sports\nSunday 19 May 2024 – Brentford v Newcastle (4pm)\n(The final day of the season live TV matches will be selected closer to the day but all 10 PL games will be same time same day)\nWednesday 22 May 2024 – Tottenham v Newcastle (at MCG – Melbourne Cricket Ground)\nFriday 24 May 2024 – A-League All Stars team v Newcastle (at Marvel Stadium, Melbourne)\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1136,
  "scraped_at": "2026-02-14T01:48:52.527563",
  "_text_extracted": true
}