{
  "article_id": "72735bb7907a",
  "url": "https://www.uefa.com/uefaeuropaconferenceleague/news/027d-170998f73681-aeade33d4225-1000--aek-larnaca-vs-dnipro-1-facts/",
  "title": "AEK Larnaca vs Dnipro - 1 match facts | UEFA Europa Conference League",
  "date": "20230111T001500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AEK Larnaca vs Dnipro-1 facts\nTuesday, January 10, 2023\nArticle summary\nPrevious meetings, form guides, links and trivia ahead of the first leg of the UEFA Europa Conference League knockout round play-off tie.\nArticle top media content\nArticle body\nAEK Larnaca, Cyprus's lone remaining participants in this season's European club competitions, will hope to deliver an encore in the UEFA Europa Conference League knockout play-offs against a Dnipro-1 side they have already defeated this season.\nHaving beaten Dnipro-1 in the UEFA Europa League qualifying play-offs, AEK went on to finish third in their group, behind Fenerbahçe and Rennes but ahead of another Ukrainian opponent, Dynamo Kyiv, to secure springtime European football for the first time. Dnipro-1, who finished second in UEFA Europa Conference League Group E, are also in uncharted territory, this being their debut season in UEFA competition.\nPrevious meetings\nDnipro-1's very first European tie was against AEK last August, and the Cypriot side won both matches. Omri Altman and Hrvoje Milićević put them two goals up before Oleksandr Svatok's late reply in a 2-1 first-leg win in Košice, and the tie was wrapped up a week later as AEK cruised to a 3-0 win in Larnaca, Ádám Gyurcsó, Rafael Lopes and Nikos Englezou all finding the net.\nThose were AEK's first UEFA meetings with Ukrainian opposition, and two more soon followed in the group stage as they overcame Dynamo 1-0 in Kraków on Matchday 2 with another Gyurcsó strike before surrendering a 3-1 lead to draw the Matchday 5 return 3-3, Altman scoring twice and Lopes once.\nDefeated twice by AEK, Dnipro-1 fared considerably better when they took on another Cypriot club in their UEFA Europa Conference League group, beating Apollon Limassol in both matches – 3-1 away with goals from Valentyn Rubchynskyi and Artem Dovbyk (two) and 1-0 at home thanks to an Oleksandr Pikhalonok strike.\nForm guide\nAEK\nAbsent from Europe in 2020/21 and 2021/22, AEK made it back in 2022/23 by finishing second to Apollon, four points behind the champions, in last season's Cypriot top flight. They have never won their domestic title, finishing runners-up five times.\nAEK returned to continental competition in the UEFA Champions League second qualifying round under new head coach José Luis Oltra, but were eliminated on penalties by Midtjylland. They recovered to win two UEFA Europa League qualifying ties against Partizan (2-1 h, 2-2 a) and Dnipro-1 and reach the group stage for the third time. As in 2011/12 and 2018/19, they again registered five points – four against Dynamo and the other on Matchday 6 at Rennes (1-1) – but on this occasion, unlike the previous two, they kept their European season alive by crossing over into the UEFA Europa Conference League.\nAEK were unbeaten in Cyprus in six European matches (W4 D2) before losing 1-2 to Rennes on Matchday 1 – and then succumbing by the same scoreline to Fenerbahçe on Matchday 4. They have won just one of their ten European home fixtures outside the qualifying phase (D4 L5) – 2-1 against Maccabi Haifa in the 2011/12 UEFA Europa League group stage.\nDnipro-1\nPlaced third when the 2021/22 Ukrainian Premier League was abandoned in April, Dnipro-1 are competing in Europe for the first time. The club has no official historical connection to the defunct Dnipro Dnipropetrovsk, UEFA Europa League runners-up in 2014/15.\nHaving lost their UEFA Europa League qualifying play-off to AEK, Oleksandr Kucher's side went on to finish runners-up to AZ Alkmaar in their UEFA Europa Conference League group. Defeated twice by the Dutch section winners (0-1 h, 1-2 a), they took four points off fellow European group stage debutants Vaduz (2-2 h, 2-1 a) in addition to the maximum six off Apollon.\nThe Ukrainian club have won two and lost two of their four European away fixtures.\nUEFA Europa Conference League squad changes\nAEK Larnaca\nIn: Ismael Casas, Marin Jakoliš (Angers, loan), Nemanja Nikolić (Pendikspor)\nOut: Miloš Gordić, Victor Olatunji (Slovan Liberec, loan), Theodosis Siathas (Doxa Katokopias, loan), Bruno Gama\nDnipro-1\nIn: João Peglow (Internacional, loan), Rónald Matarrita (Cincinnati), Hayner Monjardim (Azuriz, loan)\nOut: Gabriel Busanello (Chapecoense, end loan), Artem Gromov (AEK Larnaca), Serhiy Loginov (Oleksandriya), Valerii Yurchuk\nLinks and trivia\nGyurcsó and Svatok played together in Croatia for Hajduk Split in 2019.\nAEK's Imad Faraj and Dnipro-1's Seddik Fares Bahlouli were team-mates at LOSC Lille between 2016 and 2019.\nAs a defender for Shakhtar Donetsk, Dnipro-1 boss Kucher came up against Cypriot side APOEL in the 2011/12 UEFA Champions League group stage. Despite a 1-1 home draw and 2-0 away win, Shakhtar would finish bottom of the group and APOEL top. Current AEK captain Ivan Tričkovski scored APOEL's goal in the 1-1 draw in Donetsk.\nUkraine international Dovbyk was the top scorer in the UEFA Europa Conference League group stage with five goals.\nThis tie is one of only two in the UEFA Europa Conference League knockout play-offs not involving a reigning domestic champion – the other Braga versus Fiorentina.\nAEK and Dnipro-1 both currently lead their domestic title races, the former by two points from APOEL thanks to a 15-game unbeaten run (W13 D2), the latter by five points from both Shakhtar Donetsk and Dynamo Kyiv.",
  "word_count": 863,
  "scraped_at": "2026-02-14T02:16:35.984385",
  "_text_extracted": true
}