{
  "article_id": "72a4b9bff3da",
  "url": "https://metro.co.uk/2023/04/25/thomas-frank-hails-frank-lampard-and-clear-favourites-chelsea-18673491/",
  "title": "Thomas Frank hails Frank Lampard and  clear favourite Chelsea",
  "date": "20230425T204500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brentford boss Thomas Frank has lauded Chelsea head coach Frank Lampard and has labelled the Blues as ‘clear favourites’ for their west London derby.\nLampard returned to Stamford Bridge for his second managerial stint at the club earlier this month following the sacking of Graham Potter.\nIt has been a horrific start for the former midfielder with Chelsea losing all four games under him thus far and crashing out of the Champions League.\nBut Frank has argued that Lampard has improved Chelsea and says the Blues are still favourites heading into Wednesday’s meeting with the Bees at Stamford Bridge, despite Brentford being higher than them in the Premier League table.\n‘I think we all know that Chelsea have been struggling a little bit this season,’ Frank said on Tuesday.\n‘[They have] very good players. I know they haven’t won, but I think clearly in the four games [Lampard] has been in charge they are playing with bigger energy, more intensity on the eye and also on the numbers.\n‘It’s top players, and at the end of the day they bought players for £600 million in the past two transfer windows and they haven’t forgotten how to play football.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nMore Trending\n‘Sometimes it takes one moment. Now they had a good week to work with them at Stamford Bridge. They are clear favourites of course. They should be. But we hope and believe that we can do something.’\nBrentford sit one spot above 11th-placed Chelsea – who are five points behind Frank’s side – although the Bees have played one game more.\nThe sides played out a 0-0 draw in the reverse fixture at the Gtech Community Stadium in October.\nMORE: Frank Lampard issues blunt response to Thiago Silva's criticism of Chelsea's owners\nMORE: Frank Lampard gives brutal update on Reece James and Mason Mount",
  "word_count": 358,
  "scraped_at": "2026-02-14T01:55:54.935427",
  "_text_extracted": true
}