{
  "article_id": "72a411424a09",
  "url": "https://www.90min.com/posts/fabio-carvalho-joins-rb-leipzig-loan-liverpool",
  "title": "Fabio Carvalho joins RB Leipzig on loan from Liverpool",
  "date": "20230630T161500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Fabio Carvalho joins RB Leipzig on loan from Liverpool\n- Carvalho signed for Liverpool from Fulham in 2022\n- Failed to make meaningful impact in debut season and leaves on loan for 2023/24 campaign\n- Liverpool still in talks with RB Leipzig over Dominik Szoboszlai\nBy Sean Walsh\nFabio Carvalho has joined RB Leipzig on loan from Liverpool for the 2023/24 season.\nThe 20-year-old moved to Liverpool from Fulham last summer but was sparingly used in his debut campaign at Anfield, despite showing signs of immediate promise upon his arrival.\n90min revealed in April that the Reds would consider letting him leave on loan in search of first-team football for the new season but would not sanction a permanent exit - 90min further reported last Friday that an agreement was in place with RB Leipzig.\nAnd a dry loan to the Bundesliga was confirmed by both clubs on Friday afternoon.\nCarvalho said: \"As a young player, it's a big step for me to move from England to the Bundesliga and RB Leipzig. I'm joining a strong side, one that has been very successful in recent years. Now, I want to help build on this and am looking forward to taking on a new challenge.\n\"My goal is to play as much as possible, in the league, the cup and especially in the UEFA Champions League. RB Leipzig have a reputation for giving young players these kinds of opportunities, which is why this is the perfect club for me to continue my development at.\"\nREAD THE LATEST LIVERPOOL NEWS, TRANSFER RUMOURS & GOSSIP\nRB Leipzig board member Max Eberl said: \"Fabio Carvalho is a huge talent - the fact that Liverpool signed him recently just proves that. He is quick, agile, full of tricks and creative. He likes to get shots away and can also set his teammates up.\n\"We will give Fabio the time he needs to settle in here and to adjust to life in a new country and with a new club. We are looking forward to him improving our attacking game and to have another option in this department.\"\nMeanwhile, 90min understands that Liverpool are advancing talks with RB Leipzig over midfielder Dominik Szoboszlai, with contact also made for promising Celta Vigo midfielder Gabri Veiga.\nLISTEN NOW\nOn this week's edition of Talking Transfers, part of the 90min podcast network, Scott Saunders is joined by Toby Cudworth, Graeme Bailey and Sean Walsh to discuss Tottenham's denial of receiving a bid from Bayern Munich for Harry Kane, Arsenal and Manchester City's tug of war for West Ham captain Declan Rice, Man Utd's ongoing pursuit of Mason Mount & more!\nIf you can't see this embed, click here to listen to the podcast!",
  "word_count": 454,
  "scraped_at": "2026-02-14T01:50:37.766838",
  "_text_extracted": true
}