{
  "article_id": "72d2c23391b0",
  "url": "https://thepeoplesperson.com/2023/04/05/manchester-united-among-trio-of-clubs-ready-to-pounce-for-west-hams-nayef-aguerd-262114/",
  "title": "Manchester United among trio of clubs ready to pounce for West Ham Nayef Aguerd",
  "date": "20230405T154500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The demoralising defeat at the hands of Newcastle further dented Manchester United’s chances of finishing in the Champions League positions and reinforced the notion that the club needs to strengthen defensively ahead of next season.\nHome form aside, the Red Devils have struggled away from home against teams from the top half of the Premier League table and Erik ten Hag has decided to offload quite a few defenders in order to raise capital to strengthen the squad,\nFormer incumbents Victor Lindelof and club skipper Harry Maguire are slated to be let go this summer and that would necessitate the club to bring in another centre-back as cover.\nUnited need to strengthen defensively\nThe 20-time English league champions have been linked with quite a few names including the likes of Kim Min-jae of Napoli, Ajax star Jurrien Timber and Portuguese ace Goncalo Inacio.\nThe latest name to join the list is Nayef Aguerd of West Ham. The Moroccan has not hit the heights expected of him mainly due to an ankle injury he suffered early on in the season.\nBut he is slowly starting to show why the Hammers forked out €35million to Stade Rennais FC for the defender. He recently scored his first goal for the club in an important 1-0 win over Southampton.\nHis return from injury has coincided with an up turn in form for the London side who have lost only three games since the Morocco international rejoined the squad.\nAccording to Jeunes Footeux, Aguerd’s recent performances coupled with his ability to play on the left of the back two due to him being left-footed is a major attraction for the likes of United, Liverpool and Tottenham.\n“Performances by Nayef Aguerd which caught the eye of several big Premier League teams. Indeed, Manchester United , Tottenham and Liverpool closely follow the services of the Moroccan international.\n“A profile all the more interesting and rare, as the 3 clubs are looking for a left-handed central defender,” the report mentioned.\nUnited among trio of clubs chasing Aguerd\nWhile the Merseyside club are preparing for the probable departure of Joel Matip, Tottenham are on the lookout for a replacement for Clément Lenglet.\nUnited’s backup options have been deemed to be not good enough as the go-to defensive partnership of Raphael Varane and Lisandro Martinez.\nAnd getting a solid backup option for the Argentine World Cup winner would be a smart addition to make from an United point of view.\nThe report mentions that the Hammers could be inclined to sell the star for €55-60million, in order to remain clear of FFP issues after they splurged in the summer hoping for European football next season.\nCurrently, David Moyes’ side are languishing at 15th spot and are in danger of getting relegated and even if they do manage to steer clear, they will need to raise capital and Aguerd could be one player to make way.\nFollow The Peoples Person on Twitter or Instagram for all the latest news as it happens and to join in the conversation.",
  "word_count": 507,
  "scraped_at": "2026-02-14T01:59:46.866772",
  "_text_extracted": true
}