{
  "article_id": "72d246448c55",
  "url": "https://www.fourfourtwo.com/news/toni-kroos-honoured-adidas-after-euro-2024-farewell-germany",
  "title": "Toni Kroos honoured by Adidas after Germany Euro 2024 exit",
  "date": "20240706T174500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nToni Kroos bowed out on Friday as his glittering career on came to an end with Germany's extra-time defeat to Spain in the quarer-finals of Euro 2024.\nKroos announced in May that he would be hanging up his boots, come what may, at the end of the season and after signing off in perfect fashion on the club stage courtesy of a La Liga and Champions League double with Real Madrid, and he had hoped his last act on a football pitch would be to help Germany win the European Championship on home soil.\nThat was not to be for the 34-year-old, as it was Spain who booked a semi-final spot against France in Munich on Tuesday night.\nVIDEO Why Spain Have The PERFECT System To Win The Euros\nThat means time has been called on a career that saw the midfielder win seven league titles and six Champions Leagues during his time at Bayern Munich and then Real Madrid, plus a World Cup with Germany in 2014.\nKroos will go down as one of the most influential midfielders of his generation and German sportswear manufacturers Adidas have moved to honour the player in their own special way.\nThey have announced that their 11pro football boots, worn by Kroos for the past decade, will now be renamed the TKpro boot in his honour.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“It was love at first sight for Toni Kroos and the adidas 11pro football boots,” the firm said in a statement confirming the news.\n“For the last ten years, Toni has famously won all there is to win in football in his favourite pair of boots, making them the ‘most successful pair of football boots ever’.\n“As Toni and the 11pro have been sole mates for a decade, one can’t retire without the other, and loyalty in the beautiful game deserves to be inscribed in the history of the player and the brand, permanently.”\nGet a free live stream to watch Euro 2024 from anywhere in the world and catch the final stages of the summer's big tournament\nMore Euro 2024 stories\nFarewell, Toni Kroos: one of the greatest there ever was\nSpain vs Germany: Florian Wirtz becomes the first to do one thing at Euro 2024\n'IT'S EMBARRASSING! I wonder if he has kids watching': Ally McCoist slams Nacho during Spain's win over Germany\nFor more than a decade, Joe Mewis has worked in football journalism as a reporter and editor. Mewis has had stints at Mirror Football and LeedsLive among others and worked at FourFourTwo throughout Euro 2024, reporting on the tournament. In addition to his journalist work, Mewis is also the author of four football history books that include times on Leeds United and the England national team. Now working as a digital marketing coordinator at Harrogate Town, too, Mewis counts some of his best career moments as being in the iconic Spygate press conference under Marcelo Bielsa and seeing his beloved Leeds lift the Championship trophy during lockdown.",
  "word_count": 619,
  "scraped_at": "2026-02-14T02:08:01.883195",
  "_text_extracted": true
}