{
  "article_id": "72d7dd8742a5",
  "url": "https://www.teamtalk.com/news/neymar-barcelona-return-talks-joan-laporta-hansi-flick-stance",
  "title": "Neymar : Brazil icon holds Barcelona return talks with Joan Laporta as Hansi Flick stance emerges",
  "date": "20250215T200000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Neymar holds Barcelona return talks with Joan Laporta as Hansi Flick stance emerges\nNeymar has been in contact with Barcelona president Joan Laporta over a sensational return to the Camp Nou, though a report claims head coach Hansi Flick is not keen on the potential transfer.\nNeymar cancelled his Al-Hilal contract by mutual consent in January after a disastrous spell in Saudi Arabia where he was ravaged by injury. Al-Hilal paid Paris Saint-Germain an initial fee of €90million (£77.6m) to sign the forward in August 2023, but he never came close to living up to expectations.\nFollowing just seven games and one goal for Al-Hilal, Neymar has returned to Santos on a six-month contract.\nThe Brazil hero has captained Santos in his last two appearances for the club, but he has yet to register his first goal since re-joining.\nBut reports have claimed that Neymar is ultimately eyeing a return to Barcelona in the near future.\nAccording to Barcelona reporter Joan Fontes (via Get Spanish Football News), Neymar is hoping to sign a pre-contract agreement with the Blaugrana ahead of joining the club on a free transfer this summer.\nNeymar has supposedly held positive talks with Laporta, and the Barca chief is open to his return if the 33-year-old can prove he is in good fitness.\nHowever, not all at Barca are in agreement about Neymar returning. Flick is understood to be prioritising different targets as he feels Neymar is past his best.\nThis update comes after it emerged on Friday that Neymar’s ‘plan’ is to prove his worth at Santos to try and convince Barca to re-sign him.\nREAD NEXT: Barcelona eye player-plus-cash deal for deadly striker, as shock Atletico Madrid claim emerges\nBarca should steer clear of Neymar reunion\nNeymar is a hero at Barca, having first joined the club in 2013 and gone on to form arguably the most devastating forward trio of all time with Lionel Messi and Luis Suarez.\nNeymar scored 105 goals in 186 appearances for the Catalan giants and helped them win trophies such as the Champions League and La Liga title.\nDespite Neymar’s ridiculously good first spell at Barca, Flick does seem to be correct in this instance. The player has struggled to stay fit over the last two years and may therefore end up being a costly mistake for Barca, who are already operating on a tight budget.\nPlus, it would be an insult to Santos if Neymar only played for them for six months before leaving a second time.\nThe 128-cap international remains the most expensive player of all time, having left Barca for PSG in a €222million (£200m) deal back in August 2017.\nBarcelona transfers: Defender signing ‘close’\nMeanwhile, Mundo Deportivo claim Jonathan Tah is ‘on track’ to becoming Barca’s first signing of the summer.\nBarca are ‘close’ to reaching a contract agreement with Tah as he prepares to leave Bayer Leverkusen on a free transfer.\nThe Germany international is poised to replace Andreas Christensen in Flick’s squad.",
  "word_count": 499,
  "scraped_at": "2026-02-14T01:52:15.337494",
  "_text_extracted": true
}