{
  "article_id": "72d92b473cff",
  "url": "https://economictimes.indiatimes.com/news/international/us/karim-benzema-to-leave-real-madrid-for-saudi-pro-league-club-all-we-know-so-far/articleshow/100686056.cms",
  "title": "Karim Benzema : Karim Benzema to leave Real Madrid for Saudi Pro League club ? All we know so far",
  "date": "20230601T190000Z",
  "domain": "economictimes.indiatimes.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Benzema, who has been at Real Madrid for 14 years, was earlier agreed to a verbal deal with Real Madrid. As per the verbal deal the footballer would have stayed at the club till 2024, according to reports.\nThere are rumours that Benzema may sign three-year deal with Saudi Pro League club Al Ittihad. If the deal is materialized then Benzema is expected to earn around €100 million per year.\nThere are reports that Benzema had talks with Cristiano Ronaldo who is currently playing in Saudi Pro League with Al Nassr.\nBenzema joined Real Madrid from French Ligue 1 club Lyon in 2009. Benzema has scored 353 goals for the Spanish club.\nBenzema secured a total of 25 titles with Real Madrid. The list of silverware includes five UEFA Champion Trophy and four league titles.\nBenzema was awarded Ballon d’Or award last year after he scored 44 goals to help Real Madrid win UEFA Champions League, La Liga, and Super Cup in the 2021/22 season.\nCristiano Ronaldo's first season in Saudi Arabia ended with a whimper, but with hundreds of millions in wages and unprecedented attention on Saudi football he may not be the last megastar to grace the oil-rich kingdom.\nlast week Ronaldo backed the Saudi Pro League to become one of the best in the world. \"Step by step, I think this league will be a top-five league in the world,\" he said in a post-match interview.\nFAQ\nQ1. Is Karim Benzema leaving Real Madrid?A1. Karim Benzema will reportedly leave Real Madrid.\nQ2. Has Karim Benzema won Ballon d’Or award?\nA2. Karim Benzema has won Ballon d’Or award.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.\n(Catch all the US News, UK News, Canada News, International Breaking News Events, and Latest News Updates on The Economic Times.)\nDownload The Economic Times News App to get Daily International News Updates.",
  "word_count": 336,
  "scraped_at": "2026-02-14T01:48:17.242343",
  "_text_extracted": true
}