{
  "article_id": "72d9ac6582fb",
  "url": "https://news.yahoo.com/want-bounce-back-patrick-vieira-143018021.html",
  "title": "  They will want to bounce back  – Patrick Vieira wary of Liverpool backlash",
  "date": "20230224T150000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool will ‘want to bounce back’ against Crystal Palace, warns Patrick Vieira\nPatrick Vieira ruled out seeing Liverpool’s midweek meltdown in the Champions League as a potential benefit when Crystal Palace host the Reds at Selhurst Park.\nJurgen Klopp’s men were up 2-0 inside 15 minutes in the first leg of their last-16 clash with Real Madrid on Tuesday, but the Spanish side staged a stunning comeback to win 5-2.\nThat might seem to some a boon to Palace, still looking for their first victory of 2023, but Vieira cautioned against placing too much emphasis on the eighth-placed Premier League’s side most recent outing.\n“I don’t think this is the best time to play them,” he said. “I think when you’re talking about Liverpool Football Club, with what they have achieved in the last couple of years, looking at the quality of players that they have, they will want to bounce back straight away.\n“There is no good time to play Liverpool. But on the other side, our performances in the last couple of games, especially at home with the support that we have, has been positive. So what is important for us is to turn those performances into a win.”\nPalace have struggled to find the back of the net this campaign, scoring just 21 goals across 23 Premier League contests.\nWilfried Zaha still leads the team with six, despite his absence from the squad after sustaining a hamstring injury against Newcastle in late January.\nThe Eagles talisman trained with the team this week, although Vieira said a decision on the winger’s availability will need to wait until the day of the game.\nPalace seemed destined to pick up all three points at Brentford last time out until Vitaly Janelt equalised in the sixth minute of second-half stoppage time.\nAlthough the 12th-placed Eagles have created chances, few have resulted in much-needed goals in close contests, something Vieira admitted was beginning to affect his players’ mentality.\n“I think it’s just a lack of confidence at the moment,” he said. “The lack of belief. I think it’s important for us to continue creating those chances and keep working hard in training and try to score those goals, because moments of the game are really important to take those chances.”",
  "word_count": 378,
  "scraped_at": "2026-02-14T01:59:41.700822",
  "_text_extracted": true
}