{
  "article_id": "72e3f8b25c2f",
  "url": "https://www.teamtalk.com/liverpool/arne-slot-distraught-liverpool-starter-agrees-terms-barcelona-transfer",
  "title": "Liverpool transfer news : Slot distraught as Reds starter agrees Barcelona deal",
  "date": "20250603T173000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nArne Slot distraught as Liverpool starter agrees Barcelona switch\nA regular Liverpool starter Arne Slot does not want to lose has agreed personal terms with Barcelona, though the player the Reds could sign as his replacement will certainly perk the manager up, according to reports.\nLiverpool have already lost one key component of their title-winning team to a Spanish giant this summer. Trent Alexander-Arnold will line up for Real Madrid and with the Club World Cup less than a fortnight away, he’ll not have long to wait before making his debut.\nAccording to a fresh update from Mundo Deportivo, Alexander-Arnold could now come up against a former Liverpool teammate in future El Clasicos.\nThey state Luis Diaz – who started 28 of 38 Premier League matches this season – ‘agrees with Barca on the terms of his signing.’\nThe Colombian is understood to have informed Liverpool via his agent that he will not sign a contract extension at Anfield. Instead, and despite the vast riches on offer from Saudi Arabian side Al-Nassr, Diaz now wants one thing – to sign for Barcelona.\nDiaz’s exit would not come as a major shock given it has been reported throughout 2025 that the 28-year-old has serious chances to leave Liverpool this summer.\nHowever, it would be a blow for manager Arne Slot who CaughtOffside previously insisted does not want to lose his versatile forward.\nDiaz produced his best season to date in a Liverpool shirt this year, notching 25 goal contributions (17 goals, eight assists) across all competitions.\nHis positional flexibility allowed him to operate at a high level in both the left wing and striker positions and his high defensive workrate offsets the relatively free pass Mohamed Salah gets on the right side.\nNonetheless, CaughtOffside stated Liverpool would find it difficult to turn down bids of around €80m. Reporter Ben Jacobs more recently stated €85m will be enough to seal a deal.\nThose types of figures are easily achievable for Al-Nassr who hope to make superstar signings in an attempt to convince Cristiano Ronaldo to stay.\nFinancing a move on that scale will be much for difficult for Barcelona, with MD adding director Deco hopes to strike a deal for ‘considerably less’.\nDiaz has two years remaining on his contract, though if the report is accurate, he will not pen fresh terms.\nAs such, the clock is ticking on Liverpool and Diaz’s transfer value will only decrease the closer he gets to free agency.\nThere is no suggestion Liverpool will cash in on the cheap, though if Diaz is to realise his dream of playing for Barca, the Reds will have to accept a fee some way below what Al-Nassr can pay.\nRafael Leao to Liverpool?\nLiverpool have signed Jeremie Frimpong and are closing in on Milos Kerkez and Florian Wirtz too.\nA new centre-back is also wanted, as is a starting striker once Darwin Nunez has been offloaded.\nIf Diaz were to depart, a new left winger would be sought and TuttoMercatoWeb state Liverpool have taken tentative first steps towards signing Rafael Leao as the Colombian’s successor.\nAfter detailing Bayern Munich’s interest in the AC Milan ace, TMW added: ‘In the last few hours, however, Liverpool has made an important survey.’\nMilan reportedly have ‘no intention’ of accepting bids for the 39-cap Portugal international. But as is so often the case in football, money talks.\nTMW concluded an offer of €130m / ££109.5m would be enough to get a begrudging green light from Milan.\nOf course, Liverpool would attempt to negotiate a much more palatable sum and would only ramp up their pursuit if Diaz does depart. For that to happen, Barcelona must send a convincing offer to Anfield.\nA different left winger Liverpool hold long-standing interest is Newcastle’s Anthony Gordon.\nBut as the Reds have found with Alexander Isak, signing Newcastle’s best players will not be easy now they’ve secured Champions League football.\nLatest Liverpool news – Signing No 2 agreed? / Wirtz developments and more…\n🔴 Liverpool strike ‘full agreement’ for signing No 2 who’ll spark fan favourite’s sale\n🔴 Liverpool ‘agree’ Florian Wirtz contract – but swap deal ‘no longer being considered’\n🔴 The five Liverpool targets most heavily linked with Anfield transfers after Jeremie Frimpong",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:52:26.349354",
  "_text_extracted": true
}