{
  "article_id": "7304ee965f2d",
  "url": "https://metro.co.uk/2025/05/23/chelsea-begin-talks-sign-60million-premier-league-striker-23231029/",
  "title": "Chelsea begin talks to sign €60million Premier League striker",
  "date": "20250523T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have indicated they are willing to submit a €60m offer in an effort to sign Brighton striker Joao Pedro before the FIFA Club World Cup.\nThe Blues’ immediate focus is on Sunday’s showdown against Nottingham Forest where a positive result would secure Champions League football.\nChelsea’s attention will then turn to Wednesday’s Conference League final against Real Betis but an already overworked group of players will enjoy little more than a fortnight off before FIFA’s inaugural club competition gets underway in America.\nA special transfer window will run between June 1 and June 10 which will permit teams involved in that tournament, which also contains the likes of Real Madrid and Manchester City, to conduct business.\nChelsea would, according to Globo, ideally, like to wrap up a deal as soon as possible and ensure the 23-year-old, who has scored 10 goals this season, was eligible to play against Flamengo on June 20.\nBrighton boss Fabian Hurzeler, meanwhile, has revealed that Pedro and Georginio Rutter will not be involved in Sunday’s clash against Tottenham.\nRutter has been sidelined with an ankle injury and Hurzeler confirmed that Sunday’s game comes too soon.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPedro has missed their last four matches after being shown a red card during the 4-2 defeat to Brentford on April 19.\nAfter serving a three-match ban, Pedro was not included in the squad for Monday’s 3-2 victory over champions Liverpool and will once again be absent from the squad to face Spurs, with Hurzeler adding that a ‘small issue’ concerning the forward in training is closed.\nHe told a press conference: ‘It will be the same squad we had (against Liverpool), so positive things. Georginio is not available. Unfortunately, he didn’t make it and we won’t risk anything. He will be back in pre-season.\n‘With Joao we had a small issue in training, the type which isn’t uncommon from time to time in all football clubs. We dealt with it internally and the matter is closed.\n‘Joao is an incredible football player, he’s a match-winner for us, he’s a great player and that’s why we invested in him.\nMore Trending\n‘But there are principles that are non-negotiable and counts for everyone – everyone has to stick – where we don’t make any compromises.\n‘Joao is still a young player. He will grow and I’m sure that he will learn from this and come back stronger next season. I’m really looking forward to seeing him renewed and reinvigorated at his highest peak into our team.\n‘Joao won’t be in the squad and the rest (of the team news) I think I said everything.’\nMORE: Thomas Tuchel names Chelsea star ‘steps ahead’ of Harry Maguire after England snub\nMORE: Champions League permutations for five Premier League clubs on final day tomorrow\nMORE: Enzo Maresca sends clear transfer message to Real Madrid amid Enzo Fernandez speculation",
  "word_count": 529,
  "scraped_at": "2026-02-14T02:02:47.543868",
  "_text_extracted": true
}