{
  "article_id": "7330d3fbf9da",
  "url": "https://theathletic.com/4529998/2023/05/19/paris-saint-germain-sergio-ramos/",
  "title": "Paris Saint - Germain , Sergio Ramos and the ghost of transfers past ( aka , Thiago Silva ) ",
  "date": "20230519T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Finding the right time to part ways with an ageing player is always a road littered with hindsight-laced potholes. Avoiding them is not easy. Paris Saint-Germain know this only too well.\nIn 2020, the French champions decided to part company with their captain, Thiago Silva. The Brazilian defender would leave PSG once his contract expired shortly after helping the club reach the Champions League final, which would end in defeat by Bayern Munich, and a month before turning 36. It was argued that it was the right time to disconnect from the past and move in a different direction.\nHindsight, of course, would cast a different light.\nSince his exit, Silva has shown that age is just a number at Chelsea. He has been their most consistent performer since his signing, even during the turbulence of this past season. He will be 39 in September but shows no sign of slowing down.\nAdvertisement\nSilva was reluctant to leave PSG, and felt particular regret at the time over how the move was handled. The long-time Brazil captain voiced this himself in an interview with France Football magazine. “I really didn’t like the way it was conducted,” he said. “Things should have been done differently.” He was unhappy with then-sporting director Leonardo, who asked him to stay for two extra months to complete that pandemic-extended season but nothing more.\nPSG then signed a 35-year-old Sergio Ramos a year later. He got the deal that Silva had wanted. “I have nothing against Sergio Ramos, but when he was offered a two-year deal he was the same age as me last year,” Silva told ESPN Brazil in an interview after Ramos moved from Real Madrid in the summer of 2021. “So it made me sad.”\nToday, PSG are at a similar crossroads about whether to extend Ramos’ contract.\nInitially, signing him looked like another misstep for PSG. The Spanish defender had won every trophy available to him during his 16 years with Madrid and when it comes to experience, he seemed a perfect fit for a Silva-shaped void. Yet the year of 2021 would prove to be a total write-off. Ramos suffered numerous injuries during the final stretch of the 2020-21 season and his move to Paris offered little reprieve. In the French capital he picked up where he left off in the Spanish one; injured, sidelined and out of the picture.\nRecurrent calf problems proved his undoing and former PSG defender Alain Roche described his transfer on leading French TV station Canal+ as a “failed bet”. The statistics back that up: Ramos made 13 appearances in all competitions that debut year and was only a limited part of the team’s Champions League campaign.\n“At first, having taken that leap, everything went wrong,” Ramos told UEFA.com earlier this year. “I got injured, had a hard time recovering and adapting to the new system, to the new team and new coach. You begin to doubt whether or not you’ve done the right thing. But my career has been defined by consistency, perseverance and hard work. You keep fighting and it will give things more meaning in the future.”\nAdvertisement\nThis season has been a different story. The summer was spent building up his strength and a full pre-season helped Ramos put those injury issues behind him. He began 2022-23 as a right-sided central defender and looked a little exposed without the pace of his youth, but since moving to the middle of a back three he has looked at ease. He has made 42 appearances in all competitions for PSG this season.\nWhile he has not been able to alter the club’s fate in the Champions League — PSG once again exited at the round of 16 stage — his influence has extended beyond just what he does on the field. In a strong-willed dressing room, he holds high ground.\n“Sergio had a really difficult season last year with calf injuries,” said PSG head coach Christophe Galtier earlier this month. “He had a full pre-season and prepared well. He’s a top professional. When you have his record at his age, it’s because you are putting the odds in your favour. He brings experience and rigour and sets the standards on a daily basis and in matches. He’s an important player in the dressing room.\n“Regarding his future, there are discussions between the board and Sergio. We will see what comes from that. I am very happy with what he has done this season and what he brings on a matchday. He’s an example to follow for our young players.”\nIt may have felt improbable last season, but an extension to Ramos’ stay is increasingly likely. That two-year contract is due to expire at the end of next month, but his consistent performances have soothed concerns about injury problems. While Lionel Messi is set to depart after his own two-season stay and uncertainty remains over Neymar and Kylian Mbappe, there is more clarity emerging in Ramos’ case.\nPSG are expected to try to remould their project again this summer, sticking with their plan to move away from glitzy, big-reputation signings and towards a younger team. At 37, and with an international reputation, Ramos is not an obvious choice to be retained in that context. Yet, right now, it does not feel like quite as much of a misstep to keep him within their ranks.\nThere is a practical case for keeping him around for a bit longer.\nAdvertisement\nFirstly, because PSG can’t really afford to lose another defender. Presnel Kimpembe ruptured an Achilles in February and is not expected to return until well into the new season, while Nordi Mukiele, who can cover as a wing-back or a central defender, was also ruled out until the summer after hamstring surgery. Milan Skriniar, a central defender who is set to sign as a free agent from Inter Milan, has also recently had to undergo a back operation, although he is not thought to be out long-term.\nPSG’s squad is already a thin one, particularly in defence, where Danilo Pereira has been redeployed from midfield and 17-year-old El Chadaille Bitshiabu has been thrown in at the deep end since the turn of the year. That has ultimately hurt the team over the course of the season. Defence is an area PSG would wish to strengthen rather than thin out as part of their broader cost-saving measures. In that sense, injuries have worked in Ramos’ favour.\nThe 180-cap Spain international has also not simply been making up the numbers at PSG this past year. On the field, he is still proving to be an effective operator. A cursory glance through his data reflects this.\nIt is difficult to assess defensive quality for a central defender, particularly one who is in a very dominant team, but stylistically, the way he plays has not changed greatly. His distribution remains a very important part of his game — only two players can better his 2,154 passes this season in Ligue 1 (79.8 per game), while a pass accuracy of 94.5 per cent is the second-highest in the division.\nRamos is also still a front-footed defender. Using Smarterscout, which rates players from zero to 99 based on either how often they perform a stylistic action or how effective they are at it compared with others in their position, we can see that he scores highly in metrics that indicate proactive defending, such as disrupting opposition moves (rating 89; the higher the number, the more the player disrupts opposition moves through tackling, fouling, blocking, clearing per minute out of possession) as well as defending intensity (rating 95; the higher this number, the more often the player makes defensive actions and applies pressure).\nBy way of comparison, in his final two seasons in Spain, Ramos would make more true tackles (per 1,000 opponent touches, a measure that helps assess how often a player performs a given action relative to how much defending they have to do) and true interceptions than the average centre-back, too. In short, he is still doing what he is good at.\nWhile not conclusive, a look at his tackles and interceptions map in this season’s Champions League shows he’s not afraid to step out and make challenges in advanced areas. It is important to remember he is now playing in a back three for a very dominant team, but a figure of 3.2 true interceptions (interceptions + blocked passes) per 90 minutes — which is above the Champions League average of 2.3 — shows he is still tenacious.\nRamos is of course no longer the player who powered Madrid to four Champions League titles in five seasons from 2013-14. He does not have his old speed and agility, even if his in-game intelligence remains. A further point of debate is whether he works as efficiently in a back four now, were Galtier to depart and a new manager install such a system.\nAdvertisement\nYet, even so, retaining an older, experienced head who can clearly still play a bit certainly makes sense for PSG in the short term, despite their desire to pivot towards a younger, more dynamic side going forward.\nThis was perhaps a perspective that was not appreciated enough when what to do with Silva was on the table three years ago, even accounting for the wonderful benefits of hindsight. Ultimately, history may deem the decision to move him on as a misstep, but the addition of Ramos no longer seems like a failed bet.\nHow an extension is viewed in hindsight is for the future to decide, but as of now, there is enough of a case to say Ramos is worth another year in Paris.\nAdditional reporting: Thom Harris and Guillermo Rai\n(Top photo: Clive Rose via Getty Images)",
  "word_count": 1631,
  "scraped_at": "2026-02-14T02:00:19.995939",
  "_text_extracted": true
}