{
  "article_id": "733cd5abf20c",
  "url": "https://www.myjoyonline.com/modric-to-leave-real-madrid-after-club-world-cup/",
  "title": "Modric to leave Real Madrid after Club World Cup",
  "date": "20250523T034500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nReal Madrid captain Luka Modric has revealed he will leave the Spanish giants after the end of their Fifa Club World Cup campaign this summer.\nThe 39-year-old Croatia midfielder, the 2018 Ballon d'Or winner, will play his last match at Real's Bernabeu home when they welcome Real Sociedad on Saturday in their final La Liga game of the season.\n\"The moment has arrived. The moment I never wanted to come, but that's football, and in life everything has a beginning and an end,\" Modric said on Instagram.\nHe has won 28 trophies, including six Champions Leagues and four domestic titles, since joining Real from Spurs in 2012.\n\"I arrived in 2012 with the hope of wearing the jersey of the best team in the world and the ambition to do great things, but I couldn't have imagined what came next,\" he said.\n\"Playing for Real Madrid changed my life as a footballer and as a person.\n\"I'm proud to have been part of one of the most successful eras of the best club in history.\"\nReal will open their Club World Cup campaign against Saudi Arabia's Al-Hilal on 18 June and will also face Mexico's Pachuca and RB Salzburg of Austria in the group stage.\nModric bagged two goals and six assists in 34 appearances in the Spanish top flight this season as Real were pipped to the title by Barcelona.\nHe also featured in every game as Carlo Ancelotti's side reached the quarter-finals of the Champions League, where they were beaten 5-1 on aggregate by Arsenal.\nModric signed a one-year contract extension last year, which expires at the end of this campaign.\nSaturday's game will also be Ancelotti's last in charge of Real, with Bayer Leverkusen boss Xabi Alonso reportedly set to succeed the Italian.\n'Modric's legacy will live on forever'\nAlthough he has been largely limited to substitute appearances this season, Modric will leave Real as its most decorated player after 590 appearances, 43 goals and 95 assists.\n\"Modric will forever remain in the hearts of all Madridistas as a unique and exemplary footballer who has always embodied the values of Real Madrid,\" added club president Florentino Perez in a statement.\n\"His football has captured the imagination of Madridismo and fans all over the world. His legacy will live on forever.\"\nModric captained Real to two trophies in his final season to take his haul to 28 titles, overtaking Nacho Fernandez as the club's most successful player.\nHis tally includes the six Champions Leagues, six Fifa Club World Cups, five European Super Cups, four La Liga titles, two Copa del Rey triumphs and five Spanish Super Cups during his 13 seasons at Real.\nAfter leading Real to a 2018 Champions League success over Liverpool and then Croatia to the World Cup final in the same year, Modric became the first player since 2007, other than Cristiano Ronaldo and Lionel Messi, to win the Ballon d'Or.\nHe is also the oldest player to represent Los Blancos in La Liga and their oldest goalscorer, having scored in a 2-1 win over Valencia at the age of 39 years and 116 days, overtaking Ferenc Puskas' mark.\nModric is also currently the third longest-serving member of a Spanish top-flight side, behind Oscar de Marcos of Athletic Club and Atletico Madrid midfielder Koke.\nLast month, the Croatia legend became an \"investor and co-owner\" with a minority stake in Championship side Swansea City.\n'It feels like the end of an era'\nGuillem Balague, BBC Sport Columnist\nAlthough Modric has been playing less than he has done for most of his Real Madrid career, he is the kind of player that can affect things because he becomes a magnet for the team.\nHe may have felt he was being useful at some points, but football is heading in a different direction now - you need to cover a lot of ground for instance. Look at Pedri who is the number one retriever of possession at Barcelona and runs more than anybody else. Modric can't do that anymore.\nHe has been the one who has been pushing to stay put but Real had doubts. They listened to the player, the fans, read the room and felt it wasn't time yet. But everybody was prepared for his departure.\nModric, however, has been an exemplary professional.\nPerhaps his most difficult time was when Carlo Ancelotti told him and Toni Kroos that he was going to change things and the club had decided to go for a more physical and dynamic midfield with Aurelien Tchouameni, Fede Valverde and Eduardo Camavinga.\nKroos managed to turn things around and became a very important part of the team, but Modric had a phase on the bench.\nDuring the last couple of years, his situation has left him a bit uneasy. He didn't know where he stood. He felt he could play 90 minutes more often. It was a nightmare for him but this season, he has understood his role better and has been their leader.\nBut ultimately, this will have been a decision taken by the club. Xabi Alonso would have agreed to it but it's a club decision, first of all. The way Alonso's teams play requires a lot of effort which he cannot ask of Modric.\nIt also feels like the end of an era.\nThere is a new culture that has to be set for this team. Ancelotti has struggled with the fractions and egos in the team and by getting Modric out, you can build for new leaders - and that might be Real's thinking.\nLatest Stories\n-\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n10 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n35 minutes -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n37 minutes -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n2 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n2 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n2 hours -\nIs having a physical security operations center in your business worth it?\n2 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n3 hours -\nNUGS President urges sustainable digital governance\n3 hours -\nNational Investment Bank kicks off Ghana Sports Fund with landmark seed donation\n3 hours",
  "word_count": 1154,
  "scraped_at": "2026-02-14T02:11:36.680546",
  "_text_extracted": true
}