{
  "article_id": "7354a36c307d",
  "url": "https://www.teamtalk.com/news/barcelona-confirm-massive-dani-olmo-blow-ahead-benfica-clash-fears-grow-over-longer-absence",
  "title": "Barcelona news : Barca confirm massive Dani Olmo blow ahead of Benfica clash as fears grow over longer absence",
  "date": "20250119T191500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona confirm massive Dani Olmo blow ahead of Benfica clash as fears grow over longer absence\nBarcelona have been hit by an injury blow to key playmaker Dani Olmo ahead of their next game against Benfica in the Champions League on Tuesday evening.\nOlmo complained of muscular discomfort in his calf after featuring as a substitute in the LaLiga draw against Getafe on Saturday and Barca have now confirmed that he will be out of the midweek match against the Portuguese side.\nBarcelona, who are now third in the La Liga table and five points behind leaders Atletico Madrid, can qualify automatically for the next stage of the Champions League against Benfica.\nHowever, the loss of Olmo will be a blow for Hansi Flick’s side – especially after his impressive showing against Real Betis in the Copa del Rey.\nFlick is likely to give an update on how much time that Olmo is likely to miss at his press conference for the Benfica clash on Monday.\nBarca were only granted provisional permission to register Dani Olmo and Pau Victor by the Spanish national sports council (CSD) at the start of the month.\nThe players, both summer signings, were only registered for the first half of the season as Barcelona could not meet LaLiga’s wage cap restrictions.\nThey had initially been rejected by the Spanish Football Federation (RFEF) and LaLiga in their efforts to register the duo.\nHowever, the CSD stepped in on January 8 following an appeal by the club to grant a precautionary measure and allow the pair to play in the short term.\nREAD MORE ➡️ Ask Me Anything: Submit your transfer questions for Rudy Galetti!\nLatest Barcelona news: Offer for Liverpool star coming / Spurs to aid Rashford swoop\nLiverpool winger Luis Diaz has made a clear decision on his future amid strong interest from Barcelona, with a report in his native Colombia claiming the big issue that the Reds have to overcome to keep hold of the star, as another big-name forward could be on his way out of Anfield.\nSince his £37m move from FC Porto in January 2022, Diaz has established himself as one of the best players for Liverpool and has become a fan favourite. The Colombia international was one of the first names on the teamsheet under Jurgen Klopp, and he has kept his place in the Reds’ starting lineup under Arne Slot.\nDiaz is under contract at Liverpool until the summer of 2027, and there has been speculation in the Spanish press that Barcelona are keen on signing him at the end of the season.\nThere have been reports that Diaz is not happy at Liverpool, with the chance to move to Barcelona seen favourably by the 28-year-old winger.\nThose reports have now been backed by sources in Colombia. Antena 2 has reported that Barcelona have already told Liverpool that they plan to make an offer for Diaz in June, with a €70 (£59m, $72m) bid expected.\nMeanwhile, Tottenham could inadvertently help Marcus Rashford to secure his preferred move out of Manchester United this month, with reports detailing the latest on Barcelona’s interest as well as a Spurs ‘offer’ that unlocks their deal.",
  "word_count": 532,
  "scraped_at": "2026-02-14T01:49:18.063738",
  "_text_extracted": true
}