{
  "article_id": "7382c15828eb",
  "url": "https://thenationonlineng.net/rivers-united-face-holders-in-champions-leagues-group-of-death/",
  "title": "Rivers United face holders in Champions League  group of death  ",
  "date": "20251104T103000Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nNovember 4, 2025 by Our Reporter\nRivers United face holders in Champions League’s ‘group of death’\nBy Daniel Oyekan\nNigeria’s sole representatives on the continent, Rivers United, have been handed a tough draw in the 2025/26 CAF Champions League group stage, where they will face some of Africa’s strongest club sides.\nThe draw, conducted on Monday at the SuperSport Studios in Johannesburg, South Africa, placed the former Nigeria Premier Football League (NPFL) champions in Group A alongside RS Berkane of Morocco, Pyramids FC of Egypt, and Power Dynamos of Zambia.\nThis marks Rivers United’s first-ever appearance in the group stage of Africa’s premier club competition, following their 3–2 aggregate victory over Mozambique’s Black Bulls in the final qualifying round. The Port Harcourt-based club also became the first Nigerian side to reach the group phase since 2019.\nGroup A is widely regarded as one of the toughest of the draw. Pyramids FC, defending champions of the CAF Champions League, are among the early favourites to retain their title after defeating Mamelodi Sundowns 3–2 in last season’s final. RS Berkane, on the other hand, are the reigning CAF Confederation Cup champions, having lifted the trophy three times in the past six editions.\nRead Also: Ballon d’Or: NFF congratulates Nnadozie, Madugu\nWhile Rivers United face a daunting challenge against two continental powerhouses, Power Dynamos will also be looking to make an impression in their first group stage appearance since 2020 — making Group A, a blend of experience and emerging ambition.\nElsewhere, record 12-time winners Al Ahly of Egypt headline Group B alongside Young Africans (Tanzania), AS FAR (Morocco), and JS Kabylie (Algeria), while Mamelodi Sundowns lead Group C and Espérance de Tunis top Group D.\nThe CAF Interclub group stage will kick off between 21 and 23 November 2025, with two matchdays scheduled before the AFCON 2025 break in Morocco.\nMatches will resume from January 23–25, 2026, before the knockout rounds begin on March 13, 2026.\nThe eventual winners of the competition, according to CAF, will receive USD 4 million, while runners-up will earn USD 2 million.",
  "word_count": 346,
  "scraped_at": "2026-02-14T02:19:12.280846",
  "_text_extracted": true
}