{
  "article_id": "738361a8f2ba",
  "url": "https://www.caughtoffside.com/2025/05/29/arsenal-transfers-julian-alvarez-anthony-gordon/",
  "title": "Arsenal column : Julian Alvarez transfer , Anthony Gordon & more",
  "date": "20250529T120000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Julian Alvarez looks like just what Arsenal need, but is it realistic?\nI’ve seen the Julian Alvarez links and I’ve had lots of Arsenal fans asking me about them. But I have to admit, I would be surprised if there is much to this other than speculation.\nThe reports have emerged from Spain and suggest that Arsenal are the club ‘pushing the hardest’ for Alvarez, but I just can’t see it myself.\nDon’t get me wrong, I think he would be a great signing for Arsenal. He would bring something to the attack that Mikel Arteta currently does not have. He’s a live wire, someone who doesn’t stop pulling defenders out of position. He would add some chaos to how Arsenal play and I do think the squad needs that.\nI think back to when Gabriel Jesus first arrived and that’s exactly what he offered in those early months when he ‘changed Arsenal’s world’, to use a quote once used by Mikel Arteta.\nI see a lot of what we saw in Jesus in those first few months before his injury at the World Cup in what Alvarez would bring, which is why it is a move that would appeal to me.\nBut it all just feels a bit fanciful to me.\nFirst of all Alvarez is very happy in Spain by all accounts, he’s loving it over there and is not exactly pining for a return to the Premier League.\nAnd then there is the money involved. Players like Benjamin Sesko or Viktor Gyokeres would not come cheap, but they would still be significantly cheaper than Alvarez would be, should he move on from Atletico.\nThey spent around £80 million to sign him from Manchester City last summer and he’s been a huge success since that move. So it would take a huge fee to prize him away from the Spanish capital.\nSo I just don’t really see this one having much legs, as exciting a prospect as it may be.\nAnthony Gordon linked with Arsenal, but Nico Williams would be more likely\nThere’s lot of names being added to the mix when it comes to a possible new left winger at Arsenal. Rodrygo is obviously one doing the rounds (covered here by Mark Brus for CaughtOffside) as we wait to find out what Real Madrid’s plans are for him.\nBut Anthony Gordon is another that has been suggested as a possible target for Arsenal.\nHe’s an interesting player, one who I have to admit has taken his game to heights I did not expect him to reach when he first made his move to Newcastle.\nI was one of those who questioned the price Newcastle paid to sign Gordon from Everton, but it’s tough to question that now. He’s clearly proven himself to be a top player at the highest level since he made his move to St James’ Park.\nHad Newcastle not qualified for the Champions league, then maybe he could have been a possibility. But they did secure a top five finish, so the prospect of Gordon or any of their star players leaving now looks to be very slim.\nI couldn’t really see him heading to Arsenal anyway. Nico Williams has always been the club’s priority target when it comes to the left side of the attack and if they do make a move to strengthen in that area then I still expect the Athletic Bilbao winger to be the man they go after.\nMax Dowman is too good for the Arsenal first-team to ignore\nThe excitement over Max Dowman has been bubbling away under the surface at Arsenal for a long time now.\nEven when he was 13 you would hear people talking about what this kid was doing against older players while turning out for age groups much higher than his own in the club’s youth teams.\nArsenal were understandably keen to keep his talents under wraps for as long as possible. Not just to keep him away from rival clubs who could be looking to lure him away, but also to try and lower the expectations on such a young player.\nBut it’s so difficult now to keep Dowman out of the limelight. His talent has basically made that impossible, even at the age of just 15.\nArsenal have been handling his development carefully, but it’s been clear by the way he has been brought into the first-team picture by Mikel Arteta during the past 12 months that the preparations are being done for him to step up to senior football.\nHad it not been for the regulations I really think we would have seen him feature at some point last season, so I’m certainly expecting it to happen in the coming campaign.\nI think how much we see of him basically depends on how Dowman handles the step up and we’ll get our first good look at that during the pre-season tour later this summer, which the teenager will be a part of providing he is fit.\nArteta will have a good look at him on the tour. Not just how he performs during his minutes on the pitch, but how he handles himself while he is away with the squad.\nThere are guidelines Arsenal have to follow as a club when they have a player so young traveling with them, but they faced a similar scenario recently with Ethan Nwaneri so they are used to that.\nThat might make things a bit difficult for Dowman at first, but if he handles that well and shows that he can physically deal with going up against senior players then I think he will come into the reckoning when it comes to getting some minutes next season.\nIt’s down to him really because the talent is clearly there. He already looks far too good for the levels he is currently playing in.\nArsenal Women’s spectacular Champions League success is well deserved\nWhat the Arsenal Women achieved last week in Lisbon was nothing short of spectacular.\nTo come out on top against that Barcelona side to win the Champions League was so, so impressive and it was rich reward for all the work the club has put into the women’s game over the years.\nYes, Chelsea have been the dominant force on the pitch in England recently but no-one has done more – and continues to do more – for the women’s game in this county than Arsenal.\nThey have been such a strong driving force in trying to change and improve the women’s game and this Champions League win will do so much for that.\nThe club have really invested in the women’s side of the game in recent years. They have given the team a platform to really showcase themselves and the benefits have been clear.\nThe regular games at the Emirates have been a huge success, something that is clear by the size of the crowds that we now see at games.\nAnd just look at the scenes outside the stadium on Monday when they lifted the trophy in front of thousands and thousands of fans who had come down to celebrate the Champions League success.\nCompare those scenes to what we saw in 2007 when Arsenal last won Europe’s elite club competition and you can see just how far the game has come and much the fanbase has grown.\nIt’s absolutely brilliant and everyone at the club deserves huge credit for what they have done.",
  "word_count": 1245,
  "scraped_at": "2026-02-14T02:02:47.540452",
  "_text_extracted": true
}