{
  "article_id": "7385f0f4d5a5",
  "url": "https://theathletic.com/5260102/2024/02/13/champions-league-outsider-win-2023-24/",
  "title": "Could 2023 - 24 be the last chance for an outsider to win the Champions League ? ",
  "date": "20240213T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This year marks two decades since an outsider won the Champions League.\nIn May 2004, Jose Mourinho-managed Porto shocked the sport with a hugely unexpected triumph. Porto have long been a big club, of course, and had already lifted the trophy in the competition’s previous guise as the European Cup in 1987. But by that stage, a side from outside the major European leagues winning the biggest prize in club football felt unusual.\nAdvertisement\nTwenty years on, a champion from a country other than England, France, Germany, Italy or Spain feels almost impossible.\nThat said, this season might be the best chance of it happening we get for years.\nFor an outsider to win a major tournament in football, you basically need two things to happen. First, the outsiders themselves need to be better than usual. Second, the traditional giants need to be weaker than usual. When Leicester City won the Premier League in 2015-16, for example, it was helpful that none of the usual big clubs recorded more than 71 points. The following season, five teams did so.\nMaybe in 2023-24, the stars might align for something similar to happen in the flagship European club competition.\nLet’s start with the part we can be surer about: the bigger sides being weaker. The caveat here is that you only need one dominant side to make this all irrelevant and, having won the treble last season, Pep Guardiola’s Manchester City don’t appear to be any worse. They may well retain their crown.\nAfter them, though, the contenders don’t seem overwhelmingly intimidating.\nBased on bookmakers’ odds, the second-favourites are Bayern Munich, who are enduring a rare campaign where they’re not running away with the Bundesliga, and at the weekend were comfortably beaten by the team above them in the table, Bayer Leverkusen. The joint-third-favourites are Arsenal, a talented side but completely untested in the Champions League knockout stage having not played in this competition since 2016-17, and Real Madrid, who are essentially the same as last season, albeit with Jude Bellingham in for their previous key goalscorer, Karim Benzema.\nThe fifth-favourites are PSG, who don’t appear any better than usual, and sixth-favourites are Barcelona, who have been so poor that their manager has already told us he will step down in the summer.\nGO DEEPER\nXavi's Barcelona resignation: The full story behind his decision to step down in June\nWhere has all the quality gone? Well, there are a couple of factors at play here.\nUnusually in an era of repeat title successes, the champions of both Spain and Italy have dropped off dramatically from last season. Barcelona’s struggles are well documented, but they at least remain third in La Liga. Napoli, having parted company with Scudetto-winning coach Luciano Spalletti last summer, find themselves in ninth. Their coach, Walter Mazzarri, worked wonders in his first spell with Napoli just over a decade ago, winning the Coppa Italia (Italy’s FA Cup) and finishing as runners-up in Serie A, but was most recently coaching Watford, Torino and Cagliari. This isn’t a Champions League quality side, or manager.\nAdvertisement\nNapoli and Barcelona, incidentally, have been drawn against each other in the round of 16 starting this week, so one of them will be in the last eight.\nThe other way of looking at things is on an individual level. And while football is a team sport, the last 20 years of Champions League knockout football have arguably been more about standout individuals than great sides.\nProbably more than in league competition, and certainly more than in international tournaments, one player’s brilliance can prove the difference in a big game.\nThink about, for example, the performances of Kaka for AC Milan against Manchester United in 2007, Lionel Messi for Barcelona against Arsenal in 2010, Robert Lewandowski for Borussia Dortmund against Real Madrid in 2013, Neymar for Barca against Paris Saint-Germain in 2017, Cristiano Ronaldo for Juventus against Atletico Madrid in 2019, Kylian Mbappe for PSG against Barcelona in 2021, or Benzema for Real Madrid against Chelsea in 2022.\nYou can name others — including, of course, several repeat performances by those specific people. But at times, for all the focus on strategy, one player often proves the difference in the biggest games. There’s probably some level of availability bias involved here, but it’s still easier to recall classic individual displays than classic team ones.\nAnd, individually, European football is weaker than it has been for several years.\nPartly by virtue of years of dominance from the now departed pairing of Ronaldo and Messi, there’s only one former Ballon d’Or winner currently playing in European football — Luka Modric. He is still a majestic footballer, but Modric is now 38 (he’s older than Wayne Rooney, who has been retired for three years) and is only playing around 50 per cent of the available minutes for Madrid.\nIt’s doubtful whether Saudi Arabia’s recent massive investment will lead to it becoming a serious power in football. But for now, European football shouldn’t kid itself that it hasn’t been affected by the loss to the Saudi Pro League of players such as Ronaldo, the all-time top goalscorer in the Champions League, and Sadio Mane, who finished second in the Ballon d’Or voting two years ago. Or, for that matter: Jordan Henderson (now back in Europe with Ajax), Aymeric Laporte, Riyad Mahrez, Marcelo Brozovic, Franck Kessie, Renan Lodi, Yannick Carrasco, N’Golo Kante, Edouard Mendy, Kalidou Koulibaly, Georginio Wijnaldum, Yassine Bounou, Roberto Firmino, Ivan Rakitic and Karl Toko Ekambi.\nAdvertisement\nNot all of the above were tempted away from current Champions League clubs, but all have played a major role in a Champions League knockout game (or Europa League success) within the past four years. Messi, now in MLS, is another obvious absence.\nOn one hand, those transfers have pumped money into European club football, and allowed them to regenerate themselves. But that takes time, and top-level clubs aren’t accustomed to such a sudden drain of talent.\nThis, therefore, might be a Champions League knockout stage that rewards a cohesive unit rather than a star individual. That could favour the underdogs, of which there are a few still remaining: FC Copenhagen, Real Sociedad and PSV Eindhoven.\nOf those sides, it is PSV who are most intriguing.\nThey won each of their first 17 Eredivisie matches this season, then drew two out of three games, against Utrecht and Ajax. They were back to winning ways at the weekend though, sticking five past Volendam. While they were torn apart away at Arsenal in their opening group game, losing 4-0, they recovered well, effectively securing their place in the knockout stage with a game to spare via a dramatic 3-2 win away at European specialists Sevilla.\nTheir primary goalscorer is the veteran centre-forward Luuk de Jong, now 33. But behind him there’s an exciting cast including speedy 20-year-old Belgian Johan Bakayoko and Joey Veerman, a relatively late bloomer who only made his senior Netherlands debut last summer but suddenly looks like the Eredivisie’s best player at age 25.\nGO DEEPER\nInside PSV's academy: Goldilocks pitches, cognitive training and a pathway to success\nManager Peter Bosz has shown European expertise before, steering Ajax to the Europa League final in 2017. The draw has been kind to PSV — Dortmund were, along with Real Sociedad, probably the weakest of the seeded sides. If they progress to the quarter-finals, their task will be trickier. But on the basis of performances this season, they are probably better than whoever emerges from the Barcelona-Napoli tie.\nAdvertisement\nAn interesting feature of Porto’s victorious 2003-04 campaign was that it was the first season after the Champions League’s widely disliked second group stage was ditched, with the tournament switching to a straight knockout stage once it was down to 16 teams. It was considered that fewer games meant a shock winner was more likely.\nOn a similar note, it’s worth remembering that this is the last season of the current format before the new ‘Swiss model’ comes in. That system, where teams will play eight first-phase games, rather than the present six, and will not be divided into small groups from which two teams are guaranteed to advance probably works in favour of the big sides. More matches means fewer surprises, and no groups means less chance of a lopsided draw allowing comparative minnows to progress further.\nIf there is to be a shock winner of the Champions League ever again — and there might well not be — this season is probably our best bet.\n(Top photo: Getty Images; design: Eamonn Dalton)",
  "word_count": 1430,
  "scraped_at": "2026-02-14T02:10:42.027213",
  "_text_extracted": true
}