{
  "article_id": "738add41e9b0",
  "url": "https://www.90min.com/features/barcelona-3-3-inter-5-talking-points-30-4-25",
  "title": "Barcelona 3 - 3 Inter : 5 talking points from blockbuster Champions League semi - final",
  "date": "20250430T221500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona 3-3 Inter: 5 talking points from blockbuster Champions League semi-final\n- Barcelona only managed to draw with Inter in Wednesday's semi-final first leg\n- La Blaugrana twice came from behind to earn hard-fought draw\n- Second leg staged at San Siro next Tuesday\nBarcelona twice fought from behind to earn a 3-3 draw with Inter during the thrilling first leg of their Champions League semi-final tie on Wednesday.\nInter took a surprise two-goal lead at Estadi Olimpic Lluis Companys as Denzel Dumfries assisted Marcus Thuram before scoring himself, but a scorcher from Lamine Yamal and a close-range effort from Ferran Torres brought Barcelona level prior to half-time.\nDumfries proceeded to score his second of the evening 20 minutes after the restart but Barcelona responded instantly as Yann Sommer's own goal ensured there is nothing separating the sides ahead of next week's decider in Italy.\nHow the game unfolded\nInter would have been forgiven for fearing the worst ahead of their trip to Catalonia following three successive defeats without scoring, but any nagging doubts were silenced after just 30 seconds. Thuram, whose father Lilian once represented Barcelona, expertly matched Dumfries' delivery with a deft flick to stun the home crowd and allay any concerns over his fitness.\nBarcelona desperately sought a quick-fire equaliser - Torres spurning their best chances - but were soon left licking their wounds as Inter doubled their advantage. The home side's inability to defend another cross into the penalty box proved costly as Francesco Acerbi won first contact at a corner, with Dumfries firing an exceptional acrobatic volley beyond Wojciech Szczesny.\nRed and blue shirts trudged back to the halfway line, shell-shocked by Inter's clinical showing, but Yamal would soon single-handedly drag them back into the contest. The 17-year-old slalomed beyond several challenges and produced a staggering finish befitting of his devastating sprint, curling a pinpoint effort off the inside of the post.\nThe woodwork and Yann Sommer's fingertips proved Yamal's nemesis just two minutes later as he crashed the crossbar, but Barcelona would earn a deserved equaliser before a breathless first half concluded. Another delightful sequence proved too much for Inter's usually resilient defence to halt, with Torres converting from six yards following Raphinha's headed cut-back.\nAny fears of a subdued second half after an energy-sapping first were laid to rest 20 minutes after the restart. Both goals were breached in quick succession just after the hour mark, Dumfries briefly restoring Inter's advantage with a close-range header as Barcelona succumbed to another set-piece.\nHowever, their lead was extinguished just a minute later as Barcelona finally benefitted from a corner. An impressive routine caught Inter napping as the ball was lasered into the path of Raphinha 25 yards from goal - Yamal adding another highlight to his showreel with a lovely dummy - and the Brazilian's venomous strike ricocheted off the crossbar onto the back of Sommer and over the line to level proceedings.\nInter thought they had once again restored their buffer 15 minutes from time as Henrikh Mkhitaryan fired home another deadly delivery from the insatiable Dumfries, but the assistant referee rightly flagged for offside as replays showed the toe of the Armenian's boot had strayed beyond Barcelona's high line.\nSensing they would not produce better in the dying embers, Inter retreated in an attempt to stifle Barcelona's array of attacking dynamos. Defensive substitutions proved effective for the visitors, although Yamal's scuffed cross had them sweating as it bounced off the top of the crossbar in the final five minutes.\nDespite their best efforts, Hansi Flick's men were unable to find a winning goal to take to San Siro for next week's second leg, with Inter relieved to come away from Catalonia with a hard-fought draw.\nPlayer ratings\nCheck out player ratings for Barcelona 3-3 Inter here.\nPure chaos in Catalonia\nThis was Champions League knockout football at its blistering best.\nThere were concerns prior to kick-off that Wednesday's battle would merely be attack vs defence as the hosts looked to overwhelm their stubborn visitors, but Inter opening the scoring after 30 seconds certainly saw those fears evaporate. The early effort stunned all in Catalonia no matter their allegiances and set the tempo for an exhilarating evening.\nInter's second only served to anger Barcelona, who proceeded to dump their arsenal on their visitors. Yamal ignited and the supporting cast of Raphinha, Dani Olmo and Torres began to make things happen. In what felt a matter of seconds, it was 2-2.\nWhile the energy levels, rather unsurprisingly, dropped a tad after the restart, both sides still served up some magic. Inter were a consistent threat on the counter-attack, while Barcelona's individual brilliance was a joy to behold.\nThe Champions League seldom fails to entertain in the latter stages and Wednesday was another reminder of the competition's allure.\nYamal reaches new milestone in style\nYamal rebuffed comparisons with Lionel Messi during his pre-match media duties. \"I don't compare myself to him, because I don't compare myself to anyone,\" affirmed the teenager. But such questions were unsurprising given he marked his 100th Barcelona appearance on Wednesday evening - surpassing Messi and others to become the quickest to reach a century for La Blaugrana.\nAn injury scare in the warm-up threatened to delay his milestone outing but he quickly set about producing a Messi-esque performance. The eight-time Ballon d'Or winner would have been immensely proud of Yamal's first-half scorcher, a mazy dribble matched by an outstanding finish which made him the youngest ever scorer in a Champions League semi-final.\nYamal's effervescence proved infectious and his teammates soon rose to his standards. Yet, eyes around the stadium remained glued to Barcelona's No 19.\nHe purred throughout the contest and was unfortunate to only walk away with a solitary goal to his name, twice striking the woodwork and repeatedly tormenting Federico Dimarco - who was withdrawn before the hour mark. The Italian wing-back was not alone in enduring a chastening evening at the hands of Yamal, who produced another astounding display on the big stage.\nCrosses prove Barcelona's kryptonite\nBarcelona's ludicrously high line has been the source of much debate this season but it was their difficulties defending crosses which will come under the microscope after Wednesday's affair. Both Inter's first-half efforts came from wide deliveries, with the hosts lacking the size and physicality to match the Italians.\nKounde's unconvincing clearance played a part in Inter's opener as a near-post cross was converted by Thuram, while neither Barcelona centre-half managed to effectively challenge Acerbi from the corner that forged the visitors' second. Pedri, too, will come under fire for ducking Dumfries' scissor kick.\nThings didn't get better in the second half, either. The exceptional Dumfries struck again from a corner as Barcelona failed to match the power of his run and leap, while the tightest of offsides prevented the Dutchman from assisting Mkhitaryan with another teasing cross.\nInter will be eager to exploit Barcelona's aerial weaknesses in the reverse fixture and they proved they have the tools at their disposal to do exactly that.\nDumfries delights\nDumfries has been a notable absentee for Inter during recent encounters and Wednesday marked his return to the starting lineup following an injury setback. The Netherlands international's lung-busting runs proved decisive in Catalonia and Gerard Martin was helpless to prevent him in the first half, while even a defensive reshuffle at half-time failed to impact his usefulness.\nA player of the match display was capped by two goals and an assist, the first of the former demonstrating his astonishing agility, and Barcelona must find a way to silence him at San Siro. They will be desperate to see Alejandro Balde return from injury just in time for the ultimate battle of flying full-backs.\nInjury fears for Lautaro Martinez\nIt's rare that Inter rack up three goals without a contribution from star striker Lautaro Martinez. The Argentinian terrier has been crucial in the Nerazzurri's Champions League run, scoring in both clashes with Bayern Munich in the quarter-finals and in the last 16 against Feyenoord.\nBut Simone Inzaghi may have to demand similar output from his other attacking threats in the return leg after Martinez limped off injured in Barcelona, withdrawn at half-time and downgraded to Mehdi Taremi - an incredibly different proposition.\nMartinez grimaced as he hobbled to the touchline for treatment late in the first half, the South American seemingly tweaking something in his leg under little pressure. His absence could prove catastrophic in Inter's hunt for a Champions League final berth next week.",
  "word_count": 1420,
  "scraped_at": "2026-02-14T01:52:20.883958",
  "_text_extracted": true
}