{
  "article_id": "73a9640eb987",
  "url": "https://www.meathchronicle.ie/2023/03/02/virgil-van-dijk-admits-making-sacrifices-to-stay-fighting-fit-for-liverpool-duty/",
  "title": "Virgil van Dijk admits making sacrifices to stay fighting fit for Liverpool duty",
  "date": "20230302T184500Z",
  "domain": "meathchronicle.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Virgil van Dijk admits making sacrifices to stay fighting fit for Liverpool duty\nBy Carl Markham, PA\nLiverpool defender Virgil van Dijk is making more off-field sacrifices to ensure he remains in peak condition after accepting he has played too much across the last two seasons.\nSuch is the importance of the Netherlands captain to the club’s fortunes he rarely takes a break, but that has appeared to catch up with him in the current campaign.\nLast season, after returning from cruciate knee surgery, the Dutchman played the full 90 minutes in 49 matches in succession from the opening day, with his first substitution coming after a minor injury in the FA Cup final win over Chelsea on May 14.\nHe was on the bench for the last league game of the campaign but returned for the Champions League final defeat by Real Madrid – Liverpool’s 63rd of the season after winning a domestic cup double and coming within minutes of claiming a second Premier League title.\nThis season the 31-year-old centre-back again played every minute in 21 of Liverpool’s first 22 matches before the World Cup, missing only the Carabao Cup tie at home to Sky Bet League One club Derby.\nBut since returning from Qatar, he sustained a hamstring injury midway through his third appearance and that sidelined him for seven games.\nNormal service resumed with four 90-minute matches since returning but, after scoring the crucial opening goal in a 2-0 win over Wolves which moved Liverpool to within six points of fourth-placed Tottenham with a match in hand, Van Dijk outlined the struggles he has had.\n“We play every three to four days so what you have to do is sacrifice quite a bit. I would love to spend time with my family and my kids,” he said.\n“But obviously I need to get treatment every day, make sure I’m eating the right stuff and doing the right things in order to be ready for the next game.\n“That’s the life we live and we are very privileged and I really acknowledge that but you still have to make these sacrifices. That’s what’s going on behind the scenes.\n“Obviously I came back from quite a complex injury that I had two years ago now. That takes treatment, that takes time, it takes adaptation.\n“That’s the way I have to handle myself and I won’t say it’s always easy but it happens.\n“Coming back from the knee injury, I played all the Premier League games because I want to be out there. That’s what I’m working hard for.\n“What caught up is that I played too many games at a time. I’ll do everything possible to play but I could have also thought before the World Cup, ‘let’s rest a little bit in order to be ready’.\n“But I didn’t because I want to be influential for this football club but it caught up with me unfortunately.\n“I’m not a robot and I think having the World Cup and then doing nothing for a week and coming back it was maybe not the right decision.”\nSeventeen days after losing the quarter-final to Argentina, Van Dijk returned in the Boxing Day win over Aston Villa.\nHowever, he managed just another 135 minutes before injury sidelined him and on his return his form was scrutinised as Liverpool’s on-field struggles continued.\nBut Jurgen Klopp’s side are currently on their best unbroken run of the season of three wins and a draw – discounting two wins either side of the World Cup break – and Van Dijk has featured in the last three games, helping them secure a fourth successive clean sheet.\n“You try to hit consistency and try to build up momentum and, for me, coming back after being six weeks out, playing straight away four games of 90 minutes in such a short space of time, I need time,” he added.\n“That’s absolutely normal and sometimes people around will take it for granted and see it as normal but it isn’t.\n“That’s what I’m trying to prove but not to the outside world but to myself.\n“This six weeks (out) was a good chance for me to reflect but also let my knee settle and get ready for the rest of the season.\n“We can all go back 10 or 15 years ago and it was quite difficult to be playing at the highest level for players who had done this (ACL) injury, which is why I am very blessed to still be playing at the highest level and trying to get that same level everyone is expecting from me and I’m expecting from myself.\n“It was a tough six weeks to watch because you want to help the team and especially with a hamstring injury you have to be very patient.\n“Patience is not in my vocabulary but I had to.”",
  "word_count": 812,
  "scraped_at": "2026-02-14T02:12:28.617160",
  "_text_extracted": true
}