{
  "article_id": "73b7619c92da",
  "url": "https://metro.co.uk/2026/01/21/jose-mourinho-takes-pop-coaches-no-history-top-jobs-26428308/",
  "title": "Jose Mourinho takes pop at  coaches who have done nothing  in top jobs",
  "date": "20260121T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Benfica manager Jose Mourinho has questioned why ‘coaches with no history’ are appointed at some of the biggest clubs in the world.\nThe 62-year-old has returned to manage in his home country again after a spell with Fenerbahce came to an end in August.\nHe takes his team to Italy on Wednesday night to take on Juventus in the Champions League, facing a familiar face in Luciano Spalletti.\nThe 66-year-old was appointed Juve boss in October, having also managed the likes of Roma, Inter, Napoli and Italy in a coaching career which started in 1993.\nMourinho was asked if he was surprised to see the veteran boss given the job at Juventus, but the Portuguese said he is only shocked to see coaches with little experience handed huge roles.\n‘For me, it is just a surprise when coaches with no history, coaches without a body of work, have the opportunity to manage the most important clubs in the world,’ Mourinho told a press conference. ‘This, for me, is the real surprise.\n‘When AC Milan hire Max (Allegri), or when Juventus hire Luciano (Spalletti) or when AS Roma hire (Gian Piero) Gasperini, it is never a surprise to me, because we’re talking about great coaches.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘The surprise is when people, who have done nothing, takes the jobs of the bigger teams, and with more responsibility. That is the situation.’\nMourinho named no names with his assessment, but a number of his former clubs currently have managers with little or no experience at the top level.\nChelsea have appointed Liam Rosenior and Manchester United have Michael Carrick in interim charge until the end of the season after Ruben Amorim’s dismissal.\nReal Madrid have placed Alvaro Arbeloa in charge after sacking Xabi Alonso and Inter Milan have Cristian Chivu in charge, appointing him after just 13 games as Parma manager as his previous experience.\nMourinho was asked if he would be interested in the Juventus job if they were ever to come calling for him and he said: ‘Of course.’\nMore Trending\nHe has also been asked about reports linking him with a return to Real Madrid, but was far less clear in his answer to that question.\n‘Don’t count on me for soap operas. There are many good soap operas, but they take too long,’ he said of a possible return to the Santiago Bernabeu.\n‘Then you miss an episode or two and you lose track. Don’t count on me, I don’t watch soap operas.’\nMourinho’s Benfica are in need of a result in Turin on Wednesday night as they sit 28th in the Champions League table and are up against it in the race to make the play-offs.\nMORE: Inter Milan boss speaks out on Arsenal display: ‘There was some arrogance’\nMORE: ‘Very special’ – Mikel Arteta backs under-fire Arsenal star after Inter Milan victory\nMORE: Wayne Rooney hoping ‘clever’ Arsenal star is left out against Man Utd",
  "word_count": 541,
  "scraped_at": "2026-02-14T02:27:10.757247",
  "_text_extracted": true
}