{
  "article_id": "73cbf91388f4",
  "url": "https://theathletic.com/4809401/2023/08/28/leicester-city-transfers-squad-championship/",
  "title": "Leicester are shaping up to have the best squad in the Championship",
  "date": "20230828T060000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Turkey winger Yunus Akgun has been confirmed as Leicester City’s seventh signing of the summer and Sporting Lisbon winger Abdul Fatawu Issahaku is closing on becoming the eighth as Enzo Maresca’s squad rebuild nears its conclusion.\nMaresca would also like to bring in another central defender as well if possible but the priority now, for the remaining five days of this transfer window, is to clear players out to ensure the club aren’t left burdened by high earners who cannot be registered.\nAdvertisement\nThe arrival of 23-year-old Akgun, who has been capped five times by his country, from leading Istanbul side Galatasaray has taken Maresca’s squad size to 31. Only 25 can be registered, although players born in 2002 or later don’t have to be registered unless they are on loan. That means while Ben Nelson, Victor Kristiansen and Wanya Marcal don’t have to be registered, Callum Doyle, borrowed from Manchester City, and Cesare Casadei, from Chelsea, do.\nBefore Issahaku’s arrival, also on loan, which should happen this week after an agreement was struck with his Portuguese club, Leicester have 28 players who would need to be registered. The simple maths means that to accommodate the Ghanaian, who like Akgun could join permanently at the end of his loan if he impresses, at least four players have to leave — more if Maresca wants to add further signings.\nFor the record-breaking win at Rotherham United on Saturday, which stretched Maresca’s perfect start to his tenure as Leicester manager to five games in all competitions, a wealth of talent was again left out of the 20-strong matchday squad in anticipation of moves elsewhere.\nBoubakary Soumare, a Ligue 1 title winner with France’s Lille, Patson Daka, a Zambia international with Champions League experience wanted by top-flight Bournemouth, Harry Souttar, an Australia international who played in last year’s World Cup, and Daniel Iversen, who was in several Denmark squads in 2022, are all available.\nTimothy Castagne, capped 33 times by Belgium, also came back onto the bench to replace Marcal having previously been left out, but he is another of the players who is likely to move on this week, most likely making a swift return to the Premier League with Fulham. Likewise, Kristiansen is wanted by Italian Serie A side Bologna, and while he was still at Leicester’s Seagrave training base on Friday a move seems on the cards.\nThen there are those currently in the side who could move on.\nAdvertisement\nJannik Vestergaard has played every minute so far this season but has made no secret of his desire to move to again play in one of the top five leagues in Europe having made 185 appearances in Germany’s Bundesliga to go with his 82 in the Premier League, while Kelechi Iheanacho, who is rapidly becoming integral to how Maresca wants his attack to operate, is attracting attention.\nThe arrivals of the two wingers provide Maresca with the attacking options he desires and even if players do leave this week, he still has cover all across the pitch. As things currently stand, if there is no more activity, Leicester have 14 full internationals, including four players capped by England – Harry Winks, Conor Coady, Jamie Vardy and James Justin.\nIt is hard to think of another squad in the second tier so blessed with talent, even if a number of those internationals do move on. For starters, Leicester currently have five goalkeepers in Iversen, Mads Hermansen, Jakub Stolarczyk, Danny Ward and Alex Smithies.\nMaresca doesn’t play with conventional full-backs, but if captain Ricardo Pereira, who is in the midst of his longest run of consecutive starts for over two years after his long-running injury woes, is missing, Hamza Choudhury has been pencilled in as a replacement, even operating as an inverted left-back in the Carabao Cup win over Burton Albion.\nAt centre-back, the manager currently has his choice of Coady, Doyle, Vestergaard, Nelson and Wout Faes, with Souttar to also be reintegrated if he doesn’t move on.\nDoyle is in situ to play the left-back/left centre-back role but the incredibly adaptable Justin, who made his league comeback after nearly 10 months out recovering from an Achilles injury as a late substitute against Rotherham, could step in there – or anywhere across the back line. Kristiansen and newly-crowned Under-21 European champion Luke Thomas offer more traditional full-back options if required.\nAdvertisement\nIn midfield, Winks is the key holding midfielder and playmaker, but Choudhury is his deputy and Wilfred Ndidi offers a more combative option. Maresca has his four No 8s to flank the holding midfielder, with a licence to break into the box and provide goals. Kiernan Dewsbury-Hall and Casadei seem the long-term options to fill those roles but Ndidi and Dennis Praet, who Maresca rates highly when fit, are also considerations.\nIf Daka stays, are there three more exciting centre-forward options in the division than him, Iheanacho and Vardy? And if he goes, will Maresca look to bring in a replacement? Probably.\nNow with the capture of Akgun, who played in 25 league games as Galatasaray won the Turkish title last season and is swapping Champions League football to come to the Championship, and impending signing of Issahaku, there are more options to compete with Stephy Mavididi and academy graduates Marcal and Kasey McAteer, who was Leicester’s two-goal match-winner on Saturday.\nDon’t forget Premier League title-winner Marc Albrighton either, who can slot in on either flank.\nAlthough Leicester have sold £80million worth of talent in James Maddison and Harvey Barnes, their investment of over £30m is the highest in the Championship and they now boast the best squad in the division. It is hard to mount an argument to counter that statement.\nLeeds United and Southampton, the clubs relegated with them, will be strong too by the end of the window, with the latter in particular cash-rich after the sales of three key players. But there is a reason why, when the team sheets come through, whoever Leicester play this season, journalists covering the opposition blow out their cheeks and ruefully shake their heads at the list of names chosen by Maresca.\nLeicester are building a squad the fans can be excited about, but which must also be able to carry the burden of being the second tier’s big hitters and the scalp the other 23 clubs want to claim.\n(Top photo of Stephy Mavididi: Plumb Images/Leicester City FC via Getty Images)",
  "word_count": 1071,
  "scraped_at": "2026-02-14T01:56:26.900855",
  "_text_extracted": true
}