{
  "article_id": "73df89eb3e94",
  "url": "https://www.westmeathexaminer.ie/2023/09/24/mauricio-pochettino-believes-psg-stint-stood-him-in-good-stead-for-chelsea-job/",
  "title": "Mauricio Pochettino believes PSG stint stood him in good stead for Chelsea job",
  "date": "20230924T110000Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino believes PSG stint stood him in good stead for Chelsea job\nBy PA Sport Staff\nMauricio Pochettino thinks the 18 months he spent in charge of Paris St Germain kitted him out to tackle the complicated task of turning Chelsea’s fortunes around.\nUnder the Argentinian, PSG were crowned Ligue 1 champions in 2022 having missed out to Lille the previous campaign after he had replaced the sacked Thomas Tuchel mid-season.\nCrucially he failed to land the club’s Qatari owners the prize they most coveted, the Champions League, losing in the semi-final to Manchester City in 2021 and to Real Madrid in the last-16 the following year.\nIt was reported that Pochettino never felt that he enjoyed full authority over the club’s star-studded squad, and was kept by the hierarchy from reining in the erratic behaviour of certain big-name players.\nHe left in the summer of 2022 and did not work in football again until accepting the job of piecing together Chelsea owner Todd Boehly’s expensively assembled side in June.\nHe said the experience of managing in the famously chaotic environment of the French champions helped him as a coach, but acknowledged that the challenge he faces at Stamford Bridge is of a different order.\n“I think it helps,” said Pochettino. “It helps to take things in a different way. Of course, experience is a really important point in football, in how you are going to deal with things.\n“It would be arrogant to say that because I was there, now I can manage everything. The demands always are completely different.\n“But when you add experience and experience of different clubs, different countries, different cultures, I think it gives us the capacity as a coaching staff to help in a better way the players and then the club that wants to develop some new ideas or new projects, like we are now doing.”\nChelsea face Aston Villa at Stamford Bridge on Sunday when Pochettino will come up against another coach who knows intimately the unique demands of life at PSG, Unai Emery.\nEmery managed the club for two seasons between 2016-18, winning the title in his second year but joining the list of coaches unable to fulfil the club’s frustrated Champions League ambitions, twice going out in the last 16.\nHe returned Villa to Europe for the first time in 12 years last season, finishing seventh in the Premier League after taking over from Steven Gerrard in October.\n“For myself and for Unai, (the job) is not to prove anything,” said Pochettino. “I think it is to try to help (our) clubs to achieve what the clubs want. I never feel that I need to prove something.\n“We (Pochettino and assistant Jesus Perez) arrived at PSG and in one year and a half we won three (trophies). We proved that we can win.\n“But you can win with a team that normally wins when you are in a project ready to win. In that case, Unai and myself are building something. He is building at Aston Villa a very nice project, and we are starting to build a very good project for the long-term at Chelsea.\n“I think it’s not easy to win with PSG, it’s not easy to win with different clubs. We need to give the credit for the coaches and players that win with different teams, because for different reasons, you feel the pressure in a club like PSG. You cannot (have) any excuses.\n“But the Premier League is the most important competition and the most competitive, and if you can win here, I think the feeling for sure that the credit is bigger.”",
  "word_count": 608,
  "scraped_at": "2026-02-14T02:07:14.748881",
  "_text_extracted": true
}