{
  "article_id": "73eb9dd91def",
  "url": "https://www.justarsenal.com/saka-becomes-the-4th-arsenal-man-to-score-a-hattrick-for-england-here-are-the-other-three/342580",
  "title": "Saka becomes the 4th Arsenal man to score a hattrick for England - Here are the other three .... ",
  "date": "20230620T171500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Yesterday Bukayo Saka did what only three previous Gunners have managed in our history, he’s scored a hat trick for England.\nSome will argue how competitive fixtures against the likes of Macedonia are.\nYet, that would be unfair on Gareth Southgate who has managed to keep his squad hungry and motivated for international duty after a gruelling season.\nPrevious Three Lion bosses have failed to do that. I can name you famous names who have admitted fear of pulling on the white shirt, and who would have been preoccupied this week about their summer holidays.\nI can name you legends who of course got 3 points in this type of fixture because the limitations of the opposition dictate the outcome is a foregone conclusion.\nThey didn’t have the personality to express themselves though, or take the opportunity to boost their stats.\nSuch is the gulf between the two sides at Old Trafford last night perhaps the only thing a manager can learn from individuals is their personality.\nIf ever there was an evening, you could have forgiven players for going through the motions, it was the final game of a campaign which has included a World Cup bang in the middle of it.\nQualification for the Euros already looked a formality with the hardest tie (away in Italy) chalked off.\nPhysically and mentally, Saka has been tested as much as any of his peers this year. As Arsenal finished runners up in a League they had topped for the majority of time, the 21-year-old looked exhausted, with perhaps Arteta guilty of not resting his midfielder. Big pressure has been put on young shoulders at the Emirates.\nSo, if anybody was entitled to complain of burn out it would be Saka.\nYet instead he showcased the only plus points a coach can take from such one-sided matches.\nWho has the bravery to demand the ball?\nWho wants to take responsibility?\nWho takes initiative instead of waiting to be told what to be doing?\nWho doesn’t fear making a mistake?\nWho has the courage to try something different instead of playing the safe pass?\nSaka did all of those things, best reflected by his second goal. Three touches that take self-belief. First controlling a long ball, not letting it hit the ground, hanging it up so he could touch with his chest, allowing the ball to bounce, before unleashing a volley into the corner.\nA youngster not in awe of anything, not just doing enough to appease his seniors, simply taking centre stage.\nI can name you legends for their club’s side who couldn’t do what Saka did on Monday.\nGrown men who lifted Prems and Champions League who were crippled by anxiety when they represented their nation.\nThat’s evidence by how many Arsenal players were capped by England, yet Saka is only the 4th to get a hat-trick ……\nTed Drake\nAny Gooners old enough to remember Ted Drake’s treble (fittingly at Highbury) against Hungary in December 1936?\nMany Gunners earnt more than Drake’s 5 caps and yet didn’t manage a hat trick, making his goal to game ratio for his national team impressive.\nInternational career dictated by events complete out of the sports control.\nOnly 4 players in history have scored more goals for the Arsenal then Drake.\nDue to England’s strained relationship with FIFA, Drake missed out on playing at a World Cup.\nViewed as one of the best strikers in the country at the time, at the age of 27 his career was essentially ended by World War 2, which led to him joining the Royal Air Force.\nWhen he was on leave from duty, he still played for Arsenal, in fixtures not deemed official and therefore not counting towards his stats.\nHe scored 139 goals for the Gunners in 186 games.\nHis honours include three League titles and one FA Cup.\nScored 6 goals in 5 caps, events outside of football meaning he never got really got an international career.\nHe made the most of the short time he had representing his country.\nA hero on and off the pitch\nIan Wright\nEngland had to wait another 57 years for a Gunner to score a hat trick for England.\nYou won’t find too many occasions where a player manages the feat and barely manages a smile, yet alone a celebration. When you consider the man scoring 4 goals that evening always had an affectionate smile, you know there must be serious context to wipe away his grin.\nEach time he scored against San Marino, Wright would take the ball and rush it back to the halfway line to resume the match.\nHe knew that World Cup qualification was out of the English hands, needing a win by a 7-goal margin to have even half a chance.\nThe cruel irony was when he needed goals Graham Taylor was finally putting his trust in our striker, but it was too little too late.\nDespite winning the Golden Boot in 1992, Wright was not selected for that year’s Euros and never forgave the manager for his lack of opportunities until after his retirement.\nWright remains one of the greatest Gunners to never have played in an international tournament.\nTheo Walcott\nIn only his second competitive start for his country a 19-year-old Theo Walcott scored his first goals for his country in Croatia, the youngest Englishman to score a hat trick.\nIt was an individual performance that made the World stand up, the first time the Croatians had lost in Zagreb and a first home defeat in 35 qualification games.\nOn paper the toughest match in the group, against the team that had stopped us from going to that year’s Euros, this was confirmation that England were back on the right track under Fabio Capello, perhaps our best performance under the Italian?\nIt was one of Walcott’s best individual displays as he linked up brilliantly with Wayne Rooney.\nRooney would drop deep, allowing Theo to interchange into the central role he craved to play in. His pace was electric, finishing clinical and it seemed impossible on this evidence that our winger wouldn’t be going to the World Cup.\nHe didn’t get on the plane to South Africa, dropped for Lennon, Milner and Wright Phillips.\nIt was the latest bizarre moment in the international career of Theo Walcott.\nAt 16 he’s taken to a World Cup, despite yet to play a second in the top division. 4 years later when he’s playing in the Champions League, he’s then deemed not good enough.\nHis critics would suggest that Walcott never developed his footballing intelligence from nights like this one in Croatia.\nCapello has since admitted he made a mistake not selecting Theo for the World Cup.\nWalcott, now a free agent at the age of 34, is still to kick a ball at a World Cup.\nSo, Saka is only the 4th Gunner to score a hattrick for England, the first to do so in a Euros qualifier.\nNow is his time for a well-deserved rest.\nDan\nJust Arsenal Show – Alfie and Rob are back for the summer! Here they predict every single Arsenal incoming and outgoing this summer, including fees and potential destinations for outgoings.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 1228,
  "scraped_at": "2026-02-14T01:50:37.797594",
  "_text_extracted": true
}