{
  "article_id": "73fa6e6fa418",
  "url": "https://metro.co.uk/2025/09/20/bukayo-saka-martin-odegaard-injury-latest-revealed-ahead-man-city-clash-24217720/",
  "title": "Bukayo Saka and Martin Odegaard injury latest revealed ahead of Man City clash",
  "date": "20250920T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bukayo Saka and Martin Odegaard both have a chance of returning for Arsenal against Manchester City on Sunday.\nMikel Arteta was giving little when asked for an update on the pair during his pre-match press conference on Friday, revealing both would be assessed after a final training session today.\n‘If there is a chance, it will be after tomorrow’s session because they haven’t done anything yet, so we’ll have more information tomorrow,’ the Gunners boss said.\nArsenal have been without Saka since the second week of the new Premier League season.\nThe England international was forced off in the 5-0 victory over Leeds United in mid-August. Having missed three months of last season with a hamstring tear that required surgery, there were fresh fears for the winger but there was encouraging news when scans revealed his latest problem was not as bad as first feared.\nReports claimed Saka was facing a spell of three to four weeks out, a timescale that leaves him in contention to return to action tomorrow.\nAnd Stephen Smith, CEO and founder of Kitman Labs which specialises in injury welfare and performance analytics, believes the winger will be pushing for a place in the squad.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSmith initially diagnosed Saka’s hamstring issue as a grade 1 or a low-level grade 2, fitting into that initial three-to-four-week timeline.\nOf a possible return this weekend, Smith told Metro: ‘It keeps within that timeline for a grade 2 hamstring strain so that is probably about right. So it is likely they are targeting, or at least having a very good look to see, if he can have some involvement in the City game.’\nOdegaard meanwhile was forced off in the first-half of Saturday’s 3-0 win over Nottingham Forest after a collision involving teammate Jurrien Timber and Morgan Gibbs-White.\nOdegaard landed heavily on his left shoulder and hwas seen in real discomfort as Arsenal’s medical staff tended to him before he was replaced by Ethan Nwaneri.\nIt was the second time the Gunners captain has been forced off in the first-half this season having also been replaced with a shoulder issue early on against Leeds United in August. After the victory over Forest, Mikel Arteta confirmed it was the same shoulder his skipper had injured.\nMore Trending\nThe Norway international missed the midweek Champions League game against Athletic Bilbao but a possible return this weekend falls just inside Smith’s estimated timeline for his return.\nSmith said: ‘Like with any ligament injury, he will either have a small amount of fibre disruption where it would be a grade 1. If there is a decent amount and there is lots of separation, it is grade 2 and if it was much worse than that, a grade 3, we would be talking about going in and having surgery. From the commentary we have heard [from Arsenal] they are not concerned at all about that\n‘Typical timelines for injuries like that, I would expect that is on the lower grade so a period of 10 to 14 days or even seven to 14 days off the back of that fall. Maybe faster if he didn’t exacerbate things too badly.’\nMORE: Man Utd 2-1 Chelsea: United edge chaotic clash after Casemiro and Sanchez red cards\nMORE: Ruben Amorim told he’d be ‘amazing’ at Premier League club amid Man Utd sack rumours\nMORE: Liverpool 2-1 Everton: Hugo Ekitike on target again as Reds seal derby victory",
  "word_count": 623,
  "scraped_at": "2026-02-14T02:26:56.623902",
  "_text_extracted": true
}