{
  "article_id": "73ff8b0bff27",
  "url": "https://www.liverpoolfc.com/news/opposition-lowdown-girona",
  "title": "The opposition lowdown : Girona - Liverpool FC",
  "date": "20241210T100000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MatchThe opposition lowdown: Girona\nLiverpool meet Girona in their sixth Champions League league-phase contest this evening - here, we take a closer look at the Spanish hosts.\nOpposition view\nIvan Quiros, Girona FC expert\nOn Girona's journey to the Champions League…\nGirona FC is a club founded in 1930, which had generally played in the third and fourth levels of Spanish football. Until 2017 they had not managed to ascend to La Liga. After two seasons in the top division, they were relegated to the Segunda Division once again, but returned in 2022-23. Already with head coach Michel Sanchez, the sole objective was to remain in the league and avoid relegation in the top tier.\nIn 2023-24 the goal was exactly the same - not to be relegated - but the team began to win non-stop and gained great momentum with a spectacular and colourful offensive game. In the end they were fighting to win La Liga, which came as a huge surprise, even breaking some records. For the fans, who have been accustomed to seeing Girona FC at the second, third and fourth levels in the last 20 years, it was a dream come true and something incredible to witness.\nOn the season so far…\nThis season with the departure of several key players (Dovbyk, Savinho, Aleix Garcia and Yan Couto) alongside a plague of injuries for much of the first third of the season, the team is still trying to find rhythm with some new players to Michel's game system. Girona are close to the European positions but have been eliminated in the Copa del Rey and are practically out of the Champions League already, where they have lost all the games so far except against Slovan Bratislava.\nOn the view in Girona ahead of the game…\nIn Girona it was spectacular to be able to play Champions League football for the first time (they had never played in Europe before in any capacity). Now comes Liverpool, the game that the club most wanted to see in the city, of all the rivals in the draw. The city is both anxious and hugely excited for this game.\nOn head coach Michel's playing style…\nMichel is a coach who plays with touch football, it is very associative and combinations, creating superiorities inside with the two laterals (wingers). Possession of the ball is their priority. Girona usually play with a 4-2-3-1 in defence, which then changes to a 3-4-3 in attack.\nEveryone contributes in this system but I would highlight Krejci, Miguel Gutierrez, Ivan Martin and Bryan Gil for players Liverpool fans should look out for. Unfortunately, two of the best in the team, Yangel Herrera and Viktor Tsygankov, are out injured.\nPredicted line-up...\nGazzaniga; Arnau, David Lopez, Krejci, Miguel Gutierrez; Oriol Romeu, Ivan Martin; Asprilla, Van de Beek, Bryan Gil; Stuani.\nRecent form\nIn La Liga, Girona sit ninth in the standings having won six, drawn four and lost six of their 16 games to date.\nThey were beaten 3-0 by Real Madrid on home soil at the weekend and also exited the Copa del Rey in the midweek prior on penalties against Logrones.\nIn the Champions League, they have one victory from their opening five fixtures, which came against Slovan Bratislava, alongside four defeats.\nThey were beaten at Sturm Graz last time out in European competition in late November.\nWhat they said\nMichel, Girona head coach\n\"Liverpool are absolutely dominant, leading the Premier League and the Champions League. It's a historic match - a game to enjoy, but also to compete in. In football, anything can happen.\n\"I want us to be aggressive with and without the ball, to have the mindset to recover as quickly as possible. We want to get the crowd excited from minute one.\n\"They are a very, very hard team to stop. But with our excitement and motivation for this game, we cannot let the opportunity pass.\"\nPre-match stats\nGirona are Liverpool's 138th different opponent in European competition.\nThe Reds have played 447 minutes since last conceding a goal in the Champions League.\nGirona have won eight of 23 matches played so far this season and failed to score in 10 of those.\nIn all competitions, Girona have won 21 of their last 30 home matches, with six losses and three draws.",
  "word_count": 719,
  "scraped_at": "2026-02-14T02:20:49.375917",
  "_text_extracted": true
}