{
  "article_id": "74327fbd95be",
  "url": "https://www.liverpoolfc.com/news/arne-slot-press-conference-team-selection-wirtz-impact-salah-jones-and-more",
  "title": "Arne Slot press conference : Team selection , Wirtz impact , Salah , Jones and more",
  "date": "20251024T133000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Round-upArne Slot press conference: Team selection, Wirtz impact, Salah, Jones and more\nRead a round-up from Arne Slot's press conference ahead of Liverpool's trip to face Brentford in the Premier League.\nThe Reds travel to Gtech Community Stadium on Saturday evening for an 8pm BST kick-off as they return to domestic action following a 5-1 Champions League win at Eintracht Frankfurt in midweek.\nAhead of the contest, Slot sat down to answer questions from reporters at the AXA Training Centre on Friday morning, covering a range of topics.\nRead a round-up of what he had to say below…\nOn the importance of Florian Wirtz's impact and assists in midweek...\nI find this always a bit funny because his second assist we call that an assist, and the one we scored against [Manchester] United, that's not a goal involvement for him, where I felt that was more difficult to do what he did against United than what he did for the 5-1 [against Eintracht], but the assist at 4-1 was good. I think his general game was something I - and I think the Liverpool fans - liked.\nWe've seen more of that already, but as always if you lose a game of football and you do the same things as when you win it, the focus is on the negative. If you win a game of football 5-1 because you scored two set-pieces then all of a sudden everybody is talking about the few good attacks we had during the game. I said many times against United and against Frankfurt, from open play we generated the same amount of chances, but the difference was that we didn't concede a set-piece but we scored two.\nOn how difficult it has been for him to settle on his best line-up this season...\nIt's not only about new signings and that changes things. It's about a lot of very good players, so what is your best line-up? A lot of things go into that. The team you face, the tactics the other team plays with, the form of the player and the connections between the players. I think if you look at all the big clubs in the world, they all have more than 11 players that can play a game. For me, it has always been something I expected after the many changes we've had during the summer that it could [take time], also even after we won seven games in a row.\nI always felt like as a team you need to grow and if you have to grow and adapt to each other you can also have moments in the season where things are a bit more difficult, especially if the fixture list is as it was. When we've lost four, I said to myself that three of them were away and then I was looking at the schedule and I thought, 'Oh, another two away games coming with Frankfurt and Brentford on the fixture list!' These things also take into account that you can have a little bit of motive. It's always normal if you have a lot of changes that things go well [and not well], but we have to find a way of growing together and then when things click we need to be the best team we can be.\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeOn whether it has been a difficult moment for Mohamed Salah...\nI think it's been a difficult moment for all of us. No-one is used to losing, for all the players that have played here for so many years and even for the new players as well because we started the season with seven wins. If you start to lose once, that's a difficult moment for everyone, let alone if you [lose] twice, three or four times.\nOn Curtis Jones setting a Champions League passing record for Liverpool and how important he has been...\nI'm not so surprised that he touched the ball a lot because I positioned him and Dom [Szoboszlai] a bit lower because we missed out on Ryan [Gravenberch]. We faced again a team that was playing in a very low block and didn't press us at all. If you're then 3-1 up, you start to pass the ball because you're just waiting for them to find a moment and that's always nicer than when you're 1-0 down and face that low block because then you need to take more risks.\nCurtis, since I'm here I think his playing time went up. There's a reason for that, because I like how he progresses, but still with him, and it's the same question you can ask about every player; he's in competition with five to six very good midfielders. It's good to see he played a very good game against Frankfurt.\nOn his confidence that Salah will be back on the scoresheet regularly soon...\nI don't know if it's sharpness or not. It's so difficult for me to say why this is. I could come up with a few reasons but I am not sure they are the reasons. In general in football, players miss chances and Mo is a human being as well. We're not used to him missing chances, let alone a few games in a row, but these things happen. What could have to do with it - and I have no clue if it does - but I could come up with maybe it is easier to maybe finish a chance if you are 3-1 up than if you are 1-0 down, but maybe that is completely not true for him, but could, could, could.\nThe main thing is that Mo has always scored goals for our club. The last thing I worry about is Mo starting to score goals again because that's what he's done his whole life and what I expect him to do in the upcoming weeks and months for our club as well.\nOn whether changes to the squad have had an impact on Salah's form...\nIt could. Not particularly maybe the right full-back, but it could [be], by the way, because maybe his whole Liverpool career he played with Trent [Alexander-Arnold], so it could. But, like you just said, he has been in promising positions often enough for him to score goals. Maybe with Trent even more, I don't know, but I think in general for every player if you have quite a few changes in your squad during the summer then everyone needs to find new connections again and that normally goes like this a little bit.\nMo is not an exception to this because he's also a human being like all the others, so it might have something to do with that, but yes, like you've seen now again, in an ideal world you play every single time with the same team [but] that's not realistic for a team that plays every three days. Even if you would want to, it wasn't possible because Jeremie Frimpong has been in and out with injuries a few times, Conor Bradley has been in and out with injuries, let alone [Alexis] Mac Allister missed out on pre-season and Alex [Isak]. So, I think it might be one of the reasons why we haven't been as consistent as we were last season.\nOn making changes against Frankfurt and whether they came from having had time to assess the summer signings in training...\nA bit of everything I would say. It was maybe also the first time there was an opportunity to play with both Alex and Hugo [Ekitike] because of Alex missing out for so long. We thought this was the first time he was ready to play twice in a row, so that is also an extra reason but yes, you always look at the opponent you face and against Frankfurt we thought, I thought, they might be a bit vulnerable in and around their centre-backs when it comes to pure speed.\nIf there is one thing you can say about Alex and Hugo it is they are fast, especially after seeing the first goal Hugo scored. I don't think we did so many things different, the only thing we maybe changed was instead of playing with a nine and 10 behind each other they were closer to each other with two No.9s. We still had one winger on the left side with Cody Gakpo and our right winger, Florian Wirtz, who hardly played as a right winger and had more of a free role. Small margins I think were different. For the rest, I think we've mainly played similar to how we played last season with maybe the difference that certain players, certain new players, bring different characteristics.\nOn coming up against Caoimhin Kelleher on Saturday, and whether he's pleased to see him doing well since leaving the club...\nMaybe a goalkeeper is an exception, but in general I don't think it's a healthy situation for a player to be on the bench longer than a year or miss out on many games in a year and then go into a next season. It's so hard for them to keep giving everything on a daily basis. So, that was also one of the reasons why we thought it was best for Jarell Quansah, for Harvey Elliott to find another club.\nFor Caoimh, like I said, goalkeepers are a bit of an exception, but he did this for so many years that he felt it was time for him to start playing - and he has shown that he is right because he is doing really well. And although I haven't worked with him, we are also going to face Jordan Henderson. In Holland they cannot stop talking about how much Ajax is missing Jordan Henderson, so that tells you how important he was for Ajax and how important he has been for Liverpool and how important he now is for Brentford.\nOn Milos Kerkez starting every league game so far this season and what is 'giving him the edge over Andy Robertson'...\nI don't think that's a place for me to say this here, because then I have to say something about Robbo as well. The reason why we brought him in, that I can tell you, is that he is bringing a lot of energy to the game, keeps going up and down. And he's very well in defending the one-v-one situations against his wingers as well. So, defensively solid and a lot of energy making the overlaps.\nFor me, he's been a bit unlucky that Cody has used mainly his biggest strengths of coming inside and hitting the target, but we've shown Cody as well that there were a few moments that maybe playing the ball towards Milos would have been a better option. So, again, an example of two players playing together that need to find their connection even better than they already do. That's why we brought him in and I think that's a better answer to your question than starting to compare him with Robbo.",
  "word_count": 1860,
  "scraped_at": "2026-02-14T01:52:49.015675",
  "_text_extracted": true
}