{
  "article_id": "74396ff0025d",
  "url": "https://punchng.com/chelsea-vs-servette-key-facts-ahead-of-conference-league-clash/",
  "title": "Chelsea vs Servette : Key facts ahead of Conference League clash",
  "date": "20240822T143000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea, England’s second most successful club in European football with eight trophies, returns to continental competition after a one-year absence.\nThe Blues must overcome Swiss side, Servette, over two legs to secure a spot in the UEFA Conference League group stage, starting with the first leg at Stamford Bridge tonight (8 pm Nigerian time).\nThis is only the third time Chelsea has faced such a play-off under UEFA rules, with previous encounters in the Champions League, both successfully navigated.\nVisitors Servette, who recently lost a Europa League play-off to Braga 2-1 on aggregate, risk being eliminated from two UEFA competitions within weeks.\nServette’s best-ever European run saw them reach the quarter-finals of the 1978/79 Cup Winners’ Cup. Their last meeting with an English side was 50 years ago, losing 6-2 on aggregate to Derby County.\nChelsea, who welcomed back attacker Joao Felix on Wednesday, have a strong home record in Europe, winning 10 and drawing three of their last 15 matches at Stamford Bridge, with only two defeats to Real Madrid.\nThe Chelsea vs Servette match also marks Chelsea’s head coach Enzo Maresca’s debut in European competition.\nMaresca, a key figure in Manchester City’s Champions League success in 2022/23, will be managing his first European game for Chelsea after taking over the reins.\nHowever, the Blues will be without Reece James and Wesley Fofana, with Maresca opting to rest the latter. New signings and late-returning internationals are edging closer to full-match fitness, and Pedro Neto is expected to be involved.\nThe Chelsea vs Servette second leg will take place in Geneva next Thursday, with the draw for the six-match, 36-team league phase to follow on Friday, August 30.\nThe Conference League final is scheduled for May 28, 2025, in Wrocław, Poland, with the winner earning a place in the following season’s Europa League.\nHistorically, Chelsea and Servette have only met twice before, both in Geneva shortly after World War II. Chelsea won the first encounter 2-0 in 1946, while Servette claimed a 1-0 victory in 1954.\nCompetitively, Chelsea has faced Swiss opposition six times in Europe, including matches against Basel and St. Gallen.\nChelsea hold the highest UEFA coefficient (79.00) of any club left in the Conference League, far ahead of Servette’s ranking of 139th (9.00).",
  "word_count": 376,
  "scraped_at": "2026-02-14T02:10:58.954815",
  "_text_extracted": true
}