{
  "article_id": "7460b6d75aae",
  "url": "https://www.justarsenal.com/why-trophies-matter-more-than-performance-for-arsenal-right-now/409304",
  "title": "Why trophies matter more than performance for Arsenal right now",
  "date": "20260205T113000Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Well lovely Arsenal people, after six very long years, we are back in a final. We went into the game defending a one goal lead and Chelsea delivered one of the worst performances you will see from a team needing a result, giving Arsenal the win they needed to reach the Carabao Cup Final. That was quite the tactical approach from Rosenior, wait 70 minutes and then hope substitutions magically turn the game.\nBut I want to bring some perspective. Arsenal have been guilty of the same thing. This match reminded me of the Europa League semi final against Villarreal, when we went into the second leg needing a response and produced absolutely nothing in attack. We have delivered criminal performances like the one Chelsea produced here.\nEven recently, we have squandered opportunities to open a bigger gap at the top of the table. My concern remains that at times we do not look willing to throw the kitchen sink at games. In some matches, it feels like we are doing the bare minimum required to get the result.\nWinning versus watching\nWe live in an era where everything is min maxed, and football is no exception. Gary Neville suggesting Arsenal were the team that needed to attack more was utterly shocking analysis, though sadly not unexpected from the mainstream media these days. Where I will partly agree is that the brand of football is not always great to watch.\nThat game was a tough watch. So were Liverpool, Forest, United and even Leeds before we scored from a corner. Growing up loving Arsenal for silky players, attacking football and being branded the little Barcelona during their era of dominance, I have to admit this version of Arsenal football is not my cup of tea.\nThat said, if this is what it takes to win a league title, so be it. I am starving for success. I will take it any way it comes.\nWhy trophies matter now\nThis is why the Carabao Cup means so much to me. Not only have I never seen Arsenal win it, but this squad is simply too good not to have trophies to its name. Trophies are what separate good teams from great ones. Winning is a habit that needs to be built.\nI hope we can edge past City and lift this trophy, because it could open the floodgates for more success to follow.\nI also want to highlight two players who stood out for me in an otherwise uneventful game. Gabriel Martinelli showed the right attitude. He was one of the few who did not look like he was saving himself for something bigger. Right now, I think he deserves to start ahead of Trossard.\nThe other was Hincapie. Left back has been a revolving door this season, and consistent runs are rare, but he was excellent.\nFinally, Havertz holding up the Arsenal badge was shameless and I absolutely loved it. He won the Champions League at Chelsea, scoring the winner and cementing himself in their folklore, yet he rubs it in every time we play them. After watching so many players leave Arsenal for bigger and better things over the years, it felt incredible to be the club on the rise, mocking Chelsea along the way.\nWhat matters more to you right now, the style of football or simply winning at all costs?\nMitov\n_____________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 639,
  "scraped_at": "2026-02-14T02:09:42.989117",
  "_text_extracted": true
}