{
  "article_id": "7471e5655f2a",
  "url": "https://www.abc.net.au/news/2023-04-01/fifa-tells-broadcasters-to-put-their-money-where-their-mouth-is/102175474",
  "title": "FIFA condemns broadcasters and sponsors for not investing equivalent funds on Women World Cup as men event in Qatar",
  "date": "20230401T001500Z",
  "domain": "abc.net.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "analysis\nFIFA condemns broadcasters and sponsors for not investing equivalent funds on Women's World Cup as men's event in Qatar\nThe 100-day countdown to the FIFA Women's World Cup is looming, but when it comes to broadcast-rights deals, the number 100 is significant for another reason.\nFIFA says it represents the difference between the millions of dollars offered by some TV networks to cover the men's game versus the women's game, despite delivering around 80 per cent of the same audience.\nTo be defined as a 'serious emerging market', according to Deloitte's Sports Business Group, the value of TV rights and sponsorship needs to crack $US1 billion ($1.5 billion).\nFIFA President Gianni Infantino told the recent football congress in Kigali, Rwanda, that while his organisation is on \"an historic journey\" to prize money equality, it is the broadcasters and sponsors that are lagging in achieving that goal.\n\"This year for FIFA is the year of women,\" Mr Infantino told his delegates.\n\"We would all like that the Women's World Cup in Australia and New Zealand be a celebration — a celebration of football, a celebration of women's football, a celebration of progress, a celebration of equality, a feast for everyone.\n\"Now comes … the most difficult step, the most complicated step, the step that will take the longest time … to have equality in payments for the 2026 men's and 2027 women's World Cup, this is the objective we set ourselves.\nIn 2015, prize money at the Women's World Cup was $US15 million ($22.6 million), and for 2023 will be $US150 million ($226 million). But if parity is to be reached at the next World Cup tournament, it would need to be in excess of $US400 million ($598.5 million).\n\"FIFA is stepping up but, unfortunately, this is not the case for everyone. Broadcasters and sponsors need to do more in this respect, because it is easy to criticise, it is a bit more difficult to act,\" Mr Infantino said.\nAt the men's most recent World Cup in Qatar 2022, media rights licenses were granted to organisations from 225 territories. For this year's women's World Cup in Australia and New Zealand, that number drops to 156.\nWhen the USA women's team defended its title at the France 2019 World Cup Fox recorded 22 per cent more viewers than those who tuned in for the men's World Cup final the year before. Fox will fly in a team of 250 people to Sydney for their coverage of this year's event.\nWhen England's women's team, the Lionesses, won Euro 2022, the BBC recorded an audience of 17.4 million, making it the most watched women's football game on UK TV. The tournament's global audience was more than 365 million, double the number who watched in 2017.\nDespite audience numbers surging, broadcast offers originally put to FIFA from the UK, Italy, Germany, and France for the 2023 World Cup were rejected for being too low.\n\"Often public broadcasters in big countries offer $US100 million ($149.5 million) or more to broadcast the men's World Cup; they offer us $1 million or less to broadcast the women's World Cup,\"Infantino said.\n\"And at the same time, these same public broadcasters who are paid by the taxpayers' money, they criticise FIFA … for not guaranteeing equal pay to men and women.\"\nOn the back of its Insight report in 2021, the Deloitte Sports Business Group wrote that women's sport was still only worth a fraction of the $715 billion global value of all sport.\nIzzy Wray is the Middle East lead and assistant director of Deloitte's Sports Business Group.\n\"There has been quite a lot of growth in the last decade, and in particular the last few years, but what we've got to remember is it's not easy for new or nascent industries — such as women's sport — to grow quickly,\" she told The Ticket from Dubai.\nDespite the \"noise and talk\" around women's sport, Wray said, \"culture perpetuates the popularity of sport\".\n\"Some of the biggest sporting events in our global calendar for example are the NFL Super Bowl, or the Ashes … they're ingrained in the American and British and Australian cultures respectively and this creates a virtuous circle of engagement … [that] comes from a deep history and culture of those sporting events.\n\"It's going to take time for newer women's leagues, events and competitions to grow in the minds of the general public.\"\nThe arrival of the Women's Premier League (WPL) cricket competition in India this March has challenged some of those perspectives.\nFive franchises forked out a collective $800 million for team licenses, TV rights for five years earned $170 million, and some players were bought at auction for more than $500,000 each for the three-week tournament.\n\"I think the WPL example is a really interesting because if we think of the men's IPL, the average franchise value when that was initially established about 15 years ago was $US89 million ($133 million) and this year, 2023, there were two new men's IPL teams that were established in the league and those were sold for $US780 million ($1.167 billion),\" Wray said.\n\"Clearly, it's a significant growth over those 15 years and if we consider the women's franchise values, they were sold for an average of $US114 million ($170.6 million).\n\"The investors in that league … have probably seen the growth of the men's league … they've seen that this is the potential commercial value that we can generate from investing in another version of the IPL … the women's version.\"\nWray said it was the characters of sport that sell sport, and often those characters were created in the minds of the public through both social and mainstream media.\n\"People want to hear or watch or learn about the big characters that they are interested in, but to create those characters people need to know their stories, their backgrounds. This story telling is going to take time,\" she said.\n\"The prime example … is Serena Williams. If she was in the US Open final, the women's final had greater coverage than the men's final, which is showing you that fans aren't necessarily distinguishing between men's and women's sport but they are interested in watching someone whose got a big character.\"\nThe greater exposure, the greater the revenue. Plus, characters, and controversy, sells. And there's the irony.\nWomen's sport sees itself as a point of difference from the all-too regular controversies in men's sport. It is viewed as safer, a product mostly untainted by badly behaved athletes or fans.\nSo, how close is women's sport to cracking the billion-dollar industry mark?\n\"It's getting closer … but I don't think it will be there this year or the next year. I think I need a crystal ball really to be able to give you a proper answer,\" Wray said.\n\"The one thing I can say is that the women's sport — tennis, cricket, football, rugby are some prime examples, netball as well — are very much on the cycle of the virtuous circle of growth.\"\nThe media generally continues to low-ball the value of women's sport, despite the evidence.\nThe CEO of A-Leagues, Australia's professional women's and men's football competitions, Danny Townsend, said converting interest into investment was a matter of urgency if this country wanted to keep producing world class footballers.\n\"Women's football is primed to explode here … although we are seeing increased interest from all parts of the industry, that interest isn't always translating into direct commercial investment,\" he said.\n\"The need for further investment is urgent to deliver a legacy for the World Cup of a growing and thriving domestic league that will create the next generation of Matildas and give fans the opportunity to have a world class league on their doorstep.\"\nThe rights to Australia's domestic league is owned by Paramount ANZ, though the amount they paid has not been disclosed.\n\"[They] have worked really positively with us and now every single match is available live and free on 10Play — few women's leagues in the world can say the same,\" Townsend said.\n\"We are confident that the value of the rights will continue to increase post the Women's World Cup as people recognise the value of women's sport and the rapidly growing fan community.\"\nFormer Matildas captain Kate Gill is now co-CEO of the football players association, the PFA.\n\"Investing in women's football requires a genuine commitment from the entire industry,\" she said.\n\"At its recent congress, the FIFA president consistently trumpeted the organisation's significantly rising revenues illustrating that the decision to invest in women's football from FIFA is a question of will, not capacity,\" Gill said.\n\"Just as the Women's UEFA Champions League, the Euros and our own Matildas have shown, interest in the women's game is surging, and records will once again be broken in the imminent FIFA Women's World Cup.\n\"The challenge for organisations such as FIFA, leagues and member associations is to capitalise on the rising interest in new and innovative ways to drive value in the women's game.\n\"Sports such as tennis have shown us the benefits of doing so.\"\nInfantino is threatening to maintain a hard-line for those who are still turning a blind eye to the value and potential of women's football.\n\"The news I have for those broadcasters or sponsors who don't want to offer us similar amounts to men's World Cup is simply, well, we are not going to sell women's football and women's World Cup at these prices.\n\"Women deserve much, much more than that. We are here to fight for them, and with them.\"",
  "word_count": 1606,
  "scraped_at": "2026-02-14T01:48:06.472506",
  "_text_extracted": true
}