{
  "article_id": "747322339e06",
  "url": "https://www.bucksfreepress.co.uk/highwycombe/24601923.wycombe-wanderers-could-year-2005-06/",
  "title": "Wycombe Wanderer  could have been year  in 2005 / 06",
  "date": "20240924T084500Z",
  "domain": "bucksfreepress.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wycombe Wanderers and Aston Villa have only met four times in a professional capacity, and each occasion has been memorable.\nThe first two fixtures, which were both in the League Cup in September 2003 and September 2005 respectively, ended with an incredible aggregate score of 13-3 to the Premier League side.\nThe first concluded in a 5-0 victory for the Villans, whilst the second resulted in an 8-3 triumph for the Midlands team.\nBoth games took place at Adams Park.\nFast forward 10 years later, the two would meet again but this time in the FA Cup.\nWycombe managed to get rid of the ghosts from the previous decade with a very commendable 1-1 draw in Buckinghamshire, before losing 2-0 in the replay at Villa Park a week and a half later.\nNearly nine years on, they will meet again but in different circumstances.\nWanderers have had a year in the Championship and have had three trips to Wembley in five years, whilst Villa were relegated from the Premier League, returned within three years, lost an EFL Cup final, and are now in the Champions League.\nSpeaking ahead of Tuesday’s match, Wycombe boss Matt Bloomfield said: “It will be a brilliant occasion because under the lights at Adams Park on a slick pitch, with the way Villa play, with an incredibly talented manager and squad…it’ll be a good occasion.”\nThe 40-year-old joined the Chairboys three months after the first encounter between the two teams in 2003, but played in that amazing 11-goal thriller 19 years ago, which saw Wycombe lead 3-1 at half-time.\nBut seven second-half strikes from David O’Leary’s men capped off an incredible turnaround.\nReflecting on that fixture, Bloomfield told the Free Press: “I remember walking in at half-time with the group that we had, some of whom I am still close mates with.\n“We were excellent that first half and I just remember John [Gorman], had us playing this style and a brand of football which was so enjoyable to play in.\n“Looking back now, we might have put a little bit too much in that first-half!\n“I remember at the start of the second-half, a couple of Villa goals went in, and our legs went.\n“Before we knew it, we were on the end of eight goals.\n“Of course, it ended in disappointment, but the fact that people still talk about it to this day, it must have been some game to watch.\n“That was one of the best 45s followed by one of the worst 45s in my career – but that night certainly created some memories.”\nThe 2005/06 season remains one of the biggest ‘what could have been' years for the club, as off-field tragedies impacted on-field successes.\nThe club went on a 21-game unbeaten run in the league from the start of the campaign until the middle of December, before losing for only the second time at the start of January.\nWanderers, who were now in their second season as a League Two side following relegation to the fourth tier in 2004, were very much one of the favourites to secure promotion back to League One before two life-changing events impacted the team.\nIn the early hours of Saturday, January 14, 2006, Wycombe midfielder Mark Philo was driving his car in Wokingham when he was involved in a car crash.\nThe vehicle he had been driving ventured onto the wrong side of the road and collided with another car.\nThe latter was being driven by 58-year-old, Patricia Gammon, who sadly died at the scene.\nPhilo, who was only 21, would later succumb to his injuries that afternoon in hospital, passing away during the Chairboys’ 2-0 home victory against Notts County at Adams Park – a match that Bloomfield played in.\nThe players were told about his death not long after the match had ended.\nSeveral months later at the inquest, it was revealed that Philo had been over the drink-drive limit.\nRoughly six weeks later on Sunday, February 26, Myra Gorman, the wife of Wanderers manager John, lost her brave battle with cancer.\nFollowing the victory over Notts County in mid-January, Wycombe would only win four of their next 21 games which included suffering six straight league losses.\nA play-off place was secured, but the Chairboys fell short to Cheltenham Town in the semi-finals, losing 2-1 on aggregate.\nLooking back, Bloomfield said: “That season had a fine line of euphoria and devastation due to the tragic circumstances that happened.\n“We had a very talented young football team led by one of the best men in football, we had some tough moments to deal with as a group.\n“And through those tragedies, they created some bonds for life as I still speak to some of that group today.\n“I have never experienced devastation like it.\n“I have never experienced, and I hope I never experience a post-match talk like that ever again.\n“It was incredibly sad.\n“With John, he was a manager that we adored.\n“We wanted to do well for him.\n“We had a young team, and we all wanted to do well, and some of those boys played in the Premier League and have since gone into management.\n“Those tragedies brought us closer together and we’re sure we’ll be friends for years.”\nLooking back at the FA Cup matches, he concluded: “I spoke to the gaffer [Gareth Ainsworth], on the morning of the Cambridge game as I heading into Adams Park, just to catch up and we spoke about that day.\n“One of my memories from that day was that we knew Villa were in a bad place that day, so we played off that and got the goal.\n“We defended well and got the goal which helped us – it was a different game to the one under John, but the gaffer [Ainsworth], made us believe.”",
  "word_count": 975,
  "scraped_at": "2026-02-14T02:08:12.421664",
  "_text_extracted": true
}