{
  "article_id": "74a857bbb4c5",
  "url": "https://www.westmeathindependent.ie/2025/10/18/brett-hails-resilience-of-players-as-town-aim-for-double-glory/",
  "title": "Brett hails  resilience  of players as Town aim for double glory",
  "date": "20251018T130000Z",
  "domain": "westmeathindependent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brett hails 'resilience' of players as Town aim for double glory\nAfter a season which has already brought rich reward, Athlone Town will aim to finish their competitive campaign in true style when they play Bohemians in the Sports Direct Women's FAI Cup final in Tallaght Stadium on Sunday (kick-off: 3pm).\nAthlone claimed the Women's Premier Division title with two games to spare and are now just one competitive fixture from claiming a first league and cup double, in the process making more history for the club.\nAmid the quest to successfully retain their league title, Athlone tasted European football, their UEFA Women's Champions League qualifying round defeats of Cardiff City and Croatia champions ZNK Agram instilling belief and momentum as the season progressed. The club's European journey ended with defeat by Glasgow City in the Europa Cup, but the loss did not deter the players who immediately turned their focus towards winning successive Premier Division titles.\nAhead of the blue riband fixture on Sunday, assistant manager Gordon Brett praised the players for the resilience they have shown during throughout the season.\n\"First and foremost, John (Sullivan) and I are privileged to be working with such an amazing squad of players. We have been extremely consistent in our performances during the season and showed resilience in certain games when it was needed most,\" Gordon said.\nWith one piece of silverware now resting in the club's trophy cabinet, Gordon believes that the pressure on his players has \"eased a little\" and they can look forward to game with less tension.\n\"We have a rock solid defence who have conceded just ten league goals, while our attackers play with great flair. In the main, the team's main characteristic is resilience and that was very much on display when we defeated Shelbourne in Tolka Park a couple of weeks ago to essentially seal the league title. We came under pressure in the second half but the players stood up to the challenge and that was the difference in that game,\" said Athlone native Brett.\nGordon acknowledged that the European run of fixtures, while exacting from a fatigue perspective, also allowed the players to build momentum at a crucial stage of the season.\n\"Our European run allowed us to unload from a training perspective but as a management team we also had to manage the dynamics of the squad. Ultimately, I would look at our European journey positively and we gained confidence from the additional games,\" Gordon said.\nDespite the sudden departure in September of former manager Colin Fortune, Gordon said the players remained focused on the task in hand and have continued to produce performances and results when the need was most.\n\"Colin did a fantastic job as manager and John has also brought his qualities to the role since his appointment,\" said Gordon, who also highlighted the fitness levels of the players as a key factor.\nLooking towards Sunday's final, Gordon said the players will be determined to finish the season on a high, but he warned that Bohemians will provide \"stiff opposition\".\n\"Bohemians have enjoyed a really strong end to the season. They reached the All-Island Cup final and they were tough opponents for us during the league season. Our last meeting was a 2-2 draw in Dalymount Park so we are well aware of the threat that they will pose on Sunday,\" Gordon said.\nThere is a \"certain magic\" to winning a cup final and to that end, Gordon said the players who experienced that winning feeling in 2023 will want to replicate those emotions this weekend.\n\"We have a lot of experience from that 2023 win in our squad and they, along with all the players, will want to add a second piece of silverware to our achievements this season and sign off the year in style,\" Gordon concluded.",
  "word_count": 640,
  "scraped_at": "2026-02-14T02:21:48.749781",
  "_text_extracted": true
}