{
  "article_id": "74dbf2485363",
  "url": "https://www.geosuper.tv/latest/25161-fifpro-opens-up-about-congested-fixtures",
  "title": "FIFPRO opens up about congested fixtures",
  "date": "20230608T200000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nJune 08, 2023\nFIFPRO, a worldwide representative organisation for 65,000 professional footballers has stated that football needs to protect players from \"dangerous levels of fixture congestion\".\nA report by the players' union indicated that about half the players at last year's World Cup (WC) in Qatar experienced extreme or increased mental fatigue saying that players had little time to prepare or recover from the WC.\nIt must be noted that UEFA are proposing a new Champions League (CL) and Club World Cup (CWC) format that could pose a further threat to player well-being.\nThe number of teams in the CL group stage will rise from 32 to 36, and a team could play up to 17 matches, instead of the current 13 if they reach the final.\nA new CWC format, starting from the summer of 2025 includes 32 teams and is due to be played every four years, and could see teams play seven extra games to reach the final.\nFifpro's Player Workload Monitoring (PWM) report, which used data from 1,800 professional footballers, added: \"The reforms of the two major tournaments will ultimately increase the number of games played by top players who could conceivably feature in both.\n\"This poses a threat to the well-being of players who are already pushed to their limit with the current international match calendar.\"\nAccording to the report, about 44% of players experienced more physical fatigue and 23% more mental fatigue in January compared with other seasons, while 53% felt more likely to suffer injuries.\nManchester United and France defender Raphael Varane who had to play for his club eight days after the World Cup final was included in the report as a case study,\n\"The calendar is already more than full. The players are overworked, and it will get even worse,\" said Varane, who retired from international football in February aged 29.\n\"I'm afraid that we will witness much shorter careers and that players will have to give up the France team very early because, physically or mentally, what we are asking for today is simply beyond limits,\" he concluded.\n\"I'm afraid that we will witness much shorter careers and that players will have to give up the France team very early because, physically or mentally, what we are asking for today is simply beyond limits.\"",
  "word_count": 387,
  "scraped_at": "2026-02-14T01:48:17.235546",
  "_text_extracted": true
}