{
  "article_id": "7522ad8d2a3d",
  "url": "https://ianslive.in/uefa-champions-league-final-kick-off-moved-early-for-2025-26-season--20250828164221",
  "title": "UEFA Champions League final kick - off moved early for 2025 - 26 season",
  "date": "20250828T130000Z",
  "domain": "ianslive.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nyon, Aug 28 (IANS) UEFA announced on Thursday that starting with the 2026 final in Budapest, the Champions League final will kick off three hours earlier at 18:00 CET instead of 21:00 CET.\nThe decision is designed to enhance the overall matchday experience for fans, teams, and host cities by optimising logistics and operations, while delivering several tangible benefits. Our goal is to make matchday a truly enjoyable experience for everyone who wants to be part of the excitement, while creating a welcoming atmosphere that makes it easy for families and children to attend the biggest and most important club football match of the season.\n\"For travelling supporters, it will mean improved access to public transport – especially after the match – and a safer, more convenient journey back from the stadium. For the host cities, it will boost the positive economic impact of the event by giving fans the possibility to continue their celebrations,\" UEFA said in a statement.\n\"The new kick-off time also aligns with a more accessible broadcasting window, helping the final reach an even broader television and digital audience worldwide, with a particular focus on engaging younger viewers,\" it added.\nUEFA President Aleksander Ceferin said, \"With this change, we are placing the fans' experience at the heart of our planning. The UEFA Champions League final is the highlight of the football season, and the new kick-off time will make it even more accessible, inclusive, and impactful for everyone involved.\n\"While a 21:00 CET kick-off is well suited for midweek matches, an earlier kick-off on a Saturday for the final means an earlier finish - regardless of extra time or penalties - and offers fans the opportunity to enjoy the rest of the evening with friends and family, reflecting on the game of the season.\"\n--IANS\nab/bsk/",
  "word_count": 300,
  "scraped_at": "2026-02-14T02:15:40.834949",
  "_text_extracted": true
}