{
  "article_id": "7542c3d6f856",
  "url": "https://timesofmalta.com/article/subbuteo-still-alive-flicking.1099008",
  "title": "Subbuteo still alive and flicking",
  "date": "20241006T081500Z",
  "domain": "timesofmalta.com",
  "source_country": "Malta",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Subbuteo’s still alive and flicking\nJames Calvert joyfully waltzes down memory lane after discovering a resurgence of the game whose heyday was in the 1970s and 1980s\nLast week I wrote a little light-hearted piece about the recent world jigsaw championships, going on to say how I would like to see a different board game sport included in the Olympics every four years.\nIt was only meant in a sort of tongue-in-cheek sort of way but, to be fair, a lot of you got in touch to say you would be extremely happy to see absolutely anything take the place of the walking race, even a hotly contested game of Snap.\nBut in among the messages and e-mails there was one word that kept repeating itself – Subbuteo.\nMy word, I haven’t thought about Subbuteo for years.\nWhat a cracking game that was back in the day. The soft felt football pitch, the fragile goals, the tiny plastic players, the ‘electronic’ scoreboards, the goalkeepers on sticks, the blue tack in the corners. Oh, the memories! I must have spent a thousand hours playing that game as child, flicking small footballers around until my fingers went numb. Or their bodies snapped.\nAfter waltzing down memory lane, I obviously needed to find out what happened to the game. Does anyone still play it? Have video games entirely killed Subbuteo? Do they even make it anymore?\nWell, I can tell you, and I am overjoyed to report this: Subbuteo is alive and flicking – mostly in England, but in quite a few other countries as well.\nAnd, in many ways, it has the pandemic to thank for a recent resurgence.\nI guess that people stuck at home got fed up with doing everything online and entertaining themselves digitally, and dug out their old board games to kill the time. And that must have included dusting off many old Subbuteo sets, because from the beginning of the pandemic to date, membership of the English Subbuteo Association grew from 500 to 4,000, and the number of active clubs in the country shot up from four to 50.\nOf course, that is still a long way away from the game’s heyday in the 1970s and 1980s when it felt like every dining table in every home on the planet had become a temporary, tiny football stadium. But it’s nice to see Subbuteo making a bit of a comeback.\nIn fact, just a couple of weeks ago the Subbuteo World Cup took place in Royal Tunbridge Wells, which is where the game was invented in 1946, with players from 15 countries taking part (England got knocked out in the quarters, in case you were wondering).\nIt might not be on par with the magnitude of the Jigsaw tournament (3,000 people, 70 countries) but it’s much easier to sit down and do a puzzle than it is to set up a Subbuteo game for a variety of reasons, not least of which being that you need an opponent to make the game work properly.\nBut anyway, enough of this trip down memory lane. I have things to do. That online order for a Subbuteo set isn’t going to confirm itself...\nTen Hag’s final fling\nBy around 5pm this afternoon there is a reasonable chance we will know if Manchester United are in the market for a new manager. In the wake of last weekend’s awful defeat to Tottenham Hotspur, it was widely accepted that Erik ten Hag would have two games to save his job: Thursday’s Europa League clash with Porto and today’s ominous trip to Aston Villa.\nObviously, there was no official proclamation from the club that this was the case. But there aren’t many who don’t feel it was an unwritten ultimatum.\nGame one didn’t go smoothly with United squandering a 2-0 lead, having Bruno Fernandes sent off and, while they did ultimately sneak a 3-3 draw in injury time, the performance only served to highlight the depth of the club’s problems.\nThis afternoon they take those same problems down the road to Villa Park where the home team will be full of beans following their Champions League victory over Bayern Munich.\nErik and his team may surprise us all by putting in a job-saving performance. But I am just not seeing it. My prediction: a comfortable 3-1 win for the home side.\nAnd will that spell the end of his United career? Not certainly, but very likely.\nTesting times for Lee Carsley\nI could rant a little about the fact that we are heading into yet another international break, but that would very much be a case of me flogging the same dead horse I flogged last time.\nAlthough the fact that ‘last time’ was only four weeks ago does kind of prove my point that these disruptions to the domestic calendar are way too regular.\nBut let’s leave that aside for now and, instead, focus on England’s upcoming matches with Greece and Finland in the Nations League.\nThis is essentially part two of Lee Carsley’s three-stage audition to get the role full time. He passed the first test pretty easily and, if we are going to be brutally honest, there is nothing to fear from games against Greece and Finland.\nHowever, there is a bit of a twist that could make the next week more interesting – the squad. Why? Well, last time Carsley had it easy. Injuries deprived him of several of his superstars, so he didn’t have too many controversial decisions to make.\nAs we all know, the biggest single question hanging over the England team is how to get the most out of the embarrassment of attacking riches they have at their disposal. But in the September break that problem was temporarily solved with Phil Foden, Cole Palmer, Jude Bellingham and Ollie Watkins out injured.\nNow all four are back, and you would have to say that at least three of those are world-class players who would walk into most international teams.\nShowing he knows how to make the best use of those four, plus Saka, Harry Kane, Jack Grealish and Anthony Gordon, is unarguably his biggest challenge, far more than winning the matches themselves.\nYou sense it is how he handles the team, rather than the results themselves, that will determine whether the FA, the fans and even the players decide he is the right man for the job.\nLet’s see what happens. I have a sneaky feeling Mr Carsley may have a ‘playing people in weird positions’ trick up his sleeve.\nE-mail: James.calvert@timesofmalta.com\nTwitter: @maltablade",
  "word_count": 1096,
  "scraped_at": "2026-02-14T02:01:51.719426",
  "_text_extracted": true
}