{
  "article_id": "757a2c7a6106",
  "url": "https://timesofmalta.com/article/wenger-daylight-rule-var-antidote.1109473",
  "title": "Wenger daylight rule could be a VAR antidote",
  "date": "20250511T071500Z",
  "domain": "timesofmalta.com",
  "source_country": "Malta",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wenger's daylight rule could be a VAR antidote\nArsene Wenger’s proposed tweak could bring back some of the excitement\nAs an avid follower of English football over the past few decades it’s almost impossible not to have some sort of soft spot for Arsene Wenger.\nFair enough, he was probably never flavour of the month among Tottenham Hotspur fans, and supporters of other top clubs would have found his successes – especially during the early years – irritating.\nBut he brought all sorts of new thinking to the English game, revolutionising many aspects of the sport, from training to diet to tactics. And despite reigning at the Gunners for an incredible 22 years, he never lost his love for innovation and his appetite for making football better.\nHe isn’t involved in day-to-day management anymore but, as FIFA’s head of global development, he is still trying to find ways of improving the sport, as we saw last week with the news that he is trying to push through changes to the offside rule.\nWenger is suggesting the laws need a revamp, with forwards considered onside provided any part of their body is in line with the defender when the ball is played. It is being called the ‘daylight rule’, on the basis that unless you can see daylight between the players, the striker is onside.\nI can’t tell you how much this would improve the game.\nBefore VAR, strikers got the benefit of the doubt when it came to offside decisions, and if a linesman thought they were in line he was expected to rule in the attacker’s favour. And he normally would.\nHowever, since VAR came in, the law has been interpreted way too accurately, meaning we have been plagued with goals being ruled out because the attacker’s nose was a fraction of a centimetre ahead of the bulge in the defender’s shorts.\nIt is one probably the single most irritating thing about the video assistant system, which is quite impressive considering the list is so extensive.\nWenger’s plan would go a long way towards redressing the balance, making football a tiny bit more like it was before video replays decided to suck all the excitement out of it.\nWe have been plagued with goals being ruled out because the attacker’s nose was a fraction of a centimetre ahead of the bulge in the defender’s shorts\nIn an ideal world this change would be implemented right now. Instantly. By lunchtime today. But we don’t live in that world and there are processes that need to be gone through, including further in-game trials and discussions with all the relevant stakeholders before the rule-making body, the International Football Association Board (IFAB), will take a decision.\nHowever, don’t get too disheartened and downbeat. Reports suggest that if it proves popular with everyone and works well in matches, Wenger’s daylight rule could come in to play by 2026. I think I might just go into football hibernation till then....\nAlso-ran syndrome\nNow from a former Arsenal manager to the current one, who last week further cemented his position as one of most deluded people in world football.\nFresh from defeat to Paris Saint-Germain in the Champions League semi-final, which added another near miss to his growing list of trophy failures, Mikel Arteta insisted his team were the best in the competition.\n“I am very proud of the players, 100 per cent I don’t think there’s been a better team in the competition from what I have seen, but we are out,” he said, without a hint of humour.\nIn isolation, a statement like that would possibly be understandable as he tries to keep morale high among players and supporters in the wake of another season as also-rans.\nBut it is just the latest in a long series of comments that make me wonder if he is actually fit for purpose. The man blames everyone and everything for his repeated inability to take a very, very good Arsenal team all the way in a competition.\nIt’s been years since his one and only success at the Emirates – the FA Cup in his first season. And that is despite the club spending massive amounts building a team that should, on paper, be capable of winning regular silverware.\nTo be honest though, if I were a Gunner it wouldn’t be the near misses that wind me up but the fact that the manager never owns the failures. There is always another factor to blame, from the refs to the schedule to VAR to the type of ball being used.\nAnd now we have reached the stage where he actually seems to believe his Arsenal side are better than every other team in the Champions League, with nothing, not a sausage, to back that up.\nSince that FA Cup triumph, by my reckoning Arsenal could have gone on to win another 15 trophies. They haven’t got one. And that can’t be down to bad luck alone. There must be something else behind it and, ultimately, you would probably point your finger at the manager.\nOf course, his job isn’t under threat right now. The team, as I said, is actually very good. But I would suggest 2025-26 is going to be Arteta’s make-or-break season.\nDraw another blank, and enough may just be enough.\nThe Watford manager gap\nIn traditional end-of-season news, Watford are looking for yet another new manager.\nShowing consistency in their delusions of grandeur, the club sacked Tom Cleverly after they finished mid-table in the Championship.\nIt was a decision that ignored the fact that the relatively inexperienced manager was forced to work on a shoestring budget, mostly building his team out of youngsters, free signings and players past their best; not to mention the fact that he had only been in the job a year and is widely seen as one of the better young managers in the English game.\nBut we shouldn’t really be surprised because there is no club in the world that gets through managers in quite the same fashion as Watford have been doing since the Italian Pozzo family took over.\nThey bought the club in 2012 and, in the 13 years they have been at Vicarage Road, have made an incredible 22 managerial appointments; soon to be, you would imagine, 23.\nEven more staggering is that since they fired Nigel Pearson in 2020, they have had 10 different permanent managers at an average rate of two a season.\nIt’s a bizarre way to run a football club, and suggests the owners may just be a tiny bit too impulsive and impatient for the sport.\nI guess that’s what happens when your club becomes a plaything for millionaires.\nE-mail: Jamescalvertmalta@gmail.com\nX: @maltablade",
  "word_count": 1122,
  "scraped_at": "2026-02-14T01:55:13.641911",
  "_text_extracted": true
}