{
  "article_id": "75881d7a3fc7",
  "url": "https://arsenalnews.co.uk/2025/08/05/premier-league-2025-26-preview-man-united-vs-arsenal-villa-vs-newcastle-more-key-fixtures-from-the-opening-weekend/",
  "title": "Preview : Key fixtures from Premier League match day one",
  "date": "20250808T140000Z",
  "domain": "arsenalnews.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Premier League returns on August 15 for the eagerly anticipated 2025/26 campaign.\nReigning champions Liverpool get the ball rolling on their title defence with a home game against Bournemouth.\nThe headline fixture from the opening weekend will see Manchester United host Arsenal at Old Trafford.\nPremier League fans have mere days to wait until the start of the season, and many of them have already started purchasing match-day tickets to cheer on their favourite teams.\nWith official platforms likely to be inundated with demands, fans looking for more competitive prices can browse ticket options on resale platforms like Seatsnet.com.\nRead on as we take a closer look at some of the biggest fixtures set to unfold on match day one.\nLiverpool vs Bournemouth\nLiverpool are starting the new season with significant firepower, having spent over £250 million to bring in Jeremie Frimpong, Milos Kerkez, Florian Wirtz, and Hugo Ekitike.\nThey could still add a few more recruits before hosting Bournemouth, which would effectively rubber-stamp their position as title favourites.\nLiverpool are heading into the game as favourites, courtesy of a dominating opening-day record.\nThey have won 19 of their 33 Premier League openers. They are also unbeaten in their last 12, and have won the last five consecutive curtain-raisers on home turf.\nMohamed Salah will be looking to break yet another Premier League record. He’s already the competition’s most prolific opening-day scorer for Liverpool with nine goals.\nHowever, getting on the score sheet against Bournemouth would see him become the first player in Premier League history to hit double figures on match-day one.\nMeanwhile, Bournemouth will be hoping for a better start to the season this time around, but the odds are heavily stacked against them heading to Anfield.\nAston Villa vs Newcastle United\nTwo sides that went head to head for the extra Champions League spot last season will renew acquaintances on the opening weekend as Newcastle United take on Aston Villa in Birmingham.\nBoth sides finished level on 66 points last season, but Villa were left heartbroken as the Magpies pipped them to fifth place thanks to their superior goal difference.\nThere’ll be no love lost when they reunite at Villa Park, although Newcastle’s disappointing pre-season campaign could tilt the odds in Villa’s favour.\nUnai Emery’s side have been in fine form over their last four pre-season games and recently extended their unbeaten run with a thumping 4-0 win against Serie A side AS Roma.\nMeanwhile, Newcastle are still searching for their first pre-season victory after snapping a three-game losing streak with a 1-1 draw against Tottenham.\nTottenham Hotspur vs Burnley\nTottenham Hotspur fans will be chanting Heung-min Son’s name when the Lilywhites host Burnley in their curtain-raiser, with the club legend ending his decade-long spell in North London with a move to Major League Soccer.\nThe South Korean forward called time on an illustrious career in the English capital after leading Spurs to their first title in 17 years and a first European silverware in decades.\nMemories of his fantastic solo goal that won the Puskas award would flood the minds of the Spurs supporters who will be keen to see their side get off to a winning start.\nDespite recording their worst-ever finish in the club’s top-flight history, Spurs head into the new season brimming with expectations for a new era under Thomas Frank’s leadership.\nBut they’ll need to be wary of a Burnley side that finished the Championship campaign with a staggering 100 points tally while conceding just 16 times in 46 games.\nReplicating that record in the top flight is an impossible task, but they’ll fancy their chances of causing Spurs plenty of headache in the season opener.\nWolverhampton Wanderers vs Manchester City\nManchester City have gone about their summer business quietly. After finishing fourth last term, Pep Guardiola took advantage of the early transfer window to plug the gaps in his ageing squad, recruiting Rayan Ait Nouri, Tijjani Reijnders, and Rayan Cherki.\nSince then, City have been laser-focused on their preparations for the new campaign as they look to reclaim their place at the pinnacle of English and European football.\nAn early exit from the Club World Cup sent shockwaves throughout the globe, especially as it came at the hands of Saudi Pro League side Al Hilal.\nBut it may have been a blessing in disguise for the Cityzens, who have now had more time to recover and prepare for the new campaign.\nCity are often slow burners, but they’d head to Molineux Stadium as favourites.\nGuardiola’s side have won their last three games in a row against Wolverhampton Wanderers and should repeat that success on the opening day.\nChelsea vs Crystal Palace\nWorld Champions Chelsea will get their 2025/26 Premier League campaign underway in a mouth-watering London derby against Crystal Palace at Stamford Bridge.\nNot many gave Chelsea a chance when they squared up against the all-conquering champions of Europe, Paris Saint-Germain, in the Club World Cup final.\nHowever, the Blues rose to the occasion, dispatching the Ligue 1 champions 3-0 in the United States to win the newly formatted Club World Cup.\nThat victory has changed the perception of Enzo Maresca and his troops.\nMany expect them to challenge for the Premier League this season, and the game against Palace will give them the chance to lay down an early marker.\nChelsea are unbeaten in their last 15 Premier League games against Palace. They had won 13 in a row before Palace snapped that streak by holding the Blues to consecutive 1-1 draws.\nNevertheless, Maresca’s side are overwhelming favourites heading into the curtain-raiser.\nManchester United vs Arsenal\nThe Theatre of Dreams play host to the box office showdown of the opening weekend as United take on Arsenal in one of the Premier League’s oldest rivalries.\nUnited kicked off last season with a narrow 1-0 win against Fulham and will hope to repeat that success against Arsenal, although it’ll be easier said than done.\nTickets to this contest will be available via official platforms, but Seatsnet is a secondary market that will give fans a chance to secure their spot at decent prices.\nUnited’s opening fixture run is not for the faint-hearted, but it might just be the jumpstart they need after an abysmal performance in 2024/25.\nThe game against Arsenal will be a major talking point. But it will be the perfect test of ambitions for both sides, setting the tone for the rest of the season.\nAfter three years of falling short in the title race, Arsenal head into the 2025/26 season with a point to prove.\nOld Trafford hasn’t always been a happy hunting ground, so getting three points there to start the season would be a massive statement of intent.",
  "word_count": 1123,
  "scraped_at": "2026-02-14T01:52:36.783898",
  "_text_extracted": true
}