{
  "article_id": "759646b11b59",
  "url": "https://www.thenationalnews.com/business/money/2025/07/08/dubai-scam-gold-mining/",
  "title": "How a Dubai resident lost Dh700 , 000 in a gold mining scam",
  "date": "20250708T053000Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mehdi Asgari, an Iranian living in Dubai, was invited to join an online investment platform for gold mining introduced as Missoma through WhatsApp in January.\nWhen he signed up, he was told to complete small orders in the form of mining tasks. He initially deposited Dh5,000 ($1,360) to complete “simple daily tasks” such as clicking on mining or trading buttons. After each task, the platform would show small “profits” being added to his account balance.\nThese numbers were used to encourage him to deposit larger amounts over time. Mr Asgari, 45, was repeatedly asked to deposit more money to unlock additional features, which never materialised. Cumulatively, he transferred Dh703,000 to numerous bank accounts in the UAE.\n“I did not engage in any actual mining. The so-called mining was merely a term used by the fraudsters to describe a process where I was required to deposit additional funds in order to unlock or ‘process’ previous earnings or commissions on the Missoma platform,” says Mr Asgari, who works in analytical chemistry in Dubai.\n“The 'earnings’ or ‘commissions’ displayed on the platform were not based on any actual trading activity or product sales. Instead, they were fabricated numbers shown in my account dashboard to give the illusion that I was profiting.\n“This was part of their manipulation tactic to make it seem like the platform was generating profits. In reality, it was just a way to pressure victims like myself to deposit more money under false pretences.”\nEventually, when Mr Asgari attempted to withdraw his funds, they claimed he had to complete more “high-value orders” or “pay activation fees”. That’s when he realised his money was trapped.\nDespite filing complaints with Dubai Police’s e-crimes unit in April, the Criminal Investigation Department and the UAE Central Bank, Mr Asgari has yet to receive any resolution.\nCalls and WhatsApp messages initiated by The National with the alleged fraudsters’ phone numbers provided by Mr Asgari went unanswered.\nFifty-six per cent of the UAE population is subject to a scam attempt at least once a month, according to the UAE Cybersecurity Council’s 2024 State of Scams report, which polled 1,964 UAE citizens. The survey found the majority of scams are delivered through instant messaging tools, with WhatsApp being the most used platform for scam delivery. Phone calls and text/SMS messages are also common mediums for fraudsters, followed by email in fourth place.\nModus operandi\nScammers often approach victims through social media, messaging apps, or fake websites. They pose as trusted companies or investors, use fake dashboards to show fake profits to build trust, and gradually push for more deposits. When the victim tries to withdraw funds, they are asked to pay additional “fees” until eventually, the scammers vanish, says Navin Gupta, chief executive of blockchain analytics platform Crystal Intelligence.\nWatch out for unrealistic promises, suspicious URLs or apps, pressure to act quickly, urgent requests for more funds, or private keys, anonymous teams or sketchy websites, ever-changing withdrawal conditions and lack of transparency, he warns.\nCarol Glynn, founder of Conscious Finance Coaching, points out it can be difficult to differentiate between genuine and fake investment platforms as the latter are becoming more and more sophisticated, and especially easy to believe for an inexperienced investor eager to make good returns.\nSome red flags to look out for are platforms with no regulatory information or vague company backgrounds, promises of high, consistent returns with zero risk, urgency tactics such as “limited time investment windows” pressure to upgrade quickly, requests for payments via cryptocurrency, third-party transfers, or to personal bank accounts, and poor grammar or inconsistent communication from so-called customer support, Ms Glynn highlights.\nLegal perspective\nAbdullah Ishnaneh, partner at law firm BSA, says the avenues the investor has already pursued, including Dubai Police Cybercrime and Public Prosecution, are the “correct and most reliable” channels for addressing online fraud in the UAE.\nThese authorities have the mandate to investigate scams, trace digital transactions and prosecute cybercrime under UAE law, particularly where the individuals involved are within the country. However, such complaints can stall if the evidence is not clearly presented or if the suspects are not easily traceable, Mr Ishnaneh explains.\n“The most realistic path forward is to focus on the cybercrime complaint, ensuring that all evidence, such as proof of fabricated dashboards, misleading profit figures and coercive deposit tactics, is organised and linked clearly to UAE cybercrime laws, particularly Federal Decree Law No. 34 of 2021,” he says.\n“A well-structured submission and consistent follow-up with the authorities may improve the chances of the case being reactivated, especially if any part of the scam was operated or facilitated from within the UAE.”\nWhat to do\nMs Glynn says if someone falls victim to a suspected financial scam, the first thing to do is report to authorities ... gather all communications, bring records of all transactions, platform screenshots and any information on the individuals or companies involved.\nVictims can report the case to the Cybercrimes Unit at Dubai Police or the force in their emirate. They can also report through the eCrime platform, she explains.\nWatch: Large rise in crypto scams amid fears of missing out\nAlso, one must contact their bank immediately. If funds were sent via bank transfer, report it to the bank’s fraud department. It may be able to freeze the transfer if it was recent, she adds.\nInforming the Telecommunications Regulatory Authority is also important. This can help prevent the scam site from continuing to operate or target others in the UAE, Ms Glynn recommends.\nRed flags\nMaher Yamout, lead security researcher for the Middle East, Turkiye and Africa at cyber security firm Kaspersky, instructs users to treat any platform promising “fixed daily returns” as suspicious until it processes a small test withdrawal and presents a licence they can verify with the UAE Securities Commodities Authority, Dubai Multi Commodities Centre, ADGM or Dubai International Financial Centre; to help check for authenticity.\nKaspersky research shows users in the Middle East hit by mobile financial threats jumped 146 per cent in 2024 from the previous year, and a further 43 per cent in the first quarter of this year, even though overall cyber attack volume in the UAE fell by 16 per cent.\n“Several forces are driving the surge,” Mr Yamout says. \"Persistently high gold prices push retail investors towards high-yield alternatives, creating fertile ground for fraudsters who clone legitimate bullion or cloud-mining projects.\n“Near-universal smartphone and digital wallet adoption in the UAE gives attackers a vast target pool, while AI-generated marketing materials, deepfake endorsements and encrypted-messaging campaigns let them distribute convincing lures at negligible cost.\"\nFinally, instant crypto-payment rails make it easy to launder stolen funds across borders, keeping the risk to criminals low and the potential reward high, he adds.\nPreventive tips\nMs Glynn suggests users always check a financial platform is licensed by a recognised regulator (like the DFSA or ADGM). Check directly with the governing body, do not merely trust the declaration on the investment company’s website, she says.\nBe cautious of investment opportunities marketed through WhatsApp, Telegram, or social media with no professional or regulatory backing, especially if they are offering aggressive returns with no risk and vague explanations as to how they achieve these returns, Ms Glynn warns.\n“Don’t rely on a friend’s recommendation, especially if they’re also inexperienced. If it sounds too good to be true, it usually is. Independent research and due diligence are essential,” she says.\n“Avoid platforms that ask for repeated deposits without allowing any withdrawals and those that don't clearly outline their terms and conditions, charges, insurance, and process for withdrawal.”",
  "word_count": 1262,
  "scraped_at": "2026-02-14T01:49:44.683524",
  "_text_extracted": true
}