{
  "article_id": "759774bc50f3",
  "url": "https://www.caughtoffside.com/2023/06/24/liverpool-and-manchester-united-linked-with-a-move-for-24-yr-old-bundesliga-ace/",
  "title": "Liverpool and Manchester United linked with a move for 24 - yr - old Bundesliga ace",
  "date": "20230624T081500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayer Leverkusen defender Edmond Tapsoba is reportedly a player in demand this summer.\nThe 24-year-old Burkina Faso international has done quite well for the Bundesliga club and his performances have caught the attention of a number of Premier League clubs.\nAccording to a report from 90 Min, Liverpool, Manchester United and Newcastle Unite have been informed of the defender’s situation and they are looking to bring in defensive reinforcements.\nLiverpool need to bring in an update on Joe Gomez and Joel Matip. Both players were quite mediocre last season.\nMeanwhile, Manchester United need to bring in another reliable central defender, especially if players like Harry Maguire and Victor Lindelof leave the club this summer.\nAs far as Newcastle are concerned, they will need to find a quality long-term partner for Sven Botman. They will be playing in the Champions League next season and they need better players to cope against the European elite.\nTapsoba has the potential to succeed in the Premier League, and he could be a key player for all three clubs.\nThe opportunity to play for clubs like Liverpool, Manchester United and Newcastle will be a tempting proposition for the Bundesliga player.\nHe has been linked with clubs like Tottenham and Arsenal as well.\nTapsoba has shown his quality in the Bundesliga on a regular basis and he will be hoping to make his mark at a higher level now. The move to the Premier League would be a step up in his career.\nThe likes of Liverpool, Manchester United and Newcastle have the finances to secure his services and it remains to be seen where he ends up.\nManchester United and Newcastle United can offer him Champions League football league next season and that could give them an edge in the transfer race.",
  "word_count": 297,
  "scraped_at": "2026-02-14T01:56:02.426450",
  "_text_extracted": true
}