{
  "article_id": "759cc3ccefed",
  "url": "https://www.oxfordstudent.com/2023/02/17/the-best-of-times-the-worst-of-times-a-tale-of-man-city/",
  "title": "The best of times , the worst of times : A tale of Man City",
  "date": "20230217T170000Z",
  "domain": "oxfordstudent.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Last Monday, the Premier League announced that it had charged its current holders, Manchester City, with over 100 counts of regulation breaches committed over the course of almost a decade. The accusations, if upheld, would constitute the most severe offences by a club in the competition’s history and possible penalties include expulsion from the league.\nThe allegations are vast, and their impact could be too. Manchester City has been English football’s star performer over the last ten years, winning six Premier League titles since 2011-12 (2011-12; 2013-14; 2017-18; 2018-19; 2020-21; 2021-22), two FA Cups (2010-11; 2018-19) and six of a possible eight League Cups between 2013-14 and 2020-21. Although the Champions League continues to elude them, the club sits at the top table of European football and is revered worldwide.\nIndeed, there is much to be admired about the way that Manchester City is run. In three years following the 2008 takeover by Sheikh Mansour bin Zayed Al Nahyan and the Abu Dhabi United Group, the club leapt from mid-table mediocrity and a yo-yoing history in England’s top three divisions to a first ever Premier League title (2011-12). On the final day of the season, Sergio Aguero, assisted by commentator Martin Tyler, etched his name into Premier League history; a fall-off-your-chair moment which instantaneously became English football folklore.\nWith the club performing well in the league, CEO Ferran Soriano was working to turn Manchester City into a ‘franchise club’, and in 2013 they began building a worldwide football empire in the form of the City Football Group. Starting with New York City FC in the US’s Major League Soccer, City’s owners began the rapid founding or acquisition of subsidiary clubs worldwide, stretching Man City’s scouting net and proliferating its fanbase across the globe.\nNow twelve clubs in total, about half wear the sky-blue strip with a round white badge and ‘Etihad Airways’ plastered across the front. The garish glister of football’s biggest brand. Impressive, if a little sinister.\nWith the arrival of management mastermind Pep Guardiola, the formula was complete, and the result was inevitable. City romped to the top and dug in, leaving rivals and silverware strewn in their wake, whilst making eight-digit profits yearly. The club’s annual report from the 2021-22 season related a £613m revenue with a record profit of £41.7m, and it has won four of the last five league titles with the lowest net transfer outgoings of the ‘big six’ English clubs during that period. In the summer, City signed the world’s second most valuable player, Erling Haaland, currently sit second in the table and yet boast a net profit in transfers for the current season. As a football club and a business, it is slick and lean, a winning machine.\nBut it seems this story may be too good to be true.\nAs of last Monday, Manchester City are charged with failing to provide accurate information “that gives a true and fair view of the club’s financial position”, not disclosing contractual payments to players and managers, and with failing to cooperate with Premier League investigators, all of which are conditions of participating in the competition. UEFA Financial Fair Play, and Profitability and Sustainability regulation violations compound the allegations which will be heard by an independent commission in private.\nUndisclosed “manager remuneration” is thought to refer to a ‘secret second salary’ paid to Roberto Mancini during his time as City’s boss, where it is alleged that Mansour more than doubled Mancini’s income through a contract arranged with Al Jazira Club, Mansour’s own football project in UAE. It is also believed that the club’s owners disguised direct payments into the club as sponsorship income using Emirati companies such as Etihad and Etisalat.\nAllegations of this scale are unprecedented in Premier League history. If they are true, Man City have knowingly circumvented the rules put in place to assist in evening out the wealth disparity between clubs, rules instituted to keep football fair, to keep football about football. They would have acquired the most capable players, managers, and staff in the game simply because they were able, illegally, to pay them more than anyone else could.\nAs far as financial misconduct goes, any wrongdoing must be punished. The Premier League Handbook offers docked points, suspension and expulsion from the league, but the commission, headed by Murray Rosen KC, is at liberty to issue any penalty it sees fit. The 101 charges and four-year investigation will now be painstakingly unpicked over the course of a hearing which will drag into next season and possibly the one after that.\nDiscussions of what should happen to City and what the impact of potential punishments would be are tempting but premature. But it is impossible to resist the question: what of the last ten years of football?\nIf the charges are upheld, are all of the victories, the trophies, the surreal moments immediately invalid?\nThe simple fact is that the investigations must not stop at City. Guardiola condemned his competitors’ vindictive hounding of Man City in a press conference last Friday, claiming that they have pressed hard to see the club destroyed over this “without being innocent” themselves.\nPep undermines himself by saying this, but perhaps he has a point. Fans cannot see exactly what is going on behind the boardroom door, but it is hard to view Chelsea’s January transfer outgoings of €330m (more than every club in France, Spain, Germany, and Italy’s top divisions combined) as financial fair play, at least in the subjective sense. To some extent, the validity of City’s recent footballing success can only be fully assessed once there has been an investigation into financial conduct across the entire Premier League and the overall picture becomes clear.\nManchester City claim to have “irrefutable evidence” which will exonerate them. In defence, as an alternative to the calm heads of John Stones and Ruben Diaz, is Lord Pannick KC. Pannick in defence has not been an unfamiliar sight at City recently (irresistible) as he guided them through the successful appeal against UEFA’s two-season ban in 2020, also for financial violations.\nFans of Manchester United, Liverpool and Arsenal may be heard loudly revelling in Man City’s misfortune over the coming weeks and months and calling for the most severe punishments available. Perhaps they are right, but this is just the beginning. Point fingers, bay for the blood of the Blues and haul the skeletons from their closets; but maybe check your own first.\nImage description: Mosaic of the badge of Manchester City FC",
  "word_count": 1084,
  "scraped_at": "2026-02-14T02:24:32.674447",
  "_text_extracted": true
}