{
  "article_id": "75d31038ca2d",
  "url": "https://www.somersetcountygazette.co.uk/news/24606410.theo-walcott-issues-brutal-champions-league-prediction-arsenal/",
  "title": "Theo Walcott issues brutal Champions League prediction for Arsenal",
  "date": "20240924T140000Z",
  "domain": "somersetcountygazette.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Will Castle\nTheo Walcott does not expect Arsenal to challenge for Champions League glory this season in light of his former side’s dramatic 2-2 draw with Manchester City.\nThe Gunners were moments away from securing a famous win at the Etihad on Sunday, only to be denied by a 98th minute equaliser by John Stones.\nWhile a point on the road at City is hardly something to be down about, Gooners could not help but feel an opportunity to strike an early blow in the title race had gone begging, with the Citizens looking imperious as ever so far this term.\nBut as Mikel Arteta strives to finally pip his former employers to Premier League glory after two seasons of agonising second-place finishes, ex-Gunner Walcott cannot see Arsenal enjoying similar success on the European stage ahead of a mammoth clash with PSG next Tuesday.\n“They maybe have a chance of winning the Champions League, but I can't see them winning it,” Walcott said, speaking at a KickX community event on Monday. “I really can't, if I'm being completely honest.\n“I just feel like they're going to be putting a lot of energy into the Premier League this year, that's for sure. I feel like the Premier League is the one they want to crack, I really do.\n“But I always feel like they need to be able to be positive in these fixtures when you're faced against a team like PSG, who are of course an absolute giant in the world of football.\n“Of course it's a great statement [to win] and they're going to want to set the ball rolling in this new system in the Champions League which we're all trying to sort of catch up with and understand it. I kind of like it to be fair, it's different.”\nSurrey FA also announced their official recognition of the KickX arena and hybrid football games at the event.\nKickX opened in July 2023 and offers seven micro-sided football formats including the popular Padbol, a mix of football, squash and tennis and Teqball, a blend of football and table tennis.\nUnlike their fellow Premier League title rivals, Arsenal are yet to add a Champions League to their trophy cabinet, with memories of final heartbreak in 2006 still burnt into the minds of many fans.\nWith European titles already under their belts, Walcott puts Arsenal’s closest domestic adversaries amongst the competition’s top challenges over his former outfit.\n“Looking at the teams, I see Liverpool being very dangerous for a lot of people,” added Walcott, with the former Arsenal, Southampton and Everton forward Walcott having become an investor and official ambassador of KickX – the world’s first indoor hybrid football arena.\n. “The Champions League is a bit slower at times and when you have certain players that can just affect the game, particularly with pace, it's a massive tool in the game.\n“Man City, of course, can be talked about, and Real Madrid with all the sort of stars they have. I also think Inter look very good, I really do.”\nDavid Raya’s spellbinding double penalty save against Atalanta ensured that Arteta’s side came away from their Champions League opener with a precious point last week, denying the reigning Europa League champions a dream start to the competition.\nArsenal will now be hellbent on getting three points on the board as they host serial French champions PSG under the Emirates lights.\nBut with that seismic fixture just a week away, Walcott insists that Arteta will be taking things game by game, something indicative of the culture he has built in the club.\n“I think with Mikel, he genuinely won't be considering that game right now,” he said. “He'll be looking at the Bolton game [in the EFL Cup third round] particularly.\n“When I'm around the club and I’ve spoken to staff, it’s seeing how positive the whole environment is. When you have that in an establishment, it really does feed down to the players and feeds across into the stadium.\n“Mikel Arteta set that from day one when he went into the club, he wanted to change the whole culture. He's managed to do that, so he won't be worried about that.”\nKickX arena opened in July 2023 and offers seven hybrid football formats including the popular Padbol, a mix of football, squash, and tennis and Teqball, a blend of football and table tennis. For more information please visit www.kickxfootball.com",
  "word_count": 741,
  "scraped_at": "2026-02-14T02:20:44.347952",
  "_text_extracted": true
}