{
  "article_id": "760d82a353a5",
  "url": "https://www.teamtalk.com/liverpool/danny-murphy-expects-jurgen-klopp-revisit-van-dijk-strategy-summer-battle-long-term-target-hots-up",
  "title": "Danny Murphy expects Jurgen Klopp to revisit Van Dijk strategy as summer battle for long - term target hots up",
  "date": "20230326T190000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nDanny Murphy expects Jurgen Klopp to revisit Van Dijk strategy as summer battle for long-term target hots up\nDanny Murphy has tipped Jurgen Klopp to use similar tactics that worked on Virgil van Dijk to convince Jude Bellingham to sign for Liverpool.\nThe Reds have been tipped to revamp their squad in the summer after a below-par campaign on Merseyside. The north-west giants sit sixth in the standings and still have a chance of finishing in the top four. But it has been an underwhelming season, with eight top-flight losses already on their record.\nThey are also out of the Champions League after suffering a 6-2 aggregate mauling at the hands of Real Madrid.\nAnd with Brighton knocking them out of the FA Cup, Champions League qualification is their sole ambition left this term.\nIt remains to be seen whether they do secure a top-four berth. But, whatever happens, there will be new faces at Anfield ahead of 2023-2024.\nOne name that continues to crop up in relation to Liverpool recruitment is Borussia Dortmund ace Bellingham.\nNow an England regular, the former Birmingham City schemer has taken his game to a new level.\nHaving joined BVB in the summer of 2020, the Stourbridge-born ace has enjoyed 124 outings in all competitions.\nHe has 20 goals and 21 assists to his name, with a number of top clubs taking note.\nREAD MORE: Report names winner of £35m Arsenal, Newcastle transfer battle with Liverpool not even in running\nReal Madrid and Manchester City are said to be Liverpool’s main rivals for his signature.\nAnd there have been recent rumours that the Reds are falling behind the competition in the race to sign the powerful midfielder.\nTransfer guru Fabrizio Romano countered that argument earlier this week, with the Italian journalist suggesting Liverpool’s hopes are far from over.\nBut it looks set to be a battle royal over the summer.\nKlopp powers of persuasion set for test\nJurgen Klopp has little to prove at Anfield after delivering the Premier League and Champions League during his time at the club.\nThe German has also overseen FA Cup and EFL Cup triumphs. But his star has waned a little during the current campaign, with a number of insipid displays.\nThe 7-0 thrashing of Manchester United helped the feelgood factor return but it is silverware the fans crave.\nBellingham is a player who could help them achieve that aim. And former Liverpool star Murphy feels the manager might revisit a trick he has played to lure previous Liverpool recruits.\n“I’m sure Real Madrid would love him but I have a hunch he may prefer to return to England and be closer to the family,” he told The Daily Mail.\n“Jurgen Klopp told Virgil van Dijk he’d win titles at Manchester City but still be forgotten 10 years later whereas at Liverpool he’d be a legend forever.\n“I wouldn’t be surprised if the same kind of sell may be used on Bellingham.\n“Unlike (Declan) Rice, he has experienced Champions League football so it might not be such a crushing blow if Liverpool don’t make it for one year.”\nLiverpool are next in action when they host Manchester City on April 1.\nBellingham will now return to Dortmund after helping England to a 2-0 triumph over Ukraine at Wembley.",
  "word_count": 555,
  "scraped_at": "2026-02-14T01:53:35.633007",
  "_text_extracted": true
}