{
  "article_id": "764dbb6481d4",
  "url": "https://www.fourfourtwo.com/features/michael-owen-arne-slot",
  "title": "Michael Owen exclusive :  Liverpool need to be challenging at the top in Arne Slot first season – but fans will be supportive of him  ",
  "date": "20240621T154500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Michael Owen exclusive: 'Liverpool need to be challenging at the top in Arne Slot’s first season – but fans will be supportive of him'\nThe former Reds striker has given his views on the club's new boss, as life without Jurgen Klopp begins\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nArne Slot visited Liverpool’s training ground for the first time this week – and former Reds striker Michael Owen admits the Dutchman will be expected to keep the club near the top of the table in their first season without Jurgen Klopp.\nSlot has the tough task of stepping into a legend’s shoes at Anfield, after Klopp won both the Premier League and the Champions League during his time at the club. Liverpool finished third in Klopp’s final season at Anfield, but challenged for the title for most of the campaign – something they did on a regular basis under the German.\nAsked what should be the club’s realistic expectations for Slot’s first season, Owen told FourFourTwo that they need to be challenging again, even if they don’t win the Premier League.\nVIDEO Alan Shearer Explains How England Could Have Won The Euros\n“It will be tough for him, with expectations and everything else,” the former striker said. “I think there need to be signs of playing good football. We’ll see quite early on the style of play and how exciting it is on the eye.\n“In the long term, you’d have to think that they have to be competitive. I mean, it’s alright giving managers time, but he does walk into a very good squad already and a very good club that’s very stable at the moment.\n“So, say, they come fifth and don’t win a trophy, and saying ‘Oh yeah, it’s just building blocks’, well no, the building blocks have been put in place. I think that winning something obviously would be perfect. If they don’t win anything, they’ve got to be challenging. They’ve got to be in the conversation.”\nOwen, though, believes that Slot will receive more support and patience from Liverpool fans than he might receive at other clubs in equivalent situations.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n“The one thing with Liverpool is the fans are very, very supportive,” he told FFT. “There are certain clubs when managers are not doing well, they get on their back or on players' backs.\n“You’ll never hear Liverpool fans getting on players’ backs. If you’ve got that red shirt, they support you. OK, it might not work for whatever reason, that’s just life. But Liverpool fans are very loyal. Very loyal to their team, very loyal to their manager.\n“As long as everybody’s seen to be trying their best, then he’ll certainly get the backing of everybody at the club.”\nMichael Owen was speaking in association with AceOdds\nMore Liverpool stories\nWhat it was like inside Anfield for Jurgen Klopp’s emotional farewell\nChris joined FourFourTwo in 2015 and has reported from more than 20 countries, in places as varied as Ivory Coast and the Arctic Circle. He's interviewed Pele, Zlatan and Santa Claus (it's a long story), as well as covering the World Cup, AFCON and the Clasico. He previously spent 10 years as a newspaper journalist, and completed the 92 in 2017.",
  "word_count": 656,
  "scraped_at": "2026-02-14T02:13:55.818197",
  "_text_extracted": true
}