{
  "article_id": "764d30772c9f",
  "url": "https://www.fourfourtwo.com/news/newcastle-united-transfer-bruno-guimaraes-talismans-release-clause-revealed-with-european-giants-circling-report-transfers-gossip-paper-talk-rumours-nufc",
  "title": "Newcastle United talisman release clause revealed - with European giants circling : report",
  "date": "20231215T171500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Newcastle United talisman's release clause revealed - with European giants circling: report\nNewcastle United could be forced into entering the transfer market, with a key player potentially heading towards the exit door\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nNewcastle United have suffered a bad 10 days, and things could be about to get a lot worse for them if they lose their talisman to one of Europe's elite sides.\nHeavy defeats in the Premier League to Everton and Tottenham Hotspur were compounded by them crashing out of the Champions League on Wednesday night, with injuries a major problem at the club as well.\nThe January transfer window doesn't look like it'll offer Magpies fans much respite, either, with a new report revealing one club is looking to match the release clause of a key player to Eddie Howe's side.\nAccording to Football Transfers, Newcastle United midfielder Bruno Guimaraes has a release clause of £100m, with Barcelona reportedly interested in bringing him to Catalonia.\nThe report suggests that Barcelona are willing to trigger the release clause by selling Robert Lewandowski to Saudi Arabia, with the Pole freeing up considerable space on the wage bill as well.\nThough only signed last summer, Lewandowski is now 35 and slowing down somewhat - this term he has so far managed eight goals in 14 appearances, with Barcelona faltering in their La Liga title defence, too.\nGuimaraes has regularly been touted with a move away from St. James' Park over the last year, but a move has never materialised with the Brazilian happy staying on Tyneside.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWith Newcastle's early exit from the Champions League, though, Guimaraes was said to be \"furious\", and might prefer a move elsewhere in order to match his trophy-winning ambitions.\nBut with Guimaraes' contract running until the summer of 2028, Newcastle will be in no rush to sell the 26-year-old. Transfermarkt values him at £73m, and the Magpies will certainly want to get as much as they can for him in any potential sale.\nMore Newcastle United stories\nOne key player has had an injury setback, confirmed by Eddie Howe, with \"another operation a possibility\".\nChris Waddle reveals Jack Charlton’s rage at Newcastle United's second-half collapse against QPR, saying that \"we could see him hammering the dugout – he was wrecking anything he could get hold of\".\nNewcastle eyeing England international as replacement for the injured Nick Pope.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 585,
  "scraped_at": "2026-02-14T01:48:34.028341",
  "_text_extracted": true
}