{
  "article_id": "76514f81ca6e",
  "url": "https://theathletic.com/4512940/2023/05/13/manchester-united-liverpool-newcastle-champions-league-analysis/",
  "title": "The Champions League race : What are Manchester United , Newcastle , Liverpool really thinking ? ",
  "date": "20230513T080000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Just a few short weeks ago, the race to qualify for next season’s Champions League looked all but over.\nAfter Newcastle defeated Tottenham 6-1 on April 23, they and Manchester United enjoyed a six-point advantage over their nearest challenger for a top-four finish and seemed certain to be able to start daydreaming of midweek trips to Madrid or Milan.\nAdvertisement\nNow, however, that confidence has evaporated. A magnificent end-of-season surge from Liverpool, which has seen Jurgen Klopp’s side win six games in a row, and some late-season wobbles from Newcastle and Manchester United have thrown the race wide open again.\nThree into two won’t go, so what would be the implications of missing out, what is the current mood and who could help close the deal in the final weeks of the season? We asked Carl Anka (Manchester United), George Caulkin (Newcastle) and Andy Jones (Liverpool) to offer their verdicts.\nDid you expect your team to be in this position at the start of the season?\nCarl Anka: Few Premier League viewers believed Manchester United would finish in the top four at the start of 2022-23. Most within the United fanbase were more hopeful than expectant of Erik ten Hag. United are a bit ahead of schedule but fans are mindful of the threat of a resurgent Liverpool, Chelsea and maybe even Spurs next season. Ten Hag’s men need to seize this opportunity while they have it.\nGeorge Caulkin: Hell, no. Finishing last season in 11th was an astonishing achievement given that Newcastle were bottom of the Premier League after Eddie Howe’s first match as head coach and the club budgeted for the top 10 this time. In football terms, the club were simply aiming for anything better than that. After long years of stagnation under Mike Ashley’s ownership, there was a desire – according to one source who asked to remain anonymous to protect relationships – not to “put too much pressure on the team”. Qualifying for the Champions League was included in the squad’s bonus structure “because you never know,” but that target was only ever “aspirational”.\nAndy Jones: No, the expectations were Liverpool would continue to be the domestic and European force they have been for a number of seasons under Klopp and be title challengers again. Instead, it’s been a season of inconsistency, transition, and trying to find their identity. That said, fighting for a top-four finish is an achievement given how challenging things have been. Injuries and the drop off in a number of key players’ performances (predominantly due to age and fatigue) appear to have caught up with some which has not helped.\nAdvertisement\nGive us some compelling reasons why your team will make the top four\nCarl Anka: Points dropped to Spurs, Brighton and West Ham have taken United away from the security of third place, but they still have a one-point advantage over Liverpool in fifth and have a game in hand. United remain masters of their own fate and three of their remaining fixtures are at home, where they’ve been impressive throughout. Their one away trip is to Bournemouth who they should be able to deal with.\nGeorge Caulkin: Because they’ve been there all season, more or less. Because they’re three points clear of Liverpool in fifth and have a game in hand. Because Manchester United are also beneath them. Because they’ve still got the meanest defence in the division and have forwards in Callum Wilson and Alexander Isak who are bang in form. Because they have momentum behind them, winning eight of their last 10 matches. Because they have two home games left, against Brighton and Leicester and nowhere is noisier than St James’ Park. Because they rise to the occasion. Because they are really bloody good.\nAndy Jones: They are the in-form team. Six wins on the bounce could easily become nine with the fixtures they have remaining. The switch to an inverted full-back system has breathed new life into the entire squad, and while it has not always been pretty, they are finding ways to win games. They’ve also been in this position before, not just when competing for Premier Leagues with Manchester City, but also when they were scrabbling for the top four in 2021. They finished that season taking 26 points from a possible 30 to pass those who had been above them. Plus they have Alisson, so if they need a last-minute goal from a corner, he’s your man.\nAnd why could they miss out?\nCarl Anka: If United– even in their injury-depleted state – execute Ten Hag’s tactical plan with a good intensity and focus, they should get the get nine points they need but they have already played 56 games in 2022-23 and appear to be limping to the finish line. Ten Hag has done well to rework the spine of this squad, but he is currently without his best centre-back pairing and his best players seem to be suffering from a combination of mental and physical fatigue. The squad players that Ten Hag is calling upon to cover appear afflicted by a warped sense of self-preservation where they opt for conservative passing options out of fear of making a mistake, instead of taking games by the scruff of the neck.\nGeorge Caulkin: Liverpool have finally got their act together. They’re the big threat. Newcastle don’t have a straightforward run-in; Leeds and Leicester are both fighting at the bottom, Brighton are excellent and a final-day trip to Chelsea could be awkward, notwithstanding their shambolic season. Newcastle also have a limited squad; a couple of crucial injuries could conceivably derail them (although, for the record, I don’t think any of this will happen).\nAdvertisement\nAndy Jones: Ah, where to begin with this one. The away form? The midfield? The disjointed press? Injuries? Throw them all into the melting pot and you’ve got your reasons as to why Liverpool are where they are. Really, though, the final three games are not what will cost Liverpool if they don’t make it: the damage was done earlier in the campaign, particularly away from home where their form has been poor, so they are facing the prospect of running out of time. Three wins out of 15 away matches, before recent consecutive wins against Leeds United and West Ham, is nowhere near good enough.\nWhich player is key to securing a Champions League spot?\nCarl Anka: This question was hotly contested among the United writers last week, with votes going to Rashford (the No 1 goalscorer), Fernandes (the No 1 goal creator), Luke Shaw (the No 1 deep ball progressor) and Casemiro (the No 1 player at stopping opponents do the other things listed in brackets). I’ll once again reiterate the importance of Casemiro to Ten Hag’s side, especially when out of possession. There are moments when United lose the ball and the opposition are countering when he can be the entirety of that plan. United need a combination of Rashford, Fernandes and Shaw to win games. Casemiro makes sure they don’t lose them.\nGeorge Caulkin: Newcastle are a brilliant team in the truest sense of the word; that tightness, trust and collective spirit means they are greater than the sum of their parts. That said, Bruno Guimaraes, their Brazil international, is the player who connects everything, setting the tone and lifting the rest. The midfielder has been nursing an ankle injury recently and not been at his best and while there are options in most other positions, he is irreplaceable.\nAndy Jones: Trent Alexander-Arnold. In Liverpool’s new inverted full-back system, he has become key to everything and he has enjoyed the increased responsibilities. Liverpool cannot play this system without him and his passing range and domination of matches have given his side a stronger platform to build from. To underline the point, he has six assists in seven games from his new position, compared to two in his previous 27 Premier League matches from a more standard right-back role.\nHow damaging could it be to miss out off the field?\nCarl Anka: In the nine complete seasons since Sir Alex Ferguson’s retirement, United have finished in the top four on just four occasions. More than one summer transfer window has been affected by United playing in the Europa League and, following defeat to Brighton last week, Ten Hag himself alluded to the Champions League leading to an easier fixture arrangement than the Thursday-Sunday schedule of the Europa League, so the on-field effects could be severe. That said, both interested parties currently engaged in takeover talks have insisted that their bids are not predicated on United playing in the Champions League.\nGO DEEPER\nUnited and the Champions League: The financial consequences of qualifying\nGeorge Caulkin: It’s the other way round for Newcastle – as they haven’t budgeted for finishing in the top four, getting there would be transformative, both in terms of prestige and finances, given it is worth a minimum of £30million. Having nudged towards their FFP limits in January, when they signed Anthony Gordon from Everton for £40 million, the Champions League would give them greater leeway. There would be a knock-on effect for the commercial and sponsorship deals they are currently negotiating. All of this is a bonus. “We embrace it 100 per cent,” the source says. “We would grab it with both hands and run with it.”\nAndy Jones: Liverpool’s turnover will take a significant hit. They brought in around £100million from their run to the final last season. While that is expected to drop to around £71million after the season’s last 16 exit to Real Madrid, it still leaves a big hole and will likely have some impact Liverpool’s potential spending, even if Klopp insists otherwise. FSG have promised to back Klopp with significant funds as a major overhaul of the squad is required, but that will be in line with the owners continuing to run the club in a self-sustaining manner. The search for minority investment continues, which if found, could help bridge the gap left from no Champions League qualification.\nWhat about the manager – will they be under more pressure if they miss out?\nCarl Anka: Ten Hag has now ran into the impossible task every United manager faces: mission creep. Any good run of United form sees fans/commentators/writers hastily talk about United being “back”, and how their current manager is a genius for getting them there. Any bad run then provokes talk about how much longer it will take for United to be “back”, and whether their current manager will be the one to take them there. Ten Hag has got more than expected from this United squad, but no Old Trafford manager can truly be “ahead of schedule”, because the schedule always has the same end point: being Premier League champions again. Ten Hag needs top four because he needs to begin planning for that day sooner rather than later. Any delay will provoke questions.\nAdvertisement\nGeorge Caulkin: No and he certainly shouldn’t be. Howe is close to Newcastle’s decision-makers, their commitment to him is strong and he is wildly popular with fans. The team has been so good this season and their position so consistent, there would inevitably be a sense of deflation if they drop out of the top four now, but the bigger picture? They are way ahead of schedule.\nAndy Jones: Liverpool and owners Fenway Sports Group continue to retain complete faith in Klopp so there would be no questions surrounding his job. He has showed he can bounce back from a similar season in 2020-21, when his side were two goals from the quadruple in the following campaign. A top-four spot would help, but there is a huge amount of pressure riding on Liverpool’s summer regardless: the club and Klopp simply have to sign the right players.\nHow well equipped is the squad to cope with the Champions League?\nCarl Anka: United’s squad is not so much blessed with strength in depth as it is bodies of varying skills. It is big enough to play twice a week but it may not be skilled enough to do that past the quarter-final stages of European competition. The club is preparing itself for a large amount of player turnover to allow Ten Hag to better tailor the squad to his needs: it is understood he may have a transfer budget of £100million, plus whatever he can raise in player sales. Ten Hag has openly spoken of needing a centre-forward in the summer and he could also do with upgrades in central midfield, in goal and right-back.\nGeorge Caulkin: As things stand, they are really not, something we wrote about last month. As our source said then: “Are we ready for it? No. Is our squad big enough? No.” The big idea at Newcastle is to be regular members of the top six – and ultimately to challenge for the major prizes – not one-season wonders. Howe’s squad needs more depth in quality and more options. So far, their hit rate in the transfer market has been impressive and they will need to be “very smart and savvy” once again.\nAndy Jones: If fully fit, and with the right additions in the summer, Liverpool will be well-equipped to compete. They fell short against Real Madrid this season after only being able to sustain an incredible intensity for 20 minutes of the first leg before being sunk by the problems which have plagued them all season. Make the right additions, and this is a squad that should be able to compete on multiple fronts.\nGO DEEPER\nWho deserves to be part of the Liverpool rebuild?\nIf your team does reach the Champions League, how well could they do in it next season?\nCarl Anka: United haven’t reached the Champions League quarter-finals since Ole Gunnar Solskjaer fielded an XI including Phil Jones, Chris Smalling and Ashley Young at the Camp Nou in April 2019. Let that be the benchmark for a respectable outing next season: hearing the Champions League theme in April.\nGeorge Caulkin: Difficult to predict. The challenge of midweek to weekend matches combined with lots of travel often takes a toll; it will be a new one for Howe and some of his players. Yet look at the way Newcastle have taken games to big teams (and become a big team in the process). You would back them – and St James’ – to rise to it.\nAdvertisement\nAndy Jones: Liverpool and Klopp have reached three of the past five finals, winning one, so they will have high expectations. The club’s history in the competition and the famous Anfield atmosphere make them a team nobody wants to draw during the competition – unless you are Real Madrid, who have had Liverpool’s number during Klopp’s tenure. If the summer window goes to plan, Liverpool will hope to be able to go toe-to-toe with anyone.\nPredict your team’s remaining results\nCarl Anka: Wolves (H): Win; Bournemouth (A): Win; Chelsea (H): Draw; Fulham (H): Win\nThis should be a straightforward run-in given none of the teams United face have much to play for.\nGeorge Caulkin: Leeds (A): Win; Brighton (H): Draw; Leicester City (H): Win; Chelsea (A): Draw\nSam Allardyce’s first home match as Leeds manager should be a decent, raucous occasion, but there is nothing for Newcastle to fear and fear isn’t in their make-up anyway.\nAndy Jones: Leicester (A): Win; Aston Villa (H): Win; Southampton (A): Win\nLiverpool have a favourable run-in. Leicester are leaking goals and struggling, Aston Villa appear to be running out of steam under Unai Emery and Southampton will almost certainly be relegated by the final day.\n(Top photos: Getty Images)",
  "word_count": 2618,
  "scraped_at": "2026-02-14T02:00:19.999055",
  "_text_extracted": true
}