{
  "article_id": "765435f1f4b7",
  "url": "https://metro.co.uk/2023/06/20/manchester-united-agree-deal-to-sell-starlet-zidane-iqbal-in-1million-deal-to-utrecht-18985287/",
  "title": "Manchester United agree deal to sell starlet Zidane Iqbal in €1million deal to Utrecht | Football",
  "date": "20230620T184500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have agreed a deal to sell midfield starlet Zidane Iqbal to Utrecht.\nThe academy graduate, who made his only senior appearance for United in a Champions League group stage clash against Young Boys in 2021, has agreed a four-year deal with the Dutch side, The Athletic report.\nUnited have agreed a fee of €1million (£850,000) that also includes a ‘significant’ sell-on clause.\nThe 20-year-old midfielder impressed during United’s pre-season campaign last summer but did not manage a single minute of senior football during the 2022-23 campaign, making the match day squad on 17 occasions.\nHe has made three appearances at international level for Iraq.\nUnited are hoping to offload a number of players this summer to help raise additional transfer funds.\nFulham are interested in signing midfielder Fred who has one year remaining on his current deal at Old Trafford.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nScott McTominay is another who could be moved on if the right offer comes in with Newcastle United among the sides to have shown interest in the 26-year-old.\nDean Henderson and Harry Maguire could also help United refill the coffers with Nottingham Forest in talks to sign the goalkeeper with United hoping to get £25m.\nMore Trending\nMaguire meanwhile has attracted interest from a number of Premier League sides having lost his place in the starting XI but could yet stay at Old Trafford and fight to his place.\nEric Bailly, Alex Telles, Anthony Elanga and Brandon Williams are also among those who could be offloaded with Anthony Martial’s future also uncertain.\nPhil Jones and Axel Tuanzebe will leave the club when their respective contracts expire at the end of the month.\nMORE: ‘You have to create more’ – Andy Cole questions whether Antony is ‘Manchester United standard’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 365,
  "scraped_at": "2026-02-14T01:48:17.232229",
  "_text_extracted": true
}