{
  "article_id": "76741bfc5fc5",
  "url": "https://www.espn.com/soccer/tottenham-hotspur-engtottenham/story/4883686/harry-kane-faces-career-dilemma-at-tottenham-given-lack-of-trophies",
  "title": "Should Harry Kane sign new Spurs contract or seek trophies ? ",
  "date": "20230223T133000Z",
  "domain": "espn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Harry Kane now has just two players above him in the all-time Premier League goal-scoring chart, and each offers a different signpost at the fork in the road his career has reached.\nAfter netting his 200th goal in English football's top flight this month, Kane has only Wayne Rooney (208) and Alan Shearer (260) to chase down in his pursuit of another prestigious record. Shearer chose to join and power his hometown club (Newcastle United) after winning one league title at Blackburn Rovers, while Rooney left his (Everton) to win trophies at Manchester United. Which road might Kane take? He's already Tottenham Hotspur's all-time top scorer, and the England record will be his the next time he finds the net in an international fixture, too, but are these records enough to satisfy him?\nIt was Shearer who turned down the chance to move to Man United in 1996, then the dominant force in England, in favour of joining Newcastle. Ultimately, he chose to prioritise his longstanding affinity with one club over the near-certain guarantee of silverware with another.\n\"There is not one minute of any day I look back at my career and say I wish had gone to Manchester United because I would have won medals,\" Shearer said earlier this month. It's probably what someone with a stunning scoring record, but one solitary league winner's medal, would say.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nIt remains borderline inexplicable that a player as relentlessly efficient in front of goal as Shearer won the Premier League on only one occasion, with Blackburn in 1995. Shearer stood in the Gallowgate End at St James' Park as a youngster and felt the lure of \"achieving my dream\" of playing for Newcastle too great to resist.\n\"Harry has the Tottenham record and will have a statue, will get the England record and probably a statue at Wembley, and there's a good chance the Premier League record,\" Shearer continued. \"They are his medals. He is the only one who can answer it, if he can say, 'I'm the happiest guy alive, I have all the records, I might not have a trophy, but I'm happy.'\"\nThe jury is still out on how Kane feels now. But it is ominous for Tottenham that he tried to force an exit in 2021, believing Spurs were ill-equipped to satisfy his desire to win silverware having won nothing to that point, despite establishing himself as one of the finest strikers of his generation.\nKane's contract expires in 2024, and the situation is likely to reach a tipping point this summer, particularly if Spurs miss out on Champions League football and extend their wait for a trophy to 15 years. Tottenham will want to keep their star man and tie him to a new contract. Kane turns 30 in July and although he is in supreme physical condition, a footballer's typical lifespan suggests the next deal -- wherever he signs it -- will be the last major long-term commitment of his playing career.\nThe good news for Tottenham is that Kane's options have narrowed since 2021. After Manchester City failed to convince Spurs to allow him to leave -- sources told ESPN at the time that City never got close to matching Daniel Levy's £150 million valuation -- they won the Premier League (again) without a No. 9, and then signed Erling Haaland.\nA move to Chelsea is complicated given the animosity between the two London rivals, but that did not entirely put the Blues off at the time; however, they ended up plumping for Romelu Lukaku from Inter Milan for less money and less hassle. Lukaku's return didn't exactly go to plan -- he's back at Inter on loan -- and Kane's potential availability would surely interest a team struggling to score (23 goals in 23 league games tells its own story), but Levy is still reluctant to do a deal with Chelsea and in any case, the Blues have Christopher Nkunku arriving in the summer from RB Leipzig.\nLiverpool committed a club-record £85m on Darwin Nunez only last summer and, having also signed Cody Gakpo from PSV Eindhoven in the January window, are prioritising a move for a midfielder this summer, with Jude Bellingham top of their list and Chelsea playmaker Mason Mount also under consideration.\nKane was released by Arsenal at 8 years old, but letting their prized player join their north London rivals is unthinkable in any circumstances -- and in any case, the Gunners have Gabriel Jesus returning from injury -- which leaves Manchester United as the only real option left in England.\nElsewhere in Europe, Bayern Munich's interest is credible and the appeal for Spurs in reaching an agreement with an overseas club is obvious given it would create welcome distance between the club and the consequences of allowing Kane to leave. The likely slam dunk that is while a Bundesliga title -- Bayern have now won the league for a decade straight, though this season is shaping up to be a much closer race -- would appeal to a player craving silverware, Kane remaining in England feels more likely.\nIf he does, it sets up the possibility of Kane emulating Rooney -- albeit much later in his career -- and turning his back on the club he loved for the chance to fill his trophy cabinet at Old Trafford.\nOf course, United are no longer the guarantee of silverware they once represented. They have not won the Premier League since Sir Alex Ferguson retired in 2013 and are aiming to end a six-year drought of their own in Sunday's Carabao Cup final against Newcastle. Yet Man United look resurgent under Erik ten Hag this season, the flawed ownership of the Glazer family might soon come to an end with the club up for sale, and the sheer scale of their global reach makes them a step up, for all the infrastructure improvements -- most obviously their superb £1 billion stadium -- that Spurs have made.\nUnited might be monitoring their compliance with financial fair play, but regardless, their wage bill and resources suggest they have more firepower than Spurs as the two clubs seek to challenge.\nRooney took the gamble in August 2004 and ended with every winners' medal possible at the club level: five Premier League titles, the Champions League, the FA Cup, four League Cups, the Europa League and the Club World Cup. He also ended as the all-time top scorer for Man United and England. He returned to Everton in 2017 as a shadow of the player he was, a season-long coda to his career that began with the promise he was \"once a blue, always a blue\" and ended as the most decorated of Reds.\nShearer declined the big move and will be forever adored on Tyneside. Despite winning nothing at Newcastle, he never regretted it. \"I have memories I will hold forever and a goal-scoring record that makes me extremely proud,\" he said ahead of his final game in 2006.\nBarring serious injury, it is only a matter of time before Kane breaks Shearer's record if he stays in England. The time will soon come for Kane to decide if that and continuing the collective climb with Tottenham is enough, or whether life elsewhere is worth exploring.",
  "word_count": 1221,
  "scraped_at": "2026-02-14T01:46:30.524304",
  "_text_extracted": true
}