{
  "article_id": "7675e3524842",
  "url": "https://metro.co.uk/2024/02/23/erik-ten-hag-speaks-man-utd-future-following-sir-jim-ratcliffe-takeover-20335511/",
  "title": "Erik ten Hag speaks out on Man Utd future following Sir Jim Ratcliffe takeover",
  "date": "20240223T143000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erik ten Hag says he does not feel any more pressure to deliver for Manchester United following the arrival of new co-owner Sir Jim Ratcliffe.\nEarlier this week, Ratcliffe finally completed his partial takeover of United, paying £1.3billion for a 27.7% stake in the Premier League giant.\nThe INEOS owner is already hard at work assembling a behind-the-scenes team that can get the Red Devils back to the top of English and European football.\nBut there have also been plenty of rumours about the future of Ten Hag and whether Ratcliffe and co. want to continue with the Dutch manager who was hired in 2022.\nThe pressure on the former Ajax boss has increased significantly this season after United were embarrassingly knocked out of the Champions League group stage, while they now face a big fight just to finish in the top four.\nBut Ten Hag is confident that he can deliver for Ratcliffe and, speaking in his pre-Fulham press conference, claimed that the British billionaire has ‘absolute’ faith in him.\nHe said: ‘We are very aligned. We have the same ambition. We belong there [Champions League], we believe, we have to prove it.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘We speak a lot, there are many conversations with him, with Dave Brailsford about this club, about this team, about the structures, we are very aligned, it totally fits with ambitions I have, ambitions I had when I came in.\n‘I’m 19 months in and I see we are going in the right direction. We have had setbacks in the second season but you see the team coming, the squad developing, work hard on the training pitch, work hard during games.\n‘It’s important to have players fit but also to construct the squad, we will be strong and we will be even stronger when we add to this squad even more qualities.’\nMore Trending\nAsked if there was more pressure on him now than before, Ten Hag added: ‘That will always be the case [more pressure] but I see the process and I see this team is developing, it’s progressing.\n‘I see we have now also the right age across the squad, we can make that even stronger and they will grow and we will do everything in our power. There is strong competition.\n‘Every game is a final for us because we have to be in the Champions League, the players want this, the team want this but we have to believe.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Chelsea star Thiago Silva facing race to be fit for Carabao Cup final against Liverpool\nMORE: Manchester United suffer another huge injury setback with Rasmus Hojlund set to miss three weeks",
  "word_count": 514,
  "scraped_at": "2026-02-14T02:10:42.021465",
  "_text_extracted": true
}