{
  "article_id": "767812186916",
  "url": "https://www.geosuper.tv/latest/24168-everything-is-beyond-what-i-expected-guardiola",
  "title": "Everything is beyond what I expected : Guardiola",
  "date": "20230430T100000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nApril 30, 2023\nManchester City manager Pep Guardiola is grateful for what he has achieved as a manager in football.\nGuardiola, who is considered one of the greatest managers of all time, has won 11 major trophies with City and is also in contention for three titles this season.\n“I never expect to live what I’ve lived,” Guardiola was quoted as saying by the City’s official website.\n“When I started in the fourth division with Barcelona and after being promoted to the first division, never in my life did I expect to do it.\n“Everything is beyond what I expected and I’m more than grateful to have lived with incredible teams and players this kind of life.\n“If people said tomorrow I have to finish my career right now for some reason, I can’t ask for anything else. Anything else. I am so fortunate and privileged.\n“It’s a privilege to be at the end of the season fighting for titles is the best feeling that we can have.\n“I know that if we don’t win the treble, I know that if we don’t win the Premier League, the season will be a failure but it doesn’t matter.\n“We accept that but the important thing is still we're there and prepared and think about the final of the FA Cup and the Premier League is still in our hands.”\nGuardiola is also eager to win the UEFA Champions League once again after claiming the title twice with FC Barcelona in the past.\n“You cannot win anything if you don’t think about it,” he said.\n“Of course we think about it all of the time. The experience for me doesn’t mean what you done in the past is going to happen in the future but being there many times helps.\n“As much time as you can be in quarter-finals, semi-finals, Champions League, FA Cup will be closer. As much you play those games.”",
  "word_count": 324,
  "scraped_at": "2026-02-14T02:06:54.990118",
  "_text_extracted": true
}