{
  "article_id": "76c633bed875",
  "url": "https://www.anglocelt.ie/2025/09/24/unai-emery-says-monchi-exit-changes-nothing-at-aston-villa/",
  "title": "Unai Emery says Monchi exit  changes nothing  at Aston Villa",
  "date": "20250924T213000Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Unai Emery says Monchi exit ‘changes nothing’ at Aston Villa\nBy Phil Blanche, PA\nUnai Emery insists the departure of Monchi as Aston Villa’s president of football operations “changes nothing” at the Premier League club.\nMonchi played a role in Villa securing Champions League football last season, when they reached the quarter-finals before losing to eventual winners Paris St Germain, and the 57-year-old has been described as a key ally of fellow Spaniard Emery.\nVilla have moved quickly to fill the gap caused by Monchi’s resignation, appointing former Real Sociedad sporting director Roberto Olabe.\n“We arrived three years ago with the project we did with the club,” head coach Emery said before Villa’s opening Europa League tie at home to Bologna on Thursday.\n“Monchi arrived six months after we arrived here. He was very good, but after two years he needed another chapter in his career. I am wishing him the best in his new chapter.\n“It is something progressively we were working on after speaking with Monchi. After the window finished we spoke about it (him leaving).\n“We decided with him and the club to do a normal transition. It changes nothing, only changing the man.\n“We reacted quickly by bringing in one person I know personally. I have a lot of confidence with Roberto and he is coming to help us.”\nWe decided with him (Monchi) and the club to do a normal transition. It changes nothing, only changing the manAston Villa manager Unai Emery\nThe surprise news of Monchi’s departure has added to the sense of early-season gloom around Villa Park.\nHampered by the Premier League’s strict financial profitability and sustainability rules, homegrown talent Jacob Ramsey was sold to Newcastle to satisfy PSR.\nVilla are currently 18th in the Premier League, having drawn three and lost two of their opening five games and scored only once – in a 1-1 draw against 10-man Sunderland.\nEmery hopes to kick-start Villa’s season in a competition he won four times between 2014 and 2021, three times at Sevilla and once at Villarreal.\n“I told the players, for me, Europe is always a dream,” Emery said.\n“To share it with the supporters – two years ago in the Conference League (reaching the semi-finals), Villa Park was always amazing. Last year in the Champions League, the same.\n“I think the supporters will be excited about this competition as well, like I am. It is another competition to share special moments.”\nEmery accused his players of being “lazy” at times in Sunday’s draw at the Stadium of Light when Matty Cash had opened the scoring against disadvantaged hosts.\nAsked about Emery’s assessment, England defender Ezri Konsa said: “It’s a fair comment. Everyone saw the picture and the goal.\n“We try to pride ourselves on playing a high line. We didn’t quite get it right so far this season.\n“I don’t think we are at that stage to have what people call crisis meetings. There are blips and we are going through that right now.\n“The boss isn’t a big speaker. Sometimes he keeps himself to himself.\n“When your manager doesn’t speak well of you, it puts a bit of fuel into you to prove everyone wrong.”\nEngland international Ross Barkley could be available for the first time since May, but Amadou Onana and Youri Tielemans are set to be absent again after failing to train on Wednesday.",
  "word_count": 564,
  "scraped_at": "2026-02-14T02:26:56.621944",
  "_text_extracted": true
}