{
  "article_id": "76ef7afa8766",
  "url": "https://www.arsenal.com/news/community-shield-preview-arsenal-v-man-city",
  "title": "Community Shield preview : Arsenal v Man City",
  "date": "20230805T090000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sunday sees us head to Wembley for our first taste of competitive action this season, as we face Treble winners Manchester City with the Community Shield on the line.\nIt will be our first visit to the national stadium since August 2020 when we beat Liverpool to claim our 16th success in the competition, and despite being his fourth appearance at the venue as our boss, it’ll be the first time Mikel Arteta will lead his team out in front of spectators.\nThe venue has proven to be a lucky one for us in recent times, as we have lost just two of our last 15 games there in all competitions, including the two times we have beaten Pep Guardiola’s City, which came in the 2017 and 2020 FA Cup semi-finals.\nCity’s summer of status quo - so far...\nAfter City swept all-comers aside last season, they looked set to head into this fixture with more or less the same squad that triumphed in Istanbul less than two months ago. Skipper Ilkay Gundogan departed to Barcelona while Riyad Mahrez was lured to Saudi Arabia, with Chelsea’s Mateo Kovacic the only new face 48 hours before kick-off.\nHowever, on Saturday RB Leipzig centre-back Josko Gvardiol was confirmed as a City player for a reported £77 million - the 21-year-old is a Croatian international teammate of Kovacic's. That fee has been supplemented by their profitable academy, with midfielder Shea Charles joining Southampton, England under-21 goalkeeper James Trafford heading to Burnley and Portuguese forward Carlos Borges switching to Ajax for a combined £37 million.\nOn the pitch, they have played just three pre-season friendlies during a tour of Japan and South Korea. They beat City Football Group affiliate Yokohama Marinos 5-3 having been 2-0 behind, before a late Aymeric Laporte goal beat Bayern Munich 2-1. Sunday then saw them defeated 2-1 by Atletico Madrid in a soggy Seoul.\nWhat the managers say\nArteta: “We’re very excited to play a final and have the opportunity to win a trophy against a team that is the team to beat. They were the best team in Europe last season, and we know what the standards and are how we need to win the game, but we’re very excited.\n“They’ve shown their consistency over the years and they merit respect from everybody for what they’ve done. If you want to challenge for that championship you know the total points that you’re going to be needing and that’s unheard of in this league for the last 100 years. So that’s the standard and if you want to be there, you know what you have to do.”\nGuardiola: “Normally when you win the titles that we won they give you a chance to play for new ones – Community Shield and Sevilla next week and in Saudi Arabia in winter time [at the World Cup Championship]. [It] will be a good opportunity [to win another trophy]. Of course, we are going to try.\n“We know the situation we are in right now. We finish two weeks after Arsenal. We start two weeks after Arsenal. We are not in the best way but it is a final, hopefully our mentality can help us to compete and try to win the title.\"\nTeam news\nWe will be without Gabriel Jesus for the next couple of weeks after Mikel announced he underwent a small procedure on his knee, while another City old boy in Oleksandr Zinchenko could also be missing after sitting out all of pre-season so far with a calf issue, but has been back in training this week.\nMohamed Elneny continues to recover from his long-term knee injury, while Reiss Nelson, Folarin Balogun and Sambi Lokonga have also had issues that have prevented them from being selected in recent weeks.\nKevin de Bruyne has not played a minute during pre-season so far as he continues to recover from the hamstring injury he sustained in the Champions League final, but Guardiola believes he is closing in on a return.\nNathan Ake is City’s other doubt after he sat out the Atletico Madrid game last week as a precaution, but is expected to be fit.\nFacts and stats\nWe have won the Community Shield on the last four occasions we've participated in it since losing 2-1 against Chelsea in 2005. The last time we failed to win the Shield at Wembley was in 1993, when Manchester United beat us on penalties.\nManchester City have lost their last two Community Shield matches - 1-0 against Leicester City in 2021 and 3-1 against Liverpool last year. The only team to lose the match in three consecutive years are Manchester United, who lost four in a row between 1998 and 2001.\nThis will be the third Community Shield meeting between the two sides, and we won the previous two – 4-0 at Highbury in 1934 and 3-0 at Wembley in 2014.\nIn the Premier League era, the seven previous Double winners have won five of their seven appearances in the following campaign's Community Shield.\nThe previous season’s FA Cup winner has won the Community Shield in eight of the previous nine editions, the only exception being in 2018 when City beat Chelsea 2-0.\nKevin De Bruyne has been involved in eight goals in his last eight appearances against us in all competitions (6 goals, 2 assists), including five in his last two. The Belgian has also had a hand in six goals in his last eight club games at Wembley (1 goal, 5 assists), setting up both of the Citizens' goals in their FA Cup final win against Manchester United in May.\nAfter scoring in last season’s Community Shield, Julian Alvarez could become the first player to score in consecutive years since Adrian Heath did so for Everton in 1985 and 1986.\nNo current Arsenal player has scored for us at Wembley – our last five goals at the ground were all netted by Pierre-Emerick Aubameyang.\nFind out much more about our record in the Community Shield, as well as the history of the competition itself, with our fun facts.\nMatch officials\nStuart Attwell has been handed a chance to run out at Wembley, and last season saw us win the two games of ours he officiated - the 2-0 win at Wolves in November before the 4-1 success against Crystal Palace in March. Those were two of just eight wins we’ve achieved from the 19 games he’s refereed.\nOn two occasions he has overseen this particular matchup - a 4-1 loss in the League Cup back in December 2020 and the New Year’s Day meeting in 2022 when he dismissed Gabriel for two bookable offences before Rodri netted a last-minute winner to seal a 2-1 win for City.\n- Referee: Stuart Attwell\n- Assistants: Tim Wood and Dan Robathan\n- Fourth official: Steve Meredith\n- VAR: Michael Salisbury\n- Assistant VAR: Neil Davies\nCommunity Shield classics\nWe have a strong history in this competition, with only Manchester United winning it more times than our 16 triumphs, which includes our last four matches.\nOur last success three years ago came courtesy of a penalty shootout against Liverpool following a 1-1 draw, while we won it three years out of our four in the middle of the last decade, starting with a 3-0 win at City’s expense in 2014 when Arteta climbed the famous steps to lift the silverware.\nChelsea were our victims in both 2015 and 2017, while we also beat Manchester United twice in a row in the late 1990s. All those wins came at Wembley, but we also tasted glory in Cardiff in 2002 when Gilberto Silva’s goal beat Liverpool at the Millennium Stadium.\nRelive the highlights from those games by reliving six of our best Shield wins\nBreakdown Live\nOur matchday show goes on the road on Sunday, as Nicole Holliday and Adrian Clarke are live pitchside at Wembley Stadium providing the best pre-match build-up for any Gooner!\nThey'll look back over pre-season and preview the Premier League campaign ahead, plus you'll hear from Arsène Wenger following the unveiling of his statue at Emirates Stadium.\nLive kick-by-kick commentary from the game will come from Dan Roebuck and David Hillier, so tune into Arsenal.com and the official app from 3.30pm for all the best Arsenal-related coverage.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1410,
  "scraped_at": "2026-02-14T02:00:36.686671",
  "_text_extracted": true
}