{
  "article_id": "77148f6a9475",
  "url": "https://thepeoplesperson.com/2025/12/15/is-ruben-amorim-a-tactical-revolutionary-or-a-renegade-302268/",
  "title": "Is Ruben Amorim a tactical revolutionary or a renegade ? - Man United News And Transfer News",
  "date": "20251215T171500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Oxford Dictionary Word of the Year for 2025 was ‘rage bait’: a term to describe “online content deliberately created to provoke anger, outrage, or strong negative reactions to drive engagement”.\nBut if the publication were tasked with providing a word to define the past twelve months at Old Trafford, it would undoubtedly be ‘system’ — with Ruben Amorim‘s 3-4-2-1 set-up causing almost unrelenting rage bait across the Manchester United fanbase since his arrival from Sporting CP last year.\nThe Formation Fallacy\nThere is a fixation on formations in modern football.\nFans obsess, be it with a pint in hand down the pub or in angrily written exchanges on Twitter, over a sequence of numbers used to reductively define their team’s entire game plan on match day.\n“Why are we playing a 4-2-3-1?! We clearly need to line up with a 4-1-2-1-2,” a secondary school teacher decries to his software engineer best friend after their sixth Heineken. “No, no, no – obviously a 4-3-3 with a false nine is the way to go, you idiot!” the engineer volleys back as they impatiently wait for the seventh drink to arrive, and Roy Keane pines for a return to 4-4-2 on the screen above the bar.\nBut football is not a Subbuteo board.\nThe game is a fluid, dynamic beast which violently shifts from one moment to another. And a manager’s ‘system’ is rarely one formation; rather, it is a series of models designed to capitalise upon, or counteract, this volatile landscape.\nHow a team sets up with the ball will not be the same way they play without it. The approach a manager adopts to navigate this delicate balance — ‘in possession’ versus ‘out of possession’ — defines their philosophy on the pitch, though it can simply stem from the resources afforded to them off it. It is easier, after all, to sit deep and defend than it is to proactively push up and fight fire with fire.\nTwo of the most popular ‘models’ to have emerged in recent years — a 3-2-5 (or 3-1-6) shape in possession and a 4-4-2 out of it — can be achieved whether the base formation is a 4-2-3-1, a 4-3-3 or, as Amorim has steadfastly sought to implement at the Theatre of Dreams, a 3-4-2-1.\nThe Portuguese coach is inexorably wed to those four numbers, comprising three centre-backs, two wing-backs, a double pivot in midfield, and a No.9 flanked by a pair of No. 10s.\nBut, despite his dogmatic application of it, he has consistently spoken about the flexibility his ‘system’ — not trying to rage bait readers here — offers. In fact, it was one of the key selling points which led INEOS to appoint Amorim during their courting process to source Erik ten Hag’s replacement last year.\nIn October 2024, along with his agent, Amorim met Sir Jim Ratcliffe and United’s executive branch — Omar Berrada, Jason Wilcox and the soon-to-be-sacked Dan Ashworth — in Spain for a five-hour meeting to discuss the then-Sporting manager’s prospects of taking the reins at Old Trafford.\nThe Athletic reveals the interviewee impressed his interviewers with his “football vision”, as well as his “charisma, emotional and tactical intelligence”, traits which stood in direct contrast to the dour Dutchman INEOS had just shown the door.\nAmorim outlined the importance he felt a back three held to his understanding of football, but stressed there was a “degree of flexibility to his philosophy and that he would evolve at the right times”. He highlighted the need for “tactically versatile players” to accommodate this approach.\nUnited’s executives concluded that the system — again, not rage bait — was “overall not so far from what Arsenal and Manchester City were doing”, with the club’s local rivals having achieved a treble in 2023 by playing a “four-man defence comprised entirely of centre-backs.”\nThe Template for Success\nIgnoring the (allegedly) corrupt and illegal elephant in the room when it comes to Pep Guardiola’s side, with 115 reasons not to turn a blind eye to Dumbo, the Spaniard secured this immoral triumph with a shape, in possession, that largely resembles how United line up under Amorim — in theory at least.\nAs per City’s website, Guardiola lined up against Inter Milan in the Champions League final with a starting eleven — Ederson, Akanji, Stones, Dias, Ake, Rodri, Gundogan, De Bruyne, Bernardo, Grealish, Haaland — in a 4-2-3-1 base formation.\nBut this does not accurately reflect the way in which City attacked with the ball, nor defended without it, in the 1-0 win.\nIn possession, Guardiola instructed John Stones, as the England international had done throughout the 2022/23 campaign, to invert into midfield alongside Rodri, while Nathan Ake tucked inside to form a back three.\nEderson\nAkanji Dias Ake\nStones Rodri\nBernardo De Bruyne Gundogan Grealish\nHaaland\nIf possession was surrendered, Stones moved back into defence, Ilkay Gundogan re-joined Rodri in a central pivot, and City dropped into a 4-4-2 with Kevin De Bruyne pressing from the front alongside Erling Haaland.\nEderson\nAkanji Stones Dias Ake\nBernardo Gundogan Rodri Grealish\nHaaland De Bruyne\nThis adaptable approach was key to City’s success that year, domestically as well as on the continent, with Guardiola vanquishing his former acolyte, Mikel Arteta, in a red-hot race for the Premier League title.\nDespite Arsenal topping the table for 248 days — the most any team has led the league without winning it — Arteta’s side ran out of steam at the business end of the season. Nevertheless, it was an impressive campaign at the Emirates, representing the first tangible demonstration of progress under their young manager.\nCentral to the Gunners’ transformation from pretenders to contenders was Arteta’s shift towards this 3-2-5 structure.\nArsenal ostensibly lined up in a 4-3-3 base formation: Ramsdale, White, Saliba, Gabriel, Zinchenko, Partey, Xhaka, Ødegaard , Saka, Jesus and Martinelli being their most used starting eleven.\nBut where Guardiola instructed a centre-back to join the midfield in Manchester, it was Oleksandr Zinchenko — signed from City in the summer of 2022 — who inverted from left-back alongside Thomas Partey to buttress the middle of the pitch in north London, allowing Granit Xhaka to roam forward.\nRamsdale\nWhite Saliba Gabriel\nPartey Zinchenko\nSaka Ødegaard Xhaka Martinelli\nJesus\nThe Ukrainian would then return to defence if possession was ceded, as Xhaka dropped back into midfield, and Matin Ødegaard remained high next to Gabriel Jesus.\nRamsdale\nWhite Saliba Gabriel Zinchenko\nSaka Partey Xhaka Martinelli\nØdegaard Jesus\nThe most notable comparison from a United perspective is how both of their rivals set up with the ball, this 3-2-5 shape which has come to dominate European football. Paris Saint-Germain won their first Champions League last year, as well as a league and cup double in France, with their own version, coached to perfection by Luis Enrique.\nAnd it bears a striking resemblance, on paper, to Amorim’s 3-4-2-1 system — but the similarities in recipe do not extend to the ingredients, with the final product different as a result.\nSame System, Different Decisions\nWhere Arteta and Guardiola started with four defenders, three midfielders and three forwards— which then morphed into this modern twist with three centre-backs, two central midfielders, and five attackers — Amorim skips the transitional phase by lining up with his centre-halves and double midfield pivot already in place from the first whistle.\nThe fundamental difference comes out wide, where he employs wing-backs, rather than wingers, to maintain width and provide overlaps in the final third, pushing up to join the front three, thus creating the five-man attack.\nThere are other, subtler differences between Amorim and his peers, but it’s the use of wing-backs which makes his approach unique — and where it lives and dies.\nIf we take United’s starting eleven against City earlier in the season, a 3–0 defeat at the Etihad, we can see this structure: the same one used in Amorim’s debut against Ipswich Town last year, in every match since, and, in all likelihood, until the day he departs Old Trafford.\nBayindir\nYoro De Ligt Shaw\nMazraoui Ugarte Fernandes Dorgu\nMbeumo Amad\nSesko\nIn possession, the 3-4-2-1 base formation easily transitions into a 3-2-5 shape, as shown by the match’s pass map, with Noussair Mazraoui and Patrick Dorgu pushing forward to join the attack.\nBayindir\nYoro De Ligt Shaw\nUgarte Fernandes\nMazraoui Mbeumo Amad Dorgu\nŠeško\nThree centre-backs? Tick. Two central midfielders? Tick. A five-man attack designed to overload the opposition defence? Tick. So why does Amorim’s version of the same set-up not match his rivals’, given INEOS’s analysis indicated they were broadly similar?\nTwo primary reasons: firstly, the quality of the squad available to him, even after over £200 million was invested in the summer; secondly — and the main subject of this article — his approach is filled with choices that border on contradictions, given they place the wrong players in the wrong positions, setting those individuals, and the wider collective, up for failure, as evidenced by the comfortable win for United’s neighbour.\n1. Wing-Backs vs Wingers\nIn Arteta and Guardiola’s version of the 3-2-5 shape, wingers — Saka and Martinelli for Arsenal, Bernardo and Grealish for City — provide the threat out wide. Both sets of attackers possess a level of technical ability and incisiveness in the final third that Amorim’s wing-backs, Dorgu and Mazraoui in this instance, cannot possibly replicate, given they are defenders by trade.\nIn the defeat to City, the player with the most touches in the opposition box, for either team, was Dorgu with 12. This is a remarkable number for a brutal away fixture, given that Bryan Mbeumo — recruited for £71m and one of United’s premier attackers — averages just 4.87 per match, the team’s highest this campaign.\nDorgu was signed in the January transfer window, Amorim’s first at Old Trafford, to provide the Portuguese coach with a “specialist” at left wing-back. But the 21-year-old Denmark international is not capable of decisively affecting the game in the opposition half, lacking the attacking guile to justify a system which intentionally feeds him the ball in these threatening areas.\n“It seems extraordinary to think that this is by design but that is how it can feel with Amorim’s United. So much depends on the quality of the wing-backs in this system but even though Dorgu is seen as a specialist in the role, does he have the tools required?” Sky Sports analyst Adam Bate asked in the wake of the derby defeat.\nThe answer, approaching a year since his capture from Serie A minnow Lecce: no.\nDorgu is young enough to improve, however, and his elite duel-winning ability and strong physical attributes make him well-suited to Premier League football — just closer to his own goal than the opposition’s, most likely as a traditional left-back.\nThese struggles have seen the Dane lose his place to Diogo Dalot in recent months. But the 26-year-old right-footed right-back is a similarly awkward fit at left wing-back, while Luke Shaw — the club’s most technically gifted fullback — has been reinvented as a central defender under Amorim, with his injury-ravaged body no longer capable of playing further forward.\nIt’s little wonder, therefore, why United’s left-hand side has been largely impotent this season, particularly in comparison to the right, where Amad provides a much more effective version of the wing-back upon which his coach’s philosophy relies.\nAmorim acknowledged as such in a press-conference after the dismal 1-0 defeat to 10-man Everton, stating “we should have an Amad” to play on the left as an explanation — or excuse, depending how far along the rage bait spectrum you reside — for United’s limp attacking performance.\nThe Ivorian winger has been redeployed in this deeper role since Amorim took the helm. He possesses brilliant technique with dizzying and dazzling dribbling, comparable to the wingers at the Etihad or Emirates.\nBut his work rate and pressing are also strong, enabling him to meet the demands Amorim places on his wing-backs better than his teammates.\nIf United were to sign a version of Amad — an attacking wide player with inventiveness and industry in equal measure — to replace Dorgu or Dalot at left wing-back, it would create a far more dangerous version of Amorim’s five-man attacking unit.\nOne potential target is Bournemouth winger Antoine Semenyo, whom the Red Devils made overtures to sign last summer before pivoting towards Mbeumo after being deterred by the asking price for the Ghana international.\nDespite not having played as a wing-back before, Semenyo’s profile makes him an ideal candidate for the transition. Standing 6ft 1in and possessing a unique blend of speed and strength for someone so skilful, the ambipedal winger is as dangerous with the ball as he is hard-working without it.\nAmorim specifically name checked Semenyo as a “special player” in an interview ahead of tonight’s match against Bournemouth at Old Trafford, with the Portuguese believed to be infatuated by the 25-year-old speedster.\nThe prospect of Semenyo bombing down the left as Cunha drifts inside, and Amad doing the same on the opposite flank while Mbeumo races ahead of him, all looking to feed a hungry Benjamin Šeško in the box, is a tantalising one for United fans. Were Semenyo to have had 12 touches in the City box, the result may have been radically different.\nBut is it realistic proposition? Amorim’s full explanation for wanting an “Amad on the left” suggests not.\n“We need time to improve the characteristics of the team. I’ve said that over the last year. To give an example, in the last game [against Everton], we should have an Amad with the right foot to put on the other side to play against 10 men,” he stated. “It is these characteristics that in time we will try to get to be a better team. If we are the perfect set-up to play in this way, not yet. But like any team, we need time to put the right characteristics into every position.”\nThe salient part of Amorim’s analysis — one that should ring alarm bells for United fans — is his call for another Amad when playing “against 10 men”. It speaks to his cautious approach, indicating a preference for at least one defensively-minded wing-back when facing a full-strength side, as he consistently used with Sporting.\nIf United were to trigger Semenyo’s £65m release clause in January — an unrealistic prospect given the club’s financial situation — would Amorim start the Ghanaian at left wing-back, with Amad on the right, in every match? Or would he simply reserve it for situations where he feels comfortable taking that attacking risk, such as at home against a bottom-half side reduced to ten men?\nHis own words, as well as choices over the past year, tells us the answer. And this is the first, and biggest, contradiction in Amorim’s approach: he is actively choosing to play at least one, sometimes two, defenders as part of his forward line.\nBut even if he were to be bold and play two attack-minded options at wing-back , this choice would necessitate a midfield with a level of physicality and mobility that none of the current options at Old Trafford possess — which leads us to the next contradiction in his system: the double pivot.\n2. Monsters vs Maestros in Midfield\nAmorim’s choice to start with two central midfielders runs antithetical to the three-man units the vast majority of other coaches use.\nBut there is historical precedent for success in England with this set-up: for example, Antonio Conte employed N’Golo Kanté and Nemanja Matic as a duo at the heart of Chelsea’s title-winning side in 2017, which mirrors how Amorim sets his team up.\nHowever, the Italian’s decision was based on the unique talents of those two players, with Kante being one of the most effective and energetic ball-winners in the Premier League era, and Matic a superb holding midfielder in his own right.\nConte chose that system precisely because of the players at his disposal, having shifted towards it after beginning the season poorly in a 4-3-3; Amorim imposes his system in spite of those available to him.\nIn Lisbon, the Portuguese coach would use physical midfielders whose best assets lay without the ball, hard runners capable of overcoming the numerical superiority they often faced. They were instructed to take minimal touches, instead relying on the centre-backs to step forward and function as progressors of the ball from deep.\nBut the Premier League is a different beast. Physicality is paramount in England and players, in virtually every position of the pitch, must demonstrate a base level to compete which far surpasses what is required elsewhere in Europe, Portugal being no exception.\nManuel Ugarte’s struggles are a testament to this, having previously thrived under Amorim’s tutelage at Sporting.\nThe Uruguayan has been a fringe player this season — justifiably, given his abject displays — while Kobbie Mainoo has been reduced to bench fodder, with the experienced duo of Casemiro and Bruno Fernandes forming the pairing Amorim has almost exclusively relied upon.\nThis is a compromise, however, based on the limited options available. The truth is no one from this cohort possesses the requisite physicality to thrive in a double pivot when faced with the brutality of Premier League football.\nA younger Casemiro would undoubtedly fit the bill, and his resurgence since Amorim’s arrival is a testament to his resilience and professionalism. But the Brazilian behemoth is succumbing to Father Time and his wage packet is a bill United are no longer willing to foot, with his contract set to expire at the end of the season.\nUnited pursued Brighton & Hove Albion midfielder Carlos Baleba in the summer — tacit acknowledgement of the issues in Amorim’s engine room. But the Seagulls’ exorbitant valuation of the 21-year-old Cameroonian dashed any hopes of a deal, despite him signalling a desire to complete the switch to Manchester.\nBaleba’s profile — a ball-winning defensive midfielder who dominates transitions with outstanding physicality — is much closer to what Amorim wants in midfield than, say, Mainoo or even his talismanic captain, Fernandes.\nConnor Gallagher is believed to be a target on loan in January, especially if Mainoo pushes for his own temporary exit. The 25-year-old midfielder is not a guaranteed starter at Atletico Madrid and is angling for a return to England with one eye on the World Cup next summer, the same motivation driving Mainoo out of Manchester.\nGallagher offers the hard yards and strong attributes out of possession United’s head coach prefers. But he does not come close to matching Mainoo’s skill or creativity with the ball.\nThe fact that Amorim cannot find a home in his midfield for a homegrown talent, a player whose value to the club runs far deeper than the fee he would command in the transfer market, is a damning indictment on his ‘system’.\nIn Arteta’s or Guardiola’s version of the 3-2-5 model, Mainoo would take the place of Xhaka or Gündoğan — technically gifted midfielders given the freedom to roam forward and influence play close to the opposition box. United’s starlet, who possesses quick feet, an incisive eye, and a nose for goal, would thrive in these conditions.\nInstead, in Amorim’s interpretation, Mainoo is forced to remain in a midfield pivot, as much a part of the defensive structure as the attack, while a defender like Dorgu is pushed up the pitch, with neither the inclination nor the skillset to justify his placement there.\nThe England international is not suited to this constrained role and, as a result, finds himself warming the bench at Old Trafford, and quickly falling out of Thomas Tuchel’s plans next summer. And the perverse reality is that, within the confines of Amorim’s system, this is the correct choice — but what does that say about the system?\nNow this writer is beginning to feel the rage bait.\nFernandes has also suffered under Amorim’s reign, despite being United’s best player and the beating heart of the football club.\nHe has been shifted permanently into midfield this year, having still played as a number ten at times last season. The signings of Cunha and Mbeumo have removed the need for him to be a part of the frontline, however.\nThe Portugal international is indefatigable, offering almost endless energy despite his age — spitting directly in the face of Father Time — and is never injured. He’s a superb passer, from anywhere on the pitch, and helps United progress the ball from deep.\nThis combination means there is some logic to Amorim’s decision to deploy him further back, given the paucity of alternatives. But the 31-year-old remains United’s most effective attacker, even when stationed deeper in midfield.\nMbeumo is the top scorer with seven goals, but Fernandes is second with four and has six assists to boot, while the Cameroonian winger has just one. If he was playing closer to the goal, and receiving the chances Mbeumo consistently has, it would not be a contest between the two.\nFernandes is one of the best No.10s in Europe. But Amorim prefers a particular profile in that position — one Mbeumo and Cunha possess, but their captain does not: dribblers who can drop deep, pick up the ball, and drive at the opposition, or run in behind the defensive line with pace, power and purpose.\nThis means, in Amorim’s view of football, one of the world’s best attacking midfielders no longer has a home in the attacking phase of midfield. And part of the need for this style of No.10 — a cross between a winger and an attacking midfielder — stems from the self-inflicted choice not to play with out-and-out wingers.\nIf we again use Arteta’s or Guardiola’s approach as a comparison, Fernandes would naturally adopt the roles of Ødegaard or De Bruyne — two players he would undoubtedly consider his peers — and a position virtually every other manager would play him in.\nSo where does that leave the midfield at the Theatre of Dreams?\nThe team’s best player is forced into a suboptimal role, one he still manages to make work because he is a world-class footballer, while the best youngster has no home on the pitch and a precarious future off it. And we do this because… Patrick Dorgu must receive 12 touches of the ball in the opposition box?\nA Theatre of Nightmares more like.\nThe Red Devils will target two midfielders this summer, with only the uninspiring prospect of Gallagher on loan in the winter window. A return for Baleba is expected while Elliot Anderson — Nottingham Forest’s breakout star and arguably the best midfielder in England not already plying his trade for one of the country’s top clubs — is also high on the club’s radar.\nIf United were to replace Casemiro and Fernandes with Baleba and Anderson, the midfield becomes far more capable of meeting Amorim’s demands. But it leaves the team’s talisman, Amorim’s right-hand man, without an obvious place in the starting eleven, and further pushes an academy starlet and fan favourite out the door — while spending the best part of £200m to achieve this.\nOnce again, contradiction is the overriding word.\n3. Centre-Backs as Creators\nThe final aspect of Amorim’s philosophy requiring analysis is the expectation for his defensive line to provide progressive passing from deep, functioning as creative outlets as much as centre-backs in possession.\nThis is not necessarily contradictory, with modern coaches almost ubiquitously viewing the defence as the beginning of the attack. A goalkeeper’s ability with their feet is valued as highly as their hands, while ‘old-school’ defenders — ones whose best attributes come in their own box — are a relic.\nBut a centre-back who can do both — dominate with and without the ball — is something of a unicorn, and United’s stable of central defenders lacks this mythical beast in its full manifestation.\nLet’s take Matthijs de Ligt as an example.\nHe is undoubtedly the best ‘pure’ centre-back at Old Trafford, combining superb defensive instincts with brutish physicality. But the Netherlands international is not particularly strong in possession, despite a footballing education in Ajax’s esteemed academy. He is not poor by any stretch of the imagination, but within a system dependent on progression from its defence, the Dutchman lacks a certain je ne sais quoi with the ball at his feet.\nAt the opposite end of the spectrum is Lisandro Martinez, the 27-year-old centre-back raised in Argentina but schooled in Amsterdam.\nMartinez is only 5ft 9in — the average height for a man in Britain, but diminutive by the standards of Premier League centre-backs. He is also lacking athletically, with poor mobility and explosiveness, instead relying on anticipation and awareness to combat attackers who can often outrun, outjump, and outmuscle him.\nSo why did Guardiola describe El Carnicero as one of the “top five centre-backs in the world” after United put City to the sword in the FA Cup final last year? Because of his outstanding abilities in possession, with few centre-backs capable of the incisive passing from deep he routinely demonstrates.\nMartinez offers Amorim exactly the profile of centre-back his system needs with the ball, but becomes something of a liability if it is lost. De Ligt, by contrast, comes alive in these moments, aggressively and confidently stepping up to win back possession for his team, though he loses this aura if the ball is regained.\nThis is not necessarily an issue which lies at the feet of Amorim; rather, it’s a reality of the demands modern football places on its defenders to offer a complete skillset, or risk being caught short in one area or the other.\nThe Portuguese coach’s system does, however, maximise the extremes of these demands, with the outside centre-backs required to cover large gaps in transition once the wing-backs push high, while also exploiting those spaces to drive the ball forward.\nMartinez, for example, would struggle acutely at left centre-back with a wing-back like Semenyo ahead of him. But, as discussed above, that is precisely the type of wing-back this system requires in possession — the area where the Argentine defender is needed most.\nAnother contradiction to add to the list.\nThe use of Leny Yoro is also a cause for concern, showing further incongruities in United’s long-term planning.\nThe 20-year-old centre-back arrived in Manchester as the best defensive prospect in Europe in his age group, with United fending off interest from Real Madrid and PSG to secure his signature for £59m last year. But the French starlet had never played in a back three before, nor had been tasked with the level of ball progression he is now expected to provide at Old Trafford.\nNaturally, Yoro has suffered as a result. He is still young — and, more importantly, talented enough to adapt to these demands — however.\nThere is, nevertheless, a lingering frustration that another of United’s promising youngsters has struggled to find his feet under Amorim. It feels apt that Yoro and Mainoo have formed formed such a close bond during this time, perhaps influenced by their shared experienced.\nConclusion\nThere is a theme of doublethink throughout Amorim’s philosophy. It appears to resemble the systems at other top clubs in Europe, but the contradictory choices he makes renders it almost a different species.\nAmorim’s 3-2-5 shape — designed to overload the opposition with five attackers, while maintaining stability and security with five defenders — contains at least one, but sometimes two, defenders in the attack and cumbers the team’s best attacker with defensive responsibilities.\nThe team’s least technical players are given the most opportunities to use their technique on goal; the most technically gifted players are deployed closer to their own box than the opposition’s — Fernandes and Amad — or sentenced to life on the bench with no possibility of parole — Mainoo.\nThe midfield is not picked based on its ability to use the ball, but the defence is. Wingers are forbidden in favour of wing-backs, yet the forward line is filled with players whose skillsets suit playing on the wing.\nSo does this mean Amorim and his system — with the two almost indistinguishable from each other at this point — are destined for failure at Old Trafford?\nNo, because it is possible for this approach to work, it just requires significant investment off the pitch to achieve success on it. And this will necessitate the sacrifice of existing players who the club should instead be looking to use as foundational pieces of the team.\nBut the ‘system’ has no home for them — and the system calls Old Trafford its home now, with no room for inhabitants who do not, or cannot, conform. There’s that rage bait building again.\nFeatured image Carl Recine via Getty Images\nThe Peoples Person has been one of the world’s leading Man United news sites for over a decade. Follow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 4821,
  "scraped_at": "2026-02-14T01:52:59.295085",
  "_text_extracted": true
}