{
  "article_id": "771c06216e1d",
  "url": "https://www.newkerala.com/news/2023/70177.htm",
  "title": "Real Madrid confirm return of left - back Fran Garcia from Rayo Vallecano",
  "date": "20230610T124500Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Madrid, June 10\nReal Madrid confirmed the return of left back Fran Garcia from Rayo Vallecano for the next four seasons.\nGarcia returns to the club where he began his career after an excellent season with Rayo, playing over 3,400 minutes in the season which has just finished.\nHe will help cover the position of left back after Marcelo left the club in 2022 and with Ferland Mendy likely to leave this summer after a campaign badly affected by injury.\nWhen asked about Garcia in a press conference last week, Real Madrid coach Carlo Ancelotti said the defender \"has a lot of energy, he is very fast and attacks very well. He has a good profile to play in Real Madrid and he will be with us.\"\nGarcia is Real Madrid's second signing for the 2023-2024 season after confirming the arrival of Jude Bellingham from Borussia Dortmund for a fee of 103 million euros plus possible add-ons.\nGarcia isn't the only player to leave Rayo this summer, with Osasuna on Friday confirming the signing of central defender Alejandro Catena on a free transfer after the conclusion of his contract with the club from the south of Madrid.\nDisclaimer: This story was supplied by an external content provider; we do not endorse or accept responsibility for its accuracy, completeness, or any outcomes from relying on it. It is for informational purposes only and does not constitute legal, financial, medical, or other professional advice. Laws and regulations vary and may change; readers should verify accuracy and compliance with local requirements and consult a qualified professional for tailored guidance.",
  "word_count": 266,
  "scraped_at": "2026-02-14T02:24:42.721036",
  "_text_extracted": true
}