{
  "article_id": "7736344f3357",
  "url": "https://www.arsenal.com/news/preview-arsenal-women-v-corinthians",
  "title": "Preview : Arsenal Women v Corinthians",
  "date": "20260201T094500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The first ever FIFA Women’s Champions Cup final takes place at Arsenal Stadium this Sunday (6pm KO).\nWe booked our place in the final with a 6-0 win over Moroccan side ASFAR in the semi-final at Brentford Stadium on Wednesday.\nOur involvement in this competition is down to our UEFA Women’s Champions League glory last season.\nJoin us in N5 as we look to add more silverware to the trophy cabinet!\nEXPERIENCE IN ABUNDANCE\nBrazilian side Corinthians, who qualified for this tournament by winning the 2025 Copa Libertadores Femenina, reached the final with a 1-0 win over Gotham FC on Wednesday, with captain Gabi Zanotti’s 83rd-minute goal enough to separate the sides.\nIt was pointed out to Renée Slegers in her post-match press conference on Wednesday night that Zanotti, at the age of 40, is four years older than our head coach! Zanotti was also assisted by 38-year-old defender Tamires.\nCorinthians initially formed their women’s team following the success of Brazil at the 1996 Olympics.\nWHAT THE MANAGERS SAY\nSlegers: “The players showed that they were comfortable with the unknown. We dealt with it really well, we have to focus ourselves. Of course there is experiences the players have from national team football, playing against Brazil or other South American teams. So there are experiences in the team and the players are sharing that amongst each other.\n\"We are preparing for it tactically, we see who they are, what they can do. I think they had a great performance against Gotham, they defended so well with a lot of discipline and they have qualities to score, which they did in the game, so we’re planning and trying to plan for all aspects, but also focusing on ourselves.\" - read every word of Renée’s pre-Corinthians press conference.\nLucas Piccinato: “We want to show our quality, the Brazilian football we play, and to come away with a major title. I believe this could be the greatest achievement in the history of Corinthians.\n“It’s a challenge that takes us out of our comfort zone, but at the same time it’s a joy to experience all of this. Facing top teams from different continents makes us want to bring out the very best in ourselves.”\nTEAM NEWS\nThere are no fresh injury concerns following Wednesday's win, which Chloe Kelly made her return in. Leah Williamson is progressing well in her recovery.\nMatch officials\nMexican referee Katia Garcia has been appointed to take charge of Sunday's final. She will be assisted by Sandra Ramirez and Karen Diaz, with Karen Hernandez the Fourth Official. VAR is in use for this fixture.\nReferee: Katia Garcia (Mexico)\nAssistant Referees Sandra Ramirez (Mexico) and Karen Diaz (Mexico)\nFourth Official: Karen Hernandez (Mexico)\nVAR: Tatiana Guzman (Nicaragua)\nAssistant VAR: Diana Perez (Mexico)\nHOW TO WATCH\nThis match will be shown live on Sky Sports Main Event in the UK. Take a look at which broadcasters are showing the game elsewhere in the world.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 520,
  "scraped_at": "2026-02-14T02:09:42.991302",
  "_text_extracted": true
}