{
  "article_id": "773c6853497a",
  "url": "https://metro.co.uk/2024/08/29/time-champions-league-draw-new-format-21508986/",
  "title": "What time is the Champions League draw today and what is the new format ? | Football",
  "date": "20240829T090000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2024/25 Champions League kicks-off this evening and Europe’s biggest club competition has undergone a radical change to its format.\nManchester City, Arsenal, Liverpool and Aston Villa are the Premier League clubs vying for glory against the likes of Real Madrid, Barcelona, Bayern Munich, Inter Milan and Paris Saint-Germain.\nWhether they like it or not, supporters will have to get used to a new format this season, with Europe’s premier tournament given a makeover following Real Madrid’s triumph over Borussia Dortmund at Wembley in June.\nHere’s everything you need to know about the all-new Champions League, including how the new format works, the full schedule and how to watch on TV and live stream.\nWhat is the new Champions League format and how does it work?\nThis season, the 32-team group stage of the Champions League has been replaced by a league phase featuring 36 clubs, which is commonly being referred to as a ‘Swiss model’.\nRather than playing three teams twice, each side has been drawn against eight different opponents; two from each of the four seeding pots. Every team will play four games at home and four away.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe results will determine where all 36 teams finish in one large league table. Those that finish in positions one to eight secure direct qualification to the round-of-16.\nClubs ranked nine to 24 enter into a knockout playoff contest, where victory will secure a spot in the round of 16. Teams in positions 25 to 36 are eliminated from the competition.\nIn the knockout phase, all games are contested home and away, culminating with a single leg final.\nUEFA’s video explainer says: ‘In the new league format, every match, every goal, every point and position in the rank counts.\n‘The new system will ensure fast-changing and unpredictable standings, more matches between equally ranked teams competing for crucial points, with fans able to enjoy top clashes right from the first match day.’\nFull Champions League Schedule\nThe Champions League makes its eagerly anticipated return on Tuesday, September 17, 2024 and runs through to Saturday, May 31, 2025.\nThis season’s final will be held at Munich’s 75,000-seater Allianz Arena, Germany, home to Bundesliga giants Bayern Munich.\nLeague phase\n- Matchday 1: September 17-19, 2024\n- Matchday 2: October 1/2, 2024\n- Matchday 3: October 22/23, 2024\n- Matchday 4: November 5/6, 2024\n- Matchday 5: November 26/27, 2024\n- Matchday 6: December 10/11, 2024\n- Matchday 7: January 21/22, 2025\n- Matchday 8: January 29, 2025\nKnockout phase\n- Knockout round play-offs: February 11/12 and February 18/19, 2025\n- Round of 16: March 4/5 and March 11/12, 2025\n- Quarter-finals: April 8/9 and April 15/16, 2025\n- Semi-finals: April 29/30 and May 6/7, 2025\n- Final: May 31, 2025 (Allianz Arena in Munich, Germany)\nWho will the Premier League clubs play?\nAs UEFA hoped, the draw for the league phase has thrown up some tasty fixtures, with Arsenal up against the likes of French champions PSG, Italian champions Inter Milan and Europa League winners Atalanta.\nManchester City also take on Inter and PSG, while Liverpool face reigning champions Real Madrid as well German champions Bayer Leverkusen who are managed by Anfield legend Xabi Alonso.\nAston Villa are playing in Europe’s top competition for the first time since 1983 and their fixtures include Bayern Munich, Juventus and Scottish champions Celtic.\nFull details of who the English sides will be facing in the league phase can be found here.\nChampions League Matchday 1\nTuesday, September 17\n- Juventus vs PSV – 5:45pm\n- Young Boys vs Aston Villa – 5:45pm\n- Bayern Munich vs Dinamo Zagreb\n- AC Milan vs Liverpool\n- Real Madrid vs Stuttgart\n- Sporting Lisbon vs Lille\nWednesday, September 18\n- Bologna vs Shakhtar Donetsk – 5:45pm\n- Sparta Praha vs Red Bull Salzburg – 5:45pm\n- Celtic vs Slovan Bratislava\n- Club Brugge vs Borussia Dortmund\n- Man City vs Inter Milan\n- PSG vs Girona\nThursday, September 19\n- Feyenoord vs Bayer Leverkusen\n- Red Star Belgrade vs Benfica\n- Atalanta vs Arsenal\n- Atletico Madrid vs RB Leipzig\n- Brest vs Sturm Graz\n- Monaco vs Barcelona\nAll kick-off times at 8pm UK time unless stated otherwise\nHow to watch the Champions League on TV and live stream in the UK\nIn addition to the new format, there are also new ways to watch the Champions League in the UK this season.\nMore Trending\nTNT Sports will remain the main home of the UCL and show almost every match. Their coverage can also be streamed on Discovery+.\nHowever, Amazon Prime Video will also broadcast one Tuesday night game live in every matchday, starting with Liverpool’s trip to AC Milan tonight.\nAdditionally, BBC Sport will show highlights from the games – Match of the Day style – on the Wednesday of every matchday, starting tomorrow night at 10:40pm.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Arne Slot names key Liverpool star who he wants to see score more goals\nMORE: Real Madrid target Liverpool, Arsenal and Man City stars in stunning transfer swoop\nMORE: Ange Postecoglou responds to Cristian Romero dig at Spurs after Arsenal defeat",
  "word_count": 927,
  "scraped_at": "2026-02-14T02:08:01.863613",
  "_text_extracted": true
}