{
  "article_id": "773f046cc45c",
  "url": "https://www.90min.com/mikel-arteta-champions-league-claim-psg-luis-enrique",
  "title": "Mikel Arteta and Luis Enrique clash after Arsenal Champions League exit",
  "date": "20250508T101500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta and Luis Enrique clash after Arsenal's Champions League exit\n- Arsenal eliminated from the Champions League at the hands of PSG\n- Arteta claimed Gunners were the competition's strongest team this season\n- Luis Enrique & Arsene Wenger among those to call out Arsenal boss\nBy Tom Gott\nArsenal manager Mikel Arteta argued his team were the strongest side in this season's Champions League following their semi-final elimination at the hands of Paris Saint-Germain on Wednesday – a claim swiftly shut down by counterpart Luis Enrique.\nArteta's side slipped to a 1-0 defeat at Emirates Stadium in the first leg of the semi-final and failed to overturn that deficit in the return leg in Paris, with a 2-1 reverse dumping them out the competition and ensuring they will end another season without major silverware.\nDespite the disappointing defeat, Arteta came out firing after the game, insisting no side came close to matching Arsenal's level in the Champions League this season.\n\"I don't think there's been a better team in the competition from what I've seen,\" Arteta told TNT Sports.\nIn his post-match press conference, Arteta went as far as to claim those on the PSG bench had admitted the Gunners were the better of the two sides.\n\"I am saying that because [PSG] just told me that,\" he said when asked if he was sticking to his claim that the best team had lost. \"Today, I see how much my players wanted it because they were in tears.\"\nArteta's comments were not well-received by a number of prominent figures, namely PSG manager Luis Enrique, who was among the first to question the Arsenal manager's claims.\n\"I don't agree at all,\" said Enrique. \"Mikel Arteta is a great friend, but I don't agree at all.\n\"They played in a clever way, but in the two legs we scored more than them and that is the most important thing in football. Arsenal played a great match, and we suffered, but we deserved to get to the final.\"\nLegendary former Arsenal boss Arsene Wenger, working as a pundit for beIN SPORTS, sided with Enrique: \"Overall, in the two games, I would say [PSG] were better than Arsenal, had more chances and were never really in danger, so congratulations to Paris Saint-Germain.\"\nPSG midfielder Joao Neves was adamant the Ligue 1 champions \"were the better team\", but respectfully paid tribute to the Gunners' efforts by adding \"Arsenal are a very strong team, lots of individual quality and as a team.\"",
  "word_count": 418,
  "scraped_at": "2026-02-14T02:26:38.643788",
  "_text_extracted": true
}