{
  "article_id": "7776e32d7e71",
  "url": "https://www.barcablaugranes.com/2023/11/7/23949146/shakhtar-donetsk-barcelona-champions-league-team-news-match-preview-lineups-score-prediction",
  "title": "Shakhtar Donetsk vs Barcelona , Champions League : Team News , Preview , Lineups , Score Prediction",
  "date": "20231107T024500Z",
  "domain": "barcablaugranes.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Shakhtar Donetsk vs Barcelona, Champions League: Team News, Match Preview\nBarça look to clinch a spot in the Round of 16 and rediscover their best football\nCompetition/Round: 2023-24 Champions League, Group H, Matchday 4\nBarcelona Outs & Doubts: Frenkie de Jong, Sergi Roberto (out)\nShakhtar Outs & Doubts: Artem Bondarenko, Oleh Ocheretko (doubt)\nDate/Time: Tuesday, November 7, 2023, 6.45pm CET/WAT (Barcelona & Nigeria), 5.45pm GMT (UK), 12.45pm ET, 9.45am PT (USA), 11.15pm IST (India)\nVenue: Volksparkstadion, Hamburg, Germany\nReferee: Irfan Peljto (BIH)\nVAR: TBA\nHow to watch on TV: TUDN (USA), TNT Sports 3 (UK), SuperSport (Nigeria), SONY TEN 5 (India), Movistar Liga de Campeones (Spain), others\nHow to watch online: Paramount+ (USA), Discovery+ (UK), Movistar+ (Spain), others\nFollowing a last-second miracle victory away to Real Sociedad to keep pace with the top of the La Liga table at the weekend, Barcelona turn their attention to continental play as the Blaugrana are in Hamburg, Germany for their fourth Champions League group stage match against Shakhtar Donetsk on Tuesday evening’s early kickoff.\nBarça come into this one after getting three crucial points at Anoeta, but the overwhelming feeling amongst fans, players and coach Xavi Hernández is that the Blaugrana simply must play better. That is one of the priorities for Tuesday’s clash, along with mathematically assuring a place in the Champions League knockout stage for the first time in three years.\nThe Blaugrana will guarantee qualification with a draw, and a victory would be a big step towards winning the group. Barça welcome FC Porto to Montjuïc after the international break in what will essentially decide who tops Group H, so getting three points against Shakhtar is a must before the big meeting against the Portuguese side later this month.\nBarça beat Shakhtar at home two weeks ago in what should have been a walk in the park after a magnificent first half by the Blaugrana, but they couldn’t put the game away, had some bad luck with two disallowed goals by VAR due to very close offside calls, and conceded a poor goal that made things a lot closer than they should have been in the second half.\nShakhtar proved they can compete with anyone if given the chance, and they will approach the entire match like they did the second half in Catalonia as they need at least a point to stay alive in the group. That should lead to a more open match, and Barça should have more spaces to create chances and look to put the game away early this time around.\nXavi will want a more accomplished offensive performance in this one after the disaster showing away to Sociedad, and rediscovering the good football from the first 60 minutes of El Clásico and the first half against this Shakhtar side is very important as Barça look to continue competing in all fronts.\nShakhtar will be hungry and intense, and Barça need to weather the early storm and establish their dominance throughout the night. If they do that and are more clinical in front of goal, they should leave Germany with the job done and a spot in the Round of 16 guaranteed. If not, we could be in for another tense 90 minutes.\nLet’s dance.\nPOSSIBLE LINEUPS\nBarcelona (4-3-3): Ter Stegen; Cancelo, Araujo, Christensen, Balde; Pedri, Gavi, Gündogan; Raphinha, Lewandowski, Félix\nShakhtar (4-2-3-1): Riznyk; Matviyenko, Rakitskyy, Bondar, Gocholeishvili; Stepanenko, Nazaryna; Zubkov, Sudakov, Kryskiv; Sikan\nPREDICTION\nI expect a very serious and professional Barça looking to play close to their best and taking their chances this time to not give Shakhtar any hope: 3-0 to the good guys, and safe passage to the knockouts.",
  "word_count": 607,
  "scraped_at": "2026-02-14T02:17:09.425186",
  "_text_extracted": true
}