{
  "article_id": "77aa9812c889",
  "url": "https://www.twtd.co.uk/ipswich-town-news/26929/whoever-wins-on-sunday-will-go-up--notes-for-norwich/onthisday",
  "title": "Whoever Wins On Sunday Will Go Up - Notes for Norwich - Ipswich Town News",
  "date": "20230228T110000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 28th Feb 2015 15:32 by HarryFromBath\nHarryfromBath assesses the mood in the opposition camp ahead of Sunday’s derby match by delving into their forums.\n“A bold and brave statement, but whoever wins on Sunday will be given momentum. The game has come at the right time, and the wave that can be ridden will see the winners over the finish line. This is the biggest derby game in years”, “Momentum is such a big factor and we really are flying.”\nWith five wins on the spin having catapulted the Canaries into the play-off places, their tails are certainly up. “It’s all about momentum and confidence at this stage of the season. Twice in the last 11 years we have shown that the club has had enough bottle to finish strongly.”\n“Automatic promotion is still on”, “It certainly is. We can get ourselves in the mix”, “It’s really in our hands now. If we keep our current form all the way to the end of the season, we’ll finish in the top two”, “Squads are coming into play. People above us are looking and complaining about tiredness.”\nOne concern is that this run will fizzle out, echoing what happened after their strong start to the season. “The worry is that the inconsistency that has blighted this season will return to haunt us”, “In this league there will be some potholes to navigate before we can reach our destination.”\nBlackburn 1 - 2 Norwich\n“Alex Neil, you legend - it’s just like the last time we went up. We knew we were going to score ‘Get in!’”, “What a result - it was fully deserved by the better team”, “Keep playing the way we are and we will take Ipswich apart on Sunday”, “Beat Ipswich and it will have been an amazing eight days.”\nCity recovered from the setback of a first-half set-piece goal to snatch victory on Tuesday with a late Bradley Johnson winner. “Blackburn have shown nothing. Let’s take this”, “I think we will turn this around”, “It will come.” Canaries felt that it was a game they dominated.\n“Come on City - make this pressure pay”, “We’re getting warmer - we have played 50 minutes, with 70% possession and 11 shots on goal”, “Rovers were pressurised and their players were not allowed an easy run forward because of the work ethic we now have in place.”\nWatford 0 - 3 Norwich\n“Win this and our destiny is well and truly in our hands”, “It sounds like the first half was a bit scrappy”, “Neither team wants to risk losing this one”, “The plan will be to press high, frustrate Watford and hopefully score one or two in the process.”\n“It’s nice to get a penalty against a team full of diving Italians.” The Canaries took control of what had been an even contest after Wes Hoolahan won a highly controversial penalty after the break.\n“The build-up to our second goal was a classic example of a team pressing high up the pitch. Bradley Johnson got the first challenge in which turned the Watford player, allowing Grabban to pinch the ball. Wes then had a free run at defenders who were out of position.”\n“The penalty did win us the game, as both sides were heading towards a 0-0 stalemate. The goal advantage certainly made it easier for us”, “You could see Watford visibly crumble after they went behind”, “Ipswich Town, begin quaking in your boots.”\nAlex Neil\n“Adams tried to entertain the fans with free-flowing football which ultimately left us open to be counter-attacked. With Alex Neil we play a high tempo game which is not so pleasing on the eye, but looks so solid and ensures that we are less vulnerable defensively.”\n“We have seen an improvement in work-rate and we now have clarity of purpose. Players know what their roles are, how the team functions and what other players are aiming to do”, “Alex keeps ironing out the little problems such as our defensive frailties and ostracised players.”\nCanaries are impressed with the unfussy way their new manager has addressed problems since taking over in January after their calamitous FA Cup defeat at Preston. “He was renowned at Hamilton for getting players to understand exactly what was expected and they responded there too.”\n“I don’t think Alex is a manager to be messed about with.” He has been praised for his tactical switches. “We were a man down at Bournemouth and he went Paul Lambert on us by sending in an attacker and it worked”, “I just hope we can avoid the kiss of death Manager of the Month award.”\nA High Pressing Game\n“We’re moving the ball faster and pressing much higher up the pitch to take pressure off our defence”, “Our game-plan is to press high up the pitch and attack directly while the opposition is recovering from losing the ball in their own half. Our focus is on winning the ball quickly.”\nThe Canaries’ run of good results has been built on defensive stability and the development of a high pressing game aimed at recovering possession as quickly as possible. They have either played with three midfielders or used a diamond/narrow four when playing with two strikers.\nBradley Johnson played the important holding midfielder role on Tuesday at Blackburn, allowing Howson to get forward and press the opposition with the front four. Several fans commented on Hoolahan and Dorrans switching. They switched to a diamond when Jerome replaced Redmond.\nA 4-1-3-2 diamond was used against Watford on Saturday, and this is a system many Canaries are happiest with. Tettey is widely seen as the strongest holding player and Johnson on the left allows Olsson to get forward. Grabban works hard front but Jerome is seen as a stronger finisher.\nStriker Gary Hooper started in the Canaries’ last home game, playing as a second striker behind Grabban in their 2-0 win over Wolves. He missed the Blackburn win due to illness. Redmond is the team’s one natural winger and is seen to complement the more defensively solid Johnson.\n“Our biggest problem is to overcome how to recover defensively if opponents are able to get around our high pressing. We look a little desperate defensively if teams get around our pressing, but a consistent defensive selection will allow us to overcome this.”\nDefence\n“We have been keeping clean sheets by playing with a deep-lying midfielder and having wide midfielders tracking back. Having a settled back four has helped us be tighter at the back”, “If this renowned defensive strength holds out, we’re going to win plenty of games from here”,\n“All our full-backs have a tendency to give the ball away”, “Sloppy sideways passes will cost us. We can be indecisive and we can lack a leader on the pitch with a footballing brain.” Full-backs were blamed for Blackburn’s opener and one of Charlton’s goals in the Canaries 3-2 win at the Valley.\nJohn Ruddy\n“Ruddy looks a stone lighter to me and that’s exactly what he needed. I hope he is rebuilding his confidence.” The 28-year-old former Cambridge keeper “is looking back to his best”, “His handling is good and he comes off his line superbly.”\n“It’s scary to think what a lack of leadership did to him earlier in the season. He was unrecognisable and managed to get into arguments with fans”, “He’s able to play the ball to Bassong with his hands so we’re far more likely to retain possession. His kicking is as reliable as Tiger Woods’ driving now.”\nSteven Whittaker\n“Other than the Brentford defeat where Whittaker was played out of position, he has looked a lot more solid defensively. Some of his second half tackles against Wolves were great. You can see that he’s playing with a lot more confidence and it is paying dividends.”\n“What a ball by Whittaker for Grabban’s goal.” The 30-year-old ex-Rangers right-back was praised for setting up the third goal at Watford, but was blamed his part in Blackburn’s opener. “From hero to villain again”, “He struggled against every left-winger with a bit of pace he has faced this season.”\nRussell Martin\n“Russell has really not put a foot wrong since forming the partnership with Bassong”, “Maybe he just needed the right partner all along”, “They complement each other well and their partnership makes us less vulnerable to pace, although they got horribly square for Charlton’s first goal.”\nThe 29-year-old former Peterborough defender “is a very good centre-back when not partnered by a complete clogger”, “He has taken some unfair stick and is proving doubters wrong”, “I remember all our centre-backs looking better alongside Bassong last season.”\nSebastien Bassong\n“Bringing Bassong back has been a master stroke by Alex Neil. The second goal against Wolves showed him at his confident best. He was prepared to surge forward and deliver a very good pass inside the full-back”, “The return of Bassong has been instrumental to our success.”\n“He’s as good as a new signing, and his attitude seems excellent”, “It’s great that he is back but let’s not forget that he acted like an idiot earlier in the season”, “He is more prepared to takes risks with the ball to retain possession rather than hoof it clear.”\n“Bassong takes the ball on his chest, controlling and passing it unlike Turner who heads it into space for the opposition to run on to”, “The only time he looks shaky is when he overplays, but I would rather he did that than hoof like all the other centre-backs this season.”\nThe 28-year-old former Spurs centre-back “seems transformed after being at his hesitant worst last season”, “He was noticeably vocal against Wolves and goes forward like a tank at times”, “If Bassong brings his ‘A’ game on Sunday, Darryl Murphy will not trouble him.”\nMartin Olsson\n“Olsson stays in the side because of his attacking which Javier Garrido cannot replicate.” The 26-year-old Sweden international and former Blackburn Rovers left-back “is a liability defensively, but with Bradley Johnson on the left side of midfield, he’s needed as an overlapping player.”\n“Olsson has the pace to attack and defend. Garrido doesn’t”, “He frustrates me with his wayward passing and crossing without seeing if anyone is there”, “He can be error-prone and can ball watch”, “His lack of concentration and poor positioning was to blame for one of the Charlton goals.”\nMidfield\n“We seem to be able to hold on to the ball in midfield in order to soak up pressure”, “We are disciplined with the shape of the team in the middle. Johnson and Tettey were a huge factor in our win over Wolves”, “Wolves were poor because we didn’t give them an inch.”\nThe Canaries’ midfield is hard-working and high-pressing, but is also quite narrow. “I doubt that Neil intends to play with two wingers”, “There was not a lot of width against Watford, and it made for a tight scrappy game”, “The end of the transfer window and no left winger is seemingly coming in.”\nAlexander Tettey\n“It’s particularly good to see Tettey come short and deep to receive the ball and play it quickly to get moves started.” The 28-year-old Norway international and former Rennes holding player “is a great shield to the back four”, “He’s becoming a pivot, a great platform for good attacking players.”\n“Tettey was absolutely magnificent and man-of-the-match against Wolves. His positioning gives the team stability and he lets the other midfielders get forward”, “His touch is excellent, stopping the ball dead and creating space”, “His work goes unnoticed because he’s such a laid-back character.”\n“Tettey’s tackling is hard and fair and his positioning is disciplined. What I really like about him is his ability to hold on to the ball. When stranded in possession he has the strength and control to keep the ball until able to lay it off to another yellow shirt.”\n“His knee needs to be managed and he can’t play three times a week.” He did not start the Rovers game, coming on midway through the second half but is likely to start on Sunday. “It’s a huge shame he will always be a player managing an injury”, “No-one can do Tettey’s role and it has become key.”\nBradley Johnson\n“BJ has been excellent on the left. It allows him to get forward and score goals, but he can also get back and help the defence. He and Olsson look better for that.” The 27-year-old former Leeds man “offers a little more defensive cover against counter-attacking football with plenty of pace”.\n“He might not be the pacey winger people are crying out for, but he makes us solid defensively and has an end product going forward.” He was praised for his late winning strike on Tuesday. “Johnson is rapidly approaching double figures for the season”, “A safe pair of hands who won’t let us down.”\nJonny Howson\n“Alex Neil might be the first manager since Lambert to actually know how to play Howson to get the best out of him. He is not a holding midfielder and could be vital for us if played correctly.” The 26-year-old former Leeds man “looks excellent in his new box-to-box role”.\n“Howson uses his mobility, his energy and his ability to drive play up the pitch. He makes excellent late runs to provide support to the attacking midfielders behind the lone striker”, “He loves bombing forward with or without the ball, getting into the box and getting on the end of things.”\nGraham Dorrans\n“How come Dorrans has only been loaned for a month? He’s a dead-ball king and a giant signing for the Championship”, “We can cover all the way to the play-off final should we get there.” The arrival of the 27-year-old attacking midfielder on loan from the Baggies is seen as a statement of intent.\n“Dorrans has several strings to his bow. He has a good range of passing, but is quite a big lad and can win tackles and score goals. He is certainly more direct than Hoolahan, but perhaps not as tricky on the ball”, “Aware and full of confidence”, “The building of our Premier League squad has begun.”\nNathan Redmond\n“Redmond causes problems for opponents on the right flank.” Little has been said by Canaries about the 20-year-old former Birmingham man, but from what there is he is well regarded. “It pains me to leave Redmond on the bench, but he’s a decent weapon to bring on to hurt teams when needed.”\nWes Hoolahan\n“Dorrans's arrival makes me wonder if the manager sees Wes as no more than a bit-part player”, “I don’t see how Wes fits the Alex Neil ethos. He wants players who will pressurise opponents for 90 minutes and keep the ball moving, neither of which are strong points for Wes.”\nThe 32-year-old former Blackpool man “can tear a defence apart with a genius pass over 15 yards that no-one else predicts”, “The striker can be isolated when Wes plays off him, as he doesn’t get in the box often enough and contribute with goals”, “He’s more suited to playing off two strikers.”\n“Young Wesley maybe had a wee dive for the penalty.” Some but not all Canaries took a dim view of the way he went down in the penalty box at Vicarage Road last Saturday. “I don’t approve of diving but the Watford guy swings his leg recklessly. He could have easily clipped him if indeed he didn’t.”\nStrikers\n“I love our attacking flexibility with the three strikers and all of them being in form at once.” Canaries are happy that their three principle strikers all play different but complimentary roles, allowing them to vary attacking options.\nCameron Jerome\n“If we do get promoted, Jerome’s total will be between 20 and 25 goals.” The 28-year-old former Stoke man and leading scorer “is probably more talented than Grant Holt, but he’ll never have a season anywhere near as good as Holt’s first three. The stars aligned and Holt was untouchable.”\n“Jerome has pace and power and has goals in him”, “His pace allows him to harry defenders which has won us quite a few goals this season”, “He defends from the front and is often the player who clears defended corners”, “We would be down with Fulham and Cardiff if we hadn’t signed him.”\n“Cameron prefers to play his football on the deck. He was wasted at Stoke and Birmingham because they preferred to play the long ball”, “The mercurial Jerome scores his goals in clumps, but can be unseen between these clumps. He’s an out-and-out striker, strong and quick.”\nLewis Grabban\n“Jerome gives us goals, but Grabban’s all-round play is better.” The 27-year-old ex-Bournemouth man “does more of the dirty work. He chases down defenders, pressing them and chasing lost causes with Hooper getting the glory”, “He’s not a natural finisher, but is quick and mobile.”\n“Grabban’s first touch and decision-making are often poor. I would have preferred Callum Wilson over Grabban any day”, “His runs behind the defence make space for midfielders to operate in between the lines”, “He is less of a lone striker with midfielders flooding forward to support him.”\n“Lewis looks a bit lost playing with two up front”, “He is now playing to his strengths, given free rein to roam the front line, rather than cramping him with as a partner which does not suit his play”, “He work hard, has pace and excellent movement but my God is he a woeful finisher.”\nGary Hooper\n“Another good tweak by Alex Neil has been to play Hooper behind the lone striker to help the link-up play between midfield and the front. This has worked excellently without taking away his goal-scoring chances.” The 27-year-old former Celtic man “is an auxiliary striker, not one to lead the line.”\nHe scored a hat-trick in the recent 4-0 rout of Blackpool. “It was a masterclass in dropping off and his boots are seemingly covered in superglue”, “His one-touches and triangles are superb as is his vision for a pass. He has more to his game than just finishing and it is a delight to watch.”\n“Hooper does look tired near the 60-minute mark and isn’t accustomed to the work-rate he has to do”, “His game revolves around looking for other players movement and trying to take advantage of the space they make”, “In the right system, he would score goals in any division.”\nCanaries’ Views on ITFC and the Game\n“This Sunday sees us both in the top six and one point between us. Is this the biggest derby since the Milk Cup semi-finals in 1985?”, “It’s a huge game and that’s fantastic, a local derby with more than pride at stake. Bring it on”, “It is, but back then it was more of a contest.”\n“It’s the biggest derby for as long as I can remember. This is huge for both sides and the closest we have been in the league to each other for ages.” Most Canaries are looking forward to a keenly contested game and many are optimistic for their chances given their late good form.\n“I am utterly convinced that we have a superior squad and if we play to our recent level we will beat them. The only things I can see standing in our way are overconfidence, indiscipline or dodgy refereeing”, “Ipswich have no quality and loads of effort, but I reckon they owe us one.”\n“Ipswich are a challenge. They want to beat us as much as we want to beat them, possibly more so because they see us as a Billy Big Bollocks set of fans”, “They haven’t beaten us for ages and are bound to win against us soon. They will be bang up for this.”\n“The derby from earlier in the season was the most confident 1-0 ever”, “That was one of the best performances in the whole season. They had one chance in the whole match and we should have hammered them by at least three”, “I had a tinge of disappointment we didn’t beat them by more.”\n“Ipswich play awful anti-football.” A number of Canaries expect a physical game. “Sunday will be blood-and-thunder and McCarthy will have them well up for it. Ipswich are an aerial physical team”, “I almost dislike McCarthy as much as I dislike Ipswich, with all his droning self-righteous nonsense.”\n“This trophy thing they bang on about is pathetic. They won one old Division One title in 1961 [sic], when most of the top sides were in Division Two, one FA Cup win in 1978 when I agree they were a good side and one EUFA [sic] Cup which is okay but still for the also-rans in European leagues.”\nFeeling Confident\n“If you listen carefully you can hear a pop coming up the A140. I think it might just be the bubble bursting”, “They will be getting worried. There’s not sufficient depth in their squad to sustain a challenge”, “It will be a minimum of 4-0. Ipswich are a hoofball team punching above their weight.”\nWhile many City supporters are quietly optimistic, some indeed appear to be a great deal more certain of victory than others. “I don’t want victory. I want abject humiliation”, “Ipswich have been of little significance for many seasons. There is no need to change anything this Sunday.”\n“This game is a bit like the Grand National where one of the favourites is beginning to move up through the field, but has to avoid a silly horse that has lost its rider and is still running along, possibly thinking they are part of the proceedings.”\n“There was not one player out there in the January window who would improve that rabble of freebies, bench-warmers and rejects, though money was supposedly available. You have just got to love them. Roll on Sunday”, “It will be some time before their fans visit Carrow Road again.”\nA few of the City faithful are urging caution. “It’s never too good to get over-confident about derby games. They often go against form”, “It does seem as if some are getting a bit too confident. We are definitely showing the form we want to see but local derbies have a habit of reversing that.”\n“I’m predicting nothing because I’m always wrong. Let’s see what happens in May.”\nWebsites\nThere are four informative Canaries websites. The Pink ‘Un is the busiest while Wrath of the Barclay has plenty of colourful opinion on offer.\nTwo less busy sites are the well-moderated Norwich Talk which had some interesting tactical discussions, and there is also Not 606.\nI will update the forum on Saturday evening if there is any additional comment worth feeding back and will also link this to my twitter feed.\nPhoto: Action Images via Reuters\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nBest line\n“Ipswich are a challenge. They want to beat us as much as we want to beat them, possibly more so because they see us as a Billy Big Bollocks set of fans”, “They haven't beaten us for ages and are bound to win against us soon. They will be bang up for this\"\nCouldn't put it better myself. God I hope we beat them !\nPlease, Please PLEASE! COYB!\nPLEASE.\nPlease God we don't get stuffed.\nCOYB!!!\nDidn't think it was possible to find their dozy fans any more deluded or arrogant than I already did, but wow. Very high opinions of themselves for a team they spent £30m on, they haven't got much to show for it! I hate them with a passion any way but I so hope we go there and smash them! Come on Town!!\nOf course they will be favourites, but it will be brilliant walking out of there on Sunday if we win watching the trophy-dodging, stand-burning hordes trying to work out how they could possibly have lost.\n\"We have been keeping clean sheets by playing with a deep-lying midfielder and having wide midfielders tracking back. Having a settled back four has helped us be tighter at the back\"\nThey really are the most dislikeable fans in England.\nOh wait...\nPure gold also-rans like runners up bit beyond their imagination I guess.\nBecause all the best teams were in the second tier back then.... Possibly the most stupid thing I've ever read.\nAs if there wasn't enough incentive for the boys to rise to the challenge here, I suggest that this is mandatory reading for every Ipswich Town player to inspire them to 3 points at carrot road and silence these jumped up budgies.\nIts great to read also that Ipswich legends have been spending the time to teach the current squad about the history and importance of this fixture.\n\"who wants this the most today?\" Kevin Beattie quotes Sir Bobby Robson and you don't get much bluer than those two!\nCOYB\nThey shouldn't be too pessimistic - they may come up and join us next season, after all...\nOnly the champion club of each country played in the European Cup, the predecessor of the so-called Champions League.\nThis meant that there were seasons when it was generally agreed that the winner of the UEFA was actually the best team in Europe. That was the case in 1981. Ask Michel Platini if you happen to see him. He won't disagree.\nYou need to login in order to post your comments",
  "word_count": 4237,
  "scraped_at": "2026-02-14T01:34:28.378170",
  "_text_extracted": true
}