{
  "article_id": "77b499fa546a",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/45389.html",
  "title": "Realistically , who replaces Sean Dyche ? ",
  "date": "20241013T163000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It seems logical to expect that the football will improve if we can provide Thelwell with a competitive budget (and by that, I mean competing with the likes of Brentford, Bournemouth and Nottingham Forest) to supply Dyche with better players. And indeed we do have little spells of decent football to watch when everyone is fit.\nBut (and I am often a defender of Dyche) we’re not suddenly going to start playing champagne football with Dyche at the helm. Whilst the defence is generally very well organised (obviously undermined by the injury crisis this season), there are no clear patterns of play around the attack and even set plays are unimaginative. Hence, we score fewer goals than we should do.\nSo who realistically might take over from Sean Dyche? I’m not talking coaches like Thomas Tuchel here – I’m talking about coaches who would see Everton as a genuinely attractive next step. Having had a little think about this, there are no brilliant candidates out there so far as I can see – many of them are just the current flavour of the month to replace previous flavour of the month types like Graham Potter who ended up flattering to deceive.\nI do wonder therefore whether two more seasons of stability under Dyche might be a better bet before we really try to kick on under a new coach. But if we decide to roll the dice, then Kieran McKenna looks the best fit out of the realistically available options.\nMarco Silva\nPerhaps not so surprisingly, the coach who seems to have earned a step up over the past few years is Marco Silva at Fulham. But I won’t bother singing his praises. The time has gone. As it happens, Man Utd could do much, much worse – if they decide to part company with Ten Hag.\nDavid Moyes\nI think everyone probably knows enough about Moyes.\nI suspect the football would be well organised and conservative, with spells of decent play if he can sort out our woeful flanks. That will come down to recruitment more than anything – the same thing holding Dyche back.\nHe’s more of an emergency option than the future. Not for me.\nEddie Howe\nHe’s done well at Newcastle Utd – but has now been rumbled as a motivator more than a proper coach. Reasonably likely to be sacked, so he may become available.\nMore or less the same standard as Dyche but seen as more credible due to nice speaking voice and sensible haircut. We’d possibly be more attacking, but less well-organised in defence. He’s a “right place at the right time” sort of a manager and, let’s be honest, we are still miles away from being “the right place” for anyone.\nHe might be better placed to inherit the best England squad we’ve possibly ever had, than a still crap Everton squad. Not for me.\nThomas Frank\nA very good manager – but one who has been given the space and time to develop a style and squad to fit. He also has an excellent relationship with the visionary owner at Brentford.\nI think fans who think he’d do well with us are working on the assumption that Brentford (a small club) must have overperformed and we (a big club) must have underperformed. However, that’s not the case.\nHe’s been given an awful lot more money than Dyche. Brentford have spent more on their squad than we have and – make no mistake – they have a better squad than us. Yet they still finished lower than us (by 8 points) last season.\nThey are also still heavily reliant on long servers like Pinnock, Henry, Janelt, Norgaard, Jensen, Mbeumo and Wissa who are familiar with his tactics and well-placed to deliver on them. Newer and often expensive signings haven’t really moved them on. That is a bit of a concern.\nIt would interesting to see what he could do with us – but it seems likely he’d need time, and an even bigger budget than he has been given at Brentford to take us forward.\nKieran McKenna\nMcKenna is a talented coach and, at 38 years old, probably sees himself as a future Man Utd manager (after a stint in their backroom) – but it’s too big a jump from Ipswich Town. We would be a big step up for him. And a good step up too.\nYou can see how he’s managed to get Ipswich through the divisions of the Football League but it’s also fair to say that they have stumbled badly in the Premier League. That’s after a big spending summer too – with over £100M spent on essentially a whole new first XI – with Muric, O’Shea, Greaves, Johnson, Ogbene, Cajuste, Phillips, Clarke, Smodzics, Delap, Hutchison coming to the club. Some of these are very good players – certainly capable of stepping into our first XI.\nDefensively they’ve looked a mess, with the sort of suicidal tactics Vincent Kompany deployed from goal-kicks and possession in defence for Burnley last season. Indeed, there was talk on the (often mindless) TalkSport that Ipswich might fail to land a win all season. But they’ve also been weirdly impressive at times despite the string of crap results (still without a win).\nHow would McKenna cope at Everton? It would be a culture shift back to where we were with Roberto Martinez. That failed because, like Silva did a few years later, Martinez lost his nerve and forgot how to defend. That wouldn’t have been so bad if both coaches were supported by bigger budgets and better recruitment but at Everton there was no squad depth to mask the coach’s crisis of confidence and other shortcomings.\nSo I think McKenna would live or die to some extent again on the sort of quality Thelwell could provide. At the moment, I don’t think he’d be knocked out with the squad he’d inherit – and would need a lot of time and patience (and transfer kitty) to move us on.\nI think he’d be a good appointment in time, but we could remain bottom half for a season or two before developing into a much better team. A relegation scare or two along the way too quite possibly.\nRegis le Bris\nThe 48-year-old ex-Lorient coach in France has done really well with Sunderland so far.\nThey have also been carefully assembling a good group of players too – with the likes of Hume, Cirkin, Neil, Rigg, Roberts, Mundle and Bellingham all looking like they could potentially step up into the Premier League – with Rigg and Bellingham, the two teenage Number 8s, potentially being seriously big talents.\nAt Lorient, he also brought through a lot of good players – including Moffi (now at Nice), Ouattara (now at Bournemouth), and Lo Fee (now at Roma). This probably comes from him spending the large part of his coaching career with youth set-ups.\nThe football would definitely be more “front foot” than Dyche but would Le Bris cope at a much, much bigger club? Personally, I doubt it.\nCarlos Corberan\n41-year-old Spaniard who has got a middling West Brom squad to 4th in the Championship after spells at Huddersfield and Olympiakos. Notably an assistant to Bielsa at Leeds.\nHis attacking form is driven by goals from Josh Maja (who has knocked about for a while threatening to deceive) and Tom Fellows, the “new Anthony Gordon” who we have come very, very close to signing over the past year or so.\nThis isn’t exactly stellar stuff from Corberan but he did inherit a mess and has made West Brom much better. The football is not classic Bielsa either (in both good and bad ways). This isn’t a brilliant resume though and I can’t see us really kicking on under him.\nWill Still\n31-year-old Will Still is the manager of Lens in France after a successful period with Reims. He is English but was born and raised in Belgium.\nHe did a great job at Reims, especially given his age – turning Arsenal’s Balogun into a striker who actually scores goals. But at Lens he’s done okay without doing anything particularly notable so far. He’s more or less getting them to where they should be in Ligue 1 but not exactly punching above their weight.\nIf he wasn’t (sort of) English, I don’t think there’d be much of a fanfare about him in England. He needs to deliver more in France before he’s worth a shot.\nEden Terzic\nHe’ll get mentioned but, after taking Dortmund to a Champions League Final, he might well already be out of our league. Strong rumours that he’s in line to take over at Man Utd.\nRuben Amorim\nTop of the table with Sporting Lisbon after 8 wins in 8 this season for the 39-year-old. He’s clearly a really excellent coach and done some hard graft at smaller clubs before getting the gig at Sporting. Will be sought after by Champions League clubs and must have been high on the list for Liverpool before they appointed Arne Slot.\nHe would be a really good appointment but I suspect he is not realistic. Again, he’ll be in the frame for the Man Utd job when (rather than if?) Ten Hag is sacked.\nDino Topmoller\nThe 43-year-old has taken Frankfurt to 3rd in the Bundesliga after 4 wins from their opening 6 games. He’s done well.\nWorth noting that Frankfurt have had one of the best recruitment and development strategies in the Bundesliga over recent seasons – probably only surpassed by Stuttgart when you take account of budget. Stuttgart have an excellent coach by the way in 42-year-old Sebastien Hoeness but I suspect he’s now already out of our league.\nSo Topmoller isn’t generating this relative success against the odds – he’s doing it with the benefit of a really well-organised club like Brighton or Brentford in the Premier League. But I'm not convinced he would come to Everton and really do anything.\nFrank Schmidt\nThe 50-year-old trained banker has steered tiny Heidenheim into the Bundesliga all the way from Tier 4 and kept them there. They are currently 9th with 3 wins from 6 this season – and that after losing their best players, Beste and Dincki, over summer.\nHe's obviously got a lot about him as a coach to achieve this but he’s also a one-club man, having played for Heidenheim before moving into management. Seems a bit unlikely that he’d up sticks to Everton and replicate success which has taken him 15 years or so at Heidenheim.\nMarcel Rapp\nKiel is a tiny club in German football – based on the sticky-out bit that looks like it should be part of Denmark. Rapp is a 45-year-old coach who has spent most of his career in youth coaching, graduating from the very impressive set-up at billionaire-backed village club Hoffenheim.\nIn a short space of time, he’s taken Kiel from nowhere into the top-flight and is getting results – including a very impressive 2-2 draw against Champions Leverkusen.\nThey do this through very, very well-structured balance between attack and defence – with fluid formations for different phases of play, aggressive pressing, and direct play when circumstances allow.\nHowever, they are still winless in 6 and 2nd bottom. He’d be a fascinating choice for us – but relatively high risk. Might be a better fit for an ambitious Championship club.\nReader Comments (226)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 13/10/2024 at 15:11:43\nOf course he wasn't but we stuck with him. We should have stuck with Silva but it was touch and go.\nRight now, we have a coach who doesn't see us as a stepping stone. Every coach on your list, bar Moyes, will see us that way. So it's Moyes, Dyche or a hired hand on the way up.\nWe went all in on Dyche, we just need to watch the cards unfold and get lucky.\n2 Posted 13/10/2024 at 15:35:00\nI personally can't see that happening, for oh so many reasons, not least that Jose can be such a divisive figure and could cause more issues than he might be able to solve. I would have loved him at Goodison a decade or more earlier than today, when he was hungrier and when he did seem to have the Midas touch.\nAs always whomever pays the piper calls the tune, so we'll have to wait and see what transpires in the coming months.\n3 Posted 13/10/2024 at 16:02:30\nI don't think managers like Marco Silva, Eddie Howe or Frank can take us to next level. They are ok managers.\nI would like us to go for Amorim or Terzic. But we need to hire good players and sell players that don't fit the system they play.\n4 Posted 13/10/2024 at 16:05:48\nChecks fixtures for next PL round.\nShit!!! 🫣\n5 Posted 13/10/2024 at 16:25:43\nBut that wasn't (already talking past tense), Moshiri's way.\n6 Posted 13/10/2024 at 16:56:51\n7 Posted 13/10/2024 at 16:59:23\nThanks for posting – let's hope our new owners make the right choice. Personally, I hope they don't go for Mourinho or Moyes.\n8 Posted 13/10/2024 at 17:02:34\nSilva was awful. We sometimes showed a nice style under him, but he couldn't be bothered to coach the fundamentals. We gave up five goals a game on set-pieces.\nOkay, I'm exaggerating a little, but we led the league in that grim category two seasons in a row under that clown. Lord only knows how many points we left in the trash from our inability to defend a simple corner kick.\nI had never been so happy to see a manager get sacked, although the later beheading of Benitez turned out to be even more satisfying.\nSilva learned from his mistakes at Everton -- I believe he even said so in an interview -- and returned as a much better manager for Fulham. But he absolutely sucked for us.\n9 Posted 13/10/2024 at 17:19:50\nHis high-line defence against Liverpool when we lost 5-2 showed he had lost the plot.\nThe puzzle is how he got the job in the first place.\n10 Posted 13/10/2024 at 17:31:40\n11 Posted 13/10/2024 at 17:49:23\nHoward Kendall would have been sacked before going on to be our most successful manager.\n14 Posted 13/10/2024 at 18:10:55\nPlus we had the opportunity to bring in one of the best managers who ever lived, and what joyous year and a half he produced.\nSo zero regrets for me.\n15 Posted 13/10/2024 at 18:53:11\nFirstly, like you commented at [6] Mourinho (for better or worse) will never be recruited again by TFG after his comments and actions following his dismissal from AS Roma.\nFWIW, in a dream scenario I'll put down my top 3 managerial selections from fave to 3rd fave;\n#1 Ruben Amorim: And not as far fetched as you might believe.\nHe might enjoy cutting his teeth in the EPL with a 'lesser light' initially, especially if he is able to be backed in the Transfer Market. Personally, I think he'd be a great appointment, with a better squad, the ability to attract better (Europa league+ player levels) and could solely focus on coaching. For which we need a very good DoF and/or Sporting Director.\n#2 Sebastien Hoeness: Although not on your list, he is an ex Bayern coaching protégé. He has been successful everywhere he has been, despite a bumpy 22/23 at Stuttgart; and that is at age-group level as well with Bayern 'B'.\nIt was also reported that he turned down both Man Utd (Completely understandable), and Bayern 'A' (probably because he'd have to work with Ralf Rangnick, who was lined up at the time to be the new Sporting Director at Bayern)\n#3 Carlos Corberán: As you say he is doing well at WBA over the last two seasons. He made the playoffs last season (5th, from 22nd when he took over) despite the absolute crazy-show going on at the club. I think he does have a couple of tactical weaknesses, but is a very solid candidate for stepping up a level unless of course he brings WBA up this season.\nI can't see McKenna wanting to come, as there are too many other clubs monitoring him.\nHowever, personally and purely from a stability point of view, whilst the Club management and administration structures are changed with the take over; I think Dyche will be offered a one-year extension with an option based on performance.\nThanks again for the thread Robert, it really is a very good read.\nCheers and good wishes! 👍💙\n16 Posted 13/10/2024 at 19:09:52\n17 Posted 13/10/2024 at 20:00:08\nHoeness would be great, Simon, but that's what probably puts him out of reach. He's taken Stuttgart (albeit with the help of excellent recruitment) into the Champions League and probably feels entitled to pick up a Champions League level job somewhere.\n18 Posted 13/10/2024 at 20:27:17\nAncelotti, James and then Covid. Did I dream that?\nHindsight is strange, I can now recall arguing with Steve Ferns that Silva should go.\n19 Posted 13/10/2024 at 21:13:40\nAt present, very little is in place at our club to enable a manager to succeed. He is up against the odds from the moment he walks in. As Robert suggests, it will take shrewd leadership, sensible use of money, time and patience to rebuild the club to compete in the top half of the table.\nMcKenna shows promise; in the Championship his team played exciting football with swift counterattacking moves. But let's see how he handles the rest of this season in the Premier League before we hoist his name to the top of our wish lists or indeed write him off.\n20 Posted 13/10/2024 at 21:43:45\nHe was out of his depth by the end of his tenure John R, but I think this was partly because Brands, never replaced the pace Zouma, and he was privately fuming and possibly began to sulk, instead of just getting on with the job?\nThis is my opinion anyway although I think his overall experience at Everton, will have stood him in good stead for the future? Maybe I’m wrong but that’s how I’ve always seen it.\n21 Posted 13/10/2024 at 21:46:47\n22 Posted 13/10/2024 at 21:49:44\n23 Posted 13/10/2024 at 21:57:21\nThe manager should be anyone willing to play football that looks to score goals rather than defend first and try and nick one. Admittedly that involves getting better players.\nPersonally I hope the team continues to pick up points and this is a topic for Easter time not now. If Dyche gets money in January, then you'd think he'll get an extension if we do okay.\n24 Posted 13/10/2024 at 22:02:13\n\"The return of the magnificent seventh\"\nOnly happens in the movies... unfortunately.\n25 Posted 13/10/2024 at 22:14:43\nWe are Everton. Cradle to grave.\nWe will come good again Keep believing. It keeps me going.\n26 Posted 13/10/2024 at 23:02:04\nI think that 'disillusioned' would describe his thoughts!!\n27 Posted 13/10/2024 at 23:08:53\nWith Everton now or the Silva going thing?\n28 Posted 13/10/2024 at 23:14:39\nWe could realistically get him, he's impressed with Bournemouth and he's from the Basque region which seems to be a bonus…\n29 Posted 13/10/2024 at 23:58:58\nThe purchase of Moise Kean was a total failure.\nHe showed moments of real potential with us and changed the way we played unlike many of our recent coaches - Roberto, Sam, Dyche, Koeman - yet the removal of Brands around that era was no coincidence.\nI don't think he'd come back but, if he did, we could do a lot worse.\nThe Moyes idea seems desperate to me given he's been unemployed for so long and the Sword of Damocles has been over Dyche for the best part of a year.\n30 Posted 13/10/2024 at 00:16:38\nNot necessarily, if we assume that he is well rewarded regardless and that progressing the squad further is not simply a continuation of what has been tried so far, but I'd hope he gets to see out his contract if we are doing okay when the takeover is completed and that would be enough for him to keep his career options open.\nBefore wondering about the next manager I'd be keen to see what changes there will be, if any, for DoF. If we assume Dan Friedkin will be relying on experts in every role then it follows his appointment for DoF will likely have a big input on the next manager, having first delivered an up-to-date review of the players and prime targets in the immediate future.\nThen I'd hope the DoF would give their assessment of best options for the new manager to start us off on that upward curve towards our shiny new future in our shiny new stadium.\n31 Posted 14/10/2024 at 01:34:41\nAnd since Fulham don't use such a system much, I think one can safely assume Silva learned his lesson... from getting sacked.\nAnd we got to enjoy an Ancelotti team for a year and a half, so win-win.\n32 Posted 14/10/2024 at 06:22:01\nMG (8, 31), as one of the sharpest footy minds on these pages, your frozen attitudes towards Silva are interesting.\nSilva is not a ‘clown’ Mike. Nor was he ‘awful’ with us. And he did not ‘absolutely suck for us’. Silva is a better all-round manager now than the day he left us. You’ve said this twice on this thread MG: ‘And since Fulham don't use such a system [zonal] much, I think one can safely assume Silva learned his lesson..’ - ‘Silva learned from his mistakes at Everton -- and returned as a much better manager for Fulham’.\nWhile with us Silva was badly let down by recruitment, not least at the back – and eight clean sheets in his final eleven games of his first season rather suggests that Silva was not the complete failure in defence that MG paints him to be, and then, of course, Zouma went back home and was not replaced.\nI’m not being revisionist. I’m simply saying that MG’s views of Silva are somewhat extreme and surprisingly frozen given his own recognition of Silva’s post-us improvements and learning.\nA more defensively imaginative and sound Silva with the right coaches around him – Fulham have conceded 8 in 7 so far this season but conceded at a higher rate last season. – is by no means the worst prospect to replace Dyche with his luxurious thick hair and Latin dark looks to boot - Marco not Sean.\n33 Posted 14/10/2024 at 07:07:18\nHe was treated unforgivably shabbily by the impresario and his lap-dog crew.\nAnd, as big a pull as our magnificent dock will be, there is no finer walk in the Premier League than from the tube and alehouse to Craven Cottage (sorry Dock Road).\n34 Posted 14/10/2024 at 07:38:32\nAs I keep saying, I've long given up blaming managers.\nChange is coming and the club can move forward, whoever the manager is.\n35 Posted 14/10/2024 at 08:02:59\nWe could do a lot worse than one of the German coaches.\n36 Posted 14/10/2024 at 08:12:36\nThe problem that Silva had once Zouma wasn’t replaced was that he could no longer coach his team the way he wanted them to play imo.\nSerious question, how can you play a pressing game when you have got Michael Keane playing centre half?\nAny team that wants to play a pressing game, has to play a high line. This goes back as far as the great Everton team, of the mid eighties in my memory, so from the minute Zouma wasn’t replaced, Marco Silva, had a very big problem, again imo.\nEnjoy Ancelotti? I enjoyed the first few games of Carlo’s only full season, but otherwise I wasn’t very impressed at all. He showed his nouse, he protected his back four fantastically, but the minute he tried to get us to open up with his four man midfield, playing narrow, we got some very bad results, and the football was quite depressing really.\nDyche gets slaughtered, but I can still remember the night McNeil scored a worldy at Goodison, and Carlo’s Everton, made Dyche’s Burnley, look like Brazil.\n37 Posted 14/10/2024 at 08:44:28\nFor the record, I wanted Silva to stay. Amongst his results, 4-0 v Man Utd and Burnley 0 Everton 5 were impressive.\n38 Posted 14/10/2024 at 08:57:08\nSean Dyche has done what was asked of him, and done it admirably, but this isn't about him deserving a shot at it, its about what Friedkin had in his minds eye when purchasing the club. He will want to sort the roles and responsibilities from the first day. For that reason its hard to see Dyche getting a contract extension, deserved or not. Interestingly for the same reason its hard to see any of the usual crop of names coming anywhere close to consideration. So whats it to be? I think from the Spanish league would be tactical choice, Germany? pretty uninspiring for someone just spending a billion.. a Hollywood appointment again? Jose Mourinho, wouldn't last 5 mins.. besides, we are not a big club in his eyes..\nI would not be surprised to see an appointment from left field, South America perhaps, especially if we are to start finding talent from that neck of the woods..\nFriedkin just doesn't strike me as someone who will suffer fools or wait for managers to assemble a team..\nDavide Ancelotti perhaps as an outsider?\n39 Posted 14/10/2024 at 09:13:19\nThere'll be plenty of names I've overlooked though so maybe someone steps up. But the problem will be that the ones we really want probably see us as a step down, not a step up – except in wages...\n40 Posted 14/10/2024 at 09:29:32\nHopefully the takeover will be completed fairly quickly to allow a new manager, if there is to be one, to have access to some funds to spend in the transfer window.\n41 Posted 14/10/2024 at 09:45:06\n42 Posted 14/10/2024 at 09:51:59\nYou would be better at researching, but Germany?\nI think Tuchel is still available?\nAnd as an outside bet Joachim Löw, the former Germany head coach.\nIf we're going to change, we might as well be ambitious.\n43 Posted 14/10/2024 at 09:54:19\nWhat disturbs me slightly is that names seem to be being thrown around by TFG, eg, Mourinho and Moyes, before their status in the club has been confirmed.\nThe effect of this has got to be to undermine Dyche who surely as the manager must be looking forward to getting the best from the squad.\nConstantly being bombarded with names who are touted as likely to take his job in the next few months has got to be demotivating for the manager when we desperately need him to be on top of his game?\nJust saying.\n44 Posted 14/10/2024 at 10:03:35\nDanny, not sure what Löw has done to put him in the frame? International football is a world away from managing at club level. I would consider him a random / unlikely choice rather than an ambitious one.\nFor similar reasons I didn't bother with Southgate who I think would be a disaster.\n45 Posted 14/10/2024 at 10:05:12\nI don't believe TFG do the star-spangled banner parade and huge Americana over-the-top celebrations for their acquisitions. Maybe the move and opening of the new stadium will be different, with a stellar name leading the team out?\nThe thing is, they seem to be a highly successful franchise. Therefore, it is safe to assume that they don't go into matters half-arsed hoping for the best (as we have witnessed for the last several decades).\nThey do have experience in professional 'soccer'. Therefore I conclude there will be an in-depth strategy in place to put a professional team in who will develop the club to their 'vision'.\nTo get to the heart of who will be manager next season, you need to know the individuals who form the caucus of Project Everton within TFG, and who they have already lined up for the old and new positions surrounding the manager, coaching staff, DoF and selling the product.\nThey know who will be in situ for the varying roles once their ownership is approved. They know who they would like to be manager etc next season, but that might also depend on relegation… Everton somehow clambering out of the pit of doom for the umpteenth time in a row.\nAs both manager and DoF contracts end simultaneously at the end of the season, then TFG might see that as the best time to severe present links.\nI believe, as hardened and savvy business people, the most important thing would be to have a manager whom the DoF compliments with players that fit into his managerial style and not a manager who has to adapt to who the DoF drops on his toes.\nFor that, my own opinion is that the much-vaunted name of Maurizio Sarri is a strong contender. Available, decent, and with somewhat of a flair at times, he may well fit the bill!?!\nWhom he would work well under as a DoF I would have no idea. However, it is safe to say I don't think it would be Thelwell.\nThere is of course a safer choice for TFG: Stick with the management team who have shoved the club up from the precipice of failure on all fronts and see what develops.\n46 Posted 14/10/2024 at 10:23:08\nLike I say, an outside call.\nWe won't have a say in it anyway.\n47 Posted 14/10/2024 at 10:40:44\nLo & behold, Silva's win percentage is not only better than Allardyce, but that of Bingham, Lee and Royle too. Although, I agree with the aforementioned site that it doesn't give a true picture of a manager's overall performance.\n48 Posted 14/10/2024 at 10:40:49\nTuchel is a talented coach but also has a bit of an attitude problem. Remember that stupid handshake clash with Conte, what was that – manager-level WWE?\nHe has a history of clashing with players and management and recently does not last 3 seasons at any club.\nHowever, I would not have a clue who to go to, if that helps. I just know if the takeover goes through, that and the new stadium will be moving us up a couple of notches.\n49 Posted 14/10/2024 at 11:02:16\nAnother factor is that, as well as Dyche's contract ending in June, there are 9 players whose contracts also end. I know a goalkeeper and loan players are involved, but there are 5 members of the senior squad, which is close to half a team.\nSo the owners have to decide if they want to get into negotiations with Dyche regarding a new contract and the wages that his agent will demand and whether they want him involved in buying half a team with their money.\nI think it is a big ask. I can't see any previous Everton managers being in the frame.\nIn addition, I can see underperforming senior squad players being loaned out, if their performance is not up to scratch for a new Everton. Thelwell's contract also ends in June, so a clean sweep on the football end is possible.\nI suspect, Robert that your latter suggestions are the most realistic. Thank you for letting me know who is possibly in the frame. Well researched as ever.\n50 Posted 14/10/2024 at 11:08:25\nDoes it really matter who the next coach is if the owner and management team are not aligned and have no vision for the club?\nSeems to me that the coach and players are the latter pieces in the jigsaw, not the other way around. So I'm not so concerned who our next coach is, I want to see the new ownership manage the club sensibly and demonstrate some strategy and vision first and foremost.\nOtherwise we're back to square one. And by the way, if we're relegated, we need a different list of potential coaches.\n51 Posted 14/10/2024 at 11:09:01\nAfter a frankly astonishing first 18 months, he now appears to me to be acting like a dog who has lost his bone. How motivated would you be to bust a gut for your current employer when you know you're out of work next year?\nIn fact, it seems Seamus has taken over some of the dressing room team talks from the manager. So maybe Seamus as the new manager? Or how about Lee Carsley rather than a Hans, Pierre or Carlos?\nThere's too much uncertainty over what happens elsewhere for the rest of the season to be definitive. For example, Eddie Howe would be good but that could only happen if Newcastle bin him off.\n52 Posted 14/10/2024 at 11:55:18\nEddie Howe is rumoured to be linked to the England gig.\nCarsley is apparently more comfortable at development level and publicly stated that he hopes to go back to the U21s.\nIf change is coming, we need to cast the net further in my opinion.\nAnd no to my relative Moyes!\n53 Posted 14/10/2024 at 12:41:01\nAgree, the key component will be the new owners and their vision but I can't see it being Dyche tbh, they will have their own ideas and direction. I do think if he performs reasonably well and by that I mean a comfortable mid-table finish then he will see out this season and his contract.\nJon@51\nHe probably thinks that he has a good chance of impressing enough to warrant a further contract which he might but I can't see it personally. I don't think he has resigned himself to being out of job come the end of the season; besides, I'm sure he will have a healthy bonus on top of his salary for keeping us up. That and his CV will be motivation enough, I would have thought.\n54 Posted 14/10/2024 at 12:41:49\nGraham Potter's time at Chelsea probably wasn't helped by the club being as much a basket-case as Everton, the number of players bought that he possibly didn't want or need.\nAs for Lee Carsley, fair play to him. Imagine he just wants to manage/develop a group of players and perhaps not be involved with all the other stuff/commitments and the other latest buzzword 'noise' associated with and expected of the England manager.\n55 Posted 14/10/2024 at 13:43:33\nMcKenna is a young manager who learned a lot in the backroom staff at Man Utd.\nOr maybe Carsley with a senior figure as No 2, would be a breath of fresh air, but I don't believe in bringing back former managers.\n56 Posted 14/10/2024 at 13:45:59\nThere is no guarantee that a big name would do any better than Dyche.\nCertainly bottomless pockets give a much better opportunity for getting better players but it's all about getting the right blend.\nWe have some talent at the club but also a lot of average players that cannot compete consistently.\nThat situation (we hope) will change in the new year but right now it will be a struggle.\n57 Posted 14/10/2024 at 14:00:38\nThere's a world of a difference in coaching a close-knit group of players in a “small” club with no expectations to a fallen giant desperately trying to reclaim former status with the weight of our fans' \"Nil satis nisi optimum\" demands. I lie awake at night hoping this time they get it right.\nThe stadium can be the launch pad but we need a good and ambitious Mission Control commander.\n58 Posted 14/10/2024 at 14:12:16\nI haven't looked when the derby is. My sister works for them but won't get me a ticket amongst them as she doesn't trust me!!!\n59 Posted 14/10/2024 at 14:20:48\nOur next challenge is for us to get to County Road in a reasonable state for the Fulham match!!!\n60 Posted 14/10/2024 at 14:22:35\nTBH I don't think I've ever met a “warrior” of your experience who could pour oil on troubled waters with such calm and minimum effort. I reckon you'd convert half of them to our side if you were parachuted in the midst of them!\nI reckon 6 points from the next two games. If not, then I'd be happy with Moyes, but only until the end of the season. He's no longer the messiah to take us forward.\n61 Posted 14/10/2024 at 14:27:58\nI learned the hard way that my second wife resented me introducing her as my current wife…\n62 Posted 14/10/2024 at 15:16:50\nFor 32 years: \"Who do you love the most? Me or Everton?\"\nMy response was always the same: \"It's just different.\" It never went down well!!!\n63 Posted 14/10/2024 at 16:16:08\nDespite all the criticism Sean Dyche has received on here and in the media, I don't see any really negative feelings toward him from our supporters over a period of time.\nLast season was Dyche's best season since he got Burnley into the top half of the league. He successfully dealt with an 8-point deduction and got us safe with games to spare.\nYes, the football has not been encouraging for those who want joined-up passing but, of all things, Dyche is pragmatic and it is based on what players he has for any game.\nCan he be blamed for Branhwaite's absence which can account for our usual poor start? For Saturday he will probably be without maybe two of his best players and so plays Ipswich with a\nweakened team.\nCan Dyche be blamed for our financial position which means we have to shop in the lower half of the talent pool? If you listen to him, he rarely complains about lack of money. He just gets on with it.\nWould he be a different manager if The Friedkin Group become our owners and we have some money to spend? I don't think we will be paying £30 grand plus for new players for a couple of seasons. Hopefully we will get more depth into our squad which will mean us better to deal with injuries.\nI would like to see what Dyche could do with a stronger squad. If you listen to some of his podcasts on tactics etc, he is not just a one-trick pony.\nOne change he has clearly made this season is moving McNeil into the No 10 spot. This has only been possible because we now have 3 wide players. Last season, we wondered why we were looking for wide players… now we know.\nI feel that this weekend, even without Ndiaye, we can win the game and add another 3 points which will push us into mid-table. COYBs!\n64 Posted 14/10/2024 at 16:19:34\nWhat he didn't do, was look at the players he had and coach them to get the best out of them. A manager should do just that. Manage what he has. By starting with the style and trying to fit players into it, you are doomed to fail.\nTrying to play like Barcelona with footballers who were used to playing for David Moyes was always going to prove difficult. Tippy tappy football was not for the likes of Jagielka and Co.\nWe need a manager with the brains and adaptability to use the resources he has. Bring in better players and adapt when he can.\nTake Howard Kendall Mk I. He built a team that won the cup, the league and the cup winners cup. Then signed Gary Lineker. Tried to adapt to suit him. We won nowt. Lineker went, but with well managed resources, and an injury list that would worry us even now, we won the league again. That is a manager.\nYou can keep your philosophers. Organise, motivate and get the best from what you have. Find us a leader who does that and we will be fine.\n65 Posted 14/10/2024 at 16:47:38\nI can't see anybody coming from a settled club mid-season (that's if Dyche is sacked).\nI don't follow the managerial merry-go-round, so don't really know – other than Tuchel and Southgate, who is a big No-No imo – who is available.\n66 Posted 14/10/2024 at 16:53:08\n67 Posted 14/10/2024 at 16:58:30\nOn that basis, I can't see any alternatives to Dyche for the remainder of the season. Don't forget, we would have finished 12th last season but for the PSR deductions.\nWhat I do think is important though is that the new board and management of the club are very clear in who they want in charge for next season, whether that be Dyche or someone else, and ready to make any appointments the moment the season is over, not like the fiasco at Man Utd.\n68 Posted 14/10/2024 at 16:58:49\nI do tend to think that the manager's role is overstated.\nWhoever is manager, he can't do it without the players; top players make a manager's job much easier.\n69 Posted 14/10/2024 at 17:02:48\nEvery Everton manager has had problems with individual coaching. Players have seemed to respond only to fall back into their own inconsistent ways.\nI have always thought that there is a cultural ceiling to performance at Finch Farm arising from a lack of accountability and performance monitoring. Part of this is because of the outdated rest and recovery regime that exists, which can be exploited by players.\nThere are players that have made millions at Everton underperforming and missing playing time. The Friedkin Group will be insisting on accountability and monitoring performance for results. Consistent results requirement for everyone employed by Everton will become the norm. This will be a big change from what has been accepted before.\n70 Posted 14/10/2024 at 17:24:11\nPretty much with Everton and Moshiri.\nI was astonished that he no longer goes to matches or even looks at ToffeeWeb.\n71 Posted 14/10/2024 at 18:38:41\nThe turning point for Silva was when Zouma wasn't signed or replaced. Then we lost that derby after playing well, and the team went missing for a couple of months. Hard to fairly judge him managing with these idiots in charge.\nI think Dyche has done a good job, though I've not been convinced by his decision-making this season. It's a moot point, as I'm certain Friedkin will launch his new set-up in time for next season.\nI wouldn't touch Potter with a bargepole. He flattered under a good regime at Brighton and floundered badly at Chelsea, looking and sounding out of his depth from the start.\nI don't know enough about the overseas managers and would be even less certain how they'd cope with the Premier League. I just hope Friedkin gets it right. It'll be an even better job to land next summer – I think there'll be plenty of takers.\n72 Posted 14/10/2024 at 18:43:38\nIf you pick our best first XI and (very importantly) subs bench from the past 32 years, it might not even make the top 4 this season.\nThis is why our managers flatter to deceive. It has very little to do with coaching, tactics etc. Ancelotti, who is worth listening to, said much the same thing.\n73 Posted 14/10/2024 at 19:05:15\n74 Posted 14/10/2024 at 19:09:19\n“I always tell people, the clubs they play for, say Aston Villa or Everton and they look brilliant there and then a manager will think, ‘right then, I'm going to sign him,' and then all of a sudden you go from that to the atmosphere at Newcastle, it's completely different. Some of the players' arses go and you think, God almighty. “So for a lot of them, it's too much for their nerves, you know, a hell of a lot, because when you're playing in front of like the Gallowgate End, the noise they're making is completely different because they're just fanatical, like Rangers fans are fanatical. Man United's are fanatical, Liverpool, so when you go to stadiums like that, or playing for teams like that, it does pick up the nerves and you think, ‘God, I've got to impress them.'”\nHere's me thinking that Evertonians were the ones responsible for making unfair demands and having unrealistic expectations for their club.\nIt's okay though, we'll look forward to Dyche getting his well-earned contract extension because we know our place and wouldn't dare to expect to see anything resembling a footballing side for what another 5, 10 , or 20 years? Stay up for the sake of staying up, it makes absolute sense.\n75 Posted 14/10/2024 at 19:47:11\n76 Posted 14/10/2024 at 20:09:38\nGazza was a Geordie fan.\n77 Posted 14/10/2024 at 20:47:03\nGk Martyn\nFBs Coleman/Baines\nCBs Matterazzi/Lescott\nMFs Kanchelskis, Limpar, Arteta, Speed\nStr Rooney/Lukaku\nSubs. James, Richarlison, Distin, Hinchcliff, Graveson, Cahill, Campbell, Hutchinson, Collins, Barmby, D Watson, Ferguson, Bilic, Pienaar. Prob forgot others.\nGimme the pick out of the above and that team finishes top 4 without doubt imo. Maybe even wins.\n78 Posted 14/10/2024 at 20:50:29\nI’ve said it many times, but even though Gazza was past his best when he signed for Everton, even in his prime, he was nowhere near as good a player as Chairman Bill.\nThose fantastic Geordies, are good though because they have got nearly as many people kidded, as the greatest Evertonian, who ever lived, when it comes to making people believe their absolute fanaticism!!\n79 Posted 14/10/2024 at 20:51:09\n80 Posted 14/10/2024 at 21:01:28\nSilva is a very good manager now. I don't think he would come back -- not because of bad treatment, because those who allegedly \"treated him badly\" will be gone when the sale to Friedkin is completed, but because he's in a good spot at Fulham and there's no reason to move. He's under contract through June 2026.\nIf we replace Dyche this summer, we shouldn't be buying somebody else's manager.\nPT #71, agreed as always.\nJon #51, Dyche is nothing if not a realist. He knows the owner letting his contract run down won't be the owner when the January window opens. Friedkin's first meeting as club owner will be with Chong, Thelwell and Dyche. That's when the key figures will know what's going on. And that's when Dyche may be presented with a contract offer.\n81 Posted 14/10/2024 at 21:35:33\n82 Posted 14/10/2024 at 21:38:03\n83 Posted 14/10/2024 at 21:48:49\nNope, me neither!\n84 Posted 14/10/2024 at 22:13:59\n85 Posted 14/10/2024 at 22:24:03\nSo what are we expecting here. Dyche to keep us in the premier league and then to fuck off coz he's not wanted no more (his contract is up anyway).\nWell, that ain't gonna happen. He will want assurances that he will be given a shot at Bramley Moore if he keeps us up. He gets paid in full whether he goes now or next May, don't think either way bothers him.\nIf Dyche has us out of the bottom three when the new owners come on board, which looks like early December, then believe me, Dyche will want some sort of contract extension to include at least one season at BMD. If the new owners say no to that, which I would seriously doubt, then he will be gone before New year.\n86 Posted 14/10/2024 at 22:32:59\nThe rumour mongering in some of the media about possible early replacements is a concern. Apart from undermining Dyche it glosses over the huge obstacles associated with finding a suitable replacement from a limited field.\nUnfortunately appointing a new manager is something new owners like to do as a way of making a statement to fans and sponsors. Those who do so in haste, quickly find themselves regretting it. Even Abramovich waited a year at Chelsea before bringing in Mourinho in 2004.\nOur new owners should offer an extension of Dyche’s contract to 2026, support him and Thelwell with funds to plug some of the gaps in the squad and give themselves time to take stock and assess how best to move the club forward in the longer term.\n87 Posted 14/10/2024 at 23:16:15\nThey got off to a good start and our fight back just fell short. EFC 0pts; rs +3pts.\nWe get a draw out of that fightback, or even don't let them gallop off in the first place?\nEFC +1pt; rs 1pt (in real terms -2pts)\nEverything else, the rs going on a long run of good results, Mimms in goal for 11 games and all, down to the last bobble of the ball on a divot, Lineker not having his proper boots for 1 game - Everything! We Still win the League.\nOpinions.\n88 Posted 14/10/2024 at 23:24:29\n89 Posted 14/10/2024 at 23:27:29\nMove on almost 20 years and we appointed perhaps the biggest name in club football as manager.\nThe question is - which way is TFG going to go? In 2002 we could afford to take the risk and if he failed then we find another manager who could work on a shoestring. We cannot do that now with the finances at stake and also new owners.\nAlso back in 2002 we had nothing to lose (same in 1983/4) so the chairman stood by the manager no matter how bad it got. Just look at the last 10 years - 9 managers plus probably another caretaker I have missed. I cannot see the same patience in the future.\nSo older unsuccessful managers are probably out. Too safe\nYounger managers are too much of a risk.\nWhere is the Arsene Wenger of 2024 - innovative in an unfashionable league?\n90 Posted 14/10/2024 at 23:52:15\nCarsley? Who has never run a club in his life? \"Knows the club\" more than 15 years after leaving it?\nLöw? Whose only club success was 20 years ago in Austria?\nBellamy? Who just this year was convicted of drink driving again?\nOy vey. Let's keep it rational, folks.\n91 Posted 15/10/2024 at 03:49:07\nWe'd have to fork out for a driver too most likely.\n92 Posted 15/10/2024 at 04:05:01\n93 Posted 15/10/2024 at 05:59:15\nWhat do we want or need? Not too many have written on this before offering their options: excitement/risk, short-term stability, longer-term planning, or a global name to catch the investor’s greed (they’re not necessarily all incompatible).\nIt’s much easier, I think, to rule people out than rule them in.\nFor example, Peter Bosz has caught some peoples’ attention. No thanks. Well, that was easy. Bosz had a very successful season with PSV in the second-rate Eredivisie last season, champions, record points haul, longest winning/unbeaten run, and PSV, as I type, are top of the league with an impressive 100% record.\nThis is the first time that Bosz has ever tasted real success in the twilight of his long career. He is sixty-years-old. He won a Dutch second division title two decades ago and was a runner up in the German cup four years ago and Europa League seven years ago. Not great. So, maybe there is a stability record to help us to think through the next five years or so in the life of our club? Nope. Bosz floats. A dozen jobs in two dozen years.\nJoachim Löw? No! His last years in charge of Germany were like watching an old elephant falling to its knees in the final pangs of death. He won a German cup almost thirty years ago and the fourth-rate Austrian League twenty-two years ago and he has not had a coaching job since he got kicked out of the German job over three years ago. Crucially, he looks like a washed-up relic survivor of the druggy ‘70s who still listens to Wishbone Ash, although he is not a hard-boiled egg.\nPotter? In no circumstances. Carsley? In no circumstances. McKenna? In no circumstances now, possibly later, good pedigree. Tuchel? Looks too much like Gordon Lee and we cannot expose our infant and children blues to Hammer horror nightmare alley twice in under half-a-century. It’s not fair. They will never forgive us.\nDavide Ancelotti? He must be on the verge now of wanting the top seat somewhere. My heart says yes but don’t we need someone with the qualities to stabilise and move up the league in gradual motions? File under interesting and risky with a big splash of flair, pedigree, and excitement. If DA got the job it would feel for me like buying Remain in Light or The Stone Roses, but I have no idea how his first season would end, if he made it that far. Downside? Would not live in Crosby.\nMoving on.\nEddie Howe? Grew up one of us. Likes managing on the coast. Would like Crosby. Does not like the roller-coaster life in toon-town right now, it seems. Looks like the FA might be holding out to grab him as they have not yet interviewed anyone for the England job. If not, us? It’s possible for a handful of reasons that include the lure of the Dock. I’d be happy to see him in charge.\nRúben Filipe Marques Amorim would be my dream choice. He’s not even 40. But no chance, right? Did he indeed knock back Man-Utd and the shite over the summer?\nSebastien Hoeness? Yes please. But he will surely replace Kompany at Bayern next year?\nCarlos Corberán? A yes if we were currently 12th and had no take-over, financial, or relegation worries/hangovers. Intriguing. Keep an eye on him. It will not be him this time, I think, but I would not be disheartened if I was wrong.\nFrancesco Farioli? Roberto De Zerbi protégé, working through the leagues, one step at a time it seems. Can clearly already adapt to the unfamiliar. Tends toward mid-table rather than the higher echelons as at Nice right now where, to be fair, he had to cope with some tough openers but won away at PSG. One to watch. Maybe later?\nThiago Motta? The flashy Italian/Brasillian midfielder. This fella oozes authority and calls a shovel a shovel. I bet that he is on the radar of clubs above where we presently find ourselves. After a rubbishy start managing Genoa for a couple of months he worked wonders keeping skint Spezia in Serie A against all odds and now coaching Bologna to their highest finish for a dozen years.\njagoba Arrasate? 45, low-profile, that Basque life/culture/nous that can seem de rigueur for success these days. Quite Dyche-like n his pressers. Not much jazz or colour. Prefers the training ground to the back pages and glitzy headlines. He took over at unfashionable Osasuna in Pamplona six years ago and the trajectory has been more or less upwards ever since. Promotion to LaLiga in his first season and has never ended up lower than 11th since. Osasuna finished 7th last season and were narrowly beaten by Real Madrid in the Copa del Rey the season before.\nHow does that sound? A stable club on an upward trajectory with a cup final pedigree?\nHere’s my list in order for what it’s worth:\nRúben Filipe Marques Amorim\nSebastien Hoeness\njagoba Arrasate\nEddie Howe\nThiago Motta\nFrancesco Farioli\nCarlos Corberán\nDavide Ancelotti/Thomas Frank/Marco Silva\n94 Posted 15/10/2024 at 06:11:58\nI’d be astounded if any manager doesn't have a preferred ‘style of play’ Martin, but I agree any of them have got to be prepared to put their preferences into hiatus if they simply don’t have the players to carry out their vision.\nBut I think managers being slow or even unable to suss out which players are fundamentally not suited to their plans is not an uncommon flaw in football and any other business.\nI think it is the ability to identify your ‘type’ of player over and over again is what separates the best from the rest.\nAnd then there are the pragmatic managers who simply stick to a basic game they know pretty much any player can handle (if they are prepared to work hard and be satisfied with a restricted diet of opportunities, which probably depresses true artistes).\nI’m still not getting how Sean Dyche can somehow be said to be earning a contract extension. He’s very well paid anyway and if he’s not the best manager we can attract for the season after then I don’t see his ‘right’ to anything more.\nI don’t think he can basically down tools and still collect his money. He’ll get paid off if he is fired but surely not if he effectively breaches contract.\n95 Posted 14/10/2024 at 06:24:47\n96 Posted 15/10/2024 at 08:17:37\nIt's all speculation and I would suspect, depending on the owners and results, Dyche will see out his contract.\nOf all on your list, I quite like the idea of Hoeness if we do change.\n97 Posted 15/10/2024 at 08:23:11\n'My heart says yes but don’t we need someone with the qualities to stabilise and move up the league in gradual motions'\nWhilst I agree with you that is an ideal quality, I imagine a great number of supporters would expect any new manager to hit the road running and be winning the Champions League within 2 years having won the treble (including the League Cup) the previous season. If not, expect the crowd to turn on the manager.\n😀\n98 Posted 15/10/2024 at 08:40:56\nThe fact that it might be a case of thank you and goodnight might be a bit harsh, but if he was being poached (ha) he'd be off like a shot and the contract could go hang.\nI think he'll be a bit miffed - but who wouldn't.\nDown the track he'll probably score himself a few nice shortish well paid gigs a 'Fireman Sam Mk.II' on the strength of his relatively successful time with us.\n99 Posted 15/10/2024 at 08:42:55\nSurely Speed would too, albeit he was with us too short a period. With Linderoth and Maguire as competition I think nearly any of our CBs the last 30 odd years would also get into the United team…..Moyes made a great fist of starting the destruction of Fergusons legacy (and some people want him back!)\n100 Posted 15/10/2024 at 09:41:52\nOnana\nDalot\nMazraoui\nMartinez\nDe Ligt\nCasemiro\nMainoo\nFernandes\nGarnacho\nZirkzee\nHojlund\nSpeed may get in that side if he was prepared to play deep defensive midfield in place of Casemiro.\nThe front 3 would be Garnacho, Rooney and Kanchelskis- no room for Lukaku.\nHonestly Denis that best XI team is really crap.\n101 Posted 15/10/2024 at 10:30:21\nI know little or nothing about the managers Robert has mentioned and described but he does his homework so I read his post with interest and take his verdicts on them.\nDavide Ancelotti (?) just one question - - if his dad wasn’t Carlo Ancelotti would he be in a job? Not having a go there just interested in his qualities that sees him go from a coach, among many at Real Madrid, to be the manager of Everton or any premier league club.\n102 Posted 15/10/2024 at 10:45:12\nWe can then consider options. If he wins us the FA Cup, who knows?\nYou know me, evert the optimist!!\n103 Posted 15/10/2024 at 10:48:33\nAt Everton, it was Davide that took and arranged all the training sessions. He even did all the set-piece tactics. He was very highly thought of by all the players.\nNow I'm not saying I want him as manager. But I wouldn't be upset if he did come back to us.\n104 Posted 15/10/2024 at 10:59:53\nIt would be a short-term move but perhaps our best shot at a trophy within the next few years. Not a move I'd want but also not one I'd deem implausible.\nAmorim and Hoeness would be great appointments but I wonder if Frank or Corberan might be more pragmatic, with Ancelotti an intriguing wild card.\nAs others have said the manager should in theory be less important if we can get the club running properly and recruitment working as it should. Brighton has been able to shift manager almost as seamlessly as it has players.\n105 Posted 15/10/2024 at 11:45:28\nWhatever anyone thinks of Dyche, he has been managing a complete and utter mess in a ridiculously chaotic football club, since he came to Everton, and I'm just thankful he never folded.\nThis could have easily been the case, especially because not many people would have viewed it as being Dyche's fault, and although I can see why people want a different manager, I agree with John Rafferty, and believe that the stability that Dyche has brought, is very much underestimated, and should be used in a positive manner whilst our new owners take stock.\n106 Posted 15/10/2024 at 12:12:50\nLet's not paint a picture that he's some miracle worker. We just stayed up by our fingertips in his first half-season, it wasn't down to anything tactical he changed.\nLast season, we had 3 of the worst sides in Premier League history that went down. He now has a decent squad, and we still play crap negative football. The sooner TFG takeover and tell Dyche to sling his hook, the better\n107 Posted 15/10/2024 at 12:28:09\n108 Posted 15/10/2024 at 13:34:50\nYour very first sentence @106, is probably 100% correct, Paul, but this doesn't mean Dyche hasn't kept us in the Premier League twice and reading your post above confirms what I was saying about people underestimating the job Dyche has done in such appalling circumstances.\nI understand people not liking the football and it's apparent that this has got to change but Everton can only get better once our circumstances have finally changed, and only then will I judge Dyche, or whoever else is in charge, on the style of football that they will have us playing.\n109 Posted 15/10/2024 at 13:47:55\nThe club has been in a mess for seven years. That has not saved previous managers who took us from mid-table to the relegation zone.\nYou say Dyche knew what he was getting into. I doubt anyone told him he would need to be ready to handle deductions of 8 points last season.\nIn his first half-season, we were in the mire when he arrived. Hapless Frank looked on the point of a nervous breakdown. Many of our fans were resigned to relegation. It was a combination of good management by Dyche and some good fortune we reached the last match with the outcome in our own hands.\nLast season, we would have finished comfortably in mid-table on 48 points but for the points deductions. As it was, even after the points lost, we were able to relax going into the final matches, a unique experience for some younger fans.\n110 Posted 15/10/2024 at 14:07:19\nIf it hadn't have been for the points deductions, we may have been safe by the end of January 2024, although we may not have had that pre-Christmas boost of the points that came as a result of the perceived unfairness of the original points deduction.\n111 Posted 15/10/2024 at 14:12:22\nWe have to keep our nerve!\n112 Posted 15/10/2024 at 14:43:18\nWe”d need a driver for Bellamy, but definitely not a 3 iron who he attacked Riise with!!!\n113 Posted 15/10/2024 at 15:05:01\n1) The owner left the building and stopped funding squad improvements;\n2) The board went into exile in January 2023 after Headlockgate;\n3) We were hit with two PSR points deductions;\n4) Our auditors said in March 2024 that there was uncertainty about our ability to operate as a going concern if we were relegated;\n5) We have generated £100 million in net profit from player sales since he took over; and\n6) We have had five failed takeover bids.\nWhich other manager has faced circumstances like this and managed to earn a points total that would have put us in 12th place? Name one and I'll be impressed.\nHe has earned the right to manage us through to the end of the season, and possibly beyond. He has made mistakes this season, and he needs to show he has learned from them.\n114 Posted 15/10/2024 at 15:06:46\nI personally thought that the very hectic December, took its toll on a small and limited squad, and remember Phil Foden’s interview after City beat us during the Christmas period, when he said Everton are a good team.\nI’m aware we all see different things, but like I’ve said before, our team was just beginning to play without the pressure they had been under for the previous two seasons, and this might have even helped us get the boost you mentioned, before fatigue set in?\nA part of me thinks the points deductions last season was because the relegation places would have been settled after thirty games otherwise!!\n115 Posted 15/10/2024 at 16:07:50\nWhat's all that got to do with Dyche playing crap tactics and making even crapper subs? Picking players well past their best and out of position.\n116 Posted 15/10/2024 at 16:41:35\nIf he can get the backing financially in January to buy some better players in the right positions, then perhaps he can turn this club around.\nWhilst there are no guarantees about any manager's job, I believe he is as good (or bad) as any out there so why not stick for the time being as no new face will do anything more with the current squad?\n117 Posted 15/10/2024 at 16:47:29\nHaving said that, new owners usually like to make a fresh start with their own man, so we will have to wait and see what he does. I think he will leave well alone this season though.\nWhat about a German manager? They are usually very efficient and organized.\n118 Posted 15/10/2024 at 16:50:22\n119 Posted 15/10/2024 at 17:28:57\nHis weaknesses are clear to me too. Weak tactically and slow to respond to changes on the pitch and inconsistent team selection.\nHis win ratio is extremely poor and therefore I cannot envisage him for the medium and long term.\nPersonally, I would give him to Xmas; if we don't see a strong improvement, pull the trigger.\nI don't have sufficient knowledge or research and bow to Robert's superior knowledge but I certainly don't want Mourinho, Southgate or Potter. I would reluctantly accept Moyes short term but would like to see a young, progressive and upcoming manager to take us where we belong – at the top.\n120 Posted 15/10/2024 at 17:46:01\nHow about we get a more adventurous and tactically aware manager and let's see if we can get European football for the new ground next season. Dyche has brainwashed some fans into thinking we can't do anymore than just survive.\n121 Posted 15/10/2024 at 18:06:18\nPickford, yes, but he divides opinion; Branthwaite, yes; Calvert-Lewin, maybe… but that's pushing it.\nAs a team, we struggle to do the basics, like pass to one another; that's not the manager's fault.\n122 Posted 15/10/2024 at 18:22:51\nNot sure about Europe yet, Paul, but I definitely agree that Dyche's narrative is all about what a great job he would have done ‘combatting the noise' and keeping us in the division.\nThis squad is comfortably mid-table in the right hands imo.\n123 Posted 15/10/2024 at 18:24:38\nPlayers first and foremost.\nDespite some claiming “we're not that bad” – we absolutely are. How many of our current squad would be definite starters at any other Premier League club?\nOn the basis of a middling to crap transfer budget from Friedkin, we need the genius of early years Wenger discovering at least 4 relative unknowns healthy, effective and capable of coping with the unique demands of the Goodison goldfish bowl. I work on 50% of transfers coming off so that means 8 newbies!!\nA motivator capable of creating a team. I can't remember the last time an 11 in blue looked like a team. Possibly all the way back to Big Joe giving Spurs a doing over in the FA Cup Semi-Final and upsetting the neighbours on a regular basis.\nA charismatic communicator. It can't be understated how beneficial it is to butter up fans, especially the pitchfork and torch brigade, when results are a bit iffy. A bit of bollocks about how great we are now and again goes down a storm.\nShrewd enough to sell our best at top dollar and find better for less. (That's the way of the world without oil money!)\nAnd preferably attack-minded although not a deal breaker.\nAnyone know where this cat lives?\n124 Posted 15/10/2024 at 18:27:21\nIf the manager can't motivate the team around having confidence to do the basics and beyond, then what's he there for?\n125 Posted 15/10/2024 at 18:36:00\nIn fairness to him, we probably haven't a clue just how much shit he's had to put up with. However, it smacks of desperation when he regularly refers to the circumstances.\nThere is no doubt that the squad is thin and we are one or two more injuries from a crisis.\nHowever, he (Dyche) would have more respect from me, if he spilt the beans now, instead of signing a non-disclosure agreement, and then skate over grizzly details in his customary autobiography in 2028.\n126 Posted 15/10/2024 at 19:07:36\nLampard had both Richarlison and Gordon to call on. Martinez had Lukaku, Stones, Barkley, Barry, Coleman in his prime and the rest. At one point, Moyes had Cahill, Jagielka, Baines, Arteta and Pienaar.\nWe have hardly anyone of those levels now… nor do we have any depth.\n127 Posted 15/10/2024 at 20:02:10\nI might be wrong because I haven't taken as much notice of many teams this season, and I have often thought the Premier League is also overrated with regard to the standard right across the board over a full season. But look how poor we have been defensively without Branthwaite and, if you take Calvert-Lewin out of the team, do we have another forward to replace him?\nA big word to me in football is 'craft' and when I look around the Everton squad, one of the biggest things that stands out is how few of our players have got any real genuine craft.\n128 Posted 15/10/2024 at 20:54:34\nI can't imagine many Evertonians believe this at all. He's been fair at best but if someone wants to try and make the case to keep him, I'm all ears.\nA few attractive names on that list but I'll defer to those who follow the management merry-go-round better than me.\nI'd love someone like Thomas Frank but would he consider Everton a \"step up?\" I'm not so sure.\n129 Posted 15/10/2024 at 21:03:52\n130 Posted 15/10/2024 at 22:08:46\nThere's no way, in my mind, that Dyche will be leading us out in the new stadium. New, shiny stadium deserves a new, shiny manager.\n131 Posted 15/10/2024 at 22:17:42\nManagers just don't do this anymore. They will have a say but it wasn't Thomas Frank who signed Toney, Wissa, Mbeumo etc.\nSimilarly none of the Brighton managers have scouted teenagers like Moran and Ferguson in Ireland. That's the job of the DoF.\n132 Posted 15/10/2024 at 22:45:08\nHe deserves to be thanked for all his achievements in keeping us up in the worst-ever period of our history. The circumstances and obscene dereliction of duty by owners, board, Premier League and media, have all been horrendous.\nYet through it all, we survived thanks in the main to his management. Without it, I have no doubt we would be playing games in the Championship if we were lucky.\nYes, he's been well paid for it, but he earned every penny and his success prevented hundreds of millions being wiped off the value of the club — or worse still: administration.\nThey say \"crisis sorts men from boys...\" he has been the best possible man for the club's survival since he arrived.\nBut, with the arrival of TFG, a move to the new stadium set, financial security assured, the club enters a new phase.\nDyche's contract expires at the end of the season, new owners will be looking to wipe the slate clean, install their own structures, management style and personnel throughout the club. They will see this as the first phase in the transition of the club to successfully competing in Europe. Their plan will be geared to that outcome over I would say, a 3-year period.\nThey won't hang about. Successful US business people don't wait for things to happen, they drive change from Day 1. Ruthless.\nI have no doubt that Dan Friedkin will be totally and utterly impressed with what Dyche has done, but that does not mean he sees Dyche as the manager to take the team to the Champions League in 3 years. If he doesn't believe that, then he will appoint someone who will.\nThe season]s end offers TFG a clean break, a fresh start for the club and supporters. What Sean Dyche has done should be acknowledged by all in football as incredible, it should cement his personal future in football.\nBut not at Everton. That day is done. Big clock, pat on the back, golden handshake, fanfare of praise and thanks.\nThe club is about to get a new version of ownership and management where success is measured by on- and off-field performance criteria of a different breed of ownership we have not seen the likes of.\nThat's not meant to denigrate in anyway Sean Dyche's achievements to date and the assumption we are not relegated this season, but a reflection of the need to change, a change across the board.\nPersonally I don't think Sean Dyche will fit in those plans at all. A line drawn under the Moshiri, Kenwright era, a fresh start.\n133 Posted 16/10/2024 at 01:02:15\nYes, he's been dealt a shocking hand but that can't be changed now, just like he wouldn't change his style of play if he had better resources. For me, I'd let him see out the season and shake his hand goodbye.\nI'm not sure who I choose to replace him at the moment but I hope to god it's someone who plays football. I don't need to have 10 passes in our area from every goal kick but please can we use our midfielders.\nOne appointment I'd love us to make is bringing David Weir back home and putting him in as DoF. He's done a great job at Brighton as technical director and I'd absolutely trust him to know the market well enough to rebuild our squad.\n134 Posted 16/10/2024 at 06:03:13\nThe squad is better this season and he needs to maximise the resources he has through better tactics and selections. He could help himself no end by picking players based on form and in their right positions.\nBut, did we really expect Dyche to navigate his way through Items 1-6 on my list and deliver the joga bonito as well?\nDespite the greater depth this season, we could lose 13 first team squad players in June as contacts expire and loanees return to the club. A massive rebuild is needed over a 5-year period on limited funds.\nAgainst that requirement, Dyche could make the case he is the best man for the job.\n135 Posted 16/10/2024 at 08:05:51\nOur circumstances need to change radically for the better and be stable at that level, before we can consider the luxury of the kind of football we all want to see. Until that time, steady as she goes and Dyche is the man.\n136 Posted 16/10/2024 at 09:34:32\nNormally, I'd happily see his sort of manager out of the door but, with how horrible the last few years have been, I'm tempted to give him another season after this one. Despite his garbage football.\nWe need some stability, and giving Dyche 3½ years in charge would give us that. He'll easily keep us up, as would many other managers, but the \"noise\" around the club would start to ease. We would be seen as a solid, mid-table club who are looking up rather than down.\nIt would give another club the chance to take our Crisis Club title (maybe West Ham?) and it would just make everything a little easier if we were barely mentioned in the media for a while.\nDecent, hard-to-beat, mid-table sounds so much better than the basket-case club we've become over recent years.\nThen we appoint a young, exciting manager to lead us back into Europe with our shit-hot scouting system!\n(It's so easy in theory…)\n137 Posted 16/10/2024 at 09:40:21\nI suspect the Friedkins will be looking at it all this way too.\nIs Dyche now our longest-serving manager since Moyes? Must be there or thereabouts. That is ridiculous.\n138 Posted 16/10/2024 at 09:48:49\nNot too long ago, David Weir had the chance to come back to Everton in the position you advocate. He told Brighton about it and had a good look at the position at Everton, then decided to stay in his secure job at Brighton.\nDavid sounds like he is a very intelligent man.\n139 Posted 16/10/2024 at 10:45:00\nThe Premier League and the FA have failed miserably in producing top-class British coaches and managers. Southgate did a very good job, maybe he wasn't flamboyant enough for some, but his record stands up against any who have followed Ramsey.\nI couldn't imagine Germany employing a non-German as manager of the national team. Where is the structure for us to produce top-class British coaches? The answer sadly is non exists.\nNow I am sure Tuchel will do a decent job, but he has been sacked from his last couple of jobs.\n140 Posted 16/10/2024 at 11:01:50\nEven if that were to happen, it would always be somewhat devalued as not being a truly English achievement.\n141 Posted 16/10/2024 at 11:22:15\nTime to move on, Blues, onwards and upwards, ruthless ambition please.\n142 Posted 16/10/2024 at 11:27:55\nI don't think for a moment Pep, Arteta, Klopp, Ancelotti and other top managers kowtow to the judgement of a DoF.\nIn truth, I don't think any manager does. I imagine they appreciate the research but that's as far as it goes.\n143 Posted 16/10/2024 at 11:42:52\nTake Savinho at Mam City. He has not been identified by Guardiola. He has been scouted as a teenager of talent in Brazil and signed to City's affiliate club Troyes in France. From there he has been loaned to City affiliate club Girona in Spain to develop. Having developed to the requisite standard, he's bought by City and brought into the first-team squad by Guardiola.\nSome other big signings like Haaland and Gvardiol are no-brainers because they're obviously outstanding.\nBut whatever the case, Guardiola is not driving recruitment. It's not his job.\n144 Posted 16/10/2024 at 12:30:37\nYou have hit the nail on the head as to what to expect from our new American owners in the future; it certainly won't be throwing a lot of money on expensive players from around Europe.\nThey will carry out a 'root and branch' investigation of all the club's functions, on and off the field, and yes there will be casualties along the way.\nSome of the things they will be looking to do from Day 1, is to increase the club's revenue, so expect price increases across the board, not just season tickets; not being popular won't bother them one bit.\nWhen you pump in north of £600M on an acquisition, plus week-to-week financing (which is what is happening now) to keep us going, you are entitled to do that.\nAs for Dyche, lesser mortals would have cracked under the pressure of the last 18 months at Goodison, inheriting a piss-poor squad of largely mediocre players. And then, in the summer, scratching around for free transfers, loan players, and 'bargain buys' in the transfer market, can't be great for any manager, particularly watching little old Ipswich spending £100M in the close season, to give them a fighting chance of staying up.\nHe is a strong individual no doubt, and annoyingly frustrating at times, with his tactics, and team selections, but he is robust and honest in his press interviews, without actually coming clean and saying \"I've been dealt a pretty shit hand by the club since Day 1\".\nI have a mate who regularly asks, \"Would you have Silva or Martinez back?\" I always answer the same, \"Absolutely no chance.\" Silva would have a breakdown under the current circumstances, and Martinez would be telling us things were 'phenomenal' with one game of the season left and needing four points to stay up!!\nDyche's only task is to keep us up this season; if he does that, he will walk away with my thanks, despite the dreadful football.\n145 Posted 16/10/2024 at 12:37:18\nHowever, over the years, two managers have stood out for me. Unfortunately, they both managed Liverpool. I am referring to Shankly and Klopp, who, apart from successes on the field, both had charisma that helped promote the club and its supporters. In short, that's what I would like to see at Everton.\nI know it's not usual to promote anything about LFC on these pages, but my wish is based on my experience which has witnessed as they have grown from being the second club in this city to one of the biggest clubs in world soccer. Shankly laid the foundations and Klopp was very much his 21st century equivalent.\nSo, apart from football nouse, I would love to see someone with a big personality, and a showman's mentality to develop a team capable of filling and entertaining a full crowd at our big new stadium.\n146 Posted 16/10/2024 at 13:12:12\nHoward gave me a team that I witnessed Everton lift the first trophy in my life at Wembley and then see us lift a European trophy, followed by a near miss double and then a second league title.\nTalk about teenage dreams.\nAs you mention him, apparently Shankly had a soft spot for Everton and was often at Bellefield and Goodison in his retirement.\nThere is a photo of Bob Paisley next to Howard Kendall with the FA Cup, travelling back with the FA Cup in 1984.\nI suppose times were different then, even if the rivalry was as ferocious once we took to the pitch.\n147 Posted 16/10/2024 at 13:27:19\nI know Barry does some things differently but I do not believe he is towing cows. I mean he would need a trailer :-)\n148 Posted 16/10/2024 at 13:42:02\nWhile you are correct about Shankly resurrecting a 2nd Division club as they were then, and laying the foundations that make that club what they are today, I think Bob Paisley eclipsed everything that Shankly achieved.\nI was lucky enough to be in Shanklys company a few times after he retired, and there is no doubt there was an aura about him. I remember one time the pub I went to back then collected for a sunshine coach and Shankly came along to present the cheque. He spoke for about 40 minutes no notes just talked about football, his admiration for Matt Busby, but most of all about the people of Liverpool, and it made the hairs on the back of your neck stand up.\nHe never asked for or got a fee for doing this, he then sat down with a few of us for another hour just talking football. Just listening to him ,no wonder players would run through a brick wall for him.\nMaybe if Sir John had the courage to appoint Brian Clough, we may have had our inspirational leader that Shankly was for them.\nJust to concur with what Danny said about Shankly spending time at Bellfield when he retired, Shankly lived in Bellfield Avenue so couldn't have lived much closer to our training ground.\nThe reason he spent so much time at our training ground when he retired was because when he retired he still went to Melwood to train but the players went over to him as soon as he entered the training field, and it disrupted training.\nSo Bob Paisley asked Shankly not to come to Melwood when the players were training but said he was welcome to come there when the training had finished. I suppose Shankly took exception to that but, as much as I liked Shankly, Paisley was absolutely correct in what he did.\n149 Posted 16/10/2024 at 13:50:46\nThe mid-late '70s and early '80s may have worked out quite differently for both clubs.\n150 Posted 16/10/2024 at 13:51:26\nYou are missing the point - the DoF might recommend but the manager confirms (or not).\nLook how many times new managers go after players from their old clubs – that's not the dof in action. Might be different beyond these shores but many things are.\n151 Posted 16/10/2024 at 14:12:12\nI understand your point entirely... but couldn't you find a way of making it without talking them up? On an Everton website of all places???\nMaybe I'm somehow unique in this respect but over the years I have developed an absolute and total hatred of Liverpool FC – and that includes especially any reference to how much better they are.\nWe know it already. We know only too well how fucking wonderful they are… No Evertonian needs or wants reminding of it — especially on here of all places, a space devoted to Everton.\nWe get bombarded with it at virtually every turn, the mainstream media and their sickening love affair… how they can't ever do anything wrong or be in the wrong – even when they are. Worst is the red Echo and the links (or more) to LFC stories they put on their Everton pages.\nThe only time they should get a mention on here is when we play them.\n152 Posted 16/10/2024 at 14:31:08\nHe was also the epitome of courtesy and good humour, Merseyside has never had a finer ambassador.\n153 Posted 16/10/2024 at 14:45:30\nI don't think you're unique we all hate Liverpool winning anything, but that doesn't mean you have to be impervious to what they have won and desperately wish it was us.\nKevin while Howard was our best ever manager he hardly compares to Paisley in terms of trophies, he won 6 league titles, 3 European Cups, 3 consecutive League Cups and 3 Uefa Cups.\n154 Posted 16/10/2024 at 14:57:37\n155 Posted 16/10/2024 at 15:02:44\nIt means not talking about them on here.\nLike not making a fucking list of the prizes one of their managers has won...\nWhat the hell is the matter with you??!?!?!\n156 Posted 16/10/2024 at 15:15:03\n157 Posted 16/10/2024 at 15:18:56\nMaybe I'm somehow unique in this respect but over the years I have developed an absolute and total hatred of Liverpool FC – and that includes especially any reference to how much better they are.\nYou're not unique, mate, you're in very good company. Bollocks to all this \"give them their due.\" They are, in the main, complete and utter gobshites who would love nothing more than for us not to exist.\n158 Posted 16/10/2024 at 15:27:22\nThe relationship changed after the obvious. And don't start me on the Steaua Bucharest banner held up in the Kop at derbies.\nI have close family who are Kopites. I can tolerate them.\nBut as a collective support base, it changed in the late '80s. And try sitting with them in London. Most who have never been to the city, let alone Anfield.\nAs I've said before, I almost feel like I should go to confession for educating them on their supposed club.\nWe know the song. Every single one of them.\n159 Posted 16/10/2024 at 16:01:20\nI hate them more as a fan base since I've moved here, far worse than the scouse r/s. Most of the scousers I know in Jersey are blues.\nI agree with Michael Kenrick @155, let's keep this space sacred shall we.\n160 Posted 16/10/2024 at 16:09:15\nMy first place of employment in 1964 paired me with an angry, spiteful, mean spirited RS follower, and I have despised him and 'them' ever since.\n161 Posted 16/10/2024 at 16:11:43\nThings have gotten much worse since those days, and I'm in Michael's camp when it comes to them, we should try as Blues to give them as little publicity and attention as is possible as they get more than enough from their friends.\n162 Posted 16/10/2024 at 16:24:52\nBut on a lighter note - I went to the beer and music festival in Shrewsbury last weekend with some of my partner's family whom I had never previously met (living closer to Paris than Shrewsbury as the crow flies as I do these days). I was sat quietly in the back of the car surreptitiously following the Newcastle game on the LF when my better half announced \"Megan supports Everton\". Hallelujah! Megan is the 9 year old grand daughter of my partner and is now (as I told her) my new best mate in Shropshire. I asked if any of her school buddies were Toffees and she said oh yes! but I didn't ask about other teams.\nIt's nice that we do still appeal to these youngsters. Gave me a lovely warm feeling all over.\n163 Posted 16/10/2024 at 16:27:50\nDanny, I used to work with one who didn't even know where Queens Drive was. I asked him if he's ever even been to Anfield, the reply was \"Well yeah but I was given a lift\". So even if he had it was a one off.\n164 Posted 16/10/2024 at 16:41:51\nDyche Out!\n165 Posted 16/10/2024 at 16:48:06\n‘The Filth' or ‘The Vomit' is that the type of thing you are looking for?\n166 Posted 16/10/2024 at 17:16:18\nJoe, I hope you gave him a blue card!! Off. If I didn't get the train from Hunts Cross to Kirkdale, it was the 81D from Speke all the way along Queen's Drive. I do miss my home city and love my trips back.\nKim, that's a nice story. I am always astounded by the young supporters at the match, home and away. How they do it, I have no idea. I'm sat there having kittens, heart flutters and continuously watching the clock. These kids are raving with enthusiasm that I could learn off.\nI do miss the days when I used to go and watch Everton knowing we would probably win. It will come again. For those young supporters and the next generations.\n167 Posted 16/10/2024 at 17:40:13\nHowever, my rational half cannot escape the fact that since 1958 they've never taken a backward step. Their so-called barren Premier League years were festooned with cups including the Champions L.\nRather than shove our collective heads in the sand, we should ask what have they done different to all others and can we learn from it?\nI have my own views but fandom is subjective so objectivity about the neighbors doesn't really work in these environs.\n169 Posted 16/10/2024 at 17:49:59\nDyche has done a decent job so far of keeping us up but I will be shocked if he is still the manager when we start signing new players. So he should be safe until the end of the year at least and possibly the end of the season. It will depend upon results and if another attractive manager becomes available before then.\nDyche has plenty of experience in relegation fights and he has been fairly successful but he seems ignorant of his own short-comings. His inability to make good substitutes rules him out for the future.\nHe was shown up in the Bournemouth game when he blamed the players instead of admitting his mistake. If he cannot admit his mistakes, then he will not learn from them and he will continue to be Tony Pulis in Disguise.\n170 Posted 16/10/2024 at 18:44:38\nredshite the better.\nI completely hate them, Heysel was final straw. They tolerate us because of the position we're in, and when we beat them last season Van Dijk and Co showed their true colours.\nAnd all their pundits… don't get me started on Aldridge.\n171 Posted 16/10/2024 at 19:08:40\n172 Posted 16/10/2024 at 19:12:18\nTruly vile inhuman narcissists.\n173 Posted 16/10/2024 at 19:28:54\nAnyway, as he is family I don't call him Gobshite, I call him Koppite. My sister recently seriously said to me “I'd rather you didn't keep calling him koppite, Mark.”\nI said “but he is” and she replied, again in all seriousness, “Yes, but I know what you think of koppites and I'd rather you didn't call him that.”\nGobshites, every fucking one of them!\n174 Posted 16/10/2024 at 19:34:07\nBut that was then, the bitterness, snide vulgar bile that has replaced respect is shocking, and that's first hand in my own family!\nSo now I give them nothing but contempt for it is all they deserve. Every trophy tarnished black. I cannot hate my own, but I truly despise them for who they are and their arrogance and entitlement. Relegation awaits them.\n175 Posted 16/10/2024 at 19:53:15\nMark as a fellow Evertonian and TWer I love you, BUT, I'm obsessive about some things and I can't help it and apologise in advance.\nMark, kopite has only one \"p\" mate. Always has, always will. Now I'm off to close a cupboard door three times. 😱\n176 Posted 16/10/2024 at 20:13:33\nXxx\n177 Posted 16/10/2024 at 20:15:27\nSeven of us used to go out together every Monday before the Covid virus put the blocks on that, three Blues and three Reds and another who couldn’t give a fuck about Everton or Liverpool he was addicted to golf!\nWhen the ale was in and the wit was out three of us would argue the toss, two would sit back and enjoy the bedlam we created, one, a Blue would join in now and again throwing Man. Unt. and Alex Ferguson into the argument to set the Reds spitting and gargling in reply and do the same when City. and Guardiola were keeping Liverpool down, and when it came to Liverpool going to finals and tickets were in short supply I’d always sympathise with my little Liverpool mate who was a biased bastard telling him “ You should always get a ticket, you’ve never missed one of their games, on fuckin’ television for the last twenty years” and my little smile would set him off the edge and he’d tell us how he went to see Liverpool beat Leeds at Wembley in nineteen bleedin’sixty five! Those were the days, five of them have gone since the virus made it’s mark, sad to say.\n178 Posted 16/10/2024 at 20:38:45\nWhen there's a story online in the Echo about Everton, they can't resist posting on it as soon as they can, having a go and just being the gobshites that they are.\nI know things they've done that I'll never put in print, told to me by one of the very few I've time for, who was there when things happened, and saw them first hand.\nMy feelings towards them will never change.\n179 Posted 16/10/2024 at 20:38:59\n(It’s chorr-ee-tho NOT chorr-it-zo!)it’s not bloody Italian!\nGrinds my gears that!\nKopites are gobshites!\n180 Posted 16/10/2024 at 20:40:53\n181 Posted 16/10/2024 at 20:53:57\n* They are seriously impressed by the emerging stadium at Bramley-Moore Dock;\n* And too that we look like having serious owners;\n* They think in the next 10 years EFC will be a European powerhouse.\nInterestingly, they did not want me to tell other relatives about this… so do not underestimate some RS hostility being plain old jealous fear.\n182 Posted 16/10/2024 at 21:20:23\nLast time I stood on the kop, centuries ago, there was loads of \"p\". Rivers of it.\n183 Posted 16/10/2024 at 21:32:33\nHe had a mate at Hillsborough who escaped with quite serious injuries and it made him realise the futility of football fanaticism.\nI have sympathy for those affected by Hillsborough but their club denial of Heysel sickens me.\nWhenever I'm called a bitter by the plastic gobshites I meet down here, I remind them of Heysel and the reasons why I'm bitter. Most of them don't even realise it. God knows the press have forgotten all about it!\n184 Posted 16/10/2024 at 21:34:54\nIt's the amalgamation of all things concerning that engenders the ill feeling, from the press and pundits, the Sky 6 syndrome, which has tilted the odds heavily in their favour, the love-in with the referees, the complete lack of accountability for all the vile actions they perpetrate, both on and off the field of play, the demonizing of anybody who offends their sensibilities, or injures one of their players (St Virgil), the airbrushing of Heysel from their history, and their glee about how it has affected Everton FC, Stevey me assaulting a DJ in Southport and walking, the Michael Shields fiasco, supporting the racist Suarez with their T-shirts, stoning visiting teams coaches The list is endless, but never mentioned.\nHowever, their time will come, as it always does. I hope I will be able to witness their demise, and savour the anguish of their supporters.\n185 Posted 16/10/2024 at 21:42:25\n186 Posted 16/10/2024 at 22:41:51\nDave I agree between collectively and individually\nMind you I only regard my RS mates who I've known since before we went to The Friary infants school as good lads.\nThe rest are arseholes\nWe all meet up and regardless of half red and half blue, we'd do anything for each other without question. Regardless what we've done in life and what we have achieved we're still the same bunch that grew up together.\nMy RS mates followed them all over Europe from Shankley onwards, even preseason games. Sadly they've never actually gone to games for years, just can't get tickets they can afford.\nMind you thinking about it, they're arseholes too! Which I shall mention next time we meet up!\n187 Posted 16/10/2024 at 23:28:27\nFurther to the above; Yes it's kopite with 1 pee - which we must never cease to take out of them.\nAnd it's 'rs' not RS, only 'proper nouns' have a capital letter, 'common nouns' don't - and there's no one more common than that lot.\nThree things come to mind.\n1) I was told years ago, \"You can can always tell a kopite - but not much.\" (they know it all obviously).\n2) and one I use...a sort of footballing 'why am I not surprised' when they pop up in the news for usually the wrong sort of behaviour - which we correctly label as 'kopite behaviour'\n\"rs, you always get exactly what it says on the tin.\"\n3) When presented wirh a choice...even if it's only from two...of colour\nThe answer is never! red\nAnd if there's no choice I'll do without.\n3a) if given one and one only free trip in a TARDIS or De Lorean, I'd set it to 1892 and tell them - \"just pay the fuckin rent increase,\" I'd even give them the 120 quid myself.\nIt would save a lot of long-term angst.\nOh and kopites are gobshites, 1 = 20 etc.\n188 Posted 17/10/2024 at 06:07:33\nIf nothing else, would this be a good time to ask Lee Carsley if he would be interested in running our Academy?\nAnd on the matter of our \"neighbours\"; I refer to them as the illegitimate child who was left behind at our old home after an arguement over the rent which does tend to leave some of their \"fans\" with a silent, vacant look of incoherence.\n189 Posted 17/10/2024 at 08:27:44\nWhen I go to the Black Country (Dudley), to see the wife's family, I struggle when they speak amongst each other. They tone it down for me when they talk to me, The Dudley accent is more of a dialect.\nThere is a nearby place, which I've mentioned before, called Gornal. She's laid to rest there near her parents. Her dad used to take me to a pub there to meet his mates. I honestly spent half of the night not understanding what they were talking about!!\nThe UK is interesting. Many foreign colleagues I've worked with and have learned English to a good level, struggle with people from Liverpool, Newcastle, Glasgow and Belfast.\nIt is the same in other countries. I speak relatively good German, not as good as I used to, but I can get by. But if I'm in southern Bavaria, Austria and the Sud Tirol in Italy (German speaking), I struggle. As for Switzerland, I have no clue.\n190 Posted 17/10/2024 at 08:29:30\nTony Pullis in disguise might actually be a very good description of Sean Dyche but we all saw what happened to Stoke City once the fans had had enough of his style of football.\nHopefully better times are around the corner because I don't think Everton could have survived much longer given the way we have been getting run down season after season since Usmanov stopped pumping his money in.\n191 Posted 17/10/2024 at 08:56:13\nWhat for me is imperative is that, once the takeover is complete, we have all the building blocks in place off field and that may take until the end of the season to bed in.\nBuilding blocks being a new board of directors and those who work at the club in higher positions who will perhaps need replacing.\nFor well over 30 years, we have never had people at the helm who want to drive this club forward, no one had ever challenged the status quo and going that further mile. No one has ever looked at increasing and maximising revenue streams and better sponsorships.\nI think the point I'm making is let the off-field activities bed down whilst Dyche is in charge (barring an extremely poor run of negative results) and the club will then be aligned as to who the next manager will be next summer and why they have brought him in.\n192 Posted 17/10/2024 at 09:53:24\nSafe, sensible, a bit drab but also high profile. We need stability when we get to the new stadium – other teams have often struggled in new stadiums, so a lot of the names in the (excellent) OP, are wide of the mark as I see it.\nI don't see the new owners deviating too far from safe and sensible (and British), at least in the initial phases of us bedding in to the new ground.\n193 Posted 17/10/2024 at 09:56:19\nFor too long, the manager has been the only block.\n194 Posted 17/10/2024 at 09:58:41\nYes Hillsborough is well noted for the 97 who lost their lives there but many more, who were there that day, have carried injuries physical and mental since the traumatic Hillsborough tragedy, not forgetting the many family members who were not there but suffered from the loss of their loved ones.\nI see the son of one of my closest friends who was a young lad in the ground that day and grabbed up out of the crowd into the stands, he has suffered mentally since then especially when the date of the tragedy comes round, he feels guilty he was saved and so many died.\nHis dad was a Liverpool fan and went the game every week with me to Goodison and Anfield, unless I was watching Everton away. He never took Liverpool and football as seriously as me, he loved boxing much more, he went to the Olympics in Japan 1964 and just missed out on a medal. We met at school in 1945 and carried that friendship on until he passed away just over 20 years ago.\n195 Posted 17/10/2024 at 10:35:21\nThis is even more the case given we currently have a very safe manager.\nShort of spending £300M on new players, there's nothing the Friedkins can do to propel us into the Top 8 quickly – although Dyche gives us an outside chance with a bit of money to spend. We made it to 12th last season with a terrible squad and there were lots of games where a bit more quality would have led to points.\n196 Posted 17/10/2024 at 10:46:20\nEven though we had won a semi-final that day, I couldn't celebrate and was with a mate who was really worried about family members.\nI went to the semi-final in 2009. I gave my tickets to my son and brother and found a nearby pub to watch it. Mostly full of Man Utd supporters, who eventually got kicked out as they were taking drugs in the toilets.\nBut before that, they started going on about Hillsborough. Well, there were only a few Evertonians in the place, but one walked over to them and gave about 6 of them both barrels. They shat themselves!!\nMy wife told me to behave myself when I jumped on the table when the final penalty went in and I always remember meeting my son and brother after the match, with the latter screaming Jagielka in my face!!\n197 Posted 17/10/2024 at 11:03:08\nAside from some team selection and formation issues, he has worked hard to ensure our Premier League status.\nOn those issues and that basis, I would certainly give him the opportunity to manage Everton at our new stadium.\n198 Posted 17/10/2024 at 12:49:57\nI don't expect the above to happen.\nSouthgate would relegate us.\n199 Posted 17/10/2024 at 13:20:16\nDidn't bother me but the steel entered me Dad at once. \"I've been to Anfield a couple of times, amazing, so quiet, like a library…\" and downhill it went. He eventually staggered off but not before singing 'It's enough to make your heart go… [insert farting noise]!\"\n200 Posted 17/10/2024 at 13:37:49\nI know that doesn't really narrow it down but it does rule out Dyche, Southgate, Howe and Potter.\n201 Posted 17/10/2024 at 14:05:21\n1. Dyche\n2. McKenna\n3. Frank\n4. Terzic\n5. Potter\nThis is based on how attractive (or not) we will be to other coaches and managers.\nThe Friedkins will probably not be expecting a Top 8 finish next season – and the funding is unlikely to be there to bring in Top 8 quality players. I suspect progress is anticipated to be slower than many fans will think (hope?) is possible.\n202 Posted 17/10/2024 at 14:31:06\nI absolutely detest You'll Never Walk Alone and have walked out of many parties whenever it has been played. My argument has always been that anyone who walks through a storm, holding their head up high, must be an absolute lunatic.\n\"I pull my hood up and keep my head down, like any normal person\" I tell them. But on 15 April, even I understand the true meaning of that song.\n203 Posted 17/10/2024 at 14:56:28\nBut Hillsborough is different.\nI remember when little boy blue, Rhys Jones was killed and they played Z-Cars at Anfield with his parents on the pitch. And that symbolic image of the two kids on the pitch at Goodison the tune of \"He Ain't Heavy\".\nI can't stand them as a club, but sometimes you remember we are from the same city and often the same families and friends.\nWe may be fierce rivals, but in times of difficulty, we come together.\n204 Posted 17/10/2024 at 15:11:38\nConsider the circumstances under which Dyche came to us and what he has managed to do with a paupers stipend since, and you should agree that he has managed admirably, albeit dishing up non-attractive football on the way.\nI ventured that, if he managed to climb the league this season and we ended up well away from danger, he should be given the opportunity of a renewed contract. This would give Friedkin the chance to see what he could do in different circumstances.\nI think that would be fair as being the manager at Everton for the past couple of years or so has not been easy. He has earned his money and would deserve another chance.\n205 Posted 17/10/2024 at 15:29:57\nI don't know who would be able to manage Everton after Dyche but, given the lack of ambition shown by quite a substantial number of Evertonians, it won't be too difficult a gig to keep many of the fans onside.\nWe should be looking forward to our next few fixtures; instead, many of us have this nagging worry that it will turn out badly for us again.\nIf we go on one of those long winless runs, then it's thank you and goodbye from me. Will those advocating the stay of execution for Dyche, post official takeover, remain indignant that he's the only man for the job?\nI would love us to climb the table in the next few months but it ain't gonna happen – not with Dyche in charge. It's been torturous watching Everton under this manager, and if it continues into the new stadium, we'll see the fans staying at home more often.\nIpswich awaits as we look for our first away success since Burnley last December.\n206 Posted 17/10/2024 at 15:46:44\nIt was ambitious to get Ancelotti who is inarguably one of the all-time managerial greats. The trouble is, unless you match that kind of ambition with a supply of high quality players to the first team, then it achieves nothing.\nOrganising the academy, recruitment and player development is far, far more important than who the manager is.\n207 Posted 17/10/2024 at 16:20:11\n208 Posted 17/10/2024 at 16:24:33\nFred, and the lack of ambition shown by a substantial amount of Evertonians just takes me back to the days of glass ceilings and how plucky little Everton were constantly punching above their weight.\nThis is how we got to where we currently are because it became such an easy gig to keep so many fans onside for Bill Kenwright, when ‘careful what you wish for' became another one of those horrible catchphrases that suddenly became associated with Everton.\n209 Posted 17/10/2024 at 16:38:55\nMaybe some just get fed up of constantly moaning while still wanting us to be challenging at, or near, the top.\nWhat haven't these non-ambitious Evertonians done that they should have done to be ambitious?\nI think rolling out stuff like that is a kick in the teeth to the likes of Danny O'Neill and Rob Halligan and all the others who go home and away and show great support for our club.\nIn fact, Fred, I think that accusation is a load of shite tbh.\n210 Posted 17/10/2024 at 17:14:11\nI don't agree with your characterisation of my post, but what I do read amongst many posters on here and elsewhere, is that Dyche has and is doing a great job, and will do a better job when he's given more money, but I really don't see it that way at all.\nPounding the ball up to a lonely centre-forward, for many a game, is not my idea of entertainment. Nor will that style, help to lift us up the table for any prolonged length of time.\nAs for Danny and Rob and all of the others who travel up and down the country, I have the greatest admiration for all of them, but that doesn't mean that they have enjoyed the footy they've been watching in the last few years any more than I have.\nThis should be a time of great excitement due to the impending takeover and the new stadium on the horizon, but in my opinion, we have grown so used to losing or not winning that our 'ambitions' have been stunted even below what we had during Moyes's time at the club.\n213 Posted 17/10/2024 at 17:34:14\nAnd similarly, Friedkin has seen Roma on a very tight budget in the past couple of seasons. So a spending spree at Everton seems unlikely too.\nIt is brilliant that both takeover and stadium are now so close – but it doesn't really change anything on the pitch.\n214 Posted 17/10/2024 at 18:05:29\nI've read so many of your posts where you consistently remind us how bad we are and how bad we've been for a quarter of a century. Much of this I have nodded at approvingly; however, whilst we can all recount how bad things have been, sport is about dreams big or small…\nThe very least I want to witness prior to shuffling of this mortal coil, is an Everton team that believe they can win football matches, even if the odds and the facts of the matter would suggest otherwise.\n215 Posted 17/10/2024 at 19:59:17\nIt's no coincidence that it's pretty much always the same solution and it almost never comes down to the manager from time to time. Stuttgart, Seville, Leverkusen, Napoli, Atalanta, Villarreal have all done versions of the same thing overseas – and over recent years Brighton, Leicester, Brentford and Liverpool have all done the same thing here.\nThey have tried as hard as they can to bypass an overheated, over-priced transfer market for \"ready-made\" players – and they all use similar sorts of approaches to do it.\nWe can do it too – and will hopefully crack on as soon as the takeover is complete. It will take a little while to bear fruit though. So I am not sure whether it is better to build stronger foundations under Dyche for another season or two or to place our faith in McKenna.\n216 Posted 17/10/2024 at 20:42:40\nI strongly advise you to avoid the BBC show “Strictly Come Dancing” this Saturday evening.\nMy wife has banned me from the living room as she knows how I will react (not well). KAGS\n217 Posted 17/10/2024 at 21:09:27\nI think that the Christmas fixtures are very tough so taking points this weekend is a start.\nI think Sean Dyche had done remarkably well at keeping Everton up, in the extremist of difficult circumstances, no mean feat.\nBut with the takeover pending, I sense that change will be sooner than later this season.\nHeard some serious rumours this week about Moyes, returning once TFG take over. I hope not...\nBut more important is getting a win or at least a draw v Ipswich.\n218 Posted 17/10/2024 at 21:15:07\nAs for BBC Breakfast, as I was rantting, she switched of the TV and confiscated the remote.\n219 Posted 17/10/2024 at 22:06:17\nPlease explain my \"characterisation\" of this?\nI don't know who would be able to manage Everton after Dyche but, given the lack of ambition shown by quite a substantial number of Evertonians, it won't be too difficult a gig to keep many of the fans onside.\nQuite clearly, and obviously accuses a substantial number of Evertonians of showing a lack of ambition.\nCouldn't be any clearer.\n220 Posted 18/10/2024 at 00:36:29\n221 Posted 18/10/2024 at 17:34:02\nSorry, way back at [15] I mentioned Seb Hoeneß as some one you hadn't mentioned, but you had included him in the Dino Topmoller section of your OP, so apologies.\nAs an aside, I read yesterday and today, that the City Group have been sounding out Rúben Amorim as a potential successor to Pep. So, any thought of being able to attract him to Everton, will I suppose have to be tempered with that thought in mind.\nHowever, I'm posting more as a question to yourself and other aficionados of a Clubs Football management structure as to what your thoughts would be on changing the current structure that Everton currently have and adopt the European and I guess two or three EPL clubs (I know City and Villa do this to a degree) and adopt a three tiered structure of having a Sporting Director at the top of the chain, then a DoF and other Heads of Departments e,g, Scouting, Recruitment, Ladies Football, Academy etc, and then rather than have a 'manager' as such, hire a more 'purist' coach.\nAfter watching that bit of positive spin fluff of the interview between Dyche and Juliette Ferrington; it would appear that maybe one reason why we had an indifferent preseason, and poor start to the season is because he is having to 'manage' the footballing side of things too much and as such wasn't as hands on with the coaching (mind you, bear in mind he himself admits that he doesn't do unnecessary coaching) on the training pitch.\nWith TFG hopefully completing the take over soon (I am assuming that the FCA and FA tick boxes will be nearly already ticked by now, using the 777 application process as a guide) and I considered if they'd go with the AS Roma model, with the CEO acting as SD, with a DoF (or Technical Director using their naming convention) and then the manager?\nIt makes sense to me, as it would allow the DoF to divest themselves of some used management bandwidth, which would be better provided by a Strategic head, i.e. a SD or TD.\nIn other words, using the personnel we have now, if we appointed Mr(s). SDir, and we had Kevin as DoF, it would mean, he wouldn't have to monitor and assist the women's football, or worry too much about the scouting strategy or academy issues too much.\nYes, he'd sit in on Multi-head meetings, but once he'd discussed with the SDir and Coach what type of players they were looking for, and how he wanted the academy to dovetail into the 1st XI or specific tactical training of multi-positional training and player development etc, then he could focus on his relationship with the coach, and provide everything else required for the smooth running of the core-product, the 1st XI.\nI just think adding that layer above the DoF would actually make whoever was in that position (if it indeed still exists post-takeover) much more effective.\nI was looking to yourself and others on what your thoughts would be on that scenario?\nGood wishes\n222 Posted 20/10/2024 at 09:10:12\nI took great pleasure in pointing out that Branthwaite is too good for Man Utd…\n223 Posted 20/10/2024 at 16:35:09\nMore generally, I'm returning to this thread after our fairly straightforward victory over Ipswich yesterday - because McKenna must be one of the likelier candidates to replace Dyche.\nI suspect that Ipswich are in a bit of a false position at the moment because as well as going up in standard, McKenna is trying to bed in a lot of new players.\nThat said, I think Dyche pretty much schooled McKenna tactically - and made it very difficult for Ipswich to play much of a passing game, while exploiting their weaknesses at the same time. They will probably get better as the season progresses provided that they don't get completely demoralised by these early season defeats. Yesterday would have been particularly demoralising because that fixture would have been seen (by them) as one they could (or even should?) win - putting a very different perspective on the table as a result.\nThis was particularly good stuff from Dyche therefore with, let's be honest, a pretty ropey bunch of players available. Indeed many posters were appalled at the team he selected. Davis, O'Shea, Phillips, Clarke, Hutchison and Delap would all have been in with a shout of starting for us yesterday ahead of often disappointing (but equally often unfairly criticised) players like Young, Mykolenko, Gueye, Doucoure, Harrison and even DCL.\nTo my mind, it reinforces my expectation that we won't exactly become prime tika-taka Barcelona under Dyche - but if we can get more quality into the side then the playing style and results will improve.\nIt also makes me wonder just how long (and how much money) would a coach like McKenna need at Everton to really move us forward.\nQuite a quandary for the Friedkins but I suspect (returning to your point Simon) that they will wonder whether they can achieve more at Everton by sorting out organisational things like the academy coaching, academy recruitment, loan arrangements and affiliate clubs, scouting and connections with agents etc etc. The manager is not really the issue.\n224 Posted 21/10/2024 at 04:07:46\nHe didn't succeed at PSG, but nobody does, because winning the league is not enough for them. I have faith in him, he is my second favorite manager after Carlo Ancelotti.\n225 Posted 21/10/2024 at 04:36:31\nAnd he wouldn't have to move house or change schools for his kids.\n226 Posted 21/10/2024 at 06:56:52\nI know we've been banned from mentioning that lot but they brought in a manager who played a certain style, then players who suited that style.\nThe choice of style is probably less important than the ability to play it effectively. Leicester remain the best example – 4-4-2 out of fashion, but the 11 they repeatedly put out were perfect for it.\nBig centre-backs sitting deep, a combination of a passing midfielder and a guy who could run for days, big man and little man up front, pace on the wings. Easy.\nSo when it comes to Everton, what is the plan? When you look at our signings and the managers who have been in the frame (last time was Dyche and Bielsa who couldn't be more different) it's hard to really pin down a footballing style that we have in mind.\n227 Posted 21/10/2024 at 07:20:00\nIf not, then it looks like Dyche would likely get to stay on as he sometimes gets a tune out of what we have now and could possibly add a tweak or 2 in the transfer window.\nIt just condemns us to more of the same for a few more years.\n228 Posted 21/10/2024 at 07:34:25\nWe could very easily be where Villa are now if club management had used their brains.\n229 Posted 21/10/2024 at 13:00:31\nThe story first broke via the Grauniad;\nIt was then picked up by the usual suspects.\nHowever, it is interesting that Amorin has been distancing himself from moving with Viana to the Etihad.\nFrom Yahoo Sports on Friday;\n\"\"One potential candidate to succeed Pep Guardiola as Manchester City manager has commented on recent rumours linking him with the Etihad Stadium job. Reports concerning the future of Pep Guardiola have intensified over the course of the last seven days, both concerning the possibility of him taking a high-profile position at international level, and a factor that could influence his departure timeframe, Prior to the Football Association's decision to intensify negotiations with Thomas Tuchel, and ultimately finalise contractual talks with the German, there had been a suggestion that Manchester City's manager had received ‘informal contact' from the national federation. Additionally, Txiki Begiristain's exit for the end of the ongoing season increased speculation as to whether that could have any bearing on Pep Guardiola's decision, with the feeling from earlier in the summer being that both men could leave the Etihad Stadium at the same time. And one man who has since been heightened as a potential candidate to replace Guardiola is Sporting's Ruben Amorim, who has risen to the very top of Europe's most highly-rated coaches via his work in Portuguese football alongside City's next Director of Football, Hugo Viana. Speaking during his first press conference post-international break, the subject of a potential switch to Premier League champions Manchester City was put to Ruben Amorim, as Pep Guardiola continues to weigh up his options. “(Hugo) Viana will always be a great friend, but one day his professional trajectory will be different,” he responded with reference to Sporting's Director of Football, who is set to take on the same role at Manchester City from the summer of 2025. Amorim continued, “One thing does not lead to another. The main focus is that nothing has changed at Sporting. Viana will only leave at the end of the season. Until then, he is the sports director, there are no changes in this aspect. “We didn't talk about it (him moving also) at all. They are two completely different paths. People made that connection, but Hugo Viana's path is Hugo Viana's path, my path is my path. “We have a professional relationship, it won't last for always, what will remain is our friendly relationship, that's for sure.” In the meantime, Pep Guardiola has also had opportunity to comment on his own future, and the next steps for Manchester City, insisting that he is yet to make a call on what comes next and whether to extend his agreement beyond the end of the season. Additionally, Guardiola told reporters on Friday afternoon that despite the England job now being occupied by Thomas Tuchel, he retains an intention to manage at international level at some stage in his football career.\"\"\nMaybe he's being cute, maybe he's had a contract to look over already, maybe he's happy at Sporting?\nJust a case of suck it and see...\nCheers Eric. 🙂👍\n230 Posted 21/10/2024 at 13:02:55\nI agree that Christophe Galtier would be a great appointment, however, he has already stated that he doesn't speak English, and isn't interested in leaving Ligue 1 for the Premier League.\nA shame, but never say never I guess?\n231 Posted 21/10/2024 at 13:19:22\nJust joining the dots with you at [223], Ernie [226] and the replies, hints at what I was trying to get at in my post at [221], ie, the question of whether it would be a step 'forward' having that extra layer of expertise and management bandwidth in a Sporting or Technical Director role, with a traditional DoF sitting underneath him, and then a 'coach' for the first team.\nThat way, they pick a footballing strategy for everything from the first team, to training strategies, the academy, the youth teams and integration between them and the first team, the medical teams, Strength and Conditioning, Nutrition, Sports Science etc etc.\nOnce all that has been decided, then they should look at getting a coach in who fits their strategic vision and plan.\nIt would probably be best for the DoF to have the last say, as they and the Coach would have to work hand in glove on a daily basis.\nWhile the Sporting Director would use other departmental heads to keep the rest of the football operations running smoothly, ie, Recruitment and scouting, and the other ancillary footballing issues.\nAs you have said, Rob, and how Ernie and Eric have alluded to. With no joined-up thinking and waayyy too many fingers in the transfer pie over the last eight years, we have an incredibly poorly assembled squad, with barely any player being a genuine 'top eight' player, other than the usual suspects in Branthwaite and Pickford, with maybe Ndiaye fast becoming hot property.\nAgain, going back to your question in the OP Rob. I'd expect Dyche to remain in situ until the takeover has been completed, and the administrative (read commercial and financial) changes have been implemented and some signs of increased financial income is tangible.\nAs you say, I'd expect a couple of loans coming in with a couple being terminated, and maybe 1-3 players coming; there's already rumours of two names being mentioned with a January move to Everton from Europe.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 21283,
  "scraped_at": "2026-02-14T01:54:48.965934",
  "_text_extracted": true
}