{
  "article_id": "77b67f0bf6e9",
  "url": "https://www.teamtalk.com/manchester-united/red-devils-dream-alive-insider-confirms-path-clear-record-breaking-real-madrid-superstar-signing",
  "title": "Man Utd dream alive as insider confirms path clear for record - breaking Real Madrid superstar signing",
  "date": "20240418T231500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd dream alive as insider confirms path clear for record-breaking Real Madrid superstar signing\nManchester United could have a clear path to the signing of Vinicius Junior, as Ben Jacobs has reported juggernaut Paris Saint-Germain are not ‘looking at’ the superstar.\nSir Jim Ratcliffe’s ambition has been clear to see the moment he was confirmed as United’s new part-owner. He immediately vowed to take the Red Devils back to the top of world football.\nGiven they have not challenged for a Premier League title essentially since Sir Alex Ferguson left, and haven’t made it past the quarter-finals of the Champions League since they made the final in 2010/11, it’ll take some effort to see that happen.\nRatcliffe brings a good amount of money in with him, so if he’s able to ship some players out so that United can spend big without getting tangled in financial red tape, some huge signings could be expected.\nAn absolute marquee addition to the side that has been suggested is Real Madrid superstar Vinicius.\nIt has recently been stated United are willing to splash over £170million on him – that would shatter not only United’s record signing, but make the Brazilian the most expensive player in Premier League history.\nIt has been thought that other rich sides might be able to stump the Red Devils in that pursuit, though.\nOne that are in a much better position in them in terms of football, PSG – having reached the Champions League semi-finals by putting Barcelona out last round – have been tipped to sign Vinicius.\nDON’T MISS: Kylian Mbappe: Four superstars who may have to leave Real Madrid if blockbuster free transfer goes through\nPSG don’t want Vinicius\nBut Caught Offside‘s insider, Jacobs, has revealed they are in fact not in the race for the attacker.\nIndeed, it’s stated that while the Ligue 1 giants are ‘going to be ambitious’ this summer and have freed up a lot of funds with Kylian Mbappe leaving, Vinicius is ‘not a name PSG are looking at’.\nThey apparently believe they would be ‘wasting their time’ in trying to get him this summer.\nThat’s as Jacobs suggests the attacker is expected to stay at Real, though ‘if he ever became available’, PSG could try to get him.\nUnited won’t wait for green light\nBut given the ambition of United at the moment, it seems they don’t care whether Vinicius is available or not.\nIf clubs were to wait until players because available every time they tried to sign somebody, nobody would ever move anywhere, and United are looking to make waves, so their aforementioned bid could well come in whether or not Real want to sell.\nWith the path now clear of another big side, it seems there’s even more chance of that happening than previously.\nThat said, PSG likely have more funds to spend, and they could take United’s cavalier attitude for themselves and attempt to snare Vinicius this summer regardless of Real’s stance.\nIt remains to be seen how far United get with their attempts, but at the moment, it seems they are out in front alone in the pursuit of the star man.",
  "word_count": 534,
  "scraped_at": "2026-02-14T01:56:51.551566",
  "_text_extracted": true
}