{
  "article_id": "77b94af21cdc",
  "url": "https://www.citizen.co.za/news/four-key-sundowns-players-to-look-out-for-in-caf-final/",
  "title": "Four key Sundowns players to look out for in CAF final",
  "date": "20250524T173000Z",
  "domain": "citizen.co.za",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Loftus Versfeld will stage the first leg on Saturday afternoon, before the decisive return fixture in Cairo eight days later.\nThere will be a sense of disappointment if Mamelodi Sundowns fail to capture the 2024–25 CAF Champions League title. The Brazilians are tipped as favourites to overcome Egypt’s Pyramids FC in a two-legged final.\nLoftus Versfeld will stage the first leg on Saturday afternoon, before the decisive return fixture in Cairo eight days later. While this marks Pyramids’ debut appearance in the prestigious continental final, Sundowns will be contesting their third.\nALSO READ: Cardoso promises to stick to Sundowns identity in Champions League final\nSundowns first reached the final in 2001, losing to Al Ahly, before lifting the trophy in 2016 under the guidance of Pitso Mosimane.\nPhakaaathi football journalist Katlego Modiba highlights four key Sundowns players who could be decisive in their pursuit of continental glory.\nRonwen Williams\nThe ever-reliable Ronwen Williams has become indispensable for Sundowns. More than just a shot-stopper, he is a leader both on and off the pitch. With club captain Themba Zwane sidelined for much of the season due to an Achilles injury, Williams has taken on the captaincy and led with distinction.\nThe 33-year-old has kept six clean sheets in 11 Champions League appearances this season, anchoring the team’s run to the final. A strong showing in goal during the first leg could prove vital to securing a second continental star.\nPeter Shalulile\nSundowns’ journey to the final would likely have faltered without the contributions of Peter Shalulile. The Namibian striker has scored three crucial goals en route to the final and consistently steps up when it matters most.\nIn the group stages against Maniema Union, he came off the bench to score the equaliser before forcing an injury-time own goal to seal a dramatic comeback. He also netted the only goal across both legs of the quarter-final clash with Espérance, securing their passage to the semi-finals.\nTeboho Mokoena\nTeboho Mokoena is the heartbeat of Sundowns’ midfield. Acting as the crucial link between defence and attack, his intelligence and positional awareness allow him to break up opposition play and drive the team forward.\nOver the past few seasons, Mokoena has established himself as a consistent performer. Now, he is just two matches away from fulfilling the promise he made to club chairman Tlhopie Motsepe when he signed—to help deliver the Champions League title.\nGrant Kekana\nOften overlooked, Grant Kekana is a vital figure in Sundowns’ defensive unit. He marshals the backline with authority, making it difficult for attackers to get past him. Kekana is rarely beaten in one-on-one situations and is comfortable playing the ball out from the back.\nALSO READ: Zwane believes current Sundowns team is better than the class of 2016\nAlongside Williams, his calm presence will be crucial in containing Pyramids’ danger man, Fiston Mayele. The Congolese striker has already netted eight goals in the tournament, including a semi-final brace that eliminated Orlando Pirates.\nSupport Local Journalism\nAdd The Citizen as a Preferred Source on Google and follow us on Google News to see more of our trusted reporting in Google News and Top Stories.",
  "word_count": 525,
  "scraped_at": "2026-02-14T02:09:11.450059",
  "_text_extracted": true
}