{
  "article_id": "77c85d9d1060",
  "url": "http://www.china.org.cn/2025-12/10/content_118219782.shtml",
  "title": "Defensive crisis for Bilbao ahead of PSG clash",
  "date": "20251210T013000Z",
  "domain": "china.org.cn",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Athletic Bilbao faces major defensive problems for its vital game at home to reigning Champions League holders Paris Saint-Germain on Wednesday.\nThe muscle injury suffered by central defender Aymeric Laporte, coupled with Aitor Paredes' suspension after he received his third yellow card of the tournament away to Slavia Prague, leaves Athletic coach Ernesto Valverde with Dani Vivian as the only available central defender in his first-team squad.\nReal Madrid's Daniel Ceballos (R) vies with Athletic Bilbao's Benat Prados during the Spanish La Liga football match between Real Madrid and Athletic Bilbao in Madrid, Spain, on April 20, 2025. (Photo by Gustavo Valiente/Xinhua)\nValverde will have to decide whether to use former PSG left-back Yuri Berchiche as a makeshift central defender or hand a first-team debut to B-team defenders Jon de Luis or Ander Izagirre, which is far from ideal against an attack as lethal as PSG's.\nAthletic got an important morale boost on Saturday with a 1-0 win at home to Atletico Madrid and could have forward Inaki Williams available after the club captain missed the last seven weeks with a hamstring injury, but the Basque side has no room for error with just four points from its opening five games in the tournament.\nPSG travels without Achraf Hakimi, who has an ankle injury, while Desire Doue has a hamstring problem and Nuno Mendes' dead leg could also keep him out of the game. Ballon d'Or winner Ousmane Dembele is also a major doubt with flu.\nVillarreal is also at home on Wednesday, with Marcelino Garcia Toral's side virtually out of the competition after a 4-0 defeat away to Borussia Dortmund left it with just one point.\nThe difference between Villarreal's performances in La Liga and the Champions League is surprising, with the side third in La Liga, just a point behind Real Madrid. Marcelino may feel that Wednesday's home game against Copenhagen, followed by a trip to bottom side Ajax in January, could give his team the chance to turn its European form around.\nHe is limited in his options for rotation with injuries to striker Gerard Moreno, midfielder Dani Parejo and defender Juan Foyth, but Nicolas Pepe could come into the starting XI to freshen the side up, unless Marcelino decides to focus more on a very winnable La Liga visit to Levante on Sunday.",
  "word_count": 387,
  "scraped_at": "2026-02-14T02:03:26.515267",
  "_text_extracted": true
}