{
  "article_id": "77ef38e9edcd",
  "url": "https://www.teamtalk.com/news/clubs-queuing-sign-arsenal-star-arteta-transfer-decision-trigger-shock-january-exit",
  "title": "Clubs  queuing up  to sign Arsenal star ; Arteta transfer decision could trigger shock January exit",
  "date": "20230926T104500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Clubs ‘queuing up’ to sign Arsenal star; Arteta transfer decision could trigger shock January exit\nThere will be no shortage of interest in Arsenal goalkeeper Aaron Ramsdale should he seek a move away from the Emirates in January, it has been claimed.\nRamsdale does not want to be a second-choice goalkeeper, although he is determined to keep fighting for a spot in Mikel Arteta’s starting XI for now.\nArsenal have signed David Raya from Brentford on a season-long loan. The deal includes an option to buy for £27m at the end of the season.\nRamsdale featured in the Gunners’ first four Premier League games of the season, conceding four goals and keeping one clean sheet in the process.\nRaya was brought in for Arsenal’s match against Everton two weeks ago, however, and has remained between the sticks ever since.\nThe Brentford loanee has made two Premier League appearances and on Champions League appearance so far, keeping two clean sheets.\nArteta’s decision to drop Ramsdale has led to speculation about his future. Many pundits have urged the goalkeeper to move elsewhere.\nPlenty of clubs hold an interest in Ramsdale, so he will have no shortage of options if he does opt to leave the Emirates.\nClubs ‘queueing up’ to sign Ramsdale\nAccording to Football Insider, clubs are ‘queuing up’ to sign Ramsdale in January and are keeping a close eye on his situation.\nThe report notes that the England international is not willing to be the Gunner’s second-choice goalkeeper after Raya was brought in to the side.\nIt’s claimed that Ramsdale is determined to play for England in the 2024 European Championships and therefore, consistent playing time is his priority.\nTherefore, he may look to leave if his playing time doesn’t improve. Although, as mentioned, he is determined to fight for his place for now.\nRamsdale only signed a new contract earlier this year which is valid until 2026, so Arsenal are under no immediate pressure to sell him.\nRaya is also a full international for Spain, so like Ramsdale, he will be looking to play as much football as possible to ensure he will be playing in the 2024 Euros, too.\nArsenal are set to face Brentford in the League Cup on Wednesday, so it will be interesting to see if Arteta brings Ramsdale back into the fold for that game.\nREAD MORE: Arsenal urged to address ‘obvious’ void in squad as Gary Neville cites club legend",
  "word_count": 407,
  "scraped_at": "2026-02-14T01:48:28.232968",
  "_text_extracted": true
}