{
  "article_id": "780bc586dcc5",
  "url": "https://www.ilmessaggero.it/en/kean_s_absence_sparks_tactical_debate-9125010.html",
  "title": "Kean Absence Sparks Tactical Debate",
  "date": "20251014T101500Z",
  "domain": "ilmessaggero.it",
  "source_country": "Italy",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "martedì 14 ottobre 2025, 05:20\nAt the crucial moment, Moise Kean raises the white flag; an ankle sprain forces him to return to Florence, leaving coach Gattuso with a gap in the attack. The choice of who to place alongside Retegui is not the easiest: should he bet on Pio Esposito, fresh from a dream week, or on Raspadori, always a guarantee in the national team? Harnessing the enthusiasm of the Inter striker could be the right move, not only to overcome Israel but also to bring the Azzurri closer to the World Cup. The Atletico Madrid second striker, on the other hand, has more confidence in scoring, especially in the national team where he has scored 11 goals in his career, the latest against Israel and Estonia in the first-leg matches. Simeone in Spain has used him as an external forward (for example, against Espanyol in the first Liga match or with Eintracht in the Champions League) but also as a second striker as happened in his only starting match in Liga with Mallorca. In short, a versatile, experienced, and concrete player who has shown he can coexist with Retegui. Rino, up front, seeks certainties and perhaps giving Pio Esposito part of the burden of the offensive department in a key match could prove to be a risky move. And speaking of doubts, in midfield, there is the one between Cristante and Locatelli: the Roma player would give more physicality to the department, the Juventus player more geometry.\nMAGICAL MOMENT\nReturning to the attack, Pio would not hold back if the choice fell on him; he would continue the good work done in this magical period: the first goal in Serie A against Cagliari, his debut in the national team, and the goal in Italy's match against Estonia as a substitute as in Sardinia. However, it is more likely that he will play during the match. Pio's story remains a beautiful tale of Italian football, which struggles to produce talents. All eyes are on him, perhaps the expectations are excessive, almost as if to rehabilitate a system that has failed. This is evidenced by the last two missed World Cup qualifications. The 2026 World Cup in America, however, would be a great achievement for the young boy from Castellammare di Stabia, who will also be useful to Chivu in the delicate match against Roma. Inter lost Thuram due to a femoral bicep injury (he will miss two matches) and Lautaro will return from Argentina at the last minute, available but struggling to play at the Olimpico after playing last night against Puerto Rico in Miami. Therefore, the Romanian coach should start with him and Bonny up front, but it is very likely that Esposito will play a part of the match. In the Nerazzurri, they have been nurturing him for a long time and want to keep him close. Talks for a salary increase have reportedly already begun to avoid losing him. He has already showcased himself at the Club World Cup where he collected two appearances, one goal, and one assist. Not a small feat for a young player who, after going through the ranks between Brescia and Inter, was sent on loan to La Spezia to play in Serie B. Returning home, he demonstrated that the experience in the cadets was indeed useful. Another message to Italian football that should focus more on second teams to train young players and not on the less competitive Primavera championships. Now Esposito earns 300 thousand euros a year, but the prospects are enormous, Marotta knows it, and probably the salary adjustment will come before the World Cup call-up. Qualification permitting. Gianluca Mancini has an open account with Israel, as he was among the culprits of the sensational comeback: 'In the first leg, it was a crazy match, we let ourselves be caught like fools, we know what we did wrong and we will try not to repeat it. As long as mathematics does not condemn us, we cannot fail to aim for direct qualification: every match must be fought for, we are not thinking about the playoffs or the fact that we could be favored because we have already played them in recent editions.'\n© ALL RIGHTS RESERVED\nThis article is automatically translated",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:52:49.026408",
  "_text_extracted": true
}