{
  "article_id": "781e91c2ae1c",
  "url": "https://www.teamtalk.com/manchester-city/nico-gonzalez-rodri-replacement-manchester-city-transfer-deal-done-porto",
  "title": "Man City transfers : Nico Gonzalez joins as Rodri replacement with terms of deal revealed",
  "date": "20250204T021500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City sign Nico Gonzalez as Rodri replacement with terms of deal revealed\nManchester City have announced the signing of Nico Gonzalez from FC Porto as manager Pep Guardiola has finally found a suitable replacement for Rodri.\nRodri suffered an anterior cruciate ligament injury when Man City faced Arsenal at the Etihad Stadium in September. The Spain international defensive midfielder has been on the sidelines since, and his absence has been badly felt by the defending Premier League champions.\nMan City are two points behind Chelsea in fifth place in the Premier League table and are not going to beat Liverpool or Arsenal to the title this season.\nGuardiola’s side were also hugely disappointing in the League Stage of the Champions League and face a playoff tie against defending European champions Real Madrid to progress to the Round of 16.\nMan City manager Guardiola identified Gonzalez as the player to fill in the hole left by Rodri’s absence, and the club has now officially announced a deal with Porto.\nGonzalez has put pen to paper on a four-and-a-half-year contract that will keep him at the Etihad Stadium until 2029.\nThe Cityzens have not revealed the transfer fee they have paid to Porto to secure the services of the 23-year-old, but Fabrizio Romano has claimed that the Premier League giants have paid his release clause of €60m (£49.8m, $61.5m) but with a different structure.\nGonzalez came through Barcelona’s youth system before breaking into the first team.\nBarcelona sold the La Masia graduate to Porto in the summer of 2023 after a loan spell at Valencia.\nREAD MORE ➡️ All the done deals by Premier League clubs in the January 2025 transfer window\nMan City move ‘perfect’ for Nico Gonzalez\nGonzalez is Man City’s fourth signing of the winter transfer window after Abdukodir Khusanov, Vitor Reis and Omar Marmoush, and he is over the moon to be part of Guardiola’s squad.\nThe youngster told City’s official website: “This is the perfect opportunity for me at this stage of my career.\n“I am 23 and I want to test myself in England. There’s no better club than Manchester City for me to do that.\n“Look at the squad they have here. It’s unbelievable, full of world-class players. There isn’t a footballer in the world who would not want to be part of this set-up.\n“I know the reputation Pep has and I cannot wait to work with him. In fact, I am honoured he wants me to play in his team.\n“I am truly excited. I just want to meet my teammates, and the staff here and then I want to play in front of the City fans!”\nDirector of Football Txiki Begiristain added: “Nico is a very talented young midfielder. He is an ideal acquisition for Manchester City.\n“It was a difficult transfer to complete because his performances this season have been outstanding and he has been such an important part of what FC Porto are doing. We are really happy we have managed to get this done before the window closed.\n“He is ready to help us in the second half of the season as we compete in the Premier League, Champions League, FA Cup and Club World Cup.”\nLatest Man City news: O’Reilly stance, Doku decision\nThere had been reports that Chelsea were keen on Man City midfielder Nico O’Reilly.\nThe Blues had been looking to sign a new midfielder on transfer deadline day and reportedly showed late interest in O’Reilly.\nHowever, Man City were adamant that they did not want to lose the 19-year-old England Under-20 international.\nAnother player who is staying at Man City at least until the end of the season is Jeremy Doku.\nThere were rumours in Spain that the Belgium international winger had been offered to Barcelona.\nDoku is reportedly not happy that he is not getting regular playing time at Man City this season and was ready to move to Barcelona on a loan deal.\nHowever, the winger’s agent dismissed that speculation, and the player will now stay at the Etihad Stadium for a few more months at least.\nMan City had been linked with Sergi Altimira as well in the transfer window, but the Real Betis defensive midfielder is staying put at the Spanish club.\nWolves were also reportedly interested in the 23-year-old, who has a release clause of €40m (£33.4m, $41.5m) in his contract.",
  "word_count": 738,
  "scraped_at": "2026-02-14T02:02:19.841462",
  "_text_extracted": true
}