{
  "article_id": "782e61f35166",
  "url": "https://punchng.com/epl-haalands-late-penalty-earns-city-rare-anfield-win/",
  "title": "Haaland penalty earns Man City dramatic win at Liverpool",
  "date": "20260208T211500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Erling Haaland’s stoppage-time penalty earned Manchester City a dramatic 2-1 win at Liverpool on Sunday to reduce Arsenal’s lead at the top of the Premier League back to six points.\nCity were heading for defeat at Anfield with six minutes to go before Bernardo Silva cancelled out Dominik Szoboszlai’s stunning free-kick to spark an incredible finale.\nHaaland put City in front from the spot before the visitors had another goal ruled out, and Szoboszlai was sent off in the same incident after a VAR review.\nVictory was City’s first away to Liverpool in front of a crowd since 2003 and reapplies some pressure to Arsenal’s quest for a first title in 22 years.\nDefeat delivered another blow to Liverpool’s hopes of Champions League football next season.\nThe defending champions remain down in sixth and four points adrift of the top five.\nThese two clubs have combined to win the last eight Premier League titles, but both showed the flaws which have opened the door for Arsenal to potentially end their long wait to be crowned champions of England once again.\nHaaland has scored just once from open play in his last 13 games and an uncharacteristic lack of confidence from the Norwegian showed with the best chance of the first half inside the opening two minutes.\nSilva’s clever pass split the Liverpool defence, but Haaland’s shot lacked conviction under pressure from Milos Kerkez, and Alisson Becker was able to save low to his left.\nHaaland hooked another effort straight at Alisson among 10 first half City attempts without a breakthrough.\n– Guehi booed –\nSecond half slumps have been a consistent feature of City’s season and the visitors again faded in the second period until a late flurry saved their title challenge.\nHugo Ekitike should have opened the scoring when he completely miscued his header just before the hour mark after a lightning fast Liverpool break.\nMarc Guehi was relentlessly booed after his proposed move to Liverpool from Crystal Palace broke down on transfer deadline day in September.\nCity took advantage to swoop in last month when they lost two key centre-backs to injury.\nGuehi was fortunate to escape with just a yellow card when he dragged down Mo Salah just outside the box.\nBut it was City who were left fuming at the award of the free-kick which led to the opener when Ryan Gravenberch went down under minimal contact.\nSzoboszlai scored the only goal with an outrageous free-kick when Arsenal visited Anfield in August and produced another stunning strike which clipped the inside of the post before finding the net.\nHowever, the Hungarian went from hero to villain when City levelled six minutes from time.\nSzoboszlai played Silva onside as he slid in to volley home Haaland’s header for City’s first second half goal in the Premier League this year.\nAlisson then wiped out Matheus Nunes to concede a penalty and Haaland kept his cool from the spot to put City in front.\nPep Guardiola’s men still needed a stunning save from Gianluigi Donnarumma to tip behind Alexis Mac Allister’s deflected shot.\nWith Alisson remaining forward from the resulting corner, the Liverpool goal was open when Rayan Cherki took aim from the halfway line to roll the ball into an empty net.\nHowever, Haaland and Szoboszlai’s grappling as the ball trickled towards the goal saw the strike ruled out, with a free-kick awarded to City instead, and the Liverpool player given his marching orders.\nAFP",
  "word_count": 577,
  "scraped_at": "2026-02-14T01:53:15.564231",
  "_text_extracted": true
}