{
  "article_id": "783d877babce",
  "url": "https://www.caughtoffside.com/2024/03/09/liverpool-optimism-haaland-happy/",
  "title": "Liverpool optimistic over Edwards , Haaland happy at Man City",
  "date": "20240309T200000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article was originally published on Fabrizio Romano’s Daily Briefing, a subscription service. If you would like to receive Fabrizio Romano’s exclusive articles via email ahead of publication on caughtoffside.com, please sign-up for the service here: thedailybriefing.io\n—\nLiverpool optimistic on Edwards as they prepare for epic City encounter\nMarch is a crucial month as FSG want a final answer as soon as possible. Conversations are ongoing and Liverpool are optimistic but it’s not done yet at this stage.\nIn case Edwards accepts, I can also see Richard Hughes being part of the new Liverpool structure.\nThe match on Sunday against Man City will be a fantastic game, I’m sure. Two incredible managers, two incredible teams, many stars.\nI think it will be an open game, could be a draw at the end, but Anfield will be pushing in a special way.\nI can’t wait for this one.\nHaaland happy at City but won’t guarantee long-term stay\n“This is going to be a big headline. You can report that one but you should make sure also that all the other things I say in the press conference are reported too. I’m very happy at Manchester City but you never know what happens tomorrow.”\nThat line is quite clear guys. I think what we’ve heard Haaland say there is certainly really honest, and it’s the reality at the moment.\nIt’s difficult for him to sit in on a press conference and promise he will play for Manchester City for his entire life. He certainly can’t guarantee that so I think it’s really fair to mention that sentence.\nThe atmosphere in the dressing room has always been amazing between him and all the other stars.\nThings can still happen in the future but at the moment there is nothing ongoing in terms of discussions, nothing ongoing in terms of negotiations, but in the future – and it could be years – Erling Haaland could be part of the transfer market again.\nNewcastle pushing hard for Joelinton agreement\nNewcastle’s contract strategy over the next few months is going to be crucial.\nFor Joelinton, the proposal is on the table and they want to push hard to keep him as he’s considered an important part of the squad.\nThen, Newcastle will discuss their summer plans around May, as soon as they know what’s happening with regards to European football.\nNo confirmation on €150m Leão bid from City\nHonestly I’ve zero information on the story linking Man City with a €150m move for Milan’s Rafael Leão guys.\nAbsolutely no confirmation on any side, no talks taking place, no bid being prepared in March for sure.\nZero.\nThe situation is quiet at this stage. We will see what happens in the summer with City plans in general but for Leão, it’s quiet now.\nNot the right time for Lukaku to make plans\nWe still don’t know Chelsea’s plans, whether AS Roma can afford him with their Financial Fair Play strategy based on Champions League football or not…\nLukaku can only wait now and focus on helping Roma do special things in Italy and in Europe.\nThat’s why he wanted to stay silent in TV interviews after the Europa League win over Brighton.\nDon’t be too hard on De Zerbi\nHe has a release clause valid in the summer so we will have to wait and see on that one.\nAfter the 4-0 loss to Roma, it’s easy to criticise him. It was a very bad game… but we should also remind ourselves what he did to bring Brighton to these European nights.\nSometimes football is too ‘fast’ and people forget about the hard work that’s been done for years.\nPSG haven’t demanded Mbappé be benched\nMany of you are asking me recently why Luis Enrique decided to sub Kylian Mbappé, and whether it had anything to do with Real Madrid.\nThe answer is that, from what I’m told, the president of the club didn’t tell Luis Enrique to sub the player or that ‘we don’t want him to play.’ That is not the message coming directly from the club.\nLuis Enrique himself, as he’s also confirmed in public, wants to try other things. Something new and different, especially in Ligue Un.\nSaudi interest in Casemiro remains\nThey were interested in the midfielder last summer, and then again around October/November some calls were made to intermediaries to understand the situation.\nIt’s important to mention that there was never a concrete proposal put to Manchester United.\nLet’s see what will happen with Casemiro in the next months, but interest from Saudi is still there so let’s see if they will return with a proposal.",
  "word_count": 776,
  "scraped_at": "2026-02-14T01:48:46.207339",
  "_text_extracted": true
}