{
  "article_id": "7858ebd4f58d",
  "url": "https://www.themag.co.uk/2023/09/change-of-tactics-maybe-needed-for-the-match-against-psg-substituting-jupiler-for-duvel-ac-milan-0-newcastle-0-newcastle-united/",
  "title": "Change of tactics maybe needed for the match against PSG - Substituting Jupiler for Duvel",
  "date": "20230921T091500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Change of tactics maybe needed for the match against PSG – Substituting Jupiler for Duvel\nAfter having spent Saturday evening shouting at the television in the company of some old (Newcastle United) friends who now reside in East Anglia, and having spent the whole weekend talking about football, food, music, politics, travel and generally putting the world to rights while partaking in the occasional hop and malt based refreshment… I felt mentally prepared to confront AC Milan.\nOr anyone.\nWe have nothing to lose.\nWe are the underdogs with no recent European pedigree to live up to. In fact, our manager hadn’t even been to a Champions League match… until Tuesday!\nWe are the project that got way ahead of schedule.\nEveryone expects us to fail and we most likely will.\nI certainly don’t delude myself that we can go all the way but it would be nice to get out of the group, or at least finish third, so that the European adventure could continue a little bit longer, albeit in a different competition.\nIt would be nice to stick it to all of the naysayers: but all I have ever expected, is that the team tries and does the best that they possibly can.\nHaving now spent my first Champions League evening (in recent memory) shouting at the television, this time powered by my trusty Raspberry Pi, and hoping for a performance, I wasn’t disappointed.\n(Thanks to David Jonson for the video)\nThings could have worked out differently had our last (only) shot on target not been hit so close to the substitute keeper, that he was the hero of the day and not Sean Longstaff .\nTrippier was magnificent and seemed to always be in the right place at the right time.\nThe defence did their work but I still had the feeling that the midfield were not fully at the races.\nIsak had to spend too much time running back to collect the ball, so much so that later when he was moved out to the left he didn’t have the energy to track back and surrendered possession too easily.\nThere were times last season when you wondered, had everyone left their shooting boots at home? Decision making in the final third was also at times a problem. These things will be put right in time as Eddie finds the way to get the best out of his current squad. That hasn’t happened as yet and has been evident since the start of this season. And Tuesday night was another step on that journey. So far, our Champions League learning curve has not yet proved to be painful.\nI know everyone has their own opinion and no two people seem to watch the same match! However, I have seen some ridiculous things on social media in the aftermath of AC Milan 0 Newcastle 0.\nIt was a hot night in Milan and at the end of the game the players looked totally knackered.\nThey tried.\nHow can anyone complain about that.\nThat was after all what we where crying out for during all those years in the football wilderness: a team that tried.\nWe came away from Milan with a hard fought point but it wasn’t pretty or exciting… or at least not exciting in an enjoyable way.\nHowever, what did people really expect: that we were going to storm into the San Siro and run off with all three points?\nThis was a much worse result for AC Milan than it was for us.\nWe should be pleased with the progress we have made so far, with largely the same squad that were fighting relegation.\nClearly there were a lot of tired legs and bodies out there at the end of our first away jaunt in Europe. It will be interesting to see how Eddie rotates the squad at the weekend and how he sets up against PSG at home.\nIt will also be interesting to see if Eddie uses zonal marking at set pieces again, correct me if I am wrong but I don’t think he has used this previously in his time in Newcastle.\nI am also thinking about changing tactics for the match against PSG by substituting the Jupiler for Duvel. Hopefully that does the trick!\nHoway the Toon.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 731,
  "scraped_at": "2026-02-14T01:54:03.039087",
  "_text_extracted": true
}