{
  "article_id": "78726861ad51",
  "url": "https://www.fourfourtwo.com/news/cristiano-ronaldo-reveals-sensational-barcelona-transfer-talks",
  "title": "Cristiano Ronaldo reveals sensational Barcelona transfer talks",
  "date": "20250207T133000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nIt’s difficult to imagine Cristiano Ronaldo in a Barcelona shirt but it might have been closer to reality than we think.\nRonaldo, who turned 40 this week and is still rattling in the goals in the Saudi Pro League, might have played alongside Lionel Messi instead of against him. Football and the internet would have been very different places.\nThe five-time Ballon d’Or winner followed his success at Manchester United with a glittering Real Madrid career in which he won La Liga twice and the Champions League four times but has revealed that he could have been pushing for titles on the other side of Spanish football’s great divide.\nCristiano Ronaldo makes Barcelona talks claim\n“I remember meeting with someone from Barcelona who wanted to sign me but it didn’t happen,” said Ronaldo in an interview with Spanish sports journalist Eduardo Aguirre.\nRonaldo was a teenager at Sporting CP at the time and there was, of course, interest from the Premier League too.\n“Maybe they wanted to sign me, but that would have been for the next year. Then a club like Manchester United came along and signed me straight away. You know how quickly things can happen in football,” he continued.\nRonaldo, who is ranked at no.4 in FourFourTwo’s list of the greatest players of all time, won everything there is to win at Manchester United before his blockbuster move to the Bernabeu in 2009. He later played for Juventus, United again and Al Nassr, as well as winning the European Championship with Portugal in 2016.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nWe’ll never know how many of those titles might have taken a different path if Ronaldo had held on for a Barcelona move in the early days, but the Saudi Pro League’s star attraction thinks it would have been great. Of course he does.\n“I think my future as a player would have been very similar,” said the Galactico. “Of course Madrid is Madrid. I say my future as a player would have been very similar. But obviously Madrid is the biggest club in the world.”\nDespite his apparent disregard for chaos theory, Ronaldo probably isn’t far off the mark. He’s been lauded throughout his career for his unparalleled focus on his profession, working hard to improve and becoming notoriously intolerant of imperfection.\nThat’s the sort of mindset that takes footballers to the top of their game and, in this case, allows Ronaldo to score a goal per game at 40 years of age.\nBarcelona collected silverware for fun even without the Portugal captain, riding the Messi train to title after title under Pep Guardiola and beyond, but one suspects the ability to sell Ronaldo at some point might have helped them ease their perpetual financial challenges.\nChris is a Warwickshire-based freelance writer, Editor-in-Chief of AVillaFan.com, author of the High Protein Beef Paste football newsletter and owner of Aston Villa Review. He supports Northern Premier League Midlands Division club Coventry Sphinx.",
  "word_count": 612,
  "scraped_at": "2026-02-14T01:52:15.344873",
  "_text_extracted": true
}