{
  "article_id": "787ea12d33a1",
  "url": "https://www.cafonline.com/caf-womens-champions-league/news/ampem-darkoa-carry-weight-of-ghanas-hopes-on-caf-women-s-champions-league-debut/",
  "title": "Ampem Darkoa carry weight of Ghana hopes on CAF Women Champions League debut",
  "date": "20231026T233000Z",
  "domain": "cafonline.com",
  "source_country": "Egypt",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ampem Darkoa carry weight of Ghana's hopes on CAF Women’s Champions League debut\nWhen the 2023 CAF Women's Champions League kicks off in Cote d'Ivoire next month, Ghanaian club Ampem Darkoa Ladies will carry the weight of a nation's expectations on their continental debut.\nThe tournament, now in its third edition, is set to take place from November 5th to 19th, and they have raised the hopes of the nation as they aim to revive Ghana's fortunes on the continental stage.\nThat is because in the maiden edition of the tournament Hasaacas, a Ghanaian side, reached the final, losing 2-0 in the final game to South Africa club Mamelodi Sundowns.\nLast year Ampem Darkoa Ladies disappointed the nation when they failed to qualify for the tournament after losing the final of the regional qualifying competition against Nigerian side Bayelsa Queens.\nThey fought back 12 months later and qualified by winning the WAFU Zone B tournament in August, seeing off Nigerian champions Delta Queens 1-0 in the final.\nTheir journey to this illustrious tournament was no easy feat, built on earlier victories over Togo's Amis Du Monde, Ivorian side Athletico Abidjan and Sam Nelly FC of Benin as they blitzed the regional qualifying event.\nWhile the final was settled by Ophelia Serwaa's composed 43rd-minute strike, their free-flowing earlier matches demonstrated Ampem Darkoa's attacking talent.\nMary Amponsah underlined her eye for goal by finishing as the tournament's top scorer with eight strikes, making her one of the players to look out for in Cote d'Ivoire.\nDrawn in Group B alongside holders AS FAR Rabat of Morocco, Huracanes of Equatorial Guinea and AS Mande of Mali, Darkoa face a stern test but Amponsah is confident of their chances.\n“We are not afraid of any team, especially AS FAR, because most of their players are part of their national teams and so are we. We just have to listen to our coaches and stick to their orders,” Amponsah said.\n“We know that expectations are high and the pressure to win is also there but as players we have psyched ourselves to overcome the pressure by going as far as possible and winning the trophy.”\nHead Coach, Nana Joe Adarkwa, is also poised insisting that they can overcome their tough opponents in Group B of the competition\n“AS FAR are not bigger than any other team. Every team from each country is a champion, and so are we, so we can face them squarely. It all depends on how we approach each game,” coach Adarkwa said.\n“If we are able to win at least two games, we can qualify from the group and we will make sure to prevent AS FAR from scoring any goal against us,” he added.\nWith women's football rapidly rising across West Africa, the Ghanaians have a chance to further spur its growth with a strong CAF Women’s Champions League performance and possibly do better than Hasaacas did in the maiden competition.\nA historic first Ghanaian victor would undoubtedly accelerate surging participation and interest levels back home.",
  "word_count": 506,
  "scraped_at": "2026-02-14T02:10:28.699647",
  "_text_extracted": true
}