{
  "article_id": "78f3de4eba2b",
  "url": "https://www.dailymail.co.uk/news/article-13962361/england-manager-thomas-tuchel-claims-chelsea-club-fallouts.html",
  "title": "List of the fiery claims about England new manager Thomas Tuchel : From secret  eye - watering  reason he left Chelsea to fallouts at the clubs he has left ... so is he REALLY worth the hassle as next England boss ? ",
  "date": "20241015T210000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "List of the fiery claims about England's new manager Thomas Tuchel: From secret 'eye-watering' reason he left Chelsea to fallouts at the clubs he has left... so is he REALLY worth the hassle as next England boss?\n- Follow Mail Sport's live blog of all the updates after Tuchel agreed to take the job\nThomas Tuchel has signed a deal to become the England's new manager, and will permanently replace Gareth Southgate as the Three Lions boss.\nThe 52-year-old was reportedly keen to take over at Wembley following the end of Southgate's eight-year reign as national coach after Lee Carsley made a hash of being in temporary charge.\nAside from a poor last season at Bayern Munich, Tuchel's football acumen is largely unquestioned especially after steering Chelsea to the Champions League when the club was in near-turmoil in 2021.\nThe fact he knows English football from his time at Stamford Bridge and worked closely with captain Harry Kane at Bayern Munich last season is clearly appealing to the Football Association.\nBut there are questions about combustible Tuchel rarely staying in a job longer than two years, and his history of leaving teams under a cloud. And off the pitch is where some of Tuchel's baggage begins to really pile up.\nThomas Tuchel, pictured with new younger girlfriend Natalie Max this summer, is said to have had his private life gossiped about by Chelsea players in his downfall at the club\nIn April 2022 Tuchel and his now ex-wife Sissi (pictured together) announced they would be getting a divorce\nTuchel and his wife - pictured after the Champions League final win in 2021 - had been married for 13 years and have two children but decided to part ways\nTuchel's private life was a dressing room hot topic in his final days at Stamford Bridge in 2022 - with players discussing his failed marriage and his new girlfriend Natalie Guerriero Max.\nThe German manager was said to have lost the confidence of the Chelsea squad due to his difficult characteristics and erratic behaviour - while his private life was also a topic of dressing room gossip - according to The Independent at the time.\nWhile many Chelsea fans were dismayed at the decision to get rid of him, talkSPORT broadcaster and Mail Sport columnist Simon Jordan revealed he would also have sacked him.\n'There's a lot more behind the scenes of Tuchel that would make most people's eyes water as to the reasons why Todd Boehly made that decision and it wasn't just a case of losing to Dinamo Zagreb, it was case of a whole raft of other things - that's Todd Boehly's gift to tell people what that is,' Jordan said on talkSPORT at the time.\n'But it opened my eyes and I would've done exactly the same thing as Todd Boehly did which is \"you can go mate\".'\nIf the FA can afford him, Tuchel continues to be regarded as one of the elite managers in world football, a top tier coach that has won the biggest honours in Europe.\nHe is untested at international level - and in Spain or Italy - but has enjoyed success in Germany, France and England.\nTuchel's private life was said to be contributing factor to his dismissal as it changed the players perception of him.\nTuchel left Chelsea under a cloud with talkSPORT presenter and Mail Sport columnist Simon Jordan claiming that the reasons 'would make people's eyes water'\nThomas Tuchel is reportedly in talks with the FA about becoming England's next manager\nIn April 2022 Tuchel and his wife Sissi announced they would be getting a divorce after 13 years of marriage. Friends of the couple said that they had 'exhausted all avenues' and that there was no hope of a reconciliation.\nAs a result, the couple filed for divorce and parted ways officially in May after a judge at London's High Court accepted their request.\nIt didn't take Tuchel long to get over his marriage as he was pictured with his new Brazilian girlfriend, Natalie Max, on July 28. The pair were seen relaxing on boat in Sardinia before heading back to their £20,000-a-night private villa.\nHaving earned his stripes as an up-and-coming manager at Mainz, he headed for Dortmund but that would eventually sour.\nAt Dortmund there was a total breakdown in relations, reports at the time stated, to the point where ESPN described it as: 'A toxic mix of mistrust and communication failure has led to a point of no return. Tuchel has burnt too many bridges at the club, where leadership, players and employees have turned against him.'\nIntensity has a shelf life and that has always felt appropriate when it comes to Tuchel.\nAt PSG he routinely butted heads with sporting director Leonardo, who at one point appeared to publicly go to war against his manager: 'I didn't like Tuchel's statements, neither did the club.'\nThe two of them clashed over transfer policy, whereas at Chelsea Tuchel was irked by the amount of work he was tasked with when it came to recruitment. At Bayern Munich he was given limited influence on building the squad, which is also said to have upset him.\nTodd Boehly, freshly arrived at Chelsea, afforded Tuchel more influence on recruitment than any of his predecessors, who had worked under Roman Abramovich.\nHe delivered Borussia Dortmund's first trophy in five years with the DFB Pokal back in 2017, while he won the Ligue 1 title in his first season at PSG before following that up with a domestic Treble and a Champions League final appearance in his second season.\nThomas Tuchel, 51, has signed a deal to become the next England manager and is the first non-English boss of the men's national side since 2012\nA press conference to announce his appointment is expected to be held at Wembley tomorrow at 1.30pm, which will be attended by FA chief executive Mark Bullingham\nThe German had won the Champions League with Chelsea four months after taking over from Frank Lampard in a sign of his ability to take a dysfunctional set-up and quickly turn it into a winning machine.\nIn his first 50 matches in charge at Chelsea, Tuchel oversaw 24 clean sheets and they conceded just 24 goals as they become a model of consistency defensively. No team across Europe's top five leagues had a better record in that span.\nEven Man City boss Pep Guardiola who gushed over Tuchel's style of play back in 2022, saying: 'He's so creative, One of the few managers I learn constantly from to develop as a better manager.'\nBut Chelsea also did score fewer goals than the season before.\nWhilst he was reportedly in advanced talks with the FA about becoming England's next manager - some fans were expressed their fury that the next boss of the Three Lions could be a German.\nThe 51-year-old has been out of the game since leaving Bayern Munich at the end of last season when they failed to win the Bundesliga.\nThe German appeared to be a frontrunner as talks began regarding who would become Gareth Southgate’s long term successor.\nHe previously managed the likes of Borussia Dortmund, PSG and Chelsea, famously lifting the Champions League with the Blues in 2021 - the year he also won the award for the world's best club coach.\nThe German has an impressive CV having previously won the Champions League while manager of Chelsea\nFormer head coach of the England men's football team Gareth Southgate speaks at Labour's International Investment Summit in London yesterday\nSome England fans are unhappy with the idea of a German head coach for the national team\nBut England fans were split on whether the man to replace Gareth Southgate should be English.\nOne said: 'No thanks. Give the job to someone ENGLISH', another wrote: 'Begging a German to manage us, embarrassing!' Another said simply: 'A German managing England? Nein!' A fourth said: 'A German manager for England is just wrong'.\nBut with Eddie Howe the top English candidate happy at Newcastle, another England supporter tweeted: 'Some ambition from the FA if true. He would be ideal I think. Certainly a huge step up from Southgate and Carsley'.\nA second said: 'This is the only way England will win anything'. Many said the FA must wait for Pep Guardiola.\nSome of England's supporters welcomed the news, and urged the FA to go for the best manager available, whether that be Thomas Tuchel or Pep Guardiola, who was also reportedly approached.\nMost watched News videos\n- Extraordinary moment mass brawl breaks out between Brits on flight\n- Finance expert's TV interview interrupted by adorable granddaughter\n- Food vlogger dies after 'eating toxic devil crab'\n- Toddler opens car door in traffic and sends biker flying\n- Glamorous Olympic skating star masterfully avoids disaster\n- Astonishing moment a street is swallowed by a sinkhole\n- Spy cam shows woman on her knees next to Jeffrey Epstein\n- Moment Swiss bar fire owners collapse after being confronted\n- Leo Ross's killer unmasked: Thug who stabbed schoolboy to death named\n- Moment hi-viz thugs attack bin men in terrifying mass brawl\n- Moment driver veers to target e-bike riders before killing teen\n- Chilling police interview of ISIS fanatic plotting UK attack",
  "word_count": 1552,
  "scraped_at": "2026-02-14T01:57:46.247497",
  "_text_extracted": true
}