{
  "article_id": "78f3cf70adf7",
  "url": "https://menafn.com/1108437037/The-Five-Breakthrough-Stars-Of-Euro-2024",
  "title": "The Five Breakthrough Stars Of Euro 2024",
  "date": "20240714T173000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Five Breakthrough Stars Of Euro 2024\nBerlin: After 50 games and the exit of 22 teams, England take on three-time winners Spain in the Euro 2024 final in Berlin on Sunday.\nThe tournament has been a showcase of a talented next generation of footballers, including teenagers Lamine Yamal, Arda Guler and Kobbie Mainoo, but several under-the-radar established players have have shown their class on the European stage.\nHere are five stars who have broken through with impressive performances at Euro 2024:\nDani Olmo (Spain) Spanish starlets Yamal and Nico Williams have lit up Euro 2024 from the flanks but Dani Olmo's contributions from the middle of the park have proved crucial for the finalists.\nThe 26-year-old is well-known in Germany after four years at RB Leipzig but has made everyone else stand up and take notice of his ability with a string of excellent performances in his adopted country.\nHaving sealed Spain's 4-1 last-16 win over Georgia with a late goal, Olmo came off the bench after just eight minutes to replace the injured Pedri against Germany in the quarter finals, scoring the opener and laying on Mikel Merino's extra-time winner.\nIn Spain's semi-final with France, Olmo's 25th-minute strike would prove the winner, sending his team to their fifth Euros final.\nOlmo now has three goals, the equal most in the tournament, alongside two assists despite only starting two of Spain's six games.\nMarc Guehi (England) Playing in his first major international tournament, England's Marc Guehi quickly established himself in the middle of Gareth Southgate's miserly defensive set-up.\nJust 23, he has been calm and assured alongside John Stones in central defence, with England conceding just three goals in five games with Guehi on the park.\nWhen suspended for England's quarter-final against Switzerland, some asked how the Three Lions would replace the Crystal Palace centre-back, such is his important to the side.\nGuehi has also contributed in attack, having put in an assist for Jude Bellingham's last-gasp equaliser against Slovakia in the last 16 which saved England from an early tournament exit, keeping them on track for a maiden Euros triumph.\nCody Gakpo (Netherlands) Netherlands forward Cody Gakpo was front and centre in the Oranje's run to their first Euros semi-final in 20 years at Euro 2024, before a 2-1 defeat by England.\nThe orange shirt seems to bring the best out of the 25-year-old, whose impressive performances at the Qatar World Cup came before a big-money transfer to English giants Liverpool.\nGakpo scored the equaliser in the Netherlands' 2-1 group-stage win over Poland while his opener in the 3-0 win over last-16 opponents Romania calmed the nerves in a tense encounter.\nAn onrushing Gakpo also forced Turkey to concede a late own goal which would prove the winner for the Dutch in the quarter-finals.\nGiorgi Mamardashvili (Georgia) Napoli forward Khvicha Kvaratskhelia may have been the country's biggest name at the tournament but man mountain Giorgi Mamardashvili stood tall in Georgia's run to the last 16.\nA centimetre shy of being two metres in height, Mamardashvili's presence between the sticks was calming for the burgeoning football nation in their first ever Euros appearance.\nThe 23-year-old goalkeeper made 30 saves in four matches, the second-most in Euros history after Igor Akinfeev's 32 for Russia in 2008.\nMamardashvili's performances will not be a surprise to La Liga fans, with the Valencia 'keeper among the best in Spain this season.\nMarcel Sabitzer (Austria) A key part of club side Borussia Dortmund's surprise run to the Champions League final, Austria midfielder Marcel Sabitzer continued his stellar form at Euro 2024.\nAustria emerged top in a group which featured semi-finalists France and the Netherlands and were whispered to be dark horses for the competition until a surprise last-16 loss to Turkey in torrid conditions.\nThe 30-year-old scored the winner in Austria's 3-2 win over the Dutch which secured top spot, thundering the ball under the crossbar from a tight angle.\nA constant goal threat, particularly from long range, Sabitzer's boundless energy was key for Ralf Rangnick's full-throttle Austria side.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 731,
  "scraped_at": "2026-02-14T02:08:01.878110",
  "_text_extracted": true
}