{
  "article_id": "78f816b70b66",
  "url": "https://www.thenews.com.pk/print/1193980-germany-confident-they-are-euro-2024-title-contenders",
  "title": "Germany confident they are Euro 2024 title contenders",
  "date": "20240527T214500Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Germany confident they are Euro 2024 title contenders\nBLANKENHAIN: Germany’s victories over France and Netherlands in March showed the Euro 2024 hosts have every right to consider themselves among the title favourites, Germany sports director Rudi Voller said on Monday.\nAt the start of a short training camp in Thuringia before moving to their tournament basecamp in Bavaria next week, Voller told a news conference the Germans had shown signs ofreal improvement.\n“A key moment in our development was the last two (friendly) matches in March. We realised that after three and half months (under Nagelsmann) we had two convincing wins and in the inner circle there was more optimism,” Voller said.\n“Unbelievable optimism. We don’t need to go crazy that now everything works but we should have a measure of optimism,” he said, sitting next to the Germany coach. The three-times European champions have failed to make any impact in international tournaments since their 2014 World Cup win and are desperate for a strong showing in front of their own fans.\nThey crashed out in the first round of the last two World Cups and did not make it past the round of 16 in the last European Championship held in 2021. “Through those two international matches we want to be part of the group that are there until the end. We have a home tournament.\nWe should have the optimism to go very far and if it is Berlin (for the final) in the end evenbetter,” Voller said. Germany’s preliminary squad is far from complete for their first training camp with players from domestic double winners Bayer Leverkusen arriving in a few days.\nGermany internationals competing in the Champions League final for Real Madrid and Borussia Dortmund will join them next week. While Voller and German FA President Bernd Neuendorf are eying the title, coach Julian Nagelsmann said the team also wanted to pay back fans with exciting football.\nThe Germans, who open the June 14-July 14 tournament against Scotland, also face Hungary and Switzerland in Group A. They have two friendlies before the tournament, against Ukraine on June 3 and Greece on June 7.\n“We want to show football that’s fun,” Nagelsmann said. “Tickets cost money. You have to pay back with a football that is fun, that is entertaining. If we are excited we will excite the fans.” More than 15,000 are expected to watch their first open training later on Monday.\n-\nJames Van Der Beek's Final Conversation With Director Roger Avary Laid Bare: 'We Cried'\n-\nJaden Smith Walks Out Of Interview After Kanye West Question At Film Premiere\n-\nMichelle Obama Gets Candid About Spontaneous Decision At Piercings Tattoo\n-\nWhy Halle Berry Wasn't Ready For Marriage After Van Hunt Popped Question? Source\n-\nBunnie Xo Shares Raw Confession After Year-long IVF Struggle\n-\nBrooks Nader Reveals Why She Quit Fillers After Years\n-\nTravis Kelce Plays Key Role In Taylor Swift's 'Opalite' Remix\n-\nHow Jennifer Aniston's 57th Birthday Went With Boyfriend Jim Curtis\n-\nJoJo Siwa Shares Inspiring Words With Young Changemakers\n-\nJames Van Der Beek Loved Ones Breaks Silence After Fundraiser Hits $2.2M\n-\nDisney’s $336m 'Snow White' Remake Ends With $170m Box Office Loss: Report\n-\nTravis Kelce's Mom Donna Kelce Breaks Silence On His Retirement Plans\n-\nPremiere Date Of 'Spider-Noir' Featuring Nicolas Cage Announced\n-\nPedro Pascal's Sister Reveals His Reaction To Her 'The Beauty' Role\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters",
  "word_count": 594,
  "scraped_at": "2026-02-14T02:25:33.971654",
  "_text_extracted": true
}