{
  "article_id": "7910cebb8726",
  "url": "https://armenianweekly.com/2024/09/04/fc-noah-makes-history/",
  "title": "FC Noah makes history",
  "date": "20240904T204500Z",
  "domain": "armenianweekly.com",
  "source_country": "Armenia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FC Noah makes history\nFootball Club Noah, an Armenian Premier League club based out of Armavir, has made history in European football. FC Noah became the first team to enter the UEFA Conference League qualifiers in the first round and advance through all four qualifying rounds. Noah also made its debut in a major UEFA competition. Now, some historic matchups await the team formerly known as FC Artsakh.\nFC Noah earned a spot in the first round of the UEFA Conference League qualification after finishing second in the 2023-24 Armenian Premier League season. The prize for its joint-best league finish was a shot at European football, but the task at hand was daunting. Each of the four qualifying rounds would include a home and away fixture. The team with the higher aggregate score between the two legs would advance.\nEurope’s third season-long club competition began its first qualifying round on Thursday, July 11. FC Noah’s first opponent was Shkendija of North Macedonia. The tie ended with a 4-1 aggregate score in favor of Noah. The Armenian side scored late in the first leg, with an 81st minute goal from Gonçalo Gregório and a 90th minute goal from Aleksandar Milijković. The second leg saw Milijković double his European goal tally in the 20th minute, with a consolation goal from the North Macedonians in the 53rd minute and a 91st minute goal from Virgile Pinson giving Noah the comfortable first-round win.\nThe second qualifying round was even more comfortable for FC Noah. Sliema Wanderers of Malta was the opponent at hand starting July 25, and a statement win at home ended this tie before the second leg. Noah cruised to a 7-0 first leg win, which was enough for a spot in the third qualifying round (the second leg ended 0-0). Gregório tallied a hat-trick along with goals from Pinson, Eraldo Çinari and Hélder Ferreira (Noah also benefited from an own goal).\nAt this point, it was difficult to take your eyes off what Noah was achieving. The Armenian club had only played in the first round of the Conference League qualifiers during the 2021-22 season. At that time, Noah was knocked out by Finnish club KuPS with a 5-1 aggregate score. Up to this point, Noah had already pulled off more than it ever had in European club constitution qualifiers.\nThe third qualifying round put Noah up against its most historically significant club thus far this season. 13-time Greek champions AEK Athens danced with Noah in the first leg on August 6 in Armenia. Athens scored first, but Noah had a surprise beyond everyone’s imagination and expectations.\nNoah leveled the score heading into the break thanks to Virgile Pinson in the 33rd minute. The game was 1-1 until the 67th minute, when Noah’s attacking line was hovering around the halfway line. Armenian national team goalkeeper Ognjen Čančarević was sizing up what appeared to be another routine goal kick, when the ball seemed to sail higher and further than normal — so much so that it caught the opposing keeper napping and Noah’s goalkeeper scored to take a 2-1 lead.\nLet’s relive that one more time. Noah’s goalkeeper, from his own penalty box, was able to make such perfect contact with the ball that he scored his first career goal in one of his most important club games. Granted, it was a windy day, but a goalkeeper scoring from his own box is up there with the most improbable things you’ll witness on a grassy field.\nNoah ended the game with a 97th minute goal from Gonçalo Gregório, who is making a name for himself at his new club. That goal didn’t happen without another pinpoint ball from Čančarević who found the Portuguese attacker ready to pounce.\nA 3-1 aggregate scoreline was enough to advance through the third round. AEK had some late luck with a 92nd minute own goal in the second leg, but Noah benefited from a 3-2 aggregate score to face the fourth and final round of qualifying.\nAfter advancing through all three qualification rounds, Noah had to endure a two-leg playoff against MFK Ružomberok of Slovakia to earn a spot among 36 teams in the League phase. The first leg of the playoff took place on August 20 in Armenia — and once more, Noah punched above its weight.\nThe home team wasted next to no time, as Gonçalo Gregório scored his sixth goal of the UEFA Conference League in just the third minute. At the time of writing this article, Gregório is the top goalscorer in this year’s Conference League. The second half was more of the same, as Noah doubled its lead in the 79th minute with a penalty kick courtesy of Artsakh native Gor Manvelyan. Noah capped off a monumental result with a third goal in the 92nd minute from Matheus Aias. Despite Noah coming away with a 3-0 result, a second leg awaited with more twists in Noah’s tale.\nNinety more minutes of action stood between Noah and its first group stage/league phase in European club competition. Noah traveled to Slovakia on August 29 to decide its fate, and the match was off to a bad start. The home team took complete control of the first half. After opening the game with a goal in the eighth minute, Ruzomberok sneaked in a second goal during added time. A 3-0 aggregate score for Noah turned into 3-2 with 45 minutes to play.\nThings went from bad to worse for the Armenian club. In the 69th minute, both Ognjen Čančarević and Pablo Santos received yellow cards for tackling a Ruzomberok player. There are two major issues here: the initial foul was made inside the penalty box, and Santos was already on a yellow card. Noah was relegated to 10 men, and a couple of minutes later conceded a penalty to have a 3-3 aggregate score.\nThings seemed bleak for Noah. Another goal seemed imminent for the home team. Matheus Aias was subbed into the game in the 77th minute for top-scorer Gregório as part of a double substitution. This decision by first-year head coach Rui Mota proved to be the difference in the end — well, in the 88th minute to be exact. Aias rose to the occasion and netted the deciding goal, sending FC Noah to the league phase.\nWhat’s next? FC Noah has six opponents coming up in the league phase. In total, 36 teams will compete. The top eight teams automatically advance to the round of 16. Teams that finish 9th-24th will play in a two-leg playoff to determine the final eight teams to advance.\nOn October 3rd, FC Noah will play its first league phase match against FK Mladá Boleslav at home. Mladá Boleslav is coming off a fifth place finish in the Czech First League and makes its debut in the Conference League.\nFC Noah’s first European away game will be on October 24 against SK Rapid Wien, also known as Rapid Vienna. Earning a result against the 32-time Austrian champions will prove to be an undeniably tall task; however, Die Grün-Weißen have only won two trophies since 1996.\nNoah will stay on the road for its next UEFA Conference League game, and it’s arguably the most anticipated fixture of the six-game slate — so much so, the author of this article is trying everything he can to be in London on November 7. Six-time Premier League, two-time UEFA Champions League and two-time UEFA Europa League winners Chelsea will host FC Noah. Regardless of the result, a team worth $3.13 billion will go toe-to-toe with a club that was founded only seven years ago. A win at the Bridge could send shockwaves across all of Armenian sports.\nOn November 28, Noah will be back in Armenia to host Víkingur Reykjavík. The club’s full name is Knattspyrnufélagið Víkingur, and they are seven-time Icelandic League Champions. Vikingur’s last league championship win was in 2023, and it has also won four Icelandic Cups since 2019. Like Noah, Vikingur is among 11 clubs making their debut in a major UEFA competition group or league phase.\nNoah’s final European home game will be against another heavy hitter. The most successful club in Cyprus, APOEL FC, will make the visit to Armenia on December 12. The 29-time Cypriot champions last made an appearance in European group play during the 2019-20 Europa League. APOEL was even in the Champions League as early as the 2017-18 season, matched up with Real Madrid, Borussia Dortmund and Tottenham Hotspurs.\nThe final Conference League game for FC Noah will be against TSC Bačka Topola in Serbia on December 19. Despite only finishing as a runner up in the 2022-23 Serbian SuperLiga season, Bačka Topola found itself in the group stage of the 2023-24 Europa League, only to finish last in a group with West Ham United, Olympiakos and SC Freiburg. The Serbian team lost to Maccabi Tel Aviv in the 2024-25 Europa League play-off round and thus earned a spot in the league phase of the Conference League.\nFC Noah has a massive task at hand, but it also has a shot at more history. Either way, an Armenian football club is being represented on a big stage. Armenia will host three European away games, and Noah will travel to Austria, England and Serbia in the process.",
  "word_count": 1555,
  "scraped_at": "2026-02-14T01:49:08.096053",
  "_text_extracted": true
}