{
  "article_id": "793760842e60",
  "url": "https://www.empireofthekop.com/2024/12/19/rayan-cherki-liverpool-january-transfer-latest/",
  "title": "Liverpool pushing hard  behind the scene for £25m January swoop ; may have edge on rival suitor",
  "date": "20241219T193000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The January transfer window is less than a fortnight away, and unsurprisingly there’s been an abundance of rumours doing the rounds in terms of prospective incomings at Liverpool.\nEven with the Reds flying high in the Premier League and Champions League under Arne Slot, it appears as though there’s a determination to reinforce from a position of strength, judging by the volume of players being linked with the Merseysiders.\nAmong the rumoured list of targets is a highly renonwed playmaker whose current club are embroiled in crisis away from the pitch.\nLiverpool working on potential January swoop for Rayan Cherki\nAccording to French football journalist Santi Aouna (via X), Liverpool and Paris Saint-Germain are ‘already working behind the scenes’ on a potential swoop for Lyon wizard Rayan Cherki, who ‘could experience a very hectic winter transfer window’.\nThe corresponding article for Foot Mercato, the current league leaders in England and France lead the chase for the 21-year-old’s signature and could push for a January move.\nThe Frenchman is valued at €30m (£24.8m) by his current club, who’ve been hit by a transfer ban due to enormous debts of more than £500m and are under pressure to sell players in order to raise funds.\nLiverpool might have a significant advantage over PSG in the chase for Cherki due to Lyon’s ‘frosty’ relationship with their Ligue 1 rivals.\nCherki could be an astute prospective addition for Liverpool\nThe Reds reportedly lodged an enquiry with Les Gones for the playmaker last month, so he does appear to be a player of genuine interest at Anfield.\nPrimarily playing as a number 10 but also capable of operating on either flank, Cherki has racked up five goals and seven assists in 17 appearances for Lyon so far this season, with three goal contributions for his side in an impressive Europa League win against Eintracht Frankfurt last week (Transfermarkt).\nThe gifted playmaker ranks among the top 1% of positional peers in Europe’s five main leagues over the past year for his 90-minute averages, including shots (3.1), non-penalty xG (0.3), successful take-ons (4.39), assists (0.62), shot-creating actions (7.28) and progressive carries (4.8), via FBref.\nLiverpool already have an abundance of attacking players, so the 21-year-old would be joining a hugely competitive squad if he comes to Anfield, but the above statistics suggest that he could make an immediate impact for the Premier League leaders.\nWith Lyon desperate for cash and probably keen to avoid selling Cherki to PSG, circumstances could well play into LFC’s hands if they push hard enough for the youngster.\nOf the abundance of January transfer rumours doing the rounds, this one stands out among the most exciting… and perhaps the most plausible!",
  "word_count": 449,
  "scraped_at": "2026-02-14T01:52:10.151853",
  "_text_extracted": true
}