{
  "article_id": "798fb53f7e9e",
  "url": "https://www.90min.com/barcelona-target-snubbed-real-madrid",
  "title": "Barcelona target snubbed by rivals Real Madrid",
  "date": "20250411T140000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona target snubbed by rivals Real Madrid\n- Real Madrid in the market to sign new centre-back in the summer\n- William Saliba one of the Champions League holders main targets\n- Barcelona pursuing Jonathan Tah but Madrid not interested despite being offered German\nReal Madrid are reported to have turned down the chance to sign Bayer Leverkusen centre-back Jonathan Tah.\nThe 29-year-old's contract at the reigning Bundesliga champions expires this summer and he's already communicated his decision to move onto pastures new.\n\"I didn't want to leave Leverkusen because I don't feel comfortable there. Quite the opposite. The love I feel for this club will never go away,\" Tah said in September 2024.\n\"A football career is short, and that's why it's always been my idea to get everything out of it that's possible, to take all the experience with me. And in the summer I just had the feeling that it was time to look at something new - right after our extremely successful last season.\"\nBayern Munich were previously in the running to sign Tah, but it's Barcelona who have been frequently linked with the 35-cap Germany international. However, despite being able to negotiate a pre-contract agreement, a deal is yet to be finalised.\nThe Athletic report that Real Madrid want to sign a centre-back this summer – news that isn't really a surprise given the extensive links to Arsenal's William Saliba. But the fact the 15-time Champions League winners have previously been offered, and rejected, Tah is a new development.\nInstead, Madrid's focus is on Saliba, though a deal isn't expected to be struck this summer, and Bournemouth's Dean Huijsen. The talented Spaniard has a £50m release clause but a switch is complicated because he's wanted by a string of Premier League clubs.\nHuijsen would represent an option for now and for the future – he's almost ten years younger than Tah – but it's thought that Madrid chiefs are not ruling out the possibility of signing a player who could immediately perform. The only factor in play is that Madrid don't want to overpay for somebody of this profile.\nMadrid's desire to reinforce has stemmed from Eder Militao's second ACL injury in the space of two years, as well as David Alaba's prolonged absence from the side.\nAny arrival could be joined by Liverpool's Trent Alexander-Arnold, with a proposed free transfer to the Santiago Bernabeu looking increasingly likely to happen.\nEven though Madrid's interest never materialised, Barcelona's pursuit of Tah has taken a sharp dip in recent weeks. The Catalans told the defender's agent Pini Zahavi that they currently can't afford to offer his client a contract given La Liga's financial restrictions, according to SPORT.\nFollowing the rebuttal of Barcelona's VIP seating deal, the club no longer fall within the division's strict budgetary limitations and so have to either secure more funding or offload members of their existing squad before they can think about bringing in any new recruits.\nTah is described as being \"extremely excited\" to sign for Barcelona, but is wary of falling into the same contractual limbo as Dani Olmo this season. Madrid's disinterest in Tah is far from universal. Both Liverpool and Tottenham have been linked with the soon-to-be free agent whose future is very much undecided.",
  "word_count": 546,
  "scraped_at": "2026-02-14T02:02:35.583426",
  "_text_extracted": true
}