{
  "article_id": "79931f765d7f",
  "url": "https://www.nytimes.com/athletic/6801078/2025/11/24/premier-league-players-afcon-africa-cup-nations/",
  "title": "Which Premier League players could be heading to AFCON in December ? ",
  "date": "20251124T060000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The good news: some of the world’s best players will be congregating in Morocco in December and January to take part in what’s expected to be another thrilling instalment of the biennial Africa Cup of Nations (AFCON). The bad news: at least for some Premier League clubs, this means some of the division’s biggest talents will be missing games for them.\nAdvertisement\nThe 24-team tournament begins with the host nation playing Comoros at the 69,500-capacity Prince Moulay Abdellah Stadium in capital city Rabat on Sunday, December 21, and ends with the final at the same venue on January 18, also a Sunday. Players selected in their country’s AFCON squad will miss at least three rounds of Premier League fixtures, with any fortunate enough to be involved in the final likely to miss as many as six.\nThe Athletic’s team of writers assess how each of the 20 clubs could be affected…\nArsenal\nPlayers who could potentially play at AFCON: None\nFixtures they could miss: N/A\nHow big will the impact be? Arsenal are one of just three Premier League teams without a player from one of the AFCON nations in their first-team squad. For a club with such a rich history of African representation, that’s highly unusual. Arsene Wenger was a prolific recruiter of African talent, and the likes of Nwankwo Kanu, Kolo Toure and Pierre-Emerick Aubameyang made an enormous impact in the red and white half of north London. The decision to allow midfielder Thomas Partey’s contract to expire last summer, however, leaves Arsenal without any African players in their senior ranks. The fact they won’t lose any key players to AFCON could be a benefit to their ongoing title challenge.\nJames McNicholas\nAston Villa\nPlayers who could potentially play at AFCON: Evann Guessand (Ivory Coast)\nFixtures he could miss: Manchester United (H), Chelsea (A), Arsenal (A), Nottingham Forest (H), Crystal Palace (A), FA Cup third round tie, Everton (H)\nHow big will the impact be? Guessand has been a mixed bag since joining in the summer from Nice. He has, however, earned the trust of manager Unai Emery in starting big matches from the right (Villa are without a traditional winger), with his pace and directness, if not finesse, offering an alternative to the squad’s cluster of No 10s. Villa appreciate his versatility in operating across the forward line, so from that slant, they will be without the same level of depth, especially off the right side.\nAdvertisement\nThe 24-year-old is yet to score in the Premier League but has in the Europa League, where Emery often rotates. Missing a busy and challenging Christmas period, during which Villa face Manchester United, Chelsea and Arsenal, is not ideal, with a greater onus on Donyell Malen to feature more regularly, given he is their closest replacement stylistically.\nJacob Tanswell\nBournemouth\nPlayers who could potentially play at AFCON: Amine Adli (Morocco)\nFixtures they could miss: Burnley (H), Chelsea (A), Arsenal (H), Tottenham Hotspur (H), FA Cup third round tie, Brighton & Hove Albion (A)\nHow big will the impact be? Not too big. Adli has featured for just 247 league minutes this season, starting only once, after a summer move from Bayer Leverkusen worth €29million (£25.5m/$33.4m at the current rates). Antoine Semenyo, who has six goals and three assists in 11 league matches, would have been a bigger miss but will remain with the team after Ghana finished bottom of their qualifying group.\nAnantaajith Raghuraman\nBrentford\nPlayers who could potentially play at AFCON: Frank Onyeka (Nigeria), Dango Ouattara (Burkina Faso)\nFixtures they could miss: Wolverhampton Wanderers (A), Bournemouth (H), Tottenham Hotspur (A), Everton (A), Sunderland (H), FA Cup third round tie, potential Carabao Cup semi-final first leg, Chelsea (A)\nHow big will the impact be? Nigeria have a better chance of reaching the latter stages of the competition than Burkina Faso, if they can sort their act out after failing to qualify for next year’s World Cup just over a week ago, but Onyeka has not started a single league game for Brentford this season. The 27-year-old midfielder has only made six substitute appearances, so will not be hugely missed by the west London side.\nBrentford might struggle without Ouattara, though. The winger has played in 11 of their league games this season and scored crucial goals in the wins against Aston Villa and Liverpool. The 23-year-old has been electric on the right since he joined from Bournemouth in the summer for a club-record fee of an initial £37million plus £5m in potential add-ons.\nAdvertisement\nThe only other Brentford player to keep an eye on is Benjamin Fredrick. The 20-year-old defender is on loan with Belgian side Dender. He made his debut for Nigeria in their Unity Cup fixture against Jamaica at Brentford’s stadium in May and head coach Eric Chelle has started him in all six competitive games since.\nJay Harris\nBrighton & Hove Albion\nPlayers who could potentially play at AFCON: Carlos Baleba (Cameroon)\nFixtures he could miss: Sunderland (H), Arsenal (A), West Ham United (A), Burnley (H), Manchester City (A), FA Cup third round tie, Bournemouth (H)\nHow big will the impact be? Considerable, if we were talking about the 2024-25 version of Baleba. But the central midfielder has not looked the same player so far this season. Seemingly distracted by Manchester United’s interest in signing him over the summer, the form of the 21-year-old has been patchy at best. Hooked at half-time by Fabian Hurzeler in three of the first seven league games, he finally completed 90 minutes in the top flight in the 3-0 home win against Leeds on November 2, only to be replaced at half-time again in Saturday’s 2-1 defeat of visitors Brentford after conceding a penalty.\nHurzeler has plenty of midfield options, but peak Baleba would be a miss for those tough assignments at the Emirates and the Etihad. Of greater concern, based on form this season, would have been the loss of winger Yankuba Minteh, but Gambia did not qualify.\nAndy Naylor\nBurnley\nPlayers who could potentially play at AFCON: Axel Tuanzebe (DR Congo), Hannibal Mejbri (Tunisia), Lyle Foster (South Africa)\nFixtures they could miss: Bournemouth (A), Everton (H), Newcastle United (H), Brighton & Hove Albion (A), Manchester United (H), FA Cup third round tie, Liverpool (A)\nHow big will the impact be? All three of the players Burnley expect to lose to AFCON have played a role in Scott Parker’s team this season. The only current starter they are set to lose, though, is Tuanzebe, who has partnered Maxime Esteve in the centre of defence since returning to full fitness at the start of October. Burnley have more frequently used a back four with Tuanzebe in the team, but it remains to be seen if Parker feels he has to return to a back five based on his alternative centre-back options available.\nAdvertisement\nFoster began the campaign as the first choice No 9, leading the line well. He dropped out of the side due to injury and his replacement, Zian Flemming, scored three goals in three games leading into the most recent international break. Foster has been used off the bench and scored the late winner against Wolverhampton Wanderers on October 26.\nHannibal is another who started the season in the team but has since dropped down to the bench. Parker has regularly used him as a substitute, with the midfielder featuring in all but one of the 12 Premier League games.\nAndy Jones\nChelsea\nPlayers who could potentially play at AFCON: None (probably)\nFixtures they could miss: N/A (probably)\nHow big will the impact be? Not very big at all, because it seems highly likely that Chelsea will not lose any players to the tournament.\nTosin Adarabioyo’s international status is murky: the 28-year-old defender represented England at several youth levels but has never made a senior appearance wearing the Three Lions and is also eligible to represent Nigeria. It would be something of a surprise if he was called up for AFCON, having never appeared for Nigeria before — but even if he was, it should not have a drastic impact on Chelsea. Enzo Maresca has rotated his centre-backs regularly this season and would still have Josh Acheampong, Trevoh Chalobah, Wesley Fofana, Jorrel Hato and Benoit Badiashile (who returned from injury against Burnley on Saturday) to call on.\nCerys Jones\nCrystal Palace\nPlayers who could potentially play at AFCON: Ismaila Sarr (Senegal), Chadi Riad (Morocco), Christantus Uche (Nigeria)\nFixtures they could miss: Leeds United (A), Arsenal (A, Carabao Cup quarter-final), Tottenham Hotspur (H), Fulham (H), Newcastle United (A), Aston Villa (H), FA Cup third round tie, potential Carabao Cup semi-final first leg, Sunderland (A)\nAdvertisement\nHow big will the impact be? Unfortunately, quite significant. Mainly due to the departure of Sarr, who has been outstanding at times this season and is a guaranteed starter when fit. He has six goals and an assist from 12 appearances across all competitions, and Palace don’t have an alternative in the No 10 role who is as direct and can play in the pocket as effectively.\nUche will be less of a miss if he makes the Nigeria squad, given his lack of minutes since a summer move from Spain’s Getafe (103 in seven appearances, with no starts), but it does further deplete Oliver Glasner’s options — the manager said after the 0-0 draw with Brighton & Hove Albion that he wanted two players signed in January.\nRiad has played just three times for Palace since signing in summer 2024 because of two serious knee injuries. He has recently returned to training with the group but is some way off a first-team appearance. If he does link up with Morocco, it will not be hugely problematic in terms of taking an option away but could make it harder for Palace to manage his recovery.\nMatt Woosnam\nEverton\nPlayers who could potentially play at AFCON: Idrissa Gueye, Iliman Ndiaye (both Senegal)\nFixtures they could miss: Arsenal (H), Burnley (A), Nottingham Forest (A), Brentford (H), Wolverhampton Wanderers (H), FA Cup third round tie, Aston Villa (A)\nHow big will the impact be? Put bluntly, massive. Ndiaye has been a standout in the Premier League this season, regularly producing moments of individual quality to change games. The 25-year-old is Everton’s top scorer with four goals and has also improved his creative output from his new position on the right. Gueye, meanwhile, remains a key figure at the heart of Everton’s midfield at the age of 36. As such, Everton could do with Senegal not progressing far in the tournament. The problem there is manager Pape Thiaw’s side are packed with quality and one of the favourites to win it.\nPatrick Boyland\nAdvertisement\nFulham\nPlayers who could potentially play at AFCON: Alex Iwobi, Calvin Bassey, Samuel Chukwueze (all Nigeria)\nFixtures they could miss: Nottingham Forest (H), West Ham United (A), Crystal Palace (A), Liverpool (H), Chelsea (H), FA Cup third round tie, potential Carabao Cup semi-final first leg, Leeds United (A)\nHow big will the impact be? Losing three first-team players for up to a month is tricky at the best of times. Worryingly for Fulham, this is not the best of times. Three points above the relegation zone and drawing on a thin squad already being tested by injuries, expect Marco Silva to call for reinforcements to be signed in January.\nIwobi and Bassey, particularly, will be sorely missed — only goalkeeper Bernd Leno has more Premier League minutes for Fulham than them since the start of last season. Even if their form has dropped slightly in the current campaign, they remain crucial figures in the dressing room, setting standards and bonding the squad.\nChukwueze has only shown flashes of his talent since joining on loan from Milan in the summer, but Silva needs all the options he can get, particularly in attacking positions.\nJustin Guthrie\nLeeds United\nPlayers who could potentially play at AFCON: None.\nFixtures they could miss: N/A.\nHow big will the impact be? Leeds will be delighted to know none of their players will be off to Morocco at a time when so many of their rivals in the bottom half of the table will be hamstrung by the tournament. When Habib Diarra (Senegal) and Noah Sadiki (DR Congo) were weighed up as transfer options in the summer, knowing they would likely miss part of the season because of AFCON would have played a factor in how keenly they were pursued.\nBeren Cross\nLiverpool\nPlayers who could potentially play at AFCON: Mohamed Salah (Egypt)\nFixtures he could miss: Tottenham Hotspur (A), Wolverhampton Wanderers (H), Leeds United (H), Fulham (A), Arsenal (A), FA Cup third round tie, Burnley (H)\nAdvertisement\nHow big will the impact be? Salah has had a difficult start to the season, with just five goals and three assists in 17 appearances for Liverpool in all competitions. Arne Slot’s side aren’t as dependent on him as they have been in previous years, with summer signing Hugo Ekitike currently their top scorer (six). However, the absence of Salah will reduce Slot’s attacking options during a gruelling period in the calendar.\nLiverpool will hope Jeremie Frimpong, currently sidelined by a hamstring injury, is fit and ready to fill the void on the right flank by the time Salah departs. Federico Chiesa is another option in that role.\nJames Pearce\nManchester City\nPlayers who could potentially play at AFCON: Omar Marmoush (Egypt), Rayan Ait-Nouri (Algeria)\nFixtures they could miss: West Ham United (H), Nottingham Forest (A), Sunderland (A), Chelsea (H), Brighton & Hove Albion (H), FA Cup third round tie, potential Carabao Cup semi-final first leg, Manchester United (A)\nHow big will the impact be? Marmoush and Ait-Nouri have played among the fewest minutes of anyone in City’s squad this season, so it is fair to say that the impact will be limited. Ait-Nouri only recently returned from an ankle injury that has disrupted his start to life in Manchester following a €37million move from Wolverhampton Wanderers this summer. Marmoush has only played 286 minutes, 16 more than Ait-Nouri, thanks to a knee issue picked up on international duty in September. Both are now available again and have been part of recent matchday squads, and their absences will be felt during AFCON, but City have already spent a chunk of this season having to do without them.\nMark Critchley\nManchester United\nPlayers who could potentially play at AFCON: Amad (Ivory Coast), Bryan Mbeumo (Cameroon), Noussair Mazraoui (Morocco)\nAdvertisement\nFixtures they could miss: Aston Villa (A), Newcastle United (H), Wolverhampton Wanderers (H), Leeds United (A), Burnley (A), FA Cup third round tie, Manchester City (H)\nHow big will the impact be? Each member of United’s AFCON trio will join their national team carrying reasonable expectations of reaching the tournament’s latter stages. There is a good chance, therefore, that Ruben Amorim will be without one of his better players until mid-January. “We have time to suffer with that,” United’s head coach said when asked in late October about losing Amad and Mbeumo. “We are going to struggle a little bit.”\nDiogo Dalot (at right wing-back) and Mason Mount (right-sided No 10) are the more straightforward replacements for his two attackers, and there is strength in depth in defence to cover for Mazraoui’s absence. United have the bodies to deputies, but perhaps not the player quality in reserve that Amorim desires.\nCarl Anka\nNewcastle United\nPlayers who could potentially play at AFCON: Yoane Wissa (DR Congo)\nFixtures he could miss: Chelsea (H), Manchester United (A), Burnley (A), Crystal Palace (H), Leeds United (H), FA Cup third round tie, potential Carabao Cup semi-final first leg, Wolverhampton Wanderers (A)\nHow big will the impact be? In one sense, it would leave Eddie Howe in precisely the same position he is already in, because Wissa is yet to make a single appearance for Newcastle since his £55million move from Brentford in the summer. A knee injury while representing DR Congo in early September has so far deprived Howe of the 29-year-old, though he should be available to make his debut imminently.\nWorryingly from a Newcastle perspective, even if he returns away to Marseille in the Champions League on Tuesday, he might then feature in a maximum of eight matches across all competitions before departing for AFCON (DR Congo’s first group game is on December 23). Given Newcastle’s lack of goals, especially in the Premier League, and the pressure that has placed on Nick Woltemade during his first season in England, the frustration of losing Wissa for up to nine games across four competitions will be significant.\nAdvertisement\nWissa was acquired as a ‘Premier League-ready’ addition who was expected to deliver goals instantly, which was the justification for Newcastle paying such a large fee, and Howe has been unable to use a striker signed with the profits from Alexander Isak’s late-summer sale.\nHowever, it is not guaranteed that Wissa will go to AFCON. Howe has refused to publicly discuss the possibility of the player asking to be omitted from the DR Congo squad for the tournament. Yet it may not be in Wissa’s best physical interests to step away from Newcastle training again, particularly considering he had a disrupted pre-season, and with World Cup qualification via the intercontinental play-offs next March being such a priority for his country.\nChris Waugh\nNottingham Forest\nPlayers who could potentially play at AFCON: Willy Boly (Ivory Coast), Ibrahim Sangare (Ivory Coast), Ola Aina, Taiwo Awoniyi (both Nigeria)\nFixtures they could miss: Fulham (A), Manchester City (H), Everton (H), Aston Villa (A), West Ham (A), FA Cup third round tie, Arsenal (H)\nHow big will the impact be? All six of the league fixtures the Forest quartet could miss are against either teams who could be considered direct rivals in the fight to avoid relegation for the Premier League or who have title/Champions League qualification aspirations.\nAina is expected to return to fitness following September’s serious hamstring injury next month, and to then be included in Forest’s Premier League squad in the second half of the season — but might not make his Forest return until late January if Nigeria make good progress in the tournament. Sangare has suggested in recent games — he scored his first Forest goal in this month’s 3-1 win against Leeds United, more than two years after signing for the club — that he could be a useful asset under new head coach Sean Dyche, and his physical presence would be missed in midfield.\nAdvertisement\nBoly remains largely a backup opinion in defence at age 34, but striker Awoniyi has also been given a fresh opportunity under Dyche and Forest will hope Chris Wood can put his own recent injury issues behind him so they are not left short of forward options during AFCON.\nPaul Taylor\nSunderland\nPlayers who could potentially play at AFCON: Noah Sidiki, Arthur Masuaku (both DR Congo), Chemsdine Talbi (Morocco), Reinildo Mandava (Mozambique), Habib Diarra (Senegal), Simon Adingra (Ivory Coast), Bertrand Traore (Burkina Faso)\nFixtures they could miss: Brighton & Hove Albion (A), Leeds United (H), Manchester City (H), Tottenham Hotspur (A), Brentford (A), FA Cup third round tie, Crystal Palace (H)\nHow big will the impact be? It is hard to imagine a Premier League team will feel an adverse impact of AFCON quite like Sunderland. It is likely seven first-team squad members will be at the tournament, and among that number are regular starters and other influential players.\nSidiki has started every league game since arriving in the summer, while only a three-game suspension stopped Mandava from being in the same bracket. The club’s £30million record signing Diarra is expected to be back fit following a groin injury just before AFCON kicks off, but Sunderland will not see much of him until the back end of January if Senegal go a long way in Morocco. Attacking areas out wide will also be badly depleted for as long as Talbi, Adingra and Traore are away. At least two of those three typically start for Regis Le Bris.\nHalf of the 14 senior players signed in this summer’s post-promotion overhaul are likely to be on AFCON duty, so Sunderland knew the risks. The only blessing for their supporters? Newcastle United’s visit to the Stadium of Light comes a few days before they are expected to head off.\nPhilip Buckingham\nAdvertisement\nTottenham Hotspur\nPlayers who could potentially play at AFCON: Yves Bissouma (Mali), Pape Matar Sarr (Senegal)\nFixtures they could miss: Liverpool (H), Crystal Palace (A), Brentford (A), Sunderland (H), Bournemouth (A), FA Cup third round tie, West Ham United (H)\nHow big will the impact be? It was embarrassing for Ghana that they failed to qualify for this AFCON but it benefits Spurs because summer signing Kudus, who has been a key figure under new head coach Thomas Frank, will be available throughout the festive period.\nFrank praised Sarr on multiple occasions when he first took charge but the 23-year-old has now slipped out of his strongest starting XI. Sarr is a great rotational option in central midfield, which means there will be an extra burden on Rodrigo Bentancur, Lucas Bergvall and Joao Palhinha while he is away. Senegal were knocked out in the round of 16 (by eventual champions Ivory Coast, on penalties) at the previous AFCON in early 2024 but were runners-up in 2019 before winning the 2021 edition. They will be serious contenders to reach the final in Morocco, which means Sarr could miss a lot of the games listed above.\nSarr’s fellow midfielder Bissouma has not played a single minute for Frank so far because of an ankle injury suffered on international duty. He had surgery in October and might not recover in time for AFCON. Even if he does make Mali’s squad, he will not be missed back at Spurs as inconsistent performances had seen him drop down the pecking order.\nJay Harris\nWest Ham United\nPlayers who could potentially play at AFCON: Aaron Wan-Bissaka (DR Congo), El Haji Malick Diouf (Senegal)\nFixtures they could miss: Manchester City (A), Fulham (H), Brighton & Hove Albion (H), Wolverhampton Wanderers (A), Nottingham Forest (H), FA Cup third round tie, Tottenham Hotspur (A)\nAdvertisement\nHow big will the impact be? Wan-Bissaka, voted the club’s player of the year last season, and summer signing Malick Diouf are first-team regulars under new head coach Nuno Espirito Santo.\nWan-Bissaka’s absence from the starting XI will be eased by versatile defender Kyle Walker-Peters, who is a solid backup option. The 28-year-old, who joined in the summer on a free transfer from relegated Southampton, scored his first goal for the club in the 3-2 home win against Burnley two weeks ago. Diouf’s absence could coincide with Ollie Scarles’ return to the team. The academy graduate fractured his collarbone in October’s 2-1 loss to Leeds United but is scheduled to be back in action next month.\nRoshane Thomas\nWolverhampton Wanderers\nPlayers who could potentially play at AFCON: Emmanuel Agbadou (Ivory Coast), Tolu Arokodare (Nigeria), Tawanda Chirewa, Marshall Munetsi (both Zimbabwe), Jackson Tchatchoua (Cameroon).\nFixtures they could miss: Brentford (H), Liverpool (A), Manchester United (A), West Ham United (H), Everton (A), FA Cup third round tie, Newcastle United (H)\nHow big will the impact be? At the risk of sounding glib, it’s possible it could be next to nothing, given Wolves’ current position in the table. If they cannot improve their form in the next month and collect some vital points, they may find themselves effectively doomed to relegation by the time their AFCON players depart. But if they are realistically in the fight for survival come mid-December, the losses could be felt.\nHaving said that, of those who could be missing, Chirewa has not played a minute of first-team football for Wolves this season and only Munetsi has been a frequent starter, so the impact would largely depend on how the line-up changes under new head coach Rob Edwards. It is possible, given the way Edwards’ previous sides have played, that Agbadou, Tchatchoua and Arokodare could become more prominent in the weeks ahead.\nSteve Madeley",
  "word_count": 4014,
  "scraped_at": "2026-02-14T02:03:26.524239",
  "_text_extracted": true
}