{
  "article_id": "7996df5e75ab",
  "url": "https://metro.co.uk/2025/04/11/paul-merson-names-three-arsenal-players-mikel-arteta-must-rest-brentford-22896538/",
  "title": "Paul Merson names three Arsenal players Mikel Arteta must rest against Brentford",
  "date": "20250411T231500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paul Merson has urged Mikel Arteta to rest three players for Arsenal’s Premier League home game against Brentford on Saturday.\nThe Gunners host the Bees at the Emirates after their 3-0 Champions League quarter-final first leg victory over Real Madrid on Tuesday.\nArsenal return to European action on April 16 for the second leg at the Bernabeu and Merson feels his old club should prioritise that match.\nMerson believes Arsenal don’t have much to play for in the top-flight, given Liverpool have an 11-point lead over the second-placed north Londoners with just seven games to go.\nBut Arsenal could get their hands on this season’s Champions League trophy with Merson telling Arteta to rest Bukayo Saka, Declan Rice and Martin Odegaard this weekend before the showdown with Real Madrid.\n‘I don’t think the Arsenal vs Real Madrid tie is over yet,’ Merson told Sportskeeda.\n‘That makes this a tricky game for the Gunners. Brentford are not an easy team to face in the Premier League.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I don’t think Mikel Arteta believes his team are through to the semi-finals of the Champions League despite the 3-0 win. So I’m expecting him to rest a few players against Brentford.\n‘Arsenal are 10 points clear of Manchester City in sixth-place, so they are in the driving seat for Champions League qualification next season.\n‘They have no chance of winning the league title anymore so they will focus on the Champions League.\n‘I wouldn’t start Bukayo Saka in this game. He was excellent during midweek and Arsenal will need him fresh for the second leg.\n‘The same applies to Declan Rice and Martin Odegaard, so I’m expecting a few changes with Raheem Sterling potentially involved from the start.\n‘Even with all the changes, I think Arsenal will get the three points. Prediction: Arsenal 2-1 Brentford.’\nArteta provided fitness updates on Saka and Rice in his pre-match press conference on Friday ahead of the top-flight clash against Brentford.\nMore Trending\nSaka hobbled off during the first meeting with Real Madrid while Rice was also withdrawn during the closing stages nursing a bloodied ankle.\n‘So with Dec and Bukayo they are both fit and it was just a matter of two kicks so they are available [against Brentford],’ Arteta said.\nAsked if he could make wholesale changes for the match against Thomas Frank’s side, Arteta added: ‘We will look at how the players have recovered, it is not only about this game.\n‘It is about the schedule we have in the next few weeks. Whoever plays we will be very competitive.’\nMORE: Bayern Munich view Arsenal €125m transfer target as ‘absolute dream’ signing\nMORE: Real Madrid ‘most keen’ to sign Arsenal superstar in summer transfer window\nMORE: Edu sends message to Mikel Arteta and finally breaks silence on shock Arsenal exit",
  "word_count": 519,
  "scraped_at": "2026-02-14T02:26:33.617589",
  "_text_extracted": true
}