{
  "article_id": "79a426ad26d2",
  "url": "https://weaintgotnohistory.sbnation.com/features/2024/1/4/23999614/so-just-how-young-and-inexperienced-are-chelsea-for-the-premier-league",
  "title": "So just how young and inexperienced are Chelsea for the Premier League ? ",
  "date": "20240104T073000Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Plenty of proverbial ink, much of it quite sneering, has been spilt on the mostly unprecedented squad makeover undertaken by Chelsea’s new ownership since their takeover from Roman Abramovich at Stamford Bridge. And almost as much real money has been spent on players during this still ongoing makeover, as we attempt to put together a squad capable of winning the league again.\nSo just how young and inexperienced are Chelsea for the Premier League?\nOr: how (not) to stop worrying and learn to adjust your expectations\nBut those ambitions may be a bit too bold. While we won’t really know how this plan might turn out for a while yet, the immediate expectations set — by the owners, by the manager, by the players, and the fans like — have already proven a bit too high in the most difficult league in the world. Our hopes of a top four finish to get back into the UEFA Champions League have been severely dashed by the results on the pitch, with the team unable to perform consistently and achieve the anticipated results.\nDiscussions around the team have, unsurprisingly, often centered on the squad’s average age (especially when Thiago Silva doesn’t play). The old adage that “you can’t win anything with kids” may have been disproven once by Manchester United and their Class of 92, but it generally still rings true. (Ed.note: Chelsea recently fielded our youngest ever Premier League starting XI for example; and this week’s College Football playoffs in the USA served a great reminder how many of our key players are still of university age.)\nBut how does Chelsea’s average age truly compare to the Premier League average? And do you really always need a group of seasoned veterans at the peak of their footballing powers to reach the greatest of heights?\nWith the help of many Python functions, loops and not so flashy visualizations, that’s what I’m trying to assess. The Jupyter notebooks used for getting all the data and performing explorations/visualizations can be found in this GitHub repository.\nThe data\nThis analysis was kept only to the Premier League. There’s little incentive looking at other leagues; and wondering how this squad might compare to teams in La Liga or Serie A.\nThe data includes the last 15 Premier League seasons, between 2008 and 2023. We’ll be looking at individual player data, specifically ages, experience in terms of appearances prior to playing in the Premier League, and their successes.\nIn experience terms, I divided it into two groups: appearances and starts in top tier competitions, and appearances and starts in all competitions. The top tier competitions are:\nEngland: Premier League, FA Cup, League Cup\nItaly: Serie A, Coppa Italia\nSpain: La Liga, Copa del Rey\nFrance: Ligue 1, Coupe de France, Coupe de la Ligue\nGermany: Bundesliga, DFB-Pokal\nEurope: Champions League, Europa League, Europa Conference League, UEFA Super Cup\nSouth America: Copa Libertadores, Copa Sudamericana\nI included cup matches as well, which tend to provide a proper challenge when even facing lower-league sides. I did not count international matches to simplify things a bit. Thus assessments will only be made based on age, position, and appearances.\n- The first-choice and second-choice roles were defined as such:players are considered first-choice if they started at least 23 games in a season (i.e. more than 60% of matches)\n- players are considered second-choice if they started between 8 and 22 matches (between 20% and 60%).\n- everyone with fewer than eight starts are considered third-choice players\nThe teams\nThere are 40 teams who played in the Premier League between 2008 and 2023. Those are:\nAmazingly only seven clubs have been ever-present for the last 15 years: Chelsea, Manchester United, Liverpool, Arsenal, Tottenham, Manchester City and... Everton.\nThe average position of Premier League clubs during that time shouldn’t be a great surprise. Manchester City’s seven titles from 2011 to 2023 set them dead first, with Manchester United closely following thanks to Sir Alex Ferguson’s legacy. Chelsea lead the second group, edging out Arsenal, Liverpool and Tottenham by only a few decimal points.\nEverton, the only other team outside of the top six who haven’t been relegated, have an average finishing position of 9.37.\nWhen it comes to average points, there’s of course a strong correlation to position. Manchester City is nearly six points ahead of second-place Manchester United with 80.7 points recorded on average. Following the top six we have Everton, Leicester and Brentford — the latter helped by having only two seasons in the Premier League with great success given initial expectations — with 54, 53.2 and 52.5 points on average, respectively.\nAverage goals for and against aren’t that surprising either. Manchester City dominate once again, especially when it comes to attacking. They have scored on average nearly 11 goals more per season than second place Liverpool. However in the average goals-against stat, things are a bit tighter with Chelsea taking second place with 37.7 goals, versus City’s 34.8.\nWe have some well-defined groups here:\n- Manchester City, leading every statistic thus far;\n- The rest of the top six\n- The rest of the league and the also-rans\nThe players\nThe other two important metrics for consideration are age and experience.\nAGE\nThe following histogram shows the ages of every Premier League player between 2008 and 2023. In a dataset of 8096 entries, 3360 — or 41.5% of the observations — were players between 25 and 29 years of age.\nThere is steep drop starting at age 30 — a familiar paradigm if we recall Chelsea’s contract policies under the previous regime.\nTo complement the above, we can look at the initial and final ages of PL players, which shows that most players start their career in the league at age 19, peaking at around or just before 25, and the dropoff starts.\nThe exit age distribution plot also shows that most players start leaving the league between ages 29 and 30.\nEXPERIENCE\nBut when it comes to experience, it turns out you don’t really need to be an extremely experienced player to get Premier League minutes. Over 21% of players in this 15-year span started to play in the league with little to no experience in senior professional football.\nLet’s now drill down to the positional level.\nPOSITIONS\nWe have 8096 entries in the dataset, corresponding to 2462 unique players, with the following positional divide. (These are just general classifications; otherwise we’d be here all day talking about inverted full backs and such.)\n- Goalkeepers: 171\n- Defenders: 771\n- Midfielders: 834\n- Forwards: 691\nThe average Premier League player between 2008 and 2023 had approximately 51 starts, 64 total appearances, and stayed for about three seasons.\nBelow are the players with the most Premier League appearances in the last 15 years, as well as the ones with the most starts:\nAVERAGE LEAGUE FINISH\nThe list below was limited to players with at least 200 appearances, otherwise we’d just have Manchester City players in the entire list.\nEven still, the the only non-City player in the top seven is Liverpool’s Mohamed Salah, with a 2.62 average league finish. (Ed.note: quite sanguine to include Chelsea in KDB’s and Salah’s careers!)\nPOSITIONAL AVERAGES\nUnsurprisingly, goalkeepers have a higher average age than any other position. They also have more appearances and starts than everyone else.\nGoalkeepers’ starts-to-appearances ratio is also the highest at more than 99%, compared to forwards with around 75% otherwise. Forwards also have the least amount of top competition starts (109) in the dataset, but the most appearances (147) — which should be largely explained by the fact forwards face more rotation and are often deployed by managers as late substitutions.\nOne clear pattern here is that the further back you play, the more matches you start. Again, far from a surprising fact given the nature of the sport.\nLastly, we can break down the most common roles associated with each position on the pitch. This confirms the previous assessment with nearly 50% of goalkeepers being first-choice players, and forwards being the only position with more third-choice than either first- or second-choice players.\nBut can you win anything with kids?\nAt long last, the ultimate question. What can we expect from a young team like Chelsea win?\nTo try to answer this question, we need to focus on only the top-six teams, and their players.\nIn terms of average age, the top six are pretty well stacked together. Manchester City are the oldest, with Chelsea in close second. Things are perhaps a bit more interesting on the side of entry age (so the age at which players begin their careers in the league), where Manchester United and Liverpool have noticeably lower averages than anyone else.\nIn terms of experience, it is once again Manchester City who lead the way. Chelsea follow closely behind, while Manchester United, Tottenham, Liverpool and Arsenal are a bit further back.\nBreaking down experience by roles (first-to-third choice) shows once again that goalkeepers lead the way.\nBut surprisingly, it’s forwards who have averaged the second-most amount of experience ahead of landing a Premier League first-choice job, with midfielders and especially defenders lagging behind.\nAnd when it comes to initial experience before entering a Premier League top six squad, forwards take the lead in 1st and 2nd choice roles in total appearances.\nNo wonder there are few instances of players having little to no experience, especially in top competitions, before becoming first-choice players.\nNotable exceptions are Manchester City’s Ederson with only 12 top competition starts before locking down the goalkeeper role at the Etihad, and our own Raheem Sterling doing the same at Liverpool back in 2012.\nSTABILITY\nBefore jumping to the final assessment, we need to check squad consistency. This is a basic measure of how long a player stays in the squad on average while being relevant to the team — i.e., being either a first- or second-choice player.\nThere’s little difference across top-six teams when it comes to average tenure of a player, with Manchester United leading the pack with 3.6 seasons and Arsenal at the bottom at 2.9. Position-wise defenders are the ones with the longest tenure, and forward have the least.\nIndividually two players top the tenure chart — former Liverpool midfielder Jordan Henderson and former Manchester United goalkeeper David de Gea, each with 12 seasons as either first- or second-choice players. They’re followed by Manchester City’s Vincent Kompany, Tottenham’s Hugo Lloris and Chelsea’s César Azpilicueta at 11, and Manchester City’s David Silva just behind at 10.\nWhat about us?\nNow it’s time to (finally!) turn our attentions towards Chelsea’s current state.\nWhat the previous analysis shows is that historically, becoming a top-six player and/or being part of and playing a relevant role in a top-six team usually requires an enormous amount of experience, meaning years of regular playing time before entering the Premier League. And most of our current squad certainly don’t have that!\nThis is the current state of Chelsea (as of December 30, 2023) when it comes to both age and experience:\nOn average, these are our squad stats:\n- Age at End of Season: 23.71\n- Top Competition Starts Before Season: 86.32\n- Top Competition Appearances Before Season: 105.82\n- Total Starts Before Season: 139.04\n- Total Appearances Before Season: 164.61\nAnd when we exclude Raheem Sterling and Thiago Silva from the calculations, this is how things look like:\n- Age at End of Season: 22.92\n- Top Competition Starts Before Season: 56.54\n- Top Competition Appearances Before Season: 73.04\n- Total Starts Before Season: 108.50\n- Total Appearances Before Season: 131.50\nMeanwhile these are the league averages this season. You’ll note that their “experience” is about twice as high as our averages:\n- Age at End of Season: 26.61\n- Top Competition Starts Before Season: 122.22\n- Top Competition Appearances Before Season: 152.12\n- Total Starts Before Season: 198.70\n- Total Appearances Before Season: 241.23\nConclusion\nMy intention with this article was not to reinvent the wheel in any shape or form. There are several people with much better skills to make miles better assessments than the one in this piece.\nBut there’s certainly a big correlation between experience (more so than age) and league position.\nStill it’s interesting to look at how bold (to say the least!) upper management has been (and continue to be) in building our current squad. I’m of the camp that it’s too early to judge co-sporting directors Laurence Stewart and Paul Winstanley on how successful they were in rebuilding this very squad over three transfer windows, which is something truly unprecedented in the modern Premier League.\nGetting this very young squad to perform and reach the highest levels of Premier League football right away would be a nigh impossible task for any manager. Surely, even Pep Guardiola, with his credentials of once taking La Masia’s best into the Barcelona first-team, would likely fail to get top four with a team that on average have less than half of the experience of other top-six teams.\nI might even go as far as to say that given this data, it’s somewhat amazing we’ve been able to stay a solid mid-table team this season. When looking at the big picture, considering not just these numbers but also the quality and potential of our players, I’m highly optimistic about this group. Especially when considering that they’re not only getting experience as individuals, but also as a group to build that trust that can only come alongside a fair amount of consistent in playing time.\nAs we begin 2024, there might be some questions on whether Mauricio Pochettino is the man to lead the (long-term) charge of turning this squad into a 100-point team. But if we manage to get more than 50 points this season under his guidance, with most of our key players going through the most grueling learning curves of their careers, then we might just get there ... in a few years.",
  "word_count": 2331,
  "scraped_at": "2026-02-14T02:04:47.092777",
  "_text_extracted": true
}