{
  "article_id": "79d77adf162f",
  "url": "https://www.ariananews.af/623508/",
  "title": "FIFA Club World Cup 2025 : Everything you need to know",
  "date": "20240929T160000Z",
  "domain": "ariananews.af",
  "source_country": "Afghanistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nFIFA Club World Cup 2025: Everything you need to know\nThis new club competition – the FIFA Club World Cup 202 – will make its debut at a total of 12 stadiums across the United States\nFIFA will launch an exciting new club tournament next year that will feature the world’s best 32 teams from the six international football confederations.\nThis new club competition – the FIFA Club World Cup 202 – will make its debut at a total of 12 stadiums across the United States with the final to be played at MetLife Stadium in New York New Jersey.\nThe tournament will kick off on June 15 and end on July 13 next year.\nThis global event will bring together the most successful club sides from each of the six international confederations: AFC, CAF, Concacaf, CONMEBOL, OFC and UEFA.\nA total of 12 venues will be used to host the 63 matches which will be played across the United States.\nFIFA confirmed the 12 stadiums on Saturday. These are:\nMetLife Stadium in New York New Jersey, Mercedes-Benz Stadium (Atlanta), Bank of America Stadium (Charlotte), TQL Stadium (Cincinnati), Rose Bowl Stadium (Los Angeles), Hard Rock Stadium (Miami), GEODIS Park (Nashville), Camping World Stadium (Orlando), Inter&Co Stadium (Orlando), Lincoln Financial Field (Philadelphia), Lumen Field (Seattle), and Audi Field (Washington, D.C.).\nThe final, on July 13, will be played at the MetLife Stadium in New Jersey\nFIFA President Gianni Infantino made the announcement in Central Park, New York and said: “Football is the most popular sport on the planet, and in 2025 a new era for club football will kick off when FIFA stages the greatest, most inclusive and merit-based global club competition right here in the United States.”\n“The FIFA Club World Cup 2025 will feature 12 fantastic stadiums where a new chapter in football’s global history will be written by great players from the 32 best clubs in the world,” Infantino continued.\n“This new FIFA competition is the only true example in worldwide club football of real solidarity and inclusivity, allowing the best clubs from Africa, Asia, Central and North America and Oceania to play the powerhouses of Europe and South America in an incredible new World Cup which will impact enormously the growth of club football and talent globally,” he said.\nFIFA President Gianni Infantino made the announcement in Central Park, New York\nWith the draw set for December, just two of the 32 teams are still to be confirmed: one from South America, the other representing the host country.\nHow many teams will take part in the FIFA Club World Cup 2025, and how do they qualify?\n- A total of 32 teams will compete in the tournament, with places distributed as follows between the international football confederations.\n- Africa – 4 CAF teams. Three via champions pathway (CAF Champions League) and one via ranking pathway.\n- Asia – 4 AFC teams. Three via champions pathway (AFC Champions League) and one via ranking pathway.\n- Europe – 12 UEFA teams. Four via champions pathway (UEFA Champions League) and eight via ranking pathway.\n- North and Central America, Caribbean – 4 Concacaf teams. All via champions pathway (Concacaf Champions Cup).\n- Oceania – 1 OFC team. Via ranking pathway.\n- South America – 6 CONMEBOL teams. Four via champions pathway (CONMEBOL Libertadores) and two via ranking pathway.\n- Host country – 1 team.\nWhich teams have qualified?\n- Al Ahly (EGY) – 2020/21, 2022/23 and 2023/24 CAF Champions League\n- Wydad (MAR) – 2021/22 CAF Champions League\n- ES Tunis (TUN) – CAF ranking pathway\n- Mamelodi Sundowns (RSA) – CAF ranking pathway\n- Al Hilal (KSA) – 2021 AFC Champions League\n- Urawa Red Diamonds (JPN) – 2022 AFC Champions League\n- Al Ain (UAE) – 2023/24 AFC Champions League\n- Ulsan HD FC (KOR) – AFC ranking pathway\n- Chelsea (ENG) – 2020/21 UEFA Champions League\n- Real Madrid (ESP) – 2021/22 and 2023/24 UEFA Champions League\n- Manchester City (ENG) – 2022/23 UEFA Champions League\n- Bayern Munich (GER) – UEFA ranking pathway\n- Paris Saint-Germain (FRA) – UEFA ranking pathway\n- Inter Milan (ITA) – UEFA ranking pathway\n- Porto (POR) – UEFA ranking pathway\n- Benfica (POR) – UEFA ranking pathway\n- Borussia Dortmund (GER) – UEFA ranking pathway\n- Juventus (ITA) – UEFA ranking pathway\n- Atletico Madrid (ESP) – UEFA ranking pathway\n- FC Salzburg (AUT) – UEFA ranking pathway\n- Monterrey (MEX) – 2021 Concacaf Champions Cup\n- Seattle Sounders (USA) – 2022 Concacaf Champions Cup\n- Club Leon (MEX) – 2023 Concacaf Champions Cup\n- Pachuca (MEX) – 2024 Concacaf Champions Cup\n- Auckland City (NZL) – OFC ranking pathway\n- Palmeiras (BRA) – 2021 CONMEBOL Libertadores\n- Flamengo (BRA) – 2022 CONMEBOL Libertadores\n- Fluminense (BRA) – 2023 CONMEBOL Libertadores\n- River Plate (ARG) – CONMEBOL ranking pathway\n- Boca Juniors (ARG) – CONMEBOL ranking pathway\nWhat is the FIFA Club World Cup 2025 format?\nA group stage composed of eight groups of four teams per group playing in a single-game round-robin format.\nThe top two teams per group progress to the round of 16.\nA direct single-match knockout stage from the round of 16 to the final.\nNo third-place play-off.\nSport\nWinter Olympics 2026: Wednesday brings records, first-ever golds and thrilling action\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television.\nWednesday’s competitions at the 2026 Winter Olympics in Milan-Cortina delivered a packed schedule of medal events, record-breaking performances, and historic firsts, keeping fans on the edge of their seats.\nAcross speed skating, biathlon, luge, figure skating, and other winter disciplines, the day showcased the depth and diversity of talent at the Games.\nSpeed Skating Record\nIn one of the standout moments of the day, Jordan Stolz of the United States captured gold in the men’s 1,000m speed skating, setting a new Olympic record. Stolz’s performance marked a breakthrough on the world stage and established him as one of the sport’s emerging stars.\nHistoric Luge Gold for Italy\nOn home ice, Italian duo Andrea Voetter and Marion Oberhofer made history by winning the first-ever women’s doubles luge gold medal. Their victory delighted local fans and added a memorable chapter to Italy’s Olympic story, highlighting the host nation’s strength in sliding sports.\nBiathlon Brilliance\nFrench athlete Julia Simon claimed gold in the women’s 15km individual biathlon, demonstrating remarkable accuracy and resilience in challenging snow conditions. Her performance underscores France’s continued strength in Nordic disciplines and sets the stage for further excitement in upcoming biathlon events.\nFigure Skating Excellence\nIn ice dance, France’s Laurence Fournier Beaudry and Guillaume Cizeron claimed the top podium spot, while American favorites Madison Chock and Evan Bates earned silver in a tightly contested free dance final. Fans were treated to a display of precision, artistry, and athleticism, reflecting the high level of competition in this marquee Olympic sport.\nWednesday also featured intense competitions in alpine skiing Super-G, Nordic combined, women’s moguls, and doubles luge, keeping spectators engaged across multiple venues. Each event underscored the Olympics’ commitment to showcasing a broad range of winter sports and the exceptional skill of the athletes representing their nations.\nExclusive Coverage in Afghanistan\nAudiences in Afghanistan have been able to follow all the action live, as ATN holds exclusive broadcast rights to the Winter Olympics, with events aired nationwide on Ariana Television. This allows Afghan viewers to witness key moments, record-breaking performances, and historic wins as they happen, bringing the excitement of the Games directly to homes across the country.\nAs the Milano-Cortina Winter Olympics continue, fans can expect more thrilling stories, emerging stars, and unforgettable moments, with each day adding new highlights to a Games already rich in drama and achievement.\nSport\nAFC U17 Men’s Asian Cup Saudi Arabia 2026 Draw sets stage for continental showdown\nThe final draw for the AFC U17 Men’s Asian Cup Saudi Arabia 2026 took place today, Thursday February 12, confirming the group-stage line-up for Asia’s premier youth football tournament and setting the stage for a highly competitive continental battle.\nSixteen teams have been drawn into four groups of four, with each side aiming not only for continental success but also qualification for the FIFA U17 World Cup Qatar 2026. The top two teams from each group will advance to the quarterfinals and secure their places at the global showpiece.\nHosts Saudi Arabia headline the tournament as top seeds, joined by Asia’s leading youth football nations and several emerging teams that impressed during the qualification phase. The draw balanced traditional powerhouses with ambitious newcomers, promising closely contested matches throughout the group stage.\nScheduled to take place from May 5 to May 22, 2026, the 21st edition of the AFC U17 Men’s Asian Cup will once again serve as a key platform for the continent’s brightest young talents to showcase their potential on the international stage.\nWith the groups now confirmed, preparations intensify as teams turn their focus toward tactical planning and squad development ahead of what is expected to be a thrilling tournament in Saudi Arabia.\n- Group A: Saudi Arabia, Tajikistan, Thailand, Myanmar\n- Group B: Japan, Indonesia, China, Qatar\n- Group C: South Korea, Yemen, Vietnam, UAE\n- Group D: Uzbekistan, Australia, India, North Korea\nSport\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nAfghanistan’s campaign in the ICC Men’s T20 World Cup has taken a serious hit after suffering back-to-back defeats, leaving fans concerned about the team’s chances of progressing to the semi-finals.\nFollowing two consecutive losses, Afghanistan currently sit third in Group D with a net run rate of -0.555.\nNew Zealand and South Africa lead the group standings with four points each from two matches.\nWith four matches scheduled per team in the group stage, only the top two sides will advance to the next round.\nDespite the setbacks, Afghanistan have not yet been eliminated from the tournament. However, their path to qualification has become significantly more complicated.\nTo secure a place in the Super 8 stage, Afghanistan must win their remaining two matches against the United Arab Emirates and Canada — and do so by substantial margins to improve their net run rate. At the same time, they will need either New Zealand or South Africa to suffer heavy defeats in their remaining group fixtures.\nIf these conditions are met, Afghanistan could still break into the top two based on a superior net run rate. While the scenario is challenging, qualification remains mathematically possible — keeping Afghan hopes alive in the tournament.\n-\nSport5 days ago\nChampions League Elite action continues as qualification race tightens\n-\nInternational Sports4 days ago\nIPL 2026: Franchise sales gather pace as global investors circle teams\n-\nSport5 days ago\nEarly medal leaders emerge as Winter Olympics continue in Italy\n-\nLatest News5 days ago\nTerrorist activities observed along Afghanistan borders, says Lavrov\n-\nWorld5 days ago\nHong Kong tycoon Jimmy Lai sentenced to 20 years in jail in national security trial\n-\nLatest News5 days ago\nPakistan president claims situation in Afghanistan is ‘similar to or worse than pre-9/11’’\n-\nSport2 days ago\nAfghanistan’s semi-final hopes hang in the balance after two T20 World Cup defeats\n-\nBusiness4 days ago\nUzbekistan approves feasibility study agreement for Trans-Afghan Railway",
  "word_count": 1910,
  "scraped_at": "2026-02-14T02:11:06.639668",
  "_text_extracted": true
}