{
  "article_id": "7a109bc05387",
  "url": "https://www.90min.com/posts/man-utd-0-1-bayern-munich-player-ratings-12-12-23",
  "title": "Man Utd 0 - 1 Bayern Munich : Player ratings as Red Devils limp out of Champions League in drab defeat",
  "date": "20231212T233000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man Utd 0-1 Bayern Munich: Player ratings as Red Devils limp out of Champions League in drab defeat\n- Man Utd exited the Champions League and Europe altogether on Tuesday\n- Kingsley Coman produced the winning goal in the second half of a quiet affair\n- Erik ten Hag will be under pressure after a disastrous European campaign\nManchester United limped out of the Champions League on Tuesday evening in a woeful 1-0 defeat to Bayern Munich at Old Trafford.\nAfter a cagey and ultimately goalless first half in Manchester, Kingsley Coman's second-half strike was pretty much the only moment of quality in a drab encounter.\nErik ten Hag's side needed a win to have any hope of survival but also relied on Copenhagen and Galatasaray sharing the spoils elsewhere, but victory for the Danish side meant there was nothing United could have done to survive.\nHow the game unfolded\nIn the knowledge that only a win would do, Man Utd certainly upped the intensity from their dismal 3-0 defeat to Bournemouth at the weekend. However, the hosts couldn't cause Bayern too many problems early on, the best they could muster in the opening half-hour being Luke Shaw's long-range effort that was comfortably dealt with by Manuel Neuer.\nThe Bundesliga champions did give United some scares in the first-half, Leroy Sane's darting runs stretching their backline. The in-form winger should have done better with Coman's cross just after the 30-minute mark, inexplicably sending the ball backwards with his close-range volley.\nWhether incompetence or nerves, Man Utd failed to lay a glove on Bayern in a pretty dire first half of Champions League football, the visitors not needing to get out of second gear to contain Ten Hag's men.\nBruno Fernandes produced a couple of wayward shots from the edge of the box early in the second half as Man Utd looked to step things up, while Joshua Kimmich also blazed over from 18 yards at the other end.\nIn a lifeless affair, Bayern eventually produced a moment of quality that would send Man Utd out of the Champions League with 20 minutes to play. Harry Kane's deft flick in behind the hosts' backline sent Coman through on goal, and the Frenchman showed great composure to slam beyond a helpless Andre Onana.\nMan Utd were unable to produce any kind of response to Bayern's opener, Erik ten Hag's side exiting Europe in front of a subdued Old Trafford crowd. In the end, the damage had been done in their first five group stage games.\nMan Utd player ratings (4-2-3-1)\nGK: Andre Onana - 6/10 - Had nothing to do but pick the ball out of his own net in the 71st minute.\nRB: Diogo Dalot - 6/10 - A much improved performance from the weekend, with some encouraging forward runs.\nCB: Harry Maguire - 6/10 - Substituted just before half-time with a groin problem, only exacerbating Man Utd's injury woes. Performed well in his limited time on the pitch, but was rarely tested.\nCB: Raphael Varane - 6/10 - Some important interventions early on and didn't do an awful lot wrong in the United backline. It was the players in front of him that struggled to make an impact.\nLB: Luke Shaw - 6/10 - Not a comfortable evening for Shaw up against Coman, perhaps one of the reasons the left-back found himself injured at half-time. Substituted at the break.\nDM: Scott McTominay - 5/10 - Couldn't make too many of his trademark runs into the final third and didn't cause Bayern's defence any issues.\nDM: Sofyan Amrabat - 5/10 - Put himself about with ferocity, although did pick up a booking for a cynical foul on Jamal Musiala. The midfielder's lack of pace was often exposed.\nRM: Antony - 5/10 - One neat nutmeg on Kim Min-jae that will look great on a YouTube compilation, but he was ultimately invisible when United needed him to provide a moment of magic.\nAM: Bruno Fernandes - 6/10 - Couldn't keep his cool with a couple of efforts from the edge of the penalty area and couldn't spark anything in Bayern's half. At least showed some determination out of possession.\nLM: Alejandro Garnacho - 6/10 - Glimpses of his ingenuity down the left flank, but they didn't come with enough regularity. Lacked the quality required to hurt Bayern's backline.\nST: Rasmus Hojlund - 5/10 - Couldn't handle the aggressiveness of Bayern's two centre-backs and was bullied throughout.\nSubstitutes\nSUB: Jonny Evans (40' for Maguire) - 6/10 - Bayern didn't make Evans work too hard, but he couldn't keep a clean sheet in the end.\nSUB: Aaron Wan-Bissaka (46' for Shaw) - 6/10 - Coped with Sane relatively well, the German's influence waning as the half wore on.\nSUB: Facundo Pellistri (74' for Antony) - 6/10\nSUB: Hannibal Mejbri (74' for Garnacho) - 6/10\nSUB: Kobbie Mainoo (80' for Varane) - N/A\nSubs not used: Altay Bayindir (GK), Tom Heaton (GK), Sergio Reguilon, Daniel Gore, Joe Hugill.\nManager\nErik ten Hag - 4/10 - A long list of absentees meant that Ten Hag couldn't change too much from the Bournemouth humiliation and his side put in a pretty pathetic showing.\nBayern Munich player ratings (4-2-3-1)\nGK: Manuel Neuer - 6/10 - Tested once by Shaw with a fizzing effort, but more or less a spectator.\nRB: Noussair Mazraoui - 6/10 - Substituted at half-time after a fairly ineffective performance, although he did make some useful forays forward despite not being picked out by teammates.\nCB: Dayot Upamecano - 7/10 - Hojlund couldn't cope with his physicality, the Frenchman winning every battle.\nCB: Kim Min-jae - 8/10 - A wonderful performance from the South Korean international who showed Man Utd what they missed by not managing to capture his signature in the summer.\nLB: Alphonso Davies - 7/10 - Plenty of opportunities to exhibit his frightening pace, dealing with Antony well. Should have been made to do more defensive work, to be honest.\nDM: Joshua Kimmich - 7/10 - Almost caught in possession a couple of times after heavy touches, but helped keep things ticking in central areas.\nDM: Leon Goretzka - 7/10 - An unspectacular performance from Goretzka, which is not necessarily a bad thing. Did the basics well and helped Bayern control the tempo.\nRM: Kingsley Coman - 8/10 - A consistent threat on the right flank and took his goal beautifully. His speed made United defenders turn and face their own goal regularly.\nAM: Jamal Musiala - 8/10 - So graceful in possession, gliding across the Old Trafford turf throughout. In a tepid affair, he looked the most promising for Bayern before his withdrawal.\nLM: Leroy Sane - 7/10 - His leggy runs caused Man Utd some issues, although he was guilty of wasting Bayern's most promising moments in the first half. Continued his good form, just lacking a little end product.\nST: Harry Kane - 7/10 - Bar a couple of tame shots, the England captain couldn't get too involved. Did produce a sublime assist for Coman's effort.\nSubstitutes\nSUB: Konrad Laimer (46' for Mazraoui) - 7/10 - An admirable performance after coming on, but should have been tested more by Garnacho.\nSUB: Thomas Muller (67' for Musiala) - 6/10\nSUB: Mathys Tel (77' for Coman) - 6/10\nSUB: Raphael Guerreiro (90' for Sane) - N/A\nSubs not used: Daniel Peretz (GK), Frans Kratzig, Aleksandar Pavlovic, Eric Maxim Choupo-Moting.\nManager\nThomas Tuchel - 6/10 - Picked a full-strength side despite Bayern having sewn up top spot already. It was a pretty slow performance from his players, but they didn't need to do much to beat United.",
  "word_count": 1275,
  "scraped_at": "2026-02-14T01:51:13.784689",
  "_text_extracted": true
}