{
  "article_id": "7a156b653bbb",
  "url": "https://www.90min.com/posts/champions-league-fixtures-today-your-guide-wednesday-games-22-2-2023",
  "title": "Champions League fixtures today - your guide to Wednesday games",
  "date": "20230222T171500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League fixtures today - your guide to Wednesday's games\nThe Champions League marathon continues on Wednesday with two more round of 16 first legs.\nIt's a joyous time for football lovers and viewers were treated to a barnstormer of a contest on Tuesday night at Anfield. The opening 45 minutes between Liverpool and Real Madrid was Champions League football at its best before the holders blew away the Reds in the second period, rattling off five unanswered strikes to win 5-2 on the road.\nUEFA's next offering is perhaps less enticing, but you'd be a fool to overlook Wednesday night's first legs.\nRB Leipzig vs Man City\n- Location: Leipzig, Germany\n- Stadium: Red Bull Arena\n- Date: Wednesday 22 February\nThe group stage was once again a procession for Pep Guardiola's Citizens as they advanced into the round of 16 as group winners without tasting defeat.\nWhile their Premier League form has been patchy at times, especially away from home, their European quest began seamlessly but a tricky tie awaits against Marco Rose's RB Leipzig.\nThe east Germans had enjoyed an 18-game unbeaten run before they were beaten by Union Berlin earlier this month, but they returned to winning ways ahead of Wednesday's first leg. Die Roten Bullen won their final four games in the group phase to overcome a poor start and progress into the knockout phase in second place behind Real Madrid.\nRB Leipzig vs Man City team news\nThe hosts will be without starting goalkeeper Peter Gulacsi, as well as Dani Olmo and Abdou Diallo on Wednesday night, but they have received a double injury boost.\nBoth Konrad Laimer and Christopher Nkunku returned from long-term setbacks at the weekend and they're poised to feature against City. The Frenchman had been out of action for three months with a knee injury.\nThe visitors are missing John Stones due to a hamstring injury, while Aymeric Laporte and Kevin De Bruyne have not made the trip to Saxony through illness. City's absences will force Guardiola to reshuffle his pack once more and we could see Bernardo Silva return to his hybrid function in City's defence.\n- RB Leipzig vs Man City - Champions League: TV channel, team news, lineups & prediction\n- Man City vs RB Leipzig: Complete head-to-head record\nHow to watch RB Leipzig vs Man City on TV and live stream\nUnited Kingdom\n- Kick-off Time: 20:00 (GMT)\n- BT Sport 1\n- BTSport.com\nUnited States\n- Kick-off Time: 15:00 (ET) / 12:00 (PT)\n- Paramount+\n- VIX+\nCanada\n- Kick-off Time: 15:00 (ET)\n- DAZN\nInter vs Porto\n- Location: Milan, Italy\n- Stadium: San Siro\n- Date: Wednesday 22 February\nInter navigated the 'Group of Death' to set up this tie with Portuguese champions Porto. The Nerazzurri's Matchday 3 triumph over Barcelona proved significant as they advanced at the Catalans' expense.\nWhile Simone Inzaghi's side were defeated twice by group winners Bayern Munich, they held their nerve against Viktoria Plzen and earned an imperative point at Camp Nou.\nPorto, meanwhile, topped an evenly-contested group that also contained Club Brugge, Bayer Leverkusen and Atletico Madrid. After losing their first two games, the Portuguese side rattled off four straight victories to win Group B with 12 points.\nInter vs Porto team news\nInter's only injury concern is Joaquin Correa, who's set to miss out with a thigh injury. However, Inzaghi has a well-rested Lautaro Martinez to call upon and he'll likely partner Romelu Lukaku up top. Edin Dzeko is also in contention.\nHakan Calhanoglu, Milan Skriniar and Andre Onana will also return to Inzaghi's XI after they each dropped to the bench for the 3-1 win over Udinese on Friday.\nOn the contrary, Porto are expected to be without Evanilson, Fabio Cardoso, Gabriel Veron and Francisco Meixedo for the trip to Milan, while Galeno and Mateus Uribe are doubts.\nDanny Namaso will deputise for Toni Martinez up front should the Spaniard be deemed unfit to start on Wednesday night.\nHow to watch Inter vs Porto on TV and live stream\nUnited Kingdom\n- Kick-off Time: 20:00 (GMT)\n- BT Sport 2\n- BTSport.com\nUnited States\n- Kick-off Time: 15:00 (ET) / 12:00 (PT)\n- Paramount+\n- VIX+\nCanada\n- Kick-off Time: 15:00 (ET)\n- DAZN",
  "word_count": 709,
  "scraped_at": "2026-02-14T02:16:35.942590",
  "_text_extracted": true
}