{
  "article_id": "7a1681014a52",
  "url": "https://metro.co.uk/2026/01/21/champions-league-permutations-chelsea-liverpool-man-city-barcelona-explained-26433831/",
  "title": "Champions League permutations for Chelsea , Liverpool , Man City , Barcelona and more | Football",
  "date": "20260122T001500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea, Liverpool, Manchester City and Barcelona are among the clubs still with plenty to play for in the final gameweek of the Champions League league phase.\nArsenal are the only unbeaten team left in the competition, with their 3-1 win over Inter on Tuesday securing a top-two finish in the league phase for Mikel Arteta’s side.\nBut an intriguing set of results on Wednesday means there will be plenty to play for in the final round of league phase fixtures next week.\nMoises Caicedo’s second-half header helped Chelsea squeak past Pafos with a 1-0 win, while fellow Premier League clubs Liverpool and Newcastle were also victorious against Marseille and PSV Eindhoven.\nElsewhere, Barcelona came through a topsy-turvy first half away at Slavia Prague to record a 4-2 win and move themselves within touching distance of a spot in the top eight.\nAhead of the final round of league phase fixtures, here is the state of play and permutations for the clubs looking to advance to the next stage of the competition.\nHow does the Champions League league phase format work?\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nStarting last season, the traditional 32-team group stage of the Champions League was replaced by a league phase featuring 36 clubs, which has been commonly referred to as a ‘Swiss model’.\nRather than playing three teams twice, each side was drawn against eight different opponents – two from each of the four seeding pots. Every team will play four games at home and four away.\nThe results will determine where all 36 teams finish in one large league table. Those that finish in positions one to eight secure direct qualification to the last 16.\nClubs ranked nine to 24 enter into a knockout play-off contest, where victory will secure a spot in the round of 16. Teams in positions 25 to 36 are eliminated from the competition.\nWhat do Chelsea need to qualify for the Champions League knockout stages?\nChelsea were made to work at home to Pafos, but found a second-half winner to leave a top-eight finish in their hands ahead of the final week.\nThe Blues currently sit in eight place, but with a superior goal difference to a host of clubs – including Barcelona, City, and Athletico Madrid – who sit just below them in the table but on the same points.\nLiam Rosenior’s side face a difficult trip to take on Napoli in their final league phase fixture and have already secured their place in the knockout stages.\nBut should they win and better the results of the teams below them, Chelsea will hold on to their top-eight spot and move automatically into the last-16.\nWhat do Liverpool need to qualify for the Champions League knockout stages?\nAn impressive 3-0 away win at Marseille means Arne Slot’s side are in an advantageous position heading into the final gameweek.\nThe Reds currently sit fourth, and on 15 points, meaning a win at home to Qarabag next week will be enough to secure a top-eight spot for a second successive season.\nIn all likelihood, a draw should also be enough to secure a position in the top eight.\nWhat do Man City need to qualify for the Champions League knockout stages?\nA damaging 3-1 away defeat in Norway against Bodo/Glimt has hurt City’s chances of a top-eight finish.\nPep Guardiola’s side are already through to the knockout stages, but will need results to go their way on the final gameweek if they are to move into the top eight.\nCity, who host Galatasaray next Wednesday, are on the same number of points as Chelsea in eighth, but have an inferior goal difference to the Blues, as well as Barcelona and Sporting Lisbon, who sit in ninth and tenth respectively.\nWhat do Barcelona need to qualify for the Champions League knockout stages?\nA 4-2 win away against Slavia Prague ensured Barca’s spot in the knockout rounds, but the Catalan giants will be eager to move into the top eight.\nHansi Flick’s side currently sit ninth and host Copenhagen on the final gameweeek, but will need to win and to receive a favour from the teams above them if they to jump up into the top eight and qualify straight for the last-16.\nWho else could qualify?\nTottenham and Newcastle United are both currently in the top eight positions, but face tricky away fixtures against Eintracht Frankfurt and Paris Saint-German respectively\nMore Trending\nWin those and they should secure a top eight spot, but a dropped points risked dragging themsleves into a knockout play-off match in late February.\nSporting and Atletico Madrid could also jump into the top eight, while a trio of Italian clubs – Atalanta, Inter and Juventus – could also spring a surprise.\nDown towards the 24th spot, Qarabag will be looking to reach the knockouts for the first time, in the club’s history, while Napoli, who currently sit 25th, will need a positive result against Chelsea to avoid a disappointing league phase exit.\nWhen are the Champions League knockout rounds?\nChampions League knockout phase\nKnockout phase play-offs: 17/18 & 24/25 February 2026\nRound of 16: 10/11 & 17/18 March 2026\nQuarter-finals: 7/8 & 14/15 April 2026\nSemi-finals: 28/29 April & 5/6 May 2026\nFinal: 30 May 2026\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Liverpool legend Steven Gerrard praises Mikel Arteta over ‘extremely clever’ Arsenal transfer\nMORE: Chelsea and England star Cole Palmer linked with shock Premier League transfer\nMORE: Steven Gerrard backs Liverpool star to reach ‘another level’ after Champions League win",
  "word_count": 986,
  "scraped_at": "2026-02-14T02:09:42.997976",
  "_text_extracted": true
}