{
  "article_id": "7a35cc324a26",
  "url": "https://www.uefa.com/uefachampionsleague/news/0288-19adf1dd8f20-3a915e5e4f78-1000--highlights-round-up-copenhagen-napoli-through/",
  "title": "Tuesday round - up : Napoli and Copenhagen reach round of 16 | UEFA Champions League",
  "date": "20231213T014500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tuesday round-up: Napoli and Copenhagen reach round of 16\nTuesday, December 12, 2023\nArticle summary\nThe pair clinched second place in their groups while Real Sociedad sealed top spot in Group D.\nArticle top media content\nArticle body\nNapoli and Copenhagen claimed victories to confirm their places in the UEFA Champions League round of 16 while the head to head for first place in Group D went the way of Real Sociedad thanks to their draw at Inter. UEFA.com rounds up all the action.\nGroup A\nMan United 0-1 Bayern\nKingsley Coman's clinical close-range finish ended Manchester United's hopes of a last-16 spot as Group A winners Bayern edged a tense encounter at Old Trafford. Coman steered his emphatic strike out of André Onana's reach with 20 minutes remaining after latching on to Harry Kane's clever through ball.\nThe Red Devils, needing to win to hold any hope of Champions League football after the winter break, began both halves brightly with Luke Shaw forcing a save from Manuel Neuer and captain Bruno Fernandes sending a curling effort wide, but were unable to find the breakthrough and finished the campaign bottom of the section.\nPlayer of the Match: Kingsley Coman (Bayern)\nKey stat: Bayern's victory tonight was their ninth successive group-stage win on their travels.\nCopenhagen 1-0 Galatasaray\nWith a knockout-stage place guaranteed for the winners, Lukas Lerager settled an intense Group A finale in Copenhagen, slotting in from Elias Achouri's 58th-minute cross to send his side to the round of 16 for the first time since 2010/11.\nThe hosts survived Lerager's dismissal for a second booking in added time, with goalkeeper Kamil Grabara producing late saves to deny Mauro Icardi and Hakim Ziyech. Galatasaray came third, advancing to the UEFA Europa League knockout round play-offs.\nPlayer of the Match: Rasmus Falk (Copenhagen)\nKey stat: Copenhagen are the only Danish club to have finished in the top two in a Champions League group.\nGroup B\nLens 2-1 Sevilla\nThe French side, who only required a draw to finish third and enter the Europa League knockout round play-offs, snatched a dramatic late winner and left Sevilla winless in the group.\nPrzemysław Frankowski and Sergio Ramos traded second-half penalties before substitute Angelo Fulgini streaked away to slot an added-time second as the visitors committed men forward looking for the winner they needed to overhaul the hosts.\nPlayer of the Match: Przemysław Frankowski (Lens)\nKey stat: Lens have lost just one of their last nine UEFA competition matches against Spanish teams (W5 D3).\nPSV 1-1 Arsenal\nGroup B's top two met with progress and positions already settled, but that did not detract from an entertaining game. Both sides struck the post, through Yorbe Vertessen and Mohamed Elneny, before Eddie Nketiah finished off an incisive move just before the break.\nBack came PSV, with Vertessen bending in an equaliser at the start of the second period, and either team might have won it. Ismael Saibari struck the upright and Leandro Trossard was denied at the death as it ended all square.\nPlayer of the Match: Ismael Saibari (PSV)\nKey stat: Cédric Soares made his sixth Champions League appearance in this game, nine years after his fifth.\nGroup C\nNapoli 2-0 Braga\nVictor Osimhen scored on his first Champions League start since October as Napoli rubber-stamped their place in the last 16 behind Group C winners Real Madrid. The Serie A champions took the lead early when Braga defender Serdar Saatçı steered a cross against the crossbar and into his own net, before Osimhen back-heeled a low cross into the net.\nBraga had their chances, with captain Ricardo Horta smacking a shot against the post, and they now enter the Europa League knockout round play-offs.\nPlayer of the Match: Natan (Napoli)\nKey stat: Braga have not kept a clean sheet in the Champions League since October 2012 (a 2-0 win vs Galatasaray), with the Portuguese outfit conceding 23 goals across their ten matches in the competition since then.\nUnion Berlin 2-3 Real Madrid\nMadrid came from a goal down to complete a 100 per cent record in Group C, while also denying Union Berlin the chance to move into the Europa League. Seconds after Luka Modrić's penalty was saved, Kevin Volland's goal put the hosts ahead and into a position to claim third place given Braga's deficit at Napoli.\nHowever, a pair of Joselu headers turned the game around and, after Alex Král's strike looked set to earn the hosts a point, Dani Ceballos settled it late on.\nPlayer of the Match: Joselu (Real Madrid)\nKey stat: While Union remain without a win in the Champions League, Madrid are the second team to have registered three perfect group stage campaigns after Bayern München.\nGroup D\nInter 0-0 Real Sociedad\nLa Real won a Champions League group for the first time in their history and progressed to the knockout phase, having conceded just two goals in the competition. With both sides already through to the last 16 and level on points, the visitors secured the draw they needed to top Group D in a game of few clear-cut chances.\nA goal-line clearance by Hamari Traoré prevented Inter from taking the lead just before half-time, but both goalkeepers were relatively untested with defences standing strong in a match of high quality but little drama.\nPlayer of the Match: Martin Zubimendi (Real Sociedad)\nKey stat: Real Sociedad's 12 points are the most they have achieved in a Champions League group stage.\nSalzburg 1-3 Benfica\nEvergreen Ángel Di María inspired Benfica to a dramatic victory at Salzburg to snatch a Europa League knockout play-off round spot. Tasked with winning by two or more goals to finish third, Di María curled in direct from a corner and then teed up Rafa Silva to score before half-time.\nLuka Sučić fired home to rekindle Salzburg's hopes before the hour but, after a glut of missed chances and a grandstand finish, Arthur Cabral's 92nd-minute back-heel sparked wild Benfica celebrations.\nPlayer of the Match: Ángel Di María (Benfica)\nKey stat: Benfica were without a win in their previous seven Champions League matches. They have still never played eight successive European Cup/Champions League matches without a victory.\nComing up on Wednesday\nLeipzig vs Young Boys (18:45)\nCrvena zvezda vs Man City (18:45)\nAtlético de Madrid vs Lazio (21:00)\nCeltic vs Feyenoord (21:00)\nDortmund vs Paris (21:00)\nNewcastle vs Milan (21:00)\nFC Porto vs Shakhtar Donetsk (21:00)\nAntwerp vs Barcelona (21:00)\n*All kick-off times CET",
  "word_count": 1078,
  "scraped_at": "2026-02-14T01:51:13.783980",
  "_text_extracted": true
}