{
  "article_id": "7a96a0f82594",
  "url": "https://www.fourfourtwo.com/news/tottenham-hotspur-transfer-news-spurs-to-break-transfer-record-for-thomas-franks-first-signing-report-antoine-semenyo-signings-rumours-gossip-paper-talk-thfc",
  "title": "Tottenham working on record transfer as Thomas Frank first signing : report",
  "date": "20250611T171500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham working on record transfer as Thomas Frank's first signing: report\nTottenham Hotspur are appointing Thomas Frank as manager – and giving him a huge first signing in N17\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nTottenham Hotspur are ready to smash their transfer record, as Thomas Frank steps into the hot seat.\nWith the Europa League winners having recently dismissed Ange Postecoglou, Tottenham are on the cusp of bringing in Brentford boss Thomas Frank in anticipation of a return to Europe's top table next term.\nBut with the Lilywhites having finished 17th in the Premier League last time out, there's plenty of work to be done with an ailing squad in need of improvement across the board – starting with a major statement of intent.\nTottenham working on £70 million signing to kickstart the summer\nTottenham chairman Daniel Levy has a reputation for being a shrewd operator in the transfer market – but Tottenham's record signing remains Richarlison, who as per the Guardian, cost the North Londoners £50 million with £10m in add-ons when he swapped Everton for the capital in 2022.\nPrior to that, Tanguy Ndombele held the record – though Bournemouth did confirm that Dominic Solanke left the south coast on a club-record deal 12 months ago, when Spurs signed the striker for a fee believed to be around £55m.\nNow, Tottenham are ready to mine the Vitality Stadium once again, with Sky Sports News revealing that work has begun to sign Antoine Semenyo.\nRecognised by FourFourTwo in our list of the best left wingers in the world, the Ghanaian is valued by the Cherries at around £70m, with Manchester United believed to be interested in the star, too.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nFourFourTwo believes that the only other interested party able to offer Champions League football are Spurs' bitter rivals Arsenal, but that Semenyo features much further down the list of the Gunners' targets.\nThe 25-year-old was ranked at no.24 in FourFourTwo's list of the best Premier League players of the season, but after Bournemouth have already sold Dean Huijsen to Real Madrid and are fielding interest for Milos Kerkez and Ilya Zabarnyi from Liverpool and Paris Saint-Germain, respectively, there is a serious reluctance from the south coasters to do business unless an unignorable offer is presented.\nThe report from Sky notes that Spurs are also interested in Frank's protege at the Gtech, Bryan Mbeumo, but that the Cameroon international is unlikely to be swayed from his preference of Manchester United.\nSemenyo is worth €40m, according to Transfermarkt.\nMark White is the Digital Content Editor at FourFourTwo. During his time on the brand, Mark has written three cover features on Mikel Arteta, Martin Odegaard and the Invincibles, and has written pieces on subjects ranging from Sir Bobby Robson’s time at Barcelona to the career of Robinho. An encyclopedia of football trivia and collector of shirts, he first joined the team back in 2020 as a staff writer.",
  "word_count": 604,
  "scraped_at": "2026-02-14T01:58:41.944892",
  "_text_extracted": true
}