{
  "article_id": "7aadc9029d38",
  "url": "https://www.orissapost.com/afc-womens-champions-league-odisha-fc-drawn-with-jordan-singapore-clubs/",
  "title": "AFC Women Champions League : Odisha FC drawn with Jordan , Singapore clubs",
  "date": "20240718T093000Z",
  "domain": "orissapost.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Kuala Lumpur: Odisha FC are drawn alongside Etihad Club (Jordan) and Lion City Sailors FC (Singapore) in Group B of the Preliminary Stage of the 2024-25 AFC Women’s Champions League, following the draw conducted at the AFC House here Thursday.\nOdisha FC, the champions of the 2023-24 Indian Women’s League, will travel to Jordan to play in the preliminary stage, which will be held in a centralised league format from August 25 to 31.\nThirteen sides will contest the Preliminary Stage, which features four groups – one group of four teams and three groups of three. The four group winners will qualify for the 12-team Group Stage, joining the other eight clubs that have qualified directly.\nShould Odisha FC top their preliminary stage group and qualify for the group stage, they will be placed in Group C, consisting of Urawa Red Diamonds Ladies (Japan), Taichung Blue Whale Women’s Football Team (Chinese Taipei), and hosts Ho Chi Minh City Women’s FC (Vietnam).\nThe Group Stage comprises three groups of four teams and will also be contested in a centralised league format from October 6 to 12.\nClubs were seeded and placed in pots for the draw according to their respective Member Association rankings, based on the FIFA Women’s World Ranking (as of March 15, 2024).\nThe top two finishers of each group and the two best third-placed sides will progress to the quarterfinals, to be played March 22 and 23, 2025.\nA Knockout Stage draw will be conducted prior to the quarterfinals to determine the four pairings, which will be contested in a single-leg format, with the higher-ranked team of each tie to serve as the home side.\nThis will be followed by a centralised Finals, which will see the Semi-finals and Final – all single-leg ties – being played out from May 21 to 24, 2025, to determine the first-ever champions of the AFC Women’s Champions League.\nIANS",
  "word_count": 318,
  "scraped_at": "2026-02-14T02:08:01.875116",
  "_text_extracted": true
}