{
  "article_id": "7b06688b4ab9",
  "url": "https://www.teamtalk.com/news/eight-defenders-newcastle-can-target-after-botman-blow-including-leeds-utd-rock-and-unwanted-barcelona-star",
  "title": "Eight defenders Newcastle can target after Botman blow , including Leeds Utd rock and unwanted Barcelona star",
  "date": "20240321T211500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eight defenders Newcastle can target after Botman blow, including Leeds Utd rock and unwanted Barcelona star\nAfter being knocked out in the FA Cup quarter-finals against Man City on Saturday, Newcastle’s fortunes have gone from bad to worse as they will face up to “six to nine months” without their Dutch stalwart Sven Botman.\nBotman, who joined the Magpies from French side Lille in June 2022 for around €40m (£34.2m), had to come off late on in the game after damaging his anterior cruciate ligament.\nThe centre-back has already missed 17 games this campaign including the final five games of the Champions League group stage after initially sustaining a knee injury in September.\nEddie Howe has had to deal with a multitude of injuries this season including their number one goalkeeper Nick Pope, £38m winger Harvey Barnes, Jacob Murphy, Callum Wilson, Joelinton and Joe Willock all having missed extended periods of the campaign.\nWith Botman set to miss the rest of this season and potentially a few months into next season, the Toon Army look primed to head into the summer transfer window with a centre-back high up on their priority list.\nWith that being said, here are seven defenders Newcastle could go after in the summer.\nOusmane Diomande\nAt just 20 years old, Ivorian centre-back Ousmane Diomande has propelled himself to one of the most sought-after young defenders in world football.\nCurrently contracted to Portuguese giants Sporting CP, Diomande made the switch to the Lisbon-based outfit for upwards of €12.5m (10.6m) from Danish side FC Midtjylland having spent the previous six months on loan in the Portuguese second tier with Mafra.\nDiomande’s athletic prowess is what has made him stand out despite his youthful age, standing at 1.90m (6ft 3), he is quick and strong and also possesses great technical abilities which allow him to play out from the back with relative ease.\nHaving picked up the Primeira Liga defender of the month in September 2023, Diomande has featured in almost every minute when available this campaign, only missing six games due to representing Ivory Coast at AFCON.\nDiomande, who is also a major Chelsea target, is under contract in Lisbon until the summer of 2027 but does have a release clause in his contract of around €80m (£68.4m).\nHe won’t come cheap, but if Newcastle can make this move happen the Diomande could anchor the Magpies’ defence for the next decade.\nREAD MORE ~ Who is Chelsea and Arsenal target Ousmane Diomande?\nLloyd Kelly\nBournemouth are enjoying another steady season in the Premier League and look set to retain their top-flight status for next campaign, currently sitting in 13th, 14 points above the relegation zone with 10 games to go.\nWhere the Cherries have struggled this season is defensively, having shipped the fifth most amount of goals in the Premier League at this stage, but you can’t help but feel that that record would be better if it wasn’t for the absences of Lloyd Kelly.\nKelly joined Bournemouth in May 2019 for £13m from Bristol City and, when fit, has been a key component in the Cherries’ promotion campaign from the Championship in 2021/22.\nThis season he has been limited to just 14 Premier League appearances having endured calf, hip and muscle injuries.\nKelly’s contract on the south coast runs out at the end of this season and with rumours of Juventus, Liverpool and Tottenham all monitoring his situation, Newcastle will have to move quickly to secure his signature.\nAble to deputise at either left-back or centre-back, Kelly could slot right into the left side of the Magpies’ defence in Botman’s absence and would be a smart acquisition on a free transfer.\nJules Kounde\nAfter joining Barcelona from Sevilla in July 2022 for €50m (42.7m), Jules Kounde has been a regular in the Catalan club’s back line as well as in the French national side, able to operate at either centre-back or right-back.\nKounde has appeared in 26 of Barcelona’s 29 league games so far this season as the Blaugrana sit second in the league, eight points of leaders Real Madrid.\nIt has been reported that Man United are heavily interested in the Frenchman as Barcelona looks to sacrifice losing Kounde as a means to make money given their financial struggles.\nWith Barcelona willing to part ways with the Frenchman, Newcastle could well capitalise on Barca’s financial woes and bring the 25-year-old for a fee of around £55m.\nGoncalo Inacio\nHeading back to Lisbon and partnering Ousmane Diomande in the Sporting defence is 22-year-old Goncalo Inacio.\nInacio has spent his entire career at Sporting since joining their academy in 2012 and has since made over 150 appearances in all competitions for the Lions and even broke into the Portuguese national squad in 2023.\nThe Portuguese centre-back has played all but two games in the Primeira Liga at Sporting sits top of the table, a point clear of rivals Benfica with a game in hand.\nInacio, who is under contract in Lisbon until 2027, is currently valued at around €40m(£34m), though the Sporting is said to be holding out for his £52m release clause if they are to part ways with their homegrown talent\nHis strong left foot and ability to play out from the back means he would fit seamlessly into Eddie Howe’s system during Botman’s absence.\nJoe Rodon\nLeeds United and Joe Rodon have proved to be a match made in heaven this season in the Championship as the side from Yorkshire top the Championship table level on points with Leicester heading into the international break.\nThe Wales international joined the Whites on loan from Spurs in the summer after spending the previous season on loan in Ligue 1 with Rennes and has made a formidable partnership with fellow Welsh international Ethan Ampadu.\nThe 26-year-old has played all but three Championship games for Leeds this campaign as the side from Elland Road look to immediately bounce back to the top flight at the first time of asking.\nShould they achieve promotion, Rodon will certainly be high up on their list, though with his Spurs contract expiring in 2025, Leeds won’t be the only club on alert.\nHaving failed to make a name for himself at Tottenham, he will likely be offloaded this summer and if Newcastle throw their hat into the ring, they will fancy their chances of acquiring his services.\nDON’T MISS ~ Man Utd wonderkid and £80m-rated prospect feature in England’s predicted line-up for Euro 2028\nMurillo\nAfter joining Nottingham Forest on deadline day in the summer from Brazilian side Corinthians for £12m, Murillo has thrust himself into the limelight, becoming one of Forest’s key figures in defence this campaign.\nForest has recently suffered a four-point deduction which means that they have dropped into the relegation zone, one point beneath Luton, though if it wasn’t for Murillo they may have found themselves down there sooner.\nThis is the 21-year-old’s first time playing outside his native Brazil and he has adapted to life in England like a duck to water, having played on the left side of defence in both a back four and back three this campaign.\nWhether or not Forest remains in the Premier League next season is yet to be seen, but interest in Murillo will be prominent either way.\nWith Newcastle in the market for a left-sided centre-back, Murillo ticks all of the boxes and would most likely welcome a link-up with fellow compatriots Bruno Guimares and Joelinton.\nTosin Adarabioyo\nTosin Adarabioyo came through the Man City academy but failed to ever make a first-team appearance for the Citizens and after loan spells at Blackburn and West Brom, he made the permanent switch to Fulham for a fee of around £2m in 2020.\nThe Englishman, who is of Nigerian descent, has since gone on to make over 120 appearances for the Cottagers, as well as 15 appearances in the Premier League this season, which would be more if it wasn’t for a groin injury at the beginning of the campaign.\nAdarabioyo is out of contract at the end of this current campaign so would be available for a free transfer if he chooses to not renew terms with the West London club.\nNewcastle won’t be the only club that is interested in Adarabioyo’s services, with Liverpool, Man United, Spurs and Arsenal all said to be monitoring the 26-year-old’s situation.\nIf the Magpies are serious about acquiring Adarabioyo, they will have to move quickly.\nDean Huijsen\nAt just 18 years old, Dean Huijsen has helped make an impact at Roma after joining the capital side on loan from Juventus in January 2024.\nBorn in the Netherlands, Huijsen spent the bulk of his life in Spain having relocated there when he was younger and joined Malaga’s youth system before joining Juventus in 2021 amid interest from Real Madrid.\nHuijsen has represented the Netherlands at U17, U18 and U19 levels before recently accepting a call-up to the Spanish U21 side in March 2024 which means he is cap-tied to La Roja.\nThe 18-year-old has been linked with both Spurs and Man United in recent times having impressed in the Italian top flight despite his youthful age.\nShould Newcastle make a move for Huijsen, they won’t be getting a finished product but a highly talented defender that they can mould in their image.",
  "word_count": 1557,
  "scraped_at": "2026-02-14T02:10:47.910803",
  "_text_extracted": true
}