{
  "article_id": "7b12951c33db",
  "url": "https://www.anglocelt.ie/2024/05/01/unai-emery-has-total-trust-in-aston-villas-deputy-goalkeeper-robin-olsen/",
  "title": "Unai Emery has total trust in Aston Villa deputy goalkeeper Robin Olsen",
  "date": "20240501T154500Z",
  "domain": "anglocelt.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Unai Emery has total trust in Aston Villa’s deputy goalkeeper Robin Olsen\nBy Jonathan Veal, PA\nAston Villa boss Unai Emery says he has full faith in deputy goalkeeper Robin Olsen going into Thursday’s Europa League Conference semi-final first leg with Olympiacos.\nThe Sweden international will play as number one Emiliano Martinez is suspended after picking up three yellow cards in the competition so far, with two of them coming in the quarter-final second-leg win in Lille.\nOlsen may well have been playing anyway as Martinez sustained a hamstring injury in the first half of Saturday’s 2-2 draw with Chelsea, with the 34-year-old coming on at half-time.\nHe did concede two goals, but also made a vital save at the death to deny Cole Palmer and earn his side a point.\nEmery says he and his team have total trust in Olsen.\n“Martinez is very competitive and very important and helped us a lot,” Emery said. “But when an issue like that, the yellow card, and a small injury as well, we have to protect, help and support and push another player in the squad.\n“Robin Olsen has been very competitive every day in training. When he played he helped the team and the team believes in him and trusts in his performances.\n“On Saturday, he played 45 minutes against Chelsea and he saved us. He’s a humble man and hopefully he can help us and he can feel comfortable as well playing.”\nDefender Matty Cash added: “Robin has played so many games for his country, he is a really experienced player.\n“Emi is probably the world number one, but Robin is a fantastic goalkeeper as well.\n“He has got more than enough experience to come in. I’m not the one to tell him he is ready to come in, he knows it.”\nEmery did not say when he expected Martinez to return, with Youri Tielemans and Alex Moreno also sidelined.\nHowever, Nicolo Zaniolo could be fit after missing the last two games.\n“With the injured players, this morning (Wednesday) Nicolo Zaniolo was feeling better after yesterday not feeling very well, we are thinking to include him in the squad tomorrow,” Emery added.\n“With Tielemans, Emiliano and Alex Moreno tomorrow they are not available. On Sunday, I don’t know.\n“They are progressing well but it is three days. I don’t know.”\nVilla are aiming to win their first European trophy since 1982 but are balancing that with a quest to qualify for the Champions League for the first time.\nEmery conceded that the Premier League remains his priority, but not at the expense of trying to progress to the final.\n“No way, he said. “The most successful teams in the world and my reference as a coach are the winning teams, Real Madrid, Barcelona, Liverpool, Man City, they’re a guide for myself when I’m trying to play in different competitions.\n“Now we are very excited with the Conference League and very motivated with the Premier League. It’s not changing my first message when we started the season.\n“The most important thing is the Premier League, then FA Cup and Carabao Cup and Conference League and in case we’re getting to the end of the season and being a contender then of course the importance changes a little bit.\n“The first priority is still the Premier League but we’re going to play both trying to do the best in both.”",
  "word_count": 569,
  "scraped_at": "2026-02-14T02:07:51.314410",
  "_text_extracted": true
}