{
  "article_id": "7b2023e829e0",
  "url": "https://www.caughtoffside.com/2023/12/25/man-citys-julian-alvarez-sends-a-message-to-barcelona-and-real-madrid/",
  "title": "Man City news : Julian Alvarez sends a message to Barca and Real Madrid",
  "date": "20231225T123000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "He’s already one of the most decorated players in world football, so it’s no wonder that Julian Alvarez is coveted by Spanish giants Barcelona and Real Madrid.\nAfter winning multiple trophies whilst on the books of River Plate, the 23-year-old has continued with his trophy haul at Man City.\nHis impressive list of honours are the Argentine Primera Division, Copa Argentina, Supercopa Argentina, Trofeo de Campeones, Copa Libertadores, Premier League, FA Cup, UEFA Champions League, UEFA Super Cup, FIFA Club World Cup, CONMEBOL Pre-Olympic Tournament, FIFA World Cup, Copa America and Finalissima.\nUnder Pep Guardiola the world is clearly Alvarez’s oyster, even if he remains back-up to Erling Haaland for the most part.\nIt’s perhaps with that in mind that he sent a definitive message to Spain’s top two teams.\n??? Julián Álvarez on Real or Barça in the future: “The truth is I'm very happy at Manchester City. I've been at the club for a little more than a year. I feel very happy with everything we've achieved”.\n“Now our goal is to compete and try to win them all over again!”. pic.twitter.com/TlpVa4Ki1c\n— Fabrizio Romano (@FabrizioRomano) December 25, 2023\n“The truth is I’m very happy at Manchester City,” he was quoted as saying via a tweet from reliable journalist and CaughtOffside columnist, Fabrizio Romano.\n“I’ve been at the club for a little more than a year. I feel very happy with everything we’ve achieved. Now our goal is to compete and try to win them all over again.”\nIn any event, at present despite obviously coveting the player, Barcelona would be nowhere close to being able to afford him.\nTheir continuing financial woes are hampering them in the transfer market and that situation doesn’t look likely to change for some while yet.\nIt’s a different story for Los Blancos, but they too appear to be destined not to get their hands on the Argentine.",
  "word_count": 316,
  "scraped_at": "2026-02-14T01:51:13.765840",
  "_text_extracted": true
}