{
  "article_id": "7b27d537fb7a",
  "url": "https://www.scmp.com/author/paul-mcnamara",
  "title": "Paul McNamara | South China Morning Post",
  "date": "20231217T104500Z",
  "domain": "scmp.com",
  "source_country": "China",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Frenchman wants to create booming city cycling department, raises doubts over future of sprint coach.\nAbdullah Al Mutairi says city team need ‘peaceful time’ following Ashley Westwood’s tenure, receives backing from his ex-Sri Lanka player.\nBC Rangers No 1 Yip Ka-yu could be poised for city team debut, Roberto Losada names squad for Lunar New Year Cup match against FC Seoul.\nIncreasingly consistent 29-year-old aiming for world tour recognition following Asian Championships golden breakthrough.\nCity squad finish Asian Road Cycling Championships women’s road race empty-handed after missing pivotal breakaway.\nVisitors win doubles and singles without dropping a set on day two to complete 3-1 success at Victoria Park Tennis Stadium.\nCity’s top player efficiently brushes aside world No 476 Eero Vasa in straight sets, but Nicholas Cheng is picked apart in 42 minutes.\nCity team beat favourites Kazakhstan to claim victory in mixed relay time trial for first continental title since 2018.\nHead coach satisfied with ‘good hit out’ to start year, but Putrajaya event serves as reminder over Los Angeles 2028 qualifying challenge.\nTeam captain Yu Hiu-tung hands Nicholas Cheng singles and doubles assignments for Victoria Park Tennis Stadium tie against Finland.\nNorth District aiming to overcome Tai Po to reach first major final, before Eastern try to rescue campaign in match against BC Rangers.\nHead coach Andrew Wright tells triathletes they owe it to taxpayers to take their ‘A’ games to Malaysia, as launch pad to 2028 Olympics.\nFormer city tennis figurehead Steven Host and Finnish player Emil Ruusuvuori were topics of discussion as the teams get set for battle.\nThe 29-year-old is beaten to top honours by Kazakhstan’s Rinata Sultanova but city squad already on course for two-medal target.\nEnglishman survives slow start against Joe O’Connor to face Xiao Guodong on Thursday, defending champion Neil Robertson beaten in round one.\nThe 30-year-old becomes fifth Spaniard on league leaders’ books as Inigo Calderon seeks to heap more pressure on title rivals.\nClarissa Lyra treasures opportunity to watch likes of Roger-Yves Bost and Olympic silver medallist John Whittaker in action at horse show.\nEric Fok poised to scour globe for Ashley Westwood replacement. Manchester City in running to play summer game at Kai Tak Stadium.\nRoger-Yves Bost keen to keep competing into his seventh decade but content for new generation to sweep major honours.\nCeci Lee will lead city’s challenge at Asian Road Cycling Championships in Saudi Arabia. Head coach Herve Dagorne’s contract close to ending.\nThree-day event wraps up with Roger-Yves Bost winning Longines Grand Prix and officials promising bigger and better things to come.\nZascha Nygaard poised to defend grand prix crown on Sunday, Kevin Staut of France dashes to Longines Stakes success.\nTaiwan’s Joanna Garland beat Alexander Zverev and Nick Kyrgios in One Point Slam event, only to lose AU$1 million to amateur Jordan Smith.\nBronze medallist from 2022 Games among athletes set to shoulder burden of winning medals in Japan to help team retain HKSI Tier A status.\nJesse Yu Joy-yin returning to district club after a year with China League One club Shijiazhuang Gongfu, North District add two more players.\nPioneering city golfer tackles fatigue following decade on draining tour treadmill, refreshed and ready to be ‘better player in 2026’.\nInigo Calderon’s team sprint into 4-0 half-time lead but are given scare as visitors belatedly come to life to score twice.\nVeronika Leng and Hau Ha decide to cross finish line of gruelling race together while Qin Guidu leads the Chinese 1-2-3 in men’s race.\nDefeat for Doo and fellow Hongkonger Pedrey Ng to Chinese pair comes after her singles semi-finals loss the day before.\nThe defeat also means Ng misses out on the opportunity to claim the world No 1 snooker spot, with Bai claiming that accolade as well.",
  "word_count": 626,
  "scraped_at": "2026-02-14T01:51:13.777769",
  "_text_extracted": true
}