{
  "article_id": "7b33e3a37ee9",
  "url": "https://www.nytimes.com/athletic/6594179/2025/09/04/tottenham-left-wing-simons-johnson/",
  "title": "Tottenham left - wing options assessed : Simons , Kolo Muani , Johnson , Richarlison and more",
  "date": "20250904T053000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Son Heung-min’s emotional departure from Tottenham Hotspur earlier this summer presented their new head coach Thomas Frank with two dilemmas.\nFrank quickly realised Cristian Romero was the ideal candidate to replace Son as captain. If that was a simple decision, it will be much harder working out who should become the next first-choice left winger.\nAdvertisement\nSon scored only seven times in the Premier League last season, his lowest tally since 2015-16 when he had just arrived from Bayer Leverkusen, but he was an elite and reliable finisher for the bulk of his time in north London. He scored 127 goals in 333 top-flight appearances and shared the Golden Boot with Liverpool’s Mohamed Salah in 2021-22.\nThroughout his time at Brentford, Frank preferred to use a right-footed player on the left who could cut inside and shoot or cross. They would be supported by the overlapping runs of full-back Rico Henry. This is why Spurs’ unsuccessful pursuit of Savinho was interesting. The left-footed Brazilian only scored once for Manchester City last season playing on the right but excelled on his natural side during a loan spell with Girona in 2023-24.\nFrank worked with Said Benrahma, Ollie Watkins, Yoane Wissa and Kevin Schade at Brentford. They all possessed slightly different qualities and Frank would tweak his tactics to suit them.\nSummer signing Mohammed Kudus has emerged as Frank’s favourite right-winger but there are six different candidates on the left: Brennan Johnson, Wilson Odobert, Mathys Tel, Xavi Simons, Richarlison and deadline-day arrival Randal Kolo Muani. Mikey Moore will be added to the mix next season when he returns from a loan spell with Rangers.\nThey can all cover multiple positions. Before last weekend’s defeat to Bournemouth, Frank said ideally he would have two players in each position but Spurs want to avoid the injury crisis they suffered last season under Ange Postecoglou.\n“Hopefully we solve the (injury) problem with the process we put in place,” Frank said. “That can help but we need to be aware there is a long season, hopefully with 60-plus games. We need to be good enough at building the players, rotating at the right time — which is an art and very difficult — and good enough to have the right amount of players. You can’t have too many because that’s also not good.”\nAdvertisement\nFrank’s last sentence is a key factor to consider. Johnson, Simons, Richarlison and Kolo Muani are experienced, senior internationals but Tel and Odobert are still developing. Will they receive enough game time to fulfill their potential and stake a claim to start? Or are there too many options ahead of them? Neither have started a competitive game under Frank and Kolo Muani’s arrival makes their task even more difficult. While Tel has been left out of Spurs’ Champions League squad.\nJohnson has started all three of Spurs’ top-flight games this season on the left. The Wales international primarily played on the right under Postecoglou where he scored a lot of goals with first-time finishes from crosses pulled back towards the penalty spot. He repeated the trick from the opposite flank in last month’s 2-0 victory over Manchester City at the Etihad.\nIn the finest of margins, Brennan Johnson gives Spurs the lead over City following a VAR review!\n📺 @tntsports & @discoveryplusUK pic.twitter.com/FgMaK1POoq\n— Football on TNT Sports (@footballontnt) August 23, 2025\nJohnson was Tottenham’s top goalscorer (18) in all competitions last season but he is more conservative in possession than some of his team-mates. According to data from Fbref, he only attempted 1.8 take-ons and 2.4 progressive carries per 90 last season. Progressive carries are when a player moves the ball forward at least 10 yards or takes it into the penalty box.\nOdobert attempted 3.4 take-ons and 4.7 progressive carries per 90, while for Tel it was 5.2 and 2.7 respectively. Johnson played a significantly higher number of minutes (2,179) than Odobert (849) and Tel (913). The 24-year-old told The Athletic in July he is focused on becoming better in one-v-one dribbling situations. He is less direct than his positional rivals but they do not share his goalscoring instinct.\nSimons made 33 appearances for RB Leipzig last season and split his time between the left wing and central attacking midfield. As you can see from the graphic below, regardless of what position he starts in a match, the Netherlands international will drift out wide to receive the ball and glide towards the penalty box.\nWith Dejan Kulusevski and James Maddison recovering from long-term knee injuries, Simons is desperately needed in the No 10 role. When they return to full fitness, which is unlikely to happen this season in Maddison’s case, the 22-year-old might be an option out wide.\nAdvertisement\nSpurs’ defeat to Bournemouth exposed the lack of creativity in midfield when Joao Palhinha, Rodrigo Bentancur and Pape Matar Sarr start together. Lucas Bergvall is excellent at carrying the ball forward from deeper positions but nobody matches Simons’ ability between the lines.\n“Sometimes you need a player that can do something a little bit out of nothing,” Frank said after losing to Bournemouth. “Go past the player, produce a cross, a shot, a pass, with that extra quality that you need on the day, and that’s what I think (Simons) can bring.”\nRicharlison started both legs of Tottenham’s Europa League semi-final victory over Bodo/Glimt and the final against Manchester United on the left. He is a physical presence who can win aerial duels and hold the ball up.\nThe Brazil international can look clunky and awkward in possession. He is probably the wrong option when Spurs dominate the ball against an opponent. Spurs registered their lowest share of possession of the season against Manchester United in Bilbao (28 per cent) and joint-third lowest in the second leg at Bodo/Glimt (33 per cent). He was the right option for Postecoglou’s bespoke plan in those knockout games. Frank would ideally select someone with better ball manipulation who can draw multiple defenders towards them and create pockets of space for team-mates.\nDominic Solanke’s persistent ankle injury means Richarlison is needed as the central striker for now. The 28-year-old scored two impressive goals in the opening weekend victory over Burnley and assisted Johnson’s effort against City.\nThis is the first time Richarlison has started three games in a row for Spurs in over 18 months. He has constantly struggled for fitness since he arrived from Everton in July 2022. It feels more important for Richarlison to get a consistent run of games in his preferred position and to keep building his physical sharpness.\nSpurs tried to sign Kolo Muani from Paris Saint-Germain in January but he joined Juventus on a short-term loan. Eight months later, Kolo Muani has joined on a season-long loan. The 26-year-old’s speed, two-footedness and aerial ability make him a potent all-round threat.\nAdvertisement\nDuring his only full season with PSG, who paid €90million to sign him from Eintracht Frankfurt, Kolo Muani played across the front line under head coach Luis Enrique. He earned the majority of his minutes as the centre-forward, sharing playing time with Goncalo Ramos. If Bradley Barcola, Kylian Mbappe or Ousmane Dembele were injured or needed a break, Kolo Muani would be pushed out wide.\nHe enjoyed the most productive spell of his career playing centrally for Frankfurt in the 2022-23 campaign. Kolo Muani scored 15 times and registered 11 assists in 32 Bundesliga appearances. Frankfurt finished second in their Champions League group behind his future employers, Spurs. The France international scored the winner in their final two group games against Marseille and Sporting CP to help them progress to the knockout stage.\nCrystal Palace’s future head coach Oliver Glasner was in charge of Frankfurt at the time. Kolo Muani spearheaded Glasner’s 3-4-2-1 system, supported by Mario Gotze, Jesper Lindstrom or Daichi Kamada.\nKolo Muani scored eight goals in 16 league appearances for Juventus last season. He primarily operated as the central striker in a 4-2-3-1 formation ahead of Nico Gonzalez, Weston McKennie and Kenan Yildiz. The evidence is clear that Kolo Muani produces his best performances through the middle. It feels like he will be competing for minutes with Richarlison and Solanke instead of Tel, Odobert and Johnson on the wing.\nThe identity of the left-back will impact Frank’s plans. Djed Spence has had a strong start to the season and received his first England call-up. Destiny Udogie has been struggling with a knee injury and only made his first appearance of the season as a substitute against Bournemouth.\nSpence is predominantly right-footed and likes to bend crosses into the box with the outside of his boot when he plays on the left. When Spence starts ahead of Udogie, who is naturally left-footed, Frank will ideally pick a left-winger who is comfortable on the touchline and cutting inside. Otherwise, Spurs risk becoming too predictable down that side as all of their players will want to take up positions in central areas on their dominant foot.\nDifferent skill sets will be needed for different games. Johnson was an unused substitute in the Super Cup against PSG as Frank opted for a 3-5-2 system with Spence as the left wing-back. Frank used that formation regularly during Brentford’s first two seasons in the Premier League. If he frequently returns to it with Spurs, then maybe we should add Udogie and Spence to the overwhelming list of left-wing options.\nJohnson, who Frank tried to sign from Nottingham Forest during his time with Brentford, seems to be the first choice for now but the competition for minutes is set to be fierce.\n(Top picture: Getty Images)",
  "word_count": 1604,
  "scraped_at": "2026-02-14T02:09:24.930202",
  "_text_extracted": true
}