{
  "article_id": "7b365b1ee3e9",
  "url": "https://www.caughtoffside.com/2024/06/29/man-city-signing-man-united-star/",
  "title": "Man City News : Man City have been offered Man United Jadon Sancho",
  "date": "20240629T110000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Green light has been given to Manchester City to recruit Jadon Sancho on a reduced fee from fierce rivals Manchester United.\nTeamTalk claims that Sir Jim Ratcliffe has given Man City the opportunity to sign Sancho from Man United this summer.\nSancho, one of Europe’s most promising young prospects, has failed to regain the form that made him stand out since his £73 million transfer from Borussia Dortmund in 2021.\nAfter falling out with Man United manager Erik ten Hag, the English winger was sent on loan to Borussia Dortmund, his former club.\nHe has managed to impress during his time in Germany and helped his team to reach the Champions League final in the 2023-24 season.\nHowever, the Red Devils are looking to permanently offload the player, who they feel has no future at the club.\nWith ten Hag’s future now sorted and Man United making the decision to keep him, it is highly likely that Sancho will never play for the Red Devils again.\nMan City are reportedly one of four teams—the other three being Arsenal, Barcelona, and Chelsea—that have been contacted by United to submit a proposal for Sancho.\nMan United are ready to let him leave the club for a fee of £40m, accepting that they will face a loss on their investment in the talented young player.\nThe winger has a connection to Man City in the past as he left the Etihad Stadium at a young age to join Borussia Dortmund, where he gained prominence.\nMan City would not consider signing Man United outcast\nIt is highly unlikely that the Premier League champions would make a move for Sancho.\nThey have enough options in the wide areas and the players they have suit the football philosophy of Pep Guardiola.\nSancho is the kind of player who likes to take on his man and rely on individual brilliance, something that is not promoted at Man City.\nThe ship has sailed for Sancho to have a chance to prove himself at the Etihad Stadium and a move back to Dortmund for him makes much more sense, a place where he has felt comfortable playing his football.",
  "word_count": 360,
  "scraped_at": "2026-02-14T01:57:18.877439",
  "_text_extracted": true
}