{
  "article_id": "7b524eeae997",
  "url": "https://www.fcbarcelona.com/en/club/news/3744800/budget-for-202324-and-settlement-of-202223-seasons-approved/featured",
  "title": "Budget for 2023 / 24 and settlement of 2022 / 23 seasons approved",
  "date": "20231022T130000Z",
  "domain": "fcbarcelona.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The members Assembly has approved by a majority of 376 votes for, 45 against and 20 spoiled ballots, the settlement of the financial year for last season. Furthermore, the assembly also approved with 372 votes for, 37 against and 12 spoiled ballots the budget for the current 2023/24 season which foresees income of some 859 million euros and after tax profits of some 11 million euros.\nWith regards to the settlement from last season, the economic vice president Eduard Romeu presented figures, already made public, of some 304 million euros of after tax profits, 30 more than the 274 million predicted in the budget a year ago. For Romeu, the most important thing from the 2022/23 financial year is to have been able to stop the financial losses.\nRomeu underlined the importance of having reduced the debt to leave it under 1.2 billion euros and revert the negative equity which, according to the economic vice president \"was important for the peace of mind of members; for credibility and solvency in front of investors who have had confidence in us; and, on the sporting side, to revert to a normal fair play situation.\"\nThe figures show that for the 2022/23 season the Club achieved some 1.259 billion euros in income with 1.165 billion in outgoings, something that has allowed the net debt to be reduced for the second consecutive season, going from 680 million euros on 30 June 2021 to some 552 million euros on 30 June 2023. Commercially, the profits have risen some 43%, obtaining a total of 351 million euros, whilst the Club's facilities have raised some 229 million euros, 14% more than the budget predicted. To these benefits has to be added the extraordinary sale of 15% of audiovisual rights for the men's football which injected 400 million euros to the club's accounts.\nPredicted figures for 23/24\nWith regards to the current season, the Club considers it will end the campaign in the black despite the reduction in income due to the move to the Estadi Olímpic. This is due to the additional effort made by the commercial area, with predicted income of 378 million euros, from 351, and the rise in income from media from 245 million from 215, as progress from the group stage of the Champions League is expected, and the containment of outgoings with a 27% reduction in the wage bill for the professional teams. The viability plan to improve internal efficiency and reduce costs at the Estadi Olímpic and the disappearance of extraordinary costs from the 22/23 season will also contribute.\nThe economic vice president said before projecting the budget for 2023/24, \"the objective was to cover the hold, stop the bleeding and we have done that, but to do so we have had to take some tough and painful decisions. Once achieved, this season, without any extraordinary operations, we will able to avoid losing money.\"\nRomeu also underlined the efforts made in making cutbacks to salaries to comply with the viability plan. \"For the outgoings, a big effort has been made with both sporting and non-sporting salaries as well operational costs. The budget for the wage bill is the lowest in 8 years. That we have done with damaging the quality of the squad,\" explained the vice president.\nRatification of the agreement with TP Vision\nThe fourth point of order corresponded to the ratification of the agreement between the company TP Vision and FC Barcelona for the latter to wear the Ambilight TV brand on the left sleeve of the men's football first team jersey.\nAfter a presentation by vice president for the Area of Marketing, Juli Guiu, member delegates also ratified this agreement with 326 votes in favour, 39 against and 24 spoiled ballots.\nThe agreement with TP Vision was signed last May in an event which took place in the Directors' Box at the stadium with president Joan Laporta, vice president Juli Guiu and Kostas Vouzas, CEO of TP Vision all present.\nTP Vision is a company responsible for the design, fabrication and sale of Philips TV, Philips Sound and AOC Audio products and now forms part of the Club's sponsorship ecosystem as Main Partner for TV, Display and Sound Devices.\nIn his presentation, Juli Guiu stressed the strategic nature of the agreement with Ambilight as well highlighting a record year in the commercial area with 20 new sponsors. \"It is a leading company in its sector and it will allow us to have the resources necessary and apply the best technology, not just at Spotify Camp Nou but also at the rest of the facilities used by the professional sports teams.\"\nGuiu also picked out the Club's attraction to sponsors, citing the company Global Data as he stated that the current FC Barcelona shirt is the most valuable in the world of football.",
  "word_count": 804,
  "scraped_at": "2026-02-14T02:10:28.705928",
  "_text_extracted": true
}