{
  "article_id": "7b9d6dfe44c7",
  "url": "https://tribune.com.pk/story/2567115/heartbreak-will-help-arsenals-champions-league-charge-arteta",
  "title": "Heartbreak will help Arsenal Champions League charge : Arteta",
  "date": "20250916T014500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Heartbreak will help Arsenal's Champions League charge: Arteta\nCoach says last season semi-final loss has made team wiser\nArsenal coach Mikel Arteta said Monday his team's Champions League agony last season will help them in this season's campaign as they bid to win the competition for the first time.\nThe Gunners lost to eventual winners Paris Saint-Germain in the semi-finals and Arteta said his team were the wiser for it ahead of their opener at Athletic Bilbao on Tuesday.\n\"You take a lot of learnings from it -- it's painful because... it's about the expectation that we created and the real conviction that we had within the club, the team that we could go all the way,\" Arteta told a news conference at the San Mames.\n\"We showed a very high level of consistency and quality throughout the competition and (we'll) learn from it and try to be better.\"\nThe coach said he understood how various things needed to fall into place to triumph in Europe's premier competition.\n\"(We learned) we are good enough, that we can compete against any opposition on the day and on top of that, that things have to go your way,\" continued Arteta.\n\"You need to have a full squad available when it comes to the most critical moments in the season and then, the ball has to go in, in the right moment, or (you have to get) the right decision, because the margins are so small.\"\nArsenal reached the Champions League final in 2006, when they lost to Barcelona, and have not lifted a major trophy since the 2020 FA Cup.\nArteta confirmed Gabriel Saliba, Kai Havertz, Martin Odegaard and Ben White were not available, along with winger Bukayo Saka, as they take on an Athletic side back in the competition for the first time in 11 years.\nOne of the coach's key decisions in his tenure has been bringing in goalkeeper David Raya in 2023. When he replaced Aaron Ramsdale as Arsenal's number one, the coach was criticised.\nRaya reached a century of games for the club last weekend and has kept 42 clean sheets, establishing himself as one of Europe's best goalkeepers.\n\"When I came to Arsenal there was a lot of noise, a lot of talk, and it was understandable,\" said Raya.\n\"Having Aaron, who's a hell of a 'keeper, and out of nowhere it just gets changed -- obviously the media is going to be noisy and there were a few games where I could have done better.\n\"Everybody has bad games and the noise was starting to get a bit bigger, I just had to focus on myself and what I can control,\" Raya said. \"Off the pitch I just try to be deaf, basically.\"\nRaya said he thinks Arsenal are good enough to win the trophy for the first time.\n\"We have belief, we want to win, we are Arsenal and we play to win,\" he added.\n\"That's what we want to do and that's what we play football for, but... it's a long journey, it's a long season, in the Champions League and the Premier League.\"\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 544,
  "scraped_at": "2026-02-14T02:09:24.925210",
  "_text_extracted": true
}