{
  "article_id": "7ba4e3f71151",
  "url": "https://www.thenews.com.pk/latest/1087386-luis-enrique-takes-charge-as-psg-manager-amid-mbappe-uncertainty",
  "title": "Luis Enrique takes charge as PSG manager amid Mbappe uncertainty",
  "date": "20230705T234500Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Luis Enrique takes charge as PSG manager amid Mbappe uncertainty\nMbappe has informed PSG that he will not extend his contract beyond 2024\nDuring a press conference held to introduce Luis Enrique as the new manager of Paris St-Germain (PSG), following the departure of Christophe Galtier, club president Nasser Al-Khelaifi emphasised the importance of Kylian Mbappe signing a new contract if he intends to continue his tenure at the club.\nMbappe, the immensely talented 24-year-old French striker, has informed PSG that he will not extend his current contract beyond 2024. Al-Khelaifi made it unequivocally clear that for Mbappe to remain, he must commit to a new contract.\nThe PSG president stressed the club's firm stance, asserting their refusal to let go of the current world's best player without compensation, deeming it an impossibility. Although Mbappe has the option to activate a further year in his contract after the upcoming season, he has expressed his intention not to exercise that extension, thereby enabling him to depart on a free transfer next summer.\nAl-Khelaifi underlined PSG's status as a French club and shifted the responsibility to Mbappe if he had a change of heart about staying. Having joined PSG in 2017 from Monaco in a record-breaking transfer, Mbappe has been an exceptional goal-scorer for the club, amassing an impressive tally of 212 goals in 260 games.\nHe has consistently held the distinction of being Ligue 1's top scorer for the past five seasons and has contributed to the club's triumph in five league titles during his six-year tenure.\nThe introduction of Luis Enrique as PSG's new manager signifies his return to club management since his resignation as the manager of the Spain national team in December. Previously, Enrique enjoyed a highly successful tenure at Barcelona, where he secured nine trophies in three seasons, including a memorable treble in his inaugural campaign.\nHowever, Enrique assumes the helm of a PSG squad that faces uncertainties, with Mbappe's future hanging in the balance and questions surrounding the continuity of Neymar, the Brazilian forward, following Lionel Messi's departure. PSG's Qatari owners have expressed their determination to build a cohesive team, shifting their focus from relying solely on high-profile signings to achieving the desired success in the UEFA Champions League.\nWhile Galtier's tenure initially showed promise with a strong start to the previous season, PSG's form dwindled after the World Cup break, resulting in disappointing performances in domestic cup competitions and the Champions League.\nGaltier also encountered challenges off the field, including allegations of racist remarks during his time at Nice, for which he will face trial in December. PSG extended their gratitude to Galtier and his assistants for their professionalism and unwavering commitment throughout the season.\nThe club's attention now turns to securing Mbappe's future and embarking on a new chapter under the guidance of Luis Enrique, who faces the task of managing the transition and constructing a successful team that aligns with the ambitions of PSG's ownership.\n-\nBreezy Johnson engaged at Olympics after emotional finish line proposal\n-\nOlympics men hockey game: McDavid, Crosby power Canada past Czechia\n-\nEx-Arsenal footballer Thomas Partey charged with additional rape counts\n-\nChloe Kim set for historic halfpipe gold showdown at Milano Cortina\n-\nVladyslav Heraskevych disqualified from Winter Olympics 2026 over helmet controversy\n-\nThomas Tuchel set for England contract extension through Euro 2028\n-\nMilano-Cortina 2026: Assessing Italy’s Winter Olympics economic growth\n-\nVictor Wembanyama’s historic first half tops Tim Duncan, sparks massive NBA reactions",
  "word_count": 580,
  "scraped_at": "2026-02-14T02:24:50.291906",
  "_text_extracted": true
}