{
  "article_id": "7ba60401437b",
  "url": "https://www.nytimes.com/athletic/5720610/2024/08/25/brighton-premier-league-transfer-200m/",
  "title": "A £200m squad refresh and an exciting start : Is there something happening at Brighton ? ",
  "date": "20240825T084500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A new head coach in Fabian Hurzeler and a £200million ($265m) refresh of the squad in the summer transfer window… how good might this get for Brighton & Hove Albion?\nThey have scored five goals and conceded once in wins against Manchester United and Everton, and the 31-year-old German has not even used most of the seven signings made so far at a cost of more than £140million. It’s little wonder excitement is growing.\nAdvertisement\nMidfielder Matt O’Riley and full-back Ferdi Kadioglu are set to join from Celtic and Fenerbahce respectively, pushing the summer spending towards £200million — and that may not be the end of the business. Brighton still want to add another central defender, with Mats Hummels once among the targets, although the 35-year-old German is in advanced talks to join Real Sociedad as a free agent.\nThey also remain keen on clinching a deal with Inter Miami for Diego Gomez as they continue the policy of buying young talent from across the globe. The 21-year-old Paraguay international midfielder would come in January during the Major League Soccer off-season.\nBrighton’s first seven signings are from seven different countries. Six of them are aged 19 to 22, with 24-year-old Dutch international midfielder Mats Wieffer the oldest.\nDenmark international O’Riley, 23, will be a No 8 replacement for the prolific Pascal Gross following the German’s move to Borussia Dortmund. Left-footed and a polished passer, O’Riley scored 19 goals and provided 18 assists in 49 appearances across all competitions for Celtic last season. He also compensates for losing Gross’s set-piece deliveries.\nFenerbahce have been reluctant to lose Kadioglu. The tipping point for Jose Mourinho’s team was their financially damaging exit from the Champions League in the third qualifying round against French side Lille.\nBrighton see the 24-year-old Turkish international primarily as a right-back who can also play at left-back. This is why Argentinian prospect Valentin Barco has been loaned to Sevilla for the season amid reservations about the 20-year-old in defensive situations. Brighton already have Joel Veltman, Jack Hinshelwood and Tariq Lamptey competing for full-back positions, while Ecuador international Pervis Estupinan is on the way back from ankle surgery which has kept him out since April.\nAdvertisement\nFormer Newcastle right-winger Yankuba Minteh was the only new signing who started Saturday’s 2-1 victory over Manchester United at the Amex Stadium.\n“We haven’t used many new signings yet. It means that the players who are here already have good quality and they build a good foundation to win games,” said Hurzeler after the United game.\n“And now we try to integrate the new players as quickly as possible. We have to be clear that some players need more time and some players might integrate faster than others. It’s very important that we give them the time, because the Premier League is one of, or is, the most competitive league in the world.\n“They have to adapt, because they have come from different cultures, from different leagues, and it’s not easy for them. But I am very confident that we will make it easy for them, because of the environment, the atmosphere at the training ground, very helpful staff.”\nWieffer, having made his debut in the 3-0 win at Everton, would have made his first home appearance but for a minor injury. Billy Gilmour, Wieffer’s impressive replacement, remains the subject of persistent transfer interest from Napoli.\nGeorginio Rutter, the club-record £40million signing from Leeds, was not brought on by Hurzeler until the 89th minute as part of a triple change. The versatile French forward made his fleeting introduction on the right.\nRutter was on the pitch for Joao Pedro’s stoppage-time winner, but it was the other two substitutes introduced with him who were involved in the build-up. Yasin Ayari fed Simon Adingra for a cross headed in by the unmarked Joao Pedro.\nThe Brazilian, leading goal scorer last season with 20, became the fourth player to score for Brighton already this season. Danny Welbeck has never been as prolific as Joao Pedro in a single campaign, but the early indications are that he will enjoy Hurzeler’s intense and high-pressing style.\nAdvertisement\nThe 33-year-old has two goals in as many games after a stretching finish in the first half from Kaoru Mitoma’s cross. It was the 100th goal of Welbeck’s club career — seven of them against United — since starting for the opponents at the age of 17.\nOf the other new signings, it is too soon for Brajan Gruda, the 20-year-old attacking midfielder signed from Mainz, to feature in the Premier League squad. Ibrahim Osman has gone on loan to Feyenoord. Amario Cozier-Duberry is also going out on loan; the former Arsenal winger has attracted widespread interest from Championship clubs.\nRookie midfielder Malick Yalcouye, signed from IFK Goteborg, had his first 90 minutes last week in the group stage of the Football League Trophy against Crawley Town. His final effort in the shootout was saved in a 4-3 defeat on penalties after a 2-2 draw in normal time.\nThe picture will be clearer at the end of the transfer window, with further loan outgoings in the pipeline to trim an overloaded squad, but there is anticipation about what could lie ahead for Brighton under Hurzeler. Six points have been secured already.\nIt is not easy for Hurzeler to move Brighton on from the high bar of finishing sixth under Roberto De Zerbi in 2022-23, but European football feels an attainable ambition again if a revamped squad can build on a richly promising start.\n(Top photo: Glyn Kirk/AFP via Getty Images)",
  "word_count": 927,
  "scraped_at": "2026-02-14T01:51:48.870468",
  "_text_extracted": true
}