{
  "article_id": "7ba75b0db57d",
  "url": "https://www.goal.com/en-ug/news/tottenham-expected-sack-antonio-conte-daniel-levy-takes-action-following-savage-southampton-rant/bltc9a44bb4a0cf6a5c",
  "title": "Tottenham expected to SACK Antonio Conte as Daniel Levy takes action following savage Southampton rant",
  "date": "20230320T220000Z",
  "domain": "goal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Spurs to sack Conte\n- Italian endured miserable 2023\n- Launched attack on club at weekend\nWHAT HAPPENED? Drawing 3-3 against bottom of the league Southampton despite being 3-1 up with just 15 minutes left to play prompted a furious post-match press conference from Conte, who now looks set to get his wish in the form of a departure from Tottenham. The Telegraph report that chairman Daniel Levy has considered the next move carefully, with it now expected that Conte will be gone before the end of the week.\n🏆 BIG GAME: Barcelona ratings: De Jong masterclass all-but seals title\n📣 HAVE YOUR SAY: PSG and Lionel Messi MUST part ways this summer\n🚨 MUST READ: Where are the NXGN wonderkids of 2022 now?\nTHE BIGGER PICTURE: Ryan Mason is expected to be placed in temporary charge of Spurs until the end of the season once Conte's dismissal has been agreed and announced. The Italian has been consistent in his criticisms of the club, which the report claims has made it impossible for him to now return to his post, with him flying to Italy earlier on Monday as club football pauses for an international break.\nConte made headlines for his controversial post-match reactions at Tottenham, particularly as they were dumped out of the Champions League by Milan. With his deal up at the end of the season, many believed he was trying to force the club's hand, doing so again by doubling down at the weekend with a scathing attack on the club at board and player level.\nAND WHAT'S MORE: In what has been a difficult season on a personal level for the 53-year-old, who lost a close friend and also had to take time out following emergency surgery earlier this year, he has been unable to lead the club to silverware or improve the squad following a bright end to the 2021-22 campaign.\nAfter drawing 3-3 on Saturday, Conte told reporters: \"I think it’s better to go into the problem, we are not a team. We are 11 players that go into the pitch. I see selfish players, players that don’t want to help each other and don’t put their heart [into it]. This season compared to last, now we are worse in this aspect. When you are not a team you cannot improve.”\nHe later went on to add: “It is easy in this way [playing without pressure or importance]. Tottenham’s story is this, 20 years there is the owner and they never won something but why? The fault is only for the club, or for every manager that stay here.\"\nIN THREE PHOTOS:\nGettyGettyGetty ImagesWHAT NEXT? Tottenham will return to action after the international break in fourth and two points ahead of Newcastle, although the Magpies still have two games in hand on Spurs. Mason's sole focus will be on securing Champions League football.",
  "word_count": 480,
  "scraped_at": "2026-02-14T01:48:06.478885",
  "_text_extracted": true
}