{
  "article_id": "7bac0226de9a",
  "url": "https://www.myjoyonline.com/george-addo-jnr-returns-as-lead-english-commentator-for-official-afcon-broadcast-rights-holders/",
  "title": "George Addo Jnr returns as lead english commentator for official AFCON broadcast rights holders",
  "date": "20251220T134500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nGeorge Addo Jnr has been appointed Lead English Commentator for the Africa Cup of Nations (AFCON) by official broadcast rights holders New World TV, marking his return for a second consecutive tournament.\nThe BBC Sport presenter and former JoySports Editor previously held the same role at the 2023 AFCON in Côte d’Ivoire, where he provided commentary alongside celebrated African football legends including Sébastien Bassong, Didier Drogba, Emmanuel Adebayor, Basile Boli, and Salomon Kalou.\nAddo Jnr brings a wealth of international broadcasting experience, having covered six AFCON tournaments, three FIFA World Cups, including Qatar 2022, two UEFA European Championships, five UEFA Champions League seasons, and several Ghana Premier League campaigns.\nHe also made history at EURO 2020 by delivering nationwide free-to-air television commentary and calling the final between Italy and England from Wembley for a global audience.\nBeyond tournament coverage, he regularly contributes match reports and analysis on Premier League and FA Cup fixtures for the BBC’s Saturday Sports World, Sunday Sports World, Sports Today, and World Service flagship morning show Newsday.\nAt the upcoming AFCON in Morocco, Addo will be joined by Ghanaian compatriot Atsrim Sitsofe Philip, a seasoned commentator and regular JoySports pundit.\nWith his extensive experience in football commentary and analysis, Sitsofe Philip adds significant depth and quality to the on-ground team, further enhancing Ghana’s strong representation at the tournament.\nNew World TV’s broadcast team will deliver coverage to audiences in more than 36 countries, with commentary available in six African languages throughout the tournament.\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n39 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n57 minutes -\nNLC secures court injunction against striking tertiary unions\n2 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n2 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n3 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n3 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n4 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n5 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n5 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n7 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n7 hours",
  "word_count": 461,
  "scraped_at": "2026-02-14T02:06:26.654908",
  "_text_extracted": true
}