{
  "article_id": "7bbed1e89204",
  "url": "https://www.arsenal.com/news/every-word-leos-pre-lens-press-conference",
  "title": "Every word of Leo pre - Lens press conference | Press conference | News",
  "date": "20231128T201500Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leandro Trossard spoke to the media ahead of Wednesday’s UEFA Champions League game against RC Lens.\nHe was asked about the chance to reach the knockout stages, settling in at Arsenal and more.\nHere’s everything he had to say on the following subjects:\non scoring in all of our home Champions League fixtures so far:\nIt’s always nice to score and especially in the Champions League in front of your home crowd, of course.\non the importance of winning our group:\nIt’s very important. That’s what we want to do tomorrow. We want to win and be top of the group and have a good feeling going onwards.\non scoring two goals in his last three games and whether he should have three:\nOf course (it should be three!), but that’s football and I think we have done really well up until now and like I said, we want to finish it off tomorrow by winning.\non whether it was fair that his goal was disallowed against Brentford:\nThat’s football. There are so many things that you can think about, but in the end it’s a disallowed goal so you have to move on and that’s what we did. We kept on going and you can see at the end that we were rewarded for it.\non how we’ve coped with playing in the Champions League:\nI think very well. We are together as a group now and we want to finish it off tomorrow. We want to be top of the group going into the next round and I think we’ve done really well. We have such a good group and so much quality, so we can cope.\non his views on VAR and whether its use should be extended:\nI can only speak for myself. Obviously with VAR we want the best possible outcome, but everyone can have mistakes or some things can happen. If it doesn’t go your way then you have to take it on the chin in that moment. Obviously it’s not nice for yourself, but you can’t change it in the moment, it’s the same with my disallowed goal that we had in the game. Maybe it’s offside, maybe it’s not, but we have to move on. It’s for the guys who work with VAR to deal with it, so it’s not up to us to change anything.\non whether we all need to embrace VAR:\nWe need to get used to it. I think they want to improve as well, I think everyone wants to improve, but only time will tell how good it can be. Before we had a lot of discussion when VAR was not there when there were situations if it would be a goal or not or if a tackle would have been a red card, we can have an argument on so many things, but we have to live with it now and we can only hope for the best.\non the boost our supporters give the team:\nIt’s massive, you can feel it straight away when you walk onto the pitch. It’s amazing, especially in the Champions League. It’s been a long time for them as well so it’s a special moment when you can share it with the fans and we want to win tomorrow and share it with them.\non whether it’s difficult to play in different positions when Mikel Arteta has such specific demands:\nI have to be switched on every day, to be honest, but that keeps me on my toes I suppose. That’s the way it goes for me at the moment, I need to bear in mind that I can play in multiple positions and I need to be ready in each one of them. I think I am at the moment and I try to compete and play in the best possible way.\non whether Mikel Arteta does anything specific to help him slot into different positions:\nNot particularly, but I’ve played in each position now at some stage in my career. Obviously it’s been a bit longer in some positions, but I can adapt really quickly and it’s no issue with me.\non how he was able to settle so quickly at Arsenal:\nI think when you come to a new club, you have to prove yourself and I think what helped me was that I was important straight away with some assists and a goal and I think that helps you to integrate into a group. But obviously the team is so good, we have such good characters here and they all try to help you and settle you in, so that helped the most to be honest.\non how old he was when he realised he could score with both feet at a similar rate:\nI’ve been practicing all my life with both feet, to be honest, and I knew because it’s so hard to defend when you’re both footed. I realised maybe around the age of 16 or 17 when I got really into the first team and realised that I have to be even better at it to up my game. It helped me so much already with the goals that I’ve scored here and it makes me unpredictable.\non his left foot ability:\nI’ve been practicing all my life on it from the age of seven or eight when I started playing football. My granddad always told me you have to practice both because it will help you a lot and that’s what I did and that’s why I’m so comfortable on both at the moment.\non playing in different positions:\nIt doesn’t really matter if it’s in different positions. It’s always nice to have game time and help the team and have a run. That’s up to me to show every single game and on the training pitch for the manager to decide on the weekend.\non scoring when coming off the bench:\nI always try to be ready. Even when I’m on the bench and play only 15, 30 or even five minutes, I try to have an impact and that’s my mindset going into every game. I think you need that as a sub, you have to be ready. When you only play for 15 minutes the opposition are already a bit more tired so you need to take advantage of it and that’s what I try to do when I’m a sub.\non being a ‘finisher’ rather than a substitute:\nAt the end of the day it’s just a name, but everyone wants to have game time but it’s also about the mindset going into a game. If you have the right mindset, I believe good will come to you and I think that’s what’s happening to us. There are so many finishers scoring goals already this season and that will only help us going forward.\non if he can replace Granit Xhaka’s midfield position:\nYes I think so. It’s a position I can handle as well. I’ve played there with the Belgian national team. If I can get a run it’s different but I need to be switched on because it can change every week. It’s based on the game plan. Not every team plays the same system and the manager thinks a lot about those things so it’s up to me to keep going and pushing to have game time.\non how hard it has been playing against deep defensives this season:\nIt’s natural. We’ve seen it at Man City for example, when you’re doing so well as a team, people are going to adapt. That’s what’s happening to us as well and it’s up to us to get the game plan right and try to create as many chances as possible to score goals.\non working on set-pieces with coach Nicolas Jover:\nIt’s a pleasure to work with him. He’s really clever on set-pieces and we always try to… it’s such great aspect in the game where you can score from and open up a game and it’s so important at the moment. It helped us already a lot and we need to keep improving as well but we train on it as much as possible. When you play every three days a game there is not much time to work on that but we always squeeze it into the general game plan.\non playing with Bukayo and the connection between them:\nIt’s a coincidence at the moment. B has so much quality and it doesn’t really matter who is on the ball, I always try to get into great positions. B has already showed that last pass that he can make that one and you need to be ready for it to come. Every goal I got on the end of it and hopefully there are many more to come.\non facing Bukayo when playing for Brighton:\nI wasn’t the full back playing against him, but you could see his talent already. I had to focus on my own game back then as well, but you could always see that he has such big potential. He’s such a great player.\non where his positivity comes from:\nIt’s a tough question to be honest. I always try to be positive in general. I learned over the years, especially when you’re younger, not playing and are down, it will bring you even more down if you’re not positive. If you are more good things will come to you in life in general. I have two kids now so they help me a lot as well. Everyone around me, they’re the same as me or I won’t let them in my circle and that’s how I want to go in life.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 1649,
  "scraped_at": "2026-02-14T02:17:09.419754",
  "_text_extracted": true
}