{
  "article_id": "7bc4666e1554",
  "url": "https://www.fourfourtwo.com/news/tottenham-in-talks-with-eberechi-eze-and-could-complete-deal-quickly-report",
  "title": "Tottenham in talks with Eberechi Eze and could complete deal  quickly : report",
  "date": "20250530T193000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham in talks with Eberechi Eze and could complete deal 'quickly': report\nTottenham could make Eberechi Eze their marquee summer buy, with talks over a move progressing\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nTottenham rescued their season by winning the Europa League, and therefore qualifying for next season's Champions League.\nHowever, their 17th-placed finish probably indicates that the current crop of players at the Tottenham Hotspur Stadium are not good enough, and serious improvements are needed should they want to avoid a repeat of this campaign.\nOne way Tottenham are looking at improving their squad is by signing Eberechi Eze, who has been in sensational form for Crystal Palace as they achieved a record points haul and their first ever major trophy.\nTottenham lining up Eberechi Eze move\nEze scored 14 times in all competitions, including a run of six games in a row at the end of the season, which included the FA Cup semi-final and final, where he got the winner.\nHe also recorded 11 assists, and clubs across Europe have listed him as a potential target this summer.\nTEAMtalk are reporting that Tottenham are one of those clubs, and could close a deal for the attacking midfielder relatively quickly, owing to his £68 million release clause. The clause is said to activate this summer, but will end two weeks before the end of August.\nThey are said to be mulling a player-plus-cash offer first but may have to be quick, with Crystal Palace opening negotiations to extend the Englishman's stay at Selhurst Park.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nManchester United, Newcastle, Nottingham Forest, Arsenal and Aston Villa, are all said to be aware of the situation, while Bayern Munich see Eze as a alternative to Florian Wirtz, who appears to be on his way to Liverpool.\nEze is displaying a level of gratitude to Crystal Palace and is FourFourTwo understand he is not looking to force a move through, but is open to a move to an elite side and stake a claim to be heavily involved in England's squad at the 2026 World Cup.\nIn FourFourTwo's opinion, there is a small number of clubs that if they were to move for Eze, he should leave for. Clubs competing in the Champions League are an obvious leap up, however his ability suggests it would be a leap he could make, and other than that, a move away from Palace probably makes little sense.\nEze will be playing Europa League football next season if he stays at Palace, and moving sideways wouldn't make a huge amount of sense, given how important he is to his current side.\nFor Tottenham, it would signal their intent to not suffer the same fate as this season. Eze could immediately come into the first team, as an attacking midfielder, or off the left hand side and add creativity and goals.\nIf Spurs can slide in before a new contract and potentially offer player-plus-cash it will be good business as far as Daniel Levy is concerned.\nEwan is a freelance writer and social media manager who has worked for The Athletic, GOAL, 90min and OneFootball. From Gelsenkirchen to Riyadh, he has covered some of the biggest games in football in his three years in the industry.",
  "word_count": 656,
  "scraped_at": "2026-02-14T02:09:11.440300",
  "_text_extracted": true
}