{
  "article_id": "7bfe4696c584",
  "url": "https://www.themag.co.uk/2024/04/these-new-bruno-guimaraes-transfer-claims-are-unbelievable-newcastle-united-arsenal-psg/",
  "title": "These new Bruno Guimaraes transfer claims are … unbelievable",
  "date": "20240423T090000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "These new Bruno Guimaraes transfer claims are… unbelievable\nBruno Guimaraes has been excellent for Newcastle United this season.\nThe way things have turned out with the injury (and suspension) situation and so many players missing for so many matches, especially the likes of Joelinton and Tonali when it comes to the midfield area.\nSo much responsibility on the shoulders of Bruno Guimaraes and at times he has carried this team through some extremely runs of matches, with often the starting eleven picking itself for Eddie Howe, due to an entire other team’s worth (or more!) of Newcastle first team squad players having been unavailable.\nNo surprise then with his ongoing excellent form for Newcastle United, that we find the media putting out ever more transfer speculation that other clubs are interested in buying the midfielder AND that a move could happen this summer.\nSo many desperate media / journalists these days who are so desperate for attention / clicks, that if you were cynical, you might even wonder if at times they were simply making things up…\nIndependent Arsenal site Daily Cannon report – 22 April 2024:\n‘Arsenal have approached Bruno Guimaraes’ camp over a potential summer move, and he could be available for less than his release clause.\nBen Jacobs reports for 90min that Arsenal are interested in Newcastle United midfielder Bruno Guimaraes this summer, with Manchester City and Paris Saint-Germain also considering a move.\nJacobs adds that Newcastle would love to keep Guimaraes at the club, but he has a £100m release clause, and there is also a verbal agreement in place for the midfielder to talk to Champions League clubs.\nTheir agreement also means that Newcastle will engage with offers over £80m, even if they don’t reach the £100m mark.\nFootball insider Team News and Ticks reports that Arsenal have made contact with multiple targets or their clubs in the last week, to see if a summer deal is possible, and Guimaraes is on that list.\nIf the latest reports are to be believed, the situation may now have changed, and Arsenal could look to bring Guimaraes to the club to play alongside Declan Rice and Martin Odegaard in Mikel Arteta’s midfield.’\nSo what happens is, when it comes to say Bruno Guimaraes, is that one or more journalists will come up with a new ‘exclusive’ a new angle on a possible transfer move, then that just gets picked up by all the other desperate media and repeated over and over again, with often even extra bits added on, to give their own repeat of it, extra appeal. Make it stand out over the other desperate media / journalists.\nSo the latest ‘exclusive’ angle(s) are that we are supposed to believe that one or more journalists have discovered further intimate details of what is in Bruno Guimaraes’ Newcastle United contract.\nThose details we are supposed to believe, are that ‘Champions League clubs’ have a special status and can speak to Bruno Guimaraes without needing approval from Newcastle United, plus they are able to buy the NUFC star for anything over £80m, not the previously claimed £100m release clause figure.\nFirstly, if/when Bruno Guimaraes is going to leave Newcastle United, who other than ‘Champions League clubs’ would he feasibly want to go to? Championship clubs?? The only possible reason that could realistically put forward as to why Bruno Guimaraes would want to be leaving Newcastle United, is to stand more chance of playing Champions League football and winning trophies, as compared to how things currently stand at NUFC. I don’t believe in any way that this is going to happen this summer. However, in regard to these latest ‘in the know’ transfer claims and supposed intimate knowledge of Bruno’s NUFC contract, including ‘verbal’ agreements, it is all laughable.\nSpeaking of which… secondly, so we are now supposed to believe as well, that the release clause in his contract is now in reality anything over £80m, even if it says £100m in the contract.\nThe whole idea of Newcastle United renegotiating the Bruno Guimaraes contract earlier this season, was to tie him down for longer to the club AND then if at any time before that ends, he did end up leaving, that NUFC would get as much money as possible to then invest in new signings of our own. So in these situations, the player gets a big wage rise and in return Newcastle United get more security in terms of a longer contract AND as is the done thing with pretty much every major player that is with big clubs on the continent, a high release clause is included in the contract.\nThe thing is, nobody, especially pretty much all the journalists(!), knows for sure what the Bruno Guimaraes release clause figure actually is. It was reported by some media at the time the contract extension was announced as being £100m and that figure has stuck, probably in part because it is a nice round figure to quote, However, other journalists at the time, especially some of the usually more reliable regular NUFC journalists, said their understanding is that the release clause figure is actually significantly higher than £100m.\nWhat I do know is that those now running Newcastle United are nobody’s fools and that the last thing they are ever going to be is easy touches when it comes to money and doing deals. Just look at the ongoing embarrassment of Sir Jim Ratcliffe crying on because Newcastle United are telling Man U that they need to pay the compensation price tag, or Dan Ashworth will be in his garden until January 2026.\nSo £41.65m (£35m plus £6.65m add-ons, most of the additional money triggered if NUFC avoided relegation that first half season) was agreed to be paid in January 2022 to Lyon, and then Bruno Guimaraes has been a massive Premier League success for over two years, yet we are to believe that when Newcastle United went to all that trouble and expense to give Bruno loads more money in that enhanced new contract, the club agreed he could leave for anything over £80m?\nYou have to laugh.\nThis in an era where central midfielders who don’t even score or create goals, are getting bought by Premier League clubs for more than £100m.\nThese latest nonsense Bruno Guimaraes claims are now not just being repeated with an Arsenal angle, I have also seen similar lame PSG media claims and for other clubs, all based on what one or more journalists has now claimed, due to their sources / sauces.\nAlso, whilst you can never say never about anything, this nonsense in the media getting put out there, when the reality is that Bruno Guimaraes has just paid £4m for a new house at Darras Hall, that he, his wife and two very young children are now set to move into.\nHistory tells us that players are rarely for the full duration at your club until they retire but I think we can be very confident that Bruno Guimaraes will still be turning out for Newcastle United next season AND very confident, that he wouldn’t be sold this summer for £81m this summer.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1211,
  "scraped_at": "2026-02-14T01:56:51.547235",
  "_text_extracted": true
}