{
  "article_id": "7c012b89420a",
  "url": "https://metro.co.uk/2025/04/09/ange-postecoglou-responds-arsenal-chants-tottenham-real-madrid-22879884/",
  "title": "Ange Postecoglou responds to Arsenal chants about Tottenham against Real Madrid",
  "date": "20250409T161500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ange Postecoglou has been quizzed about Arsenal’s chants about Tottenham against Real Madrid in the Champions League on Tuesday.\nArsenal supporters poked fun at their north London rivals during their 3-0 quarter-final first leg victory over the Spanish champions at the Emirates.\nFans could be heard loudly singing ‘Are you Tottenham in disguise?’ towards the Real Madrid players in the second half of their European clash.\nSpurs head coach Postecoglou was asked about the chants in his pre-match press conference on Wednesday, before his team’s Europa League quarter-final first leg showdown against Eintracht Frankfurt on Thursday.\nOne reporter asked Postecoglou: ‘[Arsenal fans] were singing ‘Are you Tottenham in disguise’ – is that the kind of mentality, the whipping boys element, that you want to lose here or am I looking too much into it?’\nPostecoglou responded: ‘Oh mate… Yeah, I don’t know. You’re probably looking too much into it.\n‘We’re trying to concentrate on what’s important to us right now and that’s a big game tomorrow night.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nArsenal fans also targeted Real Madrid superstar Luka Modric during the match, loudly booing the former Spurs man whenever he touched the ball.\nSpeaking after the game, Modric insisted that Real Madrid are capable of turning the tie around against the Gunners in the second leg on April 16.\n‘If someone can do it, it’s Real Madrid,’ Modric told CBS Sports. ‘But it’s not going to be easy. Arsenal showed great quality, we need to do much better.’\nSpurs, meanwhile, are firmly focused on their Europa League clash with Eintracht Frankfurt as they look to end their 17-year wait for a major trophy.\nSome have suggested that Postecoglou’s future may depend on whether or not Spurs clinch the title but the Australian feels certain individuals won’t be convinced even if his side reach and win the Europa League final.\n‘Even the good stuff we may do is turned into ‘glass half-empty’ rhetoric,’ Postecoglou said.\n‘That can’t be a driver. The lads are keen to bring success to the club, keeping driving the principles of this journey in terms of playing our football.\nMore Trending\n‘Hopefully we worked our way into a position where we can make an impact on a disappointing season.\n‘I don’t think I can win the argument of convincing people. The general sentiment of people is ‘even if I win [the Europa League] I’m gone anyway’.\n‘We’re in a quarter-final, we don’t want to let that slip us by or have the wrong mindset.\n‘I think the players are handling it well, embracing the challenge.’\nMORE: PSG 3-1 Aston Villa: French champions come from behind in Champions League win\nMORE: Liverpool make breakthrough in Mohamed Salah contract talks\nMORE: Chelsea and Manchester United on alert as Liam Delap release clause revealed",
  "word_count": 515,
  "scraped_at": "2026-02-14T02:26:33.620686",
  "_text_extracted": true
}