{
  "article_id": "7c06c60ddfea",
  "url": "https://www.dailymail.co.uk/femail/article-12412311/proud-WAGs-cheering-Australia-England-World-Cup-semi-final.html",
  "title": "Meet the other Matildas ! FEMAIL reveals the proud WAGs who will be cheering for Australia as they take on England in the World Cup semi - final",
  "date": "20230816T100000Z",
  "domain": "dailymail.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Meet the other Matildas! The proud WAGs who will be cheering for Australia as they take on England in the World Cup semi-final\n- England v Australia in Women's World Cup semi-final is at 11am UK time today\n- Click HERE to read our England v Australia Women's World Cup live blog\n- READ MORE: David and Harper Beckham lead rallying cry to the Lionesses - as millions plan to ditch work to watch World Cup semi-final vs Australian Matildas\nThey're about to play in the World Cup semi-final against the Lionesses today - but thankfully for them, the Australian Matildas have very supportive plus-ones who will be cheering on the squad.\nA pack of proud partners are expected to turn out at Sydney's sold-out Stadium Australia as the team takes on England at 11am UK time.\nThe winner of today's contest will take on Spain for the trophy this Sunday, after they beat Sweden 2-1 yesterday to book their trip to the final.\nSupportive partners that fans might expect to see in the stands include goalkeeper Mackenzie Arnold's girlfriend and West Ham United teammate Kirsty Smith, who plays for the Scotland national team.\nHere, FEMAIL takes a look at the glamorous and encouraging WAGs of the Matildas.\nKirsty Yallop\nPARTNER: Tameka Yallop (midfielder)\nAustralian Matildas Tameka Yallop with New Zealand international Kirsty Yallop - who she married in 2017\nAustralian Matildas Tameka Yallop has previously opened up about feeling forced to repress her sexuality in the early parts of her career.\nThankfully, the Aussie was able to be comfortable in her own skin after meeting New Zealand international Kirsty Yallop - who she then married in 2017. Their daughter Harley was born in August 2020.\n'I felt for a long time it (sexuality) had to be suppressed and not really made common knowledge,' Yallop told News Corp earlier this year.\n'It probably wasn't until I met Kirsty that I was able to talk about it and felt we had each other and we would support each other in whatever was said or maybe looked down upon, or if we did come into any hurdles.'\nKristie Mewis\nPARTNER: Sam Kerr (forward)\nMatildas skipper Sam Kerr is in a relationship with US star Kristie Mewis (pictured together)\nThe sporting couple (pictured together) went public with their romance in 2021\nSam Kerr is in a relationship with American football star Kristie Mewis, who is a midfielder on the US squad.\nThe sporting couple went public with their romance in 2021, according to Marie Claire Australia.\nWhile they haven't squared off against each other on the World Cup pitch this year - due to the US team being knocked out by Sweden - they've previously faced one another.\nIt was after the 2021 FIFA World Cup, for instance, that rumours began to arise about a relationship between the pair, after Mewis comforted Kerr post-match when the US defeated Australia.\nToday's game will see England's Rachel Daly come face to face Kerr, who is dating the Lioness' ex-girlfriend Mewis.\nAston Villa star Daly split from Mewis in 2020, with Kerr reportedly beginning her relationship with Mewis the following year.\nErin Clout\nPARTNER: Alex Chidiac (midfielder)\nFootballer Alex Chidiac at a wedding with long-term partner of four years, Erin Clout\nChidiac has been in a relationship with Erin Clout, a player relations manager for Professional Footballers Australia, since 2019\nAlex Chidiac, 24, currently splits her time between Australia, where she plays for Melbourne Victory, and the USA, where she stars for Racing Louisville.\nShe has been in a relationship with Erin Clout, a player relations manager for Professional Footballers Australia, since 2019, according to PinkNews.\nThe stunning couple often take to Instagram to share loved-up photographs of themselves together.\nIt has been a rollercoaster four years for Alex since she was controversially left out of Australia's squad for the 2019 World Cup, with previous management not agreeing with Chidiac's decision to play in Spain with Atletico Madrid.\nTemica Sayer\nPARTNER: Emily Gielnik (forward)\nAustralian footballer Emily Gielnik, 31, who is a reserve on the team today, plays as a forward for Aston Villa. She has been with her fiancée Temica Sayer for eight years (pictured together)\nGielnik (right) proposed to Sayer last year prior to a Matildas camp, and she was a bundle of nerves before the heartwarming moment\nGielnik (pictured with her partner) recently revealed that there were many 'dark times' in her personal life, because, given her family upbringing, she didn't feel comfortable coming out\nAustralian footballer Emily Gielnik, 31, who is a reserve on the team today, plays as a forward for Aston Villa.\nShe has been with her fiancée Temica Sayer for eight years. But heartbreakingly, for much of that time she didn't feel comfortable telling the world about it.\nGielnik recently revealed that there were many 'dark times' in her personal life, because, given her family upbringing, she didn't feel comfortable coming out.\n'My mum being Croatian... being gay was frowned upon, so I never saw how I was going to come out and tell my family,' she said on the Disney+ documentary, Matildas: The World At Our Feet.\n'So I tried everything to live this lie for years. There was a lot of dark times.'\n'To be honest, if I didn't have football, I don't really know what other outlet I would have had,' she said. 'Football was the saving grace. The Matildas is a support system around everyone being equal and open, and I finally realised you love who you love.'\nAnd she is head over heels in love with Sayer - with the documentary capturing the heartwarming moment that changed her life forever.\nWhen the Matildas were set to go into camp ahead of two friendlies against Canada during August and September last year, Gielnik flew in from the UK one day early so she could propose to Sayer.\nKat Thompson\nPARTNER: Emily van Egmond (midfielder)\nEmily van Egmond recently got engaged to partner Kat Thompson in a romantic proposal by the ocean in California\nVeteran midfielder Emily Van Egmond will be appearing in her fourth World Cup for Australia\nCurrently in the USA playing her trade for San Diego in the NWSL when not starting for the Australian squad, Emily Van Egmond recently got engaged to partner Kat Thompson.\nThe footballer popped the question to her digital creator girlfriend during a romantic proposal by the ocean in California.\nConstantly looking loved-up in photographs shared online, the couple told New Idea they were 'aiming for the summer' for their wedding date.\nMcKenzie Berryhill\nPARTNER: Chloe Logarzo (midfielder)\nChloe Logarzo (left) announced her long-time partner McKenzie Berryhill had said yes to her marriage proposal in August 2021\nChloe Logarzo (pictured with her partner) is a midfielder for Australian club Western United and the Matildas\nChloe Logarzo (left) and fiance McKenzie Berryhill (right) travel all over the world as part of Logarzo's professional football career\nChloe Logarzo, 28, who is a midfielder for Australian club Western United and the Matildas, announced her engagement to her former Washington Spirit teammate McKenzie Berryhil in 2021.\nSpeaking to Daily Mail Australia at the launch of the A-League Women's season in November 2022, Logarzo said she isn't pushing any agendas - but just being true to herself.\n'I grew up not knowing anyone who was gay, literally not knowing a single soul, even though clearly they existed.\n'I didn't have an avenue to express my true self and I felt like I was on my own,' she said of her upbringing in Sydney during the late '90s and early 2000s.\n'I don't want to share an advocate in a way that I'm pushing it on people. I just live my life without lying to people about it, because I don't want to hide who I really am.\n'If you want to get offended by something, you can be offended, but that's on you and it's your choice - it's not a reflection on me. I'm just living my life and bringing a positive attitude... (and) putting back into the world what I would want to see.'\nUnfortunately, despite being so comfortable in her own skin now and trying to be a role model for the next generation, it wasn't always so easy.\n'I'd come out as gay to my parents when I was 17. They were a bit stunned and didn't show emotion either way,' Logarzo wrote for the Athlete's Voice in 2018.\n'That wasn't good enough for me. I took it to mean they didn't approve when all they were really trying to do – as I realised much later – was deal with the initial shock and process what I'd told them.'\nDanielle van de Donk\nPARTNER: Ellie Carpenter (defender)\nEllie Carpenter (right) and partner Danielle van de Donk can often be seen taking in the sights of Europe when they're not on the field\nThe self-confessed foodie has just bought a house in Lyon with partner and teammate Danielle van de Donk (who will play for Netherlands at this World Cup)\nHailing from the tiny farming town of Cowra in central-west NSW, Ellie Carpenter is now a certified globetrotter, having played in the US and France, where she is a lynchpin in football's most successful women's club side, Olymipique Lyonnais.\nShe's a two-time Champions League winner, PFA Women's Footballer of the Year and won the French league three times, all while retaining her wicked sense of humour, a twinkle in her eye and a relentlessly sunny attitude - albeit with a little more Versace.\nThe self-confessed foodie has just bought a house in Lyon with partner and teammate Danielle van de Donk (who will play for Netherlands at this World Cup).\nShe can often be seen on her Instagram feed taking in the many gourmet eateries in the famous town, or at exotic European locations if she isn't on the pitch.\nKirsty Smith\nPARTNER: Mackenzie Arnold (goalkeeper)\nMatildas goalkeeper Mackenzie Arnold is currently in a relationship with Scottish footballer Kirsty Smith\nMatildas goalkeeper Mackenzie Arnold is currently in a relationship with Scottish footballer Kirsty Smith.\nThe pair - who have been dating since 2022 - are teammates as they both play for West Ham.\nThey'll be no split loyalties for Kirsty during today's semi-final match, since she plays for the Scottish national team.",
  "word_count": 1723,
  "scraped_at": "2026-02-14T02:07:08.848557",
  "_text_extracted": true
}