{
  "article_id": "7c17350813ea",
  "url": "https://www.sportingnews.com/ca/soccer/news/croatia-player-wearing-mask-josko-gvardiol-injury-face/jzkzd7xhgbrv3m25t3rwgqah",
  "title": "Why is Croatia player Josko Gvardiol wearing a mask ? Injury forces defender to don face protection vs Morocco",
  "date": "20230107T224500Z",
  "domain": "sportingnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Men in masks have become infrequently familiar sights on the pitches of the 2022 FIFA World Cup, including Ballon d'Or nominee Son Heung-min, who played in every minute of South Korea's run to their Round of 16 exit against Brazil, despite fracturing an eye socket in November.\nBelgium defender Thomas Meunier featured for Belgium while sharing the pain of a cheekbone fracture with fellow mask-wearer and Tunisia stalwart Ellyes Skhiri.\nMasks have become commonplace to provide limited protection to players suffering from often-gruesome facial injuries across recent years, and Son's quick adaptation to the headwear was an example of how the measure appears to have become an easier one for players, as the technology used to create the masks has improved.\nThe player who is arguably Croatia's most promising talent has gone furthest at the finals while wearing a mask. Here's why Josko Gvardiol is donning one, and the rules around them.\nMORE: World Cup final best bets, predictions and odds for 2022 showpiece\nWhy is Croatia's Josko Gvardiol wearing a mask?\nRB Leipzig defender Gvardiol showed admirable good humor while sharing a photo of a huge dark swelling under his right eye and over his eyelid after playing for his German club in November.\n\"You should see the other guy,\" the 20-year-old said on Instagram, describing an injury that caused Sasa Jankovic, the doctor of the Croatian national team, to discuss the matter with his counterparts at the Bundesliga club.\n\"We have no reason to worry because Josko will be able to train and play normally from the first day of the national team gathering while, of course, wearing a mask,\" said Jankovic.\n\"We also heard from Josko, who already felt fine that same evening. Although it’s an unpleasant blow, we don’t need to worry about Josko in the context of the World Cup.\"\nBatman and Robin 👀 pic.twitter.com/Ke0XITAI1M\n— Joško Gvardiol (FAN) (@GvardioI) November 17, 2022\nWhat is Josko Gvardiol's injury?\nUnlucky Gvardiol broke his nose and injured his face and eyes when he collided with teammate Willi Orban in a match in early November.\n\"Apart from his broken nose, everything is fine,\" RB Leipzig coach Marco Rose said at the time. \"Now we have to see if he can play with a mask, but he’s otherwise making a good impression.\n\"We will see how he copes with the workload and assess whether he's in pain when he's working intensively.”\nIt was good news for Rose, as Gvardiol was available for Leipzig's subsequent 2-1 win over Werder Bremen in their final game before domestic action paused for the World Cup. That result extended the club's run to six successive victories in the Bundesliga and UEFA Champions League.\n😳😳😳😳 the aftermath of the accident, I wonder how Willi Orban's head is feeling? 😂 pic.twitter.com/30cin0sYCg\n— Joško Gvardiol (FAN) (@GvardioI) November 10, 2022\nGvardiol played every minute of the latter four games of Leipzig's group-stage campaign in the Champions League, scoring in a win over Real Madrid to help his team finish a point behind the reigning champions, as the Germans qualified for the knockout phase of the competition.\nThe Dinamo Zagreb youth product has also been ever-present for Croatia in Qatar so far, as the 2018 World Cup finalists made it all the way to the semifinals before they were beaten by Argentina.\nAre face masks allowed by FIFA?\nThe guidance from rule-making governing body the International Football Association Board (IFAB) classes facemasks as permitted non-dangerous protective equipment, citing knee and arm protectors, goalkeepers' caps and sports spectacles as other examples of on-pitch equipment that are allowed.\nIFAB says masks are fine, as long as they consist of \"soft, lightweight padded material\", adding that head covers must be black or the same main shade as the relevant team's shirt.\nThe masks are made from materials such as polycarbonate, according to the Guardian, which says that some are 3D printed to exactly fit a scan of the contours of each player's face.\nThat report adds that Tottenham forward Son's mask, which he may need again when Spurs resume their Premier League fixtures at Brentford on December 26, is made of carbon fiber.",
  "word_count": 692,
  "scraped_at": "2026-02-14T02:16:35.985033",
  "_text_extracted": true
}