{
  "article_id": "7c1a47d129c7",
  "url": "https://www.67hailhail.com/news/kyogos-pre-season-verdict-of-brendan-rodgers-and-what-his-celtic-goal-celebration-really-means/",
  "title": "Kyogo pre - season verdict of Brendan Rodgers and what his Celtic goal celebration really means",
  "date": "20230723T081500Z",
  "domain": "67hailhail.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Now that the Japan Tour is over, the Celtic fans are digesting what they have witnessed in the first two fixtures under Brendan Rodgers.\nThe games against Yokohama F Marinos and Gamba Osaka gave us a glimpse of what kind of football and tactics to expect under the Celtic manager and it’s fair to say that the familiar pressing style we have seen over the last couple of seasons continues with a couple of tweaks thrown in to mix it up.\nCeltic striker, Kyogo Furuhashi, has opened up on what he thinks of Brendan Rodgers so far and how he feels adapting to the new manager’s style of football. And it’s fair to say the Japanese forward is looking forward to the new season under the new Celtic manager.\nKyogo said [Daily Record], “I think he is very good at communicating with the players. I have only worked with him for a short period of time so I am still in the moment where I need to understand what he wants.\n“At the same time we have to show on the pitch what he wants as well. That’s my initial impression. We have an exciting time ahead. We experienced the Champions League last year so I am looking forward to competing in it again this year.\n“But we have the league games first and we need to concentrate because if we don’t do well in the league games we won’t have success in the Champions League. So our focus is on the league right now.”\nKyogo explains what his goal celebrations really means\nKyogo’s goal record at Celtic has been nothing short of remarkable. 20 in his first season despite a lengthy lay-off with a hamstring injury was followed up by 34 in all competitions last season.\nThe Celtic fans will be hoping to see their Japanese talisman continue his red-hot scoring streak that we have been enjoying over the last two seasons. Kyogo’s goal celebration where he raises both hands and touches them above his head has become a bit of a trademark over the last two seasons.\nBut what is the story behind it? Kyogo reveals all, “It’s the mushroom! When I was younger people always said my hairstyle was like a mushroom.\n“They said, ‘You are the mushroom!’ So I said, ‘Okay, I’ll make it as my celebration.’”\nSo, there you have it. Who would have thought that a simple reason such as a hairstyle would have inspired a celebration that the Celtic fans have grown to love over the last two seasons?\nAlthough that hairstyle is now gone, the goal celebration hasn’t. Let’s hope we see more of it as the team continues their preseason preparations in the upcoming matches against Wolves and Athletic Bilbao.\nIn other news, Celtic handed big Cameron Carter-Vickers boost as Lennoxtown report emerges",
  "word_count": 472,
  "scraped_at": "2026-02-14T01:53:51.861467",
  "_text_extracted": true
}