{
  "article_id": "7c2f701bf8f8",
  "url": "https://www.qatar-tribune.com/article/172618/latest-news/al-sadd-lift-falcon-shield-for-18th-time",
  "title": "Al Sadd lift Falcon Shield for 18th time",
  "date": "20250419T003000Z",
  "domain": "qatar-tribune.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "DOHA: Giants Al Sadd steamrolled to their 18th and a second successive Qatar Stars League title over powering Al Ahli 5-0 in a sizzling final Week 22 match of the Ooredoo Stars League 2024-2025 season at the Jassim Bin Hamad Stadium on Friday.\nPresident of Qatar Football Association and QSL Jassim bin Rashid Al Buenain, and CEO of QSL Hani Taleb Ballancrowned Al Sadd as champions in the presence of Vice-President of Al Sadd club Eng Abdullah bin Hamad Al Attiyah, and Board Member of Al Sadd club Sheikh Khalifa bin Khalid Al Thani, and CEO of Ooredoo Qatar Sheikh Ali bin Jabor Al Thani.\nStriker Akram Afif led the charge for The Wolves with the opening goal in the 13th minute (Penalty) before Moustafa Tarek Mashal (44th minute), Paula Otavio (45+2 minute), Rafa Mujica (67th minute), and Claudinho (81st minute) added more to the scoreline.The much-needed victory ensured Al Sadd lift the coveted Falcon Shield once again, ending the season with 52 points and edging out arch-rivals and title hopefuls Al Duhail, who with 1-0 win against Al Khor ended on 50 points. Al Ahli, who ended in top four with 35 points, clinched AFC Champions League Two qualification. Al Duhail, along with Al Gharafa (41pts), and champions Al Sadd make it to the AFC Champions League Elite for the new season.\nWith Al Sadd needing a win to be sure of the title, they went up the lead early as Al Ahli’s Talal Abdulla Bahzad fouled while trying to tackle an advancing Afif inside the ‘D’ on the right and near the goalline. The referee initially ruled out a foul but a VAR check showed that Bahzad had stepped on the left-foot of Afif and that the latter wasn’t play-acting. Afif soon stepped up and scored coolly from the spot into the left corner.\nA determined Al Ahli tried to make amends but in the 21st minute an Abdelrahman Mohamed Moustafa strike hit the bottom of the left post.\nFourteen minutes later, Moustafa had another chance as he came face to face with Al Sadd goalkeeper Meshaal Barsham, after being put through with the ball, but in trying to lob the ball over Barsham, the player did too much and the ball sailed over the post.Al Sadd wouldn’t give away any more leeway and hit back strongly just ahead of the half time whistle.\nThe lead was doubled after a Claudinho long strike was spilled by Al Ahli goalkeeper Marwan Sherif and a charging in Mashal put the ball into the net.\nAl Ahli’s hopes were further dashed within minutes as Otavio deflected home a super Afif cross from the left to make it 3-0. The quick twin strike left former Al Sadd and Barcelona coach Xavi Hernandez, who was in attendance at the stadium.In the second session, Al Sadd stamped their class and authority further.\nAfif again lit up the stadium for his team’s numerous fans as he attempted to score with a left-footed strike in the 66th minute but the kick was well stopped by a diving Sherif. It didn’t matter as in the very next minute Afif provided Mujica with a fine cross from the right to score (4-0).\nClaudinho also joined in the goal-scoring delight as he thumped in a down-headed volley from Paulo Otavio (5-0).Afif and Mujica ended with 18 goals each, the highest for their team in the league championship. Al Rayyan’s Roger Guedes scored the most, 19 goals. Baghdad Bounedjah of Al Shamal also ended up with 18 goals.\nSoon after Al Sadd’s game, Afif sported a t-shirt which said, ‘The Night of Hit Show, Impossible became possible. Only with Al Sadd’.It was Al Sadd’s tenth Qatar Stars League triumph since the 1999-2000 season.\nAl Sadd fans displayed the digit “80” placards signifying The Wolves’ whopping number of titles won so far in domestic and regional tournaments as celebrations continued for long.",
  "word_count": 651,
  "scraped_at": "2026-02-14T01:52:20.895267",
  "_text_extracted": true
}