{
  "article_id": "7c38398783aa",
  "url": "https://www.themag.co.uk/2023/06/the-newcastle-united-class-of-2022-23-sean-longstaff/",
  "title": "The Newcastle United class of 2022 / 23 - Sean Longstaff",
  "date": "20230619T131500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Newcastle United class of 2022/23 – Sean Longstaff\nHere at The Mag we have asked 20 of our regular / irregular contributors to pay tribute to the 20 Newcastle United players who started two or more Premier League matches this past 2022/23 season.\nTo an extent guided by their preference, each writer has been allocated one player each.\nThis series of articles runs from Thursday 1 June to Tuesday 20 June with one player covered each day, each article appearing at noon.\nThis will be starting with the player who had the lowest NUFC squad number (Kieran Trippier), right through to the highest (Bruno Guimaraes).\nToday’s Newcastle United player from the class of 2022/23 is Sean Longstaff, our thanks to David Punton for providing this overview:\nYour three stand out moments of the season for this player?\nWhat an impact Sean Longstaff has had this season.\nHe deserves all the credit for his efforts. Sean is a real home-grown star.\nLongstaff’s brace in the second leg of the League Cup semi final at St James’ Park were two huge goals. He fired us to Wembley that night when the nerves were jangling. A dream came true and he’ll always be remembered for his heroics that night.\nHis attitude all season has been spot on. He’s got a fabulous attitude and thanks to Eddie Howe he is playing the game with a smile on his face once again.\nHis fitness levels have stood out all season, having made 42 appearances in all competitions. Scored a nice goal away at Fulham too.\nWhat have been this player’s strengths this season?\nSean is the type of super fit footballer who can run and run. He’s got cast iron lungs.\nThe lad covers every blade of grass in that midfield engine room, and it’s work rate and tracking back that stand out, not to mention he can follow what the manager wants from him, which is a world away from how he was handled by a certain Steve Bruce.\nHis weaknesses?\nHe needs to add more goals to his game. A return of three this season is okay but we’d all love it to be a few more.\nWhen he first broke through he showed he can hammer the ball from long range, maybe he needs to have a few shots at goal when he gets into the right position.\nPerhaps gives the ball away cheaply, at times?\nHow would you describe his contribution overall this season?\nOne word: Immense.\nWhen he was out injured he was such a massive miss. Everyone was saying the same thing – ‘we need Sean back in the side’.\nHe’s beyond doubt a central reason why our club cracked the top four and will be playing Champions League football next season. I can’t wait to see him run out to that famous music.\nOn a scale of 1-10, how important will this player be to Newcastle United next (2023/24) season?\nNine. We’ll need him for his running and his work rate. It’s going to be a long season so Sean will get his chances, in fact he’s the first name on the team sheet.\nIf we bring in a new centre mid it’ll be a shame if he has to make way.\nWhat do your see their role in the team / squad being next season for Newcastle United?\nPlay maker. His passing is going to be vital, alongside Bruno and Willock. It’s quite a midfield unit. Sean has a key role to play and his attitude is really good for team spirit.\nIs there more improvement Eddie Howe can get out of this player?\nI think Eddie Howe is such a good coach that he can get more from Sean and take his game up a few more notches.\nThere was a game against West Ham three or four years back when there was a debate about Sean Longstaff being as good as, or better, than the emerging Declan Rice.\nNot long after that Steve Bruce came on the scene at Newcastle. Sean wasn’t coached well enough, and, by his own admission, he had a struggle with his mental health.\nIt even looked like he could be off to Everton and a fair few of us thought the kid wasn’t good enough.\nHow wrong we were. Howe can do more with him, for sure. It’s work in progress.\nWhat rating out of 10 would you give this Newcastle United team / squad for the 2022/23 season?\nNine out ten. Top four and a League Cup final appearance has to secure a high score. On another day, if we’d been in better form, we could have had that trophy.\nIn comparison, what would be the individual rating you’d give out of 10 for your player’s contribution this past season?\nEight out of ten. All that was missing was a few more goals.\nHow gutted would you be if this player left Newcastle United this summer?\nSean was disillusioned under the Steve Bruce era, with Ashley as owner. A new contract had become log jammed and it looked like he was out the door.\nHow things have changed since Ashley sold up and Bruce was rightly sacked by the new owners.\nGiven the turnaround, I’d be gutted if Sean Longstaff was to leave the club. He has his best years ahead and needs to be spent here at home.\nPlease predict what Eddie Howe’s first choice eleven will be next season and just put ‘New Signing’ if you think the NUFC Head Coach will bring in a new first choice for that position.\nPope; Trippier, Schar, Botman, New signing; Bruno, Willock, New signing; Joelinton, Wilson, New Signing.\nThere may well be a reality here that the club wants to improve and Sean Longstaff, like all players at the club, will have to fight for his place in the side.\nAs I said above though, he will get games and have a key role, as will Elliot Anderson and Lewis Miley, who are the next two to watch from academy to first team level.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1029,
  "scraped_at": "2026-02-14T01:50:37.800196",
  "_text_extracted": true
}