{
  "article_id": "7c5313e2c972",
  "url": "https://www.liverpoolfc.com/news/opposition-lowdown-inside-track-sparta-prague",
  "title": "Opposition lowdown : The inside track on Sparta Prague",
  "date": "20240306T110000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Q&AOpposition lowdown: The inside track on Sparta Prague\nLiverpool travel to face Sparta Prague in the first leg of their Europa League Round of 16 meeting.\nThe Reds return to European action on Thursday evening (5.45pm GMT kick-off), having qualified for the knockout stages as Group E winners.\nJürgen Klopp's squad now face Czechia's champions in their quest to reach the quarter-finals of the competition.\nHere, Liverpoolfc.com chats to Pavel Šťastný, a football journalist covering Sparta Prague, about what to expect from Brian Priske's side…\nPavel, thank you for speaking to us. Firstly, could you give us a brief overview of Sparta's season so far? They're currently top of the league…\nThis season has been very successful so far for the club. Sparta is currently very confident and in a good mood and they have good reason for that. Last week they played two matches with Slavia Prague, their biggest rival in the Czech Republic. They advanced to the semi-finals in the domestic cup and are still in first place in the league, holding an advantage of four points over their rivals. They have been extremely strong and appear to be well on the way to defending the league title. Sparta also have a very strong home record, having yet to be beaten in their own stadium and put on some very confident performances in front of their own supporters.\nHow has the Europa League campaign been? It appeared to be a big win over Galatasaray in the play-off round – how important was that for the club?\nFirst of all, Sparta wanted to qualify for the Champions League in the summer, but were eliminated on penalties by FC Copenhagen. It was a little disappointing for the club and fans. Since then, though, Sparta has fully focused on the Europa League and showed some real quality. Finishing in second place in the group with Real Betis, Rangers and Aris Limassol was a huge success for them.\nParticipating in the Europa League play-offs was an accomplished goal as well. They were given a tricky tie but these players have a winning mentality and showed huge courage. The win over Galatasaray then confirmed Sparta's move to this stage. It was a big night for the players, coaches, club and supporters. Sparta were the better team, they played dominantly and offensively and it was easily one of the best performances this season.\nCan you tell us a little bit about manager Brian Priske and his style of play? What formation does he favour?\nPriske came to the club in the summer of 2022 and changed the team in many aspects. Sparta settled into a 3-4-3 formation and now has a clear way of playing. They set out with high pressure and are dangerous in quick counter-attacks. The wingers play a key role in the game system – both Lukas Haraslin and Veljko Birmancevic have goals and assists this season.\nIn a year-and-a-half at the club, the coach has instilled in the players a huge belief in individual quality and a winning mentality, claiming a first league title in seven seasons last year, while Priske has made Sparta a competitive team in Europe. It is also because the club has backed him too, bringing in players such as Kaan Kairinen, Qazim Laci and Angelo Preciado, who all fit into the game plan.\nAnd if you had to pick out a dangerman for Sparta, who should Liverpool fans be watching out for in particular?\nLadislav Krejci is a great personality of the club, he has a great mentality and is a leader. He scores a lot of goals as a defender and is key to the team with his presence on the pitch. However, winger Haraslin can clearly be of huge interest to Liverpool fans. He is capable of causing any defence problems, he has good technical skills and is very productive. He has scored 14 goals so far this season and is a real threat in the final third of the pitch.\nJürgen Klopp recently described the tie as a 'proper test' for his team, but how are the two games against Liverpool being viewed in Prague?\nEveryone in Prague knows that Liverpool is one of the top teams in Europe and is a clear candidate to win this competition. It will be a great experience for the fans and the club. Tickets sold out immediately and interest is still huge in the tie. Players and coaches of Sparta wanted to play against Liverpool and, as you may have seen on social media, the team celebrated the moment they were drawn Liverpool a few weeks ago.\nYou have to accept cookies in order to view this content on our site.\nSparta talk about the opponent with huge respect but at the same time with great determination to show their quality. The important thing is that they are encouraged by the win over Galatasaray in the last round. They know they are capable of playing against big teams because of that. I believe they take the tie as a reward for their hard work over the last year-and-a-half under Priske.\nLastly, how do you think Sparta will approach the tie over the two legs?\nSparta players believe they can compete with Liverpool at home. The atmosphere in the stadium has been electrifying in recent months with their run of form this season. Sparta's players will try to assert an active style of play in the first match and will want to aim for a win to take to Anfield. Although the chances of qualifying for the quarter-finals are probably not great overall, they will want to leave a good impression over the two legs and give a strong account of themselves.",
  "word_count": 956,
  "scraped_at": "2026-02-14T02:10:47.917781",
  "_text_extracted": true
}