{
  "article_id": "7c6c8d823b34",
  "url": "https://www.nytimes.com/athletic/6069881/2025/01/19/david-alaba-real-madrid-acl-return/",
  "title": "Inside David Alaba Real Madrid return : 399 days out , holidays with physios and inspirational bench role",
  "date": "20250119T094500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After 399 days out injured, David Alaba is set to return to football today.\nThe 32-year-old Austria international was a key part of Real Madrid’s defence as they won their 14th Champions League/European Cup title in 2022. After signing on a free transfer from Bayern Munich, he provided one of that campaign’s memorable images when he lifted a white chair in celebration after his side’s remarkable round-of-16 comeback against Paris Saint-Germain. That chair is now displayed in the club museum.\nDon’t you sit in our chair! pic.twitter.com/lmJAMyM8UD\n— David Alaba (@David_Alaba) March 9, 2022\nBut after those highs, Alaba experienced the lowest moment of his career on December 17, 2023, when he ruptured the anterior cruciate ligament (ACL) in his left knee after challenging Villarreal striker Gerard Moreno in a game in La Liga. It was an innocuous coming-together that led to Alaba’s leg being pinned to the ground.\nAdvertisement\n“My knee…” Alaba said as he lay on the pitch. Luka Modric and Rodrygo put their hands on their heads when they heard their team-mate. Jude Bellingham sighed and looked up to the sky — goalkeeper Thibaut Courtois and centre-back Eder Militao had already suffered the same injury that campaign (Militao is currently out with an ACL injury).\nGO DEEPER\nACL injuries are a risk for male and female footballers but so much is still unknown\nThe Bernabeu had fallen silent.\nSince then, Alaba has undergone surgery twice, his return date has been pushed back and reports even surfaced suggesting he might leave the game entirely — denied by the player’s camp. He missed Madrid’s 15th Champions League success and Austria’s European Championship in Germany, although he remained a vocal figure from the bench for both club and country.\n“It was a really long and hard process, not an easy year for me… I’m so happy to be back with the team; I missed it a lot,” Alaba told Real Madrid’s official channels this month.\nView this post on Instagram\nThe Athletic tells the inside story of what some sources close to the club consider the most complex of Madrid’s recent injuries. The people we spoke to for this piece asked to remain anonymous to protect relationships.\n“This season is cursed… we’re going to remember it forever,” sources on the coaching staff told The Athletic in the aftermath of Alaba’s injury.\nIn the hours that followed, different doctors in Madrid and Innsbruck, Austria, assessed whether the defender should undergo surgery. As well as rupturing his ACL, there was damage to cartilage in Alaba’s knee, which is common in such cases.\nThe player decided to go ahead with the surgery under the supervision of Dr Christian Fink, the Austria national-team doctor who had operated on Bayern Munich players including Niklas Sule, Leroy Sane and Javi Martinez, and this took place on December 19. He travelled to Innsbruck for the surgery with his close friend Philipp Koblischek, a retired Austrian footballer, and Real Madrid physiotherapist Pedro Belon, one of the key people in the recovery process.\nAdvertisement\nIt was Belon who explained to Alaba the severity of the injury and was realistic with him about the recovery process and how long it could take to get back on the pitch, from the surgery to all the rehab that was necessary to be ready to play elite sport again. Other people were suggesting to Alaba that the injury was not as serious as that, and that he could be back playing sooner. Belon was so focused on helping Alaba return that he, along with another Madrid physio, Guillermo ‘Willy’ Zurdo, even joined the player on his holidays to help him with his rehab.\nThe first indications from the club and the player’s camp were that Alaba would return in October 2024. Madrid are always cautious with the timeframes they put on the recovery of injured players to avoid putting pressure on them, but this date was pushed back as Alaba’s recovery progressed.\nIn the first few months, various sources close to Alaba say he was isolated and sad. He did not want to share much about what he was going through. He had never experienced an ACL injury before but those around him were confident he would pull through. Alaba is seen as a strong personality, with the story regularly cited of how when he arrived at Madrid, he called club legend Sergio Ramos to ask for his No 4 shirt. Ramos left the club as Alaba arrived from Bayern in the summer of 2021.\nThe Austrian’s resilience was tested in March 2024, when it began to emerge that there were possible complications around his recovery. Club sources and voices within the player’s camp denied this at the time, saying that his fortnightly trips to Innsbruck were scheduled and that all was well.\nTwo months later, however, in May 2024, the player underwent another surgery — a minor arthroscopy, as The Athletic reported. Various people involved in the operation say this setback was due to Cyclops syndrome — a condition that can occur after knee surgery when a growth develops.\nAdvertisement\nOne Madrid staff member said: “At his age, an injury like this in most cases could be the end for top players because other complications could arise that would make it difficult to perform activities without pain.”\nMadrid’s medical department told coaching staff this new surgery would not extend Alaba’s recovery process. The club did not release a statement.\nBut in the following months, Madrid staff began to have serious doubts as to whether Alaba could return to his previous level. According to those with knowledge of these cases, almost all players return to the pitch after an ACL injury but their “return to performance” rate — ie, whether they can still perform at their best — is much lower.\nIn May, it became clear to those at the club and the Austria national team that he would not feature for his country at the Euros. So Austria coach Ralf Rangnick offered Alaba the chance to come to the tournament in a non-playing role and lead the team from the bench instead.\nSomething similar happened in last season’s Champions League semi-finals against Bayern Munich in May, when the defender cheered on his team-mates from the sidelines. After the Joselu-inspired comeback in the second leg at the Bernabeu to make it to the final at Wembley, Alaba once again performed his trademark chair celebration.\nWhile those close to him say he found it strange watching games from the stands in the first few months of his recovery, Alaba began to understand the important role he could play for his team-mates while not on the pitch.\nIn the summer, Real Madrid head coach Carlo Ancelotti asked the board for a central defender to cover for injuries including Alaba’s. But after Madrid lost out on Leny Yoro to Manchester United in July, the club did not make any concrete moves.\nThe situation in defence was compounded by further ACL injuries at the start of the 2024-25 season. In August, promising academy centre-back Joan Martinez was sidelined with the injury, along with right-back Dani Carvajal in October and Militao (again) a month later.\nAdvertisement\nAll this meant even more attention was focused on Alaba, whose return was pushed back, first to December and then to January. The doubts over his recovery meant there were even reports of a possible early retirement.\nIn late September, the Austrian started working on the pitch. According to staff members, he could not run for 10 minutes continuously at this point because of the risk of his knee swelling. Those same sources say the pace of his sessions had to be increased very gradually while he built up his muscle strength.\nDespite the complications, the player’s camp and Madrid staff played down the possibility of Alaba not returning to the game. On October 18, Ancelotti said: “He is recovering well and will soon be with the team, so for the moment we are not thinking of making any more signings.”\nBut, internally, the coaching staff complained there was a lack of staff to look after injured players (18 of the 22 in the squad have been injured at some point this season).\nUntil then, only rehab coach Jose Parrales had helped returning players, so fitness coaches Giuseppe Bellistri and Sebastien Devillaz occasionally assisted.\nIn November, the club responded by promoting the academy’s physical preparation coordinator Ruben Cipriano to help with the final phase of Alaba’s recovery and work out the best way for the player to perform specific rehab exercises.\nAlaba became close to both Cipriano and Belon and sources say he was very positive and in good spirits. That contrasted to other moments during the process when Alaba appeared downcast at Madrid’s Valdebebas training ground, sometimes making the physios’ work with him difficult — although this was seen as normal given his situation.\nVoices at Valdebebas say Alaba often spent four to five hours a day working with the physios, on the pitch, in the gym, in the pool and again with the physios. Alaba made good friends with injured 20-year-old academy defender Jacobo Ramon, with the pair helping each other stay motivated. Those within Alaba’s camp say he also works with a personal fitness trainer at home.\nAdvertisement\nOn November 7, Alaba began working with the ball again. A month later, he started working with the first-team group for part of a session and on December 30, he was involved in the team’s training session that was open to the public. He only took part in exercises where he would not collide with his team-mates and performed some running exercises with Cipriano, where fans showed their affection for Alaba.\nIn a January 2 press conference, Ancelotti said Alaba would be able to play again “around January 20”. Some on the board told The Athletic there would be no need for signings in January with Alaba’s return, adding that they expected him to be back to his best by March or April.\nDuring the recovery process, however, some staff sources expressed their belief we might have to wait until the 2025-26 season to see Alaba back to his best. Other experts in these cases say that is the norm for ACL injuries, where the key is to return gradually.\nIn any case, the coaching staff are optimistic. They see Alaba as a different type of defender — he is the only left-sided centre-back in the squad — who can be another leader in the dressing room given his experience and influence. Ancelotti has shown his support and encouragement to Alaba at various points.\nThose at the club and within his camp see him as an intelligent person who can provide inspiration to other players. In the last few months, some of his recovery has been filmed by a production company.\nToday’s game in La Liga against Las Palmas at the Bernabeu should bring an end to a difficult period for Alaba, with Ancelotti confirming at his press conference yesterday that he can play some minutes (albeit not from the start). His family will be there to see it.\nAnd, despite interest from clubs in Saudi Arabia, his camp says he is determined to succeed at Madrid, and even that he harbours a desire to extend his contract with the club, which runs out in 2026.\nThat, however, that can wait. Alaba is just relishing the chance to play football again and taste more success with the club that have missed him so much.\n(Top photo: Alexander Hassenstein/Getty Images)",
  "word_count": 1928,
  "scraped_at": "2026-02-14T02:02:19.850135",
  "_text_extracted": true
}