{
  "article_id": "7c93553f5114",
  "url": "https://www.empireofthekop.com/2024/05/24/pete-orourke-liverpool-nunez-transfer-claim/",
  "title": "Transfer reporter drops Darwin Nunez claim as Arne Slot verdict awaits",
  "date": "20240524T233000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Two years on from joining Liverpool, the jury still appears to be out on Darwin Nunez to a large degree.\nThe explosive Uruguayan has been pilloried by numerous pundits in the UK over his sometimes erratic finishing, despite racking up 33 goals in his first couple of seasons at Anfield. However, according to Pete O’Rourke, that mightn’t be enough to secure his future at the club.\nSpeaking on Football Insider’s Inside Track podcast, the journalist claimed that the Reds could be prepared to entertain offers for the 24-year-old this summer, amid reported interest from Barcelona.\nWhile O’Rourke stated that the LaLiga giants probably wouldn’t be able to afford Nunez, the striker may be left sweating on the verdict of Arne Slot, who’s set to assess his squad and determine whether or not our current number 9 fits into his plans.\nREAD MORE: Liverpool could soon receive a boost over summer transfer plans for 22y/o ‘baller’\nAfter a dry run of form which only saw him score once in the Premier League since his 99th-minute winner at Nottingham Forest on 2 March, Nunez lost his place in the starting XI towards the end of the season, starting just one of the final six matches of Jurgen Klopp’s reign.\nThe managerial change could yet offer the 24-year-old a much-needed clean slate, if Slot decides to overlook the striker’s springtime malaise in deference to the kind of form which saw him score six goals in eight league games from Christmas to that last-gasp victory at the City Ground.\nGiven the injury crisis which plagued Liverpool throughout the campaign, and with two additional group fixtures to factor into next season’s Champions League, it’d seem a big risk to frivolously jettison players who’ve shown that they can make a telling impact.\nThat said, it’s hard not to get a sense that 2024/25 could well and truly be make or break for Nunez at Anfield, having not yet been able to win over his plethora of critics.\nWe expect that Slot will give the Uruguayan at least another year to dispel the doubters once and for all. If so, let’s hope that our number 9 makes the most of that opportunity.",
  "word_count": 365,
  "scraped_at": "2026-02-14T02:01:16.456823",
  "_text_extracted": true
}