{
  "article_id": "7ca76b1f50c9",
  "url": "https://www.nytimes.com/athletic/6566565/2025/08/23/james-horncastle-serie-a-predictions/",
  "title": "James Horncastle Serie A predictions : Title winners , best transfers , rising stars and teams in trouble",
  "date": "20250823T081500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "If you were to head down to your local bar in Italy and pick up the stack of coffee-stained newspapers, what would be the principal headlines about the upcoming season in Serie A?\nThe biggest I can recall uses a mix of Neapolitan dialect and English: “Amma fatica again.” This was the post-prandial announcement Napoli owner Aurelio De Laurentiis and his head coach Antonio Conte made at a fish restaurant near Naples’ Riviera di Chiaia in May. They were going to knuckle down and get after it again.\nAdvertisement\nConte’s future had been in doubt, and memories of how badly Napoli defended the Scudetto when their previous title-winning coach left in summer 2023 were still fresh. You may recall they went through three coaches the following season and finished in mid-table, 41 points adrift of champions Inter.\nSo Naples seems like a good place to start as we look ahead to what promises to be another fascinating Serie A season…\nDoes Conte’s decision automatically make Napoli favourites to go back-to-back for the first time in their history?\nNapoli were my pick for the title this time last year, such was my confidence in Conte. He is as close to a guarantee of success as any manager in football, particularly in Italy. The 56-year-old has now won the Scudetto with three different teams, a feat matched only by Fabio Capello (whose two titles with Juventus were later revoked).\nIn the six seasons Conte has spent in Serie A since Juventus gambled on him in summer 2011, he has finished top on five occasions. People forget he adapted when he moved to Juventus, switching from the 4-2-4 with which he had his first triumphs at Bari and Siena to the 3-5-2 with which he became synonymous. Last season, he changed again, with Napoli alternating between 3-4-2-1 and 4-3-3.\nCome on, James. Nobody has retained the Italian title since 2020. Why should it be different this time?\nNapoli have learnt from their last title defence two years ago. They have kept their coach this time. They have been aggressive in the transfer market. They have, largely, filled the holes that opened up in the second half of last season, when the squad began to look thin and Khvicha Kvaratskhelia’s winter-window sale to Paris Saint-Germain hurt.\nA statement of intent was made when, on the day of their open-top bus parade, De Laurentiis revealed he had just gotten off a video call with Kevin De Bruyne. Manchester City’s greatest-ever player is 34 years old now and injuries, notably the one to his hamstring suffered in the 2022-23 Champions League final, have taken their toll. But he still got 19 combined goals and assists for club and country last season, and clocked up nearly 3,000 minutes of game time.\nAdvertisement\nWhether Conte can play the Belgian, Stanislav Lobotka, reigning Serie A MVP Scott McTominay and Andre-Frank Zambo Anguissa at the same time is one of the curiosities going into the campaign.\nWhat could possibly go wrong?\nWell, Napoli are back in Europe this season, so will have to spin an extra plate. This has never posed a problem to Conte in the past, though. His issue has been with making deep Champions League progress.\nBut the expectations are different in Naples. While De Laurentiis was annoyed at not making that competition’s final in 2023, Napoli went further than ever before in making the last eight. Unlike Juventus and Inter, Conte’s previous two Serie A employers, there is no glorious past to point to in Europe for Napoli, beyond winning the 1988-89 UEFA Cup.\nRetaining the domestic title, and so winning it for a third time in four years, would still be heralded for what it is: unprecedented in the club’s history. Napoli seem in a great position to do that, even if striker Romelu Lukaku’s lengthy injury is a spanner in the works.\nInter were trophy-less last year but were on for a treble in April. Aren’t they a threat?\nPSG made Inter look old at the Champions League final, and then did the same to Real Madrid and their neighbours Atletico at the Club World Cup.\nThat one game, a perfect one from PSG, exposed Inter’s flaws and shifted the focus onto them and away from everything else they had done to get to the final. For instance, Inter weren’t too old when they held Manchester City at the Etihad with their second string early in the league phase, or when they beat Arsenal at San Siro in November, or when they knocked out Bayern Munich in the quarter-finals and then Barcelona.\nYou can’t be over-the-hill and sustain a challenge for a treble.\nOn the theme of holding two conflicting ideas in your head at the same time, it was also true that Inter needed to rejuvenate, and they’ve done that this summer. The average age of their four signings so far is 22.\nAdvertisement\nIsn’t the dressing room split, though? Didn’t Lautaro Martinez call out Hakan Calhanoglu at the Club World Cup?\nOne of the strengths of this Inter squad is the culture within it. They aren’t afraid to tell each other what they think. They have standards and expect a lot from one another. A peace has been struck between Lautaro and Calhanoglu. The Turkish playmaker has stayed, as have Inter’s other stars. Stable ownership and a second run to the Champions League final in three years mean Inter find themselves in the rosiest position in a long time off the pitch.\nTrue, they have been frustrated in their efforts to sign Ademola Lookman from Atalanta and Borussia Monchengladbach’s Manu Kone (who has joined Roma), but the biggest question mark isn’t the squad; it’s the coach.\nUnconvinced by Cristian Chivu, eh?\nIt’s not that. It’s more his predecessor, Simone Inzaghi, added so much value and will be missed. Inzaghi was often harshly criticised, and I have no doubt there will be greater appreciation for the job he did at Inter in time. Chivu, meanwhile, was not first-choice to succeed him this summer. Cesc Fabregas was the lead candidate but they had not reckoned on the complication of his ownership stake at Como, which would have presented a conflict in the event of a move to San Siro.\nChivu, it must be said, knows Inter inside out and, on paper at least, makes sense as the coach to rejuvenate this team. After ending his playing career with seven years at the club, he spent almost as long coaching in their academy before taking the Parma job in February, so knows a lot of the kids coming through.\nThe Romanian creditably kept Parma up on the final day of last season, beating Juventus and Atalanta along the way, and frustrating Inter and Napoli with draws. But this is a big leap, and competition is fierce — particularly with Conte staying at Napoli and Scudetto-winning coaches Max Allegri, Stefano Pioli and Maurizio Sarri returning to Serie A.\nWhose business has impressed you most?\nComo are once again the biggest spenders, investing more than €100million (£86.5m; $116m).\nI like how their recruitment has evolved. A year ago, new to the head coach’s seat and following their promotion from Serie B, former assistant Fabregas thought experience was the way to go. Pepe Reina, Alberto Moreno and Sergi Roberto all joined. By January, however, he had a better feel for the league, pinpointed what his team were missing, and the improvement was rapid. Como won six straight games in April and May to finish 10th, their Assane Diao rivalled team-mate Nico Paz for Serie A’s Young Player of the Year award, and they now look primed for a push into the European places.\nAdvertisement\nCoppa Italia winners Bologna have sold centre-back Sam Beukema and winger Dan Ndoye this summer but I’d trust in sporting director Giovanni Sartori, even if they’re gambling on striker Ciro Immobile to be evergreen at age 35.\nIgli Tare has hit the ground running as sporting director at Milan. The club have set about resetting the culture and overhauling the team for Allegri’s second spell as coach. Lopsided in the past at full-back, they now have an energetic double-act in Pervis Estupinan and Zachary Athekame. The midfield has a completely different look; Luka Modric, though he turns 40 next month, will make holdover Youssouf Fofana and fellow new signings Samuele Ricci and Ardon Jashari better.\nYou’re bullish about Milan, then?\nThe only way is up after last season’s eighth-place finish.\nWhen Milan first appointed Allegri in 2010, their then chief executive Adriano Galliani commented on his “physique du role”. In other words, Allegri has big-club energy.\nHe knows how to handle business, and while it has become fashionable to say he is no longer the force of old, Allegri is Serie A’s most successful coach, a guarantee of Champions League qualification and won something even in his much-maligned second spell at Juventus where, people forget, he mounted two title challenges in three years (both of which faded in the spring, because of a 15-point penalty outside of his control and a regression to the mean following an unsustainable xG over-performance).\nWhat I would say is this is the best midfield Allegri has had at his disposal since 2017. I’m also backing Rafael Leao to have his best season since Milan’s most recent Scudetto in 2021-22.\nWhat else has intrigued you?\nJuventus are going to have to make a silk purse out of a sow’s ear. They have spent nearly €120million this summer, but you wouldn’t know it. Other than swapping one Portuguese full-back (Alberto Costa) for another (Joao Mario), the bulk of that money has been tied up in obligations from last year’s business, which was so bad it cost sporting director Cristiano Giuntoli his job.\nAdvertisement\nHis replacement, and soon-to-be-made chief executive, Damien Comolli has been limited in what he can do, particularly as the league’s highest-earner, striker Dusan Vlahovic, isn’t budging as he enters the final year of his huge contract.\nOn the positive side, the churn last summer was so great, Juventus will no doubt be more settled this time. Teun Koopmeiners and Nico Gonzalez arrived so late in the window a year ago that they were always playing catch-up. Off-season appointment Thiago Motta’s March replacement Igor Tudor has the job on a permanent basis after fulfilling his brief of qualifying for the Champions League. Their four matches at the Club World Cup helped him speed up the process of making this team his own.\nFor all the focus on the free-agent arrival of Jonathan David, Juventus’ biggest ‘new’ signing will be the return of their best defender, Gleison Bremer, from October’s season-ending knee injury.\nBut arousing your curiosity even more is…\nThe Rome-Bergamo coaching switcheroo. Gian Piero Gasperini’s decision to leave Atalanta after nearly a decade is, to me, symbolic of the summer in Serie A. Only three clubs that finished in the top 10 last season are starting this one with the coach who was in charge this time a year ago. For Gasperini to roll the dice and test himself again in a big market is, in some respects, a credit to him. At 67, he is still seeking new challenges.\nGasperini, like Conte, has a methodology that doesn’t seem to age. This is a man who missed out on the Champions League with Genoa in 2009 on a head-to-head tie-breaker. This is a man who led Atalanta to the Champions League not once but six times in nine seasons.\nThe rise and transformation of Atalanta was responsible, time and again, for squeezing Roma out of the top four. It’s been seven long years since the latter were a Champions League team. Expect that to change.\nGasperini turned Rasmus Hojlund and Mateo Retegui into €70million players in Bergamo. If Brighton loanee Evan Ferguson stays fit, he could be the next one.\nSo is it the end of an era at Atalanta?\nNo, I didn’t say that. New coach Ivan Juric is a continuity candidate. He has always been billed as the principal Gasperini disciple. He began his coaching career in the same place (Crotone) and then, upon achieving a historic promotion, moved to Genoa, again following in Gasperini’s footsteps.\nAdvertisement\nGenoa wanted Juric to do what Atalanta are now asking of him: Carry on Gasperini’s work. That was tough at a club as volatile as Genoa, and one of the reasons Gasperini kicked on at Atalanta was the stability the club’s owners, the Percassi family, afforded him, which has only been reinforced by the recent investment from Steve Pagliuca.\nNevertheless, Juric’s hire has not enthused. He was fired by both Roma and Southampton last season. The hope is that those experiences will be to him what the sack was for Gasperini at Inter and Palermo in 2011 and 2013.\nJuric is reunited with Tony D’Amico, the sporting director, with whom he did his best work at Verona. He now has better players available to him and fewer excuses than in his recent stint at Torino, for example. That said, he must cope with the sale of last season’s 25-goal Capocannoniere Retegui, and reckon with Lookman’s desire to be sold.\nAtalanta won’t go from gold-carriage to pumpkin this season and revert to the yo-yo club of the pre-Gasperini era. But hitting the same heights is going to be a challenge.\nSurprise us, Ivan! The same rallying cry applies to Chivu at Inter.\nWho do you fear for?\nLazio’s transfer embargo can either be a blessing or a curse. Sarri, back in his previous gig after a year out of football, has never liked the window anyway. He thinks it is a distraction and a sign of mass consumer compulsion. Once upon a time, coaching wasn’t about making a Christmas list of players to sign. It was about working with what you had; developing, even reinventing, players and finding solutions on the training pitch, not in the market.\nSo, last year’s squad is effectively frozen. That’s no bad thing. Mario Gila was one of the best centre-backs in the league. Nuno Tavares proved a revelation. Nicolo Rovella is emerging as one of Italy’s best tempo-setting ball-players. Pedro, now 38, remains a cult hero (in Naples too, not just Rome). As such, Lazio, who finished runners-up in 2022-23, the second season of Sarri’s first spell, could be as big a surprise as a disappointment, even if the core of the team has changed.\nAdvertisement\nGenoa, meanwhile, have me spooked. True, they have presented the few signings they’ve made in memorable ways: Lorenzo Colombo as TV’s Lieutenant Columbo and Christopher Columbus, for instance. And they launched a ‘This is England’ kit in a nod to their origin story. But is it enough from a former 777 Partners club who were taken over in December by an unknown Romanian?\n🎬 Solo un’ultima cosa…cit.\nLorenzo Colombo è 🔴🔵#GenoaCFC #DAZN pic.twitter.com/fJ3NNXIkIS\n— Genoa CFC (@GenoaCFC) July 28, 2025\nWhich young players should we keep an eye on?\nGiovanni Leoni didn’t start and finish a game for Parma in Serie A until the final day of January this year. At the time, few would have anticipated the teenage centre-back’s sale to Liverpool for around £26million in the summer. His story is a reminder of how quickly someone can burst on the scene.\nLeoni was not the league’s 2024-25 Young Player of the Year. That accolade can be found on Paz’s mantlepiece. The 20-year-old Real Madrid academy graduate is staying at Como for another year and figures as the outstanding creative talent in his age range, along with Juventus’ Kenan Yildiz and the latter’s former academy team-mate in Turin, Matias Soule of Roma, who has exactly the right coach for his development in Gasperini.\nKeep an eye on how Francesco Camarda does at Lecce. The 17-year-old striker is on loan from Milan, and Lecce manager Eusebio Di Francesco has a good record at nurturing future Italy internationals (Marco Verratti, Domenico Berardi and Nicolo Zaniolo). The hope is that Camarda solves the national team’s problem position.\nFrancesco Pio Esposito, 20, looks more ready to have a go at doing that after his 17-goal season for Spezia helped them into the Serie B play-off final. Whether there is a pathway for him at parent club Inter remains to be seen amid competition from Lautaro, Marcus Thuram and new signing Ange-Yoan Bonny.\nSerie A’s love for all things Scottish continues, too. Teenage midfielder Lennon Miller has moved from Motherwell to Udinese, where he will aim to emulate the likes of McTominay, Liam Henderson, Lewis Ferguson, Aaron Hickey and Josh Doig.\nAnd last but not least, what do you expect the promoted clubs to do?\nOnly one of the last season’s three promoted clubs, Venezia, went straight back down. Como were atypical because of how well the richest owners in Italian football deployed their capital, particularly in the corrective measures taken in the winter window. Parma stayed up with an away win on the final day and it was viewed as such a feat that Inter promptly nabbed Chivu to be their manager (albeit for reasons not limited to his three-month reign at the Ennio Tardini stadium).\nAdvertisement\nThis time around, Sassuolo are back among the elite after a year away and still have the institutional know-how from previously spending a decade in Serie A to understand what it takes to survive.\nCoach Fabio Grosso has decided to hang around rather than leave to try to find another Serie B team to take up, as he did after securing promotion for Frosinone two years ago. Talisman Domenico Berardi is still at the club and has scored 100 goals in the top flight. Had he not torn an Achilles tendon in the March of their relegation season, he probably would be somewhere else right now. Berardi is 31 but is a guarantee of goals and assists.\nCremonese have anticipated the need for a great-escape artist by hiring Davide Nicola, the closest thing to a sure thing of retaining your place in Serie A. Then there’s Pisa, back in Serie A after 34 years. Alberto Gilardino has stepped in as coach for Filippo Inzaghi, who will instead be looking to make Palermo the fourth club he has taken up to Serie A in eight seasons.\nPisa’s promotion puts one of the most underrated rivalries back on the calendar: a Tuscan derby with Fiorentina not contested since 1991.\nMuch like the shadow cast by Pisa’s leaning tower, the start of the Italian season now looms large.\n(Top photo: Francesco Pecoraro/Getty Images)",
  "word_count": 3097,
  "scraped_at": "2026-02-14T01:52:36.769227",
  "_text_extracted": true
}