{
  "article_id": "7ca982a09905",
  "url": "https://www.caughtoffside.com/2024/04/09/rio-ferdinand-aim-man-united-manager/",
  "title": "Rio Ferdinand takes aim at Man United manager Erik ten Hag",
  "date": "20240409T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rio Ferdinand has expressed doubts about Manchester United’s tactics under manager Erik ten Hag this season.\nTen Hag led the Red Devils to significant progress in the Dutchman’s debut year.\nMan United won the Carabao Cup, which ended their nearly six-year trophy drought, and they finished third in the Premier League, earning a Champions League spot.\nHowever, Man United have regressed significantly in Ten Hag’s second season with the club, now sitting in sixth place, 11 points behind the top four, with a joint club record of 12 Premier League losses.\nTen Hag’s team this season has been heavily criticized for its vulnerability, which has led to them giving up the most shots of any club in the league this season.\nFerdinand has also voiced his concerns about Ten Hag’s “kamikaze chaos football” with his former team.\nSpeaking on his Vibe with Five show, he said: “The manager came out before and was saying ‘if anyone can’t see the style of play then I don’t know what you’re looking at’ and basically ‘we have got a style of play.”\n“For the life of me, I give him the benefit of the doubt every time and am looking at him thinking every time ‘what is it’? I said after the game if kamikaze, open sesame, no control of the game football is what we’re looking for, he has it nailed on and is doing a great job at it because that’s what we’re playing.\n“You can put that down to injuries, we have a load of injuries but a lot of teams have injuries and they still play a style of football they are trying to achieve. I don’t think Ten Hag’s style is this kamikaze chaos football.”\nMan United manager could on his way out of the club\nCriticism has come for ten Hag from fans and former players after a disappointing season for the club.\nThe former Ajax manager has failed to make progress with the team and his approach to games has been negative for a club like Man United.\nThe Dutchman was known for his possession football and intricate passing that fans admired at Ajax, however, at Old Trafford, that has been a rarity.\nBig changes are expected at Man United\nMan United co-owner Sir Jim Ratcliffe have some tough calls to make in the summer and the future of his manager may be the toughest of them all.\nThe Red Devils have made a number of changes in the non-playing staff already and more changes are set to follow as INEOS try to stamp their authority.",
  "word_count": 430,
  "scraped_at": "2026-02-14T01:54:34.172071",
  "_text_extracted": true
}