{
  "article_id": "7cbe9fcbc6e3",
  "url": "https://www.rnz.co.nz/international/pacific-news/515645/ileen-pegi-is-first-solomon-islands-woman-to-score-soccer-transfer-deal",
  "title": "Ileen Pegi is first Solomon Islands woman to score soccer transfer deal",
  "date": "20240430T223000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ileen Pegi has become the Solomon Islands first women footballer to strike an international transfer deal.\nWhile there have been numerous players from the 'Brazil' of Pacific soccer securing transfer deals with clubs in Fiji and New Zealand, Pegi has created history for her fellow women players.\nShe has joined AS Feminine of New Caledonia from Koloale FC.\nPegi was in Vanuatu on Tuesday, in transit for Noumea, after departing Honiara on Monday.\nKnown for her goal-scoring ability and speed on attack, the 31-year-old will now feature in the New Caledonian women's national championship, the top division for women's football in the country.\nAS Feminine has a successful record, having won the New Caledonia National Championship three times, the New Caledonia Cup four times, and the inaugural OFC Women's Champions League in 2023.\n\"I'm super excited about this opportunity to excel in my career,\" Pegi told Solomon Islands Football.\n\"Representing the Solomon Islands women's football has always been my passion and dream. Setting this milestone will inspire more females to get involved in football.\"\nPegi helped her local club win the Solrais Women's Premier League title in 2022.\nKoloale also became the first club to represent the country at the OFC Women's Champions League 2023.\nShe also captained the Solomon Islands team that finished runners-up in the recent OFC Women's Olympic Qualifiers 2024 behind New Zealand.\nSolomon Islands Football said her move sets a new benchmark for women's football transfers and signifies the increasing recognition and valuation of Solomon Islands players in the international and regional football community.\n\"The deal marks a significant milestone not only for Pegi but for the entire landscape of women's football in the Solomon Islands,\" SIFF said.\nAS Feminine boasts an impressive track record, having clinched the New Caledonia National Championship three times, the New Caledonia Cup four times, and emerging triumphant in the inaugural OFC Women's Champions League in 2023.\nPegi's departure is a testament to the talent emerging from the Solomon Islands' football scene, joining men's reps Benjamin Totori, Micah Lea'alafa and most recently Raphael Lea'i.\nShe was winner of the prestigious 2023 Solomon Islands Female Player of the Season title.",
  "word_count": 358,
  "scraped_at": "2026-02-14T01:51:24.784583",
  "_text_extracted": true
}