{
  "article_id": "7cceff8be679",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-slap-affordable-new-price-alejandro-garnacho-three-premier-league-clubs-circle",
  "title": "Man Utd transfer news : Garnacho given  affordable  new price as three Prem clubs circle",
  "date": "20250608T113000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd slap ‘affordable’ new price on Garnacho as THREE Prem clubs circle\nManchester United will sell Alejandro Garnacho for a new reduced fee that has sparked a flurry of transfer interest including from three Premier League rivals, according to reports.\nMan Utd fully intend to offload Garnacho this summer. The Argentina international is among three other high profile forwards the club aim to sell to generate capital for new signings. The others are Marcus Rashford, Antony and Jadon Sancho, while the likes of Andre Onana and Rasmus Hojlund could also depart if suitable offers are received.\nGarnacho’s attitude came under the microscope during the last six months of the season. He described United’s campaign as “s***” following the Europa League final defeat to Tottenham and a number of ill-advised social media posts from he and his entourage have not gone down well at Old Trafford.\nNevertheless, Garnacho was actually Man Utd’s second most effective player from an offensive standpoint last term, behind only Bruno Fernandes.\nDespite being just 20 years of age, Garnacho racked up 21 goal contributions (11 goals, 10 assists) across all competitions.\nUnited were willing to sell Garnacho for a fee in the £60m-£70m range in January. Chelsea lurked but didn’t act, unlike Napoli who tried and failed with a £42m bid.\nBut according to transfer insider Rudy Galetti, Man Utd have now slapped a new and reduced asking price of €60m / £50m on the forward.\nPer the reporter, this discounted sum is widely viewed by interested sides as a more ‘affordable’ fee. As such, interest is massing.\nTaking to X, Galetti wrote: “As reported over ten days ago on TEAMtalk, Napoli, AC Milan, Bayer Leverkusen, Atletico Madrid and Chelsea have recently shown interest in Garnacho.\n“Other clubs are now preparing to step [up for the] forward. Man Utd value him at ~€60m, a figure seen as more affordable than the January price.”\nThe “other clubs” Galetti spoke of are, according to Fabrizio Romano, within the Premier League…\nGame over for Garnacho at Man Utd\nSpeaking on his YouTube channel, Romano confirmed Garnacho’s race at Man Utd is run before stating THREE Premier League sides are circling.\n“I want to confirm something I said one month ago. Alejandro Garnacho will leave Manchester United,” said Romano.\n“The decision is made, not only on Ruben Amorim’s side, but also [on the] management side.\n“It is time to part ways between Man Utd and Garnacho. It’s over, they are already looking for solutions.\n“There were some calls from Bayer Leverkusen. Leverkusen are interested in the player, Erik ten Hag appreciates Garnacho.\n“But at the moment, financially, [it] looks like a very difficult deal to do for Leverkusen.\n“[There is] some interest from Italy, but especially from the Premier League. Premier League clubs are calling [and] pushing for Garnacho.\n“Let’s see what happens in negotiations with United, but there is a strong possibility to see Garnacho playing in the Premier League with a different shirt.\n“It is a concrete scenario for this summer. Let’s see what happens… there is a lot of interest in Garnacho in this moment.\n“From what I heard, three Premier League clubs have called for Garnacho.”\nChelsea are one of the three clubs showing interest, though their focus for the left wing position right now is Jamie Gittens of Borussia Dortmund.\nThe Blues are prepared to hand the Englishman a seven-year contract running until 2032 and intend to lodge an improved second bid after their first offer worth €35m was rejected.\nThe identities of the other two EPL sides taking a close look at Garnacho has not yet come to light.\nLatest Man Utd news – Mbeumo hijack / Gyokeres chooses between Utd and Arsenal\nIn other news, the Mirror state Thomas Frank – who is on course to become the new Tottenham manager – has requested Spurs sign Bryan Mbeumo.\nThe Brentford winger has signalled his intention to sign for Man Utd who have lodged two bids so far. The latest was worth £50m plus £10m in add-ons.\nBut until such time as a deal is sealed United will remain vulnerable. Frank wants to forge an immediate reunion with Mbeumo in north London and Spurs have the added appeal of Champions League football.\nElsewhere, the Mirror state Viktor Gyokeres would sign for Arsenal ahead of Man Utd if both clubs bid.\nGyokeres is ‘open’ to joining the Red Devils despite their lack of UCL football. But per the report, he’d snub United if Arsenal make a move.\nGyokeres is one of two strikers Arsenal are simultaneously ramping up deals for, with the other Benjamin Sesko.\nArsenal’s aim is to sign just one of that pair, with the purpose of holding two sets of talks to ensure they don’t miss out if one deal falls through.\nAnd thankfully for Man Utd fans, it’s Sesko who Arsenal have reportedly chosen to sign.",
  "word_count": 822,
  "scraped_at": "2026-02-14T01:52:26.341093",
  "_text_extracted": true
}