{
  "article_id": "7cf573ca9015",
  "url": "https://punchng.com/confed-cup-enyimba-crash-out-after-zamalek-loss/",
  "title": "Confed Cup : Enyimba crash out after Zamalek loss",
  "date": "20250120T024500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Zamalek ended Enyimba’s CAF Confederation Cup campaign with a 3-1 victory in their final Group A match at the Cairo International Stadium on Sunday, PUNCH Sports Extra reports.\nThe Egyptian giants, who had already secured top spot with 11 points before the encounter, proved too strong for the Nigerian champions, who needed a win to stand any chance of progressing to the knockout stages.\nMostafa Shalaby put the hosts ahead in the 29th minute with a well-placed header before Seifeddine Jaziri doubled Zamalek’s advantage shortly after halftime.\nThe People’s Elephant briefly came back into the contest when Ifeanyi Ihemekwele pulled a goal back in the 57th minute, but Jaziri’s second strike three minutes from time ended any hopes of a dramatic comeback.\nIn the group’s other match, Al Masry secured their qualification with a convincing 3-1 victory over Black Bulls Maputo, with Fakhreddine Ben Youssef netting a first-half hat-trick.\nThe result means Enyimba finished outside the qualification spots, bringing an end to their hopes of adding to their impressive collection of continental silverware, which includes two CAF Champions League titles.\nThe eight-time Nigerian champions will now turn their attention to the Nigeria Premier Football League, which resumes on January 23 with a crucial fixture against former champions Kano Pillars.\nEnyimba have enjoyed considerable success in continental competitions over the years, but their elimination at the group stage marks another disappointing campaign in their quest to become the first Nigerian side to win the Confederation Cup.\nThe Aba-based club will be hoping to channel their continental disappointment into their domestic campaign as they aim to add to their record eight NPFL titles when the league resumes later this month.",
  "word_count": 278,
  "scraped_at": "2026-02-14T02:11:27.603332",
  "_text_extracted": true
}