{
  "article_id": "7d22171cd8a9",
  "url": "https://www.theguardian.com/world/2025/oct/02/first-edition-government-shutdown",
  "title": "Thursday briefing : Democrats gamble on another government shutdown",
  "date": "20251002T070000Z",
  "domain": "theguardian.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Good morning. The US government shut down at a minute after midnight yesterday, after Democrats and Republicans failed to reach a deal on an interim spending bill. More than 24 hours in, and as each side seeks to blame the other for the crisis, there is no sign of a compromise being reached – and every sign that Donald Trump will seek retribution against Democratic states.\nAbout 750,000 federal employees have been furloughed, and many government programmes have been paused. If it goes on for longer than a few days, the cost in lost GDP could run into the billions. And the consequences could be lasting: Trump has threatened retaliatory mass firings that could permanently reshape the administrative state.\nDespite those costs, the Democrats feel that they have no choice but to go ahead, as a way to push back against Trump’s healthcare cuts and show Republicans – and voters – that they are an opposition to be reckoned with. Today’s newsletter, with the Guardian’s senior politics reporter in Washington, Chris Stein, explains what the shutdown means in practice – and the high stakes political gamble of bringing it about. Here are the headlines.\nFive big stories\n-\nCoronavirus | The government has won its legal claim against a company linked to the Conservative peer Michelle Mone for the return of millions of pounds paid for personal protective equipment during the Covid pandemic. PPE Medpro, which filed a notice to appoint an administrator this week, was ordered to return £122m.\n-\nImmigration | People granted asylum will no longer be given “the golden ticket” of resettlement and family reunion rights, Keir Starmer said, amid deepening concerns from charities that his words are demonising refugees.\n-\nGaza | A number of boats from a pro-Palestinian flotilla have been boarded by Israeli forces roughly 75 miles off the coast of Gaza, as the vessels attempted to breach the maritime blockade of the war-torn territory and bring aid.\n-\nScience | Autism should not be viewed as a single condition with a unified underlying cause, according to scientists who found that those diagnosed early in childhood typically have a distinct genetic profile to those diagnosed later.\n-\nConservation | The world-renowned primatologist Jane Goodall has died at the age of 91, her institute has said. Greenpeace described her as “one of the true conservation giants of our time”.\nIn depth: ‘The Democrats feel it’s a moment of weakness for Trump’\nIn the UK, and many other comparable countries, government shutdowns are not a feature of political life: the government just needs a simple majority in parliament to pass a budget. Even in the unlikely event that the budget falls, there is no convention for a halt to public services.\nIn the US, if Congress doesn’t pass funding legislation, federal agencies must shut down by law. Even though the Republicans control both the House of Representatives and the Senate, they need a supermajority of 60 votes out of 100 in the Senate to pass a spending bill – meaning they need seven Democratic votes.\nWhereas shutdowns might once have been headed off by senators in swing states who feared a backlash, that is less likely now: as this New York Times piece explains, there are fewer purple states, and therefore fewer senators worried about what independent voters think.\nNow the shutdown has begun, the stakes only get higher. Here’s what you need to know.\nWhat happens when the government shuts down?\nAs Lauren Gambino sets out in this useful explainer, federal employees stop being paid, and funding for many government programmes is halted. Most workers are placed on furlough, while those whose jobs are deemed essential – defined as protecting life or property, like air traffic controllers and the military – must work with their pay delayed until the shutdown ends. Some critical programmes like social security and Medicare, the federal health insurance scheme for over-65s, are unaffected.\n“The impact is real,” Chris Stein said. “It’s deepest on the federal workforce, which stretches from scientists with doctorates to janitors. But there is also going to be a perception that you’re paying taxes, and you’re not getting the services you might expect.”\nWhy has it come to this?\nThis is not the first shutdown threat of the second Trump administration. In March, Democrats came close to withholding the necessary votes to pass a stopgap funding bill increasing military budgets by $6bn while reducing other spending by $13bn. Eventually, though, Senate minority leader Chuck Schumer relented, arguing that a shutdown would give Trump and Elon Musk, then in charge of the Doge programme aimed at gutting government agencies, “carte blanche to destroy vital government services at a significantly faster rate than they can right now”.\nThis time, Democrats believe the fight is worth having. They have said that the Republicans’ plans would increase health insurance prices for about 20 million people and demanded the reversal of drastic cuts to Medicaid, the health insurance scheme for people on low incomes, that were included in Trump’s “big, beautiful bill” in June.\n“Healthcare is ground that the Democrats have stood on for a long time,” Chris said. “The Republican cuts to Medicaid and other things are going to have a significant impact, and they see an opportunity to go after something that isn’t politically popular. By shutting down the government they create a moment of attention on them, and a platform to make the case for the alternative. It’s a rare opportunity for leverage.”\nWhat are the political risks and rewards for the Democrats?\nSchumer complained in March that he had been presented with a “Hobson’s choice” consisting of two bad options: accept a bill that would hammer spending on public services, or risk a shutdown that he feared would be abused by Trump and his allies, with the decision over which services are deemed essential ultimately resting with the executive.\nHis eventual retreat was very unpopular with progressive Democrats. They argued that their demoralised base needed a cause to rally behind, and a way to drive voters’ attention to their side.\n“In March, there was a bit of a feeling of ‘he just got elected, shutting down the government might make people think we’re unreasonable’. But that view has died in the Democratic party,” Chris said. “Now, they see how unpopular Trump has become, they see the weakness in the labour market, and they feel it’s a moment of weakness for him – that people voted for him because they thought he’d lower their costs.”\nThe history of government shutdowns suggests that, in a narrow sense, they tend to fail to achieve their aims, with the party that forces the issue usually taking the lion’s share of the blame with voters and their demands unfulfilled. That may well be the case this time, too. But there are reasons to think that even if that happens again, it could be a fight worth picking.\nJon Allsop of the New Yorker argues in this piece that the cost of being blamed for the ensuing chaos may be lower today, asking: “Will anyone really care by the time the midterms roll around, a thousand and one fresh scandals from now?” He goes on:\n“Making noise for a bit could revive an oppositional force that … appears fractious, distracted, and, ultimately, moribund … sure, marshalling the base, on its own, is rarely sufficient, but is necessary. Maybe winning, here, is showing it a pulse.”\nOn the other side of the equation, Chris said, “The risk is that they get nothing out of it – and at the same time, the public thinks that the shutdown has added to their economic troubles, and blames them. The longer it goes on, the more risk there is that they appear unreasonable or callous.” With some senators already wavering only a few more of their caucus needed by the Republicans to hit the magic 60-vote mark, they will also need rare unity to succeed.\nWhat’s the calculus for Trump and the Republicans?\nIn a press conference before the shutdown was confirmed, Trump threatened to use it to do things “that are irreversible, that are bad for them. Like cutting vast numbers of people out, cutting things that they like, cutting programs that they like.” He also said that those laid off were “going to be Democrats”.\nWhat he is describing are permanent “reductions in force” (RIFs) that have historically not been part of how the government manages shutdowns; while that is legally controversial, particularly if targeted on a partisan basis, there are fears that courts would defer to Congress as a check on the president’s authority, a slim hope given Republican majorities. Democrats and their allies counter that, as the Centre for American Progress puts it, “The Trump administration’s threats to layoff federal employees should be understood as a goal of the administration that will be pursued with or without a government shutdown.”\n“The supreme court has generally allowed Trump to do what he wants to do,” Chris said. If there are new permanent cuts during the shutdown, he added, “They’ve outlined some of the places they would go deepest, and it’s things like the Environmental Protection Agency, which they didn’t like in the first place. It’s fair to say that the things Democrats stand for are more likely to be affected.” That process is already underway, with $18bn for New York infrastructure projects on hold as well as $8bn for what the administration called “Green New Scam” projects in 16 mostly Democratic states.\nBut there are real dangers for Trump too. Giving in to the Democrats’ demands would be seen as caving, and embolden them to challenge him further in the future. But letting the crisis play out comes with its own problems. “It’s hard to imagine his base breaking with him – engaged Trump supporters will blame the Democrats,” Chris said. “The people to watch are the swing voters, or the low propensity voters, who see that the government is shutting down, think “I didn’t vote for this”, and potentially think that it must be the president’s fault.”\nWhat else we’ve been reading\n-\nAfter the death of Jane Goodall (above with Tess, a female chimpanzee) at 91, this gallery provides a lovely survey of her remarkable life. Archie\n-\nPregnant mothers in Gaza are denied the basic right to dream about their child’s future. Each day is consumed by the struggle to survive, unsure whether they or their baby will live to see tomorrow. It is unbearable that this unconscionable violence continues. Aamna\n-\nArgentinian president Javier Milei’s programme of axing public services won the glowing praise of Nigel Farage, Kemi Badenoch, and others on the right – but now his project is collapsing, they have gone curiously silent. Aditya Chakrabortty has an excellent column on the lessons for the rest of us. Archie\n-\nIn times of war, countless families struggle to maintain ordinary routines under impossible circumstances. I was deeply moved to see how this is unfolding in Ukraine in this beautiful piece on how life continues to find a way amid the most brutal violence. Aamna\n-\nGovernment procurement stories are usually dry and technical, but the Covid VIP lane scandal would make even the most level-headed person’s blood boil. My colleague David Conn’s wrap of the PPE Medpro trial is well worth a read. Aamna\nSport\nFootball | Nico Gonález gave away a late penalty, converted by Eric Dier, as Manchester City, who twice led through Erling Haaland, drew 2-2 at the UEFA in Monaco. Arsenal made it two wins from two in the Champions League after Gabriel Martinelli’s early goal helped to secure a 2-0 win against Olympiakos.\nCricket | Ashleigh Gardner struck the third-fastest century in a Women’s Cricket World Cup as Australia began their title defence by beating New Zealand by 89 runs.\nTennis | Sonay Kartal put together the best performance of her burgeoning career to outlast the world No 5 Mirra Andreeva across three gruelling sets, winning 7-5, 2-6, 7-5 at the China Open. It was the Briton’s first victory over a top 10 opponent.\nThe front pages\nThe PPE Medpro news leads many of the front pages today. “PPE firm with link to Mone ordered to repay £122m,” is the Guardian’s story. “Cough up Covid £122m,” says the Sun, while the Mail opts for “Baroness bra told: hand back our £122m...and peerage.” “Strip her of the title,” writes the Mirror. “Mone Mone Mone,” says the Metro.\n“Automatic rights for refugees to be scrapped,” is the lead story at the Times. The i paper has “Refugees stripped of automatic right to have families join them in UK.”\n“Badenoch: I’ll rip up laws on net zero,” is the focus at the Telegraph today, while the FT splashes on “Home Office in fresh push for back door into Apple user data.” “‘Let down by those whose job it was to protest them’” runs the Express, on the victims of seven men sentenced yesterday for their part in a Rochdale grooming gang.\nToday in Focus\nThe clean energy revolution – a reason to be hopeful\nThe acclaimed environmentalist and writer Bill McKibben explains to Lucy Hough that we have now passed a tipping point when it comes to solar energy, driven by falling prices, widespread innovation and countries’ desire for energy independence.\nCartoon of the day | Ben Jennings\nThe Upside\nA bit of good news to remind you that the world’s not all bad\nFour Caribbean countries have launched a historic EU-style free movement agreement, which politicians anticipate others in the region will soon join. Officials hope the deal will stem the flow of skilled professionals leaving the region for North America and Europe.\nThe agreement between Barbados, Belize, Dominica and St Vincent and the Grenadines follows decades of discussions and negotiations among members of the Caribbean Community (Caricom) – a regional grouping of 15 member countries.\nThe “full free movement” will allow nationals of the four countries to reside, work and remain indefinitely in any of the countries without the need for a work or residency permit. Officials said the scheme will boost cultural and economic integration in the region, achieving a single market and single economy across the Caribbean.\nSign up here for a weekly roundup of The Upside, sent to you every Sunday\nBored at work?\nAnd finally, the Guardian’s puzzles are here to keep you entertained throughout the day. Until tomorrow.",
  "word_count": 2409,
  "scraped_at": "2026-02-14T02:26:56.616674",
  "_text_extracted": true
}