{
  "article_id": "7d48f36f2e54",
  "url": "https://www.lawgazette.co.uk/news/lawyers-ready-to-fight-uefa-over-venue-for-cup-final-claims/5118441.article",
  "title": "Lawyers for Liverpool fans ready to fight UEFA over venue for 2022 Champions League final claims",
  "date": "20240117T200000Z",
  "domain": "lawgazette.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A firm representing more than 1,000 fans who suffered physical or other injuries in the 2022 Champions League final will fight football’s governing body over where proceedings take place.\nLeigh Day said it will resist an application from UEFA for the claims to be heard in Paris, where the final was held. The application will be heard in the High Court in Liverpool and the firm insists this is where the full hearing should also be held.\nUEFA argues that the court will have to decide on the lawfulness of actions or failings of the Frensh state over matters which occurred in Paris. The organisation also refers to the responsibilities of the French Football Association and the Préfecture de Police in its application.\nBut Leigh Day points out that UEFA’s independent review concluded that the association bears ‘primary responsibility’ for the organisational and safety failures that occurred at the Stade de France in May 2022.\nThe firm has accused UEFA of trying to deflect attention from its role in the episode and argues that the right venue for hearing claims is the nearest court to the majority of claimants. The application hearing will be on 27 and 28 June.\nIn a joint statement, Leigh Day partners Clare Campbell and Jill Paterson said: ‘Thousands of supporters were left injured and traumatised and, even now, 20 months on from that fateful day, many of those impacted continue to deal with the repercussions.\n‘It is our firm belief that High Court in Liverpool is the appropriate court to decide upon matters that are so important a large number of Liverpool FC fans and we will continue to fight for their claims to be heard by the English court system.’\nLeigh Day brings the claims on the basis that UEFA failed to ensure a safe and secure environment for those attending and could owe a legal liability to those who suffered physical and/or psychological injuries. The organisation has rejected the claims but has announced ticket refunds and measures to improve safety for football fans.\nThe 2022 final was delayed due to overcrowding and bottlenecks developing outside the stadium. UEFA and the French authorities initially sought to blame fans, but the independent report said the cause was organisational and safety failures in the run-up to the match.\nFollowing the report, Liverpool FC said: ‘It is shocking that more than 30 years after the Hillsborough disaster any club and our group of fans would be subject to such fundamental safety failings which have had such a devastating impact on so many.’\nThis article is now closed for comment.",
  "word_count": 432,
  "scraped_at": "2026-02-14T01:48:39.899885",
  "_text_extracted": true
}