{
  "article_id": "7d4c5c592cf3",
  "url": "https://www.the42.ie/arsenal-chelsea-champions-league-6941234-Jan2026/",
  "title": "Arsenal finish league phase with perfect record , Chelsea fight back to defeat Napoli",
  "date": "20260129T001500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal 3-2 Kairat Almaty\nNapoli 2-3 Chelsea\nKAI HAVERTZ SCORED and set up two goals on his first start in 357 days as Arsenal saw off Kairat 3-2 to complete a clean sweep of eight victories in the Champions League.\nMikel Arteta’s side were virtually assured of ending the group phase in first place prior to Wednesday’s contest at the Emirates Stadium.\nBut the hosts made certain of their table-topping status with a relatively straightforward victory against the Kazakh minnows.\nThe doom and gloom of the 3-2 Premier League home defeat by Manchester United just three days ago evaporated after 102 seconds when Viktor Gyokeres opened the scoring against the bottom-of-the-table side.\nGyokeres was on target when he swept home a fast-paced counter-attack – starting from the back as a composed Riccardo Calafiori cleared his lines before Havertz played Gyokeres through, and the Sweden international finished well.\nSomewhat against the script, Kairat were back on terms just five minutes later. Calafiori tugged Jorginho’s shirt in the box, and while referee Urs Schnyder was unmoved, VAR intervened. Jorginho sent Kepa Arrizabalaga the wrong way from the ensuing penalty.\nAfter providing Gyokeres’ opener, Havertz was on the scoresheet on 15 minutes to restore Arsenal’s lead. Havertz gathered Ben White’s pass on the right flank before cutting inside on his left foot and delivering a clinical finish.\nKairat could not live with Arsenal, and Gyokeres might easily have had a hat-trick before Gabriel Martinelli eventually netted Arsenal’s third. A no-look flick from Christian Norgaard sent Havertz, involved again, on his way and, although Gyokeres could get only his studs to his team-mate’s cross, Martinelli was on hand at the back stick.\nMartinelli’s tap-in was initially ruled out – with Havertz adjudged to have been offside – but VAR overturned the on-field decision and the hosts were on easy street with nine minutes of the first half still remaining.\nBrando Bailey-Joseph, 17, and Ife Ibrahim, 18, became the 18th and 19th academy players to make their Arsenal debuts under Arteta before fellow substitute Gabriel Jesus saw his strike chalked off for offside after VAR stepped in.\nRicardinho then scored a consolation for the visitors with the last action of the game.\nJoao Pedro led a Chelsea fightback that saw them through to the Champions League last 16 with two second-half goals to beat Napoli 3-2 at the Diego Maradona Stadium.\nThey had looked like being left to count the cost of poor form on the road in Europe and were facing a third away defeat in four games when Rasmus Hojlund gave Napoli the lead late in the first half.\nChelsea looked safe with an early lead given to them by Enzo Fernandez’s penalty, when suddenly they were stunned by 23-year-old academy graduate Antonio Vergara, whose first-ever goal on his sixth senior start will not soon be forgotten in the city.\nCole Palmer – reportedly ready to end his two-and-a-half year stay in west London and return to Manchester – was on the bench after missing the win at Crystal Palace, and following Napoli’s goal there was no one for Chelsea who appeared able to take control of the ball and make something happen.\nHojlund gave the hosts the lead and at that stage the job looked too big for Chelsea, who had underwhelmed.\nThen Pedro, out of nothing, turned everything around, scoring first with a wonderful drive from range then out-pacing the defence to win it in the 82nd minute.",
  "word_count": 577,
  "scraped_at": "2026-02-14T02:12:22.653604",
  "_text_extracted": true
}