{
  "article_id": "7d7ac2c13810",
  "url": "https://theathletic.com/4205907/2023/02/15/tottenham-bid-msp-explained/",
  "title": "Are Tottenham really for sale ? What we know about the reported bid from MSP and Jahm Najafi",
  "date": "20230215T201500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "On Wednesday morning, the Financial Times reported that Iranian-American billionaire Jahm Najafi was planning a bid for Tottenham Hotspur.\nThe story stated that Najafi was leading a consortium who were “weeks away” from making a formal approach for the club, and that Najafi’s consortium valued Tottenham’s equity “at approximately $3billion (£2.49bn)”, “before adding about $750million (£625m) of debt on the club’s books”. Overall, that would put the total bid at $3.75bn (£3.11bn).\nTottenham insisted on Tuesday that there had been no approach.\nAdvertisement\nThe Athletic’s Jack Pitt-Brooke and Patrick Boyland explain what it could all mean, not just for Tottenham, but also for Everton…\nWho are MSP and what is Najafi’s role?\nNajafi is the chair of investment group MSP Sports Capital, who did not respond to a request for comment on Wednesday.\nAccording to their website, MSP Sports Capital “invest in sports teams, leagues, and businesses in the sports ecosystem that are pursuing ambitious, challenging tasks.\n“We focus on opportunities where our deep expertise and elite network of principals add value. Our principals have over 65 years’ experience building companies, forging partnerships, and evolving the operations within global sports industry. The strength of our network and experience is unmatched, with our partners generating over $2bn of value over 20+ years.”\nMSP have stakes in McLaren Racing and European football clubs Augsburg (Germany), GD Estoril Praia (Portugal) and AD Alcorcon (Spain). They also have a stake in NBA franchise, the Phoenix Suns.\nHave MSP been linked with an interest in any other Premier League clubs?\nThe Athletic reported last month that MSP were interested in purchasing a minority stake in fellow Premier League side Everton.\nNajafi and MSP’s CEO Jeff Moorad, a former sports agent, attended Everton’s match with Southampton in January and were also shown around key club sites by officials.\nTalks about acquiring a minority stake in Everton have continued since then. Buying Tottenham for £3.11bn would be an altogether different level of financial commitment, so much would depend on the funding of the other partners in Najafi’s consortium.\nSo what would MSP buying Spurs mean for Everton?\nAn MSP deal for Spurs would be a blow to Everton and in particular owner Farhad Moshiri’s hopes of bringing additional capital into the club.\nAdvertisement\nMoshiri wants equity investment to aid the construction of the club’s new stadium but is also keen to bring in extra expertise to strengthen Everton’s footballing and commercial operations.\nHe has appointed Deloitte’s sports business arm to work with long-time associate Matthew Hammond on the search for outside investment.\nThe British-Iranian billionaire summarised his brief in a video interview last month.\n“It’s just bringing more expertise in terms of global sponsorship, commercial development,” Moshiri said. “A lot of specialist sport investors have this pool of knowledge, and it’s to secure that for Everton.”\nHe added that he was “close” to securing the funding he wanted. Soon after, Najafi and Moorad were spotted at Goodison.\nPotential investors would likely have input in a number of areas at Everton. The Athletic reported that MSP would push for representation on the club’s board should a deal be concluded.\nNews of MSP’s reported interest has been met with surprise at Everton’s end. The group have been seen as credible potential investors in the club and likely frontrunners, with their background in sports said to be of particular appeal.\nSources close to those talks retain faith that a deal can be concluded — either with Najafi and co or another interested party.\nDiscussions over an outright takeover with Minneapolis-based KAM Sports ended late last year, but a number of other groups have also expressed an interest in investing in Everton.\n@media (min-width:500px) {.iframe-podcast-height {height: 200px;}}@media (max-width:500px) {.iframe-podcast-height {height: 165px;}}\nBut are Tottenham even for sale?\nTottenham Hotspur would certainly not describe themselves as being ‘for sale’, but there has been plenty of interest over the years in the club. And as The Athletic has reported in the past, the long-term strategic plan of ENIC, ever since they bought Alan Sugar’s 29.9 per cent stake in 2000, has been to have one eye on a potential sale. Tottenham were valued at £80m back in 2000. More than 22 years on, the club is valued at 40 or even 50 times that. And ENIC now own 86.58 per cent of the club.\nAdvertisement\nThere have been discussions with potential buyers for Tottenham over the years although, since the Cain Hoy bid of 2014, these discussions have tended to be held in private. Todd Boehly, now part-owner of Chelsea, led a consortium that came close to buying Tottenham in 2019.\nThere has been plenty of interest from US sports owners such as Boehly and Najafi, and given the NFL games at the stadium, the presumption had always been that a new owner would come from the US. But there has also been interest from the Gulf, and Wednesday’s FT report says that 30 per cent of the purchase price from Najafi’s bid would be contributed by “backers from the Gulf, mainly from Abu Dhabi”. It certainly remains to be seen, if Najafi can make his bid, where the money would be coming from.\nOver recent years, another new idea has gained traction: that ENIC may sell a minority stake in the club. The Athletic reported last month that Daniel Levy met Paris Saint-Germain president Nasser Al-Khelaifi in early January to discuss the potential sale of a stake of up to 15 per cent to Qatar.\nWhat remains unclear is whether they would be buying shares from ENIC or new shares created in the club. (Tottenham categorically denied that the pair discussed the equity of the club.)\nAre ENIC under pressure to sell?\nLevy currently finds himself under increasing scrutiny from elements of the Tottenham fanbase, with chants for him to leave the club becoming more audible at recent games. Anti-Levy and anti-ENIC banners were prominently displayed outside the stadium before the Manchester City game earlier this month.\nBut while Levy does care what the fans think, there are no indications that ‘Levy out’ or ‘ENIC out’ chants from some fans are likely to force Levy and Joe Lewis into hurriedly selling something they have owned for almost a quarter of a century.\nLevy is said to be focused on delivering success for the club on the pitch now that the stadium is open, the pandemic is over and Tottenham have been able to invest more in players in recent years. At the end of last season, Levy arranged a £150m equity injection into the club — £50m of which has still to be drawn.\nAdvertisement\nWhen the club released their financial results last week, Levy mentioned how, since the stadium has opened, they have “invested over £500m” in the men’s first-team squad, placing Spurs “in the top five of spending in the Premier League”.\nHow much would Tottenham cost?\nUltimately, the answer is whatever Levy and Lewis would ask for, but the expectation according to multiple sources is that they would want far more than the £3.11bn reported as Najafi’s planned offer.\nTottenham released their financial figures for the 2021-22 season last week with their second highest-ever revenue of £444m, even in a season when their only European football was in the Europa Conference League group stage. (Their highest ever, £460.7m in 2018-19, came thanks to £108.4m of Champions League gate receipts and prize money.)\nClubs are often valued in terms of the sale price as a multiple of the revenue. And while European clubs have traditionally been sold for three to five times their revenue, Premier League owners are well aware of the fact that in the US, teams often go for eight, 10 or even 12 times their revenue.\nSo hypothetically, if Spurs were to be sold for $3.75bn (£3.11bn) that would represent almost exactly seven times their 2021-22 revenue. But Tottenham are likely to value the club at far more than that. At least eight times the club’s revenue (£3.5bn), more likely nine (£4bn) or even ten times (£4.4bn).\nOn top of that, Spurs’ revenues for the 2022-23 season are likely to be significantly higher thanks to the club’s return to the Champions League and the growing number of non-football events held at the stadium. They might even hit £500m. (The Beyonce concerts alone are set to rake in millions of pounds for the club.) So by this equation, the asking price for the club would likely be even higher, and further away from £3.11bn.\nWhat bearing would last year’s sale of Chelsea have on the price?\nLevy will be well aware of the fact that last year Chelsea were sold to a group of investors (including Boehly, who had tried to buy Tottenham) for £2.5bn, with a commitment to spend another £1.75bn over the next 10 years.\nAdvertisement\nThere is a view that the Chelsea sale effectively reset the market for what a top club should be sold for. And that, while Chelsea have an old ground with an expensive stadium renovation project ahead of them, Tottenham opened their new stadium in 2019 and it is already bringing in far more in matchday and event revenue.\nWith that in mind, the expectation is that Tottenham would command a higher sale price than Chelsea did last year, despite the club’s relative lack of success on the pitch.\nSo does this mean the end of the Levy era at Spurs?\nIt remains to be seen when Najafi will make an official approach to Tottenham, but the indications are that his move is unlikely to succeed, certainly at the reported figures. And even if ENIC do decide to sell to Najafi’s consortium, that does not necessarily mean that Levy would leave the club.\nPrevious takeover talks have included discussions over whether Levy would stay on and run the club under new ownership as CEO, to help facilitate a smooth transition and to secure his legacy at Spurs. He is in no mood to retire yet.\n(Photo: Tottenham Hotspur FC/Tottenham Hotspur FC via Getty Images)",
  "word_count": 1673,
  "scraped_at": "2026-02-14T01:38:01.696769",
  "_text_extracted": true
}