{
  "article_id": "7d8d2f7d3c41",
  "url": "https://impactnottingham.com/2023/02/premier-league-transfer-roundup-january-2023/",
  "title": "Premier League Transfer Roundup : January 2023",
  "date": "20230211T203000Z",
  "domain": "impactnottingham.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Vinay Patel\nAs this unique Premier League campaign resumed after a memorable winter World Cup, clubs had the opportunity to strengthen their squads for the second half of this season. A record £815 million was spent in this window alone, highlighting the allure of the English top-flight and the capital that lies within it. A groundbreaking month requires some serious rounding up; Vinay Patel is on hand to collate all the deals.\nStarting off close to home, Nottingham Forest continue their spending in a bid for survival after a rocky start to their first Premier League campaign in 24 years. With the Reds crying out for a player who slots into the “No.6” role, Danilo was signed from Palmeiras for an estimated £16 million. Joining his teammate was attacking midfielder Gustava Scarpa, joining the club on a free transfer.\nAfter limited playtime so far this season, Chris Wood has joined Forest from Newcastle on loan, as striker Taiwo Awoniyi faces a spell on the side-lines. Deadline day saw a trio of seasoned veterans arrive on Trentside, starting with Newcastle midfielder Jonjo Shelvey, Atletico Madrid centre back Felipe and to the surprise of many, goalkeeper Keylor Navas. The three-time Champions League winner joins from PSG on loan to provide cover for the injured Dean Henderson.\nLeague leaders Arsenal looked to bolster their squad as they hope to maintain their surprise title charge. Following a fallout with Brighton manager Roberto de Zerbi, Leandro Trossard forced a transfer to the Gunners for an initial £20 million. The Belgian international seems to possess exactly what Mikel Arteta needs and will provide healthy competition for the likes of Bukayo Saka and Gabriel Martinelli. Arsenal also acquired the signature of Polish defender Jakup Kiwior, from Speiza for £17 million. Giving up on their pursuit for Moises Caicedo, the league leaders completed the signing of Jorginho, from rivals Chelsea for £12 million.\nAs the future of Antonio Conte remains uncertain, Spurs turned to the transfer market as they attempt to find some consistency in their bid for top four. Arnaut Danjuma looked set to join Everton before the North London club hijacked the move and convinced the Dutch winger to sign on loan from Villareal. The London outfit also completed the signing of right back Pedro Porro from Sporting Lisbon, whose loan move will become permanent in the summer for £40 million, following arduous negotiations.\nSecuring Sean Dyche looks like it could be one of the best moves of the season\nJurgen Klopp’s underperforming Liverpool side were forced into the transfer market, as a result of long-term injuries to Diogo Jota and Luis Diaz. The club announced the signing of PSV star Cody Gakpo for an initial £37 million early in the window. Fellow Merseysiders and fellow strugglers Everton made no additions on the pitch this window, but securing Sean Dyche looks like it could be one of the best moves of the season given their victory over leaders Arsenal in his first game in charge.\nThe Erik ten Hag revolution is in full swing at Manchester United as they sit comfortably in the Champions League places. The controversial and very public exit from club legend Cristiano Ronaldo created a centre forward vacancy. After losing out on Gakpo and Joao Felix to Liverpool and Chelsea respectively, ten Hag opted for a reunion with Wout Weghorst as the Dutch striker joined on loan from Burnley, following a short spell with Besiktas. As Martin Dubravka returned to his parent club Newcastle United, Crystal Palace keeper Jack Butland joins Manchester United on a short-term loan deal. Christian Eriksen’s long-term injury also resulted in the loan signing of Bayern Munich midfielder Marcel Sabitzer.\nAlso in the top four, Eddie Howe’s Newcastle side seem to be going from strength to strength, signing Everton winger Anthony Gordon for £45 million, as he will look to add more quality to the Magpies’ front line.\nOne of this season’s biggest overachievers, Marco Silva’s Fulham have been active in the transfer market in order for it to stay that way. The West London club have signed midfielder Sasa Lukic, from Torino and Arsenal’s Cedric Soares, the latter arriving on loan.\nWith Unai Emery now at the helm, Aston Villa have backed their new manager by signing Columbian striker Jhon Duran, from MLS side Chicago Fire for £18 million. Spanish left back Alex Moreno has also joined from Real Betis, having been close to joining Forest in the summer.\nAfter a seemingly quiet transfer window, Crystal Palace decided to act late on, with midfielder Naouriou Ahamada arriving from Stuttgart for £10 million. Joining him will be Arsenal midfielder Albert Sambi-Lokonga on loan, with the Belgian in search of both form and game time.\nIt seems that no one is safe from the drop, including Leicester City\nWith the relegation battle heating up, it seems that no one is safe from the drop, including Leicester City, who have recruited right back Victor Kristiansen from FC Copenhagen. Brazilian winger Kenny Tete has also joined the Foxes, from Lyon in a short-term deal until the end of the season. Following a successful World Cup campaign with Australia, Stoke centre back Harry Souttar became their third and final signing of the window, in a deal worth £15 million.\nAlso among the underperforming sides are West Ham, in which David Moyes will expect new signing Danny Ings to put an end to their dry spell in front of goal, as the former Villain joins for £15 million. Sat rock bottom of the table, Southampton have signed forwards Carlos Alcaraz and Miroslav Orsic, as well as Ghanian winger Kamaldeen Sulemana for a club record fee of £22 million being paid to Rennes.\nFollowing a difficult start to the season, Wolves fans have a lot to look forward to as the Julen Lopetegui era is in full swing. With club record signing Goncalo Guedes leaving to Benfica for the remainder of the season, this has paved the way for striker Matheus Cunha, arriving from Atletico Madrid on loan, to become a permanent addition in the summer. Former Southampton midfielder Mario Lemina has also signed for the club from Nice in a deal worth £9 million. Joining him will be Spanish forward Pablo Sarabia from PSG. West Ham centre back Craig Dawson has also opted for the West Midlands outfit for just £3 million. Lopetegui’s final signing was Brazilian midfielder Joao Gomes from Flamengo for £15 million.\nNew faces arrived at Elland Road this window, including centre back Max Wober, from RB Salzburg, and Georginio Rutter from Hoffenheim. The French striker joins Leeds in a club record deal worth £35 million. The Yorkshire side have also brough in young centre back Diogo Monteiro from Servette and midfielder Weston Mckennie. The American international has joined the club on loan from Juventus.\nNew Bournemouth owner Bill Foley has heavily invested in this transfer window, signing FC Lorient striker Dango Outtara for £20 million and left back Matias Vina, on loan from AS Roma. Bristol City’s Antoine Semenyo moves up a division as the striker joins the Cherries in a deal worth £10 million. Ivorian winger Hamed Traore was also signed from Sassuolo, on a loan deal becoming permanent in the summer. Bournemouth’s final signing was Dynamo Kyiv centre half Illia Zabarnyi, with the Ukrainian joining for a fee in the region of £24 million.\nTodd Boehly continues to display his seemingly infinitely lined pockets\nDespite all of this activity, the winners of the transfer window are undoubtedly Chelsea, as Todd Boehly continues to display his seemingly infinitely lined pockets, taking the Blues’ spending up to a reported £289 million this window!\nDavid Datro Fofana got the ball rolling, as the Ivorian striker signed from Molde for around £10 million. Joining him will be midfielder Andrey Santos, from Brazilian club Vasco de Gama for £13 million. Frenchman Benoit Badiashile was signed from Monaco for £35 million as he hopes to support Thiago Silva in the heart of the defence. Boehly’s financial might was clearly indicated in the signing of winger Mykhailo Mudryk, who joined from Shakhtar Donetsk for an initial £62 million (potentially rising to £88.5 million). Despite the Ukranian expressing his admiration for Arsenal on multiple occasions, the Gunners walked away from negotiations as the Blues were willing to pay the steep asking price.\nAnother surprise signing was Joao Felix, who joins the West London club on a short-term loan worth £10 million(!) following a mixed spell at Diego Simeone’s Atletico Madrid. With the spending spree far from over, next to arrive at the Bridge was England U21 star Noni Madueke, signing from PSV in a deal worth £29 million. French right back Malo Gusto also signed for the Blues for £31 million but will be loaned back to Lyon until the end of the season.\nAll eyes now turn to Graham Potter, who will be feeling the pressure now more than ever as he will hope that his new signings can elevate Chelsea\nSaving the best until last it seems, Chelsea paid a British record fee of £107 million to Benfica for World Cup winner and the tournament’s best young player, Enzo Fernandez. All seemed lost in the chase for the Argentinian earlier in January, but Boehly’s perseverance eventually paid off in the final hours of the transfer window, with the midfielder impressing on his debut against Fulham. All eyes now turn to Graham Potter, who will be feeling the pressure now more than ever as he will hope that his new signings can elevate Chelsea away from mid-table and into European football.\nVinay Patel\nFeatured image courtesy of Braden Hopkins via Unsplash. Image use license found here. No changes were made to this image.\nIn article image 1 courtesy of @nufc via Instagram. No changes were made to this image.\nIn article image 2 courtesy of @wolves via Instagram. No changes were made to this image.\nFor more content including uni news, reviews, entertainment, lifestyle, features and so much more, follow us on Twitter and Instagram, and like our Facebook page for more articles and information on how to get involved.\nFor further sports content and ways to get involved, follow @ImpactSport on Twitter and Instagram, and like the Impact Sport Facebook page!",
  "word_count": 1708,
  "scraped_at": "2026-02-14T01:59:41.716793",
  "_text_extracted": true
}