{
  "article_id": "7da1092f9bd2",
  "url": "https://www.geosuper.tv/latest/34972-kylian-mbappe-to-real-madrid-is-inevitable-claims-ex-psg-man-utd-star",
  "title": "Kylian Mbappe to Real Madrid is  inevitable , claims ex - PSG , Man Utd star - Football Leagues",
  "date": "20240402T203000Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nApril 02, 2024\nFormer Paris Saint-Germain and Manchester United midfielder Ander Herrera claimed that Kylian Mbappe to Real Madrid is “inevitable” as all best players in history should play for Los Blancos.\nMbappe’s move to Madrid is just a matter of time now as multiple outlets have reported that the official deal will be announced as soon as final details are agreed upon between the two sides.\nHerrera, who played for PSG from 2019 to 2022, stated that Mbappe to Madrid was always a matter of time as he ended up calling the Whites “best club in history”.\n\"Kylian Mbappe to Real Madrid next season? Yes, of course. I think their paths would have crossed sooner or later. It's inevitable that Kylian ends up at the best club in the history of football,” Herrera said in a conversation with Spanish channel El Chiringuito.\n“I played at [Manchester] United, PSG... but you can't deny the obvious. The best players in the history have to be at the most successful club in the history, Real Madrid,” he added.\nEarlier, it was reported that Real Madrid is not concerned that the arrival of Mbappe will affect the Spanish club’s dressing room.\nAccording to Spanish news outlet Relevo, no one at Real Madrid is of the opinion that Mbappe will ruin the dressing room’s atmosphere.\nThe report added that the situation is the complete opposite in the dressing room as they are counting the days to welcome the French star at the club.\nRemember, Madrid have been trying to sign Mbappe since his AS Monaco days in 2017-18 but the player decided to join PSG on a €180 million deal.\nThe deal was likely to happen last summer after the 25-year-old sent a letter to the French club saying that he would not extend his contract till 2025.",
  "word_count": 307,
  "scraped_at": "2026-02-14T01:48:46.203084",
  "_text_extracted": true
}