{
  "article_id": "7da65fb8e3f6",
  "url": "https://www.caughtoffside.com/2023/10/05/inside-spain-breaking-down-the-barcelona-bribery-case-injury-crises-and-jude-bellingham-reings-supreme/",
  "title": "Inside Spain : Breaking down the Barcelona bribery case , injury crises and Jude Bellingham reigns supreme",
  "date": "20231005T154500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Inside Spain is a weekly instalment brought to you by Football España, providing an insight into all of the major stories coming out of the rich and intense climes of La Liga and beyond.\nBarcelona have been formally charged with bribery, in case you had missed it. The Negreira case was always going to rumble on, but now it looks as if the Blaugrana will have their day in court.\nThe court magistrate has charged Barcelona for paying a public official €7-8m (£6-7m) over 17 years for their business relations with Jose Maria Enriquez Negreira, the Vice-President of the Referees Committee, between 2001 and 2018. The nuance is important here – previously Barcelona were being investigated for sporting corruption, which would require proof that Barcelona had received favourable treatment for their money. With bribery, just the intention is enough, the public prosecutor will only need to prove that.\nThis could result in anything from a warning to relegation to dissolving the club, depending on what the judge decides at the end of the case. Meanwhile UEFA could kick Barcelona out of next season’s Champions League too, although Barcelona feel they have found a loophole to get out of it.\nOn the pitch, they rumble onwards after stodgy wins over Sevilla and Porto, but the mood is one of concern. Robert Lewandowski is a major doubt for El Clasico on the 28th of October after spraining his ankle against the Portguese giants. That will keep him out for anywhere between three and five weeks.\nThe games Robert Lewandowski could miss:\n??Granada\n?Athletic Club\n?Shakhtar Donetsk\n?Real Madrid\n??Real Sociedad\n??Shakhtar Donetsk\n?Alaves#Barca #ElClasico #Lewandowski pic.twitter.com/Jj8JajXRM6— Football España (@footballespana_) October 5, 2023\nReal Madrid are also suffering with injuries. David Alaba looks close to a return, to join their last standing central defender Antonio Rudiger. Nacho Fernandez will now begin a three-game ban after a horror challenge on Girona’s Portu last weekend in a 3-0 win. It sort of doesn’t matter when Jude Bellingham is in this form. Against Girona he provided a Luka Modric-esque outside of the boot assist for Joselu Mato, while he was imperious against Napoli in their 3-2 win in Italy. Bellingham now has 9 goals and 2 assists in 9 games, better numbers than Cristiano Ronaldo started off with. Modric on the other hand is not happy about being on the bench, something that has become very public over the last week.\nVinicius Junior is back on the pitch and scoring, but after testifying in a racism case from when he was abused at Mestalla during a match with Valencia. Reportedly, he told the judge the whole stadium was chanting ‘monkey’ at him rather than just some, which Valencia responded to quickly. ‘Racism cannot be combated with fallacies, nor unfounded lies’, say Valencia in another slightly uncomfortable statement.\nIt’s been a busy week for the courts, as various members of the Spain squad, staff and management testify in the sexual assault and coercion case against Luis Rubiales – including the man himself, who said he would do the same again if the war ended in Ukraine.\nReal Madrid are back at the top of the table, closely followed by Atletico Madrid, Girona and Barcelona, which is impressive for Atleti given 11 of their players have missed game time this season through injury. They’ve only played 10 games. It’s not going so well for Rafael Benitez at Celta Vigo. He slipped into the relegation zone after a 97th-minute Las Palmas winner on Monday night, although his side did have a goal disallowed in dubious circumstances. The latest Liverpool-linked figure in the game to complain about VAR, ‘What are we doing here, this is football, not ping pong?’, Benitez fumed in a remarkable rant.",
  "word_count": 625,
  "scraped_at": "2026-02-14T02:00:57.113335",
  "_text_extracted": true
}