{
  "article_id": "7db810853bfc",
  "url": "https://www.themag.co.uk/2025/10/la-liga-u-turn-on-playing-match-overseas-great-news-but-pressure-needs-to-be-maintained-villarreal-barcelona-premier-league/",
  "title": "La Liga u - turn on playing match overseas - Great news but pressure needs to be maintained",
  "date": "20251023T120000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "La Liga u-turn on playing match overseas – Great news but pressure needs to be maintained\nBrilliant news as La Liga have announced that they have cancelled plans to have the Villarreal v Barcelona league match played in the USA.\nThis December La Liga game had been moved to Miami, only for this week a u-turn.\nProtests from both fans and players in Spain appear to have helped force the decision.\nHowever, as BBC Sport report (see below), it appears very likely that the finances just didn’t add up, that it wasn’t going to be a big enough pot of gold to make it worthwhile.\nEspecially when it came to the additional expense of potentially flying 5,000 Villarreal fans from Spain to the USA for the match, as a sop to those supporters who would be losing a home game.\nMoney is the only motivation for this ridiculous idea of playing regular league games abroad and now it is vital that Serie A are also forced to back down, as they still plan to play in February a ‘normal’ league match between Como and AC Milan in Perth, Australia.\nI think these couple of sentences from the BBC Sport report, perfectly sum up the daft reasoning La Liga put forward…\nLa Liga said it “deeply regrets” the postponement and described it as a blow to the “international profile of the entire football ecosystem”.\nLa Liga also believed staging an official match outside Spain would have been a “decisive step in the global expansion” of its competition, and that “passing up such opportunities makes it difficult to generate new revenue”.\nLa Liga tried to bury the story as much as possible by announcing the u-turn in the middle of the Champions League third round matches, actually making the announcement DURING the Villarreal home defeat to Man City on Tuesday night.\nThere are all kinds of reasons as to why this idea is unacceptable, with at the very top of the list, that no club or league should have the right to take a match away from the supporters of that club, away from where they usually play their home games. Maybe it would be acceptable if they polled the fans of that home club and they voted in favour of playing a league game overseas BUT of course the club/league is never ever going to do that, as they know absolutely what the overwhelming vote would be.\nFrom what journalist Guillem Balague says, this won’t be the end of it, that La Liga and certain Spanish clubs will try this again, believing that huge riches can be generated by moving matches overseas.\nThis must be resisted because if La Liga and/or Serie A do play matches abroad and they generate a huge amount of extra cash, then Premier League owners will for sure look to replicate that.\nBBC Sport report – 22 October 2025:\nLa Liga has cancelled plans to hold a regular-season match between Villarreal and Barcelona in Miami in December.\nIn August, the Spanish football federation (RFEF) approved plans to move Villarreal’s fixture against Barcelona to Hard Rock Stadium on 20 December – a decision that sparked discontent in Spain.\nThe plans to hold a top-flight game outside Spain for the first time faced a huge backlash, with players refusing to move for the first 15 seconds of matches in La Liga at the weekend.\nPromoters of the match, Relevent, state the reason for the cancellation is because of “insufficient time” to organise the event, with La Liga also citing the “uncertainty in Spain”.\nThe match will now be held at Villarreal’s Estadio de la Ceramica home as originally scheduled.\nThe decision to cancel the match in Miami was announced during Villarreal’s 2-0 Champions League defeat at home by Manchester City.\nLa Liga said it “deeply regrets” the postponement and described it as a blow to the “international profile of the entire football ecosystem”.\nLa Liga also believed staging an official match outside Spain would have been a “decisive step in the global expansion” of its competition, and that “passing up such opportunities makes it difficult to generate new revenue”.\nAfter the Miami game was originally confirmed, the Italian football federation (FIGC) decided to sanction a Serie A match between AC Milan and Como to be played in Perth, Australia, in February.\nBarcelona said it “respects and accepts” the decision to cancel the match and “regrets the missed opportunity to expand the competition’s image” in a market that has a “great capacity for growth and generation of resources for everyone”.\nThe club added it “regrets deeply” that its fans in the USA “are denied the opportunity to see an official game in their country”.\nDespite the match being cancelled, Spanish football expert Guillem Balague does not think this is the end of the story.\nHe told BBC Radio 5 Live: “Whilst Javier Tebas is the head of La Liga, he will try to get one game away.\n“He thinks that it’s a project, as the statement says, aimed at enhancing the visibility of Spanish football.\n“It complied fully with federation regulations. The position on the project was just for reasons unrelated to regulatory or sporting integrity.”\nBalague believes finances were the main reason behind the cancellation of the match.\n“Perhaps there wasn’t enough money, perhaps the money wasn’t clear where it was going, but certainly it’s been a lot of confusion,” he added.\n“Villarreal were saying, ‘We’re not getting any money for it’, but Barcelona were saying, ‘As soon as we get into the plane, we will get money’.\n“It wasn’t clear how Villarreal had promised about 5,000 of their fans would go to Miami, or how that was going to happen.”\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 967,
  "scraped_at": "2026-02-14T01:49:53.045458",
  "_text_extracted": true
}