{
  "article_id": "7dc2146ca184",
  "url": "https://www.gdnonline.com:443/Details/1372182/El-Kaabi-nets-double-in-dominant-Morocco-win",
  "title": "Football : El Kaabi nets double in dominant Morocco win",
  "date": "20251230T013000Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FOOTBALL – Morocco forward Ayoub El Kaabi netted a double and midfield maestro Brahim Diaz added another as the Africa Cup of Nations hosts turned in a convincing performance in outclassing Zambia 3-0 yesterday to top Group A.\nEl Kaabi powered home an early headed goal and then scored with one of his trademark bicycle kicks while Diaz netted for the third successive game as Morocco swept their opponents aside to finish on seven points ahead of second-placed Mali on three.\nAfter a timid start to the tournament, with a nervy opening game win over tiny Comoros and then an uninspiring 1-1 draw with Mali on Friday, Morocco finally looked like the favourites that many have made them for the 24-team tournament.\nDefeat meant Zambia were eliminated, as they finished bottom of the group with two points, behind Comoros on goal difference.\nMorocco were on the attack from the start with Zambia goalkeeper Willard Mwanza forced into a save after 12 seconds and then making a point-blank stop in the sixth minute to deny Abdessamad Ezzalzouli.\nBut he was unable to stop El Kaabi’s diving header in the ninth minute as the striker powered his way in between three defenders to get onto the end of a corner.\nEl Kaabi might have had his second goal in the 27th minute but failed to get a touch to Ezzalzouli’s driving cross. But Diaz timed his arrival in the box perfectly to sweep it home with the left foot.\nDiaz drove most of the Moroccan attacks. A menace to the opposing defence with his trickery on the ball, he is fast becoming a fan favourite at the tournament.\nEl Kaabi’s second goal came from a ball over the top of the Zambian defence as he launched into an overhead kick for a spectacular finish. It was initially flagged offside but a VAR check confirmed he was onside when the ball was delivered.\n“It was not an easy match but thanks to a well thought game plan, we managed to secure the result we needed and seal our qualification,” said Morocco coach Walid Regragui.\n“We are the home team so we must always play our games as a final. We have a very supportive crowd who are rallying behind us and that is why all the players are giving it their best in every match,” he added.\nMorocco captain, and recently crowned African Footballer of the Year, Achraf Hakimi came on to great acclaim as a 64th minute substitute and had a beaming smile on his face in his first outing since suffering an ankle injury in the Champions League almost eight weeks ago.\nHakimi’s participation in the tournament had been in doubt but his recovery was completed sooner than expected with praise from his coach for his application in the rehabilitation process.\nThe Paris St Germain right back was inches away from a fairytale goal in the 81st minute as a stabbed effort with the outside of the boot looked bound for the net, only for Mwanza to make a full-stretch save.\nMorocco now wait to find out the identity of their opponents in the last 16 at the weekend, which will be one of the four best third-placed finishers.\nMeanwhile, Mali and Comoros played to a tepid 0-0 draw in their Group A fixture in Casablanca, a result that sends the Malians into the last 16 and eliminates their rivals from the tournament.",
  "word_count": 572,
  "scraped_at": "2026-02-14T02:15:58.641231",
  "_text_extracted": true
}