{
  "article_id": "7dd1eaa8927b",
  "url": "https://www.masslive.com/tv/2026/02/where-to-watch-duke-vs-north-carolina-for-free-tonight.html",
  "title": "Streameast alternatives to watch Duke vs . North Carolina for free tonight",
  "date": "20260207T230000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "One of college basketball’s most storied rivalries resumes Saturday when the Duke Blue Devils visit the North Carolina Tar Heels at the Dean E. Smith Center in Chapel Hill. Tipoff is set for 6:30 p.m. EST with ESPN carrying the broadcast.\nFans looking to watch can do so for free by using DirecTV, which offers a free trial, or FuboTV, which also offers a free trial as well as up to $30 off your first month. Paramount+ also offers a free trial. Apple TV+ offers a free trial along with multiple other ways to gain free access. SlingTV doesn’t offer a free trial but has promotional offers available for streaming the game. HBO Max has movies, original series, live sports and more and can be bundled with Disney+ and ESPN and Hulu for $16.99 a month. You can stream ESPN Unlimited on your phone, tablet, smart TV or gaming console, and bundle your plan with NFL+ Premium or with NFL+ Premium, Disney+ and Hulu. Additionally, those with DirecTV, FuboTV or Hulu + Live TV can access ESPN Unlimited through their package.\nDuke enters the game as the conference leader with a perfect 10-0 ACC record and a 21-1 overall mark. The Blue Devils are riding a five-game winning streak after defeating Boston College 67-49 in their most recent outing. North Carolina sits fifth in the conference standings at 6-3 in ACC play and 18-4 overall.\nESPN Analytics gives Duke a 77.1% chance of winning the matchup.\nThe Tar Heels have won four of their last five games, most recently defeating Syracuse 87-77. Their only loss during that stretch came at California on Jan. 17, when they fell 84-78.\nBoth teams feature potent offenses, with Duke averaging 84.1 points per game while limiting opponents to 63.6. North Carolina averages 83.1 points but allows 70.6 per game.\nThe teams are evenly matched statistically. Duke shoots 50% from the field compared to North Carolina’s 48%. The Tar Heels hold slim advantages in rebounding at 40.0 per game to Duke’s 39.9 and in assists with 17.2 to the Blue Devils’ 17.1.\nCameron Boozer leads Duke with 23.3 points, 9.9 rebounds and 4.0 assists per game. For North Carolina, Caleb Wilson averages a team-high 20.0 points and 9.8 rebounds, while Kyan Evans leads the team with 3.0 assists per game.\nWho: North Carolina Tar Heels vs Duke Blue Devils\nWhen: 6:30 PM, February 7, 2026\nWhere: Dean E. Smith Center\nStream: DirecTV (free trial); FuboTV (free trial); Paramount+ (free trial); SlingTV; HBO Max; ESPN; Peacock\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is DirecTV?\nDirecTV is an internet TV service that offers your favorite entertainment, news and sports channels, as well as local TV stations and regional sports networks. Sign up now and get three free months of premium channels including HBO Max, Paramount+ with SHOWTIME and Starz.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $30 off the first month for new customers.\nWhat is Sling TV?\nSling TV offers a variety of live programming ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancellation.\nWhat is ESPN?\nESPN is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs, WWE premium live events and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programming like NFL Primetime and Dana White’s Contender Series. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month. You can also stream ESPN Unlimited on any of those devices, and bundle your plan with NFL+ Premium or with NFL+ Premium, Disney+ and Hulu. Additionally, those with DirecTV, FuboTV or Hulu + Live TV can access ESPN Unlimited through their package.\nWhat is Peacock?\nPeacock offers a variety of sports, including: NFL, MLB, NCAA (football and basketball), Premier League, NBA, NASCAR, PGA Tour, and more. The dedicated “Sports” section within Peacock provides replays, news and analysis. Sports airing on NBC, NBC Sports, USA Network, NBC Universo and Telemundo will be available to you if you have the right Peacock plan. Peacock Premium costs $10.99 per month or $109.99 per year. Peacock Premium Plus costs $16.99 per month, and includes all the same content as Peacock Premium, but without ads. Premium Plus subscribers can also download and watch select titles on the go, and stream their local NBC affiliate.\nWhat is Paramount+?\nParamount+ is a streaming platform with hundreds of thousands of tv episodes and movies available along with the ability to access even more content through Paramount+ with SHOWTIME. Watch the NFL on CBS and the UEFA Champions League through the basic service, or upgrade for additional sporting events such as NWSL games and The Masters.\nWhat is HBO Max?\nHBO Max is a streaming service that combines the catalogues of HBO and the various channels that make up the Warner Bros. Discovery Networks like CNN, Discovery Channel and TLC. The service is also partnered with Bleacher Report to provide sports coverage for anything covered by Turner Sports such as the NBA on TNT, the NHL on TNT, college basketball games on TNT and TBS and the Unrivaled 3x3 basketball league. You can also bundle your HBO Max subscription with Disney+ and Hulu.\nMore sports, gear and tickets\n- Where to stream Rising Stars Challenge and HBCU Classic live today\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live",
  "word_count": 1078,
  "scraped_at": "2026-02-14T02:06:30.619431",
  "_text_extracted": true
}