{
  "article_id": "7e05b8b583a3",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/46552.html",
  "title": "What does a successful season look like for Everton ? ",
  "date": "20250818T120000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "You can try to find the updated link in the article archive or in the News section.\nReader Comments (32)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 18/08/2025 at 10:09:03\nPremier League: 14th\nFA Cup: 5th round\nLeague cup: 4th round\nTop Goalscorer: Ndiaye\nPlayer of season: Pickford\n2 Posted 18/08/2025 at 10:21:17\n3 Posted 18/08/2025 at 11:28:46\nWe don't need to copy Manchester City or even worse Southampton under their first manager last season. But on the other hand, I don't want to see Pickford or Tarkowski launch high balls to Beto all the time.\nWe have bought well and ambitiously with Grealish and Dewsbury-Hall and need to add a few of that quality.\nFinishing 10th and a more attractive playing style would be excellent.\n4 Posted 18/08/2025 at 11:31:07\n5 Posted 18/08/2025 at 11:35:06\n6 Posted 18/08/2025 at 11:39:17\nRightt now, above anything else, I'd take 17th if it meant we won a trophy.🤞\n7 Posted 18/08/2025 at 11:59:12\nNewcastle and Palace showed last season it can be done. Target both cup competitions and see if we can win either.\n8 Posted 18/08/2025 at 11:59:18\nIf we can take 5 points minimum from our first 3 games, we will be looking at a platform.\n9 Posted 18/08/2025 at 11:59:48\nDoucoure leaves for free, replaced by Dewsbury-Hall at £25M. Ditto Ashley Young, ditto Calvert-Lewin. So just getting to par is bloody expensive before we even think about improving the squad.\nAnd then we have the fact our finish flattered us a bit last season, getting all those away wins at Palace, Brighton, Newcastle, Fulham.\nAlso, expect a slow start, for obvious reasons.\n10 Posted 18/08/2025 at 12:26:37\nI also think our success depends more on the promoted teams and the other teams we finished above, inasmuch as, in recent seasons, we have been largely reduced to wondering how many teams were worse than us.\nI'd hope we are better than the three promoted teams, probably Brentford, hopefully West Ham and Wolves… and will Man Utd remain a basket case? I expect Spurs will be better than us, so can we compete with Fulham and Palace?\nRealistically, I'd expect 11th to 13th, but the pre-season optimist in me has at 8th, with 12-goal Grealish tearing it up, Beto to get 20 and Dewsbury-Hall to be Player of the Season because he just got on with it and was ever-present.\n11 Posted 18/08/2025 at 12:26:49\nWith regard to Everton, if we play as robustly as we did against Newcastle in the last game of last season and, with our new recruits, become more creative and finish our chances, I would like to think Top 10 to Top 6 barring massive injuries and suspensions.\n12 Posted 18/08/2025 at 12:34:09\nA decent season is Europa League qualification.\nWhat is realistically achievable this season will be down to how our squad compares with others in an extremely competitive Premier League, by the end of the window. Hard to tell right now.\nHowever, as part of our journey towards being successful again I hope we finish in the Top 10 and go really serious in the cup competitions. Also getting us playing more like the style of a big club again. I wouldn't treat that as success but it's a start.\n13 Posted 18/08/2025 at 12:37:05\nI don't think thats being too optimistic, but we need those extra class players to do it.\nAs we are we are looking at 13th to 16th\n14 Posted 18/08/2025 at 12:43:35\nSo why not?\nThe reality is probably a bit different. I was trying to think back to the expectations when Moyes arrived. I reckon most people said he'd have done well if he stabilised things last year and then got us to midtable this year with progress on a rebuild of the squad.\nWith some young players signed it at least feels like we're on the right track.\nI have a nagging sense that the next couple of years might be pretty underwhelming. Midtable is generally a pretty dull place to be.\n15 Posted 18/08/2025 at 12:58:28\nForest only score 1 goal all pre-season – and then got 3 in the first half… difficult to predict what will happen.\n16 Posted 18/08/2025 at 13:01:03\n17 Posted 18/08/2025 at 13:22:59\n18 Posted 18/08/2025 at 13:25:14\nI think – as amazing the new stadium is – lots of teams will up their game coming to our place; first season can be tricky. A good start there for us will be important.\nLots of other teams in Europe though who will be playing twice a week, when we can put all our focus on the Premier League and the cups.\nTop 10 would be a good improvement, but I feel we will finish 12th-13th again.\nIf we can show the football is getting better, can see a few young lads making a difference, like Barry and Dewsbury-Hall and other incoming, the 3 places from 10 to 13 won't really matter, it's about improving.\nWith our defence when all fit and a new right-back, we always have a chance in one-off matches, maybe this could be a good cup-run year.\n19 Posted 18/08/2025 at 13:32:26\nA secondary level is to win more than you lose and score more than you concede: this should be the minimum.\nTake the cups very seriously. An away defeat at one of the very best teams should be the only way we get knocked out.\nIt's hard to make judgements when we still clearly need 2-3 players. If we get the right ones, then I'll be unhappy if we're not thinking about Europe in April.\nWe need to have a season that makes players want to come and play for us.\n20 Posted 18/08/2025 at 13:52:16\nHopefully next season we can build on the squad and hopefully challenge for a Top 8 finish.\n21 Posted 18/08/2025 at 13:57:34\nRather than \"what would be success?\", it's more about what should be expected from existing personnel and level of investment.\nOn that basis, it can't really be anything more than to retain Premier League status. If our squad is not improved in the next couple of weeks then I think we will struggle to achieve 13th again.\n22 Posted 18/08/2025 at 14:02:17\nLet me see if I can insert a table here from 2013-14 to 2024-25\nPL Season Points Position Goal Difference Manager(s)\n2013-14 72 5 22 Martinez\n2014-15 47 11 -2 Martinez\n2015-16 47 11 4 Martinez\n2016-17 61 7 18 Koeman\n2017-18 49 8 -14 Koeman/ Allardyce\n2018-19 54 8 8 Silva\n2019-20 49 12 -12 Silva/Ancelloti\n2020-21 59 10 -1 Ancelloti\n2021-22 39 16 -23 Benitez/Lampard\n2022-23 36 17 -23 Lampard/Dyche\n2023-24 48 12 -11 Dyche\n2024-25 48 13 -2 Dyche/Moyes\nI believe that the key to achieving a high league finish is the goal difference. I can hear some people saying \"Duh!\", but look at the table.\nThe lowest league finish we had with a positive GD was 11th, in the 2015-16 season. The inference being that from last season, when we finished 13th with a -2 GD, if we add more goals, we could easily get into the Top 10.\nFor that reason, I hope that our recruitment team is prioritising a proven Premier League goal-scorer. I think Rasmus Højlund from Man Utd would be a good option if he is willing to move to Everton. He would cost £30M, which seems a lot for a guy who scored only 10 goals in about 50 games for Man United last season.\nBut I think there is an intelligent striker in there, and playing for a team like Everton would be less pressure than Man Utd, and he could easily add about 10 goals next season playing for us.\n23 Posted 18/08/2025 at 14:26:08\nThe cup games usually go on luck with the draw, that makes it unpredictable.\nWe have a new board, and a new manager, who has shown he can improve a squad with the right backing, plus what we hope will make a big difference, A New Ground.\nWe seem to be behind on players for the first game of the season, but I believe it is better waiting for the type of player you want, rather than just bring in anyone who is available.\n24 Posted 18/08/2025 at 16:12:13\n25 Posted 18/08/2025 at 16:37:34\nUnited and Spurs and Forest have strengthened significantly and I would expect them to finish above us this season. Brentford will struggle along with Wolves and West Ham will be average again. I think at least one of the promoted sides will stay up but cant see any of them finishing above us.\nIf we get a decent RB RW and goalscorer in I would hope for a top half finish but with the new stadium and lack of signings that may be too optimistic.\nThe sides we have to compete with are Villa, Palace, Fulham, Bournemouth and Brighton. If we better them it will be a good season.\n26 Posted 18/08/2025 at 17:07:07\n27 Posted 18/08/2025 at 17:16:40\nDepends now on who else we can sign.\n28 Posted 18/08/2025 at 17:34:39\nKeep it tight at the back, add more goals.\nYou don't need to be PEP to see that, it's about being more creative and attacking, while not losing that solid defensive Base.\nKDH & BARRY will score more this season than DCL & dacoure did last year, Grealish & KDH should provide more for beto,Ndiaye & Barry, so I'm optimistic for more goals.\nGet that GD a bit better !!\n29 Posted 18/08/2025 at 18:02:08\n30 Posted 18/08/2025 at 22:50:04\nSuccess for this club is what most of us now know it.\nFinished 12th and that's it.\n31 Posted 18/08/2025 at 23:15:37\n32 Posted 19/08/2025 at 07:54:00\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 1719,
  "scraped_at": "2026-02-14T01:52:36.771908",
  "_text_extracted": true
}