{
  "article_id": "7e0544876f2f",
  "url": "https://www.france24.com/en/live-news/20230423-raspadori-smashes-napoli-past-juve-and-to-the-brink-of-title-glory",
  "title": "Raspadori fires Napoli past Juve and to the brink of title glory",
  "date": "20230424T021500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Raspadori fires Napoli past Juve and to the brink of title glory\nMilan (AFP) – Giacomo Raspadori fired Napoli to the brink of their first Serie A title in over three decades on Sunday with his stoppage-time winner in a 1-0 triumph at Juventus which was packed with late drama.\nIssued on: Modified:\nItaly international Raspadori was left completely unmarked to lash home a volley from Eljif Elmas's cross in the 93rd minute of a pulsating encounter in Turin, pushing Napoli 17 points ahead of second-placed Lazio, who lost at home to Torino on Saturday.\nRaspadori's late winner means that Napoli, who were knocked out of the Champions League by AC Milan on Tuesday, can win Serie A for the first time since 1990 next weekend if they beat Salernitana and Lazio fail to win at Inter Milan.\n\"It was a very important goal, but we still have matches to win. Today gave us a great hand as we came from disappointment in the Champions League,\" said Raspadori.\n\"We only have one thing on our minds, get three points against Salernitana.\"\nJuve stay third, where they rose to on Thursday following the decision to revoke their 15-point penalty for illicit transfer activity, after their third straight league defeat.\nHowever they await a new ruling from the Italian Football Federation's (FIGC) appeals court to see if they will be handed a new points penalty, a decision which will have a big impact in Serie A's race for the Champions League.\n\"We played well but we conceded a really idiotic goal,\" said Juve coach Massimiliano Allegri.\n\"It's the 93rd minute you have to have bodies into the box to defend.\"\nLate drama\nJuve thought they had snatched the points for themselves when substitute Angel Di Maria netted a brilliant solo effort with eight minutes remaining, only for referee Michael Fabbri to then rule it out for a foul on Stanislav Lobotka which Juve were convinced was a good tackle.\nBy that point Victor Osimhen should have already put Napoli ahead through one of the three golden chances he missed midway through the second half.\nFirst he clipped the outside of the post in the 70th minute following great work from Elmas and then headed a great opportunity straight at Wojciech Szczesny from the subsequent corner.\nThe away fans then had their heads in their hands three minutes later when Osimhen was brilliantly fed by Giovanni Di Lorenzo but could only smash his close-range finish over the bar.\nHowever after Di Maria had another goal chalked off for the ball going out of play, and Osimhen miscontrolled when clean through on goal, Raspadori popped up to take Napoli to potentially one match from fulfilling the dream of a generation of fans.\nLeao and Lukaku doubles\nRafael Leao and Romelu Lukaku both hit braces as the Milan giants earned straight-forward wins over Lecce and Empoli days after setting up a derby Champions League semi-final.\nOn a high from his stellar display which knocked Napoli out of Europe on Tuesday, Leao scored his first home goals since November in fifth-placed Milan's 2-0 success over lowly Lecce, heading them in front in the 40th minute at the San Siro before slinking up the pitch and rolling home the second with 15 minutes remaining.\n\"I thought about that before the match, that I needed to score because it was such a long time since I had here,\" said Leao after taking his league tally to 12.\nStefano Pioli's side are outside the Champions League positions on goal difference behind Roma, who are at Atalanta on Monday night.\nMilan are also two points ahead of Inter following their 3-0 win at Empoli which came thanks to two fine low finishes in the second half from Lukaku, his first league goals from open play since the opening day of the season.\nLukaku, who also set up Lautaro Martinez's late strike, then hailed as a \"step forward for Italian football\" the FIGC overturning his one-match ban for being sent off in the first leg of their Italian Cup semi-final with Juve, as he was racially abused before being dismissed.\n© 2023 AFP",
  "word_count": 692,
  "scraped_at": "2026-02-14T01:55:54.939426",
  "_text_extracted": true
}