{
  "article_id": "7e26a2dcaee4",
  "url": "https://www.managingmadrid.com/2023/5/3/23708854/three-answers-three-questions-real-madrid-loss-at-real-sociedad",
  "title": "Three answers and three questions from Real Madrid loss at Real Sociedad",
  "date": "20230503T001500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was all too predictable, but a depleted and unmotivated Real Madrid side lost 2-0 at Real Sociedad on Tuesday night, with Takefusa Kubo and Ander Barrenetxea netting the goals. We had many pre-match doubts about this one, and even more post-match doubts and questions now. And, the main ones are discussed below.\nThree answers and three questions from Real Madrid’s loss at Real Sociedad\nThe talking points after this second midweek loss in a row.\nThree answers\n1. Would it be more than just the ‘forced’ rotations?\nAhead of the game, in the pre-match press conference, Carlo Ancelotti promised that he would only make “forced” rotations. In other words, those dropping out the line-up would be those on the injury or suspension list. We already saw Karim Benzema withdrawn from the squad on the morning of the game, even though there was no report of an injury, but what about the rest of the squad? Well, Ancelotti did more or less keep his word. The only regular starter who was available but who didn’t start in this game was Fede Valverde, and he too wasn’t 100 percent fit so that could also be considered a “forced” rotation. Some will think the Italian should have made some un-forced rotations too to keep his best players fresh, but we know by now that this isn’t his style.\n2. How would Real Madrid’s attack look with neither Vinícius nor Benzema?\nReal Madrid have had a few matches without Vinícius and a few without Benzema, but they’re very rarely missing both forwards. The only time neither player featured in a game this season was the Copa del Rey game against Cacereño. The last top-level game both the Brazilian and Frenchman sat out was Matchday 37 of last year’s league campaign, a 1-1 draw at Cádiz. Given how important they both clearly are, how would Real Madrid cope in attack at the Reale Arena? Well, not well. It says it all that Real Madrid’s best chances came via set pieces. While Rodrygo is a capable replacement for Vinícius, starting Mariano up front just isn’t a serious option. He had the fewest touches of anyone on the pitch, with just 13.\n3. Would Real Madrid have the right motivation?\nBesides the absences, the other key to this match was always going to be the levels of motivation in the Real Madrid team. That was the problem away at Girona last midweek, as too many players didn’t approach that game with the right focus and desire. With the LaLiga title race over, it does make sense. So, that was always a concern ahead of this game. While it wasn’t as bad as the Girona debacle, it’s clear that Real Madrid are sleepwalking through the end of this LaLiga campaign.\nThree questions\n1. Why did Mariano get the start?\nThe main question many Madridistas will have right now is: why was Mariano given this opportunity to start in Benzema’s absence? Playing the No.9 position for Real Madrid should be a privilege and Mariano simply hasn’t done enough, in matches or in training, to earn that privilege, especially when there are younger forwards champing at the bit to prove themselves and give their all. Álvaro Rodríguez is Exhibit A here, as he deserves these kinds of minutes and the club should want him to play more than the half hour he got tonight. Even if he only played as recently as Sunday, when he scored for Castilla, he is just 18 years of age and would have been perfectly capable of starting again here.\n2. What does the future hold for Kubo?\nIt was Takefusa Kubo who opened the scoring tonight against his former club, a club he never actually made a first-team appearance for. The Japan international’s relationship with Real Madrid is a curious one, and Ancelotti spoke in the pre-match press conference of how the directors at the Bernabéu are still monitoring the winger and evaluating whether they should try to bring him back. There isn’t a straight up buy-back clause, but Real Madrid are believed to have a preferential option on the 21-year-old. The reality is that Kubo probably isn’t quite at Real Madrid level and Los Blancos have enough similar profiles anyway. But, what does the future hold for this young talent? If Real Sociedad do qualify for the Champions League, you’d assume he’d stay in San Sebastián, a city he loves, to play in European football’s top competition next year.\n3. Will Real Madrid concede so many cutbacks against Manchester City?\nThe Militão mistake was obviously terrible, but Ancelotti should be concerned about how much the defence struggled in general. Real Sociedad’s poor decision-making and poor precision in the final third let Real Madrid off the hook at points, especially in the first half. The Basque side were able to get their creative players into dangerous positions for cutbacks, only to time and time again mess up the final pass. Against Manchester City, who also love to get to the byline inside the area, Real Madrid would surely be more severely punished. The defence needs to sharpen up, and quickly.",
  "word_count": 857,
  "scraped_at": "2026-02-14T01:48:17.256508",
  "_text_extracted": true
}