{
  "article_id": "7e36d6984034",
  "url": "https://theathletic.com/4444647/2023/04/25/conor-bradley-liverpool-future/",
  "title": "Liverpool prospect Conor Bradley has a bright future – but is it at Anfield ? ",
  "date": "20230425T050000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Not every Liverpool player will end the season without having tasted the joy of lifting a trophy.\nConor Bradley, on loan at Bolton Wanderers, already has one honour to his name after helping the club collect the EFL Trophy at Wembley earlier this month. The 19-year-old, who was a standout performer in the 4-0 win over Plymouth Argyle, will also be dreaming of adding a League One play-off winners’ medal. Bolton are fifth with three matches left to play (starting with tonight’s game against Accrington Stanley) and have played one game less than Derby County in sixth and Peterborough in seventh.\nAdvertisement\nEven if they fall short and fail to earn promotion back to the Championship, Bradley’s time at Bolton will be looked back on with fondness by all concerned. The club have benefited from Bradley’s vibrant performances – coaching staff have praised his aggression and his understanding of how and when to press – while the player has gained invaluable experience at the sharp end of a brutally competitive league.\nThe question now is what happens next? The Northern Ireland international, who has been capped 12 times, is highly thought of at Bolton. The Greater Manchester club’s head coach, Ian Evatt, confirmed in January that he would be keen to take Bradley back next season, but in the short term, the player’s focus is closer to home.\nLiverpool have remained in constant contact with Bradley, just as they do with all their loanees – partly through a WhatsApp group set up by Jurgen Klopp’s assistant Pep Ljinders.\n“We are watching really closely what Conor is doing and it is great, obviously,” Klopp said on Tuesday. “I am not sure if he will become Player of the Season there (at Bolton) but for sure he is a contender for that, which is great.\n“We knew what we had in our hands when he was there, but for young boys there must be an opportunity to make the next step with playing and that was now a typical win-win situation: it was good for us, good for him and good for the club and I liked it a lot.\n“Everybody speaks positively about him. I think one-and-a-half years ago only a few football nerds would have known about him and now everybody knows him. That’s cool and that’s the first step.\n“Our plans are bring him back, go in the pre-season and enjoy the steps he’s made, then we will decide together what we are doing from that moment on. Conor will be our player, but we have to see if it makes more sense for him going on loan after pre-season or not.”\nAdvertisement\nHe will not be short of options. There is the possibility of another loan move, perhaps to a team in the Championship given how well he has taken to League One. Preston North End were reported to be one of several second-tier clubs keen on taking him for the second half of this season, but while Liverpool did have the option of recalling him, they decided his progress was better served staying at Bolton.\nDepending on how pre-season works out, however, Liverpool, who are unlikely to sign another right-back this summer, could look to begin the 2023-24 season with Bradley as one backup option to the rejuvenated Trent Alexander-Arnold.\nRight-back is an increasingly crowded field for Liverpool, with Joe Gomez and Calvin Ramsay – who arrived from Aberdeen last summer but whose season ended prematurely after he underwent knee surgery in February – already providing competition.\nAnother option for Bradley is to leave permanently. This is a road Neco Williams took last summer when he moved to Nottingham Forest and, as the Wales defender highlighted with his goal and performance at Anfield on Saturday, it can work out well.\nBradley will turn 20 in July and there is no rush for him to make a decision having signed a long-term deal in 2021. But after a season of studious and energised performances at full-back, he will not be short of suitors.\nIn truth, scouts have been keeping tabs on his progress for much of his career. Manchester City, Manchester United and Chelsea, as well as Liverpool, tracked Bradley – who juggled soccer with Gaelic football and cross-country running – during his youth days at Maiden City and Dungannon Swifts.\nIt was with St Patrick’s Football Club in his native Castlederg in County Tyrone, however, that Bradley got his big break. In 2011, the under-11s were playing in a tournament 45 minutes down the road in Enniskillen. With a few players unwell, Rory Lynch, the team’s coach, was left scrambling for players.\nAdvertisement\n“Bring Conor,” heckled Bradley’s cousin, Shay Gallagher. Lynch was initially reluctant. Bradley had not even turned nine and some of the players at the tournament were going to be almost three years his senior.\nLynch eventually yielded to Gallagher’s advocating for his younger cousin. After a call with Bradley’s mother, Linda, the team picked him up on the way.\nBradley was the only substitute and might not have played had a team-mate not got injured two minutes into their first game.\n“Don’t take people on, don’t go into challenges. I don’t want you getting hurt,” Lynch warned as he trotted on.\nBradley did not listen. The first thing he did was go racing into a challenge and from that moment there was no stopping him. He scored more goals than anyone else and was named player of the tournament. Lynch was astonished.\nSpeaking to The Athletic in 2021, Lynch ascribed the club’s trophy successes thereafter in part down to Bradley’s surprise arrival. St Patrick’s had failed to claim a trophy since 1997 but suddenly started winning everything, with Bradley a key figure.\nHe would stay with St Patrick’s until he was 14. Then came moves to Maiden City and then Dungannon Swifts before he relocated to Liverpool to play at the club’s academy, having previously spent several years at the club’s development centre in Belfast.\nGO DEEPER\nLiverpool's loan army: How are they doing - and what future do they have?\nHis parents, Linda and Joe, would make the five-hour round trip every week so their son could train under the careful watch of Cliff Ferguson and Stefan Seaton. He is the centre’s success story, having signed his first professional deal with Liverpool in 2020.\nAnd he has not forgotten his roots. After being part of Liverpool’s squad last season as they won the Carabao Cup and FA Cup and finished as runners-up in the Premier League and Champions League, Bradley was asked by Ferguson and Seaton to send a short video to the boys training at the centre.\nAdvertisement\nHe obliged, much to their delight. Those Belfast youngsters were duly shown a video message in which Bradley showed off his medals. He now has one more to display in the form of the EFL Trophy.\nAs for his future, Bradley, a boyhood Liverpool fan with five senior appearances to his name, will be hoping it belongs there. If it does, then he will doubtless assess his future with his parents. It is their dedication and sacrifices, along with their son’s, that are pointing to a long, successful career in the game no matter which team Bradley represents.\n(Top photo: Jake Kirkman – CameraSport/Getty Images)",
  "word_count": 1221,
  "scraped_at": "2026-02-14T01:50:29.471582",
  "_text_extracted": true
}