{
  "article_id": "7e3c2db9af9c",
  "url": "https://punchng.com/osimhen-sets-turkish-transfer-record-e70m-above-second/",
  "title": "Osimhen sets Turkish transfer record , €70m above second – Punch Newspapers",
  "date": "20250218T054500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "United, Napoli close to agreement for Nigerian striker\nSuper Eagles striker Victor Osimhen has emerged as the most valuable player to ever join the Turkish Super Lig, with his market value of €100m putting him €70m ahead of second-placed Nicolò Zaniolo, PUNCH Sports Extra reports.\nThe Nigeria international, who joined Galatasaray on a season-long loan from Napoli last summer after proposed moves to Chelsea and Saudi Arabia fell through, has continued to justify his hefty valuation with 19 goals in 24 appearances across all competitions for the Turkish giants.\nAccording to data from Transfermarkt, Osimhen’s €100m valuation dwarfs that of Zaniolo, valued at €30m when he moved from Roma to Galatasaray in February 2023.\nThe 2023 CAF African Player of The Year leads an illustrious list that includes Zaniolo (€30m), Jean Michael Seri (€25m), Steven Nzonzi (€23m), Tanguy Ndombele (€22m), Sofyan Amrabat (€22m), Mauro Icardi (€22m), Wilfried Zaha (€22m) and former Manchester United midfielder Fred (€20m).\nMeanwhile, the Nigerian striker could be set for another big move this summer, with Manchester United and Paris Saint-Germain both tabling verbal offers for his services.\nTurkish journalist Yagiz Sabuncuoglu revealed that both European giants have reached an agreement with Napoli to trigger the striker’s €75m release clause, which becomes active when the summer transfer window opens.\n“Victor Osimhen is about to sign a deal with a world-renowned management company. In fact, a Real Madrid player is helping facilitate these discussions. This significantly reduces the chances of him staying at Galatasaray beyond June. Both PSG and Manchester United have made verbal offers regarding salary and contract length,” Sabuncuoglu told Haber Sari Kirmizi.\n“Since both clubs are willing to meet Napoli’s release clause, it will be incredibly difficult for Galatasaray to compete. A summer move looks almost certain.”\nThe development comes as Manchester United manager Ruben Amorim reportedly identified the Nigerian as his primary target to solve the Red Devils’ striking woes, with current forwards Rasmus Hojlund and Joshua Zirkzee struggling to adapt to the physicality of the English Premier League.\nUnited’s football department, led by Jason Wilcox, is exploring various options, including a potential player-exchange arrangement, though Napoli’s preference remains a straight cash deal.\nOsimhen’s journey to becoming Turkey’s most valuable import began after a failed permanent transfer last summer when his €130m release clause proved too steep for potential suitors including EPL giants Chelsea and Saudi clubs.\nThe subsequent loan move to Galatasaray raised eyebrows across Europe, but the 25-year-old has vindicated the Turkish giants’ faith with stellar performances.\nHis impact has been immediate and decisive. He played a pivotal role in firing Galatasaray to the top of the Super Lig while also helping the club progress to the knockout stages of the UEFA Europa League where they now have a big mountain to climb after a 4-1 first-leg loss to AZ Alkmaar during Osimhen’s absence.\nThe striker’s success in Turkey adds another chapter to his remarkable rise in European football, having previously led Napoli to their first Serie A title in 33 years during the 2022/23 season.\nThat campaign saw him score 26 league goals to claim the Capocannoniere as Serie A’s top scorer, becoming the first African to achieve this feat.\nGalatasaray’s dominance of the Turkish transfer market is evident in the data, with eight of their deals featuring in the top 10 most valuable transfers to the Super Lig. Only Fenerbahce, with Fred and Amrabat, managed to break the Istanbul giants’ monopoly on big-money moves.\nThe only player in the top 15 from outside of Galatasaray and Fenerbahce is Miralem Pjanic, who joined Besiktas from Barcelona in 2021.\nPSG’s interest in Osimhen stems from their need to replace Randal Kolo Muani, who was loaned to Juventus. Despite flying high in Ligue 1 without a natural striker, the French champions view the Nigerian as an ideal addition to their attacking arsenal.\nIn January, Galatasaray attempted to secure a permanent deal with a €65m bid to Napoli, the Serie A club declined, holding firm on the €75m release clause that becomes active this summer.\nThe Super Eagles striker’s next move could prove crucial for his career trajectory, with both United and PSG offering different sporting projects. While PSG can guarantee Champions League football and likely domestic success, the allure of leading United’s revival under Amorim might prove equally tempting.\nOsimhen’s form hasn’t wavered amid the transfer speculation, maintaining the same ruthless efficiency that saw him ranked eighth in the 2023 Ballon d’Or voting. His combination of physical presence, relentless pressing, and excellent speed continues to make him one of Europe’s most sought-after strikers.\nAs the summer transfer window approaches, all eyes will be on the Nigerian’s next destination, but for now, he remains focused on helping Galatasaray maintain their impressive form in both domestic and European competitions.",
  "word_count": 795,
  "scraped_at": "2026-02-14T01:58:05.346308",
  "_text_extracted": true
}