{
  "article_id": "7e5796e6bfea",
  "url": "https://www.webwire.com/ViewPressRel.asp?aId=310922",
  "title": "Thursday Night Football on Prime Video Returns for Season Two of Exclusive Coverage , With New Enhancements and Innovations to Bring Fans Closer to the Action Than Ever Before",
  "date": "20230913T033000Z",
  "domain": "webwire.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Thursday Night Football on Prime Video Returns for Season Two of Exclusive Coverage, With New Enhancements and Innovations to Bring Fans Closer to the Action Than Ever Before\nNew-for-2023 features include native HDR picture quality, Key Plays, and the first NFL Black Friday game on November 24\nPrime Vision with Next Gen Stats alternate stream introduces new AI-powered features built in conjunction with AWS: Defensive Alerts, Prime Targets, 4th Down Decision Guides, and more\nStrong season schedule kicks off September 14, when the defending NFC Champion Philadelphia Eagles host the NFC North Champion Minnesota Vikings\nVIDEO: For a behind-the-scenes look at TNFs 2023 tech differentiators, click HERE\nPrime Videos Emmy-winning Thursday Night Football (TNF) coverage returns on Thursday, September 14 at 7 p.m. EDT, as the NFC Champion Philadelphia Eagles stage their home opener against the NFC North Champion Minnesota Vikings. The playoff-caliber matchup leads off a star-studded 16-game regular-season schedule featuring all 14 playoff teams, and the first NFL Black Friday Game on November 24.\nUnlike previous seasons, the 2023 TNF schedule features teams that make multiple appearances on Prime Video, including Aaron Rodgers and the New York Jets, who host the Dolphins on Black Friday and then face the Browns in the TNF season finale on December 28, and the Pittsburgh Steelers, who host the Titans on November 2 and the Patriots on December 7. Other cant-miss matchups throughout the strong schedule of games include the Giants vs. the 49ers on September 21; the Broncos vs. the Super Bowl champion Chiefs on October 12; the Bengals vs. the Ravens on November 16; and the Seahawks vs. the Cowboys on November 30.\nThe TNF production and engineering teams are rolling out a number of new enhancements and innovations throughout the second season of exclusive coverage, aimed at bringing fans closer to the action and deepening the viewing experience.\nEmmy-Winning Production Team\nFollowing a historic inaugural season that delivered the most streamed NFL games in history, Prime Video returns with a best-in-class production, featuring an all-star cast of legendary voices and fresh-off-the-field perspectives. TNFs next-generation production fleet of eight mobile units is anchored by Prime One, the command center that produces each game in native High Dynamic Range (HDR) video and Dolby surround sound audio. The robust TNF arsenal of equipment features 50+ cameras and aerial technology covering every inch of the field and angle of action, giving every TNF game a big-game, prime-time feel. It all kicks off each week with TNF Tonight at 7 p.m. EDT.\nPreeminent play-by-play announcer Al Michaels and multi-Emmy-winning analyst Kirk Herbstreit call the main broadcast each week, with sideline reports from Kaylee Hartung. TNF host Charissa Thompson, along with analysts and former NFL stars Tony Gonzalez, Ryan Fitzpatrick, Andrew Whitworth and Richard Sherman, comprise TNFs pregame, halftime, and postgame coverage. Rising star Taylor Rooks delivers weekly features, and distinguished journalist Michael Smith provides analysis of the games biggest stories. Marshawn Lynch also returns, with his wildly entertaining N Yo City features set to run throughout the season during TNFs coverage.\nAdditionally, TNF is introducing and upgrading several enhancements designed to evolve the enjoyment of live sports beyond a one-way linear relationship and into a connected and customized online experience:\n- Native High Dynamic Range (HDR) productions\n- Prime Video will produce and deliver TNF in native High Dynamic Range (HDR) for the first time, upgrading the viewing experience for fans with greater contrast between light and dark, and more vivid colors. Prime Videos ability to capture and distribute native HDR pictures is made possible by its arsenal of next-generation production equipment, unparalleled livestreaming technology, and a direct-to-consumer delivery that is not constrained by legacy systems present in traditional broadcasting.\n- Tested and Proven Livestreaming Technology\n- A combination of Prime Video and AWS technology manifest in a proprietary, end-to-end livestreaming solution that delivers ultra-low latency, eliminates drift, ensures synchronization, and delivers streams with unparalleled quality from the stadium to the screen in 10 seconds or less. This delivery speed matchesand often surpasseswhat fans receive from traditional cable and broadcast networks.\n- Key Plays\n- Key Plays is a new feature that leverages artificial intelligence (AI) and machine learning to provide fans with an ability to view in-game highlights and key moments on demand while watching TNF on Prime Video. A bank of pivotal moments builds as the game progresses and offers viewers immediate access to a full rundown of the action.\n- Rapid Recap\n- Rapid Recap assists those who join the game in-progress and want to catch up on the action they missed before entering the livestream. Accessible after selecting Watch, Rapid Recap employs AI and machine learning to compile up to 13 highlights, with the full recap lasting no longer than two minutes. While viewing the rundown, viewers have the ability to either skip or rewatch big plays within the queue and jump to live action at any time.\n- X-Ray\n- X-Ray is an exclusive Prime Video feature that provides layers of information, allows viewers to track advanced Next Gen Stats powered by AWS, watch on-demand replays enhanced with player performance metrics, get team and player info, shop official NFL merch, and even predict the outcome of the game with Fan Polls.\nPrime Vision with Next Gen Stats\nThe weekly TNF alternate stream, Prime Vision with Next Gen Stats, returns for all 16 regular-season matchups on Prime Video. Prime Vision with Next Gen Stats presents fans with an unprecedented opportunity to deepen their viewing experience of live NFL action. Through a combination of on-screen graphic overlays, AI-driven insights, Next Gen Stats powered by AWS, and distinctive vantage points from our All-22 camera angle, Prime Vision is the most innovative NFL broadcast available. This weekly alternate stream will deliver pre-snap player ID tags, receiver route trees, identify open receivers and potential blitzers, and engage player-tracking data to display outstanding feats in ball-carrier speed, yards after catch, closing speed, and time to throwall in real-time!\nNew-for-2023 Prime Vision additions employ machine learning and custom logic to identify pivotal situations, allowing fans to place themselves in the coachs shoes and read developing plays like a quarterback. Al Michaels and Kirk Herbstreit provide commentary, with reports from Kaylee Hartung and TNF analytics expert Sam Schwartzstein.\nSome highlights that will debut on the Prime Vision with Next Gen Stats stream throughout the 2023 season include:\n- Defensive Alerts\n- Developed through a unique offseason collaboration between TNF producers, engineers, and Prime Videos computer vision machine learning team, Defensive Alerts is an AI-powered feature driven by a neural network that gets stronger as more and more plays unfold. It tracks the movements of defensive players before the snap and identifies players of interest in real-time that are probable to rush the quarterback. When a probable blitzer is identified, a highlighted orb appears under them to give viewers a heads up.\n- Prime Targets\n- Prime Targets is an enhanced version of last seasons Open Receiver feature that identifies receivers that are open and likely to convert a first down. Through RFID chips in the players shoulder pads, Prime Targets tracks and highlights open receivers in real-time with a green orb when they meet qualifying logic.\n- 4th Down Decision Guide\n- Utilizing Next Gen Stats 4th Down Decision Guide and machine learning, Prime Video will help fans understand how fourth-down decisions are made by coaches in real-time. In pivotal third-down down situations, Prime Vision will overlay a line on the field that indicates where the offense needs to advance the ball in order to receive a strong go for it recommendation on fourth down.\n- Field Goal Target Zones\n- In order to provide more context surrounding drives where a field goal has added importance, such as at the end of a game or half, the Prime Vision with Next Gen Stats Field Goal Target Zones overlay multiple lines on the field that deliver the statistical likelihoods that a kicker will make a field goal.\nBlack Friday Football\nPrime Video and the NFL are coming together to create a new sports holiday tradition on the national sports calendar. In the first-ever NFL Black Friday game on November 24, fans will be treated to a classic AFC East showdown between the new-look New York Jets, featuring four-time NFL MVP Aaron Rodgers, and their longtime division rivals, the high-powered Miami Dolphins. An extended Black Friday Football pregame show will originate live and on-site at 1:30pm ET from MetLife Stadium in East Rutherford, NJ, with kickoff expected at 3:00 p.m. EST. As previously announced, Prime Video will kick off the 2023 holiday season with an early present for NFL fans, providing free access to this unprecedented NFL eventeven to those without a Prime membership.\nAdditional details surrounding unique integrations for Amazon, including food, retail, and music, will be announced later in the season.\nHow to Watch\nViewers in the U.S. can watch TNF games on Prime Video in 2023 in their living rooms or on the go via connected televisions, streaming media players, mobile devices or set-top boxes by using the Prime Video app. In addition, viewers can stream online on Amazon, and on phones and tablets with NFL+. Each TNF game also streams live on Twitch and is available on over-the-air TV stations in the two home markets of the competing teams, as well as in Spanish language on Prime Video.\nFor all the latest information regarding TNF on Prime Video, visit the Thursday Night Football page on Prime Video and follow NFL on Prime on Twitter. If youre not a Prime member yet, join today or start a free 30-day trial to catch all the action in the upcoming season.\nComplete 2023 Thursday Night Football Schedule:\nTNF Tonight pregame coverage begins each Thursday at 7 p.m. EDT\nWeek 2 - Sept. 14: Minnesota Vikings at Philadelphia Eagles\nWeek 3 - Sept. 21: New York Giants at San Francisco 49ers\nWeek 4 - Sept. 28: Detroit Lions at Green Bay Packers\nWeek 5 - Oct. 5: Chicago Bears at Washington Commanders\nWeek 6 - Oct. 12: Denver Broncos at Kansas City Chiefs\nWeek 7 - Oct. 19: Jacksonville Jaguars at New Orleans Saints\nWeek 8 - Oct. 26: Tampa Bay Buccaneers at Buffalo Bills\nWeek 9 - Nov. 2: Tennessee Titans at Pittsburgh Steelers\nWeek 10 - Nov. 9: Carolina Panthers at Chicago Bears\nWeek 11 - Nov. 16: Cincinnati Bengals at Baltimore Ravens\nWeek 12 (Black Friday) - Friday, Nov. 24: Miami Dolphins at New York Jets (3:00 PM ET)\nWeek 13 - Nov. 30: Seattle Seahawks at Dallas Cowboys\nWeek 14 - Dec. 7: New England Patriots at Pittsburgh Steelers\nWeek 15 - Dec. 14: Los Angeles Chargers at Las Vegas Raiders\nWeek 16 - Dec. 21: New Orleans Saints at Los Angeles Rams\nWeek 17 - Dec. 28: New York Jets at Cleveland Browns\nAbout Prime Video Sports\nPrime Video supports a growing lineup of live sports globally, including Thursday Night Football, the WNBA, the Seattle Storm, the New York Yankees, and Overtime Elite in the United States; ONE Championship in the United States and Canada; Premier League in the United Kingdom; ATP and WTA tennis in the United Kingdom and Ireland; UEFA Champions League football in Germany and Italy; Roland-Garros and Ligue 1 in France; Australian Swimming globally; New Zealand Cricket in India; as well as Copa do Brasil football and the NBA in Brazil; and boxing and the 2023 World Baseball Classic in Japan. While availability varies by marketplace, fans can also subscribe to streaming services such as Eurosport, FOX Sports (Mexico), Viaplay Sport, MLB.TV, NBA League Pass, NBA TV, DAZN (Germany and Spain), and Premiere FC (Brazil) through Prime Video Channels. This is in addition to a selection of Amazon Original documentaries including Good Rivals, Coach Prime, Reggie, Redefined: J.R. Smith, and the Amazon Original All or Nothing franchise, including All or Nothing: Arsenal, All or Nothing: Juventus, All or Nothing: Toronto Maple Leafs, and All or Nothing seasons with various NFL teams, as well as the NCAAs Michigan Wolverines football team.\n( Press Release Image: https://photos.webwire.com/prmedia/8/310922/310922-1.png )\nWebWireID310922\nThis news content was configured by WebWire editorial staff. Linking is permitted.\nNews Release Distribution and Press Release Distribution Services Provided by WebWire.",
  "word_count": 2040,
  "scraped_at": "2026-02-14T02:04:03.931471",
  "_text_extracted": true
}