{
  "article_id": "7ebca7534042",
  "url": "https://www.con-telegraph.ie/2026/01/06/liam-roseniors-record-of-developing-youngsters-was-key-to-chelsea-appointment/",
  "title": "Liam Rosenior record of developing youngsters was key to Chelsea appointment",
  "date": "20260106T233000Z",
  "domain": "con-telegraph.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liam Rosenior’s record of developing youngsters was key to Chelsea appointment\nBy Robert O'Connor, Press Association\nLeadership, personality and a record of improving young players were amongst the deciding factors in persuading Chelsea to appoint new head coach Liam Rosenior, the Press Association understands.\nThe 41-year-old was unveiled on Tuesday as the successor to Enzo Maresca after signing a deal until 2032 to become the fourth permanent boss of the BlueCo ownership era.\nA former Hull and Derby manager, he moves to Stamford Bridge from Chelsea’s sister club Strasbourg where his record in working with the youngest squad in Europe’s top five leagues sufficiently impressed the owners and sporting directors to elevate him to the Stamford Bridge job.\nUnder BlueCo, the club have pursued a policy of signing young, inexperienced but promising players in the hope of seeing them mature and their value increase. It is with Rosenior’s ability to work within this model in mind that the appointment has been made.\nLast season he led Strasbourg to a seventh-place finish in Ligue 1, just the second time since 1981 they had finished that high, despite an average starting lineup age of 21.7 years.\nUnder Rosenior the team became known for playing possession-based football with defensive stability, and it is understood that his success in building a team capable of controlling games appealed strongly to the Chelsea hierarchy.\nThe club wanted to appoint a coach whose philosophy was a fit with the squad already assembled and with future recruitment plans, something they believe they have found in Rosenior.\nIn a statement he said: “I am extremely humbled and honoured to be appointed head coach of Chelsea Football Club.\n“This is a club with a unique spirit and a proud history of winning trophies.\n“My job is to protect that identity and create a team that reflects these values in every game we play as we continue winning trophies.\n“To be entrusted with this role means the world to me and I want to thank all involved for the opportunity and faith in undertaking this job.”\nPA also understands that a successful pre-existing relationship with the club’s leadership team, helmed by co-sporting directors Paul Winstanley and Laurence Stewart, was a key factor in choosing Rosenior to replace Maresca.\nThe Italian departed on Thursday after 18 months following a deterioration in his relationship with his bosses, a significant cause of which was his willingness to go against the advice of club medical staff in rushing players back from injury.\nRosenior will be expected to heed the input from medics, something Chelsea are satisfied their new head coach is ready to work collaboratively on.\nWriting on his Instagram account on Tuesday, Maresca – who led the team back into the Champions League as well as winning the Conference League and Club World Cup, said: “I leave with the inner peace of leaving a prestigious club like Chelsea where it deserves to be.\n“I want to thank all the Chelsea fans for their support over the last 18 months. Support that was crucial to achieving Champions League qualification, winning the Conference League, and winning the Club World Cup. Victories that I will always hold in my heart.\n“A special thank you to all the players who have accompanied me on this wonderful journey.\n“I wish everyone who has shared every moment with me every success in this second half of the season and in the future.”\nRosenior will watch Wednesday’s west London derby away to Fulham from the stands at Craven Cottage, with under-21 coach Calum McFarlane continuing to lead the team, before taking his first training session on Thursday.\nHis first match in charge will come on Saturday in the FA Cup third round at Charlton.\nRosenior has his work cut out to restore harmony between Chelsea and its supporters.\nThere has been dissatisfaction with the way BlueCo has run the club during its three and a half years of ownership, as reflected in the results published on Tuesday of a poll conducted by the Chelsea Supporters’ Trust that revealed only 1.3 per cent of fans believe the club is being run in a way that will produce sustained on-field success during the next three to five years.\nStrasbourg are reportedly set to hire former Bournemouth and Wolves boss Gary O’Neil as Rosenior’s replacement.\nAway from football, Rosenior was convicted on Tuesday of a speeding offence after fog left him stranded in Strasbourg and unable to attend a speed awareness course.\nHe was caught doing 36mph in a 30mph zone in Derbyshire on July 7th and has been made to pay £1,052 (€1,215) in fines, costs, and court fees.",
  "word_count": 776,
  "scraped_at": "2026-02-14T02:27:10.767459",
  "_text_extracted": true
}