{
  "article_id": "7ec28f5ab9bf",
  "url": "https://www.irishecho.com/2024/6/o-brien-passes-up-double-bid",
  "title": "OBrien passes up double bid",
  "date": "20240627T231500Z",
  "domain": "irishecho.com",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Nineteen horses have completed the English-Irish Derby double, the most recent was Auguste Rodin for trainer Aidan O’Brien last year. O’Brien, who is likely to saddle a few runners in the big race at the Curragh on Sunday could win the Irish Derby for the 16th time, but it will not be with Epsom Derby winner City of Troy. The Ballydoyle trainer said recently that City of Troy will not be following in the footsteps of stablemate Auguste Rodin and will instead head to Sandown on July 6 for the Eclipse Stakes. O’Brien said that the colt’s Coolmore Stud owners have opted to target the 10-furlong task against older horses rather than try to become the 20th horse to complete the Epsom-Curragh Derby double.\nO’Brien said: “He has plenty of pace so the drop back to a mile and a quarter won’t be a problem for him. We are all looking forward to seeing what he can do at Sandown.’’ However, the three horses who followed City of Troy home at Epsom, Ambiente Friendly, Los Angeles and Deira Mile, are all likely to contest the Curragh’s €1.25 million showpiece of the season.\nOf O’Brien’s nine previous Epsom winners, only the surprise 2020 victor Serpentine didn’t line up in the Irish Derby and that was due to the Curragh race being staged first in a Covid-pandemic disrupted year. O’Brien saddled his 400th career Group One winner courtesy of Auguste Rodin in the Prince of Wales’s Stakes at Ascot last week.\nThe Irish Derby became a major international race in 1962, when its prize money was substantially increased. Joe McGrath, a founder of the Irish Hospitals Sweepstake, combined the race with the sweepstake, and it became known as the Irish Sweeps Derby. The event began to regularly attract the winners of the Epsom Derby, and Santa Claus became the second horse to win both races in 1964. The Derby got a major boost when Budweiser came in as sponsors in 1986 and the American company stayed until 2007. Sponsorship is so important for racing and the current sponsors at what is now a completely revamped Curragh track are Dubai Duty Free.\nMeanwhile we should know this week if Henry Shefflin is going to continue as Galway senior hurling manager. There have been conflicting claims from inside the county about the Kilkenny legend remaining at the helm for a fourth season in 2025. Board sources maintain Shefflin has made no decision regarding his future, but there is growing speculation that the home defeat to Dublin in the Leinster championship at the end of May was Shefflin’s last game in charge. The former Kilkenny player was appointed manager in October 2021 for three years and the term was extended by a season last August into 2025. If Shefflin moves on former Galway star Joe Canning, who has worked as a selector with the Galway minor and under 20 teams, says he is interested.\nGIBSON-PARK\nTO MISS TOUR\nIreland have been dealt a major blow ahead of their summer tour to South Africa, as Jamison Gibson-Park has been ruled out through injury. The scrum-half was forced off during Leinster’s defeat to the Bulls last two weeks ago, and he will not recover in time to be part of the 35-man squad that will take on the Springboks in two Tests. Ireland head coach Andy Farrell has named three uncapped players in the traveling party, as Leinster backs Jamie Osborne and Sam Prendergast get the nod, along with Ulster's versatile back-row Cormac Izuchukwu. Leinster No, 8 Jack Conan misses out due to personal reasons, while Connacht winger Mack Hansen remains sidelined due to a shoulder injury. There is no place in the squad for either Byrne brother, as Ross and Harry both miss out in favor of their Leinster team-mate Ciarán Frawley. Peter O’Mahony retains the captaincy on the back of leading Ireland to the Six Nations title earlier this year. Ireland play South Africa the Loftus Versfield Stadium in Pretoria on July 6 and in the second test will be played in the Hollywoodbets Kings Park Stadium, Durban on July 13.\nKEENAN FOR PARIS\nIrish full back Hugh Keenan has been named in the Irish men’s Sevens squad for this summer’s Paris Olympics. Keenan will join French superstar Antoine Dupont as one of the most recognizable names from the XV’s team to be part of the July tournament. Former Meath Ladies footballer Vicki Wall, who quit Aussie Rules football last year to concentrate on Sevens Rugby, has not made the Irish women’s Sevens team, which will be captained by Lucy Rock. The men’s competition will run from July 24-27 and the women’s tournament from July 28-30.\nROVERS FACE\nFAMILIAR FOES\nShamrock Rovers have been paired with Vikingur Reykjavík from Iceland in the first round of qualifying for the Champions League.\nIt is the second year in a row the Hoops have been drawn to face the champions of Iceland. They were beaten last season by Breidablik in a disappointing European campaign. Progressing to the second round would guarantee a third-round Europa League qualifying tie as well as a play-off for the Conference League. The loser of the first round Champions League encounter will drop to the second round of the Conference. Rovers will be away to Vikingur on July 9 or 10 with the second leg at Tallaght Stadium on July 16 or 17. That Tallaght date is the reason why the Irish Women’s Euro qualifier against France will be played in Cork on July 16. The winners will play Sparta Prague in the second round.\nCHAMPS HONORED\nWITH POSTMARK\nIreland’s seven medal-winning athletics champions at the recent European Championships in Rome are to be honored by An Post. Christopher O’Donnell, Rhasidat Adeleke, Sophie Becker, Phil Healy, Sharlene Mawdsley, Tom Barr and Ciara Mageean are to feature on a specially-designed national postmark. An Post chief executive, David McRedmond says he hopes it will carry Ireland’s admiration and pride of our superstar athletes who inspired and delighted the nation. The postmark will be applied to millions of regular-sized letters and cards posted over the coming months.\nRYAN EXITS KILDARE\nKildare are searching for a new senior football manager following the resignation of Glenn Ryan. As a player Ryan was a great servant and captained the Lilywhites in their last All-Ireland final appearance in 1998, when they lost to Galway. His first inter-county managerial job was with Longford where he stayed for five years and then took charge of his home county in October 2021. Ryan took Kildare to the Leinster final in 2022, but last year they were relegated from Division One and earlier this year the Lilywhites dropped to Division 3. Two weeks back they were knocked out of the second tier Tailteann Cup by Laois at the quarter-final stage.\nMeanwhile Colm O’Rourke, who was appointed manager of the Royals in July 2002, says he is looking for another three-year term. Under his management Meath won the Tailteann Cup last year, but failed to make an impression in the Leinster Championship this year. After beating Longford in the first round they were well beaten by Dublin in the quarter-finals and then lost all three games in the Sam Maguire Round Robin, to Louth, Kerry and Monaghan.",
  "word_count": 1211,
  "scraped_at": "2026-02-14T02:01:16.433839",
  "_text_extracted": true
}