{
  "article_id": "7ec4af891460",
  "url": "https://www.themag.co.uk/2024/07/maybe-you-shouldnt-be-a-newcastle-united-fan-if-you-cant-handle-this/",
  "title": "Maybe you shouldnt be a Newcastle United fan if you cant handle this",
  "date": "20240717T094500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Maybe you shouldn’t be a Newcastle United fan if you can’t handle this\nLike every other Newcastle United fan, I can’t wait for the return of proper football.\nJust over four weeks time we will see competitive football again at St James’ Park.\nA handful of pre-season friendlies in the meantime, then Southampton a 3pm kick-off on Saturday 17 August.\nAs I say, it can’t come around too soon.\nFor a number of reasons.\nFirstly, of course, wanting to be back in the routine of watching my team play week in week out.\nSecondly though, as a Newcastle United fan, I hope this calms down a sizeable number of my fellow NUFC supporters.\nHonestly, this summer has been woeful in terms of how some Newcastle fans have gone on. It feels like a big minority of them live in constant fear and expectation that everything is going to go wrong.\nWell, maybe you shouldn’t be a Newcastle United fan if you can’t handle this.\nYou need to get used to the fact that other clubs will always dream of luring the likes of Bruno Guimaraes, Anthony Gordon, Alexander Isak, Joelinton, and others, away from St James’ Park.\nThe same with Eddie Howe, whether it is England or any number of club teams, they would love to have him as their manager.\nDo you honestly think that Man U wouldn’t have loved to take Eddie Howe as well as Dan Ashworth, rather than giving Erik ten Hag an eventual contract extension after hilariously Thomas Tuchel and a number of other candidates turned Man U down?\nThe same at Chelsea, desperately looking around for somebody to take the job (yet again!!!) and ending up having to take somebody whose entire management experience is a handful of games in the Italian second tier before getting the sack, then getting Leicester promoted, a club who had easily the best and most expensive squad of players.\nFor a decade and a half, Newcastle United fans didn’t need to worry about losing players and/or managers.\nIt was simply a case of knowing for sure that Mike Ashley would sell any player who there was a decent bid for, whilst if he accidentally appointed a decent manager (Chris Hughton), or was forced to (Rafa Benitz), then you also knew for sure that Ashley would be getting rid of them ASAP after they had done the job he’d needed them to do (recover from the latest relegation) because they weren’t the kind of puppets he wanted to have ‘in charge’ of things. The same of course with Kevin Keegan, under pressure Mike Ashley made a great choice to appease fans BUT at the same time secretly undermined KK from the start by giving Dennis Wise all the power on transfers in and out, ensuring Keegan would be forced out ASAP.\nHonestly, which credible Premier League club or national side was ever going to try and take Steve Bruce from Newcastle United??? The same with Joe Kinnear, John Carver, and Steve McClaren.\nAs for the fact that Alan Pardew thought that a club such as Crystal Palace was a better bet for success, just shows how far Mike Ashley had dragged us down.\nSo as a Newcastle United fan, just get used to the fact that we have a great manager and loads of excellent players that other clubs (and England in Howe’s case…) will want.\nIndeed, follow my example and revel in it.\nGrow to love the fact that as a Newcastle United fan, (pretty much) everyone now wants what we have got.\nAfter all those Ashley years I know it is something that is difficult to get used to as a Newcastle United fan, as is the fact that we now have club owners and management that will do everything they can to keep the top quality at Newcastle United AND look to add more of it.\nNewcastle United is now a club run properly and one that is trying to be the best it can be, on and off the pitch.\nI know this is a revolutionary idea after all those wasted years but get used to it and simply grow to embrace it, with part of that for sure, being that others will want to take things from you.\nThe Newcastle United owners are very ambitious and look to employ the best possible staff on both the football and business side of things.\nThat is why in these past 33 months, the Newcastle United owners have offered the job to two people, Unai Emery and Eddie Howe. That sums up the excellent judgement at play now, Emery was forced to turn the job down at that moment in time, as he’d just won Villarreal the first-ever trophy in their history and they were in the middle of their first-ever Champions League campaign. However, he has now shown at Aston Villa just what a quality manager he is, just like Eddie Howe.\nAmazing that then when club owners employ the best possible football people AND back their judgement on players, you then get the likes of Trippier, Burn, Pope, Botman, Bruno, Gordon, Barnes, Tonali, Isak, and others signed up.\nBayern Munich wanted Trippier, Manchester City/PSG want Bruno Guimaraes, Liverpool want Anthony Gordon, Arsenal want Alexander Isak.\nThis is the new reality.\nOthers want Eddie Howe, Anthony Gordon, Bruno Guimaraes and Alexander Isak BUT they are all still at Newcastle United and preparing for the new season in 31 days time. All of them wanting to show just what could/would have happened last season if not for Tonali’s suspension and the worst-ever injury-hit year in Newcastle United history, unprecedented.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 956,
  "scraped_at": "2026-02-14T02:01:23.791487",
  "_text_extracted": true
}