{
  "article_id": "7ecd66c0c151",
  "url": "https://www.90min.com/posts/premier-league-fixtures-today-your-guide-to-saturday-games-25-2-2023",
  "title": "Premier League fixtures today - your guide to Saturday games",
  "date": "20230225T153000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League fixtures today - your guide to Saturday's games\nWe're only in late February, but Saturday's matches could have a big impact on who wins the Premier League this season and who drops out of it.\nWe've been treated to tight battles at the top and bottom of the league this season, with Arsenal being chased down by Manchester City and the relegation battle involving a huge number of teams.\nSome of those teams will face each other this Saturday, while the Gunners will be tasked with a tough trip to the Midlands.\nIn an exclusive interview with 90min, Joe Cole talks to Scott Saunders & Harry Symeou regarding all things Chelsea. They talk about Graham Potter's future, Mason Mount, the Blues' transfer policy and more.\nIf you can't see the embed, click here to watch the video!\nEverton vs Aston Villa\nEverton and Aston Villa are two sides that look far more likely to be in the Premier League next season after bringing in new managers, with Sean Dyche and Unai Emery making decent starts at their respective clubs.\nIf the home side can win this game, it'll be the first time they've won back-to-back matches since the start of October, while a defeat for the visitors would be their fourth in a row.\n- Location: Liverpool, England\n- Stadium: Goodison Park\n- Date: Saturday 25 February\n- Kick-off Time: 15:00 GMT / 10:00 ET / 07:00 PT\n- Referee: Anthony Taylor\n- VAR: Chris Kavanagh\nLeeds vs Southampton\nEverton's improved form has left Leeds and Southampton as the bottom two sides in the league and both sacked their managers earlier this month in a bid to turn things around and save their Premier League status.\nThe replacements they picked weren't who their fans would have expected, with Javi Gracia taking over from Jesse Marsch and Nathan Jones being replaced by assistant Ruben Selles. Both coaches will know a defeat in this game would be a huge blow to their chances of keeping their clubs up.\n- Location: Leeds, England\n- Stadium: Elland Road\n- Date: Saturday 25 February\n- Kick-off Time: 15:00 GMT / 10:00 ET / 07:00 PT\n- Referee: Peter Bankes\n- VAR: Simon Hooper\nLeicester vs Arsenal\nThis same fixture was a title clash in 2016, but the fortunes of the two clubs couldn't be more different seven years on with Arsenal top of the league and Leicester just four points clear of the relegation zone.\nThey've made a decent start to 2023 though, beating Aston Villa and Tottenham, while Arsenal have faltered, winning just one of their last five matches, meaning this game isn't a foregone conclusion by any means.\n- Location: Leicester, England\n- Stadium: King Power Stadium\n- Date: Saturday 25 February\n- Kick-off Time: 15:00 GMT / 10:00 ET / 07:00 PT\n- Referee: Craig Pawson\n- VAR: Michael Salisbury\nWest Ham vs Nottingham Forest\nThe last time West Ham played host to Nottingham Forest, it was in the Championship, and the London club are very much in danger of ending up in the second tier of English football again, currently sitting 18th in the league.\nA win could take them up two places and within two points of their opponents though, and on the back of draws with Newcastle and Chelsea and defeat to Spurs, David Moyes and co will be expecting to get it.\n- Location: London, England\n- Stadium: London Stadium\n- Date: Saturday 25 February\n- Kick-off Time: 15:00 GMT / 10:00 ET / 07:00 PT\n- Referee: Jarred Gillett\n- VAR: Tony Harrington\nBournemouth vs Manchester City\nBournemouth and Manchester City look set to endure nail-biting ends to their 2022/23 campaigns for very different reasons, with the home team one point and place above the relegation zone and the reigning champions two behind Arsenal at the top of the league.\nAfter beating their title rivals, they undid their good work by drawing away to Nottingham Forest, and will know they can't afford to slip up in such a manner again if they want to become champions for the third season in a row.\n- Location: Bournemouth, England\n- Stadium: Vitality Park\n- Date: Saturday 25 February\n- Kick-off Time: 17:30 GMT / 12:30 ET / 09:30 PT\n- Referee: Paul Tierney\n- VAR: Andy Madley\nCrystal Palace vs Liverpool\nJust when Liverpool's poor season looked to be turning around, they threw away a 2-0 lead to lose 5-2 to Real Madrid in midweek. They don't have time to feel sorry for themselves, however, with their hopes of a top-four finish hanging by a thread.\nIf they can beat Crystal Palace, it would be the first time this season they've won three straight Premier League games, and it would do their chances of playing Champions League football next season the world of good.\n- Location: London, England\n- Stadium: Selhurst Park\n- Date: Saturday 25 February\n- Kick-off Time: 19:45 GMT / 14:45 ET / 11:45 PT\n- Referee: Darren England\n- VAR: Andy Madley",
  "word_count": 839,
  "scraped_at": "2026-02-14T01:55:49.886173",
  "_text_extracted": true
}