{
  "article_id": "7efd92004a17",
  "url": "https://www.fourfourtwo.com/features/crystal-palace-vs-arsenal-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match",
  "title": "Crystal Palace vs Arsenal live stream , match preview , team news and kick - off time for this Premier League match",
  "date": "20230820T214500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Crystal Palace vs Arsenal live stream, match preview, team news and kick-off time for this Premier League match\nFind a Crystal Palace vs Arsenal live stream for this Premier League clash\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nCrystal Palace vs Arsenal live stream and match preview, Monday 21 August, 8pm BST\nCrystal Palace vs Arsenal live stream and match preview\nLooking for a Crystal Palace vs Arsenal live stream? We've got you covered. Crystal Palace vs Arsenal is on Sky Sports in the UK. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nArsenal started off their Premier League title challenge with a convincing 2-1 win against Nottingham Forest last weekend, at least for the first 80 minutes that is.\nBukayo Saka and Eddie Nketiah were both on target for the Gunners as they got three points under their belt early on, but Thomas Partey started at right-back and Gabriel was dropped from the starting XI, confusing fans.\nWith Jurrien Timber out for an extended period of time, though, Mikel Arteta will need the whole squad at full fitness.\nThey face a Crystal Palace side who are taking positive steps under Roy Hodgson, especially after they beat new boys Sheffield United 1-0 away from home on opening day. The side is strong and balanced, but a lack of goals from the strikers this season could prove a problem for Palace, despite Odsonne Édouard bagging the winner at Bramall Lane.\nKick-off is at 8pm BST. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nCrystal Palace are missing Michael Olise, Will Hughes and Matheus Franca for the visit of Arsenal, with Olise likely going to take the longest to recover.\nArsenal will be without new signing Jurrien Timber for a number of months, though the full extent of his knee injury isn't yet known. What is known, though, is that Oleksandr Zinchenko and Folarin Balogun could both be fit enough to make the bench, but Gabriel Jesus will be out until at least September.\nForm\nCrystal Palace: W\nArsenal: W\nReferee\nDavid Coote will be the referee for Crystal Palace vs Arsenal. His assistants will be Marc Perry and Wade Smith, with Thomas Bramall the fourth official. Jarred Gillett is the VAR, with Neil Davies the assistant VAR.\nStadium\nCrystal Palace vs Arsenal will be played at Selhurst Park in Croydon, London, which has a capacity of 25,486.\nKick-off and channel\nCrystal Palace vs Arsenal kick-off is at 8pm BST on Monday 21 August in the UK. The game is on Sky Sports Premier League and Sky Sports Main Event in the UK.\nIn the US, kick-off time is 3pm ET / 12pm PT. The match will be shown on NBC in the US. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and TNT Sports are the two main players, but Amazon also have a slice of the pie in 2023/24.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing all 380 games in the season. A fuboTV subscription also lets you watch every game.\n• Canada: The way to watch Premier League football in 2023/24 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 977,
  "scraped_at": "2026-02-14T02:00:36.663579",
  "_text_extracted": true
}