{
  "article_id": "7f0c5a40d297",
  "url": "https://www.90min.com/features/real-madrid-2025-january-transfer-wishlist",
  "title": "Real Madrid 2025 January transfer wishlist",
  "date": "20241225T200000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid's 2025 January transfer wishlist\n- Real Madrid have endured a disappointing first half of the campaign by their standards\n- Carlo Ancelotti's side have struggled with injuries in defence\n- January reinforcements could come in handy for Los Blancos\nA disappointing season for Real Madrid is an impressive campaign for most other clubs in European football.\nLos Blancos have stuttered during the first half of 2024/25 and will be frustrated with themselves heading into the new year. Three wins from six in the Champions League is concerning and leaves them in a difficult position, while their La Liga form has been inconsistent. By their own lofty standards, they remain some way from their best.\nMadrid appear unlikely to make any additions in the January transfer window but that could prove a fatal mistake. Defensive injuries have been costly this season and often left the Spanish giants exposed, with reinforcements in the backline essential in the near future.\nHere are the areas Real Madrid could target over the winter window.\nRight-back\nDani Carvajal enjoyed the greatest season of his career in 2023/24 but his current campaign is already over. The 32-year-old is sidelined for the remainder of the term with an ACL injury sustained in early October, leaving Madrid incredibly short-handed at right-back.\nLucas Vazquez is their only other senior option and the former winger has rarely been a reliable figure on the right side of defence. An injury to the Spaniard in mid-November forced Ancelotti to use Federico Valverde in the right-back spot.\nLos Blancos could desperately use a more consistent and impressive option for the second half of the campaign.\nKey targets\nMadrid's chief right-back target appears to be Liverpool dynamo Trent Alexander-Arnold. The No.66 is out of contract with the Reds at the end of the current campaign and could join best friend Jude Bellingham in the Spanish capital. The England defender is able to sign a pre-contract agreement with Los Blancos in January, but it seems extremely unlikely that he would join before next summer.\nBayer Leverkusen sensation Jeremie Frimpong is another who has been casually linked with Madrid. The attack-minded Dutchman was integral to his side's league and cup double last term with his penchant for scoring goals and providing assists.\nEven Manchester United defender Diogo Dalot has reportedly interested Los Blancos. The Portuguese defender would certainly be a steady option for Madrid but is unlikely to get pulses racing at the Santiago Bernabeu.\nCentre-back\nCentre-back has long been an issue for Madrid. Not in terms of the quality of those they have in the position, but due to a relentless stream of injuries.\nDavid Alaba has been missing since December 2023 and will take time to readjust when he returns to the squad at the beginning of the new year. Eder Militao has suffered an ACL injury for the second successive season and will miss the rest of the campaign. Nacho Fernandez departed on a free transfer during the summer.\nAll that has left Madrid lacking depth and quality in the centre-back position. Antonio Rudiger has been a mainstay but his partner has flittered between defensive midfielder Aurelien Tchouameni and youngster Raul Asencio. To challenge for major titles, they may need to solidify the centre of their defence.\nKey targets\nOne option for Madrid over the January window is former defender Rafa Marin. They sold the 22-year-old to Napoli following an impressive loan spell with Alaves but could sanction a return for the Spaniard during January - even if only on loan.\nJonathan Tah was a serious target for Bayern Munich over the summer but the centre-back's move to the Bavarian giants never materialised. The Bayer Leverkusen defender is available on a free transfer next summer and Madrid have been linked previously with the German international.\nIf Madrid want to sign a younger talent with bags of potential, then Palmeiras wonderkid Vitor Reis could be a solution. The 18-year-old has been compared to his Brazilian compatriot Marquinhos and has a bright future.\nLeft-back\nLeft-back is one of the only defensive areas in which Madrid haven't suffered significant injuries this term, but the increasingly concerning performances of Ferland Mendy mean it's still a position that could be strengthened.\nDeputy Fran Garcia has replaced the Frenchman in recent weeks after a disappointing first half of the 2024/25 campaign littered with errors and shaky showings. Even Eduardo Camavinga was favoured to his compatriot in the 4-2 win over Sevilla last time out.\nKey targets\nAlphonso Davies is Madrid's leading left-back target. The speedy Bayern defender has consistently been one of Europe's best in his position over recent seasons and could arrive on a free transfer next summer. A move in January looks far less likely, but they could agree a contract with the Canada international during the winter window.\nA cost-effective option could be Girona's Miguel Gutierrez. The former Los Blancos academy product could be available for just £8m due to a buy-back clause in his contract, with the 23-year-old having dazzled for last season's surprise Champions League qualifiers.\nMoving for another former left-back, Theo Hernandez, would be a more ambitious move. Madrid are unlikely to cough up the gargantuan fee likely needed to sign the Frenchman, but there can be no doubts over his status as one of the world's leading full-backs.",
  "word_count": 887,
  "scraped_at": "2026-02-14T01:58:00.743456",
  "_text_extracted": true
}