{
  "article_id": "7f581ba86b74",
  "url": "https://www.empireofthekop.com/2025/04/20/aina-liverpool-potential-trent-replacement-transfers/",
  "title": "Report : Liverpool line up Ola Aina as potential Trent replacement",
  "date": "20250420T110000Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have been linked with numerous players from fellow Premier League clubs ahead of the summer transfer window?\nAlexander Isak, Dean Huijsen and Milos Kerkez are chief among the current stars of the English top flight who are reportedly on the Reds’ radar, with Bryan Mbeumo and Morgan Rogers also on the extensive list of names who’ve been mentioned.\nAnother familiar face to football fans in this country is now believed to be in Richard Hughes’ sights as the end of the 2024/25 season draws near.\nLiverpool eyeing Ola Aina as potential Trent replacement\nAccording to CaughtOffside, Liverpool have identified Nottingham Forest right-back Ola Aina as a potential replacement for Trent Alexander-Arnold at Anfield, with the Reds’ vice-captain approaching the end of his current contract.\nNewcastle, Tottenham Hotspur and Chelsea are also eager to snap up the 28-year-old in the summer, with the latter targeting a reunion with a player who came up through their academy.\nThe Garibaldi are understandaly keen to retain the Nigeria international and are hoping to thrash out a new long-term deal for him, but with just two months remaining on his existing terms, the Champions League chasers are in a race against time to hold onto the defender.\nAina would be a smart pickup on a free transfer\nIf Liverpool were to snap up Aina on a free transfer this summer, it’d go a long way towards making up for the likely departure of Trent in similar cirumstances, and it’d also given them an immediate, Premier League-proven replacement on far more modest wages.\nThe Nigerian currently earns £40,000 per week at the City Ground (Capology), and while he’d likely want a more substantial pay packet to come to Anfield, we imagine that he could be enticed for far less than the £180,000-a-week that LFC are paying to their vice-captain.\nThe Nottingham Forest man could be a good fit for Arne Slot’s flexible tactical setup, given his ability to take up an inverted role in addition to operating as a conventional right-back, and the much-decorated Pep Guardiola hailed him as an ‘exceptional‘ player earlier this year.\nAina is particular adept at dribbling, with his match average of 1.2 over the past year placing him among the top 11% of right-backs in Europe’s five main leagues (FBref). However, he’d have to go some way to replicating Trent’s output, having registered just eight goals and 13 assists in more than 250 senior career appearances.\nLiverpool already have a superb readymade option in Conor Bradley waiting to step up, but going into next season with only one natural right-back would be quite risky. The Nigeria international duly makes for an intriguing transfer target, and this could be one to watch over the coming weeks.",
  "word_count": 455,
  "scraped_at": "2026-02-14T01:58:31.716626",
  "_text_extracted": true
}