{
  "article_id": "7f5f52fe9e72",
  "url": "https://www.marketscreener.com/quote/stock/GETTY-IMAGES-HOLDINGS-INC-141526815/news/Getty-Images-and-UEFA-Renew-Multi-Year-Agreement-49218246/",
  "title": "Getty Images and UEFA Renew Multi - Year Agreement",
  "date": "20250303T141500Z",
  "domain": "marketscreener.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A Media Snippet accompanying this announcement is available by clicking on this link.\nLONDON, March 03, 2025 (GLOBE NEWSWIRE) -- Getty Images (NYSE: GETY), a preeminent global visual content creator and marketplace, today announced it has renewed its multi-year partnership with UEFA, with Getty Images continuing to serve as UEFA’s official appointed photographic agency.\nThe agreement will see Getty Images’ award-winning sports photographers and editors provide comprehensive coverage of all UEFA men’s and women’s club and national team competitions, including the UEFA Champions League, UEFA Europa League, the new UEFA Women’s Europa Cup starting in the 2025/2026 season, and the UEFA Futsal EURO.\nAlongside its matchday coverage of the UEFA Champions League, Getty Images will provide UEFA and its commercial partners with an expanded range of creative editorial content including official player portraits of all 36 UEFA Champions League teams, while continuing to supply portraits of all clubs competing in the UEFA Women’s Champions League. The team at Getty Images will also provide short-form video content services for UEFA partners, capturing the atmosphere and brand production at UEFA Champions League matches.\n“We are proud to build on the two-decades-long relationship between Getty Images and UEFA, where we continue to support UEFA and its partners with fresh, creative and engaging imagery delivered in almost real-time to drive the fan experience,” said Michael Heiman, Vice President of Global Sport at Getty Images. “Our industry-leading sports photographers relish the opportunity to capture the iconic moments of Europe’s biggest football tournaments in imagery available via the UEFA Collection.”\nGetty Images will serve as the official appointed photographic agency for the upcoming UEFA Women’s EURO 2025 in Switzerland, with its photographers covering every angle of the tournament across eight cities from the Opening Match on 2 July to the Final on 27 July. Its assigned UEFA photographers will capture official player and squad portraits, atmospheric imagery of the fans around the country, match action, and portraits of the winning team taken immediately after the final whistle.\n“We are delighted to continue our long-standing partnership with Getty Images, whose photographers have consistently delivered high-quality content and captured unforgettable moments for our channels and those of our partners over the years,” comments Phillip Williams, Head of Editorial Content Services at UEFA.\nFor 30 years, Getty Images has been a trusted partner to many of the world’s leading sports rights holders. In addition to its work with UEFA, Getty Images is the official photographer or photographic partner to 125 of the most significant sports governing bodies, leagues, and clubs globally, including FIFA, the International Olympic Committee, Formula 1, Bayern Munich, Ultimate Fighting Championship, NBA, World Rugby, and International Tennis Federation.\nGetty Images has worked officially with UEFA since 2004 and has content from all UEFA club and national competitions since the first European Cup Final in 1956. For more information about Getty Images’ coverage of past and future UEFA tournaments, visit www.gettyimages.com/collections/uefa.\nMedia contact:\nGill Jones\ngill.jones@gettyimages.com\nhttps://www.globenewswire.com/newsroom/ti?nf=OTM4NjgxOCM2Nzg0MjQ0IzIyNTMzMjA=\"/>\nhttps://ml.globenewswire.com/media/YjlmMGVhOGQtOTAxMy00OGM0LWE5NzktM2M5ZTdkNmE0OTgzLTEyNjQ4NzM=/tiny/Getty-Images-US-Inc-PR-.png\" referrerpolicy=\"no-referrer-when-downgrade\"/>\nSource:\nGetty Images, Inc.2025 GlobeNewswire, Inc., source Press Releases",
  "word_count": 501,
  "scraped_at": "2026-02-14T02:14:59.442522",
  "_text_extracted": true
}