{
  "article_id": "7f6299ffce6b",
  "url": "https://www.thenews.com.pk/print/1133451-psg-game-defining-moment-in-newcastle-s-season-howe",
  "title": "PSG game  defining moment  in Newcastle season : Howe",
  "date": "20231128T223000Z",
  "domain": "thenews.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "PSG game ‘defining moment’ in Newcastle’s season: Howe\nPARIS: Newcastle manager Eddie Howe believes Tuesday´s pivotal Champions League match against Paris Saint-Germain will be a “defining moment” in the English team´s season.\nNewcastle stunned PSG 4-1 in the first meeting at St James´ Park but have slid from top to bottom in the standings after successive defeats to Borussia Dortmund and would be unable to reach the last 16 if they lose to PSG.\n“This is the defining moment of our Champions League campaign and we´ll give everything,” Howe told a pre-match press conference in Paris on Monday. “It´s difficult to talk about Paris´ players. They have quality everywhere,” he said.\n“They´ve been scoring goals for fun. But our structure and resilience has been good, and we´re going to need to be as good as we know we can be.” Howe´s side have been boosted by a Premier League win over Chelsea at the weekend.\n“The mood of the group is good,” he said. “It was a pivotal moment (the Chelsea win) - it would have been very easy to feel sorry for ourselves. “The lads did well to play at such a high level. But we are not in the position we want to be in in the Champions League, and it is imperative we do not lose tomorrow.”\nPSG are second, a point behind leaders Borussia Dortmund in a tight Group F, with AC Milan and Newcastle also targeting the knockout rounds with just three points separating the four teams.\n“We were ruthless against Paris in the first game, and we don´t want any excuses this time,” Newcastle goalkeeper Nick Pope said. “It´s a tough game but a good challenge. We´ve spoken as a group about what we´d have given to be here when we were chasing Champions League football.”\nPSG coach Luis Enrique said his team were “far” from meeting his expectations and had “a lot of room for improvement” but he was convinced they could use their home advantage. “The Parc des Princes is a cauldron which lifts us,” said the Spaniard. “Newcastle know how to exert pressure very well, they need a victory because they are bottom of the group. ”\n-\nKate Middleton Proves She's True 'children's Princess' With THIS Move\n-\nPaul Anka Reveals How He Raised Son Ethan Differently From His Daughters\n-\n'A Very Special Visitor' Meets Queen Camilla At Clarence House\n-\nJodie Turner Smith Shares One Strict Rule She Follows As A Mom\n-\nHailey Bieber Reveals KEY To Balancing Motherhood With Career\n-\nPhoto Of Jay-Z, Other Prominent Figures With Jeffrey Epstein Proven To Be Fake\n-\nHillary Clinton's Munich Train Video Sparks Conspiracy Theories\n-\nFans Slam Talk Show Host For 'cringe' Behavior In Chris Hemsworth Interview\n-\nWoman Jailed Over False 'crime In Space' Claim Against NASA Astronaut\n-\nJames Van Der Beek’s Close Pal Reveals Family's Dire Need Of Donations\n-\nPrince William And Harry's Cousins Attend 'Wuthering Heights' Event\n-\nHailey Bieber Turns Heads Just Hours After Major Business Win\n-\nKing Charles' Andrew Decision Labelled 'long Overdue'\n-\nTimothee Chalamet 'forever Indebted' To Fan Over Kind Gesture\n-\nColumbia University Sacks Staff Over Epstein Partner's ‘backdoor’ Admission\n-\nOzzy Osbourne's Family Struggles Behind Closed Doors",
  "word_count": 542,
  "scraped_at": "2026-02-14T02:25:08.299909",
  "_text_extracted": true
}