{
  "article_id": "7f868692ae6c",
  "url": "https://metro.co.uk/2025/10/01/chelsea-star-alejandro-garnacho-speaks-ruben-amorim-treatment-manchester-united-24307136/",
  "title": "Chelsea star Alejandro Garnacho speaks out on Ruben Amorim treatment at Man Utd",
  "date": "20251001T003000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea winger Alejandro Garnacho says he experienced a ‘bad moment in life’ after being exiled by his former Manchester United manager Ruben Amorim.\nAmorim reportedly told Garnacho to find a new club at the end of last season after growing frustrated with him both on and off the pitch.\nGarnacho was once viewed as one of the most exciting and talented players at Old Trafford but his contributions fell away towards the end of his spell at the club.\nAmorim was also believed to be unhappy with some of Garnacho’s off-pitch conduct, especially after he and his brother questioned his tactics following the Europa League final defeat.\nGarnacho was placed in Amorim’s bomb squad over the summer and was forced to train away from the first-team while he held talks with potential suitors.\nChelsea soon emerged as the frontrunners to sign the Argentina international and brought him to Stamford Bridge in a deal worth £40m.\nGarnacho is yet to score for his new club but has offered glimpses of his potential, helping Enzo Maresca’s side beat Jose Mourinho’s Benfica in the Champions League on Tuesday night.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe 21-year-old spoke to TNT Sports after the 1-0 win and was asked about his final few months at Manchester United in which he was exiled by Amorim.\n‘I think it was a difficult moment there, just training alone,’ Garnacho admitted. ‘But I have nothing bad to say about the club, my old club Manchester United.\n‘It was just a bad moment in life but now I’m very happy to be here and to play in this competition and to get the three points today.’\nAsked whether nights playing in the Champions League made his struggles over the summer worthwhile, Garnacho added: ‘Of course, yeah.\n‘When we were young we dreamed of playing Champions League nights and we are here now so I’m very happy.\n‘It’s three big points. We needed that after losing our first game so we’re all very happy.’\nChelsea had lost two of their previous three games prior to the visit of Benfica, now managed by ex-Stamford Bridge boss Mourinho.\nThe Blues were far from at their best against Benfica and rode their luck somewhat on their way to a narrow 1-0 win.\n‘The effort was very good,’ said Chelsea boss Maresca. ‘First half I think we were better compared to the second half in the way we managed the ball and created chances.\n‘Second half we dropped. In the last two, three games we have conceded two, three goals and it’s not possible to do that. We need to be better defensively but a clean sheet is nice.’\nMore Trending\nAsked about Garnacho’s performance against Portuguese giants Benfica, Maresca added: ‘Alejandro was very good today. Not only on the ball but defensively, he was very good in the way he pressed.\n‘In the last third he has freedom to go one-v-one when he decides. To arrive in the box is important because it’s from there we score. I was pleased with him.’\nChelsea return to Premier League action this weekend with a huge home match against defending champions Liverpool.\nArne Slot’s side won their first six games of the new season but were beaten by Crystal Palace on Saturday and lost again on Tuesday night against Galatasaray.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Nicolas Jackson vents Chelsea frustration after scoring first Bayern Munich goal\nMORE: Chelsea handed another injury blow with EIGHT ruled out of Liverpool clash\nMORE: Hugo Ekitike injury update after Liverpool defeat to Galatasaray",
  "word_count": 658,
  "scraped_at": "2026-02-14T01:55:21.385983",
  "_text_extracted": true
}