{
  "article_id": "7fa66c4a7422",
  "url": "https://weaintgotnohistory.sbnation.com/chelsea-fc-women/2025/3/5/24378246/chelsea-fcw-vs-leicester-city-wfc-womens-super-league-preview-team-news-how-to-watch",
  "title": "Chelsea FCW vs . Leicester City WFC , Women Super League : Preview , team news , how to watch",
  "date": "20250305T101500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea needed yet another late goal from Lauren James — and a fair bit of refereeing luck — just to get out of Brighton with a point, and avoid the first defeat of the season and the Sonia Bompastor era.\nChelsea FCW vs. Leicester City WFC, Women’s Super League: Preview, team news, how to watch\nBack already\nBut there’s no time to dwell too long on that, with the Blues back in action already in a Wednesday night clash at home against Leicester City — who are the only team to have taken points off of us this season. Bompastor’s looking for a strong reaction to avoid that happening again.\n“It’s always the best thing when you’re able to play so quickly after a frustrating result. We’ll be different playing at home. When you drop two points, the game afterwards, you have to have the right mindset and we will be desperate to get a good result. We’ll be ready for the game.”\n-Sonia Bompastor; source: Chelsea FC\nDate / Time: Wednesday, March 5, 2025, 19.30 GMT; 2:30pm EST\nVenue: Kingsmeadow, Kingston upon Thames, London\nReferee: Abigail Byrne\nForecast: Warm and sunny day turning into a cool night\nOn TV: none (US); Sky Sports (UK); elsewhere\nStreaming: ESPN+ (US); Sky Go (UK)\nChelsea team news: It’s a busy period for Chelsea with massive games coming up this month in the League Cup final (which caused this game to get pushed forward) as well as the Champions League, and perhaps all that caused us to lose a bit of focus.\nBut injuries certainly aren’t helping either, with Naomi Girma picking up a knock on her debut over the weekend — not serious, apparently, but not ideal — and Keira Walsh being forced off at half time with an adductor concern. Chelsea had been without Guro Reiten (back), Erin Cuthbert (ribs), and Maika Hamano (ankle) already for that game, and they all remain doubtful. And of course all the usual long-term absentees remain absent.\nVeteran (ex-Chelsea) goalkeeper Becky Spencer, who recently came back to us by signing on a short-term emergency loan from Spurs to cover for Femke Liefting’s injury was in the matchday squad against Brighton, as was Niamh Charles despite a knock picked up in training.\nWe do have the depth to overcome such adversity, but there are limits to such things even for us — even with a healthy Lauren James.\nLeicester City team news: Since their draw against us in mid-December, Leicester have won three of seven in all competitions, picking up six points in the league in the process to double their points total and move well clear of last place and relegation. However, outside of a penalty shootout in a cup, they have failed to win any of their last 15 matches away home from, dating back to March of last year. There are no guarantees in football, but we should be winning this pretty easily regardless of personnel.\nDespite all that, they have the best defense in the league outside of the top four, and they will be relying on that once again to try to pull off a result.\n“When you play a team like Chelsea, the only thing you can do is get the result. [Last time] we focused a lot on the defensive aspects. That definitely helped us on that last game of the first phase because we were really strong defensively. We were a team that conceded very few goals and we were defending well in a block.”\n-Amandine Miquel; source: Sky\nYoungster Karla Torres should be back for the Foxes after getting the day off over the weekend, but defenders Sari Kees and Hlín Eiríksdóttir are doubtful.\nPreviously: The draw earlier this season was the first time (ever) that we failed to beat Leicester. The all-time series thus stands at 7 wins and 1 draw. Let’s make that 8!",
  "word_count": 649,
  "scraped_at": "2026-02-14T02:02:35.611912",
  "_text_extracted": true
}