{
  "article_id": "7fb19f01fd44",
  "url": "https://www.irishmirror.ie/showbiz/lucy-kennedy-most-challenging-interview-30824919",
  "title": "Lucy Kennedy on most  challenging interview  as all star line - up unveiled for new Living with Lucy",
  "date": "20230831T061500Z",
  "domain": "irishmirror.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lucy Kennedy on most 'challenging interview' as all star line-up unveiled for new Living with Lucy\nThe Dubliner is set to live with a new bunch of celebrities this season\nTV star Lucy Kennedy has revealed Katie Price was a “challenging interview” as she returns to our screens with a new series of Living With Lucy.\nThe Dubliner is set to live with a new bunch of celebrities this season, including the UK glamour model, sports broadcaster Des Cahill, Coronation Street star Simon Gregson, comedian Andrew Maxwell, and former footballer turned pundit Richard Sadlier.\nBut Lucy said Katie was her most “challenging interview” as she opened up about staying in her mucky mansion for the weekend.\nShe told us: “Living in the mucky mansion for three days was very full on. I really like Katie Price, but she is great craic, she has an Irish sense of humour. But she is very confident and very outspoken, so I found myself… she was a challenging interviewee. Definitely. Because she has been there, she has done it. She has done it so many times for so long that she was a challenge to live with, but would I go out for a drink with her? Absolutely.\nREAD MORE: Lucy Kennedy slams 'fake' campaign using her image to sell slimming tablets on Facebook\n“Her whole family… that was a challenge as well. Harvey was at home. Her dog, who has since passed away, and then the two little ones, Harvey’s minder and a newborn baby so I walked into a full house of just Katie Price.”\nBut Lucy said that she found Katie to be a private person who enjoys the less glamourous side of her job.\n“But then when we were on our own… she is actually a very private person, which sounds so ironic but in her home with the door closed and no make up on, she’s no interest in the glamourous side of life, she walks around with no socks on. She is very casual. That surprised me about her and how casual she was so quickly.\n“I think she is more comfortable in her own skin than people probably think,” she admitted.\nLucy said she thinks people will see Des Cahill in a different light.\n“I think people will see Des Cahill in a different light. He’s such a nice guy. We had a great night in Dalkey.\n“Richie Sadlier… new baby. I was in heaven.\n“I love Simon Gregson even more. Going on the set of Corrie with the Corrie cast member was bonkers.\n“Doing the tour was him was surreal. He really is Steve MacDonald. It’s really weird. It’s like he is not acting in Corrie, and he is just being himself. He is Steve. I kept calling him Steve. It was really embarrassing and unprofessional, but I adored my time with him and his wife and his boys.\n“He was definitely a pinch me moment.”\nLucy has lived with 54 celebrities since the series began and she said Ireland’s celebs redecorate the house before she arrives.\nShe said the late Christy Dignam got his whole house repainted in Finglas before her arrival.\n“People put extensions on their house when they know I’m coming.\n“Christy Dignam’s wife Kathryn said she repainted the whole house when they heard I was arriving.\n“Most people really make an effort, and it is nice and then of course there are my favourite houses like Vanessa Feltz, Jermaine Jackson, the wow LA houses.”\nBut Lucy recalled some of the worst moments of the show.\n“There’s been loads. We airBnB an apartment with Daniella Westbrook. Poor Daniella, she always ends up in the worst light. It’s not her fault.\n“It was in Marbella and in hindsight it wasn’t a great spot. I spent the night awake, I could hear people fighting, dogs barking. It wasn’t that clean.\n“I think there were cockroaches as well. It wasn’t my finest weekend. I slept with my hoodie up literally in 28C. Sweaty and scared because I thought something was going to bite me.”\nLucy was speaking as part of Virgin Media’s autumn schedule launch, which unveiled a host of new shows this upcoming season.\nNew dating show Grá ar an Trá’ will be fronted by Gráinne Seoige, James Kavanagh and Síomha Ní Ruairc.\nBean an Tí, Síomha Ní Ruairc and James Kavanagh, have thrown open the doors of their ‘Love Teach’, where under the watchful eye of Cinnire Gráinne Seoige, 10 singletons will be put through their paces to learn Irish to find love. Contestants will split their time between flirting and foclóir with the ultimate aim of being crowned the 'couple with the most focail', walking away with €10,000.\nBrian Dowling hosts The Salvage Squad, which transforms Ireland’s tired, old rooms into unique and stunning showstoppers. The twist; they can't buy anything new. With a maximum spend of €1,000 and just three days, they must only use second-hand, free-cycled, salvaged, up-cycled, homemade, or pre-used materials to create their dream rooms. This is the home makeover show for the world we live in today, kicking off as part of Climate Action Week in October and supported by Coimisiún na Meán's Sound and Vision funding scheme.\nNew gripping true crime series ‘Confessions of a Crime Boss’, sees John Gilligan, the most notorious criminal in Irish history, provide in-depth interviews in a must-watch three-part series. The groundbreaking fly-on-the-wall series 'The Guards' returns this September, providing real life insights into policing in Ireland.\nOriginal documentaries include ‘Faith & Courage: The Sinéad O'Connor Story’ reflecting on the life of the late singer-songwriter and activist. ‘To Die For: Cosmetic Surgery in Turkey' chronicles the increasing trend of Irish people travelling to Turkey for cosmetic surgery procedures, with sometimes fatal results, while ‘Born Too Soon’ gives unprecedented access to neonatal wards at Cork University Hospital.\nVirgin Media Television will continue to be the home of the biggest international TV shows, with the eagerly awaited return of ‘Big Brother’ accompanying viewer favourites ‘I’m A Celebrity’, ‘The Voice’ and ‘The Graham Norton Show’ as well as thrilling dramas ‘Litvinenko’ and ‘The Long Shadow’. Brand-new format ‘My Mum, Your Dad’ is dubbed the Love Island for single parents, hosted by TV icon Davina McCall.\n‘Gogglebox Ireland’ is also back for another season, with the nation’s favourite armchair critics returning, along with some new faces.\nSport takes centre stage this autumn at Virgin Media. There will be live coverage of the ‘Rugby World Cup 2023’ throughout the entire tournament, as Ireland look to make history in France.\nLive games include Ireland’s group opener against Romania on September 9th, the crunch Pool B game against Scotland, and their potential quarter-final along with the other ties from the last eight that day. Other live games include South Africa v Scotland, Wales v Australia, the semi-final, the third-fourth place play-off and the world cup final itself.\nThere’s no shortage of top-class football, with live coverage of the Euro 2024 Qualifiers, UEFA Champions League, Europa League and Conference League, along with SSE Airtricity League of Ireland Premier Division football. The season kicks off this Friday 1st September with the highly anticipated Dublin Derby between Shamrock Rovers and Bohemians FC at Tallaght Stadium.\nThe popular ‘Sport Stories’ series continues as WWE superstar Sheamus sits down with Bernard O'Toole for an in-depth interview about his life inside and outside the ring. The best of UK horseracing also features, along with weekly WWE and PGA Tour coverage. Virgin Media Television will broadcast NFL action all season, up to and including February’s Super Bowl.\nAnthony Nilan, Head of Content Strategy, Virgin Media Television said: “Public service broadcasting remains at the heart of Virgin Media Television and this season reflects our continuing commitment to deliver informative, engaging and entertaining content to our viewers nationwide. As we celebrate our 25th autumn schedule, today also marks the fifth anniversary of the Virgin Media Television brand. This season is a testament to the responsibility we hold to create a positive impact in the Irish broadcasting landscape, delivering an important alternative voice to Irish viewers.\n“Building on a year that has seen us achieve record share of viewing, we’re going to close out 2023 with sport taking centre stage with the Rugby World Cup 2023 and a schedule offering something for everyone with documentaries, drama and entertainment. We’re continuing to celebrate and promote home-grown creativity with new and returning original Irish formats and series. Our home-produced programming remains rooted in values and interests that resonate with our audience, and reflects the complexity and richness of Irish society, led by our daytime, news and current affairs output.\n“With Virgin Media Player on track to record its best year to date, we’ll be continuing our growing investment in the platform. In response to viewer demand to view content their way, this autumn will see some exciting new shows stream exclusively on Player as soon as they drop internationally, meaning our viewers won’t have to avoid dreaded spoilers and can be part of the conversation on their own terms”.\nJoin our new WhatsApp community! Click this link to receive breaking news and the latest headlines direct to your phone. We also treat our community members to special offers, promotions, and adverts from us and our partners. If you don’t like our community, you can check out any time you like. If you’re curious, you can read our Privacy Notice.",
  "word_count": 1568,
  "scraped_at": "2026-02-14T02:07:08.840413",
  "_text_extracted": true
}