{
  "article_id": "7fd0917f6fdb",
  "url": "https://www.90min.com/ousmane-dembele-liverpool-warning-champions-league-last-16-tie",
  "title": "Ousmane Dembele sends Liverpool warning ahead of Champions League last 16 tie",
  "date": "20250304T144500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ousmane Dembele sends Liverpool warning ahead of Champions League last 16 tie\n- Dembele one of world football's most in-form players\n- PSG on ruthless streak of form and blitzing to Ligue 1 title\n- Luis Enrique's side will not be underestimated by Liverpool\nIn-form Ousmane Dembele has warned Liverpool about Paris Saint-Germain's collectiveness ahead of their Champions League last 16 first leg clash in the French capital.\nThe 27-year-old has been reborn this season, thumping home 18 goals since the turn of the year to help PSG assert their dominance in Ligue 1.\nThe 4-1 win over Lille at the weekend – a side who have beaten Real Madrid and Atletico Madrid in the Champions League this season and annihilated Dutch giants Feyenoord 6-1 – has opened up a 13-point lead at the top of the table, with PSG unbeaten in the 24 matches they've played.\nPSG also saw off Manchester City in resounding fashion in the league phase of the Champions League and brushed aside Brest 10-0 on aggregate in their knockout round play-off tie, setting up a mouth-watering last 16 clash with Arne Slot's Liverpool.\nThe Reds are also 13 points clear of their nearest domestic challengers, Arsenal, and topped the Champions League league phase table. But Dembele was brimming with confidence when speaking to DAZN about PSG's chances of getting through the tie.\n\"We are preparing well for what is to come [Liverpool],\" the Frenchman said. \"Since the beginning of the season, [Luis Enrique] has been telling us to play good football. Everyone is participating, whether it's the midfielders, defenders or attackers. Everyone wants to be decisive.\n\"We are in a very good dynamic, we will try to keep it as long as possible. We are having a blast! Everyone attacks, everyone defends. We are a very united team, that gives results like that. It's just fun for 90-95 minutes.\"\nAlongside the Madrid derby, to be contested between Real and Atletico, PSG's clash with Liverpool is regarded as the standout tie of the last 16 – and the significance of the game was not lost on Dembele who is expecting a great spectacle.\n\"We know it's going to be a tough match,\" he added. \"It's the Champions League. Liverpool finished first, they're also confident. It's going to be a great show.\"\nDembele's 26-goal return in all competitions is comfortably the best of his injury-ravaged career, showing the levels that were expected of him after bursting onto the scene at Borussia Dortmund. His breakthrough in Germany led Barcelona to agree a deal worth €145m, but his six-year stint in Catalonia was constantly interrupted by niggles and muscle tears.\nLuckily, Dembele appears to have put those troubles behind him, relishing a more central role for a PSG side that have already scored 105 goals this season, conceding just 35.",
  "word_count": 471,
  "scraped_at": "2026-02-14T02:18:17.730768",
  "_text_extracted": true
}