{
  "article_id": "7fe02ad4b588",
  "url": "https://thepeoplesperson.com/2025/04/25/edwin-van-der-sar-claims-manchester-united-will-see-the-best-of-andre-onana-next-season-293314/",
  "title": "Edwin van der Sar claims Manchester United will see the best of Andre Onana next season - Man United News And Transfer News",
  "date": "20250425T200000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United legend Edwin van der Sar has backed embattled goalkeeper Andre Onana to come good for the Red Devils despite talks of an impending exit.\nThe Cameroonian has made awful errors since his arrival in Manchester, and was single-handedly responsible for United’s early exit from the Champions League last season.\nHis errors have continued under a new head coach, with high-profile mistakes both in the Premier League and Europa League with plenty of pundits calling for him to be moved on in the summer.\nRuben Amorim is also not too impressed but he might be forced to prioritise certain other positions given the limited transfer budget at his disposal.\nOnana’s mistakes have proven to be costly\nThat means the 29-year-old’s future is secure for now and while fans might be worried thinking about this, former United legend claimed the Cameroon international is too good to end up a failure at Old Trafford (via Tribal Football).\n“We had Andre for four or five years at Ajax, he did a tremendous job for us from a young boy, coming from Barcelona, we got him. He played really, really well for us and he deservedly got a great transfer to Inter Milan.\n“Played in the Champions League final, moved to Manchester United, and sometimes it’s not easy to get there and play in a different league, a different style of football.\n“But I know his quality, I trained with him, I’ve seen him, mentally he’s also strong, so give him the confidence, give him the time and from next year, I’m sure they’ll have a top, top Premier League goalkeeper in Andre Onana.”\nVDS support\nThe Dutchman will know a thing or two about Onana having worked with him extensively at Ajax. Also being a United legend, he will know the rigours and difficulties of a No 1 under the media glare at Old Trafford.\nThe ever-changing defensive shape in front of Onana has also not helped while his confidence has also taken a battering following recent mistakes and media attacks.\nOne thing that has not wavered is his confidence and hopefully, Van der Sar’s words will ring true next season. He has also received a lot of support from his teammates and that should do his form a world of good.\nEven if the ex-Inter Milan star stays, a goalkeeping revamp is still on the cards with both Altay Bayindir and Tom Heaton linked with exits.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 410,
  "scraped_at": "2026-02-14T01:58:31.701967",
  "_text_extracted": true
}