{
  "article_id": "7fed48845ee8",
  "url": "https://thepeoplesperson.com/2023/10/27/manchester-united-vs-manchester-city-top-5-things-to-watch-out-for-in-marquee-clash-271134/",
  "title": "Manchester United vs Manchester City : Top 5 things to watch out for in marquee clash - Man United News And Transfer News",
  "date": "20231027T204500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester Derby returns this weekend for its latest iteration as Manchester United welcome rivals Manchester City to Old Trafford.\nErik ten Hag’s men are on an upward curve in the form books, winning three on the trot for the first season this season with a win against Copenhagen in the Champions League.\nCity have bounced back from their Arsenal defeat with wins against Brighton and Young Boys and will be up for the marquee clash.\nHere are five things to watch out for when United clash against City on October 29, 3.30 PM BST.\nIs the streak real?\nUnited have won three in a row, but those who have seen those games know that the scoreline lies. United needed Scott McTominay’s late heroics to scrape past Brentford. A Diogo Dalot screamer saved their blushes against Sheffield United, while Andre Onana pulled out a miracle to save United’s UCL campaign.\nWith all due respect, those three are not traditionally “elite” sides. That spells trouble for United against City. If United put up a performance like they have so far this season, United might be in for a historically bad result.\nTen Hag needs to sort out the performance because the luck with results going their way in recent times will run out soon. There aren’t many worse games for the luck to run out than against the reigning treble winners.\nA player reborn\nTo say that Onana has had a “shaky” start to his United career would be an understatement. In reality, he has been a walking calamity in most games, actively hurting the team’s prospects through his errors.\nFans will hope the corner was turned against FC Copenhagen. The whole stadium was on its feet when the Cameroonian saved the last kick of the game, a penalty, to keep United in the Champions League.\nMoments like that turn seasons and careers around. Furthermore, Onana faces a familiar foe. The UCL final against City was the one where he ascended to world-class level with his all-around play. If the last game was the turning point, this one should start him on his new and successful ways.\nThe Norwegian question\nThere’s a narrative around Erling Haaland that his start to the season has been a bit cold. To put that into perspective, the Norwegian is the Premier League’s top scorer, has opened his UCL account, and is coming off a brace against Young Boys in the midweek.\nMeanwhile, United’s top scorer this season is still Casemiro, who’s a defensive midfielder, who’s injured, and has missed the last two games.\nUnited’s worries are compounded since Lisandro Martinez remains absent, which means Maguire’s “renaissance” could finally be put to test if he features in this game. Haaland has proven to be a nightmare to deal with for United. He already has a hattrick against the club and against this patched-up defence, his spectre will loom large.\nHow the team deals with the Norwegian will decide the game.\nWhat’s the blueprint?\nTen Hag wants United to play with speed and needs them to become the best in the world at transitions. As a result, there is a hurried nature to United’s play which turns into frantic sometimes, a recipe for disaster for any team that wants to be successful.\nWhen the team plays quickly, he subs on Christian Eriksen, wanting “more football”. After big forward leaps last year in terms of a playing identity, the fans are confused as to what the manager actually wants from his team.\nGranted, the injuries play a huge part, but currently, Ten Hag’s words don’t match up with his actions during the game. That needs to change soon. Fans know Ten Hag is the least of the problems at the club, but the cruel reality is, that the manager is the “easiest” problem to fix, especially with the prospect of a new owner in charge of sporting decisions looming large.\nOn last-chance saloon\nContinuing the theme of Ten Hag’s confusing actions, some of his favourites are treading a thin rope with the fans. Antony’s status as the undisputed starter has been addressed earlier, but absence made the heart grow fonder.\nNow that the Brazilian is back with the team, the fans are getting the frustrating Antony experience all over again. A United attacker’s best trait being tracking back is a dystopian nightmare for a fanbase that has grown up watching and hearing about Ryan Giggs, Cristiano Ronaldo, and David Beckham, among others, terrorising defenders out wide.\nBesides Antony, his propensity to have a short-term view when selecting squads, like giving McTominay starts after he scored against Brentford screams a lack of planning and decisiveness.\nPositive results have seen all that swept under the rug, but when they turn bad again, as the performances suggest they will, these players will be under the scanner for starting consistently despite their consistency in giving bad performances.",
  "word_count": 814,
  "scraped_at": "2026-02-14T02:13:18.805872",
  "_text_extracted": true
}