{
  "article_id": "7ff88a51cecf",
  "url": "https://www.illawarramercury.com.au/story/9117049/matildas-lock-in-kerr-for-nz-clashes-but-grant-out/",
  "title": "Matildas lock in Kerr for NZ clashes but Grant out",
  "date": "20251121T050000Z",
  "domain": "illawarramercury.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sam Kerr will play in Australia's two internationals against New Zealand despite missing a second consecutive game for Chelsea, says Matildas coach Joe Montemurro.\nSubscribe now for unlimited access.\nor signup to continue reading\nBut Football Australia confirmed on Friday that defender Charli Grant would miss the matches in Gosford and Adelaide with a knee injury she suffered while training with Tottenham Hotspur.\nKerr sat out Chelsea's 1-1 draw with Champions League foes Barcelona on Friday morning (AEDT) as part of her ACL rehabilitation, having also missed last Sunday's draw with Liverpool.\nShe suffered her ACL injury in January 2024 while on a Chelsea training trip, but scored on return for the Blues in September before playing her first full 90 minutes in last week's 6-0 thumping of St Polten, where she scored twice.\nThe 32-year-old's injury continues to be monitored by Chelsea, with Montemurro indicating it was always the plan for her to rest from recent club games.\n\"She's ready to go,\" Montemurro said of Kerr, who will play on home soil for the first time in two years.\n\"There was always a period where she was going to be basically offloaded or rested because she's come back from a long time out.\n\"Chelsea have been great and we've been monitoring it.\"\nGrant will continue her recovery with Spurs and has been replaced in the Matildas' squad by Brighton & Hove Albion's Charlize Rule, whose last cap came in December 2023.\nManchester City starlet Mary Fowler and now Grant are the only must-picks unavailable for the matches on November 28 and December 2.\nFowler is expected back from her own anterior cruciate ligament injury after Christmas.\nWith their clashes against the Kiwis taking place in their penultimate international window, Montemurro has mostly settled on the team that will vie for glory at the Asian Cup on home soil in March.\n\"There will be a little bit of tinkering but mainly stabilising,\" Montemurro said.\n\"We did stabilise the squad in (recent matches in) the UK, which was really important.\n\"But I have to look at different alternatives and different situations to prepare for the tournament ... maybe tinkering with a different type of attacking scenario.\"\nFriday marks 100 days until the first match of the Asian Cup, which will be played in Australia for the first time since 2006.\nThe Matildas will kick off their campaign against the Philippines in Perth on March 1, before taking on Iran and heavyweights South Korea.\n\"There is the expectation to lift the trophy,\" Montemurro said.\n\"We're home and we're in a good space. I'd like to think that that's our goal.\"\nAustralian Associated Press",
  "word_count": 441,
  "scraped_at": "2026-02-14T02:03:26.527136",
  "_text_extracted": true
}