{
  "article_id": "803b56919eb2",
  "url": "https://www.90min.com/chelsea-confirm-world-record-transfer-naomi-girma",
  "title": "Chelsea confirm world - record transfer for Naomi Girma",
  "date": "20250126T154500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea confirm world-record transfer for Naomi Girma\n- Chelsea signed Naomi Girma from NWSL outfit San Diego Wave\n- The move for the 24-year-old centre-back shattered multiple records\n- Girma described the decision to leave the USA as \"an easy choice\"\nChelsea officially announced the arrival of US centre-back Naomi Girma on Sunday afternoon in a deal which is thought to be the most expensive in women's football history.\nNews broke earlier this week that the 24-year-old defender was poised to leave NWSL outfit San Diego Wave and join Chelsea for a fee of $1.1m (£890,000). No player in the history of the women's game has ever cost more, eclipsing the $860,000 (£690,000) the freshly founded US franchise Bay FC spent to snap up Racheal Kundananji from Madrid CFF in February 2024.\nChelsea already held the record for the most expensive transfer in Women's Super League (WSL) history, yet Girma's reported price tag is more than double the €450,000 (£384,000) it took to prise Mayra Ramirez away from Levante in January 2024.\n\"I'm so happy and really excited to be here,\" Girma told Chelsea's official website. \"It doesn't feel real.\n\"There are a lot of things about Chelsea that made me want to come here - the culture, the winning mentality, staff and players. It's a top environment to learn and grow in. Right now, that's what I'm looking to do. It was an easy choice for me.\"\nGirma was the top pick in the 2022 NWSL draft and won Olympic gold under the tutelage of Chelsea's legendary former manager Emma Hayes over the summer. Despite her all-encompassing impact, the Blues have scarcely skipped a beat since the revered English coach took over the US women's national team last year.\nChelsea's record-breaking recruit was presented to Stamford Bridge ahead of her new side's WSL clash with Arsenal on Sunday afternoon. Girma is joining a team under Sonia Bompastor which has romped to the summit of the league table and didn't drop a single point the Champions League group stage.\nThe club's buoyant head of women's football, Paul Green, was full of praise for the latest big-money move. \"Naomi is a world-class defender who is now coming into the prime years of her career,\" he gushed. \"Her composure on the ball, ability to read the game coupled with her pace and athleticism will add top quality to an already very talented squad.\n\"Naomi has showcased her talent in the NWSL winning various individual awards and delivered on the international stage for the USA, including this summer winning a gold medal at the Olympics.\n\"She is undoubtedly ready for this next step in her career and we are delighted it will be with Chelsea.\"",
  "word_count": 452,
  "scraped_at": "2026-02-14T02:11:27.600191",
  "_text_extracted": true
}