{
  "article_id": "8055df0501f4",
  "url": "https://theprideoflondon.com/chelsea-receive-triple-team-news-blow-before-maresca-s-big-game-01jcgaw12c7j",
  "title": "Chelsea receive triple team news blow before Enzo Maresca big game",
  "date": "20241112T191500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "According to a new report in the media on Tuesday morning, Chelsea Football Club might not be at full strength for their next game. The dreaded international break may cause some testing problems ahead of the Leicester City match. The latest team news emerging on the Blues suggests that the west London club could be slightly light of starters for that particular clash. CFC could have a to navigate a triple availability blow before Enzo Maresca's big game against his one-time employers.\nBut which three respective Chelsea squad members - the majority of whom are standouts - are at risk of missing the King Power Stadium fixture? Will the multiple potential absences affect the Chels side greatly? And which backup Blues will the Italian in charge at Stamford Bridge likely select as replacements? Meanwhile, we take a quick look at which Chelsea footballers possibly let the side down against Arsenal in the draw on Fulham Road this past weekend. Is there anyone Maresca should be angling to drop from the CFC starting lineup? And which understudies may deputise in their individual places, if any are applicable?\nFour Chelsea stars who didn't perform to the appropriate standard vs Arsenal on Sunday\nMaresca's team are now a firm fixture in the top half of the table, and are even in the in demand Champions League spots. This hasn't really been the case at the Bridge for a couple of years now. Although form and quality are both generally heading in the right direction presently.\nBut who wasn't good enough versus the Gunners in the recent intriguing but ultimately anticlimactic stalemate in the English capital? Well, Robert Sanchez, Malo Gusto, Cole Palmer and Noni Madueke all scored low in this match review.\nIn fact, the aforementioned quartet only rated as fives. Palmer had just recovered from a brief injury. Though he must show more in the tougher matches; the England international won't lose his place for the Foxes contest.\nSanchez is almost certain to continue as No.1 goalkeeper, if fit. Madueke is now on shaky ground with respect to Premier League starts. Gusto is in a similar situation to the winger of course, with Reece James and Marc Cucurella ready.\nBlues team news\nThis article claims that three regulars of the Chels roster will potentially be unavailable to face Leicester on November 23. Moises Caicedo, Nicolas Jackson and Enzo Fernandez are said to be doubts due to National Team representation:\n\"...the trip to the East Midlands has been scheduled for the dreaded Saturday 12:30pm kick-off slot on Saturday, November 23, leaving a tight turnaround for Moises Caicedo, Enzo Fernandez and Nicolas Jackson between fixtures. In South America, Caicedo's Ecuador play their second World Cup qualifier of the break against Colombia on Tuesday, November 19, with kick-off scheduled for 11pm UK time. Fernandez's Argentina kick-off against Peru an hour later at midnight on Wednesday, November 20, meaning both will likely make it back to London in time to restart club training on the Thursday - two days before the Leicester clash - whilst catching up to a new time zone. Jackson is in a similar situation, with far to travel after Senegal host Burundi in Africa Cup of Nations qualifying on November 19. That match begins slightly before the South American ties, at 7pm UK time, so the striker too would likely only return two days before the Premier League resumes. As he has rotated many times this season in different competitions Maresca knows full well he possesses a huge squad with talent to spare, but for a fixture with some personal weight to it he would hope to have his first-choice team ready to go.\"Leicester Mercury",
  "word_count": 613,
  "scraped_at": "2026-02-14T01:49:13.384042",
  "_text_extracted": true
}