{
  "article_id": "8056b3c402c9",
  "url": "https://theathletic.com/4534693/2023/05/25/naby-keita-liverpool-what-happened/",
  "title": "Naby Keita and Liverpool – what happened ? ",
  "date": "20230525T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was supposed to be a major transfer coup for Liverpool.\nBayern Munich and Barcelona were interested in signing Naby Keita from RB Leipzig after an impressive 2016-17 Bundesliga season in which he’d scored eight goals and contributed eight assists in 31 league appearances.\nLiverpool had two bids rejected in the summer of 2017 before then-sporting director Michael Edwards outflanked his rivals by agreeing a deal whereby Keita would stay at Leipzig for a further 12 months.\nAdvertisement\nThe fee of £52.75million ($65.3m), then a club record, meant that Liverpool were effectively paying a premium on top of the £48m release clause in his contract which could be triggered in 2018.\n- ‘Winning the transfer window’ is misunderstood – most big deals don’t pay off\n- Transfer targets for every team in the Premier League this summer\n- Premier League summer transfer window 2023: Confirmed dates\nJurgen Klopp described him as “the complete midfielder” and believed he had the perfect skill set to flourish at Anfield. The season-long wait for him only heightened the sense of expectation among excited supporters.\nWhen he finally arrived at Melwood in July 2018, Keita was greeted by former captain Steven Gerrard, who presented him with the No 8 shirt that he had selected. No one had worn that jersey since Gerrard’s exit three years earlier.\nFive years on, Keita is about to hand back that shirt after an underwhelming stint on Merseyside that will ultimately be remembered as a story of potential unfulfilled.\nAt the age of 28, he should be entering his prime. Instead, the fourth most expensive signing in the club’s history is preparing to leave as a free agent as Liverpool look to rebuild their midfield this summer.\nFew players in Liverpool’s modern era have polarised opinions quite like Keita. Was he dogged by misfortune or just not up to scratch? The Athletic has spoken to a variety of people around the club to build a picture of what went wrong, and why.\nThe first thing to say is that there is plenty of sympathy at Liverpool for the catalogue of injury setbacks that blighted Keita’s time on Merseyside.\nThere were many occasions when the midfielder looked ready to burst into life, only for another fitness issue to derail him. Rhythm was lost, momentum stalled, morale sapped.\nPlayers have different pain thresholds. On his Champions League debut for the club in October 2018, Keita was taken off on a stretcher after a collision with Napoli’s Jose Callejon and spent the night in Naples’ Cardarelli hospital.\nAdvertisement\nInitially, there were fears he had suffered spinal damage, such was the level of discomfort he was in. However, after a series of scans, he was given the all-clear and returned to Liverpool by private jet. Three days later, he played against Manchester City.\nHis lack of durability was an unwelcome surprise given the fact that he had featured in 58 out of 68 Bundesliga matches during his two seasons at Leipzig. Six of the 10 games he missed were due to suspension.\nWhy the dramatic change? Staff point to the challenge of adjusting to greater intensity and physicality than he was used to both in training and matches — something Keita admitted himself he struggled with.\nLiverpool left no stone unturned. Yoga, dietary changes and tweaking his training plan all had some impact on trying to reduce his soft-tissue muscle problems. Andreas Schlumberger, the club’s head of recovery and performance, worked closely with Keita following the former’s arrival from Schalke midway through the 2020-21 season.\nInjury issues kept him sidelined for longer than had initially been anticipated. There was a sense that so many setbacks damaged his confidence to really push himself.\nLast season, the Guinea international clocked up 40 appearances in all competitions having only managed 33 in 2018-19, 27 in 2019-20 and 16 in 2020-21. However, this term he’s been limited to just 13 outings (and just three starts in the Premier League).\nIn total, Liverpool have played 277 competitive matches since Keita arrived and he’s featured in just 129 of them (47 per cent).\n“Naby lad”, as he’s affectionately known by his Liverpool team-mates, has been a popular figure in the dressing room. He’s been known to dance after cherished victories and play practical jokes (hiding players’ possessions is one of his trademarks). His closest friend in the squad was Sadio Mane, and his departure to Bayern Munich last summer probably did not help him this term.\nAdvertisement\nYoungsters who were promoted to train with the first-team squad would often rave about Keita’s technical ability to academy staff and team-mates when they returned to their age group.\nBut it certainly took a long time for Keita — a shy, laidback character — to come out of his shell at Liverpool with the language barrier a recurring problem.\nIn early 2020, Mane was having breakfast with Keita at Melwood when one of the staff came over to inform the midfielder they were going to step up his rehab that morning with a light jog around the training field. Much to Mane’s amusement, Keita replied: “Yeah, yeah, I like eggs.”\nThere was another occasion when medical staff were chasing up scan results only to learn that he hadn’t been scanned at all after misunderstanding the instructions he had been given. A staff member returned to the private hospital with him.\nKeita based himself in a house in Formby, around 13 miles from Liverpool, but later also acquired a city centre apartment. He certainly found it difficult to settle on Merseyside after arriving with his younger brother Petit, who effectively looked after his older sibling. However, there’s a sense that he could have been more proactive in terms of making that process easier, especially when it came to learning English.\nThat also had an impact on understanding what Klopp and Pep Lijnders demanded from him tactically. At his best, he gave the midfield a welcome injection of energy and dynamism as he broke lines and provided creativity (he did, after all, score Liverpool’s fastest goal of the Premier League era, netting after just 15 seconds against Huddersfield Town in April 2019). His athleticism and ability to press and force mistakes impressed staff, but at times his work off the ball in tracking runners and blocking passing lanes was a weakness.\nGetting picked for the first leg of the 2019 Champions League semi-final away to Barcelona was a sign of his progress but he limped off with a torn adductor and missed the heroic second-leg fightback and the final triumph over Tottenham.\nAdvertisement\nThe following season, he scored in the Club World Cup semi-final win over Monterrey and started the final victory over Flamengo but once again his joy was shortlived as he suffered a groin strain soon after. He only started nine matches in the Premier League title-winning campaign.\nKeita suggested nobody had “seen the real Naby Keita just yet” towards the end of last season and, for all his hugely impressive medal haul of Champions League, UEFA Super Cup, Club World Cup, Premier League, League Cup and FA Cup, there is a sense among many Liverpool fans that nobody knows what the real Naby Keita really looks like.\nThere were discussions a year ago about the possibility of a contract extension, but they never progressed. As his role dwindled, it became increasingly clear that a parting of the ways would be best for all parties. There was no offer on the table. His future is unclear but a return to the Bundesliga, where he’s still widely admired, is viewed as the most likely next step.\nWith the jury still out on Darwin Nunez, Keita is the only big-money signing of the Klopp era who hasn’t given Liverpool a hefty return on their investment.\nAnalysing the football\nTo fully grasp the frustration of Naby Keita’s Liverpool career, we need to examine two matches at Crystal Palace which bookended his career at the club.\nThe first came in August 2018, a match which offered a snapshot of all the good things that the Guinea international had to offer, and helped explain why Liverpool had spent so heavily on him.\nLiverpool won the game 2-0 and Keita was at the heart of everything they did well. He controlled the tempo, was dynamic with his dribbling and progressive with his passing: just look at how many of his passes in the map below are forwards and in the Palace half…\nOne moment stood out in particular. Receiving the ball from goalkeeper Alisson facing his own goal, and with Andros Townsend closing him down, Keita nonchalantly flicked the ball past the midfielder to open the game up.\nAdvertisement\nHe drove into the space in front of him before delivering a pinpoint pass over the top to Mohamed Salah, who — very unlike him — could not apply the finish.\nIt was so easy, so effortless it was impossible not to get excited, especially as it followed his excellent debut in a 4-0 victory over West Ham to open the 2018-19 campaign.\nFast forward four and a half years, another trip to Selhurst Park offered sober confirmation of how far Keita’s star had fallen at Liverpool. There was little to recommend Liverpool’s performance in a 0-0 draw in south London, but Keita was arguably the worst of the bunch: he lost multiple duels, earned a yellow card for a desperate foul and was substituted at half-time by Klopp.\nComparing his passing that night to what he had delivered at Palace in 2018 is instructive…\nEven allowing for the fact that he played half the number of the total possible minutes in January, Keita produced a third fewer passes and had retreated into deeper, ‘safer’ areas, meaning he was far less progressive with the passes he did make.\nWatching those games feels like witnessing two different players. The question is, what happened?\nThere can be no doubt that injury problems played their part. The wear and tear of repeated muscle injuries add up and the spring and spark in those early performances have been difficult to replicate consistently: he has missed around 800 days at Liverpool due to injuries, according to data collated by premierinjuries.com.\nIt should be said that, statistically, Liverpool were a better team with him in it.\nThere are, of course, caveats. He was absent from the starting XI in nearly three times as many games while the difference in goals scored and conceded is minimal. Liverpool have been one of the most successful and dominant teams during Keita’s four years and it is tough to argue his absences were ever the key reason Liverpool’s results suffered.\nAdvertisement\nWhen Keita’s signing was first mooted, Liverpool thought they were getting a box-to-box, all-action midfielder who suited the high-intensity, chaotic, gegenpressing style Klopp was fine-tuning. But by the time he arrived, the team was transitioning to one looking to control games and dominate possession while complementing that with counter-pressing.\nThere were highlights. He started both games in Liverpool’s Club World Cup success and features in some of the club’s biggest and best wins under Klopp, such as the 4-0 victory over Leicester in 2019-20 and the 7-0 demolition of Crystal Palace in 2020-21.\nHe also scored the opener and provided an assist for Mohamed Salah in the 5-0 destruction of Manchester United at Old Trafford in 2021-22. However, his afternoon ended prematurely — not for the first time — through injury via a Paul Pogba challenge.\nMore recently, he started in both EFL and FA Cup finals as Liverpool completed the domestic double. His availability improved, too. He made 40 appearances and was named in 47 matchday squads out of 63 last season; this season, however, he has made just 13 appearances all season, and just eight in the league.\nKeita’s ability has never been in question. His 2021-22 scouting report on fbref, the football statistics website, shows a sea of green suggesting he was consistently above average in most metrics across the board. On form, he could carry the ball, pick a pass, block lanes and spot runs like few others.\nHis problem was a lack of pace and physicality, which in turn meant Klopp probably felt he could never quite rely on him for sustained periods. And when he was bad, he was very bad: Keita remains one of only two players to have been tactically substituted before half-time by Klopp (in the 3-1 Champions League quarter-final defeat to Real Madrid in 2021 – Dejan Lovren was the other, at Tottenham in 2017) and he was also hauled off at half-time in both that goalless draw at Palace and the 7-2 defeat to Aston Villa. He was far from the only problem in those games, but still found himself being sacrificed by Klopp.\nThe game that arguably defines his Liverpool career is his 45-minute display against Atletico Madrid in the 2021-22 Champions League group stage. After a bright start where Keita repeatedly disrupted Atletico, he scored a superb volley. However, he was dribbled past too easily in the build-up to both of Atletico’s goals before being taken off at half-time.\nThe biggest frustration lies with what might have been. Opportunities have slipped past — such as in the 2020-21 season when Klopp was forced to convert midfielders to centre-backs, or this term when he was never touted as a solution to Liverpool’s much-analysed midfield crisis. Youngsters such as Harvey Elliott, Curtis Jones and Stefan Bajcetic stepped up instead.\nAt 28, he should be approaching his peak and central to the new era of Liverpool’s midfield. It’s a tale of what might have been. He will not be the only one harbouring a sense of regret.\n(Top photo: Simon Stacpoole/Offside/Offside via Getty Images)",
  "word_count": 2295,
  "scraped_at": "2026-02-14T01:48:17.245311",
  "_text_extracted": true
}