{
  "article_id": "805cef9ad3fe",
  "url": "https://www.arsenalinsider.com/transfers/free-agents-arsenal-should-sign-as-club-confirm-two-deadline-day-exits/",
  "title": "Free agents Arsenal should sign as club confirm two deadline day exits",
  "date": "20230201T190000Z",
  "domain": "arsenalinsider.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal were one of the more busier Premier League clubs on deadline day after the signing of Jorginho and loan departures of Cedric Soares and Albert Sambi Lokonga, yet business can still be done for free agents.\nAs is the way in football, the closure of the transfer window brings forward light players who are still out of contract, with many top sides in Europe still in need of those few extra bodies to take their squads to the next level and to get their club over the line.\nWhilst Arsenal have recruited well this January, some fans would agree that one extra signing could have been concluded with the Gunners now looking fairly short in central midfield and in the right-back positions. Yet who could be signed from the free agent market?\nThree free agents Arsenal could sign\nSime Vrsaljko\nYou know the standard of free agents this year is strong when a recent World Cup finalist is on the list, and in the case of Arsenal, Croatia international Sime Vrsaljko could be an ideal short-term replacement for Cedric and a potential challenger for Ben White’s starting right-back spot.\nOnly 31-years-old and most recently at Olympiakos, the former Atletico Madrid star was once regarded as one of the best fullbacks in world football. And although Vrsaljko’s latest spell in Greece didn’t go to plan, the defender still has a lot to offer at the highest level.\nWith Takehiro Tomiyasu injury-prone and White somewhat struggling in recent matches, Vrsaljko could be an ideal free agent signing that can elevate Arsenal’s two main right-backs as well as provide some insurance for if either of the defenders are out on the treatment table.\nMiguel\nBy far the youngest player on this list, another surprise member of the free agents market this winter is Brazilian teenager Miguel, who until recently was a member of his nation’s famed U-17 squad and a regular for the Red Bull-owned RB Bragantino.\nAn attacking midfielder who had actually come through at Fluminese as a defensive midfielder, Miguel’s versatility at such a young age should make the teenager an alluring option for many top European clubs, with Arsenal, especially, a side who should consider the Brazilian.\nWith Lokonga leaving on loan and Mohamed Elneny out for an extended period of time, Arsenal simply need more numbers in their midfield ranks. And whilst Miguel would be an untested option, there is something exciting about a Brazilian prospect joining a club like the Gunners that will get fans pumped up.\nIsco\nFrom one midfield star in the making to one who has been there and done that, Isco ended deadline day by seeing his move to Union Berlin collapsing, leaving the five-time UEFA Champions League winner as a free agent following the closure of the January window.\nA player who is no stranger to links to a Premier League move, Isco is in need of a club where the right coach can drill into him the basics of what it’s like to be a top professional in the game, and Arteta could do just that for the former Real Madrid superstar.\nIndeed, it would take some time, but given Isco’s profile and how good the Spanish international was during his prime years, Arteta could be the one to unlock the midfielder’s new potential and to get the now-30-year-old playmaker back on his feet.",
  "word_count": 563,
  "scraped_at": "2026-02-14T01:59:41.726502",
  "_text_extracted": true
}