{
  "article_id": "8062adf79237",
  "url": "https://www.juneesoutherncross.com.au/story/8980839/record-breaking-psg-complete-champions-league-project/",
  "title": "Record - breaking PSG complete Champions League project",
  "date": "20250601T023000Z",
  "domain": "juneesoutherncross.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris has erupted with flares and fireworks, car horns and an Eiffel Tower glittering in blue and red to celebrate Paris Saint-Germain's first Champions League title.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe final in Munich was watched all over the French capital — including inside PSG's Parc des Princes stadium, which beamed the match on a giant screen — and Inter Milan getting blown away 5-0 prompted flashpoints and some arrests.\nMindful of any celebrations getting out of hand, as has often been the case in Paris during high-profile soccer matches, PSG forward Ousmane Dembele urged fans to show restraint amid their euphoria.\n\"Let's celebrate but without breaking everything in Paris,\" he told broadcaster Canal Plus.\nEarlier on Saturday, the club that was transformed by Qatari billions and bought and sold a succession of the world's greatest players in an extravagant bid to get to the top got their hands on the big one.\nEuropean club soccer's grandest prize that not even Lionel Messi, Neymar or Kylian Mbappe could deliver was finally claimed by Spanish coach Luis Enrique.\n\"It's in the bag, it's coming home with us to Paris tomorrow,\" Enrique said.\nFittingly, 19-year-old French forward Desire Doue, emblematic of the club's new generation, was the chief inspiration. He became the third teenager to score in a Champions League final, following Patrick Kluivert and Carlos Alberto.\nAchraf Hakimi, Khvicha Kvaratskhelia and substitute Senny Mayulu, the fourth teenager to ever score in a final added to Doue's double as PSG recorded the biggest win in a final in the Champions League's 69-year history.\n\"It is wonderful, it is magical, we are rewriting the history of this club and French football,\" Doue said.\nEach of the previous four finals held in Munich also produced first-time winners — Nottingham Forest in 1979, Marseille in 1993, Borussia Dortmund in 1997 and Chelsea in 2012.\nPSG had been a flashy contender that always came up short.\nThat all changed at Allianz Arena, the home of Bayern Munich whom they lost their only other Champions League final in 2020 to in an empty Lisbon stadium where fans were locked out because of the pandemic.\nOn this occasion, thousands of PSG supporters were there to revel in the moment, waving flags, lighting flares and drowning out their rivals from Inter, many of whose supporters left the stadium long before the final whistle.\nIt took just 12 minutes for the French champions to go ahead when Vitinha's threaded pass into the box found the feet of Doue. The forward could have shot, but instead slid in former Inter player Hakimi to tap into an open net.\nEight minutes later and the lead was doubled as Doue's shot from the right of the box deflected off Federico Dimarco and past Inter goalkeeper Yann Sommer.\nHe got his second in the 63rd, sliding the ball into the bottom corner when through on goal.\nKvaratskhelia added a fourth 10 minutes later and Mayulu then found the back of the net in the 86th, just two minutes after coming on.\n\"We need to learn from defeats and come out stronger,\" Inter boss Simone Inzaghi said.\n\"This hurts like the Istanbul final (2023 defeat to Manchester City).\n\"Paris deserved to win this game and the trophy. We're disappointed, but the path to this point was great ... We didn't win a trophy, but I am proud to be their coach.\"\nAustralian Associated Press",
  "word_count": 575,
  "scraped_at": "2026-02-14T01:52:26.356817",
  "_text_extracted": true
}