{
  "article_id": "806c43ca1101",
  "url": "https://metro.co.uk/2025/07/27/top-48m-defender-asks-to-be-left-out-of-match-after-agreeing-transfer-deal-with-chelsea-23765297/",
  "title": "Top £48m defender asks to be left out of match after agreeing transfer deal with Chelsea | Football",
  "date": "20250727T221500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jorrel Hato asked to be left out of Ajax’s squad to face Como 1907 this weekend after agreeing personal terms with Chelsea, according to reports in the Netherlands.\nChelsea have splashed the cash across another busy transfer window, sealing deals for Jamie Gittens, Joao Pedro, Liam Delap, Dario Essugo and Mamadou Sarr for a combined fee of around £190million.\nDespite already strengthening at the back with the addition of Sarr from Strasbourg, the Blues have set their sights on making Hato, 19, their next signing and talks with the full-back’s camp have been advancing at a pace in recent days.\nHato, who is comfortable operating at both left-back and centre-back, has welcomed the interest from Chelsea and the versatile Dutchman is said to be actively pushing to force through a transfer to Stamford Bridge.\nBut while Hato has informed Ajax that he wants to leave, the Eredivisie outfit rejected Chelsea’s opening bid and sent a counter offer back to west London for the teenager.\nWith talks ongoing, Algemeen Dagblad report that Hato told Ajax head coach John Heitinga that he would ‘rather not play’ in the side’s Como Cup final defeat to Como on Sunday.\nIt’s claimed this is ‘entirely related’ to his potential move to Chelsea, though ‘that doesn’t say anything about the status of negotiations, which are currently difficult’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHato was also absent for Ajax’s semi-final win over Celtic earlier in the week. However, Heitinga insisted this was because the defender was yet to gain full match fitness having only recently returned to training.\nAjax are said to be holding out for a fee of between €55-60million (£48-52.5m) for Hato, who still has three years remaining on his current contract in Amsterdam.\nSpeaking to De Telegraaf on Wednesday, Hato’s agent, Humphry Nijman confirmed that Chelsea had opened discussions to close a deal for last term’s Eredivisie Talent of the Season.\n‘Yes, the club [Chelsea] have contacted Ajax,’ he told the Dutch newspaper.\nHato featured 50 times for Ajax across the 2024/25 campaign and played a key role as the club narrowly missed out on the Eredivisie title after finishing just one point behind PSV Eindhoven.\nIn an interview with Ajax’s official website last month, Hato outlined the goals and ambitions he hoped to fulfil in his career.\nAt the time, the Netherlands international was keen to stress that he felt at ‘home’ at Ajax.\nMore Trending\n‘The smartest thing is to look ahead to pre-season, that’s what I do,’ Hato said.\n‘Of course you want to achieve things in the end: the Champions League, a World Cup and a European Championship, I still have plenty of time. I don’t think I absolutely have to win the Champions League in two years.\n‘In the Dutch league, you have to show how good you are against the big clubs. Ultimately, I have to continue to develop the things I am already good at, so that it becomes top.\n‘How do I describe my time at Ajax? Ajax is home for me. I just feel at home here.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Newcastle United striker Alexander Isak rejects £96m transfer offer after Liverpool talks\nMORE: William Saliba provides major update on Arsenal future amid fresh Real Madrid transfer links\nMORE: Ruben Amorim explains why Man Utd fans must wait for Bryan Mbeumo debut",
  "word_count": 624,
  "scraped_at": "2026-02-14T01:49:44.673018",
  "_text_extracted": true
}