{
  "article_id": "806c47631bee",
  "url": "https://www.heraldscotland.com/news/23594844.rangers-coach-right-dream-stints-denmark-ghana/",
  "title": "Rangers coach has the Right to Dream after stints in Denmark and Ghana",
  "date": "20230617T080000Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The difference between a need and a want is not lost on Cameron Campbell. He knows, though, that everyone has the right to dream.\nThe elite environment of Auchenhowie - with its pristine pitches and all the fitness equipment and analysis technology that any player could ask for - offer perspective for Campbell as well as inspiring him. He has seen those who have it all as well as those who have nothing and his outlook has been shaped - both personally and professionally - by experiences of each situation.\nCampbell has just rounded off his third season at Rangers. It has been another fulfilling one for the Under-18s Lead coach, albeit one which ended in disappointment as his side lost an eleven-goal thriller to Celtic in the Scottish Youth Cup final at Hampden.\nREAD MORE: In profile: John Bennett's rise from Glasgow investor to Rangers chief\nRangers is not the first Scottish club that Campbell has worked for. He spent five years earning his stripes at Aberdeen after graduating from Robert Gordon University, but it is his stints in Ghana and Denmark that stand out on his CV to date and are the obvious ones to look into.\n\"The natural one people speak about was Ghana, where there was a lot more poverty and it was very different,\" Campbell said of his time at Right to Dream, an academy structure that was founded in the Eastern Region of the African nation more than two decades ago. \"We say that players in those kinds of countries need to become football players, whereas players in Scotland, if it doesn’t work out they can go to university or get a job.\n\"They can still have a good life and make a career for themselves in different avenues, which is brilliant. That is something we promote at Rangers and we make sure the players have got options for their careers.\n\"In Ghana, due to the limited options, there is a real need and desire from a young age that they will do anything they possibly can to make it as a professional football player. You then combine that with how they grow up, their environment.\"\nFrom the humble beginnings, Right to Dream has allowed countless kids and coaches to aspire and to achieve. Founded by Tom Vernon, the former Manchester United head scout in Africa, it is a club that has certainly influenced Campbell.\n\"They are playing with rolled up socks as a ball on dirt streets rather than pitches,\" Campbell said of those who start out with only a love of the game. \"They are playing bare foot so their touch develops so much quicker. They are unbelievable in one-on-one situations.\nREAD MORE: Explained in five minutes: Rangers' Lowland and Conference League plan\n\"Because there are no pitches, there are no goals so it is not a case of World Cup Doubles like we played down the park as a youngster. They just do one-v-ones and it is about skills and street games. That develops a different kind of football player.\"\nOne of those players, Mohammed Kudus, will be unfortunately familiar to Rangers supporters after he scored in both of their Champions League defeats to Ajax. Kamaldeen Sulemana, now of Southampton, is another that Campbell worked with in a system that expanded into Egypt as well as Denmark and will soon have a presence in the United States.\n🇬🇭 Mohammed Kudus vs Rangers\n— Owuraku Ampofo (@_owurakuampofo) September 7, 2022\nSuperstar ⭐pic.twitter.com/643FdveYFg\nThe opportunities provided for kids who have nothing but a raw talent and an infectious enthusiasm is unmatched. As their skills develop, so do the questions that they ask of those who are guiding them. That is true no matter the country or the conditions.\n\"I was exposed to working with real top, elite players at 13, 14, 15 and that challenged me as a coach to try and maximise my development and take on new challenges,\" Campbell said. \"Every time you step on the pitch as a coach, your job is to try and make those players in front of you better.\n\"If you are working with some top, top players then that challenge is harder. But it is an exciting one and one that makes you happy to drive into work in the morning and go ‘right, what am I going to do with these boys today?’ I had to make them better.\nREAD MORE: Alex McLeish on Beale recruitment, Rangers requirements and Ange exit\n\"When Rangers offered me a job, I definitely couldn’t say no to one of the best clubs in the world.\"\nThe time spent in Ghana was not Campbell's only position away from home. One of the Right to Dream partner clubs, FC Nordsjælland, also provided him with the platform to expand his horizons as a man and a coach.\nThe focus on teamwork and the approach to schooling in Scandinavia quickly became evident to Campbell. Culturally and socially, he found FC Nordsjælland, who now play at Right to Dream Park in Farum, to be an education in more ways than one.\n\"He almost treated it like American Football, he tried to have a play book for every phase and every scenario,\" Campbell says of Flemming Pedersen, a 'revolutionary' thinker on the game and the man that is a former boss and now technical director of the Danish Superliga club.\n\"There is a well known phrase in football that you hear over here that the same game never happens twice and everything is different.\n\"He believes the opposite and that the game is just a repetition of movement sequences and patterns of play. They trained it like that, which was really interesting to see and it gave me a different experience and a different outlook and perspective on how you can coach football.\"\nThat process has always been Campbell's passion. He describes his talents as 'modest' in terms of playing and believes he wasn't cut out to operate at League Two level here.\nHe developed a love for coaching at 18. He embraced it and is now 'obsessed' with that side of the game as he forges his own path that will, as he has shown already, take him wherever it takes him.\n\"I am very much one game at a time,\" Campbell said. \"There is a dots theory that I learned about a few years back and it is the most true thing in my life.\n\"It is only easy to connect your dots when you look back. Life should be about collecting as many different dots in terms of experience, knowledge, networks and people and then everything happens for a reason.\nREAD MORE: Kenny Miller pinpoints key qualities for revamped Rangers attack\n\"The one thing I do know is that I love being on the pitch so I would like to remain in coaching. I don’t ever see myself being a head of academy or anything like that.\n\"My passion and what I love doing is working with players day in day out on the pitch and trying to make those individuals better.\"\nThe time on the grass is when Campbell is at his happiest. He counts one of his proudest moments as the closing stages of the Premiership win over Hearts just days before Seville as several Auchenhowie kids earned their first team debuts for Giovanni van Bronckhorst.\nThe likes of Leon King, Adam Devine and Alex Lowry are the most recent examples for the next generation to follow. Campbell will play his own part in making them whatever they will become.\n\"I love the age group I am working at now in terms of that 16-19 age group where they are just becoming professionals,\" Campbell said.\n\"They are still sponges for information, have got loads to learn but are at a level where they are trying to make it and go from being an academy player to a full time player.\n\"All the different emotions and things that go with that, I find that a really enjoyable challenge working with players on their journey.\n\"If I could choose to do anything, I would like to remain in a role like this for as long as I can. As you know in football, you never know what is round the corner.\"\nThe same can be said for the youth department as a whole. The new season will provide new openings for those that have the talent and the mentality to make the most of them, either as part of Michael Beale's squad or the various groups that lead into the B Team.\nCampbell is enthused by what Rangers have achieved individually and collectively in recent seasons. He is even more excited about what could come as Rangers continue to invest - both in terms of time and money - into the Auchenhowie system and the future.\n\"People will view success in different ways,\" Campbell said. \"Whether you are measuring it on transfer sales, which we have done and will continue to do, measuring it on how many players are gaining minutes in the first team or team success in terms of the 18s winning the league or Youth Cup, the 19s competing in the UEFA Youth League.\n\"There are positives there. There has been success and hopefully there is more to come.\n\"You look at the size of the club and the success of winning title 55 and being in the Europa League final. It helps showcase that and then players like Nathan Patterson and Leon King, who had the most minutes for a player in the Champions League, players now see that pathway that we have created at the club and Rangers is a club that players want to go to. That helps us massively.\"",
  "word_count": 1625,
  "scraped_at": "2026-02-14T01:50:37.807270",
  "_text_extracted": true
}