{
  "article_id": "80c2b93195bc",
  "url": "https://www.bbc.com/sport/football/articles/ce864jlj181o",
  "title": "Man City 4 - 1 Borussia Dortmund : Does Phil Foden deserve England recall ? ",
  "date": "20251106T020000Z",
  "domain": "bbc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "'Everyone knows his quality' - does Foden deserve England recall?\n- Published\nPhil Foden enjoyed a night to remember at the Etihad as he sent Manchester City and England fans a timely reminder of his star qualities.\nBoth he and the club suffered a disappointing campaign last term - City failed to win a major trophy for the first time in eight years, while the midfielder revealed struggles with off-field issues and injury.\nBut Foden appears to have put those problems behind him, impressing his manager, supporters and pundits with performances that signal he may be returning to his best.\nWith classy displays and four goals and three assists in 13 games, the 25-year-old will have a close eye on Friday's England squad announcement for the World Cup qualifiers against Serbia and Albania on 13 and 16 November.\nA starring role in Wednesday's 4-1 Champions League win over Borussia Dortmund - taking the attention away from Erling Haaland for once this term - will no doubt have improved his chances of a recall.\n\"I'm loving it,\" Foden told TNT Sports. \"I just need to play with a smile on my face, which I'm doing. Last year was tough, not just for myself but for everyone.\n\"There is a new togetherness this season and you can tell. Dortmund caused us some problems, they are a great team, but we stuck to the plan and broke them down with our talent up front.\"\nHe 'can be the difference'\nWhile Norwegian Haaland's remarkable scoring feats in this campaign - 27 now for club and country - have hogged the headlines, Foden is a key part of that \"talent up front\".\nHaving been left out of the past two England squads - and not making himself available for the camp before that - he faces a tough task of getting back into Thomas Tuchel's set-up.\nJude Bellingham - also hoping for a return after a shoulder injury - and Morgan Rogers are rivals for the number 10 role - the position where boss Pep Guardiola feels Foden feels happiest.\nFor City, he has stepped out of the shadow of Kevin de Bruyne, who departed the club in the summer as a legend, while injuries to Omar Marmoush and Rayan Cherki at the start of this campaign allowed him to make the spot his own.\nAfter a poor start, Guardiola's men have lost only one of their last 13 games in all competitions and Foden has featured in 12 of those, having put his hand up to play - \"a sign he is ready\" according to his manager.\nAsked whether Foden deserved to be back in the England reckoning - especially with next summer's World Cup on the horizon - Guardiola said: \"Thomas is so smart and wise and knows exactly what the national team needs - and I think Thomas knows Phil perfectly.\n\"There is no person in this country, no-one around the world, that doesn't know his quality and ability, but England are so lucky to have an amount of good players in this position, there are a lot.\n\"That is why Phil has to push himself to be better and better, because when he is going to be called up, [he will] say, 'OK, I'm going to show how good I am'.\"\nThe sight of Foden in full flow, creative and scoring delightful goals like the two against Dortmund, has delighted Guardiola and the City faithful, who adore their local hero.\nHe has admitted trying to get himself \"mentally right\" after the difficulties of last season.\nIn the previous 2023-24 campaign, Foden netted 27 goals in all competitions, including 19 in the Premier League as City won an unprecedented fourth title in a row.\nIt earned him the Player of the Season and Football Writers' Association Footballer of the Year awards, as well as being named in the PFA Team of the Year.\nFoden started all seven games too as he helped England reach the final of the European Championship in July 2024, where they were edged out by Spain 2-1.\nBut if he is left out by Tuchel again, it will lead to concern about adding to his 45 caps and playing in football's showpiece international tournament.\nFormer City and Tottenham midfielder Michael Brown has no doubt as he told BBC Radio 5 Live: \"I think we have got to look at Foden for England - the full Foden in form, who can be the difference.\n\"Someone who is mature, who wants it and cool in tight situations. I think he is now at the level to go back into the squad and to push for the manager. He will take on that challenge.\n\"He is like a big kid when it comes to football, he wants to play and have a ball at his feet. As a manager it was about supporting him and getting on to the pitch in the right position and he has now found it.\n\"He has to go into the England squad.\"\n'I would say he is already there'\nFoden endured a slow start to the campaign after an ankle injury, featuring in only 15 minutes of action before the September international break.\nDespite a fear of being on the sidelines again, he scored in the 3-0 derby win over Manchester United and provided a delightful pass for Haaland's goal in a Champions League victory over a Napoli side featuring De Bruyne on his return to the Etihad.\nFoden then played a starring role in the Carabao Cup third round success at League One Huddersfield, but it was the dazzling display against Dortmund that has put him back in the spotlight.\nHis prowess from outside the area with his double was evident again, having now scored 11 goals from such positions since the start of the 2023-24 campaign - more than any other Premier League player during that period.\n\"I would say he is already there [back to his best form],\" boss Guardiola told TNT Sports. \"He does not need to get closer. He is already there. It is true we have missed goals and he got two incredible goals.\n\"How many times have we seen that from Phil, right? The generosity with the effort but also with the quality in the final third. We missed it a lot. I'm happy three more players scored goals - and not just Erling.\"\nTactical analysis: Foden profits from finding pockets\nFormer Everton and England midfielder Leon Osman told MOTD: Uefa Champions League: \"Dortmund allowed City to pass into the pocket of space in front of their defence all night, and Foden was the player who profited the most from it.\n\"In the first half, City rotated the player getting on the end of that pass quite well, and it was either Foden or [Tijjani] Reijnders getting forward and coming into those spaces, like Foden did for their first goal, or Haaland coming deep.\n\"It's how City want to play, because you know where they want to get on the ball... and Dortmund let them do it. That could have been because City have got two wingers so high up, Dortmund were keeping five defenders back to deal with them and Haaland, and leaving space for Foden and Reijnders to arrive into.\n\"It was the same with Foden's second goal. Again that was down to him finding space in the pocket again, just outside the area. None of the Dortmund players went in to challenge him.\"",
  "word_count": 1248,
  "scraped_at": "2026-02-14T02:03:26.536118",
  "_text_extracted": true
}