{
  "article_id": "80d9dbf85afa",
  "url": "https://www.justarsenal.com/opinion-england-women-take-a-stand-by-refusing-to-take-the-knee-and-it-matters/396938",
  "title": "Opinion : England Women Take a Stand by Refusing to Take the Knee , and It Matters",
  "date": "20250724T154500Z",
  "domain": "justarsenal.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Just as we were discussing the apparent rise in racism online and in stadiums across the UK, England’s Women’s team made a bold statement before their semi-final against Italy by choosing not to take the knee.\nThis was in response to the racial abuse aimed at Jess Carter on social media, abuse that mirrors the treatment some of the men’s team received after Euro 2020.\nThe European Championships is meant to showcase the best of football on the continent. Yet once again, the headlines are marred by racism. That police investigations into online hate have become expected during major tournaments says everything. It is no longer shocking that, inside football’s echo chamber, some individuals still feel emboldened to hide behind a screen and spout hate.\nWhat message does UEFA want to send?\nIt is not a good look for UEFA that the Lionesses have chosen this stage to abandon taking the knee. This is an organisation that claims zero tolerance toward discrimination. But if that were truly the case, why are we still having these conversations? Why are social media platforms still being urged to monitor their content?\nYes, there has been progress, you can now be charged for what you post. But legal action alone is not enough. If UEFA’s president stands on the podium this weekend handing out medals, celebrating the growth of women’s football, should he not also be ensuring the players driving that growth are protected?\nWhere are the sanctions and safeguards? The players’ profiles are growing. Leah Williamson and Alessia Russo are two of the first names Adidas turn to for marketing. After lifting the trophy at Wembley in UEFA Women’s Euro’s 2022, these women are more than footballers – they are brands.\nThat’s why refusing to take the knee can be viewed in different ways, depending on your perspective. But in a squad known for its unity, I find it powerful. If one player is targeted, they all stand together.\nThe gesture has changed but the message is louder than ever\nWomen’s football in the UK is thriving. The nature of the Lionesses’ performances against Sweden and Italy will only boost that growth. But as visibility increases, so too will the hate.\nWhat I admire most is how this squad understands its growing influence. Choosing not to take the knee at a Champions League semi-final or a WSL match might go unnoticed. But doing it at the European Championships, with the world watching, makes the message impossible to ignore.\nThe Lionesses are actually one of the last squads still performing the gesture. Premier League clubs initially took the knee collectively but then stepped away, reducing it to one designated weekend per season. Even then, individual players are given the choice to opt out.\nIt has become a classic example of actions speaking louder than words. UEFA and FIFA are happy to roll out hashtags and slogans every few months, to place armbands and banners in front of the cameras. Charities want players like Chloe Kelly as the face of their campaigns.\nBut for many, taking the knee had become empty, like shouting into a void.\nBy not taking the knee, the Lionesses have sparked real discussion. They have reminded everyone that the problem persists, and that it needs more than symbolic gestures.\nI still believe the biggest deterrent is education. That racism should result in jail time. That names should be released, and people held publicly accountable. Only then will the message start to stick.\nHad the Lionesses followed protocol and taken the knee, maybe this article would never have been written. But by standing up, together, they’ve forced the conversation.\nThey’re champions in more ways than one..\nLove to hear your thoughts in the comments.\nDan Smith\n__________________________________________________________________________________________\nADMIN COMMENT\nSo here are some simple rules which I must insist commenters follow….\nYou agree not to give any personal abuse to other Arsenal fans. Everyone is allowed to hold their own opinions even if you disagree with them. It COSTS NOTHING TO BE POLITE TO OTHER ARSENAL FANS.\nCALLING ALL ARSENAL FANS! Anyone who would like to contribute an Article or Video opinion piece on JustArsenal, please contact us through this link…",
  "word_count": 699,
  "scraped_at": "2026-02-14T02:09:18.636276",
  "_text_extracted": true
}