{
  "article_id": "80dcc1c8a9c6",
  "url": "https://edition.cnn.com/europe/live-news/russia-ukraine-war-news-04-12-23/h_f507d23555bf7c17e4f15cd5fec95f13",
  "title": "Serbian government denies it sold weapons to Ukraine",
  "date": "20230412T161500Z",
  "domain": "edition.cnn.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The upper chamber of Russia’s parliament, the Federation Council, has voted in favor of the electronic delivery of military call-up papers, which critics say will make it more difficult for Russians to evade conscription.\nThe final step is for the bill to be signed by President Vladimir Putin before it officially becomes law.\nOnce the bill becomes law, a person will be considered notified even if they have not seen the call-up papers or email. The call-up papers will be deemed to be served once they appear on a government portal called Gosuslugi — the main online platform for state services in Russia, such as making a doctor’s appointment, requesting a passport or registering for marriage.\nPreviously, conscription documents in Russia had to be hand-delivered by the local military enlistment office or through an employer.\nThose liable for military service will be banned from traveling abroad, the proposed legislation published on the government’s website said. Draft dodgers will receive a travel ban from the day when the summons is considered to have been “handed” to them, in accordance with the law.\nPeople who fail to show up for a military summons without a valid reason within 20 days will face restrictions, such as being unable to register a vehicle and drive it, being unable to register an apartment, being unable to register as an individual entrepreneur or as self-employed, and be blocked from getting a loan.\nPaper and electronic summonses will have equal legal force, Andrey Kartapolov, head of the State Duma Committee on Defense, said to the RBC TV channel. According to Kartapolov, the introduced changes apply to all those liable for military service and not just to conscripts, he told state news agency TASS.\nRussia’s Defense Ministry routinely conscripts men for compulsory military service twice per year, in spring and autumn.\nThe spring conscription this year will apply to 147,000 citizens between the ages of 18 and 27, and will take place from April 1 to July 15, according to an official document published by the government.\nMore context: The Kremlin has consistently denied rumors of a possible second wave of mobilization in Russia. Its “partial mobilization” last year for its invasion of Ukraine resulted in a significant number of citizens fleeing Russia.\nConscription involves the selection and enlistment of young men into the military, while mobilization refers to the larger-scale process of calling up reservists and other military personnel in the event of an emergency or war.",
  "word_count": 410,
  "scraped_at": "2026-02-14T02:24:37.523504",
  "_text_extracted": true
}