{
  "article_id": "80f224b8e548",
  "url": "https://tribune.com.pk/story/2516111/pachuca-edge-al-ahly-to-face-real-madrid-in-fifa-intercontinental-final",
  "title": "Pachuca edge Al Ahly to face Real Madrid in FIFA Intercontinental final",
  "date": "20241215T093000Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pachuca edge Al Ahly to face Real Madrid in FIFA Intercontinental final\nThe Mexican side now prepare for a monumental challenge in the final at Lusail Stadium.\nPachuca clinched a dramatic 6-5 victory on penalties against Al Ahly after a goalless 120 minutes to advance to the 2024 Intercontinental Cup final.\nThe tense semi-final unfolded at the 974 Stadium in Doha, where both sides showcased resilience but failed to find the net during regular and extra time.\nThe match was an evenly contested battle, with Pachuca relying on their swift attacking play and Al Ahly demonstrating defensive solidity.\nDespite numerous chances, the deadlock persisted, forcing the game into a penalty shootout.\nIn the decisive shootout, Pachuca displayed nerves of steel, converting six penalties to Al Ahly’s five. Carlos Moreno, Pachuca’s goalkeeper, emerged as the hero by saving the crucial penalty that secured the Mexican side’s place in the final.\nWith this victory, Pachuca now look ahead to a historic challenge against Real Madrid on December 18 at the Lusail Stadium in Doha.\nThe Mexican team will aim to make history by toppling the 14-time UEFA Champions League winners and lifting the prestigious title.\nThe final promises to be a captivating encounter as Pachuca, a rising force in international football, seeks to expand their legacy against one of the sport's most decorated teams.\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 246,
  "scraped_at": "2026-02-14T02:08:26.310482",
  "_text_extracted": true
}