{
  "article_id": "80fc856e9a06",
  "url": "https://www.caughtoffside.com/2025/06/04/tijjani-reijnders-transfer-man-city/",
  "title": "Tijjani Reijnders transfer : Man City bid accepted by AC Milan",
  "date": "20250604T110000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City have reportedly reached an agreement over the signing of AC Milan midfielder Tijjani Reijnders for €75m.\nThat’s according to Alfredo Pedulla for Football Italia, with the journalist stating that Reijnders is set to earn €8m a year at the Etihad Stadium.\nThe Netherlands international shone during his time at Milan and is now expected to become Kevin De Bruyne’s replacement in that creative role in Pep Guardiola’s side.\nThis follows Reijnders contributing an impressive 15 goals and five assists for Milan in the season just gone, according to the Italian football news outlet.\nManchester City on the verge of signing Tijjani Reijnders\nThe report states that Man City are on the verge of signing Reijnders, in what could end up being one of the most exciting signings of the summer.\nThe Premier League giants are also working on some other major deals, according to Fabrizio Romano on X earlier today.\nSee below for updates as City also look to land Rayan Cherki from Lyon and Rayan Ait-Nouri from Wolves…\n?? Understand Manchester City and Rayan Cherki have reached an agreement on personal terms!\nOfficial bid from Manchester City to OL will be submitted in the next hours…\n…in order to advance after initial club to club talks starter over the weekend. pic.twitter.com/XNIY9skZQp\n— Fabrizio Romano (@FabrizioRomano) June 4, 2025\n?? Manchester City are advancing on Rayan Aït-Nouri deal after initial talks taking place with Wolves.\nNext steps to follow in the upcoming days after player’s green light reported over the weekend. pic.twitter.com/YA7siH8F1r\n— Fabrizio Romano (@FabrizioRomano) June 4, 2025\nCan Manchester City bounce back next season?\nCity were disappointing in 2024/25, and it looks like they’re determined to bounce back next season with a strong start to the summer.\nGuardiola’s side couldn’t win a fifth Premier League title in a row, slipping to third in the table, while they also didn’t progress much in the Champions League, and surprisingly lost the FA Cup final to Crystal Palace.\nOmar Marmoush joined in January and looks a fine signing, but it’s clear that further changes will be needed to help get MCFC back to their dominant best again.\nReijnders looks a particularly exciting addition to Guardiola’s squad, and one imagines Cherki and Ait-Nouri could also have a strong impact.",
  "word_count": 379,
  "scraped_at": "2026-02-14T01:52:26.348541",
  "_text_extracted": true
}