{
  "article_id": "811bdf91123d",
  "url": "https://www.managingmadrid.com/managing-madrid-editorials/78662/road-to-madrid-part-ii-the-planet-of-valdebebas",
  "title": "Road to Madrid - Part II : The Planet of Valdebebas",
  "date": "20250807T173000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In the first part of this series, I wrote about the food, the city, and the overwhelming presence of the Santiago Bernabéu. But for those who work around Real Madrid daily, their real cathedral lies northeast of the capital—in the sprawling, sun-soaked fields of Valdebebas.\nRoad to Madrid - Part II: The Planet of Valdebebas\nA behind-the-scenes journey through the serene and surreal world of Real Madrid City.\nFriday, March 28, 2025. I had made a small detour to Cibeles Plaza earlier that morning—something I covered in Part I—before hopping on the earliest train bound for Valdebebas. Madrid’s Zone T pass makes even the farthest corners feel accessible, but door-to-door from central Madrid, Valdebebas is not exactly a breeze. Though it’s a short drive, the reality of switching metros and longer distance trains and waiting on platforms meant it took me roughly 35 to 40 minutes, with the final train ride lasting no more than 15.\nChief editor at Managing Madrid, Lucas Navarrete, told me to arrive in Valdebebas at 10 am—an hour before training starts. I tend to arrive early for anything that matters. And this mattered. But on this particular occasion I arrived comically early.\nI was standing before the Real Madrid Administrative Office in Valdebebas around 8.30 am—long before the press pass desk opened. The official assigned to distribute the passes hadn’t arrived yet. But the security welcomed me graciously and allowed me to wait in the lobby. The lobby felt more like a luxury office than a football facility.\nOne by one, club staff began filtering into their offices. Around 9:30 am, a woman approached me, amused.\n“Didn’t Lucas tell you to come at 10?” she asked.\n“He did. I got here a bit early,” I replied. She handed me my press pass.\nReal Madrid City is massive—a self-contained world of football and professionalism. From the administrative building to the media entrance is a very long walk, one that cuts across the player entry road. A small group of fans had already gathered at the gates, hoping for a glance, a wave, an autograph. Players began driving in, one by one. It wasn’t one of those autograph mornings, but most players offered a wave or a thumbs-up.\nI reached the gate to the media area just before 10 am. Security informed me it wouldn’t open for another 45 minutes. I soon found myself joined by other journalists and camera crews—familiar badges from ESPN, AS, and others. Eventually, the gates opened.\nThe walk inside was beautiful. The pathways wind past age-group training pitches, young players already deep into drills. In the distance, I saw the Estadio Alfredo Di Stéfano, Real Madrid Castilla’s home—the same stadium where the first team lifted the 2019–20 La Liga title, and where they spent the entirety of the 2020–21 campaign under Zinedine Zidane. This stadium has a pitch identical in size to the one at the Bernabéu.\nUp the elevator, I arrived in the press room—surreal in its own right. The press room is huge. That familiar backdrop behind Carlo Ancelotti during interviews, covered in sponsor logos, was now in front of me. I took a few photos of the room while it was still empty. Journalists from other publications, Real Madrid University students, and camera crew were slowly filling the seats.\nA 15-minute window opened when the curtains of the press room were raised and journalists stepped out onto the balcony. It was a brief spell during which cameras rolled, broadcasters went live, and photographers captured the early rhythms of training. There was no tactical work happening—mostly rondos, warmups, and light drills. The goalkeepers went through their separate routines while Ancelotti conferred with his staff. After those 15 minutes in the sun, he curtains dropped again, journalists return to their seats. Real training had began.\nThe press conference didn’t begin until Ancelotti decided to pause training. Ancelotti entered the room flanked by a delegate. In person, he appears taller than expected—a quiet authority surrounds him. The perfect word to describe him in person is perhaps Aura. It was a pre-game press-conference, Ancelotti was in a light mood while answering questions.\nBecause I was covering La Liga and Copa del Rey matches, questions in the press conference were permitted only in Spanish. I couldn’t ask a question, but I had a front-row seat.\nMy second visit to Valdebebas a couple of days later, ahead of the Copa del Rey semi-final second leg vs. Real Sociedad felt more familiar. Like at the Bernabéu, the nerves had eased, slightly. On this occasion, I arrived right on time.\nA key takeaway from Valdebebas, everywhere—there were photos and tributes to the UEFA Champions League. Images of Raúl Gonzalez, Toni Kroos, Cristiano Ronaldo, Sergio Ramos and many more legends are framed on the staircases with one-word Spanish messages like caracter and orden. A collage of posters from all 15 Champions League winning finals is a magnificent flex to have inside your academy.\nJust like the Bernabéu, Real Madrid City at Valdebebas breathes European greatness. 15-time champions of Europe—and the place never lets you forget it.",
  "word_count": 848,
  "scraped_at": "2026-02-14T02:09:18.619190",
  "_text_extracted": true
}