{
  "article_id": "81305c3c203d",
  "url": "https://celtsarehere.com/prolific-celtic-target-may-await-in-champions-league-play%E2%80%91offs/",
  "title": "Prolific Celtic Target May Await In Champions League Play ‑ Offs",
  "date": "20250805T020000Z",
  "domain": "celtsarehere.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Strelec, the prolific Slovan Bratislava striker who was the subject of a rejected bid from the Hoops in January, is leading the Slovak champions’ charge in Europe and could be their biggest threat if they overcome Kairat Almaty in the third qualifying round.\nBack in January, Celtic reportedly tabled a £7.9 million offer for the 24-year-old, only for Slovan to knock it back as they chased a higher fee.\nThe timing and valuation gap saw the deal collapse, leaving Strelec visibly frustrated at the time. He has since admitted he has “moved on” from the failed switch, but his performances this season show exactly why Brendan Rodgers was interested in the first place.\nStrelec has been in lethal form during the qualifiers. In the second round against Bosnian champions Zrinjski Mostar, he struck three times over the two legs.\nThat included a clinical brace away from home in a 2-2 draw that sealed a convincing 6-2 aggregate win for Slovan. His pace, movement, and ability to finish with either foot have made him the focal point of Vladimir Weiss’s attack.\nThe 6ft forward is more than just a poacher. Comfortable dropping deep to link play, Strelec can stretch defences with clever runs in behind and has the aerial presence to trouble any backline.\nThat combination of attributes makes him exactly the kind of player Celtic will have to nullify if they end up meeting Slovan later this month.\nWith the first leg of the play-off confirmed for Celtic Park, Rodgers and his coaching staff will be watching Slovan’s tie against Kairat closely. Should the Slovakians progress, Strelec will be the man most likely to cause problems for the Hoops’ defence.\nFor all the disappointment back in January, Celtic might soon find themselves up against the very striker they once tried to bring to Paradise, only this time, the stakes will be a place in the Champions League league phase.",
  "word_count": 320,
  "scraped_at": "2026-02-14T02:11:49.092265",
  "_text_extracted": true
}