{
  "article_id": "8139ff773626",
  "url": "https://metro.co.uk/2026/01/01/john-terry-makes-admission-enzo-maresca-leaves-chelsea-job-25985983/",
  "title": "John Terry makes admission after Enzo Maresca leaves Chelsea job",
  "date": "20260101T174500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "John Terry says he was ‘completely shocked’ when Chelsea confirmed Enzo Maresca had left his role as manager by mutual consent.\nMaresca’s departure from Stamford Bridge was announced on New Year’s Day, less than six months after he guided Chelsea to the Club World Cup.\nThe former Leicester City manager also won the Conference League with Chelsea last season while finishing fourth in the Premier League, successfully qualifying for the Champions League.\nChelsea started the current campaign well but endured a poor December, picking up six points from six games to slip 15 points behind Premier League leaders Arsenal.\nMaresca’s relationship with the Stamford Bridge hierarchy also became increasingly strained and club legend Terry says there was ‘clearly tension’ at board level.\nBut the Chelsea hero was still ‘completely shocked’ by Maresca’s exit and described it as a ‘big shock’.\nReacting to the announcement on TikTok, Terry said: ‘Enzo Maresca has just been sacked by Chelsea and to be honest I’m completely shocked, I didn’t see it coming.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘I know things of late haven’t been how he would like. You can see and hear that there’s been tension.\n‘I’ve had so many phone calls this morning after the news and everyone expects me to know what’s happening. I haven’t got a clue what’s happening, I’m not involved in the first team so I don’t know.\n‘Just my opinion from afar, there’s clearly been tension between the manager and the owner and they’ve come to this decision.\n‘It’s a big shock because rewind three or four weeks ago and we were playing so well against Barcelona. It was so good and fast forward four weeks and form and performances clearly haven’t been good enough.\n‘I think like the squad, the manager is inexperienced himself. It was his first full-time job in the top-flight and he has said how he’s still learning and how he’s got some things wrong at times.\n‘But I will say there’s always two sides to the story and there’s certainly things behind the scenes that I don’t know about. I just hear rumblings like everyone else does.\n‘I’m disappointed but there’s still loads to play for this season, Champions League, Carabao Cup, so whoever comes in has a lot to play for. As players you have to get on with it and step up an deal with it.’\nChelsea face Premier League title challengers Manchester City on Sunday in their first game since Maresca’s sudden departure.\nDiscussing Maresca’s exit, ex-Chelsea winger Pat Nevin said on BBC Radio 5 Live: ‘I am not shocked or mildly surprised as it is the Chelsea way. How many managers have a go at their board? They hate it.\n‘When the eyes and media start asking questions upstairs, that’s when they hate it. I thought his days were numbered after the Everton comments. The writing was on the wall.\n‘Has he done a good enough job? I think it is about par. You can dress it up as world champions and a European trophy with a young team. You could also say £1.6 billion spent on players. That would be a decent team.\n‘I do feel sorry for Enzo Maresca. This dip was always going to happen at this stage of the season because of the amount of football they played at the Club World Cup. They barely had a break.’\nChelsea statement on Enzo Maresca exit\nChelsea Football Club and Head Coach Enzo Maresca have parted company.\nDuring his time at the Club, Enzo led the team to success in the UEFA Conference League and the FIFA Club World Cup. Those achievements will remain an important part of the Club’s recent history, and we thank him for his contributions to the Club.\nWith key objectives still to play for across four competitions including qualification for Champions League football, Enzo and the Club believe a change gives the team the best chance of getting the season back on track.\nWe wish Enzo well for the future.\nAsked who could replace Maresca in the Stamford Bridge hot-seat, Nevin added: ‘Chelsea need someone who is going to buy into the methodology. Another way to say that is that you need a puppet.\n‘Someone who does exactly what they are told from above. If you want that person then you have to get one. They will get someone in who is young and easy to manipulate.\nMore Trending\n‘Chelsea want success. They want points to get top four or five and getting into the Champions League every single season.\n‘But they want something else. They want someone who will do what they tell them to do. Those two things may not be compatible.\n‘Liam Rosenior sounds like a really good idea, but he’s never done it at this level. This is the best league and the hardest league in the world. Even against the bottom teams you can get done if you make mistakes.\n‘To bring someone in who doesn’t have that level of experience is a massive, massive chance to take.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Porto boss Francesco Farioli responds to Chelsea interest after Enzo Maresca exit\nMORE: Manchester City boss Pep Guardiola sends ominous warning to Arsenal over Premier League title race\nMORE: Enzo Maresca held talks with another Premier League club before Chelsea exit",
  "word_count": 954,
  "scraped_at": "2026-02-14T01:59:31.500251",
  "_text_extracted": true
}