{
  "article_id": "81c4a07da24a",
  "url": "https://www.the42.ie/bristol-city-derby-6797381-Aug2025/",
  "title": "Ireland international grabs assist as Bristol City left frustrated , Kane hits hat - trick",
  "date": "20250823T004500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "IRELAND INTERNATIONAL Mark Sykes registered an assist, but it wasn’t enough for Bristol City tonight, as they conceded a late equaliser to draw 1-1 with Derby County in the Championship.\nCarlton Morris struck late in the second half to rescue a point for the hosts at Pride Park.\nThe 29-year-old proved to be the Rams hero and registered their first point of the season following two straight defeats, while Bristol City continued their own unbeaten start but relinquished the chance to be top of the league before the rest of the weekend action.\nIn addition to Sykes, Jason Knight captained the side while fellow Ireland international Sinclair Armstrong — who has been linked with a move away from the club recently — made a 54th-minute substitute appearance.\nThe visitors took a while to warm into the contest but ended the half on top after Scott Twine slotted in his third goal of the season.\nThe Robins missed further chances to make their evening all the more comfortable through Armstrong and Anis Mehmeti, and they paid the price through Morris, who rescued an unlikely point, after it took the hosts 86 minutes to register their first shot on target.\nDerby came out of the traps and wanted a penalty after they thought Callum Elder’s powerful effort came off the arm of Rob Dickie.\nIt took 24 minutes for the away side to make their first impression on the Derby goal after a corner fell by the way of former Derby midfielder Knight, but he scuffed the ball wide of the target.\nThe Robins took the lead in the 35th minute with their first shot on target. Sykes travelled down the right and picked out Twine, who had the space of Pride Park, and he was able to turn an effort past Jacob Widell Zetterstrom and into the bottom corner.\nBristol City soon started to dominate proceedings and could have doubled their advantage. This time, Twine turned creator and fed it to Mehmeti, who was denied an effort on target by Dion Sanderson, who blocked behind for a corner.\nMuch like the first half, Derby started strong but did nothing to threaten the goal of Radek Vitek after the break.\nCity went in search of a second, substitute Armstrong trotted his way into the area and tested Zetterstrom, who was alert to make his first save of the contest.\nThe home crowd’s patience began to wear thin as they were unable to get anything to click at the top end of the pitch, and it looked like Bristol City would bury the contest, with Mehmeti the next to miss the target as the deficit remained at one.\nBut Derby mustered an equaliser with four minutes remaining. A cross found the head of Joe Ward, who tested Vitek for the first time, but his save bounced kindly for Morris, who buried his third goal in three games despite the best efforts of Rob Atkinson on the line.\nThe visitors were denied all three points after Zetterstrom clambered across his goal to stop Twine’s goalbound free-kick from heading into the top corner at the death.\nElsewhere, Harry Kane hit a hat-trick, Michael Olise a double and newcomer Luis Diaz also scored as Bayern Munich thumped RB Leipzig 6-0 at home in the Bundesliga season opener on Friday.\nBayern’s big-money arrivals, all brought in from the Premier League across the past three seasons, were dominant as the Bavarians began their title defence in style.\nOlise scored twice in the first half, either side of a Diaz strike, as Bayern went into halftime three goals up.\nNot to be outdone, Kane scored three goals in the second half — with two assists coming from Diaz, to bring Bayern’s total to 6-0.\nThe 32-year-old England captain has seven Bundesliga hat-tricks since joining Bayern from Spurs in the summer of 2023.\nKane was subbed off to rapturous applause with four minutes remaining as the defending German champions, winners of 12 of the past 13 Bundesliga titles, sounded a warning on the opening day of the competition.\nKane told Sky Germany: “We wanted to open the season with a statement and that’s exactly what we’ve done,” adding, “we were on top in all areas and were clinical when we needed to be, so we can enjoy this.”\nBayern captain Joshua Kimmich agreed with Kane’s assessment, saying “a 6-0 at home against Leipzig is clearly a statement, but what’s hard in football is to back it up in three days.”\nKimmich praised Kane as an “absolute team player,” telling Sky Germany the England captain “he loves to score but he sets goals up and gets back and helps in defence, that’s something special.\n“He doesn’t just define himself with goals, and that helps us extremely.”\nThe defeat showed Leipzig have a long way to go to challenge for the top spots after their first summer transfer window under Jurgen Klopp, who took over as Red Bull global head of football in January.\nLeipzig captain David Raum called the match “a catastrophe”, saying his side lacked “mentality and willpower” in one-on-one situations.\n- Bayern under pressure -\nBayern were under pressure before the season opener after losing several forward players in the summer transfer window.\nTalisman Kane told reporters it was “probably one of the smallest squads I’ve ever played in,” after losing forwards Kingsley Coman, Leroy Sane, Thomas Mueller and Mathys Tel.\nDiaz became the third player in as many seasons to join on big money from England after Kane and Olise, leaving Liverpool for Bavaria.\nOlise continued his stunning start to life in Germany from last season, smashing in the opener after 27 minutes.\nDiaz then arrived at the party, scoring Bayern’s second five minutes later, hammering the ball in off the crossbar from a Serge Gnabry assist.\nWith Leipzig reeling, Olise added a second three minutes before halftime, collecting a delicate pass from Gnabry before coolly wrong-footing the goalkeeper.\nSniffing blood, Kane scored Bayern’s fourth with 64 minutes played, turning in a Diaz assist.\nAfter a Leipzig strike by Antonio Nusa was ruled out — VAR showed visiting centre-back Castello Lukeba had taken a free kick at the other end of the pitch with the ball still rolling — Kane added two more.\nThe England captain scored in the 74th and 78th minutes.\nOn Saturday, last season’s runners-up Bayer Leverkusen host Hoffenheim while Borussia Dortmund play away at St Pauli.\nFinally, Fabian Ruiz scored the only goal of the game, and Ousmane Dembele missed a penalty as a rusty Paris Saint-Germain beat Angers 1-0 on Friday to make it two wins out of two at the start of the Ligue 1 season.\nSpain midfielder Ruiz drilled home from inside the box five minutes into the second half at the Parc des Princes to give European champions PSG the win in a game in which they dominated but lacked sharpness.\nLuis Enrique’s side, who showed off their trophy haul from last season at the end of this game, edged Nantes 1-0 away last weekend to begin the defence of their 11th French title in the last 13 years.\nThat was off the back of a penalty shoot-out victory over Tottenham Hotspur in the Uefa Super Cup as PSG returned to action following just one week of pre-season training and without having played any warm-up friendly matches.\nThe Super Cup was PSG’s fifth trophy of 2025 to go with their triumphs in the Champions League, Ligue 1, French Cup and the French Champions Trophy.\nThey displayed their collection of silverware on the pitch at full-time in front of a Parc des Princes packed despite August being a time Parisians escape the city on holiday.\nAdditional reporting by AFP",
  "word_count": 1288,
  "scraped_at": "2026-02-14T01:52:36.769500",
  "_text_extracted": true
}