{
  "article_id": "81ce4db65ced",
  "url": "https://www.independent.ie/irish-news/liverpool-fan-sean-cox-walks-for-the-first-time-in-five-years-with-help-of-exoskeleton/a49793585.html",
  "title": "Liverpool fan Sean Cox walks for the first time in five years with help of exoskeleton",
  "date": "20230426T144500Z",
  "domain": "independent.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool fan Sean Cox walks for the first time in five years with help of exoskeleton\nSean Cox, the Irish Liverpool fan who suffered catastrophic injuries when he was assaulted while attending a game at Anfield, has walked for the first time in five years with the help of a team of engineers at DCU.\nMr Cox’s wife Martina said his progress has been significant, and he has now walked again with the help of a mechanical exoskeleton.\nMr Cox (53) from Dunboyne, Co Meath, travelled to Liverpool to cheer on his team against Roma in 2018 in a Champions League semi-final match, when he was attacked outside the stadium, leaving him with life-changing injuries.\nInitially there were concerns that he might not survive, but against the odds, Mr Cox has made significant progress, living once again in his home specially adapted to his needs.\nMr Cox is currently non-verbal but understands everything said to him. His short-term memory suffers and he is wheelchair bound.\nMartina Cox spoke to Miriam Callaghan on RTÉ’s Prime Time about his significant progress since his attack five years ago.\nIn the interview broadcast on Tuesday night, Martina said other than Sean’s condition and adaptations to their home, their happiness has not changed.\n“There’s never a truer word, ‘in sickness and in health’. It’s unbelievable, those words, they are so powerful, and it was never a second thought that I was going to do anything else but look after him,” Mrs Cox said.\n“I’m still happy and Sean is happy, and we still love each other, and I think that’s what makes all this work.”\nOne of the joys in Sean’s life is still travelling to Anfield to watch Liverpool play at their home ground. Martina said being at Anfield is ‘like a tonic’ for Sean.\n“It’s probably the one day he’s never tired. I think there is so much going on and everyone acknowledges him and we’re just very looked after.”\nLiverpool Football Club pull out all the stops whenever Sean visits, seating him in the director’s box and removing seats to make way for his wheelchair.\n“It’s just easy, it’s seamless when we’re there. We know where we’re going and Sean has a great seat,” Martina says.\nSince Sean’s attack, Martina has had to ensure the house was suitable for him to live in to meet his needs.\n“With the house, for me, it was very important it didn’t look anyway clinical, because I think it’s all about the setting,” she said.\n“We got Sean home for the odd day, but it was such an ordeal just getting him through the front door with his chair and manoeuvering around the house.”\nMrs Cox said she can’t thank people enough and that money by the public donated is being put to good use.\nOne major addition to the house was a home gym for Sean’s physio classes, which was possible due to fundraising organised by family and friends.\n“It’s all about stimulation, physio, it’s just constant. Ever day he has to work, he works really hard in the gym five days a week. He does speech and language twice a week,” Mrs Cox said.\n“Obviously we’re all egging him on, he needs lots of encouragement too, it’s tough. Some days he might not be in the mood for it, but we rally him on.\nA remarkable moment in Sean’s progress took place last week in DCU when he began physical therapy sessions with an exoskeleton.\nWhen Sean stood for the first time, Martina said she was “very emotional”.\n“He actually started in the sitting position and then he just stood up and just walked towards me; even the look on his own face was great,” she said.\nHowever, Martina and Sean are unsure what will come out of this physio due to the cost.\n“Physiologically it’s really good for him. Sean has only started on that and hopefully he will get a few sessions out of that. But it’s down to funding. It’s very expensive equipment, physios that need to work it, so that is constant funding too. Without the funding we can’t help the likes of Sean out there.”\nMrs Cox said she and her husband have started getting some normality back into their lives, going out more and travelling abroad.\n“It’s just a little bit trickier because of Sean’s needs, it does involve having carers, but that’s just part of our life,” she said.\n“The home care is really difficult at the moment, it’s not consistent. Sean’s needs are high and recently a lot of the hours are not met and this is down to the fact that there are not enough carers.\n“The supply of carers is just not there because I think what they’re being paid is low. I think they need to relook at this, they need to increase the funding in that area.”",
  "word_count": 815,
  "scraped_at": "2026-02-14T02:06:54.996328",
  "_text_extracted": true
}