{
  "article_id": "81d581aaf948",
  "url": "https://www.caughtoffside.com/2025/10/25/chelsea-battle-spurs-kees-smit/",
  "title": "Chelsea and Tottenham keeping tabs on Kees Smith",
  "date": "20251025T203000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea and Tottenham Hotspur are interested in signing AZ Alkmaar midfielder Kees Smit.\nThe 19-year-old playmaker has impressed with the Dutch outfit, and the two Premier League clubs are keen on securing his services, as per TBR. They have done well to bring in talented young players in recent seasons, and Smit would be another future investment for them. He has all the tools to develop into a top-class playmaker with the right guidance.\nThe report claims Smit is causing “excitement” among several European clubs.\nPremier League could be ideal for Kees Smit\nRegular football in the Premier League will help him improve and fulfil his potential. Both Chelsea and Tottenham have done well to groom young players, and they could play a key role in his development. Smit would get to work with quality managers like Enzo Maresca and Thomas Frank at the two London clubs. It will be interesting to see where he ends up. Both clubs have the resources to get the deal across the line. It will be interesting to see whether they follow up on their interest with an official proposal to get the deal done.\nThe midfielder has been compared to Kevin De Bruyne because of his playing style. His vision, technical ability, and ingenuity could prove to be invaluable for Chelsea and Tottenham in the final third. Both clubs are competing in the UEFA Champions League, and they will hope to fight for major trophies soon. They need to keep improving the squad, and signing some of the best young talents in European football would be a step in the right direction.\nSmit would be a future asset\nThe 19-year-old has the potential to compete in the Premier League, and the opportunity to join some of the biggest clubs in the country will be quite tempting for him.\nHe will certainly hope that the likes of Chelsea or Tottenham manage to secure an agreement with the Dutch outfit soon. He has the physicality and technical attributes to adapt to English football, and he will look to make an instant impact if the move goes through.\nIt is fair to assume that any move might have to wait until the summer transfer window. AZ Alkmaar will not want to lose a key player like him in the middle of the season.",
  "word_count": 387,
  "scraped_at": "2026-02-14T01:59:14.383590",
  "_text_extracted": true
}