{
  "article_id": "81d5b864b0c1",
  "url": "https://www.freemalaysiatoday.com/category/opinion/2026/01/16/semenyo-can-power-citys-gunners-chase",
  "title": "Semenyo can power City Gunner chase",
  "date": "20260115T233000Z",
  "domain": "freemalaysiatoday.com",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Steady, Jim. Two correct decisions in a week, and soon you’ll be acting like a proper owner.\nChoosing Michael Carrick over Ole Gunnar Solskjaer made sense just as opting for a caretaker boss till the end of the season did.\nBut once United fans recover from the shock of the Ratcliffe regime getting something right, the last man they want to see occupying the opposite dugout is Pep Guardiola.\nHe takes City to Old Trafford in the Saturday lunchtime game (8.30pm in Malaysia), which will be the 197th Manchester derby.\nBut Devils will be more optimistic now than under Ruben Amorim’s ill-fated tenure.\nCarrick is a look to the future, whereas Solskjaer would have been another nod to the past.\nAlright, the ex-Middlesbrough manager is also a United old boy, but his best years in coaching are surely ahead of him.\nIn the Norwegian’s case, the jury is still out, even though he had the job for three inconclusive years.\nBut the choice was made for another loyal servant without fuss and seems a safe one.\nIt’s a long time since you could say that about an Old Trafford appointment, even if it may only be temporary.\nBut if Carrick, a veteran of 464 games in United’s midfield, can steer the listing ship back into the Champions League, he may get the job permanently.\nThere were even smiles at the training ground this week as the understated – and often underrated – England international took training.\nBut the visitors, despite three draws in a row in the league, will be on a bigger high after their Carabao Cup semi-final first leg win at Newcastle on Tuesday.\nRayan Cherki’s 98th-minute goal made it 2-0 to place one foot firmly in the final.\nIf the score was ominous for the holders, the slickness and intricacy of the goals would have Arsenal on alert, too.\nAnd now it’s likely they’ll meet in the final.\nNot even another mind-numbing VAR controversy could overshadow £65m signing Antoine Semenyo.\nIt took almost six minutes to wrongly rule out the Ghanaian’s second ‘goal’ that would have taken it to three in two games.\nAnd it’s less than two weeks since he scored that wonderful farewell goal for Bournemouth.\nThis is Haalandesque and his arrival could be more than a game-changer: it could tilt the title race.\nHe’s not just hit the ground at a speed Usain Bolt would be proud of; he’s making the City attack once again an irresistible force.\nTwo-footed, with pace to burn and a knack for scoring tap-ins as well as from range, the former Cherry could be the missing piece of the jigsaw for Pep.\nCity pounced as soon as his release clause was revealed to be £65 million, which seemed reasonable at the time; now it’s looking like a bargain.\nLiverpool were initially thought to be his preferred destination, and United were also interested. But it turns out it was City.\nThe Reds might have been caught napping with Mo Salah’s future up in the air.\nBut with Luis Diaz’s power and penetration a big miss on the other flank, Semenyo would have been an ideal replacement – perhaps an upgrade.\nHis ability to play on either side or in the centre is not to be sniffed at either.\nHe represents a massive coup for City that has breathed new life into their title challenge just when it was faltering.\nAn attack already boasting the dazzling feet of Jeremy Doku, the lethal power of Erling Haaland and the trickery of Cherki could now be unstoppable.\nAnd now they have Rodri back, too. He finally looks like he really has recovered from all those injuries.\nGiven that they are fighting on four fronts, they probably need another defender to make up for the devastating losses of Ruben Dias and Josko Gvardiol.\nBut they should be too good for United.\nCarrick will know that he has a free hit on this occasion. But he has been boosted by the return of Bryan Mbuemo and Amad Diallo from Afcon.\nHarry Maguire is also fit, but youngster Shea Lacey is suspended after picking up a red card last weekend.\nBut the derby has produced a healthy share of shocks, even though the most memorable were when roles were reversed.\nBack in 1989, when City were known for cock-ups, they shocked all-conquering United with a 5-1 win that caused Alex Ferguson to go home and bury his head in a pillow for hours.\nBut a 6-1 win in 2011 hurt even more. “It’s my worst ever day in football,” the great man said.\nBy then, though, the neighbours had already begun to make noise under Abu Dhabi ownership. With Roberto Mancini as manager, Mario Balotelli scored twice and revealed his “Why Always Me?” shirt.\nWith a defence liberated from Ruben Amorim’s three-at-the-back straitjacket, United will be more organised and unlikely to ship that many goals.\nBut given the brilliance of City’s attack, we can expect a few, as we can at the other end.\nThe loss of Dias and Gvardiol leaves a hole in the United defence that may make them go for Mark Guehi in this month’s transfer window. Beating Liverpool to the punch again?\nIn Gianluigi Donnarumma, City have arguably the world’s best goalkeeper, but they have two makeshift fullbacks in Matheus Nunes and Nick O’Reilly.\nPep will be hoping Rodri can intervene before the pair are tested.\nIt promises to be a fascinating contest as there are so many subplots, not least with the respective managers.\nCarrick’s appointment coincided with Erik ten Hag going back to Twente in Holland.\nThe former boss said of United’s owners: “They seem to have very little understanding of football.”\nCarrick’s arrival suggests they are learning.\nPep seems as committed as ever and appears to be relishing the challenge of chasing down the Gunners.\nWhatever happens, it can’t be as bad as when the teams met in September.\nIt was called the worst derby ever and ended nil-nil.\nTomorrow evening, you feel they could well make up for that – and then some.\nThe views expressed are those of the writer and do not necessarily reflect those of FMT.",
  "word_count": 1031,
  "scraped_at": "2026-02-14T02:09:43.006276",
  "_text_extracted": true
}