{
  "article_id": "81d69174ec66",
  "url": "https://www.italpress.com/real-madrid-mbappe-i-hope-to-make-fans-dream-like-cr7-did/",
  "title": "Real Madrid , Mbappé  I hope to make fans dream like CR7 did  ",
  "date": "20251031T150000Z",
  "domain": "italpress.com",
  "source_country": "Italy",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MADRID (SPAIN) – Kylian Mbappé received the Golden Boot for scoring 31 goals in his first season with Los Blancos, and he’s already started this one strongly (11 goals in the first 10 league games), though he insists “what matters is finishing well.”\nThe French star has now truly made Real Madrid his own. After ending last season empty-handed – with La Liga and the Copa del Rey going to Barcelona and the Champions League to PSG – he is determined to win his first Spanish trophies. Xabi Alonso’s side sit top of La Liga and are fresh off a Clásico victory, although the derby defeat – their only league loss so far – still stings. “It was tough; no one expected it. When you’re 2–1 up, you don’t think you’ll concede four more. They played with intensity, we didn’t, they won every duel. It’s a loss to remember – one that will do us good in the future,” Mbappé told Universo Valdano.\nReal Madrid always seemed to be in his destiny, even after coming close to joining several times in the past – like when he left Monaco at 18. “But back then there were Benzema, Ronaldo and Bale, and I didn’t want to sit on the bench,” he recalled.\nAfter working with Carlo Ancelotti – “one of the greatest coaches in history, someone who makes you happy just to walk into the dressing room” – Mbappé is now under the guidance of Xabi Alonso: “You can see his hunger to prove himself and to get results with Real Madrid. It’s his first big opportunity at the best club in the world. We’ll try to help him, to do what he expects from us, and to win every possible title for Real Madrid.”\nSuccess will also depend on the best version of Vinícius Jr.: “We have a great relationship. We both want to win for Real Madrid,” Mbappé said, adding that pressure is part of life at the top. “But this is the best club in the world. I put pressure on myself because I want to live up to expectations.”\nThe French forward dreams of following in the footsteps of his idol. “Cristiano Ronaldo has always been a role model, an example. I’m lucky to be in touch with him – he gives me advice. At Real Madrid, he’s number one. I want to build my own path and hope that one day people will dream about me the way they did about Cristiano.”\nMbappé also has big ambitions with France: “I want to win the 2026 World Cup. It’s a dream. I’ve already won it once and lost a final; now I hope for a third and I want to win it.”\nHe also spoke about Lionel Messi, with whom he shared the dressing room at PSG: “He’s a normal person, respectful with everyone. As a player… unique. Being close to him helped me understand football better. I learned so much and I’m grateful to him.”\nAnd speaking of PSG, he had kind words for Luis Enrique: “A good person and a great coach. Our relationship ended well; I wish him all the best.”\nFinally, a comment on his Barcelona counterpart, Lamine Yamal: “He has to live his life. Leave him alone – he’s 18, and at that age we all make mistakes. Judge him for what he does on the pitch.”\n– Photo IPA Agency –\n(ITALPRESS).",
  "word_count": 571,
  "scraped_at": "2026-02-14T02:15:53.534490",
  "_text_extracted": true
}