{
  "article_id": "81d7e84d8036",
  "url": "https://www.arsenal.com/mikel-arteta-press-conference-full-transcript-every-word-champions-league-sevilla",
  "title": "Every word from Arteta post - Sevilla presser",
  "date": "20231109T023000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta spoke to the media after we edged closer to securing qualification for the knockout stages of the Champions League with a 2-0 win over Sevilla.\nThe boss was asked about various topics in his post-match press conference, including Bukayo Saka's performance, Kai Havertz's form and provided an update on the fitness of Martin Odegaard and Eddie Nketiah.\nHere is everything he had to say:\nOn Saka being fouled repeatedly:\nWell, there is contact in football and obviously for the wingers who want to take people on this is going to happen. At the end he wasn't comfortably to carry on, hopefully it's not too much, but I'm really pleased with his performance.\nOn if the win was a good response after Saturday:\nI think it was more of the really good things that we did against Newcastle, we didn't need a response because the team performed extraordinarily well against a team that are really difficult to play against. Today it needed other requirements, tactically we needed something else, we played at home, we need a different game, and we implemented what we wanted really, really well, so I'm really happy with the last two performances.\nOn Kai Havertz’s performances of late:\nFor me, against West Ham in the first half he was the best player, Newcastle one of the best, and today, again he was really strong, I'm really happy with him.\nOn Saka and Gabriel Martinelli’s influence:\nIt's the attacking players who obviously have a massive influence in what we are able to generate in the final third, but a lot of times the process has to be better at the back as well to give them time, to give them advantages and have the space and the support they need to generate those things. Today they have done it really well and obviously when that's the case, it's difficult to defend against them.\nOn finding the perfect balance in our front three:\nI don't know where that perfect balance is. It's what we have, you look at Gabby Jesus, I think he's only played one Premier League game for us and he played three games in the Champions League and scored four goals. It is what it is, but having Leo here who is so reliable and gives you something very different to Eddie and him is a joy to have, and I'm really happy with him.\nOn Saka’s response to being fouled:\nI think he’s getting used to it. I don’t think that’s going to change especially the way he plays and the way he attracts players so he better get used to it because I don’t think that is going to change.\nOn why Takehiro Tomiyasu was substituted:\nYeah, he had some discomfort in the first half and we didn’t want to take any risks. He’s played a lot of minutes and obviously having Alex [Zinchenko] on the bench ready to come in, I think it was the right decision.\nOn Jorginho’s performance and his influence:\nIt’s a joy to have him. His influence on the rest of the squad and the rest of the boys is enormous. He fits in with the way that we want to play, he’s so intelligent. He understands everything so quickly and he makes everybody else better and I’m really happy with his performance tonight.\nOn the details of Saka’s injury:\nIt was just a kick and I was told by the physios on the radio that he wasn’t happy to continue so he will have some discomfort but hopefully, I want to assume that he will be ok.\nOn Martin Odegaard and Eddie Nketiah’s fitness:\nThey are racing against the clock to be fit and they are trying their best and they tried to be here today with us. It wasn’t possible and now we have another 48 hours before we play Burnley. We will try again and we will see because we need players at the moment.\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 688,
  "scraped_at": "2026-02-14T02:25:08.305138",
  "_text_extracted": true
}