{
  "article_id": "81d97d3ce263",
  "url": "https://www.90min.com/posts/sandro-tonali-miss-rest-season-ten-month-ban",
  "title": "Sandro Tonali set to miss rest of season with ten - month ban",
  "date": "20231025T203000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sandro Tonali set to miss rest of season with ten-month ban\n- Newcastle's Sandro Tonali has confessed to his part in a betting scandal\n- Midfielder will be free to continue training whilst serving his suspension\n- Set to be available again ahead of the 2024/25 Premier League season\nNewcastle United midfielder Sandro Tonali will miss the rest of the Premier League season as he is set to be banned for ten months, sources have told 90min.\nThe 23-year-old has been caught up in an illegal betting scandal that has already seen Juventus midfielder Nicolo Fagiolo issued with a seven-month suspension.\nTonali admitted to his part in the scandal last week, including betting on football matches involving his former club AC Milan, which has led to his soon to be confirmed suspension.\nTonali's legal team have been speaking with the Italian footballing authorities and Turin prosecutors over the punishment that will be handed out to the midfielder. As such, an agreement has been reached between the parties.\nAn announcement is due any day, but sources have confirmed to 90min that Tonali will be banned from playing for ten months - which would mean he be free to resume his career ahead of next season's Premier League campaign. It is believed that he will remain able to train with Newcastle but will also undergo treatment for a betting addiction that his agent stated the player is suffering from.\nDespite the impending ban, Tonali was available to feature for Newcastle in Wednesday's Champions League clash with Borussia Dortmund and he did come as a second-half substitute in what is his final game before serving his lengthy suspension.",
  "word_count": 275,
  "scraped_at": "2026-02-14T01:56:32.770373",
  "_text_extracted": true
}