{
  "article_id": "81e6cacf7a4f",
  "url": "https://www.khaleejtimes.com/kt-network/gatorade-5v5-tournament-to-be-hosted-for-the-first-time-in-the-uae",
  "title": "Gatorade 5v5 tournament to be hosted for the first time in the UAE",
  "date": "20230302T081500Z",
  "domain": "khaleejtimes.com",
  "source_country": "United Arab Emirates",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gatorade 5v5 tournament to be hosted for the first time in the UAE\n- PUBLISHED: Thu 2 Mar 2023, 9:44 AM UPDATED: Thu 2 Mar 2023, 9:47 AM\nFor the first time, Gatorade is set to host its 5v5 football tournament, uniting men's, and women's youth football players from across the UAE in an epic national and global competition. The Gatorade 5v5 football tournament is an annual five-a-side competition for 14 to 16-year-olds that aims to fuel the next generation of athletes by giving them the chance to start their path to greatness. This year, young talent from the UAE, South America, Central America, North America, the Caribbean, and Asia will demonstrate what it takes to become the greatest of all time.\nThe tournament will begin on March 18, at the Sevens Stadium in Dubai, with local elimination rounds that lead up to the national finals. The winning teams from each group will then be flown to Istanbul to represent the UAE against youth teams from around the globe to be crowned Gatorade 5v5 global champions and attend the UEFA Champions League final.\nThe aim of the programme is to help grow the sport of football around the world and support youth players in their journey.\n“We've seen the impact that the Gatorade 5v5 football tournament has had in fueling the next generation of athletes globally, and we're delighted to bring the tournament to the UAE for the first time this year. It is an excellent platform to showcase youth football talent, and we are confident that this edition will help kick-start the UAE team's path to greatness.” said Aamer Sheikh, CEO, PepsiCo, Middle East.\nTo be eligible to participate in the Gatorade 5v5 tournament, each team should consist of four players, one coach, one goalie, and one substitute. The players must be between the ages of fourteen and sixteen, and each team will be represented by a coach over eighteen.\nFor more information, visit www.gatorade5v5UAE.com where you can find the participation forms and all the requirements, regulations, and all information related to the Gatorade 5v5 tournament. The application process closes on March 10. Visit @GatoradeArabia for tournament news and live coverage.",
  "word_count": 362,
  "scraped_at": "2026-02-14T02:12:28.620035",
  "_text_extracted": true
}