{
  "article_id": "81f363a0b29c",
  "url": "https://www.aol.co.uk/articles/world-cup-magic-risk-fifa-145052308.html",
  "title": "The World Cup magic is at risk and Fifa must consider this quick fix",
  "date": "20251210T161500Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The World Cup’s magic is at risk and Fifa must consider this quick fix\nFor all the absurd political theatre around the World Cup 2026 draw, there was still a sense of “magic” – as Scotland manager Steve Clark put it – as countries began to visualise the tournament. They could see the groups, so they could see the path, so they could see the dream.\nIt used to be like this with the Champions League, but nobody would really say the competition has any sense of magic during this opening stage. It’s quite the opposite. It’s all so mundane. Filler.\nTottenham Hotspur beat Slavia Prague on Tuesday night to go up a few places, but does that really matter? The stakes are so vague.\nThe Champions League group stage has become classic football as content rather than pure competitive sport, as has been discussed on these pages before.\nA concern with the 2026 World Cup is that the expansion to 48 teams starts to move it towards this. And this isn’t one of those unfair jibes about Uzbekistan against possible play-off qualifiers DR Congo.\nIt’s that Portugal against Colombia, in the same group, just doesn’t have the same sense of peril.\nIt’s simply a fundamental fact that group games will have inherently less tension because of the need to allow eight third-place sides through. There’s a much bigger safety net.\nSince 48 teams is not a symmetrical number as far as splitting the field to eventually get to a two-team final, Fifa have had to come up with some kind of convolutions to engineer the latter.\nAnd including third-place teams from four-team groups just never works as well. It isn’t as clean and, consequently, isn’t as tense.\nThere will be many people reading this and no doubt yelling that this was exactly the format in 1986, 1990 and 1994, which happen to be among the most cherished World Cups of all.\nAnd all of that is true, but there is a difference.\nFor one, there was a smaller 24-team field in those World Cups, bringing more competitive tension. The unfair and uneven imbalance towards more developed European and South American teams also ensured a higher baseline of quality.\nSecondly, two qualifying from four simply works much better. There's just no argument about this. We have demonstrable proof. In 2022, most famously, Argentina lost their first match and were immediately under immense pressure to win the next two, which they did. It was the same with Spain in 2010.\nIn 1990 and 1994, respectively, both Argentina and Italy lost their opening games but still went through in third place with one win and one draw each.\nIt’s instantly visible that there just aren’t the same stakes.\nA typical irony is that Gianni Infantino and Fifa recognised some of this at the last World Cup. The Fifa president announced that the 2026 World Cup would not go through with an original idea of three-team groups, because 2022 had shown how electric four-team groups are. Every single one of them went to the wire, with most of them requiring teams to watch what was happening in the other game. This was as pure a sporting tension as you can get.\nIt is actually galling enough that the figure who holds the highest position in football, the Fifa president, should require the most recent tournament in order to figure this out. Is it not something that any football fan just realises?\nAnd, just as typically, Fifa came up with the wrong solution.\nAllowing third-place teams, especially when an expansion dilutes quality, also dilutes the drama that so moved Infantino in 2022.\nBut there is a better solution, which is partly inspired by the Champions League, ironically enough.\nIn order to keep the exquisite tension of two teams going through from four – 48 into 24 – why not just allow the eight best group winners to go straight into the last 16, with a play-off in between?\nSuch an idea would immediately ease many problems from this World Cup’s “bloat” in an instant.\nEven the issue of first-placed teams fielding weakened sides for final group games when opposition still have qualification on the line would be solved, since they would have the incentive of finishing in the top eight of 12 group winners.\nAnd while one argument is that a mezzanine play-off round may create too long of a wait between games for the best teams, that is no longer as relevant in this calendar. By contrast, a longer mid-tournament break would probably be even more of an incentive, as fatigue takes hold.\nAs it is, too, the winners of Group A will have a six-day wait between the last group match and the last 32, with the Group L winners facing a mere five-day wait.\nExtending this out to seven or eight is hardly a sufficient negative amid the many positives. The actual World Cup calendar could also just be a bit more smartly scheduled.\nAnd if anyone quibbles about the eventual champions only playing seven games rather than the maximum of eight… well, does that actually matter? It’s just the prize for finishing best in the first stage, and still makes more mathematical sense for a sports tournament than the current convolutions of third-place qualifiers.\nAbove anything, a bit more of the old magic would be preserved. The group stage matches – and by extension the whole World Cup – would just have more meaning.",
  "word_count": 914,
  "scraped_at": "2026-02-14T02:12:17.565527",
  "_text_extracted": true
}