{
  "article_id": "81f75f77a79b",
  "url": "https://menafn.com/1108038125/Alonso-Says-Staying-As-Leverkusen-Coach",
  "title": "Alonso Says Staying As Leverkusen Coach",
  "date": "20240330T040000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alonso Says Staying As Leverkusen Coach\n“It's been a season of speculation regarding my future,” Alonso told a press conference.“Up till now we have been busy and focused on the season and I wanted to reflect during the international break and take a decision. Last week I had a meeting when I informed (Leverkusen's directors) of my decision to continue being coach of Bayer Leverkusen.”\nAlonso said he was still developing as a coach and he felt Leverkusen, his first senior team coaching post, is the best place for him to continue growing.“At the moment this is the right place for me to develop as a coach, I am a young coach,” he said.“Right now this is the right place. I have to thank the management. The club had been supportive and I feel respected by all departments.”\nAlonso has a contract until 2026 but had been linked with moves to Liverpool, Real Madrid and Bayern Munich, all clubs where he spent time as a player, having done a stunning job at runaway Bundesliga leaders Leverkusen.\nLeverkusen are unbeaten this term with 34 victories and four draws and are 10 points clear of Bayern Munich and on track for their first ever Bundesliga title with eight games remaining this season. The former Spain midfielder, who was a member of the side that won the Euro in 2008 and 2012 as well as the 2010 World Cup, is aiming to complete a treble.\nAside from topping the table they are in the final four of the German Cup and the quarter-finals of the Europa League and could potentially meet Liverpool in the final. Alonso's coaching experience was limited to the Real Sociedad B team when he was appointed Leverkusen coach in October 2022, but he showed he had natural talent as a coach as he saved them from relegation.\nWith Alonso out of the race to replace Klopp the frontrunners are believed to be Sporting Lisbon head coach Ruben Amorim and Brighton's Italian manager Roberto De Zerbi.\nDe Zerbi can further impress his potential employers on Sunday as he takes his side to Liverpool and is yet to come off second best against Klopp in four meetings. Speaking in Liverpool after Alonso had made his announcement, Klopp said he understood his decision.\n“He is doing an incredible job there. Leverkusen has a good team and they will probably keep the team together,” Klopp said.“That's a possibility and not all years it is like that. So I understand that he wants to do that.”\nKlopp shocked the football world when he announced in January he would be standing down from the Liverpool job after a hugely successful nine-year stay. In 2020 he delivered their first league title since 1990, a year after landing the 2019 Champions League.\nAlonso preferred not to comment directly about the Liverpool vacancy or indeed Bayern Munich, who were hoping to attract him to replace Thomas Tuchel, who is leaving at the end of the season. Tuchel's departure is a consequence of Alonso's success – should Leverkusen hold their nerve and lift the Bundesliga trophy it will bring to an end Bayern's run of 11 successive league crowns.\n“I think it wouldn't be correct of me to talk about other clubs when they are in this situation,” said Alonso, who remains a devoted Liverpool fan and encouraged his son to be one as well.“For sure there are clubs I have a strong link, I play there. So I respect them. But it's not correct for me to talk about them right now. It's more that the conviction I am in the right place at Bayer Leverkusen and I want to keep growing with the club, growing with the players. I am at this stage in my young career. I had to feel the decision was in a natural way and that's why I have taken it.”\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 704,
  "scraped_at": "2026-02-14T02:25:26.773900",
  "_text_extracted": true
}