{
  "article_id": "8201472306f9",
  "url": "https://www.easternriverinachronicle.com.au/story/8917459/rashford-henderson-make-tuchels-first-england-squad/?cs=6364",
  "title": "Rashford , Henderson make Tuchel first England squad",
  "date": "20250314T154500Z",
  "domain": "easternriverinachronicle.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "New England coach Thomas Tuchel has recalled striker Marcus Rashford and former captain Jordan Henderson as he raised eyebrows with his first squad announcement.\nSubscribe now for unlimited access.\nor signup to continue reading\nRashford, on loan at Aston Villa after being frozen out at Manchester United, last appeared for England in a friendly against Brazil in March last year.\n\"Never stopped believing, cannot wait to get started,\" Rashford, who has scored 17 goals in 60 England appearances, said on Instagram on Friday after the announcement.\nMidfielder Henderson, 34, last played for England in November 2023 and is not even a regular starter for Ajax Amsterdam.\nGerman Tuchel, who was named as Gareth Southgate's successor in October, will take charge for the first time in this month's World qualifiers against Albania and Latvia.\nNewcastle defender Dan Burn and Arsenal midfielder Myles Lewis-Skelly could win their first caps after receiving their first England call-ups.\nAston Villa forward Ollie Watkins, who picked up a knock in their Champions League win over Club Brugge on Wednesday, and Trent Alexander-Arnold, who will also miss Liverpool's League Cup final against Newcastle United with injury, were not included in the squad.\nWhile Rashford's inclusion was half expected after his impressive start at Villa, a recall for former Liverpool midfielder Henderson, who has 81 caps, came out of the blue. He has started only two of Ajax's last nine games.\n\"I think his career and the way he plays now and imposes himself at Ajax is just so impressive,\" Tuchel said.\n\"He builds on character, personality and energy that he brings to the team. For me, Jordan is a similar call-up for the same reasons as Dan Burn. They carry these values on their shoulders and they carry their teams.\n\"Jordan is a big piece in that puzzle for us.\"\nArsenal's 18-year-old academy product Lewis-Skelly has impressed in his breakthrough season at Arsenal, featuring in 13 league and six Champions League games.\n\"I can understand that it feels a little bit like we fast forward a career that is already on a fast pace,\" Tuchel told reporters.\nThe 32-year-old and ever reliable Burn has made 35 appearances for Newcastle this season and Tuchel said he was surprised he had never been selected before. \"He's such a tall guy, it's obviously not easy to overlook him.\"\nBurn's club coach Eddie Howe welcomed the news.\n\"I think it is a great story really, one of the great football stories, one of the great comebacks. Someone who had to do it the real hard way, coming through the leagues. Dedicated, professional, a leader, a real man, an inspirational figure.\"\nBurn played for Newcastle as a youngster, followed by a climb through the footballing pyramid, including at non-league side Blyth Spartans and sixth-tier club Darlington.\nTuchel also included his old Chelsea player Reece James, who last played for England in March 2023.\nAustralian Associated Press",
  "word_count": 484,
  "scraped_at": "2026-02-14T02:02:35.605210",
  "_text_extracted": true
}