{
  "article_id": "8203a64b0bea",
  "url": "https://www.caughtoffside.com/2023/06/25/liverpool-could-be-prepared-to-offer-e80-million-for-26-year-old-midfielder/",
  "title": "Liverpool could be ready to offer €80 million for Nicolo Barella",
  "date": "20230625T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool continue to be linked with a move for the Inter Milan midfielder Nicolo Barella.\nThe 26-year-old has been a key player for club and country in recent seasons and he has been linked with a move away from Italy recently.\nLiverpool need to bring in central midfield reinforcements and the 26-year-old Italian international could prove to be a quality acquisition. Barella will add creativity, control and technical ability in the middle of the park.\nLiverpool have struggled to control games last season and some more like Barella will help them retain possession and use the ball better.\nBarella was a key player during Inter Milan’s run to the final of the UEFA Champions League last season and he would be an upgrade on players like Jordan Henderson.\nFurthermore, Liverpool have parted ways with James Milner, Alex Oxlade-Chamberlain, and Naby Keita on free transfers. They will have to replace these players adequately.\nSo far they have signed Alexis Mac Allister from Brighton and Hove Albion. They need to bring in more additions in the midfield and Barella certainly fits the profile.\nAccording to the Italian outlet Il Tempo (h/t Paisley Gates), Liverpool could be ready to offer €80 million for the Italian international.\nBarella is at the peak of his powers and he could improve Liverpool immediately. He has the technical attributes to succeed in English football and he could be a key player for Jurgen Klopp next season.\nThe Italian helped his country win the European Championships recently and he knows what it takes to win major trophies. The midfielder recently won the Italian league title with Inter Milan as well.\nAlthough €80 million seems like a high price to pay, Liverpool would certainly get a top-class player in exchange for that.",
  "word_count": 293,
  "scraped_at": "2026-02-14T02:12:52.296628",
  "_text_extracted": true
}