{
  "article_id": "820b99ac8dc6",
  "url": "https://www.newcastleherald.com.au/story/8771122/wellissol-is-the-latest-jets-import-how-do-foreigners-stack-up/?cs=305",
  "title": "Wellissol is the latest Jets import . How do foreigners stack up ? | Newcastle Herald",
  "date": "20240923T110000Z",
  "domain": "newcastleherald.com.au",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brazilian Wellissol is expected to make a much-anticipated debut for the Newcastle Jets in a friendly against Perth Glory in Bunbury on Sunday.\nSubscribe now for unlimited access.\nor signup to continue reading\nThe 26-year-old attacker is from Salvador and will be the eighth Brazilian to play for the club.\nUnlike marquee additions to the A-League, Juan Mata (Wanderers) and Douglas Costa (Sydney), Wellissol's signing barely caused a ripple.\nJets fans went trawling through the internet for footage of the winger, who arrived in Newcastle from Brazilan Serie-B club Brusque FC, where he scored one goal in 10 games.\nA resume does not always spell success or failure for imports in the A-League.\nWellissol played in Brazil alongside championship-winning Mariners fullback Doka and came through the same agent, Milton Da Rocha, who also delivered Marco Tillio and Bobo to Australian football.\nHe is the only import in Rob Stanton's squad for the 20024-25 A-League campaign.\nLast year the Jets' two foreigners were former Arsenal veteran Carl Jenkinson and French midfielder Jason Berthomier whom struggled with fitness and form and made 16 appearances between them.\nThe Jets, who operate under one of the smallest budgets in the league, historically have been hit-and-miss when it comes to foreigners.\nWillissol is the 56th overseas player signed by the club in 20 years.\nSome have been household names. Emile Heskey won titles with Liverpool, earned 62 caps for England and was regarded as one of the best strikers in the Premier League.\nJenkinson, Michael Bridges, Francis Jeffers, Wes Hoolahan, Joe Ledley and Roy O'Donovan all graced the Premier League.\nMario Jardell also played in the English top flight and was a three-time European golden boot winner when at Porto.\nOthers were unheralded and became fan favourites - Milton Rodriguez, Ronny Vargas, Daniel Penha.\nPint-sized Brazilian midfielder Denni and equally diminutive Korean Song Jin-Hyung were part of the 2007-08 championship team.\nMilos Trifunovic (Serbia), O'Donovan (Ireland) and Beka Mikeltadze (Georgia) led the club in scoring.\nOthers failed to flatter and were soon shipped off - Jorge Drovandi, Jesper Hakansson, Edmundo Zura, Ma Leilei.\nIn total 31 countries have been represented. Brazil have supplied the most with eight, then England with six. Players have also Ben sourced from Italy, Spain, Japan, Ireland, Denmark and far flung destinations like Slovenia, Equador, Panama, Cameroon and Kosova.\nHESKEY STANDS TALL\nFormer Socceroo and long-time Newcastle Herald columnist David Lowe has cast a well-trained eye over most.\nRecently retired Jets defender and record games-holder Jason Hoffman has shared a dressing room with many of the internationals.\nBoth agreed that Heskey was the biggest signing in the club's history.\nThe imposing striker was 35 when he touched down for the 2012-13 campaign and along with Alessandro Del Piero (Sydney) and Shinji Ono (Wanderers) were the faces of the league.\nHeskey scored nine goals in his first season and two in the second.\n\"Heskey wasn't as sharp as he was at Liverpool but he was still good enough to dominate other defences,\" Lowe said. \"Melbourne Victory centreback Adrian Leijer tried to muscle up on him and was swatted away like a fly. The Jets were going down a different track where they wanted to play a possession game and press high up the pitch in an Australian summer which probably didn't suit him.\n\"There is no question that in terms of credentials, Heskey is the best player who has been here since Mick Shannon.\"\nHoffman was playing for the Melbourne Heart at the time, but Heskey's impact didn't go unnoticed.\n\"The signing of Emile Heskey was huge for the Hunter and he is still held in high regard around the football club,\" Hoffman said. \"He had a massive part to play in the journey of Adam Taggart. I didn't share a changeroom with Heskey but I'm grateful he came to the league and spent time at a club I love.\"\nFAN FAVOURITES\nColombian Milton Rodriguez was an unknown on arrival in 2006 but soon became a fan favourite.\n\"He was a cult figure,\" Hoffman said. \"He had a very distinct image. The long hair, the headband. And he played with tenacity. He gave it everything. Newcastle people loved that. I remember being a teenager and kids rocking up to games in Milton Rodriguez headbands.\"\nThe Colombian winger could also play and scored seven goals in 21 games.\nVenezuelan play-maker Ronny Vargas (2017-19) and Brazilian Daniel Penha (2021-22) also lit up the stadium with their sublime touch and flare.\n\"Ronny Vargas was a class player but he got a horror injury three games in. He still played in a grand final,\" Lowe said. \"Penha had the characteristics you want in an import - exciting, attacking player, clearly the best in the squad and one of the best in the league. He was a good passer, excellent dribbler and had a potent long-range shot. Moved on to one of Asia's bigger leagues after one season. Perhaps not as refined as Vargas but very hard to beat for raw excitement and talent.\"\nHoffman also had the wiry Brazilian, who led the league with 11 assists, in his top echelon.\n\"Daniel could single-handedly win a game,\" Hoffman said. \"He was team-first, extremely talented and has kicked on to other things. That shows we had a serious player. Rarely do you meet a nicer person. He cried when he left Newcastle to go to Korea.\"\nSong Jin-Hyung, Roy O'Donovan and Fabio Vigneroli were other \"special\" players.\n\"Song won a championship and was absolutely instrumental in the way we played,\" Hoffman said. \"A lot of young Jets fans probably aren't aware of him. He was phenomenal in the grand final and was an unsung hero during the season. He was so clever and so young.\n\"Fabio came out here late in his career. I learnt so much from him on how to read a game, how to use your technique to create time, where your first touch needed to be, your body shape. In the Asian Champions League, he was excellent, He assisted my first goal for the club against Ulsan away. We were under the pump against Ulsan and he was the one players who had time. We just went: 'get the ball to Fabio, he will keep it'.\n\"Roy has to be mentioned. What a goal-scorer and competitor. I consider Roy nearly a local. He still resides in Newcastle and is an unofficial ambassador for the club.\"\nCHARACTERS\nHoffman also named three imports, who maybe didn't produce the same quality on the pitch as others, but left a lasting legacy in the dressing room.\n\"Wes Hoolahan was a Norwich legend and an extremely talented footballer,\" Hoffman said. \"He had an unfortunate injury early in his time at the Jets and we never saw the best of him. He was a very, very clever player and fantastic pro.\n\"Few people would bat an eyelid at Bobby Burns' time at the club, but he galvanised the change room because he had an infectious personality. He was a gritty, tough, little Northern Irishman but he was also cheeky and likeable. He left a very different mark on the place.\n\"Of all the foreigners I have played alongside, Carl Jenkinson is the one I am closest to. He helped me so much in the later stage of my career around how life looks beyond the game.\"\nSUPER MARIO\nMario Jardel had a resume surpassed by few, but the Brazilian striker was way past his best and crippled by a chronic knee issue.\nUnfortunately, and perhaps unfairly, he was ridiculed, but Hoffman and Lowe saw his stay in a different light.\n\"You mention Jardel and people go, 'oh that guy',\" Hoffman said. \"As a young player to see a player like that want to come to Newcastle, I had nothing but respect for his history in the game.\"\nLowe agreed: \"In terms of credentials, the only one that comes close to Heskey is Mario Jardel,\" Lowe said. 'Unfortunately he was a spent force. If you look at his career. You don't win golden boots in Europe if you can't play.\"",
  "word_count": 1349,
  "scraped_at": "2026-02-14T02:01:51.731485",
  "_text_extracted": true
}