{
  "article_id": "8223a33ba653",
  "url": "https://www.nytimes.com/athletic/6082958/2025/02/05/west-ham-tim-steidten-exit/",
  "title": "Inside Tim Steidten West Ham exit : Signing mistakes , managerial issues and relief at leaving",
  "date": "20250205T054500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Tim Steidten picked up his phone, he could not believe what he was being offered.\nAs far as he was concerned, a deal to bring Jhon Duran to West Ham was dead in the water. After all, Aston Villa rejected their £30million-plus offer for the now 21-year-old striker last July. But a prominent member of Villa’s recruitment team phoned to say a deal could be struck for Duran in the now-closed mid-season window. Steidten initially thought they had called the wrong person by mistake but was aware of a stumbling block once the realisation hit.\nAdvertisement\nBefore the winter window opened on January 1, West Ham’s hierarchy had informed Steidten, their technical director, that he needed to be careful regarding transfers amid fear of the club risking a points deduction by breaching profitability and sustainability rules (PSR). His focus for that window needed to be on identifying potential loan signings. Steidten informed West Ham’s hierarchy of Duran’s availability and an offer of £57million ($70m) was submitted, but it fell below Villa’s asking price and, like the summer bid, was turned down.\nDuran eventually joined Saudi Pro League side Al Nassr in a deal worth €77million (£64.5m), plus the potential for more in add-ons. Steidten’s attempts at signing the Colombian forward would be one of his final acts as a West Ham employee. His position was under review, given the underwhelming nature of last summer’s recruitment, and within hours of Monday night’s transfer deadline, the club announced he was gone.\nA source close to Steidten says he is relieved to be leaving the job after 18 months, but it was not supposed to end in this fashion. The Athletic has talked to people at the club and others close to the German. All who spoke to us for this article did so under the condition of anonymity, to protect relationships.\nThe Athletic can reveal for the first time what went wrong for Steidten at West Ham, including:\n- His mistake in signing Niclas Fullkrug having dismissed his injury record\n- Why vice-chair Karren Brady took over talks with new manager Graham Potter\n- Steidten contacting Roger Schmidt about replacing Julen Lopetegui\n- Steidten feeling the club overspent on defender Maximilian Kilman.\nSteidten was appointed technical director at West Ham in July 2023, having left his sporting director role at Bayer Leverkusen of the German Bundesliga four months prior and after previously holding talks with Chelsea. He was tasked with overseeing West Ham’s player recruitment strategy and the scouting department, working closely with David Moyes, their manager at the time, and sporting director Mark Noble.\n“Tim’s appointment is key to our wider plans to drive our football strategy forward,” said West Ham co-owner David Sullivan. “We are delighted to welcome such a well-respected name in the game to the club.”\nAdvertisement\nSteidten had used his initial interview with West Ham to outline his long-term vision for the club, who had just won the Europa Conference League — ending a trophy drought dating back to the 1979-80 FA Cup.\nHe gave a presentation on the players he’d helped recruit while at German clubs Werder Bremen and Leverkusen (the latter went on to win the 2023-24 Bundesliga title). The list included Jeremie Frimpong, Moussa Diaby, Serge Gnabry, Davy Klaassen, Edmond Tapsoba and Piero Hincapie. He highlighted the importance of identifying young talents and how, if given the chance, he could do the same for West Ham.\nThere would be follow-up interviews, but the lasting impression he made with the east London club’s hierarchy was forged in that sales pitch.\nSteidten had little time to bed in, as his first job was to find a midfielder to replace wantaway captain Declan Rice.\nTheir list of options included Joao Palhinha, then of Fulham, Manchester United’s Scott McTominay, Conor Gallagher of Chelsea and Ajax’s Edson Alvarez. Three weeks after Rice completed a £105million ($133.2m) switch to Arsenal in the July, Alvarez joined for £35m from the Dutch side.\nBut tension was already starting to develop between Steidten and Moyes. The latter often worked alongside then head of recruitment Rob Newman, whose role at West Ham was marginalised after the German’s arrival. Steidten wanted to pursue targets at clubs in continental Europe, while Moyes was more inclined to sign players with Premier League experience.\nThe pair disagreed over the £30million signing of midfielder James Ward-Prowse from Southampton. Steidten felt Youssouf Fofana, then of Monaco, would be a better addition. Moyes, however, disagreed. Ward-Prowse would go on to have a solid debut season, with seven goals and 11 assists in 51 appearances, but there were more reports of a rift between manager and technical director.\nAdvertisement\n“Tim has never been in the Premier League before,” Moyes said as early as August 2023. “But we have got on very well. There has been a lot of rubbish spoken. We may not agree on every player, but there would be something wrong if we did. The longer we are together, the longer we work together, the better it will become. Anybody can agree or disagree. My recruitment team talks every day. One will say, ‘Yeah, we like the player’, and another will say, ‘No, we don’t like him’.”\nSteidten was vindicated in his preference for players from clubs in continental Europe with the £38million acquisition of Mohammed Kudus. His sales pitch convinced the Ghana international forward to follow team-mate Alvarez across from Ajax. As reported by The Athletic at the time, earlier in the summer 2023 window, Kudus had seemed destined to join Chelsea. But the deal stalled as they tried to sign midfielder Moises Caicedo from Brighton & Hove Albion, who eventually joined for £115million. Kudus waited more than two weeks for a response. West Ham first showed interest on August 6 and, due to Chelsea’s delay, Ajax and Kudus’ representatives became frustrated and switched their focus to sanctioning a move to east rather than west London.\nSteidten assured Kudus that he and attacking midfielder Lucas Paqueta, who had impressed after joining West Ham a year earlier, could play together. He also convinced him he would not receive less playing time if he joined once the Brazilian ended up staying at the club, amid a rejected £70million offer from champions Manchester City. Kudus signed a five-year contract, with the option of a further season. The addition of defender Konstantinos Mavropanos from Germany’s Stuttgart was also through Steidten’s recommendation.\nBehind the scenes, Steidten’s influence was starting to grow stronger. His brother Moritz joined the club in February 2024 as head of international scouting and recruitment, from Werder Bremen. He also pushed for Maximilian Hahn, who joined from the same German club as head of technical scouting and analysis.\nSteidten’s office was at the Rush Green training ground and club insiders say he had a boisterous presence.\nSteidten’s stock had grown, and he was linked with the sporting director role at Liverpool following Jorg Schmadtke’s departure at the end of the January 2024 transfer window. He did not rule out a potential exit in the future.\n“I’ve heard I am supposed to be on the list at Liverpool,” Steidten told Sky Germany. “It is one of the biggest clubs in the world, so it’s an honour, but so far nobody from Liverpool has contacted me. I feel very comfortable at West Ham. We signed the right players in the last transfer windows. The squad is strong, so we can achieve our goals. We are already planning the next window. What happens to the future, we will see.”\nAdvertisement\nMoyes had doubts over whether Steidten could be trusted. Their already fractious relationship led to the Scot banning him from the first-team dressing rooms at both the training ground and the London Stadium last April. That same month, Steidten held talks with Ruben Amorim of Portugal’s Sporting CP, now Manchester United head coach, over potentially replacing Moyes, who was set to leave that summer when his contract expired. This further undermined Moyes’ position and Amorim admitted he made a mistake in meeting West Ham.\nAthough the Portuguese was Steidten’s preferred option for the job, his €10million release clause was viewed as too expensive for Sullivan to sanction.\nInstead, former Spain, Real Madrid and Wolves manager Julen Lopetegui was announced as Moyes’ successor, four days after his final game in charge. Steidten, who said the Spaniard was a standout candidate for the role, joined him at his unveiling in July. That was the first time he had spoken publicly to English media outlets, a year after being appointed.\n“After the first meeting we had with Julen, I was 100 per cent convinced he was the right coach for us,” said Steidten. But five months later, Lopetegui departed as the shortest-lived managerial appointment in the club’s 124-year history, sacked after just 22 games.\nBoth Lopetegui and Steidten had come under scrutiny over West Ham’s summer recruitment, with over £120million spent on nine players.\nLuis Guilherme joined for £25million from Palmeiras of Brazil but has so far failed to justify that fee. The winger is yet to start a league game for West Ham and has made only seven appearances, albeit he is still only 18 years old.\nHaving missed out on Villa’s Duran in the search for a new striker, Steidten focused his attention on signing Niclas Fullkrug, who he knew previously at Bremen.\nAdvertisement\nThe 31-year-old Germany international joined for £27million from Borussia Dortmund. There was initial excitement, given his goalscoring pedigree with last season’s Champions League finalists. But Fullkrug sustained an Achilles tendon injury in September and was sidelined for three months. On his return, he scored in the 3-1 loss away to Leicester City and there were further signs of promise when he provided an assist in the 1-0 win over Southampton and a goal in the defeat against Manchester City. But then he suffered a hamstring injury in the FA Cup loss to Aston Villa on January 10, He hasn’t played since.\nPrivately, sources close to Steidten say he has admitted buying Fullkrug was a mistake. He was concerned about his injury record and aware of the risk. But he felt West Ham had no other options given their need for a striker. Those sources say Steidten admits he was too naive in making things happen, no matter what.\nAnother transfer he has since questioned is the decision to allow Nayef Aguerd to go to Real Sociedad on a season-long loan. A source close to Steidten claimed he wanted to keep the Moroccan defender, but Lopetegui did not. A source close to Lopetegui disagreed with this version of events though, saying he had also been keen for the player to stay.\nRegardless, what did happen is that Aguerd left, with fellow centre-back Maximilian Kilman joining from Lopetegui’s previous employers Wolves for £40million. Although Kilman has been a solid addition, Steidten believes that fee was too high.\nSticking with the defence, Steidten played a key role in securing Jean-Clair Todibo’s arrival on loan from Nice. The move looked impossible at one stage, with Juventus as West Ham’s main rival. But when they stalled, Steidten pounced and a deal with the French club was finalised shortly after.\nSteidten also clashed with Lopetegui over the signings of Carlos Soler and Guido Rodriguez, two more deals that were eventually done.\nThe relationship between the two men was not always this strained. They used to talk daily about everything and the club’s now former technical director was hands-on. But in mid-December, Steidten again began staying away from the training ground. A mutual decision was made for him to avoid Rush Green, given the speculation around Lopetegui’s future.\nAdvertisement\nLopetegui was eventually sacked on January 8, having failed to fix West Ham’s poor form. Graham Potter, the former Brighton and Chelsea manager, emerged as the preferred option to take over. West Ham’s hierarchy interviewed former Milan manager Paulo Fonseca but despite positive talks, his camp got the impression Potter was their intended target. Steidten also contacted Roger Schmidt, the ex-Benfica boss, about replacing Lopetegui, but he didn’t want the job.\nA photograph was leaked online of Steidten and Potter apparently in conversation at an undisclosed location. The timeframe of the photo was unclear but the two parties held several rounds of talks. The initial hold-up in negotiations was due to Steidten only offering a deal until the end of the season. Potter was reluctant to agree to those terms and vice-chairman Brady took over the discussions, which led to the 49-year-old signing a two-and-a-half-year contract.\nSteidten gave Potter a tour of the training ground and the new head coach was initially happy to work alongside him, but he wanted to be reunited with Kyle Macaulay, since named West Ham’s head of recruitment, who he previously worked with at all four of his previous managerial stops — Ostersunds in Sweden, Swansea City, Brighton and Chelsea.\n“I know him well and he knows me well,” Potter said of Macauley. “It’s a good link between the coach and the club in terms of recruitment, in terms of the hours and depths of conversations that you have to have around recruitment. They are easier to have with Kyle than it is for me because, clearly, I’m on the pitch and I’m working with the 20-odd players that we’ve got here.\n“I’m really happy with that appointment. It’s something that was always going to happen. It was just a case of when. I’m obviously delighted he’s here.”\nEighteen months ago, that same excitement was shared by the West Ham hierarchy after Steidten’s arrival. “Tim’s appointment is key to our wider plans to drive our football strategy forward,” said Sullivan.\nThe club sided with Steidten as he won the power struggle over Moyes. But eight months later, that decision has not reaped rewards.\nAdvertisement\nThere are also doubts from sources close to Lopetegui over whether the exits of the Spaniard and now Steidten will have a material impact on West Ham going forward, as they believe it was the planning process that has led to their difficult 2024-25 season.\nSteidten is relieved to be leaving the club but he does so with a bruised reputation.\n(Top photo: Richard Pelham/Getty Images)",
  "word_count": 2367,
  "scraped_at": "2026-02-14T02:02:19.839005",
  "_text_extracted": true
}