{
  "article_id": "822f2a7f133d",
  "url": "https://www.zerohedge.com/market-recaps/futures-rebound-worst-plunge-2025-trump-meet-ceos",
  "title": "Futures Rebound From Worst Plunge Of 2025 As Trump Meets CEOs",
  "date": "20250311T154500Z",
  "domain": "zerohedge.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Futures Rebound From Worst Plunge Of 2025 As Trump Meets CEOs\nUS equity futures are higher, rebounding from the biggest selloff since last September (and since 2022 for the Nasdaq) with both tech and small caps outperforming as Trump is set to meet with top business executives later in the day, and Goldman speculating that he will address the recent stock market plunge, with the mere confirmation expected to send stocks higher. As of 8:00am ET, S&P futures are up 0.4%, while Nasdaq futures gain 0.6% after plunging 4% on Monday, with all Mag7 names (ex AAPL) higher premarket with Semis, Financials, and Int’l Equity ADRs also poised to outperform. The JPM Trading Desk says it likes participating in this bounce higher but warns that it may be short-lived unless trade policy is crystallized (well, duh). Delta’s earnings (and now American's this morning) calling out uncertainty for hitting guidance may increase expectations for Trump to establish the \"Trump Put\" in Equity markets. Trump may also visit China in April, according to press reports, potentially to do a trade deal as a second summit in the US in June is also in discussion. Bond yields are higher as the yield curve twists flatter and the USE slides again, helping US stock futures in their attempt to rebound after Monday’s slump. Commodity prices are strong across all 3 complexes with precious metals the standout, as gold storms back over $2900. Today’s macro data focus is on JOLTS data and Small Business Optimism which slumped to 100.7 from 102.8, the lowest since Trump won the election (future hiring plans are a leading indicator for NFP).\nIn premarket trading, Delta Air Lines shares tumbled 11% after the airline cut its adjusted earnings per share guidance for the first quarter, sending shock waves across the sector (United Airlines -8.0%, American Airlines -6.5%). Tesla is leading premarket gains among the Magnificent Seven stocks, with the EV maker set to rebound after a 15% rout on Monday. The slide came as investors dumped last year’s biggest winners amid growing fears that the economy is headed for a recession (Tesla +3.2%, Nvidia +0.84%, Meta +0.8%, Amazon +0.5%, Alphabet +0.3%, Microsoft -0.1%, Apple -0.3%). Here are some other notable premarket movers:\n- Asana shares slump 27% after the work management platform provider announced Dustin Moskovitz would retire as chief executive officer. Additionally, the company issued first-quarter revenue guidance that failed to meet consensus expectations.\n- Oracle shares fall 2.9% after the software company reported third-quarter results that missed the average analyst estimates. Morgan Stanley says there are questions surrounding the durability of its training business and rising margin impacts.\n- 2Seventy Bio shares surge 76% after Bristol Myers Squibb agreed to buy the biotech company for $5.00 per share in cash.\n- Net Power shares extended losses, falling 36% to new record lows as investors continued to sell the clean energy technology company after it announced higher than anticipated costs for its Project Permian project.\n- Redwire shares plunge 17% after the space infrastructure company reported revenue for the fourth quarter that trailed Wall Street’s expectations.\nThe latest company results hinted at slowing profits earnings. Delta Air Lines shares tumbled as much as 11% in US premarket trading after a a deep cut to profit expectations. The news hit peers United Airlines Holdings Inc. and American Airlines Group Inc., and also weighed on European airlines. Sofware firm Oracle Corp. slipped after its results missed estimates.\nThe selloff in US stocks, particularly in the tech sector, has been accompanied by shift in investor perception on Europe and China, especially after Germany’s pledge to embark on large-scale defense spending. “The news flow from the US economy is likely to undershoot the rest of the world in coming months,” Citigroup strategists wrote. They downgraded their view on US stocks to neutral from overweight, ditching a position they had held since October 2023. Earlier, HSBC strategists also cut their view on US stocks, raising their European equity rating instead.\nMeanwhile, Trump’s meeting with the Washington-based Business Roundtable will include CEOs from around the country, including the bosses of Wall Street lenders, Bloomberg reported. Given the increasingly uncertain outlook for the US economy and trade war concerns, investors will watch for any signals from Trump on the likelihood of tariff-policy shifts or support for equity markets. According to Goldman's Delta One team, even an acknowledgement of market conditions by the president during this meeting, \"would be enough for a bear market rally.\"\n“What is being questioned in the market is US exceptionalism,” said Aneeka Gupta, head of macroeconomic research at Wisdom Tree UK Ltd. “When Trump came back into the White House, the focus on was on the positive impact of his policies, but now the market is really drilling down into the negatives.”\nEuropean stocks retreated for a fourth straight session as worries about a faltering US economy fueled a global selloff, with the region’s travel and airline stocks sliding after US airline Delta cut its 1Q profit expectations. Travel and health care underperformed, pulling the Stoxx 600 down by about 0.2%. The DAX outperformed regional peers, adding 0.6%, after Bloomberg reported that Germany’s Greens are ready to negotiate and are hoping for an agreement by the end of this week in a dispute over defense spending. Here are the biggest movers Tuesday:\n- Redcare Pharmacy shares surge as much as 18%, the most since May 2022, after the online pharmacy provided a 2025 outlook that pleased analysts, with peer DocMorris rising as much as 8.4%\n- Volkswagen shares rise as much as 3.7% to their highest intraday value in nine months. The German carmaker’s full-year results are called strong by JPMorgan, highlighting working capital\n- Rotork shares rise as much as 6.9% after reporting 2024 results that beat expectations, with signs of improved momentum in the latter-half of the period leaving the actuators manufacturer in good shape\n- Sensirion shares advance as much as 13% as the sensor maker delivers results which analysts say represent a significant beat. JPMorgan says estimates for FY25 may increase by almost 30%\n- Prysmian shares rise as much as 4.2% after UBS upgrades its recommendation to buy, saying that recent declines related to a broader unwind of the AI trade has created an attractive entry point\n- Burberry shares rise as much as 3.9% after BNP Paribas Exane upgraded the luxury goods stock to outperform from neutral, citing the firm’s refocus on heritage products under CEO Joshua Schulman\n- Henkel shares fall as much as 7.6%, the most in almost three years, after the company reported 4Q results that fell short of expectations and issued a warning for negative consumer volumes in 1Q\n- Partners Group shares gain as much as 2.4% after the Swiss private equity company reported better-than-expected results due to higher fees. Analysts will focus on Partners Group first CMD\n- European travel stocks slide, tracking declines in US peers after Delta Air Lines cut its profit expectations for the first quarter on weakening travel demand\n- Galderma shares drop as much as 6.7% to a three-month low after shareholders sold a stake of roughly 6.3% in the Swiss skincare group at a discount to Monday’s close\n- PolyPeptide shares drop as much as 11%, the most since June, after the Swiss biotech reported 2024 revenue that missed estimates and gave a wide guidance range for 2025 that RBC said implies cuts\n- Traton falls as much as 5% as Kepler Cheuvreux cuts its recommendation on the truckmaker to reduce from hold a day after results; Kepler notes Traton the US market is recovering slower than anticipated\nEarlier in the session, Asian stocks also slumped, taking cues from the tech-led sell-off stateside. Nikkei 225 retreated following disappointing Household Spending and revised Q4 GDP data from Japan. Hang Seng and Shanghai Comp conformed to the negativity amid light catalysts and as the NPC concludes today. ASX 200 was dragged lower by underperformance in tech and with most sectors in the red aside from energy and some defensives, while improved consumer confidence and mixed business surveys did little to inspire a rebound.\nIn FX, the Bloomberg Dollar Spot index fell 0.3%. The haven FX rally falters, as JPY and CHF flip to be the weakest performers in G-10 FX. NOK and SEK outperform. The euro was the biggest gainer, strengthening 0.6% as German lawmakers are expected to reach an agreement over additional spending.\nIn rates, Treasuries drop with the 10-year yield rising 4bps to 4.24% ahead of US job openings and layoffs data. German bond yields rise across the curve, led by the 10-year. Comparable gilts are little changed. Peripheral spreads tighten to Germany with the 10y BTP/Bund narrowing 2.7bps to 110.4bps.\nIn commodites, crude futures advance. WTI drifts 1% higher to near $67. Most base metals trade in the green. Spot gold rises roughly $25 to trade near $2,914/oz. Spot silver gains 1.4% near $33. Bitcoin rebounds, climbing above $81,000.\nMarket Snapshot\n- S&P 500 futures up 0.4% to 5,641.25\n- STOXX Europe 600 little changed at 546.15\n- MXAP down 0.7% to 185.10\n- MXAPJ down 0.5% to 580.83\n- Nikkei down 0.6% to 36,793.11\n- Topix down 1.1% to 2,670.72\n- Hang Seng Index little changed at 23,782.14\n- Shanghai Composite up 0.4% to 3,379.83\n- Sensex little changed at 74,134.83\n- Australia S&P/ASX 200 down 0.9% to 7,890.10\n- Kospi down 1.3% to 2,537.60\n- German 10Y yield little changed at 2.86%\n- Euro up 0.6% to $1.0897\n- Brent Futures up 0.4% to $69.55/bbl\n- Gold spot up 0.7% to $2,907.92\n- US Dollar Index down 0.41% to 103.48\nTop Overnight news\n- The conservative House Freedom Caucus backed a stopgap funding package, bolstering Speaker Mike Johnson’s attempt to pass the bill without the help of House Democrats and avert a government shutdown on March 15. BBG\n- Trump has made calls to undecided House Republicans and will continue to work the phones today. Trump is reportedly \"all in\" and “Members can’t be on the wrong side of this.” said a House Republican. Speaker Johnson has multiple holdouts. Rep. Massie (R) the only public no, although there are others on the fence. Reps. Cammack (R) and Duyne (R) raised concerns about the measure during a GOP whip meeting on Monday: Punchbowl\n- Trump was reportedly making calls to potential holdouts on a plan to avoid a government shutdown at the end of this week: Fox News.\n- House Minority Leader Jeffries said House Democrats will not be complicit in supporting the Republican government spending bill.\n- The Trump administration is prepared to enforce sanctions on Iranian oil production, Energy Secretary Chris Wright said. Treasury Secretary Scott Bessent also discussed pressure on Iran with his Saudi counterpart. BBG\n- Washington and Beijing have begun discussions about a potential “birthday summit” in June in the U.S. between President Trump and Chinese leader Xi Jinping. The latest talks on a potential summit in the month when both leaders celebrate birthdays signal a willingness from both sides to inject some goodwill in the relationship amid trade tensions that have unsettled markets and businesses. WSJ\n- Talks between the US and China on trade and other issues are stuck at lower levels, people familiar with the matter said, with both sides talking past each other and failing to agree on the best way to proceed. While representatives from the two countries have had contact, officials in Beijing say the US hasn’t outlined detailed steps they expect from China on fentanyl in order to have the tariffs lifted. Trump’s team rejects the assertion that it hasn’t given clear demands on fentanyl. BBG\n- Ukraine launched its biggest drone attack on Moscow, targeting the Russian capital and other regions, hours before a Tuesday meeting between senior U.S. and Ukrainian officials to discuss ways to bring an end to the war after more than three years of fighting. WSJ\n- Musk says DOGE is embedded in nearly every gov’t agency, and he wants to double headcount at the group as he ramps cost cutting initiatives throughout the federal government. NBC\n- Oracle shares fell premarket after reporting lackluster results and a profit forecast that missed. BBG\n- Airlines cutting guides… DAL -11% in pre-market.. Lowered 1Q guidance last night .. Guided EPS to $0.30-$0.50 vs. $0.70-$1.00 prior. Worse than expected, driven by domestic -- consumer and corporate. LUV -2.75% in pre-market on light volume: Lowers Q1 RASM guide to +2-4% on capacity down ~2% vs. Prior RASM guide of +5-7%. Roughly 1 pt of decrease is due to higher-than-expected completion factor, less government travel and a greater impact from the California fires. The remainder of the decrease is primarily attributable to softness in bookings and demand trends as the macro environment has weakened.\n- The BOJ probably won’t raise rates until June as it looks to maintain a pace of one hike every six months, despite recent speculation of an earlier move, former official Kazuo Momma said. BBG\nTariffs/Trade\n- US President Trump said on Truth Social that \"Despite the fact that Canada is charging the USA from 250% to 390% Tariffs on many of our farm products, Ontario just announced a 25% surcharge on “electricity,” of all things, and your not even allowed to do that. Because our Tariffs are reciprocal, we’ll just get it all back on April 2. Canada is a Tariff abuser, and always has been, but the United States is not going to be subsidizing Canada any longer. We don’t need your Cars, we don’t need your Lumber, we don’t your Energy, and very soon, you will find that out\".\n- Japanese Trade Minister Muto said he asked that Japan be exempt from tariffs in talks with US officials and did not get any assurance from the US that Japan will be exempted from US tariffs due to come into force on Wednesday.\n- South Korean acting President Choi said the time for negotiating with the US has begun ahead of reciprocal tariffs taking effect, while he added that President Trump's America First moves are targeting South Korea and the government will respond calmly and flexibly, considering only national interests.\n- Taiwan is said to launch an anti-dumping probe related to certain Chinese steel products and an anti-dumping probe related to beer from China.\nA more detailed look at global markets courtesy of Newqsuawk\nAPAC stocks took their cues from the tech-led sell-off stateside after the Nasdaq suffered its worst day since 2022 amid recession fears and tariff-related concerns. ASX 200 was dragged lower by underperformance in tech and with most sectors in the red aside from energy and some defensives, while improved consumer confidence and mixed business surveys did little to inspire a rebound. Nikkei 225 retreated following disappointing Household Spending and revised Q4 GDP data from Japan. Hang Seng and Shanghai Comp conformed to the negativity amid light catalysts and as the NPC concludes today.\nTop Asian News\n- Nissan Motor (7201 JT) CEO Uchida is set to step down.\nEuropean bourses are mixed, with price action fairly rangebound thus far. The DAX 40 (+0.7%) outperforms, as the region reacts to optimism surrounding German defence spending plans, whilst the FTSE 100 (-0.1%) is a little lower. European sectors are mixed; Real Estate is propped up by post-earning strength in Persimmon (+4.2%); Autos benefits from post-earning strength in Volkswagen (+2.5%) which reported robust FY results, but its guidance was not so optimistic. Travel & Leisure is the clear underperformer, as the sector reacts to Delta Airlines (-10% pre-market) cutting guidance, amid weak demand.\nTop European News\n- Barclays UK February Consumer Spending rose 1.0% Y/Y (prev. +1.9%) and UK Consumers' Confidence in household finance was the highest since the series began in 2015 at 75% (prev. 70%).\n- Germany's Greens reportedly made their own proposal to loosen defence spending, according to Bloomberg. Thereafter, the Green party co-leader says they are hopeful of a defence deal occurring this week.\n- ECB's Rehn says Europe needs common solutions to boost defence, Eurosystem's forecast and indicators of core inflation suggest that it will align with the 2% target. Bank of Finland estimates US tariffs on the EU and China could reduce global output by over 0.5% this year and next. Defence investments must be increased at a time when EU countries already hold large public deficits.\n- Riksbank's Thedeen says there are signs of a business cycle rebound, with GDP growth exceeding expectations in the second half of last year; early-year indicators remain mixed.\nFX\n- DXY is on the backfoot and trades towards the bottom end of a 103.40-92 range, with the trough for the session marking a fresh YTD low. The downside today stems from a slight unwinding of its haven appeal seen on Monday, but more pertinently, the resurgence in the EUR (discussed below). Ahead, markets will await US JOLTS Job Openings data.\n- EUR is the best performing G10 currency today, with commentary via a German Green party co-leader the main driver for the upside; the politician said that they are hopeful of a defence deal occurring this week. This follows on from reporting overnight via Bloomberg, which suggested that the Greens had made their own proposal to loosen defence spending. The Single Currency topped 1.09 earlier in the session and now looks to test the 5 Nov 2024 high at 1.0936. On the policy front, ECB's Rehn said if the data indicates, the Bank would hold rates in April. Ahead, today sees a busy ECB speaker slate, including the likes of President Lagarde, VP de Guindos, Lane, Villeroy & Escriva\n- JPY is the marginal underperformer today, alongside its haven peers CHF amid the modest improvement in sentiment. Overnight, USD/JPY was choppy owing to relatively disappointing Japanese GDP/Household spending metrics. The pair has been fairly unfazed by the Dollar weakness, currently trading in a 146.55-147.40 range.\n- GBP is on a firmer footing, with upside largely a factor of the broader Dollar weakness rather than UK-specific newsflow. Overnight saw a downtick in Y/Y BRC retail sales and a Y/Y slowdown in the Barclays UK February Consumer Spending report. However, these prints had no follow-through into the pound. As it stands Cable sits at the top end of a 1.2873-1.2941 range.\n- Antipodeans are both a little firmer, but to a lesser extent than the EUR and GBP, after marginal underperformance overnight.\n- PBoC set USD/CNY mid-point at 7.1741 vs exp. 7.2597 (Prev. 7.1733).\nFixed Income\n- USTs are essentially flat, but do hold a downward bias, as sentiment continues to incrementally improve in today's session, and in tandem with the pressure seen in Bunds (see below). Focus for traders today will be on US JOLTS Job Openings, remarks from US White House Press Secretary Leavitt and then President Trump thereafter. But before those remarks, a 3yr auction; as a reminder, the prior outing was strong, which stopped through the when issued by 1.3bps. USTs currently trading towards the lower end of a 111-11 to 111-25 range. If the pullback continues then USTs have a little bit of clean air until the 111-00 mark.\n- Bunds are pressured today and the underperformer amongst peers. Downside stems from comments via Germany's Green party co-leader who said they are hopeful of a defence deal occurring this week. This followed on from reporting overnight which that the Greens had made their own proposal to loosen defence spending. Bunds have been holding a bearish bias throughout the European session thus far, and currently at the day's trough at 127.04, just ahead of the 127.00 mark. Ahead, a 2027 Schatz tap and a slew of ECB speakers.\n- Gilts are modestly lower, but to a much lesser extent than Bunds. UK-specific newsflow remains light, and will likely to remain-so up until the region's GDP figures on Friday; more broadly however, PM Starmer held a cabinet meeting early doors which Politico reports is set to be focussed on the domestic agenda. This aside, European defence officials are due to meet in France today. Gilts currently in a 92.07-92.46 range, which marks a marginal new WTD low.\n- Guidance for the UK's 1.875% 2049 I/L Gilt benchmark reportedly +1.0 to +1.5bps, via Bloomberg citing sources. Orders for the UK 2049 I/L syndication are in excess of GBP 56bln, via Reuters citing a bookrunner; guidance +1.0 to +1.5bps.\nCommodities\n- Crude is on a firmer footing, after clambering off overnight lows which saw the complex modestly subdued. Upside today may stem from the a) weaker Dollar b) improvement in risk-tone (US indices look to open higher). Energy specific newsflow has been light this morning; more focus will be on Monday's remarks from US Energy Secretary Wright who said he is looking at working with Congress on cancelling mandated sales from oil reserve. Brent'May currently trades at the top end of a USD 68.63-69.72/bbl range. Energy traders will await the EIA STEO and then Private Inventory data thereafter.\n- Spot gold is back on a firmer footing, continuing the upward bias seen in APAC trade and amidst the broader Dollar weakness. XAU tested USD 2.9k overnight, and firmly topped the figure as the European session commenced; currently trading at the upper end of a USD 2,880.40-2,910.95/oz range.\n- Base metals hold a positive bias, given the slight improvement in risk sentiment seen in today's session, following a mostly subdued session overnight. 3M LME Copper is currently higher by just under USD 50/t, in a USD 9,460.95-9,602/t confine.\n- BofA expects platinum to outperform Palladium going forward, expect a Platinum deficit and Palladium surplus for 2025. Lingering concerns over trade disputes may mean that PGMs get stranded in the US for a bit longer, potentially limiting liquidity in other markets.\nUS Event Calendar\n- 06:00: Feb. SMALL BUSINESS OPTIMISM 100.7, est. 101.0, prior 102.8\n- 10:00: Jan. JOLTS Layoffs Rate, prior 1.1%\n- 10:00: Jan. JOLTS Layoffs Level, est. 1.81m, prior 1.77m\n- 10:00: Jan. JOLTS Quits Rate, prior 2.0%\n- 10:00: Jan. JOLTS Quits Level, est. 3.18m, prior 3.2m\n- 10:00: Jan. JOLTS Job Openings Rate, est. 4.5%, prior 4.5%\n- 10:00: Jan. JOLTs Job Openings, est. 7.6m, prior 7.6m\nDB's Jim Reid concludes the overnight wrap\nTonight sees a big Liverpool Champions League match. However, it annoyingly clashes with Maisie's school parents evening. After much discussion I told my wife we'll record it..... I'll then watch it back when I've finished with the football.\nOn a serious note, you wouldn't want to watch a re-run of yesterday's session as the risk-off move showed no sign of abating with the S&P 500 (-2.70%) posting its worst day YTD for the third time in six sessions while the NASDAQ (-4.00%) saw its worst day since 2022. The moves cascaded across global markets, and the Magnificent 7 (-5.41%) even moved into bear market territory, having now shed more than -20% since its peak back in December. Even before the tariff news escalated this month, the Mag-7 had been underperforming. In February when the S&P 500 was down -1.42% the Mag-7 declined -8.77%. I think the Deep Seek news was much bigger than people gave credit for after the initial attention calmed down. The epic valuations have also contributed. Indeed you can see these extreme valuations, that were comparable to 2000, in my \"Deeply Seeking Comparison to 2000\" chartbook from the end of January here. The massive and increasing capex required for AI has also gained more attention of late. A reminder of my note on capex boom and busts through history here.\nWithin the Mag-7, Tesla (-15.43%) saw its worst day since September 2020 and has now fallen by -54% since its peak back in December. It's now trading back to December 2020 levels. So it shows how quickly sentiment can change for such companies. The rest of the Mag-7 were down by between -2.4% and -5.1% yesterday. This included a -4.85% slide for Apple, which was its worst day since September 2022.\nWhile big tech led the losses, the slump broadened as the session went on, with cyclical stocks underperforming. The small cap Russell 2000 (-2.72%) closed at its lowest level since last June and the S&P 500 growth index (-3.80%) had its worst day since September 2022, with investors seemingly more wary on the risks of a downturn after Trump's comments over the weekend. In turn, volatility continued to escalate, with the VIX index (+4.49pts) closing at a new 2025 high of 27.86pts. Current losses for the S&P 500 (-8.62% from the peak) have now surpassed the moves last summer, when the index fell -8.49% from peak-to-trough. This now makes it the largest selloff for the S&P since 2023. And unlike last summer, yesterday did see the S&P 500 close beneath its 200-day moving average, which is the first time that’s happened since 2023 as well. This morning US futures initially fell a further percentage point but have subsequently rallied back with the S&P 500 and NASDAQ futures trading +0.26% and +0.15% higher respectively as I type.\nWith US equities losing ground yesterday and growth concerns mounting, that saw investors pour into US Treasuries with the 10yr yield falling -8.8bps to 4.21% and trading another -3.8bps lower in Asia this morning. Meanwhile, the 2yr yield (-11.6bps to 3.88%) yesterday saw its largest decline since the vol shock last August. This has come as investors have dialled up the chance of Fed rate cuts again, pricing in 84bps by the December meeting as I type, with a +12.6bps increase yesterday followed by another +1.2bps overnight.\nYesterday's bond rally was helped by the New York Fed’s latest consumer survey, which added to evidence of deteriorating US consumer sentiment. For instance, the share of households expecting a worse financial situation one year from now rose to 27.4%, the highest since November 2023. On the other hand, the survey's inflation expectations signal was broadly steady in February, with the 1yr measure up just a tenth to 3.1%, and the 3yr and 5yr measures unchanged at 3.0%. So it didn’t repeat the huge surge in the University of Michigan’s survey, providing some reassurance against fears that inflation expectations are becoming unanchored and suggesting that growth concerns are now dominating over inflation ones. On a related topic, our US economists yesterday published a timely report discussing the hawkish and dovish considerations that are likely to influence the Fed's response to the evolving policy mix and upcoming dataflow.\nOver in Europe, the main news came from Germany, after the Green Party said they wouldn’t support the proposal from the CDU/CSU and the SPD to amend the constitutional debt brake to unlock funds for defence and infrastructure spending. That’s significant, because a constitutional amendment requires a two-thirds majority, hence support from the Greens will be required, even though they’re not a part of the coalition talks. This likely represents a negotiating stance given that the Greens have previously supported much higher spending and an amendment of the debt break but the reforms are not a done deal yet, as it needs to be passed with two-thirds majorities in the Bundestag and Bundesrat. Later in the evening, the Greens proposed raising the threshold above which defence spending is exempt to 1.5% instead of the 1% proposed by the CDU/CSU and SPD, which in effect would lower the budget room available for other projects. Our German economists put out a note yesterday looking at the procedural hurdles and the key sources of uncertainty, and even though their base case remains for the reforms to pass, it’s unlikely to be a smooth passage.\nDespite these latest hurdles, markets didn’t experience too big a reaction. That’s because talks are still happening between the various sides, so investors are anticipating that some sort of deal will be reached in the end. So even though yields on 10yr bunds moved about -3bps lower intraday when the news came out, they swiftly pared back the move. By the end of the session, yields on 10yr bunds (-0.2bps), OATs (-1.0bps) and BTPs (+0.7bps) were all little changed. And there was a continued steepening in the German yield curve, with the 2s10s up to 61.5bps, the steepest since July 2022.\nIn the meantime, European equities came under fresh pressure yesterday, building on their declines from last week even if they out-performed the US. That meant the STOXX 600 (-1.29%) fell to a one-month low, having hit an all-time high only a week earlier. As in the US, tech stocks led the declines, with the STOXX Technology index down -3.12%. At the country level, the German DAX (-1.69%) saw the biggest losses, meaning the index is now down -3.41% over the last two sessions.\nLooking at other asset classes, the selloff was pretty consistent across the board. Credit spreads saw a noticeable widening, with US HY spreads (+19bps) posting their biggest daily jump since August, and also reaching their widest level since September. Oil prices lost ground too, with Brent crude (-1.53% to $69.28/bbl) closing at its lowest level since September. And Bitcoin took a fresh hit, falling -4.59% to close beneath $80,000 for the first time since November, and leaving it over 25% beneath its closing peak in January.\nThe global equity sell-off has continued in Asia but we're well off the lows of the session as US futures have rebounded after a difficult open. Across the region, the KOSPI (-1.14%), Nikkei (-1.01%), Hang Seng (-0.80%), the CSI (-0.44%) and the Shanghai Composite (-0.36%) are all down but have rallied back as the morning has progressed.\nEarlier, Japan’s household spending rose +0.8% y/y in January worse than the +3.7% market forecast and down from a +2.7% increase the prior month. Meanwhile, the final Japanese Q4 GDP slowed to +2.2% on an annualized basis (v/s +2.8% expected). On a q/q basis, GDP expanded +0.6% (v/s +0.7% expected), compared to the +0.7% growth in preliminary data released last month. Despite the downward revision of Japan's Q4 GDP figures, the Japanese yen has continued its upward trend against the dollar, reaching a new multi-month high of 147.01, gaining +0.18%. Meanwhile, 10-year JGBs are -6.9bps lower, catching down with the US move, and are at 1.50% as we go to print.\nTo the day ahead now, and US data releases include the JOLTS report of job openings for January, along with the NFIB’s small business optimism index for February. Otherwise from central banks, we’ll hear from the ECB’s Rehn.",
  "word_count": 5078,
  "scraped_at": "2026-02-14T01:49:31.516368",
  "_text_extracted": true
}