{
  "article_id": "823383337293",
  "url": "https://www.caughtoffside.com/2025/02/09/tottenham-looking-raid-london-rivals-adam-wharton/",
  "title": "Tottenham want to sign Adam Wharton",
  "date": "20250209T204500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are keen on signing the Crystal Palace midfielder Adam Wharton.\nA report from Football Transfers claims that they could look to sign the 21-year-old England international at the end of the season. He has been linked with Arsenal and Liverpool.\nWharton has established himself as one of the best young prospects in the Premier League, and he could prove to be a quality long-term acquisition for Tottenham. They could face competition from Manchester City as well.\nThe North London club needs to add more quality and depth to their midfield unit. Wharton is already well settled in the Premier League with Crystal Palace and he could make an instant impact at Tottenham.\nThe English midfielder joined Crystal Palace from Blackburn in January 2024, and it remains to be seen whether the Eagles are prepared to let him leave. He is a prized young prospect and the London club will not want to lose him any time soon. Tottenham might have to pay a premium in order to get the deal done. The player has a long-term contract at Selhurst Park and Crystal Palace are under no pressure to sell him right now.\nTottenham need midfield additions\nSpurs will need to improve their squad if they want to fight for trophies and qualify for the Champions League regularly. Signing a quality midfielder who will help out defensively and add composure to the side could prove to be a wise decision. The 21-year-old is a young talent, and he will only improve with coaching and experience. Tottenham could nurture him into a future star.\nThe 21-year-old could be attracted to the idea of joining a big club and Tottenham will be an attractive destination. They have a talented squad and an ambitious project. They could provide him with the platform to fight for trophies in the coming season. However, agreeing on a deal with the Eagles could prove to be very difficult.",
  "word_count": 322,
  "scraped_at": "2026-02-14T01:49:18.061697",
  "_text_extracted": true
}