{
  "article_id": "8244f3f0bd12",
  "url": "https://theathletic.com/4742743/2023/08/02/arsenal-turner-forest-usmnt/",
  "title": "Matt Turner is first choice for the USMNT – but where does his club future lie ? ",
  "date": "20230802T193000Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After a summer in which he underlined his value on the international front, Matt Turner arrives back in England at a crossroads.\nThe goalkeeper played a huge part in helping the USMNT reach the Gold Cup semi-finals with two saves in their quarter-final penalty shootout win over Canada.\nThose heroics cemented his role as the main man for his country. But, as attention turns to his future on the domestic front, the 29-year-old is less certain of where he must go to enjoy that same job security this season.\nAdvertisement\nTurner’s future at Premier League club Arsenal is unclear. Since joining from New England Revolution in June 2022, he has been second choice to England’s Aaron Ramsdale — who started all of the London club’s league games last season.\nThe New Jersey native had to make do with five Europa League appearances, in which he kept three clean sheets, and a couple of games in the early rounds of the FA Cup.\nEven if he accepted from the start that his backup job at the Emirates would be “making him (Ramsdale) a better goalkeeper and to push him to be his best”, it seems even that role is now under threat.\nThe Athletic’s David Ornstein reported on Sunday that Arsenal are exploring a deal to sign Brentford goalkeeper David Raya. The north London side want to recruit the Spain international to compete alongside Ramsdale for a starting place as they confront a return to the Champions League for the first time since 2016-17.\nThere is also interest in Raya from Bayern Munich, who want to take him initially on loan. But the highly rated Spaniard is believed to prefer the option of staying in London.\nAt the same time, Turner is being considered by Nottingham Forest as one of their two planned goalkeeping additions.\nAlthough there is some distance between the clubs’ valuations and no guarantee a move will be agreed, Arsenal know Forest are looking at Turner and dialogue continues.\nBut the option of a move to the City Ground, and a club which narrowly avoided relegation last season, would not necessarily mean the chance to play the regular first-team football Turner would relish ahead of next summer’s Copa America, and the 2026 World Cup — with both tournaments to be held in the United States.\nThat is because Forest are also pursuing another goalkeeper in Manchester United’s Dean Henderson, who impressed on loan with them last season, making 18 starts before an injury in January ended his campaign. Forest have also considered Wolves shot-stopper Jose Sa, so Turner would not be guaranteed to go straight in as first choice even if that move to the East Midlands materialised.\nAdvertisement\nIt leaves plenty for the man with 32 USMNT caps to mull over. Speaking after the national side’s defeat by Panama in their Gold Cup semi-final, Turner said playing in the competition had given him “the childish joy of playing back” and that he remains confident he “can make teams better”.\nEarlier in the competition, following the shootout win over Canada, he described that game as “one of the best nights of my playing career” and added on Instagram that he was “overwhelmed with the love” being flung his way.\nHe has also gone on record about how much he enjoys working under Arsenal manager Mikel Arteta, and how he improved over a season spent at a club challenging for major honours, even if his own impact on the pitch was relatively minimal. His game will have progressed while training with Arteta’s squad — a group which has been added to significantly over the summer in anticipation of their return to UEFA’s elite club competition.\nHowever, Turner’s former Revolution coach Brad Friedel summed up his dilemma when considering the national team’s options back in February.\n“Look at Matt’s competition for the national team spot,” he told the Sporting Post. “He was the No 1 (with Revolution in MLS) then and he’s gone all this time without playing, but Zack Steffen, who wasn’t getting a game at Manchester City, is now playing well for Middlesbrough.\n“They are possible promotion candidates and, all of a sudden, with Zack playing at a high level in the Championship and potentially in the Premier League and he’s playing every week whilst Matt is on the bench, then you’re looking at another change in who is the No 1 keeper for the USMNT.\n“I think that Matt, no matter what — even though Arsenal are an incredible club — has to find consistent football somewhere. This season, fine, but if he’s not going to be the No 1 he has got to go. The only issue is that he’s on a long contract and, if you’re Arsenal, why would you let him go? You’ve got an incredible goalkeeper, an incredible guy, a great worker, you have one of the best No 2s on the planet.\nAdvertisement\n“I think it’s a tough position. I’d like for the U.S. side of things, for Zack Steffen to be playing, for Ethan Horvath to be playing (which he is) and for Matt Turner to be playing so there is great competition because that makes everyone better.”\nFriedel’s comments have dated slightly in the period since, but the sentiment behind them remains relevant.\nSteffen made 45 appearances for Middlesbrough, who ended up beaten in the Championship play-off semi-final, while Horvath, on loan from Forest, ended up playing a huge part in Luton’s subsequent promotion to the top flight. His 51 games over the course of the campaign culminated in the play-off victory at Wembley.\nSteffen ended up playing 4,050 minutes of club football. Horvath topped that with 4,620.\nTurner managed 630 at Arsenal.\nTurner could only wish to have played such an influential part in Arsenal’s exciting campaign but, regardless of that contrast, his international team-mates do not find themselves in hugely better circumstances this summer.\nSteffen must decide whether to leave parent club Manchester City for good or seek another loan if he is to secure meaningful game time in the season ahead, while Luton have opted against signing Horvath permanently. He returned to Forest earlier in the summer and could, ironically, be faced with ending up as second or third choice behind Turner if that scenario were to play out.\nTurner has not been able to pull on an Arsenal jersey in their pre-season so far, including the tour of the U.S., after being rested for games against the MLS All-Stars, Manchester United and Barcelona in his homeland. He was in the Arsenal matchday squad for Wednesday’s 1-1 Emirates Cup draw with Monaco, but was not called from the bench.\nHe has been far from inactive over the summer, though — playing seven times for the USMNT, starting with their CONCACAF Nations League success before featuring in all their Gold Cup matches. There was time to make a proud entry in the history books for his country too, becoming the fastest goalkeeper to reach 20 USMNT clean sheets and 20 wins.\nAdvertisement\nIt is clear what playing for the USMNT means for Turner, and recapturing the joy of regular football this summer may push him towards choosing the path which leads away from north London.\nHe needs to find a home where he can enjoy that same feeling every weekend.\nGO DEEPER\nAssessing the USMNT key players and contenders whose club futures have been in doubt\n(Top photo: Mike Janosz/USSF/Getty Images for USSF)",
  "word_count": 1245,
  "scraped_at": "2026-02-14T02:00:36.687753",
  "_text_extracted": true
}