{
  "article_id": "8267a8bd1b16",
  "url": "https://www.prokerala.com/news/articles/a1625780.html",
  "title": "Lothar Matthaus braces for emotional Champions League QF clash between Bayern and Inter",
  "date": "20250415T140000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Berlin, April 15 : Lothar Matthaus is bracing for an emotional Champions League night. The German football legend acknowledged the personal weight of Wednesday's quarterfinal second leg between Bayern Munich and Inter Milan.\n\"This match splits my heart in two - I'll be grieving for whichever side falls,\" said Matthaus, 64, who played for both clubs during his illustrious career.\nThis evening, the German record international expects another dramatic chapter in the storied rivalry between these European giants, reports Xinhua.\nInter carries a narrow 2-1 advantage from the first leg in Munich, while Bayern fans cling to hopes of another Champions League miracle.\n\"There have been miracles before,\" recalled the 1990 World Cup winner.\nBayern has pulled off four historic comebacks on Italian soil - more than any other club has managed against Inter at the San Siro.\nFor Matthaus, memories remain vivid from the 1988-89 UEFA Cup knockout stage, when he battled through an intense Round of 16 clash as an Inter player.\nThe clubs share a rich history of crossover legends - from players like Jurgen Klinsmann, Andreas Brehme and Karl-Heinz Rummenigge, to managers like Giovanni Trapattoni, who coached both sides. Matthaus' own back-and-forth transfers added to that legacy.\nThe 1990 European and 1991 World Footballer of the Year believes Bayern's attack needs sharper finishing - and a spark from veteran Thomas Muller - to overturn the deficit.\nAt 35, Muller has emerged as a crucial figure, even as the club has decided not to extend his contract beyond this summer.\n\"He must start. Anything else is unimaginable,\" said Matthaus, who won the UEFA Cup with Inter in 1991 and Bayern in 1996.\nCurrently a TV pundit, Matthaus warned of \"stormy times ahead\" for manager Vincent Kompany and sporting director Max Eberl if Bayern fails to reach the Champions League final, set for May 31 in Munich.\nMeanwhile, Muller's potential return to the starting XI has become the dominant storyline heading into Wednesday's showdown.\n\"Thomas can be of great help,\" said Bayern supervisory board member Rummenigge, 69, the first Bavarian to join Inter, in 1984.\nWhile acknowledging Inter as favorites, he added: \"Bayern remain capable of advancing if they deliver a complete performance.\"\nAnd Muller? \"He showed a great reaction after the news came out; his Bayern time is coming to an end,\" Rummenigge said.\nMuller has declined to speak about his future, but made his focus clear: \"I am a competitive footballer. All that's on my mind is getting to the final.\"\nWhile a home final could be a fairytale sendoff for the club legend, speculation is growing around a potential move to Italy. Former Bayern assistant Massimo Morales - who worked under Trapattoni - suggested Inter could pursue Muller post-Munich.\n\"They target experienced free agents. Arnautovic proved that model. Muller could be their next masterstroke,\" Morales said.\n\"For changing a game's momentum in the final 20 minutes, there's no one better.\"",
  "word_count": 485,
  "scraped_at": "2026-02-14T02:18:17.723799",
  "_text_extracted": true
}