{
  "article_id": "82841a30fda2",
  "url": "https://metro.co.uk/2025/04/28/embarrassing-gary-lineker-slams-real-madrid-star-barcelona-defeat-22983958/",
  "title": "  Embarrassing  - Gary Lineker slams Real Madrid star after Barcelona defeat",
  "date": "20250428T074500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Gary Lineker branded Real Madrid ‘embarrassing’ following their antics during the Copa del Rey final defeat to Barcelona, singling out Antonio Rudiger for criticism.\nJules Kounde fired home an extra-time winner as Barca came from behind to beat Madrid 3-2 in a remarkable Clasico on Saturday.\nChampions League semi-finalists Barcelona led at half time through Pedri’s first-half goal but found themselves behind late in normal time after Kylian Mbappe and Aurelien Tchouameni scored two quick goals.\nFerran Torres’ late equaliser sent the Copa del Rey final to extra-time and Kounde settled the affair with a late screamer as penalties beckoned.\nReal Madrid, who are enduring a rare difficult spell under Carlo Ancelotti, lost their cool in the dying minutes and Rudiger, Lucas Vazquez and Jude Bellingham were all sent off.\nRudiger’s dismissal was the most shocking, with the former Chelsea defender held back by several team-mates and appearing to throw ice cubs in the direction of the referee, something he has since apologised for.\nEx-England and Barcelona striker Lineker was shocked by Real Madrid’s conduct at the end of a fiery El Clasico, describing the antics as ’embarrassing’ and ‘degrading’.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nSpeaking on The Rest is Football podcast, Lineker said: ‘The Copa del Rey was an interesting game!\n‘It was fraught with brilliance, it was a cracking game and then it all went a little t*** up for Real Madrid.\n‘I think they’ve lost their minds a little bit because they’re struggling. It’s a bit degrading, a bit embarrassing for the club.\n‘We saw the stuff with Vinicius when Rodri won the Ballon d’Or, it lacked a bit of class. And they lost their heads completely in this game.\n‘Antonio Rudiger got a red card and was throwing ice cubes or something at the referee. Real Madrid are better than that.\n‘Everyone has moments but they need to have a little word with themselves. It’s hard when you’re so used to winning, dealing with defeat is not always easy.’\nReferencing Rudiger’s behaviour on the touchline, ex-Manchester City defender Micah Richards added: ‘It’s embarrassing. That’s embarrassing.\n‘Real Madrid are a top club and they have values. They’re winners but you can’t act like that.’\nRudiger looks set for a huge ban following his implosion and was quick to apologise to the officials for his behaviour.\nHe said: ‘There’s definitely no excuse for my behaviour last night. I’m very sorry for that. We played a very good game from the second half on.\nMore Trending\n‘After 11 minutes I was not able to help my team anymore and before the final whistle I did a mistake.\n‘Sorry again to the referee and to everyone I have disappointed last night.’\nReal Madrid are enduring a difficult run under Ancelotti, who is expected to leave the Bernabeu this summer to manage the Brazil national team.\nLos Blancos were knocked out of the Champions League by Arsenal – losing 5-1 on aggregate – and are four points behind La Liga leaders Barcelona.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Karen Carney names ‘favourite’ to win Champions League final as Arsenal book Barcelona meeting\nMORE: Why Kylian Mbappe is on bench for Real Madrid vs Barcelona in Copa del Rey final\nMORE: Who is the Barcelona vs Real Madrid referee? Everything we know following controversy",
  "word_count": 617,
  "scraped_at": "2026-02-14T02:09:01.854477",
  "_text_extracted": true
}