{
  "article_id": "829d10b22496",
  "url": "https://thepeoplesperson.com/2024/05/28/casemiro-set-to-meet-manchester-united-board-ahead-of-summer-departure-as-two-new-clubs-enter-the-fray-280890/",
  "title": "Casemiro set to meet Manchester United board ahead of summer departure as two new clubs enter the fray - Man United News And Transfer News",
  "date": "20240528T180000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United emerged victorious at Wembley against cross-town rivals Manchester City and clinched their 13th FA Cup title on Saturday.\nThe odds were firmly against the Red Devils considering their dismal league finish and the fact that the build-up to the game was all about the potential sacking of manager Erik ten Hag.\nHowever, on the day, the Dutchman employed the perfect gameplan as the 20-time English league champions hardly allowed Pep Guardiola’s men the space to play their usual passing game.\nThe former Ajax coach also took the gamble of starting Sofyan Amrabat instead of Casemiro and the ploy worked a treat as the Moroccan had his best game in a red shirt.\nCasemiro unhappy after FA Cup final snub\nThe Brazilian was expected to start after the Fiorentina star’s average showing against Brighton in the last league game of the season.\nHowever, after some confusion regarding the teamsheet, Ten Hag told media that the former Real Madrid superstar was not fully fit and hence dropped out. Those claims were quashed by Brazilian media.\nThe defensive midfielder was not in his usual jubilant mood after the game and he departed on holiday instead of joining his teammates in the post-match revelry.\nThe Peoples Person claimed that a move away seems to be the most likely option but there are question marks regarding Al-Nassr‘s ability to cough up the asking price set by INEOS for the midfielder.\nGoal Brasil have claimed that Casemiro is expected to meet the United hierarchy to decide the future course of action. It has already been reported that Sir Jim Ratcliffe is not the biggest fan of the money that the club spent to sign the five-time Champions League winner.\nThe 32-year-old earns £350,000 per week (as per capology) in Manchester and INEOS are keen to get those off the table.\nInterestingly, the report also claimed that two Saudi clubs are in the lead ahead of Cristiano Ronaldo’s team, Al Ahli and Al-Qadisiyah, both of whom are prepared to increase the Brazil international’s wages.\n“GOAL anticipates that Casemiro and Manchester United directors will hold a meeting to define the future of the midfielder.\nExit on the cards\n“The expectation is that it will seal the end of the marriage between club and player, symbolizing one of Sir Jim Ratcliffe’s first decisions at the head of the institution’s football.\n“Sources confirmed to GOAL that Al Ahli and Al-Qadisiyah would be the two teams most willing to invest in the Brazilian at this time.\n“The main question, of course, is the financial issue: the understanding is that they would not only match Casemiro’s current salary in Manchester, but also put an even more lucrative proposal on the table.”\nIt has been a short but successful stint in England for Casemiro and while he was certainly one of the signings of last season, this campaign has been hugely difficult for the midfield general. An exit seems to be the best outcome for both parties.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 517,
  "scraped_at": "2026-02-14T01:48:52.519481",
  "_text_extracted": true
}