{
  "article_id": "82bf281c26c1",
  "url": "https://www.fourfourtwo.com/news/chelsea-fans-turn-on-team-despite-treble-hopes-being-on-track",
  "title": "Chelsea fans turn on team despite treble hopes being on track",
  "date": "20250429T203000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea fans turn on team despite treble hopes being on track\nChelsea were knocked out of the Champions League in embarrassing fashion and supporters have hit out at the team\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nChelsea have had a good season under new manager Sonia Bompastor with the Blues still on track to win the treble this campaign.\nHowever, the trophy they wanted the most has evaded their grasp once again in the Women's Champions League. The club reached the semi-finals but were knocked out 8-2 on aggregate by holders Barcelona.\nThe result was embarrassing for the Blues, who have dominated in the Women's Super League this season. Criticism for the performances over the two legs has been fair as Chelsea did not perform at their best level but many fans seem to have turned against their own club because of the result.\nChelsea: What have fans been saying?\nAn array of supporters took to social media to share their thoughts after the losses to Barcelona which included getting rid of players and disappointment in Bompastor.\nOther than the defeats to Barcelona and a loss in the first leg of their quarter-final against Manchester City, Chelsea have not lost a game this season. They have registered three draws and 16 wins in the WSL, have reached the FA Cup final and won the League Cup final.\nBut their third loss of the season across all competitions saw some fans hit out at their team.\nOne fan wrote on social media: \"Now Overhaul the team\"\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nAnother said: \"Totally embarrassing. They should be ashamed\"\nAnd a third said: \"Paul Green [Chelsea's head of women's football], your future with the club is in question for the first time. Half of the players need to go and we must bring in proper talent. We can’t rely on inexperienced young players anymore. It’s hard to believe how far we’ve fallen. Last season we nearly overcame Barcelona.\n\"But the contrast between our current season and previous ones has been alarmingly poor. If you don't let go of half this squad to bring in better and more effective talent, then perhaps you should consider being replaced first. Enough is enough.\"\nWith another saying: \"Bompastor out\"\nAnd while a lot of the social media discussion was negative, there were some supporters who stuck by their team.\nOne said: \"Let's keep that unbeaten run in the league. Let's also do the domestic treble. Not a great result today but a great season for Sonia in her first season in charge.\"\nAnd another said: \"'No one died; we just lost a match.' I hope the players will be able to appreciate every single fan who came to cheer them up today because they deserve it.\n\"We would be back next season to try again to lift the prestigious trophy. And if not, we keep trying every other season.\"\nSarah joined the FourFourTwo team in September 2024 in a freelance role. She also writes for The Guardian, BBC and Rugby World where she specialises in women's football and rugby. Sarah has a bachelors degree in English and a master's in newspaper journalism.",
  "word_count": 640,
  "scraped_at": "2026-02-14T02:09:01.851607",
  "_text_extracted": true
}