{
  "article_id": "82c6a7b80c30",
  "url": "https://www.caughtoffside.com/2025/06/12/leroy-sane-transfer-galatasaray-arsenal/",
  "title": "Leroy Sane transfer to Galatasaray over Arsenal explained",
  "date": "20250612T153000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Leroy Sane is on the verge of becoming a Galatasaray player after a lengthy transfer saga that resulted in a slightly unexpected outcome.\nSources close to the situation throughout have informed CaughtOffside that at various points there were bigger and more tempting offers on the table for Sane.\nStill, the Germany international is now close to being officially unveiled by Galatasaray, with the announcement expected after his medical today.\nSee the video below from Fabrizio Romano as Sane has already arrived in Turkey sporting a Galatasaray scarf as he and the club put the final finishing touches on the move…\n??? Leroy Sané has landed in Istanbul to join Galatasaray! pic.twitter.com/r0r63TZsC2\n— Fabrizio Romano (@FabrizioRomano) June 11, 2025\nSane made his final decision to join Galatasaray earlier this week, having rejected better money from Fenerbahce and Saudi Pro League club Al Hilal.\nThe 29-year-old also turned down a new contract at Bayern Munich for “personal reasons”, according to sources, while he was also genuinely keen on joining Arsenal.\nArsenal didn’t offer Leroy Sane enough money\nCaughtOffside understands Arsenal held talks with Sane and made him a written contract offer, but their offer was lower than other clubs.\nMoney was not the main motivating factor for Sane, as he ended up joining Galatasaray because they were able to guarantee him Champions League football.\nThat also made Arsenal appealing for Sane, and it’s understood he waited on a final decision in order to give them the chance to improve their offer.\nThis never materialised, however, and Sane is now on the brink of competing his move to Galatasaray.\nGalatasaray’s Sane surprise\nJournalist Buchi Laba told CaughtOffside: “At the start of the negotiations Galatasaray did not believe they could get Sane. It moved by 10% to 100% in months. Persistence pays.”\nThis is a statement signing by the Turkish giants, who have often punched above their weight in the transfer market.\nSane is an exciting arrival for this summer, following other big names like Victor Osimhen, Wilfried Zaha and Hakim Ziyech in recent years.",
  "word_count": 341,
  "scraped_at": "2026-02-14T01:58:41.944031",
  "_text_extracted": true
}