{
  "article_id": "82ccd11cb3b7",
  "url": "https://www.fourfourtwo.com/news/every-premier-league-player-linked-with-a-move-to-saudi-arabia",
  "title": "Every Premier League player linked with a move to Saudi Arabia",
  "date": "20230622T184500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Premier League players linked with Saudi Arabia: Every transfer that could happen this summer\nA whole host of Premier League players have been linked with clubs in Saudi Arabia this transfer window, with the Saudi Pro League looking to disrupt the market\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nPremier League players are constantly being linked with moves to Saudi Arabia, with clubs in the Middle Eastern country offering huge fees and contracts to some of the biggest names in football.\nN'Golo Kante, Kalidou Koulibaly, Edouard Mendy, Roberto Firmino and Ruben Neves have all swapped the Premier League for the Saudi Pro League this summer, and more stars from England's top flight seem destined to join them.\nIt doesn't just stop at players, though, with Steven Gerrard now the manager of Al Ettifaq. While Karim Benzema, Marcelo Brozovic and Celtic's Jota have all moved, too, Premier League players still seem more coveted for Saudi Arabia transfers.\nBelow, FourFourTwo details every player currently in England's top flight linked with a move to Saudi Arabia.\nPremier League players linked with a move to Saudi Arabia\nJordan Henderson\nAs reported by The Athletic's David Ornstein, England international Henderson is seriously considering a move to play for the man he replaced as Liverpool captain, Steven Gerrard. While some reports suggest he has agreed personal terms with Al Ettfiaq, the Saudi club haven't yet matched Liverpool's £20m valuation.\nFabinho\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nThe Brazilian is closing in on a move to Al Ittihad for £40m, where he will play alongside N'Golo Kante in the centre of the pitch. Fabinho didn't travel with the Liverpool squad for their pre-season training camp in Germany, and was given permission to discuss contract details with the side.\nAleksandar Mitrovic\nFulham have rejected a £30m offer from Al Hilal for their star striker, though the Serbian is reportedly open to a move if the two clubs are able to agree a deal. The BBC is suggesting that Fulham have no intention of selling Mitrovic this summer.\nAllan Saint-Maximin\nSaint-Maximin is in \"early discussions\" with a move to the Saudi Pro League, it has been confirmed. The Frenchman missed Newcastle United's pre-season game against Rangers, with Eddie Howe revealing why the 26-year-old didn't play.\n\"He's in early discussions over a potential move away. That's why he wasn't here,\" Howe said. \"It's doubtful he'll join us on the tour of America. I don't think Maxi necessarily wants to leave, but he may feel it's the right time for him to move.\"\nAlex Telles\nThe Manchester United full-back is due to join Cristiano Ronaldo at Al-Nassr for £4m, as announced by Fabrizio Romano. He won't be able to register for the side, though, after FIFA banned them from registering players until they pay Leicester City the required fee.\nCallum Hudson-Odoi\nTwo Saudi sides have approached Chelsea over signing Hudson-Odoi, according to Fabrizio Romano. The winger rejected a move there, though, instead electing to stay in England and fight for his place under Mauricio Pochettino.\nPhilippe Coutinho\nWith Gerrard the new manager of Al Ettifaq, the Daily Mail has linked Coutinho with another reunion with his former team-mate and manager. The Brazilian still as three years remaining at Aston Villa, though, and hasn't taken up any potential approaches from the Middle East so far.\nDavid De Gea\nFollowing his acrimonious departure from Manchester United, De Gea is now a free agent and exploring his options. Several clubs in Saudi Arabia have offered the Spaniard \"lucrative offers\", according to the Daily Star, and he could be about to accept them as his options elsewhere remain limited.\nJesse Lingard\nWhile no formal reports have suggested Lingard is set for a move to Saudi Arabia, the former Manchester United and Nottingham Forest man is open to playing in the Middle East.\n“I’m not really surprised big names are moving out there, they’re doing big things,\" Lingard said. \"It’s something I’m obviously going to consider as well, I’ve not ruled that out either. It’s just got to be right for me at the end of the day.”\nHakim Ziyech\nJust six months after a move to PSG fell through, Ziyech has reportedly already signed a three-year deal with Al-Nassr, the side Ronaldo currently plies his trade with. The 30-year-old struggled for consistent performances at Stamford Bridge during his three seasons at Chelsea, and will leave for just £8m.\nBernardo Silva\nDespite having just won the treble with Manchester City at the age of 28, Silva is reportedly on the verge of signing for an unnamed Saudi Pro League side for a considerable price tag. The Portuguese international still has two years remaining on his City deal, but has often been linked with a move to Barcelona or PSG. Both clubs look set to be snubbed, though, in favour of a more lucrative offer from the Middle East.\nSon Heung-min\nChampions Al-Ittihad reportedly bid more than £50m for Son in the transfer window, which the South Korean rejected in order to continue playing in his \"favourite league\".\n\"I have many things to do in the Premier League,\" Son said following the bid. \"Money doesn't matter to me now, and the pride of playing football, to play in my favourite league is important. I want to play more for Tottenham in the Premier League. I'll prepare well when I'm back to Spurs.\"\nMo Salah\nAccording to Hafez Al-Medlej, who has held positions running both the Asian Football Confederation and Saudi Pro League in the last few years, Liverpool star Salah is a target for Saudi Arabia. Al-Medlej confirmed that the Saudi revolution should not be limited to players at the end of their careers but also to those at the peak of their powers.\nWilfried Zaha\nZaha's contract at Crystal Palace expired at the end of June, causing multiple sides in the Saudi Pro League to offer him a lucrative contract. The 30-year-old has offers from elsewhere in Europe, though, including at Palace, and is taking his time in deciding his future.\nIt is believed he favours a move to a Champions League club.\nPierre-Emerick Aubameyang\nHaving fallen down the pecking order at Stamford Bridge, Chelsea are keen to sell Aubameyang in the current window. Al-Ahli and Al-Shabab have both made approaches, but the Gabonese striker is set to agree a deal with Marseille after being reluctant to agree to a Saudi move.\nHugo Lloris\nLloris skipped Tottenham's pre-season tour in order to find a move elsewhere, according to new manager Ange Postecoglou, and the French goalkeeper has reportedly been offered the chance to triple his wages in Saudi Arabia. Though he still has a year remaining on his deal at Spurs, Lloris wants to leave after more than a decade at the club.\nPSG have also reportedly expressed an interest.\nKyle Walker\nAfter growing frustrated with his inconsistent starts at Manchester City, Walker is suggested to be seeking new opportunities elsewhere. Teams from the Saudi Pro League are keen on acquiring his services, though other sides in the Premier League and even Bayern Munich have been linked.\nThomas Partey\nDespite proving an integral member of Mikel Arteta's side in the 2022/23 season, Arsenal have granted Partey permission to speak with Saudi sides over a potential deal this summer following the signing of Declan Rice. Reports have suggested the Ghanaian midfielder has agreed terms with a side in the Saudi Pro League, and his departure is imminent.\nRiyad Mahrez\nClubs such as Al-Ittihad and Al-Ahli are interested in buying Mahrez from Manchester City, with a potential £50m-per-year deal on offer should the Algerian opt to switch the Premier League for the Saudi Pro League.\nStill with a year remaining on his contract, Mahrez won't come cheap, though.\nRomelu Lukaku\nThe Belgian striker spent the 2022/23 campaign on loan at Inter Milan from Chelsea, and is focussed on a return to San Siro on a permanent deal. However, that hasn't stopped Saudi Arabian sides from offering him huge sums of cash. Lukaku has rejected these, though, instead hopeful of revitalising his career in Europe.\nJoao Moutinho\nMoutinho officially left Wolves upon the expiry of his contract at the end of June, and has been linked with Al-Ittihad and a reunion with his former manager Nuno Espirito Santo.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 1560,
  "scraped_at": "2026-02-14T01:56:02.430109",
  "_text_extracted": true
}