{
  "article_id": "82f470552f97",
  "url": "https://www.liverpoolfc.com/news/behind-badge-i-announced-rafa-manager-accident-25-years-telling-lfcs-stories",
  "title": "Behind the Badge :  I announced Rafa as manager by accident ! - 25 years telling LFC stories",
  "date": "20251217T123000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "FeatureBehind the Badge: 'I announced Rafa as manager by accident!' - 25 years telling LFC's stories\nIt's a story that almost sounds too good to be true.\nYou're an aspiring young journalist and Liverpool-mad supporter chancing your arm for an interview by knocking unannounced on the door at the club's training ground.\nSoon after pitching your request, the Reds manager himself invites you in for an exclusive, at-length chat.\nFor Mark Platt, what feels like a fantasy tale truly was reality - and became a stepping stone to almost 25 years' ongoing service with LFC itself.\n\"I was always obsessed with football, everything to do with it. I used to read everything about it,\" Mark, now the club's curator/historian, tells Liverpoolfc.com.\n\"I used to like English in school. So, that's what I wanted to do: sports journalism. I went on a journalism course at Liverpool Community College, which wasn't far from Melwood.\n\"A group of us, all Liverpool fans, were on a project and had to go out and bring a story back. I was like, 'Let's go to Melwood.'\n\"Graeme Souness was the manager, it must have been 1992 or 1993. We knocked on the gate and said, 'Can we speak to Graeme Souness? We're from the college.'\n\"The fella goes, 'Come in, lads. I'll go and speak to him.' He comes back and goes, 'He's going to get a shower and he'll come and speak to you when he's finished.'\n\"True to his word, Souness came out and must have given us a good half an hour, 40 minutes and we were firing all sorts of questions at him.\n\"We wrote the article up and actually sold it to a magazine. That obviously gave me the taste for it.\"\nIndeed, Mark and his peers went on to launch their own publication, Xtra Time, initially covering Merseyside sport.\nIt was subsequently commissioned by Mercury Press Agency and later focused solely on Liverpool, becoming a fortnightly release between 1993 and 1995.\n\"We'd be in the press box at Anfield reporting on games, it was a proper job but never felt like real work. We'd go to the away games, we'd be at Melwood nearly every day,\" he recalls.\n\"That was amazing as a grounding. Before it started, I could have gone to university to do journalism, I got a place.\n\"But then this was on offer. What do you do? 'I can't turn this down.' I would never change that.\n\"I've always had interest in the club's history, so I'd be interviewing former players. Building up knowledge, building up contacts. That was great.\"\nMark's love affair with Liverpool began, like many, by inheriting the passion from his father.\nLiving nearby Anfield during his early childhood helped ensure his colours were red rather than blue, too.\nSuch was the enormous impression football made on him, he believes he has a genuine memory of the 1974 FA Cup final - a 3-0 win for Liverpool over Newcastle United - despite being only a year old at the time.\n\"I don't know if it's even possible but I've got a vague memory of that final,\" he says. \"Of my dad coming home with a silk Newcastle scarf that he must have swapped.\n\"It could just be my mind playing tricks on me but it's there!\n\"I probably couldn't tell you what happened last week, but if there's something to do with a Liverpool match I probably do remember it.\"\nAnd his first experience of attending a fixture inside the stadium being one of the Reds' greatest ever performances only crystallised his fascination.\nSeptember 2, 1978: Liverpool 7-0 Tottenham Hotspur.\nHe says: \"You can't get much of a better introduction than that.\n\"I was in the Anfield Road end, my dad had made a little wooden stool and I was stood at the front.\n\"Then it grew from there, I started going to the match more regularly and it just became a way of life.\"\nIn March 2001, all of these strands merged together as Mark was employed as a journalist for LFC's newly launching official website.\nHe had undertaken a variety of jobs in the years since Xtra Time, from contributing to the club magazine to driving taxis to writing a book about the Reds' 1965 FA Cup triumph.\nNow, he was inside the camp as Gerard Houllier's team lifted five different trophies in a calendar year.\n\"A baptism of fire!\" he notes. \"Suddenly reporting on the FA Cup final, the UEFA Cup final.\n\"Then I was in Monaco for the Super Cup final in August. I remember being sat in the team hotel having a drink with Kenny Dalglish like, 'Woah, what is going on here?'\"\nMark would spend the next six years writing for the LFC website, a period that included one of the most unforgettable occasions in the club's history.\nHe was there in Istanbul and on match report duty as Rafael Benitez's Reds faced AC Milan in the 2005 Champions League final.\nIt represented a spectacular end to a season that had begun with a change in the dugout, Benitez arriving from Valencia to take over the reins from Houllier.\nIn a hazard of the job that this author can firmly attest to, Mark accidentally leaked the announcement of Benitez's appointment briefly to the world.\n\"We knew Rafa was being appointed but it was yet to be officially announced. I'd been off for a few days and due back in work on the Saturday,\" he details.\n\"On the Friday night, in preparation for the following day I logged on briefly to check which stories were waiting to be published.\n\"The story confirming Rafa as manager had been written in advance, so I went in to have a read, only to press the publish button by mistake! My heart sunk and I was like, 'What have I done?'\n\"I panicked, pressing all the buttons to stop it! Somehow it worked. No-one saw it and thankfully I got away with it. In this day and age it would be different, someone would be onto it straight away.\"\nA jump-scare to start the campaign, then, and there would be a breathtaking conclusion to it too.\nSo, how does - can? - a Kopite born and bred keep his cool while trying to write about his team emerging triumphant from possibly the most dramatic European Cup final ever?\n\"I always found it hard to separate myself from being a fan to being the journalist on duty, especially at a game like that which just meant absolutely everything,\" he admits.\n\"I was writing the final-whistle report. I'd done a bit of prep beforehand, scenarios if we'd won or lost.\n\"Three-nil down at half-time; gutted, felt like crying, felt like going home. Had to get on with it and get my report done.\n\"Then we're coming back and it gets to 3-3... we probably weren't the most professional in the press box, all jumping around and going mad!\n\"And then it was like, 'Oh, I've got the match report to do here!' It was amazing.\"\nYou have to accept cookies in order to view this content on our site.\nWatch on YouTubeMark's career path saw him transfer over to television production when the club launched its own in-house channel, LFCTV, in 2007.\nIn the years that followed, his enthusiasm for story-telling and history led to the creation of many documentaries and projects.\nHe helped to craft films and series that shone a light on legendary figures such as Elisha Scott, and iconic events in 100 Days That Shook the Kop.\nShows carried viewers back to special seasons such as the 1965 FA Cup glory and the 1985-86 Double win via unseen archive footage and new interviews.\nAnd the immense breadth of culture surrounding the Reds was celebrated in programmes exploring songs, banners, rivalries and occasions.\n\"Some of the massive moments in the club's history, people know the basics of it and read the stories, but they've never been told in-depth,\" says Mark.\n\"I loved doing that. Speaking to all the players, sourcing the footage - a lot of unseen footage - and piecing together a story.\"\nAs Mark neared a quarter-century within LFC, he embarked on another adventure in a different role.\nIt might not surprise you after what you have read so far that his current position is rooted in the Reds' rich past.\nHe recently became the club's official curator/historian, overseeing a wide range of incredible artefacts collected since 1892 and how they are stored and displayed across sites.\nMark was also involved in a revamp of the hugely popular LFC Museum, including a new exhibition toasting the Premier League title win of last season.\n- To visit the new and improved LFC Museum, which is included in all Anfield tours and experiences, book via liverpoolfc.com/stadium-tours\n\"It probably sounds a bit cliché but it's the dream job for me,\" he says.\n\"Even though all I did in the past, I loved and was great, this now is probably the perfect role for me.\n\"Liverpool's history is still what attracts people to the club. It's got that rich heritage and a romanticism about it, the stories of the past.\n\"That's not just Liverpool, any supporter might say that about their club and that's true.\n\"But Liverpool has so many stories, so many ups and downs. And I think it's those ups and downs that make it. If it was just success, it's not as captivating.\n\"And that goes back years - even how the club was founded, there's a dramatic story around that.\"\nThe catalogue naturally grows with items from each passing season as Liverpool contest fixtures and claim honours.\nThose organic additions sit alongside fresh discoveries from the archives regularly being made inside and outside the club.\n\"There's so much,\" says Mark. \"Supporters get in touch with us and sometimes it's stuff we might already have.\n\"But sometimes there's just something there that you go, 'Wow, I haven't seen that before.'\"\nThe latest finds and submissions include an international jersey of Scott's that is more than a century old, season tickets from 1897 and 1901, and a cigarette case that may have belonged to Tom Watson, the Reds' first league-winning manager.\nAnd while immersed in what's gone before, Mark's eye is always on the present and future too.\n\"My role now is to help preserve history,\" he finishes. \"And history is not just the ancient past. The last match was history. So it all builds up.\n\"A challenge for us now is to bring it to life and use new technology to make the stories more appealing to a younger audience. One recent example of this in the museum is a hologram that celebrates our 20 league titles, from 1901 to 2025.\n\"We must never lose sight of our origins and the factors that have made this club what it is. Our history and culture should be embraced and celebrated, nurtured as a source of inspiration for everyone at the club, and for future generations of Liverpudlians.\n\"To be entrusted to help play a part in that is a huge honour.\"\n- If you have any interesting items of memorabilia that you think may be of interest to the LFC Museum, please contact mark.platt@liverpoolfc.com",
  "word_count": 1881,
  "scraped_at": "2026-02-14T01:49:57.605329",
  "_text_extracted": true
}