{
  "article_id": "83116b302377",
  "url": "https://metro.co.uk/2024/08/27/72m-chelsea-flop-signs-new-contract-leaving-join-premier-league-club-21496601/",
  "title": "£72m Chelsea flop signs new contract before leaving to join Premier League club",
  "date": "20240827T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea goalkeeper Kepa Arrizabalaga has signed a new contract on reduced terms ahead of completing his loan move to Bournemouth.\nThe Spain international became the club’s record signing in the summer of 2018 when he joined following a £72 million transfer from Athletic Bilbao.\nKepa, however, struggled to hold down his place as the club’s No.1 under a succession of different managers.\nThe 29-year-old spent last season on loan at Real Madrid following an injury to Thibaut Courtois, but lost his place to Andriy Lunin following several high-profile errors.\nKepa returned to Stamford Bridge this summer but had been keen to leave in search of regular first team football.\nHis departure had been complicated by his huge salary but, according to Fabrizio Romano, he has signed a new deal on reduced terms that has helped facilitate a loan move to the Cherries.\nChelsea, meanwhile, have agreed the signing of 19-year-old goalkeeper Mike Penders from Belgian side KRC Genk.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nPenders will join the Blues next summer on a contract until 2032.\nPenders, a Belgium Under-19 international, only made his senior debut for Genk last month against Standard Liege, keeping a clean sheet in a goalless draw.\nHe will remain with Genk in the Belgian top flight for the rest of the season.\nChelsea’s main aim in the transfer window is to offload players from their squad so the club can balance its books, manager Enzo Maresca said on Tuesday.\nChelsea have been busy in the market since American owner Todd Boehly took over two years ago.\nThe West London club have spent over £160m pounds on 11 new signings for this season, including winger Pedro Neto, forward Joao Felix, midfielder Kiernan Dewsbury-Hall and goalkeeper Filip Jorgensen.\nMore Trending\nChelsea sold Conor Gallagher to Atletico Madrid and defender Ian Maatsen joined Aston Villa, but they still have over 40 senior players registered are at risk of falling foul of the Premier League’s profit and sustainability rules.\n‘The target is to solve the economic problem in terms of selling players,’ Maresca told the club website. ‘From there, we try to do our best and see where we arrive.\n‘For us, the target in this moment is to improve players. No one from the club asked me to compete for the Premier League, or compete for a Champions League spot.\n‘I want to see my team play the way we want to play, and compete every game. I want to see on the ball a clear idea of what they want, and off the ball, a very aggressive team. The most important thing is to be better game after game.’\nMORE: Everton make move for Manchester United flop but face competition\nMORE: Crystal Palace hatch plan to sign second Arsenal star after Eddie Nketiah\nMORE: Espanyol boss sends message to Arsenal over £25m signing",
  "word_count": 524,
  "scraped_at": "2026-02-14T01:57:35.666394",
  "_text_extracted": true
}