{
  "article_id": "837a6372e04b",
  "url": "https://www.kompas.id/baca/english/2024/04/17/en-dortmund-siap-rematch-lawan-psg-di-semifinal-liga-champions",
  "title": "Dortmund Ready to  Rematch  Against PSG in the Champions League Semifinals",
  "date": "20240417T064500Z",
  "domain": "kompas.id",
  "source_country": "Indonesia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This article has been translated using AI. See original.\nBy PRASETYO EKO PRIHANANTO\n17 Apr 2024 16:54 WIB · English\nDORTMUND, WEDNESDAY — Borussia Dortmund can't wait for the rematch against Paris Saint-Germain in the semifinal match of the Champions League. The two teams met in the group stage. At that time, Dortmund drew 1-1 at home and lost 0-2 away to Paris.\nDortmund secured a spot in the semifinals after eliminating Atletico Madrid in an epic match in the quarterfinals. The German representative managed to overturn the 1-2 deficit in the first meeting in Madrid with a 4-2 victory in the second match on Wednesday (17/4/2024) early morning GMT+7, thereby qualifying to meet PSG in the semifinals with an aggregate score of 5-4.\nPSG themselves were also involved in a dramatic battle against Barcelona in the quarter-finals. The Paris-based team also reversed their fortunes after being behind 2-3 in the first match in Paris, with a dramatic 4-1 victory in the second meeting in Barcelona.\nDortmund coach Edin Terzic, who won the Champions League trophy in 1997, feels that his team is now more prepared to face the French champions. \"Our first match against them (PSG) was not good. In the second match, we adapted and were closer to victory. I think we are now a better team compared to when we faced them in the group stage,\" said Terzic after the match against Atletico.\nAlso read: Pathways ”Dark Horses” Atletico and Dortmund\nMidfielder Julian Brandt, who scored Dortmund's opening goal in the first half, could hardly believe that their team was able to make it to the semifinals. After leading by two goals, Dortmund instead conceded two goals to Atletico, before eventually scoring two more goals to seal their spot in the semifinals.\n\"That was a crazy game for us and the supporters. An incredible game, for us, the fans, and football enthusiasts around the world,\" said Brandt.\nAccording to him, the semifinal match against PSG will certainly be more challenging. \"It will be very serious against Paris. We played well against them at home in the group stage, but not so well when we played away. We want to do better now to reach the final,\" he said.\nAlso read: Enjoy the Noise of Dortmund's \"Yellow Wall\"\nFor striker Niclas Fullkrug, who also scored a goal against Atletico, the Champions League semifinals will be a new experience for him. \"I have never played at this level before and I am very proud to appear in the semifinals. The match will certainly be different against Paris compared to when we met in the group stage,\" said Fullkrug.\nThe second quarter-final match was full of drama. Dortmund seemed to be on an easy path to victory after leading 2-0 through goals from Brandt in the 34th minute and Ian Maatsen in the 39th minute. However, Atletico managed to level the score through an own goal by defender Mats Hummels in the 49th minute and a goal by Angel Correa in the 64th minute.\nDortmund finally took the lead again through Fullkrug who scored a goal in the 71st minute. The certainty of Dortmund's ticket was obtained after Marcel Sabitzer scored the fourth goal for the home team, three minutes later.\n”It was a rollercoaster, an incredible evening,” said Dortmund Chief Executive Hans-Joachim Watzke. ”It's not always like that for Borussia Dortmund. The last time we were in the semi-finals was in 2013. This is a great day for the supporters.”\nIf able to defeat PSG in the semifinals, Dortmund will once again appear in the final match in London, on June 1, 2024. In London, in 2013, they lost 1-2 in the final match against their arch-rivals in the Bundesliga, Bayern Munich.\nThe victory over Atletico extended Dortmund's unbeaten record at home in Champions League matches to 10 matches.\n\"We almost leveled the playing field, but they were more superior. And, when a team is superior, they need to be congratulated,\" said Diego Simeone, the coach of Atletico.\nThe Argentine coach blamed his team's failure to advance to the semifinals on wasting too many opportunities during the first meeting in Madrid. At that time, Atletico dominated the match but only managed a narrow 2-1 victory. (AP/AFP)\nWriter:\nPRASETYO EKO PRIHANANTO |\nEditor:\nEMILIUS CAESAR ALEXEY",
  "word_count": 716,
  "scraped_at": "2026-02-14T02:10:47.905012",
  "_text_extracted": true
}