{
  "article_id": "83965a135f30",
  "url": "https://www.nytimes.com/athletic/5515669/2024/06/05/best-european-championship-team-ever/",
  "title": "The 10 best European Championship teams of all time ( well , kind of …) ",
  "date": "20240605T051500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There are many things to consider when judging who are the greatest sides ever to grace us with their presence at a European Championship.\nStyle, success, likeability, great players and unforgettable goals and moments, just for starters. England in 2016 provided none of the above so — spoiler alert! — they don’t make it.\nAdvertisement\nBut lots of truly great sides do, so sit back and enjoy The Athletic’s top 10 greatest-ever Euros teams. And leave your complaints in the comments…\n10) Yugoslavia 1992\nWe begin leftfield with a great team — possibly the greatest to hail from the Balkans and certainly one of the best sides never to win the Euros — even if they never actually kicked a ball in the 1992 tournament.\nYugoslavia, one of the pre-tournament favourites, were kicked out 10 days before the eight-team competition began in Sweden due to the Yugoslav wars, from which the country and its football team broke up.\nDenmark took their place at the last minute and, of course, won Euro 92. Yugoslavia had beaten them in Copenhagen in qualifying, while the Danes had won in Belgrade, but it was Yugoslavia who topped the group and headed to Sweden thinking they could win the thing. They had scored 24 in eight qualifying games — four more than any of the other 32 nations attempting to qualify and 17 more than fellow group winners England, who scored just seven in their four-team group.\nWhy is a team that did not participate in a Euros tournament worthy of inclusion in this list?\nThere is strong justification to suggest they would have gone deep in the competition and may have won it; a chunk of the squad had won the Under-20 World Cup in 1987 and finished runners-up in the Under-21 Euros in 1990. Also, in 1990, the senior side reached the World Cup quarter-finals, only losing on penalties to Diego Maradona’s Argentina, while Red Star Belgrade, again containing a number of the Yugoslavia squad, had won the 1991 European Cup.\nAnd then there are the players who took part in the qualifying campaign.\nThe European Golden Boot winner from 1991, Darko Pancev, scored 10 in qualifying and was about to join Inter Milan. In fact, most of the Yugoslav side headed to Europe in 1992 to escape the war, but just look at this list of talent and the teams they ended up at, either that summer or in the coming years: Predrag Mijatovic (Real Madrid), Robert Prosinecki (Real Madrid), Robert Jarni (Juventus), Zvonimir Boban (AC Milan), Davor Suker (Real Madrid), Vladimir Jugovic (Juventus), Predrag Spasic (Real Madrid), Dejan Savicevic (AC Milan), Sinisa Mihajlovic (Lazio) and Dragan Stojkovic (Marseille).\nNo wonder they were dubbed ‘the Brazilians of Europe’.\nAdvertisement\nSome of the above reached the Euros quarters with Croatia in 1996 and the World Cup semis in 1998. But, in football terms, that Yugoslavia squad remains the very definition of a lost generation.\nBest XI: Ivkovic; Vulic, Spasic, Mihajlovic, Jarni; Prosinecki, Boban, Susic, Savicevic; Stojkovic, Pancev.\n9) Portugal 2000\nPortugal’s only Euros success to date was in 2016, but throughout the 2000s they graced the competition with teams who were far more watchable and far more complete (their best may be yet to come this year).\nTheir team from Euro 2000 is remembered very fondly by their fans, but not through rose-tinted spectacles: they were an excellent side who, in a very high-class tournament, could easily have gone all the way.\nThere were a number of players at their peak or close to it – Luis Figo won the Ballon d’Or that year, Rui Costa was 28 and majestic, Nuno Gomes had the most purple patch of his career with four goals in the tournament (he hadn’t scored in his previous 12 caps), while Joao Pinto, Costinha and Sergio Conceicao made up a gifted, flair-laden midfield.\nIn the group stage, they came from 2-0 down to stun England 3-2, then beat Romania to qualify before resting most of the XI against a German side that had to win or be knocked out. Portugal’s reserves battered them 3-0.\nWith Turkey dispatched 2-0 in the quarter-final thanks to two Gomes goals, Portugal faced the World Cup winners France in the semi-final in Brussels. Gomes put them in front, but a Thierry Henry equaliser took it to extra time… and then, in the 117th minute, an Abel Xavier handball gave Zinedine Zidane the chance to score a golden goal from the spot, which he did.\nThey didn’t win Euro 2000, but given the extremely high levels of quality that year, you fancy this Portugal side would have won several other Euro editions.\nBest XI: Vitor Baia; Xavier, Couto, Jorge Costa, Dimas; Conceicao, Rui Costa, Costinha, Pinto, Figo; Gomes.\nAdvertisement\n8) Czech Republic 2004\nThe embodiment of a tournament dark horse, Karel Bruckner’s Czech Republic side of 2004 were one of the best attacking teams of their era and probably most people’s ‘second team’ of Euro 2004.\nThey were handed a tough group along with Germany and the Netherlands (in the days when only the top two qualified) but, with arguably the best midfield at the tournament, they won all three games.\nTomas Galasek was the defensive lynchpin behind a roaming, nimble, uninhibited Borussia Dortmund-era Tomas Rosicky, with the resourceful and graceful Karel Poborsky to the right and the Czech Fury himself, 2003 Ballon d’Or winner Pavel Nedved, coming inside from the left. Nedved, then aged 31, was at his wily, ingenious best and arguably the best attacking midfielder in the world.\nUp front was the tournament’s Golden Boot winner Milan Baros, who was far more prolific for country than club (Liverpool at the time), while 6ft 8in (203cm) striker Jan Koller, also at Dortmund, added brawn to the Czech’s beauty.\nThey also had pre-helmet era Petr Cech, probably the best goalkeeper in the world.\nA diamond midfield was their default, but Bruckner was tactically flexible, switching to 4-3-3, a flat 4-4-2 and even a 3-4-2-1 in the group stages.\nThe highlight was a stunning comeback from 2-0 down to beat the Dutch, with Baros and Liverpool team-mate Vladimir Smicer scoring late. Baros scored the winner in another comeback victory against Germany and then Denmark were brushed aside 3-0 in what was supposed to be a tight quarter-final.\nIn the semi-final, they, like Portugal, Spain and France before them, were expected to beat Greece but couldn’t break down a packed, granite defence; a task made more difficult when they cruelly lost Nedved to injury after 40 minutes. Eventually, they succumbed to a silver goal (Google it, kids) from a set piece.\nBest XI: Cech; Grygera, Ujfalusi, Bolf, Jankulovski; Poborsky, Galasek, Rosicky, Nedved; Baros, Koller.\nAdvertisement\n7) Netherlands 2000\nNot all great teams win tournaments and not all tournament winners are great teams: i.e. Greece 2004, Denmark 1992 or, for all their strengths, Italy in 2021.\nEuro 2000 set the bar for quality and entertainment, a fabulous tournament of such a high standard that this is the second team from that summer on this list and we haven’t got to the winner yet.\nFrank Rijkaard’s team blasted 13 goals in four games en route to the semi-finals, winning all three group games (1-0 against 1996 runners-up Czech Republic, 3-0 vs Denmark and then 3-2 against eventual winners France) before handing out an almighty shellacking to Yugoslavia in the quarters, Patrick Kluivert scoring a hat-trick in a 6-1 rout.\nEdwin van der Sar in goal, peak Jaap Stam and Frank de Boer in defence, Edgar Davids, Clarence Seedorf and Phillip Cocu in the engine room, blistering pace through Marc Overmars and Dennis Bergkamp in his crafty, wily phase — Netherlands really should have won Euro 2000.\nWhy didn’t they? They were Italy-d in the semis. Against a stubborn Italian team containing five defenders and two defensive midfielders (and who had their attacking ambitions further reduced by Gianluca Zambrotta’s 34th-minute red card), Netherlands contrived to miss not one but two penalties in normal time and another three in the shootout.\nBest XI: Van der Sar; Reiziger, Stam, Frank de Boer, Van Bronckhorst; Overmars, Cocu, Davids, Zenden; Bergkamp, Kluivert.\n6) West Germany 1972\nThis was West Germany’s first ever Euros and they, or Germany, have never reached this peak since.\nThe star of the side was Der Bomber, Bayern Munich’s irrepressible striker Gerd Muller, who scored six goals in six group qualification games, then another in the quarters before four in two in the semis/final tournament in Belgium, giving him a total of 11 in nine matches.\nAdvertisement\nWest Germany beat a good England side 3-1 in front of 96,000 at Wembley in the first game of a two-legged quarter-final at a time when England were still seldom beaten at home.\nThey beat hosts Belgium 2-1 in the semis and then brushed aside the Soviet Union 3-0 in a one-sided final in Brussels. Along with Brazil, Helmut Schon’s side were the most exciting international team in the world at the time and confirmed their legendary status by winning the World Cup on home soil two years later.\nMuller wasn’t even their best player; that was Franz Beckenbauer, the gifted, marauding sweeper, who won the Ballon d’Or that year. In joint-second place were Muller and Gunter Netzer, player of the year in the Bundesliga in 1972, who was their creative genius in attacking midfield.\nTo get an idea of the scale of West Germany’s dominance, no fewer than seven of their team featured in the tournament’s best XI. Little wonder this team, boasting such names as Beckenbauer, Netzer, Muller, Sepp Maier, Paul Breitner and Uli Hoeness would go on to win the World Cup two years later.\nBest XI: Maier; Hottges; Beckenbauer, Schwarzenbeck, Breitner; Hoeness; Wimmer; Netzer; Heynckes, Muller, Kremers.\n5) Spain 2008\nThe year Spain came of age with their first tournament victory in 44 years.\nLuis Aragones’ side, minus national legend Raul, who had been ruthlessly ditched two years earlier, produced a brand of winning football that was fresh, exciting and with less structure than the Spanish tiki-taka philosophy it was to morph into.\nThey were a young, vibrant side, with midfield pivot Marcos Senna the oldest outfield player in the squad aged 31. David Silva was a bright, burgeoning 22-year-old at Valencia, Andres Iniesta was 24, Cesc Fabregas was 21, and Liverpool-era Fernando Torres was 24.\nSpain won all three group games against Sweden, Euro 2004 winners Greece and tournament surprise package Russia, before edging through on penalties against Italy in the quarters after a dreadful 120 goalless minutes.\nAdvertisement\nRussia were swept aside 3-0 in the semis and then a Torres goal won the final 1-0 against a typically efficient Germany side, seen as a victory (by the Spanish at least) for attacking football.\nBest XI: Casillas; Ramos, Marchena, Puyol, Capdevila; Silva, Xavi, Senna, Iniesta; Villa, Torres.\n4) France 2000\nThe third team from Euro 2000 on this list, which may feel like overkill, but at the time it was considered the high watermark of European Championships to date in terms of the quality of technical, attacking football on show.\nThere were 2.74 goals per game in the Netherlands and Belgium, way up on 2.06 from Euro 96 and a total only beaten by Euro 2020 when there were 2.78 per game.\nFor a flavour of how strong the tournament was, just look at the official best XI from the tournament, comprised of players from the four semi-finalists. All 11 players either won a Champions League or World Cup in their careers…\nFrancesco Toldo; Lilian Thuram, Fabio Cannavaro, Laurent Blanc, Paolo Maldini; Luis Figo, Patrick Vieira, Zinedine Zidane, Edgar Davids; Francesco Totti, Patrick Kluivert.\nIt’s not a universal truth that France were undoubtedly the best side at Euro 2000; they squeaked through with golden goals in the semi-finals against Portugal and the final versus Italy but, well, they won the damn thing.\nThey were undoubtedly an improvement on their World Cup-winning side from 1998, with Thierry Henry coming to the fore and more attacking depth with Sylvain Wiltord, Nicolas Anelka and Robert Pires, plus the match-winner from the final David Trezeguet, giving coach Roger Lemerre a wealth of options.\nBest XI: Barthez; Thuram, Desailly, Blanc, Lizarazu; Vieira, Deschamps; Petit; Zidane; Dugarry, Henry.\n3) The Netherlands 1988\nStill haunted by losing two World Cup finals in the 1970s, the Dutch finally won the country’s first-ever major tournament.\nAdvertisement\nThey did so with four of the finest players the country has ever produced, all aged 23 to 25 at the time: masterly goalscoring sweeper Ronald Koeman, stylish ball-playing centre-back Frank Rijkaard, the epitome of total football Ruud Gullit, and a peak Marco van Basten up front.\nVan Basten and Gullit were already at the great club side of the era, AC Milan, with Rijkaard soon to join them, while Koeman, who scored 238 goals in his career (!), was with Barcelona.\nRinus Michels masterminded their victory, the highlight of which wasn’t actually the final when Van Basten scored the greatest goal the tournament has ever witnessed with a first-time volley from an improbably tight angle. The semi-final victory over West Germany in Hamburg, with Van Basten scoring an 88th-minute winner, was redemption on many levels.\nA 2-0 win over the Soviet Union, who had beaten the Netherlands in the group stage, was the crowning glory of a side pretty much universally admired and celebrated.\nBest XI: Van Breukelen; Van Aerle; Ronald Koeman, Rijkaard, Van Tiggelen; Vanenburg, Wouters, Muhren, Erwin Koeman; Gullit, Van Basten.\n2) France 1984\nOne of the best teams in international football history was barely seen in the United Kingdom at the time, with only two matches screened live, one of those being the final when France beat Spain 2-0.\nMichel Platini scored — of course he did. He scored in every match at the tournament, nine in five games (only one being a penalty), six more than the next highest scorer.\nThe French were a glorious mix of beauty, flair and craft, with the Carre Magique (Magic Square) midfield of Jean Tigana, Alain Giresse, Luis Fernandez and Platini proving far too good for any side they faced.\nTigana was all stamina and technique, Giresse knitted the play together and captain Platini was the visionary dribbler and goalscorer extraordinaire. He scored hat-tricks against Belgium and Yugoslavia, captained the side and was in the middle of a remarkable run of three straight Ballon d’Or wins in 1983, 1984 and 1985.\nSuave, sophisticated, arrogant, zestful and, well, likeable, the French were pretty much the most deserved winners of any Euros tournament. But not quite.\nBest XI: Bats; Battiston, Le Roux, Bossis, Domergue; Giresse, Fernandez, Platini, Tigana; Lacombe, Bellone.\nAdvertisement\n1) Spain 2012\nThat honour belongs to Spain in 2012, who were unquestionably the best team at that tournament and arguably the best Euros team ever. If that’s up for debate, then the fact they were the most all-encompassing, hardest to beat and hardest to get the ball off is not in doubt.\nIf Spain at Euro 2008 were fun and exciting, the 2012 version under Vicente del Bosque were a picture-painting art house team for whom the ball was treated as importantly as their firstborn child.\nSince 2008, they had lost Carles Puyol and David Villa to injury. Gerard Pique was in, Sergio Busquets was the young pretender to Senna’s lynchpin role, and Jordi Alba was an upgrade on Joan Capdevila at left-back. Up front, while Chelsea-era Torres was dropped for, well, Xabi Alonso, as Del Bosque went for death by a thousand passes with Cesc Fabregas as the nominal further forward player, but in reality formations were irrelevant.\nIt worked. Spain proved utterly unbeatable with effectively six midfielders and a false nine pre-dating mid-2010s-era Pep Guardiola. Perhaps he was just reacting to Torres losing his form and Villa being injured, but Del Bosque’s side felt revolutionary and confirmed their greatness with a 4-0 hammering of Italy in the most one-sided final in Euros history.\nBest XI: Casillas; Arbeloa, Pique, Ramos, Alba; Xavi, Busquets, Xabi Alonso; Silva, Fabregas, Iniesta.\n(Top photos: Getty Images)",
  "word_count": 2684,
  "scraped_at": "2026-02-14T02:01:16.444226",
  "_text_extracted": true
}