{
  "article_id": "83a67e2a239c",
  "url": "https://www.teamtalk.com/manchester-united/threatened-atletico-madrid-worlds-next-superstar-man-utd-psg-warning-issued",
  "title": "Man Utd threatened by Diego Simeone in chase for world next superstar , as Atletico Madrid join hunt",
  "date": "20230227T163000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd threatened by Diego Simeone in chase for world’s next superstar, as Atletico Madrid join hunt and PSG warning issued\nManchester United must overcome two big new rivals in the chase for one of the best strikers in world football, with Atletico Madrid and Paris Saint-Germain getting involved.\nMan Utd have finally added to their trophy cabinet by beating Newcastle in the Carabao Cup final on Sunday afternoon. Casemiro and Marcus Rashford scored to give Man Utd a 2-0 victory, handing Erik ten Hag his first piece of silverware as their manager.\nAnd more trophies could be on the way to Old Trafford this season. The Red Devils are one of the favourites to win the Europa League after beating Barcelona. They will come up against Real Betis in the last 16.\nMan Utd are also still in with a chance of winning the FA Cup for the first time since 2015-16. They will play West Ham in the fifth round on Wednesday. To get Man Utd fans even more excited, they remain in the mix for the Premier League title. However, they will have to rely on both Arsenal and Manchester City slipping up to achieve this.\nWhile Ten Hag has improved Man Utd hugely during his first season in charge, he could still do with more new signings joining in the summer. This will help the club to continue on their upward trajectory and potentially become title favourites for next season.\nThe main position Ten Hag will look to improve is centre-forward. Anthony Martial could be sold, while it is still unclear whether Wout Weghorst’s loan from Burnley will be made permanent.\nMan Utd are eyeing Victor Osimhen, Harry Kane and Benjamin Sesko as potential striker solutions. Napoli talisman Osimhen is the subject of this latest update.\nAccording to Sports Mole, who cite reports coming out of Spain, Man Utd will have to fend off Atletico Madrid if they want to win the race for Osimhen. That is because Diego Simeone’s side have just got involved in the transfer pursuit.\nAtletico Madrid have ‘genuine’ interest in Man Utd-linked ace, claims report\nAtleti’s interest is described as ‘genuine’. They will be in the market for a new striker this summer if Joao Felix’s Chelsea loan becomes permanent. And this sale, which could be worth €80million (£71m), will give Atleti the funds to bid for Osimhen. However, it remains to be seen if they can match his full valuation, which reportedly stands at €120m (£106m).\nAs is the case with Man Utd, Atleti will have to qualify for next season’s Champions League to stand any chance of capturing Osimhen. The Rojiblancos are in a good position to do this. They currently sit in fourth spot with a two-point lead on Betis, who occupy fifth place.\nAtleti are not the only European giants Man Utd will have to fight off for the 24-year-old, who has already netted 21 goals this campaign. Italian journalist Ciro Venerato believes Ten Hag should ‘beware of PSG’, as they could get in the mix.\nDuring a recent interview, Venerato was asked if Dusan Vlahovic might move from Juventus to Napoli to replace Osimhen. He replied: “In these hours, there is a lot of talk about the possibility that Vlahovic will replace Osimhen. But I can say that the rumours have been absolutely denied.\nRed Devils must ‘beware of PSG’ – journalist\n“I confirm, however, that Chelsea and Manchester United like the Nigerian. But also beware of PSG, as [manager Christophe] Galtier already had the player during his time at Lille.”\nPSG pose a far bigger threat to Man Utd for Osimhen than Atleti. The Ligue 1 leaders are one of the richest clubs in the world. This means they can bid hundreds of millions of pounds for the Nigeria international.\nAnd Galtier knows him well, as Venerato points out. This relationship might put PSG at the front of the queue for Osimhen.\nMan Utd will not go down without a fight though. They have shown they are happy to spend big money at the wishes of Ten Hag and could therefore submit a club-record bid of their own for Osimhen.",
  "word_count": 701,
  "scraped_at": "2026-02-14T01:34:30.515592",
  "_text_extracted": true
}