{
  "article_id": "83ad679a0147",
  "url": "https://www.twtd.co.uk/ipswich-town-news/43487/woolfenden-kyle-had-to-leave-his-car-and-run-to-the-ground!/onthisday",
  "title": "Woolfenden : Kyle Had to Leave His Car and Run to the Ground ! - Ipswich Town News",
  "date": "20241005T071500Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Wednesday, 5th Oct 2022 10:52\nTown centre-half Luke Woolfenden was delighted for two-goal teammate Kyle Edwards and revealed that the winger had to run to the ground having abandoned his car on the way into Portman Road ahead of the 3-0 victory over Cambridge United.\nEdwards, 24, netted the second and third goals as the Blues recorded their first ever league victory over the U’s, Tyreece John-Jules having grabbed the opener in the 72nd minute after Town patiently looked to break down a stubborn Cambridge backline.\n“I think in games like that, unless you get an early goal and they come out, it’s always more difficult because they’ve got something to come here and hold onto,” Woolfenden said.\n“You can see from the start that they’ve taken time over goal-kicks, throw-ins, free-kicks, trying to play for set pieces and stuff like that.\n“It’s pleasing because last season they did exactly the same and came here and took a 1-0 win, so it’s pleasing to turn it around and get a 3-0 win.”\nThe 23-year-old says there was no panic at the break despite Town having dominated without finding a goal.\n“I think we were very confident,” he recalled. “I think we’ve come a long way. There would have been times last season where we would have gone in at half-time very frustrated that we hadn’t got the breakthrough.\n“But I think the message from the manager was to be patient with it, more of the same. We had a lot of openings as soon as the second half kicked-off really and it paid off.”\nGiven Cambridge’s defensive approach, Woolfenden and his fellow centre-halves played in a more advanced role that usual.\n“It was probably different,” he reflected. “Usually we’re a bit deeper and we have to stay on the ball, suck teams out, which can be a bit risky.\n“But you can see that it reaps rewards. Teams can’t come here and sit deep because we’ll just keep the ball off them and they’ll become frustrated and you see the spaces that get left out wide and get left in behind, and it starts from doing what the gaffer’s asking - staying on the ball.\n“Today it was probably a bit different, it was more a sense of getting the lockdown right when we had the ball because they obviously came here trying to play on the counter and to make that happen they’ve got athletic players, so it would have been a lot harder than it was.”\nAt the other end, Freddie Ladapo put in his best display in a Town shirt, battling with the Cambridge central defenders.\n“I think especially in the first half, the number of times it would go into Freddie and he’d be surrounded by bodies but he’d come out with the ball, they’d nick the ball back and he’d win it back for us,” Woolfenden said. “It was a massive plus, the press up front was a big pleasing point.”\nThe former East Bergholt High School pupil says the expectation was that once the first goal came, others might follow.\n“I think so, that was always the message,” he said. “Getting the first goal it would have opened it up because they’d have had to come out and try and have a go, and it did.”\nWoolfenden was delighted for Edwards, who came off the bench to net his first two goals for the club after an early season spell in which he was rarely involved.\nAlthough, with heavy congestion around town due to the closure of the Orwell Bridge, which led to kick-off being delayed by 15 minutes, Woolfenden revealed Edwards didn’t have the smoothest of preparations for the match.\n“Kyle’s had a tough couple of months, really,” he continued. “He’s not been playing as much as he’s wanted to and even today he’s had to leave his car in the traffic and run to the ground!\n“You could see the fans, everyone loves Kyle, he’s always got such a smile on his face all the time, so to get two goals today was very pleasing, even if one was a cross!\n“I’ve been there myself. When you’re not playing, it’s hard to come in and be a positive member of the group. But every day he’s always laughing, he’s always joking, he’s unbelievable. I can’t speak highly enough of him really.\n“I think the gaffer’s mentioned it a few times. We’re winning games as a squad. Last week, he mentioned that Freddie came on and got the goal after Tyreece’s pressing for 60, 65 minutes and the other boys got the rewards. Throughout the squad we recognise that, so it’s good.”\nHaving conceded six goals in the previous three games, Woolfenden was delighted that he and his fellow defenders recorded their sixth League One clean sheet this season in the 12th match.\n“Recently we haven’t been happy with the goals that we’ve been conceding,” he admitted. “[The opposition] have been having a low number of chances but getting goals.\n“I think today was a big positive, it was something we spoke about as a defensive unit, getting another clean sheet, getting back to how we were at the end of last season, start of this season, keeping clean sheets, limiting the number of shots, which, to be fair, we have been throughout the whole season.”\nHaving been watched by more than 28,000 against Portsmouth at the weekend, 26,000 fans were at Portman Road last night.\n“Brilliant numbers, you can’t really say much more than that, to be fair,” he said. “Tuesday night, there’s Champions League on, I know I’d rather watch Ipswich than Liverpool!\n“You could see at the end the number of people that stay. It’s easy to get sucked in, ‘It’s 3-0, the game’s done, beat the traffic’ but they all stay at the end, singing, clapping chanting and all that, it’s unbelievable.”\nPhoto: Matchday Images\nPlease report offensive, libellous or inappropriate posts by using the links provided.\n- Page:\n- 1\nIts obvious that KM has built such a great spirit and his recruitment has been excellent.\nOne game at a time, looking at Plymouth's schedule next 5-6 games they don't play anybody big so we should be looking to keep in this neck and neck position, and if we have a good 3-4 game run from here the gap at the top will start to grow...... COYB\nI'm sure many players during the first half of the 20th century walked to the ground before playing, or got on the football special with the fans and walking with them from the station.\nAnd whilst i'm sure he didn't mean his first goal, he's that kind of flair player that deserves something spectacular to open up his account!\nK M's ability to introduce a change of character and characters is proving wonderfully challenging for ITFC opposition – and KE fully met the bill !\nCOYB\nBut ok, vilify the man, makes perfect sense. At least Hurst played proper football, right?\n- Page:\n- 1\nYou need to login in order to post your comments",
  "word_count": 1184,
  "scraped_at": "2026-02-14T01:49:08.088691",
  "_text_extracted": true
}