{
  "article_id": "83c86684d63f",
  "url": "https://www.90min.com/posts/euro-2024-qualifiers-today-your-guide-thursday-games-12-10-23",
  "title": "Euro 2024 qualifiers today : Your guide to Thursday games",
  "date": "20231012T094500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024 qualifiers today: Your guide to Thursday's games\n- International football returns as Euro 2024 qualification continues\n- Spain, Norway, Turkey and Croatia all in action on Thursday\n- Scotland can qualify if they avoid defeat or Norway fail to win\nInternational football returns this week as qualification for Euro 2024 heats up across the continent.\nNations are desperate to book their tickets to Germany as soon as possible, with many countries knowing that they could secure their place at the tournament come the end of the October international break.\nEuro 2024 qualification resumes on Thursday with eight games across four different groups, with the likes of Scotland, Spain and Croatia all in action. There are some pivotal clashes on the cards as any slip-ups become increasingly costly.\nHere is your guide to all of Thursday's Euro 2024 qualifying matches.\nAll times are BST.\nGroup A\nCyprus vs Norway - 19:45\n- Location: Larnaca, Cyprus\n- Stadium: AEK Arena\n- Date: Thursday 12 October\n- Referee: Donatas Rumsas (LTU)\n- VAR: Tiago Martins (POR)\nNorway had an enjoyable September, putting six past Jordan in a friendly and picking up a crucial 2-1 victory over Georgia in Group A. Unsurprisingly, it was Erling Haaland and Martin Odegaard who found the net against the Georgians, keeping pace with second-placed Spain as a result.\nGiven Spain host top of the table Scotland on Thursday too, Norway know a victory against Cyprus will see them close the gap with one or both of the teams at the top of Group A. If Spain were to lose, Norway would leapfrog them with a victory.\nCyrpus should pose little threat to Stale Solbakken's side, currently sitting bottom of the group with zero points and a -15 goal difference. Norway beat FIFA's 120th-ranked side 3-1 in the reverse fixture and should have no trouble dispatching them a second time.\nSpain vs Scotland - 19:45\n- Location: Seville\n- Stadium: Estadio La Cartuja de Sevilla\n- Date: Thursday 12 October\n- Referee: Serdar Gozubuyuk (NED)\n- VAR: Pol van Boekel (NED)\nThe stakes are pretty high when Scotland travel to Seville this Thursday, with Steve Clarke knowing that his side can qualify for Euro 2024 if they avoid defeat. However, the Tartan Army could lose and still qualify if Cyprus were to get something from their clash with Norway.\nIt will be a tricky test for Clarke's team, although a 2-0 victory at Hampden Park against Spain back in March will give them plenty of confidence. Despite a friendly defeat to bitter rivals England last time out, Scotland have won all their group games so far, sitting comfortably atop Group A. Surely it's just a matter of time before they book their ticket to Germany next summer.\nSpain are also in a strong position to qualify despite that Scotland defeat, sitting two points above Norway in third having played a game fewer than the Scandinavian side. Regardless of Scotland's recent results, Spain will still be considerable favourites on Thursday and are in impressive form themselves after netting 13 goals in their last two group games.\nGroup D\nLatvia vs Armenia - 17:00\n- Location: Riga, Latvia\n- Stadium: Skonto Stadions\n- Date: Thursday 12 October\n- Referee: Rade Obrenovic (SVN)\n- VAR: Nejc Kajtazovic (SVN)\nWhile not the most glamorous tie on paper, it could prove a pivotal one in Group D. Not for Latvia, of course, who currently sit at the bottom of the standings with no points and a -10 goal difference. But Armenia's push for qualification is still in the balance.\nArmenia have picked up seven points from five games, currently sat in third behind Croatia and Turkey. A narrow 1-0 defeat to the former last time out was a bitter blow for Armenia, who continue to chase qualification for a first major tournament, but a victory against minnows Latvia could get them back on track.\nMidfielder Lucas Zelarayan of Al Fateh and young Grant-Leon Ranos of Borussia Monchengladbach are two to keep an eye on for Armenia.\nCroatia vs Turkey (19:45)\n- Location: Osijek, Croatia\n- Stadium: Opus Arena\n- Date: Thursday 12 October\n- Referee: Anthony Taylor (ENG)\n- VAR: Stuart Attwell (ENG)\nThe good news for Armenia is that either Croatia or Turkey are guaranteed to drop points on Thursday. Croatia were the victors in the reverse fixture after beating their hosts 2-0 in Bursa, but the pair's recent clashes have been varied in outcome.\nBoth nations sit on ten points in Group D, with Croatia currently ahead on a much stronger goal difference. The Nations League runners-up also have a game in hand on every other team, meaning this could be a must-win for Vincenzo Montella in his first game in charge of Turkey.\nBar a surprise late draw with Wales in the opening group game, Croatia have been faultless in Group D so far as their golden generation continues to impress.\nGroup E\nAlbania vs Czechia - 19:45\n- Location: Tirana, Albania\n- Stadium: Air Albania Stadium\n- Date: Thursday 12 October\n- Referee: Danny Makkelie (NED)\n- VAR: Rob Dieperink (NED)\nIf you had to guess which one of these sides was currently top of Group E, you would probably say Czechia. Well, you'd be wrong.\nAlbania are first with ten points from five games, two points above Czechia. Admittedly, Jaroslav Silhavy's side have a game in hand and could leapfrog Albania with a win in Tirana on Thursday.\nCzechia's last competitive match came against Albania just a month ago, a game which ended 1-1. However, with Moldova and Poland on their tails, both sides will be desperate to avoid defeat.\nFaroe Islands vs Poland - 19:45\n- Location: Torshavn, Faroe Islands\n- Stadium: Torsvollur\n- Date: Thursday 12 October\n- Referee: Allard Lindhout (NED)\n- VAR: Jochem Kamphuis (NED)\nPoland's underwhelming start to qualification continued in September, with a 2-0 defeat away in Albania making life complicated for the 2012 co-hosts. They did, however, beat Faroe Islands 2-0 in the game prior, with a brace from Robert Lewandowski giving them some much-needed respite.\nHowever, Michal Probierz has had to leave Lewandowski out of his squad this time round after the Barcelona forward suffered an ankle injury in the Champions League against Porto. Given Poland's reliance on their elite centre-forward, they will need others to step up in his absence.\nFaroe Islands have managed a point in the group so far, but they still sit rock bottom. Even a Lewandowski-less Poland should ease past them on Thursday.\nGroup I\nAndorra vs Kosovo - 19:45\n- Location: Andorra La Vella, Andorra\n- Stadium: Estadi Nacional\n- Date: Thursday 12 October\n- Referee: Nicholas Walsh (SCO)\n- VAR: Andrew Dallas (SCO)\nA bottom of the group clash that is unlikely to set pulses racing, Andorra play host to Kosovo on Thursday. Kosovo are two points above last-placed Andorra and haven't been an easy side to beat in Group I so far, managing four draws.\nTheir late equaliser against Switzerland last time out was the highlight of their campaign to date, but a first victory away in Andorra would undoubtedly top it. The reverse fixture in Kosovo ended 1-1, but Andorra have also picked up two points in Group I and know a win of any description would see them potentially rise to fourth.\nBoth sides are out of the qualification picture, so it's all about playing for pride now.\nBelarus vs Romania - 19:45\n- Location: Budapest, Hungary\n- Stadium: Szusza Ferenc Stadion\n- Date: Thursday 12 October\n- Referee: Espen Eskas (NOR)\n- VAR: Guillermo Cuadra (ESP)\nDue to Israel's home clash with Switzerland being understandably postponed given the current situation, Romania know a victory will see them finish Thursday as table-toppers. A victory over Belarus would move them above Switzerland by a point, putting them in a strong position to qualify for the Euros for only the sixth time.\nBelarus, similar to Kosovo and Andorra, are incredibly unlikely to qualify, sitting on just four points. They are currently above Kosovo on goal difference, but have lost four of their last six matches. Romania will kick themselves if they can't take advantage of their hosts' poor form.",
  "word_count": 1368,
  "scraped_at": "2026-02-14T01:51:09.240168",
  "_text_extracted": true
}