{
  "article_id": "83c9c3c282d1",
  "url": "https://metro.co.uk/2025/02/13/man-utd-told-they-let-real-winner-leave-on-loan-in-january-22550493/",
  "title": "Man Utd told they let  real winner  leave on loan in January",
  "date": "20250213T133000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dick Advocaat says Manchester United let go of a ‘real winner’ by allowing Tyrell Malacia to complete a loan move to PSV Eindhoven for the remainder of the season.\nMalacia, 25, made eight appearances in all competitions under Ruben Amorim this season after returning from an 18-month spell on the sidelines with a serious knee injury.\nBut PSV announced that they had wrapped up a temporary agreement for Malacia in the dying embers of the January transfer window, with United completing a £25million deal for Lecce left-back Patrick Dorgu.\nThe Netherlands international went on to make his full PSV debut at the weekend, playing 78 minutes as the Eredivisie giants were held to a 1-1 draw at home to Willem II.\nHowever, Malacia was left as an unused substitute on Tuesday night as Peter Bosz’s men suffered a 2-1 defeat in the first leg of their Champions League play-off with Juventus.\nOne man who knows Malacia more than most is ex-PSV and Sunderland boss Advocaat, who managed the full-back for a year and a half during their time together at Feyenoord.\n‘I know that he hasn’t played for Manchester United for almost a year and a half, but this boy has a good head. Foppe de Haan (Dutch coach) always says: “He has a good head”,’ Advocaat told Voetbal International.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘But I put it a bit nicer. At Feyenoord I saw that he is made of the right stuff.\n‘When I was there, it was a bit more difficult financially and we had a lot of young players. But boys like Orkun Kokcu, Lutsharel Geertruida and also Malacia handled that very well. Real professionals who really wanted to make it. They came from the youth team, came into the team and stayed. They did great.\n‘I am convinced of that: Tyrell is a real winner. As a trainer I didn’t have to say too much to him.’\nAdvocaat is confident Malacia has found the right environment to help him return to his best in the second half of the season.\n‘He fits in with PSV, they are a good club for him. Tyrell is good on the ball, can be important in attack at PSV in Bosz’s game. And don’t underestimate his defensive qualities,’ he added.\n‘Tyrell may not be that big, but he holds his own. At Feyenoord he always went into battle. He is also really not afraid of anyone.\n‘Here in the Netherlands, he can become the player he was again. He knows the competition well and at PSV there are also players he knows from Oranje, that will give him a good feeling.’\nMore Trending\nAfter a frustrating few months, Malacia was understandably delighted to seal a temporary move to PSV, where hopes to ‘win several prizes’.\n‘I’m happy to be here. Finally playing good football again,’ the Dutchman told PSV’s official website after signing on the dotted line.\n‘I am coming off a long injury, but by now I am fit and know that my time will come again.\n‘In every tough period there are also positive elements and in this case that is that I have become much stronger physically and mentally. I have more patience, am more mature, know my body better and things like that. I’m ready to pop and hopefully win several prizes with PSV.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Cody Gakpo injury update ahead of Liverpool vs Wolves\nMORE: Chelsea’s transfer stance on signing a free agent amid striker injury crisis\nMORE: Arne Slot says Arsenal’s £62m transfer target ‘has the quality’ for Liverpool",
  "word_count": 665,
  "scraped_at": "2026-02-14T01:58:05.351248",
  "_text_extracted": true
}