{
  "article_id": "83cca3dedddc",
  "url": "https://thepeoplesperson.com/2023/02/28/manchester-united-have-finally-got-it-right-with-casemiro-after-expensive-midfield-failures-260448/",
  "title": "Manchester United have finally got it right with Casemiro after expensive midfield failures",
  "date": "20230228T081500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There have been three times that Manchester United have signed a player with a claim to the title ‘best midfielder in the world.’\nJuan Sebastien Veron traded Lazio for Old Trafford in 2001 and became the most expensive transfer in English football when the club paid £28.1m to procure his services.\n‘The Little Witch’ was a sublime passer of the ball, a creative extraordinaire who had been the driving force behind an unlikely Scudetto and Coppa Italia double.\nIn Italy, his only equal was perhaps the legendary Zinedine Zidane, a comparison that shows just how highly regarded the Argentine was.\nBut in England, he failed to live up to the incredible pressure his fee brought with it and, despite some sublime performances in Europe, he could not become the player that Sir Alex Ferguson thought he could be for Manchester United.\nDespite an expletive tirade in defence of Veron, The Gaffer soon was happy to let the midfielder sign for Chelsea for £15m, almost half of what United had paid for him.\nVeron was regarded as such an expensive flop that it is generally thought that he altered Ferguson’s entire transfer policy going forward – he certainly seemed to exercise far more caution with pricey players, particularly midfielders.\nIt wasn’t until the tenure of Jose Mourinho that United next went for a ‘world class’ player to add to their engine room.\nPaul Pogba had already left Old Trafford on a free transfer, joining Juventus, and subsequently thriving in Italy.\nHe won the Serie A title in each of his four seasons with The Old Lady, played in the Champions League final, and was named in the 2015 Team of the Year for his excellent performances.\nWhen he joined for £89m in 2016, there was a genuine belief amongst many Man United fans that their club had just signed the best midfielder in the world.\nAnd over the course of his six years at the club, there was the odd five-game stretch where he looked like he might become something like that, but the reality was that he, like Veron years before, never came anywhere near living up to the hype.\nConstant flirtations with other clubs, careless showboating, and the consistency of an English spring all combined to make him a divisive figure among the fanbase. Meanwhile his performances on the pitch were a poor trade-off for the problems he brought with him.\nHe also ended up picking swathes of injuries for which he’d refuse the club’s medical department in favour trips to Dubai. Pogba’s final campaign saw him spend most of last season away from Manchester.\nIn the end, his acrimonious departure saw him leave on a free transfer for a second time with few United fans caring very much at all.\nThree months later and Casemiro signed for Manchester United.\n£70m in transfer fees, over £300,000-a-week in wages, and a 5-year contract for a player who was 30 years of age. There were plenty of raised eyebrows last August. But Casemiro has shown already that, finally, United have got it right with a world class midfielder.\nHe has taken Old Trafford by storm, becoming a midfield general the likes of which hasn’t been seen in these parts since Roy Keane’s heyday. Writing for The Athletic, Michael Cox described him as a ‘one-man firefighter,’ in the Man United team, with his inspired performance in the Carabao Cup final helping to end the Red Devils’ six-year wait for a trophy.\nCasemiro spent much of this season anchoring for the adventurous pairing of Bruno Fernandes and Christian Eriksen – two players with very little defensive acumen – while covering for fullbacks tasked with getting high up the pitch, and shielding a defensive pairing that would otherwise be overwhelmed.\nAnd somehow, he still finds the time to chip in at the other end of the pitch, scoring five goals and providing as many assists. Ten goal contributions is more than £85m striker Darwin Nunez has mustered in the Premier League.\nIt may only have been six months since Casemiro was joined the club, but the early signs point to him being an unmitigated success.\nThree times Manchester United have signed a player with a claim to the title ‘best midfielder in the world.’ Third time lucky it is.",
  "word_count": 715,
  "scraped_at": "2026-02-14T01:46:30.514506",
  "_text_extracted": true
}