{
  "article_id": "83dda9d1ab23",
  "url": "https://www.rnz.co.nz/news/sport/525267/premier-league-predictions-who-will-finish-where-in-2024-25",
  "title": "Premier League predictions : Who will finish where in 2024 - 25 ? ",
  "date": "20240815T053000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Phil McNulty, BBC chief football writer\nIt's that time of the year again - the annual act of foolishness in which I try to predict the outcome of the 2024-25 season for all 20 Premier League clubs.\nTipping Manchester City to win last season's title hardly required genius, although tipping Aston Villa to finish fifth - they finished fourth and in the Champions League - at least earned some plus points.\nThere are caveats - excuses by any other name - that transfer activity could significantly alter this landscape but this is how it stands in the current position.\nSo while hoping not to repeat 2015-16's spectacular prediction that Leicester City would be relegated in the season they won the league, here we go.\n1. Manchester City\nLast season: Champions\nThink about backing against them. Then think again.\nManchester City's relentless hunger for success under manager Pep Guardiola brought them a sixth Premier League title in seven seasons last term, and a record fourth in succession, despite Arsenal's excellence and consistency.\nAll the same world-class quality remains, allied to the generational goal machine that is Erling Haaland. City will also have power to add armed with their vast resources plus another £81.5m after the departure of Julian Alvarez to Atletico Madrid.\nYoung stars Oscar Bobb and James McAtee have shown they are ready to step up to new levels this season to strengthen Guardiola's already formidable hand even further. It is a daunting prospect for their rivals.\nThere will be a season when Manchester City do not win the Premier League - I'm just not sure this will be it.\nMan City fan writer Freddie Pye on BBC Sport's Manchester City page:\n\"City will finish, once again, top. Understanding of philosophy, experience and Pep Guardiola's relentless hunger for more will be the difference, despite concern over a lack of new signings. Given our recent history too, you could comfortably regard this as realistic.\"\n2. Arsenal\nLast season: Second\nMikel Arteta's side - lifted to a new level by the arrival of Declan Rice - pushed Manchester City even closer for the title last season but could not maintain the levels of near perfection needed to keep them at bay.\nI am backing them to give City the closest run for their money again this season given the all-round talent the Gunners possess.\nThe signing of Italy defender Riccardo Calafiori bolsters an already strong area of the side but Arsenal must surely be in the market for a proven goalscorer before the close of the transfer window, a component still lacking for all last season's excellence.\nThe title may be out of reach once more but they will definitely be in contention for silverware. They will also have the experience of last season's Champions League campaign to call on.\nArsenal fan writer Laura Kirk-Francis on BBC Sport's Arsenal page:\n\"First. Arsenal have every reason to be confident this season, but the truth remains that to be the best they will need to beat the best. And I think they will. I'll be bold - Arsenal will win the league this year.\"\n3. Liverpool\nLast season: Third\nArne Slot is undertaking the seemingly impossible task of replacing Jurgen Klopp but the former Feyenoord coach benefits from inheriting an outstanding squad left behind by his predecessor.\nLiverpool have an array of world-class talent, with Mohamed Salah still the talisman, along with keeper Alisson, captain Virgil van Dijk and Trent Alexander-Arnold.\nSlot also has Liverpool's young brigade to call on. This can be the real breakout season for Harvey Elliott, with England's new interim manager Lee Carsley a huge admirer.\nMartin Zubimendi's decision to stay at Real Sociedad was a blow as Liverpool seek a new number six for Slot.\nAnd while there is understandable anxiety from supporters about the lack of signings, this remains an exceptionally strong Liverpool squad. They will challenge for trophies and finish in the top four.\nLiverpool fan writer Jordan Chamberlain on BBC Sport's Liverpool page:\n\"Third. Well clear of fourth. With a great run in the revamped Champions League. I still don't know much about Slot and he's keeping his cards close to his chest. But pre-season has been good and the squad is strong.\"\n4. Aston Villa\nLast season: Fourth\nI tipped Aston Villa to finish fifth last season based on Unai Emery's expertise. He went one better and put them in the Champions League, a superb achievement.\nI believe they will stay in the top four, having broken through that glass ceiling. An ambitious club with a top-class manager and a developing squad.\nDouglas Luiz will be a loss after leaving for Juventus but plenty of quality remains elsewhere. Ollie Watkins is a proven Premier League marksman who also demonstrated his ability with England at Euro 2024.\nAmadou Onana's £50m capture from Everton is intriguing. He flattered to deceive so often at Goodison Park but plenty of sound judges rate the gifted Belgium midfielder as a genuine star of the future. Ross Barkley's return has the element of a punt about it but he was cheap at £5m and showed his class at Luton Town last season.\nIan Maatsen is a smart capture from Chelsea, the Dutch left-back having helped Borussia Dortmund to the Champions League final during his loan spell last season.\nChampions League football will put an additional strain on Emery's squad but I fancy top four again.\nAston Villa fan writer David Michael on BBC Sport's Aston Villa club page:\n\"Sixth. The fact that's being conservative shows you how far Villa have come under Unai Emery. If Villa got through the expanded group stages of the Champions League and once again qualified for European competition via the Premier League, that would be a very satisfactory season.\"\n5. Manchester United\nLast season: Eighth\nErik ten Hag is still in a job after winning the FA Cup last season but he is surely realistic enough to know he needs a good start to stop speculation rearing its head again, even after signing a new contract.\nUnited have not made any signings that can be considered game-changers and the injury to new teenage central defender Leny Yoro was a body blow.\nTen Hag will hope Lisandro Martinez, a real warrior, can stay fit while he knows what Matthijs de Ligt can give him in central defence from his time at Ajax, but he was not an unqualified success at either Juventus or Bayern Munich - and it has often been a case of \"buyer beware\" when the latter are happy to sell their players.\nLots of questions to answer - not least from the manager. Can Marcus Rashford revive his career? What will become of Jadon Sancho? How will Joshua Zirkzee fit in?\nThere are outstanding youngsters, though, in Kobbie Mainoo and Alejandro Garnacho, so with less than full confidence I go for an upgrade in league position this season. Ten Hag will need it.\nMan Utd fan writer Alex Turk on BBC Sport's Man Utd page:\n\"Fourth. As has been the case every season since 2013, United fans can realistically hope for as good as a top-four finish. But I can name three clubs likely to land above Erik ten Hag's side in several different combinations.\"\n6. Tottenham Hotspur\nLast season: Fifth\nReally interesting season ahead for Spurs. Yes, last season was an improvement under Ange Postecoglou, especially after the departure of Harry Kane, but missing out on the top four after getting into such a strong position must be considered a missed opportunity.\nPostecoglou's brand of attacking football was a sharp contrast to the stodge of Jose Mourinho and Antonio Conte but was too easily rumbled by opponents in the second half of the season. The Australian showed no signs of bending but surely there must be more pragmatism?\nInteresting transfer business, as well.\nDominic Solanke, signed from Bournemouth in a deal that could be worth £65m, showed signs last season of maturing into the striker Chelsea and Liverpool thought he might be while teenager Archie Gray looked an outstanding prospect at Leeds United.\nSon Heung-min will once again be the inspiration and there is enough quality elsewhere to suggest top six is very realistic.\nAnd watch out for 17-year-old Mikey Moore, a player those behind the scenes at Spurs discuss with barely disguised excitement.\nTottenham fan writer Ali Speechly on BBC Sport's Tottenham page:\n\"Fifth. My heart says top four, but my head says fifth. Let's build on what Ange laid the foundations for last season by playing well more consistently, and give it our best shot to win the Europa League.\"\n7. Chelsea\nLast season: Sixth\nImpossible to predict what will happen in the next 20 minutes at Chelsea, let alone what might have happened by the time May rolls around.\nAnother season and another new manager. This time it is Enzo Maresca, lured from Leicester City to succeed Mauricio Pochettino, who pieced together the small community that made up his Chelsea squad to take them into Europe, although there was disappointment in the Carabao Cup final against Liverpool.\nMaresca has a squad bulging with talent. He also has a squad that is bulging.\nChelsea's fans are disappointed to see Conor Gallagher potentially being sold but the revolving door keeps spinning and will continue to do so until the transfer window closes. Pedro Neto is an exciting arrival from Wolves, Kiernan Dewsbury-Hall is another good signing, but where is the structure and what is the plan?\nOnce again, it seems like the scattergun is out at Stamford Bridge.\nThere is real talent in this squad, with Cole Palmer a brilliant signing who made a huge impact for England at Euro 2024, scoring in the final against Spain, so if Maresca can get it right, this might be an unflattering prediction.\nMaresca, however, has much to prove. Is he actually an upgrade on Pochettino or simply someone will adhere more to the whims of Todd Boehly and the Chelsea hierarchy?\nChelsea fan writer Will Faulks on BBC Sport's Chelsea page\n\"Chelsea will finish in seventh place, far off the top teams once again. We hope this season sees fans able to build connections with this group of players and with the club again, before they lose touch entirely.\"\n8. West Ham\nLast season: Ninth\nJulen Lopetegui has replaced David Moyes, whose full worth to West Ham United may yet become clear in the months ahead, and not just because he won the Europa Conference League.\nLopetegui has been keen to return to the Premier League since leaving Wolves and has the squad to prove his worth, backed by good transfer business in the summer.\nWest Ham already had plenty of class with Jarrod Bowen, Lucas Paqueta and Mohammed Kudus, while they have added to that with the signings of Crysencio Summerville from Leeds United and Niclas Fullkrug from Borussia Dortmund. The powerful Germany striker looks a perfect Premier League fit.\nLopetegui has also been reunited with former Wolves captain Max Kilman, who will play alongside Jean-Clair Todibo at the heart of defence, a signing regarded as a real coup.\nProspects look good for the Hammers if Lopetegui can piece it all together. Good bet for a cup.\nWest Ham fan writer James Jones on BBC Sport's West Ham page:\n\"Eighth-10th. The hope is that we build on the solid foundations set by David Moyes while also playing a nicer style of football. We're not looking for prime Barcelona, just signs that we actually want possession of the football.\"\n9. Newcastle\nLast season: Seventh\nStrange summer at Newcastle United, with churn backstage caused by the departure of Amanda Staveley from the boardroom and the arrival of Paul Mitchell as sporting director following Dan Ashworth's move to Manchester United.\nThe European football Newcastle thought they had was taken away by Manchester United's FA Cup final win over Manchester City, while profit and sustainability rules (PSR) meant the reluctant sales of Elliot Anderson to Nottingham Forest and Yankuba Minteh to Brighton respectively.\nAnd then came the revelation that the departure of last season's star man and England winger Anthony Gordon to Liverpool had even been discussed to raise funds until other players left.\nThrow in the speculation linking manager Eddie Howe with England and it has hardly been plain sailing on Tyneside.\nHowever, if Newcastle can get a deal for Crystal Palace defender Marc Guehi, arguably England's best player at Euro 2024, over the line then the club and the Toon Army will feel a lot better about themselves.\nTop 10 but still some uncertainty at Newcastle United.\nNewcastle United fan writer Charlotte Robson on BBC Sport's Newcastle page:\n\"I think Newcastle will finish fifth and secure European football for another season. My hope is that we finish fourth and get back into the Champions League, and that we get to one cup final this time around. We were depleted last season as we dealt with an unprecedented injury crisis, but we now have depth back in the squad.\"\n10. Crystal Palace\nLast season: 10th\nCrystal Palace did not want last season to end, playing thrilling, free-scoring football under new manager Oliver Glasner, inspired by Eberechi Eze, Jean-Philippe Mateta and Michael Olise, with new young star Adam Wharton pulling the strings.\nOlise has left for Bayern Munich and Palace must hope to keep the other three, although Guehi may be on his way to Newcastle.\nIf they do stay, then Glasner's all-out attacking approach has every chance of making it another entertaining, enjoyable season at Selhurst Park.\nCrystal Palace fan writer Alex Pewter on BBC Sport's Crystal Palace page:\n\"Tenth place. Last season was only the fourth time the club has finished in the top half of the top flight, three of those being in 10th. Establishing themselves as the best of the rest would be a big step forward for Palace, even if it's not to the outside world.\"\n11. Everton\nLast season: 15th\nSean Dyche did a fine job to spare Everton another late scramble for Premier League survival after they were deducted eight points for breaches of profit and sustainability rules. He will hope no similar complications arise in what will be an emotional final season at Goodison Park.\nEverton rebuffed Manchester United to keep prize asset Jarrad Branthwaite, at least so far, his powerful partnership with James Tarkowski pivotal - along with the outstanding goalkeeper Jordan Pickford - in recording the fourth-best defensive record in the Premier League.\nThey have been joined by the giant figure of Republic of Ireland defender Jake O'Brien from Lyon.\nAmadou Onana has left for Aston Villa but £50m can be regarded as good business given his indifferent performance.\nEverton's problem was a lack of potency, with much reliance on the fitness of striker Dominic Calvert-Lewin, but Dyche has added flair with Iliman Ndiaye from Marseille and Denmark winger Jesper Lindstrom on loan from Napoli.\nThey will need luck with injuries to fulfil this forecast, as well as one or two more additions, but I do not see Everton struggling this season.\nEverton fan writer Mike Richards on BBC Sport's Everton page:\n\"I'm predicting 11th. Hopefully a comfortable mid-table finish. Goodison Park deserves the greatest of send-offs and one that is most definitely not dictated by any potential battles for survival. Complete faith in the manager - he's earned it.\"\n12. Brighton\nLast season: 11th\nBrighton's season rather fizzled out in the final days of the charismatic Roberto de Zerbi and, in keeping with the club's approach, he has been replaced by the intriguing appointment of the Premier League's youngest-ever permanent manager in 31-year-old Fabian Hurzeler, fresh from leading St Pauli into the Bundesliga.\nHurzeler takes over a talented squad, with the return of exciting Japan star Kaoru Mitoma a huge lift. He will also hope young striker Evan Ferguson can fulfil his rich potential in an attack also boasting Joao Pedro and Simon Adingra.\nYankuba Minteh and Ibrahim Osman add threat, although the loss of cult hero Pascal Gross will be felt.\nHurzeler will also hope Brighton can fend off overtures from Napoli for Billy Gilmour so he can figure in midfield along with new £25m signing Mats Wieffer from Feyenoord.\nThis may not be the top-six season of a couple of years back but Brighton are always so watchable and will be again. A trip to Amex Stadium is never a wasted one.\nBrighton fan writer Scott McCarthy on BBC Sport's Brighton page:\n\"We'll finish 10th. Playing it safe by going slap bang in the middle as it is impossible to know whether Fabian Hurzeler will succeed in English football or appointing a 31-year-old is a gamble too far. I suspect it will be fun finding out, either way.\"\n13. Fulham\nLast season: 13th\nFulham finished in a comfortable position last season despite losing key striker Aleksandar Mitrovic. This time manager Marco Silva must do the same after losing outstanding midfielder man Joao Palhinha to Bayern Munich and key defensive duo Tosin Adarabioyo to Chelsea and Tim Ream to Major League Soccer club Charlotte FC.\nSilva, however, has proved himself adept at dealing with such matters and the acquisition of Emile Smith Rowe from Arsenal could be a masterstroke, a talented player loved by Gunners fans who simply could not force his way into regular contention.\nRyan Sessegnon has made a popular return from Tottenham and if defender Diego Carlos can arrive from Aston Villa then Silva can be satisfied with a decent summer.\nCalvin Bassey was a growing force in defence last season while striker Rodrigo Muniz developed rapidly. Silva will count on him.\nMuch will depend on Silva himself but think Fulham will have a relatively untroubled season.\nFulham fan writer Drew Heatley on BBC Sport's Fulham page\n\"I'm saying 10th. We've lowered the average age of a squad that was the oldest in the league. And in what could be Marco Silva's last campaign at the Cottage, I'm hoping he cements his legacy - perhaps even with a domestic cup?\"\n14. Bournemouth\nLast season: 12th\nThe loss of Dominic Solanke, who provided 19 Premier League goals last season, was a bitter blow to the Cherries but under the guidance of manager Andoni Iraola there will still be optimism on the south coast.\nIraola provided a measured, calm response to a dreadful start last season by sticking to his pressing principles and Bournemouth improved.\nSolanke's departure will increase responsibility on Antoine Semenyo and more consistency will be expected from Luis Sinisterra now he has made a permanent £20m move from Leeds United after a loan spell.\nCould be anxious times ahead but expect the Cherries, under Iraola, to survive.\nBournemouth fan writer Tom Jordan on BBC Sport's Bournemouth page.\n\"Tenth. We can finish in mid-table this season, so I'm going for a 10th place finish. In our first season back in the top flight, we finished 15th under Gary O'Neil, last season it was 12th under Iraola. Another step forward feels doable.\"\n15. Wolverhampton Wanderers\nLast season: 14th\nGary O'Neil did a first-class job after taking over at Molineux in turbulent circumstances just before the start of last season following the departure of Julen Lopetegui. The same again would be more than good enough after a quiet summer of incomings at Wolves so far.\nMax Kilman and Pedro Neto are big losses, although the latter was often missing because of injury, so Wolves will rely heavily on O'Neil, who has just been rewarded for his work with a new four-year contract.\nTommy Doyle has made his move from Manchester City permanent after good season on loan but Wolves will need to reinvest some of the money raked in for Kilman and Neto to keep O'Neil's side away from trouble make sure this forecast comes to fruition.\nThis prediction leans heavily on more new signings and O'Neil's ability, but I think Wolves can avoid danger - and surely they will get a better deal from VAR this season.\nWolves fan writer Dazzling Dave on BBC Sport's Wolves page:\n\"Ninth. Gary has Wolves purring nicely and we look like a team that can push on. On the whole, the friendlies have unveiled a new side of Wolves, with a higher pressing game and plenty of energy. With new recruits and returning players, the squad now looks much stronger. I am predicting a top 10 finish and a push for a European spot.\"\n16. Nottingham Forest\nLast season: 17th\nNuno Espirito Santo's presence as Nottingham Forest manager in succession to Steve Cooper was hardly inspirational but the priority of survival was achieved, especially after being deducted four points for breaching financial regulations.\nIt gives the Portuguese the chance to push on in an attempt to satisfy the demands of Forest owner Evangelos Marinakis.\nForest's magnificent support at the City Ground was a crucial factor and will be again, as will the continued presence of Morgan Gibbs-White, a significant contributor to their cause in the past two seasons. It is vital that Forest hold on to him.\nHe will be a central figure along with last season's player of the year Murillo, with the outstanding 22-year-old defender linked with Chelsea, Spurs and Atletico Madrid. Forest are under no pressure to sell and the Brazilian appears happy to stay.\nWales right-back Neco Williams has attracted interest from Atalanta but if Forest keep this squad together (and they are always looking to add) then I see them staying up.\nNottingham Forest fan writer Pat Riddell on BBC Sport's Nottingham Forest page:\n\"A hopeful 14th. Ideally we'd like a solid season, without too many changes or too much controversy, and an opportunity to see the team progress and really find their feet this year. It won't be easy but it's definitely possible.\"\n17. Brentford\nLast season: 16th\nThe shadow of Ivan Toney's potential departure will hang over Brentford for the rest of this transfer window and there is no doubt it would damage the Bees in a big way if he leaves, especially after a cruel twist of fate in pre-season.\nBrentford completed the club record £30m signing of Brazilian striker Igor Thiago from Club Bruges, perhaps in readiness for Toney's sale, only for him to be ruled out until near the end of the year, having required knee surgery after being injured in a friendly against AFC Wimbledon.\nIt makes a deal for Toney even more hazardous to contemplate but it may still happen with the England striker entering the final year of his contract.\nManager Thomas Frank continues to do a fine job but this may be his biggest test, although the £27.5m signing of Liverpool's talented 21-year-old Fabio Carvalho will lift morale.\nIt makes Bryan Mbeumo's presence even more significant while the return after injury of experienced defender Ben Mee, who has signed a new one-year deal, will also be a boost.\nBrentford fan writer Ian Westbrook on BBC Sport's Brentford page:\n\"Twelfth. The strength of Brentford's forward line - even without Igor Thiago for now and if Ivan Toney leaves - should ensure a comfortable 12th-place finish. My overall hopes are for a largely injury-free campaign and a good cup run.\"\n18. Southampton\nLast season: N/A\nNo pleasure in any of these last three placings - all great clubs back in the top flight and no doubt all as determined to make complete fools of naysayers such as this one.\nSouthampton came up by beating Leeds United in the play-off final after a season playing in the attractive manner demanded by their progressive young manager Russell Martin.\nIt may be a high-risk strategy in the Premier League, as Burnley discovered last season, but Martin does not appear for turning. He does it his way - admirable and sure to increase his reputation if he can pull it off.\nFlynn Downes has made his loan move from West Ham United permanent, the same applying to Taylor Harwood-Bellis after promotion triggered a £20m switch from Manchester City.\nBen Brereton Diaz will be asked to bring goals after the Chile striker's £7m move from Villarreal while Adam Armstrong, last season's play-off match winner who scored 24 goals in the Championship, will hope to have better fortunes in his latest crack at the Premier League.\nWill it be enough? I'm not convinced but the environment at St Mary's will be a tough one for opponents.\nSouthampton fan writer Ray Hunt on BBC Sport's Southampton page:\n\"I'm going for 16th. The aim will be survival. Past form is an issue, but improvements have been made and we take momentum from Wembley. The home opener against Forest will be a good gauge of how far we've come from the 2022-23 drop.\"\n19. Leicester City\nLast season: N/A\nA welcome return to the Premier League for a club that sleepwalked into the Championship in 2023 - and it comes following a turbulent summer and the possibility of a points deduction making their task even more difficult.\nThe club have made a shrewd appointment in Steve Cooper, who knows this course well after keeping Nottingham Forest up, following Enzo Maresca's departure for Chelsea.\nChelsea also took last season's star player Kiernan Dewsbury-Hall and there is that looming concern over charges of allegedly breaking financial regulations.\nCooper will look to the vast experience of former England duo Conor Coady and Harry Winks, while evergreen Jamie Vardy is still at King Power Stadium, although at 37 he will be handled with care. Abdul Fatawu, a real fans' favourite on loan from Sporting Lisbon, will add flair and dynamism after signing permanently.\nThe Foxes are trying to get Wilfried Zaha on loan from Galatasaray and have made a bid for Panathinaikos striker Fotis Ioannidis to increase firepower.\nCooper and Leicester could defy the odds but it may well be a steep uphill struggle.\nLeicester City fan writer Chris Forryan on BBC Sport's Leicester page:\n\"Seventeenth. We have to accept that we are not the Leicester City side that had achieved Premier League stability, we are the new boys. Give me 17th and I'll bite your hand off. That is where I think we'll finish.\"\n20. Ipswich Town\nLast season: N/A\nIpswich Town manager Kieran McKenna has already performed miracles to win back-to-back promotions in going from League One to the Premier League. If he keeps the Tractor Boys up, it will be his biggest achievement.\nMcKenna is one of the most highly rated young managers around, and his decision to sign a new four-year contract amid interest from Chelsea and Brighton was the biggest deal of the summer.\nIpswich will enjoy their rating as underdogs and McKenna will not worry about being written off but survival alone can be considered a huge success for the Suffolk club.\nThey have spent carefully in bringing in Liam Delap and Jacob Greaves, while Ben Johnson brings Premier League experience from West Ham United on a free.\nNo-one inside the atmospheric Portman Road will believe relegation is on the cards and nor will McKenna or his players - but it will be some feat if they stay up.\nIpswich Town fan writer Richard Woodward on BBC Sport's Ipswich page:\n\"Seventeenth - there is optimism amongst some of the fanbase that mid-table is possible, but the Premier League is a totally different level to what we're used to. Survival is a realistic objective for us, with the chance of springing a few surprises along the way.\"\n- BBC",
  "word_count": 4577,
  "scraped_at": "2026-02-14T01:51:48.876437",
  "_text_extracted": true
}