{
  "article_id": "83e7dbfb1110",
  "url": "https://www.thestar.com.my/aseanplus/aseanplus-news/2025/10/24/thailand039s-buriram-united-new-boss-jackson-relishing-challenge-with-team-the-asean-club-championship-shopee-cup-holders",
  "title": "Thailand Buriram United new boss Jackson relishing challenge with team , the Asean Club Championship Shopee Cup holders",
  "date": "20251024T114500Z",
  "domain": "thestar.com.my",
  "source_country": "Malaysia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "SINGAPORE: New Buriram United FC head coach Mark Jackson says his move to the Asean Club Championship Shopee Cup title holders is a “step forward” after the Englishman took over as the replacement for former boss Osmar Loss.\nJackson was appointed last week following the dismissal of Loss, who had led the club to an unprecedented quadruple as Buriram United won the Thai League 1, Thai League Cup and Thai FA Cup alongside the Shopee Cup last season.\nBut the Brazilian was moved on by the club earlier this month, prompting the arrival of former Central Coast Mariners head coach Jackson at the northern Thai operation.\n“I’ve only had a short period of time with the team but in that time, the staff, the players have been fantastic, and they’ve really embraced what we want from them,” says the 48-year-old former defender.\n“An opportunity came for me to make the step up in my career to work with a massive club in Thailand. They’re the biggest in Thailand. And to work with a fantastic squad of players as well, I feel it’s a step forward for me.\n“The infrastructure of the club, the status of the club, and the quality of the players made it appealing to me. I’m really looking forward to the challenge.”\nJackson’s arrival comes at a time with Buriram United is attempting to build on the successes of last season, with the club in pole position in the current Thai League 1 standings and competing once again in both the Shopee Cup and the AFC Champions League Elite.\nBuriram United’s form in regional and continental competition has fallen short of the previous campaign so far, with the club picking up a pair of draws in the Shopee Cup™ against Selangor FC and BG Pathum United FC in their opening fixtures.\nJackson, however, is confident he can apply the experience he gained in leading Central Coast to the AFC Cup title in 2024 and during the Australian club’s AFC Champions League Elite campaign last season to lift Buriram United back to winning ways.\n“When you go to a big club the pressure is on, I fully understand that,” he says. “It’s where I want to be in my career. I feel that pressure is good, it keeps you on your toes, it keeps you driven, focused and motivated. That’s really important.\n“Of course, it brings a different challenge to the Central Coast but I welcome that. The players are fantastic, the president has built a fantastic squad at the club.\n“And circumstances happen in football, it happens all around the world, changes happen and it’s about how the staff, the players and myself embrace that change now so we can transition into winning football again.\n“The team has been doing very well and I want to continue that with my own take on that and my own influence on the team as quickly as possible.\n“It was more about the challenge here working, with a club of such stature, a squad of really, really high quality. That enticed me into making the decision. It’s exciting for me, personally.”\nJackson’s career has been on an upward trajectory since he first moved into coaching having previously played as a defender for the likes of Leeds United, Scunthorpe United and Rochdale.\nHis first managerial appointment came in 2022 when he took over at Milton Keynes Dons, although that initial foray into coaching ended in dismissal following the club’s relegation to League Two in England.\nFrom there he was named Central Coast Mariners coach in 2023 following the departure of Nick Montgomery and, in his first season, he led the club to a remarkable treble, lifting the A-League Premiership, A-League Championship and the AFC Cup.\nAmong the stand-out results during his time at the Mariners was a 3-1 win over Melbourne Victory in the A-League Grand Final plus a 1-0 victory against Lebanon’s Al-Ahed in the final of the AFC Cup in Muscat.\n“You’re growing every time,” says Jackson of his coaching journey. “It doesn’t matter as a coach how experienced you are, how old you are. And as a player, too, I think you can learn all the time.\n“If you ever get to a point where you accept that you can’t learn any more, I think that it’s time for you to quit because you can learn in every aspect of the game, no matter what.\n“I learnt a lot in my time with the Mariners in the AFC Cup in my first season and particularly in the AFC Champions League Elite as well last year. I learnt a lot.\n“Every manager is evolving how they work, the tactics of the game, and I think all the time I’m getting clearer and clearer in my mind what I want. The important thing is you go and transmit that to a group of players.\n“The exciting thing for me is I can transmit that to an exceptional group of players who want to learn, they’ve got great quality and great experience. That’s a challenge for me and it’s an exciting opportunity for me.”",
  "word_count": 853,
  "scraped_at": "2026-02-14T01:55:21.381880",
  "_text_extracted": true
}