{
  "article_id": "83fb64bfa025",
  "url": "https://www.managingmadrid.com/2024/3/16/24101860/its-city-16-march-2024",
  "title": "It City : 16 March 2024 - Managing Madrid",
  "date": "20240316T084500Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Daily Merengue is a place where you can feel free to discuss all things football. Do not be alarmed by the overt RMCF bias. It’s in the name!\nIt’s City: 16 March 2024\nToday’s Edition of the Daily Merengue\nShoutout to the mods who do a fantastic job, Valyrian Steel, Kung_Fu_Zizou, Juninho, NeRObutBlanco and yours truly, Felipejack.\nIt’s City...again.\nand like last season, not in the configuration that we’d like: 1st leg is at home (9 April), 2nd leg away (17 April).\nIt looks like Man City also didn’t like the result. Their sporting director said “What a shame again, bored with these balls, always the same…”\nThe possible semifinals configuration is a little better. If Real Madrid get past City, we’ll play the 2nd leg at home and the opponent would be Bayern or Arsenal.\nHere is UCL full schedule:\nTwo UCL games in the same week in Madrid\nThe 1st leg of Atleti vs Borussia is also at Madrid only 24 hours apart of Real vs City. Due to security reasons, there is chance that UEFA switch Real vs City orders, so the 1st leg turns to be played at Eithad. There switch would affect Real and City game because Atleti was draw first.\nAncelotti dismissed this, saying it’s does not make a difference. Honestly, I don’t like it. If there is a switch and we win in 2nd leg, people will say UEFA favoured us....\nUEFA already weight in on the matter:\nMilitão and Courtois are training with the team\nAncelotti said the international break will be used to make two internal friendlies with the youth team, with the idea they’ll be available vs Bilbao.\nPer report, Ancelotti wants to count with them for the game against City. Completely without match rhythm, almost impossible to believe.\nMore NT calls.\nMore Real Madrid players have been called by their respective NTs: Carvajal and Joselu (Spain). Güler (Turkey).\nIt’s matchday!\nWe focused on the results of the UCL draw yesterday, but it’s matchday. Real Madrid face Osasuna today. Let’s keep the advantage we’ll have on the table.\nDue to FIFA break, Real Madrid next game is vs Bilbao on 31 March. Then, Real Madrid will have about 9 days to rest and prepare for the 1st leg vs City. As CDR final is on 6 April, there is no LL game in that weekend.\nHala Madrid!",
  "word_count": 398,
  "scraped_at": "2026-02-14T01:48:46.206275",
  "_text_extracted": true
}