{
  "article_id": "8412e26e5d3a",
  "url": "https://metro.co.uk/2026/01/21/he-stay-arsenal-star-told-pull-january-move-26427870/",
  "title": "  He should stay  - Arsenal star told he should pull out of January move",
  "date": "20260121T144500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Emmanuel Eboue has urged Ethan Nwaneri to pull the plug on a January loan move to Marseille and be ‘patient’ for minutes at Arsenal in the second half of the season.\nNwaneri broke out of Arsenal’s academy ranks to become the youngest ever player to feature in an English top-flight match back in 2022, aged just 15 years and 181 days old.\nAnother Premier League appearance followed midway through the 2023/24 campaign – but it was last season that Nwaneri cemented his place as a regular in Mikel Arteta’s first-team squad.\nNwaneri made a total of 29 appearances in the league, including 11 starts, while chipping in with a more than respectable tally of four goals and two assists.\nHowever, the 18-year-old attacking midfielder has been forced to settle for a bit-part role this time around and is still yet to make a single start in the Premier League after 22 games.\nThe Gunners were initially thought to be doubtful over a proposed loan switch for the England Under-21 international, preferring instead that he stays put to continue his development in north London amid strong interest from West Ham and Bournemouth.\nBut Ligue 1 outfit Marseille have initiated contact with Nwaneri’s entourage and discussions are progressing in a positive direction, with Roberto De Zerbi appearing to welcome the youngster’s impending arrival on Tuesday.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nFormer Arsenal defender Eboue, though, believes Nwaneri would be far better off growing and ‘learning’ under Arteta for the time being.\n‘You know Nwaneri and [Myles] Lewis-Skelly as young players, they want to show Arsenal players their quality and that they can play. I know that,’ Eboue told AceOdds.\n‘This year it will be very difficult for them to get game-time as Arsenal want to win the trophies.\n‘Arteta, as I said, won’t risk things too much and he will play the guys who are available to play.’\nThe Ivorian added: ‘They have to be patient. They have to learn how to do their best with whatever minutes they get this year. And I think next year it will be good for them.\n‘Some young players rush too much because they want to play and ask their club to go on loan.\n‘So I think for them, they should stay and learn more playing under Arteta.’\nLooking ahead to Arsenal’s next match in the Premier League, Eboue is anticipating a tough clash against a resurgent Manchester United.\n‘We saw United and the way they were motivated against Manchester City. I didn’t expect them to play like that,’ he said.\n‘Now, they have a good team and they’re ready to fight for the club so Arsenal will have to be at their best to win the game.\n‘They have to give their very best. I don’t think it will be easy.’\nAccording to Eboue, Manchester City will be doing everything in their power to ‘fight back’ in the Premier League, meaning the job is far from done for Arsenal.\n‘City have a good squad, but they are making a lot of mistakes this season,’ he explained.\n‘It has been very difficult for them to win, even against the small teams. Arsenal have to take advantage of this and Arsenal have to win all their games.\n‘The reason why they have to do more is also because I think that City will try to fight back.’\nThe ex-Ivory Coast international is confident most Arsenal supporters will have winning the Premier League title at the top of their list of priorities for the second of the season.\n‘For the fans, the Premier League trophy is the most important one, and while the others are important, this one is certainly the priority,’ he continied.\n‘They haven’t won it for a long time, so this year it is very important for both the fans and the club.\n‘Winning other cups would be a bonus, but the league is the best thing to win for the fans. They will be happy if they win the Champions League, but I think they will be more happy if they win the league.\n‘If Arsenal win the league, they are going to be more than just happy.’\nMore Trending\nIf Arsenal let their lead slip and somehow fail to win any silverware this season, Eboue can see a world in which the fanbase start to become seriously agitated.\n‘Arteta has done good things for the club, but as a fan you want to win the trophy,’ he said.\n‘When Arsene Wenger was there, they were happy when he won the Premier League, but in the long run they wanted to change him because they wanted to win the league.”\n‘This year, the fans are expecting the club to win the league. The players need to do a bit more to get it over the line though.’\nWill Arsenal win the Premier League title this season?\n-\nYes\n-\nNo\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Chelsea close in on £56m deal ahead of Arsenal with tempting new offer\nMORE: England international told to leave Marseille as Ethan Nwaneri set to arrive\nMORE: Chelsea legend Marcel Desailly apologises to Arsenal star over ‘huge misjudgement’",
  "word_count": 927,
  "scraped_at": "2026-02-14T01:53:15.587235",
  "_text_extracted": true
}