{
  "article_id": "84567eb967d4",
  "url": "https://www.bbc.co.uk/sport/football/65463322",
  "title": "Mauricio Pochettino : Why the Argentine believes Chelsea is the perfect club for him",
  "date": "20230514T140000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mauricio Pochettino: Why the Argentine believes Chelsea is the perfect club for him\n- Published\n- comments\nMauricio Pochettino is back in the Premier League.\nThe former Espanyol, Southampton, Tottenham and Paris St-Germain manager will be the Chelsea boss next season for his third spell in charge of an English club.\nHe becomes owner Todd Boehly's third permanent boss in the 12 months since he took control of the club - and his fourth appointment, counting interim coaches Bruno Saltor and Frank Lampard.\nThe Argentine arrives at Stamford Bridge after a season of turmoil for the Blues, who have spent £600m since the takeover.\nBut what Pochettino are the Blues getting? And why has the 51-year-old decided now is the time to return - to a club seemingly in a mess - after almost a year out of the game?\n'He has turned down a number of clubs since leaving PSG'\nJoining Chelsea is not a decision Pochettino has taken lightly; he has turned down a number of potential suitors since leaving PSG in July 2022.\nThere was a chance he could have joined them last September when Thomas Tuchel left but, by then, Chelsea had more or less decided to bring in Graham Potter in and the approach made to Pochettino by Chelsea seemed half-hearted at best.\nThere are other factors why the opportunity feels different this time.\nBack then, Chelsea fans were still missing Tuchel, who had won the Champions League for the club less than three months after taking over from Frank Lampard.\nPochettino would also not have been offered as much control as he is now. If he learned one thing at PSG it was that to achieve success he and his team would need influence throughout the club from academy level upwards.\nHe hasn't been short of offers since leaving Paris, but none have ticked as many boxes as Chelsea have, certainly in this second round of negotiations with the club.\nHe was determined to make sure that he made the right choice as to his next employer - and initially turned down Boehly's Chelsea until he was offered more control.\nHe has received approaches from Benfica, Athletic Bilbao, Aston Villa and Nottingham Forest. Sevilla also made contact, as did Villarreal, Nice and Leeds United.\nBut after six consecutive years in the Champions League, reaching one final and one semi-final, he wants to go to a club that he believes will challenge for titles.\nHe would certainly have gone to Manchester United and had spoken to them on a few occasions both before and after Ole Gunnar Solskjaer's departure and was very disappointed not to get the nod, especially as he had the backing from many at the club, not least from Sir Alex Ferguson.\nEverything at Chelsea fits. It is a young squad, a thriving academy coupled with a desire from the owners to bring youth through, a philosophy that is aggressive and dynamic with high pressure and loads of energy.\nMuch, of course, will depend on who he can bring in, with a need to find a striker clearly a main objective. Should Romelu Lukaku manage to steer clear of injury, he could well be an option, although he is going to have to jettison some players before contemplating additions to the squad.\n'Pochettino is not allowed to be Pochettino' - what happened at PSG?\nOn 5 July 2022, Paris St-Germain and Pochettino went their separate ways.\nIt was a rushed 'marriage', with just five days over the Christmas period from initial contact to the signing of the contract back in January 2021, and with the relationship ending 18 months later.\nThree of the four incumbents at the Parc des Princes prior to Pochettino (Carlo Ancelotti, Unai Emery and Thomas Tuchel) went on to win European trophies after leaving the club, so it would be too simple to explain their lack of European success on the managers.\nThere is inherently a problem at PSG, a club that seems to see its coaches predominantly as babysitters to the huge talents their countless riches can acquire.\nThis was always going to frustrate someone such as Pochettino and his team, who dedicate themselves to developing new talent while maximising what is available to them, rather than spending most of their time trying to keep superstars happy.\nHe wants to influence his players in a positive way and apply high-tempo, high-energy football on the pitch. That was never going to be possible in Paris.\nThese are things you can only do if you are granted the authority to do so. Once it became clear that he was there merely to keep everything on an even keel and to ensure the megastars remained in their comfort zone, then his days were numbered, because these are things that have little to do with coaching.\nHe also had to deal with the thorny problem of being the first coach to have Kylian Mbappe, Lionel Messi and Neymar together. The perception was with three of the greatest players in the world at his disposal, they should then win everything - it is never as simple as that.\nBack in November 2021, after PSG lost to Manchester City in the group stages of the Champions League, Thierry Henry commented: \"Pochettino is not allowed to be Pochettino at times with that team.\"\nWitnessing PSG's difficulties since he left, one could conclude he took the team as far as he could bearing in mind the limitations placed upon him.\nIn his last season, he won back the French title and should have enjoyed a victory over Real Madrid in the Champions League last 16 - PSG were superior until late in the tie.\nWhere has he been since leaving PSG?\nAn onerous and draining season and a half at PSG left him needing to recharge his batteries.\nThe huge enjoyment and job satisfaction he achieved at Spurs ended in sadness, especially when four months later, the world was thrown into lockdown which denied him the chance to process what had happened to him.\nThis time, he has been able to process things. He returned to Japan, a country he last visited with Argentina for the 2002 World Cup, only this time as a tourist with his family.\nMuch of his time is spent travelling between London and Barcelona. He hadn't seen as much of his son as he would have liked, primarily because when he was at PSG, it was impossible to travel and Maurizio was playing for Watford. He has now moved to Gimnastic Tarragona, in Spain's third tier, and Pochettino gets to see him play whenever he can.\nWhile in Paris, there were many periods when he could not see his wife because of lockdown restrictions. Much of his life was spent in the cosseted luxury of a five-star hotel.\nThis latest break has left him much fresher.\nHe has done a lot of coaching masterclasses along with his assistant Jesus Perez, who will join him at Chelsea, as will first-team coach Miguel D'Agostino, his son Sebastiano, a sports scientist, and goalkeeping coach Toni Jimenez. The group are inseparable friends, and all but Sebas have worked together since Pochettino's time at Espanyol.\nHe has also spent much time helping younger coaches work towards their coaching badges, while learning from their more youthful approach as the game continues to evolve.\nWhat will he need to do to succeed at Chelsea?\nPochettino is conscious that, unlike at Espanyol, Southampton and Tottenham, PSG was the first club where he had not left something of real value.\nWhat his time at PSG taught him is he needs to return to his essence, with all his passion and intensity, not dissimilar to the relationship he enjoyed with his players at Spurs.\nFor that, he has taken a good look at himself and what he did wrong at the French club, what he could have done better and how he can avoid making similar mistakes at Chelsea.\nHe needs to have the energy to be able to mould players, know that the players are listening to him and have the authority to ensure that this is happening.\nHe realises that, at Chelsea, he needs to control the agenda as much as possible - something he could not do at PSG.\nPochettino will also need to gather around him people who can understand everything about the club, what makes it tick and how he can control matters off the training pitch.\nAnd most importantly, he needs to get the message across that this will not be a quick fix and, more than vast sums of money, what is required most is time. A year will help. Two years, he believes, will guarantee the redirection and recovery of this massive club.\nOur coverage of Chelsea is bigger and better than ever before - here's everything you need to know to make sure you never miss a moment",
  "word_count": 1487,
  "scraped_at": "2026-02-14T02:00:19.998541",
  "_text_extracted": true
}