{
  "article_id": "8459b1e35303",
  "url": "https://www.thisdaylive.com/index.php/2024/08/14/remo-stars-coach-ogunmodede-beats-chest-ahead-of-caf-cl-with-moroccos-as-far/",
  "title": "Remo Star Coach , Ogunmodede , Beats Chest ahead of CAF CL with Morocco AS FAR – THISDAYLIVE",
  "date": "20240814T061500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nRemo Stars’ Coach, Ogunmodede, Beats Chest ahead of CAF CL with Morocco’s AS FAR\nHead coach Remo Stars FC Daniel Ogunmodede is confident that the Ikenne-based side will put up a good fight when they trade tackles with Morocco’s AS FAR this Sunday in Ikenne.\nRemo Stars are poised for a return to continental football as they prepare to host Morocco’s AS FAR in the preliminary round of the 2024/25 CAF Champions League.\nAfter finishing second in the Nigerian league last season, trailing only champions Rangers International, the NPFL team earned their place in Africa’s premier club competition.\nThis upcoming fixture is set to be a defining moment for Remo Stars, reviving memories of their previous continental outings.\nTheir last encounter with AS FAR dates back to the 2021/22 CAF Confederation Cup.\nDuring that campaign, Remo Stars, led by then-coach Gbenga Ogunbote, managed an impressive 1-1 draw in Rabat, only to falter in the return leg at home, suffering a narrow 1-0 defeat that ended their journey.\nThis time, the stakes are even higher as Remo Stars aim to make history by advancing to the group stage of the CAF Champions League for the first time.\nWith the memories of their past encounter still fresh, the team is determined to turn the tables and secure a victory.\nHead coach Daniel Ogunmodede, reflecting on the team’s growth since their last meeting with AS FAR, remains confident in their prospects.\n“We learn from our experiences, and I believe we will do better this time around. The squad has been training, and we will be ready,” Ogunmodede stated.\nThe return leg will hold at Stade Prince Moulay El Hassan on August 25.",
  "word_count": 281,
  "scraped_at": "2026-02-14T02:10:58.958671",
  "_text_extracted": true
}