{
  "article_id": "8467502ec907",
  "url": "https://metro.co.uk/2025/02/13/ruud-van-nistelrooy-responds-to-arsenal-striker-concern-after-kai-havertz-injury-22555311/",
  "title": "Ruud van Nistelrooy responds to Arsenal striker concern after Kai Havertz injury",
  "date": "20250213T183000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ruud van Nistelrooy insists Arsenal have a deep enough squad to cope with the absence of Kai Havertz’s ahead of their Premier League match against Leicester City on Saturday.\nMikel Arteta’s side were dealt a huge blow this week as Havertz was ruled out for the remainder of the season with a hamstring injury.\nWith Gabriel Jesus also sidelined with a long-term knee injury, Arsenal are without a recognised striker for the remainder of the campaign, while both Bukayo Saka and Gabriel Martinelli are also unavailable due to hamstring issues.\nArsenal travel to Leicester for Saturday’s 12.30pm kick-off in the Premier League and Van Nistelrooy believes Arteta still has plenty of options to cope without the Germany international.\nWhen asked about Havertz’s absence, Van Nistelrooy said: ‘Well, the depth of their squad is clear.\n‘Obviously, not having Saka and Havertz, they are absolutely top of the world, players that are in that level is something they will feel.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘But the squad, when you look at that, they have enough player to replace them.\n‘It’s clear that the difference between us and Arsenal is big. You can see that, it is in the table. The team is fighting for the title, is in the Champions League, so it’s a big challenge for us and something for us to look forward to.’\nMore Trending\nVan Nistelrooy also credited Arsenal for their impressive success from set-pieces this season.\n‘They’ve been very successful on set-pieces but not just that,’ Van Nistelrooy said.\n‘You can see the development in football, in the Premier League, with set-pieces, with set-piece coaches, and with the approach on all set-pieces, throw-ins, corners, free-kicks, penalties, everything.\n‘The amount of training invested in this part also for us is increasing because games are decided on this and Arsenal are excellent in this part.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd line up former Man City star to solve striker crisis\nMORE: Martin Keown names Leicester ‘problem’ ahead of Premier League clash vs Arsenal\nMORE: Barcelona refuse to rule out defender’s exit after Arsenal transfer links",
  "word_count": 415,
  "scraped_at": "2026-02-14T02:02:19.833345",
  "_text_extracted": true
}