{
  "article_id": "846a99171b0e",
  "url": "https://www.teamtalk.com/liverpool/jurgen-klopp-urged-axe-two-liverpool-players-world-cup-star-targeted-upgrade",
  "title": "Jurgen Klopp urged to axe two senior Liverpool players with World Cup star targeted as high - quality upgrade",
  "date": "20230208T091500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJurgen Klopp urged to axe two senior Liverpool players with World Cup star targeted as high-quality upgrade\nLiverpool boss Jurgen Klopp has been told to sell two players who look past their best in the summer transfer window, in a move which would allow the Reds to bring in a world-class replacement.\nLiverpool are languishing in 10th place in the Premier League following three defeats and one draw in their last four matches in the competition. Klopp’s men did overcome Wolves in an FA Cup third round replay recently. But they were beaten 2-1 by Brighton at the next stage.\nTo make matters worse for Klopp’s men, Wolves got their revenge on them by convincingly winning 3-0 in the league on Saturday.\nThings do not look like they are going to get any easier for Liverpool, either. They will come up against local rivals Everton on Monday, and the arrival of Sean Dyche will see the Toffees put up far more of a fight than they would have done under Frank Lampard.\nThen, Liverpool have clashes with high-flying Newcastle and reigning Champions League holders Real Madrid to contend with.\nThere have already been reports Klopp might depart Anfield, and these will only increase if results do not improve over the coming weeks. One pundit has even suggested the manager could join one of Liverpool’s biggest Premier League rivals.\nIf Klopp stays at Liverpool, he will need a squad overhaul to get rid of some of the dead wood and bring in some new, hungry players.\nThere has been plenty of speculation about their next midfield signing, with Brighton’s Moises Caicedo being looked at.\nKlopp has new problem on top of midfield issues\nBut Liverpool’s defence has been incredibly leaky this term. Due to this, a couple of centre-backs may be sold in the summer.\nPundit Gabby Agbonlahor has criticised Joel Matip and Joe Gomez, saying the pair are not up to scratch after their poor performances against Wolves at the weekend. He even reckons the duo should be axed at the end of the season to make way for one or two new defenders.\n“I don’t think either of them are good enough,” Agbonlahor said during an interview with Football Insider.\n“Gomez has been poor for a long, long time now. Matip has some good games but can be really bad in others.\n“[Ibrahima] Konate and [Virgil] van Dijk are clearly the strongest pair but they have a lot of injury problems between them. That will be a worry for Jurgen Klopp. They can’t rely on Matip and Gomez to cover.\nPundit cannot see Gomez, Matip staying at Liverpool\n“I don’t see anything but them being sold in the summer window.”\nAnd one player who could arrive on Merseyside to replace Matip and Gomez is RB Leipzig star Josko Gvardiol. The 21-year-old has been linked with plenty of Europe’s biggest teams since impressing for Croatia at the Qatar World Cup.\nAccording to a recent report from Italian source Calciomercato, Liverpool have put themselves in the frame to sign Gvardiol. They are willing to fight other teams such as Manchester United, Chelsea and Tottenham for him.\nGvardiol would ideally like to join Real Madrid next. However, he has previously spoken about his love for Liverpool after supporting them as a child. So if Real do not come calling, then a move to Liverpool could become his next priority.\nAgbonlahor suggesting Matip and Gomez should be sold fits in with what a recent report from the Daily Mirror states. They have named 10 players who could be let go by Liverpool this summer as part of a big rebuild.",
  "word_count": 612,
  "scraped_at": "2026-02-14T01:59:41.720936",
  "_text_extracted": true
}