{
  "article_id": "8476aa19954d",
  "url": "https://www.empireofthekop.com/2025/04/30/lewis-steele-liverpool-summer-transfer-claim/",
  "title": "Lewis Steele : Liverpool have money this summer and will spend it",
  "date": "20250430T154500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Lewis Steele has issued an 11-word prediction which is sure to whip Liverpool fans into a frenzy of excitement over what the summer transfer window may have in store.\nDespite minimal investment in the market since the full-scale midfield overhaul two years ago, the Reds have won the Premier League title this season with four matches to spare, representing a monumental achievement for Arne Slot in his first campaign in charge.\nNonetheless, with reliable journalists such as David Ornstein anticipating ‘a busy summer’ on the transfer front, there could be quite a few changes to the league-winning squad by the time the defence of our crown begins in August.\nSteele expecting smart summer investment from Liverpool\nIn his latest Liverpool Confidential piece for the Daily Mail, Steele addressed a series of readers’ questions in a transfer Q&A, the first of which was whether the club ‘may spend big’ over the summer.\nThe journalist opened with a simple yet emphatic 11-word sentence: “Liverpool have money to spend this summer and will do so.”\nHe continued: “I think the old cliche ‘transfer war chest’ is going too far, mind, and they are not suddenly going to finance a summer akin to one like Todd Boehly would do at Chelsea or Sheikh Mansour in his early days of Manchester City.\n“But Liverpool will certainly be spending money and Arne Slot is set to be backed with a decent budget that allows them to splash out while still keeping within the parameters of their business model which is about clever deals. They will not buy for the sake of it but certain positions have been earmarked for improvement.”\nLiverpool perfectly placed to set themselves up for prolonged title defence\nWith just €42m (£35.7m) spent on additions to the first-team squad since the end of summer 2023 (as per Transfermarkt), Liverpool haven’t exactly been lavishly throwing around money, even with plenty of it coming in thanks to the expansion of Anfield’s capacity to 61,000 and a return to the Champions League this term.\nThe significant behind-the-scenes upheaval last summer is also likely to have been a contributing factor, with not only Slot but also sporting director Richard Hughes arriving at the club and understandably needing time to properly assess the existing group of players before making any rash decisions.\nThe latter has also had his plate full with discussions over contract renewals for Mo Salah, Virgil van Dijk and Trent Alexander-Arnold. While the right-back’s future remains unresolved, securing new deals for the other two represents an enormous double win for the ex-Bournemouth chief.\nLiverpool don’t need to completely rip up the title-winning squad and splurge to excess in the transfer market this summer, and in any case that’s simply not the FSG way. Rather, we’ll likely see a few carefully considered additions throughout the squad, with maybe one ‘marquee’ signing to send tremors through English football.\nNow that Slot knows the players at his disposal and where he believes improvement will be needed, hopefully Hughes can duly deliver on the wishes of the head coach, with the duo combining to ensure that the Reds are in a prime position to go about retaining their Premier League title once the 2025/26 campaign begins.",
  "word_count": 537,
  "scraped_at": "2026-02-14T01:58:31.690273",
  "_text_extracted": true
}