{
  "article_id": "849c25b2927f",
  "url": "https://www.themag.co.uk/2025/10/brighton-2-newcastle-1-instant-newcastle-united-fan-writer-reaction-newcastle-united/",
  "title": "Brighton 2 Newcastle 1 - Instant Newcastle United fan / writer reaction",
  "date": "20251018T183000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brighton 2 Newcastle 1 – Instant Newcastle United fan/writer reaction\nBrighton 2 Newcastle 1 – Saturday 18 October 2025 3pm\nInstant fan/writer reaction from some of our regular contributors on The Mag.\nNat Seaton:\n‘Started the game ok then we dropped off as Brighton took the ascendancy.\nA much better second half from us and a brilliant goal from Big Nick, sadly not enough for us to take anything out of the game.\nDefensively not at our best today, but nothing Pope could have done with either goal.\nWe created chances but couldn’t put them away.\nWe move on to Benfica and the Champions League and hopefully smiles back on our faces.’\nBilly Miller:\n‘First half was the worst I’ve seen us play in ages but we were much better after the break.\nI had the joy of watching this at the Amex with the silent majority.\nI gave myself away when Woltemade scored and I gave it a ‘get in’ but it turned out the chap next to me was a Newcastle fan too.\nOur midfield completely lost the battle today and all our wingers bar Barnes offered nothing.\nI’ll just mark it down as another of our typical south coast performances.’\nGToon:\n‘For people who didn’t watch us in the 80s, this is what the season was like.\nLost at home to the big teams with a plucky performance and then lost away at teams like mighty Brighton.\nThe champions league has ruined football for me. It’s now all about that competition and the money from it rather than the actual league we play in.\nLast point. Why have a squad if it doesn’t get rotated from the start, rather than when we are chasing the game.\nA dull performance on a dull day in dull land, as they say in the Mr Men books.’\nMatt Busby said…:\n‘Talk about not getting the rub of the green.\nWhen big Nick’s exquisite flick brought us level, I felt there was only one team going to win it.\nThat it was Brighton beggars belief, although the fact that Burn’s brilliant challenge on Wieffer fell so invitingly into the path of Danny Welbeck was par for the course on an afternoon when nothing went for us.\nMurphy made a big difference second half and surely has to start ahead of Elanga.\nThere were other positive signs, including Eddie changing things earlier than he normally does, but big Dan Burn ain’t a left back.\nIt could be a lot worse. The games are coming thick and fast. Next up Benfica in the Champions League.’\nJamie Smith:\n‘Utterly frustrating as we remain unable to break two tropes. A shocking record at this ground and a baffling inability to live with Danny Welbeck.\nThe performance from ten minutes to half time was woeful, and credit to Jacob Murphy whose introduction brought the attack to life.\nIt’s still not clicking properly, focus on the cups for the weeks ahead and need to hope that’s the catalyst for improved form overall.’\nTony Mallabar:\n‘Back on the train to St Pancras…eventually.\nLast time I saw us win at Brighton, Mick Quinn got a hat-trick.\nA poor first half from us but a cracking game second half.\nUnfortunately, as much as I back us, we need more consistency results wise.’\nDavid Punton:\n‘Infuriating. A sucker punch as Danny Welbeck continues to be our unlikely seasonal tormentor.\nWe never do anything down here. There’s almost something in the air. Our record is abysmal.\nDeath, taxes and losing away at Brighton! A draw here last season as good as it gets for now.\nA wonderful goal to get us level too.\nAn impudent flick from Woltemade.\nAlas, we can’t hold it, and it’s yet another late goal conceded.\nAlmost ten PL games in. You’d have to say the start to the season hasn’t been amazing.\nI swear down, one day we will win away at Brighton and Hove Albion.\nFor now that’s chalked up as huge frustration for manager, player and fans.\nI hate making excuses, but precious momentum from the Forest win seems like it was lost due to the international break.’\nBrighton 2 Newcastle 1 – Saturday 18 October 2025 3pm\n(Stats via BBC Sport)\nGoals:\nNewcastle United:\nWoltemade 76\nBrighton:\nWelbeck 41, 85\nPossession was Newcastle 54% Brighton 46%\nTotal shots were Newcastle 16 Brighton 13\nShots on target were Newcastle 3 Brighton 5\nCorners were Newcastle 4 Brighton 8\nTouches in the box Newcastle 25 Brighton 29\nNewcastle team v Brighton:\nPope, Trippier, Thiaw, Botman, Burn, Bruno (Osula 86), Joelinton (Miley 46), Tonali (Ramsey 70), Gordon (Barnes 70), Woltemade, Elanga (Murphy 46)\nUnused subs:\nRamsdale, Krafth, Willock, Schar\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 796,
  "scraped_at": "2026-02-14T01:52:49.023285",
  "_text_extracted": true
}