{
  "article_id": "84b57d6ac41c",
  "url": "https://www.teamtalk.com/news/bryan-mbeumo-tottenham-colossal-offer-man-utd-sweat-ballsy-double-thomas-frank-move",
  "title": "Bryan Mbeumo : Tottenham push for star hits next level as Man Utd sweat over audacious double Frank move",
  "date": "20250614T113000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham push for Mbeumo hits next level as Man Utd sweat over audacious double move\nManchester United will need to raise the bar to win the Bryan Mbeumo race after Tottenham took their plans to hijack the deal to the next level by submitting a colossal bid as part of a potential double raid on Brentford – and with the Cameroon forward making clear his stance for four major reasons.\nThe Bees forward enjoyed a superb season at the Gtech Stadium, scoring 20 goals and adding another nine assists from 42 appearances across all competitions. With a G/A every 123.3 minutes he was on the field, and with just a year left on his deal, it is easy to see why Mbeumo finds himself in such high demand this summer.\nWhile Arsenal and Newcastle are both keen, the pair dropped out running after it was made clear that the player had chosen to join Manchester United.\nAnd with talks ongoing over a deal, United have already seen two proposals – the second worth £50m up front and £10m in add-ons – rejected by the Bees for the 25-year-old star.\nNow with Bees boss Thomas Frank ditching Brentford for Tottenham Hotspur, the north London side have suddenly burst onto the scene. And with the Dane keen on a reunion with the star, The Mirror claims Spurs have now launched an offer totalling £70m – with their downpayment worth £65m up front and some £15m higher than United’s.\nAt the same time, Spurs are also understood to have held talks with the Bees over a possible move too for Mbeumo’s attacking partner, Yoane Wissa, who also scored 20 times this season.\nHowever, the major concern for United will be that audacious Spurs play for Mbeumo. And while the Bees response to the offer has not yet been revealed, it will now mean the Red Devils will need to raise their own offer to secure his signing.\nFurthermore, it’s also said that Mbeumo is intrigued about the prospect of reuniting with Frank at the Tottenham Hotspur Stadium…\nDON’T MISS ⭐ The most expensive football managers ever: Thomas Frank overtakes Man Utd and Liverpool bosses\nBryan Mbeumo makes clear choice between Man Utd and Tottenham\nDespite that intrigue, sources have told TEAMtalk that Mbeumo remains unwavering in his decision on his next club and is still fully committed to moving to Old Trafford this summer.\nAnd our transfer insider, Fraser Fletcher, has stated: “My understanding on Mbeumo is he has made it clear he wants to join Manchester United.”\nThat is also backed up by information from our other senior transfer correspondent, Rudy Galetti, who has made it clear that Mbeumo’s choice remains Man Utd.\nPosting on X, he stated: ‘Bryan Mbeumo is NOT considering Tottenham at this stage. He gave his word to Man Utd, with personal terms already close to being finalised. He wants to wait for progress between Utd and Brentford: only if talks collapse, Spurs would be considered.’\nThat’s a view also shared by Sky Sports, who add that while Mbeumo has had his head tilted by Spurs, the player is ‘still leaning towards Man Utd’.\nPerhaps the thinking behind Mbeumo’s thoughts has been explained best by The Athletic’s Laurie Whitwell, who revealed FOUR reasons why the player favours the move to Old Trafford.\nSpeaking to the Stretford Paddock’s YouTube channel, Whitwell said: “He has a clear vision and can see how he fits into the system at United,” Whitwell began as he revealed four factors that have influenced the player’s decision.\n“The stature of the place – and I know people have been upset about him choosing Man Utd when there is no European football on offer.\n“But clearly, the raised profile you get from your own personal brand, let’s say, and also the opportunity to play in that stadium (Old Trafford), the pressure, the eyeballs that come with it, I think it (United) are still an appealing prospect to a lot of players.”\nTransfer latest: Elite keeper ‘waiting for Man Utd call’; Italy U21 star set for Spurs\nMeanwhile, one of the best goalkeepers in the Premier League is reportedly ‘waiting for a call’ from Manchester United, and will therefore say no to a Champions League club who have opened talks for him.\nElsewhere, as United look to move the unwanted Jadon Sancho on, a new report claims the club could land on a highly risky new strategy to let him leave by extending his deal at Old Trafford by another year.\nOver at Tottenham, the north London side have reportedly ‘completed the basis of a deal’ for a top Italy Under-21 Euros star, with the transfer set to conclude after the tournament.",
  "word_count": 785,
  "scraped_at": "2026-02-14T01:58:41.941613",
  "_text_extracted": true
}