{
  "article_id": "84bb7e18780c",
  "url": "https://www.caughtoffside.com/2024/08/21/liverpool-joe-gomez-aston-villa/",
  "title": "Liverpool Joe Gomez willing to join Aston Villa before Deadline Day",
  "date": "20240821T224500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool defender Joe Gomez is ready to join Aston Villa this summer as the centre-back is open to leaving the Merseyside club before the transfer window shuts.\nThe Englishman was left out of Arne Slot’s squad for the Reds opening Premier League match of the season against Ipswich Town on Saturday due to interest in the defender and it is now being reported that the 27-year-old has made a decision on Aston Villa.\nAccording to Football Insider, Gomez is willing to move to Villa Park over the coming days as he seeks a regular starting role for the 2024/25 campaign, which he is unlikely to receive at Liverpool.\nUnai Emery is interested in the Reds star as he is a versatile defender who can play in every position across the backline, however, Villa will not be able to complete a deal unless Fulham target Diego Carlos is sold.\nAston Villa have already enquired about the availability of Gomez and would have been informed by Liverpool that a deal will cost the Premier League club around £40m/£45m.\nSeveral other clubs have shown an interest in the Englishman this summer but Villa’s interest seems to be the most concrete at present. More interested parties could make a move for the Reds centre-back over the coming days but that remains to be seen.\nAston Villa is a great choice for Liverpool’s Joe Gomez\nGomez is coming off the back of one of his best seasons at Liverpool having featured 51 times during the previous campaign having been required to play in several different roles to help Jurgen Klopp cope with numerous injuries across his backline.\nThe 27-year-old is a versatile defender with good recovery speed and that suits Emery at Aston Villa.\nThe Birmingham club will also tick a lot of boxes for the England international as they will compete in the Champions League this season, have a very good manager and the centre-back is likely to start.\nIt remains to be seen if Gomez leaves Anfield over the coming days as a move to Villa would be a great next step for his career.",
  "word_count": 352,
  "scraped_at": "2026-02-14T01:57:35.678278",
  "_text_extracted": true
}