{
  "article_id": "84bfd128b19c",
  "url": "https://apnews.com/article/nagelsmann-chelsea-tottenham-bayern-d6adcc4d4f598f3af78d2e6c6ddb7d9f",
  "title": "After Bayern , Nagelsmann could interest Chelsea , Tottenham",
  "date": "20230403T143000Z",
  "domain": "apnews.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After Bayern, Nagelsmann could interest Chelsea, Tottenham\nAfter Bayern, Nagelsmann could interest Chelsea, Tottenham\nDUESSELDORF, Germany (AP) — Julian Nagelsmann has made a career out of moving fast.\nHe was a top-division coach at 28 and the youngest ever coach in the Champions League semifinals at 33. Now he’s widely considered to be a candidate for two of the top jobs in English soccer — Chelsea and Tottenham — less than two weeks after being fired by Bayern Munich.\nThe German was part of a long-term project at Bayern, handed a five-year contract in 2021, but it all crumbled in a matter of days. A loss at Bayer Leverkusen, coupled with some mediocre results since the World Cup and concerns about inconsistent form, led Bayern to drop Nagelsmann and hire former Chelsea manager Thomas Tuchel.\nBayern has denied its decision was influenced by reports linking Tuchel to jobs elsewhere, including Tottenham, as rumors swirled over the impending departure of Antonio Conte. Still, the Bayern management moved fast to secure its preferred replacement for Nagelsmann, with only three days passing between Bayern’s first call with Tuchel and the announcement he had taken charge. Now Nagelsmann is the sought-after coach who may not be on the market much longer.\nA former youth player whose career was ended at 20 by injuries before he ever played a first-team game, Nagelsmann was desperate to stay in soccer and focused his energy on coaching. He was influenced by Tuchel, who was one of his early mentors, and the German-developed “Gegenpressing” style of intensely pressuring the opposition without the ball.\nNagelsmann stood out among other young coaches for his ambition as he took over at Hoffenheim in 2016 when he was 28, and wasn’t overawed by managing players older than himself. Even at 35, both Chelsea — which fired Graham Potter on Sunday — and Tottenham have squad members older than Nagelsmann. He’s keen on tactical flexibility, using a variety of formations, and innovative, installing a giant video screen beside the training field at Hoffenheim to analyze tactics in real time during sessions, something he later repeated at Bayern.\nNagelsmann took Hoffenheim from the brink of relegation back to a first Champions League appearance in 2018-19, earning him a move to Leipzig, where he reached the Champions League semifinals in 2020 before losing to Tuchel-coached Paris Saint-Germain.\nA move to England could carry some risk both for Nagelsmann and a potential new club.\nNagelsmann’s aggressive tactics and intense pressing style can bring some big wins, and were a good fit for teams like Leipzig and Hoffenheim who challenged the established order in German soccer. Nagelsmann has racked up some notable losses, too. His first Champions League campaign at Bayern was ended by Villarreal in the quarterfinals, and the team slumped to its biggest defeat in 43 years with a 5-0 loss to Borussia Mönchengladbach in 2021.\nDepending on how Tuchel does at Bayern, Nagelsmann’s record there might come under review. Winning the Bundesliga last season gave Nagelsmann his first major trophy, but it was seen as the minimum for Bayern, and the points total was the team’s lowest in a decade.\nNagelsmann is an accomplished communicator in German but has never worked outside his home country. His relatively young age for a Premier League manager might invite comparisons to Andre Villas-Boas, who was considered a prodigy when he won the Europa League in his first season at Porto in 2011 at the age of 33 but had little success coaching first Chelsea and then Tottenham.\nCHELSEA\nThe path to Chelsea seems clear for Nagelsmann given his links with two people now on the club’s technical staff. Christopher Vivell was hired as Chelsea’s technical director in December, while Laurence Stewart was brought in to perform a similar role a few months earlier. Both previously worked alongside Nagelsmann at German team Leipzig.\nChelsea’s new leadership said it was attracted to Potter because of his “progressive football and innovative coaching,” and Nagelsmann seems to offer similar qualities while at the same time having the experience of coaching at the elite level for a title-winning team and in the Champions League.\nTOTTENHAM\nIf Tottenham were to hire Nagelsmann, it would have echoes of the bold decision to bring in Mauricio Pochettino in 2014.\nYoung and seen as having a visionary approach, Pochettino molded a team in his image and quickly became one of the club’s most popular managers ever, leading the team to a Champions League final. Some fans haven’t gotten over the departure of Pochettino in 2019 and want him back as the replacement for the fired Antonio Conte.\nTottenham chairman Daniel Levy is likely to prefer Nagelsmann, with the last three managers — Jose Mourinho, Nuno Espirito Santo and Antonio Conte — failing to inspire with their pragmatic playing styles. Nagelsmann’s enterprising approach couldn’t be more different.\n___\nAP Sports Writer Steve Douglas in Sundsvall, Sweden, contributed to this story.\n___\nMore AP soccer: https://apnews.com/hub/soccer and https://twitter.com/AP_Sports",
  "word_count": 829,
  "scraped_at": "2026-02-14T01:53:35.630219",
  "_text_extracted": true
}