{
  "article_id": "84d47c869f36",
  "url": "https://www.uefa.com/uefafutsalchampionsleague/news/027b-16af7682e9e2-983a64339ea9-1000--meet-the-final-four/",
  "title": "Meet the Futsal Champions League final four : Benfica , Palma , Sporting Anderlecht , Sporting CP | Futsal Champions League",
  "date": "20230327T033000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Meet the Futsal Champions League finalists: Palma vs Sporting CP\nFriday, May 5, 2023\nArticle summary\nHosts Mallorca Palma Futsal face Sporting CP in Sunday's final. We introduce the contenders.\nArticle top media content\nArticle body\nHosts Mallorca Palma Futsal face Sporting CP in Sunday's UEFA Futsal Champions League final at Velòdrom Illes Balears-Mallorca on Sunday.\nMallorca hope to join the list of teams to win on debut, and keep up Spain's dominance of this competition. Sporting, meanwhile, are in a sixth final in seven years and aim to be the first non-Spanish side to claim three titles.\nMallorca 2023\nFriday 5 May\nSemi-finals:\nSporting CP 7-1 Sporting Anderlecht Futsal\nMallorca Palma Futsal 4-3 Benfica\nSunday 7 May\nThird-place play-off:\nBenfica vs Anderlecht (17:00)\nFinal:\nPalma vs Sporting CP (20:00)\nAll kick-off times CET\nMallorca Palma Futsal (hosts)\nRoad to the final\nMain round Group 1 winners (W11-5 vs Sporting Paris, D2-2 vs Kairat Almaty, D2-2 vs Sporting Anderlecht Futsal)\nElite round Group B winners (W8-2 vs Dobovec, W5-0 vs Piast Gliwice, W2-1 vs Novo Vrijeme Makarska)\nSemi-final: W4-3 vs Benfica\nTop scorer: Hossein Tayebi 7\nPrevious best: Debut European season\nIn brief: Squad includes Mario Rivillos, a 2017 winner and 2016 runners-up with Inter FS as well as 2018 bronze-medallist with Barça. Palma have never won a major title, having been last season's Spanish league runners-up and 2015/16 Copa del Rey finalists, but neither had Ekaterinburg when they claimed the European crown in 2007/08.\nSporting CP\nRoad to the final\nMain round Group 2 winners (W5-3 vs Futsal Pula, W7-1 vs Ayat, W7-0 vs Novo Vrijeme Makarska)\nElite round Group A winners (W4-2 vs Loznica-Grad 2018, W4-2 vs Uragan Ivano-Frankivsk, W5-0 vs Città di Eboli)\nSemi-final: W7-1 vs Anderlecht\nTop scorers: Neves 7\nPrevious best: winners (2019, 2021)\n2021/22: runners-up (L0-4 vs Barça)\nIn brief: Now in the final for the sixth time in seven years, with a squad containing the core of the side who won UEFA Futsal EURO 2018 and 2022, the 2021 FIFA Futsal World Cup and 2022 Futsal Finalissima with Portugal.\nPrevious finals\n2022: L0-4 vs Barça (Riga)\n2021: W4-3 vs Barça (Zadar)\n2019: W2-1 vs Kairat (Almaty)\n2018: L2-5 vs Inter FS (Zaragoza)\n2017: L0-7 vs Inter FS (Almaty)\n2011: L2-5 vs Montesilvano (Almaty)",
  "word_count": 380,
  "scraped_at": "2026-02-14T02:16:40.059221",
  "_text_extracted": true
}