{
  "article_id": "84d571db2e7b",
  "url": "https://www.liverpoolecho.co.uk/news/liverpool-news/things-in-reverse-ended-up-30280410",
  "title": "I did things  in reverse  and ended up in my dream job",
  "date": "20241103T164500Z",
  "domain": "liverpoolecho.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I did things 'in reverse' and ended up in my dream job\nKris O'Hare has found a new life away from Merseyside\nA man took a gamble and is now thriving at a Spanish institution. Kris O’Hare, who is from Merseyside, grew up loving football like many others and began to think he could work in football in some capacity.\nBut instead of working his way up from amateur clubs and finding some sort of job in the UK, Kris decided to take a different approach. He decided to travel to Asia to broaden his horizons while also gaining experience in football.\nSpeaking to the ECHO, the 35-year-old said he enjoyed football in a different way to others growing up as he was fascinating by the tactical side of the game. He said: “I've always loved football. But I can remember from a young age in the local pub with my family, watching the derby, and my perspective was quite different from theirs. Especially with Rafa Benitez teams, you never had a choice but to be tactically switched on.\n“When I left university, I worked in China, Korea, Japan and finally Korea. I was coaching along the way. The thinking was the reverse to most people. I knew from a very early age that the most vital thing is experience - not just at football but in life. Rather than getting a job, getting a mortgage and all those experiences you tend to do in your twenties, I decided to do the opposite.\n“I would go and see the world in the best way possible. I decided to travel and build my personality and see the world. I learnt that football, no matter where you were, shapes culture. As humans we need competitiveness in day-to-day lives. Football, like martial arts, is about people pushing themselves, challenging themselves and getting involved in competitive games in a way that’s not mediaeval.”\nAfter several years in Asia, Kris decided to make his \"dreams more formal” by moving to Spain. Despite not knowing any of the language, he felt Spain was the “epicentre” of football in the world with the best training practices. Thankfully, he soon landed a job at CD Castellón, a Valencian team in the Spanish second division.\nFast forward to now, and Kris has a new life in Spain, where he works as a football coach and psychologist for Villareal, a club in eastern Spain that are regulars in the top flight of Spanish football despite only 50,000 people living in the town. They won their first major trophy in 2021, defeating Manchester United in the Europa League final.\nHe was hired by the club two and half years ago. Spanish footballer Rodri, who used to play for the club, was recently awarded the Ballon d'Or, the prize for the footballer deemed to have performed the best over the previous season.\nKris says Rodri’s ability to shut down opposition defences and keep Manchester City and Spain ticking over sums up what Villareal teaches his players. He said: “He encapsulates exactly what Villareal is. He’s extremely gifted but a perfect working cog within a collective system.\n“When it comes to expectations, within every club they always want the team to do the best. All I can say is that when you look at the players that are produced by Villareal, the players are always improved by being here.”\nVillareal as a club has close ties with Merseyside. They are nicknamed ‘The Yellow Submarine’ after The Beatles song and fans often sing it in Spanish at their games. When the two sides met each other in the Champions League semi-final in 2022, Villareal fans had a banner in support of the Hillsborough families.\nKris said: “That was before I joined the club but I did go to both games. I was with the Villareal fans. It was an incredible experience to be part of. Respect given both sides. A friend of mine had the Hillsborough banner. The atmosphere between the two fans was exemplary.”\nAlthough Kris would like to coach in Denmark or Norway one day, he is very happy where he is and feels his decision to travel the world has massively paid off. He said: “I am very settled. I'm hugely happy here, the quality of life is incredible. Most of my friends over here are like family. It’s 20 degrees in winter. I speak Valencian, the local language, and Spanish fluently.”\n“I'm very positive but also have my feet on the floor. I'm very fortunate to be at a great club. I'm only here because I’m doing a good job and they're happy with me. You've always got to look at improving yourself.”",
  "word_count": 783,
  "scraped_at": "2026-02-14T02:08:26.323288",
  "_text_extracted": true
}