{
  "article_id": "84d7eed07017",
  "url": "https://www.kyivpost.com/post/53673",
  "title": "A Cautionary Tale – 10 Years After FC Dnipro 2015 Magical Europa League Run",
  "date": "20250601T073000Z",
  "domain": "kyivpost.com",
  "source_country": "Ukraine",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It remains one of the great underdog stories of European football. In the shadow of Russia’s 2014 invasion of Ukraine, with war ravaging the country’s economy and its domestic football league, FC Dnipro Dnipropetrovsk defied the odds. In a fairy tale run, they marched all the way to the Europa League final, narrowly losing to Sevilla in a dramatic showdown in Warsaw.\nBut just four years later, the club had collapsed into amateur football, before eventually folding. From their peak, the departure of key players, mounting financial troubles, and ownership neglect, particularly by the oligarch Ihor Kolomoysky, sparked a rapid unraveling of the club whose origins date back to 1918. Unpaid debts, transfer bans, points deductions, and successive relegations led to the club’s downfall.\nJOIN US ON TELEGRAM\nFollow our coverage of the war on the @Kyivpost_official.\n“Dnipro had finished second the season before against the cream of Ukrainian domestic football – the era of Metalist, Dynamo, Shakhtar and other clubs being at their best,” Andrew Todos, a British-Ukrainian football journalist and founder of Zorya Londonsk recalls.\n“It was arguably the strongest Dnipro side since independence with Myron Markevych at the helm, Yevhen Konoplyanka – the star – combined with a well-balanced team of Ukrainian and foreign talent to complement one another.”\nDisaster turned (almost) to triumph\nDnipro’s campaign began inauspiciously. Knocked out of the Champions League qualifiers by Copenhagen, they dropped into the Europa League play-offs, edged past Hajduk Split, and squeezed through the group stage after narrowly defeating French side, Saint-Étienne. From there, the improbable took hold. “They then saw off giants of European football: Olympiakos, Ajax, Club Brugge and Napoli to reach Warsaw,” Todos said.\nUkrainian Priest’s Daughter Sentenced to 15 Years for Spying for Russia’s FSB\n“Grit and determination especially through the knockout rounds. The defense in particular shining as some hard ground out performances ensured progression to face Sevilla.”\nOleksandr Dovhal, a resident of Dnipro, remembers the final as the culmination of the team’s years as a rising force in Ukrainian football. “The Europa League final was already the triumph for a star-studded team. Their progress began around 2010, and each following season was better than the last. The team consistently qualified for European competitions.”\nHe said, “EURO 2012, which was held in part in Ukraine, also played a big role. All of this inspired not only fans, but also players, coaches, and club backers. Real excitement emerged, and resources began to be invested into teams.”\nMark Temnycky, a nonresident fellow at the Atlantic Council’s Eurasia Center picked up the story: “After failing to defeat FC Copenhagen in the UEFA Champions League qualification process, the Ukrainians had to face Hajduk Split to qualify for the Europa League Group Stage.” From there, Dnipro “had to fight hard to earn results, where they only won two of their six matches. Had they been placed in a different qualification group, they may not have advanced.”\nTheir knockout round story mirrored that same uphill battle. “In the Round of 32, Dnipro defeated Olympiakos 2–0, but then had to rally to a 2–2 draw in the second match,” Temnycky adds. “In the Round of 16 against Ajax, they were forced into extra time before advancing on away goals. The quarterfinal and semifinal ties against Club Brugge and Napoli followed a similar pattern: hard-fought draws away, followed by narrow 1–0 victories in Kyiv.”\nThe improbable run was all the more thrilling for fans abroad. “It was an incredible experience, I remember being in college at that point and always watching the matches in classes because I could not believe that they were doing so well,” Oleh Matviyishyn, a Ukrainian American activist and lifelong football fan based in New Jersey recalled.\n“One reason for their excellence was that Myron Markevych is probably the underrated coach in Ukrainian football history. He really knew how to set up a team and have them playing to their potential. He also had got Karpaty Lviv into the Europa League, which is an incredible achievement.”\nIn his view, the squad was far more than just a Cinderella story. “Yevhen Konoplyanka was more or less at the peak of his powers and should have been playing for a top European club. Additionally, the team had good foreign players in Nikola Kalinic and Matheus, along with a strong Ukrainian core of captain Ruslan Rotan and Artem Fedetskiy.”\nThat run, however, unfolded against a bleak national backdrop. “Russia’s initial invasion of the Donbas and the occupation of Crimea began at the end of the previous season. Problems for certain clubs in Eastern Ukraine had already arisen. Shakhtar Donetsk, Zorya Luhansk, Olimpik Donetsk were all displaced.”\nDnipro became a symbol of Ukrainian resistance\nDnipro’s Europa League success became more than a footballing triumph. “Given their successes, Dnipro became Ukraine’s club during that 2014/15 season,” Temnycky said. “Several Ukrainians had family members or friends who fought in this war, and some members of the FC Dnipro Dnipropetrovsk squad were originally from eastern Ukraine.”\nHe highlighted that “Dnipro’s success gave the Ukrainians something to cheer in an otherwise difficult period in their history.” That sentiment wasn’t symbolic alone: “Dnipro striker Roman Zozulya even auctioned off his second-place medal to raise money for the Ukrainian army.”\nThat broader meaning for the Ukrainian people was deeply felt by Andrii Senkiv, a popular Ukrainian sports journalist who is now a soldier in the Ukrainian army.\n“That Dnipro team was something magical. It happened just as Russian aggression came to Ukraine, and the team itself had no money. They weren’t even playing in Dnipro due to security concerns, they had to play in Kyiv,” said Senkiv. “How they managed to motivate the team under those conditions is a mystery. But Markevych, his assistants, and the players somehow pulled it off. Some of it was luck, some of it sheer willpower, and some of it was individual talent and they reached the final. That kind of thing happens once in a lifetime.”\nFor Senkiv, Dnipro’s success provided a rare moment of light during a bleak time for the country. “It was perhaps the only thing during those dark and gray times that brought any joy. Today, the Ukrainian Premier League doesn’t distract people from the war, no one really cares about football that lives in its own bubble,” he noted. “But back then, there was synergy. Dnipro’s players regularly visited the front lines, even the foreign players helped the military (like Laštůvka), and the song ‘Warriors of Light’ after matches still gives you goosebumps,” said Senkiv.\nTodos added that “many ultras of the club, alongside representatives from other sides, went to fight the Russians. So to see Dnipro have this historic run amidst such a backdrop was truly inspiring and rousing.”\nDovhal also noted how football became a vehicle for national attention: “The Maidan, the annexation of Crimea, and the fighting in the east were already open wounds on the country’s body. And this football success helped draw more international attention to what was happening in Ukraine.”\nTheir success was made even more remarkable by the fact that, due to UEFA regulations, Dnipro were forced to play their “home” games hundreds of kilometers away in Kyiv. Still, a powerful narrative emerged: a team representing a battered nation, defying expectations through unity and tenacity.\nThe 2015 triumph was not sustained\nThe final itself, a narrow 3–2 loss to Sevilla, was both glorious and tragic. The following season marked the start of a freefall. “Sadly, due to numerous outstanding debts that the club had amassed over the first half of the decade, the owner Ihor Kolomoysky decided to let the club with its 100-year history eventually fold. Funding was pulled entirely a little over a year after the club reached the final.” Within four years, FC Dnipro had to become an amateur side.\nA new entity, SC Dnipro-1, soon emerged, widely seen as a shadow project backed by the same controversial figure. “Ihor Kolomoysky then allegedly began to shadow fund a newly created team ‘not connected’ to the original club called SC Dnipro-1. This new club which was despised by the Ultras of FC Dnipro even finished second in 2023. However, after Kolomoysky was arrested under corruption charges, funding mysteriously dried up and this club withdrew altogether from professional leagues ahead of the 2024/25 season.”\nMatviyishyn, like many fans, views the story not just as a fall from grace, but a cautionary tale of squandered legacy. “It is a very sad story, as Dnipro went into administration shortly after making the final. Owner and oligarch Ihor Kolomoysky refused to pay the debts of the club.”\nHe added: “Dnipro currently does not have a team in the topflight and it is a sad state of affairs. Hopefully a new team from the region will be able to represent it soon. The ideal scenario would be the resurrection of Dnipro Dnipropetrovsk, as it was such a historic club and even won the top Soviet League in the 80s, a rare feat for a Ukrainian club not named Dynamo Kyiv.”\n“Unfortunately, political turbulence and the uncertainty brought by the start of the war in Ukraine led to key players leaving the club, while club leadership became bogged down in numerous legal disputes that led to bankruptcy,” said Dovhal. “There were attempts to revive football in the city, but sadly, it wasn’t possible to bring back the legendary club.”\nDespite the collapse, Dnipro’s 2015 run remains etched into national memory. “All fans remember it extremely fondly,” said Todos. “It was a hugely volatile time in Ukraine as a country following the Revolution of Dignity and the start of Russia’s initial invasions. Many Dnipro ultras were involved in defending their country.”\nLooking back now, on the 10th anniversary of that historic run, the memories feel increasingly distant. “It’s one of the defining memories of Ukrainian football’s heyday. The first half of the 2010s was probably the very peak of Ukrainian football. Four Ukrainian clubs were regulars in the latter stages of European competitions,” Todos explained.\nSviatoslav Navrotskyi, a Ukrainian football fan in the United States commented, “Looking back, 2015 felt like the last peak of that golden age of football in Ukraine. That era marked the pinnacle of the club.”\n“Now it would feel extremely unlikely to see a Ukrainian club go far in European competition... In 2015, the UPL ranked in the top 10 of UEFA’s coefficient rankings. Ukraine’s league now sits close to 30th.”\n“Many fans joined the ranks of volunteers in wartime, and football in Ukraine faded into the background. But those were great times, wonderful moments and fond memories. Yes, we didn’t win that trophy, but the emotions were something else” said Dovhal. “Today, the most important thing is for the war to end. After that, anything is possible.”\n“It brings back pleasant nostalgia, I even got to attend one of those playoff matches against Brugge,” highlighted Senkiv. “There’s a certain connection to that historic moment. But I don’t see any chances now, our football keeps falling behind Europe, losing rankings, and fewer of our teams are playing in European competitions. We’re not competitive there anymore. At best, we can hope for luck and the Conference League.”\nFootball in Ukraine has long been more than a game as it serves to unite and provide community. Many fans, ultras, commentators, and players set aside rivalries and careers to defend their country as Russia attacked Ukraine. What began in 2014 as a truce among fan movements evolved into full-scale mobilization by 2022. Some volunteered. Others were drafted. But all were united by something far more enduring than club loyalty: survival.\nNow, many Ukrainian football fans, supporters, and even commentators have gone off to war. Football infrastructure is regularly bombed, and the stadiums that once echoed with chants now lie silent or damaged.\nA decade later, Dnipro no longer has a club in Ukraine’s top league, and the nation’s focus has shifted, from the pitch to preserving its very freedom. Over 733 sports facilities have been damaged in Ukraine since the start of Russia’s full-scale invasion.\nWhat about the future for Ukrainian football?\n“All facets of life in Ukraine remain drastically affected since the full-scale Russian invasion in 2022, including football and its fan culture. Football not only provides a brief 90 minute escape for the country’s fans, but also a platform to unite and resist even further,” Irish photographer and Ukrainian football fan Bradley Stafford wrote.\nAndriy Shevchenko, Ukraine’s football legend and current president of the Ukrainian Football Association, revealed that both he and Ukraine received clear signals that they were not welcome in UEFA’s leadership for political reasons. “Unfortunately, in the last few days, we received clear signals that – due to political factors – both Ukraine and I personally were not welcome in UEFA’s leadership. These concerns were confirmed by the events that followed during the Congress itself,” noted Shevchenko.\nHe stated that this exclusion was not just implied beforehand but confirmed by what unfolded during the UEFA Congress held in Belgrade on April 3, 2024.\nThe event also drew criticism for honoring Aleksei Bugayev, a former Russian footballer who joined the Russian military and was killed fighting in Ukraine. Just months earlier, in September 2024, Bugayev had been convicted of drug trafficking and sentenced to nine and a half years in prison.\nAnother former player, Alexey Yablonsky, a Ukrainian football and futsal player, was also recently killed after joining the Russian military. Following the annexation of Crimea, Yablonsky continued his career on the occupied peninsula and later fought for Russia during its full-scale invasion of Ukraine. He was 35 and had previously played for several Ukrainian clubs, including a call-up to the national youth futsal team.\nAndrii Senkiv is currently serving as a soldier in the 53rd Separate Rifle Battalion. Photo: Andrii Senkiv\nSenkiv was also among those who traded stadiums for the trenches. He was a well-known sports journalist in Ukraine. In a March 2022 Reuters article, Senkiv was described as a pacifist who “blogged about sport and had never held a gun in his life” before Russia launched its assault on Ukraine.\n“It’s very scary that, in the 21st century, skills that should have died out a long time ago are again in high demand,” he said at that time. When asked if he would kill Russians, he replied: “I won’t be ready, but I’ll do it.”\nBy 2024, Senkiv was forced to put his career on hold after being called up to the army shortly after purchasing his first home with his wife, Marishka. Mobilized in mid-June 2024, he now serves in Ukraine’s Armed Forces as a soldier in the 53rd Separate Rifle Battalion, operating under the command of the 116th Mechanized Brigade.\nUkraine, scarred by war, will never be the same, and neither will Ukrainian football. Some of the game’s most loyal fans and voices have paid the ultimate price for defending the country. Ten years after Dnipro’s magical run to the Europa League final, Ukrainians are no longer focused on the fight for trophies, but on defending their homes from invading Russian forces.\nYou can also highlight the text and press Ctrl + Enter",
  "word_count": 2529,
  "scraped_at": "2026-02-14T02:09:11.436598",
  "_text_extracted": true
}