{
  "article_id": "84ebd6505331",
  "url": "https://www.nytimes.com/athletic/6965947/2026/01/14/nigeria-0-morocco-0-4-2-penalties/",
  "title": "Morocco 0 Nigeria 0 ( 4 - 2 pens ) – Bassey heroics in vain , Bounou saves hosts",
  "date": "20260115T000000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "In a fervent atmosphere in Rabat, Morocco held their nerve in a penalty shootout to reach the AFCON final at the expense of a courageous Nigeria. The host nation now has the chance to win the trophy for the first time in 50 years when they face Senegal in the final on Sunday. The saves of Yassine Bounou were the difference in the shootout and a packed stadium was sent into raptures when Youssef En-Nesyri scored the decisive penalty.\nAdvertisement\nThis was a game short on clear chances. Morocco had more of the ball, and built more sustained pressure, but rarely put Nigeria goalkeeper Stanley Nwabali under pressure. An early shot from Brahim Diaz and a decent chance for Abde Ezzalzouli were as good as it got in the first half. The second was, if anything, even more closely contested and it was little surprise when it went to extra time.\nWith both sides tiring, the game got more stretched, mistakes proliferated, but clear chances remained at a premium. Penalties awaited.\nCarl Anka and Mark Carey analyse the key talking points of this dramatic semi-final.\nHow did penalty shoot-out drama unfold?\nSuch was the fight from both sides that the game looked destined to go to a penalty shootout long before the referee blew the final whistle of regulation time.\nExtra time was simply the teaser for the inevitable outcome, as tired legs were evident across the pitch for both sides — so much so that star men Brahim Diaz and Victor Osimhen were substituted before the spot kicks for Morocco and Nigeria respectively.\nA hero had to be found elsewhere, and it was Youssef En-Nesyri who confidently slotted the ball past Stanley Nwabali to help Morocco win 4-2 via penalties. A villain is never far away in these situations, and it was Nigeria’s Samuel Chukwueze whose weak effort was saved by Yassine Bounou with the chance to put his side ahead in the shootout.\nThe same can be said for Bruno Onyemaechi, who was naive to direct his effort towards Bounou’s left, after Morocco’s goalkeeper telegraphed his movement across the goal line — unconventionally saving with his right hand after almost shuffling beyond the ball.\nPenalty shootouts are always a cruel way to end the game, but it was fitting that the Rabat crowd were able to celebrate the victory on home soil once more. For Morocco, Sunday’s final step will be their most important one for a generation.\nMark Carey\nAdvertisement\nBassey’s heroics ultimately in vain\nThere are a number of idiosyncrasies that make AFCON a one-of-a-kind tournament. Many of these are brilliant; a handful are frustrating. Rather than reset the suspension tally after the quarter-final stage like the European Championship and Champions League now do, AFCON totals carry on. It means several players in both semi-finals were at risk of missing out on the January 18 final if they collected a booking. Including Nigeria’s Calvin Bassey.\nBassey has been one of the players of this year’s AFCON, an all-action centre-back, whose progressive passing has been key to getting the ball from the edge of Nigeria’s box and towards the centre circle. The Fulham man is one of those entertaining defenders who clearly enjoy the act of defending. That he is a constant threat on Nigerian set pieces also makes him essential to Eric Chelle’s plans in both penalty boxes.\nWhich makes it so unfortunate that his tournament was ended after picking up a harsh booking in the 33rd minute after his trailing arm caught Brahim Diaz on the edge of his own penalty area. It was the sort of innocuous incident that might be waved off in the Premier League, but can get pinged during continental competition. Victor Osimhen, Nigeria’s captain on this matchday, would run over to Bassey shortly after to offer a consoling word after the suspension was handed out.\nWhat followed was more than 90 minutes of sparkling football from Bassey. If the 26-year-old wasn’t going to make the final, he did nearly everything in his power to make sure Nigeria would be there: 11 clearances of the ball in and around the box, 11 passes into the final third. Bassey made sure he was standing in the right place at the right time to deny Morocco any sort of joy in the final third.\nOn the rare occasions his teammates faltered, it was him making the gut-busting recovery runs mop things up. It wasn’t quite “Roy Keane masterclass in Turin”, but it was the sort of performance that would make the Manchester United legend nod his head in approval. Five minutes from the end of extra time, Morocco would again try to break the deadline, whipping in an excellent cross to the near post, hoping someone could get on the end of it. They would be denied by Bassey, who simply refused to let his team lose.\nCarl Anka\nAdvertisement\nWhy did these two attacking teams cancel each other out?\nThis is the highest-scoring AFCON ever. 120 goals had been scored before this semi-final (one more goal than the 2023 tournament).\nNigeria were the competition’s highest scorers before this game, with 14 goals in five matches. Morocco had notched up nine goals. Semi-finals are rarely high-scoring occasions, given what’s at stake, but it was interesting to see the two very different ways each side managed to repel the other.\nEric Chelle has taken a more adventurous approach to Nigeria’s off-ball scheme compared to Walid Regragui, partially due to the trust he places in the recovery pace of his backline. Calvin Bassey and Semi Ajayi made for a formidable centre-back duo. Bassey’s strength and speed made it particularly hard for Morocco’s forwards to get any sort of separation in the penalty box. Goalkeeper Stanley Nwabali limited any chance for Moroccan wonder goals from long distance.\nDespite the lack of chances, this was a gripping encounter. Two high-scoring teams knocking on the door, only to be rebuffed by two different kinds of locks.\nCarl Anka\nWhy are semi-finals low-scoring?\nThe stakes naturally become higher as each side progresses through the latter stages of a tournament.\nPerspectives can sometimes go from “must win” to “must not lose” when approaching such an important contest, with a view to qualify for the next round — and eventually win — by whatever means necessary. Add in the fact that you are the host nation with a generational cohort of talent who has not won the tournament since 1976, and you can understand why players, fans and coaching staff would be feeling a little jittery.\nMorocco had the better of the chances in their closely-fought clash with Nigeria, spurred on by a lively stadium of fans in Rabat who were willing their team forward at every opportunity. The importance of reaching an AFCON final for the first time in 22 years will have been lost on no one, but quiet confidence understandably evolved into seeds of doubt with every minute that passed without a goal in the second half.\nAdvertisement\nThis stage of the tournament always runs the risk of throwing up the tightest of games. When the best sides remain, it is natural that the contest can become attritional — with both sides in Rabat only needing to look as far as the earlier kick-off that saw Senegal’s Sadio Mane grab a late winner to edge past Egypt by a solitary goal.\nBoth sides can be proud of their overall performances, with a penalty shootout showing just how much the pair cancelled each other out after more than two hours of football. There had to be one winner, but it was by the closest margin possible.\nMark Carey",
  "word_count": 1279,
  "scraped_at": "2026-02-14T02:09:43.008468",
  "_text_extracted": true
}