{
  "article_id": "84ed34f88048",
  "url": "https://www.teamtalk.com/arsenal/gunners-misfit-tipped-oust-kai-havertz-and-give-mikel-arteta-major-headache",
  "title": "Arsenal misfit tipped to oust Kai Havertz and give Mikel Arteta a major headache",
  "date": "20241015T224500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal misfit tipped to oust Kai Havertz and give Mikel Arteta a major headache\nArsenal legend Gilberto Silva believes that Gabriel Jesus can still out Kai Havertz from Mikel Arteta’s starting line-up, when he finally gets himself fully fit.\nAfter a tough opening campaign with the Gunners after his big-money move from Chelsea, Havertz has emerged as one of the first names on Arteta’s team sheet playing as a central striker for the north London club.\nIndeed, the Germany international scored in Arsenal’s Premier League win over Southampton before the international break to mark the seventh consecutive home game in which he has scored.\nAnd if he manages to find the target again against next week’s Champions League clash visitors Shakhtar Donetsk, Havertz will tie Thierry Henry’s record of scoring in eight consecutive home outings.\nIn stark contrast, Jesus has suffered another injury-hit start to the campaign and has only featured three times in Arteta’s starting XI so far in what is his third season with the club after joining from Manchester City.\nHis last goal for the club came back in January against Nottingham Forest, but despite his struggles, Silva still thinks Jesus has a higher overall ceiling than the man who has taken his place as Arsenal’s No.1 striker.\n“Jesus has suffered a lot with injuries and that really gets in the way,” he told bettingexpert.com. “You break your rhythm and you always have to start over. It’s a huge challenge for any player. But injuries have had a big impact on Jesus’ loss of space, as he was out of action for a long time.\n“It also opened up space for Havertz, who played in positions where Jesus would have played. He ended up doing well there. However, as a nine, Jesus has the potential to do more if he’s healthy. But Havertz came in so well that many people didn’t even think about his absences.”\nInjury issues open door for Jesus\nJesus, who has been tipped to return to a club in his homeland, may well be called upon when Arsenal return to action after the international break when they face a trip to Bournemouth in the Premier League this coming Saturday.\nThe club have suffered an injury-affected fortnight with Havertz, Bukayo Saka and Gabriel Martinelli all picking up knocks while away on international duty.\nGiven those injury issues, Jesus could well feature in seven games for the Gunners before the next international break and how he performs in those could go a long way to deciding his future at The Emirates.\nIndeed, it’s reported that Arteta is already weighing up the Brazilian’s potential replacement in the shape of long-term Arsenal target Viktor Gyokeres.\nThe Sporting frontman currently has an £84million release clause in his contract and the Gunners are in a strong position financially to pull off that type of deal – one that would almost certainly signal the end of Jesus’ career with the club.\nLatest Arsenal transfer news: Klopp key to striker move / Sevilla pushing for bargain deal\nNew Red Bull global head of soccer Jurgen Klopp is being tipped to play an important role in Arsenal potentially landing a top striker target in 2025.\nOne of the top names they were chasing over the summer was RB Leipzig’s Benjamin Sesko, who they are known to have made a major play to add to Mikel Arteta’s squad.\nAnd, according to a new report from TBR Football, Klopp is now set to play a key role in shaping Sesko’s future.\nMeanwhile, Sevilla are reportedly looking to lower the option-to-buy fee they have in place with Arsenal for loanee Albert Sambi Lokonga.\nReports suggested that, unlike Lokonga’s loans at Luton Town and Crystal Palace, this deal includes a purchase option – specifically in the region of €12million (£10m, $13.1m).\nHowever, Estadio Deportivo reports that while that fee is correct, the La Liga team believe they can secure his services for a lower price.\nIN FOCUS – Jesus v Havertz Arsenal stats\nDON’T MISS ➡️ Top Arsenal star lined up for bumper new contract to prevent record-breaking transfer",
  "word_count": 688,
  "scraped_at": "2026-02-14T01:51:57.646696",
  "_text_extracted": true
}