{
  "article_id": "84f491eb132b",
  "url": "https://www.bbc.co.uk/sport/football/64777533",
  "title": "Garth Crook Team of the Week : Martinez , Lewis , Romero , Casemiro , Rice , Alvarez",
  "date": "20230227T101500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Garth Crooks' Team of the Week: Martinez, Lewis, Romero, Casemiro, Rice, Alvarez\n- Published\nAt the end of every Premier League round of fixtures, BBC football pundit Garth Crooks is on hand to give you his Team of the Week.\nBut who has he picked this time? Take a look and then pick your own team below. As ever, Garth also has his say on the game's big talking points in the Crooks of the Matter.\nEmiliano Martinez (Aston Villa)\nThe goalkeeper was reprimanded by his manager last week against Arsenal for leaving his posts and going up for a corner in the dying minutes - only to see his team exposed and punished for his folly as they conceded a goal.\nMartinez has not been out of the news, for one reason or another, since his return from a successful World Cup with Argentina. Two excellent saves from Amadou Onana and Neal Maupay kept Villa in the game in the first half.\nHowever, Maupay's fall on Martinez in the second half clearly caused the keeper to visibly wince with pain. Even though Martinez had clearly been injured by the challenge, he refused to stay down and got to his feet, twice in an attempt to stop his team from conceding - and eventually kept a clean sheet for his heroics. Tremendous goalkeeping and an outstanding performance.\nLisandro Martinez (Manchester United)\nIt would appear Argentine players are back in fashion in the Premier League. There is also something of their 1978 World Cup-winning captain Daniel Passarella in Martinez too.\nHe's roughly the same height as the Argentine legend, with the same will to win, and Passarella's sadistic streak to go with it. Against a Newcastle side desperate to give their fanatical fans something from the EFL Cup final, United centre-back Martinez never gave striker Callum Wilson a kick.\nWhen he first arrived on the scene at Old Trafford from Ajax, I thought he might struggle with the physicality of the Premier League - in fact he has relished it. He is another player who Erik ten Hag knew could handle the stage at United and now has his first trophy with the club to prove it.\nRico Lewis (Manchester City)\nThis kid is a very impressive young man. Not only is Lewis playing in a top-class team at 18, but the way he handles what are all big occasions when you play for Manchester City these days, is outstanding.\nIt was Lewis' brilliantly-timed interception which led to their opening goal at Bournemouth. The youngster can clearly tackle, but he is not afraid to find space in order to receive the ball. I saw him repeatedly raising his arms asking for the ball in advanced positions desperate to be part of the attack.\nDefenders who constantly want the ball do so because they know what they want to do with it, well in advance of receiving it.\nCristian Romero (Tottenham)\nRegular readers will know what a massive fan I am of Romero. The Tottenham defender joined from Atalanta and, as far as I am concerned, is the best signing the club have made for some time. The player has been a revelation since his arrival.\nHowever, I have an issue in this game. Chelsea's Hakim Ziyech was sent off against Spurs and reinstated after a VAR check when really there was no need to send him off in the first place. All that was required was a booking.\nI said last week referee Stuart Attwell should be relieved of his duties after his performance in the game between Manchester United and Leicester and the fiasco we all witnessed in this London derby, which was 'much ado about nothing', has only reinforced my opinion.\nThe great Pierluigi Collina would have booked the three players concerned in a nanosecond and given them a good ticking off and got on with the game. What we saw was an embarrassing mess.\nCasemiro (Manchester United)\nWhat a professional Casemiro has turned out to be for United. He could, at the age of 31 and having achieved all the success he has in his career with Real Madrid, sat on his fat contract living on easy street.\nInstead he has come to Old Trafford determined to transform the fortunes of a club that was on its knees when he arrived. The football was dire, the dressing room toxic and results poor.\nThe Brazilian has slowly got his team-mates playing again and now winning trophies. His performance against Newcastle in the EFL Cup final was a leader's performance. Casemiro has done precisely what Cristiano Ronaldo failed to do and that was unite a dressing room - and he is acquiring special status very quickly among the United fans.\nDeclan Rice (West Ham)\nThis was a game manager David Moyes and West Ham had to win. Moyes because he is under immense pressure to keep his job and the team because they are languishing near the foot of the table.\nHowever, there was a buzz around the London Stadium against Nottingham Forest I haven't heard for some time and their players responded with a 4-0 win.\nI was delighted Declan Rice's efforts these past few weeks were rewarded with a goal against Forest and what a goal - I don't see why Rice doesn't score more. He gets into great positions but seems to lack the same confidence in front of goal he clearly demonstrates in every other part of the pitch.\nEmiliano Buendia (Aston Villa)\nAwarding penalties are within the gift of the referee and nobody else - even if we disagree with him it his ultimately his opinion.\nAnthony Taylor's decision to award Aston Villa a penalty for the tackle by Everton's Idrissa Gueye on McGinn, were he to look at it again, video evidence would show Gueye made contact with the ball first and minimal contact with the player.\nBut the Argentina international made all the difference when he came on the pitch just after the hour mark and took Villa's performance into overdrive. Having played the ball to McGinn before he won the penalty he then sealed the match with a excellent finish.\nMeanwhile, Sean Dyche suffered his first defeat at Goodison Park as Everton manager which takes them back into the bottom three with trips to Arsenal and Nottingham Forest on the horizon.\nWe will certainly know what Dyche's Everton team is made of after those two fixtures.\nPhil Foden (Manchester City)\nI had got the distinct impression Foden had been affected by his omissions from England's starting line-ups in the World Cup group stages.\nIf he had, the midfielder looked back to his best against a Bournemouth side who looked out of their depth for much of the game, despite a spirited effort.\nQuite apart from his extremely well-taken goal, his contribution to City's demolition of the Cherries was very impressive. City who played RB Leipzig in midweek in the Champions League are fighting on three very important fronts and it's clear Pep Guardiola is having to manage his resources very carefully.\nFoden wasn't used against the German side but it's clear the England international is going to play a significant part in his club's efforts to win the FA Cup, Champions League - and attempt to retain the title.\nJulian Alvarez (Manchester City)\nA second strike might have gone down as a Chris Mepham own goal, but the way Alvarez controlled the ball with his midriff, having had the ball fired at him by a defender desperately trying to clear the danger, was impressive.\nHaving controlled the ball stone dead and volleyed it towards goal, all the Bournemouth defenders could do was try to stop it entering the net - sadly for them they failed.\nWhy that should go down as an own goal is a mystery to me. The defender doesn't want the goal to be attributed to him and the striker does. Who makes up these rules?\nLeandro Trossard (Arsenal)\nPlaying Leandro Trossard as an out-and-out striker is like placing a sticking plaster over a gaping wound. The Belgium international is not a natural centre-forward and, while his goal was brilliantly taken before VAR thought otherwise, Arsenal must get Eddie Nketiah - who admittedly has gone off the boil - back to form if they intend to keep a hand on the league title.\nAs for Danny Ward in the Leicester goal, it was a cheek, complaining about being fouled by Ben White from the corner that eventually led to Trossard's superb strike being disallowed. VAR insisted referee Craig Pawson look at video evidence and he bottled it.\nIf a referee awarded free-kicks every time a keeper is challenged at a corner there would be no point taking a corner at all.\nDanny Ings (West Ham)\nAs far as strikers go, you don't get many more natural finishers than Ings. He might not have the legs of Aston Villa's Ollie Watkins or the desire of current West Ham team-mate Michail Antonio, but he will score you goals and that's precisely what his side need right now. Both goals by Ings against Forest were brilliantly improvised, almost scruffy.\nHowever, when you are down at the bottom of the table fighting for survival, none of that matters and that is why the Hammers must persevere with Ings until his goals dry up.\nGoals come in bunches for strikers and I sense a few more are left in Ings before the end of this season.\nThe Crooks of the Matter\nFootball's governing bodies had been warned that if they couldn't get their act together, then the UK government would do it for them.\nThe Premier League responded by saying it appreciated the government's commitment to protecting the league's success, but cautioned: \"It is vital regulation does not damage the game or its ability to attract investment and grow interest.\"\nThat sounds like 'don't interfere with our ability to make money'.\nOn the contrary, the message from the government appears to be, we have no problem how much money you make but how you distribute it.\nWhich is also code that the big six clubs no longer being able to do precisely what they want - and neither can foreign owners, with little or no appreciation of the game's history or traditions in this country, do so either.\nAll this should have been written in stone well before there was any thought of a regulator by those running the game at the time.\nThe truth is football has been asleep at the wheel and found itself in a car crash and has now lumbered itself with an independent regulator with statutory powers.\nThe question now is will it be good for football? Let's just hope it's better than VAR.\nOur coverage of your Premier League club is bigger and better than ever before - follow your team and sign up for notifications in the BBC Sport app to make sure you never miss a moment",
  "word_count": 1831,
  "scraped_at": "2026-02-14T01:46:30.516332",
  "_text_extracted": true
}