{
  "article_id": "853b25c524b2",
  "url": "https://www.teamtalk.com/liverpool/jurgen-klopp-hits-back-ryan-mason-tells-boss-improve-tottenham-names-liverpool-season-success",
  "title": "Jurgen Klopp hits back at Ryan Mason and tells interim boss how to improve Tottenham ; names what will make Liverpool season a  success  ",
  "date": "20230430T214500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool\nPremier League • England\nJurgen Klopp hits back at Ryan Mason and tells interim boss how to improve Tottenham; names what will make Liverpool season a ‘success’\nLiverpool manager Jurgen Klopp has hit out at interim Tottenham boss Ryan Mason for claiming Diogo Jota should have been sent off, while also reacting to the Reds’ hopes of qualifying for the Champions League.\nLiverpool emerged victorious from an incredible seven-goal thriller at Anfield on Sunday, winning 4-3. Curtis Jones, Luis Diaz and Mo Salah all scored inside 15 minutes as Tottenham capitulated and Liverpool pounced.\nHowever, Liverpool let their opponents off the hook by allowing them to have more possession and to grow in confidence. This resulted in Harry Kane making it 3-1 before the break.\nSpurs then hit the post twice before Son Heung-min scored a second goal for the visitors.\nAnd in stoppage time Spurs completed their comeback, with Richarlison heading home from a Son free-kick.\nLiverpool were left stunned, but that was not the final twist of the match. Spurs substitute Lucas Moura accidentally played Jota in and he showed composure to score in the fourth minute of injury time, handing Klopp’s men a 4-3 triumph.\nREAD MORE: Arsenal, Liverpool planning to offer escape route to Luka Modric duplicate who is ‘open’ to move\nIn a post-match interview with BBC Match of the Day (via BBC Sport), Klopp said: “Did we drop off? Maybe yes. In the first 20 minutes I don’t know how they got on the ball. The best way to defend a counter-attack is to finish your situation off, the second-best is counter-pressing. If you don’t do either then there’s a counter-attack. That’s what they’re playing for and that’s why you have to do the right stuff.\n“The problem is in football the scoresheet is one [piece of] information out of 500. The one bit we misunderstood because we didn’t do the other 495 things and that’s enough for Tottenham to stay in the game. We gave them a lifeline and that’s why it happened.\nKlopp discusses Spurs, Jota and UCL ambitions\n“Before the game I would’ve taken each result and each performance to get the three points.”\nWhen celebrating Jota’s winner, Klopp got in the face of the fourth official before turning round and injuring his hamstring. When asked about this, he replied: “I’m not sure if it’s the hamstring, it could be the adductor. But I got punished. Little sins immediately.\n“I turned around for the celebration because the fourth official got nothing wrong the whole time. I didn’t say anything bad, I gave a look which is bad enough. The hamstring or whatever the muscle [is] gave up in that moment. That’s fair. Apart from that, all okay.”\nKlopp was then asked about whether Jota should have been sent off before his late goal. During his own post-match interview, Mason said he ‘needs an explanation’ as it was ‘the clearest red card you will see’.\n“Ryan [Mason] has to worry about other stuff,” Klopp said. “They’re such a good football team, Tottenham, they have to play better football. They can’t just counter-attack, they have to play better football with that team. Diogo Jota has the foot high but he’s not going for the head.\n“I heard Oliver Skipp could’ve had a red card. Did he speak about that as well?\n“Wanting Diogo Jota off the pitch, worry about other stuff.”\nAttention then turned to Liverpool causing a shock and getting into the Champions League qualification spots. Following the win over Spurs they sit in fifth place, seven points behind Manchester United in fourth.\nRather than aiming for the top four, Klopp thinks it will be a ‘success’ if his team manages to hold off the brilliant Brighton and Aston Villa.\n“If United and Newcastle wins all the games then how can we get there [top four]? If they start losing then we are close. Until then we have to win football games to qualify for Europe at all.\n“Brighton played one of the best football games this weekend I’ve ever seen in my life. I have to say, Roberto De Zerbi, wow. They are behind us with two games in hand. Aston Villa are developing. If we can keep them behind us that will already be success.”",
  "word_count": 716,
  "scraped_at": "2026-02-14T02:12:37.696762",
  "_text_extracted": true
}