{
  "article_id": "854b5e180ab7",
  "url": "https://metro.co.uk/2025/05/15/liverpool-open-talks-sign-52m-chelsea-flop-ahead-newcastle-23095825/",
  "title": "Liverpool open talks to sign £52m Chelsea star ahead of Newcastle | Football",
  "date": "20250515T223000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool have entered the race for Christopher Nkunku and discussions are in place over a possible deal to sign the Chelsea forward this summer.\nNkunku joined Chelsea with weighty expectations on his shoulders on the back of a high-profile £52m transfer move from RB Leipzig in 2023.\nBut the 27-year-old has flattered to deceive across an injury-ravaged two-year spell in English football in which he has managed a total of just six league goals for the Blues.\nLast month, it was reported that Nkunku had handed in a transfer request in a bid to bring his desperately disappointing stay at Stamford Bridge to a halt at the end of the 2024/25 campaign.\nNkunku is eager to get his stuttering career back on track and has his heart set on finding a new club when the summer transfer window opens for business.\nAccording to French publication Foot Mercato, Nkunku finds himself on Liverpool’s shortlist of targets and ‘talks have begun’ over a proposed switch to Anfield.\nLiverpool’s hierarchy are scouring the market for versatile attacking players and believe Nkunku fits the bill, with the Frenchman comfortable playing as a forward, a second striker or as an attacking midfielder.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nIt’s claimed Bayern Munich remain keen on Nkunku after missing out on a deal in January. Leroy Sane looks likely to depart the Allianz Arena and the newly crowned Bundesliga champions are on the hunt for a possible replacement.\nNewcastle are also keeping tabs on Nkunku’s situation, but their interest in the France international remains just that for the time being.\nThe report adds that Nkunku is intent on joining a club in the Champions League and playing in Europe’s premier competition next year is ‘very important’ to the former Bundesliga Player of the Season.\nIt has been nearly a month since Nkunku last featured for Chelsea and the attacker will play no part in the side’s upcoming clash with Manchester United.\nMore Trending\nEnzo Maresca has refused to be drawn on the exact reason for Nkunku’s continued absence, citing a ‘technical decision’ when pressed for an explanation last month.\n‘No, Christo is still out,’ Enzo Maresca told reporters at his pre-match press conference earlier today.\nChelsea ideally hope to raise £35m from the summer sale of Nkunku.\nThe former RB Leipzig and Paris Saint-Germain star still has four years remaining on his current contract in west London.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Andoni Iraola makes shock admission over Dean Huijsen to Real Madrid transfer links\nMORE: Arsenal icon tired of club’s failures and urges them to act this summer\nMORE: Alan Shearer urges Newcastle to rival Arsenal for ‘excellent’ £85m forward",
  "word_count": 510,
  "scraped_at": "2026-02-14T01:49:39.551089",
  "_text_extracted": true
}