{
  "article_id": "85534aa3fc7e",
  "url": "https://www.france24.com/en/live-news/20230922-marseille-mayhem-overshadows-build-up-to-psg-clash",
  "title": "Marseille mayhem overshadows build - up to PSG clash",
  "date": "20230922T041500Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Marseille mayhem overshadows build-up to PSG clash\nParis (AFP) – Bitter rivals Paris Saint-Germain and Marseille meet in Ligue 1 on Sunday with the build-up to French football's biggest game overshadowed by a crisis engulfing the 1993 Champions League winners.\nIssued on:\nMarseille are unbeaten five games into the Ligue 1 campaign and are a point ahead of reigning champions PSG before the teams clash in the capital.\nBut it has been a chaotic few days at the Velodrome, beginning when Marseille fans let their team know in no uncertain terms what they thought of the performance in a 0-0 draw with Toulouse last Sunday.\nTwenty-four hours later, a meeting between fan representatives and the club's hierarchy reportedly turned nasty, with Marseille saying president Pablo Longoria and several of his senior colleagues were threatened and told to prepare for \"war\" unless they resigned.\nShocked by what had happened, Longoria and his backroom team opted to step back from their roles and did not travel to Amsterdam for Thursday's Europa League game against Ajax.\nCoach Marcelino, only appointed in June, then decided to resign after just seven games in charge.\nIn that time the Spaniard, who is close to Longoria, struggled to get the best out of a squad featuring an array of new signings and oversaw a loss to Panathinaikos on penalties in the Champions League qualifying rounds.\nIn his eyes, and those of Longoria, nothing could justify the anger of the fans, even if supporters' representatives have denied making death threats or calling for resignations.\n\"A line has been crossed,\" Longoria said Thursday in an interview with local daily La Provence.\n\"They said to us: 'You four resign or it's war',\" he added, saying three of his senior colleagues were also targeted, including director of football Javier Ribalta.\n\"I was not afraid, but I was shocked. I don't think what happened is normal.\"\nLongoria, who is 37, was named president in January 2021 after supporters furious with then incumbent Jacques-Henri Eyraud stormed the club's training ground.\n\"There are too many individual interests when it comes to OM, in lots of areas. What happened on Monday is the consequence of that system. The whole movement is based on making people scared,\" Longoria added.\nHe received the support of Marseille's American owner Frank McCourt, but where the club goes now is uncertain.\nFormer player Jacques Abardonado was put in interim charge of the team for the Ajax game. Marseille fought back twice to draw 3-3 in Amsterdam, but had less than 72 hours to prepare for the trip to Paris.\nMarcelino's departure deprives PSG coach Luis Enrique of the chance to come up against his compatriot, like him a native of the northern Spanish region of Asturias and a former player at Sporting Gijon.\nPSG will be delighted that for once it is not them making the headlines in France, and Luis Enrique will hope his team can build on a 2-0 win over Borussia Dortmund in the Champions League in midweek.\nPlayer to watch: Manuel Ugarte\nPSG spent a reported 60 million euros ($64m) to sign the 22-year-old Uruguayan international from Portuguese side Sporting in July, believing he would be the perfect man to fill the crucial holding role in midfield.\nThe early signs are promising. Ugarte was excellent against Dortmund in midweek. His ability to break up play and start moves provides the balance needed while fellow midfielders Warren Zaire-Emery and Vitinha like to get forward and join attacks.\nKey stats\n8 - PSG's points total so far this season is their lowest five games into any campaign since the Qatari takeover of the club in 2011\n1 - Marseille have won just one of their last 22 league meetings with PSG\n31 - Lyon have not won any of their first five games of a top-flight season for the first time in 31 years\nFixtures (GMT)\nFriday\nMonaco v Nice (1900)\nSaturday\nNantes v Lorient (1500), Brest v Lyon (1900)\nSunday\nMetz v Strasbourg (1100), Le Havre v Clermont, Lens v Toulouse (both 1300), Montpellier v Rennes (1505), Paris Saint-Germain v Marseille (1845)\nTuesday, September 26\nLille v Reims (1900)\n© 2023 AFP",
  "word_count": 695,
  "scraped_at": "2026-02-14T02:20:10.965416",
  "_text_extracted": true
}