{
  "article_id": "856235ccd33a",
  "url": "https://www.empireofthekop.com/2024/04/30/goldbridge-liverpool-messed-up-season-over/",
  "title": " ( Video ) Mark Goldbridge : Liverpool have  messed up  Klopp farewell",
  "date": "20240430T194500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mark Goldbridge believes that Liverpool’s season is effectively ‘over’ after they ‘messed up’ their Premier League and Europa League hopes during a wretched April.\nThe Reds crashed out of the latter competition in the quarter-finals against Atalanta and have seen their title hopes realistically evaporate after a run of five points in as many games.\nWith just three matches remaining and Champions League football all but mathematically assured, the ubiquitous presenter of The United Stand believes that there’s precious little to play for in Jurgen Klopp’s final three games as LFC manager.\nFOLLOW Empire of the Kop on Instagram (@empireofthekop) HERE\nSpeaking on The Football Fill-In with Ben Foster, Goldbridge said: “I’m not a Liverpool fan but their season’s over. They’ve messed up the Europa League, messed up the title…it amazes me how fans don’t realise what happens in the last few weeks of the season.\n“As soon as your head’s gone, you’re gonna draw to West Ham. Those Everton and Palace losses have killed them, and going out of Europe, so their heads aren’t in the right place. Spurs might beat them on Sunday; you just don’t know.”\nWhile there’s a lot less on the line for Liverpool than what we had anticipated/hoped at the start of this month, the players have a professional duty to ensure that Klopp’s reign doesn’t completely peter out to an anti-climax.\nIf the Reds can turn things around and win their remaining three matches but still finish third, it’d at least ensure that the German goes out on the high note that he richly deserves, even if it’s not quite the fairytale finish of which we dreamed throughout the first few weeks of 2024.\nYou can view Goldbridge’s comments below (from 16:46), via Ben Foster – The Cycling GK on YouTube:",
  "word_count": 298,
  "scraped_at": "2026-02-14T02:13:49.309269",
  "_text_extracted": true
}