{
  "article_id": "857712c52d66",
  "url": "https://www.ghanaweb.com/GhanaHomePage/africa/Women-s-World-Cup-2023-Five-things-Africa-learned-at-historic-finals-1823621",
  "title": "Women World Cup 2023 : Five things Africa learned at historic finals",
  "date": "20230812T170000Z",
  "domain": "ghanaweb.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "After an inauspicious start - with none of Africa's four sides winning their opening game - the continent delivered at the Women's World Cup, held in Australia and New Zealand, like never before.\nFor the first time at a World Cup, whether male or female, three nations reached the knockout stage as Morocco, Nigeria and continental champions South Africa all qualified.\nThat left Zambia as the only team not to reach the Round of 16 - but even they had cause to celebrate as the debutants beat Costa Rica 3-1 in their final group game to register their first World Cup goals and points.\nThe victory meant that, for the first time, every African side at the Women's World Cup won a match - emulating their male counterparts who achieved the same feat in Qatar last year.\n1. Record outcomes for Africa\nPrior to this tournament, Africa had never won more than two matches at a Women's World Cup (a feat achieved in 1999, 2015 and 2019), but that tally was smashed as the 2023 edition produced a total of five wins.\nPerhaps, surprisingly, it was not serial qualifiers Nigeria who won the most games but a side that began with a 6-0 defeat (against Germany) as debutants Morocco bounced back to register consecutive 1-0 wins against South Korea and Colombia.\nThe Super Falcons, meanwhile, became the first African side to go through a Women's World Cup unbeaten, with the nine-time continental champions - who conceded just twice in four games (what a contrast to the 37 goals shipped in 10 games up to the turn of the century) - only exiting after losing on penalties to England.\nSouth Africa overcame Italy in an instant five-goal classic to register their first ever victory but, like the Moroccans and Nigerians, they were unable to win a match in the knockout phase - a barrier the continent is yet to hurdle.\nNonetheless, with increased investment in the women's game from the Confederation of African Football - whose annual Women's Champions League began in 2021 and which has insisted on all men's sides needing to have women's teams to play African club competition - hopes are high that improvements will continue.\n2. Improved discipline and organisation\nUnderpinning this quantum leap for Africa at the Women's World Cup was an increased focus on structure and discipline, a far cry from the past when many issues have adversely affected the continent's representatives.\nWhen Morocco lost their opener by six goals and Zambia were 0-10 after two games, it seemed the old tale of African sides suffering large thrashings - a familiar theme when the event began in the 1990s - was playing out once more.\nHowever, it quickly became apparent change was afoot - and not just because both sides bounced back so well.\nDuring the much-anticipated last-16 clash between Nigeria and England, the latter were shocked as they were so tactically outwitted by coach Randy Waldrum's side that nearly everyone agreed afterwards that the European champions were fortunate to have made it through.\n\"We've just pushed England to the very end and we had better chances than them,\" insisted Nigeria defender Ashleigh Plumptre afterwards. \"I'm tired of people saying that African teams are just strong and they're just fast and count us out as being technical or tactical.\"\nPhysically and tactically, Africa's most experienced side certainly proved they were, at the very least, the equal of their vaunted opponents.\n3. Kgatlana leads on biggest stage\nThere were a number of outstanding individual performances by African players, but none seemingly raised the level of their team like South Africa's Thembi Kgatlana.\nDespite missing much of the past year due to injury and then suffering bereavement during the tournament itself, the United States-based striker was in superb form, scoring against both Argentina and Italy, and terrorising the Netherlands' defence in the second round.\nHer mix of speed, timing and dribbling ability carried Banyana Banyana up the pitch time and again, giving last year's Women's Africa Cup of Nations winners both an outlet and a proper threat in the final third.\nHer goal and assist in the winner-takes-all match against Italy not only turned a potential early exit into record progress, it will go down in history as one of the most influential individual World Cup performances - so cementing the 27-year-old's standing as a player for the big occasion.\n\"We have qualified for back-to-back Women's World Cups, we won the Africa Cup of Nations and it feels like we are improving more and more,\" the Racing Louisville forward observed afterwards.\n4. Diaspora players a net positive\nOne of Nigeria's shining lights in Australia, defender Ashleigh Plumptre is a part of the diaspora recruitment movement that has swept through many African national sides.\nThe Super Falcons boast several players born outside Nigeria, with Plumptre joined by Michelle Alozie, Ifeoma Onumonu and Toni Payne - all of whom played significant roles in the team's success.\nHowever, the nine-time African champions are far from the only beneficiaries, with a number of the Morocco squad born in Europe, including midfielder Anissa Lahmari whose goal against Colombia sealed the Atlas Lionesses place in the second round.\nWhile the success of this strategy is not in question, it nevertheless shines a light on the dearth of investment in league football on the African scene - aside from Morocco, where some US$20m (£15.75m) are being invested into the women's game over a four-year period.\nDiaspora-born players usually play for the countries of their birth, meaning African nations only get the players who do not make the grade elsewhere - creating an in-built quality deficit.\nWithout a concerted effort to bridge that gap by nurturing its own talent, Africa will likely struggle to build on this year's achievements.\n\"It's very important for South Africa to get more professional leagues for women,\" midfielder Wendy Shongwe told German media. \"The standard in the World Cup is so high we need those leagues to be implemented so that we can compete more.\"\n5. Money issues undergoing change\nIt would not be a World Cup without monetary disputes of some description affecting at least one African team.\nShortly after the defeat to England, a statement from global players' union Fifpro revealed they were assisting Nigeria's players \"in a disagreement with the Nigeria Football Federation concerning bonus payments, camp allowances and expenses, some of which date back to 2021.\"\nThe NFF described the statement as a \"storm in a teacup\", but it once again brought simmering tensions over finances into the open.\nOn the eve of the tournament, Nigerian media widely reported the possibility of a boycott of the opening match against Canada and while that plan was ultimately shelved, the concerns have clearly still to be addressed.\nSouth Africa also had their fair share of financial problems, with a backlog of owed bonuses leading the team to boycott their farewell friendly against Botswana, while Zambia went to Australia without having received their allowances from the Tokyo Olympics.\nWhile these familiar issues continue, at least the sea change of Fifa promising all players \"guaranteed remuneration for their achievements at the tournament\" means squad members will finally receive their proper dues - with players from Morocco, Nigeria and South Africa all now certain to receive $60,000 (£47,300) each, a sum of money that can be life-changing for many.",
  "word_count": 1228,
  "scraped_at": "2026-02-14T02:00:36.674710",
  "_text_extracted": true
}