{
  "article_id": "85818f3ac778",
  "url": "https://thepeoplesperson.com/2023/02/24/juventus-hoping-for-summer-bidding-race-for-dusan-vlahovic-after-stopping-winter-deal-260249/",
  "title": "Juventus hoping for summer bidding race for Dusan Vlahovic after stopping winter deal",
  "date": "20230224T193000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A buoyant Manchester United are headed to Wembley to face Newcastle United in the Carabao Cup final after knocking out European heavyweights and La Liga leaders Barcelona in the Europa League yesterday.\nErik ten Hag deserves most of the credit for such a dramatic turnaround in such a short span of time. He inherited a broken squad riddled with holes but they are still the only Premier League club fighting on all four fronts.\nIt is incredible to think that the Red Devils are doing all of this without a recognised elite striker in their midst.\nAfter the acrimonious departure of Cristiano Ronaldo, United had to dive into the loan market and brought in Wout Weghorst.\nStriker needed in the summer\nThe Dutch striker has shown plenty of drive and desire without the end product and it is unlikely that United will offer him a more prominent role going forward.\nAnthony Martial remains sidelined with injury with Marcus Rashford having to do the bulk of the scoring.\nTen Hag is aware of the need to add an elite goalscorer ahead of next season and as reported previously on The Peoples Person, plans are afoot to bring in a top striker.\n*Vlahovic Transfer Rumours*\n🔴🔴🔴Manchester United above other clubs will join the race to sign Dusan Vlahovic this summer, as Corriere Torino said. Juventus will listen to offers of at least €90m.#MUFC #ManUtd #ManUnited #ManchesterUnited #MUMUfootball pic.twitter.com/PRz70IXQXe— MUMU Football (@MUMUfootball) February 23, 2023\nThe likes of Harry Kane and Victor Osimhen keep getting linked with a summer move along with Juventus striker Dusan Vlahovic.\nThe Turin side are in danger of missing out on Champions League football and that complicates the Serbian’s future at the club.\nVlahovic could be on the move in the summer\nAs previously reported, the 23-year-old’s agent had tried to gauge interest in his client during the winter transfer window and United were close to agreeing a deal, only to see the agent change tune.\nAccording to Corriere Torino, “Everything was postponed until June , when all the other top clubs will also participate in the race for Vlahovic.\n“More than one survey has been carried out by Real and Barcelona, PSG and Bayern, just to name a few. And at Juve, offers of at least 90 million will be evaluated very carefully.”\nJuventus are said to be aware of the interest their striker is generating on the market and they are open to recruiting a different profile with Rasmus Hojlund heading the list.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 511,
  "scraped_at": "2026-02-14T01:55:49.891672",
  "_text_extracted": true
}