{
  "article_id": "8588952e5123",
  "url": "https://www.nytimes.com/athletic/6191595/2025/03/11/liverpool-fsg-edwards-hughes/",
  "title": "Inside Liverpool and the  new  FSG : Edwards - Hughes dynamic , scouting revamp and multi - club latest",
  "date": "20250311T091500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is a smart but nondescript office block in the affluent Greater Manchester market town of Altrincham.\nThere is a Starbucks and a Chinese restaurant close by. Manchester Airport is just a 15-minute drive away.\nIt is the kind of building you could walk past a thousand times without a second glance. Yet it is here that Fenway Sports Group has decided to base its nerve centre for UK operations and where key decisions shaping the future of Liverpool Football Club are being taken by Michael Edwards, the CEO of football, and other senior figures, such as technical director Julian Ward and director of football development Pedro Marques.\nAdvertisement\nIt is close enough to Liverpool’s Kirkby training base — about 45 minutes by car — but sufficiently far away to give sporting director Richard Hughes space to run the club.\nTomorrow marks the first anniversary of Edwards’ reappointment by FSG. His return came nearly two years after he had stepped down as sporting director to take a break following more than a decade working for Liverpool.\nUncertainty reigned at Anfield 12 months ago. Manager Jurgen Klopp had announced his intention to walk away at the end of the season along with all his backroom staff. The club were also without a sporting director following the departure of interim appointment Jorg Schmadtke.\nFor FSG, the pivotal first stage in shaping a new era was convincing Edwards to return. Its admiration for him stemmed from the part he had played in recruiting the team that won the Champions League for Liverpool in 2019 and ended the club’s 30-year wait for the domestic title the following season.\nInitially, Edwards rejected FSG’s advances as he did not want his old job back. He had a job as a consultant for Ludonautics, the sports advisory business launched by Liverpool’s former director of research Ian Graham in 2023, and was enjoying more time with his family.\nBut the improved offer of taking over from FSG president Mike Gordon as the owners’ key decision maker on all football matters ultimately proved irresistible.\n“Michael is one of the most formidable executive talents in world football and John (Henry), Tom (Werner), and I are absolutely thrilled to have secured his services for our business,” Gordon said in a statement last March. “He returns to us in a role with greater seniority than he held previously and with a wider remit.”\nAs Edwards set about rebuilding the football operations structure, his first task was to appoint Hughes, who was already serving his notice period as Bournemouth’s sporting director. Their relationship went back two decades to when Hughes was playing for Portsmouth and Edwards was an analyst at the south-coast club.\nAdvertisement\nIt was Hughes who led the search for Klopp’s successor and the appointment of Feyenoord’s Arne Slot looks increasingly inspired with Liverpool 15 points clear at the top of the Premier League, in the final of the Carabao Cup on Sunday, and 1-0 up in the Champions League last-16 tie against Paris Saint-Germain ahead of tonight’s second leg at Anfield.\nSo much has been achieved over the past year, but there is plenty that still needs to be addressed with a busy summer in store, regardless of what silverware is secured this season.\nThe wait for clarity over the futures of Virgil van Dijk, Mohamed Salah and Trent Alexander-Arnold — all free agents at the end of the season — has dragged on and FSG has yet to add a second football club to its portfolio, a key part of Edwards’ decision to accept the role last March.\nThe Athletic has spoken to multiple sources connected to FSG to understand what the new regime has achieved in its first year and how it plans to tackle the challenges to come in the months ahead.\nThe last year may have seen huge upheaval behind the scenes in FSG’s football operation, but the lines of communication are crystal clear: Edwards reports to the FSG board, Hughes reports to Edwards, and Slot — as Liverpool’s first ‘head coach’, as opposed to manager — reports to Hughes.\nEdwards initially stayed away from Liverpool’s Kirkby training base in the early months of this season as he wanted to create room for new relationships to develop between Hughes and Liverpool’s staff and players. These days, he is an occasional visitor and largely works out of the Altrincham office, although his experience of the industry in general and Liverpool in particular makes him well placed to act as a mentor.\nHe speaks to Hughes three to four times a week during busy periods. They discuss contract negotiations, potential sales and purchases, and infrastructure. Together they make decisions that Hughes then implements.\nAdvertisement\nHughes fits the mould of how Edwards sees the role of sporting director, with his in-depth knowledge of the subject matter and how he conducts conversations with staff, players and agents.\nThe degree of separation Edwards has from the training ground also leaves him better placed to say no to requests, something that is far harder if he had close personal relationships with staff in Kirkby.\nEdwards, helped in part by his stint with Ludonautics, ensured the data model the club used to identify a suitable new head coach was upgraded and future-proofed. The different metrics covered playing style to injury prevention, outperforming resources and how current personnel might improve under a particular manager.\nExternally, Xabi Alonso had been viewed as the leading contender for the Liverpool job when Klopp announced his impending departure, but it quickly became clear he had no interest in leaving Bayer Leverkusen. And when director of research Will Spearman crunched the numbers, Slot stood out from the rest.\nWhen Liverpool sent a delegation to Feyenoord games, they reported back that Slot’s brand of football would energise Anfield in the same way it did the passionate working-class fanbase at Rotterdam’s De Kuip.\nHughes, who a year earlier had underlined his credentials with the shrewd managerial appointment of Andoni Iraola at Bournemouth, conducted all the face-to-face meetings with candidates.\nLast April, he met Slot at his house in the Dutch town of Zwolle and the pair hit it off immediately. Both were former midfielders of similar age, multilingual and shared similar personalities with a deep love for the game.\nHughes was armed with a dossier packed with stats and references that explained why Liverpool were so convinced he was the right man to succeed Klopp.\n“I had a very good relationship from the start with Richard, which is one of the reasons I loved to join the club,” Slot told reporters last November.\nAdvertisement\nHughes and Slot have offices next door to each other on the first floor at Kirkby. There is no sense of a power struggle, just mutual respect, and the dynamic works well with Slot able to focus on coaching and preparing for matches.\nLike Edwards, Hughes has proved adept at ignoring the outside noise. Rewind to last summer and there was a clamour among a section of the fanbase for new signings after seeing their title challenge wilt towards the end of the Klopp era.\nHowever, Hughes was convinced there was significant room for development in the squad Klopp left behind and Slot shared his optimism.\nThey did target a holding midfielder last August but missed out on the signing of Spain international Martin Zubimendi, who opted to stay at Real Sociedad. Rather than pursue an inferior plan B, they decided the best option was to use Ryan Gravenberch in the No 6 role — a tactical switch that transformed the Dutchman’s fortunes at Anfield.\nInternally, there is a sense that Hughes did not get the wider credit he deserved for the outgoing business that happened last summer. The sale of fringe players Fabio Carvalho, Sepp van den Berg and Bobby Clark generated up to £62.5million ($80.5m) and those fees look even better now than they did then.\nThere was succession planning with the signing of Valencia goalkeeper Giorgi Mamardashvili for an initial fee of £25m. The Georgia international will officially move to Merseyside in July, with Caoimhin Kelleher’s future uncertain as he approaches the final year of his contract.\nThe one immediate addition to Slot’s squad, Federico Chiesa, has struggled to make an impact, with just three starts in all competitions. But for a knockdown fee of £10m, signing him from Juventus was always viewed as a low-risk option to provide Slot with a sixth senior attacker.\nAdvertisement\nThis summer will certainly be busier, with Hughes having discussed with both Edwards and Slot which areas of the squad need strengthening and shortlists of suitable candidates already drawn up. The data-led approach to recruitment that served them so well during Edwards’ time as sporting director has been firmly re-established since Klopp’s exit.\n“You can’t spend it twice,” is one of FSG’s mantras, which makes it even more important that Liverpool are able to make the most informed choices about how best to use their resources. Edwards works with the finance team to create a football budget that ensures they remain within FSG’s guidelines of sustainability.\nThe club’s scouting network has been revamped in terms of how they gather and record information, with four new regional European scouting jobs created.\nDave Fallows stepped down as director of scouting and recruitment before Christmas, but the department had already been rejigged, with head of scouting operations Craig McKee and head of technical scouting Mark Burchill both following Hughes from Bournemouth to Merseyside last summer.\nMatt Newberry, who previously shone as head of senior academy recruitment and head of loan management, was promoted to director of global talent as Liverpool target the type of deals that saw them sign teenagers Trey Nyoni from Leicester City and Rio Ngumoha from Chelsea.\nHughes has led the negotiations with the agents of Van Dijk, Salah and Alexander-Arnold. It was arguably the biggest issue he inherited last year given the trio had been allowed to reach the final 12 months of their existing deals. Pressure from outside the club to seal the three extensions has been intense, especially with Salah and Van Dijk excelling this season, but agreeing extensions has proved problematic.\nBeyond that trio, Liverpool have a host of players out of contract in 2027. Hughes is in the process of trying to agree new deals with players such as Conor Bradley and Ibrahima Konate, who will only have a year left on his current contract this summer.\nAdvertisement\nA representative of one player, who has dealt with Hughes since his arrival at Liverpool, says that despite the sensitive nature of discussions and the potential for confrontation, Hughes has a calm, empathetic manner that allows him to negotiate potentially difficult parts of conversations.\nAnother agent described him as “honest, good to his word, having been thrown into a tricky situation”. Both referenced the fact that Hughes — who is fluent in Italian and French and has conversational Spanish — has to operate within the financial boundaries determined by Edwards.\nWith the help of assistant David Woodfine, Hughes has reorganised departments at Kirkby and sought to improve the levels of cooperation and understanding between them. He makes himself available for players to discuss their situations or talk through matches, taking some of the burden off Slot and his staff. Like Edwards, he prefers one-on-ones to larger-scale meetings.\nWith Hughes overseeing coaching, recruitment, negotiations, medical and sports science operations, along with administrative and facilities management at Kirkby, his focus is solely on performance.\nDevelopment is the remit for former sporting director Ward, who Edwards installed as FSG technical director last May. Ward has oversight of the academy, loan pathway, and elite player development strategies. That is also the area of expertise for Marques, who was recruited from Benfica and reports directly to Ward.\n“One of the biggest factors in my decision is the commitment to acquire and oversee an additional club, growing this area of their organisation,” Edwards said when his appointment was announced last March. “I believe that to remain competitive, investment and expansion of the current football portfolio is necessary.”\nBoth Ward and Marques will be heavily involved when a second club is belatedly added to FSG’s stable and work is continuing on that front behind the scenes.\nAdvertisement\nLast July, talks took place over a possible takeover of troubled French outfit Bordeaux, but FSG pulled out due to financial concerns. Bordeaux were subsequently demoted to the fourth tier.\nAn audit of suitable alternatives has since been completed and presented to the FSG hierarchy with 20 clubs analysed from financial, technical and geographical standpoints. Four clubs have been put forward to do due diligence on.\nIt has been the main focus for FSG Football Group staff since September, with Ward and Marques making numerous visits to prospective clubs. Edwards has liaised with UEFA over multi-club guidelines.\nA year on from Edwards’ return, Liverpool have successfully navigated what was expected to be the hardest of transitions, post-Klopp. But with contract sagas to be resolved and expansion plans still in the pipeline, the next phase of FSG’s tenure is still only just taking shape.\nAdditional reporting: Andy Jones, Simon Hughes\n(Top photos: Shaun Botterill, John Powell/Liverpool FC, Julian Finney, Andrew Powell/Liverpool FC; design: Dan Goldfarb)",
  "word_count": 2209,
  "scraped_at": "2026-02-14T02:02:35.608324",
  "_text_extracted": true
}