{
  "article_id": "858cc8a5f23b",
  "url": "https://www.yahoo.com/now/jurgen-klopp-feels-real-madrid-234541624.html",
  "title": "Jurgen Klopp feels Real Madrid tie is over after Anfield hammering",
  "date": "20230222T014500Z",
  "domain": "yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jurgen Klopp feels Real Madrid tie is over after Anfield hammering\nJurgen Klopp’s gut feeling is that Liverpool’s Champions League dreams are over after Real Madrid pulled off a staggering 5-2 comeback win in the first leg of their last-16 tie.\nA night that started with Darwin Nunez and Mohamed Salah goals ended in the Reds’ worst ever European home defeat.\nVinicius Junior’s brace had Madrid level at the break, with Eder Militao’s header moments after the restart taking the wind out of Liverpool’s sails.\nKarim Benzema added two more to seal a 5-2 victory and leave Klopp’s side staring down the barrel of an early Champions League exit to the side that beat them in final nine months ago.\nPut to the Liverpool boss that Madrid boss Carlo Ancelotti said he could not say the last-16 tie was over, he said: “I think Carlo thinks the tie is over – and I think it as well in the moment.\n“But in three weeks – that is how it is in these moments – the closer you get to the game, the bigger our chances become and the less likely that the tie is over.\n“But tonight with a 5-2 when you see the game, they are pretty good in counter-attacking… we have to score there three goals and take some risks. That could be a bit tricky.\n“But it’s really not in my mind so we go there, I can say that now already, and try and win the game.\n“If that’s possible or not right now I don’t know but that’s what we will try and from there we will see.”\nLiverpool head to Spain for the second leg on March 15 reeling from a humiliating loss, having become the first team in Champions League history to take a 2-0 lead and lose by a three-goal margin.\nIt is a result that could dent confidence in an already challenging campaign, but Klopp wants his players to focus on the positives.\n“I can see that people think that, understandable, but that is actually not allowed,” the Liverpool boss said.\n“I told the boys directly after the game so this is a different thing that happened today. One result that was opposite of what we wanted.\n“We made mistakes around the goal, yes, as well and I said a couple of times a defeat is a defeat if you don’t learn from it.\n“If you don’t learn tonight that the start of the game was outstanding and the way we played was us in a nutshell, us like we want to be, and that’s what we have to keep doing. If we now allow this one game to be influential, we are really silly.\n“We have a few days where we’ll make sure that we take the right things out of this game.\n“Yes, we have to improve. Third goal, massively. First goal massively.\n“But we have to take the good things as well. That would be horrible if we don’t do that.\n“It’s a different game obviously (on Saturday at Crystal Palace) but the intensity, the effort we showed, the football we played, pretty much everything was like we want to see ourselves.\n“So, we have to make sure that we keep that. I know 5-2 could be damaging but I hope I can make sure that that is not happening.”\nA turnaround looked unlikely given the start at Anfield but Ancelotti took heart from last year’s Champions League semi-final turnaround against Manchester City.\n“Obviously we didn’t expect to start like we did but at 2-0 down I thought about the City away leg last year in the hope that we could do the same – but it turned out even better,” the Madrid boss said.\n“They were doing us damage down our left but when we were better in our attacks, we moved (Federico) Valverde a little bit towards that danger and we then defended better.”",
  "word_count": 658,
  "scraped_at": "2026-02-14T02:06:47.843503",
  "_text_extracted": true
}