{
  "article_id": "85929814bc83",
  "url": "https://www.thisdaylive.com:443/index.php/2024/04/20/paul-onuachu-no-marching-in-with-the-saints",
  "title": "Paul Onuachu : No Marching in With The Saints",
  "date": "20240420T053000Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nPaul Onuachu: No Marching in With The Saints\nAfter a nightmarish half season with Southampton in which the Nigeria striker failed to register a goal in 404 minutes, it culminated in his being loaned to Turkish side-Trabzonspor, where he registered nine goals and three assists in 17 matches. With his season loan nearing an end, Paul Onuachu has expressed his desire to remain at Papara Park rather than rejoining the Saints. Whether the eggheads of the Turkish Super Lig outfit is able to talk Southampton to another loan deal remains to be seen as the Black Sea Storm could not meet the €15 million valuation for the 29-year-old\nNigeria international, Paul Onuachu, has expressed his desire to remain at Turkish Super Lig outfit, Trabzonspor.\nOnuachu joined Trabzonspor on a season-long loan from Sky Bet Championship club, Southampton last summer.\nThe 29-year-old has made an appreciable impact at Trabzonspor, scoring nine goals and making three assists in 18 appearances.\nThe Black Sea Storm are also interested in keeping the forward at the club on a permanent basis but are hampered by lack of funds.\nThere are reports the loan deal could be extended to another season.\nAmidst the uncertainty surrounding his future, Onuachu has revealed that his priority is to remain in Turkey.\n“I am very happy in Trabzon. My family and I want to stay here,” he was quoted by Saints Socialite.\nInterestingly, Trabzonspor is eager to extend Southampton forward’s loan for another season, seeking to secure his services beyond his current spell.\nThe Nigerian striker, who joined the Turkish Super Lig side on loan last summer, has made a significant impact with nine goals and three assists in 17 league appearances for Trabzonspor.\nWhile the Black Sea Storm is interested in a permanent deal, they are unable to meet Southampton’s €15 million valuation for Onuachu. Trabzonspor president Ertugrul Dogan is reportedly exerting considerable effort to secure Onuachu’s presence at the club for another season.\nA return to Southampton however seems unlikely for the striker, who faced difficulties in establishing himself during his previous six-month stay at the English club.\nOnuachu joined Turkish Super Lig club Trabzonspor from Southampton last summer after a failed first six months in England. The 29-year-old failed to make a mark with the Saints who got relegated from the Premier League last season, and had to get another club to get more playing time.\nSince his transfer to Turkey, Onuachu has been brilliant for Trabzonspor forming an important part of the club’s attack.\nThe fans have also accepted him swiftly. Owing to Onuachu’s performances, there have been a lot of talks concerning his future, and in a new development the president of Trabzonspor has revealed that they want to keep the big Nigerian striker.\nIf Southampton get a good bid from another club, Onuachu may not be playing his football at Trabzon next season.\nHowever, Onuachu has returned to training with his club side after picking up an injury that left him out of action for a month.\nThe 2.01m tall forward fractured his arm in Trabzonspor’s 1-0 win over Istanbul Basaksehir on February 28.\nThe 29-year-old Super Eagle, who is on loan from EFL Championship side, Southampton, took a month off football to focus on his recovery, and to help Trabzonspor gain as many points between now and the end of the season.\nThe Karadeniz Fırtınası are third on the Turkish Süper Lig table, three points above Besiktas, and are looking to finish the season strong in a bid to seal their UEFA Europa League spot as a place in next season’s Champions League has eluded them.\nHis shoulder injury meant he couldn’t feature for the Super Eagles of Nigeria during the March International break that saw them taste victory against Ghana, and then a bitter aftertaste as they lost 2-0 to Mali in Morocco.\nTrabzonspor have however received good news on the fitness of Onuachu ahead of their Turkish Super Lig match against Kayserispor at the RHG Enertürk Enerji Stadyumu today.\nThe Southampton loanee trained fully with the rest of his teammates during Wednesday morning’s workout at Mehmet Ali Yılmaz Facilities.\nOnuachu has not featured for Trabzonspor since he suffered a fracture in his left arm during the Ziraat Turkish Cup quarterfinal match against Baakehir on February 28.\nAfter spending 49 days on the sidelines, the Nigeria international is in contention to make his comeback against Kayserispor, provided he does not suffer a relapse within the next three days.\nThe 29-year-old was not in tiptop condition upon his return to Turkey after the 2023 Africa Cup of Nations as he was hardly used by manager Jose Peseiro during the tournament in Ivory Coast, with Victor Osimhen ahead of him in the pecking order of center forwards.\nHe could not play in five league matches on the bounce against Alanyaspor, Fatih Karagümrük, Fenerbahce, Konyaspor and Sivasspor due to his fractured arm.\nMeanwhile, Trabzonspor are said to be considering a move for Super Eagles forward, Kelechi Iheanacho in the summer.\nAs reported by Sporx, the Turkish outfit are eyeing the Leicester City forward as an alternative to his compatriot, Onuachu who is currently on loan at the club.\nIheanacho is in the final months of his contract with Leicester City and there is no indication that he would stay at the King Power Stadium beyond the end of the current season.\nThere were reports of him leaving the Foxes last summer but with no talk of him extending his current contract yet, he will finally end his seven-year stay with the club this summer and could be a good option for Trabzonspor.\nWhile the Black Sea Storm are exploring a move for Iheanacho, Onuachu still remains their primary target and are focused on signing him permanently.\nThe lanky striker is currently on loan with Trabzonspor from Southampton and has been in stellar form since making his debut for the Turkish outfit.",
  "word_count": 988,
  "scraped_at": "2026-02-14T01:56:51.549981",
  "_text_extracted": true
}