{
  "article_id": "85a149f9e2b1",
  "url": "https://www.fourfourtwo.com/news/manchester-united-man-utd-manu-never-able-to-start-strongest-xi-due-to-injuries-erik-ten-hag-claims",
  "title": "Manchester United  never  able to start strongest XI due to injuries , Erik ten Hag claims",
  "date": "20230920T151500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United 'never' able to start strongest XI due to injuries, Erik ten Hag claims\nManchester United are without a host of first-team players ahead of their Champions League clash with Bayern Munich\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester United manager Erik ten Hag has lamented injuries affecting his ability to select his strongest starting XI during his time at Old Trafford.\nThe Dutchman claims that, since taking over Manchester United at the beginning of the 2022/23 season, he has always had to tinker his line-up due to player unavailability while speaking ahead of the Red Devils' Champions League match against Bayern Munich on Wednesday.\nManchester United currently have 12 players missing for one reason or another, leaving Ten Hag with a weakened 21-man travelling squad, four of whom are goalkeepers, to take to Germany.\nIn defence is where the real problem lies for Ten Hag ahead of the clash against Bayern, with Luke Shaw, Raphael Varane, Aaron Wan-Bissaka, Tyrell Malacia and Harry Maguire all missing the opening Champions League game of the campaign through injury.\nElsewhere in the squad, midfielders Mason Mount, Sofyan Amrabat and Kobbie Mainoo are out, while forwards Jadon Sancho and Antony will also miss the game.\nThe Manchester United boss is confident of dealing with the issues, however, highlighting his squad's success in previous periods.\n\"One thing is true, from the start of last season I don't think I ever started with, in my opinion, the best starting XI,\" Ten Hag said. \"There was always injuries.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"We always got results apart from the period we are in now. I have experienced it in the past and managed it. You have to deal with it. I like these situations because you have to handle it and know what to do, and that is focusing on the process.\n\"The doctors are dealing with the problems. First of all, injuries always come in top football because we are living on the edge. Of course, we analyse why things happen, but we also have to deal with the effects. We have to get the best out of it. We need to make the next step, integrating Rasmus Hojlund and Sergio Reguilon.\"\nHeading into the game under intense pressure following three losses from their opening five Premier League games, Ten Hag believes his side will soon click into gear.\n\"No, we don't feel that we need a reset,\" the United manager added.\n\"Absolutely not. We are in a process and what you see is that in parts of games we play very good but then also in parts of games we played below our levels.\"\nMore Manchester United stories\nErik ten Hag says that Jadon Sancho is 'not important' right now, as the fallout from their disagreement lingers.\nSancho leaving on loan in January seems like a strong possibility, and United could make a big attacking signing of their own: the 'new Maradona' has been linked with a switch to Old Trafford.\nMeanwhile, £72m summer arrival Rasmus Hojlund has been compared to former Arsenal striker Nicklas Bendtner...\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 696,
  "scraped_at": "2026-02-14T02:00:57.127074",
  "_text_extracted": true
}