{
  "article_id": "85c0e7164ce9",
  "url": "https://www.dexerto.com/opinion/ea-fc-25-toty-dexerto-team-of-the-year-predictions-3009895/",
  "title": "EA FC 25 TOTY predictions : The Dexerto Team of the Year",
  "date": "20241225T153000Z",
  "domain": "dexerto.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Dexerto’s Team of the Year has been picked ahead of the EA FC 25 TOTY promo in Ultimate Team, with Mohamed Salah, Jude Bellingham, and Erling Haaland featuring alongside a surprise pick for the 12th Man.\nThe Team of the Year always gets everyone talking. The football fanbase looks back at another calendar year of goals, assists, and big performances in the top domestic leagues in Europe, as well as the Champions League.\nEA SPORTS will be opening the voting for TOTY at the beginning of 2025, but that hasn’t happened yet. So, in the absence of confirmed nominees, we are left to look at the big moments of the year – just as we did a few years ago.\nSpain won the European Championships for the first time since 2012, making them four-time trophy holders. Manchester City won the Premier League once again, making it a record four times in a row in England’s top flight. Real Madrid meanwhile climbed to the summit of European football once again, completing a double with the La Liga title and Champions League. Since then, Liverpool are the in-form team in Europe and have been near unstoppable under new manager Arne Slot.\nSo, with all that considered, myself, Connor Bennett, and Nathan Warby (our EA FC reviewer) have made our predictions. This year is so competitive for Team of the Year that Madrid’s new striker Kylian Mbappe faces stiff competition to make the cut.\nThe Dexerto Team of the Year (2024/25) predictions\nBest goalkeeper\nThere are many top goalkeepers in Europe right now, but Courtois stands above all of them for me (not just literally) to make it into our Team of the Year. It hasn’t been smooth sailing in front of him in the 2024-25 campaign, with the back line constantly changing with absences, but with a stopper as good as this between the sticks it is no surprise that Madrid have been able to stay within touching distance of the La Liga summit – despite a poor start to the campaign.\nWords by David Purcell.\nRelated\nBest defenders\nAs a back four unit, I have gone with a serial winner at right back for Real Madrid, in Dani Carvajal, who was crucial to everything Madrid and Spain won in the last 12 months of football. His injury has been deeply damaging for his club’s form, as well, after suffering a ruptured anterior cruciate ligament, a ruptured external collateral ligament, and a ruptured popliteus tendon in his right leg.\nVan Dijk is very much back to his solid best at Liverpool, who have long sat at the top of the Premier League table with the best defensive record in the division. They have taken that form into the Champions League, too, conceding just one goal in the first six games, beating Manchester City and Real Madrid in the same week across the two major competitions.\nAntonio Rudiger may be suffering in the Madrid back line this season, which has been chopped and changed by Carlo Ancelotti due to injuries. Yet, he remains one of the standout defenders in world football and would form a dominant partnership with the Dutchman next to him.\nAnd finally, Josko Gvardiol jumps off the page as the most established left back in Europe. The Croatian picked up a Premier League title and FIFA Club World Cup medal in his first season at the club, and later became Manchester City’s second most potent attacking threat behind Erling Haaland – which is good for him, but obviously not amazing news Pep Guardiola as its a symptom of his team’s injury-ravaged campaign. In previous seasons, there would be so many more names between Haaland and Gvardiol in the top goalscorer charts.\nWords by David Purcell.\nBest midfielders\nNo midfielder had a better year than Rodri in 2024, lifting the Premier League, European Championships, UEFA Super Cup, and Club World Cup. The Spaniard might be missing in action right now after suffering an ACL injury, but it wasn’t just his trophy haul that saw him take home the Balon d’Or.\nAs a defensive midfielder, he shouldn’t be renowned for his goals, but bagged himself 12 last term and chipped in with 15 assists. That’s not shabby at all. But, it was overall midfield dominance that was rewarded on an individual level.\nNeither his club nor country suffered a loss when he played and City averaged 2.7 goals a game when he was in the team. That dropped to 1.4 goals when he wasn’t. Again, not shabby at all.\nAfter Rodri, there is one other clear choice – Jude Bellingham. The English midfielder lit up La Liga for Real Madrid and helped Los Blancos claim their 15th Champions League trophy. He did it all, too, playing as a striker when called upon, and also dropping back into deeper positions in midfield.\nOh, and he carried his home nation to the final of Euro 2024, saving them from early heartbreak with a superb overhead finish against Slovakia.\nFlorian Wirtz rounds out our midfield choices. Sure, Toni Kroos, and Phil Foden finished ahead of the German midfielder in the Balon d’Or voting, but the 21-year-old was simply sensational in leading Bayer Leverkusen to the Bundesliga title.\nOver 40 goal involvements, a hat-trick to seal the title, and a winning goal in the DFB Pokal final. Bayern Munich are chasing after him, and so they should.\nWords by Connor Bennett.\nBest forwards\nDespite the ongoing debate about his contract situation, Mohamed Salah has taken his game to new heights in 2024 and is arguably more well-rounded than ever before. His goal output is showing absolutely no signs of slowing down, and he’s also chipped in with plenty of crucial assists, being involved in the vast majority of Liverpool’s goals since Arne Slot walked through the door.\nAlthough City’s form has plummeted towards the end of the year, it’s impossible to leave talisman Erling Haaland out of the side. The big Norwegian remains the most prolific striker in Europe, not only firing the Citizens to a fourth consecutive Premier League title but also bagging himself a second Golden Boot on the bounce.\nIf we’re talking about trophies very few players can rival Vinicius Jr. in 2024. The tricky Brazilian has helped Real Madrid to yet another LaLiga title and a 15th Champions League victory, with Vini scoring the crucial second goal to secure the latter.\nHis achievements took him all the way to second place in this year’s Ballon d’Or vote and he currently sits as one of the best players in world football. With all this in mind, there’s no one more deserving of rounding out the Dexerto Team of the Year.\nWords by Nathan Warby.\n12th Man pick\nThe most in-form striker in Europe just couldn’t sneak into our original Team of the Year XI, but edges out Kylian Mbappe for the 12th Man pick in our predictions. The former Coventry City striker has been a goal machine during his time in Portugal, so much so that his celebration is now imprinted in the minds of fans who have never even seen him play.\nSporting’s star man is destined for a move to either the Premier League or La Liga in the summer transfer window, and deserves a monster of a card during this Ultimate Team promo for his efforts.\nWords by David Purcell.\nSo, there you have it! That’s our Team of the Year for 2025, as well as our wildcard pick at the end (sorry Mbappe). Do you agree with our selections or would you do it slightly differently? Let us know @FUTWatch on Twitter and have a happy New Year!",
  "word_count": 1279,
  "scraped_at": "2026-02-14T01:58:00.743858",
  "_text_extracted": true
}