{
  "article_id": "85d08552f84e",
  "url": "https://theboar.org/2025/01/whats-gone-wrong-for-guardiolas-manchester-city/",
  "title": "What gone wrong for Guardiola Manchester City ? ",
  "date": "20250112T114500Z",
  "domain": "theboar.org",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What’s gone wrong for Guardiola’s Manchester City?\nAfter eight stellar seasons and six league titles, the seemingly impossible has finally happened: Manchester City are in bad form. After a conventionally convincing start to the season, Pep Guardiola’s once-monolithic squad has faltered and fallen out of title contention. A run of 13 games in all competitions with just one win appears to have crushed The Citizens’ title hopes and threatened their Champions League status too. Recent wins against struggling Leicester and West Ham will help fans to move on, but the question remains: just what has been going on at Manchester City, and how will Guardiola fix it?\nIn a noble attempt to spare his players from the pressure cooker that is the football press, an ever-pragmatic Guardiola chose to shoulder the blame for his side’s shortcomings in a recent press conference. “The call is on me first, it’s not the players”, said the Catalonian, who has appeared noticeably dejected on the touchline of late. “I lead the group of players and I could not lift them. This is the reality.”\nCity’s sudden demise has mystified pundits and supporters alike\nPep’s plight began back in late October after Tottenham dumped his side out of the League Cup and handed City their first defeat of the season. Confidence-sapping defeats away to Bournemouth and Brighton followed, and the sharks soon circled as defensive wounds deepened. Another loss to Spurs, this time doubly convincing, was followed by a resigned defeat against title hopefuls Liverpool and a gut-wrenching late winner for fellow strugglers Manchester United at the Etihad.\nA somewhat unexpected 3-0 win against Nottingham Forest, a feat only replicated by Arsenal, Newcastle, and Fulham this season, had offered hope of a revival, but this was quickly snuffed out by a continued run of draws and losses to teams that the likes of Haaland, Foden and De Bruyne would have once relished the opportunity of facing.\nEuropean fortunes have been equally hard to come by, as City find themselves only 22nd in the reformed Champions League table. Playing against City for Sporting in early November, Victor Gyökeres showed the world just how good he might become, grabbing a hat-trick against the 2023 European Champions. Later in the month, an embarrassing draw against Feyenoord, despite leading 3-0 with 20 minutes remaining, was City at their very worst.\nCity’s sudden demise has mystified pundits and supporters alike. Some have pointed to the absences of Ballon D’or winner Rodri and his defensive colleagues Ruben Dias and John Stones, the backbone of Guardiola’s system. Captain Kyle Walker has shown his age in recent weeks with some below-par performances, while understudies Rico Lewis and Jahmai Simpson-Pusey have perhaps been used more extensively than their current stage of development allows.\nAt the other end of the pitch, the imposing presence of Erling Haaland, so often envied and feared by rivals over the past three campaigns, has been noticeably diminished. Only Aston Villa’s Ollie Watkins has missed more big chances than the Norwegian in the Premier League this season, who contributed just three goals in the last two months of 2024. While City fans will be quick to point to the fact that equally, only one player has scored more than Haaland this season – such is his stardom – it’s clear that he has failed to fulfil his role at the apex of Guardiola’s attack with the poise and consistency of seasons past.\nThe next two months will be make-or-break for the blue side of Manchester\nRecent results have clearly taken a toll on Guardiola, but Manchester City’s legendary tactician insists that the ailment to his side’s problems is there for him to find. He will surely take comfort in the arrival of the January transfer window, which comes not one moment too soon. Omar Marmoush, Abdukodir Khusanov and Vitor Reis have all been touted as potential new incomings. If signed, they will arrive under immediate scrutiny. The impending verdict regarding 115 alleged Financial Fair Play breaches continues to hang over all present activity at the Etihad, not least what takes place on the pitch.\nWith upcoming matches against Chelsea, Arsenal, Newcastle, Liverpool, Spurs and Forest before that day arrives, the next two months will be make-or-break for the blue side of Manchester. Never before have they been so far adrift of the top spot heading into the New Year; but as Guardiola has repeatedly proven during his time at the club, all records exist to be broken.",
  "word_count": 747,
  "scraped_at": "2026-02-14T02:11:27.604753",
  "_text_extracted": true
}