{
  "article_id": "85d1542a350c",
  "url": "https://theathletic.com/4818331/2023/08/31/tottenham-bale-seven-soldado-paulinho-elvis-beatles/",
  "title": "When Tottenham  sold Elvis and signed The Beatle – reassessing their 2013 transfers",
  "date": "20230831T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "As the transfer window nears its end and we all hastily try to make sense of what’s happened, it’s been instructive to revisit one of the most dramatic windows for any club in Premier League history.\nTomorrow (Friday) marks 10 years since Gareth Bale left Tottenham Hotspur to join Real Madrid for a then world-record fee of €100m (£86m; $127m). This brought to an end a transfer window that also saw Spurs bring in seven first-team players as they completely remodelled their squad and tried to offset the loss of their star player. Or, as their former forward Garth Crooks infamously put it at the time, “Spurs have sold Elvis and signed The Beatles.”\nAdvertisement\nThat line is brought up whenever a team is attempting a rebuild after losing a key player and feels especially pertinent for Tottenham this summer after the sale of Harry Kane — their biggest superstar since Bale. This time around, Spurs have been more circumspect, so far bringing in fewer players and most of them well in advance of Kane’s departure. Ten years ago, Erik Lamela and Christian Eriksen (plus the defender Vlad Chiriches) joined Andre Villas-Boas’ team just as the window was closing and it became obvious Bale was about to leave. Kane leaving three weeks in advance of deadline day and before the season had even started meant this year has felt like much less of a mad dash.\nBut while Spurs’ approach that summer proved to be misguided (not helped by being pipped to signing Willian by Chelsea; a whole story in itself), it’s interesting revisiting that period to see that Crooks was by no means a lone voice. Opposition managers, Villas-Boas’ predecessor Harry Redknapp and other experts all agreed that Spurs had strengthened very impressively and were ones to watch for the coming season. Jose Mourinho, managing Chelsea at the time, said of Tottenham that August: “They can win the title.”\nInternally, though, there were doubts. “You can’t do that. It can’t happen,” says Sandro, the former Spurs midfielder who saw it all play out first-hand. “I liked all of the guys who came in, but I disagreed with it. It wasn’t just me, either: the whole squad disagreed with it. We had missed out on the Champions League by one point the previous season. We had had an OK season, nothing horrendous, then they sign seven players. I don’t think we needed seven players.\n“I thought it was an error. We were all looking at each other, asking what was going on. It wasn’t easy for the players who arrived, either. It’s hard to give information to that many players. It was a lot of players arriving in one window. It was like, BAM! Who am I to say what’s wrong and right? But within the squad, in the changing room, there was a heavy atmosphere. It was too much change.”\n“Too much change” is a neat summation of what went wrong.\nAdvertisement\nThe summer of 2013 was one of huge upheaval for Tottenham — something that was celebrated at the time, but it quickly became apparent that it was more of a hindrance than a help.\nAs Sandro referenced, Spurs were fresh from a promising 2012-13 campaign. They had collected their most points ever in a Premier League campaign (72) but had missed out on the top four by a single point to Arsenal. It was a sickening blow, but they had done enough to suggest they needed a nudge in the right direction rather than a complete overhaul.\nThat said, so much of what Spurs had achieved the previous season was down to Bale, who produced one of the finest individual performances ever seen in English football. Bale scored 21 goals in 33 Premier League games en route to winning the PFA player of the year award and routinely rescued Spurs with his Roy-of-the-Rovers-esque heroics. Late winners became customary, including in his final two appearances at White Hart Lane.\nAnd there were other significant departures that summer. Clint Dempsey, Scott Parker and Tom Huddlestone all finished the season as regular starters in the Spurs midfield; all three were sold that window. Steven Caulker, who’d made 28 Spurs appearances the previous season and earned an England call-up, was also allowed to leave.\nThere were major changes off the pitch as well. Most notable was the appointment of Franco Baldini as technical director — a position Villas-Boas had been clear Spurs needed. Though the following year, Villas-Boas told Portuguese TV channel TVI: “I gave full support to the football director Franco Baldini who meanwhile had other ambitions, meaning that I ended up with players that did not fit the profile I wanted.”\nVillas-Boas himself was nearly on the move as well that summer, with Paris Saint-Germain making an approach to appoint him as Carlo Ancelotti’s successor. “I understood Tottenham wanted me to go to Paris,” Villas-Boas told The Athletic two years ago. “I had an offer from Paris Saint-Germain at the end of the (2012-13) season.\nAdvertisement\n“But I said ‘No’. My clause for leaving Tottenham, which (chairman Daniel) Levy was negotiating with Paris, was £15million. Chelsea had paid €15million (£12.9m) for me and in Tottenham it was £15million.\n“So I didn’t have the best of relationships with Daniel. We were correct throughout but we were not in love with each other and I think they wanted me to accept the offer.” Villas-Boas added that the episode “led to a bad, bad animosity between us”.\nSo it wasn’t the most harmonious situation behind the scenes and as Villas-Boas referenced in relation to Baldini, there were players he wanted to bring in that didn’t arrive. The Real Madrid left-back Fabio Coentrao was someone Villas-Boas had been pushing for all window.\nIn the centre-forward position, Zenit St Petersburg’s Hulk, Barcelona’s David Villa and Aston Villa’s Christian Benteke were all on his list, along with long-term target Leandro Damiao of Internacional. But Villas-Boas couldn’t say he wasn’t backed, as Tottenham broke their transfer record for the second time that summer (after signing Paulinho from Corinthians for £17million) to sign Roberto Soldado for £26m from Valencia.\nHow much, then, was Baldini to blame for the failures of the 2013 window? There are definitely well-placed sources from that time who think a good chunk of the responsibility falls on his shoulders. Some senior figures at Spurs are said to have quickly had doubts about him. He ultimately lasted only two years at the club and left by mutual consent in 2015 having been tasked in his final summer at the club with trying to sell some of the players bought with the Bale money.\nIn fairness to Baldini, the expectation when he joined was not that he would spend his first summer trying to pick up the pieces after Bale’s departure. The general view among those close to the situation was that Bale would stay for another season. He had signed a new four-year deal the previous June and was included in Spurs’ promotional activity for their kit launch in the summer of 2013. He was also chosen by NBC as the image for their huge billboard in New York’s Times Square promoting their new Premier League coverage. Another part of NBC’s ad campaign saw Bale referenced in a Ted Lasso skit that imagined the fictional American coach as Spurs’ new manager.\nBut by the time Tottenham set off for their pre-season tour of Hong Kong in late July, it was becoming clearer that Real Madrid were going to push a year earlier than had been expected and Bale, who had grown up idolising Madrid’s famous Galacticos team, was now set on a move to Real that summer.\nAdvertisement\nThis was the background noise when Tottenham arrived in Hong Kong on July 22 to compete in the pre-season Barclays Asia Trophy. Once there, Bale played in neither of Spurs’ matches and disappointed many at the club with his attitude and lack of application. It was clear Bale’s heart was set on a move and after weeks of Madrid players past and present cranking up the pressure by talking up a potential transfer, he refused to train in the week before the window closed. A furious Villas-Boas said publicly that the club should fine him.\nEventually, with Levy determined to get the world-record €100million that he felt was market value, Bale joined Madrid on September 1. In a terse statement, Tottenham’s chairman said in response: “Gareth was a player we had absolutely no intention of selling as we look to build for the future. He is a player whose career we have fostered and developed and he was only a year into his new four-year contract.\n“Such has been the attention from Real Madrid and so great is Gareth’s desire to join them, that we have taken the view that the player will not be sufficiently committed to our campaign in the current season. We have, therefore, with great reluctance, agreed to this sale and do so in the knowledge that we have an exceptionally strong squad to which we have added no fewer than seven top internationals.”\nOf those “seven top internationals”, Paulinho and winger Nacer Chadli (£7million from FC Twente) were signed in July, while Soldado and defensive midfielder Etienne Capoue (£9million from Toulouse) came in the first couple of weeks of August. Then on August 30, just before Bale’s departure, Eriksen (a steal at £11.5million from Ajax), Lamela (£30million including add-ons from Roma) and the centre-back Chiriches (£8.5million from FCSB) all arrived. The former two, Lamela especially, were signed to help fill the deficit in goals and assists that would be left by Bale’s departure. Likewise Paulinho, Chadli and Soldado. It was an outlay of more than £100million, with Spurs breaking their transfer record three times.\nThe end of the window was especially hectic, also taking in Chelsea’s famous hijacking of Spurs’ attempts to sign Brazilian winger Willian from Anzhi Makhachkala. With his pace and powerful running, Willian was more of a natural replacement for Bale than either Lamela or Eriksen.\nBut on August 22, while at the Spurs training ground to complete his medical, Willian was made aware of Chelsea’s desire to sign him and he had a change of heart. Levy and the Spurs hierarchy were said to be incandescent and with emotions running high, there was a belief at Spurs that Chelsea had only signed Willian to spite them and damage a team they saw as a potential title rival. Chelsea have always strongly denied this and can point to the fact they had almost signed Willian from Shakhtar Donetsk two years previously as evidence of their longstanding interest in the player.\nWhatever the motivation, it was a bitter blow for Spurs and for Villas-Boas, who had wanted to sign the winger in the January window as well. They had to pivot to other targets instead, one of whom was Chelsea’s Juan Mata, but this proved to be a non-starter. “Chelsea wouldn’t sell to Tottenham in any way or form, as they think that we are title contenders,” Villas-Boas said the following week.\nThere was tetchiness all around as the window neared its end and the Bale situation — plus who to bring in as his replacement — still hadn’t been resolved. On August 28, Villas-Boas expressed his frustration with England manager Roy Hodgson for calling up Andros Townsend without consulting him.\nAdvertisement\n“I was surprised (when he was called up),” Villas-Boas said. I would like to give you a little bit more information but the fact (is) that I wasn’t contacted in any way or form by Roy Hodgson regarding the player call-up.\n“I would have preferred to give my opinion on the fact he gets called up so soon.”\nThe next few days saw Spurs get their final deals done and Bale complete his move to Madrid. When they faced Arsenal on September 1, Lamela made his debut from the bench.\nArsenal won the game 1-0 but much of the build-up to the game centred on the contrast between Spurs’ perceived effectiveness in the window compared with the dithering of their north London rivals. At that point, the day before they signed Mesut Ozil from Madrid, they hadn’t paid a fee for a first-team player.\nAs the window closed and we moved into September, the plaudits for Villas-Boas’s new-look Spurs kept on coming.\nCrooks’ line about Elvis and the Beatles drew the most attention, but a week earlier on August 21, Mourinho said: “They can win the title.\n“They’re one of the best teams. Andre Villas-Boas knows the market very well and has employed a new technical director who also knows the market very well. He has the money and ambition to form a fantastic squad.”\nIn September, Tottenham’s captain, Michael Dawson, said the squad “certainly has to be the best” he had experienced during his eight years at the club. Villas-Boas’ predecessor, Redknapp, claimed it was the strongest in the Premier League.\nAnd when Spurs put Norwich away 2-0 on September 14 to go second in their first game after the window closed, the defeated manager Chris Hughton was asked if his former team could challenge for the title. He was unequivocal in his response: “They’ve got quality and for them, it’s not a question of if it is going to click, but when. It’s certainly a squad that will be up there challenging. There is no doubt about that. They have put together a wonderful squad.\n“They have so many good offensive options and it’s tough to cope with them all.”\nIn their next game, at half-time of their 3-0 win over Tromso in the Europa League, former goalkeeper Erik Thorstvedt repeated Crooks’ “sold Elvis and bought the Beatles” line.\nAdvertisement\nVillas-Boas laughed when this was put to him after the game. “Erik is very creative,” he said. “I like it… it sounds good!”\nLess than three months later, he was sacked and the transfer window was universally acknowledged to have been a disaster.\nWhy? And is that perception fair?\nMost are in agreement with Sandro’s “too much change” diagnosis.\n“Sometimes a team has to go through a big change,” he adds. “OK. But we didn’t need it.\n“The results (in 2012-13)… we were one point off perfection. We didn’t have loads of old players, either: it wasn’t like three or four players retired. I didn’t understand it, to be honest.”\nA decade on, it’s largely accepted that it takes time for new signings to settle and teams that make wholesale changes in the summer are unlikely to instantly click the following season.\nIn 2013, the idea of “winning the window” was less tainted and earning that accolade generally meant making a glut of signings. With hindsight, dressing-room sources from that time recall what felt like a “scattergun” approach to recruitment.\nChris Ramsey, who was a coach in the Spurs academy during the Bale summer but became Tim Sherwood’s assistant when he replaced Villas-Boas in December 2013, says: “With that outlay, people wanted instant results — which we know doesn’t happen.”\nLes Ferdinand was also moved from the academy to become one of Sherwood’s assistants and admits there wasn’t an appreciation for just how hard it would be for the team to adjust to having so many new players.\n“I wasn’t fearful at the time because most of the players that were coming through the door had very good reputations and you always hope they can hit the ground running,” says Ferdinand. “Soldado came in and with his reputation, you think great signing, good goalscorer. Paulinho was this exciting attacking Brazilian midfielder with a goal threat.\nAdvertisement\n“There was lots of potential there it just didn’t quite materialise as Villas-Boas would have wanted. Ultimately, it was too much too soon.”\nSherwood, who was the club’s technical co-ordinator during the summer of 2013 before his promotion to manager, felt too much emphasis was placed on signing players rather than mining the academy for talent. Others who were at Spurs at the time felt splashing so much cash in one window was a move away from Spurs’ DNA — in echoes of some of the debates there have been about the club in more recent times.\n“He (Villas-Boas) wanted to continue signing players and wouldn’t look at the academy, but I don’t mind, that’s his prerogative,” says Sherwood. Though to be fair to Villas-Boas, academy graduates Caulker and Townsend became first-team regulars under his tutelage, while Jake Livermore made 18 appearances in 2012-13.\n“Gareth was absolutely on fire and when you lose that kind of player, it’s always going to be difficult,” Sherwood continues. “I think Villas-Boas’ whole philosophy was based around Gareth Bale and why not? They were solid at the back and everything was geared to Gareth destroying the opposition and he did that. For the whole of the season, he was absolutely magnificent.\n“The players that came in, some of them were brilliant — Eriksen was fantastic value for money. But some of them just weren’t good enough and I felt coming from a development side, we had a lot of good players coming through the academy. I’m all for signing players but I think they’ve got to be a lot better than what you’ve got through the academy and not just a little bit better. I’ve never been one to pick on price tags or reputations, it’s all about what they do on the training field. It was quite evident, certainly with the time I had with those boys, that a lot of them weren’t much better than a lot of our academy graduates.”\nSherwood could point to the fact that by the following season (2014-15), academy graduates Kane, Ryan Mason, Danny Rose and Nabil Bentaleb were all regular starters.\nBroadly speaking, there just weren’t enough goals in the players that were brought in to replace Bale. Soldado was the main culprit here, registering just five in 50 Premier League games after scoring two penalties in his first two games. This was despite him saying his aim was to score 20 goals a season upon joining and having only been outscored in La Liga over the previous two seasons by Lionel Messi, Cristiano Ronaldo and Radamel Falcao. A glaring, crucial lack of killer instinct in a Europa League tie away at Fiorentina in his second season when he opted to pass rather than shoot when clean through was the final indignity for a player whose confidence was completely shot.\nAdvertisement\nPaulinho was similarly underwhelming. He was compared to Frank Lampard when he joined, but despite a bright start managed just six Premier League goals in his two seasons in England. The defining memory most have of him at Spurs is a woeful shot wide in a 0-0 draw away at Burnley towards the end of his second and final season.\n“Paulinho was a good lad but he was never going to be the next Frank Lampard,” Sherwood says.\nPaulinho played just 15 times in the league under Pochettino in the 2014-15 season and was sold to Guangzhou Evergrande for what felt like a generous £10million.\nLamela and Eriksen were much more successful, the former lasting eight years at the club and enjoying some memorable moments. He was never a regular contributor of goals or assists, however, which was the expectation when he joined from Roma as one of Bale’s replacements. Eriksen did a much better job of that, becoming the creative fulcrum of Pochettino’s side before leaving for Inter in January 2020 for a cut-price £17million as he neared the end of his contract.\nChadli was a useful option for the three seasons he was at the club. He contributed some important goals and assists to help Spurs back into the Champions League and in 2016 was sold to West Brom for £13million, almost double what he had been bought for.\nChiriches and Capoue were the only outright flops and the latter was unlucky with injuries, never establishing himself as the Parker replacement he was brought in to be. He has since shown that he is a very useful player and won the Europa League with Villarreal in 2021.\nBy the time of Villas-Boas’ final game — a humiliating 5-0 home defeat by Liverpool on December 15 — Capoue had recovered from an injury that kept him out for two months and slowed down his assimilation to the Premier League. Of the other new signings, Paulinho had probably been the most impressive up until that point, but he was sent off in the game. Lamela was an unused substitute, before — in an unfortunate portent for what was to come — picking up an injury later that month that ended his season. Eriksen and Chiriches were out injured, while Chadli and Soldado started but failed to make much of an impression.\nAdvertisement\nThe defeat left Spurs in seventh place, five points off the top four, and Villas-Boas departed by mutual consent the following day.\nHis squad had clearly failed to click, but individually were those seven signings that bad? Eriksen had a great Spurs career, Lamela and Chadli had good ones, while Capoue, and Paulinho, signed by Barcelona for £36million two years after leaving Tottenham, had successes later on. Soldado at least started scoring a few goals post-Tottenham, even if he was never prolific again. Chiriches is probably the only one you’d say was clearly not at the required level (his career since leaving Tottenham has consisted of being a squad player for Napoli and then battling Serie A relegation with Sassuolo and then Cremonese. He’s now back in Bucharest with FCSB).\nAnd if you compare Spurs’ transfer activity in the summer of 2013 with their main rivals, there’s no big difference — apart from arguably Manchester City — in the quality of the players they signed. The main difference was the quantity.\nFor the record, the first-team signings of the other ‘Big Six’ clubs that summer were:\n- Arsenal: Ozil, Mathieu Flamini, and Yaya Sanogo\n- Chelsea: Willian, Andre Schurrle, and the ageing Mark Schwarzer and Samuel Eto’o\n- Liverpool: Iago Aspas, Simon Mignolet, Kolo Toure, Mamadou Sakho, and Luis Alberto\n- Manchester United: Marouane Fellaini\n- Manchester City: Fernandinho, Alvaro Negredo, Stevan Jovetic, Martin Demichelis, and Jesus Navas\nIf there is a lesson to be learned from 10 years ago, it’s not to rush trying to replace a player as good as Bale. Doing so is very difficult to do in one window. And if you are going to reinvest the money of a major sale, it’s probably better to do it in one or two players (see Liverpool in 2018 with Virgil van Dijk and Alisson after selling Philippe Coutinho) than it is with more than half a dozen.\nThat said, there aren’t hard and fast rules for what makes a good transfer window, which is why our conclusions about this one will probably in large part be wide of the mark.\nOne consolation from 2013 is that relations between Bale and Spurs were not soured for any length of time. Despite his disappointment at losing his star player that summer, Levy always loved Bale and was determined to one day bring him back to the club. This happened in September 2020, by which time Lamela was the only survivor of the “Bale 7”.\nWhile his departure and the attempts to replace him were dramatic, what will always define Bale and Spurs is the magical few years between 2010 and 2013 when he made it feel like anything was possible.\nAdditional reporting: Jack Lang\n(Top photo: Tottenham Hotspur FC)",
  "word_count": 3938,
  "scraped_at": "2026-02-14T01:50:52.140306",
  "_text_extracted": true
}