{
  "article_id": "85f0542773ac",
  "url": "https://punchng.com/morroco-vs-senegal-afcons-final-fiasco/",
  "title": "AFCON Final Controversy : Did Refereeing Ruin the Match ? ",
  "date": "20260122T003000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It was meant to be a moment of triumph, a celebration of African football’s finest. Instead, this year’s African Cup of Nations final descended into chaos, leaving fans and players alike wondering if the referee’s whistle had become the real MVP. As Senegal took the trophy, their joy was tempered by controversy, with star player Sadio Mane stripping off his jersey in protest. The question on everyone’s mind: did the officials rob Morocco of a deserved victory, or was it just a bad day at the office?\nAfter a spectacle of 52 games, and a record-breaking number of goals (121 in the end), the AFCON 2025 had come down to the two of the best in a tense final. Morocco’s effort in delivering a good tournament in some of the best stadiums in the world was about to see a great finale, mature in talent and technicality. And then the worst!\nBy the time the AFCON final reached its dying moments, Africa should have been holding its breath for footballing destiny. Instead, it was holding its head in disbelief. This final did not explode because of football. It imploded because of officiating. Senegal won 1-0 but found it hard to celebrate as in other such victories, beginning with the absence of the champions’ shirt on many players. Star player, Sadio Mane, had to remove his own at a point before the trophy was handed to his team.\nThe seeds of controversy were planted earlier with a disallowed goal. Many analysts, however, thought the goal should have stood. Some say it should have been ruled out as the referee did. But that is not the real issue.\nBy every reasonable football standard, e.g., movement, timing, and advantage, that decision was certain to be controversial, as is often the case in football. But when a decision lacks conviction and clarity, especially in a final, a referee must seek a healthy balance subsequently.\nFinals demand certainty, not hesitation disguised as authority. When you controversially take away a goal in a final, you do not merely affect the scoreline; you destabilise emotions, trust, and discipline on the pitch. Such a decision alone should have urged caution on the referee for the rest of the match. Instead, it became the prelude to a far more damaging moment.\nThe late penalty call, coming at the very edge of the game, was technically arguable but contextually reckless. Football is not officiated by stopwatch alone; it is governed by judgement. When a referee inserts himself so decisively at the death of a final, after already disallowing a goal, he assumes a protagonistic role that the laws of the game never intended.\nIn the 2018 UEFA Champions League quarter-final, Real Madrid were awarded a highly controversial last-minute penalty against Juventus. Cristiano Ronaldo scored, Real progressed, and eventually lifted the trophy. Gianluigi Buffon was sent off in rage, and Juventus players surrounded the referee in scenes that mirrored what Africa witnessed in this AFCON final. That decision remains debated today, not because it was unprecedented, but because it demonstrated how a single whistle can tilt history.\nPlayer walk-offs, mass protests, and emotional breakdowns are not African inventions. They happen when referees lose control of perception, not just law.\nSome have rushed to brand Aliou Cissé’s (Senegal coach) decision to pull his players off the pitch as primitive. That is a shallow reading. Was it ideal? No. Was it understandable? Absolutely.\nWhen players believe the game has crossed from competition into manipulation, emotional revolt replaces rational obedience. Footballers are not machines. In fact, one could argue that had the penalty been taken immediately, without prolonged chaos, the match might have flowed differently. Momentum matters. Psychology matters. Time matters.\nThere are also whispers that Brahim Díaz may have been instructed to miss the penalty deliberately to “even things out”. That doesn’t seem to be true given Diaz’s reactions later. The team was also taken aback at the horror of a kick. However, that line of thought is precisely why African football keeps paying reputational costs globally. Once trust in officiating collapses, conspiracy rushes in to fill the vacuum. Even if such claims are absurd, referees create the conditions for them when decisions lack credibility.\nVictor Osimhen and Bright Osayi-Samuel including many Nigerians called out Ghanaian referee, Daniel Nii Layear for poor refereeing in the semi-final loss to Morocco.\nYet, for Nigeria, a footballing giant, not a single official was deemed worthy to officiate at any level: not centre referee, not assistant, not VAR, not fourth official. That is an indictment not only of Nigeria’s refereeing pipeline but of CAF’s confidence structure. In a tournament watched by the world, Africa sidelined one of its most experienced football nations in officiating and still ended with refereeing chaos.\nReferees are custodians, not stars. The best officials are invisible; the worst are unforgettable. Jeaan Jacques Ndala, the Congolese referee for Senegal vs Morocco, may not just have committed blunders, he simply failed to learn from a flashpoint. After controversially disallowing a goal, the final lesson should have been restraint, not escalation. Instead, he added a controversial penalty call at the death to an already bruised narrative.\nThis AFCON was shaping up to be remembered for quality, passion, and progress. Sadly, its final moments will now be archived under what not to do. The referee deserves rebuke, not out of anger alone, but out of necessity. African football cannot afford finales where the whistle drowns out the champions. Trophies should be lifted because of football, not because of the referee’s courage or lack of wisdom, with a whistle.",
  "word_count": 931,
  "scraped_at": "2026-02-14T01:53:15.586030",
  "_text_extracted": true
}