{
  "article_id": "85f30990d898",
  "url": "https://www.espn.in/football/blog-marcottis-musings/story/4842644/marcotti-2023-wishes-learn-from-qatar-world-cup-remember-that-football-is-for-fans",
  "title": "Marcotti 2023 wishes : Learn from World Cup , fans are first",
  "date": "20230102T151500Z",
  "domain": "espn.in",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Another year, another chance to reflect on what to wish for in 2023 and beyond. It's easy to get cynical and assume things will never change (or at least not for the better). And, indeed, some things take a long time to come to fruition. And some never do. Which is why if you look at my past wishes you'll see some things coming up time and again.\n- Stream on ESPN+: LaLiga, Bundesliga, more (U.S.)\nBut when you care about this sport and its community -- from fans to players -- you can't help but want to continue to wish.\nGab's wishes from: 2022 | 2021 | 2020 | 2019 | 2018 | 2017 | 2016 | 2015 | 2014\n1. That we don't forget how we got to Qatar 2022 (and Russia 2018): via a corruptible mechanism of favors, bribes and political interference. And we learn lessons from it. No, I'm not just pointing the finger at Qatar and Russia; most of the bidders -- including those who often pretend to be squeaky-clean, like Australia, England and the United States -- also engaged in highly dubious ethical behavior. It's all there in the Garcia report and it's not a coincidence that more than half the people who chose the 2018 and 2022 World Cup hosts were later banned or indicted. FIFA has reformed the mechanism for choosing World Cup hosts -- no longer a committee of 25, but all 211 member associations vote -- and, on paper, it should make the process harder to rig. But we need vigilance and transparency as well, otherwise we'll always be vulnerable.\n2. That no country the size of Qatar ever be allowed to host a World Cup on its own ever again, because the tournament should be about bringing football to as many fans as possible and leave the greatest possible legacy. I know some people liked the whole \"compact World Cup\" thing and having eight venues within an hour's drive. I didn't. It's not a knock on Qatar and, in a perfect world, it would have shared this with other countries in the region, such as Saudi Arabia, the United Arab Emirates, Bahrain, Kuwait, maybe Iran and Oman too. (It may have been open to it as well, until the Saudi/UAE blockade made it impossible.) Spreading out a World Cup over a larger area (and population) may be inconvenient for journalists like me, but it ensures more people get to experience the event, leaves a greater footprint in terms of legacy and doesn't end up wasting as much money on stadiums and infrastructure that may never be used again (or that later get dismantled). This was not an issue for wealthy Qatar, but it is for 99% of the world's countries.\n3. That the system used to determine injury time in Qatar 2022 become commonplace. Personally, I'd get rid of the running clock altogether. But since that's not going to happen, I much prefer a system like this, in which the time to be added is calculated by the fourth official based on objective measures: goal celebrations, injuries, VAR interventions, etc. It makes far more sense than the status quo, with referees adding arbitrary amounts at the end of each half. The next step? Make the fourth official's calculation public: X amount for this goal, Y amount for that goal, Z amount for the injury, etc.\nBarcelona president Joan Laporta expresses his hopes club legend and freshly crowned World Champion Lionel Messi will play in Blaugrana colours again.\n4. That even as club football becomes more and more Euro-centric (if not Premier League-plus-a-few-others-centric), the international game continues to become more global. We saw teams from every continent advance to the knockout round. We saw an African team (Morocco) advance to the semifinals. We had our first ever World Cup in an Arab country. Somebody other than a European team (Argentina) won it for the first time since 2002. All these things matter, I think. International football can form a counterweight to the club game, which is ever more polarized. And that can only be healthy.\n5. That people realize that if they're going to use sports -- especially the world's biggest -- to send a message, it's much more powerful if you're willing to face consequences. Muhammad Ali, Colin Kaepernick, Tommy Smith and John Carlos... these guys took a stand and faced consequences, which is why we remember them. The European FAs with the \"OneLove\" armband? As soon as they were threatened with a booking, they backed away. Which is why they won't be remembered for taking a stand.\n6. That now that the world's attention has moved elsewhere, folks do not forget about migrant workers in Qatar (and other places across the Gulf). Under pressure from FIFA, labor unions and world opinion, Qatar abolished its kafala system (akin to indentured servitude) and improved workers' conditions. The question is whether things will revert to how they were before or if Qatar maintains its promises... and perhaps even serves as an example to countries such as the UAE, Bahrain and others, showing that you can run a modern, prosperous country with a hefty migrant labor force while still protecting workers' rights and -- gasp! -- maybe even allow for labor unions.\nMark Ogden feels Cristiano Ronaldo's move to Saudi Arabian club Al-Nassr is a sad ending to his football career.\n7. That the folks running club football remember that sometimes less is more; that we take a long, hard look at our competitions, both continental and domestic, and we be prepared to make cuts and rethink things. That could include replacing national competitions with cross-border leagues where appropriate -- Benelux, Scandinavia, Baltic Republics spring to mind -- or expanding the Europa Conference League or simply reducing the top flight in the biggest leagues to 18 (or better yet, 16) teams. (Plus, of course, scrapping the League Cup in England.) The pyramid system and open access are sacrosanct pillars of the European model, but we need to stop pretending that the current structures were given to us by Moses when he came down from Mount Sinai. They've changed -- a lot -- for much of their history and there is no reason that should not happen again.\n8. That the Super League verdict be clear and unambiguous in preserving the principle of merit, but also help define what football is, whether a branch of the entertainment business or a shared cultural phenomenon. One of the many reasons the original Super League plan failed was that it was seen as just a power grab designed to either prop up ailing super-clubs or make the successful ones even richer and unassailable. But if the game is to be merely a business, then with a less ham-fisted approach they may have won more people over. If, on the other hand, it's more of a public trust, then it's hard to see such a power grab ever succeeding.\n9. That UEFA's financial sustainability regulations, which are replacing financial fair play (FFP), not just serve their purpose but also win over public opinion, because without faith in institutions we're all weaker. FFP achieved its original objective -- European clubs went from nearly $2 billion of aggregate losses pre-FFP to consecutive years of profit pre-COVID 19 pandemic -- but the system was still seen as toothless by many and unfairly repressive by others. And the perception that certain clubs have escaped with flouting the rules remains.\n10. That we do not get hung up on arithmetic when it comes to the 48-team World Cup but instead celebrate the fact that more get to participate in the greatest event in sports. Sixteen groups of three was a silly, problematic proposal. Twelve groups of four doesn't yield a neat and tidy straight-knockout format, but so what? We had six groups of four -- with the top third-place finishers advancing -- from 1986 to 1994 and it wasn't a problem. We can figure this out too.\n11. That, in a similar vein, we don't cite \"dilution of quality\" as a reason to not go to a 48-team World Cup. For starters, the World Cup isn't about quality and the finest expression of football. If you still believe that, you've been living under a rock. Beyond that, there were very few blowouts in the past few World Cups, certainly fewer, percentage-wise, than you see in top domestic leagues or the Champions League. Would the quality of Qatar 2022 have been diluted if, say, Colombia, Norway, Italy, Hungary, Nigeria, Egypt, etc. had been a part of it? Would it heck.\n12. That the 2023 Women's World Cup be a success in both sporting and commercial terms, despite some of the hurdles. We need to stop drawing comparisons to the men's game or suggesting that the women's game somehow ape the men's model. France 2019 was a rip-roaring success and it's going to be a tall order for Australia and New Zealand to match it in 2023. But we always need to remember the additional challenges the women's game faces: there is no high-level club football to advertise stars 365 days a year, there is still a massive gap between the dozen or so wealthy nations that spend significantly on it and the rest, and too many sponsors benchmark it against the men's game, which happens to be the most popular sport in the world.\n13. That some solution be found to compensate Ukrainian clubs that lost players following the Russian invasion. When war broke out last February, FIFA decided to allow all players registered to Ukrainian clubs to become free agents. It was the right decision: with bombs falling and the league initially suspended, it was only fair that they have the right to seek employment elsewhere. But the knock-on effect for many Ukrainian clubs -- most notably Shakhtar Donetsk, which took their case to the Court of Arbitration for Sport (CAS) -- was to lose players for nothing, often after acquiring them at vast expense. Ugly as it may be to think of players as \"assets,\" in the financialized reality of modern European football, that's what they are. There has to be some dispensation when it comes to financial fair play, at a minimum.\n14. That more leagues learn from LaLiga when it comes to enforcing rules on economic stability. When Javier Tebas introduced Spanish football's version of the \"salary cap\" -- linking expenditures on wages, transfers and commissions to projected revenue -- many scoffed. But not only has LaLiga managed to enforce it while continuing to grow, despite losing its two biggest stars, Cristiano Ronaldo and Lionel Messi, it has also provided some much-needed stability to the league. And the league has done it while managing to maintain top-to-bottom quality. Sure, Barcelona and Real Madrid still dominate (like they did before) but crowds and ratings are still good, the games are largely competitive and nobody is going bust.\n15. That we take a sad event, like the passing of the legendary Pele, as an opportunity to reflect on how the game has changed and, specifically, how superstardom transcends borders and cultures. It applied to Pele, it applied to Diego Maradona and it applies, in its own way, to Ronaldo and Messi. There's a quality that goes beyond nationality and club loyalties and brings us all closer together.\n16. That Karim Benzema makes the rest of the 2022-23 season count. You win the Ballon d'Or, you cue a series of stunning comebacks en route to winning the Champions League and then... you follow up with a stop-start campaign marked by injuries and an acrimonious exit from France's World Cup squad. There's time to turn it around, but, at 35, the clock is ticking for him as well.\n17. That whatever happens this season, even if they don't win the title, Arsenal don't forget the lessons learned that took them this far. Namely, that a motivated young group coupled with a manager who learns from his mistakes can defy conventional wisdom and become competitive very quickly.\n18. That Manuel Neuer recovers quickly from his broken leg... and that Bayern learn to insert skiing clauses in player contracts. Most clubs have clauses that bar players from engaging in potentially dangerous activities (everything from skiing to rock climbing to riding motorcycles). Just why it wouldn't occur to Bayern -- who hail from a city an hour away from prime ski resorts -- is difficult to understand.\n19. That Manchester United find new owners who will treat the club better than the Glazers did. I'm not just talking about the poor decisions since Sir Alex Ferguson left or the massive dividends they paid themselves or the staggering amounts of interest the club had to pay because of the debt they saddled it with. I'm also talking about fans not having to feel like they are being fleeced by the people who own the club they love. Owners are, above all, stewards of institutions that existed before they came along and will continue to exist after they're long gone.\n20. That Paris Saint-Germain remain in good hands if (when?) the Qataris sell up or scale back their investment. They insist they're committed to the club long-term but, frankly, it's hard to see PSG operating at the highest level without the current owners bankrolling losses year after year. And now that the World Cup has come and gone, how much longer will Qatar continue to subsidize losses? Whatever happens, the European landscape benefits from having major cities and strong brands such as PSG competing for silverware.\n21. That Joan Laporta hasn't turned Barcelona into a giant house of cards by selling off future TV, commercial and media income. The Barcelona president insists it was necessary to pull the \"economic levers,\" as he calls them. But it feels like a massive and frankly unnecessary gamble to avoid being remembered as the \"austerity\" president. And the worst-case scenario is too grim to contemplate.\n22. That Jurgen Klopp sticks around and doesn't join the exodus from Anfield. Michael Edwards, Julian Ward, Ian Graham and Mike Gordon are all gone or going. The owners, Fenway Sports Group, have put the club up for sale. These are the people -- and the culture -- who built the current cycle of success, as much as Klopp. He says he's committed; let's hope whoever comes in can work with him as well as the previous group of executives.\n23. That we get some sort of closure to the Premier League's investigation of Manchester City regarding breaches of FFP. It has been 3½ years now. Surely this is when you either bring your case against City for breaking rules -- if you think you can prove that they did -- or announce that they are fully cleared. Justice delayed is justice denied. It's not fair, above all, to City.\n24. That Ronaldo comes back to the big time. No disrespect to the Saudi League, but this is the same guy who finished as the Premier League's third-highest scorer last May. I don't want to remember him -- and I don't think he wants to be remembered -- as the guy who gave up the limelight for a giant paycheck. He's not what he was, fine. But in the modern game there are examples of players -- Edin Dzeko and Zlatan Ibrahimovic to name but two with similar body types -- who adjusted their style and contributed at a high level in their mid-to-late 30s.\n25. That Juventus' new board steer the club in the right direction and that supporters understand the road ahead. Maybe start by ditching the old slogan: \"Winning isn't important, it's the only thing that matters.\" No, it's not the only thing that matters. Winning while avoiding investigations into accounting fraud and market manipulation matters more. If you can win while balancing the books and not needing massive injections of capital from your shareholders, it matters even more than that. Juventus have the history, the resources, the stadium and the fan base to bounce back the right way. All they need is the leaders to make it happen.\n26. That Messi, whose deal with PSG expires in June, sticks around in Europe a little while longer so we get to see more of him at the very highest level. Or, if he wants to make an emotional choice and go back to Rosario and Newell's Old Boys, that's cool too. But his achievements in Qatar at the World Cup leave you wanting to see more for as long as you can.\n27. That having taken advice from a ton of different people, Todd Boehly finds the right folks to listen to in order to take Chelsea forward. Boehly inherited a club whose institutional memory and know-how was quickly gutted (out went Marina Granovskaia, Bruce Buck, Petr Cech, Scott McLachlan and others) and oversaw a turbulent first few months that included an expensive (and disjointed) transfer campaign as well as the sacking of Thomas Tuchel. Now, it's time to let the experts he brought in do their jobs.\n28. That AC Milan and Inter Milan get the green light and construction begins on the new stadium. As someone who was born a long goal kick from San Siro, it pains me to see it go. But, equally, it's a key building block if these two clubs are to return to where their pedigree and history dictates they should be.\n29. That even though the World Cup is over, and the spotlight has moved away from the Iran national team and the horrors of what is happening back home, we don't forget about them. The struggle in Iran has passed the 100-day mark and they need all the support they can get. It's not about mixing politics and sport, it's about human rights.\n30. That kids who fall in love with the sport be given the chance, first and foremost, to support their local club before jumping on the big-club bandwagon simply because that is what is pumped relentlessly onto screens. Yes, this is copied-and-pasted from previous years, but it's worth repeating. And it's the one wish over which we have the most control.",
  "word_count": 3039,
  "scraped_at": "2026-02-14T02:16:35.986165",
  "_text_extracted": true
}