{
  "article_id": "85fa11654b75",
  "url": "https://9to5mac.com/2024/07/31/apple-tv-plus-tv-shows-movies-guide/",
  "title": "Apple TV+ shows and movies : What to watch on Apple TV Plus",
  "date": "20240731T093000Z",
  "domain": "9to5mac.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Apple TV offers exclusive original TV shows and movies in 4K HDR quality. You can watch across all of your screens and pick up where you left off on any device. Apple TV costs $12.99 per month. You can get a seven-day free trial for new accounts here. Here’s every Apple original television show and movie available now on Apple TV, as well as the latest trailers …\nApple TV content is available exclusively through the Apple TV app. You can watch on your Apple TV set-top box, iPhone, or iPad as you might expect.\nBut you don’t need the latest Apple TV 4K to enjoy Apple TV. The TV app is also available on other platforms like Android, Amazon Fire TV, Roku, Sony PlayStation, Xbox, and even the web at tv.apple.com.\nApple TV offers original comedies, dramas, thrillers, documentaries, and kids shows.\nFor your $12.99/month subscription, you can watch all of Apple’s originals — as listed below. You can download to watch offline too. Apple is adding new content every single month.\nHow to watch the free Apple TV shows\nThe TV app is the exclusive destination for Apple TV, but the TV app is a little confusing because it blends together purchasable TV shows and movies from the iTunes Store, which you can buy or rent, content from other apps like Amazon Prime and Disney+, and Apple TV Channels.\nThe Watch Now screen does not really distinguish between content that you own and can watch, and just Apple’s general recommendations.\nThe easiest way to get started with Apple TV is to open the Apple TV app on your device, and tap on the Apple TV tab.\nThis tab is dedicated to presenting you the original content that is included with your subscription. You can see the latest releases, top charts, and browse categories like drama, comedy, and family.\nWhat to watch on Apple TV\nApple TV has already seen breakout hits including comedy Ted Lasso and workplace sci-fi drama Severance.\nApple aims for premium quality across its drama, comedy, and documentary TV shows and movies so everything should reach a reasonable level of quality and hopefully be worth your time. In terms of personal recommendations, I suggest starting with Ted Lasso, For All Mankind, Severance, Presumed Innocent, and the movie Finch.\nRead on to see all of the TV shows, movies and specials streaming now on Apple TV as well as trailers for upcoming releases.\nAll Apple TV TV shows and movies (updated February 13, 2026):\nLatest Trailers\nWatch season two of The Last Thing He Told Me on February 20. (read the book)\nTV Shows\nYo Gabba GabbaLand!\nWatch Season Two Trailer • January 30 • 2 seasons • TV-Y\nNew magician Kammy Kam joins old favorites Muno, Foofa, Plex, Brobee, and Toodee in this reboot of Yo Gabba Gabba! Join the gang on adventures all over GabbaLand, as they learn more about the world and themselves. The hit franchise helps families explore preschool challenges together, featuring vibrant colors and catchy songs throughout.\nShrinking\nWatch Trailer • January 28 • 3 seasons\nJason Segel plays James Laird, a grieving therapist who throws out the classical rulebook. Instead, he tells his clients his raw, unfiltered, thoughts about their problems. This has life-changing consequences on them, and himself. Harrison Ford also stars in the series.\nShrinking is renewed and a fourth season is in the works.\nDrops of God\nWatch Season Two Trailer • January 21 • 2 seasons\nFine wine is on the line in this dramatic adaptation of popular manga Drops of God. Camille is the daughter of Alexandre Leger, a highly respected figure in oenology. Following his death, Camille has to compete to earn the rights to her father’s endowment — an extraordinary wine collection. The series features both French and Japanese language dialogue.\nHijack\nWatch Trailer • January 14 • 2 seasons\nIdris Elba stars in this airplane hijack thriller, with the seven hour ordeal portrayed in real-time across seven episodes. Sam Nelson (Elba) negotiates in-the-air while ground control investigates the histories of the people onboard.\nTehran\nWatch Trailer • January 9 • 3 seasons • TV-MA\nApple TV’s first non-English language show is ‘Tehran’. A Mossad agent goes undercover in Tehran, Iran, in this espionage thriller starring Niv Sultan and Shaun Toub. The series is created by Moshe Zonder, head writer of Fauda.\nA fourth season of Tehran is in development. A release date is not yet known.\nBorn To Be Wild\nWatch Trailer • December 19, 2025 • 6 episodes • TV-G\nFrom cheetah cubs to lemur pups to elephant calfs, this captivating nature documentary gives viewers a close-up look at the upbringing of six rare species. Follow from birth how the animals learn to survive in the wild.\nWondLa\nWatch Season Three Trailer • Read Related Book • November 26, 2025 • 3 seasons • TV-PG\nBased on the beloved book by Tony DiTerlizzi, WondLa is an epic animated series adaptation of the children’s tale. In this world, the girl Eva is raised underground by a robot called Muthr. When her home is destroyed by a marauder, aged twelve, she is forced to flee and embarks on a search to find anyone else like her. Can she find another human?\nWondLa concluded with its final season on November 26, 2025.\nPrehistoric Planet\nWatch Season Three Trailer • November 23, 2025 • 15 episodes • TV-PG\nDavid Attenborough narrates the first two seasons of this stunning dinosaur docuseries. From the creators of Planet Earth, Prehistoric Planet blends state-of-the-art visual effects with the latest scientific understanding to demonstrate dinosaur behavior like never before. In the third season, the show explores the species of the Ice Age.\nPalm Royale\nWatch Season Two Trailer • Read Related Book • November 12, 2025 • 2 seasons\nKristen Wiig, Ricky Martin, Laura Dern, and Carol Burnett are just some of the actors in this star-studded drama. Maxine Simmons (Wiig) wants to break into high society and join the exclusive Palm Royale club, but how much of her morals will she sacrifice along the way to achieve this?\nPluribus\nWatch Trailer • November 7, 2025 • 1 season • TV-MA\nBreaking Bad creator Vince Gilligan returns to his sci-fi roots with Pluribus, starring Rhea Seehorn as Carol. Carol is the unhappiest person in the world, with the rest of the population infected by some sort of happiness virus. As seemingly the only one who is immune, it’s up to Carol to fight the hive mind.\nPluribus is renewed and a second season is in the works.\nDown Cemetery Road\nWatch Trailer • Read Related Book • October 29, 2025 • 1 season\nOff the back of the success of Slow Horses, Apple TV adapts another Mick Herron novel: Down Cemetery Road. Following on from a mysterious explosion inside an Oxford house, neighbor Sarah (Ruth Wilson) teams up with private investigator Zoe (Emma Thompson) to figure out exactly what is going on.\nDown Cemetery Road is renewed and a second season is in the works.\nMr. Scorsese\nWatch Trailer • October 17, 2025 • 5 episodes • TV-MA\nAn insightful five-party documentary series on the visionary director, Martin Scorsese. Featuring archive footage and richly personal interviews with friends, family, and his creative partners, Mr. Scorsese deeply explores the biggest moments of his filmography and in his personal life.\nLoot\nWatch Season Three Trailer • October 15, 2025 • 3 seasons\nLoot follows Molly, played by Maya Rudolph, who is figuring out what to do with her $87 billion divorce settlement. Across the series, she reckons with the comings and goings of her new life focus; running her charitable foundation.\nKnife Edge: Chasing Michelin Stars\nWatch Trailer • October 10, 2025 • 8 episodes\nThe Michelin Star is the most prestigious award in cooking. This documentary series follows chefs from around the world in their mission to earn the coveted accolade for their restaurant, including interviews with the anonymous Michelin inspectors who judge the food.\nThe Last Frontier\nWatch Trailer • October 10, 2025 • 1 season • TV-MA\nA prison plane transporting dangerous convicts crash-lands in Alaska. To try and keep the local area safe, it falls to marshal Frank Remnick (Jason Clarke) to recapture all of the inmates now on the loose. It quickly becomes clear the crash was not an accident.\nTen episodes of The Last Frontier were released. Since the first season came out, the show has been cancelled.\nThe Sisters Grimm\nWatch Trailer • Read Related Book • October 3, 2025 • 1 season • TV-G\nBased on the books of the same name, this animated series follows two orphaned sisters in a town populated by figures of fairy tales and fantasy folklore. While also trying to find out what happened to their parents, their adventures take on many twists and turns, presenting life lessons relevant to all ages.\nSlow Horses\nWatch Trailer • Read Related Book • September 24, 2025 • 5 seasons\nGary Oldman leads this adaptation of the Mick Herron book series, about a division of MI5 rejects. The Slough Horse group are consigned to a live of admin and drudgery, until they become embroiled in an active hostage situation.\nSlow Horses is currently up to season five. It has already been renewed for a sixth and seventh season.\nThe Reluctant Traveler\nWatch Season Three Trailer • September 19, 2025 • 3 seasons • TV-PG\nEugene Levy travels the world in this fun docuseries, facing all manner of personal challenges along the way. Levy takes a helicopter tour across the Utah desert, tries sumo wrestling in Toyko, stays at a deluxe island resort in the Maldives, assists conservation efforts in South Africa, and more across eight awe-inspiring episodes.\nThe Morning Show\nWatch Trailer • Read Related Book • September 17, 2025 • 4 seasons • TV-MA\nA drama exploring the power dynamics in the world of morning news broadcasts. The story opens with anchor Mitch Kessler (Steve Carell) facing sexual misconduct allegations. Newcomer Bradley Jackson (Reese Witherspoon) aspires to replace Kessler in the prime-time slot, and clashes with longtime host Alex Levy (Jennifer Aniston). In the second season, the show unravels the ramifications further against a backdrop of the beginnings of the COVID-19 outbreak.\nThe Morning Show Season Five Release Date\nThe show has been renewed for a fifth season. An exact release date for the new season is not yet known.\nKPOPPED\nWatch Trailer • August 29, 2025 • 8 episodes • TV-Y\nIn this music battle series, Western artists pair up with K-pop icons to reimagine one of their biggest hits. The best song of the bunch is then decided in front of a live studio audience in Seoul.\nShape Island\nWatch Season Two Trailer • Read Related Book • August 29, 2025 • 2 seasons • TV-G\nGo on adventures with Circle, Triangle and Square in this stop-motion animation adaptation of the children’s book series by Mac Barnett and Jon Klassen. The Shapes aren’t all the same, but they learn how best to work together.\nInvasion\nWatch Season Three Trailer • August 22, 2025 • 3 seasons\nThis sci-fi series shows the effects of an alien invasion from several different perspectives around the world. Spanning five continents, Invasion is theoretically huge in scope, although it prefers to focus on the minutiae of individual characters’ experiences rather than a character-driven adventure.\nPlatonic\nWatch Trailer • August 6, 2025 • 2 seasons • TV-MA\nRose Byrne and Seth Rogan star in this new comedy series, which flirts with the idea of two people just being friends. Playing Sylvia and Will respectively, the series sees the characters rekindle their friendship after many years apart, leading to some hilarious antics and midlife escapades.\nPlatonic has finished its second season. A third season is in development.\nChief of War\nWatch Trailer • August 1, 2025 • 1 season • TV-MA\nLed by a largely-Polynesian cast, this historical drama series depicts the battle for unification and colonization of Hawaii in the eighteenth century. Jason Momoa stars as Ka’iana, a renowned warrior chief.\nStillwater\nWatch Season Four Trailer • August 1, 2025 • 4 seasons • Y7\nIn this charming animated kids series, three kids gain new perspectives on the world thanks to their new best friend, Stillwater the panda. Stillwater helps the children make sense of their emotions. The series received a Peabody award for outstanding children’s programming.\nAcapulco\nWatch Season Four Trailer • July 23, 2025 • 4 seasons\nHeadlined by Eugenio Derbez, this fun bilingual comedy series is set at a popular hotel resort in Acapulco. Derbez plays the present-day version of lead character Maximo Gallardo, who narrates the life experiences of his younger self, starting from when he joined the resort in 1984.\nAcapulco concluded with its final season on July 23, 2025.\nFoundation\nWatch Trailer • Read Related Book • July 11, 2025 • 3 seasons • TV-MA\nBased on the genre-defining novels by Isaac Asimov, Foundation is an epic sci-fi adventure. Hari Seldon (Jared Harris) predicts the downfall of the Galactic Empire and recruits a band of exiles to carry out his plan to save the future of humanity.\nA fourth season of Foundation is in development. A release date is not yet known.\nThe Wild Ones\nWatch Trailer • July 11, 2025 • 1 season • TV-14\nGo on a worldwide expedition with a trio of experts who try to help save endangered species from extinction. This nature docuseries spans all sorts of different terrain and climates, from tracking down Gobi bears in the desert to tigers in the rainforest to whales in the Atlantic ocean.\nSmoke\nWatch Trailer • June 27, 2025 • 1 season • TV-MA\nFresh off the success of Apple original Black Bird, Taron Egerton and series creator Denis Lehane reunited to make Smoke. In the series, Dave Gudsen (Taron Egerton) and detective Michell Calderon (played by Jurnee Smollett) are on the hunt to track down two serial arsonists. Fiery personalities confront fire in this twisty crime drama.\nThe Buccaneers\nWatch Trailer • Read Related Book • June 18, 2025 • 2 seasons\nInspired by an unfinished Edith Wharton novel, The Buccaneers sees a group of rich American women trying to find a posh English other half. The group descend into a culture clash of 1870s London society.\nThe Buccaneers has finished its second season. A third season is in development.\nNot a Box\nWatch Trailer • Read Related Book • June 13, 2025 • 1 season • TV-Y\nIn this kids animated series, Riley quite literally thinks outside the box. She’s a bunny with a big imagination. In each episode, she dreams up a whole new world to explore, turning a simple drawing of a box into an expansive adventure.\nStick\nWatch Trailer • June 4, 2025 • 1 season\nPryce Cahill is an ex-professional golfer (played by Owen Wilson) who decides to bet his life on an up-and-coming 17-year-old talent. Golfing metaphors, in-jokes and hijinks underpin this feel good comedy series that shows how sport can be an effective vehicle to bring people closer together.\nA second season of Stick is in development. A release date is not yet known.\nMurderbot\nWatch Trailer • Read Related Book • May 16, 2025 • 1 season\nAlexander Skarsgard stars as Murderbot, a SecUnit robot who really can’t be bothered with the trivial matters of human emotion and personal relationships. Nevertheless, Murderbot is assigned to protect and assist a team of research scientists who are exploring an alien planet. All the while, it would rather be in situ enjoying its pick of the universe’s best streaming soap operas.\nA second season of Murderbot is in development. A release date is not yet known.\nLong Way Home\nWatch Trailer • May 9, 2025 • 10 episodes • TV-MA\nEwan McGregor and Charley Boorman set out on their next big motorcycle adventure, traversing a path through seventeen European countries in a journey lasting two months. This time, the pair are riding on refurbished vintage bikes. The series showcases beautiful scenery, local cultures, and the typical antics of two close friends.\nCarême\nWatch Trailer • Read Related Book • April 30, 2025 • 1 season • TV-MA\nThis French-language series tells the story of Antonin Carême. Carême has ambitions to become the world’s most famous chef, but political sway leads him into a career of espionage during Napoleonic-era France.\nJane\nWatch Season Three Trailer • April 18, 2025 • 3 seasons • TV-G\nJane, an aspiring young environmentalist, who wants to save as many endangered animals as possible. Using leading computer graphics techniques to bring the animals featured in the stories to life, the series charts epic adventures to save wild animals from across the globe.\nGovernment Cheese\nWatch Trailer • April 16, 2025 • 1 season • TV-MA\nAfter being released from prison, Hampton Chambers (played David Oyelowo) invents a self-sharpening power drill to try and change his family’s life prospects. But the dynamics of the Chambers family have changed a lot during his time behind bars, and his return causes more chaos than harmony.\nYour Friends & Neighbors\nWatch Trailer • April 11, 2025 • 1 season • TV-MA\nJon Hamm stars as Andrew Cooper, a disgraced hedge fund manager, who turns to a life of crime to try and sustain his lavish lifestyle. His plan is to steal expensive items from his rich neighbors’ houses, like designer handbags and watches … but quickly finds much more than he bargained for.\nYour Friends & Neighbors will return for a second season on April 3. A third season is also in development.\nFight for Glory: 2024 World Series\nWatch Trailer • March 28, 2025 • 3 episodes • TV-14\nRelive the 2024 World Series with behind-the-scenes access to the Yankees and Dodgers as they play a game for the ages. This three-part docuseries includes interviews with players and managers as it all comes down to the wire in a memorable baseball showdown.\nThe Studio\nWatch Trailer • March 26, 2025 • 1 season • TV-MA\nSeth Rogen stars in this comedy series as the new head of Continental Studios, a Hollywood studio that is fighting to stay relevant in the modern world of entertainment. The Studio highlights the absurdity of the industry in which artistry and business collide, with the series featuring an endless list of star-studded cameo appearances throughout.\nMore episodes of The Studio are on the way. Apple has officially announced that the show has been renewed for a second season.\nSide Quest\nWatch Trailer • March 26, 2025 • 1 season • TV-MA\nAs a spinoff anthology series from the main show, each episode of Side Quest explores a story set in the universe of Mythic Quest. The show portrays the lives of the game’s most-hardcore players, the dedicated fanbase, and the employees making it all happen.\nBE@RBRICK\nWatch Trailer • March 21, 2025 • 1 season • TV-G\nBased on the popular Japanese toy brand, the series follows Jasmine and her band in a story about ambition and aspiration. In a world where how you were painted typically determines your future prospects, Jasmine and the gang find the confidence to shape their own destiny.\nDope Thief\nWatch Trailer • March 14, 2025 • 1 season • TV-MA\nBrian Tyree Henry and Wagner Moura play the protagonists in this crime drama. Their characters pose as DEA agents, planning to rob small-time drug dens. During their criminal antics, they accidentally encounter one of the biggest drug-trafficking operations in the country, and get embroiled in something much larger than they bargained for.\nBerlin ER\nWatch Trailer • February 26, 2025 • 1 season • TV-MA\nThe chaos of a hospital is brought to the fore in this German-language drama series. The show follows Dr. Parker as she tries to overhaul the processes of the Berlin hospital emergency room. That task is easier said than done, when faced with the realities of an underpaid and fatigued workforce.\nA second season of Berlin ER is in development. A release date is not yet known.\nSurface\nWatch Season Two Trailer • February 21, 2025 • 2 seasons\nSophie (Gugu Mbatha-Raw) is suffering from severe memory loss, as a consequence of a suicide attempt. Or at least, that’s what she was led to believe. Battling amnesia, Sophie begins to piece together the truth of what happened.\nOnside: Major League Soccer\nWatch Trailer • February 21, 2025 • 1 season\nGo inside the 2024 Major League Soccer season with this eight-part docuseries, made by the same producers as Drive to Survive. Onside features exclusive access to players, coaches and clubs as they cultivate talent, brew rivalries, and battle in the fight for the trophy.\nGoldie\nWatch Trailer • February 14, 2025 • 1 season • TV-G\nGoldie is a kids animated series featuring a giant, with an even bigger heart. Follow Goldie and her friends in adventures across their home town of Boysenberg. Goldie learns to celebrate her differences, not shy away from them. The series is based on a 2019 award-winning animated short film of the same name.\nLove You to Death\nWatch Trailer • February 5, 2025 • 1 season • TV-MA\nIn this Spanish language comedy, Raul and Marta rekindle their childhood friendship, following the shocking news of Raul’s heart cancer diagnosis. Marta is pregnant, and tells her family that the baby is Raul’s. The couple’s beliefs about fate, relationship and love are tested to the extreme.\nVietnam: The War That Changed America\nWatch Trailer • January 31, 2025 • 6 episodes\nNarrated by Ethan Hawke, this six-part documentary presents the story of one of history’s longest wars, Vietnam. Featuring intimate archive footage and harrowing first-person accounts, the series shows the raw emotional truths of war, and the impossible choices the men on the ground had to make.\nMythic Quest\nWatch Season Four Trailer • January 29, 2025 • 4 seasons • TV-MA\nMythic Quest centers on a video game studio working on their next hit game. This fun workplace sitcom stars Rob McElhenney and Charlotte Nicdao, featuring subtle — and not so subtle — commentary on the universe of gaming culture in every episode.\nMythic Quest ended with its fourth season on January 29, 2025.\nEva the Owlet\nWatch Season Two Trailer • Read Related Book • January 24, 2025 • 2 seasons • TV-Y\nBased on the book series ‘Owl Diaries’, Eva the Owlet is a beautifully animated childrens series. With ambition and personality, Eva and her best friend Lucy go on many different adventures, logging her progress in her journal as she goes.\nPrime Target\nWatch Trailer • January 22, 2025 • 1 season • TV-14\nLeo Woodall stars in this thriller as Edward Brooks, a math postgraduate who believes he is close to finding a pattern in the sequence of prime numbers. If successful, he could break the encryption of all computers in the world. This makes him a target.\nSeverance\nWatch Trailer • January 17, 2025 • 2 seasons • TV-MA\nSeverance is a dystopian workplace thriller, in which employees at Lumon Industries undergo a procedure that separates their home and work memories. In the ultimate test of work-life balance, Mark Scout (played by Adam Scott) slowly confronts the secrets of the mysterious corporation that he works for.\nSeverance Season Three Release Date\nThe show has been renewed for a third season. An exact release date for the new season is not yet known.\nThe Secret Lives of Animals\nWatch Trailer • December 18, 2024 • 1 season • TV-Y\nHugh Bonneville narrates this intimate series exploring the idiosyncrasies of animal life. This series gives the viewer an up close look at surprising animal behavior, like how a seal leaves home on his own to the incredible defensive tactics of a seabed octopus.\nWonder Pets: In the City\nWatch Trailer • December 13, 2024 • 1 season • TV-Y\nAs a reboot of the classic kids series, the show introduces three new Wonder Pets; Izzy the Guinea Pig, Tate the Snake, and Zuri the Bunny. The animals travel around the globe on musical missions, along the way learning how to work best together.\nSago Mini Friends\nWatch Trailer • November 22, 2024 • 3 seasons • TV-G\nBased on characters from the award-winning app Sago Mini World, this preschool series explores gratitude and thankfulness with fun animated adventures and original music, set in the world of Sagoville.\nSilo\nWatch Trailer • Read Related Book • November 15, 2024 • 2 seasons\nBased on Hugh Howey’s best-selling book series, Silo sees the last of mankind living in a vast underground bunker, without knowing exactly why they ended up down there. No one is allowed to leave. The mystery of the silo unravels as the protagonists hunt for the truth.\nSilo Season Three Release Date\nSilo fans will welcome the news that the series has been renewed for a third and fourth season. A release date for the upcoming season is yet to be confirmed.\nBad Sisters\nWatch Season Two Trailer • November 13, 2024 • 2 seasons\nFrom executive producer and writer Sharon Horgan, Bad Sisters features a dark comedy plot revolving around the mystery of how Grace’s husband ended up dead. The insurance company certainly wants to believe the death came about by malicious intent, suspecting fraud. Horgan stars as Eva, one of the five sisters in the family.\nYou Would Do It Too\nWatch Trailer • October 30, 2024 • 1 season\nIn this Spanish drama, an armed robbery on a bus results in three deaths. Detectives are tasked with determining exactly what happened, but the truth is hard to decipher when confronted with inconsistent testimony of six different witnesses.\nBefore\nWatch Trailer • October 25, 2024 • 10 episodes • TV-MA\nIn this spooky thriller, Billy Crystal stars as Eli, a child psychiatrist. Through his job, Eli meets Noah, a young boy. But he is soon perturbed by the fact that Noah appears to be somehow connected to his past.\nDisclaimer\nWatch Trailer • Read Related Book • October 11, 2024 • 7 episodes • TV-MA\nCate Blanchett and Kevin Kline lead this cinematic limited series, directed by Alfonso Cuaron. In the series, journalist Catherine Ravenscroft is perturbed by the fact that a bedside novel is actually retelling her own real-life secrets, and tries to track down the mysterious author.\nCurses!\nWatch Season Two Trailer • October 4, 2024 • 2 seasons • TV-G\nIn this animated series, an ancient curse turns a beloved father, Alex, into a stone statue. His two children, Pandora and Russ, embark on a magical quest to collect stolen artifacts, lift the family curse, and bring Alex back.\nWhere’s Wanda?\nWatch Trailer • October 2, 2024 • 1 season • TV-14\nWhen a teenage girl goes missing, and the police are none the wiser about the circumstances of her disappearance weeks later, her parents take matters into their own hands. In this screwball German-language comedy, the hunt for Wanda is on with goofy antics aplenty.\nWhere’s Wanda? has finished its first season. A second season is in development.\nMidnight Family\nWatch Trailer • September 25, 2024 • 1 season • TV-MA\nBased on real events, the series follows Marigaby Tamayo, a gifted medical student. As the sun goes down, she traverses Mexico City in her family’s private ambulance, saving lives and making a living alongside her siblings and father.\nLa Maison\nWatch Trailer • September 20, 2024 • 1 season • TV-14\nAn iconic fashion house is trying to repair its reputation in this French language drama. While designers Perle Foster and Paloma Castel team up to try to renew the brand, the CEO of a rival luxury group sees her chance to take control of Maison LEDU, in a struggle of succession and power.\nK-Pop Idols\nWatch Trailer • August 30, 2024 • 6 episodes\nJessi, CRAVITY and BLACKSWAN feature in this six-part docuseries on the behind-the-scenes stresses of being a K-Pop star. Body image expectations are also explored, with extreme dieting and an intense training schedule employed to maintain a (perhaps unhealthily) slim figure.\nPachinko\nWatch Season Two Trailer • Read Related Book • August 23, 2024 • 2 seasons • TV-MA\nTold in three languages — Korean, Japanese and English — Pachinko is a sweeping epic with a story that spans four generations of a Korean immigrant family. The show flashes between timelines to follow the main character, Sunja, from a child and all the way through to elderly adulthood.\nBad Monkey\nWatch Trailer • Read Related Book • August 14, 2024 • 1 season\nBased on the book of the same name, Bad Monkey is an enjoyable comedy drama starring Vince Vaughn, as main character Andrew Yancy. He becomes wrapped up in Florida’s underworld of greed and corruption, following the discovery of a solitary severed arm. Alongside Vaughn, the cast includes Michelle Monaghan, Jodie Turner-Smith, Rob Delaney and Ashley Nichole-Black … and yes, there’s also a monkey. The series hails from Bill Lawrence, co-creator of other Apple TV hits Ted Lasso and Shrinking.\nApple TV has confirmed that Bad Monkey is renewed and will return for a second season. We don’t yet know when season two will be released.\nCowboy Cartel\nWatch Trailer • August 2, 2024 • 4 episodes\nThis docuseries retells the story of how Scott Lawson, as a newbie FBI agent, followed a hunch and discovered a vast money laundering operation taking place inside the world of American horse racing. With threats from hitmen on his doorstep, the agent risked everything to collect evidence against one of Mexico’s dangerous drug cartels, resulting in successful arrests and convictions of its leaders.\nWomen in Blue\nWatch Trailer • July 31, 2024 • 1 season\nInspired by true events, this series tells the story of four women who join Mexico’s first female police force. They soon discover the female force had been set up under false pretenses, meant as a mere gimmick to distract attention away from a rampant serial killer. The Women in Blue are emboldened and determined to actually bring the murderer to justice.\nWomen in Blue has finished its first season. A second season is in development.\nTime Bandits\nWatch Trailer • July 24, 2024 • 1 season • TV-PG\n11-year-old Kevin joins a team of travelling thieves, in a quest to save the world. Inspired by the 1980s film of the same name, Time Bandits invites the entire family to watch a comedic journey through time and space. Lisa Kudrow stars as Penelope.\nTime Bandits was cancelled after only one season.\nLady in the Lake\nWatch Trailer • Read Related Book • July 19, 2024 • 7 episodes • TV-MA\nIn this thrilling seven-part limited series, Maddie Schwartz (played by Natalie Portman) is a journalist investigating the connections between two mysterious murders. Based on the book of the same name, the story of Lady in the Lake is told with a gritty, yet surreal, tone.\nOmnivore\nWatch Trailer • July 19, 2024 • 8 episodes • TV-PG\nChef Rene Redzepi leads the viewer through global stories of food, highlighting the ingredients that underpin societies and culture around the world. Explore the wonders of bananas, tuna, pigs, rice, salt, coffee and more in this expansive docuseries.\nMe\nWatch Trailer • July 12, 2024 • 1 season • TV-Y\nMiddle-schooler Ben is trying to figure out his place in the world, when one day he realizes he has super powers. His abilities help him navigate the challenges of school, from dealing with bullies to talking to your crush. Across the series, Ben and stepsister Max learn how to best harness his powers.\nSunny\nWatch Trailer • July 10, 2024 • 1 season\nRashida Jones stars as Suzie, an American living in Kyoto, Japan. Her husband and son are missing following a plane crash. She is given a robot called Sunny as a companion. Suzie and the android become close friends, and together they investigate the mystery of the plane crash.\nSunny was cancelled after only one season.\nLand of Women\nWatch Trailer • June 26, 2024 • 1 season\nPlaying the role of Gala, Eva Longoria leads this six-episode Spanish comedy drama. Gala is forced to leave the big city as her husband owes money to the wrong people. She tries to start a new life with her mother and daughter in a small wine town located in northern Spain, but gossip spreads fast.\nCamp Snoopy\nWatch Trailer • June 14, 2024 • 1 season • TV-Y\nSnoopy and the gang discover the wonders of nature and outdoor exploration, in this latest original animated series. Charlie Brown and friends hike, swim and roast marshmallows as they immerse themselves in the joys of summer camp.\nCamp Snoopy is renewed and a second season is in the works.\nPresumed Innocent\nWatch Trailer • Read Related Book • June 12, 2024 • 1 season • TV-MA\nJake Gyllenhaal stars as Rusty, in this latest limited series adaptation of the Presumed Innocent novel by Scott Turow. Gyllenhaal stars as prosecutor Rusty Sabich. The Chicago Attorney’s office is shook when the finger of blame points at Rusty himself.\nPresumed Innocent Season Two Release Date\nThe show has been renewed for a second season. An exact release date for the new season is not yet known.\nFrog and Toad\nWatch Season Two Trailer • Read Related Book • May 31, 2024 • 2 seasons • TV-Y\nBased on the popular children’s books by Arnold Lobel, this cartoon centers on two best friends, Frog and Toad. The show explores friendship in all its forms, and how we should all embrace what makes us different and unique.\nTrying\nWatch Trailer • May 22, 2024 • 4 seasons • TV-14\nA fun British comedy revolving around a couple who are unable to conceive, and instead opt to go down the path of adoption. ‘Trying’ stars Rafe Spall and Esther Smith as their characters negotiate all the various hurdles associated with adopting a child.\nTrying has finished its fourth season. A fifth season is in development.\nThe Big Cigar\nWatch Trailer • May 17, 2024 • 6 episodes\n`Andre Holland stars in this true story of Hollywood and social overhaul. Hollywood producer Bert Schneider concocts an almost-unbelievable plan to run a fake movie production, to serve as cover for Huey P. Newton to travel to Cuba, outside the jurisdiction of the FBI.\nHollywood Con Queen\nWatch Trailer • May 8, 2024 • 3 episodes\nA three-part investigation into the notorious ‘Con Queen’, who impersonated female executives in Hollywood to ensnare victims into false promises of tantalizing career opportunities. The perpetrator was eventually tracked down by a team of private investigators and the FBI. Unusually, the scam was motivated more by the thrills of dominance and control, than money.\nDark Matter\nWatch Trailer • Read Related Book • May 8, 2024 • 1 season • TV-MA\nBlake Crouch adapts his own novel in this captivating sci-fi drama series, starring Joel Edgerton and Jennifer Connelly. One day, teacher and physicist Jason is abducted into an alternate universe, where he replays different versions of his own life. He must face the road not taken, and find a way to return to his real life and his real family, in order to save them from himself.\nA second season of Dark Matter is in development. A release date is not yet known.\nThe Big Door Prize\nWatch Season Two Trailer • Read Related Book • April 24, 2024 • 2 seasons\nChris O’Dowd leads this comedy series adaptation of best-selling book The Big Door Prize, in which a mysterious machine appears in a small town shop. The machine promises to tell people their true life’s potential.\nThe run of The Big Door Prize on Apple TV has ended. The show was cancelled after the release of its second season.\nFranklin\nWatch Trailer • April 12, 2024 • 8 episodes\nBy 1776, Benjamin Franklin has become world-renowned thanks to his experiments with electricity. The eight-part limited series follows Franklin, played by Michael Douglas, as he off to France, on a secret mission to garner support for American independence.\nSugar\nWatch Trailer • April 5, 2024 • 1 season • TV-MA\nColin Farrell is John Sugar, a private detective. He is tasked with looking into the sudden disappearance of Olivia Siegel, the daughter of a famous Hollywood producer. With references to classic neo-noir movies throughout, it transpires that the story of Sugar himself is just as mysterious as the case he is investigating.\nSugar has been renewed and will return for a second season later this year.\nFraggle Rock: Back to the Rock\nWatch Season Two Trailer • March 29, 2024 • 2 seasons\nBack to the Rock is a full series reboot of the original franchise, featuring recognizable characters like Gobo, Red, Boober, and Mokey as well as some new additions and celebrity guest cameos. Follow the Fraggles and Doozers as they embark on a new set of fun adventures, down in Fraggle Rock.\nManhunt\nWatch Trailer • Read Related Book • March 15, 2024 • 10 episodes\nThis limited series depicts the twelve day search for John Wilkes Booth, following the assassination of President Abraham Lincoln. Anthony Boyle stars as Booth, while Tobias Menzies plays Edwin Stanton, the lead organizer of the manhunt.\nThe Completely Made-Up Adventures of Dick Turpin\nWatch Trailer • March 1, 2024 • 1 season • TV-14\nNoel Fielding stars as the famous highwayman Dick Turpin, in a wacky and absurdist comedy. Despite his repeated protests, Turpin is made the leader of a band of outlaws and the series follows the group as they embark on increasingly wild and zany adventures.\nAlthough production on a second season of the series had commenced, the project was scrapped before completion. The show will not be continuing.\nEarthsounds\nWatch Trailer • February 23, 2024 • 12 episodes • TV-G\nSound is the focus of this latest Apple TV nature docuseries. The noise of ostrich chicks inside their eggs, snow leopards singing love songs, and the sound of walrus’s underwater courtship are all featured in the series, with sequences narrated by Tom Hiddleston.\nMessi’s World Cup: The Rise of a Legend\nWatch Trailer • February 21, 2024 • 4 episodes\nLionel Messi finally achieved World Cup glory at Qatar 2022. This four-part docuseries charts the soccer legend’s performance across the last five World Cups, through the ups and downs, culminating in the ultimate career prize.\nConstellation\nWatch Trailer • February 21, 2024 • 1 season\nNoomi Rapace stars as Jo, an astronaut who returns to Earth after a stint on the space station ends catastrophically. Back on the ground, though, Jo is haunted by self-doubt and questions her own sanity. Jonathan Banks also stars in the series.\nUnfortunately for fans of the series, Constellation has been cancelled and will not return for a second season.\nThe Dynasty: New England Patriots\nWatch Trailer • Read Related Book • February 16, 2024 • 10 episodes • TV-Y\nThe ten-part docuseries dives deep into the Tom Brady era of the New England Patriots. Featuring exclusive interviews with Brady, coach Bill Belichick, and others, the series charts the team’s momentous rise to success and six-time Super Bowl glory.\nThe New Look\nWatch Trailer • February 14, 2024 • 1 season • TV-MA\nThe drama follows Christian Dior and Coco Chanel as they launch modern fashion in the midst of World War II. Ben Mendelsohn, Juliette Binoche, John Malkovich and Maisie Williams round out the cast.\nMasters of the Air\nWatch Trailer • Read Related Book • January 26, 2024 • 9 episodes\nFrom the makers of ‘Band of Brothers’ and ‘The Pacific’, Masters of the Air follows the 100th Bomb Group in a nine-part epic battle for the skies. With vast scope and meticulous attention to detail, the series captures all of the triumphs and horrors of the World War II daylight bombings raids.\nCriminal Record\nWatch Trailer • January 10, 2024 • 1 season • TV-MA\nDetective June Lenker (Cush Jumbo) confronts chief inspector Daniel Hegarty (Peter Capaldi) in this British crime drama, facing off about the circumstances surrounding the guilty verdict of an old murder case, as new information comes to light by way of an anonymous tip-off. The series shows how institutional racism and failings of the police process serve to obstruct finding the actual truth.\nThe second season of Criminal Record arrives on April 22.\nJohn Lennon: Murder Without A Trial\nWatch Trailer • December 6, 2023 • 3 episodes • TV-MA\nIn this three-part documentary, people close to John Lennon reflect on his life and death. The series examines the events surrounding his murder, including new eyewitness interviews and never-before-seen crime scene photos, as well as the many conspiracy theories that sprung up in the aftermath of the killing.\nMonarch: Legacy of Monsters\nWatch Trailer • November 17, 2023 • 1 season • TV-Y\nSet in the world of Godzilla, this cinematic series follows two siblings as they uncover their family ties to the mysterious Monarch organization. With the show spanning multiple generations, stars Kurt and Wyatt Russell portray younger and older versions of the same character, officer Lee Shaw.\nMonarch: Legacy of Monsters will return for a second season on February 27.\nFor All Mankind\nWatch Trailer • November 10, 2023 • 4 seasons • TV-MA\nFor All Mankind explores what could have happened if the Russians got to the Moon first in 1969. This inspires the US government to continue the space race. The show forges an alternate timeline of NASA with the first season covering the 1969-1974 period. Season two picks up in 1983, as the USA and USSR face off in a space race cold war.\nFor All Mankind will return for a fifth season on March 27.\nThe Enfield Poltergeist\nWatch Trailer • October 27, 2023 • 4 episodes\nThe infamous poltergeist case is explored in this docuseries with dramatic recreations that use the original audio recordings of the events in question. Subject Janet Hodgson is interviewed and reflects on the long-lasting consequences of the investigation.\nLessons in Chemistry\nWatch Trailer • Read Related Book • October 13, 2023 • 8 episodes\nElizabeth Zott’s dream of becoming a scientist is stalled by the realities of a patriarchal society. Fired from the lab, she finds her feet as the host of a TV cooking show. And suddenly, everyone is listening to her. Brie Larson stars in this adaptation of the best-selling book of the same name.\nMessi Meets America\nWatch Trailer • October 11, 2023 • 6 episodes\nSoccer legend Lionel Messi joined Major League Soccer in July 2023 and immediately made his mark. This docuseries covers Messi’s arrival at Inter Miami and the events of his thrilling match debut. The series shows how Messi propelled MLS’s popularity, garnering worldwide attention, record-breaking merch sales, and sold-out stadium crowds.\nInterrupting Chicken\nWatch Trailer • Read Related Book • September 29, 2023 • 2 seasons\nInspired by the Interrupting Chicken book series, this preschool series introduces children to the world of creative writing. The show revolves around the main character Piper, a little chicken with a big imagination.\nStill Up\nWatch Trailer • September 22, 2023 • 1 season\nLisa is an illustrator, Danny is a journalist. Their friendship is bonded by a common trait — insomnia. Despite never meeting in person, while everyone else sleeps at night, they text each other for hours. The series follows the antics of their lives as their relationship blooms.\nUnfortunately for fans of the series, Still Up has been cancelled and will not return for a second season.\nThe Super Models\nWatch Trailer • September 20, 2023 • 4 episodes • TV-MA\nA four-part documentary series on the four elite supermodels of the ’80s; Naomi Campbell, Cindy Crawford, Linda Evangelista and Christy Turlington. With exclusive interviews and archive footage, the documentary shows how the illustrious models catapulted themselves to stardom, disrupting the power dynamics of an entire industry along the way.\nThe Changeling\nWatch Trailer • Read Related Book • September 8, 2023 • 1 season • TV-MA\nBased on the book by Victor LaValle, The Changeling is described as a dark fairy tale. Apollo (LaKeith Stanfield) first believes that Emma is experiencing the effects of postpartum depression, but it quickly unravels into a whole other world of horror, fantasy, and mythology.\nWanted: The Escape of Carlos Ghosn\nWatch Trailer • Read Related Book • August 25, 2023 • 4 episodes • TV-14\nRenault CEO Carlos Ghosn was one of the most respected business leaders in the world, until a 2018 scandal saw his entire reputation destroyed. He was facing lengthy jail time for fraudulent misuse of company assets. Incredibly, Ghosn escapes Japanese arrest by being smuggled out of the country inside a musical equipment case. This four-part documentary dives deep into this extraordinarily weird tale.\nStrange Planet\nWatch Trailer • Read Related Book • August 9, 2023 • 1 season • TV-PG\nAdapted from Nathan W. Pyle’s viral social media comic of the same name, Strange Planet is an animated TV series that explores the absurdity of human life through the lens of these cute blue alien beings.\nPhysical\nWatch Season Three Trailer • August 2, 2023 • 3 seasons • TV-MA\nRose Byrne stars as Sheila Rubin in this dramedy set in the ’80s. Stricken by a serious eating disorder, Sheila turns to the aerobics craze to find motivation and self-worth. Her hobby quickly develops into something more however, as student becomes teacher and she forges a new career.\nPhysical concluded with its final season on August 2, 2023.\nThe Afterparty\nWatch Season Two Trailer • July 12, 2023 • 2 seasons\nThe Afterparty retells the story of a night gone wrong from eight different perspectives, with each account presented through the lens of a different film genre. Tiffany Haddish plays the lead detective in this murder mystery whodunnit comedy series.\nThe Afterparty ended with its second season on July 12, 2023.\nDuck & Goose\nWatch Season Two Trailer • Read Related Book • July 7, 2023 • 2 seasons\nBased on the best-selling children’s books, Duck & Goose is a cartoon series aimed at preschool age. Titular characters Duck and Goose learn to appreciate each other’s differences and become even closer friends.\nSwagger\nWatch Season Two Trailer • June 23, 2023 • 2 seasons\nSwagger dissects the world of youth basketball, inspired by the experiences of NBA legend Kevin Durant. O’Shea Jackson Jr. stars as coach Ike, who helps Jace Carson (played by Isaiah Hill) navigate his burgeoning sports career. Ike is as much father-figure as he his coach. The show covers off-the-court storylines too, including the pressures of social media, child abuse and police brutality.\nUnfortunately for fans of the series, Swagger has been cancelled and will not return for a third season.\nLovely Little Farm\nWatch Trailer • June 16, 2023 • 2 seasons • TV-Y\nSisters Jacky and Jill explore what it is like to work, and grow up, on a farm. In the series, they nurture a mysterious golden egg that hatches into a baby dragon. Lovely Little Farm is a loving children’s series that beautifully blends live-action and computer animation.\nThe Crowded Room\nWatch Trailer • Read Related Book • June 9, 2023 • 10 episodes • TV-MA\nTom Holland stars as Danny Sullivan in this 10-part series, who is arrested on suspicion of his involvement with a New York City shooting. He claims innocence, initially. Much of the story is revealed through interviews with interrogator Rya Goodwin (played Amanda Seyfried), in which the mystery unravels as Sullivan is forced to reflect on all aspects of his life.\nThe Snoopy Show\nWatch Season Three Trailer • June 9, 2023 • 3 seasons • TV-G\nA whole new set of adventures with Snoopy and friends for the whole family to enjoy, drawing on the spirit of the classic cartoons but rendered in a modern computer animated 2D style. The series will surely delight young viewers as well as parents with pangs of nostalgia.\nHigh Desert\nWatch Trailer • May 17, 2023 • 1 season • TV-MA\nPatricia Arquette stars as Peggy, a drug addict who wants to make a fresh start following the death of her mother. She decides to become a private investigator, and becomes entwined in a web of mysteries in this dark comedy series.\nHigh Desert was cancelled after the debut of its first season on May 17, 2023.\nCity on Fire\nWatch Trailer • Read Related Book • May 12, 2023 • 1 season • TV-MA\nSamantha, an NYU student, is shot in Central Park on July 4th, 2003. She appears to have been alone — there are no witnesses. As the mystery of the show unfolds, It turns out the truth of her apparent murder is connected to a series of fires that have been started across New York.\nUnfortunately for fans of the series, City on Fire has been cancelled and will not return for a second season.\nHarriet the Spy\nWatch Season Two Trailer • Read Related Book • May 5, 2023 • 2 seasons • TV-G\nInspired by the classic children’s novel, Harriet the Spy is newly adapted for television as an animated series. 11-year-old Harriet (voiced by Beanie Feldstein) is an aspiring writer and absorbs as much as information about the world around her as possible, jotting it down in her notebook.\nBig Beasts\nWatch Trailer • April 21, 2023 • 1 season • TV-PG\nFrom the same producers as docuseries Tiny World, Big Beasts looks at the giants of the animal kingdom, including the gray whale, the orangutan, and the polar bear. Filmed across seventeen countries, the series features never-before-recorded sequences of animal behavior. The show is narrated by Tom Hiddleston.\nThe Last Thing He Told Me\nWatch Season Two Trailer • Read Related Book • April 14, 2023 • 1 season\nThe New York Times bestseller The Last Thing He Told Me is dramatised in this limited series adaptation starring Jennifer Garner. The story follows Hannah, whose seemingly-perfect partner Owen unexpectedly vanishes. He leaves behind a note for his daughter that ominously reads ‘Protect her’. Hannah realizes she didn’t really know her husband at all.\nThe Last Thing He Told Me will return for a second season on February 20.\nBoom! Boom: The World vs. Boris Becker\nWatch Trailer • April 7, 2023 • 2 episodes • TV-MA\nA two-part documentary on the topsy turvy life of tennis player Boris Becker, who was ultimately sent to prison for bankruptcy fraud. The series includes interviews with Becker, as well as other tennis icons like John McEnroe and Novak Djokovic.\nSchmigadoon!\nWatch Season Two Trailer • April 5, 2023 • 2 seasons • TV-MA\nSchmigadoon embraces the parody of classic musicals with a story of a couple getting trapped in a mystical musical town until they can find true love. Keegan-Michael Key and Cecily Strong are joined by Broadway heavyweights including Alan Cumming, Jane Krakowski, Kristen Chenoweth, Aaron Tveit and Ann Harada in this star-studded cast.\nUnfortunately for fans of the series, Schmigadoon! has been cancelled and will not return for a third season.\nMy Kind of Country\nWatch Trailer • March 24, 2023 • 8 episodes\nApple TV’s first competition series, My Kind of Country, highlights upcoming talent in country music. Artists are scouted and mentored by Jimmie Allen, Mickey Guyton and Orville Peck. The contestants are hoping to win a prestigious endorsement prize from Apple Music.\nMonster Factory\nWatch Trailer • March 17, 2023 • 6 episodes • TV-MA\nThis documentary series explores the world of wrestling through the lens of the Monster Factory, a training school in New Jersey led by a tough-yet-caring coach Danny Cage. As a former wrestler himself, Cage is motivated to help the new recruits achieve their dreams of going pro.\nExtrapolations\nWatch Trailer • March 17, 2023 • 8 episodes\nDirector Scott Z. Burns brings climate change to the fore in this star-studded limited series. Across eight interconnected episodes, Extrapolations speculates how human life will be forced to adapt to the changing climate, and whether there’s a chance to turn back the the clock and reverse the trends of what seems like an inevitable fate.\nTed Lasso\nWatch Trailer • March 15, 2023 • 3 seasons • TV-MA\nTed Lasso follows an American football coach who comes to England to lead … a soccer team. However, this show is much richer than a typical fish-out-of-water story. Ted Lasso may not know about the intricacies of soccer but he employs his unyielding optimism to bring out the best in his players.\nThis heartwarming and funny comedy series has been widely received by audiences and earned much critical acclaim.\nTed Lasso Season Four Release Date\nTed Lasso fans will welcome the news that the series has been renewed for a fourth season. A release date for the upcoming season is yet to be confirmed.\nReal Madrid: Until The End\nWatch Trailer • March 10, 2023 • 3 episodes\nThis three-part series gives an inside look at Real Madrid’s legendary run during the 2021-2022 Champions League football season. The team ultimately defy their critics to score their 14th Champions League title.\nLiaison\nWatch Trailer • February 24, 2023 • 1 season\nVincent Cassel and Eva Green star in Apple’s first French language original series. The crime thriller sees Alison Rowdy (Green) and Gabriel Delage (Cassel) struggle with the secrets of their relationship in the wake of major international cyber attacks against the United Kingdom.\nPretzel and the Puppies\nWatch Trailer • Read Related Book • February 24, 2023 • 2 seasons\nPretzel is the world’s longest dachshund. He has a supportive dad to five puppies, and husband to wife Greta. In this animated series, follow Pretzel and his family as they try to make the world a better place.\nMake or Break\nWatch Season Two Trailer • February 17, 2023 • 2 seasons\nMake or Break jumps into the world of professional surfing, with exclusive access to follow some of the best surfers on the planet as they experience the highs and lows of competing in the World Surf League season.\nHello Tomorrow\nWatch Trailer • February 17, 2023 • 1 season\nBilly Crudup stars as salesman Jack in this retro-future sci-fi series, in which Jack and a cohort of others are trying to find homebuyers for promised lunar timeshares. But everything is not as it first seems and Jack’s headstrong ambition and charisma masks a darker truth.\nDear Edward\nWatch Trailer • Read Related Book • February 3, 2023 • 1 season • TV-MA\nA horrific plane crash kills everyone onboard apart from Edward, a 12-year-old boy. Based on the novel of the same name by Ann Napolitano, this emotional drama series explores the effects of grief and spontaneous camaraderie of the families left behind.\nUnfortunately for fans of the series, Dear Edward has been cancelled and will not return for a second season.\nPinecone & Pony\nWatch Trailer • Read Related Book • February 3, 2023 • 2 seasons • TV-Y\nBased on the book by Kate Beaton, Pinecone & Pony is a beautiful family cartoon starring a young warrior, Pinecone, and her best friend, Pony. A world of magic and adventure awaits in this children’s comedy series.\nTruth Be Told\nWatch Season Three Trailer • Read Related Book • January 20, 2023 • 3 seasons • TV-MA\nTrue-crime podcaster Poppy Parnell, played by Octavia Spencer, reopens a murder case as new evidence comes to light about the crime she originally investigated and brodcast to the world. In season two, Poppy Parnell follows the trail of a different case with help from lifelong friend Micah Keith (Kate Hudson).\nThe run of Truth Be Told on Apple TV has ended. The show was cancelled after the release of its third season.\nServant\nWatch Season Four Trailer • January 13, 2023 • 4 seasons • TV-MA\nA psychological thriller produced by M. Night Shyamalan, told in 30-minute chunks. The family suffers the death of their baby at 13-weeks, and get a substitute baby doll as a kind of therapy. The grief-stricken mother becomes so attached to the doll she hires a mysterious nanny to care for it.\nServant ended with its fourth season on January 13, 2023.\nSuper League: The War for Football\nWatch Trailer • January 13, 2023 • 4 episodes • TV-MA\nA four-part series detailing the (ultimately failed) attempts to create a breakway league of top clubs in European football. The documentary features exclusive interviews with the masterminds of the planned European Super League, including access to club owners and league presidents.\nPuppy Place\nWatch Season Two Trailer • Read Related Book • December 9, 2022 • 2 seasons\nSiblings Charles and Lizzie share their love for dogs in this live action TV show for kids, inspired by the Scholastic book series. In each episode, the family find a caring and loving home for each of the puppies that come their way.\nLittle America\nWatch Season Two Trailer • Read Related Book • December 9, 2022 • 2 seasons • TV-14\nLittle America is a half-hour anthology series that explores amazing tales of immigrants in America, spanning the gamut of human emotion and experience. Each episode is based on a true story from the Epic Magazine feature of the same name.\nLittle America ended with its second season on December 9, 2022.\nEcho 3\nWatch Trailer • November 23, 2022 • 1 season\nA young scientist, Amber, has been captured and held hostage somewhere near the Colombia-Venezuela border. Amber’s military veteran brother Bambi (Luke Evans) and husband Prince (Michiel Huisman) undertake a treacherous search and rescue mission to try to find her, in this intense action thriller.\nCircuit Breakers\nWatch Trailer • November 11, 2022 • 1 season\nCircuit Breakers is an anthology series for kids and families to enjoy together, featuring seven unique science-fiction stories. Go on futuristic adventures to space and more, all while exploring the highs and lows of what it means to grow up.\nSlumberkins\nWatch Trailer • Read Related Book • November 4, 2022 • 1 season • TV-G\nCombining puppetry and 2D animation, Slumberkins is an enchanting show about feelings, based on characters from the popular children’s book series. Go on adventures with Bigfoot, Unicorn, Sloth, Yak and Fox, learning about mental wellness along the way.\nThe Mosquito Coast\nWatch Season Two Trailer • Read Related Book • November 4, 2022 • 2 seasons • TV-MA\nAlthough it shares a name with ‘The Mosquito Coast’ book, this TV adaptation is more of a prequel. It follows Allie Fox (Justin Theroux) as he takes his family on the run from the US government, in a perilous journey to Mexico.\nThe run of The Mosquito Coast on Apple TV has ended. The show was cancelled after the release of its second season.\nGhostwriter\nWatch Season Three Trailer • Read Related Book • October 21, 2022 • 3 seasons • TV-G\nA reboot of the classic children’s show of the same name, Ghostwriter follows the adventures of four kids in a haunted bookstore. The ghost brings classics of literature to life, and the kids must solve the mysteries that they entail.\nShantaram\nWatch Trailer • Read Related Book • October 14, 2022 • 1 season • TV-MA\nBased on the popular novel of the same name, Charlie Hunnam stars as Lin Ford, a runaway criminal who tries to start a new life in Bombay, India. However, his ties to crime ultimately reel him back into the underworld.\nShantaram was cancelled after the debut of its first season on October 14, 2022.\nThe Problem with Jon Stewart\nYouTube Channel • October 7, 2022 • 2 seasons\nJon Stewart returns to television with a more serious tone. In each hour-long episode, The Problem with Jon Stewart examines global issues relating to current affairs and Stewart’s advocacy work, and aims to raise conversations around possible solutions.\nThe Problem with Jon Stewart ended with its second season on October 7, 2022.\nHello, Jack! The Kindness Show\nWatch Season Two Trailer • October 7, 2022 • 2 seasons • TV-Y\nJack McBrayer highlights small acts of kindness in this charming kids series aimed at preschoolers, with an original soundtrack produced by award-winning band OK Go. The Kindness Show reinforces the values of caring and connecting with others.\nGet Rolling With Otis\nWatch Trailer • September 30, 2022 • 2 seasons\nOtis the tractor is here to help others in this animated kids series that takes place on Long Hill Dairy Farm. Whenever he sees a friend in need, Otis rolls into action. You may recognize Otis from the popular children’s book series of the same name.\nWolfboy and the Everything Factory\nWatch Season Two Trailer • September 30, 2022 • 2 seasons\nIn this charming animated series, William Wolf lets his imagination run wild. Along with his new Spryte friends, he might even have the power to change the world. William is voiced by Kassian Akhtar. The show is executive produced by Joseph-Gordon Levitt.\nGutsy\nWatch Trailer • Read Related Book • September 9, 2022 • 8 episodes • TV-MA\nHillary Clinton and her daughter, Chelsea Clinton, highlight bold and influential women in this interview series. Featured celebrities include Kim Kardashian, Wanda Sykes, Megan Thee Stallion, Jane Goodall and more.\nCentral Park\nWatch Season Three Trailer • September 9, 2022 • 3 seasons • TV-14\nCentral Park is an animated series from the creator of Bob’s Burgers. With a cast that includes Josh Gad, Kristen Bell and Tituss Burgess, the story revolves around a family of caretakers trying to save the city’s green space from being converted into a shopping mall. The show is an animated musical comedy, with 3-4 original songs per episode.\nThe run of Central Park on Apple TV has ended. The show was cancelled after the release of its third season.\nLife By Ella\nWatch Trailer • September 2, 2022 • 1 season\nFollowing a stint of chemotherapy, Ella just wants to be a regular teenage girl as she starts a new year of school. Empowered by a new perspective on life, Ella faces her fears head-on with an aim to make memories she’ll remember forever.\nSEE\nWatch Season Three Trailer • August 26, 2022 • 3 seasons • TV-MA\nA post-apocalyptic adventure set 600 years in the future. The remaining population of Earth is blind. A war breaks out as sighted twins are born into a tribe, and the queen of the lands fears the mythic twins will threaten her rule. Jason Momoa stars as Baba Voss, who will do anything to protect his sighted children. Dave Bautista joins the cast as Edo Voss, Baba’s brother, in the second season.\nSurfside Girls\nWatch Trailer • Read Related Book • August 19, 2022 • 1 season • TV-G\nBased on the popular young adult graphic novels, Surfside Girls sees best friends Sam and Jade explore supernatural happenings in their seaside town, with a mysterious pirate ship docking at the bay. It all culminates in a showdown at the Danger Point coastal bluff.\nFive Days at Memorial\nWatch Trailer • Read Related Book • August 12, 2022 • 8 episodes • TV-MA\nThis limited series tells the harrowing true story of what happened at Memorial Medical Center, in the aftermath of the devastation by Hurricane Katrina. The events of the first five days inside the hospital are re-enacted over the first five episodes, combining dramatic performances with archive footage. The remainder of the season shifts to focus on the investigation into possible charges of euthanasia, raising questions about whether human failures prevented more lives from being saved.\nAmber Brown\nWatch Trailer • Read Related Book • July 29, 2022 • 1 season • TV-G\nBased on the books by Paula Danziger, Amber Brown is a fun TV series for the whole family to enjoy. It addresses issues of friendship, communication and growing up. Brown’s love to draw is brought to life in the show with beautifully animated illustrations.\nAmber Brown was cancelled after only one season.\nBest Foot Forward\nWatch Trailer • Read Related Book • July 22, 2022 • 1 season\nBased on the book Just Don’t Fall by paralympic athlete Josh Sundquist, the show centers on 12-year-old Josh Dubin, who has a prosthetic leg, as he starts a new chapter of his life at middle school. He teaches his peers at school that he is really just like them, disability or otherwise.\nBlack Bird\nWatch Trailer • Read Related Book • July 8, 2022 • 6 episodes\nBased on a true story, inmate Jimmy Keene is giving a chance for freedom. But first, he must be transported to a maximum security prison and elicit a confession out of a suspected serial killer, Larry Hall. Taron Egerton and Paul Walter-Hauser lead the cast of this thrilling six-part series.\nHome\nWatch Season Two Trailer • June 17, 2022 • 2 seasons • TV-PG\nA series that takes you inside some of the world’s most innovative homes, and the stories of the people that made them. The optimistic docuseries explores incredible dwellings from places around the world.\nHome ended with its second season on June 17, 2022.\nCarpool Karaoke: The Series\nWatch Season Five Trailer • May 27, 2022 • 75 episodes • TV-14\nBased on the popular James Corden format, Carpool Karaoke: The Series expands on the premise with different celebrities taking the wheel for various comedic skits and classic karaoke sing-alongs.\nHelpsters\nWatch Trailer • May 27, 2022 • 3 seasons • TV-Y\nAn educational children’s live-action puppet series starring Cody and the Helpsters, from the makers of Sesame Street. The show teaches the fundamentals of problem solving and coding through the lens of activities like party planning, climbing a mountain, and magic tricks.\nNow and Then\nWatch Trailer • May 20, 2022 • 1 season\nA cover up of a deadly car crash leaves a group of friends forever implicated. Twenty years on, their secret is threatened to be revealed. This Spanish and English language thriller contrasts the freedom of youth with the realities of adulthood.\nGreatness Code\nWatch Trailer • May 13, 2022 • 2 seasons • TV-PG\nA short-form documentary series covering some of the greatest stories in sports. The show features sporting legends including LeBron James, Tom Brady, Alex Morgan, Usain Bolt, Katie Ledecky and more, as they discuss the critical moments that defined their careers.\nThe Essex Serpent\nWatch Trailer • Read Related Book • May 13, 2022 • 6 episodes\nReligion, superstition and science wage war in a town on the coast of Essex. Following the mysterious disappearance of a young girl, Cora (played by Clare Danes) moves to the town to hunt for proof of the rumored serpent. Church rector Will Ransom (Tom Hiddleston) refuses to believe the myths.\nThe Big Conn\nWatch Trailer • May 6, 2022 • 4 episodes • TV-MA\nFrom the makers of McMillion$, The Big Conn explores one of the largest government frauds in US history, with ill-gotten gains valued in the billions of dollars, all centering on one man: Eric C. Conn. The four-part docuseries tells an incredible tale of how Conn evaded the eyes of the law for so long.\nShining Girls\nWatch Trailer • Read Related Book • April 29, 2022 • 8 episodes\nElisabeth Moss leads this adaptation of the award-winning novel, Shining Girls. She plays journalist Kirby, who realizes that a modern day murder is somehow linked to her own personal childhood assault. Kirby’s reality continously shifts as she discovers just how interconnected she is with the killer.\nThe Long Game: Bigger Than Basketball\nApril 22, 2022 • 5 episodes • TV-14\nMakur Maker accepted a position at Howard University in 2020, becoming the first top 100 NBA draft prospect to commit to a historically Black college. This five-part docuseries covers what is behind behind Maker’s groundbreaking decision.\nThey Call Me Magic\nWatch Trailer • April 22, 2022 • 4 episodes\nWith intimate access to Earvin Johnson, and his friends and family, They Call Me Magic charts Johnson’s incredible career as an NBA basketball legend as well as his business and philanthropic impacts later after he retired from the game. The four part docuseries also examines Johnson’s HIV diagnosis and the effect it had on changing how the disease was perceived in worldwide culture.\nRoar\nWatch Trailer • Read Related Book • April 15, 2022 • 8 episodes\nRoar is an eight-part anthology series of genre-bending feminist fables, based on a novel of short stories by Cecelia Ahern. Cast includes Nicole Kidman, Alison Brie, Cynthia Erivo, Meera Syal and more.\nWeCrashed\nWatch Trailer • March 18, 2022 • 8 episodes\nJared Leto and Anna Hathaway star as Adam and Rebekah Neumann, in this limited series drama about the whirlwind rise and fall of WeWork. Based on insane real events, the series highlights the crazy and — often — unhinged decision-making at the top of the office space startup.\nThe Last Days of Ptolemy Grey\nWatch Trailer • Read Related Book • March 11, 2022 • 6 episodes\nSamuel L. Jackson (as the titular Ptolemy Grey) leads this six-part series about a man suffering with dementia. A miracle treatment restores Grey’s memories … but only for a month. With renewed vigor, Grey can finally right some wrongs of his past that he had previously forgotten all about.\nDear…\nWatch Season Two Trailer • March 4, 2022 • 2 seasons • TV-MA\nA documentary inspired by the Apple ad campaign ‘Dear’. The series finds people who have written letters to their heroes, expands on their stories and shows how everyone can be inspired. Famous faces featured include Lin-Manuel Miranda, Stevie Wonder, Oprah Winfrey and Spike Lee.\nLincoln’s Dilemma\nWatch Trailer • Read Related Book • February 18, 2022 • 4 episodes • TV-PG\nThis four-part docuseries explores the details and nuance in the story of former President Abraham Lincoln’s journey to end slavery. Using archival footage and interviews with scholars, journalists and educators, the series lays out a more complete view of an America struggling to reconcile issues of economy and race.\nSuspicion\nWatch Trailer • February 4, 2022 • 1 season\nFour suspects are at the center of an investigation into the abduction of an American businesswoman’s son. Suspicion follows the FBI as they down track the suspects and hunt for clues as to the perpetrator. The focus of doubt shifts across the series, as more information comes to light about each person’s whereabouts and motivations.\nSuspicion was cancelled after only one season.\nEl Deafo\nWatch Trailer • Read Related Book • January 7, 2022 • 3 episodes • TV-Y\nEl Deafo is a three-part animated story about Cece, who is somewhat isolated from other kids at school because of her need to wear hearing aids. But with the help of an alter ego ‘El Deafo’, she learns to treat her hearing aids as a superpower rather than a disability. Her increasing confidence helps her to make new friends.\nThe Line\nWatch Trailer • November 19, 2021 • 4 episodes • TV-MA\nThis docuseries explores the ambiguity of war, centering on the 2018 case in which US Navy platoon chief Eddie Gallagher was accused of war crimes. The show includes interviews with Gallagher as well as members of the team that reported him to authorities, and never-before-seen footage of the controversial mission in Mosul, Iraq.\nThe Shrink Next Door\nWatch Trailer • November 12, 2021 • 8 episodes\nPsychiatrist Ike Herschkopf (played by Paul Rudd) crosses ethical and moral boundaries to exploit the vulnerable patient Marty (played by Will Ferrell) for his own gain, slowly taking over his entire life. Based on a true story, dark comedy drama The Shrink Next Door exposes this wholly-dysfunctional relationship.\nSnoopy in Space\nWatch Season Two Trailer • November 12, 2021 • 2 seasons • TV-G\nSnoopy and Charlie Brown start a whole new adventure … in space. Follow Snoopy on his steps to becoming a NASA astronaut as the Peanuts gang explores the moon and beyond. Snoopy in Space is part of a wider Apple deal that includes Charlie Brown and Peanuts classics, and new original titles.\nDickinson\nWatch Season Three Trailer • Behind The Scenes • November 5, 2021 • 3 seasons • TV-MA\nIn a modern interpretation of Emily Dickinson’s life, Hailee Steinfeld stars as the misunderstood American poet in her coming-of-age story. Dickinson blends classical themes and carefully-crafted set pieces with anachronistic language and flair, personifications of Death, among other twists.\nDickinson ended with its third season on November 5, 2021.\nDr. Brain\nWatch Trailer • November 3, 2021 • 1 season\nApple’s first Korean drama is the six-part series Dr. Brain. The show features a daring brain scientist named Sewon. He discovers that the closest members of his family have mysteriously died. In an attempt to find closure, Sewon connects to their brains to try and uncover exactly what happened.\nDoug Unplugs\nWatch Trailer • September 17, 2021 • 2 seasons • TV-Y\nHave fun with Doug, the inquisitive robot, in this kids animated adventure series. Most robots spend their days downloading facts. Doug wants to explore the world. Doug Unplugs encourages children to always be curious, try out new activities, and learn more about Planet Earth.\nMr. Corman\nWatch Trailer • August 6, 2021 • 1 season\nJoseph Gordon-Levitt wrote, directs and stars in this ten-part series about a teacher who thinks he is stuck in a rut. The show explores Mr. Corman’s anxieties and his underlying musical ambitions, as he struggles to find happiness in the daily grind of life.\nMr. Corman was cancelled after the debut of its first season on August 6, 2021.\nWatch the Sound With Mark Ronson\nWatch Trailer • July 30, 2021 • 6 episodes\nMark Ronson reveals how musicians turn sound into music, specifically tackling how technology is changing the development of modern songs and soundtracks. This docuseries features interviews with Paul McCartney, Dave Grohl, Charli XCX and more.\nHome Before Dark\nWatch Season Two Trailer • June 11, 2021 • 2 seasons • TV-14\nBased on the true story of young investigative reporter Hilde Lysiak, Home Before Dark shows how a young girl uncovers a cold case that even her own family tried to hide. The appeal of the show spans generations, just like its cast.\nLisey’s Story\nWatch Trailer • Read Related Book • June 4, 2021 • 8 episodes • TV-MA\nWith all episodes written by Stephen King, Lisey’s Story is a deeply personal horror thriller. Following the death of her husband, Lisey, played by Julianne Moore, must confront her past relationship. The show blends real-world heartbreak and despair with supernatural encounters.\nThe Me You Can’t See\nWatch Trailer • May 21, 2021 • 6 episodes • TV-MA\nProduced by Oprah and Prince Harry, this docuseries tackles issues of mental health in modern society. It features interviews with people from all walks of life, united by the challenges and struggles of emotional well-being. Stars featured include Lady Gaga, Glenn Close and DeMar DeRozan.\n1971: The Year That Music Changed Everything\nWatch Trailer • Read Related Book • May 21, 2021 • 8 episodes • TV-MA\nThe music of 1971 reflected the political and cultural upheaval of the time. This docuseries explores the innovative artists and bands of the era, featuring John Lennon, Marvin Gaye, Tina Turner and more.\nTiny World\nWatch Trailer • April 16, 2021 • 2 seasons • TV-MA\nThis docuseries explores the life of living creatures at microscopic scale. Paul Rudd narrates stunning sequences of animals that are so, so, small. Tiny World features a variety of species and habitats, including the depths of the forest, the dry sands of the desert and the underwater biodiversity of the coral reef.\nEarth At Night In Color\nWatch Trailer • April 16, 2021 • 12 episodes • TV-MA\nWhat would be pitch black to human eyes, is revealed in full color in this innovative docuseries. The show used cutting-edge camera equipment to film animals going about their normal business, in the dead of night. Tom Hiddleston narrates.\nCalls\nWatch Trailer • March 19, 2021 • 9 episodes\nCalls is a strange addition to Apple’s lineup of originals, as it relies on audio for storytelling and features almost no visuals at all. Each episode features an eerie phone call conversation as a group of strangers simultaneously experience an apocalpytic event.\nLosing Alice\nWatch Trailer • January 22, 2021 • 8 episodes • TV-MA\nA fictional psychological thriller that follows Alice, a film director, as she becomes obsessed with a young screenwriter. The show examines how Alice succumbs to the allure of power and success.\nBecoming You\nWatch Trailer • November 13, 2020 • 1 season • TV-MA\nOlivia Colman narrates ‘Becoming You’, a docuseries covering the first 2000 days of 100 children’s lives. It features a wide variety of kids from an array of cultures and from all walks of life. The show highlights young people find their own way in the world, from their very first step.\nLong Way Up\nWatch Trailer • September 18, 2020 • 11 episodes • TV-14\nLong Way Up follows Ewan McGregor and Charley Boorman on a 100-day journey riding electric Harley-Davidson motorbikes. The show is about best friends travelling through Argentina, Bolivia, Peru and Mexico. The new trip is the latest installment in the Long Way franchise. Apple TV is also streaming the prior adventures, Long Way Down and Long Way Round.\nThe Oprah Conversation\nJuly 30, 2020 • 1 season • TV-14\nThe Oprah Conversation is the reincarnation of Oprah’s iconic talk show format. The interview format explores deep topics affeecting the world. In the opening episode, Oprah explores racism in culture, in conversation with Emmanuel Acho.\nThe Oprah Conversation ended after the release of its first and only season on July 30, 2020.\nLittle Voice\nWatch Trailer • July 10, 2020 • 1 season • TV-14\nFeaturing original music from Sara Bareilles, Little Voice charts the path of a fledgling music artist trying to make a name for herself in New York. Brittany O’Grady stars as Bess in this romantic tale as she finds her voice in the big city.\nLittle Voice was cancelled after only one season.\nDefending Jacob\nWatch Trailer • Buy on DVD/Blu-ray • Read Related Book • April 24, 2020 • 8 episodes • TV-MA\nDefending Jacob tells the story of a legal attorney whose teenage son has been accused of murder, based off the best-selling book of the same name. The story culminates with an epic twist that you can’t predict. The limited series stars Chris Evans, Jaeden Martell, and Michelle Dockery.\nOprah Talks COVID-19\nMarch 21, 2020 • 1 season • TV-PG\nAs everyone self-isolates, Oprah Winfrey hosts video conversations with noted doctors, scientists, recovering COVID-19 patients, and the health workers on the front line fighting this pandemic. Every episode is free to watch, no subscription required.\nOprah Talks COVID-19 ended after the release of its first and only season on March 21, 2020.\nAmazing Stories\nWatch Trailer • March 6, 2020 • 5 episodes • TV-PG\nA remake of the 1980’s classic sci-fi show, the Amazing Stories anthology series is produced by Steven Spielberg. Each episode follows a different tale in a completely different setting. With a family-friendly age rating, the series aims to appeal to parents and children alike.\nVisible: Out on Television\nWatch Trailer • February 14, 2020 • 5 episodes • TV-MA\nDescribed as a five-part documentary series, Visible looks at the portrayal and development of LGBTQ characters on television. It also examines the consequences of coming out in the television industry and how attitudes have evolved, albeit slowly.\nOprah’s Book Club\nNovember 1, 2019 • TV-14\nRenowned American talk show host Oprah Winfrey brings her famous Book Club to Apple TV. Every few months, Oprah records interviews with the author of her book picks at locations around the world.\nMovies\nEternity\nWatch Trailer • February 13 • Romance • PG-13\nIn this romantic comedy, Joan must choose how to spend her eternity in the afterlife. Does she pick the man she was married to for 65 years, or does she pick her first love, who died young and has been waiting for her soul to arrive for years? The film stars Elizabeth Olsen, Miles Teller, and Callum Turner.\nF1 The Movie\nWatch Trailer • December 12, 2025 • Action • PG-13\nF1: The Movie lands on Apple TV after a successful theatrical run, grossing over $600m at the worldwide box office. Sonny Hayes (Brad Pitt) comes out of retirement to help a backmarker team win a race to secure their future in F1. With extensive filming taking place at real race weekends during the 2023-2024 season, the movie effectively integrates the fictional APX GP team into the sport, featuring cinematic visuals and driver cameos throughout.\nThe Family Plan 2\nWatch Trailer • November 21, 2025 • Comedy • PG-13\nApple’s popular action comedy movie starring Mark Wahlberg has gotten a sequel. This time, Dan has arranged a perfect vacation for the holidays. But Dan’s past catches up to him once more, unravelling into an international caper of car chases, bank robberies and family hijinks.\nCome See Me in the Good Light\nWatch Trailer • November 14, 2025 • Documentary • TV-MA\nThis is a poignant documentary about poet Andrea Gibson who is facing a terminal ovarian cancer diagnosis, and her relationship with partner Megan Falley. It serves as a compassionate reflection of life, love and loss during our time on Earth.\nStiller & Meara: Nothing is Lost\nWatch Trailer • October 24, 2025 • Documentary\nBen Stiller presents this new documentary ostensibly about his parents, that also reveals much about his own personal influences, with Jerry Stiller and Anne Meara’s comedic backgrounds naturally percolating down to the next generation.\nThe Lost Bus\nWatch Trailer • Read Related Book • October 3, 2025 • Drama • R\nMatthew McConaughey plays Kevin McKay, in this dramatically tense retelling of the choices made by a school bus driver during the 2018 California wildfires. As the fire rages, McKay wants to find his family, but ultimately decides to drive his bus into the inferno in order to save the lifes of 22 trapped children.\nAll of You\nWatch Trailer • September 26, 2025 • Romance • R\nThe unspoken feelings between Laura (Imogen Poots) and Simon (Brett Goldstein) become even more complicated, when Laura takes a test that promises to reveal her life soulmate. This intimate film blends romance and comedy as the pair discover what true love really means.\nHighest 2 Lowest\nWatch Trailer • September 5, 2025 • Thriller • R\nDenzel Washington stars in this thriller as David King, a high-profile music mogul. When his son is seemingly kidnapped, he is eager to simply pay the $17 million ransom demands. However, when it turns out that the criminal has actually taken his son’s friend by mistake, David faces a moral dilemma.\nEcho Valley\nWatch Trailer • June 13, 2025 • Thriller • R\nIn this tense thriller revolving around the strained relationship of mother and daughter, Claire (Sydney Sweeney) turns up at her mother’s house covered in someone else’s blood. Their bond prevails, and Kate (Julianne Moore) will do just about anything to protect her child from harm.\nBono: Stories Of Surrender\nWatch Trailer • Read Related Book • May 30, 2025 • Documentary • TV-MA\nBono tells intimate stories about his career, family, and friends in this intimate portrayal of the eponymous one-man stage show. The documentary also features Bono performing a variety of iconic U2 songs from his illustrious career.\nFountain of Youth\nWatch Trailer • May 23, 2025 • Action • PG-13\nIn this adventure caper, John Krasinki and Natalie Portman play two estranged siblings who team up to try and find the mythical Fountain of Youth. The film follows the pair on their journey as they encounter various obstacles in their pursuit for immortality.\nDeaf President Now!\nWatch Trailer • May 16, 2025 • Documentary • TV-MA\nAt Gallaudet University in 1988, the board select a hearing president, overlooking several highly-qualified Deaf candidates. This documentary explores the historic protests and boycotts that ensued as a result of the decision, which ultimately lead to the appointment of dean Dr. I. King Jordan as the university’s first Deaf president, marking a key moment in the history of civil rights.\nNumber One on the Call Sheet\nWatch Trailer • March 28, 2025 • Documentary • TV-MA\nFeaturing a swathe of leading Black men and women in Hollywood, the two-part documentary interviews actors about their place in the industry, the various challenges they faced in their career, and what it felt like when they finally did become top of the call sheet.\nThe Gorge\nWatch Trailer • February 14, 2025 • Thriller • PG-13\nMiles Teller and Anya Taylor-Joy star as guards who are appointed to watchtowers on opposites side of the mysterious gorge. While the pair keep watch to protect the world from its evil contents, they send messages back and forth to each other and bond over their shared experiences.\nFly Me To The Moon\nWatch Trailer • December 6, 2024 • Comedy\nIn this rom-com set against the backdrop of the 1960s space race, marketing exec Kelly Jones (Scarlett Johansson) is tasked by the White House to fix NASA public’s reputation. Faced with the prospect that the Apollo 11 mission may not succeed, Jones is ordered to stage a fake moon landing as a backup. In the process, she locks horns with launch director Cole Davis (Channing Tatum) who is trying to get the actual spaceship off the ground.\nBlitz\nWatch Trailer • November 22, 2024 • Drama • PG-13\nSteve McQueen presents his take on a war odyssey, starring Saoirse Ronan as Rita. Rita sends her 9-year-old son, George, away to safety in the countryside while London is besieged by bombing during the Blitz. But George is determined to return home.\nBread & Roses\nWatch Trailer • November 22, 2024 • Documentary • TV-14\nExecutive produced by Malala, this harrowing documentary follows three Afghan women as they fight to protect their rights, in the aftermath of the fall of Kabul to the Taliban in 2021. The film is a sobering depiction of just how fragile ‘freedom’ can be.\nThe Last of the Sea Women\nWatch Trailer • October 11, 2024 • Documentary\nProduced by Malala, this documentary film spotlights the haenyeo divers of South Korea’s Jeju Island. They dive to the bottom of the ocean floor to harvest seafood to sell and eat. Youth and elders join together in a story of friendship, independence and empowerment.\nWolfs\nWatch Trailer • September 27, 2024 • Action\nGeorge Clooney and Brad Pitt play lone wolf fixers in this action comedy movie. The pair are forced to work together to cover up a crime whos scope keeps getting bigger and bigger, over the course of one long night.\nThe original feature is directed and written by Jon Watts. Wolfs was originally scheduled for a wide theatrical release in cinemas, but Apple changed plans at the last minute, and the film became an exclusively streaming affair.\nNapoleon: The Directors Cut\nWatch Trailer • August 29, 2024 • Drama • R\nRidley Scott proffers an extended cut of his historical epic Napoleon, also streaming on Apple TV. The Directors Cut includes 48 minutes of additional footage, diving deeper into Josephine’s origin story as well as Napoleon’s failed invasion of Russia.\nThe Instigators\nWatch Trailer • August 9, 2024 • Action • R\nThis action-comedy features Matt Damon and Casey Affleck as partners in crime. They play Rory and Cobby, who plot to rob a corrupt politican of his ill-gotten gains. When the heist goes wrong, they try to scarper, finding themselves chased by the police and the city’s crime bosses who are seeking retribution.\nFancy Dance\nWatch Trailer • June 28, 2024 • Drama • R\nJax (Lily Gladstone) has been caring for her niece Roki (played by Isabel Deroy-Olson) since her sister’s mysterious disappearance. Jax and Roki embark on a road trip to find answers, meanwhile Roki’s grandfather presents a troubling custody battle. The movie portrays the nuances of life as indigenous women in a colonized world against the backdrop of a failed justice system.\nArgylle\nWatch Trailer • Read Related Book • April 12, 2024 • Action • PG-13\nThe twisty spy drama Argylle sees fictional author Elly Conway caught up in the world of espionage, as she discovers that stories she wrote in her books actually happened. Bryce Dallas Howard and Sam Rockwell lead the film, with a supporting cast that includes Henry Cavill, Catherine O’Hara, Bryan Cranston, John Cena and Dua Lipa.\nGirls State\nWatch Trailer • April 5, 2024 • Documentary\nFrom the same directors as the acclaimed Apple Original Film ‘Boys State’, ‘Girls State’ brings the female perspective to the mock government experiment. The movie follows a group of Missouri teenage girls, from various backgrounds and social classes, as they consider their unique approaches to running a political career.\nSTEVE! (martin) a documentary in 2 pieces\nWatch Trailer • March 29, 2024 • Documentary\nSteve Martin’s life is the subject of this documentary by Morgan Neville, unusually told in two feature-length parts, each with different styles of filmmaking. “Then” covers Martin’s early life with the usual fare of archive footage, whereas the second part “Now” takes a more conversational approach with Martin himself leading the story.\nNapoleon\nWatch Trailer • March 1, 2024 • Drama • R\nJoaquin Phoenix stars as Napoleon Bonaparte, in Ridley Scott’s latest historical epic. The film features stunning depictions of six significant battles in Napoleon’s military career, interspersed with insights into his personal life, rise to power, and his complex relationship with wife Josephine (played by Vanessa Kirby).\nKillers of the Flower Moon\nWatch Trailer • Read Related Book • January 12, 2024 • Drama • R\nDirected by Martin Scorsese, Killers of the Flower Moon explores the unspeakable crimes against the Osage Nation, in a conquest for oil riches. Leonardo DiCaprio, Lily Gladstone, Robert De Niro and Jesse Plemons star in this three-hour crime western epic.\nThe Family Plan\nWatch Trailer • December 15, 2023 • Comedy • PG-13\nMark Wahlberg stars as Dan Morgan in this action comedy film. Dan is living comfortably with his family, having withheld the fact that he was once a career assassin. When he realizes that he has been located by someone that wants him dead, he takes his family on a ‘road trip’ to Las Vegas to try and end it once and for all. His cover is blown, and his family is now along for the ride.\nFingernails\nWatch Trailer • November 3, 2023 • Drama • R\nJessie Buckley, Riz Ahmed, and Jeremy Allen White star in this sci-fi romantic drama. This film explores what happens in a world where the compatibility of couples can be tested for. Anna (Buckley) and Ryan (White) are told they are a perfect match for each other, but Anna isn’t so sure. She forges a new love interest with Amir (Ahmed), a co-worker at the love testing institute\nThe Pigeon Tunnel\nWatch Trailer • October 20, 2023 • Documentary • PG-13\nWriter of Tinker Tailor Soldier Spy and other espionage fiction, John le Carré’s life is brought to the fore in this insightful film, directed by award-winning documentarian Errol Morris. The film explores the throughline between le Carre’s relationship with his father, and the themes explored in his written work.\nFlora and Son\nWatch Trailer • September 29, 2023 • Drama • R\nFlora (Eve Hewson) attempts to get her wayward son, Max, a meaningful hobby. With the help of a second-hand acoustic guitar and the teachings of an LA musican (Joseph Gordon-Levitt), Flora and Max’s connection deepens.\nThe Beanie Bubble\nWatch Trailer • July 28, 2023 • Drama • R\nZach Galifianakis, Elizabeth Banks, Sarah Snook, and Geraldine Viswanathan star in this retelling of the late 90s Beanie Babies craze. The film shows who came up with the smart business strategy that helped keep the hype train moving, and who took credit for it.\nStephen Curry: Underrated\nWatch Trailer • July 21, 2023 • Documentary\nFrom Apple and A24, this documentary explores the rise of Stephen Curry in the world of basketball, charting his course from an unknown college player to a four-time NBA champion. The film features a mix of exclusive interviews and new fly-on-the-wall footage.\nStill: A Michael J. Fox Movie\nWatch Trailer • May 12, 2023 • Documentary • R\nMichael J. Fox tells his story in this documentary that cleverly blends scripted elements, new interviews, and archive footage. As well as showcasing his rise to stardom in the 1980s, the film uncovers his private journey battling Parkinson’s disease, having been diagnosed at just 29 years old.\nGhosted\nWatch Trailer • April 21, 2023 • Action • PG-13\nCole (Chris Evans) is infatuated by Sadie (Ana de Armas) in this rom-com action thriller. Before he can get a second date, he learns that Sadie is actually an undercover secret agent and is caught up in an international espionage mission.\nTetris\nWatch Trailer • March 31, 2023 • Thriller • R\nStarring Taron Egerton as Henk Rogers, the movie Tetris is a dramatic retelling of the story behind acquiring the distribution rights for Tetris. Rogers must collaborate with Tetris’s Russian inventor, Alexey Pajitnov, to secure the deal amid a tense Cold War environment.\nSharper\nWatch Trailer • February 17, 2023 • Drama • R\nMax hunts larger ill-gotten gains and plots to scam the New York elite, in a proposed heist of epic proportions — but will his greed backfire? Julianne Moore, Sebastian Stan, John Lithgow and more star in this twisty thriller.\nEmancipation\nWatch Trailer • December 9, 2022 • Drama • R\nWill Smith stars as Peter, a slave who takes it upon himself to flee his captor, escaping his life of cruelty in the hopes of returning to his family. He traverses the dangers of the Louisana swamps as part of his journey to freedom. The film is inspired by the famous photos of ‘Whipped Peter’, whose depiction of Peter’s brutal lashings helped accelerate the emancipation movement in the US.\nSpirited\nWatch Trailer • November 18, 2022 • Musical\nWill Ferrell, Ryan Reynolds and Octavia Spencer star in this modernized, musical, comedic reimagining of A Christmas Carol. In this adaptation of the iconic Charles Dickens tale, it is the Ghost of Christmas Present (Ferrell) that reflects on his own past, present and future.\nSelena Gomez: My Mind & Me\nWatch Trailer • November 4, 2022 • Documentary • R\nMental health is the focus in this documentary on Selena Gomez, who shot to fame as a child star on the Disney Channel. Using footage filmed across the last six years of her life, the Emmy-nominated actress intimately reveals her struggles with lupus and bipolar disorder.\nCauseway\nWatch Trailer • November 4, 2022 • Drama • R\nJennifer Lawrence stars as a soldier, Lynsey, who has just returned from the warzone of Afghanistan. She is dealing with the aftermath of a traumatic brain injury she sustained in the field. Lynsey bonds with James (played by Brian Tyree Henry).\nLouis Armstrong’s Black & Blues\nWatch Trailer • October 28, 2022 • Documentary • R\nBlack & Blues is a feature-length documentary on Louis Armstrong, one of the most influential figures in jazz music. Using archive footage and never-before-heard home recordings, the film presents intimate insights into the mind of the culture-defining musician.\nRaymond & Ray\nWatch Trailer • October 21, 2022 • Drama\nHalf-brothers Raymond (Ewan McGregor) and Ray (Ethan Hawke) must come together to fulfill their estranged father’s final wish following his death: to have them dig his grave. In inviting guests to his funeral, they discover that their dad treated his friends very differently to how he treated them.\nThe Greatest Beer Run Ever\nWatch Trailer • Read Related Book • September 30, 2022 • Drama • R\nBased on the incredible true story, Zac Efron stars as Chickie, who takes it upon himself to travel to the front lines of the Vietnam war, to give allied soldiers a little bit of hope — and a can of beer. Upon arriving at the trenches, Chickie is forced to confront the harsh realities of war. The film also stars Russell Crowe, with Bill Murray in a supporting role.\nSidney\nWatch Trailer • September 23, 2022 • Documentary • PG-13\nThe life of Sidney Poitier is explored in this documentary film, produced by Oprah Winfrey in collaboration with the Poitier family. Poitier’s legacy is brought to life with archive footage and interviews with Denzel Washington, Halle Berry, Barbra Streisand and more.\nLuck\nWatch Trailer • August 5, 2022 • Animation • TV-Y\nThe unluckiest person ever, Sam Greenfield, journeys into a secret world where magical creatures manage the good luck and bad luck experienced on Earth. Sam’s arrival threatens the balance of fortune, and chaos ensues. Luck’s voice cast features Eva Noblezada, Simon Pegg, Jane Fonda, Whoopi Goldberg and more.\nCha Cha Real Smooth\nWatch Trailer • June 17, 2022 • Drama\nCooper Raiff wrote, produces, directs, and stars in this Sundance award-winning film. In Cha Cha Real Smooth, Andrew is a wayward unemployed young man working as a Bar Mitzvah party starter. He strikes up a friendship with Domino (Dakota Johnson) and her autistic daughter, Lola at one of these parties — beginning a very unconvential love story.\nThe Sky Is Everywhere\nWatch Trailer • Read Related Book • February 11, 2022 • Drama\nBased on the novel by Jandy Nelson, The Sky is Everywhere tells the story of Lennie Walker, who is struggling with grief following the death of her older sister. Lennie navigates love and loss as she meets Joe Fontaine, the new guy at school, and is inspired to write a song of her very own.\nThe Tragedy of Macbeth\nWatch Trailer • January 14, 2022 • Drama • R\nDenzel Washington and Frances McDormand lead a bold black-and-white adaptation of the Shakespeare classic. Joel Coen’s interpretation retains much of the original dialogue, albeit abridged to keep the story lean and focused. The stunning sets are stark and geometric, with clear German Expressionism influences, evoking the tone of a classical stage setting whilst still feeling impressively cinematic.\nSwan Song\nWatch Trailer • December 17, 2021 • Drama • R\nStarring Mahershala Ali, Swan Song explores the ultimate dilemma: would you let a clone take your place? Ali’s character, Cameron, is tragically diagnosed with a terminal illness. But, in the near-future sci-fi setting, Cameron has the opportunity to replace himself with a perfect, healthy, human clone. The catch is that he cannot tell his family what he has done. Cameron struggles with the ramifications of this heart-breaking choice, learning much about love and life along the way.\n‘Twas the Fight Before Christmas\nWatch Trailer • November 25, 2021 • Documentary\nJeremy Morris is perhaps the only person who has been banned by a federal court from putting up Christmas decorations. This documentary film shows the extreme lengths Morris will go to celebrate the holiday season, and the neighborhood’s less-than-welcoming response to a Christmas bonanza taking place on the driveway of his North Idaho home.\nFinch\nWatch Trailer • November 5, 2021 • Drama • PG-13\nTom Hanks stars as the eponymous inventor, who is one of the last human survivors in this post-apocalyptic world. Finch builds a robot to keep him — and his beloved dog — company as they embark on a cross-country expedition in increasingly harsh conditions.\nThe Velvet Underground\nWatch Trailer • October 15, 2021 • Documentary • TV-MA\nTodd Haynes brings a refined perspective on a genre-defining rock band in The Velvet Underground. Leaning heavily on the cinematic language of the ’60s — such as montage and split screen compositions — the film is far from a standard run-of-the-mill rock documentary.\nCome From Away\nWatch Trailer • Read Related Book • September 10, 2021 • Drama • TV-14\nThe Come From Away musical tells the story of the small town of Gander, who generously opened their doors to more than 7,000 people who found themselves stranded in the wake of the 9/11 attacks. They would go on to develop long-lasting bonds and friendships. This filmed version of the musical features many original Broadway cast members, and was performed to an audience of 9/11 survivors and front-line workers.\nCODA\nWatch Trailer • August 13, 2021 • Drama • PG-13\nRuby, played by actress Emilia Jones, is the only hearing person in her family. She has grown up helping out, and generally acting as interpreter, for her deaf parents. In this heartwarming and hilarious film, Ruby discovers a passion and a talent for singing. She must reconcile her new-found career ambitions with her family commitments.\nCODA premiered at the 2021 Sundance film festival and took home the grand jury prize for drama. Following positive audience reception and critical acclaim, the film ultimately won the prestigious Best Picture award at the 2022 Oscars.\nWho Are You, Charlie Brown?\nWatch Trailer • June 25, 2021 • Documentary\nFeaturing interviews with people that worked with him and were inspired by him, this documentary explores the life of Charles Schulz, creator of Charlie Brown. It shows how Schulz became interested in cartoons and how that evolved into the development of the Peanuts series. The film interweaves a new Peanuts animation featuring Charlie Brown and the gang tackle the question of ‘who are you?’ in a school essay.\nFathom\nWatch Trailer • June 25, 2021 • Documentary • TV-PG\nDr Michelle Fournet wants to prove that whales identify each other by sound and Dr Ellen Garland aims to show how whalesong is not so dissimilar to human speech. Fathom centers on the intricacy of scentific research. It also highlights how the scientists readjust to normal life, after spending months dedicated to observing one species of animal.\nThe Year Earth Changed\nWatch Trailer • April 16, 2021 • Documentary • PG\nThe year of human quarantine allowed wildlife flourished in unexpected and profound ways and The Year Earth Changed explores 2020 from the perspective of the natural world. David Attenborough narrates this fascinating documentary film, featuring scenes such as the penguin takeover of Cape Town and the appearance of whales in Glacier Bay.\nCherry\nWatch Trailer • Read Related Book • March 12, 2021 • Drama • R\nTom Holland stars as Cherry, in this hard-hitting drama feature directed by the Russo brothers. After joining the army at a young age, Cherry falls into the depths of heroin addiction. He becomes a bank robber to service his cravings, with the film examining the real impact of the opoid crisis in America.\nBillie Eilish: The World’s A Little Blurry\nWatch Trailer • February 26, 2021 • Documentary • R\nA documentary film depicting the meteoric rise of Billie Eilish’s career. Recorded mostly in 2019, the film shows the artist’s triumphs and personal struggles as she crafts her debut album. An album so successful that it lands her five Grammy wins, at the age of eighteen.\nPalmer\nWatch Trailer • January 29, 2021 • Drama • R\nJustin Timberlake stars as Eddie Palmer, who has just completed a 12 year prison sentence. Palmer’s neighbor disappears, leaving him in the care of her 7 year old son Sam. As the pair develop a close bond, Palmer’s past comes back to haunt the relationship.\nWolfwalkers\nWatch Trailer • Buy on DVD/Blu-ray • Read Related Book • December 11, 2020 • Animation • PG\nWolfwalkers is the latest installment from Irish animation studio Cartoon Saloon. A young hunter, Robyn, comes to Ireland and discovers the magical world of the Wolfwalkers, after originally intending to exterminate the last remaining wolf pack. The film tells an enchanting folklore tale and received glowing reviews from critics, including an Oscar nomination for best animated feature.\nFireball: Visitors From Darker Worlds\nWatch Trailer • November 13, 2020 • Documentary • TV-MA\nFireball is a documentary film about the human response to meteorites and shooting stars, or more cryptically the ‘visitors from darker worlds’. Werner Herzog explores how these happenings have shaped human culture and beliefs.\nOn The Rocks\nWatch Trailer • Buy on DVD/Blu-ray • October 23, 2020 • Comedy • R\nOn The Rocks stars Rashida Jones and Bill Murray, in a romantic comedy film directed and written by Sophia Coppola. Jones’ character, Laura, suspects her husband might be having an affair. On the Rocks is a light-hearted and fun caper to find out the truth.\nBruce Springsteen’s Letter to You\nWatch Trailer • October 22, 2020 • Documentary • TV-PG\nA documentary showcasing the creative process of Bruce Springsteen and the E Street Band, as they record their new album ‘Letter to You’. The film includes 10 final take performances from the album.\nBoys State\nWatch Trailer • August 14, 2020 • Documentary • PG-13\nAn illuminating documentary following the 2018 Boys State in Texas, providing a fascinating insight into the machinations of politics. Boys State won the Grand Jury prize at the Sundance festival.\nGreyhound\nWatch Trailer • Read Related Book • July 10, 2020 • Action • PG-13\nA cinematic World War II naval thriller starring Tom Hanks. Hanks play Krause, a commander on his maiden voyage to escort a convoy of merchant Allied ships across the North Atlantic. The film follows their quest as they face the German submarines trying to stop them in their tracks.\nDads\nWatch Trailer • June 19, 2020 • Documentary • PG\nA documentary about the father relationship in a family. The 80-minute movie starts with interviews with famous faces but pivots into an exploration of how fathers in ordinary families are dealing with the many stresses of life.\nBeastie Boys Story\nWatch Trailer • Read Related Book • April 24, 2020 • Documentary • TV-MA\nThe Beastie Boys Story takes a personal look at the band’s highs and lows over the last 40 years. The documentary is narrated by band members Mike Diamond and Adam Horvitz, in an intimate live theater setting, and directed by the award-winning Spike Jonze.\nThe Banker\nWatch Trailer • March 20, 2020 • Drama • PG-13\nBased on a true story, the movie follows two businessmen who take on the oppressive racial climate of the 1960s by pretending to be just a janitor and chauffeur, whilst they secretly grow their business empire.\nHala\nWatch Trailer • December 6, 2019 • Drama • R\nHala puts the spotlight on a teenager attempting to balance the innate freedoms of teenage life with her traditional Muslim upbringing. A secret romance could split the family relationship altogether.\nThe Elephant Queen\nWatch Trailer • November 1, 2019 • Documentary • TV-PG\nA documentary spanning footage shot over four years of an elephant herd traveling across Africa. The film centers around the matriarch Athena but also pays attention to other animal species encountered along the way.\nSports\nMajor League Soccer\nStarting in 2026, watch all Major League Soccer games, with no blackouts or geographic restrictions, exclusively on the Apple TV app at no extra charge. MLS season ticket holders even get a free subscription as a perk of their membership.\nMLB Friday Night Baseball\nHow to Watch\nApple has partnered with the MLB to offer a doubleheader of two live baseball games, every Friday of the regular season, exclusively for Apple TV subscribers. Apple also streams ‘MLB Big Inning’, a daily live show featuring game highlights. You can also watch a 24/7 stream of MLB replays, historic games and more content.\nShorts and Specials\nThe First Snow of Fraggle Rock\nWatch Trailer • December 5, 2025 • Kids • TV-G\nIt’s winter at Fraggle Rock, and all the Fraggles can’t wait to make snow angels and have snowball fights. But when only a single snowflake falls from the sky, they are left disappointed. Gobo ventures out to the human world to find some inspiration for Christmas cheer.\nSnoopy Presents: A Summer Musical\nWatch Trailer • August 15, 2025 • Animation • TV-G\nCelebrating the fun of summer camp, Peanuts presents its first original musical special in more than 35 years. Charlie Brown is trying to make his last year of camp the best it can be. Meanwhile, Snoopy and Woodstock find a mysterious map and hunt for hidden treasure.\nLulu is a Rhinoceros\nWatch Trailer • Read Related Book • May 30, 2025 • Kids • TV-Y7\nLulu is a bulldog-presenting rhino, who wants to spread kindness and joy with everyone she meets. This animated special elegantly explores matters of expression and identity, following Lulu on an adventure packed with catchy songs and beautifully rendered visuals.\nA Carpool Karaoke Christmas\nWatch Trailer • December 16, 2024 • Holiday\nJoin Zane Lowe as he goes on a trio of carpools with pop divas Dua Lipa, Chappell Roan, and Lady Gaga. Expect sing-alongs to pop hits and holiday classics as they travel around Japan, Missouri and Los Angeles.\nThe Bloody Hundredth\nWatch Trailer • March 15, 2024 • Documentary\nNarrated by Tom Hanks, documentary The Bloody Hundredth serves as a companion piece to the dramatization of events in Masters of the Air. In this one-hour special, viewers find out the real-life stories of several airmen in the 100th Bomb Group.\nSnoopy Presents: Welcome Home, Franklin\nWatch Trailer • February 16, 2024 • Kids • TV-G\nIn this original Peanuts special, the beloved character of Franklin Armstrong is given a backstory for the first time. Franklin depends on a notebook containing his grandfather’s advice on friendship. After a few false starts fitting in, Franklin and Charlie Brown work together to make a car to race in the town’s Soap Box Derby.\nHannah Waddingham: Home for Christmas\nWatch Trailer • November 22, 2023 • Holiday • TV-PG\nHannah Waddingham stars in a musical extravaganza holiday special, filmed at the London Coliseum. Singing iconic Christmas classics to a rapturous crowd, Waddingham is joined by special guests including Leslie Odom Jr., Luke Evans, Sam Ryder, and surprise appearances from her Ted Lasso co-stars.\nThe Velveteen Rabbit\nWatch Trailer • Read Related Book • November 22, 2023 • Kids • TV-G\nBased on the beloved children’s book by Margery Williams, The Velveteen Rabbit comes alive in this holiday special. Combining animation and live action, William gets a new toy for Christmas, a woven rabbit doll. The rabbit magically comes alive and the pair go on a wondrous adventure.\nSnoopy Presents: One-of-a-Kind Marcie\nWatch Trailer • August 18, 2023 • Kids • TV-Y\nThis Snoopy special sees introvert Marcie in the running for class president. She has a bunch of great ideas to improve lunchtimes, but lacks the confidence to be in the spotlight. She finds a way to express her ideas — to great effect — without taking all of the attention.\nApple Music Live\nIn collaboration with Apple Music, Apple TV streams live concerts from some of the biggest artists in music. The series debuted with a performance by Ed Sheeran, premiering tracks from his new album, Subtract.\nThe Boy, the Mole, the Fox and the Horse\nWatch Trailer • Read Related Book • December 25, 2022 • Animation • TV-G\nCharlie Mackesy’s book is brought to life in this carefully-crafted Christmas Day special, featuring beautiful hand-drawn animation. Four unlikely friends team up on an inspiring journey of exploration.\nSnoopy Presents: Lucy’s School\nWatch Trailer • August 12, 2022 • Kids • TV-Y\nLucy is worried about starting at a new school in the fall, so she decides to start her own instead. The Peanuts gang enroll as her students. However, Lucy soon learns that running a school is easier said than done. The new Peanuts special debuts in time for back-to-school season and pays respect to the important role of teachers in children’s lives.\nSnoopy Presents: To Mom (and Dad), With Love\nWatch Trailer • May 6, 2022 • Kids • TV-Y\nIn the latest Charlie Brown special for Apple TV, Peppermint Patty grew up with a mother, so she isn’t quite as excited for Mother’s Day as everyone else. However, the Peanuts gang help to make her see that the day celebrates all kind of families too.\nSnoopy Presents: It’s the Small Things, Charlie Brown\nWatch Trailer • April 15, 2022 • Holiday • TV-Y\nIn this brand new animated special, Charlie Brown looks to see how he can best make a positive impact on the environment. Starring Snoopy and all your favorite Peanuts characters, It’s The Small Things aired to help celebrate Earth Day 2022.\nSnoopy Presents: For Auld Lang Syne\nWatch Trailer • December 10, 2021 • Holiday\n‘For Auld Lang Syne’ is a brand new Peanuts holiday special, featuring Charlie Brown, Snoopy and the gang. In this special, Lucy tries to arrange the best New Year’s Eve party ever to make up for a somewhat disappointing Christmas.\nMariah’s Christmas: The Magic Continues\nDecember 3, 2021 • Holiday • TV-G\nMariah Carey returns to Apple TV in a more subdued affair than her 2020 special. It features an exclusive performance of her new holiday song ‘Fall in Love at Christmas’, featuring Khalid and Kirk Franklin, as well as an interview with Zane Lowe.\nBlush\nWatch Trailer • October 1, 2021 • Animation\nThis beautiful short film follows the journey of a nature-loving astronaut who is stranded on a small, desolate, planet. The astronaut visibly blushes at the arrival of a friendly, pink, alien lifeform.\n9/11: Inside the President’s War Room\nWatch Trailer • September 1, 2021 • Documentary • TV-14\nThis documentary special features exclusive access to the highest-level of decison makers in the aftermath of the 9/11 terrorist attack, including interviews with President George W. Bush and his chief of staff, as they break down — minute-by-minute — the government response to the events of that terrible day.\nMariah Carey’s Magical Christmas Special\nWatch Trailer • December 4, 2020 • Holiday • TV-G\nMariah Carey leads a holiday celebration spectacular, featuring original performances of a dozen Christmas classics. The special includes the debut performance the new holiday track ‘Oh Santa’, sung by Carey, Ariana Grande and Jennifer Hudson.\nHelpsters Help You\nApril 23, 2020 • 6 episodes • TV-G\nShot on iPhone during the pandemic, Cody the monster broadcasts from the Helpsters workshop to demonstrate how it is still possible to learn, play, and have fun whilst stuck at home. Band Grouplove join Cody for a special celebration to thank all the people helping to keep others safe and healthy.\nFraggle Rock: Rock On!\nWatch Trailer • April 21, 2020 • 6 episodes • TV-G\nThe classic Fraggle Rock puppet show returns with a new series of shorts that show how friendship can bind us all. Amidst coronavirus lockdown measures, ‘Fraggle Rock: Rock On’ is recorded in the homes of the production team, shot on iPhone 11.\nHere We Are: Notes for Living on Planet Earth\nWatch Trailer • Read Related Book • April 17, 2020 • Kids • TV-G\nAn animated short film that follows a young boy learning about wonders of nature, in celebration of Earth Day. The story is based on the best-selling book by Oliver Jeffers. The film is narrated by Meryl Streep.\nPeanuts in Space: Secrets of Apollo 10\nMay 18, 2019 • Kids • TV-G\nPeanuts celebrates the 50th anniversary of the moon landing in this live-action mockumentary revealing Snoopy as the fourth member of the Apollo 10 mission, also starring Jeff Goldblum and Ron Howard.\nComing Soon to Apple TV\n- The Last Thing He Told Me Season Two: February 20 — Read the Book\n- Monarch: Legacy of Monsters Season Two: February 27\n- Imperfect Women: March 18\n- For All Mankind Season Five: March 27 — Listen to Podcast\n- Your Friends & Neighbors Season Two: April 3\n- Outcome: April 10\n- Margo’s Got Money Troubles: April 15\n- Criminal Record Season Two: April 22\n- Widow’s Bay: April 29\n- Maximum Pleasure Guaranteed: May 20\n- Cape Fear: June 5\n- Sugar Season Two: June 19\n- Lucky: July 15\n- The Dink: July 24\n- Matchbox: The Movie: October 9\n- Way of the Warrior Kid: November 20\n- The Savant: TBA — Watch Trailer\nBack Catalog Content\nApple TV is focused on producing new TV shows and movies, which means exclusive originals make up the vast majority of the available content. However, the service includes a handful of older titles to stream: ‘Fraggle Rock’, ‘Long Way Round’, ‘Long Way Down’, ‘It’s the Great Pumpkin, Charlie Brown’, ‘A Charlie Brown Thanksgiving’, ‘A Charlie Brown Christmas’, ‘Happy New Year, Charlie Brown’, ‘Be My Valentine, Charlie Brown’, ‘It’s the Easter Beagle, Charlie Brown’, ‘It’s Christmastime Again, Charlie Brown’, ‘The Peanuts Classics’, ‘Charlie Brown’s Christmas Tales’, ‘I Want a Dog for Christmas, Charlie Brown’, ‘Yo Gabba Gabba!’ and ‘Wonder Pets’.\nThese classics are now airing on Apple TV as Apple has reached deals to make new seasons, or reboot the franchise entirely, so the older episodes are made available for customers to catch up.\nMore Coming to Apple TV\nThat’s a total of 319 TV shows and films to watch on Apple TV. Apple has a lot more originals in development, with new content being added every couple of weeks. We’ll keep this post updated with the latest official announcements of new Apple TV content.\nFTC: We use income earning auto affiliate links. More.",
  "word_count": 19648,
  "scraped_at": "2026-02-14T02:10:58.961020",
  "_text_extracted": true
}