{
  "article_id": "85fbca955fe7",
  "url": "https://english.news.cn/20240620/35b021ff35924c84843e73c1ae212c1f/c.html",
  "title": "Germany leader Toni Kroos says euphoria is flushing Euro 2024 hosts - Xinhua",
  "date": "20240620T143000Z",
  "domain": "english.news.cn",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "by Oliver Trust\nBERLIN, June 20 (Xinhua) -- Toni Kroos isn't known for getting easily taken away by emotions. The Real Madrid midfielder and six-time UEFA Champions League winner much more stands for a pragmatic approach when it comes to football.\nThis time the 34-year-old in the Stuttgart Arena seemed to throw all his natural reluctance overboard. \"I feel there is something big growing; I feel something is happening,\" the tournament hosts' undisputed leader said after securing Germany's last-16 participation after two group victories.\nAs a fact, following a 2-0 over Hungary, a wave of euphoria is flushing through Germany as a tenth of thousands of fans celebrates.\nPacked fan zones in Berlin, Munich, Hamburg, Stuttgart, Cologne, and Leipzig give proof of a country having caught fire when it comes to the performance of its national team at the 2024 UEFA Euro tournament.\nNever in its history, a German team has scored seven goals in the group stage. After years of drought coming along with early group exits in several major tournaments, the mood around the national team has been near to enthusiasm at present.\nThe country's big cities might only be an example of various locations, experiencing football parties while fans start to dream about the big shot.\n45,000 supporters among the crowd of 60,000 turned the Stuttgart Arena into a party zone. Loudspeakers spew out the song \"Success isn't only luck\" while Julian Nagelsmann's team went on celebrating round on the pitch.\nAhead of the remaining group encounter against Switzerland this Sunday in Frankfurt, team Germany has created the fundament for something getting close to the so-called summer fairytale of the 2006 FIFA World Cup, when the country experienced a meanwhile famous football festival.\nSports magazine Kicker wrote about growing dreams around a team showing resilience. The country's leading media such as the Sueddeutsche, the FAZ, and Welt noted the apparent changes compared to previous tournaments.\n\"We see a team is playing as a team,\" and \"This hungry team is triggering joy,\" \"Weather-resistant at last,\" the headlines read.\nHaving found a bearing axis of keeper Manuel Neuer, defense chief Antonio Ruediger, midfielder Kroos, captain Ilkay Guendogan, and Jamal Musiala, everything seems to pay off for national coach Nagelsmann.\nNagelsmann's statements mirror the teams' ambitions. \"We want to end up as the group's first as this is a sign for inside and outside the team,\" the 36-year-old stated.\nThe German coach managed to launch a convincing restart for the lately struggling 2014 world champion. \"The crowd started to sing the national anthem in the middle of the game, I like that very much,\" the former Bayern coach said and praised fan engagement \"as the fan march in front of our hotel is supplying confidence and energy.\"\nThousands gathered when \"we entered the team bus,\" the coach mentioned and called supporters' actions infectious. ■",
  "word_count": 474,
  "scraped_at": "2026-02-14T02:10:54.422034",
  "_text_extracted": true
}