{
  "article_id": "8603debb3315",
  "url": "https://www.fourfourtwo.com/features/ranked-the-100-best-players-of-the-21st-century",
  "title": "Ranked ! The 100 best players of the 21st Century",
  "date": "20230301T164500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! The 100 best players of the 21st Century\nThe 100 best players of the 21st Century: the greatest Ballon d'Or hoggers, serial winners and cult heroes since the turn of the millennium\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nDebate about the best players of the 21st Century goes back, funnily enough, to 2000, when Boca Juniors beat Real Madrid in the now-extinct Intercontinental Cup final. President Florentino Perez reportedly gave both barrels to his misfiring Galacticos in the aftermath – but more because of the commercial opportunities that a pancontinental cup final loss had scuppered than the embarrassing result.\nFlo saw the match as a chance to expand his brand to Asia, with a new millennium beaming more football matches than ever: but not even he could envisage what this new century would bring. The internet would create stars – it would break them, too – the Champions League would grow in prestige, while scientific and technological advancements (not to mention coaching evolution) would make this game almost unrecognisable from the one that Perez grew up wanting to tame as his own.\nThe 21st Century has taken football to new realms. Let us introduce the 100 best artists, artisans, wizards and wunderkinder to have boldly gone where no one has else has ventured since that heady Intercontinental Cup clash…\nRanked! The 100 best players of the 21st Century\n100. Trent Alexander-Arnold\nThe Liverpool man has been a cornerstone of the club’s glorious era under Jurgen Klopp, winning the Champions League, Premier League, and Club World Cup, as well as helping England to the World Cup semi-final and Euro 2020 final.\nHis attacking threat from right-back is a constant thorn in the side of opposition teams, while he possesses outstanding technical ability and free-kick prowess. And he’s still only 25 – imagine what he could still achieve.\n99. Miroslav Klose\nThe Germany legend holds the record for the most goals scored at the World Cup, having struck 16 times across four different tournaments, the last of which ended in well-earned glory in 2014.\nKlose is also his country’s all-time top scorer with 71 goals, and would certainly be higher up this list if his club achievements matched those at international level.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nHis club CV is hardly to be sniffed at – the striker won two Bundesliga titles with Bayern Munich and the Coppa Italia with Lazio – but he became a different beast altogether when he pulled on the white shirt of his country.\n98. Rivaldo\nThe Brazilian great’s career traversed two centuries, but some of his finest moments came in the 21st.\nHe scored arguably the greatest hat-trick ever (a treble against Valencia in 2001 that concluded with an overhead kick from the edge of the box), and starred alongside Ronaldinho and Ronaldo in possibly the classiest front three of all time as Brazil won the 2002 World Cup.\nRivaldo’s dazzling talent was a joy to watch, and he would certainly be higher up this list if his Ballon d’Or-winning heyday didn’t come the wrong side of the year 2000.\n97. Luca Toni\nThe ultimate late bloomer, Toni only made his Serie A debut in 2004 aged 27 and things only got better from there.\nAt Fiorentina in 2005/06, the totemic striker became the first Italian ever to win the European Golden Shoe, and nine years later he scored 22 goals for Verona at the age of 38 to become Serie A’s oldest-ever top scorer.\nHis Bayern Munich spell brought major honours (and the Luca Toni macaroni song), but the crowning moment of Toni’s career was the 2006 World Cup, where he scored two goals on the Azzurri’s path to glory.\n96. David De Gea\nThe Spaniard’s star may have waned in his latter Manchester United years, but for a long time he was considered among the very best goalkeepers in the world, when his agility and ability to pull off seemingly impossible stops – often with his feet - beggared belief.\nDe Gea’s outstanding performances for Atletico Madrid earned him a move to United in 2011 and, although he would’ve wanted to have claimed more than the one Premier League title, his individual performances were recognised with four fans’ player of the season awards between 2013 and 2018.\n95. Deco\nThe diminutive Portuguese playmaker is a member of a very exclusive group of players who have won the Champions League with two different clubs, having triumphed with Porto in 2004 and Barcelona two years later.\nThe Brazil-born midfielder’s creativity, technique and versatility made him a manager’s dream – and further honours followed when he helped Chelsea to a league and cup double in 2009/10.\n94. Javier Zanetti\nThe Inter Milan legend’s 19-year stint at San Siro peaked in 2010 when he helped Jose Mourinho’s side win an unprecedented Serie A, Coppa Italia and Champions League treble.\nOne of the greatest defenders of his generation, the Argentina international was versatile enoughto operate in midfield, as well as being remarkably dependable, coming in 13th in the all-time list of footballers with the most official appearances.\nZanetti holds the Inter record for most appearances and won 19 trophies with the Nerazzurri – no wonder they wanted to keep him on in a vice-president role following his retirement.\n93. Mesut Ozil\nOzil was instrumental in Germany’s 2014 World Cup win and deservedly established a reputation as one of the world’s best attacking midfielders during spells with Real Madrid and Arsenal.\nNobody has won more German Player of the Year awards than Ozil’s five, and his sublime creative abilities came to the fore when he was the top assist provider in La Liga for three consecutive seasons.\nHe helped Arsenal end a nine-year trophy drought by winning the 2014 FA Cup, before winning two more. At his peak, Ozil was a joy to behold.\n92. Edwin van der Sar\nWidely considered one of the greatest goalkeepers of all time, Van der Sar had already enjoyed Champions League-winning success at Ajax before the 21st century even began.\nTrophies followed wherever the Dutchman went, as he collected 26 during his career, including becoming the oldest Premier League winner in 2011 aged 40 years and 205 days.\nVan der Sar is also the world record holder for the longest spell without conceding, going 1,311 minutes at Manchester United in 2008/09, while his ability with his feet as well as his hands inspired Germany World Cup winner Manuel Neuer, who credited the Dutchman with “allowing the position to enter a new phase”.\n91. Carlos Tevez\nDynamic, explosive and prolific, Tevez was a complete striker who won major honours with six different clubs on three different continents during his decorated career.\nThat included a Champions League triumph with Manchester United, a Premier League crown with Man City, back-to-back Scudetti at Juventus and silverware at either end of his long career with his beloved Boca Juniors.\nA career record of 214 goals in 497 games speaks to the natural ability of a player who could find the net and get fans off there seats wherever he went: a Premier League golden boot winner, Serie A player of the year and three-time South American footballer of the year.\n90. Arturo Vidal\nThe Chilean warrior’s blend of technical prowess and physical tenacity – not to mention his array of haircuts – has made him stand out during a hugely successful career for club and country.\nVidal won four consecutive Serie A titles at Juventus, three Bundesligas with Bayern Munich, a La Liga crown at Barcelona before returning to Italy to win another Scudetto at Inter Milan.\nBut his central role to Chile’s golden age has made him a hero in his home country. Vidal was man of the match when Chile beat Argentina in the 2015 Copa America final to win their first title, before starring again as they defended the crown the following year.\n89. Hernan Crespo\nOne of the deadliest finishers Argentina has ever produced, Crespo sits fourth in his country’s all-time top scorer list behind the illustrious trio of Sergio Aguero, Gabriel Batistuta and Lionel Messi.\nThe striker found his best club form in Italy, joining Lazio from Parma for a world-record £35 million fee in 2000 and immediately winning the Serie A top scorer award, and in 2004 Brazilian great Pele name-checked Crespo as one of the world’s greatest living players.\n88. Thibaut Courtois\nYou would be hard pressed to find a more reliable goalkeeper Courtois, the rock behind two Premier League titles at Chelsea, Europa League and La Liga successes at Atletico Madrid, and another Spanish title at Real Madrid.\nAn outstanding shot-stopper with remarkable agility for a man of his 6ft 6in frame, the Belgian has swept up individual awards throughout his career, including multiple Zamora trophies, a Premier League Golden Glove award and a Best FIFA Goalkeeper prize in 2018.\n87. Thiago Silva\nStrikers the world over probably still have nightmares about being marked by Silva. The Brazilian great is a flawless defender who combines intelligence and leadership with world class physical and technical attributes.\nAny doubts about whether he would be up to the demands of transitioning to Premier League football aged 35 were soon forgotten when Silva quickly settled and led Chelsea to Champions league glory in his first season, adding that trophy to seven Ligue 1 crowns, a Serie A title and the Copa America – among many others.\n86. Juan Roman Riquelme\nRiquelme was the archetypal No.10, a player born to entertain. His seemingly effortless elegance and flair drew inevitable comparisons with Diego Maradona and while he never hit the same heights as his legendary compatriot, the playmaker did earn icon status at Boca Juniors.\nRiquele won five league titles and three Copa Libertadores crowns in the two stints with the Buenos Aires club that book-ended his career, while he’s perhaps best remembered in Europe for guiding Villarreal to the semi-finals of the Champions League for the first time in 2006.\n85. Fernando Torres\nTorres enjoyed the most prolific spell of his career at Liverpool, becoming the club’s first player to notch more than 20 league goals in a season for 12 years in his debut season.\nAlthough he never hit the same heights at Chelsea, he will be remembered fondly for a last-minute goal against Barcelona that sent the Blues to the Champions League final.\nTorres also found the net in the finals of Euro 2008 and Euro 2012, winning the golden boot in the latter tournament, as he played a major part in his country’s golden era of winning two European Championships and the World Cup.\n84. Henrik Larsson\nThe Celtic legend is quite possibly the greatest signing in Scottish football history, having won the European Golden Shoe in 2001 and fired a superb Bhoys side to the UEFA Cup final and four league titles.\nLarsson was also instrumental in Barcelona’s 2006 Champions League triumph, setting up both of his side’s goals from the bench, and showed his class by impressing so much during a three-month spell with Manchester United towards the end of his career that Sir Alex Ferguson was eager for him to stay. The King of Kings indeed.\n83. Raphael Varane\nVarane’s blend of intelligence, pace, strength and technique make him the complete package as a centre-back - and his trophy cabinet backs that up.\nThe 28-year-old was a cornerstone of France’s 2018 World Cup victory, earning a place in the UEFA and FIFA Team of the Year after that triumph, as well as Real Madrid’s remarkable run of four Champions League titles in five years.\n82. Raheem Sterling\nSterling was a key contributor to the most successful era in Manchester City’s history, not to mention the revival of England as a serious force on the world stage.\nThe agile winger’s dazzling dribbling has tormented defenders for years, but he became a prolific player under Pep Guardiola, hitting double figures consistently and sweeping silverware.\nAn international honour still eludes him, but the winger scored three times on England’s road to the Euro 2020 final after helping them to the World Cup semi-finals two years earlier.\n81. Ryan Giggs\nGiggs would be even higher up this ranking if it included the 1990s, but the Welsh winger still made a massive contribution to Manchester United’s 21st-century success.\nThe Old Trafford club’s record appearance holder remains one of the most decorated footballers ever and his post-millenium haul includes eight Premier League titles and the Champions League.\nA remarkably consistent who reinvented himself as a central midfielder towards the end of his career, Giggs was technically gifted and a creative force who produced the most assists in Premier League history, The Welshman is rightly considered one of the greatest players of his generation.\nCurrent page: The 100 best players of the 21st Century: 100-81\nNext Page The 100 best players of the 21st Century: 80-61Alasdair Mackenzie is a freelance journalist based in Rome, and a FourFourTwo contributor since 2015. When not pulling on the FFT shirt, he can be found at Reuters, The Times and the i. An Italophile since growing up on a diet of Football Italia on Channel 4, he now counts himself among thousands of fans sharing a passion for Ross County and Lazio.\n- Mark WhiteContent Editor\n- Conor PopeOnline Editor\n- Greg Lea",
  "word_count": 2337,
  "scraped_at": "2026-02-14T01:46:30.512763",
  "_text_extracted": true
}