{
  "article_id": "860d33e16ed2",
  "url": "https://punchng.com/finidi-happy-to-end-nigerias-caf-jinx/",
  "title": "Finidi happy to end Nigeria CAF jinx",
  "date": "20251027T040000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Rivers United coach Finidi George is proud of the team’s achievement of reaching the group stage of the CAF Champions League for the first time in their history, as well as ending Nigeria’s six-year drought in the competition, PUNCH Sports Extra reports.\nThe 2022 Nigeria Premier Football League champions made history at the Godswill Akpabio International Stadium in Uyo on Saturday, defeating Black Bulls of Mozambique 3-1 and securing a spot in the group stage of the 2025/26 CAF Champions League.\nHaving lost the first leg 1-0 away, Rivers United secured a 3-2 aggregate win to remain as the only Nigerian club on the continent this season, following the elimination of Remo Stars, Kwara United, and Abia Warriors.\nThe qualification will mark Finidi’s first taste of first-tier continental club football in Africa since returning to the NPFL as a coach in 2021. He joined Rivers United last season after about three years at Enyimba, as well as a short stint as the Super Eagles head coach.\n“I am quite happy for the victory and the hard-fought battle. Yes, to have qualified is great for everybody here. We have been looking forward to this, and it has happened. Personally, it is an achievement to get to this stage, and going forward, we will see how we can compete in the group stages,” Finidi told journalists after the game.\n“We will see the draws and take each game as they come. We know how difficult this tournament is, so we will add one or two players to this squad. But we will enjoy this for now and take each game at a time. We could have won in Mozambique because we created enough chances to have got something out of it, but it didn’t happen. Fortunately for us, we scored three at home, and it is a well-deserved qualification.”\nNeeding a win at home, Rivers United got off to a flying start, dominating proceedings with Boluwaji Sholumade, Wasiu Falolu, and Seyi Oguntayo in the midfield, and it paid off with Wasiu Falolu scoring in the 15th minute to level the aggregate score at 1-1. The goal came after Maclyn Biokpo’s shot was blocked, and Falolu capitalised on the rebound.\nThey continued to dominate with Osagie Onisodumeya having a solid back four of Isaac Annor, Taiwo AbdulRafiu, Stephen Manyo, and Ogechukwu Ogbu, and just before half-time, Maclyn Biokpo converted a penalty, awarded after Timothy Zachariah, set up by Ubong Friday, was tripped in the box, to make it 2-0.\nBlack Bulls pulled one back within the opening five minutes of the second half, with Moctar Diallo finding the back of the net, as the aggregate score was level at 2-2, and the away-goal rule threatened to eliminate the Nigerian side.\nHowever, Zachariah crowned his man-of-the-match performance with a superb strike in the 78th minute, off an assist from Manyo, to secure the win and send Rivers United to the group stage after four attempts.\nThe last Nigerian club to play in the CAF Champions League group stage was Lobi Stars during the 2018/19 season.\nMeanwhile, the former NPFL champions will return to domestic action on Wednesday, October 28, when they take on Ikorodu City FC at the Adokiye Amiesimaka Stadium in a rescheduled match-day 10 fixture.\nThe following midweek, they will head to Benin to face Bendel Insurance in a rescheduled match-day nine tie at the Samuel Ogbemudia Stadium on Wednesday, November 5. Their final rescheduled match so far will see them travel to Kano State to face Barau FC on Wednesday, November 19.",
  "word_count": 591,
  "scraped_at": "2026-02-14T02:12:04.341836",
  "_text_extracted": true
}