{
  "article_id": "862c914c5cd2",
  "url": "https://www.bbc.co.uk/sport/football/66841246",
  "title": "AC Milan : Can the Rossoneri bounce back from Inter thrashing in Champions League ? ",
  "date": "20230918T130000Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AC Milan: Can the Rossoneri bounce back from Inter thrashing in Champions League?\n- Published\nLosing 5-1 to Inter in the Derby della Madonnina on Saturday night, Stefano Pioli, AC Milan's Coach, was asked if he should apologise to the fans.\nInter had just achieved a historic feat by defeating their city rivals for the fifth time in a row this year, scoring 12 and conceding only one goal along the way.\nBy winning this derby Inter have proved yet again why they are the favourites to win Serie A and while the likes of Romelu Lukaku and Marcelo Brozovic have departed, they continue to find ways to exercise their excellence. However, Pioli's curious tactical decisions and the way in which his team folded in the last quarter of the game has invited plenty of criticism and melodramatic reactions.\nUp until suffering their heaviest derby defeat for a few decades this weekend, Milan were performing beyond expectations at this early stage of the season to shut down any concerns with regards to their summer revolution. Allowing Paolo Maldini, club legend and beloved director, to leave only to then sell die-hard Milanista Sandro Tonali had several wondering if new owners Red Bird understood the culture of the club.\nTen new signings later and Milan were delighting spectators with overwhelming attacking patterns of play that left us wondering how Pioli was able to embed so many new signings so quickly. Christian Pulisic and Olivier Giroud, two former Chelsea players, immediately displayed their familiarity with one another, creating and scoring goals together. The dynamism of Tijjani Reijnders, who frequently made intelligent runs into the box, coupled with Ruben Loftus-Cheek's vision, energy and willingness to cover ground has us believing in this new Milan.\nThe side were no longer left leaning, hoping Rafael Leao would conjure up magic on the left or that someone would deliver a great ball for Giroud. Now there were options all across the pitch and on the bench.\nYet defensively, there were still some questions. Milan may have won their first three games of the season, scoring eight, but the two goals they did concede raised concerns. Fikayo Tomori was sent off against Roma and while the Rossoneri still won that match, the defender was going to miss the derby. A huge loss.\nEven in his presence, the vulnerable-looking defence bred concerns as to how Milan would cope against better attacking sides. We had seen the backline exposed far too frequently last season and were yet to understand if they had resolved this issue. Most of the incoming transfers were made to bolster the attack, not solidify a defence that conceded 43 goals to Napoli's 28 last term.\nWould this midfield offer enough of a filter? Tomori's performances in his first season drew widespread praise because he drew so much confidence from the running done by the likes of Franck Kessie and Tonali ahead of him. Last year, his performances were less complimented when the midfield grew more overwhelmed and overworked.\nHowever, Tomori is Milan's best centre-back and without him not only did Malick Thiaw fall apart but the Rossoneri defence crumbled. Inter's physicality, rehearsed understanding of how to double up and their midfield density served to nullify any opposing attacking threats while allowing themselves to endlessly threaten in the transitions.\nPrior to the derby, Milan were confident of their attacking prowess across the pitch due to the abundant number of attackers capable of one-on-ones. However, Inter proved pre-season fears correct when they starved Milan of that space and forced them to operate in tight spaces against physically imposing players.\nMilan lost 5-1 and deserve to be subjected to criticisms but not exaggerated questioning. This is a side with 10 new players that have yet to understand their limitations and true strengths. This is only the fourth match of the season and nothing great can be achieved so quickly. Inter boast more experience and the continuity of a project that yielded an impressive performance in the Champions League final. They too have changed but not to the same degree and are rightfully favourites for the Serie A title and always bound to be the hardest opposition to face for this new Milan.\nPioli is adamant his side are resilient enough to weather this psychological storm. 2023 has proved to be a tough year for the Rossoneri in these derby fixtures, but it is worth remembering Pioli won two Serie A derbies in a row in 2022 and was the first coach to manage it since Massimiliano Allegri in 2011, so he shouldn't be doubted… yet.\nMilan will welcome Newcastle in the Champions League on Tuesday and the Italian side will be eager to repent. The Rossoneri are still deliciously effusive going forward and will have Tomori back in defence to hopefully ensure a more balanced performance.\nThe club is quietly confident of their chances to escape what is currently being labelled as the group of death. Champions League success in a priority for this side for financial reasons as well as for their reputation. Only Real Madrid have won more trophies than Milan in this competition and they hope they will be allowed to progress to the knockouts to demonstrate their expected maturity.\nQuestions from readers\nDemarcus, Harrogate: Do you think we will ever see a repeat of [a club like] Porto winning the Champions League in 2004 with the money in the top leagues today?\nAnything is possible but perhaps somewhat improbable. With such heavy fixture lists and players subjected to playing so many more minutes, squad depth and the quality of that depth will make the difference. That unfortunately requires money but the reason we love this sport is because of its unpredictability.\nHowever, nearly every year we witness at least one excellent story in the Champions League and while the less rich may not win the entire competition, they can still compete till the end. Inter made £261m in revenue in the season prior to last according to the Deloitte Football Money League, ranking 14th in terms of revenue in Europe. Milan were ranked 16th and yet they contested the semi-final. Inter were excellent in the final and according to Pep Guardiola, were unlucky to not have won.\nJuventus contested the Champions League final in 2015 despite a small budget. In fact, even the likes of Schalke were making more in commercial revenue than the Italian giants. Interestingly, the more they earned in revenue, the harder they found it to compete in the latter stages of the competition. Money is an advantage but the lack of it allows for innovation and well-run teams will always compete.\nIfeanyi Elekwachi, Nigeria: What do you make of Mourinho's chances of seeing out this season at Roma? Are the management and fans still happy with him?\nHis importance to the club cannot be adequately quantified. When Jose Mourinho was announced as Roma's new coach, AS Roma shares rocketed by more than 21% while the club's brand continues to grow largely due to the pull of his name and reputation. It is often noted in Italy that he is a large reason why players like Paulo Dybala and now Romelu Lukaku have chosen to play in Roma.\nWinning the club's first European trophy since 1961, the 2022 Europa Conference League, has elevated his status even more, not to mention reaching the Europa League final one year later. He has added value to the club and the fans often sing his name. Sold out stadiums (which equates to revenue) is what we have come to expect from Roma and regardless of his antics, he is very well loved and respected by the fans and the club. Away from Rome, he has his critics and questions have been asked of his team's style of play.\nHe seems committed to the club for this last year, his contract ends in June 2024 and it's worth mentioning he turned down more lucrative deals from Saudi Arabia to stay on this Roma path and for that they are thankful.\nBill, Cumbria: Who would you say the next big young talents are in Serie A?\nIn Serie A, several and hopefully the league will get to keep them!\nMichael Olabode Kayode is one to look out for and is the current Fiorentina right-back. He started Fiorentina's first game of the season against Genoa and dazzled on the pitch but was then reportedly struck down with Tonsilitis so hasn't featured since.\nHe was also the player who scored the only goal of the game to ensure Italy's success in UEFA's European Under-19 Championship.\nIntelligent runs coupled with tidy passing and a strong mentality, Coach Vincenzo Italiano will be looking to play the right-back quite often in this busy season. He is a player who fears nothing while his athleticism is exactly what the club need going forward.\nGiorgio Scalvini is an Italian centre-back who plays for Atalanta and the Italian national team. Only 19 years old, he's incredibly elegant, highly technical but will never turn down the chance to engage in a physical battle. He's tall and strong and will ensure his opponents are aware of it but he's also someone who can pick out a clever pass and allow the team to keep progressing up the pitch.\nLuciano Spalletti is already depending on him as he tries to ensure Italy qualify for the upcoming Euros.\nSamuel Iling-Junior is a Juventus winger who is highly admired. The Englishman recently had his contract extended and he's someone who seems to always know how to make an impact on the pitch. In Juventus' Champions League match against Benfica last season, the Italians were losing 4-1. After Iling-Junior came on, he not only assisted Arkadiusz Milik's goal to make it 4-2 but delivered a key ball into the box to help Juve make it 4-3.\nTactically smart, dynamic and capable of getting past his opponents with ease to deliver delectable passes, his introduction is what helped Juve to recover a point against Bologna when they were down 1-0 two weeks ago, delivering the assist for Dusan Vlahovic's finish.\nMina Rzouki is a European football journalist and broadcaster who is writing for BBC Sport this season. If you have a question on European football that you'd like to ask her, then fill out the form below and she will answer a selection of them in subsequent columns.",
  "word_count": 1735,
  "scraped_at": "2026-02-14T02:07:14.754957",
  "_text_extracted": true
}