{
  "article_id": "863eed32cd19",
  "url": "https://thenationonlineng.net/karim-benzema-to-leave-real-madrid-ahead-of-saudi-arabia-move/",
  "title": "Karim Benzema to leave Real Madrid ahead of Saudi Arabia move",
  "date": "20230602T053000Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nJune 1, 2023 by Agency Reporter\nKarim Benzema to leave Real Madrid ahead of Saudi Arabia move\nKarim Benzema will leave Real Madrid when his contract expires this month to join Saudi Arabian side Al Ittihad, sources have told ESPN.\nESPN reported earlier this week that Benzema was offered a two-year contract worth €400 million to move to Saudi in January, the same deal as Cristiano Ronaldo who joined Al Nassr after leaving Manchester United.\nThe centre-forward, 35, has spent 14 seasons at the Bernabeu, becoming the club’s second-highest goalscorer and winning five Champions Leagues, four LaLiga titles and the 2022 Ballon d’Or.\nBenzema had been expected to stay at Madrid for one more season until June 2024, but has opted instead to accept a new challenge. Madrid are in advanced talks to sign Joselu on loan to replace Mariano Diaz but they will look for someone else to bolster the attack.\nRead Also: Real Madrid targets Mato as backup for Benzema\nMadrid’s club captain has had an injury-hit season — missing the 2022 World Cup in Qatar with a hamstring problem — but still scored 18 goals in 23 LaLiga appearances, as well as four goals in the Champions League knockout stage.\nBenzema joined Madrid from Lyon in 2009 as one of Europe’s most highly rated young forwards. He initially had to compete with Gonzalo Higuain for a place in the side, before becoming a part of Madrid’s iconic “BBC” forward line alongside Gareth Bale and Ronaldo.\nBenzema evolved into the team’s main goal threat with the departure of Ronaldo in 2018. He had a career-best season in 2021-22, top scoring in LaLiga with 27 goals and scoring another 15 in the Champions League, form which won him the Ballon d’Or in October 2022.\nBenzema will leave Madrid having won a total of 24 trophies: four LaLiga titles, five Champions Leagues, three Copas del Rey, three Spanish Supercopas, four UEFA Super Cups and five FIFA Club World Cups. His 353 Real Madrid goals — more than club legends such as Raul Gonzalez and Alfredo di Stefano — are only surpassed by Cristiano Ronaldo, the club’s all-time record scorer, with 450.\nHe retired from international football in December following France’s World Cup final defeat to Argentina, having been left out of his country’s squad by coach Didier Deschamps after failing to recover from injury in time for the start of the tournament.\n(ESPN)",
  "word_count": 404,
  "scraped_at": "2026-02-14T02:00:19.986377",
  "_text_extracted": true
}