{
  "article_id": "864829442bf2",
  "url": "https://thepeoplesperson.com/2023/04/10/juventus-eyeing-manchester-united-striker-anthony-martial-to-replace-outgoing-dusan-vlahovic-262326/",
  "title": "Juventus eyeing Manchester United striker Anthony Martial to replace outgoing Dusan Vlahovic",
  "date": "20230410T204500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s win over Everton at the weekend was yet another example of the team struggling to score despite creating clear-cut chances galore.\nThat is exactly why manager Erik ten Hag is keen on adding an elite striker to the mix ahead of next season.\nAfter losing club legend Cristiano Ronaldo in the middle of the season, the onus of scoring goals fell on Marcus Rashford‘s shoulders.\nA striker to be added in the summer\nThe Mancunian has done exceedingly well this season and remains the only player in the squad to have hit double digits in the Premier League.\nUnited No 9 Anthony Martial has struggled with injuries while loan signing Wout Weghorst is not good enough for a club of United’s calibre.\nThe Red Devils have been linked with a move for Tottenham’s Harry Kane, Victor Osimhen of Napoli and Juventus hit-man Dusan Vlahovic.\nThe Old Lady are already plotting for a replacement should the Serbian striker bid adieu in the summer due to a lack of Champions League football.\nSurprisingly, their list is topped by Martial who has a chance to save his United career or make himself attractive for other clubs if he can finish the season strongly, especially now that Rashford could be sidelined for some time.\nDespite playing only 799 minutes this season, Martial has notched seven goals and two assists and thus has recorded a goal involvement every 88 minutes, which is a fine statistic to have.\nThe Frenchman remains a mercurial talent and on his day, can be devastating. He remains the best finisher by far but his woeful injury record and lack of effort might see his United chapter come to a close in the summer.\nMartial on his way out?\nAccording to Calciomercatoweb, United could be open to mutually terminating the French international’s contract, which runs till 2024, in order to free up the wage bill.\n“The class of 1995 will see his contract with the Red devils expire in June 2024, with the company that would be thinking of a consensual termination in order to let him leave.\n“The Bianconeri, especially in the event of exclusion from the next European competitions, could lose Dusan Vlahovic in the summer, and the Frenchman’s profile seems to be considered perfect by the management and by Massimiliano Allegri,” the report added.\nThe report also mentioned that “Juventus are ready to launch the definitive assault” but take this report with a pinch of salt as it is highly unlikely that United will not try and recoup some of the money they paid for Martial back in 2015.\nFollow The Peoples Person on Twitter or Instagram for all the latest news as it happens and to join in the conversation.",
  "word_count": 455,
  "scraped_at": "2026-02-14T01:59:46.864087",
  "_text_extracted": true
}