{
  "article_id": "865c5b1e1b00",
  "url": "http://thepeninsulaqatar.com/article/03/10/2023/persepolis-clinch-crucial-win-over-al-duhail-fc-nasaf-beat-al-sadd",
  "title": "Persepolis clinch crucial win over Al Duhail ; FC Nasaf beat Al Sadd",
  "date": "20231003T060000Z",
  "domain": "thepeninsulaqatar.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "CHAIRMAN: DR. KHALID BIN THANI AL THANI\nEDITOR-IN-CHIEF: PROF. KHALID MUBARAK AL-SHAFI\nPersepolis’ Iranian midfielder Omid Alishah (center) celebrates after scoring a goal against Al Duhail at Abdullah bin Khalifa Stadium in Doha, yesterday. AFP\nIran's Persepolis secured a crucial 1-0 victory over hosts Al Duhail to jump to the second spot in Group E of the AFC Champions League in Doha, yesterday.\nAt the Abdullah Bin Khalifa Stadium, Omid Alishah's second-half goal made the difference, giving Persepolis their first three points in the group.\nBoth teams entered their second game without having scored a goal in their previous match, with Al Duhail drawing 0-0 against Istiklol and Persepolis losing 2-0 to Al Nassr.\nAl Duhail missed several golden opportunities to score in front of their fans. Persepolis goalkeeper Alireza Beiranvand made crucial saves to deny scoring efforts by Kenyan striker Michael Olunga and Qatari defender Sultan Al Braik.\nPersepolis's Yasin Salmani hit the crossbar from outside the box, almost scoring their opening goal, but it was Alishah who finally succeeded in the 63rd minute with a surprising cross.\nAl Duhail will take on Cristiano Ronaldo-led Saudi powerhouse Al Nassr next on October 24 in Riyadh, while Persepolis welcomes Istiklol in their next match.\nFC Nasaf too good for Al Sadd\nEarlier, visitors Al Sadd succumbed to a 1-3 defeat against hosts FC Nasaf.\nAt the Pakhtakor Central Stadium in Tashkent, Sukhrob Nurulloyev opened the scoring for Nasaf in the 29th minute before Azizbek Amonov added two more goals in the second half (46’, 58’) securing full points for the Uzbek side. Al Sadd managed to pull one back through Boualem Khoukhi in the 83rd minute, but it was too late for the Qatari side to recover.\nThe victory, their second in a row, consolidated FC Nasaf's place at the top of the Group B standings, with six points, while Al Sadd stay in third position having one point so far from their draw against Sharjah FC on matchday 1.\nAl Sadd’s coach Bruno Miguel did not hesitate to express disappointment following the defeat.\nAddressing the media during a post-match press conference, Miguel stated that Al Nasaf deserved the win.\n\"I do not have much to say about this match. Nasaf won the match because they deserved it,\" Miguel said.\nMiguel said Al Sadd were off to a good start, but indicated that the opening goal turned things around.\n\"Unfortunately, when we started to play better, we conceded the first goal. Nasaf started well with counterattacks, but then when we started to control the match, we conceded a goal.\"\nMiguel highlighted a crucial moment in the match, saying, \"At the beginning of the second half, we conceded a goal in the first minute from a side throw, and this should not happen. In the end, when we scored and tried to come back, we got a red card, which made things difficult for us.\"\n\"Al Sadd is always a team that tries to control the match. We tried to do what we always do, but we lost. It is part of football. Winning, drawing, and losing - it is all part of the game. What is important for us is correcting mistakes and achieving better results in the upcoming matches,\" Miguel said.\n\"We will fight in the upcoming matches. I truly believe that we are able to get enough to qualify from the group.\"\nIn the next matchday on October 23, Al Sadd are set to take on Al Faisaly, while Nasaf will face UAE's Sharjah FC.\n-\nStrong winds, blowing dust forecast from Sunday: Qatar Meteorology\n-\nMandarin Oriental, Doha celebrates dual five-star recognition at Forbes Travel Guide 2026 Star Awards\n-\nMinistry of Municipality launches 34 e-services for livestock sector\n-\nAl Attiyah, McInnes top times on Jordan Baja Prologue\n-\n‘Stability offers investment confidence as Qatar poised for further growth’",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:25:00.757328",
  "_text_extracted": true
}