{
  "article_id": "867026532019",
  "url": "http://www.geosuper.tv/latest/39366-lille-loss-a-reality-check-for-real-madrid-ancelotti-says",
  "title": "Lille loss a reality check for Real Madrid , Ancelotti says",
  "date": "20241004T211500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Reuters\nOctober 04, 2024\nReal Madrid manager Carlo Ancelotti is hoping the short preparation time he has had with his players following the shock Champions League loss at Lille will be enough for his team to return to winning ways.\nAs they prepare to host Villarreal in LaLiga on Saturday, Ancelotti said Wednesday's match was a reality check after a penalty scored by Jonathan David earned the French side a 1-0 victory over the holders, ending the 15-times European Cup winners' 36-game unbeaten run in all competitions.\n\"(Villarreal) are doing really well, tomorrow it's an opportunity for us to reconnect, to get back to playing good football,\" Ancelotti told a press conference on Friday.\n\"(The mood) is fine, as always. (Wednesday's) defeat is an opportunity, if we take it and react well. We are self-critical. There are times when you have to reconnect and you need to do it quickly.\n\"Sometimes a good run makes you think you're invincible, but a defeat brings you back to reality. We are still not at our level, we have players who are not at their best. We are not far from where we want to be. There is a lack of defensive intensity and, offensively, a lack of ball circulation.\"\nComing off a remarkable 2023-24 season in which they won the LaLiga and Champions League double, Real are second in the Spanish league standings on 18 points, three behind leaders Barcelona and one ahead of Villarreal.\nAncelotti expects to get Kylian Mbappe back into the starting team after the forward missed last weekend's 1-1 derby against Atletico and came off the bench at Lille due to a hamstring injury, which led to France manager Didier Deschamps leaving his captain out of the squad for next week's internationals against Israel and Belgium.\n\"He has had a problem that seems to have been solved. He has trained normally,\" Ancelotti said.\n\"I don't get involved in what national coaches do. Deschamps has decided not to call him. We need to get the ball to the strikers quicker and we lack defensive intensity.\"",
  "word_count": 347,
  "scraped_at": "2026-02-14T02:01:51.720069",
  "_text_extracted": true
}