{
  "article_id": "8675bf3265c5",
  "url": "https://www.caughtoffside.com/2025/02/22/paul-scholes-man-united-greatest-player/",
  "title": "Paul Scholes names Ryan Giggs as the greatest Man United player",
  "date": "20250222T190000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United have had some of the greatest players play for them.\nFrom the days of George Best, Bobby Charlton and Denis Law, to Wayne Rooney, Crisitano Ronaldo, Roy Keane and others.\nThey have been the most successful club in Premier League history, winning 13 Premier League titles.\nWhile Wayne Rooney is the club’s all time top goal scorer, Ryan Giggs has won the most league titles.\nUnder the era of Sir Alex Ferguson, the Red Devils enjoyed success and competed for the biggest honours in football every season.\nPaul Scholes, one of the most decorated Man United and Premier League midfilders, has opened up on who he believes is the greatest player to ever play for Man United.\nThe former England international midfielder surprisingly snubbed Rooney and Ronaldo and instead named his former teammate as the club’s greatest player.\nScholes named 13-time Premier League winner Giggs as the club’s best player ever with Rooney in second place, on TNT Sports’ Tik Tok account.\nScholes then named the club’s former iconic captains as the third and fourth best players; Roy Keane and Bryan Robson.\nEric Cantona made the top five of Scholes’ rankings, with no place for Ronaldo in the top five.\n@tntsports Paul Scholes ranks his top 5 Manchester United players of all time 👀🔥 #EVEvMNU #PL ♬ original sound – TNT Sports\nRyan Giggs elevated Man United to a whole new level\nGiggs played 963 games for the club, scored 168 goals and provided 266 assists for them, winning 13 league titles in the process and two Champions League titles.\nNobody can match his longevity in the English game and that is why with the club having several Ballon d’Or winners, Scholes has named Giggs as the greatest player.\nHe played all his career at United and became a fan favourite over the years with his consistent performances and his crucial role in the club winning major silverware.\nRuben Amorim wants marauding left-back to replace Luke Shaw at Man United",
  "word_count": 332,
  "scraped_at": "2026-02-14T01:52:15.331823",
  "_text_extracted": true
}