{
  "article_id": "86761facaa25",
  "url": "https://bleacherreport.com/articles/10107364-cristiano-ronaldo-out-for-al-nassrs-match-vs-lionel-messi-inter-miami-with-injury",
  "title": "Cristiano Ronaldo out for Al - Nassr Match vs . Lionel Messi , Inter Miami with Injury",
  "date": "20240131T184500Z",
  "domain": "bleacherreport.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Featured Video\nLeBron's Historic Triple-Dub 👑\nCristiano Ronaldo out for Al-Nassr's Match vs. Lionel Messi, Inter Miami with Injury\nThe highly anticipated clash between legendary soccer stars Cristiano Ronaldo and Lionel Messi will not happen Thursday despite a scheduled friendly between Al-Nassr and Inter Miami.\nAccording to Kyle Bonn of Sporting News, Al-Nassr head coach Luís Castro said Wednesday that Ronaldo will not play in the friendly since he was not fit enough to train with the team and could only participate in individual drills.\nThursday's match was being billed as \"The Last Dance\" due to the strong possibility that it would have marked the final Ronaldo vs. Messi encounter, as both players approach the end of their careers.\nPer ESPN's Chris Wright, Messi and Ronaldo have faced each other 36 times in competitive matches, the first of which occurred in 2008 when Messi was a 20-year-old playing for Barcelona and Ronaldo was a 23-year-old playing for Manchester United.\nIn their 36 meetings, Messi has the upper hand with 16 wins, 11 losses and nine draws. Messi has also registered 22 goals and 11 assists in those matches compared to 21 goals and one assist for Ronaldo.\nWright noted that the most recent meeting between Messi and Ronaldo was a friendly between Paris Saint-Germain and a Saudi Pro League XI in January 2023. Although the match didn't count in their record against each other since it was an exhibition, Ronaldo scored twice and Messi scored once in a 5-4 Saudi win.\nTheir most recent competitive meeting was in the 2020-21 UEFA Champions League group stage when Ronaldo scored twice in Juventus' 3-0 win over Barcelona.\nRonaldo and Messi are recognized as the two top goal scorers in major professional soccer history across all competitions, as the 38-year-old Ronaldo has 873 goals and the 36-year-old Messi has 821 goals.\nMessi and Ronaldo also happen to be two of the most decorated players in the history of the sport in terms of individual and team accomplishments.\nMessi is a four-time UEFA Champions League winner with Barcelona and a one-time FIFA World Cup and one-time Copa América winner with Argentina.\nHe has also won the Ballon d'Or eight times, the FIFA World Cup Golden Ball twice and the FIFA World Cup Silver Boot once.\nRonaldo won the UEFA Champions League four times with Real Madrid and once with Manchester United, plus he won the UEFA European Championship with Portugal in 2016.\nIndividually, Ronaldo is a five-time winner of the Ballon d'Or and he won the UEFA European Championship Golden Boot in 2020.\nAt this point in their careers, Messi and Ronaldo aren't likely to be battling for many more major trophies or awards, as Ronaldo took a big-money contract to play in Saudi Arabia with Al-Nassr, while Messi chose to spend the golden years of his career in the United States with MLS club Inter Miami.\nRonaldo's absence undoubtedly takes away a large chunk of the excitement surrounding Thursday's match, but assuming Messi still plays at Kingdom Arena in Riyadh, it will be a major event in Saudi Arabia.",
  "word_count": 516,
  "scraped_at": "2026-02-14T02:10:42.030328",
  "_text_extracted": true
}