{
  "article_id": "868fbadad967",
  "url": "https://metro.co.uk/2025/01/06/arsenal-transfer-target-alexander-isak-can-sink-gunners-carabao-cup-22301381/",
  "title": "Arsenal transfer target Alexander Isak can sink Gunners in Carabao Cup | Football",
  "date": "20250106T140000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s 14 long years since Newcastle United returned to Tyneside with a victory against Arsenal in North London and the Magpies may have to wait to end that sorry streak when they face the Gunners in their Carabao Cup semi-final, first leg at the Emirates Stadium.\nThe Toon Army have not won any significant silverware since beating Hungarian club Ujpesti over two legs in the 1969 Fairs Cup final, a wait of 56 years which gives Tottenham fans something to laugh about.\nBut Newcastle did reach the final of this competition a couple of years ago, only to be beaten by Manchester United, and although they will be without key midfielder Bruno Guimaraes through suspension they will be full of confidence after winning their last six matches including Saturday’s 2-1 success at Spurs.\nDuring that spell they have climbed from 12th to fifth in the Premier League table and are justifiably eyeing a return to Champions League football next season and in Sweden striker Alexander Isak they possess the hottest goalscorer in the country on current form.\nHe has netted nine times in his last eight matches to take his tally to 14 for the campaign so it is no surprise he is a highly coveted commodity with Arsenal manager Mikel Arteta reportedly willing to pay a king’s ransom to lure him away from St James’ Park to strengthen the Gunners’ chances of winning the Premier League for the first time in two decades.\nNewcastle won’t allow their prize asset to leave, however, as they are reliant on his prowess in front of goal, so home fans will have to watch with envy and frustration as he prowls the dangerzones seeking to add to his tally.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThe Gunners drew 1-1 at Brighton on Saturday to extend their unbeaten run to 13 matches following back-to-back defeats at Newcastle in the league and at Inter Milan in Europe, but have not been at their exhilarating best in recent weeks barring the 5-1 thumping of Crystal Palace at Selhurst Park and the 3-1 success at Brentford.\nInjuries have blunted their performances with Martin Odegaard still working his way back to his scintillating best and Bukayo Saka sidelined for a couple of months and this opening leg could finish on level terms, which is 3/1 with several firms including Bet Victor, Betway, Betfair, Betfred and Paddy Power.\nMore Trending\nIsak is 13/2 to open the scoring with the latter outlet and BoyleSports, who go 9/4 he scores at any time while William Saliba is 16/1 with Sky Bet to reply for the hosts.\n• Second faces fourth when Wycombe entertain Huddersfield in what should be an entertaining League One affair at Adams Park and a share of the spoils appeals at 12/5 with Ladbrokes, Coral, Bet Victor and bet365. A 2-2 draw is 14/1 with the latter.\n• There won’t be anyone dressed as Batman, Super Mario or Darth Vader but snooker fans will be just as enthusiastic in their own way when the Masters follows the World Darts Championship at Alexandra Palace on Sunday.\nSecond seed Kyren Wilson is in the better half of the draw and the reigning world champion is 14/5 with SpreadEx to bank the £350,000 which goes to the winner.\nMORE: Michael Owen says Arsenal target would ‘walk into every team in the Premier League’\nMORE: Paul Merson tells Arsenal to ‘break the bank’ for £150m star who he would take over Erling Haaland\nMORE: Gary Lineker says frustrating Arsenal star ‘needs coaching’",
  "word_count": 638,
  "scraped_at": "2026-02-14T02:08:52.970270",
  "_text_extracted": true
}