{
  "article_id": "86ceb4237fba",
  "url": "https://www.caughtoffside.com/2024/02/20/liverpool-interested-in-60m-man-united-target-this-summer-ten-hag-wants-23-year-old-since-last-year/",
  "title": "Liverpool interested in £60m Man United target this summer",
  "date": "20240220T170000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool and Man United will be in the transfer market this summer in search of a centre-back and it is now being reported that the Reds are interested in one of the Manchester club’s targets.\nErik ten Hag has wanted a new defender since last summer but United failed to deliver him one. There were several names on the Dutch coach’s list, one being Crystal Palace’s Marc Guehi.\nIt was reported ahead of the January window that the Eagles wanted £60m for the 23-year-old, which ruled Man United out of a move due to financial fair play concerns.\nThis might come back to haunt the Manchester club as Liverpool are now interested in the player, reports the Telegraph, but it depends on the new sporting director and manager.\nLiverpool are interested in signing Marc Guehi this summer but bid will depend on sporting director and manager appointments. Manchester United could rival Liverpool if Dan Ashworth can be appointed in time…#lfc #mufc #cpfc https://t.co/rVWFILYvN2\n— Matt Law (@Matt_Law_DT) February 20, 2024\nLiverpool are set to lose Joel Matip this summer as the centre-back’s contract expires at Anfield. The Reds will very likely want to replace him and that is a role Guehi could fill.\nIt is uncertain if the Crystal Palace star will still cost £60m in the summer but that seems a reasonable fee for the 23-year-old given that he is a proven Premier League talent.\nHowever, Man United could still tempt the centre-back to move to Old Trafford and given that the player has been on their radar for longer, that might benefit them. Although if the Merseyside club have Champions League football over the Red Devils, that will likely outweigh it.",
  "word_count": 283,
  "scraped_at": "2026-02-14T01:56:44.625925",
  "_text_extracted": true
}