{
  "article_id": "86dce0dde829",
  "url": "https://hudsonriverblue.com/taty-castellanos-nycfc-scores-four-goals-real-madrid/",
  "title": "Taty Castellanos scores four goals against Real Madrid",
  "date": "20230425T204500Z",
  "domain": "hudsonriverblue.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The four goals Taty Castellnaos scored against Real Madrid today is the biggest redemption story in global football, and arguably the finest attacking performance by a former MLS player in La Liga. We’re here for all of it.\nCastellanos might now suit up the red of Girona FC red instead of the sky blue of New York City FC, but we follow every goal (and every yellow card) he logs over in La Liga. Today he put on what was easily the most impressive 90 minutes of his career when he scored four goals against a Real Madrid that just last week booked their ticket to the UEFA Champions League Semifinals with a commanding win over Chelsea FC.\nIt was a historic performance. According to the Guardian, it was the first time this century that any player has scored four times against Madrid. The upset victory lifted Girona to 9th place on the table, which puts a comfortable gap between them and the relegation zone in the club’s first year back in La Liga.\nCastellanos now has 11 goals in La Liga this season, which brings him even with Atlético Madrid’s Antoine Griezmann in eighth place on the leaderboard. One more goal and Castellanos could climb into fourth place. By comparison Madrid’s Vinícius Júnior, who scored a consolation goal today, is now tied for ninth place with 10 goals.\nFour goals\nTaty’s first goal was a clinical header he buried in the 12th minute, professional and crisp:\nThe second goal was far more dramatic — a long ball over the top, a bit of skill to control it and a bit of physicality to withstand a push from the defender, then a cold-hearted shot that nutmegs the goalkeeper to find the back of the net:\nThe third goal is the result of some team flair. First there’s the cross from the left, then an acrobatic dummy from a teammate, and finally Taty’s chopping shot that catches the Madrid defense unaware:\nTaty’s fourth goal is all vibes. A long cross from the top of the box, a glancing header, a big night in Girona:\nRedemption after Barca miss\nThe four goals against Madrid are all the more poignant after Taty’s heartbreaking miss against FC Barcelona earlier this month. Taty was one-on-one with goalkeeper Marc-André ter Stegen — after sprinting into the penalty box he eased off the throttle to better pick out his shot but then sent the ball wide.\nTaty left the game in tears. A video of the despondent striker sobbing in the dressing room after the game went global. Taty suspended his social media accounts that night.\nDo these four goals make up for that miss? Maybe. In some ways, the second goal Taty scored today was a re-do of the Barcelona miss. Take a look and compare for yourself:\nRELATED: NYCFC have the youngest attack in MLS\nAn annual tradition\nThis four-goal display marks an anniversary of sorts. A little over one year ago – on April 17, 2022, to be exact – Castellanos scored a club-record four goals for NYCFC in their 6-0 win over Real Salt Lake. Looks like Taty is making the four-goal thing against a Real team an annual tradition.\nThat NYCFC win was vital for a club exhausted after a short offseason and a brutal travel schedule for the CONCACAF Champions League. The 6-0 scoreline put some MLS Cup-winning swagger back into the team, and started the club on a nine-game undefeated streak that saw New York City take 22 points out of a possible 27.\nLet’s hope that Girona experiences a similar four-goal bounce.\nFotMob gave Castellanos a stellar 9.6 rating and Player of the Match honors. That sounds like quite an accomplishment, although the Athletic’s Tom Bogert had a more gimlet-eyed response:",
  "word_count": 632,
  "scraped_at": "2026-02-14T01:50:29.470132",
  "_text_extracted": true
}