{
  "article_id": "872e3ad024c0",
  "url": "https://www.wcvb.com/article/revolution-goalkeeper-djordje-petrovic-to-chelsea-tomas-vaclik-to-new-england/44917780",
  "title": "Revolution Petrović signed by Chelsea ; New England signs new keeper",
  "date": "20230826T224500Z",
  "domain": "wcvb.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Revolution goalie Petrović signed by Chelsea; New England signs new keeper\nNew England Revolution goalkeeper Djordje Petrović, an MLS All-Star, is now officially a member of Chelsea Football Club following a transfer.\nChelsea announced Saturday that Petrović signed a seven-year deal that includes a club option for an additional year at the London-based club that has won five Premier League championships and two UEFA Champions League titles.\nNeither the Revolution nor Chelsea disclosed the transfer fee for Petrović, but ESPN reported that the fee was worth up to £14 million ($17.6 million).\nPetrović, 23, started 43 regular-season matches for the Revolution over the past two seasons, during which he posted 14 shutouts and made an MLS-leading 184 saves in that time span. His 1.20 career goals against average across 48 matches in all competitions is the best mark in the club's history among qualifying goalkeepers.\nThe Serbia native finished second in the MLS Goalkeeper of the Year voting in 2022, a season in which he was named the Revolution Team MVP and Players' Player of the Year.\n\"Playing in the Premier League is something I’m really looking forward to doing and I hope to learn many things here at Chelsea. I can’t wait to meet everyone and play at Stamford Bridge,\" Petrović said in a statement.\nPetrović is the latest newcomer at Stamford Bridge following a spending spree of more than $1 billion over the last 18 months by the club's American ownership fronted by Todd Boehly and Clearlake Capital.\nAbout an hour after announcing Petrović's transfer to Chelsea, the Revolution announced that they had signed goalkeeper Tomáš Vaclík through the 2024 season with a club option for 2025.\nVaclík, 34, has 16 years of professional experience in Europe. The Czech Republic native most recently played for Huddersfield Town, a team in the second division of English soccer. He has also played for Olympiacos in Greece (2021-23), Sevilla in Spain (2018-21), FC Basel in Switzerland (2014-18) and three teams in his home country: Sparta Prague (2012-14), Viktoria Žižkov (2010-2012) and Vítkovice (2007-2010).\nHe has 25 career appearances in the UEFA Champions League, Europe's top club competition, and has played 54 times for the Czech national team. He was the starting goalkeeper for the Czech Republic during the 2020 UEFA European Championships.\nInformation from The Associated Press was used in this report.",
  "word_count": 391,
  "scraped_at": "2026-02-14T01:56:26.902586",
  "_text_extracted": true
}