{
  "article_id": "874b66d47380",
  "url": "https://www.the42.ie/arne-slot-tactics-6687052-Apr2025/",
  "title": "How Arne Slot improbably guided Liverpool to the brink of the Premier League title",
  "date": "20250427T071500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LIVERPOOL WILL BE champions later today if they avoid defeat at home to Tottenham, thereby confirming an outcome that has looked inevitable for weeks. It’s a stunning achievement for Arne Slot in his debut season in England: here we look at some of the decisions underpinning his incipient success.\nMaximising Salah\nJurgen Klopp’s greatest Liverpool team maintained a creative tension between Mohamed Salah and Sadio Mane.\nBoth played with each other while competing to become accepted as the best African player of their generation, and the fault lines in their relationship were occasionally on public display.\nSalah won the war when Liverpool jettisoned Mane to Bayern Munich in 2022, but Slot’s indulgences of Salah have gone further than Klopp’s ever did.\nThe primary reason Liverpool will win the league this season is down to Slot’s decision to build his team around Salah. He has largely been exempt from defensive duties, with Dominik Szoboszlai a key cog in the midfield, as he does Salah’s running for him. (The fall guy here has been Harvey Elliot, who is technically brilliant but physically limited, and thus hasn’t started a Premier League game all season.)\nFurthermore, Trent Alexander-Arnold’s role was simplified, no longer inverting into midfield but kept at right-back, from where he could supply Salah with dead-eyed accuracy from long range, allowing for fast breaks. (Liverpool lead the league in goals from counter attacks, despite averaging the third-highest possession across the whole league.)\nSalah has responded with a truly remarkable output. As it stands, Salah has 27 goals and 18 assists in 33 appearances, and looks certain to win the golden boot along with the award for the league’s top assist provider.\nThis may be an unsustainable set-up as Salah ages and, crucially, once Alexander-Arnold takes flight for Madrid. (It’s hardly a coincidence that Salah’s recent dip in form came while Alexander-Arnold was injured.)\nBut whatever about the future, Slot’s was one hell of a strategy for the here and now.\nDefensive solidity\nLiverpool don’t quite have the best defensive record in the league – Arsenal have conceded two goals fewer than their 31 – but their goals conceded per game average is the lowest its been since the 2021/22 season, when they collected 92 points and missed out on the title by a single point.\nThe bedrock of this incipient title victory was their fast start, winning 11 of their first 13 games, first going top after the sixth round and staying there from matchday nine onwards.\nLiverpool opened with three consecutive clean sheets against Ipswich, Brentford and Manchester United, the first time Liverpool had gone three-straight league games without conceding since March 2023.\nThere followed further clean sheets in key wins at home to Aston Villa and Manchester City.\nThe enduring class of Virgil van Dijk, the early-season form of Ibrahima Konate and the contributions of Caoimhín Kelleher all played important role in this new-found solidity, but most important was Slot’s greater caution. Where Liverpool would sling the ball forward as quickly as possible under Klopp and thus leave themselves open to counters, Slot’s more patient build-up has left them less susceptible to turnovers.\nIt will be interesting to see for how much longer this remains an uncomplicated strength, however: there were times, especially in the Champions League tie at home to PSG, the Anfield crowd were beseeching the team to attack in the manner of Klopp’s side, only to be frustrated as the team sought patience instead.\nBut as their early-season challengers foundered, Liverpool built what has become an glorious run-in.\nDouble Dutch\nVirgil van Dijk’s performances this season have been superb, but customary. Where Slot has found an edge on league rivals is by provoking a big improvement from a couple of their compatriots, Cody Gakpo and Ryan Gravenberch.\nHe’s improved both by changing their positions: Gakpo has been moved from the centre to the left of the front three and has become much more effective, 16 goals and six assists in all competitions. An ankle injury was poorly-timed around the PSG tie and the Carabao Cup final, for which Gakpo returned but was clearly unfit.\nMeanwhile, Liverpool tried to sign Spanish midfielder Martin Zubimendi ahead of the season, to plug a gap Klopp had previously tried to fill with that madcap dash for Moises Caicedo. But ater Zubimendi became the latest holding midfielder to say no to Liverpool, Slot turned to Gravenberch, who had been playing in a more advanced midfield role under Klopp. He proved a revelation.\nHis performances have dipped in recent weeks: next season will tell us if that’s just down to fatigue, or the consequence of opponents adjusting and pressing him more aggressively. Either way, Slot’s tinkering solved a problem position for this season.\nImproved injury record\nIn the land of a berserk match schedule, the team that suffers the fewest injuries will be king. Hence why Liverpool’s recruitment team factored in player availability when hiring Klopp’s successor, and why sports science specialist Ruben Peeters followed Slot to Liverpool. This was an admission from Liverpool that injuries are partly but not entirely down to bad luck: preparation and training regimes play a role, too.\nTake a look at the injury table from this season and you’ll understand why Liverpool are about to clinch the title before April is out. Where Liverpool are 11th – ie they had the 11th-highest number of player injuries this season – Arsenal are top, having suffered more injuries than any other side.\nWhere an injury-free Mohamed Salah has played 2,921 minutes, a hamstring-encumbered Bukayo Saka has clocked 1,454 minutes. (Salah, to be fair, has still outscored Saka four to one.)\nLiverpool’s injury record is made all the more impressive given their intense schedule – no other side ranked eighth and lower in the injury table played European football this season – and that they have used the second-fewest number of players this season. Slot has selected 24 different players in the league this season, the same as have been picked by Newcastle and one player more than Nottingham Forest.\nSlot’s lack of rotation has perhaps caught up with Liverpool in recent weeks, and they looked zapped of energy in the Carabao Cup final in particular.\nBut that lack of change is at least partly because Slot doesn’t trust some of the options available to him, which only goes to accentuate his achievement: Arne Slot will win the Premier League title in his debut season, and he’s done it with somebody else’s squad.",
  "word_count": 1083,
  "scraped_at": "2026-02-14T01:52:20.887717",
  "_text_extracted": true
}