{
  "article_id": "875520915b79",
  "url": "https://thepeoplesperson.com/2023/01/10/man-united-club-insider-brands-transfer-dealings-chaotic-as-horrific-details-emerge-257802/",
  "title": "Man United club insider brands transfer dealings  chaotic  as horrific details emerge",
  "date": "20230110T134500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s transfer dealings have been slammed as “chaotic” by insiders at the club, according to a new report.\nThe club has only one recognised striker on the books and is struggling to recruit more this month, with no funds available following a summer overspend.\nAccording to The Athletic, director of football John Murtough and head of recruitment Steve Brown are running a system based on a database created by Murtough called “TrackerMan”, which contains information on players accumulated from United’s 140-strong scouting network.\nThe implication in the report is that this system has been largely ineffective. The club only recently (October 2021) appointed a data analyst, Dominic Jordan, to modernise things, although the appointment was slammed due to his lack of football background, having come from the fashion industry.\n“Murtough and Brown are convinced United are better equipped to make good choices than they have been at any point post-Ferguson,” reporter Laurie Whitwell says.\n“The Athletic has spoken to former employees who would challenge that assertion, and during last year’s summer window, the club’s business touched on the chaotic.”\nWhitwell says that while the five stars signed in the summer – Casemiro, Antony, Tyrell Malacia, Lisandro Martinez and Christian Eriksen – have all done well, “the cost of recruiting that quintet exceeded the original plan to such a degree that the budget for this month has United only looking at loan deals.”\nUnited were slow to operate last summer, which “senior figures” suggest was partly because the club could not tell prospective signings who the manager would be until the end of April.\nBut time was also wasted on the pursuit of Frenkie de Jong from Barcelona, which took up most of the summer.\nIndeed, Whitwell claims that the season had already started before meetings were called to draw up a list of alternatives.\n“Multiple senior figures at Old Trafford felt the club should have moved on from [De Jong] sooner,” the report continues.\nIt was only after United’s opening day humiliation at the hands of Brighton that the recruitment team decided to act. A long meeting was held at Carrington “to assess the options” and Casemiro was identified as the top target.\n“People who work elsewhere in football found it astonishing decisions of that significance were being made at United after the season had started,” the reporter claims.\nAnother reason for the club’s ineptitude in transfer dealings is club owner Joel Glazer’s insistence on micro-managing everything and signing off on “all spending — even minimal fees”. This is something that Whitwell has mentioned on numerous occasions before. He adds that waiting for Glazer’s sign off is “a time-consuming aspect of recruitment to navigate.”\nOne agent is quoted as describing United’s decision makers as “flaky”, adding “nobody makes a decision unless everyone agrees.”\n“One owner of an EFL club inquiring about loans of United players was astonished at the amount of time taken over what appeared small-fry deals for a club their size,” Whitwell adds.\nThe journalist also reports that when good scouting work is done, it tends to get lost in the system and good leads are missed altogether. One such example relates to a Champions League winner “who is regarded as among the best in the world”.\n“Dozens of reports were filed into United on him from the time he was 13 years old, the consistent message being that the club must sign him. Nobody at Carrington responded by email or phone until the player joined another big European club years later,” Whitwell writes.\nThe report even claims that former manager Ole Gunnar Solskjaer signed Amad Diallo without even having seen him play, believing he was being signed for the academy, whereas he was actually bought as a first team squad addition.\nThere is a sense through the article that current manager Erik Ten Hag is being given a great deal of power now in the recruitment process and that is helping to focus the effort.\nHowever, there is also some concern that if the Dutchman were to move on, the club would be left with a group of players with a very particular profile who might not fit any other manager’s system.\nUnited Matchday Magazine – be in the know about everything in red!\nStill itching for more United content? Get everything you need right here. For just £1.25 per issue/£3.75 a month you’ll receive unique insights into United, straight to your inbox – before every match and throughout the month.\n- Get the exclusive build-up to each match, plus team news, tactics and history.\n- Not only that – United Matchday is jam-packed with articles, news, transfer news, puzzles, nostalgia and humour.\n- Impress your friends and be in the know about everything in red!",
  "word_count": 790,
  "scraped_at": "2026-02-14T01:53:21.844006",
  "_text_extracted": true
}