{
  "article_id": "876c4f4d3788",
  "url": "https://www.90min.com/posts/david-raya-opens-up-really-good-relationship-aaron-ramsdale",
  "title": "David Raya opens up on  really good  relationship with Aaron Ramsdale",
  "date": "20231227T163000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "David Raya opens up on 'really good' relationship with Aaron Ramsdale\n- David Raya has usurped Aaron Ramsdale at Arsenal\n- Spain international dismissed claims their relationship is frosty\n- Ramsdale expected to be allowed to leave at end of season\nBy Sean Walsh\nArsenal's David Raya has insisted his relationship with teammate Aaron Ramsdale is \"really good\" despite taking his starting spot this season.\nThe Gunners signed Raya on an initial loan from Brentford back in August, though 90min understands they intend to make this deal permanent. After watching on from the bench in three matches prior to the season's first international break, Raya has started every Premier League game he's been eligible for since as well as five of Arsenal's six Champions League group stage fixtures.\nRaya's gain has been Ramsdale's loss. The England international, who was voted into the 2022/23 PFA Team of the Year, has been relegated to the sidelines and has been increasingly linked with a move away in search of regular minutes.\nSpeaking to Arsenal's website, Raya said he gets on well with Ramsdale, but ultimately his focus is on helping the club achieve their goals.\n\"It's a big thing when another goalie comes to a club,\" Raya said. \"Aaron had a magnificent season last year so I'm just here to help the team to win the games when the gaffer puts me in.\n\"My relationship with Aaron is really good. We're teammates and try to make each other better in every single session. We don't try to hear what the outside world is saying, just focus on the team.\n\"I'm enjoying every time I go out there, playing football and doing what I love, especially enjoying every single training session as well. It's incredible to be part of this football club and hopefully we can fight for the title.\n\"A club of this level, you cannot drop at any point. We want to fight and try to win as many titles as we can, so it's very demanding. For me now, experiencing new things, it's very demanding. The teams in the top six and top 10 are behind us so we have to keep on our toes and try to win every single match.\"\n90min understands Arsenal would be willing to allow Ramsdale to leave at the end of the season, but an exit during the January transfer window is unlikely. Chelsea and Newcastle United are believed to be long-term admirers of his.",
  "word_count": 410,
  "scraped_at": "2026-02-14T01:56:38.136909",
  "_text_extracted": true
}