{
  "article_id": "877f0e09ec51",
  "url": "https://www.westmeathexaminer.ie/2023/11/27/pep-guardiola-describes-incredible-impact-of-terry-venables-at-barcelona/",
  "title": "Pep Guardiola describes  incredible  impact of Terry Venables at Barcelona",
  "date": "20231127T211500Z",
  "domain": "westmeathexaminer.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Pep Guardiola describes ‘incredible’ impact of Terry Venables at Barcelona\nBy PA Sport Staff\nPep Guardiola has hailed Terry Venables as an inspirational and visionary leader following the former England manager’s death at the age of 80.\nGuardiola, the Manchester City boss, remembers well the impact Venables had at his boyhood club Barcelona in the 1980s.\nGuardiola was both a ballboy and a youth player at the Nou Camp when Venables coached the Spanish giants, guiding them to the domestic title in 1985 and the European Cup final the following year.\nA photograph has emerged on social media of a young Guardiola looking on from pitchside as Venables celebrated one particular triumph.\n“As a Barcelona fan, he gave us La Liga after 11 or 12 years,” said Guardiola, who went on to captain and manage Barcelona himself. “His impact there was incredible.\n“In that era I was 13 or 14 years old. It was the first time I saw us win La Liga. For many years it was not possible because of other teams.\n“He introduced something that had never been (done there) before, especially a certain type of pressing and the set-pieces. He introduced many, many things.\n“A true gentleman for the people. Unfortunately, he could not win the Champions League in that time, with the final against Steaua Bucharest, but it’s a big loss for English football.\n“I was a ballboy so I wasn’t in contact with him, I just gave the ball to his players, but I remember talking to friends of mine, who did play with him, and their words for him were not just as a manager but as a person – so funny, appearing on programmes, singing Frank Sinatra.\n“He was a proper, proper man. I am so sorry for his family.”\nFormer England goalkeeper David Seaman has also paid tribute to Venables.\nSeaman was England’s number one when they reached the semi-finals of Euro 96.\nThe 60-year-old told Good Morning Britain: “First of all it was a really sad day yesterday and when I started seeing the clips and all the tributes coming in, all I could remember was the smile on his face. He always had a smile on his face even when he was angry, if I’m honest.\n“He was just a great guy, he was brilliant at man-to-man management.\n“He was just brilliant and with Euro 96 everything just got better and better and I’ll never forget the day before Euro 96 and he came up to me when he just got the job, looked me straight in the eyes and said, ‘You’re my England number one’ and the confidence I gained from that was just brilliant and something I’ll never forget.”\nGareth Southgate missed the all-important penalty in the Euro 96 semi-final shoot-out loss to Germany.\nSeaman recalled memories during his time under Venables and drew comparisons with the current England boss, insisting Southgate has learned a lot from ‘El Tel’.\nHe continued: “You didn’t feel that disappointed because he actually told us that we had achieved something special here.\n“I know we had gone out in the semi-final but he wanted us to know we had really achieved something. We got England to the semi-final at Wembley and the most important thing he’d done was that the England fans started loving the England team again because of the way we played. He was just a really nice guy.\n“Gareth will have learned a lot from Terry because Gareth very rarely loses it and that’s what Terry was like. He was always calm and confident and that’s what he’s learned from him that you don’t have to be really loud on the sidelines. You’d just watch and learn.\n“The way Terry treated Gareth, it just shows you the class of the manager and he was just a really special guy.”",
  "word_count": 641,
  "scraped_at": "2026-02-14T02:07:27.057591",
  "_text_extracted": true
}