{
  "article_id": "878f6866fcad",
  "url": "https://mufclatest.com/xi-prediction-sesko-to-continue-goalscoring-against-liverpool-lammens-to-start/",
  "title": "XI Prediction : Sesko to continue goalscoring against Liverpool ? Lammens to start ? ",
  "date": "20251018T151500Z",
  "domain": "mufclatest.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool -v- Manchester United\nPremier League\nAnfield, Liverpool\nSunday 19th October 2025; KO 16:30 BST\nManchester United travel the short distance to Anfield to face Liverpool in the Premier League on Sunday afternoon. Ruben Amorim’s side got a victory over Sunderland in the last Premier League match prior to the international break so he will be pushing for a good result on Sunday.\nUnited have struggled to find form this season but now there is no excuse to string some performances together starting on Sunday to better the clubs league position and push to achieve something. The media would be upset as they want another sacking at the club.\nUnited sit in tenth place in the league prior to any matches being played on Saturday with Liverpool sitting in second place – just five points separate the two teams, which considering United are being criticised for a poor start – is not that bad at this stage of the season.\nManchester United Top Scorers & Assists\n⚽️ 2 – Bruno Fernandes, Bryan Mbeumo, Benjamin Sesko, 1 – Casemiro, Harry Maguire, Mason Mount\n🅰️ 1 – Amad, Diogo Dalot, Patrick Dorgu, Harry Maguire, Kobbie Mainoo, Bryan Mbeumo, Mason Mount, Leny Yoro\nLiverpool Top Scorers & Assists\n⚽️ 5 – Hugo Ekitiké, 3 – Mohamed Salah, 2 – Federico Chiesa, Cody Gakpo, Ryan Gravenberch, 1 – Jeremie Frimpong, Alexander Isak, Rio Ngumoha, Andrew Robertson, Dominik Szoboszlai, Virgil van Dijk\n🅰️ 3 – Mohamed Salah, 2 – Federico Chiesa, Cody Gakpo, Ryan Gravenberch, Dominik Szoboszlai, 1 – Hugo Ekitiké, Wataru Endo, Alexander Isak, Alexis Mac Allister, Florian Wirtz\nPredicted Manchester United XI:\nLammens;\nYoro, De Ligt, Shaw;\nDalot, Fernandes, Casemiro, Dorgu;\nMbeumo, Mount;\nSesko\nPredicted Liverpool XI:\nMamardashvili;\nBradley, van Dijk, Konate, Kerkez;\nGravenberch, Mac Allister;\nSalah, Szoboszlai, Gakpo;\nIsak\nGoalkeeper: Senne Lammens\nSenne Lammens should be starting against Liverpool on Sunday. The Belgian goalkeeper showed his stature in goal against Sunderland and it was much better than both Andre Onana and Altay Bayindir over the last two seasons. Lammens should be United’s number one goalkeeper.\nUnited need a goalkeeper that is able to command his area and make himself big on goal – just like Peter Schmeichel, Edwin van der Sar and David De Gea. Lammens is that man at this time, especially going into an important match against Liverpool. This is his moment to shine.\nBayindir will be on the bench for United, should a change need to be made but in all honesty, I would not like to see that happen. Perhaps United will be fine this season with Lammens in goal but in terms of beyond this season, I don’t see a future for Onana nor Bayindir.\nDefence: Leny Yoro, Mathijs De Ligt, Luke Shaw\nUnited’s defence will need to have the key attributes of United of old going into a clash with Liverpool at Anfield. United will need, fight, character and ability to command their area and get the better of Liverpool’s attacking players – which this team is capable of.\nLeny Yoro should be starting on the right side off the back three as he has the ability, guile and determination to fight for United and get the better of his opposition. In the centre of the back three Mathijs de Ligt should be starting. His experience in the game is second to none.\nOn the left side of the defence, Luke Shaw should keep his place as he has risen from the doldrums this season and seems to be determined to get the better of the rough last few years he has had and wants to change everything and enter the twilight of his career in good form.\nMidfield: Diogo Dalot, Bruno Fernandes, Casemiro, Patrick Dorgu\nUnited’s midfield requires some attention in January or in the summer but for now, United will need to make do with what they have. On the right side of midfield in the wing back position, Diogo Dalot should start. He has the experience to do well against Liverpool.\nOn the left side in the wing back position, Patrick Dorgu should be starting. He has the pace and ability to get the better of his opposition, both in attack and defence. He could be a good signing for United in this position. United need pace and width from these positions.\nIn the centre of the midfield, Bruno Fernandes will continue playing a much deeper role for the club and should be partnered with Casemiro, who seems to be determined to have a good season. United will need help in the midfield to get the better of Liverpool’s attacking players.\nAttack: Bryan Mbeumo, Benjamin Sesko, Mason Mount\nUnited’s attacking line will need to be at the top of their game against Liverpool. Benjamin Sesko should lead the line as he has two goals in his last two appearances, which will mean he is determined to find goals against Liverpool, which would be brilliant for him and United.\nBryan Mbeumo should keep his place too. He has two goals and one assist so far this season and has been the better attacking player the club signed in the summer. What a player he is going to be for United when he has fully settled in his role and the system the club had adopted.\nMason Mount should start ahead of Matheus Cunha against Liverpool. The way he has played in the last few matches shows that he is a player determined to have a good season. He has one goal and one assist this season and wants to build on that and get in the mix of scoring goals.\nSubstitutes: Altay Bayindir; Harry Maguire, Ayden Heaven, Tyler Fredricson; Manuel Ugarte, Kobbie Mainoo; Matheus Cunha, Joshua Zirkzee, Amad\nUnited will have nine players on the bench against Liverpool. Altay Bayindir will be the goalkeeper on the bench, or perhaps Tom Heaton? In defence, Harry Maguire, Ayden Heaven and Tyler Fredricson should all be available should they be required.\nIn midfield, Manuel Ugarte and Kobbie Mainoo should be available. United need competent midfielders at the club and it does not look like any of them are commanding at this stage of the season, which is a major problem that Amorim and United will need to overcome.\nIn attack, Matheus Cunha, Joshua Zirkzee and Amad should all be available. Cunha has no goals or assists to his name this season and Zirkzee has been used sparingly. Amad is perhaps the player that is likely to get on they pitch with Dalot likely to tire in the second half.\nMatch Prediction\nUnited need to take on the might of Liverpool like they did with Chelsea – push for an advance from the start of the match and use the strengths of the players to find goals – that shock and awe could be enough to get the better of this team, who seem to think they are invincible.\nLiverpool are on a three match losing streak in their last three matches. They have lost to Crystal Palace and Chelsea by the same 2-1 scorelines and 1-0 to Galatasaray in the UEFA Champions League. This means they are in a tough position ahead of this clash with United.\nUnited getting the better of Liverpool will be a great feeling as for some time now the supporters of that club seem to think they are the best thing since sliced bread and it is pretty pathetic. Two Premier League titles in the Premier League era is pathetic. Best club in England. No way!\nLiverpool 1-2 Manchester United\nWritten by Paul\nDiscover more from Daily Man Utd News\nSubscribe to get the latest posts sent to your email.",
  "word_count": 1278,
  "scraped_at": "2026-02-14T01:52:49.023597",
  "_text_extracted": true
}