{
  "article_id": "87a770e4ad38",
  "url": "https://www.france24.com/en/live-news/20240416-versatile-rodrygo-madrid-s-low-key-weapon-at-man-city",
  "title": "Versatile Rodrygo Madrid low - key weapon at Man City",
  "date": "20240416T043000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Versatile Rodrygo Madrid's low-key weapon at Man City\nMadrid (AFP) – Real Madrid visit Manchester City on Wednesday bidding to reach the Champions League semi-finals and forward Rodrygo Goes may hold their key to success.\nIssued on:\nRodrygo struck twice in a late blitz against Manchester City in 2022 to help Madrid knock the English side out and was on target again in the 3-3 quarter-final first leg draw last week.\nWhile his Brazilian compatriot and strike partner Vinicius Junior and England international Jude Bellingham draw most of the attention, Rodrygo flies by under the radar.\nRodrygo's goals tend to come in fits and starts and with three in his last two games, the forward may have hit a new purple patch at a crucial moment.\nIn the first leg Madrid coach Carlo Ancelotti deployed Rodrygo on the left of the attack, a position where he has been used sparingly, more often on the opposite flank.\nThe forward netted after 14 minutes to put his team 2-1 up, escaping into space down his wing, his shot deflecting off Manuel Akanji and past Stefan Ortega.\nContent to play wherever and whenever the coach deems necessary, Rodrygo is a versatile weapon for Ancelotti.\n\"They didn't expect me to be on the left, we did it differently today and it went well,\" Rodrygo said after the thriller at the Santiago Bernabeu.\n\"We have to win there, it's all open -- whoever makes the fewest errors will go through.\"\nMadrid made several of those last season at City, thrashed 4-0 in the semi-final second leg which saw Pep Guardiola's side sail through to the final 5-1 on aggregate.\nLos Blancos licked their wounds and have come back stronger this season, leading the Spanish top flight by eight points and looking sharper with Vinicius and Rodrygo backed up by Bellingham in attack.\nRodrygo has superb poise on the ball and dances slickly and effortlessly around defenders, with his movement making him hard to track.\nMadrid will be looking to hurt Manchester City on the counter-attack at the Etihad Stadium and he is one of their best tools in transition situations.\nAncelotti has kept faith in Rodrygo through dry spells at times this season.\nAfter he failed to find the net in 11 appearances between August and October, he went on to score eight goals in the next eight games.\n\"If they say to you 'Think about any animal apart from the cat', you only think of the cat,\" Ancelotti said in February.\n\"To Rodrygo, I will not speak to him about goals, I'll never speak to him about goals.\"\nBig moments\nDespite gaining revenge last season by hammering Madrid on the way to winning the trophy for the first time, Rodrygo's stunning late brace in 2022 still haunts City supporters.\nThe Brazilian pounced in the 90th and 91st minutes to force the semi-final second leg to extra time when it seemed City had booked their ticket to the Paris final.\nKarim Benzema's penalty helped Madrid progress against a shellshocked City and Los Blancos went on to win the trophy for a record 14th time.\nRodrygo has won every trophy possible in club football at just 23 years old.\nOne competition Madrid have struggled in during the last decade is the Copa del Rey, but Rodrygo's double helped them to a 2-1 win over Osasuna to lift the cup in 2023.\nIt was Madrid's first Copa triumph since 2014 and Rodrygo's goal the quickest in a Spanish cup final for 17 years.\nIn the Champions League quarter-final second leg against Chelsea last season Rodrygo hit another brace to secure Madrid a 2-0 win at Stamford Bridge.\nThese decisive interventions make Rodrygo a pivotal man for Madrid on the big occasion and raise questions about how the team will set up if they capture Paris Saint-Germain forward Kylian Mbappe in the summer.\nMany predict Rodrygo would be the player to lose his place -- but Madrid will cross that bridge when they come to it, hoping to carry a record-extending 15th Champions League trophy.\n© 2024 AFP",
  "word_count": 680,
  "scraped_at": "2026-02-14T01:51:24.800657",
  "_text_extracted": true
}