{
  "article_id": "87bead72c330",
  "url": "https://thenationonlineng.net/champions-rangers-crowned-in-style/",
  "title": "Champions Rangers crowned in style - The Nation Newspaper",
  "date": "20240624T041500Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nJune 24, 2024 by Our Reporter\nChampions Rangers crowned in style\n- Enyimba, Remo Stars grab continental tickets\n- Sporting Lagos relegated\nEnugu Rangers were yesterday crowned Nigeria Professional Football League (NPFL) champions in style after they beat hosts Gombe United 2-1 to finish top of the standings on 70 points from 38 matches.\nRangers will represent Nigeria in the CAF Champions League.\nKazeem Ogunleye put Rangers ahead in Jos after just three minutes.\nGodwin Obaje then scored his 12th goal of the season in the seventh minute for ‘The Flying Antelopes’ to stay ahead 2-0.\nAnas Hassan then pulled a goal back for already relegated Gombe United on 25 minutes.\nRangers are expected back in Enugu today on a chartered flight before they embark on a trophy parade at Okpara Square later that day.\nMeanwhile, Remo Stars and Enyimba will represent Nigeria on the continent after both teams won their final games of the season today.\nRemo Stars beat visiting Katsina United 2-1 to finish as runners-up on 65 points, five points adrift of champions Enugu Rangers.\nThey will play in the CAF Champions League along with Rangers.\nLast season champions Enyimba stopped Plateau United 2-0 at home to finish third on 63 points and they will feature in the second-tier CAF Confederation Cup.\nRead Also: Gov. Mbah congratulates Rangers for winning NPFL title\nMeanwhile, Sporting Lagos suffered relegation after they were undone by a 1-0 defeat away to Shooting Stars in Ibadan\nThe Noisy Lagosians dropped to the second tier Nigeria National League (NNL) with Doma United to the who were held to a 1-1 draw by President Federation Cup finalist, Abia Warriors at the Pantami Stadium.\nIn a related development, Enyimba striker Chijioke Mbaoma has won the Eunisell Boot as the top scorer in the NPFL for the 2023/24 season.\nHe succeeds another Enyimba striker, Emeka Obioma, who was top scorer last season\nMbaoma netted his 17th goal of the season in yesterday’s final game against Plateau United in Aba while Sikiru Alimi of Remo Stars netted 15 goals\nNPFL RESULTS\nGombe United 1-2 Rangers\nKano Pillars 3-2 Lobi Stars\nShooting Stars 1-0 Sporting Lagos\nDoma United 1-1 Abia Warriors\nEnyimba FC 2-0 Plateau United\nKwara United 4-0 Heartland\nNiger Tornadoes 2-1 Sunshine Stars\nInsurance 0-2 Bayelsa United\nAkwa United 3-1 Rivers United\nRemo Stars 2-1 Katsina United",
  "word_count": 392,
  "scraped_at": "2026-02-14T02:13:55.816328",
  "_text_extracted": true
}