{
  "article_id": "87cd478535d5",
  "url": "https://theathletic.com/4819605/2023/08/30/time-wasting-uefa-player-welfare/",
  "title": "UEFA concerned added time for time - wasting will harm player welfare",
  "date": "20230830T194500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "European football’s governing body UEFA will not be joining the global crackdown on time-wasting, as it believes the increasing amount of added-time being played in the Premier League and elsewhere is damaging player welfare.\nFIFA, UEFA’s international counterpart, has been encouraging match officials to add more time at half-time and full-time to compensate for the minutes taken out of the game by goal celebrations, substitutions and VAR checks.\nAdvertisement\nThis led to matches at the men’s World Cup in Qatar last year routinely going beyond 100 minutes in total playing time and the International Football Association Board (IFAB), the organisation that oversees the laws of the game, has subsequently backed the initiative.\nUEFA, however, is not on board.\nWhen asked by reporters if fans can expect similar match durations in this season’s European club competitions, UEFA chief of football Zvonimir Boban said: “It’s absolutely absurd.\nGO DEEPER\nWhy is there so much added time in the Premier League this season?\n“Regarding player welfare, it’s some kind of small tragedy or big tragedy because we are adding almost 12, 13, 14 minutes.\n“We are adding almost one half of the game. I can speak from experience, especially as a midfielder, (but) it’s the last 30 minutes of the game when you get tired. And then somebody comes and adds another 15 minutes of the game…for what reason?\n“How commonly have we spoken critically about the calendar and too many games. We are not listening to players and coaches — they are complaining all the time.\n“And now we add probably six, seven minutes more per game — for some, that’s almost 500 minutes more per season, that is six games.\n“It’s crazy. It’s too much, so we will not do this. Our guidelines are different.”\nThe former AC Milan and Croatia star was speaking at the launch of a pan-European recruitment drive for new referees that doubled up as a media briefing for how UEFA intends to referee its club and international games this season.\nRoberto Rosetti, the chairman of UEFA’s referees’ committee, backed Boban’s stance, saying UEFA had been working for five years on increasing the amount of time the ball is actually in play during its games. He pointed out that the effective playing time in Champions League games last season was just over 60 minutes, five minutes more than the average in the Premier League.\nAdvertisement\n“There is something more important than the accuracy of additional time,” said Rosetti. “Why do people like the Champions League so much? Because it’s intensive, it’s fantastic, the players never stop.\n“We tell our referees to speed up the restart of play instead of focusing on stoppage time.”\nFIFA, IFAB and UEFA are all on the same page, however, when it comes to improving standards of behaviour on and off the pitch, with Rosetti promising a significant crackdown this season on unsporting behaviour.\nThe Italian explained that UEFA is hosting a meeting of Europe’s leading referees at its headquarters in Nyon next week when it will tell them to hand out yellow cards to players who show dissent or crowd around a referee after a contentious decision. Any manager or coach who does this on the sidelines will be dismissed.\n“Enough is enough,” said Rosetti. “It is time to act, we need to be strong tomorrow and all season. The players prefer a strong referee to a weak one.\n“We have to do it. The message will be clear: be consistent, be strong.”\nWhen asked if UEFA had specifically spoken to Jurgen Klopp and Jose Mourinho, two of the game’s more notorious critics of refereeing standards, Rosetti said “no but we’re talking to you now — we trust you”.\nUEFA believes the crackdown on unsporting behaviour will help to recruit and retain more referees. Rosetti explained that about 15 per cent of referees quit the game each season and there was a shortfall of more than 40,000 referees across Europe, a situation that would only get worse if action is not taken.\nMaking referees’ jobs on the pitch easier is one part of UEFA’s approach, the other is encouraging more youngsters and former players to try refereeing.\nWith this in mind, UEFA is launching its first recruitment campaign,“Be A Referee!”, which includes a short film starring Premier League referee Michael Oliver, leading female referee Stephanie Frappart and former England manager Fabio Capello.\nAdvertisement\nUEFA is also keen to make referees’ lives easier in another regard, too: by simplifying what is and what is not a handball.\nRosetti said officials will be told that “not every touch is handball” and to concentrate on the few occasions when the handball really is intentional and the more common examples when players’ areas are away from the body, “not in a normal position”.\nHe said handballs that occur when players are not trying to make their silhouettes “unnaturally bigger”, when their arm is supporting their weight after they have gone to ground, or after the ball has been deflected, will not be penalised.\nHe also said that officials will be told not to award yellow cards for blocking shots on goal in the penalty area, unless they are intentional, as that would constitute “unsporting behaviour”, as the award of a penalty is punishment enough.\n(Photo: Stu Forster/Getty Images)",
  "word_count": 882,
  "scraped_at": "2026-02-14T01:50:52.140658",
  "_text_extracted": true
}