{
  "article_id": "87d4877eefcd",
  "url": "https://www.uefa.com/uefanationsleague/news/0282-183cd3275d58-92ac91cff04e-1000--dumfries-dutch-purpose/",
  "title": "Netherlands right - back Denzel Dumfries on the UEFA Nations League , Rotterdam and Croatian club - mates – interview",
  "date": "20230612T114500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Netherlands right-back Denzel Dumfries on the UEFA Nations League, Rotterdam and Croatian club-mates – interview\nWednesday, June 14, 2023\nArticle summary\n\"We are still a work in progress, but we also have a very talented team,\" said the right-back as the Netherlands look to unsettle Croatia in the UEFA Nations League.\nArticle top media content\nArticle body\nThe UEFA Nations League finals are bringing Netherlands right-back Denzel Dumfries home to Rotterdam, with the Inter player receiving another reminder of just how far he has come as the hosts take on Croatia in the semi-finals.\nAs a teenager at modest Barendrecht, Dumfries played a couple of games for Aruba, but always knew his destiny lay with the Dutch national team. Having worked his way up via Sparta Rotterdam, Heerenveen and PSV, the 27-year-old was a losing UEFA Champions League finalist with Inter this season, but hopes to grab a second chance at a trophy in his home city.\nOn taking on Croatia in the semi-finals\nI know two lads from Croatia very well of course, Ivan Perišić and [Marcelo] Brozović [who he played with at Inter]. After the draw we got in touch, especially me and Ivan, because we are good mates and will probably be playing against each other. So it will be a very special match, ignoring the fact that our goal is to get to the final.\nCroatia has a fantastic team with excellent players. They always do well at the big tournaments. They took third place at the last World Cup. A very tough team. We are still a work in progress, but we also have a very talented team with lots of individual qualities, who can be decisive in a match. It will be a really great match, but we do have to win.\nOn playing Nations League games in Rotterdam\nIs it special? Yes, definitely. No offence to Amsterdam, but De Kuip has a great atmosphere.\nOn being a late bloomer\nI always had faith that I would make it as a professional footballer. I was aware, however, of the fact that my path towards that goal would be slightly different to most professional footballers, but I have always been convinced that I would succeed. I am glad and feel blessed that I am able to play on this stage at this moment.\nWhen I was 17, I played two international matches for Aruba. I was playing for [BVV] Barendrecht at the time, for the Under-18s. Quite unexpectedly, I received an email from the Aruban Football Association saying they wanted to invite me to play in two friendlies with the national team. I immediately called the KNVB [Royal Netherlands Football Association], to ask them if this was possible and whether I would still be able to play for the Netherlands after that.\nBut they checked and said there was no problem. So I went to Aruba, played the two friendlies. It was a nice experience for someone playing for Barendrecht and who was still in school. But I already knew then that this would not be my final destination.\nOn writing 'I will play for the Dutch [national] team' on his bedroom wall as a child\nIt's true. I always had this strong conviction that I would. It was never a dream, but an objective; something I had to achieve. And along the way, you start to set out your path in more detail. You look at what you need to get better at and the fact that if you go in a certain direction, it will be easier. But I've always been a fan of the Dutch team and I knew that one day I would be part of it.\nIs there anything more I have written down? I've written down lots of things. Especially the steps in my career I needed to take. Certain clubs. It didn't exactly go the way I had mapped out, but my final destination was what I wrote on that wall.",
  "word_count": 663,
  "scraped_at": "2026-02-14T02:07:02.895392",
  "_text_extracted": true
}