{
  "article_id": "87e8b860cff5",
  "url": "https://weaintgotnohistory.sbnation.com/2024/8/18/24222838/chelsea-manchester-city-premier-league-preview-team-news-how-to-watch-tv-stream-online",
  "title": "Chelsea vs . Manchester City , Premier League : Preview , team news , how to watch",
  "date": "20240818T114500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Welcome to a new season.\nChelsea vs. Manchester City, Premier League: Preview, team news, how to watch\nWe’re back!\nIt’s been a long summer full of international football, transfer drama, and concerns over the direction of the club. We ended last season on a positive note and got back into Europe, finishing sixth. Now we’re essentially starting over. We’ve had some painful moments over the past 24 months. We might be in for a bit more.\nBut if we can’t be hopeful before a ball is kicked in anger, then when can we? So here’s to instant success for Enzo Maresca, continuous improvement for the team, and some fun football from the players.\nOh, and winning, of course.\nDate / Time: Sunday, August 18, 16.30 BST; 11:30am EDT; 9pm IST\nVenue: Stamford Bridge, SW6\nReferee: Anthony Taylor (on pitch); Michael Salisbury (VAR)\nForecast: sunny and warm\nOn TV: Sky Sports Main Event (UK); NBC, Telemundo (USA); Star Sports Select HD1 (India); SuperSport Premier League (NGA); elsewhere\nStreaming: Sky Go (UK); Peacock, Telemundo Deportes En Vivo (USA); Hotstar (India); DStv Now (NGA)\nChelsea team news: Reece James will miss the first month of the season with a new hamstring injury, though he would’ve been suspended for this game anyway, as well as two more due to the red card he picked up in the penultimate match last season. The captain is the only noteworthy injury in the squad — though new signing Pedro Neto has only had a few days of training with Maresca, so he’s likely to start only on the bench.\nPreseason was a mixed bag in terms of trying to play the Maresca way, not to mention in terms of the Maresca way itself, but we did show a bit of improvement as the weeks went along. But now the games are for real and the time for experimentation is over.\nManchester City team news: City did most of their preseason without most of their presumed first-team squad, so match fitness could be an issue for them. The likes of Phil Foden, John Stones, and Kyle Walker have only just returned to summer holidays, and are unlikely to start. Key midfielder Rodri is in a similar boat, but he’s not expected to play at all. Meanwhile, young winger Oscar Bobb has fractured his leg in training, and will be out for several months.\nFellow winger Savinho is the only noteworthy new face in City’s squad. On the other side of the ledger, City collected some £80m from Atlético Madrid in exchange for Julián Álvarez, and another £50m in various Academy departures. Bit of a weird summer for the big-moneyed outfit. They did win the Community Shield against Manchester United on penalties last weekend.\nPreviously: City’s B side took care of things against us in the friendly the other week. Overall, we still haven’t beaten them since the 2021 Champions League final, though we did play out two draws in the league last season before narrowly losing in the FA Cup semifinal.",
  "word_count": 503,
  "scraped_at": "2026-02-14T01:57:35.682498",
  "_text_extracted": true
}