{
  "article_id": "8824e77bf270",
  "url": "https://www.nytimes.com/athletic/6872246/2025/12/10/newcastle-woltemade-germany-champions-league/",
  "title": "Newcastle  Woltemessi  returns to Germany with a new edge to his game",
  "date": "20251210T084500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "When Newcastle United agreed to pay a club-record £65.5million for Nick Woltemade in late August, Eddie Howe realised evolution was required.\nHowe really rated Woltemade and the 23-year-old really wanted to join after hearing the head coach’s vision over Zoom, but Newcastle were not signing a like-for-like replacement for Alexander Isak. Yoane Wissa, who joined later in the window, theoretically represented something closer — just as previous targets Hugo Ekitike and Joao Pedro would have done — but, with Woltemade, Howe recognised that, stylistically, adaptation was required.\nAdvertisement\nDespite being 6ft 6in (198cm), Woltemade grew up being inspired by Diego, the former Werder Bremen playmaker, and ex-Barcelona forward Neymar — skilful Brazilian attackers, rather than a traditional targetman centre-forward. Nicknamed ‘Woltemessi’ by his former team-mates, he is a technical striker, someone who is adept at link-up play, rather than running in behind and pressing.\nWhen he was growing up, he was dubbed ‘Crouchy’, given his physical resemblance to former England striker Peter Crouch. His approach is far removed from that, however.\n“I want to be an entertainer on the pitch and I’m excited to see people watch me play,” Woltemade said on Tuesday.\nWoltemade is back in Germany as Newcastle take on Bayer Leverkusen in the Champions League and he returns an already improved centre-forward, in a team adapting to his unique methods. Rather than seeming like “fools” for forking out on Woltemade, as a Bayern Munich official claimed, those inside Newcastle are delighted to have beaten the Bundesliga giants to his signature.\nRewind to June and Woltemade had not even been among Newcastle’s initial priority targets, largely because he was considered unattainable. Bayern had courted Woltemade and had three offers rejected by Stuttgart, with the public pronouncement that he was not for sale.\nHaving received intel late in the window that Stuttgart would be receptive to dealing with a non-Bundesliga club, Newcastle made their decisive move, with Andy Howe, the assistant head of recruitment who was leading incoming transfer business due to the lack of a sporting director, concluding talks inside four days. The move blindsided other suitors, Bayern included.\nYet, despite all the challenges facing Newcastle and Woltemade, of the big-money summer strikers imported into the Premier League, the German has arguably impressed the most, alongside Ekitike. His league tally of five goals — there have been seven in 19 games across all competitions — exceeds Benjamin Sesko, Joao Pedro and Viktor Gyokeres, while his rate of scoring once every 190.8 minutes is bettered only by Ekitike (158.8 minutes) among those recruits.\nIn Germany, Woltemade’s fee was seen as excessive, especially considering his breakout campaign only came last season, while in England, a strong narrative emerged that Newcastle had panicked, given the disastrous summer-long Isak saga, and had signed a striker ill-suited to Howe’s tactics.\nAdvertisement\nCharacter references were important when deciding to go big on Woltemade. Newcastle scouts were adamant he could handle the pressure of playing up front for the club, the price tag and reputation in Germany — even if they did not expect Bayern’s persistent criticisms.\nA gangly, fashion-promoting, one-of-a-kind forward, Woltemade has learned to ignore the noise.\n“To be honest, I don’t care,” Woltemade told reporters when asked about Bayern’s remarks. “A lot of people speak about me, and if I listened to everything about me, I can’t focus on myself anymore, so I don’t read it. I’m not deciding what someone is paying for me, but I can say I’m really happy that Newcastle is paying this for me because I’m really happy I’m in Newcastle.”\nWhen he arrived in Newcastle and the club offered him three potential houses, he took the first one, not precious about such non-footballing issues. His friend, Silas, who he played with in the youth teams at Werder Bremen, has moved in with him. He has a close support network; his mother, a florist, and father, a health-insurance worker, have visited, while his agent, Danny Bachmann, has represented him since he was in his early teens. Woltemade is Bachmann’s one big client, helping nurture the forward to what he is now.\nAlthough Woltemade’s acclimatisation to English football is far from complete, his impressive early returns have gone some way to justifying a deal many questioned. It has been fascinating to witness how he has tweaked his game to suit Newcastle, while remaining a distinctive profile.\nWhen comparing his top-flight shot map this season with Stuttgart last year, the location of his efforts being mainly between the width of the six-yard box — whether via his right foot, left or head — is remarkably similar.\nThe likeness between these graphics shows Woltemade is still getting into good positions to attack the ball. He has developed real penalty-box tendencies, something that attracted Newcastle’s recruitment team, given how clinical he was in the area last season.\nWoltemade’s touch map has developed, however, and suggests he is showing more clearly identifiable No 9 traits.\nAdvertisement\nAs the graphic below shows, the German is taking fewer touches in wide areas and is mainly receiving the ball centrally, both inside the box and deeper.\nPartly, that adjustment can be explained by his sole deployment as a centre-forward at Newcastle in a 4-3-3, whereas at Stuttgart he operated in a 4-2-3-1 and, even when he was the No 9, he rotated with the No 10 or right-sided forward.\nAt Newcastle, his role has been more defined and has required him to play centrally. He has looked to compete directly with opposition centre-backs, as well as become the focal point for Newcastle to hit with long balls when necessary.\n“My physical work is getting way better, I can sprint more,” he said. “I can go more into duels.” That is something Howe and his coaches have specifically encouraged Woltemade to improve upon.\nBut playing as the striker has not necessarily been a seamless transition for Woltemade or Newcastle. He has appeared isolated and uninvolved at times. Against Burnley on Saturday, he managed only 16 touches, one of which was in the opposition box.\nSeason on season, Woltemade’s touches in the attacking area have halved (from 8.8 per 90 minutes to 4.2), suggesting the striker requires more time to adapt to a higher-quality league.\nWoltemade is also dribbling far less than at Stuttgart (0.8 successful take-ons per 90 at Newcastle, down from 1.7) and he is making significantly fewer key passes per 90 (0.85, down from 2.1) — although his pass completion has improved from 80.3 per cent to 88 per cent. This suggests that Woltemade is playing more conservatively in possession, whether by accident or design, and is expected to be the player finishing chances, rather than creating them.\nSkillCorner charts, depicting how Woltemade makes off-ball runs when his team is in possession, also show how his own game is changing.\nAdvertisement\nAs shown below, at Stuttgart, Woltemade regularly overlapped and provided support runs, but his figures have dropped dramatically in both areas. His game was less built on running in behind and battling with central defenders.\nAt Newcastle, meanwhile, he is regularly coming short, with runners ahead (89 out of 99), and is making runs into the box to try and get on the end of crosses (cross receiver, 88 out of 99).\nWoltemade is expected to lead the attack and be Newcastle’s finisher and even if there is still vast improvement to come, he has already adapted to these fresh demands.\n“My only frustration,” Howe said at his pre-Leverkusen press conference, “is I haven’t been able to train with him as much as I’d like because that’s the quickest way to bring out the growth we want in his game.”\nHis rise has certainly been rapid. When Werder allowed him to leave on a free transfer in 2024, they did not envisage Woltemade moving on a year later for a huge transfer fee. “It’s crazy to be honest,” Woltemade said of his own development.\nThere is understandable embarrassment about that in Bremen, who nurtured him through their academy, and they have shut down all attempts to speak about his development there. One of the reasons they appointed Horst Steffan — who coached Woltemade successfully while he was on loan at third-tier Elversberg in the 2022-23 season — was his reputation for developing young players and creating pathways.\nAt 23, Woltemade has significant room for development and he fits Newcastle’s preferred profile of recruiting players 24 and under.\nThere have been highlight-reel goals and breathtaking moments already, but what Newcastle want is consistency.\n“There’s so much more to come from him,” Howe said. “I’m excited about what he can be.”",
  "word_count": 1436,
  "scraped_at": "2026-02-14T02:27:05.513459",
  "_text_extracted": true
}