{
  "article_id": "885b6d37fbdb",
  "url": "https://www.rnz.co.nz/news/sport/491865/ac-milan-pays-tribute-to-berlusconi",
  "title": "AC Milan pays tribute to Berlusconi",
  "date": "20230612T200000Z",
  "domain": "rnz.co.nz",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Italian football giants AC Milan have paid tribute to \"unforgettable\" former owner Silvio Berlusconi following his death at the age of 86.\nBerlusconi bought his hometown club in 1986 and turned the struggling side into one of football's most successful clubs.\nUnder his leadership, Milan won five European Cups, as well as eight Italian league titles.\nIn 2017, he sold the club to Chinese investors for $1.3 billion.\nFifa president Gianni Infantino described Berlusconi as a \"visionary\".\nMilan tweeted: \"Deeply saddened, AC Milan grieves the passing of the unforgettable Silvio Berlusconi and wishes to reach out to the family, associates, and most cherished friends to share our sympathies.\"\nThe former Italian prime minister returned to football less than 18 months after selling Milan when his holding company, Fininvest, bought 100% of shares in third-division side Monza in 2018.\nBerlusconi and former Milan chief executive Adriano Galliani guided the club to Serie A for the first time in their 110-year existence.\nReal Madrid manager Carlo Ancelotti, during his playing career, helped Milan lift their first league title of the Berlusconi era in 1988 and returned to manage the club from 2001 to 2009.\nThe Italian was criticised by Berlusconi during his early seasons for his supposedly defensive tactics but would go on to win the Champions League twice, the Coppa Italia and secure the Serie A trophy with an Italian record 82 points from 34 games.\nAncelotti wrote on Twitter: \"Today's sadness doesn't erase the happy moments spent together.\n\"There remains infinite gratitude to the President, but above all to an ironic, loyal, intelligent, sincere man, fundamental for me as a footballer first, and then as a coach. Thank you President.\"\nIn a statement, AC Milan's city rivals Inter said: \"He has left an indelible mark on the history of our country. The challenges between Inter and his Milan have made the city of Milan the heart of world football.\"\nBerlusconi was a controversial figure and often complained of victimisation - particularly by prosecutors in his native Milan - once claiming to have made 2,500 court appearances in 106 trials over 20 years.\nCharges over the years included embezzlement, tax fraud and false accounting, and attempting to bribe a judge. He was acquitted or had his convictions overturned on several occasions.\n-BBC",
  "word_count": 381,
  "scraped_at": "2026-02-14T01:53:41.886622",
  "_text_extracted": true
}