{
  "article_id": "88616468da05",
  "url": "https://www.managingmadrid.com/2025/5/13/24429203/carlo-ancelotti-i-have-never-had-a-problem-with-real-madrid-and-i-never-will-press-conference",
  "title": "Ancelotti :  I have never had a problem with Real Madrid and I never will  ",
  "date": "20250513T123000Z",
  "domain": "managingmadrid.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Speaking in his first press conference since it was announced that he would not be in charge beyond the end of this month, Real Madrid coach Carlo Ancelotti addressed the media. About his exit, he said, “football, like life, is an adventure that begins and ends. I always had in mind that one day it will come to an end. A very nice period is coming to an end. I’ve had a great time. But as in all things in life, there is a moment like that. If life comes to an end, imagine if an era of a football team can come to an end. I have had a good time, I want to end it well. On the 26th I will talk about another challenge. I never had a problem with the club and I never will. It is a club that I have in my heart and I will have it too when this adventure is over. It ends after a few years where we have won many titles. With a fantastic memory that will remain for life.”\nAncelotti: “I have never had a problem with Real Madrid and I never will”\nHe spoke after confirming his exit for Brazil\nAncelotti on how he feels\n“My feeling is that, from the 26th, I will be Brazil’s coach. It’s an important challenge, but I’m still coach of Madrid. I want to finish this fantastic adventure well. I know they will be interested in what I will do. But I have to think about the days I have left here. For the respect I have for this club and this fan base, I am focused on this last stretch of this spectacular adventure.”\nAncelotti on why he’s leaving now\n“It’s because the CBF has issued this statement and from the 26th I will be Brazil coach.”\nAncelotti on why the club hasn’t made a statement\n“Madrid will release the statement when they want to release it. There is no problem at all. I don’t know when they will do it. They will do it at the time they consider appropriate. Nothing to add.”\nAncelotti on when he told the club\n“This is personal, what I talk about with the club.”\nAncelotti on why Brazil were in such a hurry\n“Everyone acts as they want to act.”\nAncelotti on his feelings as he leaves\n“No frustration at all. The day I arrived, if you told me I was going to win 11 titles in four years, I would sign it in blood. This season has not gone well for many reasons. But it has been an unforgettable period.”\nAncelotti on his advice to Xabi Alonso\n“I’m very fond of him. I don’t have any advice, because he has all the tools to be a great coach in the future.”\nAncelotti on the next two weeks\n“I know how they are going to be. We have to prepare for the next matches. I have it very clear in my head. And then, on the 26th, I will have something else to do. And I will think about it.”\nAncelotti on when he knew he wouldn’t continue\n“You have to look at the facts. I am coach until the 25th. I found out yesterday.”\nAncelotti on the game against Mallorca\n“The last games are always competitive. We have important absentees. We will try to put out a competitive team and win these three matches. The league is not over. We don’t want to give it away. We want to do well and finish a difficult season well.”\nAncelotti on whether Florentino Pérez has allowed players to get into bad habits\n“That he lacked the whip? I don’t think he has miseducated the players.”\nAncelotti on whether he has any regrets\n“No regrets at all. I want to have a fantastic time in my last 15 days. I got as much out of it as I could. From myself. The titles speak for themselves.”\nAncelotti on whether he’s happy to join Brazil\n“Yes, I am very happy. At the press conference I have to explain things that I don’t want to explain, because I have the shirt of Madrid until the 25th. Because I respect this shirt very much. I want to respect it until the last day. I wanted to win the league, the Champions League, but I am very happy.”\nAncelotti on whether now is the right time to leave\n“I never felt that Madrid didn’t want me. Madrid wants me. Also if on the 25th I go to Brazil. Madrid always loves me. They have always shown me affection. I could not be coach of Madrid all my life. This is over for many things. Maybe the club needs a new impulse. I don’t make a drama out of this. A thousand thanks to this club. And we will continue. I will be a Madridista for the rest of my life. It is a period that is coming to an end. It’s spectacular. I never thought I could coach Madrid for six years and it has happened.”\nAncelotti on Rodrygo Goes\n“Rodrygo has had a fever that has not allowed him to be at his best level. Today in training he had some discomfort in his leg. I don’t know which leg. And he wasn’t well, he didn’t recover well from the fever. After that, there was a lot of speculation about it. Everyone has a special affection for Rodrygo, especially me.”\nAncelotti on the feeling he’s left with\n“It could be anything. It was time to make a change. That’s all. I take it as something absolutely naturak. It was a shared decision to end up here.”\nAncelotti on how Rodrygo feels emotionally\n“When a player is not well, he is not well emotionally. He wants to show his quality, to help the team. That’s normal.”\nAncelotti on how he hopes fans think of him\n“We had a wonderful time with unforgettable comebacks and I’m sure the fans won’t forget it.”\nAncelotti on those annoyed by him negotiating with Brazil while employed by Real Madrid\n“I respect all opinions. It’s a football thing. Like press conferences. And you have to put up with them. But I am not sad.”",
  "word_count": 1040,
  "scraped_at": "2026-02-14T02:26:38.640162",
  "_text_extracted": true
}