{
  "article_id": "88622ac2cd75",
  "url": "https://www.lbc.co.uk/article/mo-salah-player-of-the-year-award-5HjdBCP_2/",
  "title": "Mo Salah makes history as he wins PFA Player of the Year award for third time",
  "date": "20250820T014500Z",
  "domain": "lbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mo Salah makes history as he wins PFA Player of the Year award for third time\nMo Salah has won a record third PFA Men's Player of the Year award.\nListen to this article\nThe 'Egyptian King' scored 29 goals and provided 18 assists as Liverpool clinched the Premier League title last season.\nThe 33-year-old was presented the award by Ian Rush, Liverpool’s record goal scorer, at Manchester Opera House.\nHe won the vote ahead of Reds team-mate Alexis Mac Allister, Manchester United captain Bruno Fernandes, Newcastle striker Alexander Isak, Chelsea forward Cole Palmer and Arsenal midfielder Declan Rice were also on the shortlist.\nArsenal's Mariona Caldentey scooped the women's award - after helping the Londoners win the Champions League.\nAsked if he had ambitions to win awards as a child while growing up in Egypt, he said: \"Of course I wanted to be a football player and I wanted to be famous and provide for my family, but you don't think about the big stuff when you are still in Egypt.\n\"When you grow, you start to see things differently and you start to have ambition and you start to the see the bigger picture.\"\nRead more: Emma Raducanu and Carlos Alcaraz out after making US Open doubles debut\nRead more: Jannik Sinner pulls out of US Open mixed doubles after Cincinnati Open retirement\nAston Villa midfielder Morgan Rogers was also named young player of the year.\nHe is the fifth Aston Villa representative to be named young player of the season, following in the footsteps of Andy Gray, Gary Shaw, Ashley Young and James Milner.\nOther former winners of the highly sought-after award include icons such as Steven Gerrard, David Beckham, Wayne Rooney and Gareth Bale.\nRogers added he wants to be one of the \"incredible players people speak about\".\nFormer England manager Sir Gareth Southgate is the 2025 recipient of the PFA merit award for his contributions to football and achievements with the national side.",
  "word_count": 328,
  "scraped_at": "2026-02-14T01:52:36.771509",
  "_text_extracted": true
}