{
  "article_id": "888d41934e78",
  "url": "https://www.fourfourtwo.com/news/goalkeepers-who-scored-goals",
  "title": "Goalkeepers who scored goals",
  "date": "20240227T214500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Goalkeepers who scored goals\nFrom the sublime to the ridiculous, here are a bunch of goalkeepers who have scored goals in professional football\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nA goalkeeper's primary function is to stop the ball going in their net, first and foremost. But, in the modern age, goalkeepers can be expected to start moves from the back, sweep up after defenders and be good with their feet, particularly in more progressive sides.\nSweeper keepers at some clubs are the norm, rendering teams' GKs as not simply bog standard shot-stoppers, but a player who is expected to invite pressure, distribute the ball and initiate attacks from deep.\nDespite all of that, scoring goals is still not part of a goalkeeper's job description - not usually, anyway. Over the years, though, there have been a handful of goalscoring goalkeepers. Here, FourFourTwo takes a look at some of the most notable and prolific...\n34. Peter Shilton\nFirst on FFT's comprehensive list of goalscoring goalkeepers is one of England's greatest stoppers. Peter Shilton won a record 125 caps for the Three Lions between 1970 and 1990 and won two European Cups at Nottingham Forest.\nShilton started his career at hometown club Leicester City and his only goal in over 1,300 career appearances came with the Foxes as an 18-year-old, when he scored with a long kick forward in a 5-1 win over Southampton in October 1967. It is said that, due to misty conditions, he didn't even know he'd scored. Yeah, right. Very nonchalant.\n33. Pat Jennings\nNext on the list is Pat Jennings, who played 119 times for Northern Ireland over a period of 22 years and appeared at two World Cups, making his final appearance in Mexico '86 at the age of 41.\nJennings played for both Tottenham Hotspur and Arsenal, but is associated with Spurs where he won more trophies and also scored in the 1967 Charity Shield against Manchester United with a long kick forward. The game ended 3-3 and the trophy was shared. Ever heard of extra-time and penalties, chaps?\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n32. Andres Palop\nAndres Palop was part of Spain's European Championship squad in 2008 and won a medal despite never earning a cap for La Roja. At club level, he won the UEFA Cup three times – once at Valencia and twice with Sevilla.\nHe more than played his part en route to the last of those European victories. Trailing 2-1 to Shakhtar Donetsk in a round of 16 second leg tie, Palop scored an incredible equaliser deep into added time to draw the game level. Sevilla added another in extra-time and went on to win the competition for a second season in a row.\n31. Alisson Becker\nWho could forget Alisson Becker's header against West Brom during 2020/21. The Brazilian went up for a corner and scored a crucial goal for the Reds.\nHe hasn't managed to replicate his heroics since, at club or international level, but don't rule it out.\n30. Anatoliy Trubin\nAnatoliy Trubin wrote himself into Champions League history with a fine header to send Benfica through to the knockout stages in the 98th minute - at the expense of Marseille.\nThe Ukrainian stopper was sent forward by manager Jose Mourinho with Benfica needing one goal against Real Madrid and duly delivered.\n29. Bernard Lama\nBernard Lama played 44 times for France between 1993 and 2000 and was part of the squads which won the 1998 World Cup and Euro 2000.\nAt club level, he was successful at Paris Saint-Germain, winning one league title, two French Cups, a Cup Winners' Cup and a Trophee des Champions. Lama also played for Lille and Lens earlier in his career and scored a penalty for each. Goalkeepers taking penalties, what ever happened to that? Bring it back, we say.\n28. Andreas Kopke\nAndreas Kopke won 59 caps for 'Die Mannschaft' between 1990 and 1998 and was the first-choice goalkeeper at Euro '96 when Germany clinched their first title since reunification.\nKopke played for Hertha Berlin, Eintracht Frankfurt and Marseille at club level but spent much of his career at Nuremberg, scoring two goals for the club in his first spell, both of which were penalties against FC Koln and Dynamo Dresden.\n27. Alex Stepney\nAlex Stepney played over 500 games for Manchester United and in that many games, there was always going to be at least a slim chance of scoring. Stepney was in goal for the Red Devils as they won the European Cup in 1968 and seven days earlier, had earned his only cap for England.\nThe veteran keeper scored twice for Manchester United – penalties in the 1973/74 season. The first was a consolation in a 2-1 loss to Leicester at Old Trafford; the second a winner in a 1-0 victory at home to Birmingham.\n26. Ivan Provedel\nIvan Provedel signed for Lazio in 2022 and was first called up by Italy that same year, but hasn't exactly had the same success since. At least by goalkeeping standards, he's made a habit of scoring late in the day.\nProvedel has netted two last-minute goals in his career – the first in Serie B for Juve Stabia against Ascoli in 2020, and the second for Lazio with a header to earn a 1-1 draw at home to Atletico Madrid in the Champions League in 2023. He remains Lazio's first choice stopper but is still waiting on that Italy debut.\n25. Paul Robinson\nOne of the more memorable goalkeeper goals is Paul Robinson's strike against Watford in 2007, lobbing Ben Foster with a wind-assisted effort from inside his own half. But that wasn't the first time Robinson had hit the back of the net.\nThe goalkeeper scored a header from a corner in Leeds United's League Cup win against Swindon before his free-kick for Spurs wound up in the Hornets' goal.\n24. Jens Lehmann\nCapped 61 times by Germany in a 10-year international career between 1998 and 2008, Jens Lehmann was best known at club level for his spell at Arsenal.\nBefore joining the Gunners, Lehmann was an established goalkeeper in the Bundesliga having spent much of his career with Schalke where he scored two goals for the club. The first was a penalty; the second a last-minute equaliser against rivals Borussia Dortmund - which was the first goal from open play ever scored by a goalkeeper in the Bundesliga.\n23. Oscar Perez\nOscar Perez has a certain 'do not mess with me' aura to him, with the shaved head and all.\nThe Mexican was known for his quick reflexes and agility despite his short stature, and also managed to score four career goals – one for Mexico's Under-23s, two last-minute headers for Cruz Azul and another for Pachuca.\n22. Peter Schmeichel\nOne of the most recognisable goalkeepers of recent times, treble-winner Schmeichel was prolific at finding the back of the net in goalkeeping terms.\nIn total, Schmeichel won 129 caps for Denmark and scored 11 goals in his career, six of which were for Hvidovre in his homeland, but also one for the national team, one for Manchester United and one for Aston Villa in the Premier League.\n21. Nelson Ramos\nNelson Ramos was part of Colombia's squad at the 2011 Copa America but never won a cap for his national team.\nRamos played for some of Colombia's biggest clubs and scored 13 career goals – six penalties and seven free-kicks. In 2021, he became the first goalkeeper to score goals from free-kicks in three consecutive matches.\n20. Sebastian Viera\nA lot of goalscoring South American goalkeepers, aren't there? Must be something in the water. Sebastian Viera won 15 caps for Uruguay and played in Spain, Greece and Colombia after starting his career with Nacional in his homeland.\nViera scored 13 goals in total, including nine free-kicks. He won a Uruguayan league title with Nacional and three Colombian championships at Atletico Junior.\n19. Ignacio Gonzalez\nYou'll never guess, it's another South American stopper. Ignacio Gonzalez spent most of his career in Argentina, but had two spells at Las Palmas in Spain and also played briefly in Mexico. He won four caps for Argentina.\nHe scored six goals for Las Palmas in LaLiga, a joint division record, and netted 14 times overall in his career. He retired after his second spell at Las Palmas in 2008.\n18. Kennedy Mweene\nKennedy Mweene played 122 times for Zambia between 2004 and 2021 and was in goal for the nation's 2012 Africa Cup of Nations triumph.\nMweene scored 14 goals in his career, including 12 penalties. He netted an equaliser against Nigeria in an AFCON group game in 2013 and another in a 3-0 win over Niger the following year.\n17. Sebastian Saja\nSebastian Saja had long spells at San Lorenzo and Racing Club and also played in Spain, Italy, Greece, Brazil and Mexico in a long career. He won four caps for Argentina.\nSaja scored 20 goals overall: 12 for San Lorenzo, seven for Racing and one for Gremio. He retired in 2017 at the age of 38 and later became Inter Miami's goalkeeping coach.\n16. Cristian Lucchetti\nSounds Italian, must be Italian then, right? Nope, Argentinian. Cristian Lucchetti had long spells at Banfield, where he won a league title, and Atletico Tucuman in a career spanning 28 years between 1995 and 2023.\nThe goalkeeper also had a spell on loan at Boca Juniors and in Mexico with Santos Laguna. He scored 20 career goals: 19 for Banfield and one for Atletico Tucuman.\n15. Phan Van Santos\nPhan Van Santos was born Fabio dos Santos in Brazil but went on to play in Vietnam and even represented the Vietnamese at international level.\nHe played for Dong Tam Long Am between 2001 and 2010, scoring 22 goals, the highest by a goalkeeper in Asia. In 2006, he scored a free-kick against Shanghai Shenhua in the AFC Champions League, becoming the first goalkeeper to net in the competition.\n14. Rafael Dudamel\nRafael Dudamel won 57 caps for Venezuela between 1993 and 2010. The goalkeeper spent most of his club career in Venezuela and Colombia, but also played in Argentina and briefly in South Africa.\nHe scored 22 goals in total, including a direct free-kick againsrt Argentina in a World Cup qualifier ahead of France 98. After retirement, Dudamel spent four years in charge of the national team.\n13. Vincent Enyeama\nVincent Enyeama earned 101 caps for Nigeria between 2002 and 2015 and was an Africa Cup of Nations winner in 2013.\nAlways substituted before penalty shootouts in Nigeria with Enyimba, he became a specialist – at both saving and scoring spot-kicks. First-choice penalty taker in Israel with Hapoel Tel Aviv, Enyeama netted 25 career goals in total.\n12. Exar Rosales\nBorn in Lima, Exar Rosales represented Peru at Under-17 and U-20 level and won a league title with Alianza Lima in 2004.\nRosales frequently took penalties for his clubs and scored a total of 26 goals. His career was effectively ended in 2021 when he was handed a 10-year ban for alleged match-fixing.\n11. Misael Alfaro\nMisael Alfaro won 42 caps for El Salvador between 1991 and 2005 and was a league champion with four different clubs in a career of over 20 years spent entirely in his homeland.\nAlfaro is one of the highest-scoring goalkeepers in football history. He scored 31 times across his club career, including 11 from penalty kicks. That's good going, but we're not sure what it says about the quality of the Salvadoran top flight.\n10. Hans-Jorg Butt\nOne of the best German goalkeepers of his generation, Hans Jorg-Butt played for Hamburg, Bayer Leverkusen and Bayern Munich in an impressive career. He also won four international caps.\nKnown for scoring penalties and for going forward if his team needed a late equaliser, Butt scored 33 career goals in total. Those included a whopping 26 penalties in the Bundesliga and three in the Champions League – a record for a goalkeeper.\n9. Fabio Rampi\nIn a career spent largely in Brazil's lower leagues and including long spells at both Sao Jose-RS and Cruzeiro-RS, Fabio Rampi has featured in Serie C, Serie D and the regional Gaucho Championship.\nRampi hit his first senior goal in 2011 and has gone on to net over 30 in his career, making him the third-highest Brazilian on the list of goalscoring goalkeepers.\n8. Fernando Patterson\nFernando Patterson was born in Costa Rica and won one cap for his national team, but the goalkeeper would go on to spend most of his career in Guatemala.\nPatterson had five spells with Xelaju MC in a career spanning more than two decades and netted 35 goals overall, leaving him eighth on the all-time list of goalscoring goalkeepers when he retired in 2013.\n7. Marcio\nMarcio played for a number of Brazilian clubs in a career spanning 17 years between 2002 and 2019. His most successful spell came at Atletico Goianiense, where he played for nine years.\nBorn in Brazil's northeast, Marcio scored 40 goals in his career, with all of those coming at clubs in the same city: 37 for Atletico Goianiense, two for Goias and one for Goiania.\n6. Dimitar Ivankov\nNo, he didn't score at Old Trafford, but Dimitar Ivankov was capped 64 times by Bulgaria and won three titles at Levski Sofia in the early 2000s, before adding another with Bursaspor in Turkey.\nIvankov is the sixth highest scoring goalkeeper of all time with 42 goals in total and the leading European. In 2008, he scored two penalties and saved three as Kayserispor beat Genclerbirligi 11-10 in a shootout to win the Turkish Cup. Main character energy.\n5. Rene Higuita\nThe man famous for the scorpion kick, Rene Higuita was a sweeper-keeper who was ahead of his time, often coming out of his area to help his defenders, even if that led to occasional mistakes.\nOne such error saw him dispossessed by Cameroon striker Roger Milla as Colombia were beaten in the last 16 of the 1990 World Cup. Most of the time, though, he was an asset and scored 43 career goals – including three for Colombia.\n4. Johnny Vegas\nWho? Yes, that really is his name. He's Peruvian, of course, not a Manchester-born entertainer. Johnny Vegas won just three caps for Peru but was one of the nation's best goalkeepers in a 20-year career between 1997 and 2017.\nVegas scored a total of 45 career goals from penalties and free-kicks, a tally which included 40 in Brazil's top flight, four in the country's second tier and one in the Copa Sudamericana.\n3. Jorge Campos\nKnown for colourful kits and acrobatic saves, Jorge Campos is one of Mexico's greatest goalkeepers – and stood just 5 foot 6 inches (1.68m) tall!\nAlso a talented striker, Campos played as a forward for Mexican side Pumas between 1989 and 1991 and scored 28 goals in that period. He netted 46 times in his career, with most of those coming when another goalkeeper was brought on, allowing him to move forward. That's wild - a bit like his sartorial tastes.\n2. Jose Luis Chilavert\nJose Luis Chilavert is one of South America's goalkeeping greats and was renowned for his hot temper. The Paraguayan won 74 caps in a 20-year international career and was South American Footballer of the Year in 1996.\nChilavert is the second-highest scoring goalkeeper ever with 67 goals and is one of a select few to have scored a hat-trick. Eight of those goals came for Paraguay, which is a record tally for a goalkeeper at international level. Emile Heskey only scored seven for England!\n1. Rogerio Ceni\nThe GOAT when it comes to goalkeepers scoring goals. Apart from a brief spell at Mato Grosso side Sinop, Rogerio Ceni spent his entire career at Sao Paulo and made over 1,000 appearances for the club.\nA Brazilian international and part of the World Cup-winning squad in 2002, Ceni was Sao Paulo's set-piece taker from 1997 until his retirement in 2015 and scored 129 goals in that time. He is listed in the Guinness Book of Records as the goalkeeper with the most goals scored in professional football.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.\n- Joe DonnohueSenior Digital Writer\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.",
  "word_count": 2928,
  "scraped_at": "2026-02-14T01:51:19.049181",
  "_text_extracted": true
}