{
  "article_id": "88962dedb127",
  "url": "https://www.gdnonline.com:443/Details/1367457/Arsenal-extend-lead-at-top-as-Liverpool-drought-ends",
  "title": "Football : Arsenal extend lead at top as Liverpool drought ends",
  "date": "20251102T011500Z",
  "domain": "gdnonline.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football – The wins just keep on coming for Arsenal - and Liverpool’s losing streak is finally over.\nMikel Arteta’s team extended its lead at the top of the Premier League to seven points yesterday with a 2-0 victory against Burnley. Liverpool won by the same scoreline against Aston Villa to end a four-game losing run in England’s top flight.\nIt’s 13 wins from 15 games in all competitions for Arsenal after a flying start to the season that has only strengthened belief it will end its long-running title drought.\nNot since 2004 has the London club been crowned English champion - but it has quickly established itself as the team to beat this season.\nFirst half goals from Viktor Gyokeres and Declan Rice at Turf Moor made it nine wins in a row and put further distance between Arsenal and the chasing pack.\n“Every weekend I know how important it is to win football matches,” Rice said. “I realise the position we’re in and what we can achieve as a club.”\nLiverpool is third after victory at Anfield, with Mohamed Salah scoring his 250th goal for the club.\nManchester United missed the chance to move up to second, but maintained its recent unbeaten run by scoring late to salvage a 2-2 draw at Nottingham Forest.\nChelsea beat Tottenham 1-0 and bottom of the table Wolverhampton remains winless after yet another defeat - losing 3-0 to Fulham.\nCrystal Palace beat Brentford 2-0 and Brighton won 3-0 against Leeds.\nAnother win and another clean sheet for an Arsenal team that has by far the meanest defense in the league.\nVictory at Burnley was the seventh straight shutout for the London club, which has only conceded three goals all term. This was also the third time in the league this season that Arsenal denied its opponent any shots on target.\nCrucially, the goals are flowing at the other end and summer signing Viktor Gyokeres scored his sixth of the season to put Arsenal in front with a 14th minute header from close range. Rice doubled the lead in the 35th with another header low into the corner.\n“We knew it was going to be a tough test, but we had to stick to our principles,” Rice said. “In the end our quality shone through.”\nAmad Diallo scored a stunning left-footed volley from the edge of the area to salvage a point for United and ensure coach Ruben Amorim’s unbeaten run was extended to four games.\nUnited had led Forest at halftime at the City Ground after Casemiro’s header in the 34th.\nBut the visitors were stunned after the break when Morgan Gibbs-White and Nicolo Savona struck within five minutes of the restart to put new Forest coach Sean Dyche in sight of a first league win since taking charge.\n“We lost control of the game for five minutes and we paid the price,” Amorim said.\nBruno Fernandes hit the post with a long range effort as United went in search of a leveler and in the 81st Diallo lashed a volley beyond Forest goalkeeper Matz Sels.\nHe might have scored a winner with another fierce strike that was cleared off the line.\n“We managed to score, we had a big opportunity in the end. But we lost two points and that is the feeling, but we have the next week to work and to try and get these points in another stadium,” Amorim said.\nChelsea bounced back from last week’s defeat to Sunderland with victory against London rival Tottenham.\nJoao Pedro’s finish in the 34th was enough to separate the teams at the Tottenham Hotspur Stadium, but Enzo Maresca’s team had numerous chances to extend its lead.\nSpurs’ league record at home is looking increasingly concerning for coach Thomas Frank, with the last win coming against Burnley on the opening day of the season.\nAn eighth league defeat from 10 games this season leaves Wolves rock bottom and in danger of being cut adrift.\nThe signs were ominous from the ninth minute when Ryan Sessegnon opened the scoring for Fulham at Craven Cottage and it got worse from there.\nThe visitors were down to 10 men when Emmanuel Agbadou was sent off in the 36th and in the second half Harry Wilson extended Fulham’s lead before Yerson Mosquera’s own goal made it 3-0.\nThe latest defeat will only heighten speculation over the future of Wolves coach Vitor Pereira, who only signed a new three-year contract in September.\nAt the age of 34, Danny Welbeck is still delivering in England’s top flight.\nThe Brighton striker’s 11th-minute goal at the Amex Stadium was his sixth in as many games and opened the scoring against Leeds.\nAt this rate, the former Man United and Arsenal player may be a contender for England’s World Cup squad.\n“I just control what I can control – I am enjoying playing my football here at Brighton, my focus is always on Brighton and doing the best that I can,” Welbeck said.\nDiego Gomez scored twice in the second half to complete the 3-0 win for Brighton.\nJean-Philippe Mateta was on target for Palace in its 2-0 win against Brentford.\nlMeanwhile, Bundesliga leaders Bayern Munich bagged three goals in 19 minutes in a rampant first half to power past visitors Bayer Leverkusen 3-0 and stretch their record-extending run to 15 wins from 15 matches across all competitions this season.\nGoals from Serge Gnabry and Nicolas Jackson and an own goal from Loic Bade in the 44th minute gave Bayern, who rested top scorer Harry Kane, Michael Olise and Luis Diaz in the first half ahead of next week’s trip to reigning champions Paris St Germain in the Champions League, an easy victory.\nThey extended their record run in Europe’s top five leagues to 15 wins on the trot after setting a record on Wednesday with a 4-1 win over Cologne.",
  "word_count": 980,
  "scraped_at": "2026-02-14T01:52:49.007225",
  "_text_extracted": true
}