{
  "article_id": "889c66d9d0bb",
  "url": "https://www.asahi.com/ajw/articles/15134565",
  "title": "Lionel Messi and the World Cup have left Qatar with a richer sports legacy | The Asahi Shimbun : Breaking News , Japan News and Analysis",
  "date": "20240128T044500Z",
  "domain": "asahi.com",
  "source_country": "Japan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THE ASSOCIATED PRESS\nJanuary 28, 2024 at 09:10 JST\nFILE - Fireworks go off during the opening ceremony ahead of the Asian Cup Group A soccer match between Qatar and Lebanon at the Lusail Stadium in Lusail, Qatar, Friday, Jan. 12, 2024. (AP Photo/Thanassis Stavrakis, File)\nReminders of Lionel Messi and the 2022 World Cup are not hard to find in Qatar.\n“Last chance” tournament souvenirs greet visitors on arrival at Doha's Hamad International Airport. In Souq Waqif — a vibrant eating and shopping area — replica World Cup trophies and shirts are on sale. Decorative soccer balls remain inside the metro carriages.\nElsewhere, a poster of Messi stands tall in a shopping mall, announcing the imminent arrival of a coffee house brand that sponsors Argentina's national team.\nBut just over a year on, what is the real sporting legacy for Qatar after soccer's showpiece was staged in the Middle East for the first time?\nThe country is currently playing host to another major soccer tournament, the Asian Cup, which organizers say “reaffirms Qatar’s place as a global sporting capital.”\nThe natural gas-rich nation certainly knows how to put on a show. State-of-the-art stadiums and public transport catered to millions of fans during the World Cup. The tournament was crowned by possibly the greatest final in its history when Messi inspired Argentina to victory over France on penalties after a 3-3 draw through extra time.\nFIFA president Gianni Infantino said afterward it was “simply, the best World Cup ever.”\nThat is up for debate, particularly as FIFA faced intense criticism for giving the tournament to Qatar plus concerns about its treatment of migrant workers.\nYes, the World Cup produced thrilling narratives, as it invariably does; Messi finally won the one major trophy missing from his CV; and Morocco became the first African nation to reach the semifinals. But intrinsic to the delivery of any major sporting event is the question of legacy and whether the fervor generated over a few weeks of competition left a lasting impression.\nFANS\nIn isolation, Qatar’s games at the Asian Cup suggest passion for the sport still runs high in the country. More than 82,000 watched the opening game against Lebanon at Lusail Stadium. More than 57,000 attended the host nation's second match against Tajikistan at Al Bayt Stadium.\n“The World Cup made more fans of football,” Hamad Sultan, who attended the Lebanon game, told The Associated Press.\nSoccer fan Mohammed bin Qhata said, “(The) 2022 World Cup enhanced how important football (is). As you can see, all Qataris are attending this opening ceremony. Football is (the) number one sport in Qatar.\"\nOrganizers said 900,000 tickets were purchased before the tournament. But the huge crowds for Qatar's games have not been the norm.\nJust 4,001 attended China's 0-0 draw with Tajikistan, though there have also been games in excess of 20,000, 30,000 and 40,000.\nThe festival atmosphere generated by the World Cup has been less evident at the smaller Asian Cup. While thousands of fans made their way to Lusail Stadium for the opening ceremony, its nearby city streets were eerily quiet at other times.\nWhat is not clear is how many fans regularly attend Qatari league matches, with figures not openly published.\nFIFA and the Qatari league cited a recent game between Al Rayyan and Al Arabi that was watched by a crowd of more than 27,000, but it is not clear how representative that is.\n“Our league matches, especially the signature games, draw sizable crowd(s),” said Hani Taleb Ballan, CEO of the Qatari league.\nSTADIUMS\nWith an estimated population of less than 3 million people and only around 300,000 citizens, Qatar would appear to have a disproportionate number of top-class sporting venues after eight stadiums were built or redeveloped for the World Cup.\nSeven of those stadiums are being deployed again for the Asian Cup and five have been used in the Qatari league. But it should be noted the delayed 2023 Asian Cup is being staged in Qatar only because original host China canceled its hosting plans due to the COVID-19 pandemic.\n“The state-of-the-art World Cup stadiums remain as one of the best memories of FIFA World Cup Qatar 2022 and fans are just excited to attend matches at the venues,” Ballan said. “We didn’t leave our amazing venues idle and our Expo Stars League matches in this 2023-24 season are being played in five of them — Al Bayt, Ahmad Bin Ali, Al Janoub, Al Thumama and Khalifa International Stadiums. That was a part of our plans towards further increasing popularity of the game and we’re glad that it’s serving its purpose.”\nQatar said as part of its post-World Cup strategy that capacity would be reduced in some of the stadiums.\nStadium 974 — one of the most distinctive venues created for the World Cup — was supposed to be reduced to nothing. Described as “eco-friendly,” it was constructed from repurposed shipping containers and was set to be dismantled after hosting seven games at the tournament.\nYet, Stadium 974 still stands more than a year on, complete with World Cup signage around its grounds.\nAs for Lusail Stadium, its place in history is secure after staging Messi's crowning glory against France.\n“It is like a museum of football,\" Mohammed bin Qhatan said. \"It is enough (that) I can say that this is a stadium that (hosted the) 2022 final.\"\nDOMESTIC SOCCER\nFocus has shifted from Qatar to Saudi Arabia since the World Cup.\nA spectacular recruitment drive has seen some of the world's top players like Cristiano Ronaldo, Neymar and Karim Benzema move to the Saudi League. More are expected to follow as the country seems intent on turning itself into a major power in the sport.\nIt also looks set to host the 2034 World Cup as the only candidate left in the bidding process and is staging the next edition of the Asian Cup in 2027.\nWhile the Qatari league has attracted former Liverpool and Barcelona forward Philippe Coutinho and former Paris Saint-Germain midfielder Marco Verratti, it pales in comparison to the signings being made by Saudi teams.\n“It’s not our intention to attract more star players from overseas. However, we’re open when it comes to our clubs’ recruitment policy,” said Ballan, adding the league “always attracted star players from across the globe.”\nThe league's ambitions appear to be based on more than star appeal. Ballan said he wants it to be \"recognized as a leading, progressive Qatari institution\" and spoke of raising its professionalism.\n“We aim to keep delivering high-quality competitive football entertainment by raising the playing standards of all teams through higher performance,” he said.\nQatar's star player at the Asian Cup, Akram Afif, has made it clear where he hopes his future lies.\n“Every player has a wish to play in Europe,” he said. “I want to play in Europe tomorrow if possible.”\nWhile Qatar was humbled at the World Cup by being eliminated in the group stage, it is the defending Asian Cup champion and has advanced to the round of 16 with a 100% winning record.\n“The 2019 (Asian Cup) generation raised our levels and ambitions. We are always required to win in any game and championship we partake in,\" Qatar captain Hassan Al Haydos said. “We are playing the Asian Cup as titleholders and in our own home, so we have to perform and show to the fans that we mean business.”\nTHE FUTURE\nQatar describes itself as a global sporting capital and is trying to build on that reputation. The world aquatics championships come to Doha next month and the Asian Games will be here in 2030.\nThere is also talk of a bid for the 2036 Olympics.\nQatar Sports Investments has a strong foothold in European soccer as the owner of Paris Saint-Germain.\nMeanwhile, Qatari banker Sheikh Jassim bin Hamad Al Thani last year tried to buy Manchester United. It remains to be seen if there will be further interest from Qatar in any other top European teams.\nSPORTING LEGACY\nIt is highly unlikely Qatar will ever become a global soccer power on the field. That is not a requirement of a World Cup host.\nNor is the Qatari league likely to challenge the popularity of the English Premier League, Champions League or even the Saudi league.\nBut the significance of the 2022 World Cup cannot be understated.\nAs the first in the Middle East, it has paved the way for attracting more major sporting events. Saudi Arabia is quickly becoming the second nation from the region to host soccer's biggest tournament.\nBarriers have been broken. It is possible to host a World Cup at a time of the year that is midway through the season for many of the world's top leagues.\nTemperatures that were among the concerns leading up to the tournament proved not to be an issue in air-conditioned stadiums, while state-of-the-art public transport operated smoothly.\nFIFA said the Asian Cup was a “direct sporting legacy of the FIFA World Cup infrastructure and best practices.”\n“The tournament has helped instill more passion for sports, especially football, in Qatar’s future generation. I’m sure it has left a lasting legacy besides motivating youngsters to chase their passion,” Ballan said.\nThe profile of club soccer in the region is also growing.\nLess than two weeks after the World Cup final, Ronaldo agreed on a move to Saudi team Al-Nassr.\nQatar, meanwhile, will always have the image of Messi, wearing one of the country's ceremonial robes, holding the World Cup trophy aloft.\nIt is one of the enduring sights in the history of the tournament and Qatar will forever be linked to soccer's greatest event because of it.\n- Japan moves for the first time to criminalize paying for sex\n- Man accused of making and selling porn of 15-year-old girl\n- High school baseball players probed over obscene video\n- French sex abuse expert shocked by girls in red-light district\n- Insiders fear Japan’s military buildup goal is unrealistic\n- Taiwanese grow more confident in buying Japanese real estate\n- Teacher, students team to improve English learning in high school\n- Survey: 93% of election winners favor revisions of Constitution\n- Finless porpoises filmed off Haneda Airport in Tokyo Bay\n- 46 people killed in heavy snow over three weeks around Japan\n- Japan moves for the first time to criminalize paying for sex\n- Man accused of making and selling porn of 15-year-old girl\n- Snow forecast to accumulate in central Tokyo over the weekend\n- LDP secures supermajority in Lower House election victory\n- Hakuba village office stymied by ‘furigana’ for foreign names\n- French sex abuse expert shocked by girls in red-light district\n- Sanseito’s Kamiya labels gender equality 'communism'\n- Teacher, students team to improve English learning in high school\n- EXCLUSIVE-BOJ won’t come to the rescue of a Takaichi-driven bond rout\n- Peak conditions: ‘Diamond Fuji’ visible from Tokyo Skytree\n-\n- YOASOBI\nA peek through the music industry’s curtain at the producers who harnessed social media to help their idols go global.\n-\n- Diplomatic Documents\nA series based on diplomatic documents declassified by Japan’s Foreign Ministry\n-\n- Memories of Hiroshima and Nagasaki\nHere is a collection of first-hand accounts by “hibakusha” atomic bomb survivors.\n-\n- Taste of Life\nCooking experts, chefs and others involved in the field of food introduce their special recipes intertwined with their paths in life.\n-\n- Memories of Nikkei Americans\nA series about Japanese-Americans and their memories of World War II",
  "word_count": 1924,
  "scraped_at": "2026-02-14T02:10:42.032204",
  "_text_extracted": true
}