{
  "article_id": "88a2bd1b9b48",
  "url": "https://www.fourfourtwo.com/features/ranked-every-england-manager-ranked-from-worst-to-best",
  "title": "Ranked ! EVERY England manager ranked from worst to best",
  "date": "20231225T170000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ranked! EVERY England manager ranked from worst to best\nFrom Wembley finals to pints of wine, we run through the best and worst of England's 15 managers\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nEngland may have played their first international match in 1872, but it took another 74 years for the FA to appoint a full-time manager.\nThe team had previously been chosen by the International Selection Committee, a policy which continued even after Walter Winterbottom had been handed the reins.\nWith Thomas Tuchel having started work as Gareth Southgate's replacement, but still yet to take charge of his first match, England have had 15 permanent managers prior to the German's appointment. But how do they compare? FourFourTwo ranks each boss from worst to best below.\nEngland manager ranked from worst to best: 15. Steve McClaren (2006-2007)\nHighlight: David Nugent scoring from 0 yards out\nLowlight: Wally with brolly\nAfter taking Middlesbrough to the UEFA Cup final, England installed McClaren in the hot seat after the 2006 World Cup and Sven-Goran Eriksson's departure. But while he inherited a talented squad which had nevertheless failed to live up to expectations at the previous three tournaments, McClaren failed to find a tune out of Wayne Rooney, Steven Gerrard, Frank Lampard & Co. during Euro 2008 qualifying, let alone at a major tournament, inexplicably failing to reach the tournament hosted in Austria and Switzerland.\nThough they headed into qualification among the favourites to actually win the European Championship outright, McClaren’s men stumbled to third in their qualification group – level on points with Israel and one behind Russia – after dropping points in five of their 12 games. Their fate was sealed by a 3-2 loss to Croatia at Wembley, where McClaren had the audacity to use an umbrella to keep dry.\n14. Graham Taylor (1990-1993)\nHighlight: Sticking up for John Barnes\nLowlight: “Do I not like that?”\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nA true gentleman who conducted himself with real dignity, even when root vegetables were being digitally merged with his head in the tabloids, Taylor's tenure in charge of the Three Lions proved, rather unfortunately, dire.\nEngland bored at Euro 92: three games, only one goal and Gary Lineker substituted with the Three Lions urgently needing to score against Sweden. But at least they got there - they failed to reach the 1994 World Cup, which proved a debacle detailed in the riveting documentary An Impossible Job. Taylor’s use of language was the stuff of genius (“Can we not knock it?”) but his usage of England’s creative players was definitely not.\n13. Sam Allardyce (2016)\nHighlight: 100% win record!\nLowlight: Pint of wine!\nIt’s hard to judge Big Sam on a tenure comprised solely of a forgettable 1-0 win over Slovakia (opposition Big Sam couldn't actually remember when FFT quizzed him on it).\nBut lasting only 63 days in a job is ignominious, even if there wasn’t really a ‘smoking gun’ moment in the Telegraph sting in Wing's restaurant which ended his stint. Allardyce was a little unlucky – he didn’t actually break any rules and the FA probably acted too hastily in dismissing him almost immediately after the story hit the papers – but it’s hard to imagine his England side capturing the nation’s hearts in the way that Gareth Southgate’s did in 2018.\n12. Kevin Keegan (1999-2000)\nHighlight: Beat Germany\nLowlight: Quit in the loo\nKeegan took control of his country in 1999 and successfully steered them to the following year’s European Championship, overcoming Scotland in a qualification play-off. England weren’t much cop at the tournament itself, though, throwing away leads to lose to both Portugal and Romania either side of a forgettable 1-0 triumph over the worst Germany team in decades.\nHis tenure with the national team ended with a defeat by the Germans in a qualifier for the 2002 World Cup. In the last game played at the old Wembley, King Kev abdicated the throne after a rare Dietmar Hamann goal settled the match in the visitors’ favour, telling David Davies of his resignation inside a toilet cubicle. Some way to go.\n11. Fabio Capello (2008-2012)\nHighlight: Revenge over Croatia\nLowlight: Capello Index/Germany meltdown\nAfter the golden generation’s continued failures throughout the 2000s, England saw Capello – a no-nonsense disciplinarian who had won seven league titles and the Champions League at club level – as the ideal man to whip a ragtag bunch of overpaid primadonnas into shape. It started well too, England steamrollering their way past everything in sight to qualify for the 2010 World Cup at a canter.\nUltimately, things didn't go quite as well upon reaching South Africa, with dismal displays against the United States and Algeria (both draws, with the latter game arguably the worst game in the history of professional football) in the group stages compounded by a 4-1 thrashing at the hands of Germany.\nBut while England and Frank Lampard suffered from the lack of goal line technology in that game, it's fair to suggest little would have changed had the officials seen the ball cross the line. That defeat revealed that Capello was a busted flush tactically as the Germans’ between-the-lines attackers found gaps in England’s rigid, outmoded system. He clung on until 2012, before resigning in protest at the FA’s decision to strip John Terry of the captaincy.\n10. Don Revie (1974-1977)\nHighlight: Beating West Germany\nLowlight: Sneaking off to Dubai\nReplacing the great Alf Ramsey was a daunting prospect for any manager in 1974, even despite the World Cup-winning boss having failed to qualify for that year's World Cup. And so it proved for Don Revie. A great success with Leeds, winning multiple trophies in Yorkshire, Revie never managed to get to grips with succeeding Ramsey.\nThere were good results; beating world champions West Germany 2-0, a strong Czech team 3-0 and Scotland 5-1, but his mistrust of flair players, a strained relationship with FA bigwigs and England’s declining form led to an abrupt end. Revie sensationally left England to manage the UAE, selling the story of his departure to the Daily Mail – “Revie Quits Over Aggro” – before the FA had received his resignation letter.\n9. Roy Hodgson (2012-2016)\nHighlight: Euro 2012 was quite fun\nLowlight: Freezing against Iceland\nNo stranger to international management, having previously taken charge of Switzerland, the United Arab Emirates and Finland, Hodgson arrived before Euro 2012 in surprising circumstances - everyone expected Hary Redknapp to replace Fabio Capello - though he managed to boost his reputation with a reasonable job at the European Championship. Upon reaching the quarter-finals, England were given the run-around by Andrea Pirlo and Italy, and duly dumped out of the tournament.\nBut while Hodgson remained undefeated in qualifying matches (16 wins, four draws), his team underwhelmed at both the 2014 World Cup and Euro 2016.\nEngland failed to get out of the group at the former tournament, before suffering an ignominious last-16 defeat by Iceland in France two years later. The veteran manager did plenty to freshen England up after the Capello era, but he ultimately failed when it really mattered.\n8. Glenn Hoddle (1996-1999)\nHighlight: World Cup qualification in Rome\nLowlight: Dubious reincarnation views\nA mixed bag for Hoddle, who encouraged an attacking, passing style and whose victory at Le Tournoi is still recalled in revered tones in every office (OK, in FourFourTwo’s office).\nYet Hoddle didn’t always get selections right. At the 1998 World Cup, his decision not to start a red-hot Michael Owen in the first two games was a head-scratcher. At least Owen was in the side for the epic 2-2 draw and subsequent shootout loss to Argentina in the last-16.\nHoddle’s own exit was less epic. After intimating that people with disabilities may be paying for sins in a former life, he was let go, despite Hoddle’s claim that his words had been misinterpreted. A fine training-ground coach, it’s widely felt that his man-management deficiencies let him down.\n7. Ron Greenwood (1977-1982)\nHighlight: Two major tournaments\nLowlight: Two dour draws\nA manager defined less by who he was than who he wasn’t. Brian Clough was the popular choice to become England boss in 1977, but the FA chose the less irascible option of Greenwood, manager of a stylish West Ham side in the 1960s.\nAn able pair of hands, Greenwood took England to the 1982 World Cup after the failures of 1974 and 1978. His team topped their first group in Spain but back-to-back 0-0s in the second group stage spelled doom, with some suspecting that defensive-minded coach Don Howe had too much influence.\n6. Walter Winterbottom (1946-1962)\nHighlight: World Cup quarter-finals (1954, 1962)\nLowlight: Humbled by Uncle Sam\nEngland’s first full-time manager, pipe-smoking Winterbottom guided England to four successive World Cups (which is good) but lost 1-0 to a semi-professional USA side in 1950 (which is very bad).\nWinterbottom’s 16-year spell had other ups and downs. He convinced the FA that a manager should have sole control over team selection before he left the role, and repeatedly warned that sides in Europe and South America were surpassing England.\nYet despite that astute analysis, Winterbottom didn’t seem able to learn from England’s chastening 6-3 and 7-1 defeats by Hungary – undoubtedly a missed opportunity for self-reflection.\n5. Sven-Goran Eriksson (2001-2006)\nHighlight: 5-1 vs Germany\nLowlight: Fake sheikh shenanigans\nA mild-mannered chap whose time in charge of the Three Lions provoked fiercely differing opinions.\nOn the one hand, England’s first foreign manager bested an admittedly weak German side 5-1, took England to two World Cup and one Euros quarter-finals and generally delivered better results than the managers before or after him.\nHe did, however, only reach the quarter-finals while in charge of a hugely talented squad brimming full of some of the best players in Europe. Off-field scandals - the most amusing being Eriksson telling a ‘fake sheikh’ that he’d take the Aston Villa job after England won the World Cup – certainly didn’t help when it came to the Swede's critics.\nYet his reign is ultimately proof that the margins are fine at international level, with Eriksson’s England suffering two penalty shoot-out defeats in the quarter-finals of successive major tournaments.\n4. Terry Venables (1994-1996)\nHighlight: Football’s coming home (or being on the first cover of FFT... you decide)\nLowlight: El Tel left early\nA slick operator within the media and a highly adept coach, Venables used the Euro 1996 warm-up matches to fine-tune his ‘Christmas tree’ formation, with Alan Shearer the burly fairy up top.\nIt paid off in a tournament lit up by Paul Gascoigne’s goal against Scotland and a 4-1 demolition of the Netherlands. England were fortunate to sneak past Spain in the quarter-finals, but had chances to beat Germany in the last four before the inevitable exit on penalties.\nVenables stood down post-Euros, believing that the FA were unlikely to back him during the ongoing business and legal disputes which played out in the background of his tenure.\n3. Bobby Robson (1982-1990)\nHighlight: Nessun Dorma\nLowlight: Hand of God\nMemories of Robson’s reign focus on his twinkly-eyed charm and the glorious oh-so-near of Italia ’90, but it wasn’t always such a love-in. After exiting the 1986 World Cup to Argentina, Robson felt the venom of the press when Euro 1988 went badly wrong (three games, three defeats).\nAll that changed when England reached the semi-finals of the 1990 World Cup, taking eventual winners West Germany to penalties only to lose the shootout. That campaign played a big part in sparking the football renaissance in England during the 1990s, yet it’s the loyalty he inspired in players as varied as Paul Gascoigne, Gary Lineker and Terry Butcher that define Robson. A terrific man manager and a terrific football man.\n2. Gareth Southgate (2016-2024)\nHighlight: Football’s coming home: parts II, III and IV\nLowlight: The most painful penalty heartache yet\nSouthgate got the England job in unusual circumstances, replacing Sam Allardyce after the ex-Bolton boss was disposed following a newspaper sting. Expectations were low – his only previous experience of senior management came at Middlesbrough, who were relegated from the top flight on his watch – but Southgate exceeded them in his first tournament, forming a fresh and vibrant team that shone at the 2018 World Cup.\nThere, he took England to their first semi-final in almost three decades. Extra time against Croatia proved a bridge too far, but at least we got to hear a crowd – nay, a country – serenade the England manager with, “Southgate you’re the one; you still turn me on”, which didn’t feature in even the wildest pre-tournament predictions.\nHe followed that up by leading the Three Lions all the way to a Wembley final at Euro 2020, beating Germany for the first time at a major tournament since 1966 in the process. It was England's first-ever European Championship final but they came up just short by losing to Italy, you guessed it, on penalties.\nAfter a strong 2022 World Cup showing saw England suffer a stomachable quarter-final loss to France, Southgate's coup de grace - for plenty of his naysayers - came at Euro 2024 when his side lost another final against Spain. But while the now-knighted manager received plenty of (unjust) criticism throughout his tenure, no Three Lions manager has performed anywhere near as well in four successive tournaments.\nSure, that trophy he and the nation so desperately craved proved elusive, but Southgate reinvigorated a country's football team once again.\n1. Alf Ramsey (1963-1974)\nHighlight: Take a wild guess...\nLowlight: Substituting Charlton in 1970\nContrarians might point out that Ramsey is the only England boss fortunate enough to have the advantage of a World Cup on home soil. He also had a formidable group of players to pick from, including Bobby Charlton, Bobby Moore and Gordon Banks.\nHowever, other England managers have boasted world-class players and never come close to finding a system to unlock their talent. Ramsey did.\nHis ‘wingless wonders’ won the World Cup in 1966, and while it’s a shame his time in the job ended with the sack after failure to qualify for 1974 the World Cup, his legacy was secure by then.\nA sunny afternoon at Wembley; Bobby Moore lifting the trophy as the team hoisted their captain aloft; Ramsey watching on, letting his players soak up the adulation.\nGreg Lea is a freelance football journalist who's filled in wherever FourFourTwo needs him since 2014. He became a Crystal Palace fan after watching a 1-0 loss to Port Vale in 1998, and once got on the scoresheet in a primary school game against Wilfried Zaha's Whitehorse Manor (an own goal in an 8-0 defeat).\n- Alasdair Mackenzie\n- Ryan DabbsStaff writer",
  "word_count": 2566,
  "scraped_at": "2026-02-14T02:07:27.042270",
  "_text_extracted": true
}