{
  "article_id": "88ac1a05de47",
  "url": "https://theprideoflondon.com/posts/chelsea-0-2-man-city-blues-positives-and-negatives-01j5nady6ydw",
  "title": "Chelsea 0 - 2 Man City : Blues positives and negatives",
  "date": "20240819T204500Z",
  "domain": "theprideoflondon.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea’s winless streak against Manchester City since the 2021 Champions League final continues, as the hosts were defeated 2-0 by the reigning champions. Goals from Erling Haaland and Mateo Kovacic secured all three points for Pep Guardiola, triumphing over his former assistant, Enzo Maresca.\nHere are the positives and negatives from the match.\nPositives\n1. Team Progress Despite the Result\nThe football philosophy Enzo Maresca is introducing at Chelsea will take time to develop fully. However, from the first preseason match to Sunday’s game, the team’s improvement has been evident. Although Maresca’s Premier League debut as Chelsea's head coach was a tough challenge, the signs are clear that this team will look significantly better once they are settled and more accustomed to the Italian’s style of play.\n2. Promising Performances from New Signings\nWhile none of the new signings made it into the starting XI, four were introduced as second-half substitutes and showed promise. Pedro Neto stood out among the quartet, especially considering he joined the club only a week ago. With time and more training, the Portuguese winger could be an excellent addition, provided he stays injury-free.\n3. Romeo Lavia Shines in First Start\nRomeo Lavia's 2023-24 season was marred by injuries, limiting him to less than 40 minutes of play in any single match. Sunday marked his first start, and he arguably was Chelsea’s best player. He remained composed and distributed the ball effectively. If Lavia can stay fit, more minutes on the field will undoubtedly solidify his status as a great signing for the Blues.\nNegatives\n1. Defensive Errors Cost Goals\nWesley Fofana's poor positioning contributed to Man City's first goal, as he allowed Bernardo Silva to enter the box unchallenged. Had he been more aware, Silva might not have been able to assist Haaland, resulting in the goal.\nFor the second goal, instead of closing down Kovacic, Levi Colwill allowed the Croatian midfielder too much space, leading to the shot and the goal.\n2. Robert Sanchez’s Struggles\nThere’s a reason Robert Sanchez was Brighton’s third-choice goalkeeper. He has yet to show the qualities of a top-class shot-stopper. While he made some routine saves, extraordinary saves set elite goalkeepers apart. Sanchez’s positioning and attempt to save Kovacic’s shot were also disappointing.\nAlthough Sanchez’s ball-playing ability is often cited as an asset, he has been average in this area as well, as evidenced by his careless distribution. Chelsea should consider bringing in Filip Jörgensen, hoping the Dane is an upgrade, or rely more on Djordje Petrovic, who has already proven to be a better goalkeeper than Sanchez.\n3. Nicolas Jackson’s Finishing Woes\nAlthough Jackson had limited preseason action due to injury, his finishing has remained inconsistent, echoing his struggles from last season. Poor misses, mistimed shots, and hitting the ball straight at the goalkeeper instead of aiming for the corners have been all too familiar. Just as the goalkeeper position needs an upgrade, Chelsea might need to consider changes upfront to progress on the field.",
  "word_count": 497,
  "scraped_at": "2026-02-14T01:51:48.873525",
  "_text_extracted": true
}