{
  "article_id": "88b9701de12a",
  "url": "https://www.fourfourtwo.com/features/manchester-city-vs-liverpool-live-stream-match-preview-team-news-and-kick-off-time-for-this-premier-league-match",
  "title": "Manchester City vs Liverpool live stream , match preview , team news and kick - off time for this Premier League match",
  "date": "20230331T140000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nManchester City vs Liverpool live stream and match preview, Saturday 1 April, 12.30pm BST\nManchester City vs Liverpool live stream and match preview\nLooking for a Manchester City vs Liverpool live stream? We've got you covered. Manchester City vs Liverpool is being shown in the UK by BT Sport. Brit abroad? Use a VPN to watch the Premier League with your subscription from anywhere.\nManchester City will be looking to close the gap at the top of the table to five points, as they seek to overtake Arsenal in the Premier League title race.\nPep Guardiola's side are eight points adrift of top spot as they prepare to welcome Liverpool to the Etihad Stadium.\nThe Reds, meanwhile, trail fourth-placed Tottenham by seven points, although they have two games in hand on the north Londoners.\nKick-off is at 12.30pm BST. Make sure you know how to watch the Premier League wherever you are.\nTeam news\nPep Guardiola has named the following Manchester City starting 11, with the injured Erling Haaland a huge miss: (3-2-4-1) Ederson; Manuel Akanji, Ruben Dias, Nathan Ake; John Stones, Rodri; Riyad Mahrez, Kevin De Bruyne, Ilkay Gundogan (captain), Jack Grealish; Julian Alvarez\nJurgen Klopp has selected the following Liverpool starting 11: Alisson; Trent Alexander-Arnold, Ibrahima Konate, Virgil van Dijk, Andy Robertson; Harvey Elliott, Fabinho, Jordan Henderson (captain); Mo Salah, Cody Gakpo, Diogo Jota\nForm\nManchester City have won three games on the bounce in the top flight and are seeking a fourth consecutive victory for the first time this term.\nLiverpool were beaten 1-0 by Bournemouth in their last Premier League outing three weeks ago, which means they have still won only one away game in 2023.\nReferee\nSimon Hooper will be the referee for Manchester City vs Liverpool.\nStadium\nManchester City vs Liverpool will be played at the 53,500-capacity Etihad Stadium in Manchester.\nKick-off and channel\nManchester City vs Liverpool kick-off is at 12.30pm BST on Saturday 1 April in the UK. The game is being shown on BT Sport 1.\nIn the US, kick-off time is 7.30am ET / 4.30am PT. The match will be shown on NBC in the US. See below for international broadcast options.\nVPN guide\nUse a VPN to watch Premier League football from outside your country\nIf you’re out of the country for a Premier League fixture, then you won't be able to watch on your domestic streaming service as usual. The broadcaster knows where you are because of your IP address (boo!) and blocks you from watching it. You can use a VPN to get around that, though, without resorting to illegal feeds you’ve found on Reddit.\nA Virtual Private Network (VPN), assuming it complies with your broadcaster’s T&Cs, creates a private connection between your device and t'internet, meaning the service can’t work out where you are and will let you watch. And all the info going between is entirely encrypted, anonymous and safe – and that's a result.\nThere are plenty of good-value options out there. For the Premier League, FourFourTwo currently recommends:\nExpressVPN including a 30-day, money-back guarantee\nFourFourTwo’s brainy office mates TechRadar love its super speedy connections, trustworthy security and the fact it works with Android, Apple, Roku, Amazon Fire TV, PS5 and loads more. You also get a money-back guarantee, 24/7 support and it's currently available for a knockdown price. Go get it!\nInternational Premier League TV rights\n• UK: Sky Sports and BT Sport are the two main players once again, but Amazon also have a slice of the pie in 2022/23.\n• USA: NBC Sports Group are the Premier League rights holders, with the Peacock Premium streaming platform showing even more than the 175 games it aired last season. If you pick up a fuboTV subscription for the games not on Peacock Premium, you'll be able to watch every game.\n• Canada: The way to watch Premier League football in 2022/23 is fuboTV, which has exclusive rights to all the action.\n• Australia: Optus Sport will screen every game of the Premier League season. Non-subscribers can access the action via a Fetch TV box and other friendly streaming devices.\n• New Zealand: Sky Sport are serving up all 380 games – plus various highlights and magazine shows throughout the week, as well as the Champions League.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nGreg Lea is a freelance football journalist who's filled in wherever FourFourTwo needs him since 2014. He became a Crystal Palace fan after watching a 1-0 loss to Port Vale in 1998, and once got on the scoresheet in a primary school game against Wilfried Zaha's Whitehorse Manor (an own goal in an 8-0 defeat).",
  "word_count": 892,
  "scraped_at": "2026-02-14T02:29:12.767125",
  "_text_extracted": true
}