{
  "article_id": "88c6fff00e88",
  "url": "https://www.africanews.com/2024/06/22/can-2025-in-morocco-officially-postponed-to-december-2025-and-january-2026/",
  "title": "CAN 2025 in Morocco officially postponed to December 2025 and January 2026",
  "date": "20240622T183000Z",
  "domain": "africanews.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Morocco\nAs expected, the African Cup of Nations 2025 has been rescheduled by the Confederation of African Football (CAF) to take place in Morocco from December 21, 2025, to January 18, 2026. This decision comes after the announcement of the Club World Cup for the summer of 2025. This will mark the third consecutive edition of the tournament to be postponed, following the CAN 2021 in Cameroon and the CAN 2023 in Côte d'Ivoire.\nThe CAF EXCO also announced the dates of the CAF TotalEnergies Women’s Africa Cup of Nations (“WAFCON”) which will also be hosted in Morocco.\nThe Confederation of African Football initially agreed to host the CAN 2025 in July-August 2025 to avoid clashes with the first 32-team Club World Cup set for June 15 to July 13, 2025 in the United States. However, the summer schedule is overly congested. Recently, various soccer associations have been voicing their concerns about the overwhelming workload.\nConsequently, the African tournament has been postponed due to the clash with the Club World Cup-CAN 2025. Despite CAF's denial of any postponement rumors a few weeks ago, the General Secretary Veron Mosengo-Omba hinted at a possible delay in an interview with AFP, stating that discussions with relevant parties are at an advanced stage and a decision will be made public \"soon\". The postponement is now confirmed.\nThe 35th edition of the CAN, which will be held in Morocco, is set to make history with its unique scheduling. Unlike previous tournaments, this edition will span across two years, commencing on December 21, 2025, and concluding on January 18, 2026.\nThis unprecedented decision deviates from the traditional CAN schedule, which typically begins in early January and concludes in early February. The purpose behind this change is to prevent any clashes with the newly implemented UEFA Champions League format, which will take effect in 2024. With the new format, the C1 group stage's sixth matchday will conclude in mid-December, while the seventh matchday will commence around January 21.\nBy adopting this arrangement, players who participate in European leagues and compete in the UEFA Champions League will have the opportunity to represent their national teams without any scheduling conflicts.\nCAF has demonstrated a pattern of altering its original schedules since CAN 2012, showcasing a consistent trend of contradiction.",
  "word_count": 380,
  "scraped_at": "2026-02-14T02:10:54.418765",
  "_text_extracted": true
}