{
  "article_id": "891d6cedea49",
  "url": "https://www.geosuper.tv/latest/43182-psg-boss-luis-enrique-issues-warning-ahead-of-villa-second-leg",
  "title": "PSG Boss Luis Enrique issues warning ahead of Villa second leg",
  "date": "20250415T151500Z",
  "domain": "geosuper.tv",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "By Web Desk\nApril 15, 2025\nBIRMINGHAM: Paris Saint-Germain (PSG) will take on Aston Villa in the second leg of their UEFA Champions League quarter-final tie on April 15 at Villa Park in Birmingham.\nThe French giants lead the tie 3-1 after a dominant first-leg performance in Paris and are well-positioned to secure a place in the semi-finals, where they will face either Arsenal or Real Madrid.\nDespite the advantage, PSG head coach Luis Enrique remains cautious and has issued a stern warning to his players ahead of the crucial fixture.\n\"The tie is not over,\" Enrique warns ahead of the showdown. \"We have a lot of maturity within the team to not listen to all the noise going on outside.\n\"There will be a lot of moments when we need to dig in at Villa Park and we must be prepared for that so that we can achieve our goal of winning the tie.\"\nWhile PSG are viewed as favourites, Enrique is wary of the threat posed by Unai Emery’s Aston Villa, especially at home. The Spanish coach underlined the importance of staying focused and not underestimating their Premier League opponents.\nIn a bid to aid their preparations, the Ligue de Football Professionnel allowed PSG to postpone their weekend Ligue 1 fixture against Nantes.\nAston Villa, however, received no such concession from the Premier League and were in action against Southampton over the weekend.\n“At the end of tomorrow’s match, only one of the two teams will qualify for the semi-finals. That’s what makes this competition so exciting,” he added.",
  "word_count": 261,
  "scraped_at": "2026-02-14T02:26:33.612754",
  "_text_extracted": true
}