{
  "article_id": "89201f1657f4",
  "url": "https://www.heraldscotland.com/news/23608781.brendan-rodgers-celtic-rallying-cry-champions-league-push/",
  "title": "Brendan Rodgers in Celtic rallying cry for Champions League push",
  "date": "20230623T064500Z",
  "domain": "heraldscotland.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Brendan Rodgers settled in at Lennoxtown on Thursday – and immediately set his sights on the Champions League.\nIn a first address since being re-appointed Celtic manager earlier this week, the 50-year-old admitted his pride at returning to Glasgow four years after his departure for Leicester City.\nRodgers even added a first signing of his new era – midfielder Odin Thiago Holm from Norwegian side Valerenga. Holm will go straight into a squad which completed a clean sweep of domestic silverware last season, a feat Rodgers himself achieved twice before.\nBut having already won everything Scottish football has to offer has not dulled the Northern Irishman’s appetite for success. He’s not interested in looking back as past achievements as he insisted he’s here win it all again. And he hopes that can be a launchpad for significant progress on the European front.\nREAD MORE: Brendan Rodgers reveals secret Celtic briefing with Callum McGregor\n“I’m very proud and obviously really happy to be here,” Rodgers told Celtic TV. “Obviously a massive thank you to Dermot (Desmond) and the board for taking me back.\n“Everything just feels so natural and I’m really pleased. There were two factors. The first thing was that, when I came in the first time, and now, I’m here to win.\n“The nostalgia is great but it’s the past. Hopefully from that period what we achieved is set in concerted and it will always be there.\n“But I’m here again to win and look forward and continue with that mentality and look to see if we can do something in Europe. There’s no doubt that the happiness of being here played a huge part both professionally and personally.\n“From a football perspective we achieved and completed history while I was here. The aim will be to continue with that mentality going forward.\n“Also outside of the football, my family and everyone associated with me had great happiness in their time here. So what made to pretty straightforward in terms of wanting to come back.\n“Our life outside of football was incredible. Scotland and Glasgow were amazing for us. So from a professional perspective, and from a personal perspective, there was real happiness for us to come back (to).”\nIt’s believed a unified vision between manager and club on advancing Celtic’s standing in continental competition was a key factor in tempting Rodgers back to Scotland. He looked set to take a break from football after being dismissed by Leicester City in April.\nBut after talks with the Parkhead hierarchy he decided it was time to attend to some unfinished business. Rodgers has signed a three-year contract to replace Ange Postecoglou and believes this is the first time he has taken over a team in a position of strength.\nPostecoglou delivered a treble before departing for Tottenham Hotspur, and Rodgers was keen to pay tribute to the ‘fantastic’ work done by his predecessor. And he now’s determined to build on the foundations set by the Greek-Australian, including leading Celtic into next season’s Champions League group stage.\nREAD MORE: Brendan Rodgers addresses fans in first Celtic message\n“It will be the first job I’ve come in to where the team has been on a high,” said the former Liverpool manager. “When I’ve gone in to previous roles, there have been different situations. I think Ange has done fantastic job here over the last couple of years, culminating in finishing with the Treble.\n“It’s a fantastic achievement. What you’ve got is a young, hungry squad who, if they can keep that mentality, can continue to achieve.\n“I think Europe is always a big factor for this club. Can we develop the team to do something in Europe? Domestically, it’s always important, that’s your bread and butter, so being it’s about being dominant in Scotland and transferring that into Europe and see if we can achieve something.\n“My commitment has always been to aggressive attacking football. In my last time here we were able to achieve that. My commitment is always to be an attacking team, an aggressive team – and a winning team.”\nRodgers admitted the quality of squad left to him by Postecoglou was a significant draw in his return, revealing he sat down with captain Callum McGregor in Majorca earlier this month to gain a detailed understanding of his new charges. He’s set to find a much-changed group from the one he parted company with in 2019.\n“That was a big part in coming back [quality of squad],” said Rodgers. “When I look at the squad, you’ve virtually only got Callum who was from my time at the club, with James Forrest, who has been a fantastic servant to the club, also still here.\n“Callum was a big part of my decision to come back as well because I had a lunch with him in Majorca to understand the squad and where it was at, to understand where he felt the club was at.\n“He gave me some great feedback that the group was young, hungry and ready to keep pushing forward. For me, Callum is a brilliant player.\n“There’s also Scott Bain in the goalkeeping section, but there’s not too many others from my previous time. That’s exciting. There are a lot of young players who we can hopefully develop and improve.\nREAD MORE: All fans should get behind Brendan Rodgers on Celtic return - Kenneth Ward\n“With direction and the mentality, that can continue to achieve, while continuing that team spirit in order to win trophies.”\nRodgers wasted no time in signing off on the signing of 20-year-old Holm from Norway. And as well as being impressed by Holm’s dynamism and technical quality, the new manager was struck by the improvements made behind the scenes at Celtic.\nRodgers was given a guided tour of the club’s current structure by chief-executive Michael Nicholson and noted significant changes from his tenure. He also singled out Mark Lawwell for praise in bringing in players who have contributed to the past two seasons’ domestic success.\n“The one thing I’ll start by saying is the recruitment team, when Michael took me through the structure of the club from where it was at when I was here before, I can see a clear change in that infrastructure and the team behind the football team,” said Rodgers. “Mark [Lawwell] has done a brilliant job with the recruitment when you see the markets the club are operating in. He’s done a great job in bringing in the players that fit in to the profile of Celtic. And Odin is one of those players.\n“I like his technical quality, he’s dynamic, he’s young, he’s hungry but he’s also got speed. I’ve had the chance to meet him already. I met him Monday and had a good chat with him and he is very determined to do well at a big club like Celtic.”",
  "word_count": 1146,
  "scraped_at": "2026-02-14T02:09:58.115330",
  "_text_extracted": true
}