{
  "article_id": "892451f66a2b",
  "url": "https://www.the42.ie/mo-salah-form-6854761-Oct2025/",
  "title": "Liverpool boss Arne Slot backs Mohamed Salah to find scoring form again",
  "date": "20251024T201500Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "LIVERPOOL HEAD COACH Arne Slot insists the last thing he is worried about is Mohamed Salah ending his goal drought.\nThe Egypt international has not found the net in his last six matches for the club and has looked like he is missing his usual cutting edge.\nHe has just three goals this season, one of those a penalty, and was restricted to a 16-minute substitute appearance in the midweek Champions League win over Eintracht Frankfurt.\nHowever, there has been a decline in output since March with just five goals in 23 matches.\nWednesday’s victory ended Liverpool’s worst run of results since 2016 and whether that was partly a result of Salah’s form or vice-versa remains a subject for debate, but Slot has no doubts.\n“I don’t know if it’s sharpness or not. It’s so difficult, I could come up with a few reasons which I’m not sure are the reasons,” said the Reds boss.\n“In general in football players miss chances and Mo is a human being as well. We are not used to him missing chances, let alone a few in a row, but these things can happen.\n“It’s easier to finish a chance if you are 3-1 up than if you are 1-0 down but maybe that is not true for him.\n“But the main thing is Mo has always scored goals for our club and the last thing I worry about is Mo starting to score goals again.\n“That is what he has done his whole life and that is what I expect him to do in the upcoming weeks and months for our club as well.”\nThe influx of £450million of new signings in the summer has led to some teething problems and Salah has been a victim as much as anyone.\nTrent Alexander-Arnold’s departure to Real Madrid in the summer combined with injuries has seen Slot use three different right-backs already, including midfielder Dominik Szoboszlai.\n“I think (Salah) has been in promising positions often enough for him to score goals but maybe with Trent even more – I don’t know,” added the Dutchman.\n“But in general for every player, if you have quite a few changes in your squad during the summer then everyone has to find new connections again.\n“Mo is not an exception to this and it might have something to do with that.\n“In an ideal world you play every game with the same team but it’s not realistic for a team which plays every three days. Even if you wanted to, it is not possible as Jeremie Frimpong has been in and out with injuries a few times, Conor Bradley has had injuries, let alone (Alexis) Mac Allister missed out on pre-season and so did Alex (Isak).”\nSlot and Salah will hope Saturday’s evening trip to Brentford could be the turning point.\nThe Bees are one of the 33-year-old forward’s favourite opponents, scoring six times in seven appearances.\nFrimpong and goalkeeper Alisson Becker will definitely miss the match with hamstring injuries, while Slot is waiting updates on Isak, who sustained a groin problem in midweek, and midfielder Ryan Gravenberch, who did not travel to Germany due to an ankle injury.",
  "word_count": 530,
  "scraped_at": "2026-02-14T01:52:49.015096",
  "_text_extracted": true
}