{
  "article_id": "895914f7bfdf",
  "url": "https://www.uefa.com/uefaeuropaleague/news/028a-1a404395fc14-5bb1b6f67580-1000--last-16-what-to-look-out-for/",
  "title": "What to look out for in the UEFA Europa League round of 16 | UEFA Europa League",
  "date": "20240226T091500Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What to look out for in the UEFA Europa League round of 16\nThursday, March 7, 2024\nArticle summary\nSparta Praha stand in the path of Jürgen Klopp's Liverpool, Brighton boss Roberto De Zerbi heads home while six teams prepare to discover if third time really is the charm.\nArticle top media content\nArticle body\nThe distinct shape of the Dublin Arena, venue for the final, can just about be made out on the horizon as the 2023/24 UEFA Europa League reaches the latter stages. The round of 16 sees the return of the group winners, including Liverpool, Brighton and a trio who will meet teams that finished directly beneath them, hoping to pick up where they left off.\nIn this piece presented by Enterprise Rent-A-Car, we pick out some key talking points ahead of the first legs. Remember: Every mission matters.\n6 March\nSporting CP 1-1 Atalanta\n7 March\nSparta Praha vs Liverpool (18:45 CET)\nRoma vs Brighton (18:45 CET)\nQarabağ vs Leverkusen (18:45 CET)\nMarseille vs Villarreal (21:00 CET)\nBenfica vs Rangers (21:00 CET)\nFreiburg vs West Ham (21:00 CET)\nAC Milan vs Slavia Praha (21:00 CET)\nWhat happens next?\nRound of 16 second legs: 14 March\nQuarter-final & semi-final draws: 15 March\nQuarter-finals: 11 and 18 April\nSemi-finals: 2 and 9 May\nFinal: 22 May\nWhat to look out for\nSparta stand in Liverpool's way\nThere's never been a shortage of hunger for success at Anfield, but Jürgen Klopp's impending departure has focused hearts and minds at Liverpool like never before, with players, fans and staff united in their determination to say farewell in style. Barring an FA Cup final appearance, the Europa League final in Dublin could be the German's final game as Reds manager.\nOf course, Liverpool have not enjoyed the success they have had over the last nine years by looking too far ahead. First things first: Sparta Praha will be no pushovers. Last time out the Czech side stunned Galatasaray (Champions League conquerors of Manchester United, no less), overturning a 3-2 first-leg loss with a 4-1 home win. It sparked celebrations almost matched by those when the players gathered to watch the last-16 draw.\nDe Zerbi's licence to Rome\nBy his own admission, Roberto De Zerbi didn't reach his potential as a player, the AC Milan academy product making just three Serie A appearances (for Napoli) over a 14-year career spent mostly on the lower rungs of the Italian football ladder. \"I set out to enjoy fully what I hadn't enjoyed as a player,\" he said last year of his move to coaching. \"The full stadiums, big moves, characters.\"\nThe Italian, 44, is realising his dream. Having cut his managerial teeth at Sassuolo and Shakhtar, he arrived at Brighton with the unenviable task of picking up where Graham Potter left off, and exceeded all expectations, leading the side into Europe for the first time. The Seagulls flew through the group stage and now De Zerbi gets his wish of the big stage in his native Italy, with 67,000 expected at Roma.\nDeja vu all over again\nThe UEFA Europa League typically involves trips into the unknown, the opportunity to travel to new places to see clubs making waves and challenging the status quo. Brighton, for example. But for six of the last 16, by a quirk of the draw, there will be something very familiar about their next opponents: they met them in the group stage a few months ago.\nSporting CP and Atalanta were first up and familiarity got the better of them as they drew 1-1 on Wednesday. West Ham will go into their meeting with Freiburg with cause for confidence after beating the German side home and away, though domestic form has trailed off since. Then there's Qarabağ, twice beaten by Leverkusen (aggregate scoreline: 6-1) but, as they proved against Braga last time out, underestimate them at your peril.\nWhere is the 2024 Europa League final being played?\nThe 2023/24 Europa League season will conclude at Dublin Arena in the Republic of Ireland on 22 May 2024.\nWith a capacity in excess of 50,000, Dublin Arena is the home of the Republic of Ireland's national football and Ireland's rugby union team. First opened in 2010, the stadium will be staging its second UEFA Europa League decider, having been the venue for the all-Portuguese final of 2011 between Porto and Braga, when Radamel Falcao scored the only goal as the Dragons took the trophy.",
  "word_count": 743,
  "scraped_at": "2026-02-14T01:51:19.050274",
  "_text_extracted": true
}