{
  "article_id": "896dc06cb262",
  "url": "https://www.nytimes.com/athletic/5976906/2024/12/07/la-galaxy-mls-cup-final-win-red-bulls/",
  "title": "LA Galaxy 2 New York Red Bulls 1 : No Puig , no problem as Vanney team win sixth MLS Cup",
  "date": "20241208T004500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The LA Galaxy might have been without their most influential player this season in Sunday’s MLS Cup final but that did not stop them winning the trophy for the sixth time, beating New York Red Bulls on home soil in Carson, California.\nIt was a wild scene at the end. Galaxy players, including injured superstar Riqui Puig — wearing his jersey backwards — streamed onto the field, mistakenly believing the final whistle had blown, before being ushered back to the sidelines. But the celebrations would begin soon enough.\nAdvertisement\nPuig was out after his injury-defying heroics against Seattle Sounders in the last round but Greg Vanney’s team came racing out of the blocks, taking a 2-0 lead through goals by Joseph Paintsil and Dejan Joveljic inside the opening 13 minutes. The Red Bulls were shell-shocked and their star player Emil Forsberg had failed to touch the ball before they found themselves two goals down.\nThey found some control as the first half wore on though, and pulled a goal back when Sean Nealis converted from a corner in the 28th minute.\nThe second half was a much more even affair, with Gabriel Pec missing a big chance for Galaxy and Forsberg doing the same for Red Bulls, but Vanney’s side held out to stop their opponents from lifting the MLS Cup for the very first time.\nWe analyse the key talking points from Galaxy’s win on home soil at Dignity Health Sports Park…\nVanney has been Galaxy’s biggest signing\nThis final was a match-up between two old foes with starkly different levels of success in American soccer.\nThe Red Bulls have been rebranded. Their original look and feel as the New York/New Jersey Metrostars has been repackaged in the colors of the popular energy drink. For mainstream Americans, Red Bull is a drink consumed at parties and nightclubs. It’s a perennial Formula One championship-winning team. Red Bull gives you wings, not league titles.\nThe Galaxy have been here before. They’re used to the expectation that LA’s first MLS club should be in a final. But hard times, brought about by failed visions and mediocrity, set the club back years, a decade to be exact.\nHistory has repeated itself for the Galaxy, ever so slightly. Bruce Arena, the league’s most successful head coach to date, rescued the club in 2008 after their celebrity hire Ruud Gullit missed the mark. Arena had won two MLS Cup titles before taking the Galaxy job 16 years ago. He won three more in LA. Arena was a proven coach, like Vanney, who was brought in to stabilize a volatile club after the Galaxy moved on from former Boca Juniors star Guillermo Barros Schelotto.\nAdvertisement\nBarros Schelotto was a former MLS MVP with the Columbus Crew but he was unable to establish a winning culture. Vanney had played in MLS Cup finals as a player (never winning) but had won a final with Toronto in 2017. He had dressed in the Galaxy’s white kit as a player and understood the demands of America’s most popular team.\nThe Galaxy signed Puig from Barcelona, lured Pec from Brazil and sold an MLS dream to Paintsil. Marco Reus played in a UEFA Champions League final last spring, then boarded a flight to LA to live out his American dream.\nBut it’s Vanney, a known commodity in MLS, who has been LA’s biggest signing. He’s now a two-time MLS Cup-winning manager and the match-day architect of the club’s return to relevance. Order has been restored to the galaxy.\nHow did Galaxy cope without Puig?\nPuig became the heart and soul of the Galaxy in 2024. The No 10 was more than a creative playmaker: he became the emotional leader on match day. Galaxy players throughout the week said publicly that they would play for Puig — and they made good on the promise. He was up in the fancy seats, wearing a tailored suit, but somehow it still felt like Puig was at the heart of it all.\nMark Delgado, who stepped into the starting XI in Puig’s absence, had called the former Barcelona man “irreplaceable.” Delgado was right, but LA did a good job of trying.\nVanney echoed that sentiment in the build-up to the final, knowing that he would have to adjust tactically — and that he did.\nWithout Puig, the Galaxy conceded possession to the Red Bulls. New York held 54 per cent of the possession, as the Galaxy hoped to force the visitors into mistakes. Vanney opted for Delgado, a two-way No 8, and Uruguayan defensive midfielder Gaston Brugman. Delgado is a trusted player for Vanney. The final on Saturday was his fourth MLS Cup under the American manager.\nAdvertisement\nBrugman was a mainstay in Vanney’s midfield last season, but the 32-year-old has been overtaken by American Edwin Cerrillo, 24, a tough tackler, and a player who came of age in 2023 when he stared down Lionel Messi during a regular season match in LA. Still, it was Brugman who provided the opening assist of the match. A perfectly threaded pass to the Ghana international Paintsil.\nJP2⃣8⃣ pic.twitter.com/dE5kfV2mo7\n— LA Galaxy (@LAGalaxy) December 7, 2024\nThe goal was created after a clever one-two between Cerrillo and Brugman. Painstil searched for a Puig jersey as the partisan crowd were in raptures, finally dedicating his goal to his injured team-mate.\nThe Galaxy split open the spine of the Red Bull to go up 2-0 after 13 minutes. This time it was Delgado, whose one-time pass released Joveljic. The Serbian dribbled untouched into the Red Bull penalty area and finished with his weak foot past New York goalkeeper Carlos Coronel. His dedicatory celebration was a nod to Galaxy legend Robbie Keane. An awkward double somersault from Joveljic that harkened back to the glory days in Los Angeles.\nDejan is CLINICAL. pic.twitter.com/7XnAcXxPCy\n— LA Galaxy (@LAGalaxy) December 7, 2024\nIn the first half, Vanney’s game plan without Puig bore fruit — and it was enough to put Galaxy in an unassailable position.\nForsberg falls short in the final\nRed Bull is a well-known global football entity. They’ve become known as the sports conquistadores, traveling about the world and selling their footballing methodologies. Brazil, Germany and Austria have budding Red Bull clubs. In the U.S., the former Metrostars are a Red Bull brand that’s still searching for an identity.\nThe addition of Emil Forsberg signaled that the club were willing to bring in well-known attacking players, rather than relying on homegrowns and the occasional MLS journeyman. The Swedish international was decisive in the playoffs, but he was a non-factor on Saturday.\nIn the build-up to the game, he laid out his intentions. “I came here to… bring the Red Bulls back to something special,” he said. “The goal was to come here to win.”\nAdvertisement\nAs a No 10, Forsberg lacked an attacking partner, and he was anything but clinical in the final moments of the match. Forsberg represents what the Red Bull project in MLS could be: European pedigree and experience. But the Red Bulls can’t only be about fight and grit.\nWhere will the goals come from in the future? What style of play does Red Bull head coach Sandro Schwarz want to implement and will he be given the tools to evolve the club’s style of play?\nNew York was in an MLS Cup final again, but so many questions remain about the longevity of their success.\n(Top photo: Frederic J. Brown/AFP via Getty Images)",
  "word_count": 1247,
  "scraped_at": "2026-02-14T01:52:10.165352",
  "_text_extracted": true
}