{
  "article_id": "89782ec575fc",
  "url": "https://www.themag.co.uk/2024/01/chris-sutton-on-newcastle-united-little-bit-of-an-excuse-when-you-lose-that-many-games/",
  "title": "Chris Sutton on Newcastle United - Little bit of an excuse , when you lose that many games",
  "date": "20240116T151500Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chris Sutton on Newcastle United – Little bit of an excuse, when you lose that many games\nChris Sutton has been talking about Newcastle United.\nThe BBC Sport pundit speaking about the issues at St James’ Park and the current position.\nChris Sutton talking in the aftermath of the defeat to Manchester City.\nChris Sutton talking to BBC Radio 5 Live – 15 January 2024:\n“I have always admired how Eddie Howe’s teams play and if I am a Newcastle fan, I am enjoying what I am watching.\n“Albeit, the results haven’t been there recently.\n“I think maybe, we understand how the squad has been stretched, but maybe you could view that as being a little bit of an excuse, when you lose that many games.\n“I think they will be fine this season but I think it is too much of a stretch for them to get into a Champions League spot.\n“Especially now you know, with Eddie Howe coming out and saying, well hang on a minute, we need to hang fire in January [on signings].\n“I just wonder that whole situation, should maybe… or is there a regret at Newcastle, that they could have planned things differently?\n“[Instead of] Putting all the eggs in one basket and spending so big in the summer.”\nA lot of this smacks of hindsight, from Chris Sutton and others.\nI don’t recall any of the football ‘experts’ pointing to Newcastle’s summer transfer activity as having major faults.\nTonali was seen as a massive coup by NUFC and AC Milan fans and indeed the entire Italian football fraternity were furious at losing one of their best young internationals.\nHarvey Barnes was viewed as a very good signing, someone who has an outstanding record of scoring and assisting goals over a number of Premier League seasons.\nTino Livramento seen as an outstanding young prospect and just maybe needing a little time to get over having had a serious injury and missing pretty much an entire year of football.\nWhilst at 18, Lewis Hall a bonus signing for the future, only able to be done as it was an initial loan, set to be made permanent next summer (2024).\nWith Champions League football on top of the three domestic competitions, Eddie Howe and Newcastle United needing the reinforcements in last summer, rather than keeping serious spending capacity for this current January window. Signings that wouldn’t be able to influence the first half of the Premier League season and the Champions League group stage.\nOn the hindsight front, I find it laughable how so many clowns are saying surely Newcastle United should have known about Tonali’s gambling activity. By its very nature, it is something that players / individuals keep as secretive as possible. Funny how I have never seen a single pundit / journalist saying how they can’t believe Brentford didn’t find out about Ivan Toney’s gambling issues before signing him. Indeed, any of the other high profile cases where players in English football have ended up getting punishment for breaking betting rules, I have never seen any football ‘expert’ declaring, surely any club should have known.\nEddie Howe and Newcastle have just been so so unlucky, especially when their two big summer signings have played next to no games. Barnes picking up that absolute freak foot injury against Sheffield United with nobody near him, the previous two seasons at Leicester the winger had been unavailable for only seven of 76 Premier League matches.\nTino Livramento brilliantly handled by Eddie Howe, given the time to get settled at a new club as a young player and be fully ready after a year with almost no football. When he was then introduced he was man of the match against both Man City and Man U in the Carabao Cup, then following that up with an excellent run of form in the Premier League.\nOn the wider debate of missing players, to his credit, Eddie Howe has never made a big deal of it, using them as an overriding excuse for this run of results. However, he has pointed to them as a factor and indeed, you would have to be a laughable character if you didn’t acknowledge that missing players haven’t massively impacted in recent months.\nFor example, this is the list of who was unavailable against Man City:\nJoelinton – Brazil international\nNick Pope – England international\nTino Livramento – Very exciting young player and certainty to be England international in the future\nJacob Murphy – Featured in 36 of NUFC’s 38 Premier League matches as finished fourth last season.\nSandro Tonali – Italy international\nJoe Willock – Great player, a key factor in Newcastle’s fourth place finish last season\nHarvey Barnes – England international\nElliot Anderson – Newcastle’s top scorer during pre-season and very exciting young player\nCallum Wilson – England international striker\nMatt Targett – Second choice left-back who is Premier League level proven\nJavier Manquillo – Squad player\nThis list above has outstanding first choice goalkeeper Pope and Livramento who has been excellent. However, the real big story is that this list above has seven midfielders and attacking players who would all have been expected to play a lot of football this season and in the recent run of games.\nMidfield and attack is where you need the legs and with so many games in quick succession, where you need to at times rotate and especially, make changes during matches.\nThese last two Premier League games / defeats have been against arguably the best two teams in England and potentially Europe / The World, both Liverpool and Man City bringing on top class players who have scored and made the goals that won the matches, whilst Eddie Howe had pretty much nobody to bring on. Certainly not on a like for like basis, most certainly not a Kevin De Bruyne!\nWhat I think is also conveniently missed / ignored, is that whilst Eddie Howe has still generally been able to put a credible looking starting eleven on the pitch, the fact is that so often these past few months, those eleven have included players who clearly are not 100 per cent and who in other circumstances, Eddie Howe would never be starting. That eleven of course also including a 17 year old having to play in such a tough area as central midfield match after match, something that pretty much never happens at that age.\nI agree with some of what Chris Sutton is saying, especially about enjoying Eddie Howe’s football being good to watch and that NUFC will be fine this season, even if not Champions League fine.\nSometimes you just need to accept that these are tough times for your club, with factors beyond their control massively impacting.\nSimply a case of staying behind Eddie Howe and his players, supporting them as best we can from the stands.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1163,
  "scraped_at": "2026-02-14T02:10:42.041104",
  "_text_extracted": true
}