{
  "article_id": "899a6dea1b3c",
  "url": "https://www.themag.co.uk/2026/01/full-details-of-champions-league-play-off-draw-and-the-two-clubs-newcastle-united-can-play/",
  "title": "Full details of Champions League play - off draw and the two clubs Newcastle United can play",
  "date": "20260129T040000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Full details of Champions League play-off draw and the two clubs Newcastle United can play\nNewcastle United are in the Champions League play-off draw.\nA brilliant performance in Paris seeing them come so close to winning and progressing automatically to the last 16.\nHowever, the 1-1 draw means both Newcastle United and PSG are in the Champions League play-off draw.\nThe 2025/26 UEFA Champions League knockout phase play-off draw takes place on Friday 30 January at 11am.\nThe draw will be streamed live on UEFA.com and on the official UEFA Champions League app.\nThe play-off draw involves the teams finishing in ninth to 24th place in the league phase, the top eight sides in the league phase having qualified automatically for the round of 16.\nThe Champions League play-off draw will take place at the House of European Football in Nyon, Switzerland and this is how UEFA explain what will happen…\n‘a. The clubs are paired based on their positions at the end of the league phase to form four seeded pairs (clubs in positions 9 and 10, 11 and 12, 13 and 14, and 15 and 16) and four unseeded pairs (positions 17 and 18, 19 and 20, 21 and 22, and 23 and 24).\nb. The clubs in each seeded pair are drawn into the knockout phase bracket, against the clubs in each unseeded pair: clubs 9 or 10 against clubs 23 or 24, clubs 11 or 12 against clubs 21 or 22, clubs 13 or 14 against clubs 19 or 20, and clubs 15 or 16 against clubs 17 or 18.’\nPSG finished 11th on the same goal difference and number of points as Newcastle United, the French club ending up higher only on goals scored, meaning that NUFC were 12th in the Swiss League phase.\nSo in Friday’s Champions League play-off draw, PSG and Newcastle United are paired together, just as the clubs that finished 21st (Monaco) and 22nd (Qarabag FK) are paired.\nSo Newcastle United will be drawn against either Monaco or Qarabag FK, with PSG getting the other one of that pair which NUFC don’t get.\nChampions League play-off dates:\nThe play-off games to be played…\nFirst legs: 17/18 February 2026\nSecond legs: 24/25 February 2026\nPSG 1 Newcastle 1 – Wednesday 28 January 2026 8pm\nMatch Stats\nGoals:\nNewcastle United:\nWillock 45+2\nPSG:\nVitinha 8\nPossession was Newcastle 33% PSG 67%\nTotal shots were Newcastle 10 PSG 25\nShots on target were Newcastle 4 PSG 7\nCorners were Newcastle 1 PSG 5\nTouches in the opposition box Newcastle 25 PSG 48\nNewcastle team v PSG:\nPope, Miley, Thiaw, Botman, Burn, Hall, Tonali, Ramsey, Willock (Barnes 68), Elanga (Gordon 67), Woltemade (Wissa 79)\nUnused subs:\nRamsdale, Harris, Trippier, Osula, Jacob Murphy, Alex Murphy, Bruno, Shahar\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 475,
  "scraped_at": "2026-02-14T02:19:21.164320",
  "_text_extracted": true
}