{
  "article_id": "89f0a67c44a2",
  "url": "https://www.90min.com/posts/why-tottenham-want-sign-santiago-gimenez",
  "title": "Why Tottenham want to sign Santiago Gimenez",
  "date": "20231101T201500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Why Tottenham want to sign Santiago Gimenez\n- Santiago Gimenez has been on fire for Feyenoord this calendar year\n- Tottenham and Real Madrid are among the long list of clubs interested in the Mexican striker\n- Feyenoord are desperate not to sell Gimenez this January\n\"Un ano mas.\" One more year.\nThat was the headline Feyenoord chose to announce Santiago Gimenez's contract extension last summer but the highly rated Mexican striker does not look like he will be sticking around until his deal expires in 2027. At best, the Dutch champions will get one more year of his goals.\nPremier League leaders Tottenham Hotspur are one of several clubs feverishly sniffing around Feyenoord's frontman.\nHere's everything you need to know about why Gimenez is in such high demand...\nWhat Santiago Gimenez can bring to Tottenham\nGoals. That is Gimenez's chief selling point. As the hardest thing to do in football, offering a sharp edge to attacking sequences is worth plenty.\nGimenez spent his formative years at Cruz Azul in Mexico. His Argentine father Christian - or 'Chaco' as he was known - won the Copa Libertadores with Boca Juniors against Cruz Azul at the turn of the century, before moving to Mexico and winning the Central American equivalent a decade later with the club his son would represent. Santi would have to settle for domestic success before Feyenoord spotted his potential and whisked him away to Rotterdam for £5.2m in 2022.\nThe physical and mental toll of playing for Arne Slot's high-pressing side limited Gimenez's impact during his first five months at the club. Yet, a recalibration over the World Cup hiatus has sparked a radical uptick in form. In 2023, Gimenez has scored 29 goals in 34 games.\nFor all that Slot has tried to mould Gimenez into more of an all-round player, he very much remains a pure No 9 (even if he wears 29). A whopping 15% of every interaction Gimenez has with the ball ends in a shot - only two players in the Dutch top flight are more inclined to let rip. Since tucking the ball past Emmen's Eric Oelschlagel for his first Feyenoord goal from inside the D, Gimenez has not scored from outside the penalty box.\nSpurs lost Harry Kane - their top scorer from each of the previous nine seasons - to Bayern Munich in the summer. Son Heung-min has filled in admirably through the middle but Ange Postecoglou is not convinced about the fluency of his side going forward.\n\"A lot of our moves are not natural or how we want them to be,\" the Australian coach fretted in October - Gimenez is certainly a natural centre-forward.\nThere is of course the danger of the mythical Eredivisie tax. For every Ruud van Nistelrooy, there is a Vincent Janssen, for every Luis Suarez, an Afonso Alves.\nAccording to Opta's Power Rankings, which provides a statistically grounded rating for more than 13,000 teams from every corner of the globe, just two Eredivisie clubs this season are within the top 70 sides in the world (Gimenez's Feyenoord and PSV Eindhoven). By comparison, 16 of 20 Premier League teams are ranked 65th or higher.\nGimenez may fill his boots against the Eredivisie's also-rans but he has excelled on the elite European stage as well.\nSince arriving in Europe last summer, Gimenez has scored seven goals across just five starts in the Europa and Champions League, finding the net once every 73 minutes. He is one of just three regulars in the continent's two most prestigious competitions to average more than a goal per game in this time frame. Mohamed Salah and Erling Haaland are the other two. Not bad company to keep.\nSantiago Gimenez career stats\nThe details of Santiago Gimenez to Tottenham\nGimenez has attracted suitors from across the continent since last spring. In early April, 90min revealed that a glut of Premier League clubs had begun to keep tabs on the 22-year-old. But the consensus was that he needed another year - un ano mas - in the Netherlands.\nNews of Tottenham's interest filtered through in May, as Spurs sized up Feyenoord's manager Slot as well as their top scorer. As it transpired, neither the coach nor the striker swapped the Netherlands for N17 last summer. While Tottenham's interest in Slot has been extinguished by Postecoglou's lightning start, club scouts were part of the crowd that saw Gimenez score twice against Ajax in September before the match was postponed. The unrest among the stands was caused by raging Ajax fans rather than a scramble for Gimenez's signature but the race for the Mexican is fierce.\nLondon rivals Arsenal and Chelsea also had representatives present while the rest of Europe is just as aware of Gimenez's potential. 90min understands that Benfica, Borussia Dortmund, Inter, Juventus, Milan and Napoli all had scouts watching on, with Gimenez a key figure of interest.\nAs recently as April, Leicester City were among the interested parties in Gimenez but his relentless start to the new campaign has catapulted him into the realm of Real Madrid targets.\nFeyenoord are confident that they can keep hold of Gimenez during the January transfer window and have placed a prohibitive price tag around the Mexican's neck. If he is to leave the club this winter, any successful buyer would have to stump up a record fee for an Eredivisie player - currently the £87m sum Manchester United coughed up for Ajax's Antony.\nAt that price, Gimenez will almost certainly see out the season at Feyenoord. How many more years he'll have in Rotterdam after that remains to be seen.",
  "word_count": 937,
  "scraped_at": "2026-02-14T01:51:09.202346",
  "_text_extracted": true
}