{
  "article_id": "8a0926221649",
  "url": "https://www.the42.ie/shamrock-rovers-academy-6522765-Oct2024/",
  "title": "Have Shamrock Rovers found ingenious way to fund League of Ireland academies ? ",
  "date": "20241024T080000Z",
  "domain": "the42.ie",
  "source_country": "Ireland",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "THIS IS ANOTHER big week in the history of Shamrock Rovers.\nTonight, the reigning League of Ireland Premier Division champions face Larne at Windsor Park in an intriguing All-Ireland clash in the UEFA Conference League.\nStephen Bradley’s side already have one well-earned point in the league phase of the competition after a stirring comeback down to 10 men saw them snatch a late 1-1 draw at home to APOEL.\nThe Cypriots, by the way, have since sacked manager Jose Dominguez.\nRovers will believe they can win in Windsor tonight and continue their domestic impetus at the weekend.\nDylan Watts’ late strike away to Drogheda United last Friday ensured they stayed in third place, level on 55 points with Derry City but trailing leaders Shelbourne on 57.\nA trip to relegated Dundalk – who beat them at a Oriel Park earlier in the campaign – follows on Sunday.\nThe Hoops’ European exploits mean they will be in action 48 hours after their title rivals, so will know exactly how the land lies.\nEuropean football – even the qualifying rounds – offers the kind of riches that can help a club forecast and plan for the future.\nWinning the Premier Division – while earning a paltry €110,000 – does have greater benefits in that it secures a place on the champions’ path of European qualifying, thus providing a fall back with shots at reaching the Europa or Conference Leagues.\nRovers ended up in the third after reaching the Europa play-off stage, losing to PAOK.\nBut if you want a sense of just how truly fickle and brittle fortunes can be just go back to the Champions League first-round qualifying stage when Víkingur Reykjavík came to Tallaght Stadium after a 0-0 stalemate in Iceland.\nRovers had a 2-1 lead in the second leg when Jack Byrne was sent off on 74 minutes. Víkingur pulled one goal back and were awarded a penalty kick in the eighth minute of injury time to try and send the game into extra time.\nThey struck the post and the celebrations that followed were joyous in Dublin 24.\nBut for the powers that be in the boardroom their sense of jubilation was overpowered by relief.\nWhy does that hold even greater significance now?\nWell, the previous year Rovers recorded a loss of close to €2.3 million. They needed success and the UEFA money that can flow with it to help balance the books.\nRovers have already earned €3.87m from Europe this season with each Conference League win worth an additional €400,000 and a draw adding €133,000.\nBut you cannot budget for anywhere near that kind of windfall on a consistent basis in a notoriously volatile industry.\nThat is why events off the pitch – or at least the first-team one – this week could have the potential to have a far greater and long-lasting impact on the health of the club moving into the next decade, and beyond.\nRovers might just have found an ingenious way to help make League of Ireland academies sustainable by being completely independent of the first team’s fortunes.\nYesterday, The 42 reported how the reigning Premier Division champions had successfully reclassified their academy as a School Age Childcare provider (SAC).\nWith Tusla approval for the next three years and ongoing benchmarks and procedures to be met for increased child protection, the Hoops have been met with serious and genuine encouragement from senior Government figures as they are now entitled to funding through the Department of Children’s National Childcare Scheme (NCS).\nRovers chief executive John Martin this week wrote to his counterpart at the FAI, David Courell, to offer the association a place on the board of the newly formed Shamrock Rovers Community Foundation CLG, the not-for-profit arm of the club that will now take control of the academy and be legally obliged to invest all funds – and profits – back into the academy.\nThe NCS funding model means Rovers can avail of a minimum of €2.14 per child, per hour of training. Depending on family circumstances that could rise to €3.75.\nParents of children in the academy have been notified on the imminent changes, due to be in place over the next few weeks.\nAs detailed in The 42′s report yesterday, the League of Ireland club believe they will be able to increase contact hours for kids aged 8-14 to 300 hours a year, and if a pilot scheme to extend the NCS for players who are between 15 to 18 is also granted – and the club are hopeful Government will green light that before the end of this year – that would create up to 40 paid positions for coaches and other academy staff with the potential to earn between €400-600 a month within the next 12 months.\nThere must be two childcare practitioners for every 12 children per guidelines and Rovers also stress that this would help them increase some squad sizes with additional coaches.\n“It’s at an early stage of development but we feel it’s an innovative and progressive way of funding our academy and helping us support an industry,” Martin told The 42 yesterday. “We’ve been encouraged by the support from Government to pursue this.”\nThe reason for that is that the development of players within the academy is no longer majorly reliant on the first-team being successful to ensure sufficient budgets remain in place.\nThis can now operate at a significant level independent of what happens in the senior, professional ranks. That will be crucial to maintaining a sustainable model for academies as an industry in this country.\nRovers stress that this project, that has been established due to the work of former player Eoin Doyle’s consulting firm Sport Cosanta, could also be taken on by clubs in other sports around the country.\nBut it may fit in perfectly with the needs of League of Ireland clubs that are still waiting for any guidance as to what funding may well be coming for academies through the FAI’s own lobbying of Government.\nRovers could be to at the forefront of a revolution that has required the kind of thinking outside the box to find an Irish solution to a very Irish problem.\nIts outcome will have a far greater impact on the club’s future than tonight’s European tie.",
  "word_count": 1051,
  "scraped_at": "2026-02-14T01:51:57.640480",
  "_text_extracted": true
}