{
  "article_id": "8a1100692082",
  "url": "https://www.newkerala.com/news/o/kalinga-super-cup-2025-15-teams-take-centerstage-asian-922",
  "title": "Kalinga Super Cup 2025 Race for AFC Champions League Spot",
  "date": "20250419T133000Z",
  "domain": "newkerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bhubaneswar, April 19\nThe fifth instalment of the Kalinga Super Cup will kick off on Sunday as 15 teams battle it out for the trophy and a slot in next season's AFC Champions League Two. Unlike the last two years, where the tournament witnessed a group stage followed by semifinals, this season will be purely in a knockout format like 2018 and 2019, meaning every game is 'do or die'.\nThe Kalinga Super Cup's special connection with Bhubaneswar goes without saying. Three of the four editions, since the first in 2018, were hosted at the Kalinga Stadium, and the only time the tournament was held outside Odisha, at Kozhikode in 2023, the trophy was won by Odisha FC and brought to Bhubaneswar.\nLast year, East Bengal FC snatched the silverware, defeating the Juggernauts 3-2 after a thrilling period of extra-time in the final. The Red and Gold Brigade ended their 12-year wait for a national trophy, and are out to defend their crown on the same pitch. East Bengal are no stranger to defending cup titles, having won back-to-back Federation Cups in 2009-10 and 2010.\nThe Kolkata side's quest for a second Kalinga Super Cup begins in the Round of 16 on Sunday against Kerala Blasters FC, a side hunting their first-ever trophy at the national level. Both sides have had underwhelming ISL campaigns, ending in ninth and eighth place, respectively. So, this tournament presents them with a shot at glory. The winner of this clash will face Mohun Bagan Super Giant, who received a bye after Churchill Brothers' withdrawal, in the first quarterfinal.\nOn Monday, FC Goa, champions from 2019, will take on Gokulam Kerala FC in an inter-league showdown. The Gaurs couldn't make it past the group stage in the last two editions and will be eager to not only win the trophy again but also mark a return to the continental stage for the second time after the 2021 AFC Champions League. Gokulam Kerala are also eyeing a second Asian campaign after the 2022 AFC Cup. But the Malabarians have never gone past the Round of 16 of the Kalinga Super Cup. They finished without a win in the last two tournaments, including a 0-1 loss to Goa in the 2023 group stage.\nLater on Monday, hosts Odisha FC will face Punjab FC. Ever since making their Kalinga Super Cup debut in 2023, the Juggernauts have been the team to beat in the competition.\nChampions in 2023 and runners-up in 2024, the Super Cup has been their favourite tournament. It also opened their doors for a maiden AFC Cup appearance in 2023-24. Punjab FC also debuted in 2023, but have never made it past the group stage, winning just one of their six matches in the two seasons.\nBengaluru FC and Inter Kashi will meet for the third time in two seasons on Wednesday. They drew 1-1 in the Kalinga Super Cup group stage in 2024, before the Blues ran out 3-0 winners in the Durand Cup group stage in August last year.\nThe hurt of losing the ISL Final is still fresh for Bengaluru FC. But that will only add to the hunger of the first-ever winners of the Super Cup in 2018 as they look to become the first club to win the tournament twice, and also end their four-year absence from Asian competitions. Inter Kashi made their Kalinga Super Cup debut last year, coming through the qualifying round, but ending the group stage without a win in three.\nLater that day, Mumbai City FC and Chennaiyin FC will face off for the fourth time in the Super Cup, making it the most-played fixture in the tournament's brief history. The Islanders won 1-0 in each of the last two seasons' group stage, while the Marina Machans were 2-0 victors in the round of 16 in 2019.\nMumbai City have a 13-game unbeaten streak across all competitions against Chennaiyin, who haven't tasted victory in this fixture since February 2020. Both sides have played continental football before - Mumbai City in the 2022 and 2023-24 AFC Champions League, and Chennaiyin FC in the 2019 AFC Cup.\nNorthEast United FC and Mohammedan Sporting will lock horns on Thursday. It's already been a historic season for the Highlanders, who won their first-ever silverware in the form of the Durand Cup last August and made it to the Indian Super League (ISL) play-offs. NorthEast, whose best showing in the Super Cup was a semifinal appearance in 2023, will relish another cup win to end the campaign, just like how they began it. This comes with an extra prize of a maiden ticket to Asia.\nMohammedan SC, on the other hand, will hope to find some joy in the Kalinga Super Cup after a disheartening debut ISL campaign that concluded with just two wins. This will be the Black and White Brigade's second showing in the Super Cup -- the first being a 5-2 hammering at the hands of Gokulam Kerala in the qualifying round in 2023.\nThe round of 16 will conclude with a clash between Jamshedpur FC and Hyderabad FC later that day. The Red Miners, semi-finalists in each of the last two Super Cups, and also the ISL this season, will be desperate to go a couple of steps better and finally get their hands on the trophy.\nHyderabad will make their third Super Cup appearance but haven't made any mark in their first two, crashing out of the group stage in 2023 and 2024, getting one win in six attempts. As such, the Nizams will hope that the third time's the charm to target a good cup run. The quarterfinals will take place on April 26 and 27, the semi-finals on April 30, and the final on May 3.\nWhere will the Kalinga Super Cup 2025 be played?\nKalinga Super Cup 2025 will be played at the Kalinga Stadium.\nWhen will the Kalinga Super Cup 2025 be played?\nThe tournament kicks off on Sunday, April 20, with the final scheduled to be played on May 3.\nWhere to watch the Kalinga Super Cup 2025?\nKalinga Super Cup 2025 will be broadcast on Star Sports Network and livestreamed on JioHotstar.\n- IANS",
  "word_count": 1034,
  "scraped_at": "2026-02-14T02:11:32.307128",
  "_text_extracted": true
}