{
  "article_id": "8a25a5cdf979",
  "url": "https://www.thedrum.com/opinion/2023/07/18/what-bt-and-discovery-need-do-make-success-tnt",
  "title": "The Drum | What BT And Discovery Need To Do To Make A Success Of TNT",
  "date": "20230718T113000Z",
  "domain": "thedrum.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The UK has a new powerhouse sports broadcaster on the market - it has a huge job to do if it wants to challenge Sky Sports. Joe Weston, head of sport, We Are Social, lays out what TNT Sports needs to do to resonate in 2023.\nOne of the best-known brands in UK sports broadcasting, BT Sport, today rebrands to TNT Sports in partnership with Warner Brothers Discovery. Eventually, this will create a channel housing football, rugby, tennis and the Olympics all under one banner. It may well rival Sky Sports for high volume, quality content of major sporting events.\nAs well as offering healthy competition on the viewing front, this move represents an unmissable opportunity for the merging channels - and its impressive female-led presentation team - to take a different approach to sports coverage. Anyone who’s watched US broadcasts of sports events, from the Superbowl and the NFL to global football (or soccer) tournaments and athletics meets will be able to identify the vastly different approach to that we’re used to in the UK.\nCBS Sports is a great example of how to nail sports coverage. The channel has the rights to the Champions League coverage in the US and what it produces is pacey, fun and entertaining, with the passion and expertise of the pundits unmistakable. The presenting style of Jamie Carragher on Sky Sports in the UK is worlds apart from his work for CBS Sports, where he comes across more as a fan than a pundit. There’s a joviality to his exchanges that transforms the tone of the broadcast and, to my mind, makes it a far more enjoyable watch.\nBecause, let’s not forget, sport is about enjoyment.\nMaybe not when your team is losing, but when the half-time whistle goes viewers are invested in maintaining the momentum of the match, staying upbeat, rooting for their team. How many are waiting with bated breath for the detailed touchscreen analysis of each side’s strategy and a deep dive into a particular passing formation? The post-mortem should come the next day in the newspapers when there are column inches to fill and the fans are in a calmer, more contemplative mindset.\nThe more personality-led broadcasts also play brilliantly into social media, lending themselves to clips and cut-downs that can be shared all over Instagram, TikTok and more, extending the life of the initial show.\nThe power of social lies in its ability to tap into a niche for a specific audience. We know watching live sport on TV is less appealing to today’s Gen Z than it was to their parent's generation, with a Deloitte survey showing nine in 10 consume content via social media, so enabling them to share extracts that specifically appeal to them and their peers will help drive that much-needed passion for the game.\nAdvertisement\nThey want to see the hype, they want emphatic interview pieces, emotion, passion and spontaneity. And by posting these clips on owned social channels broadcasters own the moment instead of the world enjoying dodgy, shaky mobile recordings of TV replays.\nYounger fans are turned off by football in particular being presented as a giant commercial beast that takes itself too seriously and verges on the exclusionary rather than the inclusionary. They don’t care about the business side of this mega industry - they care about the role the sport plays in their own lives.\nToday, sports creators online are attracting audiences with niche content, from alternative commentary to comedy, while outrage also continues to work well on social. Indeed, our Think Forward: Sports Edition report earlier this year identified the Margin Chasers, a group for whom being seen to occupy the middle ground was the ultimate insult.\nAnd while the US has absolutely got its sports broadcasting right, we are starting to see slight shifts in the UK. Match of the Day, for example, now includes a presenter and pundits’ top 10 podcasts slot, and while it's not niche it is very specific and allows the pundits to act like fans. There should be more of this.\nMore moving from the studio to pitch side and grabbing players for spontaneous interviews, opening up more opportunities for human interaction and less for pulling apart their performance. Here, where Thierry Henry interviews Lukaku, is a beautiful example of connection that young fans want to see.\nThe existential threat in sport is the next generations becoming less and less engaged. So longer term, if you're going to place your bets anywhere you need to be placing them with Gen Z - who are now old enough now to be getting their own TV channel subscriptions.\nTNT Sport will always attract older audiences, those who have tuned in for decades, and they’re unlikely to switch off just because the coverage takes a turn towards something more jovial. But when it comes to younger audiences they have a golden opportunity to engage, they just need to package it up in a way that makes it more accessible and more fun.\nMaking the editorial decision to encourage pundits to show up on TV as a champion for the sport rather than a clinical analyst will allow broadcasters to build engagement through an online social media presence, one that will require a different approach to traditional television broadcasting.\nSo my advice to BT Sport, as it evolves into TNT Sport, is to work on finding the balance between its talent acting as an expert and acting as a fan and (usually) former player. If it can successfully address that conundrum it will make its content not only more appealing to younger viewers, but hugely more adaptable for social channels to boot.",
  "word_count": 946,
  "scraped_at": "2026-02-14T01:48:22.651473",
  "_text_extracted": true
}