{
  "article_id": "8a42d4efba6f",
  "url": "https://theathletic.com/4149638/2023/02/02/inside-newcastle-transfer-window/",
  "title": "Inside Newcastle transfer window : Balancing short - term success with long - term vision",
  "date": "20230202T171500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It is the morning before the night after — that evening of emotional heft, release and relief, of “Tell me ma, me ma” — and Newcastle United are talking long term.\nThe January transfer window is closing but not quite closed and barring miracles and last-minute loans, the club’s business for the month is done. The gamble (not the right word), has been not to gamble, to stick to their principles and their game plan, to trust the process (which very much is the right word).\nAnd come the morning after the night before?\nAdvertisement\n“It’s Sod’s Law,” says a figure at the top of the club, speaking anonymously to protect relationships.\nAmid the emotion and release and reality of reaching a Wembley cup final for the first time in a generation, Bruno Guimaraes is sent off for violent conduct. The straight red card means he will be suspended for the next three Premier League matches, and the one area of the team that was really looking light is now looking lighter still.\n“We’ll be fine,” they say.\nFor Newcastle, January 2023 was a month of contrast. A year earlier, there was a focused frenzy at St James’ Park; Eddie Howe doubled up as head coach and de facto sporting director, Amanda Staveley and Mehrdad Ghodoussi, the new co-owners, lost weight and lacked sleep, hundreds of calls were made, players targeted and rejected and at the end of it all a kind of exhausted alchemy. Five new additions, a cost of £92million ($113m), relegation swerved.\nThe memory of that mania prompts a rueful laugh.\n“It’s been much calmer,” the same source says.\nThe difference is everywhere, with Newcastle third in the Premier League, into the final of the Carabao Cup and boasting a new corporate structure to spread the workload. It is also a transformation of attitude, with the club looking “to buy what we want”, rather than acting out of short-term necessity. What they wanted last month simply wasn’t available.\nAnd then there is financial fair play (FFP).\nChelsea’s January spending blitz muddies this complex world of amortisation and financial juggling even further — supporters routinely ask on social media whether FFP even exists — but Newcastle have been consistent on the subject, on and off the record. The message: after spending around £211million on transfers in 2022 and, crucially, bringing very little money back in, with new sponsorship deals still to be finalised, they are at their limits.\nGO DEEPER\nHow were Chelsea allowed to spend so much in the January transfer window?\nTo be fair to Newcastle, they have tried their best to explain this, but when the wider narrative is “Richest club in the world™”, thanks to their 80 per cent ownership by Saudi Arabia’s Public Investment Fund, people have tended not to listen.\nAdvertisement\nIn their most recently published set of accounts, Newcastle’s annual turnover was £140million. Chelsea’s was £434.9million.\nCommercial income will inevitably rise — they are talking to several potential front-of-shirt sponsors, while a documentary is in the works which will bring them a bigger profile and more cash — but they are operating during a cost-of-living crisis, with high inflation, marketing budgets being slashed and other clubs seeking similar arrangements.\nIn October, Dan Ashworth, the sporting director, said Newcastle’s current level of spending was “unsustainable”, adding, “We have to look at some emerging talent, enhancing our academy and getting the players through from a different route. But also, FFP is quite complicated in the fact that it’s over the duration of a player’s contract. If you sell a player, the money hits the account at a different time than when you buy a player. It is making sure that the timing is right.”\nHowe, too, has repeatedly made similar comments.\n“We have spent money in the previous two windows and FFP is impacting what we can do,” he said at the start of January. “FFP and our need to improve are two different things.” Howe also said, “It will be the injury list that dictates what we do transfer-wise.” At another press conference he said, “Anything we do in January potentially harms us for the summer.”\nIn one respect, a theme stretches through from 12 months ago, when Newcastle outspent every other club in Europe.\nBack then, with the team still in the bottom three, nobody quite knew. Staveley was “waking up with that feeling of, ‘Did we do enough?’. I’m still having nightmares,” she told The Athletic last February. The question being asked by many supporters now is comparable, albeit with a transformative shift: are they strong enough to qualify for the Champions League?\nYet it is not a question being asked inside the club, at least not in the same way. There is recognition that Newcastle’s position in the table is “fantastic”, and precisely where they want to be, given time, but the priority is not getting into Europe just the once, however much this season might feel like an opportunity. “We want to be a sustainable, viable, long-term club,” says the source quoted earlier. “We don’t want to chase after this now and risk damaging ourselves in the process.”\nAdvertisement\nNewcastle end the winter window with one “impact-ready” addition in 21-year-old Anthony Gordon, signed from Everton for an initial fee of £40million, paid in a single, hefty chunk. Harrison Ashby, also 21, comes in as cover for Kieran Trippier at right-back, from West Ham United for £3million. Announced well ahead of time, Garang Kuol, the 18-year-old Australian prodigy, officially arrived on January 1 and was sent on loan to Hearts of the Scottish Premiership. All three were longstanding targets.\nSustainable, long-term; what does that mean in practice?\nGordon was the subject of interest from Newcastle last summer and would have been again in the coming one; they have acted now to get their man, paying cash to drive down Everton’s initial asking price, which was £20million more. He will strengthen the squad immediately and will develop and improve as a player. Howe needed backup for Trippier, hence the signing of Ashby, who they tried to buy on deadline day last September.\nThe club’s priority for January, however, was a central midfielder, someone who would free Guimaraes, arguably the team’s most influential player, to play higher up the pitch. Here, Newcastle were thwarted.\n“There’s very little out there, a real shortage of quality,” says the same source. “So what do we do? Bring in somebody for £50million that not everybody really believes in? What if they’re a flop? What if they mess up the dressing room?”.\nNewcastle are not the club they were six months ago — a notional threat. They are a threat now.\nThey might have stretched themselves, dangerously, to have bought (or borrowed) Conor Gallagher, a player they admire and one who would have added flexibility to the team, and Ghodoussi and Staveley are matey with Chelsea co-owner Todd Boehly, but they are now seen as the west Londoners’ “biggest competitors” for a top-four finish in May. Chelsea did business with Arsenal last month, but not with Newcastle.\nIt is a frustration and also a compliment, one they have encountered elsewhere.\nAdvertisement\nThey considered loans right until the deadline, but there was little in the way of frantic urgency. Ideally, Newcastle would always prefer options for a permanent transfer and there was no interest in simply bringing in another body. To get into Howe’s team now means being good enough for third place in the Premier League; good players, most often at good, competitive clubs, who have less reason or desire to lose them.\nAt St James’ Park, the notion of risk is reversed. While Chelsea are rolling the dice under Boehly, their co-owner and chairman, spending around £280million last month, Newcastle have taken a different approach, one they insist they have to.\nGO DEEPER\n'It's madness': How Premier League transfer spending is viewed in Europe\n“We’re just not about that. We’re about building and it’s every aspect, not just the first team,” the source says. “It’s about best practices and processes.” So, yes, qualifying for the Champions League is an aspiration, but not as a one-off. They want to get back there and then stay there.\nWhich is not to say that anybody at Newcastle would reject the top four this season; quite the opposite. The Champions League would pump-prime their commercial income, which is not to be sniffed at during challenging economic conditions, but they also point to the example of clubs such as West Ham and Leicester City who have got into Europe and then toiled in the parallel Premier League campaign. Newcastle do not want to be like that.\nThe notion that Newcastle could go for it and turbo-charge their progress is flawed, they insist, mainly because of FFP. Plenty of names were put to Howe and rejected; his exacting standards were not met. In turn, the head coach understands that the summer window of 2023 was always going to be more active than the January one for transfers, a time when commercial deals should be signed off, and that he will not be judged harshly if results become more difficult in the months ahead.\nEverybody agrees with that basic premise; the club began this season with an internal target of a top-10 finish and in board meetings, directors have acknowledged that by any reasonable standards, sixth or seventh should be regarded as a fine achievement.\nAnd then, of course, Guimaraes is sent off and Alexander Isak suffers a possible concussion in the second leg of the Carabao Cup semi-final against Southampton.\nSpeaking directly after that deadline-day match, Howe says, “I don’t think this window has been perfect for us. But that’s just the reality of the situation.” But he also says “no window is perfect”, and, “I think we’ve signed two really talented young players”. Speaking before the Southampton game, the source said, “Eddie is comfortable.”\nAdvertisement\nWorking relationships are solid and tight and the owners, says the source, “love Eddie”, who remains heavily involved in transfers, and is “very particular” in who the club signs, but with Ashworth now ensconced after arriving in the summer, his is not the only footballing voice.\nAshworth has a wider remit — the growth of the whole club, FFP compliance, squad age and the rest — where the coach is largely judged on first-team results. There are always little pulls in different directions.\nThe transfer market is traditionally a mixture of preparation and reaction — there is always something to respond to — and in Newcastle’s case, it came with outgoings.\nIf he had been asked in December about the prospect of Chris Wood or Jonjo Shelvey, two stalwarts of last season, leaving before the winter window shut, Howe would have dismissed it. But with both being offered better, longer contracts by Nottingham Forest than they were on, there was understanding and compromise.\nKarl Darlow’s loan to Hull City of the Championship was different, if only because of Newcastle’s unfeasibly large collection of senior goalkeepers, with Nick Pope unassailable in the starting XI, Martin Dubravka returning early from an unsatisfactory loan at Manchester United and Loris Karius extending his contract until the summer.\nThe timing of Wood’s departure, without Newcastle first sourcing a direct replacement for the striker, was more Ashworth than Howe. Indeed, Howe said not long afterwards, “Three or four days ago, it wouldn’t have been something that was on my horizon, losing a player we’ve used so much.” He added: “Certainly from my side, there was no thought of letting a player go and not replacing him. I think that would leave us dangerously short.”\nIn bigger-picture terms, in financial terms, the deal made sense; Wood is 31 and had started four league games this season.\nAdvertisement\nWhile many observers expressed incredulity when Newcastle activated Wood’s £25million release clause at then-relegation rivals Burnley last January, the New Zealand international more than played his part in what followed. Now, with Forest agreeing to turn his initial loan into a permanent transfer in the summer if certain conditions are met, Newcastle will effectively only have spent £12million on him.\nWith Wood gone, Newcastle pivoted. Howe’s primary concern had been to bolster his midfield with more athleticism and dynamism, complementing Guimaraes. Players who had been watched extensively included Leicester pair James Maddison and Youri Tielemans, Edson Alvarez of Ajax, Brighton’s Moises Caicedo and Scott McTominay of Manchester United, but fees, availability and the rest proved prohibitive.\nAnd it was not as if Newcastle could really sell to buy. At some point, recycling players must become part of the business plan, but the club rebuffed all enquires about Guimaraes, viewing him as a foundation of their side, and Howe shut down any talk of Allan Saint-Maximin leaving — not that there was any serious interest in the Frenchman. All their other assets are integral to the first team.\nA flexible forward was now sought.\nIn football terms, Wood was important; a reliable presence and tactically aware, if hardly a prolific goalscorer. After his departure, the senior figure quoted in this piece said there was “one nice deal” there for Newcastle to do, “a lad we really like and who wants to come, but the numbers are huge and we can’t do it at that price”. They also had a non-English alternative. As it turned out, Gordon was the first player and Nico Williams, the 20-year-old Athletic Bilbao winger, was the other.\nGordon prompted the one set of discussions which brought flashbacks to the tension and stress of 12 months earlier.\nEverton were (and remain) in a state of flux, with a confused chain of command and no manager. Farhad Moshiri, the Everton owner, insisted that negotiations took place at principal level, with Staveley and Ghodoussi working for Newcastle.\nAdvertisement\nWith the price set at £60million and suggestions Chelsea might pay in instalments of £40million then two £10million chunks, Newcastle walked away. But with Chelsea indicating they would not proceed, they finally shook hands with Everton at £40million up front with a bit extra in potential add-ons.\nAs with most, if not all of Newcastle’s domestic signings, Gordon had been coveted by Howe, although his age suited everybody. Howe sees an exciting, energetic, versatile and spiky player with plenty of room for development, which is exactly what he likes.\nShelvey’s exit, which was finally confirmed right before the window closed, was another deal that came from nowhere. His absence from the team had been more to do with injury — he made only three appearances in the Premier League this season, all off the bench — and the calculation here was not quite the same.\nWith the former England midfielder, who turns 31 this month, still not fully fit and his contract due to expire in the summer — unless he made two more starts, which would trigger another year — Newcastle sanctioned his departure even though it was leaving them short. A more complicated character to manage than Wood, but someone who has been integral to the squad since promotion in 2016, Shelvey was given an emotional send-off on the pitch at half-time on Tuesday night and showered with respect.\nNewcastle hoped their approach left them with enough pliability to cover most eventualities. Saint-Maximin and Isak, two players of talent, are still to work their way into Howe’s regular starting XI, Gordon gives them another attacking option, Joelinton can drop back into midfield and Sean Longstaff can move deeper.\nIn Shelvey’s absence, 20-year-old Elliot Anderson, “the Geordie Maradona”, as the song goes, will be given more of a chance. All eight of his league appearances this season have been as a substitute.\nGuimaraes’ red card and Isak’s possible concussion then happen. That’s football for you, but Newcastle believe they are robust enough to cope, and in any case they are looking beyond the next few matches, the next few months.\nWhere they are is great but the idea is to build, grow, and then cement their place at the top table. The idea is to be greater. Long-term, not the wrong term.\nAdditional contributor: Jacob Whitehead\n(Main graphic — photos: Getty Images/design: Sam Richardson)",
  "word_count": 2698,
  "scraped_at": "2026-02-14T01:59:41.724616",
  "_text_extracted": true
}