{
  "article_id": "8a49cf439b2f",
  "url": "https://thepeoplesperson.com/2024/04/26/former-man-united-midfielder-juan-mata-tells-sir-jim-ratcliffe-the-path-to-put-the-club-back-on-top-279433/",
  "title": "Former Man United midfielder Juan Mata tells Sir Jim Ratcliffe the path to put the club back on top - Man United News And Transfer News",
  "date": "20240426T223000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "INEOS have been making their presence felt in football for many years now, having invested in OGC Nice and Lausanne-Sport.\nThis has provided them with vital experience that may prove to be crucial in their aim to put Manchester United to the top echelons of the game following Sir Jim Ratcliffe’s purchase of a minority stake in the Premier League’s most successful side.\nTheir moves in the early days, including appointments of highly-rated football minds like Omar Berrada and Jason Wilcox, have also promised plenty, with many Man United fans believing they have found the right football owners after years of mediocrity under the Glazers family’s reign.\nArsenal are another Premier League heavyweights who have endured a dry spell in the last decade (or two). However, under Mikel Arteta, they have shown plenty of promise and could very well end their long wait for a league title this season.\nFormer United midfielder Juan Mata recently spoke with ESPN and advised the Red Devils to follow Arsenal’s suit.\n“We know the consistency that Man City is having over the years and for me, the sign of of a great club that is doing the right things on the pitch is one that if [they] don’t win, is second or third,” Mata said.\n“So I think the club first needs to focus on getting closer, like Arsenal is doing. Of course, Arsenal, a couple of years ago, was far away from winning and now they’re very close and I think United, hopefully with the new direction in the football side can do that.”\nThe big reason behind Arsenal’s success under Arteta is the club’s hierarchy’s patience with the Spaniard’s process.\nThe former Manchester City assistant coach moved to North London as Arsenal’s head coach in 2019 and it was not until 2023 that he led them back to the Champions League. During this period, he has also received plenty of financial backing in the transfer market.\nRatcliffe needs to make sure they show the same level of support and patience to their manager. Whether that is Erik ten Hag or someone else will become clear this summer.\nEarlier this week, a report in the Telegraph suggested that following the arrival of Wilcox, the club’s new technical director, Ten Hag has been effectively put on a “trial”.\nIt is added that Wilcox will conduct an audit of Ten Hag’s credentials before the higher-ups make a final decision on the Dutch coach’s position.\nWant to be the first to hear breaking Man United news? For carefully selected, crucial updates, join our WhatsApp channel: https://bit.ly/United-Breaking-News.",
  "word_count": 430,
  "scraped_at": "2026-02-14T01:56:51.543374",
  "_text_extracted": true
}