{
  "article_id": "8a4a04a8283a",
  "url": "https://www.caughtoffside.com/2025/10/30/just-in-tottenham-line-up-attacking-move/",
  "title": "Tottenham ready to make move to sign West Ham Jarrod Bowen",
  "date": "20251030T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur are reportedly preparing a bold €60 million bid to sign Jarrod Bowen from West Ham United, according to Fichajes.\nManager Thomas Frank, who has enjoyed an excellent start to life in North London, is eager to add further attacking depth as Spurs continue to push near the top of the Premier League table.\nBowen, one of West Ham’s most consistent and influential players in recent years, has emerged as a prime target to strengthen Tottenham’s frontline as Frank looks to elevate his side into genuine title contention.\nFrank’s arrival has injected renewed energy and tactical clarity into Tottenham’s squad.\nThomas Frank wants more signings at Tottenham\nWith the club currently sitting third in the Premier League, optimism is high, but Frank is under no illusion about the need to strengthen in key positions if Spurs are to maintain their challenge through the second half of the season.\nThe Dane has reportedly made reinforcements on the flanks a top priority, identifying Bowen as the ideal candidate to fit his high-intensity, attack-minded system.\nThe 28-year-old England international has been a central figure for the Hammers, combining relentless work rate with an eye for goal and a knack for producing in big moments.\nDespite Bowen’s importance to West Ham, the East London club could face a difficult decision in the coming transfer windows. While Bowen’s contract runs until 2030, reports suggest the winger may be open to a new challenge given the club’s recent struggles.\nWest Ham’s poor start to the season and their position near the bottom of the table have cast doubt over their ability to retain their key players.\nBowen could be open to a move to Spurs\nFor Bowen, a move to Spurs would not only offer the chance to play Champions League football but also to link up with a manager known for maximising player potential.\nTottenham, meanwhile, are believed to be ready to offer up to €60 million for the player, a figure that could tempt West Ham into negotiations, particularly if they plan to reinvest in multiple positions.\nThough Bowen remains a vital part of the squad, financial realities and the player’s ambitions may push the Hammers toward considering a sale.\nReport: Tottenham linked with surprise move to sign 2025 Ballon d’Or nominee",
  "word_count": 379,
  "scraped_at": "2026-02-14T01:52:49.009661",
  "_text_extracted": true
}