{
  "article_id": "8a52a11abccd",
  "url": "https://metro.co.uk/2023/03/31/man-utd-eddie-howe-hits-back-at-erik-ten-hag-over-annoying-newcastle-dig-18535968/",
  "title": "Man Utd : Eddie Howe hits back at Erik ten Hag over  annoying  Newcastle dig | Football",
  "date": "20230331T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Eddie Howe has responded to Erik ten Hag after the Manchester United manager called Newcastle’s ‘game management’ tactics ‘annoying’.\nNewcastle host United on Sunday in their first game since the international break and one that could prove pivotal in the race for the top four.\nThe Magpies are fifth in the table, only three points behind the Reds Devils in third, with Tottenham, Liverpool and Brighton also aiming to finish the Champions League qualification spots.\nThis will be the third meeting between the two sides this season, following October’s goalless draw at Old Trafford and February’s Carabao Cup final which United won 2-0.\nAhead of the final, Ten Hag called out Newcastle’s notorious time-wasting, saying: ‘It is an annoying team to play against so we have to find a way to play against them.\n‘They try to annoy you. So we have to make sure we play our game and focus on our game. So it’s up to us that we get speed in the game and we are also then dependent on the refereeing as well.\n‘For instance, if you see from the FA, the referees want to play an effective time. They have the lowest in the league [time when the ball is in play] and they are quite successful with it.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nAccording to Opta, on average the ball has been in play for just 51 minutes and 41 seconds in Newcastle’s matches this season – the lowest in the Premier League – but despite the stats not being in his favour, Howe is adamant the matter has been blown out of proportion.\n‘It’s part of the game, but not the main part of the game,’ the Newcastle head coach said in his pre-match press conference on Friday.\n‘The main part of the game is we have to play well. We have to be really good in possession and really good out of possession.\nMore Trending\n‘The game management stuff has been massively overblown towards us in the media. That’s just my opinion.\n‘First and foremost, we want to be a good football team, but if there are things you can do, as Kieran [Trippier] showed for the penalty [against Nottingham Forest], to help your team in certain moments, that are all within the laws of the game, we will try to do it.’\nIn some bad news for United, Howe confirmed that Nick Pope, Callum Wilson and Allan Saint-Maximin should be fit in time for Sunday’s game, though Miguel Almiron will miss it with a thigh injury.\nMORE: Former Arsenal star Philippe Senderos makes title prediction ahead of Leeds clash\nMORE: Ray Parlour names the two players Arsenal must tie down to new contracts after Bukayo Saka\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.",
  "word_count": 525,
  "scraped_at": "2026-02-14T01:53:35.631169",
  "_text_extracted": true
}