{
  "article_id": "8a630dcbfcb2",
  "url": "https://playingfor90.com/barca-vs-frankfurt-champions-league-tv-channel-prediction-team-news-and-lineups-01kbwef96sy2",
  "title": "Barça vs Frankfurt - Champions League : TV channel , prediction , team news and lineups",
  "date": "20251208T233000Z",
  "domain": "playingfor90.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "These two clubs have only ever met once before. It came in the quarter-finals of the 2022 Europa League, drawing 1-1 in Germany before Eintracht Frankfurt prevailed 3-2 in Catalonia, en route to winning the competition, backed by over 30,000 supporters who made their way inside Camp Nou.\nBarcelona vs Frankfurt preview\nBarcelona kick off 18th in the gigantic Champions League table, having finished second last time round, so really need a victory here to improve their position. A fortnight ago, Hansi Flick's side were hammered 3-0 by Chelsea at Stamford Bridge, with Ronald Araújo sent off on a miserable night in West London. This means Barça have just seven points on the board after five fixtures, also beaten by Paris Saint-Germain at Montjuïc, only managing to beat Newcastle and Olympiacos so far. Their two remaining opponents are Slavia Prague and København, both of which are certainly winnable, but they'll almost certainly require a victory here too if they're to gatecrash the top eight positions.\nWell, in La Liga, things could hardly be going much better, enjoying six successive victories, thereby sat top of the table. In the last week, Barça have beaten Atlético Madrid 3-1 at home, before a thrilling 5-3 victory over Real Betis on Saturday evening; Ferran Torres with a hat-trick at the Cartuja. Here, Barcelona will play a Champions League match back at Camp Nou for the first time since October 2022, a gap of 1,140 days. That night, Xavi's team were demolished 3-0 by Bayern Munich, thereby eliminated from the competition, hoping this clash with Bundesliga opposition goes rather better.\nAs for Eintracht Frankfurt, they really need points to keep their qualification hopes alive. Die Adler demolished Galatasaray 5-1 on matchday one, but have added just a solitary point to their tally subsequently. Dino Toppmöller's team left Napoli with a 0-0 draw, but have suffered 5-1 hammerings at the hands of both Atlético Madrid and Liverpool before, most recently, a resounding 3-0 defeat when Atalanta visited Waldstadion. Their two January fixtures are Qarabağ away and then Spurs at home, needing to win at least two out of three to stand any chance of a top 24 place.\nWell, in the Bundesliga, Frankfurt were annihilated 6-0 by RB Leizpig on Saturday, thereby suffering their biggest league loss since 1996. Across all competitions, Frankfurt's 20 fixtures so far have produced 85 goals; Barcelona's 21 outings have witnessed 89 goals. Thus, this will almost certainly be an entertaining affair, but Barça should be far too strong at Camp Nou.\nBarcelona vs Eintracht Frankfurt head-to-head record\n- Matches Played: 2.\n- Barcelona Wins: Zero. Draws: 1. Eintracht Frankfurt Wins: 1.\nBarcelona team news\nGavi and Dani Olmo are sidelined while Ronald Araujo has not been seen since being sent off at Stamford Bridge, given some time away from football by Hansi Flick to improve his mental health.\nIn terms of who will feature, Gerard Martín is set to continue as Pau Cubarsí's centre-back partner.\nRoony Bardghji was handed a rare start against Real Betis on Saturday marking the occasions with a goal, but will drop out here, with Frenkie de Jong, Fermín López, Raphinha and Robert Lewandowski all expected to come back into the lineup.\nBarcelona predicted lineup vs Eintracht Frankfurt: (4-3-3): García; Koundé, Cubarsí, Martín, Balde; Eric García, Pedri, Fermín López; Lamine Yamal, Raphinha, Lewandowski.\nBarcelona player to watch vs Frankfurt\nLamine Yamal bagged his eighth goal of the season at the Cartuja on Saturday, netting seven times in his Champions Leage career, with the teenager very much Barça's most dangerous attacker.\nFrankfurt team news\nDino Toppmöller travels to Catalonia without striker Jonny Burkardt, who was on fire earlier this season, but has missed the last two matches due to a calf injury.\nMichy Batshuayi also picked up a knock during Saturday's shellacking at RB Leipzig, so Ansgar Knauff could lead the attack, with Ritsu Dōan and Jean-Mattéo Bahoya in support.\nEintracht Frankfurt predicted lineup vs Barcelona: (3-4-3): Zetterer; Collins, Koch, Theate; Kristensen Chaïbi, Højlund, Brown; Dōan, Bahoya, Knauff.\nFrankfurt player to watch vs Barcelona\nEven if he doesn't start, 20 year old Can Uzun is Frankfurt's best young attacker, having scored six times so far this season, so can he announce himself to a wider audience here?\nBarcelona vs Eintracht Frankfurt prediction\nAs already mentioned, this Tuesday night Champions League tie guarantees goals, but we're forecasting that the vast majority of them will be scored by Barcelona, with Eintracht Frankfurt simply far too generous at the back to compete at this level: Barcelona 4-1 Eintracht Frankfurt.\nBarcelona vs Frankfurt FAQs - UEFA Champions League\nHow to watch Barcelona vs Frankfurt in the Champions League on TV channel?\nBarcelona vs Eintracht Frankfurt in the Champions League will be available on the following TV channels;\n- UK: TNT Sports 4.\n- USA: Paramount+ & Univision\n- Canada: DAZN Canada\nHow to watch Barcelona vs Frankfurt in the Champions League on live streaming?\nBarcelona vs Eintracht Frankfurt in the Champions League will be available on the following streaming services;\n- UK: Discovery+\n- USA: Paramount+\n- Canada: DAZN Canada\nWhat is the date and kick-off time for Barcelona vs Frankfurt in the Champions League?\nBarcelona vs Eintracht Frankfurt takes place on Tuesday 9 December 2025, with kick off at 20:00 (GMT), 15:00 (ET) & 12:00 (PT).",
  "word_count": 886,
  "scraped_at": "2026-02-14T02:28:55.393480",
  "_text_extracted": true
}