{
  "article_id": "8a6847628b1c",
  "url": "https://www.namibian.com.na/petrus-enjoying-new-life-in-rwanda/",
  "title": "Petrus enjoying new life in Rwanda",
  "date": "20260120T101500Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Namibian defensive midfielder Aprocius Petrus (26) is enjoying an impressive but unusual season, playing in the Rwanda Premier League with Sudanese club Al Hilal Sports Club.\nAl Hilal moved to the top of the Rwanda Premier League standings for the first time this season after a commanding 4-0 victory over Rayon Sports FC. The result lifted the Sudanese side to the summit with 35 points after 15 matches, with two games in hand, while most teams have already played 17 matches.\nPetrus made his league debut in Al Hilal’s opening fixture against Police FC and has since become a regular and influential presence in midfield, featuring week in, week out.\nThe 50-capped Brave Warriors international joined Al Hilal on a four-year deal from Cape Town City FC following the club’s relegation from South Africa’s Premier Soccer League (PSL) to the National First Division (NFD). Petrus spent one year and five months with the Citizens, making 37 appearances across all competitions.\nIn an unprecedented decision the Rwanda Football Federation, following approval from the Confederation of African Football (CAF) executive committee, sanctioned the participation of Al Hilal Sports Club and fellow Sudanese side Al Merrikh FC in the 2025/26 Rwanda Premier League season. The decision has seen Petrus become the first Namibian footballer to feature in Rwanda’s top flight.\nThe decision follows the continued suspension of domestic football in Sudan due to the ongoing civil war, which has forced the country’s leading clubs to seek competitive football abroad.\nDuring the 2024/25 season, Al Hilal and Al Merrikh temporarily competed in the Mauritanian Premier League, finishing first and sixth, respectively, although Al Hilal were ineligible to claim the domestic title due to their status as foreign entrants.\nAl Hilal have also maintained strong continental form, reaching the CAF Champions League quarter-finals in 2024/25 season, underlining the high level of competition and experience Petrus is gaining during his standout season in Rwanda.\nIn the current 2025/26 season, Al Hilal have been drawn in CAF Champions League Group C alongside Mamelodi Sundowns FC, MC Alger (Algeria) and FC Saint-Éloi Lupopo (Democratic Republic of Congo) setting up an exciting all-Namibian showdown between Peter Shalulile (Sundowns) and Petrus (Al Hilal), with the two countrymen set to face each other on 23 January, marking the first-ever club-level meeting between the pair.\nAfter two matches, both Al Hilal and Sundowns remain unbeaten and level on four points, setting the stage for a tightly contested group.\nIn the Botswana Premier League, Gaborone United FC maintained their unbeaten start to the season with a narrow 1-0 victory over Botswana Defence Force XI at VTM Arena.\nNamibian defender Ivan Kamberipa was the hero of the night, scoring the winning goal in the 88th minute to secure all three points for the Reds.\nNamibian forward Obrey Amseb, who recently joined Gaborone United from Gabon-based Young African FC, made his club debut, coming on in the 60th minute. Another familiar name to Namibian football fans, Ibroihim Youssouf of Comoros – formerly of African Stars FC – also made his debut, entering the match in the 78th minute.\nThe victory sees Gaborone United remain top of the league standings after 12 matches.\nElsewhere, Dynamo Fredericks featured in the starting line-up as Jwaneng Galaxy FC claimed a 2-0 win over Marcel Papama’s Township Rollers FC. The result moved Galaxy up to second place on the log with 29 points, while Rollers remain sixth on 23 points. Namibian midfielder Marcel Papama missed the encounter as he was not in the matchday squad.\nIn Malaysia, Petrus Shitembi was in the starting lineup as his side played Penang FC away in the first leg of the Malaysian Cup. They went down 1-0 and will be hoping to bounce back and overturn the deficit in the second leg to advance to the quarter-finals.\nThis is their last realistic chance of keeping their silverware hopes for the 2025/26 season alive after falling short in the Malaysia FA Cup semi-finals against Johor Darul Ta’zim, losing 2-1 on aggregate over two legs, and sitting 17 points behind league leaders Johor Darul Ta’zim FC after 15 matches.\nIn England, Ryan Nyambe was an unused substitute as Derby County secured an important away win against sixth-placed Preston FC in Gameweek 26. The victory lifted Derby to 12th place on the table, a much-needed result after their FA Cup exit to Leeds United, where they lost 3-1 in their previous match.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 839,
  "scraped_at": "2026-02-14T02:12:22.659904",
  "_text_extracted": true
}