{
  "article_id": "8a6a6d6a524f",
  "url": "https://tribune.com.pk/story/2393708/guardiola-regrets-dropped-points",
  "title": "Guardiola regrets dropped points",
  "date": "20230101T154500Z",
  "domain": "tribune.com.pk",
  "source_country": "Pakistan",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Guardiola regrets dropped points\nMan City play 1-1 draw at home to Everton to fall seven points behind leaders Arsenal\nPep Guardiola rued the loss of two points following a 1-1 draw at home to Everton but insisted he had no complaints about the visitors' approach in a fiery Premier League clash at the Etihad Stadium on Saturday.\nErling Haaland fired reigning champions City into a first-half lead only for Demarai Gray to equalise midway through the second period of a match featuring numerous fouls.\nThe game also required 11 minutes' stoppage time following repairs to an assistant referee's headset.\nThe result left second-placed City seven points behind Arsenal heading into 2023 after the Gunners won 4-2 at Brighton in Saturday's late clash.\nCity manager Guardiola, reflecting on Everton's tactics, said: \"They made a fantastic goal with the first shot on target they had, so we played a real, real good game.\n\"Of course the result was not expected but that is football, it is not the first time it happened. We did everything to win. They played really well.\"\nThe Spaniard added: \"Afterwards they broke a bit of the rhythm because the referees were not ready but, in general, we did everything and unfortunately could not win.\"\nA battling draw gave Everton a first point in four matches and left the Merseysiders, who had lost 2-1 at home to Wolves in their first post-World Cup game, two points above the relegation zone.\n\"I think we did limit their good chances,\" said Everton manager Frank Lampard.\n\"And in terms of our character and discipline and following through with the plan, working consistently for 100-odd minutes, understanding that's sometimes tough and you have to stick with it, I thought we did that brilliantly and we deserved a point.\"\nLampard, turning to Gray's \"unstoppable\" strike, said: \"When he hits a goal like that it just shows you the talent he's got, and it got us a point.\"\nArsenal have 'desire' to lift title: Arteta\nMikel Arteta said Arsenal's 4-2 win at Brighton proved the Premier League leaders have the \"desire\" required to lift the title for the first time since 2004.\nArteta's side will go into the new year with a formidable seven-point lead over second placed Manchester City after they powered to a fifth successive league victory.\nGoals from Bukayo Saka, Martin Odegaard and Eddie Nketiah set the Gunners on course to cement their unexpected status as serious title contenders.\nKaoru Mitoma reduced Brighton's deficit before Martinelli raced half the length of the pitch to finish off Odegaard's sublime pass.\nBrighton substitute Evan Ferguson claimed his first Premier League goal in the closing stages, but Arsenal survived a nervous finish to make it nine league wins from 10 games.\n\"It's a big win against a really good side. We had big moments, especially attacking the spaces with the way they play. We were ruthless, clinical,\" Arteta said.\n\"We had some great moments, and also moments when we have to dig in and suffer. You expect that against Brighton.\"\nAfter squandering a golden opportunity to qualify for the Champions League with a late collapse in the Premier League last term, Arsenal found themselves written off as also-rans ahead of this season.\nBut Gunners boss Arteta has worked impressively to revitalise his team, sparking dreams among their fans of winning a first English title since Arsene Wenger's \"Invincibles\".\nArsenal's haul of 43 points from 16 games is among the five best starts to an English top-flight season, with the other four teams all going on to claim the title.\n\"You can't expect to not concede anything with the way they play. It's a big test for us, but we win two in a row after the break and now on to the next one,\" Arteta said.\n\"I think we have enough desire. We know the other results, but we know our success will be from what we do.\n\"This is what we want to continue, to improve as a team and play better, to dominate all the areas like today. We had to suffer but we show we could manage the game.\"\nCOMMENTS\nComments are moderated and generally will be posted if they are on-topic and not abusive.\nFor more information, please see our Comments FAQ",
  "word_count": 713,
  "scraped_at": "2026-02-14T01:53:21.845525",
  "_text_extracted": true
}