{
  "article_id": "8a7c4c5ec7fe",
  "url": "https://thenationonlineng.net/eyes-on-remo-stars-as-nigerias-quartet-brace-for-continental-cups/",
  "title": "Eyes on Remo Stars as Nigeria quartet  brace for continental cups",
  "date": "20250926T064500Z",
  "domain": "thenationonlineng.net",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sports\nSeptember 26, 2025 by Tunde Liadi\nEyes on Remo Stars as Nigeria’s quartet brace for continental cups\nWith mixed fortunes from the first-leg results, Nigerian clubs are on the rampage again starting from today with key games in the CAF inter-club competitions, TUNDE LIADI writes on the hurdles before the Nigeria’s quartet as the second leg ties get underway with Remo facing US Zilimadjou of Comoros yet again in Abeokuta…\nWith 120 clubs entering the CAF Champions League and Confederation Cup — the largest pool in history — the continent is braced for intense battles and Nigeria’s quartet of Remo Stars, Rivers United, Abia Warriors and Kwara United know they must step up to restore lost prestige.\nFor over a decade, Nigerian clubs have struggled to make a significant impact in Africa. The last CAF Champions League triumph dates back to 2004 when Enyimba against all odds, broke the stronghold of North African teams while no Nigerian side has lifted the Confederation Cup since its inception. Early exits and dwindling CAF rankings have painted Nigerian football as underachieving as such, this season offers a fresh chance to change that narrative.\nNigeria’s CAF struggles are not just about tactics or player quality. Structural issues — poor infrastructure, financial instability, and the exodus of players abroad — often derail campaigns. The misalignment of Nigeria’s domestic calendar with CAF schedules means clubs frequently juggle competitions without rhythm.\nBut kudos to the Nigeria Premier Football League organisers, who have ensured the league season started on schedule in the last few seasons, with the country’s representatives on the continent involved in preseason tournaments to ease their preparation. They were also able to play a few games of the current campaign before they played their first inter-club games.\nCAF has doubled preliminary round grants from $50,000 to $100,000, a welcome boost for logistics. Nigeria’s four clubs will also share over ₦616 million in support from CAF, easing some financial burdens. For clubs like Abia Warriors and Kwara United, such funds could prove crucial in sustaining the journey.\nAnd amidst challenges, there are bright sparks. Young talents like Remo’s Leonard Ngenge, who scored on debut while filling the void of departed captain Junior Nduka, embody a new spirit of belief. Kwara’s resilience in Kumasi shows Nigerian sides can score and compete away. These signs, though small, may mark a shift.\nRead Also: Nottingham Forest manager laments Aina absence\nFrom Abeokuta to Bamako, Nigeria’s representatives have contrasting journeys but a shared mission: to restore Nigeria’s name in African club football. Remo Stars’ youthful ambition, Rivers United’s experience, Abia Warriors’ underdog grit, and Kwara United’s fiery resolve all carry the hopes of millions.\nThe path is tough, the margins thin but if discipline, preparation and self-belief align, Nigerian clubs may yet turn 2025/26 into the season that reawakens their continental relevance.\nRemo Stars dream big\nMaking only their third appearance in Africa’s elite competition, Remo Stars announced themselves in style with a 4–0 demolition of Comoros champions US Zilimadjou in the first leg at Abeokuta. Goals from Leonard Ngenge, Ebuka Anthony, Adama Goita, and Samson Olasupo set up a commanding advantage.\nWith today’s return leg fixed for the MKO Abiola Stadium, Abeokuta, following renovation works at the Remo Stars Stadium, Ikenne, head coach Tiago Conde insists his players must remain humble.\n“We won 4-0, it could be 5 or 6. But the eliminatory is not finished. We have another game, and we must approach it with the same discipline,” he said.\nThe absence of injured striker Victor Mbaoma is a blow but Conde has instilled a culture of discipline and tactical focus. Their immediate aim is progression but their long-term goal is to establish themselves as consistent continental contenders.\nRemo Stars will have former champions, Mamelodi Sundowns, waiting for them in the next round, with their place in the second preliminary round almost assured with a 4-0 advantage going into the second leg.\nRivers United lean on experience\nWhile Remo Stars provide freshness, Rivers United bank on their continental experience. Drawn against DR Congo opposition, Aigles du Congo, the Port Harcourt side got a morale-boosting draw away in Kinshasa. Rivers United, ranked Nigeria’s highest CAF-rated club at 24th , have the pedigree of recent quarterfinal runs but need greater consistency if they are to out-perform the Congolese in Uyo this weekend.\nTechnical Manager Finidi George has built a side capable of blending grit and flair, with key men like Ubong Friday and Anthony Omaka expected to shoulder responsibility. Rivers United carry perhaps Nigeria’s strongest chance of going deep in the Champions League, if they can navigate the tricky preliminary rounds.\nMeanwhile, Rivers United will slug it out with the winner between AC Leopards of Congo and Black Bulls of Mozambique if they are able to surmount the Aigles du Congo hurdle.\nBaptism of Fire for Abia Warriors in Bamako\nThe Confederation Cup debutants, Abia Warriors, face a daunting task against Djoliba AC in Bamako, having drawn 1-1 at home against the Malians. Djoliba are seasoned campaigners, with multiple semifinal appearances in their history.\nFor Abia Warriors, the tie represents both a test and an opportunity to show that their NPFL progress can translate onto the continental stage.\nHead coach Imama Amapakabo has urged his young side to play without fear. While the odds may be stacked against them, upsets remain part of African football’s magic. A disciplined away performance will be key if they are to qualify for the next round.\nKwara United renew West African derby with Asante Kotoko\nPerhaps, the most intriguing of Nigeria’s fixtures is the Confederation Cup clash between Kwara United and Ghana’s Asante Kotoko. The Ghanaians edged the first leg 4–3 in Kumasi but Kwara United now have the chance to overturn the deficit on home soil. At training in Abeokuta, coach Tunde Sanni was seen drilling tactical adjustments and urging focus.\n“The players are in high spirits, physically and mentally ready to finish the task and book their place in the next round,” a club statement read.\nKotoko arrive in Nigeria today with confidence, knowing a draw would suffice. But the Harmony Boys, roared on by their fans, have vowed to give everything. The clash promises fireworks, as two West African powerhouses battle for continental survival.",
  "word_count": 1044,
  "scraped_at": "2026-02-14T01:55:21.387791",
  "_text_extracted": true
}