{
  "article_id": "8a80d1b0c160",
  "url": "https://www.independent.co.uk/news/world/europe/fifa-ap-spanish-uefa-spain-b2400839.html",
  "title": "Spanish soccer federation leaders asks president Rubiales to resign after kissing player on the lips",
  "date": "20230828T221500Z",
  "domain": "independent.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Spanish FA asks president Luis Rubiales to resign after kissing player on the lips\nLeading officials within the Spanish Football Federation have asked suspended president Luis Rubiales to resign after kissing a player on the lips at the Women’s World Cup final\n- Bookmark\n- CommentsGo to comments\nLeading officials within the Spanish Football Federation asked suspended president Luis Rubiales to resign on Monday for kissing a player on the lips at the Women's World Cup final.\nThe heads of the regional bodies that make up the federation (RFEF) made the request in a collective statement.\n“After the latest developments and the unacceptable behavior that has caused great damage to the image of Spanish soccer, the presidents request that Luis Rubiales resign immediately as president of the RFEF,” the statement said.\nThe heads also urged interim president Pedro Rocha to immediately withdraw the federation's request to Uefa on Monday to suspend it from international competitions because of government interference over demands to remove Rubiales.\nThat move was widely seen as an attempt to silence some of Rubiales' critics, including government ministers who have asked for his removal, as such a suspension would ban Spanish teams from competitions like the Champions League and could sway public opinion in favor of letting him keep his job.\nFootball’s governing bodies have long-standing rules barring national governments from interfering with the running of the domestic soccer federations. However, Uefa will not comply with the Spanish federation's request for a sanction, a source said. The person spoke on condition of anonymity because the decision-making process was confidential.\nRubiales has faced a torrent of criticism from around the globe over his behavior at the Women’s World Cup final, including kissing Spain player Jenni Hermoso on the lips without her consent during the on-field trophy ceremony. He was suspended from office Saturday by soccer's governing body Fifa, which is investigating his conduct.\nHis mother on Monday started a hunger strike in a church in southern Spain in defense of her son, demanding an end to “the bloody and inhumane hounding” of Rubiales.\nThe unprecedented request by the Spanish federation asking for a suspension seemed like a leverage play against its critics by trying to provoke fans and powerful clubs like Barcelona and Real Madrid, plus the men’s national team, into backing its efforts to save Rubiales’ job. Rubiales is also a Uefa vice president.\nSpain’s top clubs are due to take part in Thursday’s Champions League group-stage draw being made by Uefa, and the men’s national team has games on Sept. 8 and 12 in qualifying for the 2024 European Championship.\nFifa opened a disciplinary case against Rubiales on Thursday after taking control of the process because it organized the Women’s World Cup. Rubiales' behavior during and after Spain's 1-0 win over England in the final on Aug. 20 in Sydney, Australia, has focused intense scrutiny him and his five-year management of the federation.\nFifa, however, did not invoke its version of the rules against government interference to protect Rubiales.\nThe Spanish federation then urged Uefa to act, reportedly in a letter sent Friday, the same day its embattled president defiantly refused to resign at an emergency meeting.\nThe Fifa suspension prevents Rubiales taking part in official business and having contact with other officials, including in Spain’s bid to co-host the 2030 World Cup with Portugal, Morocco and possibly Ukraine.\nFifa disciplinary judge Jorge Palacio also ordered Rubiales and the federation not to contact Hermoso. She has said the federation pressured her to publicly back Rubiales.\nNewly crowned as world champions, though drawn into a national scandal they did not seek and has distracted from their triumph, the Spain players have said they will not play any more games for as long as Rubiales is in charge.\nAP\nJoin our commenting forum\nJoin thought-provoking conversations, follow other Independent readers and see their replies\nComments",
  "word_count": 647,
  "scraped_at": "2026-02-14T02:10:09.476253",
  "_text_extracted": true
}