{
  "article_id": "8a87b2d2a791",
  "url": "https://www.myjoyonline.com/isak-must-earn-right-to-train-with-squad-howe-2/",
  "title": "Isak must  earn right  to train with squad - Howe",
  "date": "20250805T060000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nNewcastle United boss Eddie Howe has said striker Alexander Isak must \"earn the right\" to train with his squad.\nThe Magpies rejected a £110m bid from Liverpool for Isak on Friday as the Sweden forward trained alone at former club Real Sociedad amid uncertainty about his future.\nThe 25-year-old, whose desire to explore a move away from Tyneside emerged in July, was left out of the club's pre-season tour of Asia with what the club called a \"minor thigh injury\".\nIsak returned to the Magpies' training ground on Monday but Howe, speaking to the Newcastle Chronicle,, external said he had not spoken to the forward since Liverpool lodged a bid.\n\"He's like any other player, we would expect him to come in and train as normal,\" said Howe.\nThe Newcastle boss, speaking before he travelled back home with his squad from South Korea, added that Liverpool, as far as he was aware, had not been back in touch since making their offer.\n\"You have to earn the right to train with us,\" Howe told the Daily Mail., external\n\"We are Newcastle United. The player has a responsibility here to be part of a team and part of a squad - you have to act in the right way. So that is also at play here.\n\"We will make sure that any player does that to earn the right to train with the group. No player can expect to act poorly and train with the group as normal.\"\nIsak, who joined Newcastle in a £60m move from La Liga side Sociedad in 2022, scored 27 goals in 42 appearances last season.\nHe helped the Magpies qualify for the Champions League courtesy of a fifth-place finish in the Premier League and also scored in the 2-1 win over Liverpool in the EFL Cup final.\nNewcastle finished off their pre-season tour with a 1-1 draw against Tottenham in Seoul.\nAfter the game, asked if Isak was scheduled to train, Howe said: \"Of course I'd like him to but whether or not he will, I don't know at this moment in time.\n\"Other people have been dealing with that situation back at home.\"\nNo individual is bigger than any club - Shearer\nNewcastle have been linked with a move for RB Leipzig forward Benjamin Sesko but they have missed out on a number of targets and former striker Alan Shearer called their summer transfer window so far a \"mess\".\nSpeaking on The Rest is Football podcast,, external he also spoke about Isak's situation.\n\"I thought he might have stayed for another season and then this would have happened next summer,\" said Shearer.\n\"If he can't be persuaded to stay then, if someone offers Newcastle what they want, then you've got to take that. Ultimately, you just say 'thank you very much for the great memories you've given us, off you go'.\"\nHe added: \"I'm not angry at all towards him. I understand how football works, I know what happens in and around the game.\n\"I probably understand his mentality. Do I like it? Do I understand it? Probably two different things.\n\"If it really is impossible for Eddie to turn him around and he says no, and it sounds like that is the case, I want him to be out now.\n\"You get your big money for him, whoever's prepared to pay that, and you get other people in, hopefully beforehand, and then you move on.\n\"No individual is bigger than any football club.\"\nTimeline of Isak transfer saga\n25 May - Alexander Isak finishes 2024-25 season as Newcastle's top scorer with 27 goals in 42 appearances\n19 July - Eddie Howe says Isak will \"absolutely\" be on Newcastle's pre-season tour of Asia after the Swede misses a 4-0 friendly defeat by Celtic with a thigh injury\n23 July - Liverpool sign striker Hugo Ekitike in £69m deal from Eintracht Frankfurt\n24 July - Isak is left out of Newcastle's squad for their pre-season tour with a \"minor thigh injury\"\n24 July - Isak expresses desire to explore move away from Newcastle\n28 July - Sources tell BBC Sport Liverpool remain keen on signing Isak, despite the arrival of Ekitike\n29 July - Howe says Newcastle are yet to receive any offers for Isak\n31 July - Isak trains alone at former club Real Sociedad\n1 August - Newcastle reject Liverpool's opening offer for the Sweden striker\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n43 minutes -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n1 hour -\nAquafresh donates to National Chief Imam ahead of Ramadan\n2 hours -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n2 hours -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n3 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n3 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n4 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n4 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n4 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n4 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n4 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 957,
  "scraped_at": "2026-02-14T02:02:51.939465",
  "_text_extracted": true
}