{
  "article_id": "8a8869c96a88",
  "url": "https://www.bbc.co.uk/news/uk-england-shropshire-66385924",
  "title": "Blues fans react to Tom Brady news :  This is beyond massive  ",
  "date": "20230804T061500Z",
  "domain": "bbc.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Elated Birmingham City fans said there was \"hope again\" after NFL star Tom Brady announced he was a minority owner of the club.\nThe seven-time Super Bowl star announced the news in a video on his social media earlier.\nHe also becomes chairman of the advisory board at St Andrew's, consulting on health, nutrition, wellness, and recovery.\n\"This is fantastic news,\" former Blues captain Ian Clarkson told BBC Radio WM.\nClarkson, also a die-hard Blues fan, said the big names just kept on coming to the club after businessman Jeremy Dale, sports executive and club CEO Garry Cook and co-founder of Knighthead Capital Management Tom Wagner.\n\"Now we've got Tom Brady on board, who next?\" Clarkson said.\nUS-based Shelby Companies Limited (SCL), which is a subsidiary of the Knighthead Capital Management Group, completed its takeover of Blues, the Championship's longest-serving club, in July.\nAllow X content?\nThis article contains content provided by X. We ask for your permission before anything is loaded, as they may be using cookies and other technologies. You may want to read X’s cookie policy, external and privacy policy, external before accepting. To view this content choose ‘accept and continue’.\nClarkson, who captained the side between 1988 and 1993, drew comparisons with Hollywood's Ryan Reynolds and Rob McElhenney takeover of Wrexham F.C, which he said had been \"absolutely spot on\".\n\"They've gone into the community and Shelby Company Limited are doing the same,\" he said.\n\"For me as a Blues fan it is really positive, the club appears to be doing all the right things.\n\"There is hope again,\" he added.\n'Astronomical'\nBrady, 46, retired as a quarterback and seven-time Super Bowl winner in February after 23 seasons in the NFL.\nHe recently split from his Brazilian model wife, Gisele Bündchen, with whom he shares two children.\nAnnouncing his minority ownership, he told fans: \"Birmingham City is an iconic club with so much history and passion, and to be part of the Blues is a real honour for me.\n\"BCFC is built on teamwork and determination and I'm excited to work alongside the board, management and players to make our Second City club second to none,\" he added.\nMark Watson, BCFC fan and co-host of the Fat Lads Go In Goal Podcast, said: \"This is beyond massive.\n\"You say NFL and you say Tom Brady...this is astronomical.\"\nMr Watson told BBC Radio WM the goal for BCFC was now to \"stay up\".\n\"This doesn't change the on-field issues... we're not so complacent that we think 'right, job done - Premier League next season, here we go'.\n\"[Aim is to] stay up this season, build next season, build more the next, Champions League final in five years,\" Mr Watson said.\nKnighthead co-founder Tom Wagner said Brady joining the team was a \"statement of intent\".\n\"We are setting the bar at world class,\" he said.\nA team ready and waiting for a visit off Brady are Birmingham Lions Women's American Football Team.\nCaptain Maz Hughes said: \"If Tom is planning to visit his new club in the coming weeks, we'd love to invite him to do the coin toss for our semi-final game on 12 August.\"\nShe added she hoped Mr Brady's investment into BCFC will not only be a big boost to the club and the EFL Championships in the US, but also American Football in the UK.\n\"We hope it'll help increase the visibility of American football in the UK - not just the men's game, but the women's game too, which is celebrating its 10th anniversary this year,\" the caption of the six-time British champions said.\n\"It's surprising to say the least - not just because he's branched out to a different kind of football, but also that he's heard of one of our local teams,\" she added.\nMany took to Twitter to express their shock of an NFL star coming to St Andrews, swapping corn dogs for balti pies.\nFellow and former NFL star JJ Watt, who invested in Burnley FC in May, told Mr Brady he hoped to see him at games in the future.\nIn a tweet, Mr Watt said: \"Well well well, what do we have here…Happy for you, wishing Birmingham all the best and hope to see you in the PL real soon.\"\nFollow BBC West Midlands on Facebook, external, Twitter, external and Instagram, external. Send your story ideas to: newsonline.westmidlands@bbc.co.uk, external\nRelated topics\n- Published3 August 2023\n- Published28 July 2023",
  "word_count": 742,
  "scraped_at": "2026-02-14T02:07:08.855004",
  "_text_extracted": true
}