{
  "article_id": "8a8b7154676c",
  "url": "https://www.teamtalk.com/manchester-united/man-utd-smoke-real-madrid-above-market-offer-dazzling-double-signing-gets-real",
  "title": "Man Utd transfers : Ratcliffe smokes Real Madrid with  above - market offer  as dazzling double signing gets real",
  "date": "20240605T174500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nMan Utd smoke Real Madrid with ‘above-market offer’ as dazzling double signing gets real\nManchester United have thundered in with a significant bid to sign a centre-half also wanted by Real Madrid, while TEAMtalk can confirm how much it will take to seal a separate deal for Everton ace Jarrad Branthwaite.\nArguably the most important area of the pitch Man Utd must address this summer is the centre-back position. The Red Devils shipped an eye-watering 58 goals in the Premier League alone last season. A leaky defence unquestionably contributed to their 14 league defeats and their worst-ever finish of eighth place in the Premier League era.\nInjuries played a major part in derailing United’s campaign and limiting Erik ten Hag’s options at the back.\nNonetheless, there are countless question marks over the defenders at Ten Hag’s disposal and one player – Raphael Varane – is leaving the club anyway.\nMan Utd confirmed on Wednesday that Varane will leave the club as a free agent when his contract expires later this month.\nJonny Evans is in talks over signing a one-year extension, though the long-term futures of Harry Maguire and Victor Lindelof remain uncertain.\nAs such, Man Utd require a high calibre partner for Lisandro Martinez. In the event Maguire and/or Lindelof depart too, a second signing at centre-half will be required.\nAt the behest of co-owner Sir Jim Ratcliffe, Man Utd are targeting younger stars whose best years still lay ahead.\nAmong the many centre-backs United have cast their eye over is Lille’s Leny Yoro and according to Spanish outlet Marca, they’ve acted on their interest.\nREAD MORE: Man Utd centre-back targets: Every option linked for a summer switch assessed\nMan Utd blow Real Madrid away for Leny Yoro\nThey state Man Utd have thundered in with an ‘above-market offer’ for the 18-year-old sensation.\nVarious reports claim Lille value the in-demand defender around the €60m mark. Per Marca, Man Utd are willing to meet Lille’s asking price and intend to ‘close the operation’ to the tune of around €60m.\nIn effect, Man Utd’s reported bid is not higher than Lille’s valuation. However, it is incredibly rare for clubs to meet a player’s asking price with their first bid.\nMarca’s report stems from the fact Real Madrid – a club in which the publication focus on – also want to sign Yoro.\nHowever, according to further news coming out of Spain, Real Madrid are only willing to stump up €40m for Yoro this summer.\nAs such, Yoro could be faced with a difficult decision. Real Madrid would represent the sexier option for the Frenchman, though they’ve reportedly told the player and his agent that they must show patience if Yoro is to move to the Spanish capital.\nThe LaLiga and Champions League winners have not made signing a new centre-back a top priority this summer. They would move for Yoro over the coming months if a deal can be done on their terms, though they won’t overpay.\nThere is also a suggestion that Real Madrid wouldn’t be able to match the salary conditions Man Utd will put forward too.\nIf the decision is down to Lille, logic dictates they’ll sell to the highest bidder.\nAt this stage, only one club has reportedly put money on the table and that is Man Utd. Even if Real Madrid do enter the frame, they won’t come close to matching United’s bid in the upcoming window at least.\nMan Utd learn Jarrad Branthwaite price\nElsewhere, Man Utd continue to chase Everton and England ace, Jarrad Branthwaite.\nUnited’s interest in Branthwaite is no secret, though TEAMtalk has learned the round figure of £70m would be enough to seal a deal.\nThe Toffees value the left-footer around the £80m mark, though the need to raise quick funds means they won’t object to a £70m bid.\nTEAMtalk sources at Everton have stated that they believe Branthwaite is “one of the best young players in world football” and have looked at transfers for the likes of Wesley Fofana at Chelsea as a marker.\nFofana cost £70m when signed from Leicester City in 2022.\nDON’T MISS: Man Utd confirm triple exit, but star tipped to leave for free offered surprise new deal",
  "word_count": 708,
  "scraped_at": "2026-02-14T01:48:52.514797",
  "_text_extracted": true
}