{
  "article_id": "8a8c66ade7a7",
  "url": "https://toffeeweb.com/season/24-25/comment/editorial/45986.html",
  "title": "Man Utd will have to win Europa League to tempt Branthwaite",
  "date": "20250322T110000Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sources claim that Manchester Utd are again eying up a move for Everton's centre-back Jarrad Branthwaite, but the 'price' appears to be Champions League football.\nHowever, with the supposedly 'greatest club on earth' now wallowing in 13th place just above 'plucky little Everton', they have no chance of qualifying through their final Premier League position in May.\nThat is allowing the transfer speculators to claim that only by winning the Europa League this season will they be able to tempt the Cumbrian giant away from Everton and an exciting debut season for the Blues in the new stadium at Bramley-Moore Dock.\nThe Mancunians still seem to think they can buy Branthwaite for just £50M but David Moyes has suggested anyone who wants to steal the young star away will have to produce a lot more cash than that.\nA slight case of 'second season syndrome' has seen his form dip a little below the heights of his first full season in the Everton side, and that has perhaps convinced the Old Trafford recruiters to have another go at pushing a cut-price deal.\nBut Everton should hold a number of cards with new owners The Friedkin Group said to be planning a much anticipated new playing contract that would help to ensure he continues to play for the club he clearly loves being at.\nReader Comments (26)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 21/03/2025 at 10:20:43\n2 Posted 21/03/2025 at 11:01:48\nStay with us a bit longer and you will get a better club to go to in time.\n3 Posted 21/03/2025 at 11:37:06\nYeah... dream on. Still if they're that set on him anything north of £90M would suffice. And they'd probably ask for government funding!\n4 Posted 21/03/2025 at 12:09:06\nI don't like hearing it when supporters belittle us suggesting Everton is not a big club. We are.\nManchester United is a massive club on a global scale. In both cases and on different scales, we shouldn't mix up recent performances and success on the pitch with the size and stature of a club in my opinion.\nOne thing I feel confident in, is that the new owners will push to boat out to keep the likes of Branthwaite. If we have ambition, we have to retain Jarrad and others and build around them.\nIf the player and his agent push it, then I am equally confident we will get top dollar. Where those dollars come from is questionable given their £1BN debt and hundreds of millions in unpaid transfers. If, and right now, it's an if, he decides he wants to go, then there will be more than a sniff of interest from other well-placed suitors.\nWe are well into rumour season now, so I'm taking it all with a pinch of salt until something happens or is announced, which won't be before the end of the season and beyond.\n5 Posted 21/03/2025 at 12:26:59\nHowever, should Man Utd come in seriously, we have to demand an absolute top-dollar record fee. None of this so much down and so much a season and based on a Rooney-like contract. So much if we win the league, so much for a Cup etc etc.\nIf they want him, then top dollar — in cash!!!! That'll sort that out.\n6 Posted 21/03/2025 at 12:50:41\nHopefully it is just a temporary loss of form — maybe a goal or two will up his markings… like they have done with O'Brien.\n7 Posted 21/03/2025 at 12:58:07\nIf they do offer him a new contract, will it be good enough to keep him here for at least 1 or 2 years longer?\nIf the Man Scum really are serious in intent, but still think they can get him for anything less than £90M, and are not sent packing, then I think we will have our answer.\nIt will also be interesting to see what sort of spin the new regime put on it if he does leave. It would be nice if they are honest with us, as the shysters who would previously make up all sorts of nonsense to diss the leaving player are hopefully now all gone.\n8 Posted 21/03/2025 at 13:11:41\nI've done articles on this in the past so won't labour it but you can attribute a large part of the recent success of clubs like Leverkusen and our horrible neighbours to selling very well.\n9 Posted 21/03/2025 at 13:13:26\nLook what happens to young players that go to Man Utd, Chelsea, Spurs etc — they disappear into oblivion.\n10 Posted 21/03/2025 at 13:45:21\nWhy on earth would he want to join Man Utd? They are in a terrible financial mess both on the pitch and off it.\nI think Jarrad will give Everton another year as we move into the new stadium, with our future progression he may well decide to commit long-term and enjoy the ride.\n11 Posted 21/03/2025 at 18:17:47\nI doubt TFG would be holding out for £90m for Branthwaite - and I doubt anyone would pay that either at the moment.\nThe biggest fees for any players this season have all been for attackers €77m (Duran), €75m (Alvarez and Marmoush) and €70m (Kvaratskhelia).\nThe biggest CB signing was Yoro €62m followed by Kilman for €47m and then Deligt for €45m.\nHowever, whether it's a good deal to sell at, say, €70m or €90m or whatever pretty much comes down to who you have lined up in replacement.\nIf we are stupid enough to do what West Ham did and waste €47m on crap like Kilman, then it's a bad idea to sell whatever the price.\nHowever, if selling for £65m enabled you to secure the signings of, say, Doyle (City), Couto (City) and Ferguson (Brighton) - then you have probably improved your First XI by a decent margin overall - and with players who could form the backbone of the side for the next 5 to 10 years. That might be a good idea.\nObviously I am cherry picking, but had we sold Branthwaite for, say, £70m last summer - we could have had a First XI of:\nDCL\nNdiaye\nSarr (€15m)\nHutchison (€23.5)\nMangala\nGarner\nMykolenko\nAraujo (€10m)\nHuijsen (€15.2m)\nTarkowski\nPickford\nIt doesn't need to be a distaster to sell.\n12 Posted 21/03/2025 at 18:33:28\nI'd rather keep the player, but if it was to happen, and it's still inevitable speculation and rumour, then as long as the proceeds are used to improve the squad then it's good business.\nEarly days, but I have more optimism in this regime than the previous one to do that.\n13 Posted 21/03/2025 at 19:02:23\nThey'd have been better off re-signing Michael Keane for this season and given us £10M! Yorro is not Premier League standard.\nKillman £47M 🥴🥴hope Moyes wasn't involved.\n14 Posted 21/03/2025 at 19:14:55\n15 Posted 21/03/2025 at 19:20:30\nYoro is still only 19. He's been bought for his huge potential not immediate impact. He could yet be a superb signing. He's a very classy technical defender.\nHenry didn't look much at Arsenal in his first season.\n16 Posted 21/03/2025 at 23:30:00\nThose two aren't actually money's worth, are they? Two right donkeys.\n17 Posted 22/03/2025 at 01:28:02\nTarkowski can be ‘streaky’ but never seems to attract the same dismissive attitude.\nHope the lad or his family never read TW.\nI know money to spend will have to be eked out for a while, but selling top level players who may prefer to stay seems a big gamble to me. Just the other day we had a thread about how difficult it has been to actually sign top class talent; I believe that is easier if the potential recruits can see real quality happy to stay that they are going to be added to.\nI certainly wouldn’t swap Jarrad for Yoro. I don’t see Yoro will ever be a ‘dominant’ central defender but Jarrad is getting there.\n18 Posted 22/03/2025 at 10:36:53\nTarkowski has had poor games this season but he has had many good games as well as being an outstanding Captain rallying and talking the defence through the game including Jarred and having to listen to the inane ranting of Pickford in goal and let’s be honest here nobody is talking about Tarkowski as a £80-90M player but is well value for the wages he earns and I don’t think he has missed one minute on the pitch since he signed even if he has had to carry an obvious injury at times.\n19 Posted 22/03/2025 at 11:06:05\nIf we lose Tarkowski, we lose his leadership on the pitch and he is mostly a very good defender. Not a world beater, much in the same mould as Jagielka, who didn't have that about him.\nBranthwaite has had a few wobbles of late, but that's to be expected when a young player bursts onto the scene. They will have a dip, but likewise, he's impressed for the majority of the season and at 22, very young for a centre back. He's not the finished article yet, but an exciting prospect that I hope we keep.\n20 Posted 22/03/2025 at 11:38:13\nI wonder whether his 'game has dropped' if indeed it has, due to the more attacking style Moyes has adopted, leaving the defence with more to do, especially when the opposition break quickly and when most of our players are in their half of the field.\nHe is quick, but not as fast when he is forced to run back looking over his shoulder - and open to being turned. I'd still like to keep hold for another couple of years.\n21 Posted 22/03/2025 at 12:00:45\nYes, that could have a bearing on his game.\nI'm always fearful when the opposition break quickly under both Dyches' and Moyes's ways of playing.\nTo be honest, to me, it is the simple act of lack of concentration that is leaving Jarrad open to criticism — just watch him, he looks switched off at many times during the game.\nIf that is one of his problems surely Moyes as an ex centre back will be correcting him or Baines will be on to it.\nIt is also likely that I'm seeing a problem that isn't there but I never criticise just for the sake of having a moan.\n22 Posted 22/03/2025 at 12:05:53\nBut I think the financial state of Everton will dictate what happens there and maybe Jarrad's agent will also be down his ear!\n23 Posted 22/03/2025 at 12:06:01\nThat said, they're rare, and his general reading is very good. He has good pace, but he needs to be careful throwing himself into challenges as he has a build that could pick up bad injuries if he's launching for the ball. Stay on your feet lad.\nI read he's the most complete player to play the ball with both feet in the Premier League. I'd like to keep him, and have an adventurous left back he can feed to start the attacks next to him. He's good on the ball, and that is vital position as seen across the park.\n24 Posted 22/03/2025 at 13:13:19\nI don't know whether it's his concentration. I sometimes think he takes the game too easily. He knows he has the ability but is rather casual in his approach, as if it's second nature and he expects the right result without the full application.\nI am told that football is an easy game – but it does require a certain level of application; otherwise, there is a lot of mopping up to be done and mistakes tend to crop up.\n25 Posted 22/03/2025 at 19:30:25\nWell, I don't think we are far apart in how we rate Jarrad. I'd say concentration is part of applying himself fully to 90 minutes of each game plus whatever VAR adds on.\n26 Posted 25/03/2025 at 12:11:34\nNow there is always the possibility that the club decide to sell him and reinvest the money; I think that would be something we have done before to our detriment. Clubs selling their best players sends out the wrong message to both prospective signings and our fans.\nWe have been told we had to sell Rooney because of the financial position of the club, and lately we have had to do the same with Richarlison and Gordon. But now, with new owners and us being in a better financial position, we should not be selling our best players.\nOnly weeks ago, it was reported Branthwaite would be happy to sign a contract extension. So now our Premier League status is virtually certain, then sign him up for 5 or 6 years! He will, if he stays, captain us and England.\nI am sure, when Moyes feels it right at some time next season to move O'Brien to centre-back, we will have a young pairing for years to come. So start building a side to play in our magnificent new stadium – and do not sell our best players.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 2259,
  "scraped_at": "2026-02-14T02:02:35.599532",
  "_text_extracted": true
}