{
  "article_id": "8a92c0854a4f",
  "url": "https://www.smh.com.au/sport/nrl/stay-classy-brisvegas-roosters-fears-for-spencer-leniu-at-magic-round-20240516-p5je0d.html",
  "title": "NRL 2024 : Magic Round sparks Sydney Rooster fears for Spencer Leniu",
  "date": "20240517T020000Z",
  "domain": "smh.com.au",
  "source_country": "Australia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This was published 1 year ago\nOpinion\nStay classy, BrisVegas: Roosters’ fears for Spencer Leniu at Magic Round\nAndrew Webster\nChief Sports WriterWhether it’s Las Vegas to open the season or BrisVegas for Magic Round, rugby league certainly knows how to light it up.\nSince 2019, when the NRL copied the idea from the UK Super League of playing an entire round in one city, Magic Round has grown into an annual pilgrimage for the game’s true believers.\nThe vibe is careless, reckless, and intentional, but mostly convivial with only a small few among the 140,000 who attend over three days stepping out of line.\nNevertheless, the Roosters hold fears about how the crowd might behave on Saturday night when prop Spencer Leniu makes his first appearance in Brisbane since the ugly incident in Las Vegas involving Broncos star Ezra Mam.\nLeniu was suspended for eight matches for calling Mam a “monkey” in the season-opener. He returned last Sunday when he came off the bench in the 38-18 victory over the Warriors at Allianz Stadium. It was a home game, so it was a safe space.\nThere are concerns about how the crowd will react to the Samoan international before, during and after the Roosters’ match against Cronulla at 5.30pm on Saturday.\nBy that stage of Magic Round, the magic is wearing off and it becomes Maintaining Round for the rest of the campaign.\nThe Broncos play the night before, and the sold-out Magic Round matches are attended by a potpourri of supporters from every club, but the pain from the Vegas incident still lingers.\nLeniu reached out to the Broncos five-eighth days after returning to Australia to apologise and was prepared to fly to Brisbane at his own expense to do so face to face.\nI’m told they’re yet to catch up, and there are no plans for them to do so this weekend, but that doesn’t mean they won’t. Mam, a class act on and off the field, has said he’s open to it.\nThe Roosters remain bemused about Leniu’s suspension – not so much its length but the judiciary panel’s findings that he intentionally used the term in a racist manner.\nLeniu strongly argued he didn’t know the racial implications of the utterance while revealing players of colour speak to each other like this regularly.\nWith that in mind, he’s spent the last two months undergoing meaningful education to better understand Indigenous culture.\nHe spent a day at The Glen, a respected drug and alcohol rehabilitation centre on the Central Coast catering for Indigenous men and women.\nHe’s also met with the family of Arthur Beetson – a former Rooster and Australia’s first Indigenous captain in any sport – as well as NRL wellbeing managers Dean Widders and David Solomona.\nThroughout this process, Leniu has declined a mea culpa interview with various media outlets. I’m told he won’t be doing one, which says everything about his priorities.\nBroncos officials reckon their fans won’t be too lippy when they spot Leniu, although rugby league crowds have hardly been on their best behaviour this season.\nSome supporters have been acting like small, racist, bottle-throwing children.\nOn Friday, a bottle was allegedly thrown at a touch judge during the Broncos-Eels match at CommBank Stadium. On Saturday, racist remarks were thrown at Souths duo Latrell Mitchell and Cody Walker at Jubilee Stadium.\nA month ago, two off-duty police officers were barred from attending NRL games at Allianz, Accor and CommBank stadiums after they threw an item at referee Ashley Klein.\nSeriously. Even the coppers can’t control themselves.\nSo stay classy this weekend, BrisVegas. Don’t throw bottles nor inappropriate shade and let’s celebrate the enigmatic wonder that is rugby league.\nSexual assault allegations tarnish many\nRugby league’s four-day footy festival started amid rape allegations levelled at a Queensland-based NRL player.\nNRL powerbrokers were completely blindsided by the story. They found out via Twitter late on Wednesday night.\nNo charges have been laid and details about the allegations are scant at best, but that hasn’t stopped rampant speculation about the player’s identity.\nQuite unfairly and very much defamatory, any player ruled out from playing this weekend because of injury could be pegged as the one involved.\nThat didn’t stop countless people tossing up names on social media. What a time to be alive.\nThe NRL is ploughing ahead and, on Friday, will announce it’s extending its deal with the Queensland government for Brisbane to host Magic Round well into the future, despite keen interest from rival states.\nWhat about a third Brisbane team, then?\nThat very topic was discussed at the chief executives’ meeting on Thursday as the NRL edges closer to making a call on which franchise will be handed the 18th club licence.\nMost consider the PNG bid to be a done deal, mostly because of the $600 million the Department of Foreign Affairs and Trading has pledged.\n“Nothing’s being ruled out,” ARL Commission chairman Peter V’landys insisted.\nPerth and Christchurch are also in the mix but the Brisbane Tigers, who want to stitch up the western corridor that extends through Ipswich all the way to Toowoomba, deserve serious consideration.\nThey cover the third-fastest growing region in the country and are flush with both funds and members. In terms of operational readiness, it could probably start next season.\nLike Western Sydney, the AFL has already got its claws into Brisbane’s west, setting up a centre of excellence at Springfield.\nRugby league might dominate that area now, but the AFL is playing the long game.\nSouths want a win - and a signature\nMost people will leave Magic Round with happy memories to last a lifetime but with a thumping headache that endures long after the event.\nSouth Sydney hope to leave Brisbane with something similar: Wayne Bennett.\nBunnies officials want him to sign a three-year deal when they meet on Monday morning, but they’re wary of the usual Bennett plot twist.\nRemember, he’s previously changed his mind on deals with the Roosters (2006), Broncos (2011) and Dragons (2014) at the 11th hour.\nThe offer, I’m told, is close to $1.1 million a year. That’s far less than the $1.5 million being tossed about a few weeks ago.\nIn other flip-flopping news, Gold Coast Titans back-rower David Fifita performed one of the truly great circus acts when he phoned Roosters chairman Nick Politis on Tuesday night and told him he wasn’t coming next season.\nSome are calling it a “reverse DCE” in reference to Manly captain Daly Cherry-Evans deciding in June 2015 that he wouldn’t be honouring the contract he signed with the Titans three months earlier.\nWhat does it all mean for Angus Crichton, who is off contract but wants to stay now he’s in career-best form?\nThe Roosters were hopeful before Tuesday’s events of keeping both him and Fifita, although some at the club were bemused by his remarks after the win against the Warriors.\n“It does make you question where their head’s at,” Crichton told reporters about the Fifita signing. “No one’s talked to me, which is funny … I’m not sure if they will.”\nThe club stood by Crichton throughout his well-publicised mental health issues last year. He’d also indicated he was off to France to play rugby.\nCrichton has played some explosive footy in the last month. Hand him a sky-blue jumper now as the starting left-edge forward by all means.\nBut get some perspective.\nTHE QUOTE\n“The last 48 hours have revealed to me the foundations are fairly fragile.” — No, not rugby league fans at Brisbane Airport on Sunday night but Tottenham Hotspur manager Ange Postecoglou after his side’s 2-0 loss to Manchester City, a result that trashed their hopes of playing Champions League football next season.\nTHUMBS UP\nFormer Brisbane Broncos development squad player Jotham Russell has signed with the New England Patriots. He’ll likely play as a defensive end after impressing scouts during his time in the NFL’s International Player Pathway program.\nTHUMBS DOWN\nOn Saturday night, the final score in the Super Netball match between the Giants and Sunshine Coast Lightning was incorrect, forcing the teams to return to the court long after full-time. On Sunday, ring announcer Dan Hennessey declared bantamweight champion Nina Hughes had beaten Aussie challenger Cherneka Johnson, who was actually the winner on the judges’ scorecards. You had one job, as they say in the classics.\nIt’s a big weekend for … NSW coach Michael Maguire who is about to start scouring the Trading Post for some halves to play Origin I. Nathan Cleary is gone with a hammy, Mitchell Moses is no certainty of being back from injury, and Jack Wighton refuses to be coaxed out of representative retirement. All eyes on Nicho Hynes′ calf when the Sharks play on Saturday.\nIt’s an even bigger weekend for … my brain, soul, ING Savings Maximiser account …\nNRL is Live and Free on Channel 9 & 9Now\nSports news, results and expert commentary. Sign up for our Sport newsletter.",
  "word_count": 1501,
  "scraped_at": "2026-02-14T02:01:16.462506",
  "_text_extracted": true
}