{
  "article_id": "8a9acd1b1eab",
  "url": "https://metro.co.uk/2025/10/10/chelsea-place-48m-premier-league-star-transfer-shortlist-24396738/",
  "title": "Chelsea place £48m Premier League star on transfer shortlist",
  "date": "20251010T230000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Chelsea have added Murillo to their transfer wishlist, but are likely to face strong competition from Bayern Munich should they pursue a move for the Nottingham Forest defender.\nMurillo has made 80 appearances in all competitions for Forest since joining the club from Corinthians in an agreement worth around £15million back in 2023.\nThe Brazilian was named Forest’s Player of the Season after a stellar first year at the City Ground and his partnership with Nikola Milenkovic proved central to the side’s success under Nuno Espirito Santo.\nAnd while Forest have endured near-disastrous start to the new campaign, Murillo’s stock remains high, with the 23-year-old among the most highly regarded young centre-backs in English football.\nAccording to German newspaper Bild, Murillo’s performances over the last two-and-half years have not gone unnoticed amongst Europe’s elite and Bayern Munich have ‘set their sights’ on a possible deal with Forest.\nIt’s claimed Murillo’s ‘name is interesting’ at Bayern – while the German champions scour the market for defensive reinforcements – and the Brazil international is said to be firmly on the club’s ‘radar’.\nBayern bosses are ‘desperate’ to extend Dayot Upamecano’s contract beyond the end of the season, but have been forced to consider potential replacements in the event that the Frenchman edges towards the exit.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nA deal for Murillo will not come cheap, though. The report suggests it would likely take an offer in the region of €55million (£48m) to prise the centre-half away from the City Ground.\nBayern’s hierarchy are aware that Chelsea also ‘have Murillo on their list’ and have been monitoring his progress for some time. It’s understood Real Madrid are admirers, too, and made an unsuccessful bid for the Forest star last January.\nChelsea decided to prioritise their attack when strengthening Enzo Maresca’s squad in the summer transfer market, with Liam Delap, Joao Pedro, Jamie Gittens and Alejandro Garnacho all arriving through the doors in west London.\nJorrel Hato, a £35.5m signing from Ajax, was Chelsea’s one and only defensive addition of the transfer window.\nMurillo is tied into a contract until June 2029 and Forest have no intention of entertaining offers for the defender at this stage, especially in their current position.\nIn the past, Murillo has made no secret of his ‘dream’ to one day play Champions League football and compete for major trophies.\nMurillo also confirmed that he had been the subject of ‘interest’ from Chelsea last year.\nBut at the time, the ex-Corinthians man – who has been capped once by Brazil – decided to turn down a proposed move to Stamford Bridge to continue his development with Forest.\nMore Trending\n‘I don’t know if it’s £70m, but I know there was a buzz of interest,’ he told the Benja Me Mucho podcast.\n‘I had the dream of playing in the Premier League and I had that thought. I thought: “I’ll go to Nottingham Forest, have a good year and then I’ll go to a big club”. I had that in my head.’\nMurillo was forced off with a thigh injury in Ange Postecoglou’s first match in charge of Forest against Arsenal and he made his return in the side’s Europa League defeat to Midtjylland.\nThe defender will have the chance to impress his potential suitors when the Premier League season resumes, with Forest playing host to Chelsea in eight days’ time.\nMORE: Bruno Fernandes speaks out on fresh rumours he wants to quit Man Utd\nMORE: Casemiro issues warning over Estevao as Chelsea star shines for Brazil\nMORE: Arsenal star linked with transfer exit after club president’s comments",
  "word_count": 649,
  "scraped_at": "2026-02-14T01:49:53.047339",
  "_text_extracted": true
}