{
  "article_id": "8aa789cadf9c",
  "url": "https://www.90min.com/posts/el-clasico-when-do-barcelona-real-madrid-play-2023-24",
  "title": "El Clasico : When do Barcelona and Real Madrid play each other in 2023 / 24 ? ",
  "date": "20230622T133000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "El Clasico: When do Barcelona and Real Madrid play each other in 2023/24?\n- The rivalry between Barcelona and Real Madrid is one of the most storied in world football\n- Barcelona finished ten points above Madrid at the summit of La Liga last season\n- Madrid knocked their rivals out of the Copa del Rey semi-finals in April\nBy Euan Burns\nThere's no disputing what the biggest fixture on the Spanish football calendar is each and every season. You could even argue it's the biggest meeting between rivals throughout the whole of Europe.\nIt may have lost some of its edge in recent years, but there are still fans who watch little to no Spanish football who set time aside twice a year to watch Barcelona and Real Madrid play in El Clasico.\nThe 2023/24 season won't be any different and the fixtures for the next La Liga season have now been confirmed.\nIt will be the first opportunity to see Jude Bellingham in El Clasico and, given how well he has taken things in his stride during his short career so far, the English youngster could be a major protagonist in this fixture for years to come.\nGiven Barcelona and Real Madrid tend to be the two best teams in Spain each campaign, there are often more than two Clasicos during a season as they can also face each other in the Copa del Rey or even the Champions League.\nWhen do Barcelona and Real Madrid play each other in 2023/24?\nEl Clasico is the first match fans of Barcelona and Real Madrid look for every season.\nIn 2023/24, the two La Liga matches will be spaced out more so than they were last term. The first game sees Real Madrid travel to Catalunya on Saturday, 28 October 2023 before the reverse fixture at the Santiago Bernabeu on Saturday, 21 April 2024.\nWho won more Clasicos in 2022/23?\nThanks to a glut of cup ties, there were five Clasicos to enjoy during the 2022/23 season. The first came in La Liga during October when the table was still taking shape.\nIt was clear Barcelona were back in the title hunt but goals from Karim Benzema and Federico Valverde put Real Madrid 2-0 up at half-time. Ferran Torres got one back with seven minutes to go, but a Rodrygo penalty secured the 3-1 win for Los Blancos.\nThree months later, Spain's most famous clubs duked out the final of the Spanish Supercup in Saudi Arabia - a legacy of Luis Rubiales' controversial reign as president of the Spanish FA. Gavi inspired Xavi's side to a commanding 3-1 win to claim his manager's first trophy as Barcelona boss.\nThey would not meet again until the Copa semi-final first leg at the start of March 2023. Barcelona got their revenge as an Eder Militao own goal meant they took a 1-0 lead into the second leg.\nBack in the top flight, there was a nine-point gap between Barcelona at the top and Real Madrid in second coming into the next match in late March with 13 games to play. It was clear that if Barcelona won, they would be overwhelming favourites to seal the title, but if Real Madrid won, the momentum could have swung.\nIt was 1-1 at half-time but then an unlikely hero in Franck Kessie grabbed a winner at Camp Nou in the 92nd minute, sparking wild celebrations. Real Madrid got some revenge just a couple of weeks later as they knocked Barcelona out of the Copa with a 4-0 win at Camp Nou. They would go on to win the domestic cup, but Barcelona took the La Liga title.\nEl Clasico complete H2H record\nOne thing that adds an extra edge to El Clasico - if it really needed it - is how incredibly close the head-to-head record between Real Madrid and Barcelona is considering how many times the two sides have faced one another.\nIt's Real Madrid who lead the way, but a run of two or three very strong seasons for Barcelona and the small gap could suddenly close.",
  "word_count": 684,
  "scraped_at": "2026-02-14T02:07:02.886601",
  "_text_extracted": true
}