{
  "article_id": "8aa8fa7bae72",
  "url": "https://www.caughtoffside.com/2024/06/03/man-united-express-interest-andriy-lunin/",
  "title": "Man United express interest in signing Andriy Lunin",
  "date": "20240603T091500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United are keen on signing the Real Madrid goalkeeper Andriy Lunin during the summer transfer window.\nThe Ukrainian goalkeeper has been in fine form this past season and he played a key role in Real Madrid’s Champions League win. During the absence of Thibaut Courtois due to an injury, Lunin was a key player for Real Madrid and he produced impressive performances during crucial stages of the UEFA Champions League campaign.\nA report from Fichajes claims that Manchester United are looking at him as a potential option this summer and they have already expressed interest in signing him. The Red Devils signed Andre Onana last summer, but the former Inter Milan goalkeeper has not been convincing with his performances.\nThe Red Devils are now looking to bring in the 25-year-old as an alternative. It will be interesting to see if they can win the race for his signature. Bayern Munich and Real Betis are keen on the Real Madrid goalkeeper as well.\nThe 25-year-old needs to play regularly at this stage of his career and Real Madrid will not be able to provide him with that opportunity. With the return of Courtois, Lunin will be resigned to the role of a back up goalkeeper once again.\nMan United move would be ideal for Andriy Lunin\nIt remains to be seen whether the Ukrainian decides to push for an exit this summer. He has the potential to develop into a top class goalkeeper with regular football and a move to Manchester United will be an attractive opportunity for him.\nManchester United are one of the biggest clubs in the world and if they can provide him with gametime assurances, the player could be tempted to join them. The Red Devils need to improve their squad in order to compete for major trophies once again. The 25-year-old certainly has a quality to thrive in the Premier League, and he could be a useful acquisition.",
  "word_count": 323,
  "scraped_at": "2026-02-14T02:01:16.445665",
  "_text_extracted": true
}