{
  "article_id": "8ac19ce7c6d0",
  "url": "https://www.empireofthekop.com/2023/06/09/klopp-mac-allister-liverpool-transfer/",
  "title": "Jurgen Klopp comments on the signing of  very talented  Alexis Mac Allister",
  "date": "20230609T104500Z",
  "domain": "empireofthekop.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jurgen Klopp has expressed his delight after Liverpool completed the signing of Alexis Mac Allister from Brighton.\nThe dynamic midfielder’s move to Anfield was made official yesterday with Fabrizio Romano claiming the deal cost as little as £35m – half the price of what Sky Sports were expecting the Reds to pay for the World Cup winner.\nThat is exceptional business for the Merseysiders with them now being able to call upon someone who has ‘proper game intelligence’ according to his new manager.\n“We are adding a very talented, very smart, very technically skilled boy to our squad and this is super news, really it is,” the German tactician told Liverpoolfc.com.\n“I do not think the football world needs me to say too much about Alexis’ qualities because they are already pretty well known but it is clear that he is someone who can play in a number of positions in the midfield and is an all-rounder, I would say. He is calm and composed and someone with proper game intelligence.\n“Of course, he is a player we have known about for a long time and I have watched him grow from a young boy coming into the Premier League to a man who helped his country win the World Cup. That is quite a journey.\n“My admiration and respect for what Brighton are doing is well known and Alexis has been a part of the journey that they have been on in becoming one of the toughest and best sides in the Premier League.\n“I’m really happy his next steps will now be with us and we get to work with a player who is already excellent and experienced, but also has so much more to come given he is just 24 years old.\n“He is just as excited to be joining and working with us and that already makes it a good partnership, but there is no pressure on him. He is still so young, so it is obvious he will only improve and our job is to help him take the next steps.\n“I’m grateful to everyone at the club who helped make this transfer happen and I am sure I speak for everyone here when I say I cannot wait to start working with Alexis.\n“It will be a bit of time before he is able to play at Anfield in front of our fans but in this modern world I am sure he will see how our supporters will welcome him to the Liverpool family when he looks at his phone today and sees the messages online. They will make him feel at home straight away. I have no doubt about that.”\nThere’s no doubt that our new No. 10 instantly improves our starting XI.\nThis season we have missed a player with his composure and ability to control the tempo from the middle of the park and the hope is that he can help us return to our best next term.\nHis 12 goals and three assists this season helped Brighton to a Europa League spot and all the way to the FA Cup semi-final where they were narrowly edged out by Manchester United.\nHe would’ve liked to have been plying his trade in the Champions League with Liverpool next season but there’s no doubt that he’ll be hungry to achieve more success and get us back to where we belong in the near future.\nWe can’t wait to see him out on the pitch in the famous red shirt and let’s hope he can show us all what he’s made of.",
  "word_count": 598,
  "scraped_at": "2026-02-14T02:07:02.900527",
  "_text_extracted": true
}