{
  "article_id": "8ad6b39db9b8",
  "url": "https://www.90min.com/how-england-stars-ranked-in-ballon-d-or-2024",
  "title": "How England stars ranked in Ballon dOr 2024",
  "date": "20241029T034500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "How England stars ranked in Ballon d'Or 2024\n- Manchester City midfielder Rodri won 2024 Ballon d'OR\n- Number of England stars nominated for prestigious award\n- Harry Kane scooped Gerd Muller trophy during Paris ceremony\nWhile no British player has won the Ballon d'Or since Michael Owen in 2001, a number of current England stars were shortlisted for football's most coveted individual prize in 2024.\nDespite just missing out on the chance to achieve continental success at Euro 2024, England enjoyed a successful summer in Germany - defeating the likes of Switzerland and the Netherlands to face Spain in the all-important final.\nThe Three Lions were unable to grab a trophy on the international stage, but that did not stop the nation's stars from impressing at club level.\nHere's how England players ranked in the 2024 Ballon d'Or.\nDeclan Rice - 26th\nDeclan Rice has become an integral part of Arsenal's midfield since making the switch to north London from West Ham last summer. The playmaker made 51 appearances for the Gunners across all competitions last season, registering seven goals and 10 assists while they battled to steal the Premier League title away from rivals Manchester City.\nArsenal just fell short of Premier League glory in 2024, missing out on the chance to clinch the title on the final day whilst City cruised to victory over West Ham. Regardless, Rice's display in Mikel Arteta's midfield proved vital on numerous occasions.\nHe was given the opportunity to demonstrate his skillset on the international stage with England also, playing every game of their Euro 2024 campaign. His efforts during the 2023/24 season saw him finish 26th in the this year's Ballon d'Or standings.\nCole Palmer - 25th\nChelsea star Cole Palmer finished 25th in the Ballon d'Or standings after an impressive breakthrough season at Stamford Bridge. The midfielder rose to the top of the game during the 2023/24 campaign, netting 27 goals in 48 appearances.\nWhile some may think this position is quite low for a player who constantly makes headlines for his impressive outings, Palmer is just at the start of his professional career and will undoubtedly achieve glittering success in the future.\nNo player has ever actually won the Ballon d'Or whilst playing for Chelsea, but Palmer could become the first with his consistent displays of talent.\nBukayo Saka - 21st\nAnother Arsenal and England talent was nominated for the prestigious Ballon d'Or award, with Bukayo Saka sitting in 21st place.\nSaka has been impressing in north London since his promotion to the Gunners' first team in 2019 - becoming a staple part of Arteta's competitive lineup. The winger played in 47 games for his club last season, finding the back of the net 20 times.\nThe Arsenal star was also imperative to England's journey to the Euro 2024 final, playing in all seven games under Southgate whilst bagging an important goal against Switzerland in the quarter-final of the tournament.\nPhil Foden - 11th\nPhil Foden lifted his fourth successive Premier League title with Manchester City during the 2023/24 campaign. At just 24-years-old, that's mightily impressive.\nHis efforts saw him crowned the PFA Player of the Year for the first time shortly after receiving FWA's Footballer of the Year title. He was also a standout in his club's European charge, finishing City's Champions League campaign with five goals and three assists in only eight appearances, including a strike at the Santiago Bernabeu.\nFoden saw slightly less success on the international stage with England, falling at the last hurdle to City teammate Rodri - who was crowned the 2024 Ballon d'Or winner.\nHarry Kane - 10th\nBayern Munich forward Harry Kane led his nation to the Euro 2024 final in the summer after breaking countless records during his debut season in the Bundesliga.\nThe Three Lions captain actually picked up an award on the night of the Ballon d'Or ceremony in Paris, winning the Gerd Muller trophy alongside Kylian Mbappe after scoring 52 goals for his club and country.\nThe prolific striker finished in the top 10 of the Ballon d'Or standings, 10 places higher than the 19th he recorded in 2023.\nJude Bellingham - 3rd\nJude Bellingham finished third in the Ballon d'Or standings, just behind teammate Vinicius Junior and winner Rodri. The Real Madrid star did not attend the ceremony in Paris after Madrid caught wind of the fact that Vinicius would not claim the 2024 prize and decided to boycott the proceedings entirely.\nHowever, it was still a night of success for the reigning Spanish champions - who claimed the Club of the Year award as well as silver and bronze medals in the men's individual award.\nBellingham enjoyed a strong debut season in Spain, scoring 23 goals in 42 club appearances before lifting the Champions League and La Liga trophy.\nHe's yet to clinch silverware on the international stage, but looks set to be a key part of England's future plans.",
  "word_count": 825,
  "scraped_at": "2026-02-14T01:51:57.632520",
  "_text_extracted": true
}