{
  "article_id": "8ad877932704",
  "url": "https://www.twtd.co.uk/ipswich-town-news/44927/mckenna-a-special-day",
  "title": "McKenna : A Special Day - Ipswich Town News",
  "date": "20230429T213000Z",
  "domain": "twtd.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday, 29th Apr 2023 20:25\nBoss Kieran McKenna hailed Town’s promotion-winning 6-0 thrashing of Exeter City as a special day and one which should be cherished.\nThe Blues romped to the three points which secured a place in next year’s Championship with the result never in doubt once Conor Chaplin gave them the lead in the seventh minute.\nThe Town coach was met by fantastic scenes as they arrived at the ground with thousands of supporters lining the streets to give them their backing ahead of the match.\n“A special day, obviously the scenes before the game were a massive part of that and the sign of the spirit and the love of the football club and the community, and the atmosphere in the stadium and, of course, all backed up by the performance on the pitch,” McKenna said.\n“A special day, a fantastic season, a huge effort by everyone associated with the club. And just really proud to be part of it, giving the club a day like today to enjoy.”\nRegarding the scenes beforehand, he added: “It was amazing, it was way, way beyond what we expected.\n“I’ve seen a few of those sort of things, even at big Premier League grounds or big European games, but I’ve not seen many, not just in number but the passion, seeing people’s faces, the enjoyment, the excitement, the passion.\n“It was wonderful scenes, wonderful to see. I’m sure not many of the players will have seen anything like that in their careers. Really special moments.”\nWas he always confident players could focus on the game on such a big day and with so much at stake?\n“That was the hope and that was the plan but it’s not easy,” the Northern Irishman reflected. “They’re human beings, of course. They all care passionately about trying to get the club where it wants to be.\n“Such a big day and with the scenes before the game, you never quite know how they’re going to react because that was over and above what we’ve had so far.\n“You’re never 100 per cent sure, we do know we have a really good group, good leadership, good characters.\n“We’ve been consistent with our messages and the players have been the same, and we were really focused on going out and delivering a really good performance and just trying to play well.\n“That’s the base for us, just prepare well for the games and go out and try and play in a manner we like and a manner our supporters are proud of and deliver one more home performance.”\nMcKenna admitted any nerves he might have been feeling were settled by the Blues going three goals up within 22 minutes of the start.\n“It helps, no doubt about it,” he laughed. “It was nice to be able to enjoy the game, nice to be able to enjoy the second half.\n“Proud to see the way the players kept the standards, even at 5-0 or 6-0 up in the second half, the way we were still sticking to the organisation, to the details and were trying to keep a clean sheet. Proud of the players’ performance.”\nAsked what promotion means to him, he added: “It means an awful lot, no doubt about it. It’s been an honour to come here as manager. You work very hard in your coaching career to get to positions like this and we’re all ambitious and we want to achieve things.\n“Since I’ve come to this football club, you feel the passion of the people here and how much it means to everyone, but we knew it was going to take a really, really big effort to get out of this really tough division.\n“And it’s taken so much work by everyone associated with the club. And it’s just great to see that work pay off.\n“And I think when you’re the leader of it, or one of the leaders at the football club, it’s just seeing the happiness in everyone else, seeing the players celebrating with their families, seeing the staff enjoying it together, enjoying it with their families, it’s seeing my family being able to enjoy it and be proud of the work that they’ve supported me through.\n“And seeing the supporters enjoying a day that they’ve waited a very long time for. And, of course, the ownership group and the board as well, being here and being able to enjoy it.\n“For me, the main joy comes from seeing other people and seeing how much they enjoy it.”\nIs winning promotion in his first full season beyond his expectations? “Not beyond our expectations, no. The target I laid out last season was to win the league. We knew it wasn’t going to be easy, we finished 11th twice and ninth.\n“It looks routine in the end because of how the day finished but it’s been a very, very difficult task and I’ve said that right the way through.\n“I know and the players know how much effort it’s taken to get to this point, so it’s not exceeded expectations, we set the bar right up there and we need to keep doing that, we need to keep setting the bar really, really high.\n“But I know how hard it is in this division and I think our performance level, I know we’ve got promoted and it’s nice to get promoted in your career, but I think how we’ve done it and the level of performance, the consistency of performance, the level of the football, the style of football that we’ve played.\n“I’m sure there were plenty of people who said, people said to me that we wouldn’t be able to do it in League One, but how we’ve done it makes me very proud.”\nMcKenna is proud of his squad: “They’re a great group of players, I have to say. Some of them have been here since my first day and I’ve enjoyed working with them so much.\n“We’ve added to the group as we’ve gone along and added the right characters and added people who would fit how we would play.\n“They’re a great group of players with really strong leadership, a good balance of senior leaders but we’ve brought in some really high potential young players, who are growing with the team and growing week by week and it’s a really good squad, and it’s been a joy to work with them.”\nPromotion from League One is far from the extent of the owners’ aims but McKenna says the thinking hasn’t yet gone further than this campaign.\n“The club is very ambitious, I’m very ambitious and I’m sure the players are very ambitious,” he said.\n“We’ve just put everything into this season, to be honest, not thought too far ahead in many ways.\n“In terms of infrastructure and things we’ve invested in, we’ve tried to do things that will help us in the long term.\n“But in terms of the on-the-pitch stuff, we have thought anything past this season because it’s been such an intense and challenging season and we’ve invested everything into it.\n“We’ll enjoy that now, we’ll enjoy these moments, we’ll celebrate well, but there’s no doubt about it, in the summer we’ll be looking at every which way we can improve the club to keep building on the momentum that we’ve got.”\nQuizzed on why second-choice keeper Vaclav Hladky was brought on late on in the game, McKenna said: “It was more about Vaz, it wasn’t to make a point, but it does make a point. It was about Vaz.\n“Someone who’s been fantastic, played in my first game when I arrived. I think that’s his only league start since I’ve been here.\n“But representative of the group in being a fantastic professional, trainer, teammate, support to myself.\n“Has delivered top performances. I spoke to Vaz yesterday about his performances yesterday about his performances against Burnley in the FA Cup and against Rotherham in the FA Cup and that was a big part of the season.\n“They came at a time of the season when it’s winter, we’d some tension about how we were playing, and that’s normal that we have to work through that. And for us to go out and play against Burnley, a team at the top of the Championship and go toe-to-toe- with them in terms of building from the back and pressing high against the high press, that was a big confidence booster in the season for the players.\n“But I think more probably for the players as well because they saw a team at the top of the Championship playing a very similar version of football as us and us showing that we can compete with that team over two legs doing that, and Vaz was a big part of that.\n“Little things like that. When I say everyone’s had a part to play, it’s little things like that that people maybe don’t appreciate in the story of a season, and the players who started the match today, the players who finished the season will get a lot of recognition, and rightly so because of the fantastic run.\n“But I know the work, so many different stories that go into the course of making a group successful over the course of the season, and that was just one small example, so we want to take the chance to get Vaz on the pitch today as a symbol of what he’s given to the group all year.”\nAsked about the plans for celebrting, he added: “I’m not sure. They tell me, but I don’t think anyone’s planned anything because we were so focused on the game.\n“I’ve just found out one of the staff put a spare set of clothes in his car, I won’t name him but he’s getting a bit of stick in there from the other staff.\n“We’ve been so focused that we we’re not making any plans, we’re not thinking about anything beyond three o’clock to five o’clock, but we have to enjoy it.\n“Of course, we’ll give the players a couple of days off. We have our internal end-of-season awards on Tuesday night, which will be a night we can enjoy and we’re not thinking too much past that at the moment.\n“I know how competitive myself, the staff and the players are that come the middle of next week, we’re going to start thinking about the next game and trying to finish off in a successful way, but we can’t look at that now, we need to enjoy what’s a really fine achievement.”\nLooking ahead to the Championship, the 36-year-old said: “It’s exciting, there’s no doubt about it, it’s going to give everyone in the town, the supporters, the players a big boost because this is a club with a fine heritage at the top tree of English football.\n“It’s been a clear goal to get it back there and you never know how long that’s going to take and there are a lot of other things that go on at the club and the ownership want to engage with the community in different ways, but there’s no doubt we want to climb back up that pyramid.\n“Once we get this season finished off, we can all look forward to next season. A big challenge again, another great challenge but one we’re all going to throw ourselves into.”\nThe post-match celebrations on the pitch extended long after full-time with the players’ families joining them and fans remaining in the stands singing and chanting.\n“It was lovely,” McKenna, who had changed into dry clothes by the time he spoke to the media, continued. “Getting to see your family, walk round with my wife and kids, knowing how much they’ve helped me.\n“Moving from Manchester down to Ipswich is a big one, moving the whole family in, going all in like we have been and the support that I’ve had from my wife.\n“Special to enjoy it with them, special to enjoy it with the staff, special to see the enjoyment in everyone else and a wonderful day, one that we’ll always remember. One that the people of Suffolk will always remember.\n“We have to cherish it, but there’s no doubt about it, we’re going to be looking to create some more good memories in the future.”\nMcKenna has insisted all season that he’s paid little heed to the table throughout the campaign but afforded himself a look prior to his press conference, which took place more than an hour after its usual time due to the celebrations.\n“I’ve just checked the results as I’ve come in,” he smiled. “I think the first thing I have to say is that it’s been a terrific effort from the other teams.\n“We’ve had a fantastic season, I think our performance level has been so high. Plymouth are having a fantastic season, the points total they have, the job that [manager] Steven Schumacher’s done, the number of margins they’ve come out on top of, and don’t say that in a negative way. To come out on top of so many tight games is an incredible effort.\n“I feel a little bit sorry for Darren Moore and Sheffield Wednesday I have to say, there’s no doubt about it.\n“I can very much feel what my emotions would be if I was in their position, another team having an incredible season, such a strong squad and they’ve gone out and delivered a top season and they’re on 93 points with a game to go and they’re not going to go up automatically.\n“I think in the situation you have empathy with all the other teams, it’s been a fantastic season, I think the level of play has been really high and we’ll try and finish it off well now.\n“We know where we are, we’re on 97 points, 99 goals. I think anyone who can do arithmetic will know what we’re going to try and finish off with.”\nNice to finish by winning the title? “Honestly, it’s not a focus at the moment, so at the moment it doesn’t feel like it’s very important.\n“At the moment what feels very important has been achieved, but I know what I’m like, I know what the players are like, and I think once we get into the meat of next week and we start training and preparing for Fleetwood, we’ll go and try and deliver another good performance and a professional job.”\nWherever McKenna’s career ultimately takes him, today will be a milestone, his first promotion as a manager.\n“It will always be a special day, there’s no doubt about it,” he continued. “It doesn’t feel like a start for me. I know because people disassociate management from coaching but for me, it started many, many years ago.\n“This is another step on something that I’ve really worked hard for. But, yes, there’s no doubt, I’ve worked at Champions League level, who knows where I’ll go in the future.\n“But this is a really special day and coming to Ipswich Town, a club with such a history and tradition and trying to help it get out of this league, was a really difficult task, there’s no doubt about it and I know how hard it’s been and when you finish with a 6-0 it looks routine, but it’s not routine and there’s no guarantees.\n“The ownership has been fantastic but we knew that we have to get back to where we can be and it doesn’t come easy.\n“You see so many big football clubs fall further and further down the ladder, so I think this is certainly an achievement that I’m going to look back on with great pride for myself and for everyone who’s played a part in it.\n“And I also know that come next Monday, I’ll be thinking about the future and how I can keep improving and how I can keep pushing the football club as well.”\nPhoto: TWTD\nPlease report offensive, libellous or inappropriate posts by using the links provided.\nGiving the best football for 20 years.... please stay !!\nThe lowest attendances and dreary football under McCarthy and Marcus Evans are just a terrible memory now. Thank you KMcK, a rather splendid Saturday afternoon was had by all!\nYou have no worries of him leaving just yet, he has a new challenge.\nI can only see him leaving once we are established in the Prem and not progressing.\nWe must hope he and all his family have settled well in East Anglia , and that he ,undoubtedly being appreciated and valued , will stay and build a team to forge a sound future in the Championship,and upwards .\nLong may we be privileged to witness his work , listen to his judgements and continue to enjoy HIS football !\nK M is a gem !\nCOYB\nAs his first proper management position, I can't see him being desperate to shoot off anywhere - especially with a other great challenge ahead of him\nWho's to say he won't be managing Premier league football from East Anglia in a couple of seasons?? We can dream!\nThen international.\nThanks to -\nKM\nGame Changer\nMark Ashton\nRed Ed\nMost importantly-\nTeam and Supporters\nWHAT AN AMAZING DAY FOR EVERYONE AND MASSIVE CREDIT TO THOSE EXETER SUPPORTERS WHO STAYED TO WATCH OUR CELEBRATIONS AFTER WATCHING THEIR OWN TEAM HUMILIATED.\nCOYB\nAlso Big Fat Joe wasn't a bad manager in between GB and KMcK\nYou need to login in order to post your comments",
  "word_count": 2934,
  "scraped_at": "2026-02-14T01:39:36.157248",
  "_text_extracted": true
}