{
  "article_id": "8afae7a02424",
  "url": "https://www.thisdaylive.com:443/index.php/2024/04/30/its-finidi-not-amuneke-that-succeeds-peseiro-as-super-eagles-substantive-head-coach",
  "title": "It Finidi Not Amuneke that Succeeds Peseiro as Super Eagles Substantive Head Coach",
  "date": "20240430T014500Z",
  "domain": "thisdaylive.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Latest Headlines\nIt’s Finidi Not Amuneke that Succeeds Peseiro as Super Eagles Substantive Head Coach\nDuro Ikhazuagbe\nAfter months of dilly dallying over who to succeed Portuguese Jose Peseiro as Super Eagles Head Coach, the Board of the Nigeria Football Federation (NFF) on Monday finally approved the recommendation of its Technical and Development Committee to handover the job to former winger, Finidi George.\nThe announcement by the NFF puts to rest speculations that had earlier pointed in the direction of another former Super Eagles Star, Emmanuel Amuneke, as the gaffer selected for the job.\nGeorge, a former Ajax and Real Betis player whose immediate responsibility on assuming the post is to fashion a winning formula against South Africa and Benin Republic in 2026 World Cup qualifiers in June, spent 20 months understudying the Portuguese as an assistant coach.\nIn a little over five weeks, the former Sharks and Calabar Rovers star will lead Nigeria into the must-win encounters in Uyo (against South Africa) and Abidjan(against Benin Republic). The Super Eagles are lagging behind in third place in Group C of the African campaign behind Rwanda and South Africa.\nGeorge, 53, was in charge of Eagles after Peseiro left the post after his contract expired with the 2023 AFCON in Côte d’Ivoire.\nHis squad edged Ghana 2-1 in the first match, ending an 18-year winless streak against the Black Stars, but then lost 0-2 to Mali in the second game.\nGeorge, a member of the ‘Golden Generation’ that won the 1994 Africa Cup of Nations tournament in Tunisia and emerged the second most entertaining team in Nigeria’s debut at the FIFA World Cup finals in USA the same year, won 62 caps for Nigeria, including featuring at the 1994 and 1998 FIFA World Cup finals. He also won gold, silver and bronze medals from the 1992, 1994, 2000 and 2002 AFCON tournaments.\nHe made a scoring debut for fatherland in an Africa Cup of Nations qualifying match against Burkina Faso at the National Stadium, Lagos on 27th July 1991, also featured for Calabar Rovers and Sharks FC in the domestic scene before heading to Europe. He assisted Rashidi Yekini (of blessed memory) to score Nigeria’s first-ever FIFA World Cup goal against Bulgaria in Dallas, USA on 19th June 1994.\nThe Rivers State -born George won the prestigious UEFA Champions League with Ajax along with another Nigerian, Kanu Nwankwo.",
  "word_count": 397,
  "scraped_at": "2026-02-14T01:51:24.784909",
  "_text_extracted": true
}