{
  "article_id": "8b61cee9b58d",
  "url": "https://thepeoplesperson.com/2025/02/10/man-united-agree-to-loan-casemiro-to-flamengo-290740/",
  "title": "Man United agree to loan Casemiro to Flamengo - Man United News And Transfer News",
  "date": "20250210T161500Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Casemiro could yet leave Manchester United this month with the club agreeing to subsidise his massive wages to help get a loan move to Flamengo over the line, according to reports.\nBolavip claim that the Brazilian side are very keen on the midfielder, who has been an unused substitute in nine of United’s last 11 Premier League games.\nThe report states that the club “sounded out the midfielder in recent days”, and adds that manager Filipe Luis approves of the move.\nJournalist Jorge Nicola writes that United are “willing to loan him out and help with his salary. Filipe Luis would love to have Casemiro.”\nHowever, despite the Red Devils agreeing to pay part of his wages – £350,000 a month – the deal is still in serious doubt.\n“Flamengo understands that, given all the figures, it is a very risky business,” the report continues.\n“Even if United agrees to help with most of the salary, it would still be a very high amount to be paid.”\nThe report also discusses Arsenal midfielder Jorginho, who is said to have agreed a salary with the Brazilian side, and anticipates that he will soon be signing a pre-agreement.\nYet again, this looks like a case of United’s sky-high wages scuppering otherwise easy deals; while the report concedes that Casemiro’s return to his homeland is possible, it doesn’t sound promising.\nRuben Amorim clearly doesn’t have the veteran midfielder in his plans, and has used him only sparingly since his arrival.\nThe Portuguese boss is now more likely to send 21-year-old Toby Collyer off the bench to shore up the United midfield than the multiple Champions League winner, so getting him off the books is a priority.\nOther transfer windows remain open, so there is every chance a solution will be found, but the reports of him playing club football in Brazil for the first time since 2013 seem to be wishful thinking.\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 324,
  "scraped_at": "2026-02-14T01:58:05.353726",
  "_text_extracted": true
}