{
  "article_id": "8b6375fecc80",
  "url": "https://www.nytimes.com/athletic/6702600/2025/10/09/three-years-amorim-manchester-united/",
  "title": "Three years for Amorim at Manchester United ? Plus : Is scouting too data focused ? ",
  "date": "20251009T153000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Athletic FC ⚽ is The Athletic’s daily football (or soccer, if you prefer) newsletter. Sign up to receive it directly to your inbox.\nHello! Find a boss who believes in you like Sir Jim Ratcliffe believes in Ruben Amorim.\nOn the way:\n- Amorim ‘will get three years’\n- Old-school scouting\n- Right-wing football influences\n- Libyan butter-fingers\nThree-year vow: Ratcliffe backs Man Utd’s Amorim to prove he’s a ‘good coach’\nThe streets of football are littered with promises which weren’t kept, and this next one will take some sticking to.\nAdvertisement\nIt came from Sir Jim Ratcliffe, the Manchester United co-owner, who appeared on a podcast published by UK newspaper The Times yesterday. Ratcliffe was asked about Ruben Amorim, of course, because any conversation about United has to touch on their head coach, a man forever hanging by a thread. Was Amorim’s job on the line?\n“He has not had the best of seasons,” Ratcliffe conceded, which was putting it mildly. “Ruben needs to demonstrate he is a good coach over three years. That’s where I would be.”\nAnd there you had it — a vote of confidence to beat all votes of confidence. Amorim, by the standards of the Premier League, should be somewhere close to sacking territory by now. It is, after all, an environment where a coach like Ange Postecoglou at Nottingham Forest finds himself fighting to save his skin within days of being appointed. Amorim is still to post consecutive league victories, 11 months after taking charge at United. He’s lost as many games as he’s won.\nWhat Ratcliffe is essentially saying is that, for now, the numbers don’t count. No matter how it looks or how a different board might act, Amorim will have three full seasons to get it right. It’s a refreshing attitude on one hand: a shareholder trusting his gut when others would twitch. On the other hand, it’s going to take a backbone of steel to deliver on that pledge — because a week can be a long time at Old Trafford, never mind three years.\n‘Most profitable club’\nUnited, to be frank, are operationally messy, although Chris Weatherspoon’s analysis of their financial position this week suggests they’re slightly less messy than they were. They have reduced their wage bill and are steadily lowering their operating losses, but it’s all a slow creep back towards fiscal sanity (Ratcliffe reckons they can be “the most profitable club in the world”. Good luck with that).\nAdvertisement\nThe football isn’t helping much. United have not just no Champions League income this season, but no European revenue at all. If the first two months of 2025-26 are indicative of what’s to come, they won’t have any next time either. Amorim is glued to his 3-4-3 (or thereabouts) system, in spite of how inconsistently it works. It’s not unfair to say that many regimes would have binned him.\nRatcliffe’s justification for backing Amorim is this: “The press, sometimes I don’t understand. They want overnight success. They think it’s a light switch. You know, you flick a switch and it’s all going to be roses tomorrow. You can’t run a club like Manchester United on knee-jerk reactions to some journalist who goes off on one every week.” He also insisted that majority shareholders, the Glazer family in America, won’t ever pull rank by dismissing Amorim.\nBy any measure, it’s an extraordinary stance; high risk, considering how heavily Ratcliffe’s reputation is now staked on Amorim. Underperforming coaches are incredibly hard to stand by. Aside from anything else, supporter sentiment can be overwhelming; far more difficult to head off than the whims of journalists. So two questions. Will Ratcliffe actually give Amorim three years? And if United don’t hit a hot streak, can he give Amorim three years? I know what I think.\nNews round-up\n- The churn of employees at United has brought Ameesh Manek to Old Trafford from Brentford. He has accepted the role as the club’s new head of football operations.\n- Argentina’s neutral-soil friendly against Puerto Rico next Monday, October 13, is being moved from Chicago to Inter Miami’s Chase Stadium. Reports in the U.S. and South America say this is because of social protests in the game’s original host city.\n- In a sign of the times, UEFA is looking for online streaming companies to get involved when it invites bids for the TV rights to the Champions League for the 2027-33 cycle. The aim is to take annual revenue towards or beyond the £5bn ($6.7bn) mark.\n- Rangers look like turning back to Steven Gerrard, their title-winning manager in 2020-21, after the swift sacking of Russell Martin. They’re in talks with the former Liverpool captain.\n- The owners of Premier League side Burnley have sealed a takeover of Barcelona-based La Liga team Espanyol. The deal is said to be worth £113m.\n- Megan Feringa has rounded up the first week of Women’s Champions League action. Barcelona smashing visitors Bayern Munich 7-1 was slightly ominous.\nScout’s honour: Has modern-day recruitment gone too far down the data road?\nOne of my favourite stories about Eddie Gray — Mr Leeds United — comes from his first stint as manager of the club in the 1980s. New to the role, he walked past a youth-team training session and caught a glimpse of John Sheridan, a slick and silky midfielder. “From tomorrow,” Gray said, “he trains with the first team.”\nSome in the game can see talent with one glance — like the highly-respected Dave Worthington, a former scout for Chelsea, West Ham United, Everton and more besides. Worthington, now 80 years old, is from the old school; so much so that the march of data analysis pushed him out of his last club role. Oli Kay tracked him down for a chat about modern-day recruitment.\nAdvertisement\nIn his pomp, Worthington was recommending Karim Benzema before the world really knew about the Frenchman. He was banging the drum about Rodri before the Spaniard was Ballon d’Or material. He told Chelsea to sign Manuel Neuer from Schalke, and I bet they wish they had. All of this was based on intuition and the naked eye.\nData’s takeover of the transfer world was an inevitability, and it made a lot of sense. It’s efficient and it cuts deeper into trends and traits. There’s no going back to the time when Worthington was driving 14 hours (and sleeping in a lay-by overnight) to watch Benzema at Lyon. But his track record is a useful reminder that human instinct should always play a part in guiding a club’s investment.\nRight-wing run: Farage, Trump and a new front to culture war in UK game\nSome of our readers will be familiar with Nigel Farage. For those who aren’t, he’s the leader of Reform UK, a British right-wing political party. He’s also a friend of Donald Trump’s and appeared not long ago at a U.S. congressional hearing.\nPart of Farage’s schtick is to latch onto football. He launched a Reform FC shirt before the party’s last annual conference with his name and the number 10 on the back (signed versions retail at £100, or $134). At the same time, chants in support of him and some of his policies — criticism of illegal immigration across the English Channel for one — have grown more prevalent at international England fixtures.\nPolitics in football isn’t a wholly new phenomenon. Extreme influences have been evident in the sport, and in different countries, before. But there are culture wars in the UK, just like America, and as Phil Buckingham explains, the sport is being dragged into them. It doesn’t strike you as a wholesome combination or something the game needs.\nAround TAFC\n- A nice read here on Jordi Alba, a left-back who knew exactly how to feed Lionel Messi. The only thing missing from Alba’s record is a World Cup winner’s medal. Joan Capdevila had the left-back berth for Spain’s triumph in 2010.\n- Celebrity spotting at the football has become a pastime in itself. TV producers are now prepped to scan the stands for famous faces, like Madonna at Chelsea last weekend. It’s very much Tim Spiers’ wheelhouse, so he wrote about it.\n- The mascots at tonight’s friendly between England and Wales at Wembley won’t be the traditional set of kids. Instead, the youngest will be in their fifties — because all are living with Alzheimer’s disease or dementia, and this evening is designated as an Alzheimer’s Society match.\n- Joshua Kloke sat down with Canadian international Liam Millar for a very open discussion about how the 26-year-old suffered mentally after a serious ACL injury. Canada head coach Jesse Marsch was instrumental in helping him through the bad times.\n- Almost a year has passed since Antonee Robinson last played for the USMNT but he’s now back and over a chain of injuries. Paul Tenorio spoke to him.\n- Most clicked in Wednesday’s TAFC: Felipe Cardenas’ Darlington Nagbe interview.\nCatch a match\n(Selected games, times ET/UK)\nUEFA World Cup qualifiers (all 2.45pm/7.45pm): Group C, Scotland vs Greece Fox, Fubo, ViX/BBC; Group G, Malta vs Netherlands Fubo, Amazon Prime/Amazon Prime; Group L, Czech Republic vs Croatia ViX/Amazon Prime.\nInternational friendly: England vs Wales Fox, Fubo, ViX/BBC, ITV.\nUnder-20 World Cup, round of 16: USMNT vs Italy, 3.30pm/8.30pm — Fubo/FIFA+.\nAdvertisement\nAnd finally…\nA win for Cape Verde against Libya yesterday would have booked their place at a World Cup for the very first time. Alas, they drew 3-3, meaning qualification for 2026 rests on their last group-stage fixture at home to Eswatini on Monday.\nTheir draw with Libya was quite a drama. Cape Verde trailed 3-1 until the Libyan goalkeeper forgot how to catch (above) and helped them back into the match. There was then a shocker of an offside decision as Cape Verde tore forward in search of a stoppage-time winner. African football can sometimes go under the radar in the wider world but it doesn’t half know how to bring the fun.",
  "word_count": 1670,
  "scraped_at": "2026-02-14T02:26:56.613929",
  "_text_extracted": true
}