{
  "article_id": "8b646873e360",
  "url": "https://theathletic.com/5254589/2024/02/09/postecoglou-de-zerbi/",
  "title": "Continued rise of Postecoglou and De Zerbi shows Premier League more open than ever",
  "date": "20240209T054500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "There was a time, not very long ago, when it felt like the top end of European football was a sealed world, a caste almost impenetrable to those who existed outside of it.\nThe big jobs were reserved for coaches who had spent most of their careers at the elite clubs, and who looked like they belonged in that hermetically-sealed world. There was little prospect of steadily working your way to the very pinnacle of the game. You either spent your career safely within that echelon or you were locked outside.\nMaybe that is starting to change.\nAdvertisement\nBecause two of the most admired managers in the Premier League right now, two men with the most innovative and entertaining styles of play, are two men who have taken a patient route to get to the top.\nWhen Ange Postecoglou and Roberto De Zerbi shake hands just before 3pm tomorrow (Saturday), they will do so as the leaders of two of the Premier League’s most exciting teams, Tottenham Hotspur and Brighton & Hove Albion respectively.\nIn front of them on the pitch, they will have hundreds of millions of pounds worth of players trying to carry out their instructions and make their ideas real. Sat behind them in the stands, they will have dozens of analysts, coaches and staff. They have resources at their disposal the envy of almost every other coach in the world.\nBut it has not always been like this for these two.\nAs they are not averse to reminding people, they have both had to work exceptionally hard to get to this point. Neither had an elite playing career (Postecoglou won four caps for Australia, where he spent a decade with two clubs; De Zerbi spent most of his in Italy’s second division). So, as managers, they were never going to be parachuted directly into the biggest jobs, but rather had to earn the right to work their way up.\nPostecoglou did most of his work back home in Australia before moving on to Japan and then Scotland. De Zerbi has not travelled quite so far, working his way steadily up the ladder in Italy, starting in the lower leagues, eventually getting two eighth-place Serie A finishes with Sassuolo before leaving to do one season at Ukraine’s Shakhtar Donetsk.\nThere are certainly differences between the two men — Postecolgou is 14 years older than De Zerbi for one — but they have often been seen as paired or connected somehow. Each offers not only his own interesting story but more importantly his distinct brand of possession football, carefully developed over the course of his career.\nAdvertisement\nEvery manager now seems to get the the suffix ‘ball’ attached to their name and yet in the case of these two it actually feels appropriate. They have each created something original and unique, something that has been proven to work from one job to the next.\nGO DEEPER\nUnderstanding the [Manager]ball phenomenon\nMaybe it was their circuitous paths to the top that gave Postecoglou and De Zerbi the chance to develop their own unique styles. The environments they worked in were certainly not low-pressure but they were not quite the Premier League, where you have to arrive with all your ideas fully formed.\nBoth had their CVs sneered at when they arrived in England but those experiences are why they are who they are. Because, from their own journeys, they have emerged with their own authentic approaches. Which is why, in a league where all the clubs are desperately trying to find a playing identity to give them an edge, they are so attractive.\nSo the similarities between the two men have been clear for some time.\nIn September 2022, when Graham Potter took the Chelsea job, Brighton were keen on a new manager who could build on Potter’s impressive three years at the club and who had his own original approach to possession football. Prominent in their thinking were De Zerbi at Shakhtar and Postecoglou of Celtic. Postecoglou did not want to leave mid-season with Celtic competing for multiple trophies and De Zerbi got the nod. (Postecoglou said in December that he “did not have discussions with Brighton at the time” and “there wasn’t really the possibility” of leaving Celtic at that point.)\nThen, at the end of last season, it was Tottenham’s turn to look for a new manager. They wanted something new, something fresh, a more modern style of play and a character who could drive it. De Zerbi was in their thoughts but, in the end, they went for Postecoglou, who had just won his second Scottish title in as many years with Celtic.\nAdvertisement\nThe success of both men in their respective roles so far suggests that you do not always need Premier League experience to succeed in the Premier League. Both have taken their distinct approaches and made them work here, undermining so much of what we tell ourselves about the unique demands of English football.\nDe Zerbi took Brighton to a sixth-place finish last season, qualifying them for Europe for the first time in their history, and lost an FA Cup semi-final on penalties against Manchester United. Brighton are currently eighth in the table, one of 16 teams still in this season’s FA Cup and, best of all, at the same stage of the Europa League, having won a group containing two former European champions in Marseille and Ajax. He has quite literally taken them to places they had not previously been in their history.\nPostecoglou has not been at Spurs for as long, but he has overseen a complete overhaul of the squad and the playing style, finally moving on from both the Mauricio Pochettino era and the years of negative counter-attacking football that followed it. He has guided the team through an injury crisis and has them fifth, just two points away from the top four. And he has transformed the mood and ethos of the place, realigning players, fans and club even faster than might have been expected.\nBut no good work goes unnoticed in football.\nCome the summer, De Zerbi and Postecoglou are likely to find themselves in similar positions again: linked with any number of the many big-club jobs that are likely to be open by the end of the season.\nWe already know the Liverpool job will be one of those and while Anfield old boy Xabi Alonso is the favourite, De Zerbi and Postecoglou have both been linked with it. It would be a change in style for that club but ultimately there can be no smooth transition from a figure as dominant as Jurgen Klopp.\nAt Manchester United, it remains to be seen what Sir Jim Ratcliffe, Dave Brailsford and Omar Berrada will do with the managerial post, but no one would argue that Erik ten Hag has done so well that he is certain to still be there in August. United are sixth in the league, having finished bottom of their Champions League group with one win from the six games.\nAdvertisement\nWhile we do not know what profile of manager the new United hierarchy would go for, one theory points to the success Ratcliffe and Brailsford have had since appointing Francesco Farioli to manage Nice, who are currently second in France’s Ligue 1. Farioli is a protege of De Zerbi, having worked for him at Benevento and Sassuolo. Given Ratcliffe and Brailsford’s strong relationship with the apprentice, they might be tempted to go for the master this summer.\nAt Manchester City, Pep Guardiola still has another season left on his contract after this one.\nThe night that Klopp announced his departure, Guardiola confirmed he still wanted to do his final year, and even floated the possibility he might extend that deal. And yet it is hard to shake the suspicion he may at least consider following Klopp, especially if City win as much this season as they did last year.\nAnd if that job does suddenly become open, De Zerbi and Postecoglou would surely be among the favourites, both of them established in the Premier League and with Guardiola-approved styles of play. (Postecoglou has already succeeded within the City Football Group network, having won the title in Japan with the multi-club stable’s Yokohama F Marinos.)\nBeyond Liverpool, United and City, it is very difficult to know what the situation will be at Chelsea by the summer, and if we look abroad there are likely to be plenty of big vacancies — Xavi has already announced he will be leaving Barcelona. De Zerbi has been linked there, too. As he has also been to a few big Serie A jobs that may come up, including Napoli, a club he played for, AC Milan, where he started his career, and possibly even Roma.\nBut while speculation is inevitable, how likely is it that either man would leave his current job?\nDe Zerbi still has two years left on his contract, although he revealed in December that there are talks over a new one. While the Serie A clubs may struggle to afford him financially, if a richer side elsewhere in Europe makes De Zerbi their priority, it is hard to see them not paying the money to get him out of Brighton.\nAdvertisement\nPostecoglou feels like a different story. He has effectively three years left on his deal after this one (two, plus an option) and there are no indications whatsoever that he is interested in looking away. In fact, the story of Postecoglou’s time at Spurs so far has been their growing power in the transfer market, as the club has been one of the very few so secure within the Premier League’s profit and sustainability rules that they could continue to spend in the January transfer window.\nTottenham currently look more able to punch their weight in the market than ever before, and Postecoglou knows he is assembling an exciting team for the future. Last week, he mentioned the examples of Micky van de Ven, Pape Sarr and Destiny Udogie, all first-choice players in their early twenties, and spoke of his hope that young players from across Europe can see what he is building in north London.\nWith a young, hungry squad and the club in a strong position financially, Spurs look better set for the next few years than many of their rivals. (Contrast their situation with that of Brighton, where the policy of selling players to make money will eventually put a limit on how much they can achieve in the league.)\nSo while people have to be prepared for speculation, the chances of Postecoglou not being at Tottenham next season feel statistically minimal in the extreme. And even if he was hypothetically interested in a move elsewhere, the chance of chairman Daniel Levy sanctioning it would be absolutely zero.\nIn June 2018, Pochettino was interested in talking to Real Madrid, where Zinedine Zidane had surprisingly quit. But Pochettino had just signed a new contract with no release clause, and so he was reliant on Levy and Madrid president Florentino Perez doing a deal.\nPerez called up Levy, hoping that it would be a smooth negotiation and he would emerge with a new manager. Levy told him the price would be Marco Asensio. And Mateo Kovacic. And £100million. The conversation was over.\nMadrid appointed then Spain head coach Julen Lopetegui instead.\n(Top photo: Julian Finney/Getty Images)",
  "word_count": 1905,
  "scraped_at": "2026-02-14T01:56:44.634822",
  "_text_extracted": true
}