{
  "article_id": "8b72af8854f6",
  "url": "https://fansided.com/5-players-free-transfers-summer-window",
  "title": "Five on a free : 5 players who could potentially move on free transfers in the summer",
  "date": "20241209T190000Z",
  "domain": "fansided.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The transfer windows within football come around on a cyclical basis. Every six months or so, teams have the opportunity to improve their sides to battle for their aims, be it a side that are battling for a title, fighting for a place that qualifies them for European football or simply one with an aim of avoiding relegation.\nBeing just weeks away from the winter transfer window at the time of writing, every team in Europe will have an eye on potential business they can conduct in January. Not only that, but January offers teams the chance to speak with players on expiring contracts with an aim of that player joining their side in the near future.\nSo, with all of this being said, who are some of the best players, according to their Transfermarkt market values, that would be available on a free transfer in the upcoming summer if nothing changes about their contracts between then and now?\n5. Joshua Kimmich\nEmerging with RB Leipzig after time in Stuttgart’s academy, Joshua Kimmich made his professional debut in 2013 and joined Bayern Munich after two years in Leipzig. Kimmich has remained with the club ever since, making hundreds of appearances and winning countless honors, such as eight Bundesliga titles and a Champions League.\nKimmich has earned comparisons to former Bayern player Philipp Lahm, who was capable of playing as either a midfielder or right-back just as Kimmich is. The German international has been used as a center-back on occasion if it has been needed, further displaying the comfort he has in his versatility.\nIf reports are to be believed, Kimmich’s contract is due to expire in the summer of 2025. Similar reports have touted numerous potential destinations for Kimmich, which is perhaps an indication that the general feeling is that Kimmich sees his immediate future outside of Bavaria.\n4. Alphonso Davies\nAlphonso Davies emerged to prominence as a senior player with the Vancouver Whitecaps in Major League Soccer, for whom he made his professional footballing debut in 2016. Two years later, it was announced that Bayern Munich had agreed a deal to acquire the defender’s services and after a year with their second team, Davies joined up with the senior side in 2019.\nSince then, “the Roadrunner” has established himself as one of Europe’s best left-backs and has risen to the position of captain for the Canadian national side. Davies, who is capable of playing either as a full-back or further up the flank as a winger, has lightning pace which, combined with his amazing technical ability, makes him a handful for opposing defenders.\nDespite already having won five Bundesliga titles, two DFB-Pokal’s and a Champions League with the Bavarian giants, Davies is still just 24 years old and not even in his prime. Reports suggest that the Canadian’s contract is up in the summer of next year and he will no doubt be a priority target for many of football’s elite.\n3. Mohamed Salah\nPrior to Mohamed Salah’s time with Liverpool, his experience of English football had hardly been enjoyable. The Egyptian joined Chelsea in 2014 in his early 20s, but only made a handful of appearances for the club before joining Roma in 2016 after loans with them and Fiorentina.\nAfter one season as a permanent Roma player, Salah moved back to England to join Liverpool and was a crucial part of the Jurgen Klopp team that won a Premier League, Champions League, FA Cup and two EFL Cups. The winger formed a fearsome attacking trio alongside Roberto Firmino and Sadio Mane.\nMuch has been said of the fact that Salah’s contract expires this summer, with the player himself having come out and spoken about the fact he hopes to remain at Anfield. One would assume, given the value Salah offers his team, that the winger will renew his deal, but were that not to happen, he would be an immense signing for anybody.\n2. Leroy Sane\nAfter making his senior debut in 2014 with Schalke in his native Germany, Leroy Sane had established himself as one of the continent’s more promising talents by the time Manchester City came calling for him in 2016. Having recently appointed Pep Guardiola as manager, City recruited Sane as one of the Spaniard’s first signings.\nSane made almost 150 appearances for Man City across his four years at the Etihad, netting 39 goals and notching 43 assists in that time. After rejecting a contract extension in 2020, Sane was swiftly sold, moving on from Manchester and returning to Germany to join Bayern Munich.\nSince then, Sane has made 191 appearances for the Bavarian giants at the time of writing, with over 100 goal contributions to his name. The winger has had his injury struggles, especially in recent years, but as a player who is within his prime years, he would surely be worth a punt as a transfer, particularly if it was on a free.\n1. Trent Alexander-Arnold\nEnglish right-back Trent Alexander-Arnold has served as something of a revelation for the position. With the passing range of a midfielder and forward-thinking of a winger, Alexander-Arnold has been a fixture in the Liverpool team since soon after he made his professional debut in 2016.\nSince then, Alexander-Arnold has won all of the major honors available to him at least once, having been part of the Jurgen Klopp team that saw Liverpool rise into title contenders again after some years of mediocrity. Though his defensive abilities have been questioned in the past, it has not taken away from Alexander-Arnold rightly being considered as one of the best in the world.\nA dead-ball specialist and a full England international, there have been many reports of the fact that Alexander-Arnold’s contract is due to expire in the summer, with Real Madrid allegedly having made him their number one target. Whether a move occurs remains to be seen, but it’s hard to argue that Alexander-Arnold moving on a free transfer would be an exceptional bit of business.",
  "word_count": 1000,
  "scraped_at": "2026-02-14T01:52:10.163596",
  "_text_extracted": true
}