{
  "article_id": "8b79da5ec305",
  "url": "https://www.90min.com/features/champions-league-predictions-knockout-play-off-round-second-legs-february-2025",
  "title": "Champions League predictions : Knockout play - off round second legs",
  "date": "20250218T040000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Champions League predictions: Knockout play-off round second legs\n- Second legs of Champions League play-offs take place this week\n- Eight teams will advance into round of 16\n- PSG, Bayern Munich and Real Madrid in commanding positions\nUEFA's format changes to their club competitions has resulted in more football, more knockout rounds, and more second leg drama.\nThe all-new Champions League play-off round has been greeted with a mixed reception, but more will doubtlessly come around to the competition's extension should the typical chaos we associate with the competition's knockout phase manifest this week.\nWhile several away teams took a big leap towards the round of 16 by winning the first leg, six of the eight ties boast one-goal differences heading into the upcoming return fixtures.\nHere's how 90min projects the Champions League play-off round second legs to play out.\nTuesday 18 February\nFULL MATCH PREVIEWS\nAC Milan were sub-par in Rotterdam last week as an undermanned Feyenoord side currently led by an interim manager secured a 1-0 win by virtue of Igor Paixao's early goal. The Rossoneri huffed and puffed for the remainder of the contest, but never looked like restoring parity.\nThus, there's work for Sergio Conceicao's side to do on home soil as the depleted Dutch side aim to preserve their slender advantage. Former Feyenoord striker Santiago Gimenez was kept quiet at De Kuip, but he scored his second Serie A goal at the weekend.\nAnother Italian club, Atalanta, have a goal deficit to overcome on home soil. La Dea met their match in Club Brugge last week, but they were hard done by in the first leg with the home side being gifted the softest of penalties late on.\nLa Dea have stuttered over the past month, but they could be boosted by the return of Ademola Lookman from injury on Tuesday night.\nCeltic have a mountain to climb in Bavaria after they were beaten by the Bundesliga leaders in Glasgow. Goals from Michael Olise and Harry Kane put Bayern Munich into a commanding position before Daizen Maeda halved Celtic's deficit to offer the Scots a mere glimmer of hope. Bayern haven't been beaten at home in this competition in almost four years.\nBenfica secured their second victory of the season over Monaco last week, with in-form striker Vangelis Pavlidis separating the two sides with a sublime dinked effort. Once again, the Ligue 1 side were made to pay for ill-discipline as Al-Musrati received his marching orders before Benfica took the lead.\nWednesday 19 February\nBorussia Dortmund have lost their first two Bundesliga games with Niko Kovac at the helm, but the Croatian manager oversaw an impressive 3-0 win over Sporting CP in Lisbon last week. Runners-up last year, Dortmund may well be poised to enjoy a similar campaign to 2023/24 which saw their European run mask distinct flaws.\nThe standout tie of the round didn't disappoint last week as Real Madrid claimed a 3-2 victory at the Etihad amid yet another Manchester City collapse. Madrid scored twice in the final five minutes to take control of the tie, with City needing to win at the Bernabeu for the first time since 2020 to have a chance of progressing on Wednesday night.\nPSG may well be the hottest team on the continent right now, and they made light work of domestic rivals Brest in the first leg. Luis Enrique's side take a 3-0 lead with them to Paris, and the Ligue 1 leaders are expected to saunter into the round of 16.\nJuventus, off the back of Sunday's 1-0 win in the Derby d'Italia, have a 2-1 lead to preserve in Eindhoven. Thiago Motta's side have proven to be unspectacular but tough to beat this term, and a draw on the road will see them into the next round. PSV Eindhoven are aiming to complete a come-from-behind victory.",
  "word_count": 643,
  "scraped_at": "2026-02-14T02:18:11.277546",
  "_text_extracted": true
}