{
  "article_id": "8b9440b15bf2",
  "url": "https://www.masslive.com/tv/celtics-schedule/",
  "title": "2025 Boston Celtics TV Schedule : how to stream NBA playoff games free , what time , channel are the Celtics on today ? ",
  "date": "20250418T193000Z",
  "domain": "masslive.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Boston Celtics are back in the playoffs for the 11th consecutive season and for the first time since 2009, they are the defending champions looking to extend their NBA record for titles.\nDuring the first round of the postseason, fans will be able to watch games on the local NBC Sports Boston broadcast in addition to the national broadcasts on ABC, ESPN, TNT and truTV.\nThe 2025 NBA Playoffs started on Saturday, April 19, and the Celtics played Game 1 of their series against the Orlando Magic on Sunday, April 20 at TD Garden in Boston. The Celtics wrapped up their series with the Magic on Tuesday, April 29 when they won Game 5 at home.\nBoston is taking on the New York Knicks in the second round of the NBA Playoffs. The series starts on Monday, May 5 at TD Garden in Boston and transitions to Madison Square Garden in New York for Games 3 and 4 starting on Saturday, May 10.\nFans looking to watch the Celtics this postseason for free can do so by using DirecTV Stream, which offers a free trial. Fans can also check out FuboTV, which also has a free trial, along with up to $25 off your first month depending on your package.\nAdditionally, games can be watched through Sling TV, ESPN+ or MAX, which can be purchased along with Disney+ and Hulu in a bundle.\nMake sure to stay up to date on the latest Celtics news, game analysis and game preview coverage on MassLive.\nCeltics Playoff Schedule\nStream: DirecTV Stream (free trial); FuboTV (free trial); Sling TV; ESPN+; MAX\nBetting: Check out our MA sports betting guide, where you can learn basic terminology, definitions and how to read odds for those interested in learning how to bet in Massachusetts.\nWhat is DirecTV Stream?\nDirecTV Stream offers practically everything DirecTV provides, except for a remote and a streaming device to connect to your television. Sign up now and get three free months of premium channels including MAX, Paramount+ with SHOWTIME and Starz.\nWhat is FuboTV?\nFuboTV is an internet television service that offers more than 200 channels across sports and entertainment including Paramount+ with SHOWTIME. From the UEFA Champions League to the WNBA to international tournaments ranging across sports, there’s plenty of options available on FuboTV, which offers a free trial and up to $25 off the first month for new customers.\nWhat is Sling TV?\nSling TV offers a variety of live programming ranging from news and sports and starting as low as $20 a month for your first month. Subscribers also get a month of DVR Plus free if they sign up now. Choose from a variety of sports packages without long-term contracts and with easy cancellation.\nWhat is ESPN+?\nESPN+ is a one-stop shop for content from almost every single sport. In addition to on-demand replays of games across all sports shown on the ESPN and Disney family of networks, there is also exclusive access to select college football games, NHL games, soccer matches, UFC programs and the entire 30 for 30 catalogue. Additionally, there is ESPN+ exclusive original programming like NFL Primetime, Dana White’s Contender Series and The Breakdown with Peyton and Belichick. You can stream ESPN+ on your phone, tablet, smart TV or gaming console for $11.99/month or bundle with Disney+ and Hulu for just $16.99 per month.\nWhat is MAX?\nMAX is a streaming service that combines the catalogues of HBO and the various channels that make up the Warner Bros. Discovery Networks like CNN, Discovery Channel and TLC. The service is also partnered with Bleacher Report to provide sports coverage for anything covered by Turner Sports such as the NBA on TNT, the NHL on TNT, college basketball games on TNT and TBS and the Unrivaled 3x3 basketball league. You can also bundle your MAX subscription with Disney+ and Hulu.\nMore sports, gear and tickets\n- Where to watch NBA Celebrity All-Star Game today free\n- How to buy tickets to NBA All-Star Weekend: Celebrity Game, Rising Stars Challenge, All-Star Saturday Night, NBA ASG\n- Where to watch USA women’s hockey game today free\n- 2026 Olympics: How to stream Canada men’s hockey game today live\n- Where to stream Olympic figure skating today live",
  "word_count": 711,
  "scraped_at": "2026-02-14T02:05:46.991558",
  "_text_extracted": true
}