{
  "article_id": "8b9401e252cb",
  "url": "https://www.koreaherald.com/view.php?ud=20240214050714",
  "title": "Jeonbuk beat K League rival Pohang to open AFC Champions League round of 16",
  "date": "20240214T164500Z",
  "domain": "koreaherald.com",
  "source_country": "South Korea",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jeonbuk Hyundai Motors defeated their South Korean league foe Pohang Steelers 2-0 to begin their round of 16 series at the Asian Football Confederation (AFC) Champions League on Wednesday.\nHernandes scored the opening goal in the 17th minute, and Ahn Hyun-beom's diving header in the 64th minute rounded out the scoring at Jeonju World Cup Stadium in Jeonju, some 200 kilometers south of Seoul.\nThe return leg between the two K League 1 clubs is next Tuesday at Pohang Steel Yard in Pohang, 260 kilometers southeast of the capital.\nThe aggregate score will determine the winner. There is no away goals rule in play, meaning the teams will go to extra time or penalties, if necessary, if they are tied in total goals after the two matches.\nHernandes, who left Incheon United to sign for Jeonbuk this offseason, volleyed home a headed pass from Lee Dong-jun, moments after defender Hong Jeong-ho struck the crossbar with a mid-range strike. The ball bounced back out toward the box, and Jeonbuk maintained possession, with Lee finding the Brazilian midfielder just to the left of the penalty spot.\nJeonbuk doubled their lead in the 64th minute when right back Kim Tae-hwan, one of Jeonbuk's key winter signings, sent a perfectly placed cross for Ahn, whose header easily beat goalkeeper Hwang In-jae.\nAlthough Pohang enjoyed a sizable advantage in ball possession and were far more accurate with their passes, they weren't able to translate those numbers into goals.\nJeonbuk and Pohang are two of three South Korean clubs in the knockout stage, along with Ulsan HD FC.\nUlsan will take on Ventforet Kofu of Japan in the first leg Thursday and the second leg next Wednesday. The winner of the Jeonbuk-Pohang showdown will meet the winner of the Ulsan-Ventforet Kofu series in the quarterfinals. (Yonhap)",
  "word_count": 300,
  "scraped_at": "2026-02-14T02:17:18.385121",
  "_text_extracted": true
}