{
  "article_id": "8ba28c4433ed",
  "url": "https://www.liverpoolfc.com/news/pre-season-opponents-lowdown-yokohama-f-marinos",
  "title": "Pre - season opponents lowdown : Yokohama F . Marinos",
  "date": "20250729T103000Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "MatchPre-season opponents lowdown: Yokohama F. Marinos\nLiverpool will face Yokohama F. Marinos in a friendly as part of their continued pre-season preparations.\nThe teams meet in the Reds' first game in Japan for two decades at Nissan Stadium on Wednesday (kick-off 11.30am BST).\nHere, we take a closer look at the opposition…\nFounded: 1972, Yokohama\nNickname: Marinos\nGround: Nissan Stadium\nLeague: J1 League (five titles)\nHead coach: Hideo Oshima\nYokohama F. Marinos are a football team based in Yokohama, in the Greater Tokyo Area.\nFounded in 1972 as Nissan Motor, they later changed to Yokohama Marinos to join the newly formed J.League in 1992, before merging with Yokohama Flugels in 1999, with an 'F.' added to the name to mark the moment.\nThe club won two Japan Soccer League Division 1 titles and now has five J1 League crowns to their name – winning back-to-back trophies in 2003 and 2004, with their last triumph coming in 2022.\nThey are majority-owned by Nissan, with City Football Group also owning a share of the club since 2014.\nMarinos are one of two clubs to be ever-present in the top flight of Japanese football in its current form – alongside Kashima Antlers – since its inception in 1993.\nLast season, they finished eighth in the J1 League and reached the quarter-finals of the AFC Champions League.\nThe 2025 campaign is ongoing in Japan, having reached a little over the halfway stage, and Marinos currently sit in the relegation places ahead of the mid-season friendly against Liverpool.\nThey recently appointed head coach Hideo Oshima, promoting him from assistant, with his aim to steer the team to safety by the end of the season in December.\nThe club also has a previous connection to the Reds having seen 2005 Champions League winner Harry Kewell enjoy a stint in charge in the 2024 season.\nMarinos' club motto can be seen across a range of team branding and was altered in 2025 to: Be a Stunner.",
  "word_count": 329,
  "scraped_at": "2026-02-14T02:11:49.096543",
  "_text_extracted": true
}