{
  "article_id": "8bb64aa52564",
  "url": "https://www.themag.co.uk/2023/12/this-is-why-i-would-never-want-this-serial-champions-league-winner-managing-newcastle-united/",
  "title": "This is why I would never want this serial Champions League winner managing Newcastle United",
  "date": "20231214T150000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This is why I would never want this serial Champions League winner managing Newcastle United\nA lot of fans are probably wondering how long they will have to wait for United to play their next game in the UEFA Champions League.\nA couple of decades was a hell of a hiatus.\nI can only hope the gap is nowhere near that long this time but, after last night’s heartbreaking defeat to AC Milan and recent setbacks in the Premier League, qualification for the 2023-24 tournament is looking decidedly dodgy.\nLong-term injuries to a batch of first-teamers, with Nick Pope’s the latest and perhaps the most important, have undermined the side. When Eddie Howe says “intensity is our identity”, we can all believe… until the intolerable burden of two matches a week saps the energy from an understrength squad.\nThe people who own our club, principally the Saudi Arabia PIF, are presumably looking at why we finished last in the Group of Death and wondering what they can do to ensure we have more success, if and when we qualify again.\nWith the transfer window opening in less than three weeks, rumours will fly like kites in a gale. Expect to see United linked with dozens of Toms, Dicks and Harrys (though perhaps not the £80m Man Utd centre-half).\nNeither will the speculation be confined to potential playing recruits.\nThe Italian paper Gazzetta dello Sport reported yesterday that the club’s owners continue to admire Jose Mourinho, whose contract with Roma expires next summer.\nA cynic might suggest the two parts of that sentence (admiration for a manager who might just need a new job in 2024) are intrinsically linked. In other words, those people who represent the Portuguese serial winner are doing a little kite-flying of their own, either to help him earn a new deal in Rome or to advertise his availability far and wide. Why they would feel the need to promote a man who loves to blow his own trumpet is just one of life’s little mysteries.\nHowever, let’s take the Gazzetta story at face value.\nAre our lords and masters in the Saudi Arabia PIF seriously considering replacing Howe? And if they are, is the man who calls himself the Special One a fitting successor?\nSuch a changing of the guard would be a massive shift. Eddie Howe is diplomatic, Jose Mourinho is confrontational. Howe is respected for his calm temperament under extreme provocation. Mourinho could start a fight with the speaking clock. Howe does his best to avoid criticising referees, opponents, rival managers and the press. Mourinho thrives on conflict, intimidation and bully-boy tactics. Not even his own players are shown respect.\nAnd here’s an irony.\nA lot of what Jose Mourinho practises was garnered from the Alex Ferguson playbook. The Glaswegian had many supporters in the media, foremost among them the late, great Hugh McIlvanney, a multi-award-winning sports writer. They were from the same neck of the woods and shared quite a few interests, including fine wine.\nYou might reasonably expect McIlvanney to have been impressed by Mourinho, another serial winner. Not a bit of it. Rather than referring to him as the Special One, McIlvanney called him the Specious One: a man who was superficially plausible but actually wrong.\nThe dislike stemmed from what McIlvanney witnessed in the 2003 Uefa Cup final, when Porto defeated Celtic 3-2 in a memorable match that went to extra-time. Play-acting and diving by Mourinho’s team besmirched what should have been a showcase for the beautiful game. The slightest physical contact yielded a thespian response from Porto’s players and Celtic were eventually reduced to 10 men.\nMourinho’s elongated knee-slide down the Old Trafford touchline a few months later, when Porto ejected their hosts from the Champions League, would have done little to change the journalist’s mind.\nThe success Mourinho enjoyed in his first spell with Chelsea sealed his reputation as a champion, while confirming the perception that he was (and is) somebody with zero moral scruples. If he could gain an advantage, he would do so by fair means or foul. If his team lost, it was never because they were beaten by superior opponents. Somebody else was always at fault. Piling pressure on the referee and his assistants was a constant.\nAmong the most notorious incidents was his verbal attack on Anthony Taylor after last season’s Europa League final, when he berated the English referee in the stadium car park and called him a “f…ing disgrace”. That match was the first UEFA final Mourinho had lost as a manager (he would doubtless argue Roma didn’t lose because they were beaten only on penalties) but by no means the first time his behaviour could reasonably be called a “f…ing disgrace”.\nAs long ago as 2005, after a Champions League match between Chelsea and Barcelona, he accused the Swedish referee Anders Frisk of favouring Barca and said Frisk had invited their manager into the officials’ dressing room at half-time. Chelsea fans subsequently made death threats against Frisk and his family, prompting the referee to retire. He was given FIFA’s Presidential Award as recognition for an 18-year career cut short, while Jose Mourinho was given a touchline ban. Why was Mourinho upset? Due to Frisk showing two yellow cards to one of the best / worst divers I’ve seen in nearly 60 years of watching football. Take a bow, Didier Drogba.\nAnd so it goes on.\nOnly last weekend, before Roma played Sassuolo, Mourinho said of the match referee: “To be honest [a phrase always worth a credibility alert] I will say that I am worried about the referee. We had this official three times and I don’t think he has the emotional stability to work at this level.”\nAttempting to influence and intimidate match officials is by no means a trait unique to the Portuguese coach, but the frequency with which he employs this transparent ploy, is unparalleled.\nIf he were showing loyalty to his players, it would be understandable, but showing loyalty to his players is another virtue that seems beyond Mourinho. They have been hung out to dry more often than the washing on a sunny Monday morning. The bigger the name, the more likely they are to have been kebabbed by their manager. Just for starters, try these 10 who share that dubious privilege: Luke Shaw, Mesut Ozil, Kaka, Samuel Eto’o, Cristiano Ronaldo, Ricardo Quaresma, Kevin de Bruyne, Pepe, Anthony Martial and Iker Casillas. Thanks to ESPN for the list, which is five years old and doubtless considerably longer by now.\nMany United fans will recall another chief coach who seemed to take pleasure in falling out with the very men he was paid to motivate. He doesn’t need to be named; let’s just say he succeeded Sir Bobby Robson in 2004. Do we want to return to that disastrous type of management?\nWe have been fortunate since November 2021. We have a manager and a team who have made us proud. Positivity has returned to St James’ Park. Hope has been restored. The life of a football supporter is, generally, a series of disappointments punctuated by outbreaks of joy. If you cannot except that reality, perhaps football is not for you.\nJose Mourinho would be an odd choice for those wanting only trophies. Shorn of the riches he enjoyed at Chelsea and Real Madrid, he has struggled at Roma. His style of football, never adventurous, looks almost as dated as Big Fat Sam’s. Yes, a generation ago he upset the applecart with Porto, but that was then and this is now. Football should be enjoyable and entertaining. Switching to a “more pragmatic” approach is no guarantee of success. What is does is suck the fun out of supporters, in the way Kevin Keegan’s successor did in 1997. The media almost universally declared that appointment a masterstroke, the missing piece bound to turn The Entertainers into the winners. Which just goes to show…\nAs a mere keyboard warrior, there is nothing I can do but appeal to the Saudi Arabia PIF and my fellow-fans: Please, please, please do not jeopardise what is being built at Newcastle United by allowing Jose Mario dos Santos Mourinho Felix anywhere near our club.\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 1386,
  "scraped_at": "2026-02-14T01:54:16.871096",
  "_text_extracted": true
}