{
  "article_id": "8bfbf9931ab9",
  "url": "https://www.stokesentinel.co.uk/news/stoke-on-trent-news/ex-copper-charity-champ-now-9296193",
  "title": "Ex - copper and charity champ now behind bars as reputation goes down the toilet",
  "date": "20240521T084500Z",
  "domain": "stokesentinel.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-copper and charity champ now behind bars as reputation goes down the toilet\nRichard Stubbs, 55, from Endon, has now been jailed for five-and-a-half years after being convicted of ripping off customers at his kitchen and bathroom showrooms\nHe was once a police officer upholding the law on Staffordshire's streets. Now Richard Stubbs is today starting a five-and-a-half year prison sentence after ripping off customers at two of his businesses selling kitchens and bathrooms.\nStubbs joined Staffordshire Police at the age of 26 after quitting his job as a prison officer and served with the force for eight-and-a-half years. It was a spinal injury following a motorbike crash that forced Stubbs to leave Staffordshire Police and become a risk and compliance office for a mobile phone company. He had been an undercover spotter policing games at Stoke City and Port Vale.\nHe said at the time: “After the crash I was told that, due to my injuries, I could not go back on the beat as a police officer. I was offered a desk job in the force which I declined as that just wasn’t for me.”\nREAD: 'Dishonest' North Staffordshire businessman JAILED - Richard Stubbs, 55, from Endon, is now a 'broken man'\nREAD: GUILTY! Fraudulent North Staffordshire businessman faces jail - Richard Stubbs, 55, from Endon, has been remanded in custody\nStubbs lodged a formal complaint with the authorities over the treatment of England fans at Euro 2004 in Portugal following violence he experienced during a Champions League match when Manchester United played Porto earlier that year. He was on the committee of the Independent Manchester United Supporters’ Association.\n'Frightened' Stubbs told The Sentinel at the time: “The atmosphere was good but people were drunk although I didn’t sense any trouble. Towards the end of the afternoon a number of locals began lining up. The police formed a line to prevent them coming into the square. I can’t understand why the police didn’t move them on.\n“You could tell the police were up for it, they were all in riot gear. The United fans were chanting and the locals were hurling abuse. A plastic beer glass was thrown. The police drew their batons and charged up the square hitting anyone and anything. One police officer was coming at me with a baton but I managed to dodge it, otherwise I would have been hit by three-feet of baton. It was very frightening. We managed to run up to where the coaches were and took shelter in a bar.\n“The game passed without incident and the atmosphere was good. We saw some other Manchester fans being punched and kicked by the stewards. The police and stewards were hitting anybody. I put a complaint into United. They approached the official security who provided statements backing the statements of fans. A report has been forwarded to UEFA to try and ensure the safety of fans. The Portuguese police are definitely heavy-handed. It was almost as if the match was a trial-run for Euro 2004.”\nStubbs has been a Manchester United fan since 1976, had a season ticket, followed the club around Europe, and was 'good friends with the directors'.\nHe added: “Following the tsunami disaster in the Indian Ocean in 2004, I contacted Manchester United and asked if I could organise a collection during one of the matches with the Football Community. During a game in 2005 we raised £22,000, which I understand was the largest amount ever raised in a day at a football ground. I put the money through Manchester United which sent it to UNICEF.”\nIt was back in 2006 when Stubbs first moved into the business of selling kitchens and bathrooms. He opened Delta Bathrooms and Kitchens, in Station Street, Leek - with Stoke City legend Lou Macari officially opening the showroom.\nTo celebrate the opening, he pledged to fit a new bathroom for one lucky community group in the Staffordshire Moorlands. The company later opened a second branch in Congleton and secured a contract with social landlord Dane Housing.\nHe added: “We are offering a free of charge makeover for the most deserving and needy venue in the community. It is a cracking prize for a charity and it is already creating quite a bit of interest. I have always felt that Leek has managed to retain a real community spirit, where the locals pull together and support each other. “This is why I thought it would be nice to give something back to the community now that I am in a position to do so.”\nDelta Bathrooms and Kitchens closed in 2009 and triggered a move online. Two years later, Stubbs opened I Design Kitchen and Bathrooms, in The Smithfield Centre, in Leek.\nStubbs said at the time: “I had to take some time off after displacing two vertebrae in my spine so I could not carry on. I was told originally that I was going to be out of action for a long time which is why I decided to put the business online and run a much smaller operation. The good news is that my back has responded to treatment and the internet business has gone so well I need to reopen a showroom again. It is good to be back and I am really looking forward to contributing to Leek’s commerce.\n“The shop will stock quality kitchens and bathrooms at an affordable price. With the economy hopefully taking a turn for the better I aim to add to Leek town centre in a positive way. I will still run the internet site alongside the showroom as both will complement each other. I am very excited about the new shop.“\nStubbs also became known for his charity work. He has run the London Marathon, the New York Marathon and The Potteries Marathon. Stubbs also sponsored The Plough darts team in Endon. He also teamed up with business partner and cancer patient Denise Chenoweth to raise money for Cancer Research UK. They formed the DCR motorbike racing team too.\nRichard told The Sentinel in 2015: \"Denise is just inspirational. Nothing compares to what she has gone through and she always keeps smiling. It always makes me think if Denise is happy, I should be happy too. She is known as ‘Pit Mum’ because she helps all the racers. I’ve noticed a change in her since we started with the racing team. We are always thinking about the next race and how to improve. It has taken her mind off things. It has been good for her and she has made many friends.”\nStubbs last hit the headlines - before his court shame - iwhen he was hit with fines for loading and unloading vehicles outside The Smithfield Centre. He fell out with Staffordshire Moorlands District Council and accused the local authority of committing 'commercial suicide'.\nNow Stubbs is contemplating his fall from grace from a prison cell. The 55-year-old, of High End View, Endon, has been found guilty of three charges of fraudulent trading, seven charges of fraud and two charges of intending to pervert the course of public justice after a six week trial at Stoke-on-Trent Crown Court. He was found guilty of taking money upfront from customers for home improvements and not completing the work. Builder Carl Egerton, aged 54, of Basford Green, Cheddleton, who carried out work on behalf of Stubbs, was found guilty of one charge of fraud.\nThe case follows a five-year investigation by Staffordshire County Council’s trading standards service.\nHis barrister - Hugh Barton - told Stoke-on-Trent Crown Court this week: \"His convictions in this trial represent a significant fall from grace for him. Since the early 2000s he has been running businesses designing and supplying kitchens and bathrooms. There is no suggestion this was anything other than a legitimate successful business. He did not set up his business with the intention to commit fraud and traded lawfully over many years.\n\"The offences were committed in an increasingly desperate attempt to keep his business afloat. There was a genuine cash-flow crisis in 2019. In June and July 2019 he was still spending large sums of money obtaining goods for kitchens and bathrooms as he attempted to honour contracts. His dishonest, fraudulent behaviour occurred alongside continuing honest endeavours to satisfy contractual obligations. He acknowledges his actions were wrong and he is very, very sorry for the people who lost money as a result of his actions.\n\"He suffers from a variety of physical and mental issues. Spinal injuries sustained in the road traffic accident have left him with chronic back pain. He has suffered from depression and anxiety since 2019. His mental health has deteriorated since his remand in custody.\n\"He is a broken man and a pale shadow of his former self. He has experienced significant difficulties in custody linked to his former status as a police officer, some bullying, some abuse, some threats. He has found the whole experience traumatising.\n\"It is not accepted that he deliberately targeted any victims. He was not seeking people out. He had business premises. People came to that.\"\nJudge Graeme Smith jailed Stubbs - and has banned him from being a company director for the next 10 years.\nHe told Stubbs: \"I Design ran into financial difficulties in 2018 and 2019. I accept that was for various reasons, including a social media campaign, although part of that was the result of the failure to complete contracts.\n\"I am satisfied that the main reason for the failure of the company was the extraction of funds by Stubbs to maintain his lifestyle. It was clear from your evidence, Richard Stubbs, you felt you were working hard so you were entitled to a certain lifestyle. That included regular trips to a property in Spain, other trips, and watching your football club. The profits of your company were insufficient to maintain this lifestyle. You chose to prioritise yourself. You must have been aware of the money coming in and going out of the company and that there was a shortfall.\n\"I accept you did not target victims on the basis of vulnerability. You were indiscriminating. However, I do find you targeted the doctor to take significant sums from her. She is an intelligent and articulate woman. She was at the time extremely vulnerable.\n\"You have a tendency to blame everybody but yourself for what was happening.\"\nIf you're on the lookout for local news, we have you covered with our FREE email newsletter - sign up in the box at the top of this story or click here.",
  "word_count": 1763,
  "scraped_at": "2026-02-14T01:48:52.522240",
  "_text_extracted": true
}