{
  "article_id": "8c0ff9c6a1c5",
  "url": "https://weaintgotnohistory.sbnation.com/2023/2/15/23599544/borussia-dortmund-chelsea-live-stream-time-tv-how-to-watch-champions-league-round-of-16-online",
  "title": "Borussia Dortmund vs . Chelsea , Champions League : Preview , team news , how to watch",
  "date": "20230215T054500Z",
  "domain": "weaintgotnohistory.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It may be awhile before Chelsea qualify for the Champions League by finishing in the top-four of the Premier League, so I guess we’re just going to have to go on and win it instead. Written in the stars, a la 2012!\nBorussia Dortmund vs. Chelsea, Champions League: Preview, team news, how to watch\nThat journey begins here, at Borussia Dortmund’s iconic Westfalenstadion and The Yellow Wall. It’s going to be absolutely electric, and of course to truly mirror the 2011-12 season, we would have to go on to lose this first leg very badly, 3-1, and then win the second leg in extra time. But let’s not get ahead of ourselves.\nAlso, let’s not lose this first leg.\nDate / Time: Wednesday, February 15, 2023, 20.00 GMT; 3pm EST; 1:30am IST (next day)\nVenue: Signal Iduna Park, Dortmund, Germany\nReferee: Jesús Gil Manzano (on pitch); Alejandro Hernández (VAR) — Manzano was in charge of our Round of 16 first leg last year, too, a 2-0 win over Lille.\nForecast: Cold\nOn TV: BT Sport 1 (UK); CBS, TUDN (USA); Sony TEN 2 (India); SuperSport Football Plus (NGA); elsewhere\nStreaming: BT Sport Live (UK); Paramount+, Univision Now (USA); Sony LIV (India); DStv Now (NGA)\nBorussia Dortmund team news: 2023 has been a very good year thus far for the black and yellow, who have six wins from six since the winter break. After an indifferent first half to the league campaign before the World Cup (8 wins, 6 losses from 15), they’ve now closed the gap to Bayern Munich to just three points, and alongside surprise package Union Berlin, are expected to duke it out for the title going forward.\nThat indifference had extended to their European campaign as well, as they just barely made it out of the group: 9 points was the lowest of any qualifier for the knockout round. However, they picked up 7 of those points at home, where they are now unbeaten since late August (7 wins, 3 draws in all competitions — the draws coming against Bayern, Manchester City, and Sevilla).\nFormer Chelsea transfer target Niklas Süle anchors a decent defense, while future Chelsea transfer target Jude Bellingham is of course the big starboy in midfield — though Julian Brandt and Gio Reyna are no slouches either. Up front, occasional Chelsea transfer target Youssoufa Moukoko is a big loss through injury, though Sébastian Haller recently returned to action after beating cancer (!) so compared to that, even beating Thiago Silva might be child’s play. Young forward Karim Adeyemi has not quite lived up to his next-Haaland billing, but former Manchester City youngster Jamie Bynoe-Gittens has two goals in his last five (substitute) appearances. And Marco Reus is still around, too!\nLeading it all is up-and-coming head coach Edin Terzić, whose name we might be hearing for many years to come. The 40-year-old, who was once the assistant to the permanently underrated Slaven Bilić at West Ham, is building quite a reputation for himself. Incidentally, Terzić and Graham Potter graduated from the same UEFA Pro Licence course in 2018 (the highest qualification in the game).\nView from the enemy: Fear The Wall\nChelsea team news: Raheem Sterling has not recovered from his knee knock and has thus stayed back in London alongside injured quartet N’Golo Kanté, Christian Pulisic, Édouard Mendy, and Armando Broja, as well as the ineligible quartet of Benoît Badiashile, Noni Madueke, David Datro Fofana, and former Dortmund star Pierre-Emerick Aubameyang. That Chelsea were still able to bring 23 players along (including Lewis Hall and third goalkeeper Lucas Bergström) speaks to the depth of the squad — especially now that Mateo Kovačić, Denis Zakaria, and Wesley Fofana are all back in contention as well.\nUnlike for the hosts, 2023 has not been overly great to us thus far (at least on the pitch) — though results of late have favored draws rather than defeats, so we’ve got that going for us. Off the pitch, 2023 has been nothing short of amazing, with a record-breaking January raising pulses and expectations. It’s gonna ah-may-zing when we find the secret sauce to make it all work. (Or not so secret.)\nPreviously Cooooooming up: This will be the first ever meeting between Chelsea and Borussia Dortmund. And this will be the soundtrack to our 2023 Champions League victory:",
  "word_count": 721,
  "scraped_at": "2026-02-14T01:59:41.711265",
  "_text_extracted": true
}