{
  "article_id": "8c2ee7ec1636",
  "url": "https://www.90min.com/posts/real-madrid-academy-rising-stars-la-fabrica-watch-out-for",
  "title": "Real Madrid academy : The rising stars from La Fabrica to watch out for",
  "date": "20240125T013000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid academy: The rising stars from La Fabrica to watch out for\n- Real Madrid have some incredibly talented youngsters in their ranks\n- Nico Paz and Vinicius Tobias have already made first-team appearances\n- La Fabrica continues to be a conveyor belt for high-potential wonderkids\nBarcelona may receive all the plaudits for the success of their La Masia academy setup, but Real Madrid are no strangers to developing exciting young talents.\nWhile Madrid have not been shy in splashing the cash on high-potential wonderkids rather than nurturing the talent they boast in La Fabrica, the likes of club legends Iker Casillas, Raul and Emiliano Butragueno have all come through the in-house youth system.\nThe capital side have plenty of promising prospects at present, some of whom have already made a significant impression in the senior squad. Hopefully, they get the chance to blossom further at the Santiago Bernabeu. Here are some of the most eye-catching talents currently playing in La Fabrica.\nNico Paz\nNico Paz is more or less a fully-fledged academy graduate at this moment in time, the Argentine having made eight appearances for Madrid this season. He even scored the winning goal in a Champions League group stage match against reigning Italian champions Napoli.\nThe tricky winger, who can play as an advanced midfielder, has also found himself as an unused substitute by Carlo Ancelotti plenty of times this term, but remains a regular for Real Madrid Castilla in the third tier as well. Currently being mentored by former La Fabrica star Raul with the second team, Paz has a bright future in the capital.\nIn his Primera Federacion games with Real Madrid Castilla, the 19-year-old, who is son of former Argentina international Pablo Paz, has scored seven goals in just 13 outings, playing in a multitude of roles under Raul.\n\"He is a player for the future of Real Madrid. He has all the quality that a Real Madrid player needs to have,\" said Ancelotti about Paz earlier this season.\nVinicius Tobias\nWhile not an organic product of La Fabrica, Vinicius Tobias is currently plying his trade with Real Madrid Castilla, often making the senior team squad due to Ancelotti's defensive injuries.\nThe Brazilian is technically not a Madrid player yet, only on loan at the Bernabeu from Shakhtar Donetsk. However, the Spanish giants have the option to sign him permanently for just shy of £13m this summer.\nWhile the young right-back will find it hard to become the best Vinicius at the club, Madrid look likely to sign him in the next transfer window given they worked hard to extend his loan deal for a second year last summer.\nTobias has made just one appearance for the senior side this term, doing so in the Copa del Rey victory against Arandina in the third round. The attacking full-back will look to muscle his way into Ancelotti's first-team plans in the near future should Madrid recruit him on a permanent basis.\nTheo Zidane\nThe son of former Real Madrid icon Zinedine Zidane, the young midfielder has huge shoes to fill - his two older brothers, Enzo and Luca, have already passed through in recent years without permanently making the grade. The likelihood is that he won't be able to replicate the brilliance of his father, but that doesn't mean he's a player worth disregarding.\nTheo Zidane will find it difficult to shake comparisons, however, especially given he has the ability to be a box-to-box, goalscoring central midfielder. The 21-year-old has regularly trained with Madrid's first-team squad, but it yet to make his senior debut despite infrequent matchday squad appearances.\nZidane has played 19 times for Real Madrid Castilla this term, the French Under-20 international producing two goals and three assists.\nAlvaro Rodriguez\nHaving been signed from Girona's youth setup at a very young age, Alvaro Rodriguez has sparkled for Real Madrid Castilla. The Uruguay Under-20 international has an eye for goal, netting five in the Primera Federacion this season so far.\nThe 6'3 forward's impressive performances earned him a spot In Madrid's senior squad for the victory over Arandina, albeit he only enjoyed a very small cameo in the closing minutes.\nRodriguez has established himself as a quick and powerful centre-forward, while he has also been used on the left-hand side of a front three. If he continues to hone his finishing skills under Raul's guidance, the sky is the limit for the 19-year-old.\nGonzalo Garcia\nHaving risen through the age levels in Madrid, Gonzalo Garcia has been rewarded for his impressive performances with first-team minutes this season. They haven't been regular but the Spaniard has made two La Liga appearances under Ancelotti.\nCapable of playing anywhere across the front line, the 19-year-old has also netted four goals for Real Madrid Castilla this campaign, as well as two strikes in the UEFA Youth League.\nGarcia is known for his tactical intelligence at such a young age and seemingly has a footballing brain capable of helping him flourish in Spanish football. He's been named nine separate times in Madrid's matchday squad this season and has clearly made his mark on Ancelotti.\nManuel Angel\nAn all-action central midfielder, Manuel Angel is yet to be handed his senior debut, the 19-year-old still fine-tuning his game with the second team. He has made 18 Primera Federacion appearances this term, managing two goals.\nAngel is an all-round threat in the engine room, showing good physicality, technical qualities and dribbling ability. The youngster is a clever footballer and can operate in a deep or advanced role in the centre of the pitch.\n\"Only time is keeping Manuel Angel away from the elites,\" said Under-19s coach Alvaro Arbeloa several months ago.",
  "word_count": 949,
  "scraped_at": "2026-02-14T02:10:42.034765",
  "_text_extracted": true
}