{
  "article_id": "8c3c6f630dad",
  "url": "https://www.liverpoolfc.com/news/it-means-everything-kostas-tsimikas-reaching-100-lfc-appearances",
  "title": "  It means everything  - Kostas Tsimikas on reaching 100 LFC appearances",
  "date": "20241231T131500Z",
  "domain": "liverpoolfc.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Reaction'It means everything' - Kostas Tsimikas on reaching 100 LFC appearances\nKostas Tsimikas described his immense pride at reaching the landmark of 100 Liverpool appearances on Sunday.\nThe Greece international was a second-half introduction from the bench at London Stadium as the Reds signed off their 2024 schedule with a comprehensive 5-0 victory over West Ham United in the Premier League.\nThe outing took Tsimikas to a century of games since he sealed a move to the club from Olympiacos back in the summer of 2020.\nAn Emirates FA Cup and two-time Carabao Cup winner with Liverpool so far, Tsimikas now wants to contribute to further successes.\n“It means everything,” the left-back told Liverpoolfc.com of his personal milestone. “It was a dream when I was a young kid to play in a big team.\n“When I came here I didn’t realise I could reach these numbers but I’m really glad. I’m more than glad, to be honest. I’m blessed from God because he gave me the power and no injuries, to achieve this number.\n“I’m really, really happy and really glad to be with these people here and with these players. I think we can achieve many, many things if we stick together and do exactly what we did until now.”\nHe added: “I’m really happy for my team to score five goals, obviously I got some minutes.\n“We have a long journey until the end of the league and we have to see game by game, just take the three points and to win as many games as possible.”\nArne Slot’s men end the calendar year with leads in both the Premier League and Champions League tables, and with a Carabao Cup semi-final against Tottenham Hotspur also forthcoming.\nSince the Dutchman’s appointment, Liverpool have won 23 games, drawn three and lost only once.\nAsked about his objectives heading in to 2025, Tsimikas said: “I’m 100 per cent sure I want to win everything. I think this team can win everything, so every competition ahead is clear for us: we have to win every single game we have ahead and [try] to win every competition.\n“We set our goals from the start of the season and the only thing we have to do is exactly that, to go out there and show to the world we are good players, we play incredible football and we win football matches.”\nTsimikas’ close friend Mohamed Salah sent more records tumbling with a goal and two assists during the win over the Hammers.\nThe No.11 became the first Liverpool player ever to reach 20 goals in eight consecutive seasons, and also scored and assisted in the same Premier League match for the eighth time in 2024-25 – a record for the division.\n“I see him more hungry for the Premier League and every competition,” said Tsimikas. “I think he wants to show to everybody that at this time we are now, he is the best football player in the world.\n“For me personally, he is. The things he does inside the pitch are incredible, the numbers he does every game, and especially on the training ground with all the work he puts in.\n“He deserves everything and I’m really happy for him.”",
  "word_count": 538,
  "scraped_at": "2026-02-14T02:08:26.306961",
  "_text_extracted": true
}