{
  "article_id": "8c688491bdef",
  "url": "https://www.ealingtimes.co.uk/news/24672632.dawson-hails-van-de-ven-one-premier-leagues-best/",
  "title": "Dawson hails Van de Ven as one of the Premier League best",
  "date": "20241023T143000Z",
  "domain": "ealingtimes.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Micky van de Ven is the one player Tottenham Hotspur cannot live without according to club legend Michael Dawson.\nVan de Ven has quickly established himself as a fan favourite in north London for his marauding runs from the back which have culminated in a couple of eye-catching assists against Everton and Manchester United this season.\nDawson believes the Dutch defender should be considered one of the Premier League’s best as the one irreplaceable star in Ange Postecoglou’s side.\n“It’s normally the forward that’s so valuable but the way Spurs play and the way the full-backs are so expansive, Micky is always on the half turn and ready to run in behind,” said Dawson, who was speaking at the Copa del Cure Leukaemia tournament at St George’s Park.\n“You can leave him one v one and I never liked to be in that position because I was never as quick as he was.\n“He can do that and that gives the attackers the opportunity to go forward. I think he’s one of the best in the league, right alongside Van Dijk, Saliba, Gabriel and Dias.\n“I think Ange is lucky he’s got Micky to play the way they do.”\nSpurs fans have also been excited by the emergence of Mikey Moore, with the 17-year-old considered one of the brightest young prospects in England.\nWhile Champions League qualification is the ultimate goal for Spurs fans, Dawson believes the Europa League offers the perfect breeding ground, with Moore expected to start Thursday’s clash with AZ Alkmaar as he did against Ferencváros.\n“Mikey is a great young talent and for him to get the opportunity late in the season last year was great and now we’re starting to see him a little bit more,” said Dawson.\n“Mikey has been great and it’s always good to see a player come through the ranks. You look at the guys who have come through at City, like Rico Lewis, Oscar Bobb and Phil Foden – I love seeing Pep do it.\n“When you’re a young lad at an academy you look at your pathway and you have to be special to get into the first team because it’s really hard but I really enjoy watching Mikey.\n“He’s at a football club which isn’t easy to break through at because of the money that’s spent, so you have to be a special talent to do it.\n“Mikey and Will (Lankshear) will be patient and get game time and when they do, my advice is just keep expressing yourselves.”\nSpurs bounced back to form with an emphatic 4-1 win over West Ham on Saturday following the disastrous defeat to Brighton before the international break.\nSome have agued that Spurs have struggled for consistency but Dawson feels they have been unlucky to have not picked up more points.\nDiscussing his former club’s start to the season, Dawson said: “I wouldn’t say consistency has been an issue, I would say it’s results.\n“The performances have been good but they haven’t got the results they deserve, all the way back to the first game of the season against Leicester.\n“Ange will be hugely disappointed that so early in the season there have been games like that where they could and should have won and they should have a lot more points than they’ve got.”\nCure Leukaemia is a UK-based blood cancer charity founded in 2003, working to accelerate the process of bringing life-saving treatments to leukaemia patients by funding specialist Research Nurses across the country.",
  "word_count": 584,
  "scraped_at": "2026-02-14T01:51:57.640932",
  "_text_extracted": true
}