{
  "article_id": "8c68d108cb7a",
  "url": "https://www.caughtoffside.com/2024/04/13/eddie-howe-lauds-tottenham-player/",
  "title": "Newcastle news : Eddie Howe lauds  outstanding  £40m Tottenham player",
  "date": "20240413T113000Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "St. James’ Park should be full to bursting for the visit of Tottenham on Saturday lunchtime, and Eddie Howe will be paying keen attention to one player who was previously linked to Newcastle.\nBoth teams love to play front foot, attacking football, and to that end we should see a game that is guaranteed goals.\nGiven the wishy-washy form of both clubs, it’s hard to pick a winner at this stage too.\nBoth clubs need three points for different reasons, with Spurs chasing a finish in the Champions League spots and the Magpies just looking to get into any European competition at this stage.\nEddie Howe is wary of Tottenham ace\nAt present, Tottenham find themselves in fourth, level on points with Aston Villa in fifth but with a game in hand.\nGiven that Man City in third are 10 points ahead, and Man United in sixth are 11 points behind, the final Champions League place looks to be a straight shoot-out between Spurs and Villa.\nNewcastle are in eighth place and are only two points behind Man United in sixth, so they do still have something to fight for.\nSpurs’ James Maddison will need to be kept quiet, however, if Howe is to be the happier of the two managers come full-time on Saturday afternoon.\n“I don’t think he (Maddison) was ever close in the literal sense of coming here,” Howe said in his pre-match press conference, attended by CaughtOffside representatives.\n“But he’s a player that I’ve admired for many, many years. I think he’s outstanding. I watched him play for Coventry many years ago and liked him straight away.\n“No, he’s never came close to signing for me. Regardless of that, I think he is an outstanding talent and this year he has really excelled in Ange’s style. He is certainly a player we are going to have to keep quiet.”\nAnge Postecoglou does have other players that can do damage to the home side, though there’s little doubt that it’s £40m ace (Sky Sports) Maddison that’s the fulcrum.\nGiven half the chance he will set the tempo of the game and perhaps even write the narrative, but Howe simply can’t allow that to happen if he wants his team to emerge victorious on the day.\nA classic Premier League match up awaits and with lots at stake, expect both teams to be going at it for the entire 90 minutes.",
  "word_count": 403,
  "scraped_at": "2026-02-14T02:25:26.763263",
  "_text_extracted": true
}