{
  "article_id": "8c73d2d983eb",
  "url": "https://toffeeweb.com/season/25-26/comment/fanscomment/46874.html",
  "title": "Manager watch : 2025",
  "date": "20251103T011500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Over the course of the current Premier League season, David Moyes will probably deliver what we all seemed to expect: an 8th- to 12th-place finish. But this season so far is a reminder of a few things which are frustrating about our sensible but boring manager.\nHe’s not especially imaginative.\nEven noting the limitations of our squad, we see no variation in formation to give us more pace or width. And for a tall team, we don’t seem to be troubling other sides with our set pieces.\nHe’s not especially brave.\nI think there’s a bit of myth and legend at play with Moyes and youth – but other managers would, I expect, have been braver in their use of Dibling in particular. And we’ve also seen some frustratingly timid performances, too. He’s also timid with referees and too accepting of decisions against.\nHe not especially positive.\nI know I can come across as negative. But then I’m not in charge. You kind of want the guy in charge to be like Russell Crowe in Gladiator. Moyes just loves to put a lid on expectations and get his excuses in early. Not the guy you follow into battle.\nBut, he’s a sensible old pro too and, for the time being, I expect that TFG are fairly unperturbed,\nStill, just for fun – what are the options?\nProbably not...\nI’ll start with two managers who are just about possible but only if we promise some serious spending.\nIraola: currently doing well with Bournemouth.\nGlasner: currently doing well with Crystal Palace.\nIn the case of both managers, what is particularly impressive is how they have coped after losing really important players. Iraola has had to rebuild an excellent defence after losing Kerzez, Huijsen and Zabarnyi to Liverpool, Real Madrid and PSG, respectively.\nGlasner has to manage without Eze.\nBoth clubs recruit very well (and this recruitment is not overseen by either manager) and that has helped, but still – in the case of all of these players, it was big shoes to fill. However, both managers have performed strongly enough to fancy their chances of a Champions League appointment – not necessarily with a Premier League club either. And the Saudi League also offers big bucks and an increasingly high standard to work with.\nThere will be competition for these two – as there will be for the third “probably not”.\nJaissle: the charismatic 37-year-old is currently earning absolutely shit loads of money for Al-Ahli out in Saudi. He’s also overseeing some decent names from recent Champions League history in Mendy, Demiral, Ibanez, Kessie, Millot, Mahrez and Galeno – as well as some other quality non-Saudi players in Dams, Goncalves and Ivan Toney. They are a good side in a fast-improving league – and would give us a run for our money certainly. Could we get him? Not sure. I expect he’d be looking for a bigger, more immediate Champions League opportunity.\nOut of contract\nMotta: serial winner as a player and did well at Spezia and then Bologna as a manager, adapting his tactical approach to the quality of players available. Famously claimed to play 2-7-2 – but was talking about the formation as a horizontal (wing to wing) arrangement rather than vertical (goal to goal). The actual formation switches between 4-2-3-1 and 4-3-3. Didn’t fare well at Juve but still a good manager. He’s one of my three favourite options after Iraola and Glasner.\nTerzic: strangely overlooked since getting Dortmund to a Champions League final and now out of work for the last 10 months. Talks of it being a sabbatical in which he’s improved his skillset. Highly regarded as a coach and a fluent English speaker after his time as assistant coach with Bilic at West Ham. He’d be a big risk – and I think we’re better than this now.\nTen Hag: built a couple of really good sides at Ajax before leaving for Man Utd. Was really crap at Man Utd. Hired by Leverkusen to replace Madrid-bound Alonso this summer. Was crap and got sacked. Would be an unlikely choice for us.\nOn the up\nHoeness: the Stuttgart manager has done an exceptional job after good grounding with Leipzig and Hoffenheim. He’s benefited (as many better performing managers do) from a very well organised player recruitment and development structure. But he’s brought trophies and Champions League to a club that was struggling recently. He would be an ambitious appointment. Another one of my three favourite options.\nMcKenna: reminds me of a young Brendan Rodgers or Roberto Martinez. He can organise a mediocre bunch into a footballing side and really develop players too. He also plays football as though he’s in charge of a big club – which means dominating possession and committing players forward in attack (at the expense of defence).\nDespite having a very good group of players available in his Premier League season with Ipswich, they never looked like staying up. And having lost Delap, Hutchinson and Enciso, he’s not managed to maintain Ipswich’s form into the new season. Is he a flash in the pan? Not sure. I still (being all romantic about things) think he might be just what we need. Seems to have turned down Celtic, presumably because he reckons he could get a better Premier League job. The last of my three favourite options.\nHayen: current Club Brugge coach, linked with Celtic. They have a very good recruitment and development arrangement and he’s overseen a well assembled, talented squad very well – playing fast, aggressive front-foot football. Randomly had a coaching spell with Haverfordwest in the Welsh League. Would be a brave choice but has some real potential.\nAndrews: he’s started very well at Brentford after what looked like a hospital pass of a job. But having lost Mbuemo, Wissa and Norgaard, he’s managed to keep them going. The style and tactics are much as they were under Frank. I expect he’s benefiting from Frank’s influence and the brilliant management of the club as a whole, but still a good performance. This would be such an uninspiring appointment though.\nReader Comments (56)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 02/11/2025 at 20:48:52\nAny chance of providing their first names?\n2 Posted 02/11/2025 at 20:59:15\nPersonally, I think it's worth the risk of going all out for an Iriaola type but I am not at all sure TFG would jump any time soon.\n3 Posted 02/11/2025 at 21:38:29\nThey're going to bigger and better things.\n4 Posted 02/11/2025 at 21:54:14\nOn the managers, my only input?\nNot Andrews, with that hair of his Barry Bouffant job.\n5 Posted 02/11/2025 at 22:01:30\nI think there are few genuine managers that have the ability to succeed at Everton, but those two I think have the ability to get through the squad overhaul stage and create something longer term.\nInstead, we went down the Carlo route.\n6 Posted 02/11/2025 at 22:05:27\nSurely Everton are bigger and better on the grand scale of things than Bournemouth or Palace?\nI understand the “reality” view but FFS PH, you're not coming across as remotely positive as far as Everton are concerned.\nChin up lad, there's worse clubs than ours to follow.\nUTFT and KAGSEFOOTELBOs\n7 Posted 02/11/2025 at 22:13:53\nIraola should be the Number 1 target. We're a massive step up from Bournemouth in all aspects but recent short term form. With our new ground and resources he'd be a fool to turn the opportunity down.\nWe're the best prospect outside the top six and an exciting challenge for any young coach with ambition.\n8 Posted 02/11/2025 at 22:18:05\n9 Posted 03/11/2025 at 07:23:58\nIrola I can see going back to Spain to manage a big club over there. Glasner will also move onto a bigger and better club. Just not us.\n10 Posted 03/11/2025 at 10:50:18\nIn terms of new potential managers I also like Hoeness and agree that Iraola and Glasner will move to bigger clubs.\nVery near the top of my list is Adi Hutter, who I think was pretty unlucky to lose the Monaco job and is a great coach who has done well at a number of teams in different countries.\nMckenna is an interesting option but have been slightly concerned by Ipswich underperforming this year (despite losing players). Terzic and especially Motta could be good options.\nWhat about Fabregas? Early days for him but doing a great job at Como who look really exciting. Well known in the Premier League and the sort of manager who could attract some talented young players who grew up watching him.\nI remember a few years back a lot of really wanting Christophe Galtier, I wonder if he may get bored of his Saudi holiday within the next year or two?\nThat chap at Coventry is doing a fine job too!\n11 Posted 03/11/2025 at 11:33:32\n12 Posted 03/11/2025 at 12:40:31\nSam # I ignored Fabregas as his profile is such that his next step will probably be a Champions League heavyweight I expect. He could be the next Barca or PSG manager.\nWith all of these the key things for the mos heavily courted candidates are:\n1. Is there a Champions League level budget for recruitment?\n2. Is there a sophisticated player recruitment and development programme in place?\nSince at least 7 other Premier Leagur clubs do have this, we will need it too to stand any chance.\n13 Posted 03/11/2025 at 12:56:04\nHe was sacked by Hull due to being seen as too defensive so he went to Strasbourg and has created a really young exciting vibrant team.\nI think he would be perfect for a lot of the young players who have been marginalised here and would be a great fit for TFG.\nMy worry is that these owners tend to go with experienced managers so I don't know how likely this would be. I could see them trying for Sarri or Conte though with Gasperini doing well they might want us to play progressive football.\n14 Posted 03/11/2025 at 13:24:21\n15 Posted 03/11/2025 at 13:48:47\nAnother young manager under the radar Brian Barry Murphy, worked at City Academy under Pep, who seemingly very impressed with him.\nIf tonight doesn't go well against Sunderland, the pressure will be on Moyes?\n16 Posted 03/11/2025 at 14:22:03\nI'm always wary of this 'nice style' of football mantra. Always implies letting goals in, to me!\n17 Posted 03/11/2025 at 14:25:15\nIs he going to get us better results against the same opposition? Marginal. They've got 11 points from 7 teams we've also played this season and we got 10 points against them.\nThey started off last season well and finished 9th. He won't win us anything anymore than Moyes will.\nWhat is the point in replacing Moyes, unless it's for someone that can win league titles and cups with us?\n18 Posted 03/11/2025 at 14:43:24\nRosenoir is doing a great job. Roberto de Zebri for me, I'm sure he would leave Marseille and a move back to the Premier League bring Mason Greenwood with him — we can definitely pay him more than he'd be on at Marseille\nAfter all, we paid Big Sam more than Zidane when he was manager of Real Madrid... mind-boggling!!\n19 Posted 03/11/2025 at 14:48:30\n(My optimism for the season has gone tbh. I thought we could get into the Top 10 but I fear a 14th-ish place finish.)\nThere simply seems to be a lack of goals across the whole team.\n20 Posted 03/11/2025 at 15:00:52\nWe could hire the love child of Alex Ferguson and Jose Mourinho and achieve bugger all unless we start spending real money.\n21 Posted 03/11/2025 at 16:20:40\nCity, United, Arsenal and the RS all have revenues over $600 million.\nWe're under $200 million with the likes of Palace, Fulham and Wolves.\nThat's what TFG has to emphasize -- jacking up revenues. Not just ticket sales at HD, but commercial revenue from gear sales, and events, and worldwide promotions. (And of course some TV revenues from Europe would be nice.)\nI'm convinced Friedkin will spend on this club, for both new players and a new manager -- when he can.\n22 Posted 03/11/2025 at 16:27:25\nWe will soon operate like a normal top 10 premier league club which means spending far, far in excess even of what we spent this summer.\nThis is good news because we’ve never experienced this as a Premier League club. We have always been either (a) poor (b) run by idiots or very often (c) both.\nBut what I mean is that Iraola and others haven’t failed to win silverware because of being mediocre. Far from it. Someone like Iraola and a few others on my list (esp Hoeness, Motta and McKenna) look exactly the sort of people who could kick on with a good budget\n23 Posted 03/11/2025 at 17:54:57\nOf the teams above us in just expenditure Forest lost Elanga, Newcastle lost Isak Bournemouth lost half of their first team, Wolves lost Cunha.\nMaybe if we had sold Pickford and Branthwaite we could have spent close to £300m. Does that mean you are happy because we are one of the big spenders?\nAston Villa were the lowest spenders and had a negative net by the way\n24 Posted 03/11/2025 at 18:18:57\n25 Posted 03/11/2025 at 18:21:02\nThat’s not very much at all in the context of:\n- the best part of 5 years’ extreme austerity that places our net spend well adrift of all other Premier League clubs (and some Championship clubs) in that period; and\n- being left with only about 12 players in contract at the end of June.\nThe net spend this summer only looked more respectable because we had nothing much to sell. Free transfers, Maupay etc…\nSo all in all our spending is not that of a top 10 club. And it’s miles off the clubs that will dominate this season. The wage bill is the same. Not because TFG are stingy either - but because of financial constraints which will take a while to sort out.\nAnyway, you’ve had your say on this now; I’ve had mine. To avoid boring other posters (again) let’s leave it at that. The article is about managers who can take us forward post Moyes once we are a properly resourced club.\n26 Posted 03/11/2025 at 18:24:32\nRobert don't move the goalposts. We are all aware of the past. Your observations this summer are blatantly wrong. Keeping all our major players is a sign of a club with ambition\n27 Posted 03/11/2025 at 18:27:11\nVilla already had a good team. We were 13th last season and spent the 13th highest amount of money in the summer. You cant expect much progress, particularly when so much was spent on potential for the future.\nWe also made a decent attacking midfielder's loan permanent and then spent twice as much on a player that keeps getting played ahead of him. We also brought in a player that caused our best attacker last season to have switch sides to accommodate him.\nTerrible window. Club's still clearly badly run and it cant all be put on Moyes. Although some of it can be.\n28 Posted 03/11/2025 at 18:27:21\n29 Posted 03/11/2025 at 18:42:12\nThe deficiencies in this squad are due to the manager but I like the signings of Barry, Rohl and especially Dibling. We will look back very favourably on this window in my opinion and will build on it next summer\nNet spend is important in the context of Robert's point about TFG. They kept our best players and spent what they could.\n30 Posted 03/11/2025 at 18:56:40\n31 Posted 03/11/2025 at 18:57:04\nThis is no longer a short-term strategy. There's some risk in signing younger players but, hopefully, there's a point where we see the benefit of it on the pitch or in what we recoup for players. Whether they fail or succeed to various degrees.\nTalk of the next manager is fair enough. Moyes's appointment should have had succession planning baked into it. Moyes isn't here to make us challengers for anything. If you were after that you wouldn't pick Moyes. We needed stability and someone who could be sensible while we turn the ship around. I can't imagine many managers who are more credentialed for that role.\nI see progress. Maybe even sustainable progress.\nIn the meantime it's going to be a bit of a slog. We'll have some good games and then be frustrated when we don't kick on from there. Midtable isn't much fun. Buckle up.\n32 Posted 03/11/2025 at 22:31:03\n\"I like the signings of Barry, Rohl and especially Dibling. We will look back very favourably on this window in my opinion and will build on it next summer.\"\nYou're the only one who does. Clearly Moyes doesn't -- based upon tonight -- and he signed them. Or someone did and he just went along with it.\n33 Posted 04/11/2025 at 02:06:42\n34 Posted 04/11/2025 at 13:47:01\nMark Hughes = David Moyes (18 months)\nRoberto Mancini = Eddie Howe (3.5 years)\nManuel Pelligrini = bring back Don Carlo (3 years).\nPep Guardiola = Xabi Alonso (9 years).\nSorted.\nBased on these timeline Davie gets the boot in May 2026 and Eddie Howe joins after the sack from Newcastle.\n35 Posted 05/11/2025 at 09:43:08\nHe was TFG's go-to man at Roma, wasn't he?\n36 Posted 05/11/2025 at 15:53:05\nWhat thoughts now that he's a free man? Straight swap with Moyes going the other way?\n37 Posted 05/11/2025 at 19:33:33\nI expect there is some chance of Rodgers but maybe wait until Christmas to see how our form is. He is a bit unlucky to have been overlooked for the Man Utd and Chelsea jobs previously when doing so well with Leicester City. That is a while ago now though.\nHe would certainly attempt to play more progressive football than Moyes and has a bit of big club swagger to him.\nI guess the downsides are that he's another ex-Red and comes across like a wanker. But maybe he's the wanker we've been waiting for?\nAnd why would TFG go to the expense too?\n38 Posted 05/11/2025 at 20:54:02\nDon't think there's any hope of Iraola, but I am astonished that anyone would say they didn't want him. Especially when giving the reason that he's no more likely to win a cup than Moyes. Truly bizarre.\nHighly likely cup winners ain't coming to us any time soon. Iraola is way head of Moyes in the modern game.\n39 Posted 05/11/2025 at 21:25:18\nI wonder if he'd be interested in coming to us? Might be worth a punt.\n40 Posted 05/11/2025 at 21:45:24\nI'm really pleased he's doing well, Everton unfortunately was the wrong time for him.\n41 Posted 05/11/2025 at 22:49:47\nA romantic choice would be Don Carlo Ancelotti but I hear he's loving it out on the Copacabana, even though it's no comparison to the sand dunes at Ainsdale.\n42 Posted 06/11/2025 at 00:44:43\nMason Greenwood has never been convicted of a crime; hopefully his solicitor is not reading your comment, lol 😂.\nMason knows how to put his onions in the bag though: 28 in 44 at Marseille from the right wing and he's only 11 months older than Barry. He will definitely be back in the Premier League -- why not with us?\n43 Posted 06/11/2025 at 01:01:38\nHe should be free after the World Cup.\n44 Posted 06/11/2025 at 02:20:02\n45 Posted 06/11/2025 at 05:25:11\nWe will be told by Sam and Robert that we cannot attract any of them, but that is simply not the case. I think they are still working through their post-rationalisation of why Koeman and Ancelotti took the job. One went on to manage Barcelona and the other Real Madrid.\nMoney talks when it comes to personal compensation, we are a bigger club than Iraola, Glasner and Hurtzler are currently managing. It would then be up to TFG to prove their ambition (if they have it).\nRodgers is a redshite wanker and we have tried that before. Bielsa is becoming as standard as Riquelme in that he is always cited and never appears. Nor should he.\n46 Posted 06/11/2025 at 06:47:57\nI loved the way Dortmund played under him.\n47 Posted 06/11/2025 at 07:15:09\nNot sure what Hurzeler has done to merit a mention, though, to be honest. They spent about £250M on De Zerbi's good team last season -- and no material improvement.\nI think lots of fans fall into the trap of thinking we are a bigger club than the likes of Bournemouth etc -- therefore, these managers will do even better with us.\nAs ever, if you look more deeply at spending patterns, wages, and quality of players etc, it's not that simple.\n48 Posted 06/11/2025 at 08:24:45\nI absolutely think we are a bigger club than those “etc” in all aspects but recent points and performances.\nYou may disagree but surely the draw of the new stadium and obvious ambition and potential of Everton should be a massive incentive for any young ambitious manager to come to us and drive “the project”?\nWith all due respect to the “Bournemouths etc” the best they will ever achieve is top half prem with occasional European qualifications. Several of them, including Bournemouth, will almost inevitably drop back down a division before too long.\nEverton, even with our obvious flaws and frailties have the potential for so much more and are building towards that.\nUnless Iraola has already been approached by the actual (current) big boys I firmly believe he would jump at the chance of joining us if offered the job.\n49 Posted 06/11/2025 at 08:25:50\n100% correct Robert. We've had that many managers over the past decade that I'm not sure getting a new one will change things. There are so many variable factors involved in improving and ultimately success.\nMost of us tend to reduce it all down to get rid of the manager, but its much more complex. It's even more difficult when managers (and players) are judged and written off after about half a dozen games.\nWe've survived in the PL all these years by essentially having an attritional and defensive model. Changing this, changing the mindset, changing the expectations, changing the culture is a massive task.\nIt also comes with the added jeopardy of things going seriously wrong - its not easy to make these changes. Clubs have tried and been relegated. That's the risk though, and its one we ultimately have to take.\n50 Posted 06/11/2025 at 08:34:12\nLots of young players with energy all over the park especially upfront.\nThat is the type of football I want to watch. I am fed up of the turgid survival stuff.\nWhen tfg decide to change manager the Brugge manager or style is what I would want for us.\nI don't know enough about the manager, he has had quite a few clubs for a young man. So is the style his or the culture within club Brugge?. Whatever it is I would quite happily pay to watch it.\n51 Posted 06/11/2025 at 08:40:15\n52 Posted 06/11/2025 at 09:31:46\nIt is entirely possible that Hayen at Brugge is just an ordinary manager but the beneficiary of good player recruitment and development system (as was Potter at Brighton).\nFor the club to meet its ambitions, it needs this sorting out at least as much as a new manager.\n53 Posted 06/11/2025 at 09:41:49\n54 Posted 06/11/2025 at 10:00:05\n55 Posted 06/11/2025 at 10:05:06\nWe did manage somehow to convince one of the Worlds best managers to sign for us and he showed what a class act he was by having the 3rd best win rate of any Everton manager, with a real rag tag of a team. But if you go back to T/W when he was manager he was still getting slaughtered over style of play and team selection.\nSo while its fun to speculate unless we can somehow get access to the same wealth as the top 6 then a top 10 is the best we can hope for.\n56 Posted 07/11/2025 at 15:37:33\nHe'll be available after the World Cup.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 4136,
  "scraped_at": "2026-02-14T01:55:28.738008",
  "_text_extracted": true
}