{
  "article_id": "8c8e04a05e8d",
  "url": "https://news.yahoo.com/uefa-champions-league-changes-111608627.html",
  "title": "What are Uefa new Champions League changes ? ",
  "date": "20230515T120000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "What are Uefa’s new Champions League changes?\nUefa’s executive committee confirmed last year the most significant changes to the Champions League in a generation.\nDays before the failed European Super League plot was launched back in 2021, Uefa announced reforms to the Champions League had received unanimous backing from the European Club Association and Uefa Club Competitions Committee.\nIt confirmed plans to change the format of European football’s top club competition from 2024, giving the tournament its first new look in 20 years. The proposals were not met with the same level of backlash that greeted the Super League plans but have still been criticised by leading fans’ groups, including the Football Supporters’ Association [FSA].\n“We are united in opposition to proposals to reform the Champions League that are a back door attempt at a return to the discredited idea of a European Super League,” read a statement from the FSA’s Premier League Network.\nBut what are the changes, and how will the Champions League look from 2024 now the plans have been voted through? Here’s everything you need to know.\nWhat would the new Champions League look like?\nSince 2003, the Champions League has been a 32-team competition with a single group-stage phase followed by a knockout phase. The 32 teams, seeded according to league position and Uefa coefficient, have been split into eight groups of four, with the top two teams progressing to the last-16 after six rounds of matches in a round-robin format with both home and away matches. That has then been followed by three two-legged rounds, the last-16, quarter-finals and semi-finals, with matches played home and away, before the final at a neutral venue.\nFrom 2024, the group stage will look completely different.\nThere are two main changes: four additional teams will be added to take the number of clubs up to 36, and a single league format will be used. The league phase will determine an overall ranking - from 1st to 36th, with three points for a win and one for a draw as usual. The top eight teams will advance to the last 16, with the 16 teams finishing between ninth and 24th entering the play-off round over two legs, with a victory securing passage to the last 16. Teams who finish 25th or below will be eliminated and will not drop down to the Europa League.\nHow will the league format work?\nUefa and the European Club Association reached agreement on this last year. The number of fixtures is set to increase from the current six to eight, after Uefa compromised on its original plan of ten.\nFixtures would be determined using a ‘Swiss-style’ seeding system. All eight matches will be played against different teams, with four at home and four away, and organised by seeding. All the results would contribute to the overall league ranking.\nWill it change the knockout phase?\nApart from the play-off round, the knockout phase is set to be the same from the last 16 stage. There have been reports, however, that Uefa will discuss the idea of scrapping two-legged semi-finals in favour of a ‘final four’ format played across a week in one European city.\nWill some clubs be able to qualify based on past performance?\nNo, this has been scrapped by Uefa, after the plans were met with criticism and would have opened the door to there being a safety net for the biggest clubs and widening the inequalities in European football to an even greater extent.\nInstead, Uefa will award two extra places to the countries who collectively performed best in Europe in the previous season. If applied to next season that would mean England gaining an extra spot, along with the Netherlands.\nThis would mean the Premier League would have five Champions League teams for that season. Unlike the coefficient plans, it would mean there would be no barrier to certain clubs receiving an additional spot.\nHow will the other two extra Champions League spots be allocated?\nAccording to Uefa, the other two spots will be allocated according to this criteria:\nSlot one: One of the additional places will go to the club ranked third in the championship of the association in fifth position in the Uefa national association ranking.\nSlot two: Another will be awarded to a domestic champion by extending from four to five the number of clubs qualifying via the so-called ‘Champions Path’.",
  "word_count": 734,
  "scraped_at": "2026-02-14T02:19:46.302218",
  "_text_extracted": true
}