{
  "article_id": "8c96b8d69a60",
  "url": "https://metro.co.uk/2024/05/01/arsenal-made-transfer-mistake-charismatic-player-says-ex-star-20756238/",
  "title": "Arsenal made transfer mistake over  charismatic  player , says ex - star",
  "date": "20240501T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal made a transfer mistake in offloading Granit Xhaka to Bayer Leverkusen, according to former Gunners centre-back Philippe Senderos.\nSenderos, who played for Arsenal between 2003 and 2010, was disappointed to see Xhaka depart the Emirates last summer ahead of the 2023-24 campaign.\nXhaka played a key role in Arsenal’s title challenge in 2022-23 and in his first season at Leverkusen, he helped Xabi Alonso’s side clinch the Bundesliga trophy.\n‘You always want this type of player to stay in your team because he’s such a leader and such a charismatic person,’ Senderos told OLBG.\n‘You want these types of people when things get tough. But it’s been an amazing thing for him in his career to move, to have a new manager, to have a new team and to be so successful that they have been this year.\n‘So I’m very happy for him personally. But as an Arsenal fan, it’s always good to keep those type of players.\n‘You always want quality players in the team, Granit Xhaka might not have been missed from the offensive point of view but he was great for Arsenal. I think everyone respected how he handled himself when he left.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nArsenal still hold a very special place in Xhaka’s heart and he sent a message to the club after they crashed out of the Champions League to Bayern Munich.\n‘I think they went 10 or 11 games unbeaten, you lose one game it doesn’t mean you’ve lost everything already,’ Xhaka said.\n‘Still a big chance to get the Premier League [title] and I wish them, for sure, all the best because I’m still supporting them, still in contact with the staff and players, and still watching the games.\nMore Trending\n‘I think the team and the staff and the football club deserve to win trophies.\n‘They are very close this year as well, like they were last year, but in football the small details are the difference, and I hope that they can do it this year.’\nXhaka made a total of 297 appearances for Arsenal, producing 23 goals and 29 assists.\nMORE: Ollie Watkins reveals secret chat with Arsenal star amid transfer talk\nMORE: Michail Antonio suggests West Ham can help Arsenal win Premier League\nMORE: Javier Zanetti hails £51m Arsenal transfer target as a ‘great champion’",
  "word_count": 440,
  "scraped_at": "2026-02-14T01:56:51.537167",
  "_text_extracted": true
}