{
  "article_id": "8c9732bf1520",
  "url": "https://punchng.com/psg-vow-to-fight-back-after-champions-league-defeat-against-barca/",
  "title": "PSG vow fight back after Champions League defeat against Barca",
  "date": "20240411T100000Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Paris Saint-Germain manager Luis Enrique said he is still confident his team can overcome a 2-3 home loss to FC Barcelona in their Champions League quarterfinal.\nEnrique hopes PSG can shine against the Spanish side next week to progress.\nStill looking for their first Champions League crown, PSG gave up a 2-1 lead late in the second half on Wednesday against an FC Barcelona side that made the most of the chances they had.\nThe result meant Barcelona earned a narrow advantage for the return leg in Spain.\n“It is clear that all defeats hurt and annoy, but I believe we played a good game against a very strong team,” Luis Enrique said in a press conference on Wednesday.\n“We are only going to change the things that didn’t work; we always have to appreciate what a match of this magnitude means.\n“We’re going to Barcelona with a lot of desire. It’s a positive point of view to think that we can win there. It’s going to be a final for us. I’m confident in my team.”\nLuis Enrique refused to comment on Kylian Mbappe’s performance, as the France captain was shackled by Barcelona’s defence and had little impact on the game.\nThe Spanish manager, who won the treble with Barcelona in 2015, said his side deserved to win and that Barca were not necessarily favourites even with a win in hand and the home-field advantage.\n“We are going to go to Barcelona to fight a war,” he said.\n“I never see the opposition as favourites, whoever they are. In top-level competition, that’s how I see it. And I will continue to believe that we will go to Barcelona to win the game.\n“I repeat. We could have won this game. (Football) is about small details and let’s hope that the small details go our way in the second leg.”\nReuters/NAN",
  "word_count": 311,
  "scraped_at": "2026-02-14T02:25:26.766192",
  "_text_extracted": true
}