{
  "article_id": "8cbd1b797553",
  "url": "https://punchng.com/bat-vs-artiku-the-final-game-of-crooks/",
  "title": "Bat Vs Artiku : The final game of crooks",
  "date": "20230224T034500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tomorrow is D-Day. The belly of the sky is heavy but no one knows what it will birth. The sky rumbles in labour pain.\nThe water has broken. But no meteorologist is ready to put their certificate on the line and make a forecast.\nThe sky booms in thunder and lightning, the wind whistles in whispers — twisting trees, bending branches, uprooting roots. Nightfall.\nDaybreak. Welcome to the Estadio De Nigerianna, where the Champions League Final between the All Progressives Criminals FC and Peoples Democratic Plunderers FC is about to get underway. In goal for APC FC is the giANT, HeL Roofai (1); Keredolu (2), Massari (3), Zuluum (4), Gandollar (5), Jagba-Jagba-Biamila (6), Fasola (7), Sanwo-Bola (8), Shetty Ma (9), Bat (10, Captain), Fayemi (11). Substitutes: Amosu, Hope Uzo, Kalu, Fayoshe, Bello, Eleyi, Abdulrasaki, Wike(d), S. Makinde. Coach: Buharry.\nIn goal for PDP FC is Man-Mountain Ayim (1), Mark (2), Obaseky (3), Ayu (4), Ugwuanyi (5), Udom (6), Masked player (7), Tambuwa (8), Okowah (9), Artikú (10, Captain), Saraki (11). Substitutes: Fintiiri, Dickson, Diri, Reno, Adeleke, Dino. Coach: Buharry. Injuries: Ekeremadu is being treated abroad.\nThe 120,000 capacity Estadio De Nigeriana is filled to the brim. Renowned football commentators, Martin Tyler, Eseoghene Edafe and Peter Drury, are running commentary. Drury, it was, whose immortal description of Kim Aguero’s last-kick goal against Queens Park Rangers in 2012 EPL finale goes thus, “Aguero, with 90 seconds remaining…has won the English Premier League for Manchester City!!! Hollywood, make this movie!”\nToday, Drury, in his silky voice, makes some pre-match remarks, describing the mood in the country, Naijeria.\nDrury: Welcome to Naijeria, Africa’s giant without might, ruled by termites devouring widows’ mites…\nTyler: What’s sauce for the goose should be sauce for the gander, but not in Naijeria. All animals aren’t equal. Some steal billions and get medallions, some steal kobo and get koboko, life isn’t fair here; the rich don’t cry here, it’s only the poor that gnash.\nEdafe: It’s my country, my fatherland, Nigeria! Don’t cry for me, Argentina! I see hope, I see tomorrow, I see light…\nDrury: Without necessarily dabbling in local politics, Edafe, may I quickly have your word on the Nollywood actress, Oluwadarasimi Omoseyin, who was arrested for spraying naira. But naira was sprayed during the wedding of the President’s children.\nTyler: Before Edafe makes his pronouncement on the issue, let me quickly say this: The ICPC and the EFCC should cover their faces in shame. For keeping silent, Nollywood should bury its head in shame. And Naijerians kept quiet?! I understand Nollywood actors and actresses are queuing behind rogue politicians for perks.\nI’m not absolving Omoseyin, but the law should be for everyone.\nEdafe: One even went naked on a beach, praying for the success of a notable politician.\nDrury: Wow! Naked? Was that a male actor swinging a pair of balls or a female with a pussycat?\n(Laughter)\nEdafe: Gentlemen, please, let’s go back to the job at hand. The sight of the male actor was terrible, though. And the police didn’t quiz him.\nTyler: The two teams are yet to file out. This Champions League comes up once in every four years. It’s a winner-takes-all finale. We’re looking at the otential champions of the 2023 season. Will it be PDP or APC?\nEdafe: One of the two other teams, Labour FC, has defeated New Naijeria Peoples Party FC in the third place match.\nTyler: Can I have your views on the captains of the four teams, gentlemen?\nDrury: The four are compass points, each pointing towards its own region. They shift with the wind of time, religion, ethnicity and nepotism. They are all alike– lying, manipulative and power hungry, without much difference.\nTyler: But I like OB for his style, belief and dynamism. He hadn’t much time on his hands to prepare for this tournament, otherwise, his team would have qualified for the final and put up a good show. Of the four teams, Labour won more fans this season. Labour FC has petitioned the FA, alleging cheating in its matches. The petition isn’t decided yet.\nEdafe: And here they come; the greatest football showpiece of the season is here, I can see Bat and Artiku leading out their teams. The referee, Mamood Yakub, leads by the hand a little girl whose father, a senatorial candidate in Enugu, was shot dead a day before. The little girl picks the match ball.\nTyler: Though limping, Bat is confident, beaming with smiles as he exchanges pleasantries with his formidable foe, Artikú, who looks solid. Time for the anthems of the two teams. ‘Za Zu Zeh’ is APC’s anthem while ‘Tesumole’ is PDP’s anthem. The captains exchanged pennants.\nPDP fans burst into the popular “Emi lo kan,” and “Bula Ba blu,” songs while APC fans shout louder, singing, “He’s a miracle working God” and “Ole ole ole, ole ole.”\nEdafe: There goes the referee’s whistle for the kick off. Who lifts the trophy? Artikú or Bat? The die is cast. A winner must emerge.\nDrury: PDP FC is taking things easy, watching and waiting for an opportune moment to strike but APC FC looks more aggressive and daring, contesting every ball.\nTyler: OMG! Did you see that gliding dribble by Bat? Whether he limps or crawls, there’s something you cannot take away from Captain Bat; he has all the attributes of the ultimate predator; patience, deception and the dagger.\nEdafe: Bat dribbles past three defenders, moves but Obaseky quickly comes to the rescue of goalkeeper Ayim who surely wouldn’t like the prospect of coming face-to-face with the deadly Captain Bat.\nTyler: Artikú shoots the ball into the air in the centre circle, Shetty Ma and Okowa go for an aerial battle in a clash of heads, gbosa! Shetty Ma goes hard on Okowa who lands badly. Shetty Ma gets a yellow card, Okowa gets a free kick.\nAyu lobs the free kick to Saraki who sends a low cross in the path of an onrushing Artikú, who hammers a shot that rattles the upright and bounces off into touch. Oh, what a miss!\nDrury: It’s the 75th minute of the game, excitement is building up. Left-legged Fasola gets the ball, he reminds me of Amuneke, he turns Mark inside out and lays a sitter for Bat, who latches onto the begging pass, readies to shoot, but Ayim, the almighty Man-Mountain spreads like an eagle, and crumbles on Bat, who folds up in the box 18. It’s a penalty! APC jubilate. But I can see an ambulance making its way into the 18 yard box.\nEdafe: Tempers have gone up. HeL Roofai races from his goal post to hit Ayim, who chases Roofai down the field with a stick. Oh, the match is getting out of control!\nTyler: Can someone, please, explain to me why the referee allowed the player in jersey No. 7 for PDP to wear a full mask? I know a player can wear a protective mask like Victor Osimhen, but the face must be visible.\nDrury: Naijeria is at it again! The match has turned into a war! Fayoshe, Bello, Sanwo-Bola and Wike have pinned PDP’s No 7 down, they are tearing off his mask, and oh my God! It’s Emifiele behind the mask! He breaks from his captors, runs towards Coach Booharry…, shouting, ‘Sai Baba, our plan don backfire o’ The APC chase after Booharry, Emifiele…",
  "word_count": 1232,
  "scraped_at": "2026-02-14T01:46:30.520935",
  "_text_extracted": true
}