{
  "article_id": "8cd38623a66c",
  "url": "https://www.90min.com/posts/xabi-alonso-tug-of-war-liverpool-bayern-munich",
  "title": "Xabi Alonso in line for tug of war between Liverpool and Bayern Munich",
  "date": "20240127T141500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Xabi Alonso in line for tug of war between Liverpool and Bayern Munich\n- Alonso's Bayer Leverkusen currently unbeaten in all competitions\n- The Spaniard's reputation has soared amid Liverpool and Bayern Munich interest\n- Liverpool looking for new manager after Jurgen Klopp confirmed exit at end of 2023/24 season\nXabi Alonso could be at the centre of a tug of war between Liverpool and Bayern Munich, with a release clause in his Bayer Leverkusen contract applicable to both European giants as well as Real Madrid.\nThe footballing world was rocked on Friday by Jurgen Klopp's decision to leave Liverpool at the end of the season, two years before his contract is due to expire at Anfield, and Alonso was immediately installed as favourite to return to the club he represented as a player between 2004 and 2009.\nAlonso's stock as a manager has risen exponentially after transforming the fortunes of Bayer Leverkusen - a job he took in October 2022 after spending three years coaching Real Sociedad B. The 42-year-old's side are remarkably unbeaten during 2023/24, winning 24 out of 27 games while scoring 85 goals in the process, and top the Bundesliga table ahead of serial winners Bayern by four points.\nLiverpool are also riding high, topping the Premier League table under Klopp, and having reached the Europa League knockout stages and FA Cup fourth round, are in contention for an unprecedented quadruple after beating Fulham to reach the Carabao Cup final.\nBayern's interest in Alonso\n90min previously revealed Bayern's interest in appointing Alonso, who won five trophies at the Allianz Arena between 2014 and 2017 to wind down his career, in a triple swoop involving Florian Wirtz and Alex Grimaldo, and they remain full of admiration for the job he has done at the BayArena.\nBayern are currently managed by former Champions League winner Thomas Tuchel, who succeeded Julian Nagelsmann in March, but the German is under increasing pressure in Bavaria because of Leverkusen's sensational form under Alonso. Tuchel also suffered the ignominy of Bayern being dumped out of the DFB-Pokal by third tier 1. FC Saarbrucken in November, having been defeated 3-0 by RB Leipzig in the German Super Cup prior to the league season beginning.\nTuchel is under contract until 2025 but there's been widespread rumours in Germany of discontent behind the scenes. Tuchel's relationship with the press has also been frosty, while he admitted in a recent interview that he doesn't feel as appreciated at home as he did during his time in England.\nIt's thought that Bayern's players remain fully behind the former Chelsea and Paris Saint-Germain boss, for now at least, and are focused on not only overcoming Alonso's Leverkusen in the Bundesliga title race but also competing to win the Champions League. Club chiefs also don't want to make a rash decision over Tuchel's future, but a failure to deliver trophies - the minimum expectation of any Bayern manager - could leave the club with no choice but to act.\nAlonso's name would be front and centre of conversations were a change to be made, with the likely arrival of Max Eberl in a sporting director role a potential catalyst for the club moving in a different direction.\nRelease clause in Alonso's contract\nThere has been speculation over Alonso's contract and whether or not it contains a release clause of some kind. Sources have confirmed to 90min DE that his Leverkusen deal does contain a fixed fee, rumoured in German media to be worth in the region of €15m-€18m, but it only applies to Bayern, Liverpool and Real Madrid - the latter also a former club of Alonso's.\nLiverpool are undoubtedly frontrunners to trigger the release clause, given their need is far greater at this point, and Carlo Ancelotti's recent signing of a new contract should quieten the noise about Alonso returning to Madrid.\nIt would be unwise, however, to rule out a switch to the Spanish capital in the future, particularly if Ancelotti is able to deliver another La Liga title and a fifth Champions League crown of his illustrious managerial career.\nAlonso's response to Liverpool links\n90min understands that Alonso wishes to focus on his work at Leverkusen and does not want to entertain outside noise from Bayern, Liverpool or anybody else. That notion was on evidence when Alonso spoke to the press on Friday, where he was asked by reporters about Klopp's shock announcement.\n\"I was surprised by Jurgen's news. I have huge respect for Jurgen and Liverpool. At the moment I am really happy here and enjoying my work. Each day and game is a challenge. We are in an intense and beautiful journey here at Leverkusen,\" Alonso said.\n\"Speculation is normal, but I have great respect and admiration for what Jurgen has done at Liverpool in the last nine years, and how he's done it. He has a connection with the fans, he's done a great job, but my focus is here at Bayer Leverkusen.\n\"I have great motivation to do a good job here, I'm very happy with the team, with the club, with everything, so that's my focus. My focus isn't on May, it's on tomorrow ahead of our game against Gladbach and helping my players to be ready. But what I will say is it was surprising what happened at Liverpool with Jurgen leaving.\"\nLiverpool and Bayern to compete for Alonso?\nWith Klopp staying until the end of the 2023/24 season, Liverpool have a bit of time behind the scenes to figure out their next move. It will be extremely difficult to agree a deal with Alonso, or any other employed manager, until the campaign is over, but it's not an impossibility. Manchester United's hiring of Erik ten Hag in April 2022, when he was still in charge of Ajax, evidence that it can be done.\nWhat may go against Liverpool in this situation is, ironically, Alonso's Leverkusen seeing off Bayern in the Bundesliga title race. The Bavarian giants last came up short way back in 2011/12 - losing to Klopp's Dortmund - and failure to win the title could see the club finish the season without a trophy. That's unthinkable from Bayern's point of view and would almost certainly see Tuchel shown the exit door.\nAlonso would then be the overwhelming favourite to take over at Bayern, given their long-standing interest, and Liverpool would need to convince him that the chance to succeed and build on the incredible foundations laid by Klopp is an opportunity too good to pass up. The stability on offer at Liverpool may prove to be key, as well as his fond playing days memories, but there's no guarantees they would win a tug of war.\nStaying at Leverkusen can't fully be discounted either. However, winning the Bundesliga title - and potentially the Europa League - would appear on the surface to be the perfect way to say goodbye, before stepping up to take charge of one of the biggest football clubs in the world.",
  "word_count": 1167,
  "scraped_at": "2026-02-14T02:17:18.386414",
  "_text_extracted": true
}