{
  "article_id": "8cfbeea9d260",
  "url": "https://www.prokerala.com/news/articles/a1397028.html",
  "title": "Santosh Trophy : Eugeneson Lyngdoh dreams of one giant step for Meghalaya",
  "date": "20230302T190000Z",
  "domain": "prokerala.com",
  "source_country": "India",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Riyadh, Saudi Arabia : Though he has been part of many successful campaigns at the club level and has achieved stardom playing for the country, Meghalaya's campaign in the 76th National Football Championship for Santosh Trophy has been a memorable one for Eugeneson Lyngdoh.\nThe former India midfielder is on cloud nine as Meghalaya have surprised everyone by reaching the final, stunning former champions and favourites Punjab 2-1 in the semifinals on Wednesday.\nAs the players are one step from glory, Lyngdoh says this set of players can become idols for the future footballers from Meghalaya for they have chartered history, reaching a high that no one from Meghalaya has achieved. And on Saturday, they can climb the summit of Indian football and make more history.\n\"A lot of these boys have so much to prove, so much to learn and it is a really proud moment for us for every young footballer in the state that this result has arrived,\" he said.\n\"I played under Khlain as a player at a time when there were not so many coaches with such knowledge and education as him. It is a great result for him too and I hope people notice this,\" added Eugeneson Lyngdoh, a creative force in the Indian midfield during his heyday who has played for clubs like Shillong Lajong, Rangdajied United, Bengaluru FC, FC Pune City, ATK, and East Bengal.\nHe had made history himself by scoring Bengaluru FC's first-ever goal in an Asian continental club competition in an AFC Champions League qualifier against Johor Darul Ta'zim of Malaysia in a 2-1 loss.\nA product of the semi-professional league in Shillong, where most of the current lot of players play, Eugeneson Lyngdoh believes his boys are just one step away from history and will add to the rich history of Shillong and Meghalaya.\n\"Shillong has had a rich history of football. We had the first club from the North East in the I-League and even some that gave so many good players from other states also a chance to shine.\n\"Mahesh Naorem is making waves in East Bengal right now, but it was at Shillong Lajong that he grew up,\" said Lyngdoh when asked how this result would impact football at home.\nNow a mentor of another set of dreamers from the NorthEast, Eugeneson is hoping that his wards will achieve something their peers could not -- win the Santosh Trophy. That will truly inspire another generation of footballers in Meghalaya.",
  "word_count": 414,
  "scraped_at": "2026-02-14T01:46:30.511679",
  "_text_extracted": true
}