{
  "article_id": "8d22d5ccea28",
  "url": "https://www.nytimes.com/athletic/6246482/2025/04/02/cristian-romero-tottenham-hotspur-argentina/",
  "title": "How do Tottenham Hotspur get the best out of Cristian Romero ? ",
  "date": "20250402T044500Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Cristian Romero charged up the pitch with one objective.\nIn Tottenham Hotspur’s 2-0 defeat by Fulham in March, the 26-year-old left his centre-back partner Ben Davies alone and tracked Raul Jimenez deep into Fulham territory before clattering into him on the touchline. Jimenez hobbled in pain while Romero jogged back into position, facial expression unchanged.\nAdvertisement\nWhen Tottenham faced AZ in the second leg of the Europa League round of 16 tie, Romero shoulder-barged his opponents and screamed in the face of his former team-mate Troy Parrott. The Argentina international is unrelenting in aggressively pursuing opponents.\nThe problem is that drama follows him in the same way.\nAfter losing Arsenal goalscorer Gabriel at a corner in September’s 1-0 north London derby defeat, Argentinian media reported that Romero was unhappy with his travel arrangements after representing his country twice in World Cup qualifiers. Romero arrived at Gatwick Airport on Thursday and had only a couple of days to train before facing Arsenal.\nIn December, Romero came off injured after 10 minutes during Tottenham’s defeat by Chelsea and appeared to criticise chairman Daniel Levy in an interview with Spanish broadcaster Telemundo Deportes.\n“You have to realise that something is going wrong,” Romero said. “Hopefully they (club board) realise who the true responsible ones are and we move forward because it’s a beautiful club that, with the structure it has, could easily be competing for the title every year.” Head coach Ange Postecoglou revealed a few days later that Romero apologised for his comments.\nAt the beginning of March, after making his comeback from the quad issue he suffered against Chelsea, Romero only thanked Argentina’s medical staff for their help with his recovery, which hinted at dissatisfaction with Spurs.\nDespués de un periodo difícil y lleno de cosas que pasaron en el medio , estoy de vuelta con el grupo y feliz de poder ayudar al equipo .\nSeguramente hay mucho que corregir y trabajar , pero estamos juntos y con ganas de revertir esta situación\nNos vemos el jueves , volveremos… pic.twitter.com/X68eDqsRyG— Cuti Romero (@CutiRomero2) March 9, 2025\nRomero has only made three appearances in all competitions since he returned from injury, but speculation is growing around his long-term future. Tottenham’s vice-captain has a contract until 2027 but has been linked with Real Madrid, and it has emerged that he is a target for their city neighbours Atletico. What does the future hold?\nAdvertisement\nRomero has made high-profile errors this season, with the latest example coming in Argentina’s 4-1 victory over Brazil in March. On the ball in his own half, he took a loose touch, which allowed Matheus Cunha to pinch it before firing a shot past Emiliano Martinez.\nIn August at Leicester City, he left Jamie Vardy unmarked for the equaliser in a 1-1 draw. A few weeks later, Romero stepped up when the rest of Tottenham’s defence dropped off in the build-up to Alexander Isak’s strike in a 2-1 defeat at Newcastle United. He left Danny Welbeck unmarked when the forward scored a header in a 3-2 defeat at Brighton & Hove Albion. In the 2-2 draw with Bournemouth on March 9 — the defender’s first appearance since December — an erratic left-footed pass in the opening minute was nearly punished by Evanilson.\nRomero won the Copa America with Argentina last summer and had less than three weeks off before he reported for pre-season. He started the first 11 league games but would have benefited from being slowly reintegrated.\nIn a report from FIFPRO on player workload, Romero travelled more than any other player during 2023-24, covering a distance of 162,978 kilometres. The next highest was his international team-mate Julian Alvarez, with 153,869km. Constantly travelling must be physically, emotionally and mentally draining and it is not surprising that it can negatively impact him.\nSince the group stage of the 2022 World Cup, which he helped his country to win, Romero has started 27 out of 32 matches (84 per cent), including friendlies.\nBut Romero’s fitness struggles suggest it has not always been the right decision to travel to Argentina to play under Lionel Scaloni.\nA toe injury sustained in a reckless challenge on Morgan Rogers in Tottenham’s 4-1 victory over Aston Villa in November became a repeat issue when he started for Argentina against Paraguay 12 days later, with him being taken off at half-time due to discomfort.\nAdvertisement\nHe did not play again until Spurs hosted Chelsea on December 8 and lasted 15 minutes. The Athletic reported in January that Romero only had a couple of training sessions before then and, suffering a quad injury, raised questions about his rehab work. The club said that this sort of injury is impossible to predict and this speculation is hindsight.\nThere have been 143 top-flight games since Romero joined Spurs in August 2021, initially on loan from Italian side Atalanta before the move became permanent for £42.5million. He has started 94 of them (65 per cent). He has only appeared in more than 30 league games in a season once for Spurs across four years.\nRomero has barely missed a game for Argentina over the past few years, but his poor availability for Spurs is concerning.\nRomero can be erratic, but Tottenham have missed his quality and leadership this season. He has won multiple trophies with Argentina. He has a good relationship with Postecoglou, who appointed him as vice-captain last season. He is the voice of the Spanish-speaking and South American contingent in Spurs’ dressing room, which includes Rodrigo Bentancur, Pedro Porro and Sergio Reguilon. He still occasionally defends in a wild manner but does not concede as many fouls or receive bookings like he used to. The defender’s experience would have been invaluable in the FA Cup and Carabao Cup defeats away at Aston Villa and Liverpool respectively.\nRomero is brave in possession and excellent at playing line-breaking passes. When Radu Dragusin partnered Archie Gray at centre-back between December and January, he looked nervous on the ball. Dragusin was guilty of turning away from strikers and passing back to the goalkeeper, which slowed down Tottenham’s attacks.\nIt is rare to see Romero looking flustered in those situations. Romero’s aggressive, front-footed approach to defending complements Micky van de Ven, who has the recovery speed to sweep up any loose balls played in behind. They will be crucial to Spurs’ chances of reaching the Europa League final in Bilbao on May 21.\nAfter Spurs beat AZ 3-2 on aggregate last month, Romero and Van de Ven were reunited for the first time in three months. “For the first 60 minutes, it was as solid as we’ve been all year,” Postecoglou said. “They had one shot off a set piece and they didn’t threaten us at all. Central defensive partnerships are important and both with and without the ball, they gave us good options.\n“With the ball, Micky is a great outlet for us because he can run with it, having a left-footed defender helps and (Romero’s) passing range is ridiculous.”\nAdvertisement\nThere are similarities between Romero and Kevin Danso, who joined Spurs in January on loan from French side Lens with an obligation to buy for €25m. Danso, who has been capped over 20 times by Austria, is only five months younger than Romero.\nDanso’s arrival means Postecoglou has four centre-backs, although Dragusin is recovering from an anterior cruciate ligament injury he suffered in January, along with Gray and Davies, who can cover the position. Davies is the established backup, but it is unclear who Postecoglou would select when everybody is fit.\nVan de Ven’s contract runs until 2029, while Dragusin and Danso’s deals expire 12 months later. Romero only has two years left on his contract and if he leaves, Spurs already have a right-footed replacement who likes to battle strikers and is comfortable carrying the ball forward in Danso. If Romero does not sign a new contract, the upcoming transfer window is the best time to sell him for a significant fee.\nIt is easy to see the appeal that Atletico might hold for Romero. It would give him the opportunity to work under an Argentinian coach in Diego Simeone and to play regularly with several international team-mates, including Alvarez, Rodrigo De Paul, Giuliano Simeone and Nahuel Molina.\nSpurs will miss out on European football for the second time in three years unless they win the Europa League. At Atletico, Romero would join a team fighting for the title, compared to Spurs, who have taken a step backwards in Postecoglou’s second year in charge. His long-term future is in serious doubt, while Simeone has been in charge of Atletico for over a decade.\nMaybe Romero will help Spurs win a trophy for the first time since 2008 and will line up alongside Van de Ven in the Champions League next season. Tottenham’s squad is packed with young talent, including Gray and Lucas Bergvall, so Romero might be determined to keep leading them along with Son Heung-min.\nWhatever happens next, do not expect the noise and drama surrounding Romero to quieten down anytime soon.\n(Top photo: Catherine Ivill – AMA/Getty Images)",
  "word_count": 1521,
  "scraped_at": "2026-02-14T02:02:35.592699",
  "_text_extracted": true
}