{
  "article_id": "8d22bc5a488b",
  "url": "https://theathletic.com/4609915/2023/06/15/randal-kolo-muani-profile/",
  "title": "Randal Kolo Muani has gone from zero to €100m in a year – meet the world most rapidly improved striker",
  "date": "20230615T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "This summer we are profiling 50 exciting players under the age of 25 — who they are, how they play, and why they could attract interest in the coming transfer windows.\nSo far we have analysed two Bayer Leverkusen stars, Florian Wirtz and Moussa Diaby; Rasmus Hojlund at Atalanta; two Benfica stars, Goncalo Ramos and Orkun Kokcu; Real Sociedad’s Martin Zubimendi and Marcus Thuram of Borussia Monchengladbach.\nNext up, it’s Randal Kolo Muani of Eintracht Frankfurt who has attracted interest from Bayern Munich, Real Madrid and Manchester United.\nAdvertisement\nIn 2020, Students in the German city of Stuttgart built a car that set a new world record for “fastest accelerating electric vehicle” by going from zero to 100 kilometres an hour (62mph) in 1.461 seconds.\nEintracht Frankfurt striker Randal Kolo Muani isn’t quite that quick but the 24-year-old is set to break a similar type of “zero to one hundred” record this summer.\nHaving left Nantes of France’s Ligue 1 on a free transfer last July, he could move on again for a nine-figure sum one year later.\nThere can’t be many players whose value has grown so rapidly in such a short space of time.\nIn truth, the forward born in Bondy — the same Paris district that gave the world Kylian Mbappe — was already worth a tidy sum 12 months ago, but Nantes hadn’t been able to renew his contract in time. “They have a well-deserved reputation for being clever in the market and selling players for profit but even they couldn’t anticipate his lightning progress,” Thibault Dumas, a Nantes-based journalist for leading French newspaper Le Figaro tells The Athletic.\nAfter being signed to Nantes’ academy in 2015 at age 16, Kolo Muani struggled with growth problems — he’s now 6ft 2in (187cm) — and a lack of discipline — he forgot his boots before matches a couple of times.\nThere were no indications he would ever make it at any pro level in the game before a loan move to third-division Boulogne in the summer of 2019 kick-started his career. Kolo Muani scored three times in that pandemic-curtailed season (all in the last three of his 14 appearances) but more importantly, came back to his parent club “a different player,” Dumas recalls. “He still had that calmness in front of goal but was much more hard-working and alert on the pitch.”\nNine goals in his first full season in Ligue 1 (2020-21) then brought him to the attention of Frankfurt’s scouting department. After a database had identified him as a potential target, they spent weeks scouting him extensively on video and in person. Their evaluation included a character assessment carried out with the help of a psychologist, who analysed his behaviour on and off the pitch as well as every single statement of his in the media and any social media posts.\nAdvertisement\nKolo Muani’s output, meanwhile, accelerated again. He would score 13 goals in 41 all-competitions games in 2021-22.\nA few months before his Nantes contract was about to expire, Frankfurt managed to convince him that moving to their Deutsche Bank Park was a good next step. They spoke openly about his strengths (dribbling, pace, finishing) and weaknesses (tactical discipline, work rate) to him and laid out a pathway for his further development. After attempts to sign him in the January window failed, Kolo Muani kept his word and signed for the Bundesliga side once that season finished.\nBut even Frankfurt had little idea how quickly he would go to a whole new level.\nKolo Muani has lit up the Bundesliga as a right-sided forward, scoring a glut of goals (23), both on the break and from inside the box. His 17 assists in all competitions were also crucial in getting Frankfurt to the DFB-Pokal final (Germany’s FA Cup) and into the knockout phase in their debut Champions League campaign. Oh, and he nearly won the World Cup final for France, too.\nA look at his smarterscout profile — with an explanation for the metrics here — underlines why his playing style has often been compared to Thierry Henry back home.\nHis standout attributes are the high carry and dribble volume, which tells us he loves to have the ball at his feet, and his equally strong xG from ball progression, showing he is a dangerous player with his forward runs, through balls and crosses. He’s able to create for his team-mates, as his xG from shot creation rating shows — his 11 assists were only beaten by Dortmund’s Raphael Guerreiro (12) in the 2022-23 Bundesliga — while a good ball retention ability score tells us he is good in possession and rarely loses it.\nHis shot map shows him overperforming his expected goals (xG) number slightly for a second season running, which points to what could become a sustainable level of finishing ability, while an average of 2.5 shots per 90 minutes shows he’s a busy, positive striker. With 84.9 per cent of his shots coming from in the penalty area, his box movement is also good.\nUnlike Arsenal royalty Henry, who often played wide off a central striker and loved to collect the ball out wide on the left, his countryman loves to attack the goal from an inside-right channel. That makes it harder for him to work good angles for a shot on his favoured right foot. The trade-off is having more space to go wide.\nAdvertisement\nKolo Muani is a very unselfish forward, happy to turn provider from the flank when a better-positioned team-mate can be found. In addition, he’s also a comfortable finisher on his left foot, which makes him much harder to control.\nTake this goal against Werder Bremen last August. Without any support to call upon, Kolo Muani’s best option would appear to be trying to beat the nearest defender for pace towards the near post.\nBut he chooses a much more difficult route, surprising the home side’s entire back line in the process. He cuts back into traffic, onto his left foot….\n…retains the ball under pressure, switches back onto his right foot…\n… and then onto his left again to leave the central defender in a tangle and work an opening.\nThe goalkeeper gets a touch, but can’t keep the shot out of his net.\nKolo Muani thrives in open spaces but is much more than a threat from counter-attacks.\nA couple of very fine headed goals are a testament to his aerial prowess, and his movement inside the box has vastly improved in recent months, as our next example shows.\nOpponents Freiburg have seven players in their penalty area, including three close to Kolo Muani just outside the six-yard box.\nAs the ball gets passed back inside to Mario Gotze for a cross, he realises the defence has left some space near the penalty spot and moves away from goal.\nGotze’s cross takes a big deflection and comes down close to the 18-yard line. Kolo Muani is the first to react…\n…and his perfect first touch sets him up to make a run across the defensive line and fire a powerful low shot into the net.\nIt’s a real poacher’s goal, conjured up from next to nothing.\nAt Frankfurt, they value Kolo Muani’s intelligence and dedication to getting better. The intention is to keep him for one more season, after which, they believe, he’ll be ready to play for any club in the world. But with so many major sides hunting for a new No 9 this summer, big offers are bound to come in soon.\nAdvertisement\nBayern Munich, in particular, are prepared to break the bank for him, as Frankfurt well know. But Real Madrid and Manchester United are looking too, and who knows what’s going on with Mbappe at Paris Saint-Germain.\nWith four years left on his contract, it will take an offer of €100million (£85.6m, $108.6m) or more to capture the most rapidly improved striker in world football.\n(Top photos: Getty Images; design: Sam Richardson)",
  "word_count": 1333,
  "scraped_at": "2026-02-14T01:50:37.810385",
  "_text_extracted": true
}