{
  "article_id": "8d55e49443b8",
  "url": "https://thepeoplesperson.com/2025/05/14/europa-league-final-press-conference-ruben-amorim-confident-that-man-united-can-overcome-tottenham-hotspur-in-the-final-294013/",
  "title": "Europa League final press conference : Ruben Amorim confident that Man United can overcome Tottenham Hotspur in the final - Man United News And Transfer News",
  "date": "20250514T203000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Despite a dreadful domestic season, Manchester United are in the Europa League final and are one step away from glory, as well as qualifying for next season’s Champions League.\nIn the pre-match press conference on Wednesday, Ruben Amorim was asked about the significance of the occasion and how it could provide a major fillip to the club’s fortunes in the immediate aftermath.\nThe head coach made it clear that the Champions League is where the Red Devils belong, while it would provide a huge boost in terms of transfers as well as the Portuguese seeks to improve the club’s fortunes.\n“Personally for me, I think the Champions League is more important for everything, to prepare for the next season. We are supposed to be in the Champions League; the Europa League here is not enough. This is the best way to get us to the top in a few years.”\nChampions League football is a must\nIt has been a disappointing time in the Premier League for United with the club languishing in 16th place. And Amorim recently claimed he would walk should results and the team’s mentality not improve.\nHe clarified his previous comments by saying, “Since I arrived here, I have always been talking about the standards. I have a clear idea what to do. I understand the problems of the team, so I am far from quitting.\n“What I am saying is, we need to perform in the future and this season. If not, they will change us, that is a normal thing. That was my feeling and is still my feeling today.”\nOn the mood around the camp, the ex-Sporting CP boss made it clear that while everyone is smarting from the losses in the Premier League, a European final is upon the team and everyone is raring to go for the Bilbao showdown.\nFinal is different\n“A final is different. But this season has been really tough on everybody; the results and the changing in the staff. You can feel it. We are addressing that during the season, we are changing the way we play during the season, so the environment is tough.\n“But I guarantee you when we are playing a game in the Europa League the environment is different and you can feel the excitement.”\nThere are lots of injury concerns, especially at the back with Ayden Heaven, Matthijs de Ligt and Diogo Dalot currently sidelined. Amorim said they are pushing to be available but it is still not clear whether they will make it.\n“I don’t know if they are going to be available. We are going to try and push because it is the final matches and there is a final. All the players want to play in that really bad. I don’t think they will go to Chelsea, but we will have a possibility to have some of them in the final.”\nInjury update\n“Dalot is trying really bad. I don’t want to risk Dalot because when you start getting one injury, a second injury, it is a big thing. We cannot have these kinds of problems in our squad. We will see. He is working really hard to get in the final.”\nPlaying another Premier League team in the final in Tottenham Hotspur will be a different experience even though the North London side have already got the better of the Old Trafford side thrice this season.\n“It is going to be different. We are prepared for that and the final is completely different. The context is different. This team has proven already that in a final they can step up.\n“We give all the information that we can and we prepare the game in the same way. It is the only way I know how. It is a thing of our players also. They have proven in the past, in these types of games, they are prepared to do that.”\nHeartwarming gesture\nAmorim was naturally asked about his gesture of buying tickets for the staff members, to which he replied, “To start with that, the situation is simple: we know that we have had a lot of things with people leaving and changes in the staff. In this moment, in our club, sometimes it is hard when to give, when to take.\n“It is complicated for the club to start giving to other members of staff. It is a really hard position. That situation was explained and in that moment was to help. It is not going to change my life.\n“To help the staff to be there… to be better staff for the final. All the players had the same reaction. Everyone wants the staff there, their families there. It is hard to manage things in our club, so it is a simple thing.”\nAmorim could follow in the footsteps of Jose Mourinho in his debut season by clinching the Europa League to qualify for the Champions League despite a below-par Premier League season.\n“I didn’t speak with him. Again, it would be massive for us to win something and give something to the fans. It is not important if I follow Jose Mourinho or another manager. The most important thing is how this title could help us get back to the top, fast.”\nThe Europa League final is on May 21 at the San Mames Stadium in Bilbao. Kick-off is from 8pm.\nFeature image Alex Livesey via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 908,
  "scraped_at": "2026-02-14T02:02:47.550263",
  "_text_extracted": true
}