{
  "article_id": "8d5a4f9e9bcb",
  "url": "https://thepeoplesperson.com/2025/05/07/im-happy-here-alejandro-garnacho-confirms-he-wants-to-stay-at-man-united-amid-transfer-speculation-293725/",
  "title": "  Im happy here : Alejandro Garnacho confirms he wants to stay at Man United amid transfer speculation - Man United News And Transfer News",
  "date": "20250507T163000Z",
  "domain": "thepeoplesperson.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alejandro Garnacho has insisted that he is happy at Manchester United and wants to continue at the club, even as he continues to be strongly linked with a summer exit.\nGarnacho’s future at Old Trafford remains uncertain amidst suggestions that United could offload him in the upcoming window for the right price.\nThe club engaged in talks with Chelsea and Napoli back in January, but no deal was reached. While both clubs are still thought to be interested, the Argentine has also attracted attention from Bayer Leverkusen, Atletico Madrid, and Juventus.\nAs a homegrown talent, any sale of Garnacho would be logged as “pure profit” in the club’s financial records, making his departure even more financially appealing. However, the winger has declared his intention to stay at United.\nHe joined Ruben Amorim at the press conference ahead of United’s second-leg clash with Athletic Club on Thursday.\nAsked about his future, Garnacho answered, “As a footballer, you are always gonna listen and read some rumours about the future. I have a contract here until 2028, I am happy here.”\nOn his improved form, Garnacho remarked, “We have to work hard to be in the squad. I just have to train well every day and I will be available for the games.”\nLike many of his teammates, Garnacho initially found it hard to adjust to Amorim’s 3-4-3 system.\nThe 20-year-old said about this,”I think it is not easy in the middle of the season when you change the manager and all the staff. In my mind, I just try to work hard every day and show the manager that I want to play.”\n“I think it is difficult for everyone when it is in the middle of the season when a new manager comes in and changes the formation. We just need to follow the rules and I am trying to improve every day. I think we are improving as a team also.”\nGarnacho needs one more goal or assist before this season ends to equal Cristiano Ronaldo’s record of 25 Premier League goal involvements before the age of 21.\nHowever, Garnacho has stressed that his primary focus is not on matching his football idol’s numbers.\n“I am not focused on the numbers. I think when Cristiano [Ronaldo] played here it was a different type of football and a different type of game. We are training really hard, me, Rasmus [Hojlund], all the strikers in the team. I think we are improving and trying to get better.”\nA few months ago, Amorim branded the current United squad as perhaps the worst in the club’s extensive and illustrious history.\nAsked about this, Garnacho explained, “We know that we are not doing a great job in the Premier League. But the manager said before that we have followed the rules and tomorrow is a final, and we will face it like it is 0-0.”\n“If we win the Europa League, we will be in the Champions League and we will face next season with a different mentality and in a different way.”\nUnited vs. Athletic kicks off at 20:00 BST.\nFeatured image Carl Recine via Getty Images\nFollow us on Bluesky: @peoplesperson.bsky.social",
  "word_count": 528,
  "scraped_at": "2026-02-14T02:26:38.644353",
  "_text_extracted": true
}