{
  "article_id": "8d6c534c0d42",
  "url": "https://www.myjoyonline.com/arsenal-seize-massive-opportunity-by-proving-mentality/",
  "title": "Arsenal seize  massive opportunity  by proving mentality",
  "date": "20250929T011500Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nTime was rapidly running out for Arsenal. With 83 minutes on the clock, Newcastle United were still in front at St James' Park courtesy of a powerful header from Nick Woltemade.\nAnd it looked like being one of those days for the visitors.\nA penalty award had earlier been overturned following an intervention from the video assistant referee (VAR) after Newcastle goalkeeper Nick Pope appeared to bring down Viktor Gyokeres.\nLeandro Trossard saw an effort crash off the post.\nPope made superb saves to keep out a pair of volleys from Eberechi Eze and a header from Jurrien Timber.\nBut not only did Arsenal equalise through substitute Mikel Merino - they won thanks to Gabriel's dramatic stoppage-time goal.\nNo wonder manager Mikel Arteta celebrated wildly on the touchline as his side moved within a couple of points of league leaders Liverpool.\n\"To win in the manner that we have done it, wow, what a feeling,\" he told Match of the Day. \"Football is about emotion and going through things and today we had a beautiful one at the end of the match.\n\"That is how you get to a different level. By going through those moments and take those lessons from it.\n\"It was a massive opportunity to make a statement and to prove to everybody and ourselves the team that we are.\"\nArteta plays trump cards\nArteta has felt very different emotions on recent visits to St James'.\nNewcastle had won each of their previous three home games against Arsenal in all competitions.\nThere has been an edge to these matches in recent years - one that has tended to bring out the best out of Newcastle.\nAnd Newcastle head coach Eddie Howe has long told his players they play better when they hit that \"sweet spot of aggression and competitiveness\".\n\"We are competitors,\" midfielder Joelinton roared before the game. \"We want to compete. We want to win.\"\nIf Joelinton's words did not fire up his team-mates enough, Jamaal Lascelles wrote in his pre-match programme notes about how playing at a febrile St James' \"makes you feel like you can run through a brick wall\".\nThat was the challenge Arsenal faced - not least after going behind in the first half - as the home support roared at tackles and blocks.\nThere were even taunts of \"Mikel Arteta - it must be the ball\" in reference to the Arsenal manager's explanation for his side missing the target when these teams met in the Carabao Cup semi-final first-leg last season.\nYet Arteta had a couple of familiar trump cards to fall back on: his bench and set-plays - and not for the first time.\nSubstitutes Eberechi Eze and Gabriel Martinelli previously linked up for the equaliser against Manchester City. Martinelli and Trossard both scored after coming off the bench versus Athletic Club in the Champions League. Trossard helped seal the midweek EFL Cup win at Port Vale after being thrown on as a replacement.\nThis time, it was Merino's turn to make an impact.\n'Keep doing what we do'\nWhat is it about this side and set-plays?\nFor context, since the start of the 2023-24 season, Arsenal have scored 36 goals from corners in the Premier League - 15 more than any other side in this period.\nArsenal's prowess from set-pieces ultimately turned this game on its head.\nFrom the first, in the 84th minute, Arsenal took a short corner before Declan Rice swung the ball into the box.\nMerino got there in front of Sven Botman to glance the ball in off the post.\nAnd the decision to go short certainly did not go unnoticed by Match of the Day pundit Joe Hart.\n\"Rice was willing to do something off the cuff [for the goal],\" the former Manchester City goalkeeper told BBC Sport. \"That is someone who is not bothered about the problems Arsenal had faced, that was someone looking for a solution and, at that moment in time, that was the solution.\n\"When he needs to make the last-ditch tackles, that's what he does and when he needs to do something special, like that kind of blind round the corner ball on to Merino's head, that was a special bit of play that his team needed.\"\nMerino previously spent a season at Newcastle, but there was no chance of the Spaniard reining in his celebration as he punched the air.\nBut it was instructive that each Arsenal player raced back to their own half so the game could get back under way.\nThey sensed there was another twist to come - and it arrived in the 96th minute.\nAfter going short for their equaliser, Arsenal went direct and another substitute, Martin Odegaard, set up Gabriel, who headed home at the near post.\nThe away end up in the gods could scarcely believe it - even though this side are making a habit of scoring late goals.\n\"That shows a lot and not only set-pieces strategy but also mentality,\" Merino told Match of the Day. \"Other teams, if they get six or seven corners and they don't score, they start to lose belief in the qualities.\n\"But, for us, it's a matter of keep doing what we do, doing it at the highest level and, in the end, the last one, the last second, we scored and I'm really happy.\"\nIt is very early days, of course, but this felt like a timely test of Arsenal's credentials as title challengers that the Gunners found a way to pass.\nAfter watching champions Liverpool slip up against Crystal Palace on Saturday, Arteta's team ultimately took advantage.\nRather than remaining five points behind, Arsenal have instead closed the gap.\n\"The character they showed today was as impressive as the result,\" England women's record scorer Ellen White told BBC Sport. \"St James' Park has been such a hard place for them to go, and they have had some difficult games there recently with maybe some things not quite going their way.\n\"We saw that again at the beginning of this game as well, so to show that grit, determination and togetherness and have the character to come through such a physical game - there were some big hits going in, with a lot of big tackles and relentless running as well - was so impressive.\"\nLatest Stories\n-\nThis is not the time to settle political scores – Bawumia to government\n38 minutes -\n37% of SHS students exposed to drugs – Opare-Addo\n56 minutes -\nNLC secures court injunction against striking tertiary unions\n2 hours -\nWaiting in the Ring: life inside Bukom’s halted boxing scene\n2 hours -\nRed Notice cancellation: OSP official fires back at Ofori-Atta’s lawyers\n2 hours -\nOfori-Atta saga: Red Notice ends after arrest – OSP official clarifies\n3 hours -\nAAG raises alarm over billboard demolitions, calls for presidential intervention\n3 hours -\nHealth Minister to chair probe into ‘No Bed Syndrome’ death; promises system overhaul\n3 hours -\nPrime Insight to tackle ‘galamsey tax’ debate, cocoa reforms and Ayawaso East fallout this Saturday\n4 hours -\nCocoa crisis, galamsey complicity and election credibility to dominate this Saturday’s Newsfile\n5 hours -\nINTERPOL deletes Red Notice for Ofori-Atta as extradition process continues — OSP confirms\n5 hours -\nMasterMinds resources positions itself as key player in skills development and workforce training\n6 hours -\nINTERPOL has deleted Ofori-Atta’s Red Notice – Lawyers\n7 hours -\nSteven Spielberg donates $25,000 to James Van Der Beek’s $2m GoFundMe\n7 hours -\nSix possible effects of Trump’s climate policy change\n7 hours",
  "word_count": 1266,
  "scraped_at": "2026-02-14T02:09:24.916724",
  "_text_extracted": true
}