{
  "article_id": "8d6d62796a58",
  "url": "https://metro.co.uk/2025/04/24/ian-wright-backs-marcus-rashford-join-shock-premier-league-club-22968813/",
  "title": "Ian Wright backs Marcus Rashford to join shock Premier League club",
  "date": "20250424T171500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ian Wright says there is ‘no chance’ Aston Villa loanee Marcus Rashford will return to Manchester United.\nRashford’s future remains far from certain as he comes to the end of his loan spell at Villa Park.\nThe 27-year-old has enjoyed an encouraging stint at the Midlands club since effectively being forced out of Old Trafford by Ruben Amorim.\nAmorim constantly overlooked Rashford following his arrival from Sporting Lisbon and criticised the England international’s work rate in training before sanctioning his January move to Villa.\nAston Villa are not obligated to sign Rashford on a permanent transfer but may choose to do so for around £40m given his upturn in form under Unai Emery.\nA possible sticking point, however, could be Rashford’s significant wages, while there is also a possibility the player looks to go elsewhere, particularly if Villa fail to qualify for the Champions League.\nA number of European clubs are said to be open to signing Rashford if he agrees to take a pay-cut, but Wright believes there could be a decent option much closer to home.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘It’s the kind of signing Newcastle should be making,’ Wright said on his Ringer FC podcast when it was suggested to him that Rashford could make a surprising move to St James’ Park.\n‘That would be amazing. That would be dangerous. Rashford at Newcastle? Yeah. That would be really good. I really like that for Rashford. Rashford at Newcastle can be dangerous.’\nAsked whether Rashford could yet return to Manchester United, the club he first joined at the age of seven, Wright said: ‘Nope. No chance.’\nNewcastle have enjoyed a historic season under Eddie Howe, winning the Carabao Cup while challenging for Champions League football.\nWith Rashford keen to play in the Champions League next season, Aston Villa’s chances of a summer deal could rest on a top-five finish in the Premier League.\nVilla are seventh in the Premier League with four games remaining, two points outside the Champions League spots.\nBut even if Aston Villa are able to convince Rashford to stay, they should seriously consider whether they want to commit to a big-money transfer and lucrative contract, according to Graeme Souness.\nWriting in a column for the Daily Mail, Souness said: ‘The question I’d be asking as Aston Villa consider whether to sign Marcus Rashford permanently is this: “Can you trust him?”\n‘Has he really pulled up any trees in his time on loan? Unai Emery will know more having seen him up close. He has started him in key games but has he really done enough?\n‘Aston Villa know this is a huge transfer for Manchester United. If they pay the £40m fee it gives United greater headroom with Profit and Sustainability to buy in the summer, so why should Villa do United any favours?\n‘They know how desperate United are so they’ll likely bid low. Villa won’t want to match his wages as they’ll have everyone else knocking on the manager’s door asking for over £300,000 a week.\n‘They know United need to sell him and they’ll also have to weigh him in to go. But you are still wondering what has changed?\n‘This is a Manchester boy who had to leave his boyhood club. They gave him a big, big contract and he let them down big time.\nMore Trending\n‘What is different in his life? Are the same people supposedly responsible for looking out for him, still around?\n‘And if he signs, how long is it before he reverts to the same moody individual who struggled to turn up for Manchester United.\n‘Can you trust him is the biggest question. Aston Villa are a huge football club that have to be in the Champions League and for that you need players you can rely on.’\nAston Villa and Rashford’s next assignment will be a FA Cup semi-final against Crystal Palace on Saturday.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Teddy Sheringham urges Man Utd to snub Liverpool star in summer transfer window\nMORE: AFC Bournemouth vs Man Utd: Latest team news, predicted lineup and injuries\nMORE: Jamie Vardy to leave Leicester City after incredible 13-year career",
  "word_count": 759,
  "scraped_at": "2026-02-14T01:58:31.706035",
  "_text_extracted": true
}