{
  "article_id": "8d8493be6330",
  "url": "https://www.uefa.com/news-media/news/028e-1b2e0a589504-9c17f56753f2-1000--uefa-mourns-passing-of-former-general-secretary-gerhard-a/",
  "title": "UEFA mourns passing of former general secretary Gerhard Aigner",
  "date": "20240621T053000Z",
  "domain": "uefa.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "UEFA mourns passing of former general secretary Gerhard Aigner\nThursday, June 20, 2024\nArticle summary\nGoverning body to honour Aigner's memory at EURO 2024 matches on Thursday and Friday with a moment of applause.\nArticle top media content\nArticle body\nUEFA is deeply saddened to learn of the loss of Gerhard Aigner, our former general secretary and chief executive, widely recognised as a key architect of the UEFA Champions League.\nIn a mark of respect for Mr Aigner, who passed away on Thursday aged 80, UEFA EURO 2024 group stage matches played on Thursday and Friday will observe a moment of applause before kick-off.\n\"Football has lost one of its truly great leaders… We will miss him enormously.”\nDuring 34 years of service at European football's governing body, Mr Aigner worked hand in hand with then president Lennart Johansson to navigate UEFA through a period of rapid and far-reaching change for the game – first as the organisation's fourth general secretary (1988–99), then its first chief executive (1999–2003).\nHis time in office witnessed the transition of the European Champion Clubs' Cup to the UEFA Champions League and the development of UEFA's national team competitions. Mr Aigner also masterminded UEFA's transformation from a purely administrative body into a modern, dynamic business organisation, as well as guiding its response to the far-reaching consequences of the Bosman Ruling.\n\"Football has lost one of its truly great leaders,\" said UEFA president Aleksander Čeferin. \"Gerhard was instrumental in the creation of the Champions League and played a critical role in turning UEFA into the modern governing body of European football that it is today. He was a man of utmost integrity who always championed the true values of the game. We will miss him enormously.\"\nThroughout the enormous growth in football's commercial value, Mr Aigner never lost sight of the need to balance sponsorship and media opportunities with UEFA's core mission to safeguard football's fundamental principles such as respect, sporting merit and equality.\nBeginnings\nGerhard Aigner was born in Regensburg, Germany, on 1 September 1943, playing for the local amateur side as a teenager before taking up refereeing as well as coaching his home town's youth teams.\nAfter completing his studies at Regensburg's economic high school, he worked locally as an apprentice for foreign trade, nurturing a natural talent for languages. In his early 20s, he spent extended spells in England, Spain and the French-speaking part of Switzerland, where he played for FC Moutier.\nUEFA refereeing and youth sector\nOn 1 October 1969, Mr Aigner accepted an offer to run UEFA's refereeing and youth football sector at its then small secretariat headquarters in Berne, Switzerland.\nIt was a move that would shape the rest of his working life.\nIn the ensuing years, he gained experience and insight into a range of UEFA activities, before making his name as head of the competitions' sector from 1973 – at a time when UEFA's club tournaments were growing rapidly in prestige and popularity.\nFourth general secretary\nWhen Hans Bangerter decided to step down in 1988, the Executive Committee had little hesitation in nominating Gerhard Aigner as the fourth man to bear the title of general secretary.\n\"I have certain plans and ideas for the future, but the time is not yet ripe to reveal them all in public,\" he said in 1989 following his appointment. \"But I have made it my goal to make sure that there is a certain continuity in UEFA's work; I want to make fair play a priority in every way, and I also want to show that I am open to new ideas and initiatives. I also want to make it clear that, in thinking ahead, we must always ensure that we do not jeopardise the sporting value of the European competitions in any way.\"\nModernisation\nFor the next 15 years, Mr Aigner was true to his words, modernising the UEFA administration, pioneering the FORCE project that introduced widespread changes, leading by delegation and adopting a low-key approach to his increasingly public role.\nHe seldom hesitated to make clear his disdain for those who sought only to make personal profit from the new wave of finances that was sweeping into the game, or his annoyance with those outsiders who challenged UEFA's authority.\nIn 1995, he helped mastermind UEFA's move from Berne to its current headquarters in Nyon and recognised the need to revitalise the Champion Clubs’ Cup, leading the introduction of the UEFA Champions League without ever betraying his belief in the importance of national team competitions.\nFootball first\nHis main task, however, and one which consumed him ever more throughout the 1990s, was to plot UEFA's route through negotiations with European political leaders that preceded and followed the Bosman Ruling at the end of 1995. Throughout all this, Mr Aigner never lost sight of his original determination to keep the interest of football itself at the forefront of all his deliberations.\nHonorary member of UEFA\nAt the end of 2003, aged 60, Mr Aigner's devotion to his family persuaded him to step down as chief executive. Within a year, he was appointed as an honorary member of UEFA – a lasting recognition of his outstanding services to European football.",
  "word_count": 867,
  "scraped_at": "2026-02-14T02:10:54.419031",
  "_text_extracted": true
}