{
  "article_id": "8d8c01e9dbd4",
  "url": "https://www.teamtalk.com/arsenal/gunners-express-interest-dominant-defender-punish-chelsea-regrettable-transfer-decision",
  "title": "Arsenal  express interest  in dominant defender to punish Chelsea for regrettable transfer decision",
  "date": "20240105T210000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal\nPremier League • England\nArsenal ‘express interest’ in dominant defender to punish Chelsea for regrettable transfer decision\nArsenal have developed an interest in AC Milan defender Fikayo Tomori and could consider bringing the former Chelsea product back to the Premier League, a report has claimed.\nIn and around his 27 senior appearances for Chelsea, Tomori endured loan spells with Brighton, Hull City, Derby County and AC Milan. The latter two spells were his most successful; his work under Frank Lampard at Derby earned him a chance with the same coach at Chelsea, before his opportunities decreased and his move to Milan was inspiring enough that it became permanent in 2021.\nTomori helped Milan win the Serie A title in his first full season and is now in his third. He has made more than 100 appearances for the club, including 21 in the Champions League.\nThe fact he has only earned four England caps as a Milan player is surprising to many who have seen him playing to a high standard in Italy.\nWould it help his case if he was playing back in the Premier League? Maybe, maybe not. Either way, there have been rumours of a return to English football for a while now.\nAccording to FootballTransfers, the latest contenders for Tomori’s signature are Arsenal, who have ‘expressed an interest’ in the 26-year-old.\nWhether or not they will turn that interest into a bid is still to be decided. Arsenal already invested in a centre-back in the summer of 2023, but the player they chose (Jurrien Timber) soon suffered a serious injury.\nThe report claims Mikel Arteta might want to upgrade his defensive options this year and has told Arsenal to monitor Tomori.\nMilan still have Tomori under contract until 2027, so their asking price has not yet been established.\nCoincidentally, Milan are one of the clubs to have been linked with Arsenal defender Jakub Kiwior, who left Serie A side Spezia this time last year to join the Gunners but has failed to become a regular starter.\nIf Arsenal do let Kiwior go – which they are currently reluctant to – to Milan or anyone else, perhaps they could turn to Tomori as an upgrade if they feel they have enough room for a player of that quality.\nTomori to Arsenal would be insult to injury for Chelsea\nChelsea would no doubt be aggrieved to see their academy product playing for their London rivals, especially when there have been suggestions that the Blues might look at taking Tomori back for themselves.\nFor now, Tomori’s focus will be on returning to fitness after suffering a hamstring injury in Milan’s last match of 2023.\nIt added to an existing injury crisis in Milan’s defence, heightening the Rossoneri’s need to explore their own new defensive options in January.\nFor example, they have already recalled Matteo Gabbia from a loan spell at Villarreal and may look for a low-cost signing as well while Malick Thiaw and Pierre Kalulu are among their absentees.\nBefore his injury, Tomori had played 22 times for Stefano Pioli’s side this season, scoring three goals.",
  "word_count": 519,
  "scraped_at": "2026-02-14T01:48:39.901161",
  "_text_extracted": true
}