{
  "article_id": "8da57df86ef1",
  "url": "https://metro.co.uk/2025/09/16/champions-league-games-thursday-this-week-24176208/",
  "title": "Why are there Champions League games on Thursday this week ? ",
  "date": "20250916T094500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The Champions League is back for another season – with 12 of the teams competing in the 2025/26 edition starting their campaigns on Thursday.\nThis is particularly unusual as Tuesday and Wednesday are traditionally designated for the Champions League, with Europa League and Conference League matches being played on a Thursday instead.\nNewcastle and Manchester City are amongst the sides who will get their first taste of European football this season tonight, with the Premier League duo taking on Barcelona and Napoli respectively.\nYou might suspect that the increase in fixtures courtesy of the revamped format of the competition has brought about this change. But that’s not actually the case.\nWhy six Champions League games are being played on Thursday\nThe switch from the 32-team group stage to the 36-team league phase means that the number of Champions League matches has risen from 125 to 189.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nBut the Thursday fixtures have nothing to do with the congested schedule.\nRather, UEFA have decided that each of their three competitions will have an exclusive matchweek this season with no fixtures from the other two, with the week of September 16-18 allocated to the UCL.\nThis has been done because UEFA are keen to draw more focus to their less premium competitions.\nThe Europa League’s exclusive week is on Wednesday, September 24 and Thursday, September 25, whilst the Conference League’s exclusive matchday is taking place solely on Thursday, December 18.\nWill there be more Champions League games on a Thursday?\nNo. Tonight is the only time this season that Champions League games will be played on a Thursday.\nAside from the exclusive weeks, the format for European games is the same as prior years with the Champions League on Tuesday and Wednesday, and the Europa League and Conference League on Thursday.\nChampions League fixtures\nThursday, September 18\n- Copenhagen vs Bayer Leverkusen – 5.45pm\n- Club Brugge vs Monaco – 5.45pm\n- Eintracht Frankfurt vs Galatasaray – 8pm\n- Sporting vs Kairat Almaty – 8pm\n- Newcastle vs Barcelona – 8pm\n- Manchester City vs Napoli – 8pm\nWhat about the early kick-offs?\nThe 5.45pm kick-off slot was introduced by UEFA for its club competitions in 2021.\nMore Trending\nThis staggering of kick-off times enables viewers to be able to watch more games, whilst also being more beneficial to TV broadcasters.\nThe move hasn’t been universally popular, however, with one common complaint being that fans commuting home from work often miss the start of the match on TV.\nThe early start also leaves little time for match-going supporters to reach the stadium on time after work – and not to mention the fact they are often travelling during peak public transport times.\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Peter Schmeichel names two players Manchester United should ‘never’ have sold\nMORE: Sergio Aguero backs third team to rival Liverpool and Arsenal for Premier League title\nMORE: Sol Campbell makes confident prediction ahead of Arsenal vs Man City",
  "word_count": 563,
  "scraped_at": "2026-02-14T02:21:48.754446",
  "_text_extracted": true
}