{
  "article_id": "8dbdf38ce21f",
  "url": "https://cartilagefreecaptain.sbnation.com/hoddle-of-coffee/66331/the-hoddle-of-coffee-tottenham-hotspur-news-and-links-for-friday-october-10",
  "title": "The Hoddle of Coffee : Tottenham Hotspur news and links for Friday , October 10",
  "date": "20251010T093000Z",
  "domain": "cartilagefreecaptain.sbnation.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "We’ve finally made it to the end of the week, which normally means Tottenham football is right around the corner. ‘Cept this is the international break, and we have to settle for a weekend without Spurs. What’ll we do?\nThe Hoddle of Coffee: Tottenham Hotspur news and links for Friday, October 10\nThe great news is this is the time of year when we have so many different sporting options to choose from, unless you watch the rugby.\nBut if you follow some other sports - those coming from the US - there’s plenty to follow.\nMLB\nWe’re in the most exciting time of the season - the playoffs. The LA Angels (America’s sweethearts) might be out of it, and probably were as back as May, but that doesn’t mean you shouldn’t be watching. Who doesn’t want to see Vladimir Guerrero Jr’s Toronto Blue Jays romp to the American League Championship Series?\nOf course, on the other side of the bracket we have the Los Angeles Dodgers, the other team from Southern California but north of San Diego. No, I don’t want to talk about Shohei Ohtani.\nNHL\nThe season’s finally begun! And this is a new year full of hope. Will the San Jose Sharks eclipse the bottom-of-the-table mediocrity they suffered last year? Probably not. But, as of this writing, they’re tied 1-1 versus the Las Vegas Golden Knights.\nMeanwhile, Connor McDavid’s Edmonton Oilers could be the team to beat this year, while the Florida Panthers are chasing the three-peat.\nNBA\nStill two weeks away - but we’re excited. Not really, if you’re a Suns fan.\nNFL\nThat Vikings-Browns game at Tottenham Hotspur Stadium sure was fun (and it gave us a COYS reference in today’s hoddle). Spurs host another NFL game this weekend when the Denver Broncos take on the New York Jets.\nFitzie’s track of the day: Oxford Comma, by Vampire Weekend\nAnd now for your links:\nBBC: “How Frank is tweaking Tottenham”\nJack P-B ($$): “Tottenham owners pledge ‘more money to deliver success’ after £100m injection”\nSky Sports: “Thomas Tuchel calls England fans ‘silent’ in Wales win and wants ‘energy’ from Three Lions support”\nThe Mercury News: “Kurtenbach: Three things I’m watching for at the start of this crucial Sharks season”",
  "word_count": 375,
  "scraped_at": "2026-02-14T02:26:56.612887",
  "_text_extracted": true
}