{
  "article_id": "8dc6e7e37415",
  "url": "https://www.teamtalk.com/manchester-city/man-city-accelerate-move-unstoppable-bundesliga-forward",
  "title": "Man City accelerate move for unstoppable Bundesliga forward , with rivals caught off guard",
  "date": "20250104T150000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester City\nPremier League • England\nMan City accelerate move for unstoppable Bundesliga forward, with rivals caught off guard\nManchester City have overtaken several of their Premier League rivals, including Liverpool and Arsenal, in the race to sign Omar Marmoush – but there are conflicting claims over how far they have taken their approach to the on-fire Eintracht Frankfurt forward.\nWith 18 goals and 12 assists to his name this season, Marmoush has been a revelation. The 25-year-old has caught the attention of various English clubs in recent months and seems to be interested in entertaining a move to the Premier League.\nMost recently, Arsenal were said to be ready to make the first move for Marmoush. However, Man City are the ones who have actually swooped in early.\nAccording to Foot Mercato, Man City have ‘decided to step up a gear’ in the race for Marmoush. What they imply is that the club have made an offer to the Egypt international for him to join – in the summer, rather than this month.\nIn doing so, they have stolen a march on Arsenal, Liverpool and Tottenham – all of whom have been showing interest in Marmoush too.\nThe report claims Marmoush is ‘very excited’ about the idea of joining Man City after holding talks with the club, even though he is under contract with Eintracht until 2027.\nThere have even been claims in his native Egypt that everything is set up for Marmoush to sign for Man City in a €50m (£41.5m) move in the summer – but in reality, things might not be that far forward…\nREAD MORE – Man City crisis: Nine biggest transfer mistakes that have caused Pep Guardiola downfall\nMan City transfer agreement denied\nAccording to TBR Football, Man City have ‘insisted’ that they have not yet reached an agreement with Marmoush’s current club for his transfer.\nHowever, the report claims the reigning Premier League champions have confirmed their ‘admiration’ for Marmoush – who is also on Chelsea’s radar, in addition to the aforementioned clubs.\nTheir scouts have been watching the versatile forward ‘closely’, but a January move would be unlikely while Frankfurt are aiming to qualify for the Champions League and even a summer move might cost more than the mooted €50m fee.\nTherefore, Man City will have to keep working if they intend to sign Marmoush, but they still seem to have become one of his main admirers.\nMan City transfer roundup\nMeanwhile, Man City are one of the main clubs to keep an eye on in the battle for Dani Olmo after Barcelona continued to struggle to secure his registration with LaLiga.\nPep Guardiola’s side are apparently accelerating their interest in the Spain international, who could soon be available to sign.\nHowever, there have also been claims that Barcelona could respond by taking Kevin De Bruyne away from Man City if they find it easier to fit him within their budget.\nThat, though, would require some compromise from the Premier League’s highest-paid player, who is in the final six months of his contract at the Etihad Stadium.\nIn other news, Man City are taking a close look at a Nottingham Forest defender.\nOmar Marmoush: The story so far\nFebruary 1999 – Marmoush is born in Cairo, Egypt.\nJuly 2016 – He makes his debut as a substitute in an Egyptian Premier League match for Wadi Degla.\nDecember 2016 – His first goal for Wadi Degla comes in an Egypt Cup match.\nAugust 2017 – After a total of 18 appearances and three goals for Wadi Degla, Marmoush moves to Germany to sign for Wolfsburg, initially being placed in the reserve team.\nMay 2020 – Marmoush makes his first-team debut for Wolfsburg in a Bundesliga match.\nJune 2020 – Wolfsburg reward him with his first professional contract.\nAugust 2020 – Marmoush makes his European debut in a Europa League match for Wolfsburg.\nJanuary 2021 – Wolfsburg send Marmoush on loan to St Pauli in the German second tier.\nAugust 2021 – His next loan spell is arranged to be in the Bundesliga with Stuttgart.\nSeptember 2021 – Marmoush scores on his Stuttgart debut with a last-minute equaliser and is named as the Bundesliga’s Rookie of the Month.\nOctober 2021 – Marmoush makes his international debut with Egypt and marks the occasion with a goal.\nDecember 2021 – Egypt include Marmoush in their squad for the upcoming Africa Cup of Nations, where he will go on to play in all their matches from the group stage to the final.\nMarch 2022 – For the second time, he wins the Rookie of the Month award.\nJuly 2022 – After being reintegrated by his parent club, Marmoush scores his first goal for Wolfsburg in a German Cup match.\nJanuary 2023 – Marmoush features at a second AFCON tournament with Egypt.\nMay 2023 – Eintracht Frankfurt announce they will be acquiring Marmoush on a free transfer.\nAugust 2023 – Marmoush scores on his debut for Frankfurt in the German Cup and also in his second Bundesliga appearance for them.\nSeptember 2023 – He adds his first-ever European goal by scoring a penalty against Aberdeen in the Europa Conference League.\nMay 2024 – Marmoush finishes his debut season with Frankfurt on a career-best tally of 17 goals, some of which were against clubs like Bayern Munich, Borussia Dortmund and RB Leipzig.\nOctober 2024 – Marmoush scores his first Europa League goal, while also completing a run of scoring in five successive Bundesliga matches before the international break.",
  "word_count": 919,
  "scraped_at": "2026-02-14T01:49:18.067058",
  "_text_extracted": true
}