{
  "article_id": "8dc938f9be19",
  "url": "https://www.fourfourtwo.com/features/the-most-acrimonious-transfer-exits",
  "title": "The most acrimonious transfer exits",
  "date": "20231121T091500Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The most acrimonious transfer exits\nStories of betrayal, burning effigies, street riots and pig's heads from football's controversial and craziest moves over the years...\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nFootball fans have long memories and expect loyalty from their heroes. If that trust is betrayed, their love can soon turn to hate.\nPlayers leave clubs for many reasons, but little irks a football fan more than seeing one of their own join a direct rival, moving for more money or being sold against their will.\nOften, feelings remain for a lifetime, making the player in question persona non grata at their former team. Here, we look at football's most acrimonious transfer exits...\n33. Gabriel Batistuta\nGabriel Batistuta is one of the greatest centre-forwards in Argentina's history, but the former Fiorentina attacker wasn't getting a game at River Plate under Daniel Passarella.\nBatigol rescinded his contract at River and was expected to return to Newell's, but their rivals Boca Juniors made a late offer and he was soon on his way. After a year at the Bombonera, he moved to Italy.\n32. Paul Ince\nPaul Ince angered West Ham fans when he posed with a Manchester United shirt before his move to Old Trafford had even been completed.\nThe former England midfielder was an important player at United, but later upset fans of the Red Devils by signing for Liverpool following a spell at Inter and wildly celebrating after scoring in a 2-2 draw between the two clubs.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n31. Harry Kewell\nHarry Kewell left Leeds United for Liverpool in 2003, having criticised staff at the club in an interview prior to his departure.\nLeeds had agreed a £7 million deal with the Reds but according to chairman John McKenzie, Kewell's agent demanded the fee be £5m, with the remaining £2m to be paid to his representatives. The Australian is also said to have turned down some higher offers and angered his former club again by joining Galatasaray – whose fans had stabbed two Leeds supporters to death in 2000 – after he left Liverpool in 2008.\n30. Luis Enrique\nLuis Enrique spent five seasons at Real Madrid after leaving hometown club Sporting Gijon, but the former Spain midfielder is best known for his time at Barcelona.\nHaving let his contract wind down, he joined Barcelona for free in 1996 and spent eight seasons at Camp Nou. He scored 109 goals in 300 appearances for the Catalan club and seemed to relish beating his former club. He has been a villain in Madrid ever since.\n29. Dimitri Payet\nDimitri Payet was so popular at West Ham that the club made a mural of the French midfielder at the London Stadium after he was named Player of the Year.\nBut amid interest from former club Marseille in re-signing him and the revelation that he no longer wanted to play for the Hammers, the mural had to be guarded by security to stop it from being vandalised. West Ham rejected two bids and called for the midfielder to apologise, but by the end of January he had returned to the Stade Velodrome in a £25 million deal. And the mural was taken down altogether.\n28. Thibaut Courtois\nThibaut Courtois seemed to have good reasons for wanting to swap Chelsea for Real Madrid in 2018, but the Belgian's exit from the Blues was messy.\nWith his partner and children in the Spanish capital, Courtois cited his family as the main motivation for the move, but he upset Blues fans by staying away from training in a bid to force through a transfer. He then called Real Madrid the \"best club in the world\" at his unveiling and irked Chelsea supporters more by encouraging Eden Hazard to join him in Spain. Since his move to Real, Atletico's fans have also turned on the goalkeeper, vandalising his plaque outside their stadium and showering him with toy rats on his return with their city rivals.\n27. Andy Cole\nAndy Cole left Newcastle United for Manchester United in January 1995 for a fee of £7 million in a shock move.\nNewcastle fans were upset and could not understand the transfer of a player who had scored 68 goals in just 84 appearances for the club. Manager Kevin Keegan confronted some disgruntled supporters on the steps outside St. James' Park that day to explain the transfer. Six months later, Les Ferdinand was signed as his replacement and Newcastle became serious title challengers to Manchester United.\n26. Fernando Redondo\nReal Madrid may have pulled off the transfer coup of the year when they signed Luis Figo from Barcelona in 2000, but their decision to sell Fernando Redondo a few days later proved hugely unpopular.\nAround 200 fans protested against the Argentine's sale to AC Milan outside the Santiago Bernabeu, with banners reading \"Redondo is Madrid\" and \"Figo, no; Redondo, yes!\" The player himself also made it clear that he had wanted to stay. He suffered serious injury in one of his first training sessions in Italy and did not play again for well over two years.\n25. Raheem Sterling\nRaheem Sterling was signed by Liverpool from QPR's academy and excited the fans at Anfield in the first few seasons of his career.\nBut the young winger forced his way out of the club at just 20 years old, when he gave an unsanctioned interview to BBC Sport in the middle of a controversial contract dispute. Citing his desire to win the Premier League, he ended up moving to Manchester City. Liverpool fans have never forgiven him.\n24. Pierre van Hooijdonk\nPierre van Hooijdonk angered Nottingham Forest fans when he went on strike in August 1998, claiming the club reneged on an agreement to let him leave.\nPriced out of a transfer, he eventually got back to playing but scored only six goals in 21 games as Forest were relegated and joined Vitesse Arnhem at the end of the 1998/99 season.\n23. Romelu Lukaku\nFollowing a difficult spell at Manchester United, Romelu Lukaku rebuilt his career in Italy with two spectacular seasons at Inter.\nAfter hitting 64 goals in 95 games, he was transferred to Chelsea, but went back to Inter on loan for the 2022/23 season. Expected to return permanently, it emerged he had also been in contact with Inter's big rivals Juventus and AC Milan, so the club's ultras reacted with an angry statement calling him a \"traitor\" and handed out 40,000 whistles to \"welcome\" him when he visited San Siro as a Roma player in October 2023.\n22. Fernando Torres\nFernando Torres quickly became a fan favourite at Liverpool following his move from Atletico Madrid in 2007, but the Spanish striker broke the hearts of those supporters when he left to join Chelsea in 2011.\nTorres was unsure of the direction Liverpool were taking and asked for a move, though he has since spoken of his affection for the Anfield club and how he has been unfairly depicted as a traitor. He was not the same player at Chelsea, but did win major silverware with the Blues – including the Champions League in 2012.\n21. Alan Smith\nYorskshire-born striker Alan Smith was a hero at Leeds United and cried when the club were relegated in 2004. But his move to rivals Manchester United that summer caused huge controversy.\nSmith had previously been on record saying he would never play for the Red Devils and was dubbed a traitor by many Leeds fans. In truth, though, the Whites could no longer afford to pay his wages and sold him to the Old Trafford outfit because they were the only club offering the money up front.\n20. Cristiano Ronaldo\nReal Madrid tried to sign Cristiano Ronaldo from Manchester United in 2008 and, irritated by Los Blancos' transfer tactics, Sir Alex Ferguson famously said: \"I wouldn't sell that mob a virus.\"\nBut the Portuguese was set on a move to Madrid and a year later, the transfer finally went ahead for a record fee of €94 million. Ronaldo returned to Old Trafford in 2021, of course, but left in controversial circumstances as his contract was terminated after he criticised the club in an explosive television interview.\n19. John Robertson\nJohn Robertson was a big part of Nottingham Forest's success in the 1970s under Brian Clough and Peter Taylor, but his transfer to rivals Derby County drove a huge rift between the two men which was never repaired.\nClough was upset at how his former assistant signed Robertson for Derby and the two men never spoke again. Robertson was relegated at Derby and had minimal impact in two seasons at the Baseball Ground. He briefly returned to Forest in 1985/86.\n18. Robin van Persie\nRobin van Persie scored 132 goals in 278 appearances for Arsenal between 2004 and 2012 and was an extremely popular player at the north London club.\nBut the Dutch forward received horrific abuse after moving to rivals Manchester United in 2012. Later, he revealed he had not been offered a new deal by the Gunners. He spent three seasons at Old Trafford and won the Premier League in 2012/13.\n17. Enrique Borja\nMexico striker Enrique Borja was expecting to renew his contract with Pumas in 1969, only to be told he was being transferred to their local rivals America.\nBorja was happy at Pumas and publicly declared that he hoped to stay. Frustrated at his situation, he even set up a meeting with the Mexican president to ask for help. He signed for America in the end and became an idol, but it was a scandal at the time and fuelled more fire in a growing rivalry between two of Mexico City's biggest clubs.\n16. Nick Barmby\nAfter Nick Barmby's impressive form for Everton in 1999/2000, chairman Bill Kenwright wrote a letter to England manager Kevin Keegan in which he urged him to hand the forward a recall.\nLater, he may have regretted that as Barmby met Liverpool manager Gerard Houllier in a late-night rendezvous and the player agreed to sign for the Reds. It was the first time since 1959 that Everton had sold a player to Liverpool and on his return to Goodison Park, a significant number of supporters sang \"Die, die, Nicky, Nicky, die\" to the tune of She'll Be Coming 'Round the Mountain.\n15. Lionel Messi\nBarcelona fans were furious when Lionel Messi left for Paris Saint-Germain in 2021, with groups of angry supporters gathering outside Camp Nou to air their frustration.\nMany were already angry at the French club following Neymar's transfer in 2017 and some blamed LaLiga president Javier Tebas for the Argentine's exit, due to the competition's strict financial rules which meant the club could not afford to keep him. \"F**k Tebas, F**k PSG. Stay, Messi!\" one banner read.\n14. Kaka\nAC Milan coach Carlo Ancelotti admitted he had no say in the future of Kaka as it emerged that the Brazil attacker was close to a move to Real Madrid in 2009.\nBut outside the club's headquarters, hundreds of fans protested against the proposed transfer. The building was defaced in the demostrations, which continued at San Siro days later. \"Kaka is priceless,\" one banner read. But Madrid signed the Brazilian for £60 million.\n13. Gonzalo Higuain\nGonzalo Higuain was adored by Napoli fans during his three-year spell at the club between 2013 and 2016, but all of that changed when he moved to Juventus.\nWhen he returned to San Paolo for the first time after his €90 million transfer, Higuain was met with a banner calling him a \"dirty rotten scoundrel\" and outside the stadium, vendors sold toilet rolls with his face on the front and images of him sitting in a toilet bowl.\n12. Hugo Sanchez\nAtletico Madrid fans have still not forgiven Mexican striker Hugo Sanchez for making the move across town to fierce rivals Real Madrid in 1985.\nSanchez spent four seasons at Atletico and scored 82 goals in 152 games. In order to avoid a backlash from fans, he was briefly transferred back to Pumas in Mexico before signing for Real Madrid in July 1985. At Atletico's Metropolitano stadium, every player who had made 100 appearances or more for the club has a plaque – and his is regularly vandalised.\n11. Carlos Tevez\nWhen Carlos Tevez complained to the press at not being offered a new contract at Manchester United, the club's fans chanted \"Fergie, sign him up!\" during the derby against Manchester City in May 2009.\nBut the Argentine's two-year loan deal came to an end and he signed for City instead. United's Old Trafford stadium is outside the city boundaries and to mock their rivals, City erected a billboard in the centre. \"Welcome to Manchester,\" it read. In response, United fans made their own banner with the same wording, alongside images of all their trophies. Tevez was also pelted with objects and loudly booed on his return to Old Trafford.\n10. Neymar\nWhen rumours of a possible transfer for Neymar to Paris Saint-Germain first surfaced in the summer of 2017, they were quickly dismissed by Barcelona. But the story would not go away.\nTeam-mate Gerard Pique famously posted a picture with the Brazilian on Twitter. \"He's staying,\" it read. But the forward ended up leaving after PSG paid his €222 million release clause and there was nothing Barça could do. Their fans were furious and the Brazilian had to be held back as he was confronted by angry supporters in a nightclub just a couple of days before the transfer was completed.\n9. Mario Gotze\nJust 36 hours before their Champions League semi-final against Real Madrid, Borussia Dortmund were rocked by the news that fan favourite Mario Gotze had agreed to sign for rivals Bayern Munich in the summer.\nSupporters held up banners saying \"Gotze out\" and \"Gotze Judas\", while a video of his BVB shirt being burned was posted on YouTube. There were also reports that his younger brother had to leave school early after he was taunted with \"traitor\" chants. Gotze returned to Dortmund in 2016.\n8. Ashley Cole\nAshley Cole was fined by the Premier League after an illegal meeting with Chelsea in 2005, but ended up making a controversial move from Arsenal to the Blues the following year.\nCole wrote in his book that he was \"trembling with anger\" after Arsenal offered him wages of £55,000 per week. He went on to earn a lot more at Chelsea, but infuriated Gunners fans, who called him \"Cashley\" and waved fake money at him on his return to the Emirates Stadium.\n7. Diego Maradona\nDiego Maradona led Napoli to their greatest triumphs in the second half of the 1980s, winning two Serie A titles and the UEFA Cup in a glorious era, but the Argentine great departed under a cloud in 1991.\nBanned for 15 months for cocaine use, Maradona left Napoli in disgrace and was never the same again. The city was in mourning and the club in decline as a dark period began without their legendary number 10.\n6. Mo Johnston\nMo Johnston's Celtic exit in 1987 was not acrimonious, but his return to Glasgow after two seasons in France with Nantes certainly was.\nJohnston was a Celtic fan and a Catholic and had been photographed back at the club, with his return already announced. But Rangers swooped at the last minute and manager Graeme Souness convinced the Scotland striker to join them instead. The Gers did not openly sign Catholic players and the move caused outrage at both clubs. At Rangers, he was ultimately accepted, but he will not be welcome back at Celtic any time soon.\n5. Eusebio\nEusebio was born in Mozambique and played for Sporting CP feeder club Lourenco Marques. Following his impressive performances, they had hoped to bring him to Portugal.\nBut Lisbon rivals Benfica struck a deal with the player and that infuriated Sporting. Word was spread that he had been kidnapped by Benfica, while the Eagles hid him away from their rivals in a hotel in the Algarve and warned him not to go out. Sporting disputed the legality of the deal, but Eusebio ultimately signed for Benfica and became a legend for club and country.\n4. Johan Cruyff\nJohan Cruyff will forever be synonymous with Ajax, but the Dutch legend angered fans of the Amsterdam club by joining fierce rivals Feyenoord in 1983.\nCruyff had returned to Ajax at the end of his career but was upset at not being offered an extension after two successful seasons, so he responded by moving to Feyenoord for a year before retirement.\n3. Roberto Baggio\nRoberto Baggio's transfer to Juventus in 1990 infuriated Fiorentina fans and caused riots on the streets of Florence.\nBaggio later said he had been \"compelled to accept the transfer\" and angered Juve's supporters by picking up a Fiorentina scarf after he was substituted on his return to the Artemio Franchi and saying he was \"purple deep down\".\n2. Sol Campbell\nSol Campbell was one of the world's best defenders in 2001 and could have signed for any club in the world, but let his contract wind down as he insisted he wanted to concentrate on his football.\n\"I'm staying,\" he said in one post-match interview. But he rejected a new deal at Spurs and signed for their north London rivals Arsenal instead. For free. Tottenham fans hung an effigy outside White Hart Lane and held up Judas banners on his return.\n1. Luis Figo\nReal Madrid president Florentino Perez stood for the club elections in 2000 and promised to sign one of Barcelona's best players: Luis Figo.\nPerez had not been expected to win but did, Figo could not get out of the agreement and another chapter was written in this bitter rivalry. Barça fans burned his picture on his return to Camp Nou and threw a series of objects at the Portuguese when he went to take the corners in a match in 2002 – including a pig's head.\nBen Hayward is a European football writer and Tottenham Hotspur fan with over 15 years’ experience, he has covered games all over the world - including three World Cups, several Champions League finals, Euros, Copa America - and has spent much of that time in Spain. Ben speaks English and Spanish, currently dividing his time between Barcelona and London, covering all the big talking points of the weekend on FFT: he’s also written several list features and interviewed Guglielmo Vicario for the magazine.",
  "word_count": 3201,
  "scraped_at": "2026-02-14T01:54:16.875868",
  "_text_extracted": true
}