{
  "article_id": "8dd4fc58c4b2",
  "url": "https://www.nytimes.com/athletic/6066943/2025/01/21/champions-league-knockout-play-off-phase-explained/",
  "title": "How will the Champions League knockout play - offs work ? ",
  "date": "20250121T183000Z",
  "domain": "nytimes.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The revamped Champions League is nearing the knockout phase and in a week’s time, we’ll know which teams will have made it through to the next stages.\nThe top eight from the 36-team league phase will automatically qualify for the last 16, leaving another eight spaces to be decided through the play-off route.\nAdvertisement\nTeams finishing ninth to 24th will compete in a two-legged play-off, which means, as it stands at least, Manchester City — currently 25th after their 4-2 loss to Paris Saint-Germain — won’t make the play-offs.\nPSG, who are 22nd, holders Real Madrid and other big-name clubs like City and Juventus are not where many would have expected them to be in the table at the start of the campaign. Madrid (16th) and Juventus (17th) are currently in play-off spots.\nThere will be plenty of jeopardy in the final round of fixtures on Wednesday, February 29, as these sides chance their arm at a top-eight spot or, in City’s case, simply making the play-offs and avoiding elimination from the competition altogether.\nThe table as it stands\nHave teams already qualified?\nYes. Liverpool and Barcelona, currently occupying the top two spots in the table, are through to the last 16. Both rubber-stamped their progress with victories on Tuesday which confirmed a top-eight finish.\nLeague phase leaders Liverpool went through thanks to a 2-1 win over Lille on Tuesday in the penultimate round of fixtures while Barcelona’s incredible 5-4 win over Benfica ensured they progressed and denied Liverpool the chance of wrapping up the top slot in the league phase.\nBut, as they say, everything else is still to play for and the remaining fixtures — the final round on January 29 when every team will play on the same night — will be crucial to the final standings.\nAt the other end of the table, nine teams have been eliminated, including RB Leipzig and Girona. As things stand, the permutations for every other team are more complicated. You can read more about our projection model and what teams need to qualify here.\nWhen do the knockout stages begin?\nThe knockout play-offs begin on February 11 and 12, with the second legs on February 18 and 19. From the play-offs onwards, the tournament is a bracket, ending with the final at the Allianz Arena in Munich, Germany, on May 31.\nThe full knockout dates are below:\n- Knockout phase play-offs: February 11, 12 and February 18, 19\n- Round of 16: March 4, 5 and March 11, 12\n- Quarter-finals: April 8, 9 and April 15, 16\n- Semi-finals: April 29, 30 and May 6, 7\n- Final: May 31\nHow will the play-off draw work?\nThe play-off draw will be held on January 31 at the House of European Football in Nyon, Switzerland, and will be streamed live on UEFA.com.\nAdvertisement\nClubs that finished ninth to 16th in the league are seeded in four pairs (9 and 10, 11 and 12 and so on) and the rest will make up four unseeded pairs (17 and 18, 19 and 20 etc).\nEach seeded pair will be drawn against an unseeded pair. For example, nine or 10 will play 23 or 24, while the teams that finished 11th or 12th will come up against the teams that were 21st or 22nd in the league. The aim is for seeded clubs to play their return legs at home.\nThe draw allocates each team from a pair to one of the pre-determined positions in the bracket.\nFor example, for the first draw, one of the clubs ranked 23rd or 24th will be drawn in one side of the bracket, leaving the other to be automatically placed on the opposite side. The unseeded pairings will be drawn first, with the process then repeated for the seeded pairings, starting from the teams ranked 15 and 16.\nTeams can be drawn against another from the same country or an opponent they faced during the league phase. The eight teams that come through the play-off phase will then progress to the last 16. The top two seeds (currently Liverpool and Barcelona) cannot play each other until the final.\n(Top photo: Maria Gracia Jimenez/Soccrates/Getty Images)",
  "word_count": 698,
  "scraped_at": "2026-02-14T02:08:52.965388",
  "_text_extracted": true
}