{
  "article_id": "8dd6e1ebd178",
  "url": "https://www.teamtalk.com/manchester-united/ten-hag-heaps-praise-on-exiled-man-utd-winger-with-big-hint-dropped-on-uncertain-future",
  "title": "Ten Hag heaps praise on exiled Man Utd winger with big hint dropped on uncertain future",
  "date": "20240419T214500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United\nPremier League • England\nTen Hag heaps praise on exiled Man Utd winger with big hint dropped on uncertain future\nManchester United boss Erik ten Hag acknowledged “fantastic” Jadon Sancho’s role in Borussia Dortmund progress to the Champions League semi-finals, but said nothing has changed regarding his future.\nSancho, 25, rejoined Dortmund in January after a very public falling out with Ten Hag earlier this season and has since regained some confidence having begun to play regularly under Edin Terzic at Signal Iduna Park.\nThe 24-year-old played 86 minutes in Dortmund’s Champions League quarter-final second-leg victory over Atletico Madrid, which has seen them set up a repeat of their Group F clash with Paris Saint-Germain in the last four.\nTrailing 2-1 from the first leg in Madrid, Dortmund ran out 4-2 winners thanks to goals from Julian Brandt, Ian Maatsen, Niclas Fullkrug and Marcel Sabitzer.\nAsked about Sancho in his pre-match press conference ahead of the FA Cup semi-final clash with Coventry City this weekend, Ten Hag praised the winger but refused to be drawn on whether he may be reintegrated upon his return in the summer.\n“Of course, I follow international football and follow the players on loan at other clubs,”, Ten Hag said.\n“It was a fantastic game, Dortmund against Atletico Madrid. A great performance from Dortmund and also for Jadon it’s good news. He made his contribution to the result for Dortmund.\n“We know Jadon Sancho is a fantastic football player, so that is not a surprise for us. That is not the issue.”\nMan Utd return unlikely for Sancho while Ten Hag remains\nSancho’s form in his first spell, when he scored 38 Bundesliga goals and registered 45 assists in four seasons, persuaded United to spend £72m on him in 2021 when Ole Gunnar Solskjaer was in charge. But he struggled to find that consistency at Old Trafford even before Ten Hag’s arrival a year later.\nAn angry social media post from Sancho in September in response to comments made by Ten Hag about his performances in training following a defeat to Arsenal, a game which Sancho was not involved in, sparked an exile from the first team and his eventual Dortmund return.\nA reconciliation between player and manager seems unlikely, but there is not believed to be any clauses to extend Sancho’s stay in Germany.\nAs things stand, United are still planning to sell Sancho in the summer. That could change, however, if Ten Hag is sacked by Sir Jim Ratcliffe ahead of next season.\nDON’T MISS – Man Utd on red alert as striker target incredibly decides own price tag and namechecks Arsenal",
  "word_count": 441,
  "scraped_at": "2026-02-14T02:07:51.325607",
  "_text_extracted": true
}