{
  "article_id": "8dda569dffb7",
  "url": "https://www.finanznachrichten.de/nachrichten-2025-04/65134103-pepsico-linkin-park-to-rock-the-uefa-champions-league-final-kick-off-show-presented-by-pepsi-008.htm",
  "title": "PepsiCo : LINKIN PARK TO ROCK THE UEFA CHAMPIONS LEAGUE FINAL KICK OFF SHOW PRESENTED BY PEPSI",
  "date": "20250416T103000Z",
  "domain": "finanznachrichten.de",
  "source_country": "Germany",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "- Pepsi reveals the iconic global superstars will headline the UCL final's unmissable annual 'Kick Off Show'\n- LINKIN PARK has composed and recorded an electrifying new remix which blends their signature sound with the culture of European football\n- The signature track features in a short film to mark the announcement\nPURCHASE, New York, April 16, 2025 /PRNewswire/ --\nPepsiKickOffShow\nPepsi® and UC3 are excited to announce that LINKIN PARK will headline the UEFA Champions League Final Kick Off Show presented by Pepsi on May 31st at the Munich Football Arena. Pepsi and UEFA will once again mark the final with its eagerly anticipated curtain raiser, with the event set to be an unforgettable experience just minutes ahead of the match.\nLINKIN PARK recently made a triumphant return to the spotlight with the release of FROM ZERO, their first new music in seven years. The album hit the top of the charts across the globe and features #1 smashes \"Heavy Is The Crown\" and \"The Emptiness Machine,\" which surged as the biggest rock song of 2024 with over 250 million streams. Notably, as reported by Billboard, LINKIN PARK was the one-and-only rock band to cross over 2 Billion yearly streams in 2024. The momentum continues this year with their ferocious new single \"Up From The Bottom,\" taken from their upcoming From Zero (Deluxe Edition), releasing on May 16. Meanwhile, the band continues their massive From Zero World Tour, picking up next in Austin, TX on April 26, winding their way across sold-out stadiums in Europe for the summer, and culminating in South America this fall.\nNow, for 2025, LINKIN PARK is taking its brand-new era to new heights, by revealing that they will be taking the stage at this year's UEFA Champions League Final Kick Off Show presented by Pepsi, with a setlist representing the best of their legacy, past and present.\nTo announce this iconic collaboration, LINKIN PARK has composed and recorded an electrifying new remix which features in a short film to mark the announcement. The featured track blends the band's iconic sound with the culture of European football, incorporating the immediately recognisable riffs of their 4X Platinum hit \"Numb,\" with sounds inspired by UEFA Champions League football - the strike of leather, the whistle of a free kick, the sounds of the most passionate fans in the world. The film goes on to deliver an emotionally charged performance of the new bespoke track, together with high-octane UEFA Champions League football footage, paying homage to the way the UEFA Champions League Final Kick-Off Show presented by Pepsi clashes football and entertainment together to create one night of epic entertainment.\nLINKIN PARK commented: \"With our new album and ongoing tour, we've been overwhelmed by the fans' energy and excitement. We can't wait to share that same energy and excitement at the UEFA Champions League Final Kick Off Show presented by Pepsi. This marks a totally new experience for us as a band, and we're excited to share some of our favourite songs from the past and present, with the thousands in the crowd and millions watching around the world.\"\nEric Melis, VP of Global Brand Marketing - Pepsi at PepsiCo, added: \"We are proud to announce that one of the most influential rock bands of the 21st century will be headlining this year's UEFA Champions League Final Kick Off Show presented by Pepsi. This marks our ninth year bringing together millions of viewers from around the world, with LINKIN PARK sure to put on a show like no other, live from the Munich Football Arena in Germany. We're delighted to be working with a group of artists who live by our 'Thirsty For More' philosophy, reflecting the same spirit of innovation and boldness that Pepsi embodies - and we can't wait to see how fans react to this unmissable show.\"\nGuy-Laurent Epstein, Co-Managing Director, UC3, said: \"This year's UEFA Champions League Final Kick Off Show presented by Pepsi promises to be a spectacular moment, with one of the world's most iconic rock bands performing live just minutes before the biggest match in European club football. Together with Pepsi, we're proud to continue enhancing the fan experience - both in the stadium and for millions watching around the world - with unforgettable entertainment on and off the pitch.\"\nOnce more, Pepsi and UEFA have marked the UEFA Champions League final with a momentous music performance showcasing the world's most iconic artists and uniting football and music fans through one compelling entertainment spectacle. The UEFA Champions League Final Kick Off Show presented by Pepsi will be aired all around the world and territories globally, just minutes before the stand-out fixture of the club football calendar commences and is the embodiment of Pepsi's 'Thirsty For More' global platform.\nFans can tune in to watch the Kick Off Show via their local broadcaster and through the official UEFA YouTube channel. Fans are encouraged to stay in-the-know by following Pepsi on Instagram, X (formally Twitter), and Facebook.\nPEPSIKICKOFFSHOW\nVideo - https://www.youtube.com/watch?v=w8PZe0EnNhM\nPhoto - https://mma.prnewswire.com/media/2665870/PEPSI_KICK_OFF_SHOW.jpg\nLogo - https://mma.prnewswire.com/media/2665176/Pepsi_Logo.jpg\nView original content:https://www.prnewswire.co.uk/news-releases/linkin-park-to-rock-the-uefa-champions-league-final-kick-off-show-presented-by-pepsi-302430154.html\nGleichzeitig vollzieht sich an der Wall Street ein lautloser Favoritenwechsel. Während viele auf Wachstum setzen, feiern Value-Titel mit verlässlichen Cashflows ihr Comeback: Telekommunikation, Industrie, Energie, Pharma – die „Cashmaschinen“ der Realwirtschaft verdrängen hoch bewertete Hoffnungsträger.\nIn unserem aktuellen Spezialreport stellen wir fünf Aktien vor, die genau in dieses neue Marktbild passen: solide, günstig bewertet und mit attraktiver Dividende. Werte, die nicht nur laufende Erträge liefern, sondern auch bei Marktkorrekturen Sicherheit bieten.\nJetzt den kostenlosen Report sichern – bevor der Value-Zug 2026 endgültig abfährt!\nDieses exklusive PDF ist nur für kurze Zeit gratis verfügbar.",
  "word_count": 940,
  "scraped_at": "2026-02-14T02:11:32.315388",
  "_text_extracted": true
}