{
  "article_id": "8dec12e9a648",
  "url": "https://metro.co.uk/2025/02/19/steve-sidwell-tells-three-chelsea-stars-to-step-up-ahead-of-aston-villa-clash-22586730/",
  "title": "Steve Sidwell tells three Chelsea stars to  step up  ahead of Aston Villa clash",
  "date": "20250219T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Ex-Chelsea midfielder Steve Sidwell has called on Jadon Sancho, Noni Madueke and Christopher Nkunku to ‘step up to the plate’ to help steer the club out of the rut they find themselves in this season.\nChelsea surpassed expectations across a promising start to the campaign, with Enzo Maresca’s men suffering just three league losses heading into the Christmas period.\nBut the west London giants fell to a disappointing Boxing Day defeat at the hands of local rivals Fulham and have badly struggled since, picking up only two wins from seven in the Premier League.\nMaresca’s attacking options, including Cole Palmer, have been found wanting in the most part since the turn of the year and an injury to Nicolas Jackson has threatened to further derail the Blues at this crucial stage of the season.\nThe drastic decline in form has seen Chelsea drop out of the top four, which they will look to rectify this weekend away to Aston Villa on the back of a dismal 3-0 mauling at Brighton.\nSidwell, who spent one season at Stamford Bridge as a player, believes Maresca lacks the experienced heads in his squad capable of rallying the troops when times are tough.\nAnd while Sidwell has sympathy for Chelsea’s youngster stars as a result, he feels it is time for the likes of Sancho, Madueke and Nkunku to stand up and be counted.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘Their model is, “We’re going to buy all the best young talent in England, Europe and the world”, so they’ve got the youngest average team in the Premier League,’ Sidwell said on The Dressing Room Podcast.\n‘They haven’t played anyone over the age of 30 in a Premier League game this season. So when you start buying all the young talent, then it’s about getting a head coach who is going to develop them.\n‘We all know in football that some players can develop quicker than others so it’s a waiting game.\n‘When I look at Chelsea now, up until probably Christmas, when they were playing and performing well, it’s all fine and then when they hit a rocky patch it’s a case of who is pulling people together.\n‘That shows with the performances. Their first to second half performances have been chalk and cheese in terms of scoring and conceding goals.\n‘There are loads of factors. Their backline has been very disjointed with injuries, relying on Cole Palmer. Sancho, Madueke, Nkunku, it’s been a bit unfair with him because he hasn’t had a run of games, but they need to step up to the plate.’\nMore Trending\nAccording to Sidwell, it should be deemed a ‘great achievement’ if Maresca manages to lead Chelsea into the Champions League qualification places this season.\n‘They are in a project, they’ve overachieved this year,’ he added.\n‘When they got to second in the Premier League and two points behind Liverpool… that wasn’t a true reflection. Since Enzo Maresca said that it has gone the other way.\n‘It’s a project, we’ve got to remember that, and if they get top four… well top five gets you Champions League now… which would be a great achievement for them and then you build on that again.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Ademola Lookman blasts ‘deeply disrespectful’ Atalanta manager after penalty miss\nMORE: Liverpool legend sends stark Mohamed Salah warning to Premier League leaders\nMORE: Arsenal eyeing transfer move for £66m Bundesliga striker",
  "word_count": 637,
  "scraped_at": "2026-02-14T02:02:19.831813",
  "_text_extracted": true
}