{
  "article_id": "8dfa6c665735",
  "url": "https://toffeeweb.com/season/24-25/rumour-mill/46247.html",
  "title": "Everton learn price tag of striker target Rumour Mill",
  "date": "20250605T164500Z",
  "domain": "toffeeweb.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Season › 2024-25 › News\nEverton learn price tag of striker target Thierno Barry\n| 05/06/2025Everton would need to pay a fee of €40m (£33.6m) to sign Villarreal forward Thierno Barry this summer.\nBarry is one of several targets David Moyes is considering, as the Blues look to bring in competition for Beto in attack. Dominic Calvert-Lewin’s future is yet to be resolved and Armando Broja’s injury-hit loan from Chelsea will not be made permanent. Barry is a player Everton have watched closely this season.\nThe 22-year-old impressed at Villarreal after joining from FC Basel last summer. He scored 11 goals in La Liga as the Spanish side secured Champions League football for 2025/26.\nVillarreal are keen to keep Barry at El Madrigal, though a release clause in the player’s contract opens up an opportunity for Everton. TEAMTalk claim Barry can be signed for a fee of €40m (£33.6m).\nThe 6ft 5in forward is currently with the France squad preparing for this summer’s u-21 European Championship. Last season, Barry ranked eighth in La Liga for aerial duels won and in the top one percent of forwards across Europe for percentage of aerial duels won.\nOther Premier League sides are also reportedly weighing up a move for the French forward, including Aston Villa.\nReader Comments (9)\nNote: the following content is not moderated or vetted by the site owners at the time of submission. Comments are the responsibility of the poster. Disclaimer ()\n1 Posted 05/06/2025 at 16:31:24\n2 Posted 05/06/2025 at 17:02:36\nRobert Tressel rates this guy very highly so that’s good enough for me.\nI agree Chermitti has looked promising but we’ll have to trust Moyes judgement on that one.\n3 Posted 05/06/2025 at 17:04:17\nChermiti could be better in due course but it’s vital he plays a lot of games this season otherwise he’s just stagnating. A loan beckons\n4 Posted 05/06/2025 at 17:05:42\n5 Posted 05/06/2025 at 17:26:48\nWhat concerns me is that Chermiti seems to be perpetually a “future prospect” rather than ready to step in to the first team squad. I’ve seen talk of him going out on loan again.\nSo the question is, is he really all that??\nIF DCL goes then yes, this Barry fella looks a good option. Personally I think Beto can get 15-18 goals with a good run in the team.\n6 Posted 05/06/2025 at 23:16:16\nI heard Mesi is definitely coming to us, and he's buying the dock next to BM and turning it Into a Heli pad to airlift all the blues to the game free using giant military helicopters bought from the Argentina army, with free cake, honest !!!\n7 Posted 06/06/2025 at 13:34:54\nThere is absolutely no way we will get free cake.\n8 Posted 06/06/2025 at 18:57:18\nWell they are Eccles Cakes actually, but they still count and are a staple food in Argentina.😀\n9 Posted 06/06/2025 at 23:12:00\nIMO £33.6M is a big bite for Barry, but not outlandish by any means given what he has shown so far, raw or not. Robert, you described him as a younger Beto and I agree. The fans would certainly love his aggression. If Calvert-Lewin doesn't return, there are a number of candidates worth considering, but I think Barry is a swing worth taking.\nAdd Your Comments\nIn order to post a comment, you need to be logged in as a registered user of the site.\nOr Sign up as a ToffeeWeb Member — it's free, takes just a few minutes and will allow you to post your comments on articles and Talking Points submissions across the site.\nHow to get rid of these ads and support TW",
  "word_count": 611,
  "scraped_at": "2026-02-14T01:58:41.960879",
  "_text_extracted": true
}