{
  "article_id": "8e01fa54b427",
  "url": "https://www.aol.com/north-macedonia-vs-england-live-180037578.html",
  "title": "North Macedonia vs England LIVE : Euro 2024 qualifier result and reaction as Three Lions held to draw",
  "date": "20231121T021500Z",
  "domain": "aol.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "North Macedonia vs England LIVE: Euro 2024 qualifier result and reaction as Three Lions held to draw\nEngland were held to a drew in their final Euro 2024 qualifying fixture after another sluggish performance against North Macedonia. It was a frustrating night for the Three Lions who desperately hoped for an improved performance after they edged past Malta 2-0 on Friday.\nThey started well enough and had a bit of zip and tempo back in their passing which was evidently missing last week. Declan Rice hit the woodwork after just 15 minutes but the hosts grew in confidence. Rico Lewis, making his debut for the senior team, was a bright spark but a stray hand when clearing an aerial ball out of his own box forced a VAR check and North Macedonia won a penalty - Enis Bardhi slotting it past Jordan Pickford on the rebound after the goalkeeper initially saved it.\nEngland went into the break behind but came out strongly once again. Jack Grealish thought he had an equaliser only for it to be ruled out for offside. Harry Kane’s introduction into proceedings resulted in an own goal going against the hosts but the Three Lions were unable to press their advantage and claim the win.\nRelive the action from this Euro 2024 qualifier below:\nNorth Macedonia vs England live\nLacklustre England end Euro 2024 qualifying campaign with a whimper\nFT - England draw with North Macedonia and end qualifying campaign unbeaten\n59’ GOAL! - Kane’s pressure results in an own goal after his introduction off the bench (MKD 1-1 ENG)\n49’ NO GOAL! - Grealish’s effort is ruled out for offside (MKD 1-0 ENG)\n47’ GOAL! - Grealish taps in after Saka dances into the box (MKD 1-1 ENG)\n41’ GOAL! - Bardhi puts the ball home on the second attempt (MKD 1-0 ENG)\n39’ PENALTY! - North Macedonia awarded controversial penalty (MKD 0-0 ENG)\n15’ POST! - Rice’s low effort strikes the woodwork (MKD 0-0 ENG)\nNorth Macedonia 1 - 1 England\nLacklustre England end Euro 2024 qualifying campaign with a whimper\n22:13 , Mike Jones\nEngland toiled to a 1-1 draw in North Macedonia as their Euro 2024 qualifying campaign came to a lacklustre close.\nGareth Southgate’s side secured qualification to next summer’s finals in Germany last month and a forgettable draw in Skopje was at least enough to confirm them among the top seeds for December’s draw.\nDebutant Rico Lewis endured a night to forget at the Tose Proeski Arena as he conceded a controversial first-half penalty which Jordan Pickford saved before Enis Bardhi turned home the rebound.\nCaptain Harry Kane came off the bench and played a part in the leveller as Jani Atanasov scored an own goal but England failed to find a winner.\nLacklustre England end Euro 2024 qualifying campaign with a whimper\nEngland’s Rico Lewis on Channel Four\n22:36 , Mike Jones\n“Obviously, overall I’m very happy. Unfortunate with the result and the decision that went against me. It’s a lovely birthday present, to do it with these people around me, it couldn’t have been better.”\nReaction from Harry Kane\n22:15 , Mike Jones\nEngland forward Harry Kane spoke to Channel 4 after the match saying: “Difficult game, we knew it would be and it was tough against a decent side playing on a pitch that’s difficult to play our style of football.\n“We went 1-0 behind against the run of play with a soft penalty. It was good to get on the pitch, I’m always trying to help the team whether it is 90 minutes or 10 minutes. It was important for us to get a goal back and a shame we couldn’t get a second.\n“I think it was an own goal, pretty sure. If anyone was going to get a second it was us.\n“Against Malta we were sloppy on the ball, today we got a bit of a sucker-punch with the counter-attack and a soft penalty. We were playing against a team that people expected us to beat five or six nil, but they did a job on Italy in the World Cup qualifiers to knock them out.\n“We can be really proud of how the qualifying campaign has gone.”\nOn debutant Rico Lewis: “I thought he was really good with and without the ball. A shame for the penalty but he can be proud, I thought he was fantastic. He just needs to keep working hard and I’m sure he will be back with us.”\nFT North Macedonia 1-1 England\n22:09 , Mike Jones\nEngland have benefitted from an own goal in consecutive games (Enrico Pepe for Malta on Friday, Jani Atanasov tonight) for the first time since June 2006 vs Jamaica and Paraguay.\nFT North Macedonia 1-1 England\n22:05 , Mike Jones\nThis was only the third time in their last 26 European Championship qualifiers that England have failed to win (won 23, drawn two, lost one).\nThey’ve gone two consecutive away Euro qualifiers without a win for the first time since March 2007 under Steve McClaren.\nFT North Macedonia 1-1 England\n22:01 , Mike Jones\nEngland failed to beat a side ranked as low as 66th in the Fifa Rankings for the first time since October 2016 in a goalless draw with Slovenia (67th at the time), in what was Gareth Southgate’s second game in charge.\nFT North Macedonia 1-1 England\n21:57 , Mike Jones\nElsewhere in Euro 2024 qualifying Italy, the Czech Republic and Slovenia have all secured their spots for next summer’s tournament.\nItaly, the reigning European champions, held on for a 0-0 draw against Ukraine to scrape through thanks to a better head-to-head record.\nCzech Republic earned a 3-0 win over Moldova, while Slovenia’s 2-1 victory over Kazakhstan takes them to Germany.\nFull-time! North Macedonia 1-1 England\n21:44 , Mike Jones\n90+6 mins: England finish their European Championship qualifying campaign unbeaten. They finish their calender year unbeaten, they’ll be in pot one for the seeding at next summer’s Euros.\nBy most markers this is a good result but England will be disappointed with the performance again. They cancelled out a controversial penalty thanks to an own goal.\nIt’s been lacklustre international break and Gareth Southgate has some planning to do for next year.\nNorth Macedonia 1-1 England\n21:41 , Mike Jones\n90+3 mins: Mark Guehi sends the ball long and picks out Harry Kane. He nods the ball down for Phil Foden but England retreat from the final third.\nThey’ve not been on it at all in these two matches.\nNorth Macedonia 1-1 England\n21:37 , Mike Jones\n90 mins: Six minutes of added time to play in Skopje as Marcus Rashford lines up a free kick. He goes for goal, catches it well enough and fires it wide of the far post.\nIs there time for a winning goal?\nNorth Macedonia 1-1 England\n21:34 , Mike Jones\n87 mins: Walker takes out Elmas as the North Macedonian forward looks to come forward down the left side. The free kick is taken short and comes out to Elmas on the same wing.\nHe swings in a cross and finds Nikola Serafimov who pumps a headed effort over the top of the crossbar.\nNorth Macedonia 1-1 England\n21:31 , Mike Jones\n84 mins: Phil Foden is doing his best to get England a winner. He’s sending a lot of balls into the box and looking for willing runners. One of them is Bukayo Saka who nods a chance wide of the post.\nA triple change now comes from Gareth Southgate with Trent Alexander-Arnold, Jack Grealish and Saka himself being taken off the pitch.\nCole Palmer, Marcus Rashford, and Kalvin Phillips come on for the final few minutes. Can they have an impact?\nNorth Macedonia 1-1 England\n21:28 , Mike Jones\n81 mins: Close! England are awarded a free kick over on the left side of the pitch and Phil Foden swings the ball over to the far post. Harry Maguire leaps highest to win the ball and nods it straight at the goalkeeper who manages to cling onto the ball.\nNorth Macedonia 1-1 England\n21:26 , Mike Jones\n78 mins: Chance! Phil Foden and Harry Kane do brilliantly to win the ball back high up the pitch. It comes out to Trent Alexander-Arnold who threads a superb pass into the box for Jack Grealish.\nThere are white shirts flying forward but Grealish’s pass into the six yard box it too high and sails over everyone’s heads. Chance goes begging.\nNorth Macedonia 1-1 England\n21:24 , Mike Jones\n75 mins: A positive from Gareth Southgate’s point of view will be how England keep their composure in frustrating and hostile environments.\nThe decisions are going against them and North Macedonia are making things tricky. Can they hold their nerve to score a winning goal with 15 minutes to play?\nNorth Macedonia 1-1 England\n21:19 , Mike Jones\n71 mins: Saka gets the ball in the box and lays it off to Foden. Foden chips it over to Lewis who looks to find Saka over by the far post.\nAlioski looks to win the ball and runs into Saka before falling to the ground convincing the referee to award the hosts a free kick which he does.\nThere’s some questionable decisions being made. Any sort of contact between players and a free kick is being given.\nNorth Macedonia 1-1 England\n21:17 , Mike Jones\n68 mins: ‘They’re a bit scrappy at the moment England’ says Dion Dublin on the Channel 4 commentary. That’s an understatement to say the least.\nEngland struggled against Malta and they’re struggling again tonight. Rico Lewis is playing with energy and bombs down the left wing. He flicks the ball into the box and finds Bukayo Saka who shifts the ball onto his left foot and shoots.\nThe effort is blocked.\nNorth Macedonia 1-1 England\n21:12 , Mike Jones\n65 mins: Elmas takes a shot but has his effort blocked by Kyle Walker.\nThe ball deflects behind for a corner and North Macedonia knock it short. When it is eventually delivered into the penalty area Harry Kane leaps highest and nods it away.\nEnglan threaten to break on the counter but they lose possession and the home side fail to capitalise on the opportunity to counter attack themselves.\nNorth Macedonia 1-1 England\n21:10 , Mike Jones\n62 mins: Jack Grealish and Rico Lewis combine on the left wing with both players overlapping each other. Grealish takes the ball to the byline and is tackled.\nHe lets it run out of play for what he thinks should be a corner. The referee thinks otherwise and awards a goal kick.\nGOAL! North Macedonia 1-1 England (Atanasov OG, 59’)\n21:06 , Mike Jones\n59 mins: Harry Kane take a bow.\nThe corner is swung into the middle of the box and the England captain makes his run from deep. He’s tracked by Jani Atanasov who has his eyes on the man not the ball.\nKane attempts to glance a header into the back corner but misses the dropping ball which then hits the defender and ends up in the back of the net anyway.\nNorth Macedonia 1-0 England\n21:04 , Mike Jones\n58 mins: Harry Kane is introduced into proceedings as Alexander-Arnold wins a corner kick for England. Can they make something happen from this set piece?\nNorth Macedonia 1-0 England\n21:03 , Mike Jones\n55 mins: Trent Alexander-Arnold is very frustrated. He thinks he’s won a throw with a nice tackle but the referee awards it to the hosts. The Liverpool man throws the ball into the floor and yells at the official who pulls out a yellow card.\nThe growing frustration is more about the state of play in the game rather than the decision. England just aren’t playing that well.\nNorth Macedonia 1-0 England\n21:01 , Mike Jones\n52 mins: The Harry Maguire incident from the first half, in which North Macedonia should have won penalty, means that the home fans are booing the England defender whenever he’s got the ball.\nPhil Foden attempts to thread a path into the box at the other end of the pitch but there are seven defenders around him with only Ollie Watkins as a viable option to give the ball too.\nNO GOAL! North Macedonia 1-0 England\n20:57 , Mike Jones\n49 mins: Hold up.\nThere’s a VAR check happening to see if this goal is going to stand. It’s a long one but the video referee determines that Grealish was offside when Saka flicked the ball over to him.\nEngland’s equaliser is chalked off.\nGOAL! North Macedonia 1-1 England (Grealish, 47’)⚽️\n20:55 , Mike Jones\n47 mins: Equaliser!\nEngland have their goal and it’s a bit of brilliance from Bukayo Saka. The Arsenal man is fed the ball on the right wing.\nHe brings it under control and weaves into the box, skipping past two defenders before chipping the ball over to the back post where Jack Grealish taps it home!\nSecond half! North Macedonia 1-0 England\n20:53 , Mike Jones\nThe hosts get the match back underway. Gareth Southgate hasn’t made any changes to the team and is trusting his players to get England back in this contest.\nHT North Macedonia 1-0 England\n20:48 , Mike Jones\nThere’ll be a lot of talk about the penalty being awarded against England but it has balanced out.\nHarry Maguire was lucky not to have given one away earlier in the half despite a VAR check and Rico Lewis was unlucky to have given one away with his stray hand when jumping.\nEngland have been slack again. At times they’re playing with two at the back without managing to transition the ball into attack clinically.\nThere needs to be more of a cutting edge to their play. Lots to work on for the second half.\nHT North Macedonia 1-0 England\n20:44 , Mike Jones\nRico Lewis is the first England player to make his debut on the eve of his birthday since Andrew Johnson in February 2005 against the Netherlands.\nHT North Macedonia 1-0 England\n20:40 , Mike Jones\nHalf-time! North Macedonia 1-0 England\n20:36 , Mike Jones\n45+4 mins: So, England trail in their final Euro 2024 qualifier. They’ve tried to be different tonight and move the ball quicker.\nRico Lewis is getting himself stuck into the game but was unlucky to give away the penalty. Enis Bardhi slotted the ball into the back of the net and that goal is the difference between the teams.\nThere’s work for Gareth Southgate to do at half-time.\nNorth Macedonia 1-0 England\n20:31 , Mike Jones\n45 mins: Four minutes of added time to play at the end of the first half. Rico Lewis spies a gap in the North Macedonian defence and takes a shot from just outside the box.\nHe hits it sweetly but can’t beat the goalkeeper with his low effort.\nGOAL! North Macedonia 1-0 England (Bardhi, 41’)⚽️\n20:28 , Mike Jones\n41 mins: Enis Bardhi takes the penalty kick and pings it to Jordan Pickford’s left.\nThe goalkeeper moves the correct way and palms the ball away but Bardhi is first to the rebound and he belts it past Pickford who’s left sprawled on the floor.\nEngland need to come from behind in Skopje.\nPenalty to North Macedonia!\n20:26 , Mike Jones\nNorth Macedonia 0-0 England\n39 mins: Wow. The hosts dink the ball into England’s penalty area. Rico Lewis leaps into the air to clear the danger and nods the ball away.\nAs he jumps Bojan Miovski arrives behind him and runs into Lewis’ left-hand which swings down as the teenager makes his jump. There’s contact to the forward’s face which VAR believes is enough to send the referee to the monitor.\nHe takes a long look at the replays then points to the spot.\nNorth Macedonia 0-0 England\n20:23 , Mike Jones\n36 mins: Almost great! The ball is bouncing around the middle of the pitch as Trent Alexander-Arnold and Jack Grealish nod the ball up towards the box.\nOllie Watkins nudges the nearest defender, spins away from him as he goes to ground then collects the ball and drills a shot at goal. Stole Dimitrievski palms it away but the referee pulls the play back after the foul by Watkins.\nNorth Macedonia 0-0 England\n20:19 , Mike Jones\n33 mins: Atanasov arrives late for a challenge on Lewis who drifts into a central midfield spot. The teenager is brought down and wins England a free kick in a dangerous area.\nThe Three Lions decide not to send the ball into the box and instead work it across to Jack Grealish who wins a corner from the left wing.\nNorth Macedonia 0-0 England\n20:16 , Mike Jones\n30 mins: Close! Rico Lewis piles up the pitch to take part in England’s attack but is forced to track back into midfield as North Macedonia threaten to break up the pitch.\nHarry Maguire is the lone defender and nods the clearance into the middle of the pitch where Lewis shields the ball and manages to offload it.\nEngland move it quickly across to Phil Foden on the inside left and he threads a fine pass into the penalty area but Ollie Watkins can’t reach the ball with his lunge.\nNorth Macedonia 0-0 England\n20:12 , Mike Jones\n27 mins: The home side are starting to get themselves into the game. They win a free kick over to the left of England’s penalty area and have the chance to flood the box with players.\nEnis Bardhi fizzes the set piece over the six yard box but it drops safely and England work the ball away.\nNorth Macedonia 0-0 England\n20:10 , Mike Jones\n24 mins: Oh my, Harry Maguire is a lucky boy.\nFirst he gives the ball away deep in his own half and then has to back track as North Macedonia get Eljif Elmas into the box. He brings it in from the right and looks to create an angle to shoot.\nMaguire thinks about making a tackle, half-lunges for the ball then pulls his leg back. He trips on the ground, knocks into the striker and brings him down too.\nThe hosts are screaming for a penalty but the referee waves for a goalkick as the ball heads out of play.\nNorth Macedonia 0-0 England\n20:07 , Mike Jones\n21 mins: Ezgjan Alioski catches Bukayo Saka’s heel as the winger run past him with the ball. England take the free kick quickly and work it across the defence.\nThe Three Lions send the ball down the line to Jack Grealish who is fouled by another quickly closed down but mistimed challenge.\nNorth Macedonia 0-0 England\n20:04 , Mike Jones\n18 mins: Saka draws a foul with his quick footwork and gives England a chance to swing in a set piece. Trent Alexander-Arnold whips the set piece into the middle of the box and puts it into a dangerous area.\nThere’s a coming together in the box but the whistle goes as Harry Maguire is flagged offside.\nNorth Macedonia 0-0 England\n20:01 , Mike Jones\n15 mins: Woodwork!\nDeclan Rice receives the ball on the edge of the box. He drills a low, straight effort towards the back corner and beats the North Macedonian goalkeeper.\nFor a moment Rice thinks he’s scored but the ball hits the upright and bounces back into play where it’s booted away.\nNorth Macedonia 0-0 England\n20:00 , Mike Jones\n14 mins: England slow the build-up right down as the ball goes back to Harry Maguire who’s looking for a cutting pass. He sends it over to Declan Rice who floats a lovely ball over the top as Ollie Watkins makes his run in behind.\nThe forward brings the ball down then pokes it to Bukayo Saka.\nSaka dances inside moving past a bunch of defenders before unleashing a shot with his left-foot. It’s a typical move from the Arsenal man but his effort is blocked on the edge of the box.\nNorth Macedonia 0-0 England\n19:57 , Mike Jones\n12 mins: Jack Grealish tries to play a one-two with Phil Foden on the front edge of the box but its blocked off and cleaned out by Jovan Manev.\nThe referee seemingly misses the incident as nothing comes from it other than a drop ball for the hosts. Grealish isn’t too happy about it though.\nNorth Macedonia 0-0 England\n19:55 , Mike Jones\n9 mins: The hosts are finding it tricky to get themselves on the ball. Rico Lewis is stepping into midfield allowing England to have an extra body for closing the ball down quickly.\nEnis Bardhi pumps a long pass up the pitch in a hopeful punt to find Eljif Elmas. It’s too pacey for the forward to get to and Jordan Pickford scoops it up without too much trouble.\nNorth Macedonia 0-0 England\n19:51 , Mike Jones\n6 mins: Jani Atanasov leaves a bit too much on Jack Grealish who is trying to weave his way out of danger in England’s final third. The Man City man wins England a free kick and relieves the pressure on the defence.\nNorth Macedonia played well against Italy last time out and they won’t hold back from taking the game to England here.\nNorth Macedonia 0-0 England\n19:49 , Mike Jones\n3 mins: Close! There’s already more of a zip to England’s play in comparison to the match against Malta. They bring the ball down the right side through Bukayo Saka who sends it across the middle.\nDeclan Rice and Jack Grealish combine for a lovely one-two on the opposite side of the box with Grealish making the run in behind. He looks for a short pass to Ollie Watkins who tries to turn it home at the near post but his touch it deflected out for a corner.\nKick off! North Macedonia 0-0 England\n19:46 , Mike Jones\nEngland get the ball rolling against North Macedoina. This is the first of three matches for the Three Lions before the squad is named for Euro 2024.\nWho will impress Gareth Southgate tonight?\nNorth Macedonia vs England\n19:40 , Mike Jones\nHarry Kane has either scored or assisted a goal in each of his last 11 appearances for England in all competitions (11 goals, 3 assists).\nWith two goals in this game, he would be the first ever European player to score 10-plus goals in three consecutive qualifying campaigns, having netted 12 in qualifying for both Euro 2020 and the 2022 World Cup.\nNorth Macedonia vs England\n19:35 , Mike Jones\nBukayo Saka has been involved in 10 goals in his last 11 competitive games for England (7 goals, 3 assists), setting up Harry Kane’s strike against Malta last time out.\nHe also scored a hat-trick in the Three Lions’ home fixture against North Macedonia in June.\nNorth Macedonia vs England\n19:33 , Mike Jones\nEngland striker Ollie Watkins speaking on Channel Four: “Obviously goals is the main thing [that will help me get selected for the Euros]. As a striker I need to score goals.\n“But also bringing a different dynamic to the team, stretching defences, bringing a different energy.\n“You’re going to get games like that. Malta made it difficult and we still came away with the win. Hopefully we’ll see a lot more fluid a performance with a lot of goals and we’ll bring some energy and excitement tonight.”\nDeclan Rice putting pressure of price tag behind him to pursue biggest prizes\n19:30 , Mike Jones\nDeclan Rice went to the World Cup surrounded by England team-mates who had won the biggest prizes in the game – now he is a £105million player who insists he is not fazed by the price tag having lifted European silverware and instantly taken to Champions League football.\nThe 24-year-old admitted a year ago in Qatar that he wanted to play at the highest level and left West Ham in the summer after captaining them to Europa Conference League glory.\nRice moved across London to Arsenal, joining the Gunners for a club-record fee and has hit the ground running with a run of fine performances for Mikel Arteta’s side.\nDeclan Rice putting pressure of price tag behind him to pursue biggest prizes\nNorth Macedonia vs England\n19:25 , Mike Jones\nEngland have won eight of their last nine games in all competitions (one draw) since losing against France in the 2022 World Cup.\nVictory here would mean their highest-ever win rate across a single calendar year in which they played at least 10 matches (90%).\nNorth Macedonia vs England\n19:20 , Mike Jones\nNorth Macedonia have won just one of their last six European Championship qualifiers (one draw, four defeats), conceding 17 goals across those four defeats.\nSince drawing 0-0 at Israel back in March 2007, England have scored in 19 consecutive away European Championship qualifiers, the longest run of any nation in qualifying history.\nThey have netted 55 goals in those games, an average of 2.9 per game.\nRico Lewis hopes his versatility helps him make late push for Euro 2024 squad\n19:15 , Mike Jones\nRico Lewis is hoping his versatility will work in his favour as he aims to make a late charge to Euro 2024.\nGareth Southgate will name a 23-man squad for next summer’s finals in Germany, having been able to pick 26 players for both Euro 2020 and the 2022 World Cup.\nThat means competition for places will be more fierce than in recent years, with Southgate admitting those who are more adaptable could have the edge.\nRico Lewis hopes his versatility helps him make late push for Euro 2024 squad\nNorth Macedonia vs England\n19:10 , Mike Jones\nManchester City’s Rico Lewis turns 19 tomorrow. Given England’s lack of options at left-back and Lewis rising star status with the Premier League champions he is a given to start in that position tonight.\nIt’ll mark the teenager’s senior debut for England. Some birthday present.\nSouthgate on tonight’s priorities\n19:05 , Mike Jones\nAfter a lacklustre performance against Malta on Friday, and with Euro 2024 qualification already secure, Gareth Southgate outlined what his priorties are for this evening’s game.\n“Performance is the priority,” Southgate said. “We didn’t reach that standard on Friday. We have to get back to what we’re good at.\n“There’s always a chance within that to have a look at a couple of things that we’d like to see as well but the biggest thing is making sure we hit the level of performance that we’ve set ourselves this year.”\nNorth Macedonia vs England\n19:00 , Mike Jones\nEngland have won both of their previous away games against North Macedonia.\n2-1 in September 2003 with Wayne Rooney and David Beckham goals and 1-0 in September 2006 thanks to a Peter Crouch winner.\nCan they make it three from three tonight?\nNorth Macedonia vs England\n18:55 , Mike Jones\nNorth Macedonia are winless in five international meetings with England with two draws and three defeats. They lost 7-0 against the Three Lions in June in the most recent encounter between the teams.\nCan they improve this evening?\nSouthgate on left-back issues\n18:50 , Mike Jones\nWith Kieran Trippier withdrawing from the England squad ahead of tonight’s match, there is a big vacancy in the left-back role.\nBen Chilwell, Levi Colwill and Luke Shaw all currently out injured and Gareth Southgate was asked ‘what he was thinking’ when it came to left-backs for tonight’s game.\nHe replied: “That we need to adapt and that we have a couple of different options. We are comfortable with it and that we can find a good solution to the issue.\n“We haven’t got somebody that is playing there regularly, but we’ve adapted to lots of situations over the last few years and we’re comfortable with doing that again tomorrow.”\nEngland team changes\n18:46 , Mike Jones\nGareth Southgate has made six changes to the England team that started the match against Malta. In the backline comes Kyle Walker and Rico Lewis who replace Kieran Trippier and Fikayo Tomori.\nTrent Alexander-Arnold is the only one to keep his spot in midfield as Jordan Henderson and Conor Gallagher are replaced with Bukayo Saka and Declan Rice.\nPhil Foden looks likely to move into a central position with Saka starting on the right wing, over on the left Jack Grealish comes in for Marcus Rashford and Ollie Watkins takes Harry Kane’s place as the centre forward.\nNorth Macedonia vs England line-ups\n18:40 , Mike Jones\nNorth Macedonia XI: Dimitrievski, Manev, Serafimov, Musliu, Dimoski, Atanasov, Alimi, Alioski, Miovski, Bardhi, Elmas\nEngland XI: Pickford, Walker, Maguire, Guehi, Lewis, Alexander-Arnold, Rice, Saka, Foden, Grealish, Watkins\nKieran Trippier withdraws from England squad ahead of trip to North Macedonia\n18:35 , Mike Jones\nKieran Trippier will play no part in England’s final Euro 2024 qualifier as the defender has withdrawn from the national team squad due to a personal matter.\nThe team underwent their final training session at Tottenham Hotspur’s training ground earlier today before they fly out to Skopje for the match against North Macedonia tomorrow night.\nPosting on X, formerly Twitter, the England social media account announced Trippier’s departure saying: “22 players are out for today’s session at Spurs Official’s training ground ahead of our final Euro 2024 qualifier.\n“[Kieran Trippier] has departed the ThreeLions camp, owing to a personal matter and will not travel to North Macedonia.”\nKieran Trippier withdraws from England squad ahead of trip to North Macedonia\nNorth Macedonia vs England\n18:33 , Mike Jones\nEngland have arrived in Skopje. Team news coming shortly...\nNorth Macedonia vs England\n18:30 , Mike Jones\nEngland have met North Macedonia on five previous occasions, having previously been drawn alongside each other in successive European Championships qualifying groups for Euro 2004 and Euro 2008.\nThe first encounter came at St. Mary’s Stadium in Southampton. England went behind twice in the game but ended up securing a 2-2 draw thanks to strikes from David Beckham and Steven Gerrard.\nThe second game ended 0-0 at Old Trafford during Steve McClaren’s reign and the most recent clash also took place at Manchester United’s home ground with the Three Lions impressing in a 7-0 victory in this year’s Euro 2024 qualifying.\nGareth Southgate wants vastly-improved display from England in North Macedonia\n18:25 , Mike Jones\nGareth Southgate says “performance is the priority” in North Macedonia as already-qualified England look to make up for winning with a whimper against minnows Malta.\nThe Euro 2020 runners-up sealed their place at next summer’s edition with two matches to spare and were below par in Friday’s qualifier.\nEngland disappointed a packed Wembley crowd by limping to a 2-0 victory over Malta, leading the manager to suggest his players had subconsciously taken their foot off the gas.\nSouthgate did not castigate those that have done so well for him over the years, but he is demanding a vastly-improved display in North Macedonia as they bring the curtain down on 2023.\nGareth Southgate wants vastly-improved display from England in North Macedonia\nSouthgate agrees with Rice on England’s performance versus Malta\n18:20 , Mike Jones\nGareth Southgate echoed the thoughts of Declan Rice saying that he’s hoping for an improved performance from England tonight and wants to end the year well.\n“We weren’t at the level of performance that we wanted on Friday so we are all focused on tomorrow’s game.” He said at the pre-match press conference yesterday.\n“We play a team who, although they can’t qualify, have tremendous pride and they’ll be wounded by what happened in Manchester [when England won 7-0], so we have to be ready for a really good, really good atmosphere and a full stadium.\n“We’ve had a calendar year where we’ve been very good, so we want to finish well.”\nNorth Macedonia vs England\n18:15 , Mike Jones\nThe Three Lions are unbeaten since just being edged out in the World Cup last year by finalists France.\nThey have already secured their place in next summer’s Euro 2024 in Germany and could complete this qualifying campaign without a loss if they avoid defeat to North Macedonia tonight.\nRice wants England to end the year with a bang\n18:10 , Mike Jones\nDeclan Rice took the pre-match press conference alongside England boss Gareth Southgate and spoke about the team’s plans for tonight’s match and I how he wants England to end the year on a high.\n“Look, we know how good they are,” said Rice, “Even though we won quite big in Manchester, we knew before the game some of the quality they have on the pitch and some of the star players they have.\n“We were wary of that and we will be wary of that again tomorrow night, especially after the other night against Malta – just a bit of pride in ourselves that we need to raise the level, we need to put out a statement and it’ll be a good way to end the year.\n“We are currently unbeaten since the World Cup, so it’s down to us to go out tomorrow night and put on a performance. I feel like we have to be mentally prepared, have the right mentality, be ready for a hostile environment and make sure that we go out of this year with a bang.\n“So we’ll be ready for whatever they throw at us.”\nDeclan Rice shares thoughts on VAR after England screamer ruled out: ‘I was gutted’\n18:05 , Mike Jones\nDeclan Rice has shared his thoughts on VAR after his impressive goal against Malta was ruled out by the technology.\nThe Arsenal midfielder curled an effort into the net from the edge of the box, but it was chalked off after Harry Kane was adjudged to have been stood in an offside position, blocking the goalkeeper’s view.\nAhead of England’s fixture against North Macedonia on Monday night, Rice was asked if he is a “fan” of VAR and how he felt when his goal was ruled out.\nNorth Macedonia vs England prediction\n18:00 , Mike Jones\nFollow their less than stellar outing against Malta last Friday, England will be looking to impress as they take on North Macedonia away from home tonight. Expect a much-improved performance, albeit against sterner opposition.\nNorth Macedonia 1-4 England.\nEarly team news and predicted line-ups\n17:55 , Mike Jones\nGareth Southgate has had to deal with a host of injuries in this camp with Jude Bellingham, James Maddison, Levi Colwill, Callum Wilson and Lewis Dunk all pulling out, while Kalvin Phillips was unavailable for personal reasons.\nKieran Tripper has since also departed the squad due to a personal matter, Jarrod Bowen is injured, while Marcus Rashford might not be risked on Monday after being substituted following a collision with Trent Alexander-Arnold in the game against Malta.\nNorth Macedonia head coach Blagoja Milevski, meanwhile, may look to rotate his team following their defeat against Italy, with Jani Atanasov - scorer of a brace off the bench against Italy - potentially in line for a start.\nPredicted line-ups\nNorth Macedonia XI: Dimitrievski, Ashkovski, Serafimov, Musliu, Dimoski, Atanasov, Elezi, Alioski, Ristovski, Bardhi, Elmas.\nEngland XI: Pickford; Walker, Konsa, Maguire, Lewis; Alexander-Arnold, Rice, Gallagher; Grealish, Kane, Saka.\nHow to watch North Macedonia vs England\n17:50 , Mike Jones\nNorth Macedonia vs England is due to kick off at 7.45pm GMT tonight, Monday 20 November, at the National Arena Tose Proeski in Skopje.\nViewers in the United Kingdom can watch the match live on Channel 4, with coverage on the channel from 7pm GMT. A live stream will be available via the Channel 4 website and app.\nIf you’re travelling abroad and want to watch the event, you might need a VPN to unblock your streaming app. Our VPN round-up is here to help and includes deals on VPNs in the market. Viewers using a VPN need to make sure that they comply with any local regulations where they are, and also with the terms of their service provider.\nNorth Macedonia vs England\n17:45 , Mike Jones\nHello and welcome to The Independent’s coverage of tonight’s Euro 2024 qualifier as England take on North Macedonia in the final qualifying match of their campaign.\nThe Three Lions have already secured a spot in Germany for next summer’s tournament and Friday night’s victory over Malta ensured they will finish top of Group C.\nThe team’s performance during that 2-0 victory was suspect though and at times they were challenged by a side that haven’t won a match during this qualifying run.\nGareth Southgate will be hoping his players can round out 2023 in style with another victory tonight but more importantly a performance the fans can get behind which will give England some momentum heading into the new year.\nWe’ll have all the team news, updates and match action throughout the evening so stick around as we build up to kick off at 7.45pm.",
  "word_count": 6167,
  "scraped_at": "2026-02-14T02:25:08.301867",
  "_text_extracted": true
}