{
  "article_id": "8e1eb0cf7abc",
  "url": "https://thechronicle.com.gh/weekend-european-leagues-fixtures-previews-10/",
  "title": "Weekend European Leagues Fixtures & Previews - The Ghanaian Chronicle",
  "date": "20240510T163000Z",
  "domain": "thechronicle.com.gh",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Girona, Alaves face-off in La Liga today\nGirona, fresh off their historic Champions League qualification, will face Alaves on Friday, May 10th, in their next La Liga encounter. The Alaves vs Girona match promises to be an intriguing clash between two surprise packages of the season, with Girona aiming for their best finish yet.\nAlaves endured a tough spell with three consecutive losses but have since turned things around, securing three consecutive victories. In contrast, Girona have been consistent, losing just one of their last five matches, including a notable win against Barcelona in their most recent fixture.\nIn their last five encounters, Girona have won two encounters, losing one and drawing the other two matches against Alaves. The last encounter between these two teams ended up in favour of Girona with them scoring three goals.\nAlaves are facing injury concerns as Andoni Gorosabel is sidelined with a muscular problem, potentially ruling him out for the season. Additionally, Ruben Duarte and Aleksandar Sedlar are unavailable due to fitness issues, while Samu Omorodion serves a suspension for accumulating yellow cards. Girona faces uncertainties with Joel Roca and Ricard Artero still sidelined.\nCredit: footballwhispers.com\nNottingham Forest welcome a resurgent Chelsea\nPotentially just one point away from being assured of Premier League survival, Nottingham Forest‘s final home game of the season sees Chelsea arrive at the City Ground on Saturday.\nThe Tricky Trees are on the cusp of safety thanks to last weekend’s 3-1 beating of already-relegated Sheffield United, while the Blues crushed West Ham United 5-0 to remain in control of their top-seven destiny.\nThe historical omens may be promising for Santo’s men, but Chelsea’s recent exploits make for grim reading for those of a City Ground persuasion, as Mauricio Pochettino‘s side have begun the month with seven goals scored and zero conceded in a pair of London derbies.\nSitting seventh in the table with a two-point gap to make up to Newcastle United, Chelsea’s current standing may suffice for Europa Conference League football if Manchester United – who are only behind on goal difference – lose to Manchester City in this year’s FA Cup final, which would see the second Europa League spot pass to the sixth-placed team.\nChelsea’s impressive home exploits have not translated into praiseworthy performances on the road in the latter stages of the season, and Forest’s effervescent attackers should be licking their lips if the visitors’ defensive record on rival turf is anything to go by.\nGoals should be a guarantee in this fascinating battle, but a free-scoring Chelsea side who have seen their ranks strengthened by several returning players get our vote to enhance their European credentials and deny Forest the chance to secure their Premier League status.\nCredit: sportsmole.co.uk\nArsenal are favourites as they travel away to face Man United\nArsenal head to Manchester United on Sunday looking to avoid a costly slip-up in the Premier League title race. The Gunners are heavy favourites to win but have left Old Trafford with all three points just once in their last 16 visits, a run which also includes 10 defeats.\nAny dropped points will surely hand the title to Manchester City, who can move above Arsenal with a victory for Fulham on Saturday lunchtime.\nUnited, meanwhile, continue to trudge towards the finish line. They were thumped 4-0 at Crystal Palace last time out and are in danger of slipping out of Europa League contention. Bruno Fernandes remains a doubt having missed the defeat at Selhurst Park, which was the first game the captain has ever missed through injury.\nScott McTominay could also return, and both Marcus Rashford and Lisandro Martinez have returned to first-team training. Arsenal have a clean bill of health for the first time this season. Jurrien Timber is in contention to make his first appearance since the opening day and could make the squad.\nArsenal have a woeful record at Old Trafford but surely have never had a better chance of a win, coupled with the fact they simply cannot afford not to.\nCredit: standard.co.uk\nAtalanta and Roma lock horns in Serie A\nAtalanta and AS Roma will lock horns with each other in Serie A this coming weekend. Atalanta have established themselves as a major club in Serie A and always tend to at least challenge for the UEFA Champions League places. Gian Piero Gasperini’s side finished fifth in the league table last season and there is a very good chance that they could end up fourth.\nGli Orobici are fifth in the Serie A table at the moment with 60 points from 34 matches, four points behind Bologna, who are fourth and have played 35 games. They have won their last three league games and are on a roll.\nAS Roma were really struggling under Jose Mourinho, but Daniele De Rossi has transformed the team. When Mourinho parted company with the Italian giants, it looked like they would struggle to finish mid-table, but now they could get into the UEFA Champions League.\nRoma are doing well at the moment and could still end up in the top four of the Serie A table this season. Roma are now sixth in the standings with 60 points from 35 matches, level on points with Atalanta, who are fifth and have played 35 games. Bologna are fourth with 64 points from 35 matches.\nBoth Atalanta and AS Roma are doing well at the moment, and this particular Serie A game promises to be hugely exciting and entertaining. It is very likely that there will be goals in this match, and the match could end in a scored draw.\nCredit: soccernews.com\nPremier League\nSaturday 11th May\nFulham 12:30 Manchester City\nAFC Bournemouth 15:00 Brentford\nEverton 15:00 Sheffield United\nNewcastle United 15:00 Brighton & Hove Albion\nTottenham Hotspur 15:00 Burnley\nWest Ham United 15:00 Luton Town\nWolverhampton Wanderers15:00 Crystal Palace\nNottingham Forest 17:30 Chelsea\nSunday 12th May\nManchester United 16:30 Arsenal\nSpanish La Liga\nFriday 10th May\nSaturday 11th May\nSunday 12th May\nCádiz 13:00 Getafe\nAtlético Madrid 15:15 Celta de Vigo\nValencia 17:30 Rayo Vallecano\nReal Betis 20:00 Almería\nItalian Serie A\nFriday 10th May\nFrosinone 19:45 Internazionale\nSaturday 11th May\nSunday 12th May\nLazio 11:30 Empoli\nGenoa 14:00 Sassuolo\nHellas Verona 14:00 Torino\nJuventus 17:00 Salernitana\nAtalanta 19:45 Roma",
  "word_count": 1045,
  "scraped_at": "2026-02-14T02:01:16.466570",
  "_text_extracted": true
}