{
  "article_id": "8e55a3f02722",
  "url": "https://www.arsenal.com/news/team-news-three-changes-made-villa-game",
  "title": "Team news : Three changes made for Villa game",
  "date": "20240414T173000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Mikel Arteta has made three changes to his side for today’s game against Aston Villa, with Leandro Trossard and Gabriel Jesus handed starts.\nThe pair came off the bench and combined for our equaliser in the 2-2 draw against Bayern Munich in the Champions League on Tuesday, and are rewarded with starting berths against the Villans.\nJorginho and Gabriel Martinelli drop to the bench to accommodate them, meaning Kai Havertz is likely to drop back into midfield. The other change sees Oleksandr Zinchenko replace Jakub Kiwior at left-back.\nUnai Emery meanwhile has made two changes to his team that started the 2-1 success over Lille in the Europa Conference League on Thursday night.\nDouglas Luiz is suspended so Nicolo Zaniolo replaces him in midfield, while Mousa Diaby is preferred on the wing to Leon Bailey. Matty Cash and Clement Lenglet return from injury to get spots on the bench.\nArsenal: Raya, White, Saliba, Gabriel, Zinchenko, Rice, Odegaard, Havertz, Saka, Trossard, Jesus.\nSubs: Ramsdale, Tomiyasu, Kiwior, Jorginho, Partey, Vieira, Smith Rowe, Martinelli, Nketiah.\nAston Villa: Martinez, Konsa, Carlos, Torres, Digne, Tielemans, McGinn, Diaby, Zaniolo, Rogers, Watkins.\nSubs: Olsen, Cash, Kesler-Hayden, Moreno, Chambers, Lenglet, Iroegbunam, Bailey, Duran\nAhead of the game, get all the stats, facts, tactics, TV listings and more in our in-depth preview\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 240,
  "scraped_at": "2026-02-14T02:25:26.762414",
  "_text_extracted": true
}