{
  "article_id": "8e550889a0f4",
  "url": "https://metro.co.uk/2025/12/11/jurrien-timber-injury-arsenal-defender-missed-win-club-brugge-25378219/",
  "title": "Jurrien Timber injury : Why the Arsenal defender missed win at Club Brugge | Football",
  "date": "20251211T124500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Jurrien Timber has joined the list of injured Arsenal stars, missing out on the Champions League trip to Club Brugge on Wednesday.\nThe Dutch defender has been in brilliant form this season, starting at right-back as the Gunners shine in the Premier League and in Europe.\nHowever, he was not in action in Belgium this week, with Ben White filling in on the right of the defence as Arsenal picked up a 3-0 win.\nMikel Arteta fielded a makeshift back four at Club Brugge, with Christian Norgaard playing at centre-back alongside Piero Hincapie, while Myles Lewis-Skelly started at left-back.\nThe manager addressed Timber’s absence from the squad and the fact Riccardo Calafiori could only make the bench on Wednesday night.\nBoth started in the defeat to Aston Villa on Saturday and were nursing injuries picked up at Villa Park.\nSpeaking before the game, Arteta said: ‘They both had issues from the weekend, both really bad kicks.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\n‘For Jurrien it was too early and for Ricci [Calafiori] we have to manage to see if he can do some minutes.’\nCalafiori came off the bench in Belgium, replacing Hincapie after 63 minutes as Arsenal ease him back to full fitness.\nThe Gunners are next in action on Saturday evening at home to Wolves and it is yet to be made clear whether Arteta will bring Timber back into the squad against the Premier League’s bottom club.\nThere will be no Calafiori at the Emirates this weekend as he is serving a suspension for picking up five yellow cards.\nArsenal are dealing with a number of injuries currently, especially at the back.\nGabriel Magalhaes and Cristhian Mosquera remain sidelined, while William Saliba could not play on Wednesday but is nearing a return.\nMore Trending\nDeclan Rice missed the trip to Club Brugge through illness, while Leandro Trossard is injured, set to miss this weekend’s action.\nKai Havertz is also still out, but there was positive news on Wednesday as Gabriel Jesus returned to action after being out since January due to a knee injury.\n‘So happy for him, I think you can see how much we all love him,’ said Arteta of the returning striker.\n‘It’s been a very, very difficult and long journey. For 11 months he’s been fighting against another very difficult injury and to see him back with that smile, with that energy and with that quality in his first performance with us is something really impressive and we’re all delighted for him.’\nMORE: Mikel Arteta names Arsenal’s best trainer with ‘immaculate’ attitude\nMORE: Mikel Arteta sends message to Viktor Gyokeres after Gabriel Jesus makes Arsenal return\nMORE: Chris Sutton says ‘really smart’ Arsenal signing has damaged Chelsea",
  "word_count": 502,
  "scraped_at": "2026-02-14T02:03:26.513331",
  "_text_extracted": true
}