{
  "article_id": "8e6a87c5af15",
  "url": "https://www.bizcommunity.com/Article/196/82/239042.html",
  "title": "Man City the world most valuable football club brand ; Real Madrid the world strongest football club brand",
  "date": "20230607T063000Z",
  "domain": "bizcommunity.com",
  "source_country": "South Africa",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Top stories\nMore news\nESG & Sustainability\nAdvertise your job vacancies\n- Sales Representative Nelspruit\n- Account Manager Johannesburg\n- Telesales Pretoria\n- Graphic Designer Cape Town\n- Sales and Business Development Executives Johannesburg\n- Sales and Business Development Executives Johannesburg\n- Graphic Designer Cape Town\n- Installations Supervisor Johannesburg\n- Junior graphic designer Pretoria\n- Structural Designer - Packaging Cape Town\nManchester City FC becomes the world's most valuable football brand, ending Real Madrid's four-year streak at the top, but Real Madrid is still the world's strongest football club brand.\nSource: © Football London (Image: Matt McNulty - Manchester City FC) Football London Manchester City FC is the world’s most valuable football brand, says Brand Finance\nIn securing first place, Manchester City FC (brand value up 13% to €1.5bn) has achieved a historic milestone by surpassing Real Madrid CF (brand value down 4% to €1.5bn) as the world's most valuable football club brand.\nThis is according to the Brand Finance Football 50 2023 report, which shows that Manchester City FC’s club’s brand value has seen a positive increase of 34% growth since the Covid-19 pandemic and has now reached an all-time high.\nThe Club boasts the highest revenue in this year’s table, a key driver in its ascent to the top.\n“Manchester City FC has achieved an extraordinary feat by surpassing Real Madrid to become the champion of football club brands,” says Hugo Hensley, head of sports services at Brand Finance.\n“For a decade now, the City team has exerted its dominance in English football, including securing four Premier League titles in the past five seasons.\n“However, the club’s performance in this year’s ranking highlights that Manchester City FC is performing off the pitch in terms of building a strong brand and attracting fans and sponsors, and setting the stage for what should be an iconic 2023 Champions League final against Inter Milan,” explains Hensley.\nFollowing Real Madrid in 2nd, FC Barcelona (brand value up 4% to €1.4bn) defends its 2022 rank in third, as does Club Atletico de Madrid (brand value down 5% to €549.56m) in 12th.\nManchester United FC (brand value up 9% to €1.4bn) now sits one rank ahead of its historic rival Liverpool FC (brand value up 7% to €1.4bn) in fourth and fifth position respectively.\nBoth clubs have recorded positive brand value trajectories since 2022, finally surpassing their pre-pandemic values.\nAfter two Covid-hit seasons, 2022-2023 saw the continued return of live matches and fans to stadiums, resulting in increased ticket sales and revenues.\nArsenal FC (brand value up 14% to €906.28m) is up two positions from 2022 and now ranks eighth.\nParis Saint-Germain (brand value up 10% to €1.1bn) has moved up one rank into sixth, overtaking 2022 rival FC Bayern Munich (brand value down 1% to €1.1bn) who drops to seventh.\nGermany has 10 clubs in the 2023 ranking, with its strongest and most valuable club brand, FC Bayern Munich holding its top 10 rank in seventh.\nBrand Finance research finds that the Bundesliga’s brand value has decreased by a further 8% since 2022.\nThe perception likely persists that the Bundesliga is less competitive compared to the Premier League and Serie A, as major British and Spanish clubs continue to dominate the brand value and strength rankings, while Bayern Munich remains the sole German club in the top 10.\nBrazil's Flamengo just holds onto 50th position as the only non-European club in the ranking. Flamengo (brand value up 2% to €97.85m) have dropped from 49th in 2022 to 50th position in 2023.\nThis strong result indicates that the club maintains a favourable global reputation, attributed to the successful legacy and rich heritage of its nation’s football culture. Flamengo also achieves the second-highest score globally for its passionate fan base.\nIn addition to calculating brand value, Brand Finance also determines the relative strength of brands through a balanced scorecard of metrics evaluating marketing investment, stakeholder equity, and business performance.\nCompliant with ISO 20671, Brand Finance’s assessment of stakeholder equity incorporates original market research data from over 10,000 football fans in Europe, Brazil, China, and the US.\nWhile beaten out of the top spot by Manchester City FC this year, Real Madrid CF strikes again as the strongest and second-most valuable football club brand.\nIn 2022, Brand Finance research determined that the Spanish powerhouse was the most likely club to be rated ‘the best club in the world’ by fans.\nBrand strength is what attracts fans, players, investors, and sponsors to engage with the club –delivering commercial value through higher revenues, prices – especially for sponsorship, higher growth, and sponsors, reducing risks to profitability related to weak-on-pitch performance.\nAC Milan (brand value up 33% to €357.98m) ranks 15th this year and is named the fastest-growing football club brand, closely followed by SSC Napoli, (brand value up 31% to €239.81m) in 18th as the second-fastest growing.\nAC Milan had a successful season, reaching the Champions League semi-finals and holding a respectable 4th position in Serie A.\nThe club's brand value has increased through royalties and sponsorships, totalling nearly €20m in 2022.\nAlso solidifying its growing success, SCC Napoli has stormed to the top of the Serie A league following continued on-pitch success.\nRevenues generated from the Serie A and the Champions League qualifiers, in addition to broadcasting and sponsorship opportunities, have further propelled the club’s growth.\nFurther, Brand Finance also ranked Real Betis second, one spot ahead of Real Madrid CF, in its Football Sustainability Index.\nThe club’s commitment to raising awareness about climate change has further bolstered its positive reputation worldwide.",
  "word_count": 926,
  "scraped_at": "2026-02-14T02:07:02.903222",
  "_text_extracted": true
}