{
  "article_id": "8e88c76c8cae",
  "url": "https://www.teamtalk.com/news/first-man-utd-signing-january-lined-up-submit-22m-bid-arsenal-linked-star",
  "title": "First Man Utd signing of January lined up after Red Devils  submit £22m bid  for Arsenal linked star",
  "date": "20231219T133000Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "First Man Utd signing of January lined up after Red Devils ‘submit £22m bid’ for Arsenal linked star\nManchester United are keen on signing highly-rated Galatasaray right-back Sacha Boey in the January transfer window, according to reports.\nThe Red Devils have endured a lacklustre start to the season and currently sit in seventh place in the Premier League table – six points adrift from the top four.\nErik ten Hag is keen to bolster his squad in January and should have funds to spend, with Sir Jim Ratcliffe’s £1.25bn investment set to be finalised before Christmas.\nThe manager is keen to bring in a new full-back. Diogo Dalot and Aaron Wan-Bissaka have been inconsistent this season, with the latter being linked with an exit from the club.\nWan-Bissaka has been underwhelming going forward this season and it’s thought that Ten Hag wants to bring in someone who can offer more in attack.\nBoey has proved himself to be a force to be reckoned with in the Turkish league and plenty of top sides have taken notice.\nNow, reports suggest that Man Utd have already lodged an offer for the dynamic right-back ahead of the January window.\nREAD MORE: Ten Hag rocked as Tottenham hijack priority £35m Man Utd transfer with talks on\nMan Utd launch £22m bid for Arsenal target Sacha Boey\nAccording to reports from Turkey, as cited by Football Talk, Man Utd are ‘in contact’ with Galatasaray over a winter swoop for Boey.\nIt’s claimed that the Red Devils have ‘offered €25.5m (approx. £22m) for the talented defender.’\nAs mentioned, Boey is very highly regarded around Europe and it’s thought that he is keen to join one of Europe’s biggest clubs.\nThe 23-year-old signed for Galatasaray in 2021 and has gradually established himself as one of their most important players.\nBoey has made 79 appearances to date for the Turkish giants, scoring four goals and making four assists, helping his team to one league title in the process.\nWith Galatasaray now knocked out of the Champions League, Boey is open to moving elsewhere in the January transfer window.\nTalks over a contract extension for the defender are reportedly at a ‘stalemate,’ with his current deal set to expire in 2025.\nAs previously reported by TEAMtalk, Arsenal and Man Utd are both keen on signing Boey, but it seems that Man Utd have made the first move in the race for his signature.\nWith that in mind, it will be interesting to see if the Red Devil’s offer of £22m is enough to convince Galatasaray into a January sale.",
  "word_count": 430,
  "scraped_at": "2026-02-14T01:56:38.148139",
  "_text_extracted": true
}