{
  "article_id": "8e9b8b9f5d8a",
  "url": "https://www.arsenal.com/news/russo-champions-league-dreams-and-confidence",
  "title": "Russo on Champions League dreams and confidence",
  "date": "20250318T123000Z",
  "domain": "arsenal.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Alessia Russo is eagerly anticipating her first-ever Champions League quarter-final as we take on Real Madrid tonight.\n\"If you'd have said when I was a kid that this game would be coming tomorrow, I wouldn't have believed you,\" said Alessia, at the pre-match press conference. \"It’s a Champions League night. As a player, I don't think it gets much better.\n\"We had a positive result on Friday and then we've seen a lot of each other this week, travelling and playing games. So, we're in a good place as a team.\"\nIn terms of individual form, our number 23 bagged a brace at the weekend in our 3-1 win over Everton, making that 15 goals in all competitions this season.\n\"I always say I play my best football when I'm happy. I'm enjoying the games at the moment, especially nights like tomorrow night. I just feel happy and valued within the team, which is always nice. I'm just trying to get the best out of myself and see how I can get the best out of others too.\"\nWhile her goal tally may be continuing to soar, Alessia isn't paying attention to talk of the Golden Boot and is fully focused on team accolades.\n\"I think the older you get, the cleverer you get with the position in the sense that it's all tiny moments and fine margins. I'm enjoying learning and I want to keep working hard.\n\"Our goal as a team is to keep progressing in this competition. I think when you come and you sign for Arsenal, you understand the legacy of the club and the history of their successes in winning trophies. I want to be a part of that with this club because knowing from the past, there's nothing like winning a trophy with a team.\n\"We were really disappointed to go out of the FA Cup. We reflected on it and we put on a good performance in the following game against Everton. This game coming up is another chance for us to keep building and showing what Arsenal are about.\n\"I have full confidence in the players and the staff around the team and I know we can go on to achieve great things.\"\nCopyright 2026 The Arsenal Football Club Limited. Permission to use quotations from this article is granted subject to appropriate credit being given to www.arsenal.com as the source.",
  "word_count": 398,
  "scraped_at": "2026-02-14T02:26:33.626978",
  "_text_extracted": true
}