{
  "article_id": "8eb2d35c5e5b",
  "url": "https://punchng.com/la-liga-barcelona-defence-on-another-level-now-says-flick/",
  "title": "Flick : Barcelona defence on  another level  now",
  "date": "20251208T194500Z",
  "domain": "punchng.com",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Barcelona coach Hansi Flick claimed Monday his team’s defending is now on “another level” after a run of good results.\nThe Catalans have won three matches in a row after a 3-0 defeat by Chelsea in the Champions League near the end of November.\nBarca face Eintracht Frankfurt on Tuesday in Europe as they fight for a top-eight finish in the league phase.\nWith several players back from injury last week, Barca beat Atletico Madrid 3-1 and Real Betis 5-3.\n“Everyone knows what happened in the last three months: a lot of injuries, very important players out, the last weeks we have to manage the minutes and the load of every player,” Flick told a news conference.\nThe coach said that although his team shipped three against Betis, the use of his high defensive line system was good, and the players were tired in the final stages, when two of those goals were scored.\n“The last 10 minutes, they were exhausted,” reasoned Flick, whose side also let in three at Club Brugge in a 3-3 draw earlier in November.\n“I said this morning to them, the (back) line is doing really good, we’re getting pressure on the ball, we are connected. This is what we need.\n“And the (high) line, they play it on another level than maybe one month, five weeks ago.”\nThe win over Betis left Barca four points clear at the top of La Liga, with attention turning to the clash against Frankfurt.\nIn 2022 Barcelona suffered a humiliating Europa League elimination at the hands of the German side, whose fans filled the stands at Camp Nou.\nBarcelona restricted access to tickets as a result this year, anxious to avoid similar scenes at their reopened stadium.\nThat defeat was arguably the club’s lowest ebb, but in the years since, they have risen sharply, reaching the semi-finals of the Champions League last season.\nThe Frankfurt match will be the club’s first game in the competition at Camp Nou since October 2022.\n“For everyone, it was a dream to come back and play in Camp Nou,” said Flick.\n“It’s also important for the Champions League. It’s a really important match for us tomorrow.\n“We have to win, we want to win three points. We want to show our best level.”\n‘Starts from scratch’\nThe coach said goalkeeper Marc-Andre ter Stegen may return to the squad after injury but made clear Joan Garcia “is number one.”\nFrankfurt were thrashed 6-0 by RB Leipzig in the Bundesliga on Saturday, where they sit seventh. They are 28th in the league phase table, 10 places below Barca.\nTheir playmaker, Mario Gotze, who worked with Flick in the Germany national team, said he admired the coach’s “very attacking brand” of football.\nGotze also said that Frankfurt’s Camp Nou victory in 2022 would bear no relation to Tuesday’s game.\n“Every match is new and starts from scratch,” said the 33-year-old. “You can hardly draw conclusions from the past — it was a unique experience, and we want to live our own experience.”\nAFP",
  "word_count": 508,
  "scraped_at": "2026-02-14T02:03:26.516599",
  "_text_extracted": true
}