{
  "article_id": "8ec9eb756021",
  "url": "https://www.fourfourtwo.com/news/karim-benzema-sees-saudi-arabia-nightmare-go-from-bad-to-worse-as-season-is-thrown-into-turmoil-by-al-ittihad",
  "title": "Karim Benzema sees Saudi Arabia nightmare go from bad to worse , as season is thrown into turmoil by Al - Ittihad",
  "date": "20240214T173000Z",
  "domain": "fourfourtwo.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Karim Benzema sees Saudi Arabia nightmare go from bad to worse, as season is thrown into turmoil by Al-Ittihad\nKarim Benzema only joined Al-Ittihad last summer, but his time in Saudi Arabia isn't quite going to plan\nThe best features, fun and footballing quizzes, straight to your inbox every week.\nYou are now subscribed\nYour newsletter sign-up was successful\nWant to add more newsletters?\nFive times a week\nFourFourTwo Daily\nFantastic football content straight to your inbox! From the latest transfer news, quizzes, videos, features and interviews with the biggest names in the game, plus lots more.\nOnce a week\n...And it’s LIVE!\nSign up to our FREE live football newsletter, tracking all of the biggest games available to watch on the device of your choice. Never miss a kick-off!\nJoin the club\nGet full access to premium articles, exclusive features and a growing list of member rewards.\nKarim Benzema faces yet more turmoil in Saudi Arabia, with Al-Ittihad making a shock decision over the Frenchman.\nDespite being club captain and scoring nine in 15 games, Benzema hasn't played since a 5-2 defeat to Cristiano Ronaldo's Al-Nassr on Boxing Day. He missed Al-Ittihad's mid-season training camp in January before having a training ground bust-up with manager Marcello Gallardo.\nHe subsequently failed to play in the Saudi Pro League match against Al-Tai and a King's Cup quarter-final victory over Al-Faisaly. Things haven't improved in the intervening period, either, with the latest Al-Ittihad a decision proving a real blow for Benzema and his career in the Middle East.\nAccording to Spanish outlet AS, Al-Ittihad have left Benzema out of their Asian Champions League squad for Thursday's match against Uzbekistan side Navbahor Namangan.\nWith sides only allowed to name five non-Asian players in squads for the tournament, Gallardo has snubbed Benzema a spot in the name in place of N'Golo Kante, Fabinho, Ahmed Hegazy, Abderrazak Hamdallah and Romarinho.\nThe report suggests that Benzema's lack of fitness has contributed to Gallardo's decision, with the 36-year-old now training alone in Saudi Arabia as his team-mates travel to Uzbekistan looking to take the club deep into the Asian Champions League.\nWhile his career in Saudi Arabia is in jeopardy, Benzema is still committed to developing football in the country and the long-term project.\nThe best features, fun and footballing quizzes, straight to your inbox every week.\n\"I'm not only a football player here in Saudi Arabia,\" Benzema told GQ Middle East, \"I'm also an ambassador. I'm here to bring great European players in, in the near future, even if there are already great ones in the Saudi league. Our challenge is to raise it to the same level of the European Leagues.\n\"Time will tell [what happens next] but it will be myself who chooses when my career will end or not. Ultimately, I would like to be remembered as someone who started from the bottom and worked their way up to the top alone, and despite all the obstacles I have faced. That is something that makes me truly proud.\"\nMore Karim Benzema stories\nChelsea plan Karim Benzema bid as Frenchman requests Saudi exit, while Arsenal are also plotting a deal for the former Ballon d'Or winner.\nFind out where Karim Benzema placed in our list of the 100 best footballers of 2023.\nRyan is a staff writer for FourFourTwo, joining the team full-time in October 2022. He first joined Future in December 2020, working across FourFourTwo, Golf Monthly, Rugby World and Advnture's websites, before eventually earning himself a position with FourFourTwo permanently. After graduating from Cardiff University with a degree in Journalism and Communications, Ryan earned a NCTJ qualification to further develop as a writer while a Trainee News Writer at Future.",
  "word_count": 618,
  "scraped_at": "2026-02-14T01:48:39.897831",
  "_text_extracted": true
}