{
  "article_id": "8ed582e6316f",
  "url": "https://www.themag.co.uk/2023/12/i-love-this-team-and-what-the-manager-has-done-but-newcastle-1-ac-milan-2-newcastle-united/",
  "title": "I love this team and what the manager has done but ... ",
  "date": "20231214T200000Z",
  "domain": "themag.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "I love this team and what the manager has done but…\nNewcastle 1 AC Milan 2 – Wednesday 13 December 8pm\nWasn’t so long ago that nights like this were a far off dream.\nThe Ashley years, when cup campaigns were treated with disdain and any progress into the top half of the table was a laughable prospect, were an ongoing procession of doom, but even when they ended it felt like their might be an almighty turning circle to move from relegation fodder to European contenders.\nHowever, as we all know, Eddie Howe produced a handbrake turn to navigate that ascension and suddenly it had come to this: AC Milan, at home, with a win giving a very real chance of passage into the last 16 of the Champions League.\nOf course, this was dependent on a favour from Borussia Dortmund, who needed to deny PSG a win in Germany to open the door for a side to progress from this match. Given their respective records it was a decent chance that Dortmund would at least deny Paris the victory that would allow United their opportunity, but this certainly promised to be the game where the lack of any phone reception in the ground was at its most utterly frustrating.\nThe build up to this was bittersweet, with a pair of awful defeats to Everton and Spurs suggesting an exhausted and unravelling side. However, the return of Longstaff and Wilson gave a glimpse that a corner might be turning and changes to that consistently tiring outfield ten may be on the cards.\nWhile the return of Dan Burn to the bench was a welcome surprise, the only change to that well flogged outfield ten was Wilson starting in place of Isak, which seemed like a wise choice as the Swede was one of those urgently in need of some respite, but would offer an option later in the game if needed. Meanwhile in goal, tales of Dubravka succumbing to various illness and injuries proved unfounded and he retained his place over Karius despite a pair of underwhelming performances at Goodison Park and the Your Name Here Stadium.\nConcerns over further sluggishness were quickly dispelled in a lively opening as United swarmed forward with intent. Crucially, they seemed to have learned from the game in Italy, and Trippier’s ventures forward were offset by constant awareness of what Rafael Leao was up to, given his dominance in the fixture at the San Siro.\nThe right hand side was looking like our most promising attacking outlet and it was this route that provided a key moment which for me would prove definitive in this game (and indeed the entire outcome of the group). Joelinton went steaming past Reijnders on the right and showed great strength to produce a magnificent cutback, beating the keeper’s dive and putting it on a plate for the opener, only to produce what I have to say was the most infuriating moment of Miguel Almiron’s Newcastle career. It is a football cliche when you say “he’s just stuck his foot out” to describe a close range goal, but in this case this was literally all that it needed. Joelinton had done all the work and Almiron was in the right place to finish it, but his utter refusal to use his right foot was extremely costly.\nQuite why he felt his weaker peg was not adequate to duff the ball into an open goal from two yards is utterly beyond me, but the slow motion replay of him watching the ball travel across his body when there seems an age to tap it in is agonising. This was shocking, but despite this, nothing should be taken away from the incredible last ditch tackle that Tomori had no right to make.\nThings did get better for a while as United subsequently took a magnificent lead. Gordon drove forward from midfield and moved the ball out wide to Miley, who cut it back to the unmarked Joelinton at the edge of the box. Joe took a touch and gave it the most outrageous, beautiful smack right into the postage stamp in the opposite corner. Eruptions all round.\nThis goal had us in the last 16, as from this point until the half time break it remained 1-0 with no score in Germany, which would see us nudge ahead of PSG on the head to head rule, which would be hilarious.\nUnited kicked off the second half 45 minutes away from the heady prospect of our first ever knockout match in Europe’s premier competition. This is where I maybe divert from the script a bit, but the second half performance served up with such a prize at stake, was shocking.\nThere is massive nuance to this turn of events.\nWe have come on an incredible amount over the past two years, from relegation fodder to a team to be proud of, contesting cup finals and battling massive clubs in the Champions League. I absolutely acknowledge that and I love this team and what the manager has done. However, I reserve the right to hold both that opinion and the one that this second period was an echo of that cup final in being a massive let down at the most crucial time.\nThe reasons for this are multiple and debatable. Of course the injury list has been unprecedented and the inevitable fatigue it has caused is the key factor. However, I would argue that Dummett, Ritchie, Hall and Krafth could all have done an equally as capable job of getting buckled 4-1 at Tottenham if we were to have kept a few key characters back to attack this one slightly fresher.\nThere is also the question of experience, after being bested by a more streetwise Dortmund side, there was further relative naivety on show as United were absolutely wide open second half as they sought to extend the lead, then regain it, then rescue the match. Milan looked like they couldn’t believe their luck as they took full advantage of the space to score that goal on the break we keep conceding a couple of times.\nThen of course, there’s that word: luck, which has deserted us entirely of late. Lascelles had a decent game tonight, with some fine passes out of defence, but I can’t help but wonder what difference the cool, steadying presence of Botman would have made tonight and in the previous three group games. Similarly, I think many will be choking on their words about Nick Pope’s kicking, given how keenly we’ve felt his absence. Pope plays as a sweeper keeper, allowing the defence to play further forward while being quick out to snuff out any danger before it really threatens. Dubravka tends to stick to his line and this has cost us, partly because of the defence having to adapt to a different game and partly because our former stellar number one has had a shaky time since his reintroduction.\nIt’s debatable whether Pope would have made any difference to either of Milan’s goals. News filtered through of a Dortmund goal, followed by a PSG equaliser, none of which affected the fact Newcastle were still going through until the 60th minute, when Leao once again menaced us down the left. His pull back hit Tomori and landed with Giroud, who played in Pulisic for a straightforward finish with the defence all over the place. Nick and Sven might have shut the door on this one you know.\nCurrent status was the Europa League then, a fact that was hammered him by an extremely unhelpful update on the big screen claiming Paris had taken the lead when it turned out they never would. I assume this was a VAR overturn and am unable to say if this added to the players jitters, but I’m annoyed that the seemingly slapdash nature of score updates chose this moment before the goal had been properly vetted.\nThere was time for one more intervention by luck, as Bruno produced a vicious effort from the edge of the box that Mike Maignan equalled with a tremendous reflex save, deflecting the ball up.\nIt hit the same bar that denied us in the closing stages against Dortmund and bounced to safety.\nNot our night? Definitely not. United went wide open looking for the win and got battered on the break. First Livramento was caught in possession only for Leao’s attempt to bounce back off the post. Moments later, with the warning unheeded, Schar was caught in possession on one of his forays forward and Milan broke in numbers. Substitute Chukwueze finished the move, the game and our European campaign.\nMilan perhaps should have equalled their city rivals 2002 winning margin on Tyneside as they wasted a pair of chances in time added on, with Hernandez attempting a glory shot when Dubravka was up for a corner, only for his weak effort to fail to even reach the dead ball line. Tomori then smacked the same post Leao had belted, as Milan (that’s right) hit us on the break.\nThis was an absolute gut punch, having had sight of the last 16 via that late heartache in Paris then for a decent chunk of tonight’s match, with Europa League qualification also being assured until the final five minutes. It hasn’t been talked about so much, but we’ve chucked a lot away from winning positions this year, again a factor of the fatigue perhaps but also a weakness to address as soon as possible.\nThere is the bright side of schedules clearing for a squad that we all suspected didn’t have the depth for a campaign on four fronts. The hope now has to be that recovery can begin as more and more bodies come back, hopefully boosted by January reinforcements. Chelsea takes on a bigger impetus without the comfort of Europe in the new year and I hope we can galvanise for Stamford Bridge as the sickening prospect of all remaining cup hopes being on the line in Wearside is not one I want to think about.\nMake no mistake we have come great distances in recent times. While this hurts right now these are exciting times and this season still promises a great deal. It’s maybe a weird thing where the transitional season has come after the breakthrough season and ambitions may need to be reset to aiming for the top six or seven and a good go at the domestic cups. Hopefully everyone stays pointing in the same direction and the team feels that support on Saturday.\nStill, gutted like.\nStats via BBC Sport:\nNewcastle 1 AC Milan 2 – Wednesday 13 December 8pm\nGoals:\nNewcastle United:\nJoelinton 33\nAC Milan:\nPulisic 59, Chukwueze 84\nPossession was AC Milan 42% Newcastle 58%\nTotal shots were AC Milan 12 Newcastle 17\nShots on target were AC Milan 2 Newcastle 8\nCorners were AC Milan 3 Newcastle 5\nReferee: Danny Makellie\nAttendance: 52,037 (Approx 1,200 AC Milan)\nNewcastle team v AC Milan:\nDubravka, Trippier (Burn 63), Lascelles, Schar, Livramento, Bruno, Lewis Miley (Longstaff 71), Joelinton, Almiron, Gordon (Isak 62), Wilson\nUnused subs:\nKarius, Harrison, Dummett, Hall\n(Newcastle 1 AC Milan 2 – Match ratings and comments on all of the Newcastle United players – Read HERE)\n(The uncomfortable truth that follows Newcastle 1 AC Milan 2 – Read HERE)\n(BBC Sport comments from ‘neutrals’ – Interesting on Newcastle United after AC Milan defeat – Read HERE)\n(Newcastle 1 AC Milan 2 – Newcastle United fan / writer reaction – Read HERE)\nYou can follow the author on Twitter @Mr_Dolf\nNewcastle United confirmed matches to end of January 2024:\nSaturday 16 December 2023 – Newcastle v Fulham (3pm)\nTuesday 19 December 2023 – Chelsea v Newcastle (8pm) Sky Sports\nSaturday 23 December 2023 – Luton v Newcastle (3pm)\nTuesday 26 December 2023 – Newcastle v Forest (12.30pm) Amazon\nMonday 1 January 2024 – Liverpool v Newcastle (8pm) Sky Sports\nSaturday 6 January 2024 – Sunderland v Newcastle (12.45pm) ITV\nSaturday 13 January 2024 – Newcastle v Man City (5.30pm) TNT Sports\nTuesday 30 January 2024 – Aston Villa v Newcastle (8.15pm) TNT Sports\nIf you would like to feature on The Mag, submit your article to contribute@themag.co.uk",
  "word_count": 2042,
  "scraped_at": "2026-02-14T02:17:09.410384",
  "_text_extracted": true
}