{
  "article_id": "8edac3c37d1b",
  "url": "https://dailypost.ng/2023/03/18/ucl-its-crazy-pulisic-makes-honest-confession-to-chelseas-quarter-final-draw-with-real-madrid/",
  "title": "UCL : It crazy - Pulisic makes honest confession to Chelsea quarter - final draw with Real Madrid",
  "date": "20230318T074500Z",
  "domain": "dailypost.ng",
  "source_country": "Nigeria",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Sport\nUCL: It’s crazy – Pulisic makes honest confession to Chelsea’s quarter-final draw with Real Madrid\nChelsea winger, Christian Pulisic has admitted that his side’s Champions League quarter-final fixtures against Real Madrid is not going to be easy.\nPulisic also said that it was crazy how fast things can change in football after Chelsea won their last three games in a row before the Champions League draw with Real Madrid.\nChelsea was drawn against Real Madrid during Friday’s Champions League last-8 draws in Nyon.\nThe two-legged Champions League quarter-finals will take place on April 11-12 and April 18-19.\n“I would not want to play us in the Champions League, I will say that much,” Pulisic told ESPN.\n“I think we were in a similar situation as far as the last time we won the Champions League. Halfway through the year, we are struggling in the league and a lot of people are counting us out. Look what happened then.\n“Has it been easy in recent weeks? No, but I am proud of the way the team has overcome it and the last week that we have had, getting three wins in a row.\n“I am feeling a lot of confidence now and it is crazy how fast things can change in football, it is a snap of a finger.\n“All of a sudden, you start to feel that confidence – especially in a team with a lot of new players – you start to feel each other out more. The team all of a sudden looks like a dangerous team to play against.\n“Is it going to be easy? No. Are we going to have big fights, tough battles and big teams that we’re going to play against to get there? 100% – but we are ready for it and we are excited by the challenge.”",
  "word_count": 306,
  "scraped_at": "2026-02-14T02:19:40.793532",
  "_text_extracted": true
}