{
  "article_id": "8ee4834c7b54",
  "url": "https://www.namibian.com.na/with-champions-league-final-psg-see-end-in-sight-in-quest-for-holy-grail/",
  "title": "With Champions League final , PSG see end in sight in quest for holy grail",
  "date": "20250528T120000Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It has taken almost 15 years of huge spending by their Qatari owners and an overdue shift away from signing glamorous superstars, but Paris Saint-Germain go into Saturday’s Champions League final against Inter Milan as favourites to finally win the coveted trophy for the first time.\nA club that for years made a habit of collapsing in spectacular fashion in big Champions League games has been transformed this season as a thrilling young team, brilliantly coached by Luis Enrique, has taken the continent by storm.\nOnce they might have been ridiculed by football fans around Europe who dismiss their domestic dominance due to the huge financial advantage they enjoy — PSG have just won their 11th Ligue 1 title in 13 years and eighth French Cup in a decade.\nNow, however, they draw admiration from rivals — “This is the most complete team we have faced,” said Arne Slot, whose Liverpool team lost to PSG in the last 16 in March.\nThe Parisian bid to dominate Europe began in 2011, when Qatar Sports Investments (QSI) bought a club in dire straits.\nTheir investment immediately catapulted PSG into the top-10 wealthiest clubs in Europe and the rise has been vertiginous since.\nMore than two billion euros ($2.28 billion) has been spent on transfers, and by last year, PSG’s annual revenue of over 800 million euros had made them the third-richest club in the world according to analysts Deloitte, behind only Real Madrid and Manchester City.\nThose two clubs are the last two winners of the Champions League, while PSG’s only previous appearance in the final came in 2020, when they lost to Bayern Munich behind closed doors in Lisbon during the Covid pandemic.\nPSG’s Qatari president Nasser al-Khelaifi had initially said the plan was to win the Champions League within five years of buying the club.\nThat did not happen, while signing both Neymar, for a world-record 222 million euros, and Kylian Mbappe in the same summer in 2017 was also not enough to deliver Europe’s biggest prize.\nIndeed PSG even went backwards after signing Lionel Messi in 2021.\n“It is a trophy the club have been waiting a long time for, but it is very difficult to win,” insisted Pedro Miguel Pauleta, a star PSG striker in the first decade of this century.\nThe genesis of their current success goes back to 2023, when the chronically-unfit Neymar and the ageing and unmotivated Messi departed.\nThat was the summer Luis Enrique arrived, replacing Christophe Galtier to become the eighth coach of the Qatar era.\nWith their all-time record scorer Mbappe spearheading the attack, PSG got to last season’s Champions League semi-finals, losing to Borussia Dortmund.\nBy then Mbappe had made it clear he would be leaving, yet Luis Enrique kept insisting his team would be better without the France superstar.\n“Last season we were also a proper team. I said we were going to improve the side. Players came in and all the stats say we are a better team now,” the Spaniard said last week.\nThe former Barcelona boss needed a young, energetic and hungry squad to make a success of his preferred style of football and they have recruited some of the world’s most exciting young players.\nCentre-back Willian Pacho, midfielder Joao Neves, and wingers Bradley Barcola and Desire Doue have been outstanding additions.\nOusmane Dembele has been turned by Luis Enrique into a clinical finisher who has 33 goals this season.\nKhvicha Kvaratskhelia joined from Napoli in January for good measure, and the oldest player in the squad now is Marquinhos, at 31.\n“We have the players to win the Champions League this year, next year or in eight years. We have the base on which to build a great team for the future,” Khelaifi said in a recent interview with German media.\n“The new star at Paris Saint-Germain is the team and I am really proud of the way in which we have transformed the philosophy of the club in such a short space of time.”\nIn fact it could be said the new star is the coach, so it is over to him to deliver in Munich.\n“We began preparing for this when we started pre-season training. It was in the minds of everyone at the club from then,” he said last weekend.\n“It is a game we have had marked in the calendar. We are coming into it in very good shape, full of confidence, and we are determined to go down in the history of the club.”\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 857,
  "scraped_at": "2026-02-14T02:09:11.444150",
  "_text_extracted": true
}