{
  "article_id": "8eedb8085d22",
  "url": "https://www.namibian.com.na/bayern-score-late-to-see-off-celtic-in-champions-league/",
  "title": "Bayern score late to see off Celtic in Champions League",
  "date": "20250219T013000Z",
  "domain": "namibian.com.na",
  "source_country": "Namibia",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bayern Munich secured their place in the last 16 of the Champions League with a 94th minute strike by Alphonso Davies on Tuesday to secure a 1-1 draw on the night and a 3-2 aggregate win.\nBayern will face either their fellow German rivals Bayer Leverkusen or Spanish giants Atletico Madrid in the last 16.\nCeltic had led 1-0 since the 63rd minute and the Scottish side had been on the verge of taking the German giants to extra time and pulling off their first ever win in Germany.\nBut with Harry Kane off injured and time running out, Davies stepped up as Bayern’s saviour, tapping in after Celtic keeper Kasper Schmeichel had kept out Leon Goretzka’s header.\nBayern went into this game 2-1 up from last week’s first leg at Celtic Park and seeking to stretch their unbeaten run to seven games in all competitions.\nBayern dominated possession in the first half but Celtic were more dangerous with at least three clear cut chances to score before the break.\nFormer Bayern Munich second-team player, Nicolas Kuehn beat Manuel Neuer but Raphael Guerreiro cleared off the line.\nMoments later, Alistair Johnston flashed a dangerous ball across the Bayern goal. With Neuer stranded the ball flew just beyond Daizen Maeda.\nThen Maeda missed a golden opportunity to put Celtic ahead. When Dayot Upamecano was forced into a stray pass, Kuehn led the surge forward and fed Maeda, who blazed over with Kuehn and Jota in support.\nBayern dominated the ball on a freezing night but suffered with a lack of quality in attack.\nSerge Gnabry was wasteful while Kane sometimes cut an isolated figure, starved of service.\nThe England captain’s best chance saw him rattling the bar with a snapshot after Josip Stanisic picked him out from the right.\nThat would be Kane’s final action. The striker was withdrawn at half time, feeling the effects of an injury picked up against Bayer Leverkusen on Saturday.\nBayern upped the pressure after the break and fashioned a clear chance when Goretzka went clean through. Schmeichel, however, made a crucial stop to keep Celtic in the game.\nSoon after, Celtic were in front. Maeda seized on a loose pass by Josip Stanisic and helped it on toward Kuehn. Min-Jae Kim reached the ball first but could not clear and Kuehn was able to take a touch and find the bottom corner.\nIt was a goal that shocked the Allianz Arena and threatened Bayern’s record of 20 European home games unbeaten. Celtic were delivering on coach Brendan Rodgers’ pre-match battle cry to show bravery.\nBayern sought an equaliser but Vincent Kompany’s side were reduced to long-range shots, with Schmeichel pulling off saves from Joshua Kimmich, Michael Olise and substitute Leroy Sane.\nCeltic were moments away from inflicting Bayern’s first defeat by a Scottish team and taking the tie into extra-time but the game had a sting in the tail. Olise delivered a pinpoint cross that was met by Goretzka.\nSchmeichel saved but Davies scrambled the rebound home off his shin to send Bayern through to the last 16.\nFeyenoord reach Champions League last 16 as Hernandez lets down AC Milan\nFeyenoord reached the last 16 of the Champions League on Tuesday after taking advantage of Theo Hernandez’s damaging sending off to draw 1-1 at AC Milan and go through 2-1 on aggregate.\nJulian Carranza thumped home the winning header in the 73rd minute at a frigid San Siro, sending around 5,000 away fans wild at the same ground where Feyenoord won the old European Cup in 1970.\nArgentine attacker Carranza, who told reporters he was too sick with fever to start the match, cancelled out Santiago Gimenez’s first-minute opener for the seven-time European champions Milan and sent the Dutch through to meet either Inter Milan or Arsenal in the next round.\nThe only sour note for Feyenoord was right-back Givairo Read being sent off after the final whistle as tempers flared on the touchline between both sets of players.\n“The 25 minutes that I played, or 30, I was not feeling great and I think everyone could see it, because after every single sprint there was coughing,” said Carranza.\n“It’s the most important goal I’ve ever scored so I’m really happy for that.”\nCarranza struck for Feyenoord shortly after coming on as substitute as the away side pushed to reach the next round following Hernandez’s red card five minutes after half-time.\nAlready on a booking for a needless foul on Anis Hadj-Moussa just before half-time, Hernandez was ruled by referee Szymon Marciniak to have dived in the penalty box when under pressure from Read.\nHernandez horror show\nThe France full-back, who went close to putting Milan ahead in the 23rd minute when he crashed a close-range effort off the post, was dismissed, leaving Milan on the back foot after having dominated up to that point.\nHernandez’s sending off and Carranza’s tie-winning header ruined what looked to be Gimenez’s night when he nodded home the opener against his old team after just 36 seconds.\nMexico forward Gimenez, who transferred to Milan from Feyenoord during the winter transfer window, pushed the ball home from practically on the line after Malick Thiaw did brilliantly to keep in Christian Pulisic’s cross.\n“Yes, today Theo was sent off but that could happen to anyone. That’s football,” said Gimenez to Sky.\n“We all have great respect for Theo and we ask that he is supported because he always gives everything for Milan and is one of the best full-backs in the world\n“Now we can’t look back, we have to look forward. We’re still in the (Italian) cup and have work to do in the league so all we can do is keep our heads down and work hard.”\nThe 23-year-old Gimenez has already scored three times for Milan since signing from Feyenoord but his sixth goal in the Champions League this season was also his last.\nMilan coach Sergio Conceicao was quick to deflect blame away from Hernandez.\n“You can talk about whether Theo was touched or not but we need to be stronger emotionally and mentally,” said Conceicao.\n“This elimination is down to me, not Theo or anyone else. I’m the one who’s responsible. Theo has gven a lot to Milan.”\nMilan are by no means assured of a spot in next year’s tournament as they sit seventh in Serie A, five points off the top four with a game in hand.\nAnd their season has been greatly compromised by the dismal way they lost the first leg in Rotterdam and Hernandez’s poor discipline which led to Tuesday’s painful elimination.\nIn an age of information overload, Sunrise is The Namibian’s morning briefing, delivered at 6h00 from Monday to Friday. It offers a curated rundown of the most important stories from the past 24 hours – occasionally with a light, witty touch. It’s an essential way to stay informed. Subscribe and join our newsletter community.\nThe Namibian uses AI tools to assist with improved quality, accuracy and efficiency, while maintaining editorial oversight and journalistic integrity.\nStay informed with The Namibian – your source for credible journalism. Get in-depth reporting and opinions for\nonly N$85 a month. Invest in journalism, invest in democracy –\nSubscribe Now!",
  "word_count": 1205,
  "scraped_at": "2026-02-14T01:52:15.336391",
  "_text_extracted": true
}