{
  "article_id": "8eff86a5b042",
  "url": "https://metro.co.uk/2025/05/03/arsenal-vs-bournemouth-live-premier-league-latest-score-goal-updates-23020505/",
  "title": "Arsenal vs Bournemouth LIVE : Premier League latest score and confirmed lineups",
  "date": "20250503T153000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bournemouth came from behind to seal a huge victory over Arsenal at the Emirates.\nDeclan Rice’s first-half strike had the Gunners in control in north London on Saturday evening.\nBut a meek second-half showing allowed the visitors to fight their way back into the contest with Dean Huijsen heading home an equaliser after 67 minutes.\nEvanilson put the Cherries in front with 15 minutes of the game remaining, winning a tussle up against Martin Odegaard to convert at the near post.\nThe Cherries hung on to do the double over Mikel Arteta’s side this season.\nAfter defeat at home to Paris Saint-Germain on Tuesday, Arsenal head to the French capital next week for the second leg of their Champions League semi-final.\nMore Trending\nWhile Luis Enrique rested 10 players for his side’ Saturday evening game against Strasbourg, Arteta named a strong team that included Rice, William Saliba, Bukayo Saka and Gabriel Martinelli from the start.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nDespite naming close to his strongest side, Arsenal could not get the job done with work still to do to book their place in next season’s Champions League.\nManchester City are now just three points behind the Gunners who need four points from their final three games to secure qualification.\nRelive the action with Metro’s LIVE blog.\nLive Feed\nThis Live Blog has now ended\nThis blog is now closed. For the latest updates, visit Metro’s Football page.\nFULL-TIME! Arsenal 1-2 Bournemouth\nBournemouth do the double over Arsenal!\nArsenal 1-2 Bournemouth\n95 mins | Arsenal probe before Sterling feeds through Partey who hits the deck after the slightest contact as he breaks into the box. No foul, and that will be that surely.\nArsenal 1-2 Bournemouth\n94 mins | Bournemouth have the ball back and are pinging it about comfortably. Arsenal are running out of time…\nArsenal 1-2 Bournemouth\n92 mins | It’s poor from Odegaard – his free kick doesn’t beat the wall and Bournemouth clear.\nArsenal 1-2 Bournemouth\n91 mins | Scott bundles Odegaard over on the edge of the D and Arsenal have the chance to pull level.\nFree kick extraordinaire Rice is on the bench. Odegaard may fancy this.\nArsenal 1-2 Bournemouth\n90 mins | Six minutes of added time have been chucked on.\nArsenal 1-2 Bournemouth\n86 mins | Finally, Arteta makes his changes.\nEthan Nwaneri takes the place of Saka, Raheem Sterling is on for Martinelli and Oleksandr Zinchenko replaces Ben White.\nArsenal 1-2 Bournemouth\n83 mins | This is very meek from Arsenal. They drop deeper and deeper to try and avoid the press and eventually lose possession. Bournemouth advance but play is pulled back for a free kick.\nArsenal 1-2 Bournemouth\n80 mins | There are 10 minutes left and Declan Rice is the only player to have been subbed off. Saka, Saliba, Partey, Martinelli are among those still out there. There is a game to be won, after all.\nGOAL STANDS!\nReplays suggest the ball might have come off Evanilson’s elbow… but VAR decides there isn’t enough evidence to rule it out and the goal stands!\nArsenal 1-2 Bournemouth\nArsenal ship another! It’s a set piece that causes the damage again. Tavernier meets the corner with a superb flicked header. Evanilson is tussling with Odegaard at the far post and the Bournemouth striker wins the battle to poke home from close range!\nThere will be a VAR check however…\nGOAL! Arsenal 1-2 Bournemouth (Evanilson, 74 mins)\nBournemouth take the lead!\nArsenal 1-1 Bournemouth\n73 mins | Arteta makes his first change of the evening – Mikel Merino comes on for goal scorer Rice.\nArsenal 1-1 Bournemouth\n71 mins | Bournemouth smell a second here – Arsenal cannot clear their lines and are looking very nervy.\nArsenal 1-1 Bournemouth\n67 mins | Bournemouth are level! Semenyo takes the long throw in, launching it into the Arsenal box. Huijsen is somehow free to meet it, directing it across goal with a pinpoint header to level the game.\nGOAL! Arsenal 1-1 Bournemouth | Dean Huijsen, 66 mins\nArsenal let another lead slip!\nArsenal 1-0 Bournemouth\n65 mins | Semenyo is off the bench and races forward with acres of space on the counter. Maybe still a bit rusty having just come on, a heavy touch allows Lewis-Skelly to get back and force the throw in.\nArsenal 1-0 Bournemouth\n59 mins | Ouattara gallops past White like he’s not there and threads an inviting ball across goal with two for company. Raya reads it well though and is out to collect.\nArsenal 1-0 Bournemouth\n57 mins | For the third time today, Raya plays a very dangerous ball out the back. There are gasps around the Emirates but he just about gets away with it.\nArsenal 1-0 Bournemouth\n52 mins | More neat play from the Gunners involving Odegaard and Trossard. It breaks to Saka but his effort is deflected out for amcorner.\nMORE: Ralf Rangnick sends warning to ‘significantly worse’ Man Utd ahead of Athletic Bilbao clash\nMORE: Arsenal or PSG? Didier Drogba asked to pick Champions League favourite\nMORE: Mikel Arteta explains risky Arsenal team selection against Bournemouth",
  "word_count": 904,
  "scraped_at": "2026-02-14T02:09:01.834186",
  "_text_extracted": true
}