{
  "article_id": "8f08cbcabfb6",
  "url": "https://www.90min.com/posts/four-things-real-madrid-fix-november-international-break",
  "title": "Four things Real Madrid need to fix during the November international break",
  "date": "20231117T161500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Four things Real Madrid need to fix during the November international break\n- Madrid have started the season well but injuries are beginning to pile up\n- Just behind La Liga leaders Girona and have qualified for the Champions League last 16\n- How Carlo Ancelotti can keep their trophy hunt on track\nReal Madrid may not sit at the top of La Liga by the November international break, but there's little doubt they have caught the eyes of fans around the world already this season.\nWhile the campaign began with Karim Benzema's departure to Saudi Arabia and questions over manager Carlo Ancelotti's future, the arrival and subsequent incredible form of Jude Bellingham has helped drag Los Blancos into second in Spain's top flight, two points behind surprise leaders Girona.\nQualification for the 2023/24 Champions League knockout stages has been confirmed with two Group C games still to play, but it hasn't all been plain sailing for the 14-time European champions.\nHere's what Madrid need to sort out while international football takes centre stage in mid November.\nQuick Links\nStop all the drama over their medical department\nInjuries unfortunately go with the territory in football. Some days are quiet and other nights see teams lose two of their best players long-term in the space of ten minutes.\nHow Madrid haven't helped themselves, however, is with their incompetent approach to Arda Guler's rehabilitation. The young Turkey international is yet to make his debut for the club due to a knee injury, but the dithering over whether he needed surgery or not has slowed his comeback.\nThe club's chief medical officer paid the price as he was fired and Madrid now need professionalism from those behind the scenes, with so many first-team stars suffering knee problems.\nGet Jude Bellingham in the oxygen chamber\nBellingham's electric start at Madrid has dominated headlines around Europe but his past injuries do prompt some cause for concern.\nThe former Borussia Dortmund midfielder pulled out of the England squad with a knee issue. Bellingham has suffered knocks there before, most notably missing the final day of the 2022/23 Bundesliga season when BVB threw away the title in his absence.\nThe 20-year-old has stepped into Benzema's talismanic shoes seamlessly with 13 goals in 14 games and his form will be incredibly important to Los Blancos' trophy hopes in the remainder of the season. A prolonged absence will be nightmare fuel for Madridistas, so Bellingham and those around him must use the time to get him as niggle-free as possible.\nFigure out how to get their forwards scoring regularly\nBellingham's form and goal output has helped Madrid bridge the gap from the departed Benzema to their next superstar striker - whoever that may be - but he could do with a little more help from his talented wing duo.\nVinicius Junior and Rodrygo aren't natural strikers and have been asked to play somewhat out of position by Ancelotti - they are hardly unique in that regard, mind - but their combined lack of threat and wastefulness in front of goal needs to be curtailed.\nVinicius, who suffered a thigh injury on international duty, has over-performed his low xG of 2.89 to score four La Liga goals while Rodrygo is under with three strikes from 5.32 xG.\nBellingham's impressive start will drop off at some point and Madrid will need their Brazilian duo to contribute when it's needed to keep Los Blancos in trophy contention.\nKeep throwing shade at Barcelona\nJust where does Gerard Pique get off, eh?\nThe former Spain defender recently claimed Champions League triumphs are \"remembered forever\" at old club Barcelona and that few will hark back to Madrid's 2022 triumph.\nHe said: \"When [Madrid] win, it is just another one. The last one [in 2022], which was a miracle because they were inferior in each round, and it won't be remembered.\"\nSure, who could remember that 2022 run when they beat French giants Paris Saint-Germain, defending champions Chelsea and Premier League behemoths Manchester City in the knockout stages and an electric Liverpool in the final with all manner of late goals and drama?\nI didn't even need to look those results up which somewhat disproves Pique's theory, but Los Blancos striker Joselu saw it a different way, labelling the ex-Barcelona star \"envious\".\nHow any club could prefer to have five European titles instead of 14 is somewhat ludicrous, and with Barca struggling for form and consistency despite their reasonable standings domestically and in the Champions League, poking the bear a little more could see the Barca camp unravel.",
  "word_count": 762,
  "scraped_at": "2026-02-14T02:17:09.422764",
  "_text_extracted": true
}