{
  "article_id": "8f12c57b97eb",
  "url": "https://dailytrust.com/mixed-reactions-greet-proposed-presidential-reception-for-remo-stars/",
  "title": "Mixed reactions greet proposed presidential reception for Remo Stars",
  "date": "20250614T063000Z",
  "domain": "dailytrust.com",
  "source_country": "Niger",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The planned presidential reception in honour of the reigning Nigeria Premier Football League (NPFL) champions, Remo Stars, has triggered a storm of ethnic agitation within Nigeria’s football circles as stakeholders raise concerns over perceived regional bias and the need for equity in recognising sporting achievements.\nReports have it that Remo Stars, a privately-owned club based in Ikenne, Ogun State, is to be hosted by President Bola Ahmed Tinubu before the start of the new season following their remarkable triumph in the 2024/25 NPFL—marking their first-ever league title. While many applaud the honour, others view it as a controversial move.\nAlthough the Presidency is yet to confirm or deny the reports that the president is going to host the victorious club in Aso Rock, it would be recalled that in May, a day after their NPFL victory, President Tinubu, through a statement released by his Special Adviser on Media and Information Strategy, Mr Bayo Onanuga, saluted the Ikenne side to demonstrate his support for the NPFL and the champions.\nThe initial reaction of the president to Remo Stars’ victory is said to have given credence to reports that he is going to host the club, even as the NPFL has denied knowledge of the widely publicised reception.\n- Fiscal Expenditure: N39bn ICC cost can build 312 health centres, 1,200 classrooms\n- Kanu’s broadcasts incited violence in South-East, DSS tells court\nA top official of the NPFL who spoke to our reporter on condition of anonymity said neither the league oragnisers nor the management of Remo Stars was aware of the planned hosting.\nHe said, “We also read it in the news and immediately contacted Remo Stars, but they said they were not aware of the proposed presidential reception.\n“I think the whole thing is an arrangement between the National Sports Commission (NSC) and the Presidency. In any case, it is a welcome development because in the USA, winners of the NBA are usually received by the president.”\nHowever, there are dissenting voices as some football stakeholders are saying that what is good for the goose should be good for the gander. Stakeholders, particularly those from the South-East, are of the view that since Enugu Rangers won their last NPFL title under the present administration in 2023, they too should be invited.\nOthers have said that leaving out El-Kanemi Warriors who won the Federation Cup in the same year that Enugu Rangers clinched the league title is also not acceptable.\nIn any case, supporters of Remo Stars have continued to point to the club’s unique achievements on and off the pitch as reasons for the proposed reception.\nOwned by Kunle Soname, a Nigerian billionaire and business mogul, the club has developed one of the best football structures in Africa, including a vibrant academy and modern training facilities. These, along with their commitment to youth development, are viewed by many as deserving of national honour.\nStill, there is a consensus among neutral observers that such high-level recognitions must be handled with caution and inclusivity. They opine that in a country as diverse as Nigeria, where public gestures carry deep symbolic value, perceived bias can do more harm than good.\nBoth President Tinubu and the victorious Remo Stars are from the South-West, giving rise to what is now perceived as ethnic bias.\nSome stakeholders express scepticism\nA former chairman of the Gombe State Football Association and chairman of the Gombe State Athletics Association, Ahmed Shuaibu Gara Gombe, has called the proposed reception ill-timed and unsustainable.\n“This is ill-timed and ill-advised. Enugu Rangers and El-Kanemi are champions within the period Tinubu has been in office. This is poor advice. Instead of them making friends for the president, they are making enemies for him.\n“This move is not sustainable, then why start it? Even the Federation Cup final is a few days away. Will they take the winners to the president?\n“We don’t have a stadium to host international matches. Only one stadium we have that meets the standards of FIFA and CAF, but they are only interested in ceremonies. They should also ask the president to host the families of the Kano 22 athletes who died in national service,” he said.\nA former member of the House of Representatives and proprietor of the defunct Jos City Raiders FC, Lumumba Dah Adeh, said the reception would serve no good as it smirks of politicisation of sports.\n“Even as I commend Remo Stars as a privately owned club achieving such a near impossible feat after a long time, I see such reception as not only unnecessary and uncalled for but also the height of politicisation of sports, which ultimately will serve no one any good.\n“So Remo alone or with Rangers, I am not thrilled. You see, the league is a professional venture; possibly, if it were the FA Cup winners, I may have a different opinion,” he said.\nA former chairman of Federal Capital Territory (FCT) coaches, Godwin Bamigboye, urged the president to receive both Enugu Rangers and Remo Stars to end any feeling of favouritism.\n“What the president wants to do is a good gesture, but I think his aides, including the chairman and director-general of the NSC should be able to advise him appropriately.\n“If it is the national teams, that’s good, but not for a club. Had it been that Remo Stars won the CAF Champions League or Confederation Cup, we can be talking about the reception. But for him to receive the domestic league’s champions, I think it may not be completely okay. Rangers won it last season but he didn’t receive them. He can combine the two and make it an annual ritual,” he said.\nA move in the right direction – Yakmut, Tyowua, Akpehe\nA former director-general of the NSC, Alhaji Alhassan Yakmut, hailed the move as an innovative one but said it should be sustained beyond the current administration.\n“We are in an innovative society. It is never too late to do the right thing. That the president is doing this now should not be seen in a different light.\n“Is it the president that asked Remo Stars to win the league? This is the first time this is being done and we ought to see that it becomes a tradition beyond this current administration,” he said.\nThe secretary of the Benue State Football Stakeholders Forum, Coach Austin Tyowua also threw his weight behind the move, arguing that it may not have been done in the first year because it is a new concept.\nHe said, “Someone raised that, but I don’t think it is a justifiable line of argument. There is always a beginning to everything. If the president has been hosting league title winners and skipped Rangers, it would make more sense to accuse him of ethnic bias, but since it is a new concept, I think it is not a strong argument.\n“He didn’t promise to do that and failed. Many actions he (Tinubu) is taking now were not taken in his first year. You cannot say that what he didn’t do in his first year should not be done in his later years or must be backdated.”\nIn the same vein, the president and chief executive officer of Galaxy Sports Academy, Mr Austin Akpehe, said it was possible that Enugu Rangers didn’t see the need to present their title to the president when they won the league last year.\n“There should be even grounds. But it all boils down to proposals and propositions. It is possible that Remo Stars made the move to visit the president and present the trophy to him. It is also possible that Enugu Rangers never saw it necessary to write and request to present the trophy to Mr President.\n“I think that if Rangers had requested to present their trophy to Mr President and they were turned down, by now, the media would have exposed him and his unfairness.\n“Consequentially, if Enugu Rangers raised any eyebrow, they are only dwelling on the premise that Remo Stars are to be hosted, but did they request for it?” Akpehe asked.\nDespite the divergent views, the debate underscores a longstanding tension in Nigeria’s sports landscape, where ethnic and regional imbalances in recognition, appointments and resource allocation continue to spark discontent.\nMany sports stakeholders are calling for a more merit-based and inclusive framework that ensures equal treatment and recognition for all achievers.\nUPDATE NEWS:\nNigerians can now invest ₦2.5 million on premium domains and profit about ₦17-₦25 million. All earnings paid in US Dollars. Rather than wonder, click here to find out how it works.",
  "word_count": 1431,
  "scraped_at": "2026-02-14T02:15:31.403905",
  "_text_extracted": true
}