{
  "article_id": "8f27ade6e63b",
  "url": "https://www.france24.com/en/live-news/20230608-man-city-and-inter-target-champions-league-glory-in-istanbul-final",
  "title": "Man City and Inter target Champions League glory in Istanbul final",
  "date": "20230608T063000Z",
  "domain": "france24.com",
  "source_country": "France",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Man City and Inter target Champions League glory in Istanbul final\nIstanbul (AFP) – Manchester City are hoping to get their hands on the Champions League trophy at last, and complete a historic treble, when Pep Guardiola's team face outsiders Inter Milan in Saturday's final in Istanbul.\nIssued on:\nCity have been building towards winning Europe's elite club competition since the Abu Dhabi-backed takeover of 2008 which transformed them and helped reshape the sport on the continent.\nThey came agonisingly close to Champions League glory in 2021, losing narrowly to Chelsea in the final, before being denied in last year's semi-finals by a remarkable Real Madrid comeback.\nHaving exacted revenge on Madrid, the holders, in this season's last four with a 5-1 aggregate triumph, they are now expected to complete the job at the Ataturk Olympic Stadium.\n\"We have all been working for this for a long time,\" City goalkeeper Ederson, at the club since 2017, said this week.\n\"The whole team have seen a lot of victories but also defeats as well. The players who have been here for five or six years who have seen these sorts of defeats, we have learnt from them so that helps us to grow as a team.\"\nA victory for City will see them complete the treble after they claimed a fifth Premier League title in six seasons and then lifted the FA Cup last weekend, beating Manchester United 2-1 in the final.\nUnited were the last English club to achieve the treble, in 1999.\nIlkay Gundogan was City's goal hero in the FA Cup final, as Erling Haaland drew a rare blank, but the Norwegian has scored 52 times for his club this season.\nHis goals appear to have taken City to another level, and Guardiola seems poised to finally win a third Champions League, 12 years after claiming a second in three seasons with Barcelona.\n\"If we want to make a definitive step as a big club, we must win in Europe,\" Guardiola, who joined City in 2016, told UEFA.com.\n\"We have to win the Champions (League). That's something you can't avoid.\"\n'A lot of expectation'\nSimone Inzaghi's Inter may have something to say about that, however, and perhaps being the underdog will suit the Nerazzurri.\nThey are one of Europe's grand old names, having won the European Cup twice in the 1960s.\nThis is their sixth final altogether, and first since Jose Mourinho's team triumphed in 2010, completing a treble of their own.\nNo Italian club has lifted the trophy since.\nMoney talks more than ever in football, and City topped this year's Deloitte Football Money League with revenue of over 700 million euros ($749m).\nTheir revenue was more than double that of Inter, a club swimming in enormous debts. Nevertheless, their proud history means Inter will be in Saturday's final to win it.\n\"We are a big club and we have a lot of expectation,\" said goalkeeper Andre Onana.\n\"When Inter gets into a final they have to win. We're all big players, we know how to play finals.\"\nInter, who finished third in Serie A and won the Coppa Italia, could have had a harder run to this stage, beating Porto, Benfica and neighbours AC Milan in the knockout rounds.\nHowever, they did qualify from a difficult group ahead of Barcelona.\nPast drama at the Ataturk\nCuriously, City's first ever appearance in the old European Cup came against Istanbul club Fenerbahce in the 1968/69 first round, and ended in a 2-1 defeat.\nThat team, featuring Francis Lee, Colin Bell and Mike Summerbee, was City's last great side before Abu Dhabi's arrival.\nCity did not return to Europe's top table until 2011, by which time former Inter coach Roberto Mancini was at the helm.\nThe Ataturk Olympic Stadium has hosted a Champions League final between English and Italian clubs before.\nThis year's match will need to go a long way to equal the drama of 2005, when Rafa Benitez's Liverpool recovered from a three-goal half-time deficit to draw 3-3 with Carlo Ancelotti's Milan before winning on penalties.\nThe 72,000-seat stadium, located around 25 kilometres west of central Istanbul, now finally gets the chance to stage the showpiece game again.\nIt was supposed to be the venue for the 2020 final, only for the pandemic to force UEFA to move the latter stages of the competition to Lisbon.\nPlans to hold the final there in 2021 again had to be changed, with the match between City and Chelsea eventually taking place in the Portuguese city of Porto.\n© 2023 AFP",
  "word_count": 761,
  "scraped_at": "2026-02-14T02:07:02.902205",
  "_text_extracted": true
}