{
  "article_id": "8f43bbe8af37",
  "url": "https://www.myjoyonline.com/twenty-times-but-now-manchester-united-must-exit-ice-age/",
  "title": "  Twenty time - but now Manchester United must exit  Ice Age  ",
  "date": "20250428T060000Z",
  "domain": "myjoyonline.com",
  "source_country": "Ghana",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Audio By Carbonatix\nAfter an hour of Manchester United's draw at Bournemouth, their travelling support struck up a familiar refrain.\n\"Twenty times, 20 times, Man United. Twenty times, 20 times, I say. Twenty times, 20 times, Man United, playing football the Matt Busby way.\"\nThe song has been a source of both pride and solace since United won the most recent of those championships to ease Sir Alex Ferguson into retirement in 2013.\nOn Sunday, it felt particularly poignant.\nAt the time they sang, those supporters did not know the day would end with Liverpool being crowned champions. But they knew it was coming. That very soon, their fierce rivals would join them on the total that had previously meant they stood alone as the most successful team in English football.\nAnd while Rasmus Hojlund's injury-time equaliser prevented them experiencing yet another defeat in this torturous domestic campaign as they drew 1-1 at the Vitality Stadium, there is no disguising the reality of the situation.\n\"Oh yes, it matters,\" said Adam Bell - a long-time United fan, who started following the club in 1973-74, just as they were about to be relegated.\n\"It was really important for us to get to 20. Now they are joining us and you have to say they have a better chance of getting to 21 and 22 than we have.\"\nHis friend Andrew Harris agreed.\n\"But if you look back,\" he said, \"this kind of thing happens in cycles at Manchester United.\n\"We had the Busby Babes and the 1968 team, then we dropped back in the 1970s and 1980s, then Fergie came. Now we are in the next Ice Age.\"\nAfter David Moyes, Louis van Gaal, Jose Mourinho, Ole Gunnar Solskjaer and Erik ten Hag tried, it is Ruben Amorim's turn to attempt to prise United out of the deep freeze.\nHis results since replacing Ten Hag in November have been patchy.\nThe draw at Bournemouth means United have collected two points from their past five games. It lifted them a place to 14th but they are still heading for their worst finish since the relegation season over half a century ago. The nadir since then was 13th place in 1989-90, when Liverpool won their 18th league crown.\nWhat Amorim has done is to understand the history around Old Trafford.\nTo his credit, he also refuses to dodge a question.\nLiverpool and their achievements, he said, were not his concern. What he thinks about Manchester United is another matter.\n\"The first thing is to focus on ourselves and not on the other teams,\" he said. \"The next thing is to be really honest.\n\"We are in different levels [to Liverpool] in this moment. But I remember when I start seeing Premier League, was the opposite. So, everything can change.\"\nAmorim said United must not try to think too far ahead.\n\"We have an ultimate goal that is winning the Premier League,\" he said. \"I'm not crazy, I know it's not going to be next year. But we are trying to build something and the small things we did during this year are really important.\n\"We need to improve next year, we know that.\"\nThere is support for Amorim in the fanbase, even if they don't all feel the salvation that would come from a Europa League triumph this season is realistic.\nIn an ordinary season, a two-legged semi-final with Athletic Bilbao - fourth in La Liga - would be regarded as tricky. Ferguson's team couldn't beat them in a 2011-12 Europa League last-16 tie when Andoni Iraola - now Bournemouth manager - played for them.\nThis season, many fans will have hope rather than expectation.\nVictory in the final in Bilbao - which, of course, offers United's opponents even more incentive - not only provides Champions League riches but is also their only route back into Europe full stop.\n\"I hope the project to rebuild works but it is going to take a few years,\" said Bell. \"Even winning the Europa League is a long shot.\n\"I like Amorim. I am positive about him, but we need patience. It takes time to build a team and make them successful. It took Sir Alex Ferguson a long time.\"\nFerguson was three and three-quarter seasons into his tenure before he delivered the trophy that changed United's history for the better. The parallels with that season and this are impossible to ignore given the respective league positions.\nThere was no social media then, no 24-hour rolling news cycle and endless talk on infinite platforms for opinion to be expressed on the club's dysfunctional results.\n\"Two to three years\" was Bell's assessment on the time Amorim will need.\nHis friend is not so sure.\n\"Ten,\" he said, referring back to his Ice Age comment, \"using the same Glacial calendar.\n\"It is not going to be instant, that's for sure.\"\nLatest Stories\n-\nBooming Indicators, Dying Rivers: Ghana under Chronic Environmental Poisoning\n8 minutes -\nThe Accra Mandate: Securing Africa’s AI Future through Local Data and Ethical Governance\n36 minutes -\nAquafresh donates to National Chief Imam ahead of Ramadan\n1 hour -\nAdopt a mix of bond and short-term finance to address financing challenges in cocoa industry – Professor Peprah to government\n1 hour -\nNSA introduces dual authentication system for 2025/26 enrolment exercise\n2 hours -\nFuel prices to increase from Feb. 16, influenced by cedi’s depreciation\n3 hours -\nGNFS to launch automated fire safety compliance system to modernise regulation\n3 hours -\nNALAG president commends Local Gov’t Minister for payment of assembly members’ allowances\n3 hours -\nIs having a physical security operations center in your business worth it?\n3 hours -\nAsiedu Nketia recounts fierce political wars in Ajumako-Enyan-Essiam constituency\n3 hours -\nNRSA sets up committee to probe road crashes involving Toyota Voxy\n3 hours -\nCocoa farmers decry the adverse impact of producer price cut on livelihoods\n3 hours -\nFamilies who lose relatives to ‘no bed syndrome’ must sue health facilities – Dr. Nawaane\n3 hours -\nGhana Sports Fund: Dr. David Kofi Wuaku outlines vision for Youth Empowerment growth through sports\n4 hours -\nNUGS President urges sustainable digital governance\n4 hours",
  "word_count": 1033,
  "scraped_at": "2026-02-14T02:09:01.854673",
  "_text_extracted": true
}