{
  "article_id": "8f57d1738c63",
  "url": "https://www.90min.com/posts/6-transfers-we-want-to-see-final-week-january-window",
  "title": "6 transfers we want to see in the final week of the January window",
  "date": "20240126T001500Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "6 transfers we want to see in the final week of the January window\n- The January transfer window hasn't seen much blockbuster activity thus far\n- Plenty of world class players have been linked with moves before the window shuts\n- Here are six transfers we'd like to see go through\nLet's call a spade a spade: the 2024 January transfer window has been pretty damn boring.\nAside from Tottenham - they've at least signed Timo Werner and Radu Dragusin - top clubs around Europe have simply refused to do any sort of business that doesn't involve a young player returning from loan and then going on loan to a different club for the rest of the season.\nSo in a bid to spice things up a bit heading into the final week of the transfer window, we at 90min have decided to try and wish some signings into existence.\nHere's six transfers we want to see go through before the window shuts...\nKarim Benzema - Al Ittihad to Manchester United\nThere's clearly a good player in Rasmus Hojlund...deep down...somewhere. The ex-Atalanta forward has basically everything you could want in a number nine, but Erik ten Hag was perhaps asking a bit too much of Hojlund when he decided to make him the club's one and only centre forward heading into the 2023/24 season.\nThat pressure has not agreed with Hojlund and, as such, he's managed two Premier League goals all season.\nEnter 2022 Ballon d'Or recipient and five-time UEFA Champions League winner Karim Benzema.\nRumours have been swirling regarding Benzema's potential loan availability this January - thanks to seeming regret from joining Saudi Pro League outfit Al Ittihad - and if they're true, Manchester United should be first in line to sign the legendary forward.\nBenzema would provide United's forward line with star power, ease the pressure on the young Hojlund, and his ability to drop deep and link play could bring out the best in Marcus Rashford once again.\nIt's a transfer that makes so much sense.\nGoncalo Inacio - Sporting CP to Liverpool\nVirgil van Dijk and Ibrahima Konate have struck up quite an impressive partnership at the heart of Liverpool's defence this season, but outside of that first-choice pair, Jurgen Klopp doesn't have too many options to call upon.\nAside from the hugely talented Jarell Quansah and a Joe Gomez who is more regularly used as a full-back these days, Klopp has little else with Joel Matip out with an ACL injury.\nWhen going toe-to-toe with Manchester City for the Premier League, that simply isn't enough.\nIn order to bulk up the defensive options, Klopp and co should probably turn to Goncalo Inacio this January. The 22-year-old has the physical stature and capabilities on the ball to fill in for Van Dijk when needed, and has the potential to go on and become a regular when the Dutch star begins to wind down his career.\nIvan Toney - Brentford to Arsenal\n\"You can never predict when is the right time to move elsewhere, but I think it's obvious I want to play for a top club. Everybody wants to play for a top club that is fighting for titles. Whether it's this January that is the right time for a club to come in and pay the right money, who knows?\"\nThose are recent quotes from Ivan Toney - a man seemingly desperate to leave Brentford as soon as possible.\nThe striker recently returned to action following a betting ban, and immediately got among the goals in his first game in eight months. Noticing that Toney hasn't missed a beat during his lengthy lay-off, while also noticing his current strikers regularly ballooning the ball wide of the net during crucial games, Mikel Arteta should be considering making a move for the current Brentford star this January.\nHe's a reliable goalscorer in the Premier League, and that's probably the only thing Arteta's team is missing right now.\nVictor Osimhen - Napoli to Chelsea\nA player signing a new contract at his current club usually puts talk of a transfer to bed, but it's done the opposite for Victor Osimhen.\nThe striker put pen to paper on a new deal which runs until 2026 at Napoli just before Christmas, but with a nine-figure release clause in it, the fact that the Serie A champions have been utterly rancid this season, and Osimhen continuing to discuss a future move to the Premier League, it's very obvious that he's leaving very, very soon.\nOsimhen's most obvious destination is the free-spending striker-less (we refuse to count Nicolas Jackson) Chelsea, who have been heavily linked with the Nigerian star for quite a while.\nThiago Alcantara - Liverpool to Barcelona\nJust imagine it: a decade after leaving Barcelona, prodigal son Thiago Alcantara returns to his boyhood club.\nIt's a beautiful story, isn't it?\nAnd it's one we'd like to see become a reality this January, especially when Barca are in dire need of midfield cover following Gavi's season-ending injury, Pedri's hamstring becoming even less trustworthy, and Oriol Romeu's poor performances.\nIf* Thiago can stay fit, he'd be a tidy loan addition for Xavi's side.\n*We are aware of how big an 'if' this is.\nKylian Mbappe - Paris Saint-Germain to Real Madrid\nLook, Kylian Mbappe is almost certainly going to join Real Madrid, so why not just do it this January?\n*Fixes glasses* \"Because it doesn't make financial sense to sign a player for a huge fee when he'll be free in the summer.\"\nYeah, we know that, but it'd be funner if Madrid went out and signed Mbappe within the next week instead. And that's, fundamentally, all that matters to football fans.\nThe forward would also instantly make Los Blancos heavy, heavy favourites to win the UEFA Champions League this season too.",
  "word_count": 971,
  "scraped_at": "2026-02-14T02:04:47.091530",
  "_text_extracted": true
}