{
  "article_id": "8f76430c3717",
  "url": "https://metro.co.uk/2025/05/06/real-madrid-offer-transfer-fee-liverpool-sign-trent-alexander-arnold-early-23032236/",
  "title": "Real Madrid offer transfer fee to Liverpool to sign Trent Alexander - Arnold early | Football",
  "date": "20250506T084500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Real Madrid are ready to pay a transfer fee to Liverpool in order to sign Trent Alexander-Arnold for the Club World Cup this summer.\nAlexander-Arnold confirmed on Monday that he will leave Liverpool on a free transfer after his contract expires at the end of the season.\nThe 26-year-old has already reached an agreement to join Real Madrid on a free transfer this summer and is set to sign a six-year contract with the Champions League holders.\nHowever, Cadena COPE report that Madrid want to have Alexander-Arnold registered in their squad to play in their Club World Cup campaign, which starts with their opening group game against Al-Hilal on June 18.\nMadrid are also due to play Mexican side Pachuca and RB Salzburg in Group H.\nAlexander-Arnold’s contract with Liverpool expires at the end of June, however, the summer transfer window will temporarily open from from June 1 to June 10 to allow teams who are participating in the Club World Cup to sign new players.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nThat window would give Madrid an opportunity to sign Alexander-Arnold before the tournament starts and Cadena COPE report that the Spanish club are ready to offer a €1 million (£850,000) transfer fee to Liverpool.\nBy that stage, Liverpool’s season would be over as their final Premier League game is at home to Crystal Palace on May 25.\nMadrid had made an attempt to sign Alexander-Arnold in the January transfer window following Dani Carvajal’s season-ending injury in October.\nHowever, Liverpool turned down Madrid’s approach, despite the Spanish side ready to pay a £20m transfer fee.\nWhen announcing his Liverpool exit on Monday, Alexander Arnold said: ‘After 20 years at Liverpool Football Club, now is the time for me to confirm that I will be leaving at the end of the season,’ Alexander-Arnold said.\n‘This is easily the hardest decision I’ve ever made in my life. I know many of you have wondered why or been frustrated that I haven’t spoken about this yet.\n‘But it was always my intention to keep my full focus on the team’s best interests, which was securing No.20 [the Premier League trophy].\n‘This club has been my whole life – my whole world – for 20 years.\n‘From the Academy right through until now, the support and love I have felt from everyone inside and outside of the club will stay with me forever.\nMore Trending\n‘I will forever be in debt to you all. But, I have never known anything else and this decision is about experiencing a new challenge, taking myself out of my comfort zone and pushing myself both professionally and personally.\n‘I’ve given my all every single day I’ve been at this club, and I hope you feel like I’ve given back to you during my time here.\n‘From the bottom of my heart, I thank everybody – my coaches, my managers, my teammates, the staff and our incredible supporters – for the last 20 years.\n‘I’ve been blessed enough to live out my dreams here and I will never, ever take for granted the special moments I’ve been fortunate enough to have lived through with you all. My love for this club will never die.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Man Utd’s £30m transfer target told to join ‘desperate’ Premier League rivals instead\nMORE: Is ‘dangerous’ Lamine Yamal the best player in the world right now?\nMORE: Dodgy defence means Arsenal face Champions League exit to Paris Saint-Germain",
  "word_count": 644,
  "scraped_at": "2026-02-14T02:02:47.557667",
  "_text_extracted": true
}