{
  "article_id": "8f79244f57bc",
  "url": "https://theathletic.com/4885428/2023/09/29/womens-super-league-predictions-new-season/",
  "title": "Women Super League 2023 - 24 season predictions : By our women football experts",
  "date": "20230929T044500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "The 2023-24 Women’s Super League (WSL) season gets underway on Sunday, 42 days since the Lionesses took on Spain in the World Cup final in Sydney.\nWill Chelsea, as the winners of the last four WSL titles, secure a record-breaking fifth? How will Bristol City, who were relegated in 2021, cope on their return?\nAdvertisement\nWill Arsenal, who suffered an early exit from the Champions League when they lost to Paris FC on penalties this month, have more success on the domestic stage?\nWith a big summer of stellar signings, which stars are the ones to watch?\nOur women’s football experts Charlotte Harpur, Michael Cox, Katie Whyatt and Chloe Morgan — along with former Lioness Izzy Christiansen and football commentator Pien Meulensteen — give their verdicts on what they think will happen…\nGO DEEPER\nFull Time with Michael Cox: Arsenal already playing catch-up, Liverpool off to a flier again\nWSL title winner?\nCharlotte Harpur: I’m torn between Arsenal and Chelsea. Without the Champions League, Arsenal can dedicate all their resources to the WSL, but the league is Emma Hayes’ bread and butter. Although she will have one eye on Europe, Hayes will not want to let the domestic title slip. They have the talent, strength in depth and experience to win again, so I’ll go for Chelsea.\nGO DEEPER\nWith Hannah Hampton joining Chelsea, why are they the only WSL side to have five goalkeepers?\nChloe Morgan: Arsenal — they have an added incentive to win it after crashing out of the Champions League. They have made some stellar international signings — England striker Alessia Russo, World Cup winner Laia Codina and Sweden defender Amanda Ilestedt. Beth Mead is back from after a long absence with an anterior cruciate ligament injury.\nMichael Cox: Arsenal will play the best football and Chelsea will somehow, as always, find a way to grind it out and win the league.\nPien Meulensteen: Arsenal will have a point to prove after last season and it would be interesting if they could push Chelsea all the way. They have great players coming back in and getting fit again, so I’ll go Arsenal.\nKatie Whyatt: Chelsea. It would not shock me if this evolving Arsenal side were to beat Chelsea in some of the head-to-heads, but Chelsea’s experience, depth and consistency will get the job done again.\nIzzy Christiansen: Arsenal or Chelsea. It’s going to be tight again and this season will see teams below the top four or five having a bigger say in taking points off bigger teams to contribute towards winning or losing the title.\nAdvertisement\nWho’s going to be in trouble?\nChristiansen: I go on squad depths and ambition — a few teams will have moments this season. I’m concerned about West Ham United. They might find it tricky but they’ve got experienced coaches who could steer them upwards. Bristol City will have a tough time after winning promotion, but I know what the culture and ambition are like there. If they can string some results together, they’ll be OK. Leicester have a good platform to build on from last season — they’ll be all right.\nMorgan: Bristol City — it’s a tough ask to make the jump back into the WSL and the league has come a long way since they were last in it. They have made some good signings (including, Amalie Thestrup from PSV Eindhoven), but the calibre is different given the club’s limited budget.\nCox: It’s hard to look past Bristol City — the squad just doesn’t seem equipped for life in the WSL.\nHarpur: Bristol City — the gap between the WSL and Championship is growing and adapting quickly to the demands will be tough. Willie Kirk performed a rescue mission last year to save Leicester — they will be safe again.\nGO DEEPER\nWSL aiming to be world's first £1billion women's league\nWSL Golden Boot?\nMorgan: Hinata Miyazawa — we saw what she was capable of in the World Cup. Everything she touched turned to goals. Miyazawa picked up the Women’s World Cup Golden Boot (five goals and one assist) and that was despite her country only making it to the quarter-finals. I’m grateful we get to see more of her magic.\nCox: Bunny Shaw, who missed out on being top scorer by only two goals last season. I expect the other big clubs to share the goals around, but Shaw has the luxury of Manchester City almost solely geared around getting the ball into her in the box and she can score from every angle.\nMeulensteen: So many players could get it, but Shaw. She’s so influential in front of goal for City and a lot of the goals come through her. Chelsea’s Sam Kerr is up there, but Shaw will edge it.\nHarpur: Shaw — she is a clear target up top and an aerial threat who can score with both feet. A Golden Boot winner in the French league, I expect her to do the same in the WSL.\nChristiansen: Lauren James or Russo. Russo is the perfect fit for the Arsenal system — she will find herself at the end of a lot of moves. James’ ability on the ball is unrivalled. Regular playing time is essential for her to chase that trophy, but for a player with her quality, she can be in the mix.\nAdvertisement\nRising star?\nMeulensteen: Mary Fowler was an important player for Australia during the World Cup when Kerr wasn’t playing. Fowler stepped up when she needed to and she has the ability to do that for City. The 20-year-old links play well and City have good attacking options.\nMorgan: Kyra Cooney-Cross — the Australian midfielder was one of the standout stars of the World Cup. Her passing and ability to read play will light up the league and her move to Arsenal (following in the footsteps of fellow Aussies Steph Catley and Caitlin Foord) will only push her on.\nCox: I picked Cooney-Cross as my breakthrough player for the World Cup, so in the interests of variety, I’ll go for City’s Jess Park. Yes, she’s an established player with lots of WSL experience, but she improved a lot on loan at Everton last season and, at 21, she’ll demonstrate that she’s a more well-rounded player now.\nHarpur: Everton’s Karoline Olesen. An unknown name to the WSL, but the 18-year-old trained with the Denmark senior squad this year before the World Cup. Even if she does not shine this season, she will be one to watch for the future.\nChristiansen: I’m going to go a bit rogue with this one: Carrie Jones from Bristol City. From what I’ve seen, she is a quality player with huge potential. Under the fantastic international manager she has at Wales, Gemma Grainger, the 20-year-old has an exciting future.\nOne to watch?\nHarpur: Catarina Macario — she has been out with an anterior cruciate ligament injury, but when she comes back to full fitness, she will add more magic to Chelsea’s attack. She is versatile and I’m intrigued to see how Hayes will use her.\nGO DEEPER\nACL injuries in women's football: Why the high risk and can they be prevented?\nMorgan: New Aston Villa signing Daphne van Domselaar. The Netherlands international was one of several goalkeeping heroes at the World Cup. Her individual performance against the U.S. (ending their 13-game tournament unbeaten record) was perfect. At 23, she isn’t even close to hitting her peak and she will be integral to Carla Ward’s ambitions to push Villa into the top four.\nAdvertisement\nWhyatt: Really looking forward to seeing Geyse and Irene Guerrero at Manchester United — signings clearly brought in to help the club progress in the Champions League. Miyazawa looks like a player who can do it all and her movement will help compensate for the loss of Russo and Ona Batlle.\nChristiansen: If she plays regularly, Sjoeke Nusken at Chelsea will excite. The 22-year-old looks the business in midfield. Then there is Russo and Cloe Lacasse at Arsenal. I’m a big advocate of Cooney-Cross.\nMeulensteen: There’s a few! Macario is an exciting one for Chelsea following her success with Lyon. I’m really happy to see Jill Roord back in the WSL — she did really well at Wolfsburg and can bring that excitement back to Manchester City. That little bit of rivalry when City play her old club Arsenal (November 5) will be exciting. If Miyazawa can live up to what she did at the World Cup, she’ll also be a huge threat.\nCox: I like the look of Nusken, Chelsea’s energetic midfielder. She only played 45 minutes for Germany at the World Cup, but her no-nonsense attitude and tenacity make her a perfect fit for Hayes’ side.\nChampions League qualifiers for 2024-25?\nMorgan: Arsenal, Chelsea, Aston Villa.\nCox: Chelsea, Arsenal, Manchester City.\nWhyatt: Chelsea, Arsenal and… tough to call between the two Manchester clubs. It depends on which version of City turn up. I’m going for Manchester United.\nHarpur: Chelsea, Arsenal, Manchester City.\nChristiansen: Chelsea, Arsenal, Manchester United.\nGO DEEPER\nRusso gone. Batlle gone. Earps remains. So how strong are Manchester United?\nMeulensteen: Chelsea are nailed on, especially with the signings they’ve made. Arsenal have made some good signings — they are the two obvious ones. It’s a difficult call between United and City. United have lost some big players but made some good signings, so it’s whether they can click quickly. City might just edge it.\nAdvertisement\nOne thing you’d like to see happen this year and why?\nWhyatt: For crowds to bloom beyond main stadium matches and outside of the top four clubs. For a competitive league and to improve player well-being, we need all 12 clubs to be thriving. The Lionesses’ impact is only trickling down so far.\nCox: A new cup winner. Arsenal, Chelsea and Manchester City have won all 12 Conti Cups and the last 11 FA Cups between them. This is, clearly, boring and an outsider triumphing would be great.\nHarpur: No games to start and then be called off because of frozen pitches. It makes the league look tinpot.\nChristiansen: I really want to take women’s football to the next level. Working with Sky, together we can do that with the depth of analysis of the matches. There’s a lot of work going on within clubs, tactically and technically, that needs to be highlighted more in the media. I can give that insight and hopefully bring fans new information.\nHow will this season be different?\nWhyatt: I wonder if we’ll see increased player power after the events of the summer. Could we see some sort of protest or unified action over the ACL crisis, or players speaking up jointly on the schedule? It feels like we’re at a tipping point in terms of players’ tolerance towards things that were just accepted as ‘part of the game’.\nGO DEEPER\nBronze on England bonuses resolution: ‘We want to help other countries set the standard’\nChristiansen: It’s funny because I see preparing for a game now with my new role as being similar to preparing for a game as a player. You need to make sure you are fuelled up and ready to perform on air. The pressure — you’re on live TV — is the same as playing.\nMeulensteen: The other day I was at the barbers with my boyfriend and his barber said, “I heard you were doing the World Cup.” How often does that happen? You can tell that an everyday person is getting more and more into it. There’s more interest among the general public. It’s not just the hardcore women’s football fans watching it but the everyday football fan. The biggest difference is that people are seeing players everywhere and not just being told to go and watch. My heart is with the WSL — it’s a league I’ve followed from a young age.\nChristiansen and Meulensteen will be appearing regularly on Sky Sports’ Women’s Super League coverage this season. Sky will show 35 exclusive live WSL fixtures on Sky Sports and NOW TV, kicking off on October 1.\n(Top photos: Getty Images)",
  "word_count": 2023,
  "scraped_at": "2026-02-14T02:00:57.121348",
  "_text_extracted": true
}