{
  "article_id": "8f91c8613c95",
  "url": "https://www.aol.co.uk/saturday-briefing-isak-interests-liverpool-033002463.html",
  "title": "Saturday briefing : Isak interests Liverpool and Son set for Tottenham exit",
  "date": "20250802T040000Z",
  "domain": "aol.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Saturday briefing: Isak interests Liverpool and Son set for Tottenham exit\nAlexander Isak’s future was once again a red-hot topic as Liverpool reportedly upped their interest in the Newcastle striker on Friday.\nTottenham captain Son Heung-min announced his intention to leave the club, while Spurs are closing in on the loan signing of Joao Palhinha from Bayern Munich and Everton are pursuing a deal for Southampton teenager Tyler Dibling.\nIsak bid rejected\nNewcastle have rejected a bid from Liverpool for striker Alexander Isak, according to reports.\nThe 25-year-old Sweden striker has been training at his old club Real Sociedad this week amid reports he has asked Newcastle executives to explore a move away from the club.\nHe has been heavily linked with Liverpool, who are now reported to have made a bid for the player which Newcastle have knocked back. Isak still has three years left on his contract with Newcastle.\nNeither club has commented on the matter.\nSon Heung-min set for Tottenham farewell\nHeung-Min Son has announced his intention to leave the Club at a press conference alongside Thomas Frank in Seoul.\n— Tottenham Hotspur (@SpursOfficial) August 2, 2025\nTottenham captain Son Heung-min has revealed he will leave the club this summer.\nSon has spent the last decade at Spurs and achieved his goal of silverware in May when he helped them to Europa League success with a 1-0 victory over Manchester United.\nIt ended a 17-year trophy drought for the club and South Korea captain Son explained his decision to target a “fresh challenge” during a press conference in his home country ahead of Tottenham’s pre-season friendly with Newcastle on Sunday.\nAfter Spurs arrived in Seoul on Friday, Son – following a remarkable 454 appearances and 173 goals for the north London club – confirmed his desire to depart this summer, with MLS outfit Los Angeles FC leading the race for his signature, the PA news agency understands.\nSon told a press conference: “Before we start, I wanted to say I have decided to leave the club this summer.\n“Respectfully, the club is helping me with this decision.\n“It was the most difficult decision I have made in my career, such amazing memories. It was so hard to make this decision.”\nSpurs close in on Palhinha\nBayern Munich midfielder Joao Palhinha underwent a medical at Tottenham on Friday, the PA news agency understands.\nSpurs are eager to boost their squad for new boss Thomas Frank ahead of the club’s return to the Champions League this season and set their sights on the Portugal international.\nPalhinha only signed for Bayern last summer from Fulham in a deal worth up to £47.4million but endured a difficult debut campaign and made only six starts in Bundesliga, which has opened the door for a return to the Premier League.\nTalks between Tottenham and Bayern got under way on Thursday and PA understands an agreement was reached with Palhinha given the green light to undergo a medical ahead of the proposed move.\nLockyer nears football return\nFormer Luton captain Tom Lockyer has revealed he is “four weeks away” from being allowed to play football again.\nLockyer has not played since suffering a cardiac arrest during Luton’s Premier League game against Bournemouth at the Vitality Stadium in December 2023, while he collapsed on the field just seven months earlier during the Hatters’ Sky Bet Championship play-off final win at Wembley against Coventry.\nLockyer, speaking ahead of Luton’s opening Sky Bet League One fixture against AFC Wimbledon at Kenilworth Road, told Sky Sports: “I haven’t had a break, I’ve been working all the way through, just trying to get this ankle right and trying to get fit.\n“But I’ve had a really good few weeks and hopefully now I’m four weeks away from getting signed off and told I’m allowed to play football again.”\nSaints want more for Dibling\nEverton are looking to sign Tyler Dibling but are well below Southampton’s current valuation, the PA news agency understands.\nThe 19-year-old caught the eye during his breakthrough campaign, scoring four goals in 38 appearances in all competitions for the relegated side.\nA number of Premier League clubs have tracked Dibling’s progress and Everton have seen an initial approach in the region of £27million rejected by the Championship club.\nThe Toffees are reportedly ready to make another move for the England Under-21s international, but PA understands Saints want in excess of £40m for the academy graduate.\nWhat’s on today?\nAfter Luton edged out AFC Wimbledon on Friday night, Sky Bet League One gets in full swing with 10 fixtures while there is a full League Two programme.\nRangers get their Scottish Premiership campaign under way with a trip to Motherwell and Kilmarnock welcome Livingston.",
  "word_count": 787,
  "scraped_at": "2026-02-14T02:26:46.355568",
  "_text_extracted": true
}