{
  "article_id": "8f9d58c38256",
  "url": "https://www.thenationalnews.com/business/economy/2025/09/03/iraq-attracts-more-than-100bn-in-investments-in-bid-to-claw-back-regional-standing/",
  "title": "Iraq attracts more than $100bn in investments in bid to claw back regional standing",
  "date": "20250903T064500Z",
  "domain": "thenationalnews.com",
  "source_country": "",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Iraq is pitching itself as a rising investment hub in the turbulent region after years of instability and sluggish economic reforms, with more than $100 billion pledged for investment since early 2023.\nAbout $64 billion has come from foreign investors and $38.6 billion from domestic companies, Haider Makiya, chairman of the National Investment Commission, told The National.\n“Iraq is a fertile ground for investment projects,” Mr Makiya said. The government is planning to add a further $100 billion in investment projects in the next two years.\nDecades of war, UN-imposed economic sanctions, instability, corruption and mismanagement have derailed growth in Iraq, despite it being the second-largest oil producer in Opec. The country has a rapidly growing population, with under-25s accounting for at least half of its nearly 45 million people.\nIn 2006, Iraq endorsed for the first time its landmark investment law but progress was hindered by chronic political instability, civil war, weak infrastructure and cumbersome bureaucracy.\nThe unprecedented political and security stability in the country since late 2022, when the government of Mohammed Shia Al Sudani took over, has encouraged authorities to launch infrastructure projects and introduce reforms to improve the business environment.\nIraq is building sprawling residential complexes, hotels, shopping malls and new roads, upgrading airports and ports, modernising its agriculture, and strengthening trade ties with neighbours and the West.\nNIC has adopted several administrative reforms and eased bureaucracy, such as reducing the period for issuing visas to 24-48 hours from up to 10 days, Mr Makiya said. A set of amendments to the Investment Law that address different issues has been prepared and sent to parliament for approval. However, the issuance the investment licence still takes two to three months due to a lack of co-operation with other ministries, he added.\nLast year, in a significant milestone, Iraq signed the UN Convention on International Settlement Agreements Resulting from Mediation, known as Singapore Convention, to attract foreign investors.\nThe Convention eases the enforcement of mediated settlement agreements, paving the way for enhanced international trade and commerce between countries.\nIt aims to strengthen Iraq's legal framework for dispute resolution, making the country a more attractive destination for foreign investment by providing a predictable, efficient and amicable process for resolving international commercial disputes.\nAs Iraq joined that Convention, a “red light switched off and a green one switched on for the investors”, Mr Makiya said.\n“We hope that with 10 more years of stability in Iraq, the situation will look more promising,” he added. He expressed optimism that the country will emerge as a major investment hub in the region given its location, resources and vast needs.\nThe most sought-after projects investors are focusing on are in energy, industry, agriculture and housing, he said. “We are looking for projects that serve as the cornerstone for the infrastructure,” he said, adding that the country needs at least one trillion dollars of investment in infrastructure.\nOn housing projects, about 660,000 new units are either complete or under construction across Iraq, excluding the semi-autonomous Kurdistan Region in the north, he said. That is still far from the three million needed.\nIraq has also secured significant projects in energy with international companies in recent months.\nUK energy company BP signed a deal this year to develop several oilfields in Kirkuk with at least 7 billion barrels of reserves. It will spend more than $25 billion during the course of the project in Kirkuk to boost production to 420,000 barrels per day from the current 300,000 bpd, capture and treat 400 million cubic feet per day of associated gas, and build a power station and solar power plant.\nIn May, Iraq signed a multibillion, fully integrated energy project in the southern province of Basra, with a consortium that includes Chinese company Geo-Jade and Iraqi company Hilal Al Basra (Crescent Basra) that will combine upstream oil and gas production with downstream refining, petrochemicals and power generation.\nIn 2023, Iraq signed a deal worth $27 billion with French company TotalEnergies to develop oil and gas as well as renewable energy projects in the south. Several other deals have been signed with companies from the US, Europe and the Gulf.\nchairman of National Investment Commission\nSome of those leading Iraq's government have pushed for a major economic integration project known as the Development Road – a $17-billion project that will connect Iraq’s southern Gulf ports to Turkey. Iraq, Turkey, Qatar and the UAE have signed a preliminary agreement for joint co-operation on the project. As part of the initiative, a high-speed road and rail link, running from Iraq's port city of Basra on the Gulf to the Turkish border and later to Europe, will also be extended.\nThe New York-based Oliver Wyman is providing financial and economic advisory services and is preparing an economic study and model for the project, Mr Makiya said, adding that the final report is expected to be finalised in two to three months.\nThe initial plan is to implement the project in phases by dividing it into sectors, and economic and industrial areas will be established in different areas along the road, he said. The project will be managed by a new company or commission to be established by a separate law with more powers.\nTurkey, Qatar and the UAE are still “interested in this project and [we are] just waiting [for] the final report,” he said without giving more details.\nThe country is also eyeing an ambitious plan to establish advanced data centres in Iraq and extend optical cable to neighbouring countries to enhance Iraq's strategic geographic position as a regional connectivity hub, he added.\nThe National Investment Commission is also planning an international conference in Baghdad on September 27 and 28 in which it will offer more than 100 investment opportunities, he said. That event was initially scheduled for June but was called off when the Israel-Iran war broke out.\n“Investment in Iraq will definitely be impacted by any conflict in the region, and we hope Iraq stays out of it,” Mr Makiya said.",
  "word_count": 1003,
  "scraped_at": "2026-02-14T01:49:53.056539",
  "_text_extracted": true
}