{
  "article_id": "8fc36ded35f1",
  "url": "https://www.90min.com/arsenal-predicted-lineup-vs-ipswich-premier-league-20-4-25",
  "title": "Arsenal predicted lineup vs Ipswich - Premier League",
  "date": "20250419T170000Z",
  "domain": "90min.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Arsenal predicted lineup vs Ipswich - Premier League\n- Arsenal back in Premier League action on Sunday after securing place in Champions League semi-finals\n- Mikel Arteta to rotate heavily at Portman Road\n- Jorginho the latest to join injury list\nArsenal will soon discover that there really isn't all that much difference between the Santiago Bernabeu and Portman Road when they travel to Ipswich Town this weekend.\nThe Gunners have enjoyed the highest of highs in recent days off the back of their success in the Spanish capital, which saw them progress into the last four of the Champions League for the first time in 16 years.\nWith Premier League glory veering into a realm of impossibility, all of Mikel Arteta's eggs have been placed into the continental basket. As a result, heavy rotation from Wednesday night's starting XI is expected on Sunday.\nHere's how Arsenal could line up at Ipswich.\nArsenal predicted lineup vs Ipswich (4-3-3)\nGK: David Raya - Raya was surprisingly quiet in Madrid, and he'll be hopeful of another stress-free afternoon on Sunday as he aims to close the gap on Golden Glove leader Matz Sels to a single clean sheet.\nRB: Ben White - Jurrien Timber was brilliant against Los Blancos and deserving of some respite. White hasn't played all that much since returning from injury, but he'll keep his place in Arsenal's Premier League XI.\nCB: William Saliba - Arteta would love to preserve Saliba for PSG, but the Arsenal boss doesn't have any alternatives at his disposal.\nCB: Jakub Kiwior - Kiwior has garnered the faith of a previously sceptical fanbase as a result of the performances he's strung together in Gabriel's absence. The Polish defender will keep his place alongside Saliba.\nLB: Kieran Tierney - It turns out that Tierney's Arsenal career isn't dead just yet, and we can expect to see plenty more of the Scottish left-back during the Gunners' remaining Premier League games this season.\nCM: Thomas Partey - After stupidly getting himself suspended for the first leg of the Champions League semi-final, Partey will likely line up at the base of midfield again on Sunday with Jorginho nursing a rib injury.\nCM: Oleksandr Zinchenko - The Ukrainian was used in midfield against Brentford last week, and we should see him in the middle of the park again to offer Declan Rice respite.\nCM: Ethan Nwaneri - The bulk of Nwaneri's minutes down the stretch will come in this competition, and he's expected to replace captain Martin Odegaard in Sunday's starting XI.\nRW: Bukayo Saka - Arteta may think an hour of football will do Saka good this weekend after his fine showing on Wednesday. The winger hasn't missed a beat since returning from a hamstring tear.\nST: Leandro Trossard - Trossard has somewhat fallen out of favour as of late, with Gabriel Martinelli and Mikel Merino both impressive in Arteta's frontline. The Belgian will get an opportunity to impress from a fluid central position on Sunday.\nLW: Raheem Sterling - Arsenal almost certainly won't be buying Sterling permanently in the summer, so this will be one of his final few starts for the club.",
  "word_count": 526,
  "scraped_at": "2026-02-14T01:58:31.718161",
  "_text_extracted": true
}