{
  "article_id": "8fc4d55cc828",
  "url": "https://news.yahoo.com/manchester-united-surrender-sevilla-left-221707714.html",
  "title": "Manchester United surrender to Sevilla left manager Erik ten Hag  really mad  ",
  "date": "20230422T233000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Manchester United’s surrender to Sevilla left manager Erik ten Hag ‘really mad’\nErik ten Hag said his Manchester United side fell well short of his expectations in their limp Europa League exit to Sevilla.\nUnited were humbled 3-0 in Andalusia to crash out of the competition despite having held a two-goal lead in the final stages of the first leg before capitulating.\nSunday’s FA Cup semi-final against Brighton at Wembley offers a chance for immediate redemption for a team who have seen their hopes of landing a cup treble dashed following elimination in Europe.\nThe match against Roberto de Zerbi’s high-flying side comes off the back of inconsistent form as cracks have begun to show in the manager’s rebuilding job at the club, with defeat in Seville coming in the aftermath of a loss to fellow Champions League chasers Newcastle and a 7-0 thrashing at Liverpool.\nTen Hag was asked whether the famous hairdryer treatment meted out by his predecessor Sir Alex Ferguson was the kind of response he subjected his players to in the immediate aftermath of Seville.\n“Sometimes, yeah, I can go strong in certain situations,” he said. “It’s about timing, when to use it. As a coach, the communication style…you can pick many styles and this is one of them.\n“(On Thursday), I was really mad. For me it was so unacceptable. You can make a mistake, but you have to carry on.\n“If you play a quarter-final of the Europa League, you give everything. And we didn’t. For any team that is unacceptable. As a manager I can’t accept that my team is not giving its best.\nI was really mad. For me it was so unacceptable.\nErik ten Hag on Thursday's loss to Sevilla\n“Yes of course (the players were made aware). I made them aware of my analysis, my feelings about the game were, what my facts of the game were. They didn’t match the standards (to which) I manage a team in professional football.”\nUnited’s season – and the Dutchman’s reign at Old Trafford – began with a 2-1 home defeat to Brighton on the opening day of the Premier League season, the first of two humbling defeats in his first two games in charge.\nIt was followed by a 4-0 defeat away to Brentford, when United conceded all four goals inside the first 35 minutes.\nSince then, the manager has been hailed for nurturing the first shoots of recovery for the club after years spent limping from crisis to crisis in the seasons since Ferguson retired.\nTen Hag acknowledged the latest setback, and insisted that the key to sustained success lies in grinding out results even when the team are not in top form, which was a staple of the success the club enjoyed under its most celebrated manager.\nHe added: “I hope that everyone sees, the experts and fans, that we have made progress (from the Brighton game), that we have developed. We are a different team now.\nWe have to face that we have steps to go. It’s quite clear.\nErik ten Hag\n“We know and we have to face that we have steps to go. It’s quite clear. We spoke after Seville that it’s quite clear but also some other games.\n“None of the team will always play the highest level, I know. But if you don’t play at the highest level, you still have to win.\n“That is what we have to learn. How we deal with the setbacks in a game. We have to carry on, we have to stick to the plan, we have to stick to the game. You have to keep the confidence. So yeah, we have steps to go.”",
  "word_count": 616,
  "scraped_at": "2026-02-14T02:06:55.003075",
  "_text_extracted": true
}