{
  "article_id": "8fecee910ba2",
  "url": "https://menafn.com/1107321646/AFC-Annual-Awards-Doha-2022-To-Honour-Asias-Best",
  "title": "AFC Annual Awards Doha 2022 To Honour Asia Best",
  "date": "20231028T070000Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "AFC Annual Awards Doha 2022 To Honour Asia's Best\nDoha, Qatar: The cream of the crop in Asia are set to be feted in a star-studded ceremony at the Al Mayassa Theatre, nestled within the impressive Qatar National Convention Centre, on Tuesday evening.\nMaking its highly anticipated return to the Asian Football Confederation (AFC) calendar after four years, the AFC Annual Awards Doha 2022, to be presented by the AFC's Global Partner NEOM, will celebrate the momentous achievements of a groundbreaking year in Asian football.\nThese encompass the spectacular success of the biggest ever AFC Women's Asian Cup in India, alongside memorable campaigns in the AFC Champions League and various age-group competitions, while the Continent's national teams showcased their prowess with impressive displays at the FIFA World Cup Qatar 2022.\nThe gala event will culminate in the prestigious AFC Player of the Year accolades, where the trio of Mathew Leckie, Almoez Ali and Salem Al Dawsari have been nominated in the Men's category, while Samantha Kerr, Zhang Linyan and Saki Kumagai are the three front-runners for the Women's equivalent.\nRead Also- More AFC Asian Cup Qatar tickets soon AFC Annual Awards Doha 2022 nominees revealed\nA total of 18 accolades will be handed out on the evening, including the newly introduced AFC Regional Association of the Year award, and the revamped AFC Member Association of the Year award, and the AFC President's Recognition Award for Grassroots Football.\nA commemorative plaque will also be presented to the Supreme Committee for Delivery & Legacy of the FIFA World Cup Qatar 2022 at the ceremony, in acknowledgement of Qatar's world-class staging of the global football showpiece.\nQatar will host the AFC Annual Awards for the first time and the AFC President Shaikh Salman bin Ebrahim Al Khalifa said:“The AFC is delighted to be able to bring the Asian football family together in the stunning city of Doha and I would like to convey our heartfelt appreciation to the Qatar Football Association for their impeccable organisational capabilities and hospitality, to set the stage for what is certain to be a memorable occasion for all the nominees and guests.”\n“The AFC Annual Awards Doha 2022 has added significance, as we gather in solidarity for the first time in nearly four years. While the pandemic forced us to pause our celebrations, it did little to impact the resolve and commitment of the Asian football family in strengthening the beautiful game across all levels.\"\nThe categories to be announced at the AFC Annual Awards Doha 2022 and presented at another special event are, AFC Youth Player of the Year (Women), AFC Youth Player of the Year (Men), AFC Asian International Player of the Year and AFC Referees' Special Awards.\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 508,
  "scraped_at": "2026-02-14T02:10:28.699112",
  "_text_extracted": true
}