{
  "article_id": "8ff4e1bd9bd5",
  "url": "https://metro.co.uk/2026/01/24/bruno-guimaraes-injury-latest-ahead-newcastle-united-vs-aston-villa-26485133/",
  "title": "Bruno Guimaraes injury latest ahead of Newcastle United vs Aston Villa",
  "date": "20260124T114500Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Bruno Guimaraes remains in contention to play in Newcastle United’s Premier League match against Aston Villa on Sunday.\nThe midfielder suffered an ankle injury in the first half of Newcastle’s 3-0 win against PSV in the Champions League on Tuesday evening.\nBruno’s right ankle looked severely swollen in a photo of Newcastle’s players celebrating in the dressing room after the win, raising doubts over the midfielder’s availability for the game against Villa at St James’ Park.\nBut speaking during his press conference on Friday, Eddie Howe revealed that Bruno has not been ruled out against Villa.\n‘With Bruno we hope it is not serious, the extent of the injury is still unknown,’ Howe said.\n‘But he was reasonably positive after the game, speaking to him again, he is the guy that will never rule anything out, we are going to give him every chance for this weekend, so let’s wait and see.’\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHowe added: ‘We will try and make the right decision with Bruno, he is a pivotal player.\n‘We will always try to make the right decision. To protect the long-term.\n‘We will try to do that, Bruno. He is a match-winner and an inspiration, so we need him.\n‘We will make all the calculations and come to the right decision.’\nNewcastle’s poor record without Bruno\nNewcastle have failed to register a win in 10 Premier League matches without Bruno since the Brazil international joined the club in a £40 million deal from Lyon in 2022.\nThe only match Newcastle have won without Bruno in the starting line-up is the Carabao Cup semi-final first leg against Arsenal in January last year.\nMore Trending\n‘I wondered how long it would be before that one came up,’ Howe said.\n‘In terms of working out how to play without him, I think he is just a very, very good player. A very, very talented footballer. A very creative footballer.\n‘Regardless of where he plays, he has the ability to change games. Of course, if we’re without him in any game, you have to come up with a solution.\n‘You have to come up with an alternative way of either selecting your team or a way of playing. We’re trying to figure out all avenues if he isn’t available but we hope he can make it.’\nFor more stories like this, check our sport page.\nFollow Metro Sport for the latest news on Facebook, Twitter and Instagram.\nMORE: Mikel Arteta reveals why Arsenal did not sign Benjamin Sesko ahead of Viktor Gyokeres\nMORE: Paul Scholes makes bold Premier League title prediction ahead of Arsenal vs Man Utd\nMORE: Chelsea set out key condition for Douglas Luiz loan deal as player’s stance revealed",
  "word_count": 503,
  "scraped_at": "2026-02-14T01:53:15.583430",
  "_text_extracted": true
}