{
  "article_id": "901b92eca652",
  "url": "http://www.bignewsnetwork.com/news/278258656/wtc-final-2025-south-africa-batter-aiden-markram-aims-to-end-sa-icc-trophy-drought",
  "title": "WTC Final 2025 : South Africa batter Aiden Markram aims to end SA ICC trophy drought",
  "date": "20250605T094500Z",
  "domain": "bignewsnetwork.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "WTC Final 2025: South Africa batter Aiden Markram aims to end SA ICC trophy drought\nNew Delhi [India] June 5 (ANI): In their quest to finally break South Africa's ICC trophy drought, South Africa batter Aiden Markram hopes a run for underdogs continues in the World Test Championship (WTC) final against Australia, according to the ICC website.\nMarkram hopes a run of sporting trophy droughts broken in 2025 rings true at the World Test Championship 2025 Final, with the Proteas taking on defending champions Australia from June 11.\nIn the cricket world, Royal Challengers Bengaluru finally tasted men's IPL success, beating Punjab Kings in the tournament final, while in football, Paris Saint Germain lifted the UEFA Champions League earlier this month for the first time.\nWhile Markram acknowledged it hasn't been a storyline taken on by the Proteas looking to finally break their duck, the right-hander hopes it may just be an omen for his team.\n'(There's) not much chat along those lines in terms of watching the other events, but hopefully that trend can continue,' Markram told ICC Digital ahead of the Final. Obviously, we've been chasing it now for many years as a squad,' Aiden Markram said.\n'Across all formats, we've probably improved slightly throughout and had sniffs to win it. If we can get ourselves into a position over the five days of the Test match to win, we'll push really hard for that.'\nSouth Africa has been in the mix across formats at ICC events in recent years. Last year, it reached the ICC Men's T20 World Cup Final but fell at the final hurdle to India.\nThe side also reached the semi-final stage at both the 2023 Cricket World Cup and 2025 Champions Trophy, and came into the Lord's final having topped the table.\nMarkram gives insight into South Africa's mindset by saying each player has received clear instructions in pursuing the mace.\n'I think it's the collective decision for each guy to bring their best skill. It's going to be a tough game.'\n'It's a Test match, of course, against Australia and a Dukes ball, Lord's, all those sorts of things, but ultimately, the guys have a skillset that have got them here, got them selected, throughout the cycle performed as well, doing those skills,' he added.\n'So it's about backing that, our best skill versus their (Australia's) best skill, and we'll see where it lands us at the end of the day.'\nAustralia stands as an imposing opponent. They are the defending champions and sealed their Final spot after a series win over giants India on home soil.\nThe Proteas fell 2-0 to the Aussies on tour in the 2021-2023 cycle, though Markram believes there is little he and his side haven't seen from their opponents.\n'We pretty much know what the Australians are all about and their skill levels, their characters and all those sorts of things,' Markram said.\n'It's always a challenge that we get really excited for, and we generally get up for it and look forward to it. I've got no doubt this time it'll be any different.'\nIn their quest for victory, the Proteas have set up in Arundel, taking on Zimbabwe in a warm-up match, before travelling to Lord's to join England fast bowling legend Stuart Broad, who comes in as a consultant for the team's fast bowling battery.\nMarkram says vibes in the camp are positive ahead of the Final.\n'The energies have been good, obviously lots of excitement in the air for the time being. (I'm) sure when we get a bit closer to the game or a few nerves will start kicking in,' Markram said. (ANI)",
  "word_count": 612,
  "scraped_at": "2026-02-14T02:09:11.431980",
  "_text_extracted": true
}