{
  "article_id": "90239c997c94",
  "url": "https://menafn.com/1108404745/Euro-2024-Germanys-Kroos-Dreams-Of-Title-In-His-Final-Event-As-A-Player",
  "title": "Euro 2024 : Germany Kroos Dreams Of Title In His Final Event As A Player",
  "date": "20240703T194500Z",
  "domain": "menafn.com",
  "source_country": "Qatar",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Euro 2024: Germany's Kroos Dreams Of Title In His Final Event As A Player\nLast updated: Wed 3 Jul 2024, 5:05 PM\nRetiring Germany midfielder Toni Kroos is not feeling nostalgic ahead of their Euro 2024 quarterfinal against Spain that would be his last match as a player if they lose.\nKroos, who won the Champions League with Real Madrid last month and will hang up his boots after the Euros, came out of international retirement this year to chase the one major trophy missing from a vast haul that also includes the 2014 World Cup.\n\"It is the second most important title you can win and it would have a huge importance for me,\" the 34-year-old said on Wednesday. \"If I did not see having the chance to do it with the team I would not have done it (come back).\n\"It would be a sensational end but I have also considered the possibility of it not happening. I am not nostalgic at all and did not bring any treats for you (journalists) either,\" he told a press conference when asked about a possible defeat on Friday spelling the end of his playing career.\n\"I do not expect tomorrow to be my last game so I assume we will see each other again.\"\nGermany are eyeing their first major title in 10 years after a string of poor tournament displays in recent years, including consecutive World Cup first round exits in 2018 and 2022.\n\"There were big doubts about the tournament before it started. That's normal after the previous tournaments we had. So we've now reached a minimal goal and whatever the result we won't be speaking about a tournament catastrophe here,\" said Kroos.\nHe added the team wanted to make the last eight to avoid another early exit and embarrassment, especially on home soil.\n\"But anything that comes now is not a bonus. We, as a team, have the goal to win the tournament. So it is not a bonus but we are at a stage in the tournament we wanted to reach.\n\"We should be satisfied but the demand within the team is to progress further and we are convinced we can do it.\"\nGermany have not managed to beat Spain at a tournament since the 1988 Euros and Spain's Joselu, a teammate of Kroos at Real Madrid, said he wanted to send the midfielder into retirement.\n\"Because we will win? Is that a good enough answer,\" he said when asked why Joselu's wish may not materialise.\n\"We have a lot to offer against it and we have good chances. The Spaniards play good football, we have to give them that, and so do we,\" Kroos said.\n\"You can expect a relatively interesting game. It will not be boring, that's my own feeling. I will do everything so his (Joselu's) wish is not fulfilled.\"\nALSO READ:\n-\nEuro 2024: Dutch emerge from introspection with spring in their step\n-\nDemiral brace powers Turkey past Austria into Euro 2024 quarterfinal\n-\nDorival urges Brazil to stick to the process after reaching Copa quarters\nLegal Disclaimer:\nMENAFN provides the\ninformation “as is” without warranty of any kind. We do not accept\nany responsibility or liability for the accuracy, content, images,\nvideos, licenses, completeness, legality, or reliability of the information\ncontained in this article. If you have any complaints or copyright\nissues related to this article, kindly contact the provider above.",
  "word_count": 571,
  "scraped_at": "2026-02-14T02:25:54.617263",
  "_text_extracted": true
}