{
  "article_id": "9027a896a54a",
  "url": "https://www.irishnews.com/opinion/brendan-crossan-spain-and-barcelona-great-andres-iniesta-was-truly-one-of-a-kind-2KKLIQT2PZHULBMQLJTELKSZWQ/",
  "title": "Brendan Crossan : Spain and Barcelona great Andres Iniesta was truly one of a kind",
  "date": "20241011T013000Z",
  "domain": "irishnews.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "“I don’t know how to explain it. I don’t know how to do it justice. Everything around me froze for a few seconds. I heard the silence. That sounds like a contradiction, but I can’t think of a better way of describing it: an audible silence.” – Andres Iniesta describing his winning goal in the 2010 World Cup final against Holland\nAFTER 116 fractious minutes in Soccer City Johannesburg on July 11, 2010, justice was finally served.\nHolland’s muscular approach, bordering on the vicious, succumbed to the Spanish artists in the World Cup final.\nWhen Cesc Fabregas popped the ball into Andres Iniesta’s path inside the Dutch penalty area, it sat up invitingly for the Barcelona player.\nAnd with the sound of silence all around him, Iniesta executed the perfect volley that saw the ball fly past Maarten Stekelenburg and into Holland’s net.\nIniesta wheeled away towards the corner flag and removed his dark navy jersey to reveal a white sleeveless t-shirt with the words ‘Dani Jarque – siempre com nosotros’ – translated always with us.\nJarque and Iniesta played together for Spain’s youth teams and were close friends.\nDuring an Espanyol training camp in August 2009, Jarque collapsed and died.\nThe devastating loss of his friend and a troublesome thigh muscle injury threatened to derail his World Cup dream in South Africa.\n“My heart and morale were on the floor,” he said.\nIt was the same injury that threatened his participation in the 2009 Champions League final against Manchester United in Rome.\nMedics told Iniesta not to shoot during the game for fear of making the muscle injury worse.\nIniesta glided through the final and was the best player on the pitch against United.\nAnd who can forget his stunning stoppage-time goal at Stamford Bridge that dumped Chelsea out at the semi-final stages that same season.\nIniesta was always a player of big moments.\nThree years earlier, Frank Rijkaard had opted to start Marc van Bommel in Barca’s midfield instead of the more artful Iniesta in the Champions League final against Arsenal.\nAt half-time and with Barcelona trailing 1-0, Iniesta was introduced and shifted the game in his team’s favour by dictating new terms in midfield and setting up the equaliser.\nThe first time I watched Iniesta in the flesh was in the mid-Noughties in a Spanish La Liga game at Camp Nou.\nOur seats were in the lower deck where we had a worm’s eye view of Iniesta’s dancing feet in the first half.\nNo-one moved quite like Iniesta, who announced his retirement from football on Tuesday at the age of 40.\nHe’d shift the ball seamlessly from his right foot to his left and find a way around an opponent in the tightest of spaces.\nIniesta was smooth as silk.\nWhile the Barcelona supporters - Cules – around us were lamenting Yaya Toure’s heavy first touch on occasion, as he’d only joined the club, they drooled over Iniesta’s every swivel of his hips and touch.\nGiovanni Trapattoni’s Republic of Ireland side never stood a chance in the group stages of Euro 2012 in Gdansk.\nBy that stage, Spain had become European and World Champions – and would go on to successfully defend their Euro crown in Poland and Ukraine.\nFrom high up in the Gdansk stadium, the Spanish played football from another world.\nIt remains the best ‘live’ performance I’ve seen. Spain were better than the Euro 2008 version of themselves and a significant improvement on the class of 2010.\nThe Spanish midfield of Sergio Busquets, Xavi Hernandez, Xabi Alonso and Iniesta were awesome on the night.\nThey moved the ball, short and long, rotated continuously and played like they were floating a metre above the pristine grass.\nIreland’s midfielders Keith Andrews and Glenn Whelan were dizzy trying to track the blood red jerseys, never laying a stud on them the entire night, which finished 4-0 in Spain’s favour.\nIniesta delivered another masterclass and man-of-the-match display.\nWhen Jose Mourinho was building powerhouse football teams in the ‘Noughties’ – another counter-revolution was taking place in Barcelona under Pep Guardiola.\nLa Masia – the Catalan club’s famous youth academy – had helped produce Iniesta, Xavi, Busquets and Messi around the same time.\nThere have been some compelling claims from different eras to being hailed the best-ever midfield.\nBrazil’s class of ‘82 of Cerezo, Socrates, Falcao and Zico will always stand the test of time, while the French triumvirate of Michel Platini, Jean Tigana and Alain Giresse was pure class.\nBut for balance and one-touch play, Busquets, Xavi and Iniesta were as good as anything the game has ever seen.\nIt’s impossible to put one of those Barca midfielders above the other because each of them were elemental in creating arguably the greatest-ever team.\nBusquets was the team’s brilliant defensive pivot who was so assured and reliable in possession that allowed Iniesta and Xavi to play further forward in old-fashioned inside left and inside right positions in a midfield three.\nEach of them was a midfield controller in their own way. It was virtually impossible to get the ball off Xavi.\nWatching Sami Khedira trying to keep up with Xavi in the 2010 World Cup semi-final meeting between Spain and Germany remains one of the finest midfield masterclasses in keeping and progressing the ball.\nIniesta could do what Xavi could do - only more. Iniesta was the dribbler among the trio - the schemer who could test an opponent’s mettle by running directly at them.\nWatching the kid from Albacete play football - the 12-year-old who cried himself to sleep most nights when he moved to Barcelona’s La Masia - was joy itself.\nHe viewed the game from a different, more cerebral place.\nThey don’t make players like him any more - players who would come up with their own solutions on a pitch, blissfully free of homogenous coaching templates.\nIniesta was truly one of a kind.\nAs Lionel Messi said upon hearing the news of his former team-mate’s retirement - ‘the ball will miss you’.",
  "word_count": 1006,
  "scraped_at": "2026-02-14T01:51:57.649174",
  "_text_extracted": true
}