{
  "article_id": "9064553c73e0",
  "url": "https://theathletic.com/live-blogs/premier-league-news-updates-live-latest/fhDid13RHrf8/hJBVCbZbMBDx/",
  "title": "Arsenal stronger after  learning  from last season - Odegaard",
  "date": "20240311T234500Z",
  "domain": "theathletic.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Football news live: Champions League reaction, Premier League latest and more\nToday's top stories\n- Dortmund and Atletico through to Champions League quarter-finals\n- Ben White signs new Arsenal contract\n- Chelsea to hire Brentford’s Bernardo Cueva as set-piece coach\n- Arteta accused of ‘disrespecting’ Porto coach Conceicao’s family\n- Sarri resigns as Lazio head coach\n- Edwards becomes CEO of football at Liverpool owner FSG\nArsenal stronger after 'learning' from last season - Odegaard\nArsenal captain Martin Odegaard believes last season's disappointing conclusion has stood the side in good stead this year.\nArsenal beat Leeds United 4-1 on April 1 last season to move eight points clear of Manchester City at the top of the Premier League, although second-placed City had played one game fewer.\nHowever, Mikel Arteta’s side — having won seven successive Premier League matches — won just two of their next eight in the competition, with City being crowned league champions with several games to spare.\nArsenal are once again top of the Premier League, while they face Porto in the second leg of their Champions League round of 16 tie on Tuesday, having lost the first leg 1-0 in Portugal last month.\n“First of all, we’re a better team,\" Odegaard told reporters on Monday. \"We’ve made good signings but also the experience of what we learned last season, we’ve been using that in a good way. The bond we have and the spirit in the team is unbelievable.\n\"It’s the best I’ve seen in my life being in teams. We have something special for sure and you can see that more and more on the pitch now as well. How we understand each other, how we move in relation to each other.”\nAsked on how he stayed calm in being a young captain of a team in the Champions League knockout stages and competing for a league title, Odegaard responded: “Its not something I think too much about. When I play football I get in my zone and its something I do in a natural way. I love playing football, love playing this game. we are all so excited to play another big game at home. That’s the main feeling, excitement and doing what we always do and play our game and focus on ourselves. I’m sure it will be a good night.”\nRonaldo's Al Nassr out of Asian Champions League after penalty shootout defeat\nAl Nassr were eliminated from the Asian Champions League at the quarter-final stage by Al Ain of the UAE.\nThe Saudi Arabian club lost the penalty shootout at the end of the two-legged clash, having won 4-3 on the night at Al Awwal Park after losing the first leg 1-0 last week.\nAlex Telles, Marcelo Brozovic and Otavio all failed to convert their penalties in the shootout, with Cristiano Ronaldo the only player of Al Nassr’s four penalty takers to score as they lost 3-1.\nRead the full story below.\nManchester United sale meeting with Sheikh Jassim: 'They put serious bids on the table'\nJoe Ravitch, co-founder and partner at Raine Group, has described his meeting with Sheikh Jassim Bin Hamad Al Thani regarding the Qatari’s bid to buy Manchester United.\nRaine were tasked with acting as United’s financial advisor during the takeover process, which concluded in February with Sir Jim Ratcliffe and INEOS securing their purchase of a minority stake.\nUnited confirmed in December that a deal had been agreed for Ratcliffe to take a 25 per cent stake in the club, with the Glazer family diluting their shares, rather than leaving altogether. Ratcliffe’s petrochemicals company INEOS is buying an even split of Class B + Class A shares at $33 (£26) each for an overall cost of $1.3bn.\nRead the full story below...\nManchester United to play Real Betis in San Diego pre-season friendly\nManchester United will play Real Betis in a San Diego friendly on July 31.\nThe game will be staged at the 35,000-capacity Snapdragon stadium where United’s Under-21 side lost against Wrexham last July. United were based in San Diego for much of their US tour in 2023, with Erik ten Hag’s training sessions held at the University of San Diego.\nThis year, the team will be based in Los Angeles and will play Arsenal in the 70,000 capacity SOFI stadium on July 27.\nPL fails to agree funding package for EFL clubs\nPremier League clubs have again failed to agree on a new funding package for the English Football League (EFL), with club bosses too divided on the matter to even put it to a vote at an emergency meeting on Monday.\nThe league’s voting rules require a two-thirds majority for important decisions, which usually means 14 of the 20 clubs must be on board but can be fewer if there are abstentions.\nBut despite months of talks and significant pressure from the UK government, the clubs remain hopelessly split on how generous the so-called “New Deal for Football” should be, the conditions that should be attached to it and how it should be funded.\nRead our full story below.\nWhitecaps sign midfielder Priso from Rapids\nThe Vancouver Whitecaps has acquired midfielder Ralph Priso from the Colorado Rapids, sources briefed on the talks tell The Athletic.\nColorado receives a first and third round draft picks, plus up to $150,000 general allocation money pending performance based add-ons. Colorado also will keep a sell-on percentage in Priso.\nPriso, 21, appeared in 26 regular season games for the Rapids last season, 11 of which were starts. He has yet to appear in a match this season.\nThe Canadian midfielder was originally acquired from Toronto FC in a trade in 2022 that saw Mark-Anthony Kaye go to TFC. Priso has made 69 appearances between Colorado and Toronto.\nPriso will challenge for minutes in Vancouver’s midfield depth chart, anchored by Andres Cubas, Ali Ahmed and more.\nThe Rapids have a glut of central midfielders. The deal allows Priso a better chance of playing time as well as opening opportunities for other rising talent at the club, including No 2 overall SuperDraft pick Wayne Frederick this winter. Frederick had passed Priso on the depth chart, sources say.\nArteta excited by Arsenal fans role ahead of Porto tie\nMikel Arteta says that the Emirates atmosphere makes him want to put his boots on again as he urged the Arsenal support to inspire his team to a Champions League comeback against Porto.\nArsenal go into Tuesday’s last 16 second-leg trailing 1-0 from the first-leg in Portugal. They were roared on to a late winner against Brentford to go top of the league on Saturday and Arteta has stressed that the fans have a crucial role to play in helping the team to its first Champions League quarter-final in 14 years.\n“That’s the opportunity we have In front of our people, in our stadium for 96 minutes,” he said. “Bring your energy, bring your noise and let’s do it together. I think the impact that they can make tomorrow is incredible. I don’t think they realise. We need that noise, we need them playing every ball with us and we need that emotional control as well to understand that the game will go through certain phases and we have to be really intelligent to get what we want.\n“It’s a beautiful opportunity to live one of those nights. It’s been 14 years so everything that we put in there is going to be worth it.”\nArteta was part of a team who repeatedly fell at the last 16 hurdle and has repeatedly spoken about how transforming the belief in the stadium was a priority. He praised the “connection” between the team and the fans after their 3-1 win over Liverpool in February.\n“It makes me want to go there and play,” said Arteta. “It’s the feeling that we have that it’s a joy to be part of this club and to be part of these games. Tomorrow is going to be a great night. I have a few (favourite atmospheres). The one we played here with Barca, with Bayern Munich as well was an amazing night. As well when we had to do a comeback against AC Milan.\n“The first derby that I played with PSG and Marseille I couldn’t believe the atmosphere. I played the Old Firm in Scotland and I was shocked. It can play a huge part and give you a great atmosphere and belief. I’m sure tomorrow will be like that.”\nMan City keeper Ederson out for up to a month with thigh injury\nManchester City goalkeeper Ederson will miss three to four weeks with a thigh injury picked up against Liverpool on Sunday and is a doubt for the match against Arsenal at the end of March.\nThe Brazilian suffered the injury when he came out of his goal and collided with Liverpool forward Darwin Nunez in the 1-1 draw at Anfield on Sunday, giving away a penalty and receiving a yellow card.\nEderson, who could not stop Alexis Mac Allister from scoring the resulting penalty to level the scores, was later replaced by Stefan Ortega.\nAfter the match, City manager Pep Guardiola told beIN Sports “It doesn’t look good” when asked about the injury and it has now been confirmed the 30-year-old will miss up to a month.\nFull story below\nRodrygo is in a Real Madrid dry spell – but those close to him aren’t worried\nWith just over 15 minutes left, Real Madrid’s 1-0 lead over Celta Vigo was looking slender and Carlo Ancelotti decided to act: Rodrygo was coming off.\nThe Brazilian wasted no time once he saw Joselu ready to take his place, running off without any sign of frustration. On his way to the bench though, he couldn’t help but lower his head just a little while while meeting the applause from the Santiago Bernabeu stands.\nAfter drawing three of their past four matches in all competitions, Madrid returned to winning ways with a 4-0 La Liga victory on Sunday evening, but once again Rodrygo went without a goal.\nFull story below\nMan City's Walker praises referee Oliver’s ‘character’ after Liverpool penalty decision\nManchester City captain Kyle Walker has praised referee Michael Oliver for his decision to not award Liverpool a penalty during the 1-1 draw between the two sides at Anfield on Sunday.\nLate into second-half added time, City winger Jeremy Doku collided with Liverpool’s Alexis Mac Allister in the penalty area.\nDoku appeared to connect with the ball but followed through into the chest of Mac Allister. Oliver chose not to award a spot kick, a decision that was confirmed by a video assistant referee (VAR) check.\nJurgen Klopp called Doku’s challenge “100 per cent a foul” but Walker believes Oliver’s call showed his experience and “character”.\nFull story below\nA forgotten man in England, Lingard is box office in South Korea\nThey called it ‘The Lingard Zone’.\nIt was an area set up just outside FC Seoul’s stadium to deal with the extraordinary hype and excitement around the home debut of the biggest signing in the K-League’s 41-year history.\nA forgotten man back home in England, Jesse Lingard is box-office material in South Korea, where the astonishing level of interest surrounding him prompted his new club to open a temporary ‘shop’ on Sunday: the only thing you could buy was the FC Seoul No 10 shirt.\nQueues started forming four hours before kick-off against Incheon and were soon stretching for as far as the eye could see (Lingard’s representatives clearly knew what they were doing when they negotiated a commercial deal that included a percentage of shirt sales).\nLingard has become a star in South Korea. Read all about it below\nWhy Premier League postponements leave Arsenal, Liverpool and Man City on course for chaotic final week\nThere is no mid-season World Cup to worry about and no delays caused by a pandemic, but the same scheduling issues of recent years are once again causing headaches in the Premier League.\nBy the time the international break starts on March 18, the ‘games played’ column in the Premier League table will be far from uniform. Seven teams will have played 29 games, 12 will have played 28 and Chelsea will have played just 27 matches.\nIt leaves those in charge of scheduling at the Premier League with the unenviable task of squeezing the remaining games into a seven-week window before the final round of games on Sunday, May 19.\nRead our explainer in full below\nUEFA opens disciplinary proceedings after alleged homophobic sign at Roma vs Brighton\nUEFA’s disciplinary body has opened proceedings after a homophobic sign was allegedly held towards Brighton supporters by a fan in the Roma crowd during Thursday’s Europa League tie.\nThe Athletic reported on Saturday Brighton had asked UEFA to investigate the incident, with the club providing photographic evidence, seen by The Athletic, of a spectator in the home section at the Stadio Olimpico holding up the alleged sign.\nThe sign was one of three incidents Brighton asked European football’s governing body to investigate after the 4-0 defeat in the first leg of their last-16 tie.\nUEFA's disciplinary body has since opened proceedings following Thursday's game in relation to a provocative message of an offensive and political nature, blocking of public passageways, lighting of fireworks and throwing of objects.\nFull story below\nMan City walked through a storm at Anfield, one where others would have crumbled\n“Sooner or later with this stadium, you have 15 or 20 minutes and it looks like a tsunami, coming for everybody who has the ball,” Pep Guardiola said after Manchester City’s 1-1 draw with Liverpool at Anfield.\nImagine conceding a throw-in near the halfway line after about eight minutes and having the crowd, especially the thousands of people now shouting in your face, stand up and rally like it is a last-minute corner in the biggest game of the season.\nIn fact, imagine trying to see out two last-minute corners in the biggest game of the season (so far).\nThis is what it means to play at Anfield when Liverpool are fighting you for the title and, if City can hope for one thing from future title races, it will be that things might not be quite so intense in the post-Jurgen Klopp era.\nSam Lee on City's showing at Anfield ...\nLiverpool’s ‘exceptional’ display against Man City should fuel belief this team can go the distance\nLiverpool captain Virgil van Dijk succinctly described the feeling as “bittersweet”.\nYou could sense it around Anfield as the dust settled on a frenetic, fabulous contest with Manchester City, even if it was a tale of what might have been for Jurgen Klopp’s depleted side.\nIf only Luis Diaz had kept his nerve when put through on goal by substitute Mohamed Salah, Liverpool’s second-half onslaught would have resulted in them landing a sizeable blow in the Premier League title race.\nIf only VAR Stuart Attwell had urged referee Michael Oliver to take another look on the pitch-side monitor when Jeremy Doku’s high boot caught Alexis Mac Allister deep into stoppage time, they could have secured a dramatic late victory from the penalty spot.\nThere was frustration — with a dose of anger at the perceived injustice thrown in — but what shone through more than anything was pride as Van Dijk and his team-mates accepted the acclaim of the home fans.\nCan Liverpool do it? James Pearce thinks so\nLiverpool vs Man City: This is what a Premier League classic looks like\nJurgen Klopp summed it up perfectly: “What a game, what an atmosphere, what an afternoon.”\nEven his wife enjoyed it. “She was completely buzzing,” the Liverpool manager said — and just about everyone inside Anfield must have felt the same.\nIt ended with the points shared: Liverpool 1-1 Manchester City. In that respect, perhaps the biggest beneficiaries were Arsenal, who remain top of the Premier League with 10 games left, ahead of Liverpool on goal difference.\nBut it was one of those afternoons when it feels legitimate rather than trite to suggest football was the winner — another epic battle between these two teams who, in terms of speed and imagination, can give you the feeling you are watching 4D chess.\nLiverpool v City was one for the ages. Oli Kay details yesterday's spectacle below\nThe Briefing: Best title race ever? Klopp v Guardiola – a remarkable rivalry\nWelcome to The Briefing, where every Monday during this season The Athletic will discuss three of the biggest questions to arise from the weekend’s football.\nThis was the weekend when Arsenal dug Aaron Ramsdale out of a hole after his mistake, the bottom three all collected points, Manchester United managed a win with two penalties and Danny Ings reminded the world who he is with a late equaliser for West Ham.\nHere we will ask if this three-way title race is the best one the Premier League has ever seen, whether the Klopp-Guardiola rivalry loses anything because the two men are fairly friendly with each other, and if Tottenham are now favourites to complete the final top four.\nNick Miller explains all below\nXavi: 'Montjuic has to look like Camp Nou' for crucial Napoli game\nXavi has urged Barcelona fans to make the Estadi Olimpic Lluis Companys a “pressure cooker” ahead of tomorrow’s Champions League last-16 second leg against Napoli.\nThe teams drew 1-1 in last month’s first leg in Naples, with everything to play for tomorrow.\nBut with Barcelona playing away from their famed Camp Nou stadium this season as it is renovated, the crucial second leg will be played at the stadium on the Montjuic hill.\n“I like a lot of things about Napoli, they have a high level of individuality,” Xavi said. “They play very well from the back, they play similar to us.\n“Montjuic has to look like Camp Nou. The Cules have to come and cheer and make it a pressure cooker. They have to be our 12th man and the players have to feel the support.”\nThe rise of Alejandro Garnacho\n\"He is a showman. He has a desire to entertain. The bigger the game, the bigger the crowd, the better he was.\"\nThe inside story of how Alejandro Garnacho ended up at Manchester United and what happened to him once he did — by Andy Mitten.",
  "word_count": 3061,
  "scraped_at": "2026-02-14T02:17:27.960269",
  "_text_extracted": true
}