{
  "article_id": "908a51826e12",
  "url": "https://www.caughtoffside.com/2024/10/28/arne-slot-liverpool-darwin-nunez/",
  "title": "Liverpool manager Arne Slot was surprised with Darwin Nunez vs Arsenal",
  "date": "20241028T104500Z",
  "domain": "caughtoffside.com",
  "source_country": "Spain",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Liverpool manager Arne Slot praised Darwin Nunez’s fitness levels against Arsenal in their 2-2 draw at the Emirates Stadium.\nThe Dutch manager would be happier of the two manager with the result against the Gunners.\nSlot’s team came back twice against Arsenal to come away with a point from the Emirates Stadium with goals from Virgil Van Dijk and Mohamed Salah, two of the Liverpool stars who are in the final year of their contract at the club and face an uncertain future.\nArsenal had taken the lead through Bukayo Saka but the Reds replied with a set-piece goal through Van Dijk.\nNew signing Mikel Merino gave Mikel Arteta’s side the lead once again but in the 81st minute, Nunez ran behind the Arsenal defense after a clever pass from Trent Alexander-Arnold and put it on a plate for Salah to finish the chance and make it 2-2.\nSlot was surprised with Nunez after the match and while speaking to Liverpool World, the Dutch manager said:\n“The last thing is also the reason I [kept] him on, because if you just keep on going and I see you’re fit enough to keep competing. Also, after speaking about Ibou [Konate] that is almost what also surprised me [because] Darwin hasn’t played that much yet. To then play three games in a row with the difficult fixtures we had, an away game in Europe and then to be so fit in the end of the game… I took Curtis [Jones] out against Leipzig because that was what I was a bit afraid of: is he ready to play two in a row?\n“But with Darwin, in my opinion, I have no choice because he is the only available striker at the moment. To see how hard he worked was really pleasing. Yes, he had to play deep in the first half but that had not so much to do with the game plan, but with the quality of Arsenal in the first half because they dominated us, without creating that many chances. They also needed set-pieces for the second goal and to threaten us, whereas the first goal was, of course, great individual quality of Saka.”\nWith Diogo Jota out injured, Nunez was expected to start the match and he made a positive impact for the team.\nHas has not played enough football this season due his position in the pecking order at the club but whenever he has been called upon, he has shown signs of improvement and that he is ready to perform for the team.\nArne Slot has been impressed by Darwin Nunez\nThe Uruguayan international scored against RB Leipzig in the Champions League last week and provided a crucial assist against Arsenal to keep up Liverpool’s brilliant start to the new season.\nHis fine performances will give Slot a selection headache, one which he will be happy with, when Jota gets fit again.\nThe Reds have been linked with a move for Jonathan David to replace Darwin Nunez with Barcelona reportedly ready to offer the striker an escape route from Anfield.\nLiverpool travel to Brighton in the Carabao Cup next before hosting the Seagulls in the Premier League next week.",
  "word_count": 532,
  "scraped_at": "2026-02-14T02:14:47.093851",
  "_text_extracted": true
}