{
  "article_id": "908c11b7d279",
  "url": "https://www.aa.com.tr/en/world/morning-briefing-sept-20-2024/3335450",
  "title": "Morning Briefing : Sept . 20 , 2024",
  "date": "20240920T080000Z",
  "domain": "aa.com.tr",
  "source_country": "Turkey",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Morning Briefing: Sept. 20, 2024\nAnadolu’s recap of top stories from around the globe\nISTANBUL\nHere is a rundown of all the news you need to start your Friday with, Biden to host the Ukrainian president at the White House next week to discuss the \"state of the war\", the EU Parliament saying Ukraine \"must be able' to hit legitimate military targets in Russia\", and Lebanon saying 37 killed, thousands injured in two waves of wireless device explosions.\nTOP STORIES\nUS President Joe Biden will host his Ukrainian counterpart Volodymyr Zelenskyy at the White House next week to discuss the state of Russia's war against its neighbor, the White House announced.\nDuring the Sept. 26 sit-down, the leaders \"will discuss the state of the war between Russia and Ukraine, including Ukraine’s strategic planning and US support for Ukraine in its defense against Russian aggression,\" spokesperson Karine Jean-Pierre said in a statement.\nZelenskyy will also meet separately with Vice President Kamala Harris, who is in the midst of her presidential campaign after Biden dropped out of the 2024 White House race.\nUkraine “must be able to strike legitimate military targets in Russia,” the European Parliament said, according to a statement.\nThe EU Parliament adopted a resolution in a 425 - 131 vote, with 63 abstentions, that said: “Without lifting current restrictions, Ukraine cannot fully exercise its right to self-defense and remains exposed to attacks on its population and infrastructure.”\nMEPs also pointed out “insufficient deliveries of ammunition” and a “declining volume of bilateral military aid to Ukraine by EU countries.”\nThe death toll from two waves of wireless communication device explosions in Lebanon rose to 37 and thousands were injured, Health Minister Firas Al-Abiad said.\nThousands of pagers exploded in the capital Beirut and several areas across Lebanon on Tuesday, killing 12 people, including two children, and injuring 2,323 others. A second way of device blasts killed 25 people and injured 608 others on Wednesday.\n\"The explosions showed the unity of the Lebanese people in all areas in the face of the incident,\" Al-Abiad told a press conference in Beirut.\nNEWS IN BRIEF\n- China said it launched two new BeiDou-3 Navigation Satellite System (BDS-3) satellites, state media reported.\n- An Israeli drone aired incendiary audio messages against Hezbollah Secretary-General Hassan Nasrallah as it flew above towns in the Nabatieh district in southern Lebanon, according to media reports.\n- The Russian Foreign Ministry praised a UN General Assembly resolution on Palestine as \"an important step to recognize Israeli actions illegal.\"\n- Israel carried out intensive airstrikes against several towns in southern Lebanon amid growing concerns about an escalation of the conflict between Hezbollah and Tel Aviv.\n- The US urged all parties to “de-escalate” and stressed the need for a diplomatic resolution as Israel intensified its attacks on Lebanon.\n- Taiwan warned of a possible attack by China \"under the guise\" of military drills in its region.\n- Ongoing floods in Nigeria have claimed a total of 285 lives, the country's National Emergency Management Agency reported.\n- The British foreign secretary expressed deep concern over rising tensions in Lebanon, urging UK citizens to leave the country while commercial options remain.\n- Hezbollah Secretary-General Hassan Nasrallah vowed to turn Israel’s actions into a “hell” after the group suffered a “severe blow” when communication devices were detonated earlier this week in Lebanon.\n- Five Palestinians were killed, including two children and a woman, in Israeli attacks targeting a group of civilians and a house in the Gaza Strip.\n- The National Telecommunications Agency of Brazil (Anatel) reported that X deliberately ignored a Supreme Court order to block the social network.\n- China urged Israel to halt building illegal settlements in the occupied West Bank while implementing a UN resolution for a cease-fire in the embattled Gaza Strip, state-run media reported.\n- US Secretary of State Antony Blinken will meet with the foreign ministers of the UK, France, and Italy in Paris to discuss the latest situation in the Middle East, Ukraine, and other international hotspots, diplomatic sources said.\nSPORTS\nCeltic football club fans in Scotland have reiterated their solidarity with Palestine in the face of nearly a year of Israel’s devastating attacks on Gaza.\nFans of the Scottish team displayed pro-Palestine banners during a Wednesday night UEFA Champions League match in Glasgow against Slovan Bratislava.\n\"They can oppress you, they can imprison you, but they will never break your spirit. Gaza, Jenin, Tulkarm, Nablus. You’ll never walk alone,\" said the Celtic fans' banners on display at Celtic Park.\nBUSINESS & ECONOMY\nUS Treasury Secretary Janet Yellen said that the Federal Reserve's interest rate cut of 50 basis points is \"a very positive sign\" for the American economy.\nYellen said the Fed's jumbo cut \"reflects confidence\" for the central bank that inflation has come down significantly and is on a path back to the bank's 2% target.\nRisks regarding inflation have \"meaningfully diminished,\" she told the Atlantic Festival 2024 in Washington, D.C.\nAnadolu Agency website contains only a portion of the news stories offered to subscribers in the AA News Broadcasting System (HAS), and in summarized form. Please contact us for subscription options.",
  "word_count": 859,
  "scraped_at": "2026-02-14T02:25:58.984055",
  "_text_extracted": true
}