{
  "article_id": "90dd8de27e37",
  "url": "https://www.teamtalk.com/tottenham-hotspur/four-players-spurs-need-sign-end-renewed-talk-ange-postecoglou-sack-talk",
  "title": "Tottenham transfers : Four players Spurs need to sign to end renewed talk of Ange Postecoglou sack",
  "date": "20250306T224500Z",
  "domain": "teamtalk.com",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "Tottenham Hotspur\nPremier League • England\nFOUR players Tottenham need to sign to end renewed talk of Ange Postecoglou sack\nThis summer is expected to be an incredibly busy one for Tottenham, after their squad depth was exposed badly, and TT has looked at four players the club should sign who could also help finally silence talk over Ange Postecoglou’s future in north London.\nThe Australian has come under plenty of fire during the second half of the season as Spurs have struggled badly domestically, thanks in no small part to the number of players who have been sat on the sidelines.\nThings had picked up with three successive league wins before defeats to Manchester City and then AZ in the Europa League, putting more pressure on Postecoglou after a terrible display from his side in Holland.\nMoney is expected to be available to make significant additions to the first-team squad though and avoid a similar scenario to this season happening again.\nTo that end, TEAMtalk have taken a look at four realistic signings Tottenham should make to give Postecoglou the best chance of keeping his job and succeeding next season…\nMarc Guehi\nIt’s no secret that Spurs are firmly in the mix to bring the Crystal Palace centre-back to north London, having failed with a deadline day bid for the England star in the winter window.\nGuehi would be a great fit in Tottenham’s back line alongside Micky Van de Ven, but it would almost certainly mean an exit for long-term Real Madrid target Cristian Romero as a result.\nWhile that might come as a surprise for some watchers of Ange Postecoglou’s men, there is a feeling among many fans in north London that Romero produces his best performances in international colours with Argentina.\nIndeed, some of the 26-year-old’s displays in a Tottenham shirt since Postecoglou took charge have been littered with errors in possession and awful positioning that has led to goals.\nYes, he remains a quality defender on his day, but there’s every chance he’s had his head turned by Real’s interest. To that end, recouping upwards of £50m for Romero now might end up being some of the best business Tottenham could do this summer, especially for a player who has also been proven to be injury-prone as well.\nReinvesting that sort of figure wisely on the centre-back position would then be paramount, especially with Radu Dragusin out until the end of the year with his ACL injury.\nKevin Danso has impressed since joining on loan and there is every expectation that the deal will be turned into a permanent one come the summer, but adding Guehi to that central defensive mix would be massive for Posetcoglou and Spurs.\nThe 24-year-old would slot in perfectly alongside Van de Ven and give Tottenham one of the quickest centre-back pairings in European football – a perfect scenario for Postecoglou’s high line.\nPalace are unlikely to do business for less than £70m though, which will be more than affordable for Spurs if they decide to part ways with Romero.\nREAD MORE ➡️ Tottenham ready to pull off spectacular £112m double deal to transform their attack completely\nJohnny Cardoso\nThis is an absolute no-brainer of a deal for a player who can be signed for as little as £21million due to a clause that was inserted when Giovani Lo Celso was sold to Real Betis last summer.\nThe USMNT international has been outstanding for the LaLiga outfit this season and fills a big Tottenham need in terms of the defensive midfield role.\nPostecoglou’s fluid midfield rotation means no one player is designated to sit and protect the back four, but that has left his side so exposed this season – especially when the Australian has been unable to pick his best defenders due to injuries.\nSpurs actually looked their most solid under Postecoglou in that 10-match unbeaten run at the start of last term, when Yves Bissouma was sitting a bit deeper and providing a better base to build from while also enabling that defensive cover.\nHowever, there is every chance that Bissouma will be offloaded this summer after falling out of favour with Postecoglou due to his inconsistent performances. Indeed, teenager Lucas Bergvall has often been preferred to the experienced Mali international.\nCardoso has played 31 times for Betis in all competitions this season, with more than 20 of those outings coming in the No.6 role, while he averages almost two tackles and two interceptions per game – clearly showcasing those defensive qualities.\nTo sign a 23-year-old who has won 18 caps for his country, and is playing regularly at a high level in Spain, is a deal that has to happen – although they will only have between June 30 and July 10 to get that contract signed.\nDON’T MISS ➡️ Man City flop Jack Grealish told he’s ‘the man’ to replace iconic figure at Premier League rivals\nMarcus Thuram\nPotentially a slight on Dominic Solanke here, but he’s not quite shown enough that he can be the elite presence as a No.9 that Spurs had for a decade with Harry Kane.\nThe 27-year-old has scored 11 goals in 30 appearances in all competitions but only seven in the Premier League, while Solanke has also had his fair share of injuries in north London after hardly ever missing a game during his time at Bournemouth. Indeed, he limped off again at AZ not long after making his return to action.\nTottenham were in the market for another striker in January, especially after Richarlison joined Solanke on the sidelines, and ended up bringing on Mathys Tel on loan from Bayern Munich.\nThey do have an option to sign the young French forward on a permanent deal this summer but Tel has struggled to adapt to English football so far, while there’s also an argument that he is better playing on the left wing than as a central striker – a position has looked a little lost in.\nStep forward Thuram, who has been performing at a high level for Inter since moving to Italy from Borussia Monchengladbach on a free transfer in the summer of 2023.\nThe France international has scored 30 times in 70 games in total for Inter, with 15 of those goals coming this season for an Inter side who currently sit top of Serie A and also have one foot in the Champions League quarter-finals.\nThuram’s strengths are his explosive pace, power and movement, while he is particularly strong at isolating defenders and creating one-on-one situations.\nThat fact that Thuram could also play wide is another bonus and a way of getting Solanke in the team as well, in what could end up being a destructive forward line for Postecoglou.\nReports in Italy have previously reported that the 27-year-old could be available for around €80million (£67m / $84m).\n🔵 The FOUR Tottenham players out of contract in 2026: Keep or Sell?\nTyler Dibling\nThe Southampton attacker is only 19 years of age but plays well beyond his years, something Tottenham have already unearthed this season with the likes of Archie Gray and Lucas Bergvall.\nAdding Dibling to that mix would give Spurs another explosive young talent to go along with the club’s current remit of building for the future.\nThe right winger has only scored four goals and provided two assists this season, but his overall play has been outstanding in a side that has just nine points on the board at the bottom of the Premier League.\nDibling’s direct style and dribbling ability would see him become an immediate option in the Tottenham attack, with Brennan Johnson currently occupying that role on the right.\nWhile there can be arguments with Johnson’s goals and assists output this season, his overall play still leaves plenty to be desired at times and Spurs adding Dibling could see him forced to take his game to another level.\nThe talented teenager will almost certainly be on the move at the end of the campaign, as Saints stare relegation in the face, and currently has a £50m valuation.\nTottenham, however, are confident they can snap up Dibling for less than that, while the player himself is said to be sold on a switch to north London.",
  "word_count": 1376,
  "scraped_at": "2026-02-14T02:02:35.610865",
  "_text_extracted": true
}