{
  "article_id": "90e223b13309",
  "url": "https://metro.co.uk/2023/10/31/declan-rice-can-haunt-old-boss-david-moyes-on-his-west-ham-return-19748033/",
  "title": "Declan Rice can haunt old boss David Moyes on his West Ham return | Football",
  "date": "20231031T170000Z",
  "domain": "metro.co.uk",
  "source_country": "United Kingdom",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "It’s about five miles from Arsenal to West Ham but the gulf between the two clubs going into their Carabao Cup clash at the London Stadium is as wide of the Grand Canyon.\nThe Gunners are undefeated in domestic matches this season and the only defeat they have suffered was at Lens in the Champions League. They are fresh from a 5-0 victory over a shocking Sheffield United at the Emirates on Saturday while the Hammers are going through a miserable spell which matches the gloomy weather.\nThey were battered 4-1 at Aston Villa before losing at Olympiakos in their Europa League tussle and then slumping to a miserable defeat at home to Everton on Sunday.\nAn exit from the League Cup will heap further pressure on David Moyes, who looks a big but inviting price at 33/1 with Ladbrokes, Coral and many others to be the next Premier League manager to vacate his post.\nMore Trending\nIt won’t help his cause if former Hammers captain Declan Rice struts around midfield, orchestrating play and leading Arsenal to victory in his first return to the London Stadium since his £105million summer move to the Gunners.\nThe England international, who led West Ham to their first major trophy in 43 years when they won the Europa League Conference final last term, has picked up a goal and an assist in his last two league matches.\nGet your football fix\nDon't want to miss the week's biggest football stories? Metro's exclusive football newsletter, In The Mixer, is your essential guide.\nFrom the latest transfer rumours and managerial moves to analysis of the biggest games and a lot more, our experts have you covered.\nSign up here, it's an open goal.\nHe should receive a largely positive reaction from home supporters but, such is the nature of the current football fan, it wouldn’t be a surprise if there were plenty of boos, especially if he opens the scoring at 25/1 with BoyleSports or ifhits the net at any time at 9/1 with bet365.\nArsenal are 5/4 with Unibet to win in 90 minutes and they can be paired with Everton to build on their success over the Hammers when they face Burnley in their first match at Goodison Park since the passing of club chairman Bill Kenwright.\nThe Toffees are 19/20 to triumph with Betfred while Newcastle can recover from their recent dip in form against Borussia Dortmund and Wolves by knocking Manchester United out of the competition with a victory at Old Trafford at bet365’s 23/10.\n• South Africa are 4/6 with Paddy Power in their Cricket World Cup match with New Zealand in Pune where Aidan Markham is 9/2 with Betfair and Paddy Power to score the most runs for his side. Devon Conway is 10/3 with Sky Bet to clobber the most runs for the Black Caps.\n• Holger Rune is 11/8 with Bet Victor to beat Dominic Thiem in straight sets at the Paris Masters while Daniel Medvedev is 3/4 with Unibet and Paddy Power to defeat Gregor Dimitrov by the same margin.\nMORE: ‘Impossible’ – Mikel Arteta gives worrying injury update on Arsenal captain Martin Odegaard\nMORE: ‘It doesn’t work’ – Arsene Wenger critical of Mikel Arteta’s Arsenal goalkeeper decision",
  "word_count": 541,
  "scraped_at": "2026-02-14T02:13:18.788548",
  "_text_extracted": true
}