{
  "article_id": "90fea86a6b99",
  "url": "https://news.yahoo.com/glorious-kings-win-over-golden-073330937.html",
  "title": "A glorious Kings win over the Golden State Warriors proves the NBA Cup is a big deal",
  "date": "20231129T080000Z",
  "domain": "news.yahoo.com",
  "source_country": "United States",
  "language": "English",
  "gender_category": "men",
  "source_pipeline": "gdelt",
  "body_text": "A glorious Kings win over the Golden State Warriors proves the NBA Cup is a big deal | Opinion\nThis game was as ugly as sin but, when it was over, the Kings won three times.\nThey improbably beat the Golden State Warriors 124-123, their first win over their regional rival this season. They advanced to the quarterfinals of the new — and much hyped — NBA Cup (more about that in a moment). And they silenced a large contingent of Warriors fans at Golden 1 Center who made a lot of noise Tuesday night until they didn’t.\nAnd what made it all the sweeter? The King’s victory was made possible by a ghastly turnover committed by Draymond Green, the Warriors villain, who was back from a five-game suspension and showed his rustiness by throwing the ball away late in the fourth quarter —allowing the Kings a chance to take the lead.\nThe last shot taken by Steph Curry, which would have sealed a Warriors win, clanked off the iron. It looked good from the time it left Curry’s hand. He is the greatest shooter in NBA history, but this one didn’t connect.\nKings win.\nOpinion\nA playoff atmosphere in the arena morphed into bedlam as a Kings fan base hungering for this win, and for a deep playoff run by their team, was rewarded in the end after a dismal performance in many aspects of this game by the Kings.\nBut a win is a win is a win and no one, save for the Warriors, who were eliminated from the NBA in-season tournament, or the NBA Cup, will remember how badly this game truly stunk.\nKings never give up\nBut we love this game because the Kings played the game until the final seconds, never giving up and never hesitating when a shot presented itself.\nKings talisman De’Aaron Fox thanked the fans afterward and promised them that he and his teammates would keep playing for them. The Kings kept that promise tonight, even when this one seemed lost.\nThey also proved that they really wanted to advance in this tournament. It was conceived by the NBA to create excitement early in the season and to create more possibilities for more teams to win a trophy other than the one given only to NBA champions.\nSoccer fans know about the Cup\nIf this seems like a foreign concept to American fans, it’s because it is. Cup competitions in international soccer are not only commonplace, it’s a century-old tradition. Fans throughout the world follow seasons within seasons, where teams not only compete for their league championships, but for cups of all kinds.\nMore in Sports\nThe most famous is the Champions League, where the elite teams of European soccer play against each other midweek and then return for their domestic league games on weekends. The Champions League Final is bigger than the Super Bowl in terms of attracting a global audience.\nIn England, the FA Cup not only is competition among Premier League teams. All teams at all levels participate and, every now and then, a Cinderella team from the lower runs of English football upsets the big boys.\nI’m a fan of Arsenal FC and we haven’t won a league title in almost 20 years, but we’ve won the FA Cup several times. There is no drop off in enthusiasm when your team lifts that Cup, especially in years when you know your team is not good enough to win the league championship.\nIt’s fun and festive and it creates more excitement among more fan bases.\n“I think the In-Season Tournament has done great.”\nDe’Aaron Fox after the Kings clinched West Group C and advanced to the Knockout Rounds pic.twitter.com/C1PCqF2xUd— NBA (@NBA) November 29, 2023\nKings fans, all in\nThe NBA Cup can do the same thing, and based on the response from Kings fans Tuesday night, they are all in for the NBA Cup. Sacramento as a sports city is hungry for wins after decades of dismal play.\nDon’t tell me Sacramento won’t be watching intently when the Kings enter the quarterfinals. Don’t tell me the excitement won’t be off the chain if the Kings make the semifinals in Las Vegas or the NBA Cup Final on Dec. 9.\nCan you imagine how Sacramento would react if the Kings brought that cup back to town? It will be a moment to rival any other in Kings’ history and it will be validation of a team only lacking the experience and poise to survive big games when everyone is watching and when the stakes are high.\nOn Tuesday night, the Kings won ugly — but they won. They looked like they would be owned again by the Warriors, but they weren’t. Somehow they won and, now, onward they go to try to win a trophy against other elite NBA teams.\nThe Kings won their NBA Cup group, along with Western Conference rivals, the Los Angeles Lakers and New Orleans Pelicans. The Pelicans come to Golden 1 Center at 7 p.m. Monday for the next round.\nThere has been a fair amount of griping about the Cup among some fans and media members, but here? The chance for the Kings to win an NBA competition is nothing but a positive for a franchise that has needed it, just as the Kings needed a dose of inspiration to prevail Tuesday night.",
  "word_count": 900,
  "scraped_at": "2026-02-14T02:07:27.056564",
  "_text_extracted": true
}